{
    "news": [
        {
            "url": "https://www.chronicle.co.zw/massive-windfall-for-sables-players/",
            "content": "Online ReporterPresident Emmerson Mnangagwa on Wednesday hosted the Zimbabwe senior mens rugby team at State House where he distributed cash rewards of US$6,500 per player for winning this years Rugby Africa Cup.In his congratulatory address, President Mnangagwa described the Sables feat is a testament to the dedication and perseverance of all involved and serves as shining symbol of the nations pride and unity.I am honoured today as we gather to celebrate an extraordinary victory and pay tribute to the remarkable spirit, resilience and teamwork that have propelled our team to this pinnacle of success at the Rugby Africa Cup in Uganda, said President Mnangagwa.This achievement is a testament to the dedication and perseverance of our players, coaches and support staff, serving as a shining symbol of our nations pride and unity, he said.The Zimbabwe Sables are coming off quite the impressive year, during which they finished unbeaten in Test rugby and clinched the Africa Cup title in Kampala, Uganda back in July.The Africa Cup conquest was their first victory 12 years, a run that also included a first and, more importantly, victory over regional powerhouses Namibia in 23 years.The win now puts them in good stead for next years Africa Cup competition which will double as qualification for the 2027 Rugby World Cup in Australia.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/yufhy.jpg"
        },
        {
            "url": "https://www.chronicle.co.zw/2024-cabs-candidates-chess-tournament-a-resounding-success/",
            "content": "Brandon Moyo,[emailprotected]\n\nTHE third edition of the CABS Candidates Chess Tournament, held at the National University of Science and Technology (NUST) from 5 to 8 December, concluded with remarkable excitement and fierce competition.\n\nSponsored by CABS Bank, this years tournament brought together 269 chess players across four sections, showcasing the growing popularity of chess in Zimbabwe and the success of the initiative to decentralise the game.\n\nThe tournament saw an all-time high turnout, with 121 participants in the Open Section, 30 in the Ladies Section, 39 in the Under-16 Prestige Section, and 79 in the Under-16 Development Section.\n\nThe commitment to inclusivity was evident as players from various backgrounds gathered to compete, further enriching the chess community in Bulawayo.\n\nDefending champion Tanaka Katsande claimed victory for the second consecutive year in the Open Section, securing an intense win in the penultimate round against Castro Sibanda, who had been unbeaten prior to the match.\n\nKatsandes performance was a testament to his skill and determination, and the talented player said it was not an easy journey to victory but was pleased to have crossed the line in the end.\n\nI actually had little hope of winning the tournament despite being the 2023 champion. The tournament had many competitive players, and it was unpredictable who would come out victorious. I felt overwhelmed and unbelievably happy when I won my final game, as it was the last match against Castro. With my prayer, sweat, and faith, I eventually emerged victorious, said Katsande.\n\nThe Ladies Section was dominated by Ropafadzo Dube, who finished with an outstanding score of 8/9, remaining undefeated throughout the event. Her success reinforced the importance of female representation in chess, further inspiring future generations of female players.\n\nDube, who won a gold medal at the CUCSA Games in South Africa in June, also expressed her gratitude for her victory.\n\nIt still feels unreal, while at the same time exciting. It feels like I have finally been awarded for the work I have been putting into my career and passion, said Dube.\n\nThe Under-16 Prestige Section saw an exciting upset as unrated player Nathan Moyo triumphed over the favourite, Mutendi Anesu, finishing with an impressive score of 6.5/7.\n\nIn the Under-16 Development Section, Makoni Anesu achieved a perfect score of 5/5, showcasing exceptional talent among young players. The tournament was characterised by intense battles and unexpected twists, captivating participants and spectators alike.\n\nZimbabwe Chess Federation (ZCF) Vice-President Elvis Shora expressed his appreciation for the events success.\n\nWe are grateful to CABS Bank for their generous sponsorship of this prestigious event in Bulawayo. Their support has been vital in making this tournament a reality and in nurturing our chess community. It was a great tournament, and we are pleased with the attendance numbers.\n\nAs ZCF, we are committed to ensuring that chess is played in all corners of Zimbabwe, starting from the development level. We want to create a Russia-like environment where everyone, from a young age, is a chess player, which in turn will help with their academics. Chess is a key element in educational development.\n\nWe are looking forward to more great initiatives like this that support the development of the game not only in the major cities but across all of Zimbabwe, said Shora.\n\nZCF Communications and Public Relations Director Agab Dozva shared similar sentiments with Shora.\n\nThis tournament not only highlights the skills of our players but also emphasises our commitment to promoting chess as a key element of cultural and educational development in Zimbabwe, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfbhdf.jpg"
        },
        {
            "url": "https://www.chronicle.co.zw/dozens-arrested-for-filming-police-in-bulawayo-operation-against-illegal-taxis/",
            "content": "Peter Matika[emailprotected]IN a surprising turn of events, dozens of onlookers found themselves on the wrong side of the law this morning as police cracked down on illegal taxis and kombis operating in the Central Business District (CBD).They were arrested for filming the clampdown.\n\nThe operation aimed at ridding the CBD of unlicensed vehicles, as well as restoring sanity on the roads took an unexpected twist when members of the public began filming the police as they carried out their duties.Witnesses reported that the police were actively engaged in stopping and checking vehicles that were not adhering to designated pick-up and drop-off points.However, instead of just watching, many bystanders pulled out their phones to capture the action.\n\nWhat started as casual curiosity quickly escalated into a flurry of arrests as officers deemed the filming as interference with their operation.A comment from the police could not be immediately obtained on the situation.A police officer at the scene stated that the arrests were necessary to maintain order and ensure the safety of both the police and the public.\n\nWe understand that people are curious, but when it starts to disrupt our work, we have to take action, said the officer.These operations are crucial for maintaining safety in our city, and we cannot allow distractions.The situation has sparked a heated debate among residents and social media users. Many are questioning whether its fair for citizens to be arrested simply for documenting a public operation.\n\nI was just taking a video to show my friends what was happening, one bystander lamented. I never thought people would end up in a police van.As the dust settles, many are left wondering if this crackdown will deter future filming.For now, the police continue their efforts against illegal taxis, while the public remains divided on the implications of capturing such moments on camera.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fbvw.jpg"
        }
    ]
}