{
    "news": [
        {
            "url": "https://www.herald.co.zw/shamva-woman-robbed-murdered/",
            "content": "Crime Reporter\n\nA 52-year-old Shamva woman was attacked and killed by two unknown assailants who stole some money from her.\n\nThe victim was found with multiple stab wounds all over her body.\n\nNational police spokesperson Commissioner Paul Nyathi said investigations are in progress.\n\nPolice in Shamva are appealing for information which may assist in the investigations of a case of murder in which Gladys Chidaro was attacked to death by two unknown suspects in Sanye Village 10 on December 9, 2024.\n\nThe suspects allegedly stole a yet-to-be-established amount of money. The victim was later found dead with multiple stab wounds all over the body, he said.\n\nIn another case of murder that occurred on the same day at Commonwealth Claim, Mazowe Mine, a 17-year-old artisanal miner was found dead with multiple stab wounds all over the body.\n\nAnother miner was found with multiple wounds all over the body and was rushed to a hospital in Concession where he is receiving treatment.\n\nPolice are appealing to anyone with information that might assist in investigating these cases to contact the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/12/PAUL-NYATHI-1.jpg"
        },
        {
            "url": "https://www.herald.co.zw/government-hands-over-35-fire-fighting-trucks-to-local-authorities/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nGovernment has handed over 35 fire-fighting trucks to various Rural District Councils countrywide.\n\nLocal Government and Public Works Minister Daniel Garwe handed over the fire trucks to the local authorities at Kuwadzana Fire Station in Harare.\n\nThe local authorities that received the trucks are Manyame, Goromonzi, Mutoko, Murewa, Chikomba, Mazowe, Pfura, Chaminuka, Chegutu, Zvimba, Makonde, Umguza, Hwange, Binga, Kusile, Chiredzi, Bikita, Gutu and Chivi.\n\nMakoni, Mutare, Chimanimani, Buhera, Zibagwe, Chirumanzu, Vungu, Runde, Beitbridge, Matobo, Umzingwane, Insiza, Ruwa Local Board, Gokwe Town and Chegutu Municipality also received the fire-fighting trucks.\n\nSpeaking during the handover ceremony, Minister Garwe said, On the backdrop of escalating fire incidents in the country, Government decided to procure state-of-the-art fire-fighting equipment from the Republic of Belarus.\n\nProcurement of the equipment was made possible by the Second Republics engagement and re-engagement programmes being championed by His Excellency, the President of the Republic of Zimbabwe, Dr Mnangagwa.\n\nHe said relations between Zimbabwe and Belarus were strengthened by the signing of eight Memoranda of Understanding in January 2022.\n\nMinister Garwe said fire is becoming a major threat to peoples lives, livelihoods and property.\n\nCauses of these infernos vary, with some resulting from electrical faults, improper usage and storage of LP Gas, negligence, veld fires, accidents and trafficking of flammable and hazardous substances, among other things.\n\nGiven the destructive nature of fire, there is a great need for concerted efforts from all stakeholders in its prevention and management. It is important for authorities to take charge and ensure the safety of property and people, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/trucks.jpg"
        },
        {
            "url": "https://www.herald.co.zw/harare-athletic-board-to-hold-elections/",
            "content": "Zimpapers Sports Hub\n\nTHE Harare Athletic Board is scheduled to hold an elective annual general meeting on December 22 at the National Sports Stadium.\n\nA new executive will be elected into office during the AGM.\n\nAll posts will be up for grabs and these include the chairperson, vice-chairperson, secretary-general, vice secretary-general, treasurer, coaches coordinator, officials coordinator and committee members.\n\nThe executives term of office is four years and nominations close on Sunday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/athletics.jpg"
        }
    ]
}