{
    "news": [
        {
            "url": "https://www.herald.co.zw/zimparks-to-reintroduce-rhinos-in-matusadonha/",
            "content": "George Maponga in Masvingo\n\nZimparks is preparing to reintroduce rhinos at Matusadonha National Park in northern Zimbabwe.\n\nThe reintroduction of the endangered species is expected to boost tourism at one of the countrys most popular wildlife sanctuaries.\n\nZimparks spokesperson Mr Tinashe Farawo said plans to bring back rhinos at Matusadonha are at an advanced stage.\n\nWe are planning to reintroduce rhinos at various game parks around the country where the species had become extinct due to poaching and our next target is Matusadonha National Park, said Mr Farawo.\n\nHe said the move follows the successful reintroduction of rhinos in Gonarezhou National Park early this year.\n\nRhinos were wiped out from Gonarezhou in the 1990s.\n\n"
        },
        {
            "url": "https://www.herald.co.zw/zvishavane-man-loses-us15k-to-chadonha-scammers/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nA 43-year-old Zvishavane man lost US$15 000 to scammers who lured him into believing that they had found a large sum of money on the roadside and wanted to share it with him.\n\nOne of the suspects, Wellington Nhiwatiwa (46), appeared before Harare magistrate Mr Isheanesu Matova yesterday facing fraud charges.\n\nNhiwatiwa challenged his placement on remand, and the court deferred the ruling to Thursday.\n\nAccording to the prosecutor, Mr Takudzwa Jambawu, the incident occurred on November 19.\n\nNhiwatiwa, along with seven accomplices who are still at large, approached Mr Luckson Daka shortly after he had disembarked from an Inter-Africa bus on his way from Zvishavane.\n\nThe gang threw a bundle of fake notes wrapped in plastic in front of Mr Daka, convincing him it was a large sum of money.\n\nThey persuaded Mr Daka to accompany them to Harare Kopje Mountain, claiming they would share the money with him.\n\nWhile at the mountain, another group of five men appeared, pretending to be police officers.\n\nThey allegedly searched Mr Dakas satchel, seized the US$15 000 he was carrying, and fled the scene.\n\n"
        },
        {
            "url": "https://www.herald.co.zw/zimbabwe-reaffirms-commitment-to-humane-migration/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZimbabwe has reiterated its dedication to ensuring the safe, orderly and humane treatment of migrants, both its citizens abroad and foreigners within its borders.Home Affairs and Cultural Heritage Minister Kazembe Kazembe said this in a speech read on his behalf by the director of Strategic Policy Planning, Monitoring and Evaluation Mr Mike Masaka at the International Migration Day commemorations held in Harare yesterday.\n\nMinister Kazembe highlighted the Governments collaborative efforts with various international organisations and local stakeholders to support Zimbabweans in the diaspora and foreign nationals residing in the country.\n\nHe said partnerships are important in ensuring the protection and well-being of migrants.\n\nWe cannot do this alone. The private sector, civil society organizations, UN agencies, and community agencies must work with Government to ensure that migrants are protected.\n\nThe Minister also acknowledged the significant contributions of Zimbabwean migrants to the countrys development, citing the success of athletes like Sikandar Raza as an example of the positive impact of well-managed migration.\n\nMs Amy Pope, director-general of the International Organisation for Migration (IOM), said migrants have rights.\n\nShe said migrants are individuals with rights, adding that their contributions are invaluable to both their home countries and the places they migrate to.\n\nMigrant rights are human rights. Today is the day when we celebrate the contributions that migrants bring, not just for themselves, not just for the communities they come from, but the contributions they bring to the communities they go to.\n\nMs Pope further highlighted the critical role of migration in addressing global challenges such as labour shortages and demographic imbalances.\n\nThe Minister of Higher and Tertiary Education Ambassador Fredrick Shava also spoke at the event, emphasising Governments recognition of the diasporas potential and its efforts to engage with Zimbabweans living abroad.\n\n"
        }
    ]
}