{
    "news": [
        {
            "url": "https://www.zimeye.net/2024/12/10/chamisa-throws-tshabangu-councillors-under-the-bus/",
            "content": "By Political Reporter- The Peoples President Nelson Chamisa has thrown the Sengezo Tshabanhu Harare-led council under the bus, condemning them for abandoning their duties as soon as they are voted into office.\n\nAppearing before the commission of inquiry into the financial affairs of the capital city yesterday, Chamisa denied allegations that he directed councillors to fast-track regularisation of settlements in Harare.\n\nPresident Emmerson Mnangagwa in May this year appointed the commission led by retired judge Justice Maphios Cheda to investigate financial management systems and audit compliance with the Public Finance Management Act at the local authority.\n\nThe commission invited Chamisa to answer to the allegation that he gave a directive to councillors to fast-track land regularisation.Evidence leader Tabani Mpofu told Chamisa that the commission had evidence that the councillors were teaming up with land barons.However, Chamisa dismissed the assertions accusing councillors of abusing their mandate after being elected into office.Well, I am not aware of that process, but what I am aware of is that there is a lot of tomfoolery and shenanigans within the context of local authorities.In fact, what bleeds my heart is the fact that each time councillors are elected on a party ticket the moment they go into council, they go bonkers, run amok, throw away all dictates of reason, throw away all dictates of allegiance and loyalty to the party, which I cant understand, he said.Chamisa also condemned the indiscriminate destruction of houses by council.What I am aware of, though, is that peoples houses were being destroyed and I had difficulties appreciating and understanding why a whole council would destroy peoples houses when they, in the first instance, had allowed people to construct those houses, he said.I take umbrage and great exception to people who then choose to undermine the rights of others in terms of the Constitution.Naturally, I would have issues with any kind of disposition where peoples houses are destroyed. But as regards processes within the council, I am not a councillor, not a mayor, not even a council official.In terms of the Urban Councils Act, there is no way individual citizens can actually have authority over the processes of council.Because council is a creature of statutes and council is a product of the law. Anything that happens within the council is governed by statutes, laws and procedures within that council.Chamisa said he was not able to control the councillors because parties are not contemplated in the statutes in terms of the running of local authorities.We are governed by the electorate. We are governed by the statutes. We are governed by the Urban Councils Act and on that score, then it becomes very difficult to bring to account, especially our councillors.I just hope that the commission will appreciate that delinquent characters must, you know, account for their delinquency and name throwing. There are many people who rape in the name of leaders, he said.The former opposition leader, who dismissed the August 2023 presidential elections, denied allegations made in a recording where his name was mentioned by a local councillor. I would never address a few people like a few councillors that have been mentioned. If I were to address, I would address maybe the entirety of the people.I am sure the commission within the realm of due diligence was to adduce evidence from him where I say that. Either, voice or written or whatever, because there is always evidence that is supposed to back a claim.It is another point I have been asked.If you were to show me I would not know him. I have over 2 000 councillors.If I were to see him I would not know him. There are 2 000 councillors who were under the CCC ticket. I dont know who is who. I would not know. Theres no reason for me to even address an individual councillor on any matter. Newsday\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/10/baba-harare-fights-to-retain-own-name/",
            "content": "Baba Harare is fighting to retain his brand name which he announced he has ditched for the Biblical King David tag. Below is some of the dramatic social chatter over it\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/10/chamisa-full-text-response-after-appearing-on-eds-commission/",
            "content": "1/ On Monday, I was requested to testify before (Rtd) Justice Maphosa Cheda at the Harare City Commission inquiry, a forum set up by Mr Mnangagwa.\n\n2/ I have reservations about the foundation of the Commission. However, out of courtesy, and being an officer of the Court and Justice, I obliged.\n\n3/ The Commission sought my response to claims purportedly made by a councillor mentioning my name in connection with the so-called regularisation process of the Harare City Council.\n\n4/ I made it unequivocally clear: I have no locus to comment on local authority issues. I am neither a councillor, mayor, local government official, nor part of central government. Urban councils are statutory bodies governed by the Urban Councils Act. Decisions arise from council committees or full council motionsnot external actors or political parties.\n\n5/ An audio was played at the hearing, said to be of the councillor referring to me as a leader of a party. Its amateurish presentation, played from a phone, raised questions about its authenticity and veracity. Yet, I responded to avoid embarrassing the commission. For the record, I would not recognise the named councillor if we met face to face. The voice on the audio also mentioned Mr Mnangagwa. I pointed out that if my presence was deemed necessary, based merely on this audio, then the same courtesy should surely be extended to Mr Mnangagwa, whose name was also mentioned.\n\n6/ The principle is clear: he who alleges must prove. It is unjust to summon private individuals based on unsubstantiated claims. The law demands evidence, not speculative accusations.\n\n7/ I wish to state the following for the record; as a human rights defender, a justice champion and a consummate constitutionalist, I strongly condemn the destruction of peoples homes. Using bulldozers to erase lives and livelihoods is criminal, sadistic and inhumane. This is not justice; it is evidence a systemic leadership failure and a mockery of human rights.\n\n8/ This is not the first time a commission has been used as a diversion from addressing real issues. In 2018, Mr. Mnangagwa established the Motlanthe Commission following disputed General Elections. I was summoned before the commission over a matter entirely unrelated to me. Now in 2024, the same pattern is repeated, where I am once again being drawn into issues far beyond my purview.\n\n9/ This governance crisis cannot be resolved by malicious intent and unwarranted targeting of innocent individuals through commissions. It requires genuine accountability and action to address the root causes.\n\n10/ Corruption, maladministration, and bad governance are eroding our towns, cities, and country. These cancers must be rooted out. Local governance has become a theatre of incompetence and impunity. It is a crisis compounded by a small grouping that weaponises inquiries to distract from its dire failures. It is time to hold accountable those truly responsible for this decay.\n\n"
        }
    ]
}