{
    "news": [
        {
            "url": "https://www.zimeye.net/2024/12/10/mugabe-youth-leader-arrested/",
            "content": "By Political Reporter-Zanu PF Mugabe era youth leader Kudzai Chipanga, has appeared before a Rusape magistrate to face charges of theft involving agricultural inputs valued at US$11,000.\n\nChipanga gained fame as a vocal and controversial figure in Mugabes regime and used his position to intimidate political opponents and citizens.\n\nHe became one of the most visible faces of the Zanu PF youth league, often issuing fiery statements and leading campaigns against perceived detractors of Mugabes rule.\n\nIn the final days of Mugabes presidency in late 2017, Chipanga was a key player in the factional battles within the ruling party, aligning himself with the G40 faction led by Grace Mugabe.\n\nThe faction sought to elevate Grace as Mugabes successor, setting them on a collision course with then-Vice President Emmerson Mnangagwa and the military.\n\nHowever, the tide turned during the November 2017 military coup that ended Mugabes 37-year rule.\n\nChipanga, who had publicly denounced the army and sided with the embattled G40, found himself humiliated when the military detained him.\n\nImages of a subdued and apologetic Chipanga reading a prepared statement in army custody circulated widely, symbolising the fall of Mugabes loyalists.\n\nChipanga avoided prison time despite his earlier defiance in the coups aftermath, which surprised many who had witnessed his brazen behaviour.\n\nThe theft charges now before the court mark yet another chapter in his checkered career.\n\nHe was granted $400 bail, and Chipanga awaits the courts determination on his alleged involvement in the theft.\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/10/chamisa-throws-tshabangu-councillors-under-the-bus/",
            "content": "By Political Reporter- The Peoples President Nelson Chamisa has thrown the Sengezo Tshabanhu Harare-led council under the bus, condemning them for abandoning their duties as soon as they are voted into office.\n\nAppearing before the commission of inquiry into the financial affairs of the capital city yesterday, Chamisa denied allegations that he directed councillors to fast-track regularisation of settlements in Harare.\n\nPresident Emmerson Mnangagwa in May this year appointed the commission led by retired judge Justice Maphios Cheda to investigate financial management systems and audit compliance with the Public Finance Management Act at the local authority.\n\nThe commission invited Chamisa to answer to the allegation that he gave a directive to councillors to fast-track land regularisation.Evidence leader Tabani Mpofu told Chamisa that the commission had evidence that the councillors were teaming up with land barons.However, Chamisa dismissed the assertions accusing councillors of abusing their mandate after being elected into office.Well, I am not aware of that process, but what I am aware of is that there is a lot of tomfoolery and shenanigans within the context of local authorities.In fact, what bleeds my heart is the fact that each time councillors are elected on a party ticket the moment they go into council, they go bonkers, run amok, throw away all dictates of reason, throw away all dictates of allegiance and loyalty to the party, which I cant understand, he said.Chamisa also condemned the indiscriminate destruction of houses by council.What I am aware of, though, is that peoples houses were being destroyed and I had difficulties appreciating and understanding why a whole council would destroy peoples houses when they, in the first instance, had allowed people to construct those houses, he said.I take umbrage and great exception to people who then choose to undermine the rights of others in terms of the Constitution.Naturally, I would have issues with any kind of disposition where peoples houses are destroyed. But as regards processes within the council, I am not a councillor, not a mayor, not even a council official.In terms of the Urban Councils Act, there is no way individual citizens can actually have authority over the processes of council.Because council is a creature of statutes and council is a product of the law. Anything that happens within the council is governed by statutes, laws and procedures within that council.Chamisa said he was not able to control the councillors because parties are not contemplated in the statutes in terms of the running of local authorities.We are governed by the electorate. We are governed by the statutes. We are governed by the Urban Councils Act and on that score, then it becomes very difficult to bring to account, especially our councillors.I just hope that the commission will appreciate that delinquent characters must, you know, account for their delinquency and name throwing. There are many people who rape in the name of leaders, he said.The former opposition leader, who dismissed the August 2023 presidential elections, denied allegations made in a recording where his name was mentioned by a local councillor. I would never address a few people like a few councillors that have been mentioned. If I were to address, I would address maybe the entirety of the people.I am sure the commission within the realm of due diligence was to adduce evidence from him where I say that. Either, voice or written or whatever, because there is always evidence that is supposed to back a claim.It is another point I have been asked.If you were to show me I would not know him. I have over 2 000 councillors.If I were to see him I would not know him. There are 2 000 councillors who were under the CCC ticket. I dont know who is who. I would not know. Theres no reason for me to even address an individual councillor on any matter. Newsday\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/10/baba-harare-fights-to-retain-own-name/",
            "content": "Baba Harare is fighting to retain his brand name which he announced he has ditched for the Biblical King David tag. Below is some of the dramatic social chatter over it\n\n"
        }
    ]
}