{
    "news": [
        {
            "url": "https://www.zimeye.net/2024/12/11/zimbabweans-gain-path-to-seize-ed-kamlesh-pattnis-billions-following-us-sanctions/",
            "content": "By A Correspondent | ZimEye | In a seismic development, dispossessed Zimbabweans now have a legal pathway to target and reclaim billions of dollars and gold stashed abroad by Kamlesh Pattni, a business partner of Zimbabwean President Emmerson Mnangagwa. The announcement comes in the wake of sweeping sanctions imposed by the U.S. Department of the Treasurys Office of Foreign Assets Control (OFAC) on Pattni and his global network of businesses for their involvement in corruption and gold smuggling.\n\nThe sanctions, announced on International Anti-Corruption Day, are the culmination of a multi-year investigation led by ZimEye News Network and Al Jazeeras Investigative Unit. The investigation, spanning 2015 to 2023, exposed Pattnis elaborate schemes to siphon off Zimbabwes natural resources through bribery, fraud, and money laundering for the purpose of rigging elections.\n\nA Path for Asset Seizure\n\nU.S. sanctions on Pattni mirror global moves against illicit wealth, including the freezing and forfeiture of Russian oligarchs assets following sanctions over the Ukraine war. Legal experts suggest Zimbabweans and other affected parties can pursue similar actions to reclaim Pattnis offshore wealth, potentially valued in billions.\n\nPrecedents, such as a 236,815.15 forfeiture against a UK scammer, underscore the possibility of attaching Pattnis assets under U.S. and UK sanctions regimes. These measures target funds derived from corruption, enabling victims to recover stolen wealth through court-enforced forfeiture orders.\n\nPattnis Web of Corruption\n\nThe U.S. Treasury detailed Pattnis operations, accusing him of orchestrating a global gold smuggling and money laundering network that exploited Zimbabwes natural resources. By bribing officials and deploying trusted associates, Pattni concealed his illicit activities through a complex web of companies in jurisdictions such as the UAE, Singapore, and the British Virgin Islands.\n\nKey to Pattnis schemes was his use of trusted supporters, including relatives and close allies, to mask ownership and facilitate illegal transactions. Among his front companies are Sun Multinational DMCC, Fiza Gold and Bullion Trading LLC, and numerous others, all implicated in smuggling and laundering funds derived from Zimbabwean gold exports.\n\nZimbabwes Dispossessed Citizens Stand to Benefit\n\nThe sanctions highlight the systemic looting of Zimbabwes natural wealth, depriving its citizens of critical resources for infrastructure, education, and economic development. Bradley T. Smith, Acting Under Secretary of the Treasury for Terrorism and Financial Intelligence, condemned Pattnis actions, stating, Corruption respects no borders, and its consequences are felt worldwide. These sanctions demonstrate our commitment to holding these actors accountable.\n\nZimbabwean activists and anti-corruption campaigners have welcomed the sanctions, emphasizing that this opens a new chapter for justice and restitution. Pressure is now mounting on the Zimbabwean government to cooperate with international enforcement efforts to recover the stolen wealth.\n\nNext Steps for Justice\n\nPattnis designation under Executive Order 13818 freezes all U.S.-linked assets and prohibits transactions with him or his network. Entities and individuals facilitating transactions with Pattni risk secondary sanctions, further isolating his operations.\n\nThis landmark action signals hope for Zimbabweans seeking justice and accountability for decades of exploitation. Legal experts urge victims and advocacy groups to act swiftly, leveraging the sanctions to initiate asset recovery and reparations.\n\nAs the investigation continues to unfold, the spotlight remains on how Zimbabwes government and international partners will collaborate to dismantle Pattnis network and restore stolen wealth to its rightful owners.\n\nThis story is developing, and more updates are expected in the coming weeks.\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/chamisa-slams-mnangagwa-over-harare-land-saga/",
            "content": "By A Correspondent\n\nOpposition leader, Advocate Nelson Chamisa, has responded to President Emmerson Mnangagwas desperate attempts to implicate him in the Harare City Council land saga.\n\nBelow is Advocate Chamisas full response:\n\nOn Monday, I was called to testify before (Rtd) Justice Maphosa Cheda at the Harare City Commission inquiry, a forum established by Mr. Mnangagwa.\n\nWhile I have reservations about the legitimacy of the Commission, I agreed to appear out of courtesy and in my capacity as an officer of the Court and advocate for justice.\n\nThe Commission sought my response to claims allegedly made by a councillor, who supposedly mentioned my name in connection with the so-called regularisation process of the Harare City Council.\n\nI made it clear: I have no locus standi to comment on local authority matters. I am neither a councillor, mayor, nor a local government official, and I am not part of the central government. Urban councils are statutory bodies governed by the Urban Councils Act, and decisions are made by council committees or full council motionsnot by external actors or political parties.\n\nAn audio recording was played at the hearing, purportedly of the councillor referring to me as a party leader. Its amateurish presentation, played from a phone, raised questions about its authenticity and reliability.\n\nDespite these concerns, I responded to avoid embarrassing the Commission. For the record, I would not recognise the councillor in question if we met face-to-face. The voice on the recording also mentioned Mr. Mnangagwa. I pointed out that if my presence was deemed necessary based solely on this audio, then the same courtesy should surely be extended to Mr. Mnangagwa, whose name was also mentioned.\n\nThe principle is clear: he who alleges must prove. It is unjust to summon individuals based on unsubstantiated claims. The law demands evidence, not baseless accusations.\n\nI wish to make it clear: as a human rights defender, a champion of justice, and a steadfast constitutionalist, I strongly condemn the destruction of peoples homes. Using bulldozers to erase lives and livelihoods is criminal, sadistic, and inhumane. This is not justice; it is a testament to systemic leadership failure and a mockery of human rights.\n\nThis is not the first time a Commission has been used as a diversion from addressing real issues. In 2018, Mr. Mnangagwa established the Motlanthe Commission following disputed general elections. I was summoned before the Commission over a matter that had nothing to do with me. Now, in 2023, the same pattern is repeating, with me being drawn into issues far beyond my purview.\n\nThis governance crisis cannot be resolved through malicious intent or unwarranted targeting of innocent individuals via commissions. It requires genuine accountability and decisive action to address the root causes.\n\nCorruption, maladministration, and poor governance are eroding our towns, cities, and the country as a whole. These cancers must be eradicated. Local governance has become a theatre of incompetence and impunity. It is a crisis compounded by a small group that weaponizes inquiries to distract from its own failures. It is time to hold accountable those who are truly responsible for this decay.\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/greatman-mocks-themba-gorimbo/",
            "content": "By A Correspondent\n\nAfro-fusion musician Greatman, whose real name is Tongai Gwaze, has taken to social media to mock Zimbabwean MMA fighter Themba Gorimbo following his loss over the weekend.\n\nGwaze, who has collaborated with prominent musicians such as Mathias Mhere, Dorcas Moyo, Sulumani Chimbetu, and Alick Macheso, shared a post on X (formerly Twitter) saying: Great Hope batai hama dzaGori kunenge kwaita basa uko (Gorimbos relatives, please check if hes okay).\n\n"
        }
    ]
}