{
    "news": [
        {
            "url": "https://www.zimeye.net/2024/12/11/tafadzwa-leithen-ngirazi-struggling-in-chinese-hospital/",
            "content": "Dear Editor\n\nAnyone who knows relatives of this guy by the name Tafadzwa Leithen Ngirazi.\n\nThis guy is on death bed in China and no relatives. He is from Byo.\n\nAny leads please get in touch on 0717940183.\n\nPass on to other Byo groups. Thank you\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/coup-in-zanu-pf-youth-league/",
            "content": "By Political Reporter- The Zanu PF Youth Leaguehas been plunged into chaos as a power struggle erupted over an allegedcoupwithin its top executive.\n\nSecretary for Youth Affairs Tinoda Machakaire unilaterally reshuffled the executive council, sparking fierce resistance from his deputy, John Paradza.\n\nIn a circular dated 09 December 2024, Machakaire announced sweeping changes to key positions, asserting the reshuffle was necessary for fulfilling theleaguesconstitutional obligations and implementing resolutions from the NationalPeoplesConference.\n\nAmong the new appointees were:\n\nMachakaire said these changes were effective immediately.\n\nHowever, Paradza swiftly declared the move unconstitutional, advising the affected officials to ignore the reshuffle.\n\nIn a strongly worded memo to Machakaire, Paradza cited Article 25, Section 339 of the Zanu PF Constitution, accusing him of bypassing proper procedures and disregarding the mandate of elected provincial representatives.\n\nParadza revealed that he had escalated the matter to thepartysSecretary General, Obert Mpofu, seeking intervention to prevent what he described asunnecessary divisions and tensionswithin the league.\n\nHe further instructed the reshuffled officials to remain in their posts pending official resolution.\n\nThe YouthLeaguesinternal rift comes amid heightened political sensitivity in Zanu PF, raising questions about broader implications for thepartysstability ahead of key national events.\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/tshabangu-chopped/",
            "content": "By Political Reporter- The Welshman Ncube faction of the Citizens Coalition for Change (CCC) has filed an urgent High Court application to block disputed Secretary General Sengezo Tshabangus controversial actions in Parliament.\n\nLed by Ncube, deputy leader Lynette Karenyi Kore, Sesel Zwidzai, and Edwin Mushoriwa, the CCC faction has named the party as the primary applicant in their case.\n\nTshabangu, who took control of the CCC after the 2023 general elections, has been accused of using his position to orchestrate a sweeping reshuffle of parliamentary portfolio committee chairpersons to favour his allies.\n\nCritics claim these moves undermine the CCCs collective authority.\n\nAmong the respondents listed in the court papers are Tshabangu, Speaker of the National Assembly Jacob Mudenda, and Senator Nonhlahla Mlotshwa, who Tshabangu controversially appointed as the CCC Chief Whip.\n\nThe applicants are challenging the constitutionality of Tshabangus decisions, arguing that they exceed his authority and violate both party rules and court orders.\n\nThey seek a declaration nullifying Tshabangus recent actions, including the alleged removal of CCC representatives from the Standing Rules and Orders Committee (SROC) and various reshuffles within parliamentary committees.\n\nNcubes affidavit emphasizes that Tshabangus actions are unilateral and do not reflect the CCCs collective stance.\n\nHe accused Tshabangu of defying an earlier court order barring him from recalling party members, asserting that the reshuffles amount to disguised recalls.His actions are a frolic of his own, stated Ncube. He is a non-entity, and it is surprising that the Speaker continues to entertain him instead of respecting the partys collective will.The matter is yet to be heard in court, with no date set for the hearing. Until then, the CCC remains embroiled in its deepest leadership crisis to date.\n\n"
        }
    ]
}