{
    "news": [
        {
            "url": "https://www.newzimbabwe.com/zimbabwe-wants-26-free-carry-stake-in-new-mining-projects/",
            "content": "Bloomberg\n\nZimbabwe is planning to hold 26% of new mining projects on a free-carry basis, and will also negotiate with existing operators to acquire a similar stake.\n\nWe need to move to a level where we reach 26% shareholding in most of the big projects, Zimbabwes Secretary for Mines Pfungwa Kunaka told Bloomberg in an interview. A lot of these things would take negotiations with the investors that are on the ground.\n\nKunaka declined to say how the government would finance acquiring stakes in established mining projects.\n\nResource nationalism is strengthening across Africa as countries seek a greater share of the profits from their commodities while addressing historical imbalances in the wealth flows from mining. Zimbabwe mines a number of metals, such as gold, platinum, lithium and chrome, with operators including Zimplats, Anglo American Platinums Unki mine and RioZim.\n\nObviously when you have decisions which were made some years back and decisions were made on the basis of a certain framework, you cannot just willy-nilly go and change that, Kunaka said. It takes negotiations.\n\nKunaka did not disclose the minimum value of mining assets in which the government would want a shareholding, saying that details will be released later. The policy would be introduced from next year, he said.\n\nZimbabwe has a 15% free carry shareholding in platinum miner, Karo Resources, according to its website.\n\n"
        },
        {
            "url": "https://www.newzimbabwe.com/former-zanu-pf-youth-leader-matutu-up-for-us150k-fraud/",
            "content": "By Staff Reporter\n\nFormer Zanu PF youth leader Lewis Matutu appeared in court Tuesday for allegedly stealing shares from a local company.\n\nMatutu was arraigned before Harare Magistrate Isheanesu Matova who remanded him out of custody on free bail.\n\nHe is alleged to have conspired with Blessing, Tafadzwa Kusangaya, Muzimba, and Chikwasha Muhamba to steal shares from a company headed by Avurath Sibanda.\n\nAccording to prosecutor Takudzwa Jambawu, the fraudulent activity dates back to 2018 when Matutu and his accomplices, along with others still at large, devised a plan to misappropriate shares from Shusib Investments, a mining company.\n\nThey allegedly prepared fraudulent annual returns dated April 30, 2018, which were backdated to 2014, 2016, 2017, and 2018, forging the signatures of the complainant and Lyton Shumba, falsely indicating that the complainant had signed as director and Shumba as secretary.\n\nThe fraudulent returns were reportedly filed with the Registrar of Companies, presenting false information about changes in shareholding and directorship at Shusib Investments, thereby allowing the accused parties to allocate themselves shares and become majority shareholders.\n\nThe scheme came to light on September 30, 2024, when the complainant was notified by the Department of Parks and Wildlife that the accused had instructed the suspension of all mining operations, claiming they were entitled to sell the mining claim.\n\nThis prompted a request from the department for a meeting with a representative of Shusib Investments.\n\nFurthermore, using the illegally obtained shares, the accused participated in an annual general meeting on November 19, 2024, where they allegedly removed the complainant from his position as director and resolved to change the companys address.\n\nAs a result of these actions, the complainant is said to have suffered a financial loss amounting to US$150,000, with no recovery of the misappropriated assets reported, according to the States allegations.\n\n"
        },
        {
            "url": "https://www.newzimbabwe.com/zanu-pf-youth-league-leaders-cross-swords-amid-deepening-power-struggles/",
            "content": "By Staff Reporter\n\nDAGGERS have been drawn within the ruling Zanu PF party amid an alleged unconstitutional reshuffle of elected executives of the influential Youth League.\n\nThe ruling partys youth leaguetop leadershipYouth Affairs Minister, Tino Machakaire and Tourism Deputy MinisterJohn Paradza have locked horns over the unilateral removal of office bearers, which the latter said divides the revolutionary party.\n\nMachakaire, who is President Emmerson Mnangagwas appointee, is reportedly purging Paradza loyalists in a bid to dilute his elected deputys influence as internecine fights between the Zanu PF leader and Vice President Constantino Chiwenga intensify over a bid to extend the presidential term.\n\nSources told NewZimbabwe.com Machakaire was trying to balance the power matrix of the two feuding factions dividedover whether Mnangagwa should serve a third presidential term, which will require constitutional amendments and referendums.\n\nThrough a December 9, 2024 communication, Machakaire said changes to portfolio holders were meant to ensure resolutions of the National Peoples Conference held last October were swiftly implemented. The resolutions include pushing Mnangagwas incumbency beyond 2028 when his second and final term expires.\n\nIn my capacity as the Secretary for Youth Affairs, l have made the following adjustments in the departmental leadership of the National Youth League Executive Council.\n\nThese changes are intended to enhance the fulfilment of the Zanu PF YL constitutional obligations and meticulous execution of the National Peoples Conference resolutions wrote Machakaire.\n\nConsequently, Tsungai Makumbe was appointed Secretary for Finance, Phineas Makombe (Commissariat), Phillipa Makoko (External Relations), Munashe Mtutsa (Information), Valeria Makonza (Legal Affairs) and Garikai Zonde was thrust to the Science and Technology portfolio.\n\nSources further told this publication that the most affected executive members are those who were given party vehicles by Mnangagwa, and are now required to surrender them.\n\nThe reshuffle was, however, met with resistance by Deputy Secretary for Youth Affairs, Paradza.\n\nIn a letter dated December 10, 2024, Paradza said rejigging the executive was a nullity as due process was not followed.\n\nIt is imperative for me to remind you that these comrades were elected into the National Executive and their mandate is from the provinces and was ratified by the National Youth League Conference of 2022, hence any adjustments should be done in consultation with the provinces and above all the Constitution of the party, said Paradza.\n\nI have since written to the affected comrades guiding them to remain in their positions and continue with their responsibilities as mandated by the National Youth Conference of May 2022 until a clear instruction is issued by the secretary-general. Thus being said, the purported reshuffle is hereby put on hold until further notice, he added.\n\nMachakaire yesterday wasted no time and angrily responded to Paradzas letter, saying his deputy was not qualified to reprimand him.\n\nYou will note that your exercise of functions as Deputy Secretary for Youth Affairs, there is absolutely no basis upon which you can purport to censure the due discharge of any of the functions of the Secretary for Youth Affairs, Machakaire wrote.\n\nHe said he communicated the adjustments and got the blessings of his principal, Mnangagwa.\n\nI have been duly guided by my principal in terms of Article 10(88)(1)(2) and (13) and Article 26(339) and (4), further wrote Machakaire.\n\nParadza was urged to withdraw his earlier letter or risk facing disciplinary action.\n\nIn the circumstances, your much-circulated and published correspondence contesting the communicated position is irregular and must be withdrawn forthwith, failing which the appropriate measures shall be set in motion, warned Machakaire.\n\nMeanwhile, the Zanu PF Mashonaland West Provincial Coordinating Committee (PCC), during a meeting held in Chinhoyi Saturday, called upon Mnangagwa to remain in power until 2030, to realise his vision.\n\nThe indaba was the first since the partys October National Peoples Conference in Bulawayo and served to endorse resolutions.\n\nZanu PF Politburo member and Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, told the gathering of the importance of unity and discipline within the party.\n\nHe quashed rumours of factionalism pitting Mnangagwa and his deputy, Chiwenga.\n\nThere is no bad blood between President Mnangagwa and his deputy, Cde Constantino Chiwenga. The Vice President has remained loyal to President Mnangagwa.\n\nZanu PF has one centre of power, and party members always be loyal to the sitting leader, Ziyambi said.\n\nHe added that the ED 2030 slogan, which encourages Mnangagwa to see through Vision 2030, should be embraced without fear.\n\n"
        }
    ]
}