{
    "news": [
        {
            "url": "https://www.zimeye.net/2024/12/11/ezekiel-gutis-million-pound-bangalore-in-uk-picture/",
            "content": "Dear Editor.\n\nThis is the late ED prophet, Ezekiel Gutis million pound UK house bought for him 2 years ago that his daughter Laverner is now living in when shes  around. This is where she went to soon after that October womens prayer meeting with Gutis chipoko (ghost), the latter where one of the ZAOGA church elders, Silvia Munensa amd son Tariro duped a jobseeker 6,000 COS money.\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/tafadzwa-leithen-ngirazi-struggling-in-chinese-hospital/",
            "content": "Dear Editor\n\nAnyone who knows relatives of this guy by the name Tafadzwa Leithen Ngirazi.\n\nThis guy is on death bed in China and no relatives. He is from Byo.\n\nAny leads please get in touch on 0717940183.\n\nPass on to other Byo groups. Thank you\n\n"
        },
        {
            "url": "https://www.zimeye.net/2024/12/11/coup-in-zanu-pf-youth-league/",
            "content": "By Political Reporter- The Zanu PF Youth Leaguehas been plunged into chaos as a power struggle erupted over an allegedcoupwithin its top executive.\n\nSecretary for Youth Affairs Tinoda Machakaire unilaterally reshuffled the executive council, sparking fierce resistance from his deputy, John Paradza.\n\nIn a circular dated 09 December 2024, Machakaire announced sweeping changes to key positions, asserting the reshuffle was necessary for fulfilling theleaguesconstitutional obligations and implementing resolutions from the NationalPeoplesConference.\n\nAmong the new appointees were:\n\nMachakaire said these changes were effective immediately.\n\nHowever, Paradza swiftly declared the move unconstitutional, advising the affected officials to ignore the reshuffle.\n\nIn a strongly worded memo to Machakaire, Paradza cited Article 25, Section 339 of the Zanu PF Constitution, accusing him of bypassing proper procedures and disregarding the mandate of elected provincial representatives.\n\nParadza revealed that he had escalated the matter to thepartysSecretary General, Obert Mpofu, seeking intervention to prevent what he described asunnecessary divisions and tensionswithin the league.\n\nHe further instructed the reshuffled officials to remain in their posts pending official resolution.\n\nThe YouthLeaguesinternal rift comes amid heightened political sensitivity in Zanu PF, raising questions about broader implications for thepartysstability ahead of key national events.\n\n"
        }
    ]
}