{
    "news": [
        {
            "title": "Former Young Warriors stars at Etihad Stadium",
            "url": "https://www.chronicle.co.zw/former-young-warriors-stars-at-etihad-stadium/",
            "content": "Online Reporter\n\nBENJANI Mwaruwari a hit at Manchester City as a player, remembered for a hattrick against Manchester United is watching his former side against his employers Plymouth Argyle in an FA Cup fifth round tie at Etihad Stadium.\n\nMlungisi Ndebele\n\nAccompanying him is childhood friend Mlungisi Ndebele, with whom he played junior football in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ww.jpg",
            "description": "Online Reporter BENJANI Mwaruwari a hit at Manchester City as a player, remembered for a hattrick against Manchester United is watching his former side against his employers Plymouth Argyle in an FA Cup fifth round tie at Etihad Stadium. Accompanying him is childhood friend Mlungisi Ndebele, with whom he played junior football in Zimbabwe.",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "“And the Winner is”… NAMA Awards Tonight",
            "url": "https://www.chronicle.co.zw/and-the-winner-is-nama-awards-tonight/",
            "content": "The stage is set for the 23rd edition of the National Arts Merit Awards, taking place tonight in Harare.\n\nWith an exciting lineup of artistes, the event promises an unforgettable evening of entertainment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-6-Recovered-Recovered.jpg",
            "description": "The stage is set for the 23rd edition of the National Arts Merit Awards, taking place tonight in Harare. With an exciting lineup of artistes, the event promises an unforgettable evening of entertainment.",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Action is underway at Luveve Stadium, where hosts Chicken Inn are facing off against Bikita Minerals in their opening match of the Castle Lager Premier Soccer League.",
            "url": "https://www.chronicle.co.zw/action-is-underway-at-luveve-stadium-where-hosts-chicken-inn-are-facing-off-against-bikita-minerals-in-their-opening-match-of-the-castle-lager-premier-soccer-league/",
            "content": "The lineups for both teams are as follows:\n\nChicken Inn:\n\nDonovan Bernard, Kudzaishe Dzingwe, Mpumelelo Bhebhe, Joseph Thulani, Xolani Ndlovu, Lincoln Mangaira, Miguel Feldman, Tinashe Mushaireni, Genius Mutungamiri, Brian Muza, Godfrey Mucheje\n\nBikita Minerals:\n\nTawanda Dendera, Tanaka Makwarimba, Pascal Shumba, Carlton Munzamba, Tinashe Ruzive, Felix Moyo, Chelsea Makope, Innocent Masiwa, Benedict Bera, Takunda Manyuchi, Tadiwanashe Musarurwa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/football-580x380.jpg",
            "description": "The lineups for both teams are as follows: Chicken Inn: Donovan Bernard, Kudzaishe Dzingwe, Mpumelelo Bhebhe, Joseph Thulani, Xolani Ndlovu, Lincoln Mangaira, Miguel Feldman, Tinashe Mushaireni, Genius Mutungamiri, Brian Muza, Godfrey Mucheje Bikita Minerals: Tawanda Dendera, Tanaka Makwarimba, Pascal Shumba, Carlton Munzamba, Tinashe Ruzive, Felix Moyo, Chelsea Makope, Innocent Masiwa, Benedict Bera, Takunda Manyuchi, Tadiwanashe […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "President Mnangagwa departs Namibia after honouring Liberation Icon Dr Sam Nujoma",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-departs-namibia-after-honouring-liberation-icon-dr-sam-nujoma/",
            "content": "Nduduzo Tshuma in Windhoek, Namibia\n\nPRESIDENT Mnangagwa has left the Namibian National Heroes Acre for the Hosea Kutako International Airport from where he will fly back home in Harare.\n\nThe Sadc chairperson earlier in the day joined fellow Heads of State at Namibias National shrine to bid farewell to the countrys founding father and liberation icon Dr Sam Nujoma who died on February 8 last month.\n\nAlso at the burial was AU chairperson and Angolan leader President Lorenco, South African President Cyril Ramaphosa, among other dignitaries from the African continent and beyond.\n\nThousands of Namibians also turned out at the National shrine for the burial of their liberator. Namibian President and chief mourner Dr Nangolo Mbumba said Dr Nujoma completed his life mission with distinction, leaving the country with the gift of independence and freedom.\n\nThe previous day at a memorial service for Dr Nujoma, President Mnangagwa said the Namibian founding father will be remembered for his fierce fight for justice and equality not only for Namibia but Africa and beyond.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-01-at-11.30.47_e83bbb9d-680x380.jpg",
            "description": "Nduduzo Tshuma in Windhoek, Namibia PRESIDENT Mnangagwa has left the Namibian National Heroes Acre for the Hosea Kutako International Airport from where he will fly back home in Harare. The Sadc chairperson earlier in the day joined fellow Heads of State at Namibia’s National shrine to bid farewell to the country’s founding father and liberation […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "President Mnangagwa’s All-Councillors Indaba set for Bulawayo this month",
            "url": "https://www.chronicle.co.zw/president-mnangagwas-all-councillors-indaba-set-for-bulawayo-this-month/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHE second edition of the All-Councillors Indaba, where President Mnangagwa engages with councillors from the countrys 92 local authorities, will be held in Bulawayo in March 2025.\n\nThe inaugural Indaba took place in Harare in November last year, where the President strongly condemned corruption in councils and launched the Call to Action: No Compromise on Service Delivery blueprint.\n\nSpeaking during his keynote address at a heritage training workshop for Matabeleland North councillors at a Bulawayo hotel on 28 February, Local Government and Public Works Minister Daniel Garwe said President Mnangagwa will address the long-standing issue of councillors welfare during the upcoming interaction.\n\nBefore I take my seat, as you know, President Mnangagwa made a promise to engage with all councillors from our local authorities on a quarterly basis. He will be here in Bulawayo within the first two weeks of next month, said Minister Garwe.\n\nHe urged councillors and executive council staff to prepare thoroughly for the meeting with the President.\n\nI can pre-empt some of the issues His Excellency will address, including your welfare in terms of allowances, which have been reviewed to what I believe are acceptable levels. There is also the issue of housing stands as well as a duty-free car import scheme. All this is because he is a listening leader, and your concerns have been heard, said Minister Garwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/thytytyty.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE second edition of the All-Councillors Indaba, where President Mnangagwa engages with councillors from the country’s 92 local authorities, will be held in Bulawayo in March 2025. The inaugural Indaba took place in Harare in November last year, where the President strongly condemned corruption in councils and launched the Call to Action: […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Sobukhazi High School crowned Reigate District Inter-Schools Athletics Champions",
            "url": "https://www.chronicle.co.zw/sobukhazi-high-school-crowned-reigate-district-inter-schools-athletics-champions/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nSOBUKHAZI High School were yesterday crowned champions of the Reigate District Inter-Schools Track and Field Athletics Competition after amassing an incredible 33 gold medals at White City Stadium.\n\nThe meet, featuring 12 schools, was held over two days, starting Thursday and concluding Friday. Led by their sports-enthusiast headmaster, Cain Ncube, Sobukhazi High also secured 16 silver and 13 bronze medals. Northlea, who came in second place, earned 24 gold, 16 silver, and an equal number of bronze medals.\n\nA distant third was Entumbane, with 12 gold, 13 silver, and three bronze medals. Luveve secured fourth place with eight gold, six silver, and 12 bronze medals, while Mzilikazi finished fifth with six gold medals and an equal number of silver and bronze medals (4).\n\nCowdray Park suburb-based institutions, Prestige College and V. Mhlophe Secondary School, were the only schools without a gold medal. Prestige College managed five silver and three bronze medals, while V. Mhlophe secured a single silver and bronze medal.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/TUYU7I.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw  SOBUKHAZI High School were yesterday crowned champions of the Reigate District Inter-Schools Track and Field Athletics Competition after amassing an incredible 33 gold medals at White City Stadium. The meet, featuring 12 schools, was held over two days, starting Thursday and concluding Friday. Led by their sports-enthusiast headmaster, Cain Ncube, Sobukhazi High […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Strengthening Football Together: Zifa engages stakeholders nationwide!",
            "url": "https://www.chronicle.co.zw/strengthening-football-together-zifa-engages-stakeholders-nationwide/",
            "content": "Online Reporter\n\nTHE Zimbabwe Football Association (Zifa) executive committee has officially begun a nationwide stakeholder engagement, which kicked off on Friday in Harare (Northern Region).\n\nThis weekend, the team will visit Gweru (Central Region), Bulawayo (Southern Region), and Masvingo (Eastern Region) to connect with key football stakeholders.\n\nDuring these engagements, Zifa president Nqobile Magwizi will be presenting a strategic framework aimed at guiding all stakeholders in shaping a clear, progressive path for Zimbabwean football in the short and medium term.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ilouio.jpg",
            "description": "Online Reporter THE Zimbabwe Football Association (Zifa) executive committee has officially begun a nationwide stakeholder engagement, which kicked off on Friday in Harare (Northern Region). This weekend, the team will visit Gweru (Central Region), Bulawayo (Southern Region), and Masvingo (Eastern Region) to connect with key football stakeholders. During these engagements, Zifa president Nqobile Magwizi will […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "LIVE: Thousands gather to honour Namibia’s Founding Father Dr Sam Nujoma",
            "url": "https://www.chronicle.co.zw/live-thousands-gather-to-honour-namibias-founding-father-dr-sam-nujoma/",
            "content": "16:34He was seen off at the Hosea Kutako International Airport by Zimbabwes Ambassador to Namibia Melody Chaurura\n\n16:34President Mnangagwa has left Namibia for Zimbabwe after attending the memorial service and burial of the countrys founding father Dr Sam Nujoma in Windhoek\n\n14:00The singing of the Namibian National Anthem marks the end of the burial\n\n13:42:Namibian Vice President and President-elect Netumbo Nandi-Ndaitwah is next to lay the wreath\n\n13:39Next up is South African President Cyril Ramaphosa\n\n13:37Sadc chairperson, President Mnangagwa follows in laying wreaths on the grave\n\n13:35He is followed by the Angolan President who is also AU chairperson\n\n13:30Heads of State led by President Mbumba lay wreaths on the grave of Dr Nujoma\n\n13:22More than 250 foreign journalists were accredited to cover Dr Nujomas burial confirming his status as a liberation giant\n\n13:20Emotions run high as members of the ruling SWAPO break into revolutionary songs\n\n13:19He is being honoured by a 21 gun salute as military jets fly past as a final send off\n\n13:17He is being buried in a Mausoleum on the top most end of the heroes acre\n\n13:14Pall bearers now preparing to lower Dr Nujomas body into his grave\n\n12:09Heads of State and dignitaries have also made it to the burial site\n\n11:42The representative and members of the local clergy will accompany Dr Nujomas body to the burial site\n\n11:41Dr Nujomas body is now being taken to the burial site. It is revealed that the Pope has sent a representative to attend the burial\n\n11:41Dr Nujomas body is now being\n\n11:38Dr Mbumba ends his speech\n\n11:38He says the entire State of Namibia stands together with Dr Nujomas family in this difficult time\n\n11:30You were the ultimate statesman and Commander in Chief. Namibia is proud to call you the son of the Namibia soil\n\n11:29We fought under your command and removed the face of apartheid colonialism forever\n\n11:28He says those who served under Dr Nujoma before and after the liberation was remembering how he confidently led from the front\n\n11:28He salutes Dr Nujoma for his service to Namibia before and after the struggle for liberation\n\n11:27Dr Nujoma has completed his mission with distinction Namibia with the gift of freedom\n\n11:26We have gathered in these grounds to bury a distinguished son of Namibia\n\n11:22Dr Mbumba takes to the podium to give his address\n\n10:41Dr Nujomas casket arrives at the shrine accompanied by Dr Mbumba\n\n10:27We now await the arrival of Namibian President Mbumba who will be accompanying Dr Nujomas casket\n\n10:22South African President Cyril Ramaphosa arrives at the heroes acre\n\n09:54 President Mnangagwa arrives for burial of Dr Nujoma\n\nSADC Chairperson and Zimbabwe President Mnangagwa, has arrived at Namibian National Heroes Acre to attend the burial of Namibias founding father, Dr Sam Nujoma. The solemn event is being held at the national shrine, a facility inspired by Zimbabwes own revered Heroes Acre, which honours the nations liberation heroes.\n\nPresident Mnangagwa joins other leaders from across the region to pay tribute to Dr. Nujoma, a towering Pan-African figure who played a pivotal role in Namibias independence. The ceremony reflects the profound respect and solidarity shared among African nations for their liberation icons.\n\n09:44 Dignitaries arrive ahead of Dr Nujoma burial\n\nVARIOUS dignitaries have started arriving at the Namibian National Heroes Acre ahead of the burial of Dr Nujoma.\n\nAmong those that have since arrived are Malawi Vice President Michael Usi, former South African President Thabo Mbeki and former Zimbabwean First Lady Grace Mugabe.\n\nZimbabwe Foreign Affairs Minister Professor Amon Murwira and Zimbabwes Ambassador to Namibia Melody Chaurura have also arrived at the shrine.\n\nDr Nujomas widow Mrs Kuvomba Nujoma and members of the family have since arrived at the Acre.\n\nOthers who have also arrived are; Former Botswana President Ian Khama, Vice President of Ghana, Jane Naana Opoku-Agyemang, Cuban Communiste Paryh representative Hernandez arrives, Kenyan Deputy President Kithure Kindiki, Former Mozambican President Joaquim Chissano and former DRC President Joseph Kabila\n\n09:26Sadc chairperson, President Mnangagwa arrives at the heroes acre. A familiar facility inspired the Zimbabwean shrine\n\n09:24Former DRC President Joseph Kabila arrives\n\n09:24 Kenyan Deputy President Kithure Kindiki arrives\n\n09:24Former Mozambican President Joaquim Chissano arrives\n\n09:24Cuban Communist Party representative Hernandez arrives\n\n09:24Vice President of Ghana Naana Opoku-Agyemang arrives\n\n09:23Former Botswana President Ian Khama also arrives\n\n09:22Dr Nujomas widow, Mrs Kuvomba Nujoma and members of the family arrive at the Acre\n\n09:21Foreign Affairs Minister Professor Amon Murwira and Zimbabwes Ambassador to Namibia Melody Chaurura also arrive at the shrine\n\n09: 20Dignitaries have started arriving here, including Malawi Vice President, former South African President Thabo Mbeki, former Zimbabwean First Lady Grace Mugabe and representatives of different countries.\n\n08:52The construction of the Namibian National Heroes Acre was initiated by Dr Nujoma, after he visited the Zimbabwean national shrine on the sidelines of an African Union summit in Harare in 1997.\n\nMULTITUDES of people are making their way to Namibias National Heroes Acre for the burial of the countrys founding father, Dr Sam Nujoma.Dr Nujoma, who led Namibia from independence in 1990 until 2005, passed away in a Windhoek hospital on 8 February.SADC chairperson, President Mnangagwa, will join fellow Heads of State at the burial of Dr Nujoma, the last surviving founding father in the region.Speaking at a memorial service for the liberation icon at Independence Stadium yesterday, President Mnangagwa described Dr Nujomas death as a huge loss to Africa and beyond. He said the liberation icons selfless efforts and unwavering commitment to justice, equality, and freedom for his people and all of humanity would remain etched in our collective memory for posterity.In the late Dr Nujoma, we had more than just a political figure; he was a larger-than-life revolutionary icon and a shining beacon of hope for the peoples of Africa. His astute, exemplary, and consistent leadership during our struggles for independence laid critical building blocks for the democratic culture that not only Namibia but the whole of SADC cherishes so dearly to this day, said the President.As the leader of SWAPO, he inspired countless individuals to rise against colonial oppression and to fight for their birthrightfreedom, independence, and dignity. His vision for a truly independent and liberated African people transcended borders, uniting people from across Southern Africa.\n\nChronicle Assistant Editor Nduduzo Tshuma is in Namibia and will give us live updates of the event while Presidential Photographer Tawanda Mudimu will provide pictures and videos.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-28-at-09.31.55-680x380.jpeg",
            "description": "UPDATE 16:34 He was seen off at the Hosea Kutako International Airport by Zimbabwe’s Ambassador to Namibia Melody Chaurura 16:34 President Mnangagwa has left Namibia for Zimbabwe after attending the memorial service and burial of the country’s founding father Dr Sam Nujoma in Windhoek UPDATE 14:00 The singing of the Namibian National Anthem marks the end […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Thousands gather to honour Namibia’s Founding Father Dr Sam Nujoma",
            "url": "https://www.chronicle.co.zw/thousands-gather-to-honour-namibias-founding-father-dr-sam-nujoma/",
            "content": "Nduduzo Tshuma in Windhoek, Namibia\n\nMULTITUDES of people are making their way to Namibias National Heroes Acre for the burial of the countrys founding father, Dr Sam Nujoma.Dr Nujoma, who led Namibia from independence in 1990 until 2005, passed away in a Windhoek hospital on 8 February.SADC chairperson, President Mnangagwa, will join fellow Heads of State at the burial of Dr Nujoma, the last surviving founding father in the region.Speaking at a memorial service for the liberation icon at Independence Stadium yesterday, President Mnangagwa described Dr Nujomas death as a huge loss to Africa and beyond. He said the liberation icons selfless efforts and unwavering commitment to justice, equality, and freedom for his people and all of humanity would remain etched in our collective memory for posterity.In the late Dr Nujoma, we had more than just a political figure; he was a larger-than-life revolutionary icon and a shining beacon of hope for the peoples of Africa. His astute, exemplary, and consistent leadership during our struggles for independence laid critical building blocks for the democratic culture that not only Namibia but the whole of SADC cherishes so dearly to this day, said the President.As the leader of SWAPO, he inspired countless individuals to rise against colonial oppression and to fight for their birthrightfreedom, independence, and dignity. His vision for a truly independent and liberated African people transcended borders, uniting people from across Southern Africa.\n\nNo synonyms found.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fdc.jpg",
            "description": "Nduduzo Tshuma in Windhoek, Namibia MULTITUDES of people are making their way to Namibia’s National Heroes’ Acre for the burial of the country’s founding father, Dr Sam Nujoma. Dr Nujoma, who led Namibia from independence in 1990 until 2005, passed away in a Windhoek hospital on 8 February. SADC chairperson, President Mnangagwa, will join fellow […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Africa mourns Nujoma. . .Africa must deepen unity, honor legacy of  Dr Nujoma- President",
            "url": "https://www.chronicle.co.zw/africa-mourns-nujoma-africa-must-deepen-unity-honor-legacy-of-dr-nujoma-president/",
            "content": "NDUDUZO TSHUMA in Windhoek, Namibia\n\nSADC Chairperson, President Mnangagwa, yesterday stated that African nations, in honour of the legacy bequeathed by their founding fathers, have a responsibility to deepen collaboration and synergies for a brighter and more prosperous future, especially for young people.\n\nSpeaking at a memorial service for Namibias founding father and liberation icon, Dr Sam Nujoma, at the Independence Stadium, President Mnangagwa said the liberation icon understood that true liberation extends beyond mere political independence to encompass social equity and sustainable development.\n\nDr Nujoma, who led Namibia from independence in 1990 to 2005, passed away at the age of 95 in a Windhoek hospital on February 8, 2025.\n\nSpeaker after speaker praised Dr Nujoma for his fearless fight to dismantle colonialism, not only in his own country but in other African nations as well.\n\nSam Nujoma\n\nPresident Mnangagwa said that throughout his tenure, Dr Nujoma championed policies that promoted social justice, economic development, and regional co-operation.\n\nAs we reflect on his legacy and continue our pursuit to realise the SADC Vision 2050 and the AU Agenda 2063, let us be emboldened by his words of recollection, and I quote, When the founding fathers were calling for African unity, they were calling for economic emancipation, cooperation, and integration of the entire African continent.\n\nThey fully understood that political freedom would remain insufficient and meaningless unless it was accompanied by genuine economic independence.\n\nWe must continue to work together as nations within SADC and the larger African continent to uphold the values he and many others fought hard to entrench in the psyche of our peoples, said the President.In mourning Dr Nujoma, President Mnangagwa said Africa must transform its sorrow into purposeful action.\n\nThe late Dr Nujomas vision must live on through our collective efforts towards sustainable peace and prosperity in Southern Africa, the African continent as a whole and the Global South.\n\nIn honour of the legacy bequeathed to us by our founding fathers, including the late Cde Nujoma, we all have the responsibility to deepen collaboration and synergies among Member States for a brighter and more prosperous future, especially for our young people.\n\nI exhort us, therefore, to continue the fight for justice, equality, and a peaceful region. This is the fight that our late African icon and founding father, Dr Sam Nujoma, so passionately led throughout his lifea life well lived in service of his people and all of us, said President Mnangagwa.\n\nPresident Mnangagwa addresses mourners in Namibia yesterday\n\nDescribing the death of Dr Nujoma as a huge loss to Africa and beyond, President Mnangagwa said the liberation icons selfless efforts and unwavering commitment to justice, equality, and freedom for his people and all of humanity would remain etched in our collective memory for posterity.\n\nIn the late Dr Nujoma, we had more than just a political figure, he was a larger-than-life revolutionary icon and a shining beacon of hope for the peoples of Africa. His astute, exemplary, and consistent leadership during our struggles for independence laid critical building blocks for the democratic culture that not only Namibia but the whole of SADC cherishes so dearly to this day.\n\nAs the leader of SWAPO, he inspired countless individuals to rise against colonial oppression and to fight for their birth right, freedom, independence, and dignity. His vision for a truly independent and liberated African people transcended borders, uniting people from across Southern Africa, said the President\n\nAfrican Union Chairperson and Angolan President Joo Loureno said that the works of Dr Nujoma would be recorded in the annals of history and serve as a beacon for future generations.\n\nNamibias President and chief mourner, Dr Nangolo Mbumba, noted that while the month of February is associated with purity and love, Namibia had endured the pain of losing its third President, Hage Geingob, last year and Dr Nujoma this year.\n\nHis indomitable revolutionary spirit will always be with us. We do not bid him farewell, but we mourn and celebrate his life, history, and achievements, he said.\n\nNamibias Vice President and President-elect, Dr Netumbo Nandi-Ndaitwah, emphasised the importance of staying true to the ideals of Namibias liberation, a cause to which Dr Nujoma dedicated his life.\n\nDr Nujomas successor and Namibias second President, Dr Hifikepunye Pohamba, said he was privileged to have worked closely with the liberation icon for 63 years, both in exile and after independence.\n\nDr Nujoma held the people together, and indeed history was achieved, Namibia was free, he said.The late Dr Sam Nujomas eldest child, Unoti Nujoma, who is Namibias Minister of Labour, Industrial Relations and Employment Creation, described his fathers legacy as one of unity, not just within Namibia but across the African continent.\n\nNamibian Member of Parliament and leader of the Official Opposition McHenry Venaani praised Dr Nujomas unparalleled leadership, describing him as not just a leader but a master tactician in the field.\n\nThe memorial service was attended by former Mozambican President Joaquim Chissano, former DRC President Joseph Kabila, former first lady Grace Mugabe and dignitaries from various countries, including Cuba, the Netherlands and the European Union among others.The late Dr Nujomas body lay in state at the Independence Stadium ahead of his burial at Namibias National Heroes Acre today.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-3-7-680x380.jpg",
            "description": "NDUDUZO TSHUMA in Windhoek, Namibia SADC Chairperson, President Mnangagwa, yesterday stated that African nations, in honour of the legacy bequeathed by their founding fathers, have a responsibility to deepen collaboration and synergies for a brighter and more prosperous future, especially for young people. Speaking at a memorial service for Namibia’s founding father and liberation icon, […]",
            "time": "08:26",
            "date": "02 Mar 2025"
        }
    ]
}