{
    "news": [
        {
            "title": "Bulawayo losing 46 percent of produced water to leakages: Council outlines US$43 million emergency measures to improve supply",
            "url": "https://www.chronicle.co.zw/bulawayo-losing-46-percent-of-produced-water-to-leakages-council-outlines-us43-million-emergency-measures-to-improve-supply/",
            "content": "Online Writer\n\nThe Bulawayo City Council (BCC) has outlined a comprehensive strategy to address the citys ongoing water crisis, as revealed in the latest report from the Director of Water and Sanitation dated 26 November 2024.With dam reserves continuing to deplete and a precarious 21-month water supply projected, the council emphasised the need for immediate, medium-term, and long-term interventions to conserve water and secure sustainable resources.To mitigate the crisis, BCC has outlined 41 projects requiring an estimated $29.1 million in immediate funding, with an additional $13.5 million for short-to-medium-term projects and $7.5 million for long-term solutions.\n\nWater shedding, a controversial measure due to its adverse impacts on public health and social equity, remains a cornerstone of the citys conservation efforts. Despite these challenges, the local authority asserts that rationing and shedding remain practical strategies under present conditions. A 130-hour weekly water shedding programme is in place.\n\nKey initiatives to address the challenge include:\n\nInfrastructure Rehabilitation: Renewal of water mains to reduce losses, which account for 46 percent of produced water, and replacement of non-functional meters affecting 17 percent of connections.\n\nWater Treatment Improvements: Refurbishment of Ncema Water Treatment Works and installation of bulk flow meters to improve reservoir level control.\n\nPipeline Upgrades: Upgrades to critical pipelines, such as the Mtshabezi-Umzingwane interlink, to increase supply capacity.\n\nSewer System Repairs: Rehabilitation of problematic sewer outfalls and pump stations to improve wastewater management.\n\nGovernment and Development Partner Support\n\nThe Government of Zimbabwe has allocated $1.5 million to support these efforts, complementing the reduced scope of ongoing projects, including the UMzingwane and Inyankuni rehabilitation. The council has also approached international development partners to secure additional funding.\n\nThe report highlights the challenges posed by non-revenue water (NRW) losses due to leaks, burst pipes, and billing inaccuracies. The council plans to address these inefficiencies through targeted repairs, meter replacements, and public awareness campaigns.\n\nLong-term projects include increasing reservoir storage capacity at Criterion and Tuli and conducting feasibility studies for new pipeline and energy generation systems. These initiatives aim to ensure a sustainable and resilient water supply for Bulawayos growing population.\n\nThe BCCs report underscores the urgent need for investment and collaboration to avert a full-blown water crisis. Residents are encouraged to conserve water while stakeholders are called upon to support the citys ambitious recovery and development plans.\n\nAs Bulawayo grapples with its worst water crisis in years, the citys resilience and the effectiveness of these measures will be put to the test.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/bcc.jpg",
            "description": "Online Writer The Bulawayo City Council (BCC) has outlined a comprehensive strategy to address the city’s ongoing water crisis, as revealed in the latest report from the Director of Water and Sanitation dated 26 November 2024. With dam reserves continuing to deplete and a precarious 21-month water supply projected, the council emphasised the need for […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Gokwe North’s first state-of-the-art Mall nears completion, ushers urban vibes to rural area",
            "url": "https://www.chronicle.co.zw/gokwe-norths-first-state-of-the-art-mall-nears-completion-ushers-urban-vibes-to-rural-area/",
            "content": "By[emailprotected]\n\nGOKWE  Kabuyuni Constituency legislator Cde Spencer Tshuma, is spearheading the construction of Gokwe Norths first-ever state-of-the-art double-storey mall in Nembudziya.The project is part of Zimbabwes National Vision 2030 initiative to uplift rural areas to urban standards.\n\nConstruction of the mall began in late 2024 and is now nearing completion, with only final touches such as paving, tiling, and painting remaining.\n\nIn an interview with the chronicle, the legislator outlined the transformative vision behind the project, aimed at improving the lives of people in Gokwe.\n\nThe target is to bring about change in Gokwe and raise rural areas to urban standards, he said.\n\nThe mall, which will feature only the second-ever bank in Nembudziya, is set to improve access to essential services for villagers. This will be the second financial institution in the area, after the longstanding CBZ Bank. According to Cde Tshuma, AFC and ZB Banks have shown interest in occupying the space, with a decision expected soon.\n\nThe building is now 90% complete; whats left is beautifying the place. We are determined to make it a fully inclusive shopping mall where various services will be provided. Products usually found in urban areas will be sold at affordable prices, with us controlling the pricing, he explained.\n\nThe introduction of a bank is expected to simplify financial transactions for the community, particularly parents paying school fees. Residents will no longer need to travel to urban centres for banking services.\n\nThe bank will make it easier for parents to pay fees and for residents to send and receive money without travelling long distances, Cde Tshuma said.\n\nHe revealed plans to shift focus from the Nembudziya Mall to a new project in Kadoma.\n\nWe are phasing out the Nembudziya project, as we are starting another important venture in Kadoma. To us, this one is complete, he said.\n\nThe mall follows Cde Tshumas earlier development of a fuel station, Spencer Fuels, launched in early 2024 next to the construction site. The station provides petrol, diesel, and LPG gas at urban-equivalent prices, alleviating fuel shortages and price inconsistencies in the region.\n\nI saw the struggles of motorists and surrounding communities with fuel and gas availability. The station is there to offer consistent, reliable, and competitive services, he said.\n\nZanu PF Midlands provincial chairperson, Cde Edson Chakanyuka Chiherenge, commended Cde Tshuma for his efforts to transform Gokwe North.\n\nHonourable Tshumas work is putting Gokwe North on the map. His projects are attracting the youth to love Gokwe and providing much-needed employment, he said.\n\nHe noted that the developments are helping the region overcome its reputation for underdevelopment, bringing it in line with national aspirations for progress under Vision 2030.\n\nCde Tshumas initiatives are revolutionising the region, fostering local development, and ensuring Gokwe North moves closer to achieving urban standards and realising Vision 2030.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/GERER.jpg",
            "description": "By mpofuamos41@gmail.com GOKWE – Kabuyuni Constituency legislator Cde Spencer Tshuma, is spearheading the construction of Gokwe North’s first-ever state-of-the-art double-storey mall in Nembudziya. The project is part of Zimbabwe’s National Vision 2030 initiative to uplift rural areas to urban standards. Construction of the mall began in late 2024 and is now nearing completion, with only […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Republic of Cuba in historic handover of artefacts to the Museum of African Liberation",
            "url": "https://www.chronicle.co.zw/republic-of-cuba-in-historic-handover-of-artefacts-to-the-museum-of-african-liberation/",
            "content": "In a historic milestone for the Museum of African Liberation Project, the Government of the Republic of Cuba is handing over a variety of artefacts for display at the facility, which is being constructed by the Institute of African Knowledge (INSTAK) with support from the Government of the Republic of Zimbabwe.\n\nHis Excellency the President of the Republic of Zimbabwe, Cde Dr Emmerson Dambudzo Mnangagwas Special Envoy on the Museum of African Liberation, Ambassador Simbarashe Mumbengegwi, will this week take receipt of the donation from the President of the Council of the Republic of Cuba, H.E. Miguel Diaz-Canel Bermudez. Accompanying Ambassador Mumbengegwi to Cuba is the Chief Executive Officer of INSTAK, Ambassador Kwame Muzawazi, and other delegates.Ambassador Mumbengegwi will also deliver a Special Message from H.E. President Dr E.D. Mnangagwa to H.E President M. Diaz-Canel Bermudez.\n\nAmong the items that the Republic of Cuba is handing over are armoured vehicles used in the historic Battle of Cuito Cuanavale; a pistol that belonged to the iconic Leader of the Cuban Revolution, Commandante Fidel Castro; and other artefacts and paraphernalia related to Cubas immense contributions to African liberation struggles.\n\nPrior to the Zimbabwean delegations departure for the Republic of Cuba on 11 January 2025, Ambassador Muzawazi described the handover as a momentous marker in the implementation of the Museum of African Liberation Project.Ambassador Muzawazi said, The Republic of Cuba played a pivotal role in the liberation and post-colonial development of Africa, and the handover of artefacts for display at the Museum of the African Liberation is a truly historic landmark in the long-standing and deep-seated ties between Cuba and Africa.\n\nSuccessive generations must be reminded that Cuba is the only non-African country that actually deployed its own troops to confront apartheid in Africa. Cubas most telling contribution to the liberation of Africa was its involvement in the Battle of Cuito Cuanavale from November 1987 to March 1988. In that battle, Cuban soldiers got into the trenches with Angolan and Namibian freedom fighters to first stop the advance of apartheid forces, and then to repel them and send them retreating like a rag-tag army back to South Africa.That colossal victory greatly weakened imperialist-backed rebels in Angola, speeded up Namibias quest for independence, and paved the way for majority rule in South Africa. Even today, the SADC region observes 23 March, which was the last day of the Battle of Cuito Cuanavale, as Southern Africa Liberation Day.\n\nBefore Cuito Cuanavale, Cuba was already supporting Africas liberation and development, with such support dating as far back as 1961 when Havana extended military and civilian assistance to the Algerian National Liberation Front. After independence, Cuba has continued to support Africa, particularly in the areas of health, education and diplomatically at international fora.Ambassador Muzawazi expressed his deep gratitude to H.E. President Dr E.D. Mnangagwa for his crucial support for the Museum Project, which had culminated in the handover of the Cuban artefacts.\n\nIn July 2022, His Excellency the President, Cde Dr E.D. Mnangagwa dispatched a delegation to Cuba to initiate discussions on cooperation on the Museum of African Liberation Project. Led by Special Envoy Ambassador Mumbengegwi, the delegation met H.E. President Diaz-Canel Bermudez, and other senior officials.\n\nThe Cuban President warmly welcomed President Mnangagwas invitation to participate in the Museum of African Liberation. There were several subsequent engagements on the matter and today we are humbled and honoured to announce that historic artefacts pertaining to Cubas contributions to African liberation will now be on display at the Museum.\n\nThe Republic of Cuba is one of three non-African countries whose flag has been raised at the Museum of African Liberation, with the other two being the Peoples Republic of China and the Russian Federation.The Museum of African Liberation in Harare is part of a 101-hectare multipurpose development known as Liberation City, which is being spearheaded by the Pan-African think tank INSTAK, with support from the Government of Zimbabwe.\n\nThough based in Zimbabwe, the Museum houses material from all African countries that waged armed struggles to liberate themselves, in addition to documenting the contributions of African and non-African countries and organisations that supported the liberation struggle politically, militarily, diplomatically and morally.The Museum of African Liberation is conceived as a monument to the epic struggle to liberate the African people from European colonialism and apartheid.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Museum-of-African-Liberation.jpg",
            "description": "In a historic milestone for the Museum of African Liberation Project, the Government of the Republic of Cuba is handing over a variety of artefacts for display at the facility, which is being constructed by the Institute of African Knowledge (INSTAK) with support from the Government of the Republic of Zimbabwe. His Excellency the President […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Bulawayo residents bear brunt of water shortages in the face of declining pumping capacities and infrastructure challenges",
            "url": "https://www.chronicle.co.zw/bulawayo-residents-bear-brunt-of-water-shortages-in-the-face-of-declining-pumping-capacities-and-infrastructure-challenges/",
            "content": "Online writer\n\nBULAWAYO residents are enduring prolonged water shortages as the city grapples with reduced pumping capacities and deteriorating infrastructure.The latest Bulawayo City Council report reveals a critical situation, with operational inefficiencies, pipeline leaks, and resource mobilisation delays compounding the issue.\n\nAccording to the report, water pumping across Bulawayo has been significantly hampered, with most facilities operating below their designed capacities.The citys water delivery is marked by fluctuating output, equipment breakdowns, and poor infrastructure maintenance. For many residents, this translates to extended periods without running water, forcing reliance on alternative sources.\n\nThe report shows pumping station performance as follows :\n\n1. Mtshabezi DamOver the last four years, water pumping from Mtshabezi has shown a declining trend. The monthly average fell significantly from 800 000m in 2020 to around 300 000m in 2024, reflecting a worrying decline in the dams reliability. Residents in areas dependent on Mtshabezi face worsening supply gaps as the dams output struggles to meet demand.\n\n2. Ncema Water Works\n\nCurrent Capacity: Produces only 40-45 ML/day, half of its design capacity of 80 ML/day.\n\nChallenges: 65 percent of filters are non-operational, limiting treatment capability. Rehabilitation efforts are underway but still in the evaluation phase.\n\nAverage Output: 32 ML/day for distribution, insufficient to meet the citys needs.\n\n3. Ncema to Fernhill and Tuli Hill Reservoirs\n\nRaw water delivered: 1 945 440m.\n\nTreated water for distribution: 913 600m.Persistent inefficiencies in water treatment and conveyance hinder optimal supply to key reservoirs.\n\n4. Nyamandlovu Aquifer\n\nAverage Daily Delivery: 5.62 ML/day.\n\nFunctional Boreholes: 33 out of 60.\n\nIssues: Frequent breakdowns and power outages limit pumping, while non-functional water meters delay monitoring and planning.A tender for meter replacement stalled due to budget shortfalls and non-responsive bids, further exacerbating inefficiencies.\n\nPipeline Leaks are also a major factor.The city reported 34 pipeline leaks in November 2024, with only 15 repaired. Major challenges include:\n\nLack of operational vehicles: Inspectors struggle to identify and repair leaks promptly.\n\nProcurement delays: Securing materials takes too long, creating a backlog of unresolved issues.\n\nDelays in plant resource allocation slow down repair efforts.\n\nThe result is a vulnerable water supply system prone to further failures, risking public safety and environmental integrity.\n\nFor residents, these challenges translate to:\n\nInconsistent Water Supply: Areas dependent on Ncema, Fernhill, and Nyamandlovu receive water intermittently, often going days without tap water.\n\nReliance on Boreholes: In areas with non-functional boreholes or limited aquifer output, residents face severe water shortages.\n\nIncreased Costs: Households may turn to costly water alternatives, straining already stretched finances.\n\nThe Bulawayo City Council must urgently address the following to alleviate the crisis:\n\n1. Expedite filter rehabilitation at Ncema to boost water treatment capacity.\n\n2. Prioritise procurement of materials and replacement of non-functional meters to restore system efficiency.\n\n3. Invest in operational vehicles for inspectors to ensure timely leak detection and repairs.\n\n4. Enhance budget allocations to address infrastructure challenges comprehensively.\n\nWithout swift action, the citys water infrastructure risks further deterioration, leaving residents to bear the brunt of an escalating water crisis.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/fdgjkghsdf.jpg",
            "description": "Online writer BULAWAYO residents are enduring prolonged water shortages as the city grapples with reduced pumping capacities and deteriorating infrastructure. The latest Bulawayo City Council report reveals a critical situation, with operational inefficiencies, pipeline leaks, and resource mobilisation delays compounding the issue. According to the report, water pumping across Bulawayo has been significantly hampered, with […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Bulawayo’s Water Crisis Deepens Amid Urban Expansion",
            "url": "https://www.chronicle.co.zw/bulawayos-water-crisis-deepens-amid-urban-expansion/",
            "content": "Online writerBULAWAYO is grappling with a severe water crisis, exacerbated by declining abstraction volumes from its supply dams and the citys rapid expansion over the past two decades.The development of new suburbs, including Cowdray Park, Emganwini, Pumula South, Mahatshula, and Selborne Park, has significantly increased the demand for water. However, the citys water supply infrastructure has struggled to keep pace, leading to acute shortages and extended water-shedding schedules.\n\nData from the latest Council report indicates a sharp decline in water abstraction volumes in 2024 compared to the years begining 2021. In April 2024, abstraction volumes fell below 4 million cubic meters, a significant drop from nearly 6 million cubic meters in April 2022. This downward trend has persisted throughout the year, raising concerns about the citys ability to meet the escalating water demand.\n\nThe expansion of suburbs such as Cowdray Park, which now hosts over 25 000 households, has placed immense pressure on the existing water supply infrastructure. The 110mm PVC pipeline serving Cowdray Park is insufficient, resulting in low water pressure and, in some cases, complete lack of access to running water for residents.\n\nIn response to the crisis, President Mnangagwa approved the formation of a 20-member Bulawayo Water Technical Committee in November 2024. Chaired by Dr Annatoria Chinyama, the committees mandate is to oversee the rapid improvement of water and sanitation services within a 100-day period. Key tasks include rehabilitating the Mzingwane Dam booster station to increase water delivery from 125 megalitres per day to 175 megalitres per day, upgrading the Cowdray Park water mainline to ensure adequate water pressure, and ensuring the sustainable operation of the Nyamandlovu Aquifer to supply 16 megalitres per day.\n\nThe Bulawayo City Council (BCC) has implemented stringent water-shedding schedules, extending cuts to 130 hours per week as of October 2024. Even previously exempted areas, such as the central business district and industrial zones, are now subjected to water cuts when power cuts and equipment breakdowns hit supply resevoirs. While these measures aim to conserve the limited water supply, they have led to residents resorting to unsafe water sources, raising public health concerns.\n\nEfforts are underway to rehabilitate critical infrastructure. The Zimbabwe National Water Authority (Zinwa) has embarked on a programme to equip and bring back on board at least 34 boreholes at the Nyamandlovu Aquifer. This initiative is expected to restore water production to 20 megalitres per day, improving supplies to some western suburbs. However, challenges such as vandalism of infrastructure have previously hampered these efforts.\n\nThe construction of Lake Gwayi-Shangani is anticipated to provide a permanent solution to Bulawayos water woes. Once completed, the dam is expected to significantly boost the citys water supply, supporting both residential needs and industrial growth. However, the project has faced delays, and its completion is crucial for the citys sustainable development.\n\nWhile the Governments interventions demonstrate a commitment to addressing the water crisis, their efficacy depends on timely implementation and maintenance. Short-term measures like water-shedding provide immediate relief but are not sustainable in the long run. Infrastructure rehabilitation offers medium-term solutions but requires protection against vandalism and consistent funding. The success of the Lake Gwayi-Shangani project is pivotal for a long-term resolution but hinges on overcoming logistical and financial challenges.\n\nBulawayos water crisis is a multifaceted challenge intensified by urban expansion and declining water abstraction. A combination of short-term, medium-term, and long-term interventions is essential to ensure a consistent and safe water supply for the citys residents. The timely execution and maintenance of these measures, along with community engagement in water conservation, are critical to mitigating the crisis and supporting Bulawayos growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gvdfff.jpg",
            "description": "Online writer BULAWAYO is grappling with a severe water crisis, exacerbated by declining abstraction volumes from its supply dams and the city’s rapid expansion over the past two decades. The development of new suburbs, including Cowdray Park, Emganwini, Pumula South, Mahatshula, and Selborne Park, has significantly increased the demand for water. However, the city’s water […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Bulawayo City Council approves transfer of historical records to National Archives",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-approves-transfer-of-historical-records-to-national-archives/",
            "content": "Online Writer\n\nTHE Bulawayo City Council has approved the transfer of archival records from the Chamber Secretarys registry to the National Archives of Zimbabwe.The resolution, passed on 3 December 2024, aligns with the National Archives Act (1986), which encourages Government bodies and parastatals to utilise the National Archives storage facilities to improve record management.\n\nThe Chamber Secretary, Mrs Sikhangele Zhou, reported that the move aims to optimise storage space and enhance functionality within the registry. The transferred records, described as dead staff files from 1958 to 2008, have outlived their operational purpose and are no longer of value to the organisation. The total volume of records amounts to 62 cubic feet, packed into 62 boxes, each measuring one cubic foot.\n\nKey reasons for the transfer include:\n\n1. Creating More Storage Space: The registry requires additional capacity to manage the daily creation of new records.\n\n2. Decommissioning Redundant Records: Files that have served their purpose will be archived to prioritise functional resources.\n\n3. Improving Workspace Efficiency: Decongesting the registry is expected to enhance operational efficiency.\n\nThe council granted permission for the records transfer, ensuring their preservation and accessibility at the National Archives high-density storage facilities. This marks a proactive step in record management and historical preservation in line with legislative guidelines.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/BCC-LOGO.jpg",
            "description": "Online Writer THE Bulawayo City Council has approved the transfer of archival records from the Chamber Secretary’s registry to the National Archives of Zimbabwe. The resolution, passed on 3 December 2024, aligns with the National Archives Act (1986), which encourages Government bodies and parastatals to utilise the National Archives’ storage facilities to improve record management. […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Man (68) rapes 8-year-old neighbour",
            "url": "https://www.chronicle.co.zw/man-68-rapes-8-year-old-neighbour/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nA 68-YEAR-OLD grandfatherly figure from Dzivarasekwa, Harare, has been sentenced to 15 years behind bars for the heinous crime of raping his 8-year-old neighbor.\n\nOn 7 October 2024, the perpetrator seized the girl (8) while she was walking with a friend to collect water from a nearby borehole, and dragged her into his house.\n\nIn an official statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, While inside the house, he fondled the complainant, ordered her to undress before he raped her. The complainant narrated her ordeal to the friend who told the elders.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/gavel-rape.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A 68-YEAR-OLD grandfatherly figure from Dzivarasekwa, Harare, has been sentenced to 15 years behind bars for the heinous crime of raping his 8-year-old neighbor. On 7 October 2024, the perpetrator seized the girl (8) while she was walking with a friend to collect water from a nearby borehole, and dragged her into […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Man kidnaps, indecently assaults tot on Christmas Eve",
            "url": "https://www.chronicle.co.zw/man-kidnaps-indecently-assaults-tot-on-christmas-eve/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nA 21-YEAR-OLD man from Shurugwi has been sentenced to 4 years in prison for kidnapping and indecently assaulting a 3-year-old girl.\n\nOn 24 December 2024, a 3-year-old girl was seized by the accused while playing with a group of children. He held the girl captive for approximately 30 minutes, without her parents knowledge or consent.After receiving disturbing information, the girls father swiftly launched an investigation to locate his daughter.In an official statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said,  found the complainant standing naked, wearing the offenders necklace. The offender ran away leaving his cellphone behind. The matter was reported to the police, leading to the arrest of the accused person. The offender was sentenced to an effective 4 years in prison.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A 21-YEAR-OLD man from Shurugwi has been sentenced to 4 years in prison for kidnapping and indecently assaulting a 3-year-old girl. On 24 December 2024, a 3-year-old girl was seized by the accused while playing with a group of children. He held the girl captive for approximately 30 minutes, without her parents’ […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "Liberation War Heroine burial set for Nkulumane Heroes Acre",
            "url": "https://www.chronicle.co.zw/liberation-war-heroine-burial-set-for-nkulumane-heroes-acre/",
            "content": "Trish Mukwazo\n\nCDE Sinikiwe Ndlovu, who recently passed away at Mpilo Hospital in Bulawayo, has been conferred with Liberation War Heroine status. She will be laid to rest on Monday, 13 January, at the Provincial Heroes Acre in Nkulumane.\n\nCde Ndlovu, affectionately known as Sanele Nyathi during the armed struggle, died at the age of 65. She resided in Nkulumane 12 suburb.\n\nIn a statement, Zanu PF Bulawayo Provincial Chairman, Cde Jabulani Sibanda, confirmed her status.\n\nThis letter serves to confirm that the late Cde Sinikiwe Ndlovu has been declared a liberation war heroine. She passed away on 7 January 2024 at Mpilo Hospital in Bulawayo and will be buried at Nkulumane Heroes Acre, Bulawayo, on 13 January 2024, he said.\n\nCde Ndlovu left Rhodesia in April 1977, heading to Selebi-Phikwe Camp in Botswana under Commander Smart Sibanda. She was later transferred to Lusaka, Zambia, at the VC Transit Camp, where she underwent primary military training in the First Battalion Detachment.\n\nShe mastered guerrilla tactics, including judo, crawling, rolling, toi toi, and singing freedom songs, among other exercises. Unfortunately, she could not graduate at Mkushi Training Centre, as the last group was bombed by the Smith Regime. Following the ceasefire, she received repatriation forms and returned to Zimbabwe, said Cde Sibanda.\n\nUpon her return to Luveve at Thembiso Childrens Home, Cde Ndlovu met her husband, former freedom fighter Leonard Ndlovu, and the couple had five children.\n\nShe is survived by her husband, three children, and four grandchildren, added Cde Sibanda.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/04/Bulawayo-Provincial-Heroes’-Acre-in-Nkulumane.jpg",
            "description": "Trish Mukwazo CDE Sinikiwe Ndlovu, who recently passed away at Mpilo Hospital in Bulawayo, has been conferred with Liberation War Heroine status. She will be laid to rest on Monday, 13 January, at the Provincial Heroes’ Acre in Nkulumane. Cde Ndlovu, affectionately known as Sanele Nyathi during the armed struggle, died at the age of […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        },
        {
            "title": "‘Expect new way of doing business’",
            "url": "https://www.chronicle.co.zw/expect-new-way-of-doing-business/",
            "content": "Africa Moyo, Harare Bureau\n\nZIMBABWEANS should expect to see a marked change in the way the Second Republic conducts its business this year, as all systems are being improved to respond to the peoples needs, Acting President Kembo Mohadi said yesterday.\n\nIn an interview at his offices in Harare, the Acting President said 2025 promised to be exciting on the back of the current wet spell being experienced across the country, giving hope for a good cropping season and pastures for livestock.\n\nHigh impact projects such as dam and road construction, together with provision of decent and affordable housing, would be continued, he added.\n\nWe are all enthused about the prospects for the year. The Gods have smiled on us. We are receiving rain which is good for our crops and pastures, said Acting President Mohadi.\n\nActing President K. Mohadi\n\nI am happy to inform the nation that the Whole-of-Government remains steadfast on President Mnangagwas commitment to realise his Vision 2030 for Zimbabwe. Even as the President is on leave, we are busy fine-tuning the Whole-of-Government architecture, to be responsive to the needs of the people. It cannot be business as usual. You will see marked changes in the way we conduct business.\n\nThe good rains were expected to help the country save a lot of money that would ordinarily go towards making sure extra food reached a lot of people who would have lost their crops, as well as the cost of imports.\n\nWith prospects of a decent harvest, extra funds will now be channelled towards development, which has been the hallmark of the Second Republic led by President Mnangagwa since 2018. In the last summer cropping season, Zimbabwes yields were affected by the erratic rains due to the El Nino weather phenomenon, resulting in Government funds being used to provide grain for many rural families and cash allowances for the poorest of the urban families as a result Presidents call of ensuring that no one should starve. Acting President Mohadi said the Government needed the hunter spirit in its operations, adding that sufficient preparations for a successful year have been made, riding on the milestones achieved last year. Asked if last year was a success, he said: Depending on how you view it yourselves, I would describe 2024 as a year in which as Government, we took bold and decisive decisions to pursue and consolidate our development thrust towards the attainment of Vision 2030.\n\nPresident Mnangagwa\n\nLast year many achievements were recorded in terms of economic stabilisation, health sector improvement, commendable regional contributions and good performances in the agricultural sector, among other milestones.\n\nOn economic reforms, Acting President Mohadi said Government, through the Reserve Bank of Zimbabwe (RBZ), introduced the Zimbabwe Gold (ZiG) currency to replace the Zimbabwe dollar.\n\nThis move stabilised the economy, as it laid the foundation for sustained economic growth, he said, reiterating that no country in the world can develop without its own currency.\n\nTurning to infrastructure development, Acting President Mohadi said the impact of last years severe drought affected progress on many fronts, including infrastructure development as resources had to be diverted towards mitigating the effects of drought.\n\nHowever, Zimbabwe completed 520km of the Harare-Beitbridge Highway and 1 500km of road rehabilitation.\n\nZimbabwe Gold\n\nWe also saw the commissioning of the new Robert Gabriel Mugabe International Airport by His Excellency (President Mnangagwa), which increased the airports passenger capacity.\n\nOn digital transformation, the major development was the licensing of Starlink, a satellite internet service in the country.\n\nThe coming of Starlink, said Acting President Mohadi, was an acknowledgement of the information sector as a major contributor to the economy.\n\nFollowing the investments by other local companies and the coming of Starlink, overall internet penetration increased from 63 percent in 2023 to the present levels of 75 percent in 2024.\n\nIn the agricultural sector, Zimbabwe set a new wheat harvest record after attaining over 550 000 tonnes following heavy investments in irrigation while farmers were provided uninterrupted electricity supply.\n\nActing President Mohadi said another bold and decisive step of the Government last year was the issuing of new land title deeds that give indigenous farmers direct ownership of their land, allowing them to use the land as collateral for loans or sell it for investment.\n\nPresident Mnangagwa launched the new land title deeds programme at Precabe Farm on December 20, with the first beneficiaries receiving their title deeds.\n\nOn the political front, the country remained peaceful, despite unfounded reports of divisions in some sections of the media.\n\nAs a people we have remained united. The divisions we hear about, if any, are those we read from newspapers and social media.\n\nThe year 2024, saw the successful launch of the Gukurahundi Community Engagement Outreach by the President, His Excellency Dr Mnangagwa. This initiative seeks to address the historical grievances arising from the Gukurahundi disturbances.\n\nThis programme, spearheaded by our traditional leaders, identifies individuals and communities directly and indirectly affected, captures their views, and establishes community-led solutions to their grievances. Their involvement ensures that the process is inclusive, culturally sensitive, and reflective of the aspirations of affected communities, he said.\n\nZimbabwe also hosted a successful 44th SADC Summit in Harare in August, attracting a record number of delegates from the region.\n\nIn November, Zimbabwe also hosted an Extraordinary Sadc Summit to resolve some emerging issues in the region.\n\nActing President Mohadi said as Zimbabwe continued to assert its leadership role within SADC, several milestones were achieved including regional integration, peace and sustainable development.\n\nOn the health front, Government procured cancer machines for Parirenyatwa and Mpilo hospitals and also implemented a basic diagnostic tool for village health workers to screen and diagnose basic conditions.\n\nIn response to concerns from many football fans where the national football team, the Warriors, has been staging its home games in other countries, Acting President Mohadi said Government is now finalising the long-awaited installation of the bucket seats at the National Sports Stadium.\n\nOther sporting facilities such as Magamba, will be modernised.\n\nActing President Mohadi added that as a proud Zanu PF cadre, it would be amiss for him to discuss political developments in the country without acknowledging his partys role.\n\nThe revolutionary party, he said, held a successful 21st Zanu PF Annual National Peoples Conference in Bulawayo in October.\n\nZANU-PF\n\nThis is a pivotal event in our partys calendar and the highest expression of democracy within Zanu PF.\n\nThe conference allowed us to reflect on our achievements and identify areas where we need to improve as a Government.\n\nImportantly, the resolutions adopted were rooted in the aspirations and voices of the people, he said.\n\nTurning to his own health, Acting President Mohadi, who was said to be unwell on social media, dismissed the reports.\n\nArriving for the interview earlier, he asked photographers if they needed his pictures before letting them embark on a five minute photo shoot.\n\nThe Acting President then asked them, jokingly, if they needed more time, to which they said they were fine.\n\nLater in his address, he referred to the social media allegations of ill health, and scoffed at claims he was in India to seek medical attention.\n\nActing President Mohadi said by being at the media engagement, that should dispel reports he was battling for his life.\n\n",
            "image_url": null,
            "description": "Africa Moyo, Harare Bureau ZIMBABWEANS should expect to see a marked change in the way the Second Republic conducts its business this year, as all systems are being improved to respond to the people’s needs, Acting President Kembo Mohadi said yesterday. In an interview at his offices in Harare, the Acting President said 2025 promised […]",
            "time": "18:27",
            "date": "12 Jan 2025"
        }
    ]
}