{
    "news": [
        {
            "title": "Man battles for life at Mpilo Hospital after hooked wire stabbing",
            "url": "https://www.chronicle.co.zw/man-battles-for-life-at-mpilo-hospital-after-hooked-wire-stabbing/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 45-year-old Bulawayo man who allegedly stabbed his neighbour with a hooked wire used to repair shoes over a misunderstanding had been dragged to court facing attempted murder charges.Mbuso Ncube of Pumula South suburb appeared before Western Commonage Regional magistrate, Mrs Sibongile Marondedze, who remanded him in custody to March 5.The incident occurred on 16 February at a car park in Nkulumane and left the victim, Mr Romeo Farai, nursing severe injuries on the chest and a bruised face.Prosecuting, Ms Christine Manyika, told the court that the incident happened at around 8pm when Ncube started assaulting Mr Farai as he was going home and later on stabbed him twice on the chest.\n\nAs Mr Farai was walking he met Ncube on the way who slapped him and hurled insults. He suddenly took a hooked wire used to repair shoes out of his pockets and stabbed him twice on the left side of the chest, said Ms Manyika.Mr Farai is still at Mpilo Central Hospital where he is receiving medical attention.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/Court.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 45-year-old Bulawayo man who allegedly stabbed his neighbour with a hooked wire used to repair shoes over a misunderstanding had been dragged to court facing attempted murder charges. Mbuso Ncube of Pumula South suburb appeared before Western Commonage Regional magistrate, Mrs Sibongile Marondedze, who remanded him in custody to March 5. […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "Elderly driver collapses and dies after crashing into street curb in Bulawayo",
            "url": "https://www.chronicle.co.zw/elderly-driver-collapses-and-dies-after-crashing-into-street-curb-in-bulawayo/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nAn elderly man collapsed and died at the corner of Herbert Chitepo Street and Fifth Avenue in a suspected case of sudden death on Thursday afternoon.\n\nEyewitnesses said the elderly man was driving a white Nissan pick-up vehicle when it suddenly rammed into a street curb.\n\nVendors rushed to the scene to see what was happening, and the man reportedly signalled to them that he was in distress.\n\nThe vendors helped him out of his vehicle, which had come to a stop after hitting the street curb.\n\nWe helped him out of the car, and he indicated that he was diabetic and was in distress. We laid him on the ground to help him rest, but he started convulsing, said one of the vendors.\n\nPolice declared the man dead on arrival.\n\nWhen Chronicle arrived at the scene, police were collecting the body to take it to a local mortuary.\n\nThe vehicle that the deceased was driving was still at the scene, as his next of kin had not yet been notified.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dies.jpg",
            "description": "  Raymond Jaravaza, raymondjaravaza@gmail.com An elderly man collapsed and died at the corner of Herbert Chitepo Street and Fifth Avenue in a suspected case of sudden death on Thursday afternoon. Eyewitnesses said the elderly man was driving a white Nissan pick-up vehicle when it suddenly rammed into a street curb. Vendors rushed to the scene […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "Awa Khiwe on reviving local content in the shadow of South African influence",
            "url": "https://www.chronicle.co.zw/awa-khiwe-on-reviving-local-content-in-the-shadow-of-south-african-influence/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nGermany-based hip-hop artiste Awakhiwe Sibanda, known as Awa Khiwe, has emerged as a powerful voice articulating the decline of local content knowledge in Zimbabwe, particularly in her hometown of Nkayi, Matabeleland North.\n\nReflecting on her upbringing, Awa recalled a childhood shaped by limited access to local media, stating, Growing up eNkayi we did not have access to ZBC; my father bought a satellite dish in 2002. From then on, I consumed South African content daily, while local shows like Studio 263 and Amakorokoza were merely whispers from my cousins.\n\nThe Rap Gandaganda hit-maker lamented the missed opportunities for local content to instil pride and identity, imagining a world where children learn about Zimbabwes diverse languages and cultures through engaging programming.\n\nIf only we had Zim content, it could have been a powerful tool, she said, envisioning educational shows similar to Sesame Street that celebrate local heritage.\n\nWith limited access to galas and local events, Awa reflected on how many young people in Zimbabwe, like herself, grew up believing that local content was non-existent. The allure of relatable South African media led to a generation that often overlooked its own artistic talent.\n\nI think a lot of people had a similar childhoodwe found it so relatable, she continued.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/kjki.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Germany-based hip-hop artiste Awakhiwe Sibanda, known as Awa Khiwe, has emerged as a powerful voice articulating the decline of local content knowledge in Zimbabwe, particularly in her hometown of Nkayi, Matabeleland North. Reflecting on her upbringing, Awa recalled a childhood shaped by limited access to local media, stating, “Growing up eNkayi we […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "Duo in court for fraudulently using dead man’s property as collateral",
            "url": "https://www.chronicle.co.zw/duo-in-court-for-fraudulently-using-dead-mans-property-as-collateral/",
            "content": "Trish Mukwazo,[emailprotected]\n\nTWO men appeared in court accused of defrauding CBZ Bank of US$41 000 through misrepresentation during a loan application where they tendered title deeds of a property belonging to a dead person.Anoop Ranmanlal Desai who the director of Phenduka Supplies Pvt Ltd and Prosper Moyo, son of the deceased whose title deeds were tendered, appeared in court on Wednesday facing charges of fraud.The duo denied the allegations and will appear in court on 25 February for the continuation of the trial. The State opened its case by leading two witnesses and paperwork was produced in court as evidence.Prosecutor, Ms Nomthandazo Mafu, told the court that on 6 July 2016 the duo working with Rahmiben Tharolbual Desai who is on the run, approached CBZ Bank to apply for a loan on behalf of Phenduka Supplies Pvt Ltd.The accused persons presented title deeds for a property registered under the late John Nkonyane Moyo as collateral. The accused were given guarantor forms to be signed by John Nkonyane Moyo, she said.They returned the documents to CBZ Bank purportedly signed by John Nkonyane Moyo well knowing that John Nkonyane Moyo was deceased.CBZ Bank processed the loan application forms based on the provided documents and the application was approved, and Phenduka Supplies Pvt Ltd was availed a loan of USD$30,000.00 in 2016, which was credited into CBZ Bank account number 026023699010014 belonging to Phenduka Supplies Pvt Ltd, said Ms Mafu.The court heard that CBZ Bank went on to register a mortgage bond for US$41 000. After failure to pay the loan by Anoop Desai, the loan was downgraded to recoveries in 2019.Whilst CBZ was in the process of instituting the property that is when they discovered that the property belonged to a dead person and could not be auctioned.Due to the accused persons actions the bank suffered an actual prejudice of US$30 000 actual loan disbursed plus US$11 000 interest accrued, the court heard.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/02/fraud.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com TWO men appeared in court accused of defrauding CBZ Bank of US$41 000 through misrepresentation during a loan application where they tendered title deeds of a property belonging to a dead person. Anoop Ranmanlal Desai who the director of Phenduka Supplies Pvt Ltd and Prosper Moyo, son of the deceased whose title […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "Zimbabwe commits to enhancing ease of doing business, boosting competitiveness",
            "url": "https://www.chronicle.co.zw/zimbabwe-commits-to-enhancing-ease-of-doing-business-boosting-competitiveness/",
            "content": "Rutendo Nyeve, Sunday News Reporter\n\nIN a bid to accelerate Zimbabwes economic transformation, the Ministry of Industry and Commerce has reaffirmed its dedication to implementing President Mnangagwas directive to enhance the ease of doing business, emphasising the pivotal role of competitiveness in driving sustainable economic growth.\n\nSpeaking at the official opening of the National Competitiveness Commissions (NCC) Inaugural Competitiveness Summit at the Zimbabwe International Exhibition Centre, Minister of Industry and Commerce Mangaliso Ndlovu outlined the Governments commitment to fostering a competitive and business-friendly environment.\n\nMinister Ndlovu stressed that competitiveness remains a cornerstone for achieving national growth and long-term sustainability.\n\nCompetitiveness is a key driver of sustainable economic growth. Zimbabwes efforts to achieve Vision 2030 of becoming a prosperous, empowered upper-middle-income society hinge on creating a conducive business environment, said Minister Ndlovu.\n\nMinister Ndlovu praised President Mnangagwas unwavering support for economic transformation, industrial growth, and private sector development, noting that the Presidents leadership has been instrumental in inspiring national efforts to position Zimbabwe as a globally competitive economy.\n\nThe Presidents dedication to economic prosperity, sustainable industrialisation, and private sector development aligns with our collective vision of transforming Zimbabwe into a globally competitive economy, said Minister Ndlovu.\n\nThe summit comes just a week after President Mnangagwa issued a directive to his ministers to address the challenges faced by businesses due to bureaucratic red tape, exorbitant fees, and over-regulation.\n\nIn his speech, Minister Ndlovu reiterated the Presidents call for a streamlined business environment, emphasising the need to remove barriers that hinder both local and foreign investments.\n\nTo enhance the overall performance of our economy, the ease of doing business continues to be an important aspect of our programming, Ndlovu stated, quoting the President.\n\nConcerted efforts must be made to revisit all areas that hinder the start and growth of investments. Businesses should not suffer from limited regulations, punitive administrative licenses, or excessive fees. These measures should instead promote economic development and improve the livelihoods of our people.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/erf.jpg",
            "description": "Rutendo Nyeve, Sunday News Reporter IN a bid to accelerate Zimbabwe’s economic transformation, the Ministry of Industry and Commerce has reaffirmed its dedication to implementing President Mnangagwa’s directive to enhance the ease of doing business, emphasising the pivotal role of competitiveness in driving sustainable economic growth. Speaking at the official opening of the National Competitiveness […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "BAC Leisure kicks off 2025 with Jah Master, Etherton B performances",
            "url": "https://www.chronicle.co.zw/bac-leisure-kicks-off-2025-with-jah-master-etherton-b-performances/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nAs Zimbabwe commemorates National Youth Day on Friday, Zimdancehall sensation Jah Master and veteran DJ Etherton B are set to descend on Bulawayo, the host city, for a performance at BAC Leisure.\n\nJah Master\n\nThe duo will be part of the Shorts & Slay event on Saturday, sharing the stage with Young Gemini, Fab G Umshanakagogo, Browny, Band Fusion, and Cardy B. The nights entertainment will be further amplified by a line-up of DJs, including CP, Sweeto, FF Mofy, Blaze, Aunty Tev, Teekay, Offswag, Kaysdeep, Kanando, and Meyah Meyah.\n\nBAC Leisure, known for hosting Band Fusions live performances every Saturday, is kick-starting the year with a vibrant schedule aimed at catering to its diverse clientele.\n\nIts manager Tawanda Muchechete said they are pulling out all the stops to revive the venues status as a top entertainment hub.BAC Leisure is the place to be this year. We have introduced exciting specials, and as a token of appreciation, we will be offering free entry to birthday celebrants every month. We kick-start this with February babies getting free entry on February 22 during Short and Slay: Ladies and Gents, said Muchechete.\n\nHe encouraged fun lovers to gear up for a year of unforgettable experiences at BAC Leisure.\n\n@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/6ti-1.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com As Zimbabwe commemorates National Youth Day on Friday, Zimdancehall sensation Jah Master and veteran DJ Etherton B are set to descend on Bulawayo, the host city, for a performance at BAC Leisure. The duo will be part of the “Shorts & Slay” event on Saturday, sharing the stage with Young Gemini, Fab […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "Fresh venue, fresh line-up, National Arts Merit Awards embrace change",
            "url": "https://www.chronicle.co.zw/fresh-venue-fresh-line-up-national-arts-merit-awards-embrace-change/",
            "content": "Showbiz Reporter\n\nThe 23rd edition of the National Arts Merit Awards (Nama) is set to take place on March 1 with an exciting line-up of artistes ready to entertain guests.\n\nFor the first time, the prestigious event will be held at the Harare Hippodrome, marking a shift from the 7 Arts Theatre, which had long been the home of the awards.Following an extensive search for a venue that would allow us to showcase and bring to life our theme, #Afrofuturism, Nama is excited to host the event at a new venue for the very first time, event organisers said in a statement.\n\nIn line with the #Afrofuturism theme, the line-up features a diverse mix of performers, including Hwinza, Nisha Ts, Oriyano, Shashl, Atenda Chinx, Bagga, Sylent Nqo, Probeatz, Misheck Mahendere, Joyful Praise Choir, The Choice Childrens Choir, and Denilson the Saxophonist.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/6ti.jpg",
            "description": "Showbiz Reporter The 23rd edition of the National Arts Merit Awards (Nama) is set to take place on March 1 with an exciting line-up of artistes ready to entertain guests. For the first time, the prestigious event will be held at the Harare Hippodrome, marking a shift from the 7 Arts Theatre, which had long […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "Collaboration between Government and private sector critical: ZNCC",
            "url": "https://www.chronicle.co.zw/collaboration-between-government-and-private-sector-critical-zncc/",
            "content": "Judith Phiri, Business Reporter\n\nThe Zimbabwe National Chamber of Commerce (ZNCC) has emphasized the importance of continued collaboration between the Government and the private sector, highlighting that a competitive environment is essential for the success of Zimbabwean businesses.\n\nDelivering the vote of thanks at the inaugural two-day National Competitiveness Commission (NCC) Competitiveness Summit held at the Zimbabwe International Exhibition Centre in Bulawayo, ZNCC CEO Mr Christopher Mugaga noted that a competitive environment where businesses can thrive and survive is important for economic growth.\n\nHe said collaboration between the Government and private sector is critical, while there is a need to address the regulatory environment for competitiveness.\n\nMr Mugaga called upon all stakeholders both private and public to take competitiveness seriously in the face of the AFCFTA which calls for a borderless Africa.\n\nHe said as the country celebrates the National Youth Day Commemoration tomorrow it was also important for young people to understand the aspects of competitiveness.\n\nThe Summit is running under the theme: Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/erf.jpg",
            "description": "Judith Phiri, Business Reporter The Zimbabwe National Chamber of Commerce (ZNCC) has emphasized the importance of continued collaboration between the Government and the private sector, highlighting that a competitive environment is essential for the success of Zimbabwean businesses. Delivering the vote of thanks at the inaugural two-day National Competitiveness Commission (NCC) Competitiveness Summit held at […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "President Mnangagwa unveils NDS2 plan: Value Addition and Industrialisation to drive economic growth",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-unveils-nds2-plan-value-addition-and-industrialisation-to-drive-economic-growt/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPresident Mnangagwa has announced that the upcoming National Development Strategy 2 (NDS2) will focus on value addition and industrialisation, to increase the manufacturing sectors value from the current US$4 billion to over US$10 billion.Speaking at the inaugural Competitiveness Summit in Bulawayo, President Mnangagwa highlighted the transition from the first edition of the National Development Strategy, which concludes in 2025, to its successor, NDS2.As you are aware, the first edition of the National Development Strategy is coming to an end in 2025.Efforts are underway to develop the successor program, the National Development Strategy 2. The NDS2 will prioritize value addition and industrialisation, but put leverage on the manufacturing sector.The aim is to increase the sectors value from the current US$4 billion to over US$10 billion through a strategic focus on value chains in the different sectors, said President Mnangagwa.He commended the National Competitiveness Commission for organizing the summit, emphasising its role as a key institution in fostering a competitive economic environment in Zimbabwe.The summit runs under the theme: Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/DXFGVD.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw President Mnangagwa has announced that the upcoming National Development Strategy 2 (NDS2) will focus on value addition and industrialisation, to increase the manufacturing sector’s value from the current US$4 billion to over US$10 billion. Speaking at the inaugural Competitiveness Summit in Bulawayo, President Mnangagwa highlighted the transition from the first edition of […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        },
        {
            "title": "VP Chiwenga commends President Mnangagwa for Advancing Zimbabwe’s global competitiveness",
            "url": "https://www.chronicle.co.zw/vp-chiwenga-commends-president-mnangagwa-for-advancing-zimbabwes-global-competitiveness/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nVICE President Constantino Chiwenga has praised President Mnangagwa for consistently championing efforts to enhance Zimbabwes global competitiveness.Speaking at the inaugural Competitiveness Summit in Bulawayo, Dr Chiwenga emphasized the Presidents commitment to economic transformation.The summit runs under the theme: Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.Distinguished guests, ladies and gentlemen, it is gratifying that our guest of honour has consistently championed the improvement of Zimbabwes global competitive place, he said.VP Chiwenga noted the transformative journey the country has undertaken under President Mnangagwas leadership, focusing on productivity, ease of doing business, and fostering an investment-friendly environment.Under his dynamic and result-oriented leadership, the country has embarked on a transformative journey focusing on boosting productivity, enhancing the ease of doing business, and fostering an ecosystem that attracts both domestic and foreign investment, said the Vice President.He noted that the summits theme aligns with President Mnangagwas commitment to sustainable, inclusive, and equitable economic growth as outlined in National Development Strategy 1.This trajectory will continue to inform and guide us into a National Development Strategy 2, he added.VP Chiwenga further commended the President for spearheading various initiatives to enhance the countrys competitiveness, including the Competitiveness Summit itself.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/UYIK.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw VICE President Constantino Chiwenga has praised President Mnangagwa for consistently championing efforts to enhance Zimbabwe’s global competitiveness. Speaking at the inaugural Competitiveness Summit in Bulawayo, Dr Chiwenga emphasized the President’s commitment to economic transformation. The summit runs under the theme: “Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.” “Distinguished guests, ladies […]",
            "time": "18:42",
            "date": "20 Feb 2025"
        }
    ]
}