{
    "news": [
        {
            "title": "Infrastructure boom powers national Uhuru celebrations",
            "url": "https://www.chronicle.co.zw/infrastructure-boom-powers-national-uhuru-celebrations/",
            "content": "Patrick Chitumba,[emailprotected]\n\nNEMBUDZIYA Open Grounds is becoming a confluence of progress in Gokwe North.The sites rapid development, in preparation for the 45th Independence Day celebrations and the Uhuru Cup final, exemplifies this years theme Zim @ 45: Devolve and Develop Together Towards Vision 2030 ethos.\n\nThe convergence of national celebration and infrastructural advancement is set to leave a lasting mark, with over 100 000 participating in this historic moment.\n\nLeading up to the main celebrations, the Childrens Party, hosted by the First Family is scheduled for April 17 at Nyamuroro High School, with the Independence Gala taking place at Nembudziya Government High School on the same evening.Over 3 000 child delegates will be accommodated at Nyamuroro High School from April 15th to 19th.\n\nMajor infrastructure projects are progressing well at the principal event arena, the gala site, and the Childrens Party venue.The Government has drilled over 120 boreholes across Gokwe North and South, including those at the event sites.\n\nThe celebrations will feature the lighting of the Independence Flame, the traditional Torch Relay, and a variety of cultural performances by dance troupes and artistes from Kwekwe, Gokwe, and other districts.\n\nFootball enthusiasts can look forward to matches between Simba Bhora and FC Platinum during the main celebrations, while Herentals Queens and Black Rhinos will play at the Childrens Party.\n\nIn previous years, Harare has been the host of the national festivities, but under the Second Republic, President Mnangagwa has directed that the commemorations be rotated across the different provinces, aligning with his administrations vision of leaving no one and no place behind.\n\nRotating the celebrations ensures that all regions of the country benefit from the legacy projects associated with hosting the main event.\n\nEngineer Akim Maravira, Director of the Ministry of Local Government and Public Works, confidently said that key infrastructure projects are well beyond the halfway mark, guaranteeing the event.\n\nEveryone is busy here in Gokwe Nembudziya, where the 2025 Independence Day Celebrations will be held. We have accelerated our pace, and works are at 75 percent completion, with a target of April 10th for all works to be finalised, he said.\n\nOne of the road contractors, Mr Benny Majoni, confirmed that the road connecting Kadoma, Sanyati, and Nembudziya is currently under rehabilitation, with works progressing rapidly.\n\nWe are working on the Kadoma-Sanyati road and are progressing well. We are pleased that this years Independence Day Celebrations will be held in our area for the first time, thanks to the Second Republic, he said.Local youths and the community have welcomed the developments, praising the Second Republics inclusive development agenda.\n\nWe thank the Government for creating employment for us; roads are being rehabilitated, and the area has been upgraded, thanks to the Second Republic for adhering to the mantra of leaving no one and no place behind, said Mr Amon Ncube.Last week, Zanu-PF Midlands Provincial party chairperson, Cde Edson Chiherenge, noted the significant progress in Gokwe North District.\n\nThe Independence Day celebrations have brought with them substantial development in Gokwe North and South Districts. As of today (Thursday), most projects are at 70 percent completion as we approach the April 18th celebrations, he stated.\n\nCde Chiherenge emphasised that the Government is constructing two state-of-the-art boys and girls hostels at Nyamuroro Secondary School, the venue for the Childrens Party. Furthermore, the celebrations will include the commissioning of a state-of-the-art nursing school at Nembudziya District Hospital.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/z88.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw NEMBUDZIYA Open Grounds is becoming a confluence of progress in Gokwe North. The site’s rapid development, in preparation for the 45th Independence Day celebrations and the Uhuru Cup final, exemplifies this year’s theme “Zim @ 45: Devolve and Develop Together Towards Vision 2030” ethos. The convergence of national celebration and infrastructural advancement […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "11-year-old drowns in Mazayi river",
            "url": "https://www.chronicle.co.zw/11-year-old-drowns-in-mazayi-river/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE news hit Mr Clement Ndlovu like a physical blow  his 11-year-old son, Joseph Randy Mpofu  had drowned in a pool of water beneath a bridge in Richmond suburb.\n\nThe short distance between his home and the scene of the tragedy stretched out, an agonisingly long run, the longest of his life.A whirlwind of conflicting emotions surged through him as he sprinted the half-kilometre to Sikokiyana Bridge on Mazayi River. He desperately yearned to find his son alive, clinging to hope, yet simultaneously dreaded the inevitable  that he would find him gone.\n\nThe schoolboy had been walking home from nearby Aisleby Farm School with friends on Thursday afternoon, around 3PM, when tragedy struck.\n\nI received a call that Randy had drowned while playing with friends on the bridge they cross every day to and from school. I ran to the bridge, praying that I would find my son alive, but I was also terrified that it was too late, Mr Ndlovu recounted to Chronicle.\n\nRandy is expected be buried in Matopo today.Randy, a Grade 5 pupil at Aisleby Farm School, was the middle child, with two sisters. Mr Ndlovu is struggling to comprehend how his son could have fallen from the bridge, which was not overflowing, and drowned in a pool of water a few metres away in the Mazayi River.\n\nClement Ndlovu, father of the late Randy shows the pool where his child allegedly drowned on his way home from school on Thursday afternoon\n\nThe boys school shoes and jersey were found in his bag on the dry concrete bridge.His friends said that when Randy fell into the water, they initially thought he was just playing around and called for him to come out so they could go home. They realised something was wrong when Randy started flailing his arms and then disappeared beneath the surface, he explained.\n\nThe boys screamed for help, and an elderly man who responded to their cries raised the alarm with other Richmond residents. By the time Ndlovu arrived at the scene with two other residents, it was tragically too late to save the boy, whose body remained submerged.\n\nThe area where the boy drowned is choked with water hyacinth, a floating invasive plant that disrupts freshwater ecosystems by smothering native vegetation and impeding the flow of water in rivers and streams.\n\nThe Bulawayo Fire Brigade was called to the scene and retrieved the body.We received a call at 15:38 hours about a drowning incident, and the crew arrived on scene at 15:53 hours. The body of an 11-year-old boy was retrieved from Sikokiyana Bridge. The Fire Brigade continues to urge the public to stay away from water bodies, said Bulawayo Fire Brigade chief fire officer Mhlangano Moyo.\n\nLast month, three-year-old Sibusiso Methembe Ndlovu died after being swept away by flash floods near his home in New Lobengula suburb. The boy was carried away by strong currents after falling into a storm drainage system. His lifeless body was found several metres away in a ditch from the storm drain where he was swept away.\n\nThe Civil Protection Unit (CPU) has also urged people to exercise caution during heavy rains and to keep a close eye on children, especially near storm drains, rivers, streams, and flooded areas.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/53tg.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com THE news hit Mr Clement Ndlovu like a physical blow — his 11-year-old son, Joseph Randy Mpofu — had drowned in a pool of water beneath a bridge in Richmond suburb. The short distance between his home and the scene of the tragedy stretched out, an agonisingly long run, the longest of […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Alarm over mismanagement at US$3,5 million Bubi Milling Centre",
            "url": "https://www.chronicle.co.zw/alarm-over-mismanagement-at-us35-million-bubi-milling-centre/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Parliamentary Portfolio Committee for Mines and Mining Development has voiced serious concerns regarding the mismanagement of the Bubi Milling Centre, a facility established in 2018 to benefit small-scale miners and the wider community.\n\nFunded to the tune of US$3,5 million, the centre was created after Bubi Small Scale Miners Association petitioned the Government for financial support, resulting in a partnership with the Zimbabwe Mining Development Corporation (ZMDC).\n\nThe ownership structure allocated 60 percent of shares to ZMDC and 40 percent to the local community.During a visit on Friday by the portfolio committee chaired by Honourable Saul Maburutse, the current state of the gold processing facility revealed a complete cessation of operations. This led parliamentarians to question whether the site had been abandoned altogether.\n\nIn an interview during the visit, Mr Benjamin Ndlovu, secretary of the Bubi Small Scale Miners Association, stated that since its inception, the facility has failed to operate at full capacity, thus failing to fulfil its mandate to create local jobs and empower small-scale miners in the district.\n\nThere was a clear agreement between ZMDC and the Bubi Small Scale Miners Association that upon commencement of operations, the shareholding would be 60 percent for ZMDC and 40 percent for the miners in the district, derived from the processing of the mine dump. However, the construction of the milling centre was substandard.\n\nThe crushing machinery failed to function for even a week, and subsequent attempts by the contractor to rectify the issue were unsuccessful. Funds earmarked for processing sand were diverted to purchase new machinery, resulting in the project failing to meet its intended objectives, Mr Ndlovu said.\n\nDespite the projects aim to empower small-scale miners, Mr Ndlovu lamented that the centre only managed to support three out of the targeted ten miners per year. He further stated that the project was intended to provide crucial training to local miners on improving production, enhancing their capabilities, and adopting best mining practices to facilitate their progression from small to medium and large-scale operations.\n\nMr Ndlovu also highlighted the procurement of equipment, including trucks for ore transportation and seven compressors intended for distribution to small-scale miners, some of which were never delivered.\n\nIn response, Mr Voster Mamvura, ZMDCs business development manager, confirmed that equipment was purchased, but the supplier only delivered one tractor and three compressors. He stated that legal proceedings were now underway due to the suppliers failure to fulfil the order.\n\nHe also acknowledged managements concerns regarding the difficulty in securing ore for processing, citing intense competition in the area.\n\nHowever, management indicated they were actively pursuing new partnerships with other mining associations, aiming to secure ore for processing at the facility to ensure its continued operation.\n\nHonourable Maburutse expressed the committees dissatisfaction and emphasised the need for thorough follow-ups.We visited this area with the understanding that the Bubi Milling Centre was built using Government funds. We wanted to ascertain whether it was still operational. What we discovered was a project that appears to have been abandoned, as there is no activity taking place.\n\nThe management even arranged for the site to be cleaned in anticipation of our visit, attempting to create a false impression of activity. However, it is clear that nothing is happening. Local residents informed us that numerous promises made during the facilitys setup were not fulfilled.\n\nFor instance, they were promised a 40 percent shareholding, which they have not received, and equipment was purchased but not delivered. Something is clearly amiss, he said.\n\nHe stressed the importance of rigorous oversight of Government-funded projects to ensure they deliver the intended outcomes.ZMDC facilitated a US$3,5 million loan from Fidelity Gold Refinery for the procurement of machinery and mining consumables for the centre.\n\nHonourable Maburutse confirmed that the loan had been repaid. However, parliamentarians were left with lingering questions, as the output did not appear to align with the repaid loan, raising suspicions of under-declaration of proceeds.Consequently, the committee has summoned the Bubi Milling Centre management to Parliament for further discussions regarding the project.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/trb.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com THE Parliamentary Portfolio Committee for Mines and Mining Development has voiced serious concerns regarding the mismanagement of the Bubi Milling Centre, a facility established in 2018 to benefit small-scale miners and the wider community. Funded to the tune of US$3,5 million, the centre was created after Bubi Small Scale Miners Association petitioned […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Filmmakers welcome grant, call for more funding",
            "url": "https://www.chronicle.co.zw/filmmakers-welcome-grant-call-for-more-funding/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nFilmmakers across Zimbabwe have welcomed the short film grant recently launched by the National Arts Council of Zimbabwe (NACZ), calling it a positive step towards revitalising the countrys film industry while also advocating for more funding.NACZ introduced a US$6000 grant to support short film production, with three filmmakers set to receive US$2 000 each to pursue their projects.\n\nRaisedon Baya\n\nVeteran filmmaker Raisedon Baya hailed the initiative, stressing its importance in fostering a vibrant film sector.I think its a step in the right direction. We have always called on NACZ to support the arts, and they have now taken action. While the grant may not be enough, it is a commendable start, Baya said.\n\nNACZ has shown an understanding of what is needed to grow the sector. First, they developed a film strategy as a roadmap for growth. Now, they have introduced a grant. I believe they are on the right track and deserve recognition for their efforts.\n\nEddie Ndhlovu\n\nYoung filmmaker Eddie Ndhlovu, who has relied on self-funding, expressed gratitude for the grant but also called for more resources to support emerging creatives.\n\nAs a filmmaker accustomed to self-financing and low-budget projects, I see this grant as a significant opportunity. I believe such funding should primarily support emerging creators, as it is crucial for nurturing new talent and providing the necessary resources to bring their stories to life.\n\nWhile it is encouraging to see support directed towards filmmakers, it is equally important to ensure that grants go to those actively producing tangible content. This would help prevent favouritism and ensure funds reach committed filmmakers rather than those seeking financial gain without dedication to the craft, he said.\n\nNdhlovu added: Theres an urgent need for more grants, not just for short films but also for feature films and documentaries. Establishing training workshops led by experienced filmmakers would also help aspiring creators acquire essential skills and industry knowledge.\n\nMoreover, the Government should implement policies that promote and protect local content to foster industry growth.Rasquesity of Keaitse Films echoed these sentiments, highlighting the need for continued support.\n\nWe have waited a long time for the Government, corporate entities, and NGOs to support our growing film industry. The recognition of our film sector means a lot to us as active participants. Though the fund may not be sufficient for a single short film, we appreciate NACZ for initiating this effort, and we hope it is just the beginning. There is light at the end of the tunnel.\n\nAdmittedly, the budget falls short when considering costs such as crew, cast, props, and locations. However, it is a step in the right direction. I believe those selected will find creative ways to produce quality work. I also appreciate the requirement encouraging female filmmakers to apply, as it promotes gender balance in the industry, he said.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/vv.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Filmmakers across Zimbabwe have welcomed the short film grant recently launched by the National Arts Council of Zimbabwe (NACZ), calling it a positive step towards revitalising the country’s film industry while also advocating for more funding. NACZ introduced a US$6 000 grant to support short film production, with three filmmakers set to receive […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Warriors leave for South Africa",
            "url": "https://www.chronicle.co.zw/warriors-leave-for-south-africa/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nWARRIORS coach Michael Nees was yesterday forced to make an injury-inspired change to his squad for the upcoming Fifa World Cup qualifiers after dropping captain Marvelous Nakamba and replacing him with locally-based Richard Hachiro.\n\nHachiro, who gave a standout performance when former champions Ngezi Platinum Stars outplayed star-studded Scottland in a league match last Friday, was rewarded with a late call-up before the Warriors left for South Africa yesterday.He was on standby, having last featured for the national team a few months ago as the Warriors sealed qualification for the 2025 Afcon under Nees.\n\nRichard Hachiro\n\nThe diminutive midfielder joined goalkeeper Martin Mapisa, Dynamos captain Emmanuel Jalai, Isheanesu Mauchi of Simba Bhora and the six Scottland players led by Khama Billiat, Walter Musona and Godknows Murwira on the trip.\n\nThe contingent of 10 locally-based players was the first to arrive in Durban where Nees is hoping to conduct a three-day training camp ahead of Zimbabwes Group C home game against Benin at the Moses Mabhida Stadium this Thursday.The local players will be joined by their foreign-based counterparts starting today as they prepare for the two games against Benin and then Nigeria at the Godwill Akpabio Stadium in Uyo next Tuesday.\n\nOne of the senior players Billiat, who is no stranger to the tough continental battles, was excited to be taking the responsibility once again.\n\nIts a great feeling to represent your country, and we are always ready to give our best for the nation, he told Scottland media.This is our nation and we truly appreciate the call-up and we are looking forward to the games.To coach Nees, I just want to tell him that we are grateful to be part of the national team that is going to represent the country right now. We are always here to give our best and represent the nation in the best way.To the fans and everyone who is behind me and the team, I have nothing to promise but to give my best and make sure that I give everything on the day and make sure that I represent the nation positively.I would like to say thank you to everyone who has been behind the team, the nation and all the sports people out there. We truly appreciate it and that motivates us to do better every day, said Billiat.\n\nHis Scottland teammate Musona is relishing the opportunity to don the national team colours alongside his brother Knowledge, who has just come out of international retirement.\n\nMusona, a key member in Zimbabwes recent 2025 Afcon qualifying squad, has helped the Premiership newboys win two of their opening three assignments.\n\nNow I have to shift forward to the Warriors and I think I just have to work hard. Its not going to be easy for me to play because the team is strong.\n\nMy brother is back. Some think we play in the same position but we dont. So, I just have to fight for my position and Ill see what happens.\n\nWe just have to go there and apply ourselves better than before because we have qualified for Afcon and now we are going to fight for the qualifications for the World Cup. So we just have to go on top as a team, said Musona.Dynamos fullback Jalai is also praying for his breakthrough after warming the bench each time he has been called. But he believes he has picked priceless lessons from the experience.\n\nInteracting with the European-based players is always a source of inspiration, as they compete at the highest level.I learn something new every time we meet during national team duty, and Im always eager to continue working, resetting, and enjoying the high level of football, he said.\n\nScottland midfielder Mthokozisi Msebe was also excited to get a national team call-up ahead of the two assignments.I am very happy because its not easy to be called up to the national team but through hard work it has happened. So I will try to push and play to my best so that our football wins, said Msebe.\n\nKhama Billiat\n\nWarriors coach Nees has been tracking both the local and foreign-based players ahead of the resumption of the 2026 World Cup competition.\n\nThe Warriors had a slow take-off in Group C of the 2026 World Cup qualifiers, but they still harbour hopes for a comeback despite sitting bottom of the table with just two points from four games.\n\nZimbabwe had two defeats and as many draws under Baltemar Brito and Jairos Tapera. This will be Nees first time in charge of the World Cup campaign.\n\nWith Zimbabwe on two points, the trio of Rwanda, Benin and South Africa are tied on seven points while Lesotho have five and powerhouse Nigeria three.\n\nNees has convinced former captain Musona to reverse his retirement from international football and the forward is expected in Durban after featuring 45 minutes in Al-Okhdoods 2-1 win over Al Ahli on Saturday in the Saudi Pro-League.There was also positive news at the weekend as midfielder Andy Rinomhota made a welcome return from injury for Cardiff City when he featured in a 2-1 win over Blackburn Rovers in an English Championship match on Saturday.\n\nRinomhota, who has occasionally been deployed at rightback, played 61 minutes in his usual right midfield position.He had missed the teams previous two games since picking up a hamstring injury against Burnley at the beginning of the month.\n\nAnother England-based Warrior Tawanda Chirewa made a second-half appearance for Huddersfield Town, coming on at the hour mark as they thrashed Crawley Town 5-1 in the English League One.\n\nChirewa is returning to the Zimbabwe fold after missing the previous four national team assignments due to a thigh injury.However, his namesake Tawanda Maswanhise was not in the match day squad for Motherwell as they came from two goals down to draw 2-2 against visiting St Mirren in the Scottish Premier league.\n\nItaly-based Jordan Zemura was back in the starting line-up for Udinese in the Italian Serie-A but his sided lost 0-1 to Verona.Munashe Ganananga could be the last player expected to join the Warriors in Durban as his team FC Copenhagen was billed to feature in a Danish Superliga match against Viborg FF last night.\n\nSquadGoalkeepers: Washington Arubi (Marumo Gallants), Marley Tavaziva (Brentford), Martin Mapisa (MWOS)\n\nDefenders: Jordan Zemura (Udinese), Divine Lunga (Sundowns), Gerald Takwara (Al Minaa SC), Munashe Garananga (FC Copenhagen), Isheanesu Mauchi (Simba Bhora), Peter Muduhwa (Scottland), Godknows Murwira (Scottland), Emmanuel Jalai (Dynamos)\n\nMidfielders: Marshall Munetsi (Wolverhampton Wanderers), Andy Rinomhota (Cardiff City), Richard Hachiro (Ngezi Platinum Stars), Mthokozisi Msebe (Scottland), Khama Billiat (Scottland), Knowledge Musona (Al-Okhdood), Tawanda Chirewa (Huddersfield Town)\n\nForwards: Prince Dube (Young Africans), Tawanda Maswanhise (Motherwell), Terrence Dzvukamanja (SuperSport United), Tymon Machope (Scottland), Walter Musona (Scottland)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/rh-1.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub WARRIORS coach Michael Nees was yesterday forced to make an injury-inspired change to his squad for the upcoming Fifa World Cup qualifiers after dropping captain Marvelous Nakamba and replacing him with locally-based Richard Hachiro. Hachiro, who gave a standout performance when former champions Ngezi Platinum Stars outplayed star-studded Scottland in […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Zimbabwean students win Expo 2025 website design",
            "url": "https://www.chronicle.co.zw/zimbabwean-students-win-expo-2025-website-design/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nAS Zimbabwe prepares for Expo 2025 Osaka in Japan, the contribution of young people in the lead-up to the event has been warmly acknowledged, with students from the Harare Institute of Technology celebrated for their winning design of the Zimbabwe Pavilion website.\n\nZimbabwe has launched its Expo 2025 Osaka Zimbabwe Pavilion website and mobile application, a crucial step in ensuring the nations narrative is conveyed effectively and accurately to a global audience. With preparations for Expo 2025 Osaka now well advanced, Zimbabwe is poised to showcase its dedication to sustainable growth and innovation, while simultaneously aiming to attract investment, promote its rich cultural heritage, and highlight its abundant natural resources.\n\nIn a post on their X (Twitter) account, ZimTrade commended the youths innovative work, emphasising the power of youth-driven initiatives.\n\nWe are delighted to highlight the remarkable contributions of young people in shaping Zimbabwes presence at Expo 2025 Osaka.\n\nZimTrade\n\nThe winners of the Expo 2025 Osaka website and mobile app contest have played a pivotal role in this process. A special mention to the talented students from the Harare Institute of Technology, who developed the Zimbabwe Pavilion website.\n\nTheir innovative work exemplifies the power of youth-driven initiatives. Let us continue to collaborate and ensure Expo 2025 Osaka is an unforgettable success, the X post read.\n\nNext month, the world will converge on Osaka, Japan, for Expo 2025, a prestigious international event showcasing innovation, culture, and technological advancements from across the globe. Expo 2025 will run from April 13 to October 13, under the theme Designing future society for our lives.\n\nThe theme aligns seamlessly with Zimbabwes vision for sustainable and inclusive economic growth.The Expo also presents an opportunity to showcase Zimbabwes commitment to sustainable tourism development and strategic partnerships within the sector.\n\nZimTrade said: Expo 2025 Osaka will soon commence, and in preparation, tourism took centre stage at yesterdays stakeholder engagement with the Commissioner-General, signalling a significant boost for the tourism sector. We are excited to push beyond our limits.\n\nZimbabwe, with its rich cultural heritage, diverse emerging economy, and resilient people, is well-positioned to make a significant impact at this esteemed gathering.\n\nIts participation at Expo 2025 Osaka is expected to yield immensely beneficial outcomes that will positively influence the countrys economy. The Expo will provide a platform for Zimbabwe to increase its international trade, tourism inflows, and revenue, showcase its investment opportunities, and enhance its brand visibility.\n\nAnticipated outcomes from Zimbabwes participation at Expo 2025 Osaka include a 15 percent increase in tourist arrivals, a 10 percent increase in trade deals annually, a 10 percent increase in registered investment deals annually, and an enhanced Brand Zimbabwe.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Harare-Institute-of-Technology.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com AS Zimbabwe prepares for Expo 2025 Osaka in Japan, the contribution of young people in the lead-up to the event has been warmly acknowledged, with students from the Harare Institute of Technology celebrated for their winning design of the Zimbabwe Pavilion website. Zimbabwe has launched its Expo 2025 Osaka Zimbabwe Pavilion website […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "COMMENT: Streamlining taxes will definitely attract more investors",
            "url": "https://www.chronicle.co.zw/comment-streamlining-taxes-will-definitely-attract-more-investors/",
            "content": "It has taken quite some time for authorities to act on the high tax and regulatory framework for businesses to legally register and operate in the country, but we are encouraged that work to address that is now underway.\n\nWe were concerned recently to hear that, for a supermarket to be deemed legally operational, it has to secure and maintain more than 30 licences and permits from multiple regulatory authorities. Also burdened are the hospitality, mining and public transport sectors.\n\nThe huge tax and compliance requirements discouraged investment. Also, formalising the informal sector in that environment is difficult.\n\nEncouragingly, however, President Mnangagwa has ordered a review of the countrys tax and regulatory regimes with an express view to easing them to make the country really open for business.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube told the latest issue of our sister paper, The Sunday Mail, that the revision is underway with a substantive position likely by August.\n\nWe will streamline the taxes; we will cut out some of them; we will reduce the number of steps required to set up and run a business; and reduce the number of licences, he said.\n\nWe are aware that in some countries in the region, businesses require about half the number of licences we do. A good target would be to cut the number of regulatory licences needed to start a business by half. If we can achieve that  halving the number of steps and halving the cost of doing business  that would be a good target and that is a target that we are aiming for.\n\nThis must be good news for local businesses that, although the review is coming quite late, it is now on the way.We appreciate that a tough discussion is ongoing among the various ministries and government agencies and local authorities to reach agreements on which tax or regulation to scrap, reduce or maintain and which one not to and why.As mentioned, reaching a settlement on these various matters and across various agencies and ministries is not going to be easy but a settlement must just be reached.\n\nThis means some ministries, government agencies or local authorities will have to agree to losing certain powers and revenues or portions thereof. Unfortunate for them, but we are confident that the wider economy will benefit if the taxes and regulations impeding business are streamlined.\n\nEconomies rarely thrive in an environment of multiple taxes and onerous regulations. Instead, an environment with fewer taxes and regulations tends to get businesses thriving.\n\nMultiple studies show that China has prospered since 1978 because the Den Xiaopings administration of the time eliminated most of the taxes that were applicable at the time.\n\nWe learn from this Chinese experience that no country can tax and regulate itself to prosperity. A more relaxed, deregulated environment is what drives prosperity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dvfhuhuudgiodfgusdfd.jpg",
            "description": "It has taken quite some time for authorities to act on the high tax and regulatory framework for businesses to legally register and operate in the country, but we are encouraged that work to address that is now underway. We were concerned recently to hear that, for a supermarket to be deemed legally operational, it […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Watch, learn from Europe’s best, Mapeza urges players",
            "url": "https://www.chronicle.co.zw/watch-learn-from-europes-best-mapeza-urges-players/",
            "content": "Innocent Kurira,[emailprotected].\n\nFC PLATINUM head coach Norman Mapeza has voiced his concerns about the lack of creativity in the Castle Lager Premier Soccer League (PSL), urging domestic players to broaden their horizons by watching top European leagues to learn from world-class talent.\n\nMapeza, a former Warriors captain and one of Zimbabwes most celebrated football figures, made the call following his teams 1-1 draw against Chicken Inn at Luveve Stadium on Saturday.\n\nDespite the result, Mapezas focus shifted to a pressing issue that he believes is hindering the growth of local football  the absence of truly creative players in the PSL.\n\nSpeaking to the media after the match, Mapeza lamented the fact that domestic football is lacking players with the flair and skill seen in Europes elite competitions.\n\nHe singled out the likes of Vinicius Jnior of Real Madrid and Manchester Uniteds Alejandro Garnacho as examples of players who possess the kind of creativity Zimbabwean players need to embrace.\n\nAs coaches, we cant teach players everything. They should watch and learn from these leagues on TV. Right now, we dont have a single player in the domestic league who can take free kicks, said Mapeza.\n\nThe veteran coach believes exposure to top European football is vital for the development of Zimbabwean players, particularly in terms of creativity and technique.\n\nHe stressed that watching world-class talent in action could help local players understand how the skills they practice in training can be translated into actual match situations.\n\nThese guys need to learn. Sometimes they need to go and watch football on TV because they might think whatever we are trying to do on the training field doesnt exist. They should go and watch it on TV; it happens, said Mapeza.\n\nWe are not teaching something that we do not know. We are teaching something that we know can happen. So we need to have that belief in the players in what we are teaching them. What we are teaching them is happening all over week in, week out. Go watch Real Madrid, Barcelona, Arsenalthese teams are doing these things we are trying to teach. Why cant we do those things here?\n\nMapezas remarks come as part of his on-going mission to uplift the standard of football in Zimbabwe. Despite his success at FC Platinum, where he has won league titles and other tournaments, Mapeza is not satisfied with just results.\n\nHe is keen to see a more innovative, creative brand of football emerge from the PSL. The lack of such players, he believes, is a major gap that needs to be addressed for Zimbabwean football to thrive on the international stage.\n\nAs someone who played in top leagues, including a memorable stint with Turkish giants Galatasaray, Mapeza has experienced first hand the level of professionalism, technical skill and creativity required to succeed at the highest level.\n\nHis call to local players to watch and learn from Europes best is a direct reflection of his own experiences, where he believes players can expand their understanding of the game and improve their craft.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fdyj.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw. FC PLATINUM head coach Norman Mapeza has voiced his concerns about the lack of creativity in the Castle Lager Premier Soccer League (PSL), urging domestic players to broaden their horizons by watching top European leagues to learn from world-class talent. Mapeza, a former Warriors captain and one of Zimbabwe’s most celebrated football […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Innscor’s agro unit invests US$10,4m in inputs",
            "url": "https://www.chronicle.co.zw/innscors-agro-unit-invests-us104m-in-inputs/",
            "content": "Martin Kadzere\n\nInnscor Africa Limiteds agriculture unit, PHI/Agrowth, invested a total of US$10,4 million in the current cropping season to ensure a continuous supply of key raw materials to the conglomerates agro-processing units while also contributing to national food security, a senior company executive has said.\n\nAs the leading purchaser of Zimbabwean maize, soya products, and wheat, Innscor has a diverse portfolio including National Foods milling operations, Profeeds, Probrands, Irvines, The Buffalo Brewing Company and Colcom.\n\nThe group also uses significant quantities of locally sourced sorghum, sugar beans, and popcorn.PHI director Mr Graeme Murdoch said the company partnered with 199 farmers, resulting in about 6 800 hectares of key crops being grown under contract.\n\nThe investment not only strengthens the supply chain for various food products but also enhances the livelihoods of local farmers and promotes sustainable agricultural practices, he said.\n\nMaize received the largest portion of funding, at US$8 million, supporting 4 804 hectares of commercial irrigation, 130 hectares of commercial dryland, and 132 hectares of dryland small-scale farming.\n\nPHI also invested US$1,66 million in soya beans, planting a total of 1 231 hectares. The remaining funds were allocated to sorghum and popcorn.\n\nOur commitment to investing in local agriculture is fundamental to achieving both our business objectives and supporting food security in Zimbabwe, said Mr Murdoch.\n\nBy working closely with our farmers through initiatives such as contract farming, we help ensure stable production levels and provide them with the necessary tools and resources to succeed.PHIs investment aligns with the Government policy requiring the private sector to meet at least 40 percent of annual raw material needs through value chain financing of farmer production.\n\nPHI operates under the umbrella of the Food Crop Contractors Association, which also includes Staywell, Delta, and Northern Farming. For this summer cropping season, the estimated financial requirement was US$1,6 billion, with the Government contributing 37 percent, the private sector 60 percent through contract schemes, and self-financed farmers contributing 3 percent.\n\nAfter last years drought, Innscor group companies have been relying on imports for their maize and soya requirements for most of 2024.\n\nPHI purchased approximately 40 000 tonnes of maize and about 7 000 tonnes of soya beans from the 2023/24 summer crop, alongside 53 000 tonnes of contracted wheat from the 2024 wheat crop.Looking ahead, the unit targets 6 400 hectares of winter wheat this year.\n\nThe 2024/25 summer rains were much later than expected, with the first planting rains falling, for most areas, only in the middle of December, Mr Murdoch said.\n\nThe rain in the northern areas has been adequate for the crops, but run-off to fill the dams is still insufficient to guarantee a winter crop.\n\nThe PHI/Agrowth scheme facilitates better yield outputs while fostering a cooperative environment among farmers.The initiative not only assists farmers in accessing finance and essential farming inputs but also guarantees reliable marketing channels for their produce.\n\nLooking ahead, PHI plans to continue expanding its agricultural footprint and increasing investments in crop production to meet the rising demand for locally sourced food products.\n\nAs we move towards the next planting season, we are focusing on diversifying our crop base and enhancing our partnerships with farmers to cultivate a broader range of crops, he said.\n\nTo bolster its efforts, PHI is seeking to enhance its collaboration with independent contractors to secure consistent off-take options for commodities, thereby solidifying Zimbabwes agricultural sector and ensuring a stable supply of raw materials for its diverse food production divisions.\n\nMr Murdoch said Innscor Africas strategic approach not only prioritises its operational needs but also plays a vital role in uplifting the agricultural sector and contributing to the broader economic landscape of Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/01/download.png",
            "description": "Martin Kadzere Innscor Africa Limited’s agriculture unit, PHI/Agrowth, invested a total of US$10,4 million in the current cropping season to ensure a continuous supply of key raw materials to the conglomerate’s agro-processing units while also contributing to national food security, a senior company executive has said. As the leading purchaser of Zimbabwean maize, soya products, […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        },
        {
            "title": "Under threat filling stations close at night",
            "url": "https://www.chronicle.co.zw/under-threat-filling-stations-close-at-night/",
            "content": "Peter Matika,[emailprotected]\n\nA worrying surge in armed robberies targeting Bulawayos fuel service stations is forcing the businesses to drastically alter their operations, with some now closing their doors at night. This drastic measure comes in response to a persistent wave of robberies, a trend that began last year, where criminals have repeatedly targeted these establishments, making off with substantial sums of foreign currency.\n\nThe escalating threat has left fuel station owners and staff increasingly vulnerable, impacting both their livelihoods and the vital service they provide to the community.\n\nIn the most recent incidents, a gang made off with a total of US$2374 and ZAR115 235 after raiding a service station located in the Kelvin industrial area last Tuesday night.\n\nAccording to national police spokesperson Commissioner Paul Nyathi, the robbers struck at 9pm while the service station owner was parked nearby.\n\nHe was in his Toyota Hilux at the station when he witnessed the suspects attacking his employees. Upon realising they had been seen, they also attacked him, firing shots into the air to deter any intervention, Commissioner Nyathi said.He said that the robbers forced the employees to lie on the ground before stealing the cash.\n\nIn a separate incident, Commissioner Nyathi reported that the same suspected group targeted a service station in Tshabalala, where they stole US$440 and a Toyota Altezza valued at US$3 200, which they later abandoned in the Pumula suburb.They discharged firearms into the air before assaulting the workers. During the raid, they also attacked and hijacked a mans vehicle, Commissioner Nyathi said.\n\nHe appealed to the public for information that could lead to the apprehension of the suspects, who were wearing balaclavas.The police are appealing to members of the public for any information that can assist in the arrest of these suspects.\n\nThey are part of the community and are known criminals. The public are advised not to harbour such criminals, as they are extremely dangerous, Commissioner Nyathi warned.\n\nHe urged business owners to strengthen their security measures by installing CCTV systems and other electronic security devices, such as trip alarms.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/armed-robbers-used-gun-robbery-600nw-1495712093-600x380.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw A worrying surge in armed robberies targeting Bulawayo’s fuel service stations is forcing the businesses to drastically alter their operations, with some now closing their doors at night. This drastic measure comes in response to a persistent wave of robberies, a trend that began last year, where criminals have repeatedly targeted these […]",
            "time": "06:10",
            "date": "17 Mar 2025"
        }
    ]
}