{
    "news": [
        {
            "title": "WATCH: Zanu PF Insiza North Constituency primary election candidates for National Assembly announced",
            "url": "https://www.chronicle.co.zw/watch-zanu-pf-insiza-north-constituency-primary-election-candidates-for-national-assembly-announced/",
            "content": "Judith Phiri, Chronicle Reporter\n\nTHE Zanu-PF Matabeleland South Provincial Chairman, Cde Mangaliso Ndlovu, has announced the partys candidates vying for the Insiza North Constituency National Assembly seat.\n\nThe seat became vacant following the passing of Insiza Norths legislator and businessman, Cde Farai Taruvinga, last month. Cde Taruvinga, aged 53, succumbed to cancer at his family home in Hillside, Bulawayo.\n\nSpeaking after the announcement at the Insiza District Zanu PF office on Sunday, Cde Ndlovu confirmed that the primary election would take place on Saturday.I came to engage with the leadership of Insiza District, with particular focus on Insiza North Constituency. As you know, we lost our member, Cde Farai Taruvinga, may his soul rest in peace, who was the Member of Parliament for this constituency.\n\nAs a party, we are already preparing for the by-election and are leaving nothing to chance. We aim to continue the work that Zanu PF started for the people of Insiza North. We have begun the process of selecting our candidates, he said.Cde Ndlovu explained that he had been tasked by the National Political Commissar, Cde Munyaradzi Machacha, to guide the constituency through the process leading up to the primary elections on Saturday, 3 May, where they will select a candidate to represent Zanu PF in the upcoming by-election.\n\nHe expressed satisfaction with the outcome of the meeting, stating that all candidates who had submitted their names were cleared to contest.We will approach this election in a family-friendly manner. All candidates will campaign together with the Provincial leadership, and each will have the opportunity to engage with the people, presenting their case as the best choice to represent the interests of the community. Ultimately, it will be the people who decide, he said.\n\nThe candidates are: Qhubani Moyo (Ward 22), Clever Sibanda (Ward 20),Delani Moyo (Ward 13), Moses Langa (Ward 14), Sifiso Mpofu (Ward 19), Nkosana Mthunzi (Ward 19), Ernest Ncube (Ward 17), Davison Moyo (Ward 21), Lindelwe Ndlovu (Ward 14).\n\nThe meeting was attended by Politburo member Cde Esther Nyathi, Central Committee member Cde Andrew Langa, Provincial Political Commissar Cde Washington Nkomo, District Coordinating Committee (DCC) Chairman Cde Spare Sithole, along with other provincial members, National Consultative Assembly (NCA) members, and representatives from various districts and party structures.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Minister-Nqobizitha-Mangaliso-Ndlovu-630x380.jpg",
            "description": "Judith Phiri, Chronicle Reporter THE Zanu-PF Matabeleland South Provincial Chairman, Cde Mangaliso Ndlovu, has announced the party’s candidates vying for the Insiza North Constituency National Assembly seat. The seat became vacant following the passing of Insiza North’s legislator and businessman, Cde Farai Taruvinga, last month. Cde Taruvinga, aged 53, succumbed to cancer at his family […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Zimbabwe set to be first African nation with nationwide public Air rescue service",
            "url": "https://www.chronicle.co.zw/zimbabwe-set-to-be-first-african-nation-with-nationwide-public-air-rescue-service/",
            "content": "Sikhumbuzo Moyo, Senior Reporter\n\nZIMBABWE is on course to become the first African country to have a public air rescue service covering the entire country, following the establishment of Helidrive National Air Rescue Service, which was officially launched in August last year.\n\nHelidrive National Air Rescue Service was established through a partnership between the Russian Republic and the Republic of Zimbabwe, where President Vladimir Putin and President Mnangagwa saw it fit to develop a robust air evacuation system, considering the challenges the country faced in air rescue transportation services.\n\nSpeaking in an interview at the Ministry of Health and Child Care stand at the recently concluded 65th edition of the Zimbabwe International Trade Fair, one of the doctors, Dr Rudo Gumbo, said the company was created to address some of the medical transportation challenges the country faced. It began operations in Harare in July 2024, while the second base in Bulawayo became operational in December of the same year.\n\nSince July 2024, the company has evacuated 450 patients, 150 of whom were neonates (less than 28 days old). Sixty of the evacuated patients were from the Matabeleland region, said Dr Gumbo. Helidrive National Air Rescue Service falls under the Ministry of Health and Child Care.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-27-at-11.07.42-680x380.jpeg",
            "description": "  Sikhumbuzo Moyo, Senior Reporter ZIMBABWE is on course to become the first African country to have a public air rescue service covering the entire country, following the establishment of Helidrive National Air Rescue Service, which was officially launched in August last year. Helidrive National Air Rescue Service was established through a partnership between the […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Booked & busy Mzoe7 inspires fellow Bulawayo artistes",
            "url": "https://www.chronicle.co.zw/booked-busy-mzoe7-inspires-fellow-bulawayo-artistes/",
            "content": "Melissa Mpofu,Zimpapers Arts & Entertainment Hub\n\nIts undeniably Mzoe7s time to shine. The ever-versatile artiste, whose name has become synonymous with high-profile gigs, has become the go-to name due to his impressive versatility. His success has been so remarkable that fellow musicians are now eager for him to host a masterclass, hoping he will share the secrets behind his consistent bookings.\n\nFor years, many Bulawayo-based artistes have felt side-lined, often missing out on major line-ups. But for Mzoe7, that is not the case as his name appears on almost every major show line-up, not only in Bulawayo but nationwide.\n\nWhether it is national galas or large music festivals, Mzoe7 has carved out a spot for himself, not just as a performer but as a sought-after MC. His versatility has made him a key figure in the entertainment scene, blending his musical talent with charisma on stage.\n\nFrom energising crowds at the Swan Music Festival in Bulawayo a few weeks ago and Zimbabwe Independence gala in Gokwe last weekend to delivering a stellar performance at the Bulawayo Shutdown gig at the ZIEC main arena, Mzoe7 has proven time and again that he is one of the citys top entertainers.\n\nSuch accomplishments have not gone unnoticed, prompting his fellow musicians to seek his advice.\n\nArt teacher Trevor Mawaka recently posted, If Mzoe7 holds a masterclass on how Bulawayo musicians can stay booked, Ill definitely attend.\n\nIn response, Mzoe7 humbly acknowledged the suggestion, saying, Id definitely attend too, but the most important thing is to listen, understand, and implement the lessons.\n\nThe artiste revealed the immense amount of work he puts into his craft, sharing that he has the ability to perform on three different stages or events in a single day. He attributed this success to a rigorous routine of practice, rehearsals, and dedication.\n\nMzoe7 also recently opened up to his followers about his approach to success. He shared that before any performance, he takes the time to connect with the venue, the stage, and the crew behind the scenes to align expectations and share his vision. This collaborative approach ensures that everyone involved in the production is on the same page, which leads to flawless performances that keep him in demand.\n\nMany fans have taken to social media to express their admiration for Mzoe7s work ethic. One comment read, This guy never sleeps and knows how to knock on doors.\n\nIt is clear that his hustle and dedication continue to inspire many aspiring artistes in Bulawayo and beyond.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hngng.jpg",
            "description": "Melissa Mpofu,Zimpapers Arts & Entertainment Hub It’s undeniably Mzoe7’s time to shine. The ever-versatile artiste, whose name has become synonymous with high-profile gigs, has become the go-to name due to his impressive versatility. His success has been so remarkable that fellow musicians are now eager for him to host a masterclass, hoping he will share […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Watch: Music sensation Oriyano wins hearts of Bulawayo crowd at Shutdown gig",
            "url": "https://www.chronicle.co.zw/watch-music-sensation-oriyano-wins-hearts-of-bulawayo-crowd-at-shutdown-gig/",
            "content": "Amos Mpofu\n\nHarare-based newcomer Oriyano has quickly won the hearts of music lovers, and his star is undeniably on the rise. After captivating audiences at the National Arts Merit Awards in Harare earlier this year, Oriyano cemented his place in the Zimbabwean music scene with a remarkable performance at the Bulawayo Shutdown gig on Saturday evening.\n\nThough one of the last artistes to be included on the shows line-up, Oriyanos performance proved why he belongs at the top. He effortlessly bonded with the crowd, which included locals, festival-goers, and international visitors attending the just-ended Zimbabwe International Trade Fair.\n\nhttps://youtube.com/shorts/ljv06uFWVek\n\nFans were heard singing along to his tracks, Areka, Ndakuda, and Makarima Mupoto, word for word, showing just how much they have embraced his music.\n\nOriyanos stage presence was magnetic, and his vocal power was undeniable, leaving the crowd begging for more. His energy lit up the stage, and it was clear that he had found a special connection with the Bulawayo audience.\n\nBursting onto the music scene only last year, Oriyano immediately attracted attention with his vocal resemblance to superstar Jah Prayzah, with many fans initially mistaking him for the seasoned icon. However, Oriyano has since carved out a unique identity, winning over fans with his distinct sound and undeniable talent.\n\nAs his fan base continues to grow, it is clear that Oriyanos journey has just begun, and his future in the industry is bright.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cvxvdsxzcxz.jpg",
            "description": "Amos Mpofu Harare-based newcomer Oriyano has quickly won the hearts of music lovers, and his star is undeniably on the rise. After captivating audiences at the National Arts Merit Awards in Harare earlier this year, Oriyano cemented his place in the Zimbabwean music scene with a remarkable performance at the Bulawayo Shutdown gig on Saturday […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Jah Prayzah’s daughter Kayla makes artistic debut on “Ndini Mukudzeyi” album",
            "url": "https://www.chronicle.co.zw/jah-prayzahs-daughter-kayla-makes-artistic-debut-on-ndini-mukudzeyi-album/",
            "content": "Melissa MpofuZimpapers Arts & Entertainment Hub\n\nAs the countdown to Jah Prayzahs much-anticipated album Ndini Mukudzeyi intensifies, the award-winning musician has gifted fans a moving prelude, the release of a special single titled Kuno to be released on April 28.\n\nAlready stirring excitement, Kuno is not just another song; it is a deeply personal milestone for Jah Prayzah (real name Mukudzeyi Mukombe), as it marks the musical debut of someone very close to his heart, his daughter, Kayla.\n\nTaking to Facebook to share the emotional moment, Jah Prayzah wrote:Tomorrow at 10am, a piece of my heart comes to life. Kuno, the first full release from my upcoming album Ndini Mukudzeyi, will be going live. Its even more special to me because my daughter, Kayla, plays herself in this story.\n\nThe proud fathers words captured the emotional weight of the moment, showing that beyond the polished sounds and global tours, there remains a man who treasures family above all.\n\nKuno follows the earlier releases of the album teaser Ibvo and the prayerful single Fambai Neni, which, though not part of the album, beautifully set the tone for what fans can expect. From the rich production quality to the authentic storytelling, Jah Prayzahs new project promises to reflect not just musical excellence, but a deeper, matured artistry shaped by life, travel, and fatherhood.\n\nFans have been urged to prepare their data bundles ahead of the songs release, as this emotional offering is expected to be a rare, unforgettable treat.\n\nNdini Mukudzeyi will officially drop on May 3, with a grand launch event at the Old Hararians Sports Club in Harare. The launch marks the beginning of a broader plan that will see Jah Prayzah take his music across the world in an international tour.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/pot.jpg",
            "description": "Melissa MpofuZimpapers Arts & Entertainment Hub As the countdown to Jah Prayzah’s much-anticipated album “Ndini Mukudzeyi” intensifies, the award-winning musician has gifted fans a moving prelude, the release of a special single titled “Kuno” to be released on April 28. Already stirring excitement, “Kuno” is not just another song; it is a deeply personal milestone […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Young Flying Stars shine as top players honoured at Toppers Uniforms Master Masiku Soccer Festival",
            "url": "https://www.chronicle.co.zw/young-flying-stars-shine-as-top-players-honoured-at-toppers-uniforms-master-masiku-soccer-festival/",
            "content": "Chronicle WriterTHE Toppers Uniforms Master Masiku Soccer Festival not only delivered thrilling football action but also celebrated the tournaments brightest stars, with Young Flying Stars Soccer Academy dominating the awards.\n\nAmong the standout performers were Akim Ndlovu of Young Flying Stars and Qhubekani Ndlovu of Mountain Climbers Academy, who both clinched the top goal scorer title after netting five goals each. Their impressive finishing earned them medals and Toppers Uniforms vouchers as recognition for their outstanding efforts.\n\nThe coveted Player of the Tournament award was deservedly given to Jayden Matawu,son of renowned former footballer Clemence Matawu, who showcased exceptional talent while representing Jadel Academy. His prowess in front of goal also saw him named Promising Striker, earning him a medal and a Toppers Uniforms voucher.\n\nYoung Flying Stars continued to dominate as Alvin Mpofu claimed the title of Most Promising Goalkeeper, while Jayden Dube was recognised as the Most Promising Defender. In midfield, Chris Mukundi of Young Flying Stars proved his mettle, securing the Most Promising Midfielder award.\n\nMeanwhile, the Sponsors Best Player award was given to La Masias goalkeeper, acknowledging the shot-stoppers brilliant performances between the posts. Like the other award winners, he was rewarded with a Toppers Uniforms voucher for his efforts.\n\nFor their triumph in securing the Toppers Uniforms shield, the Young Flying Stars Soccer Academy players will be treated to a special trip to Luna Park, a gesture courtesy of the amusement parks owners.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-27-at-14.14.44-680x380.jpeg",
            "description": "Chronicle Writer THE Toppers Uniforms Master Masiku Soccer Festival not only delivered thrilling football action but also celebrated the tournament’s brightest stars, with Young Flying Stars Soccer Academy dominating the awards. Among the standout performers were Akim Ndlovu of Young Flying Stars and Qhubekani Ndlovu of Mountain Climbers Academy, who both clinched the top goal […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Two arrested for possession of illicit drugs",
            "url": "https://www.chronicle.co.zw/two-arrested-for-possession-of-illicit-drugs/",
            "content": "Online Reporter\n\nPolice in Bulawayo and Victoria Falls have arrested two people in separate incidents involving the unlawful possession of contraband substances.\n\nIn a post on their social media, police said on April 23, 2025, details in Bulawayo intercepted a Toyota Altezza vehicle, registration number ADW 8920, at a secluded area at Siphambaniso Flats near Mazai Bridge, Makokoba.Mthobeki Sibanda, 26, was arrested and found in possession of Benylin Cough Syrup and dagga, said the police.\n\nIn a similar operation in Victoria Falls, police arrested Sinikiwe Mangisai, 20, at a house in Chinotimba for unlawful possession of dagga.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Online Reporter Police in Bulawayo and Victoria Falls have arrested two people in separate incidents involving the unlawful possession of contraband substances. In a post on their social media, police said on April 23, 2025, details in Bulawayo intercepted a Toyota Altezza vehicle, registration number ADW 8920, at a secluded area at Siphambaniso Flats near […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Woman hangs daughter (6) ashamed of her disability",
            "url": "https://www.chronicle.co.zw/woman-hangs-daughter-6-ashamed-of-her-disability/",
            "content": "Online Reporter\n\nPolice in Hwange arrested Melody Mwiinde, 23, in connection with the murder of her six-year-old daughter.\n\nThe incident occurred on April 23, 2025, at Mujimba 9, Siabuwa.\n\nAccording to police reports, Mwiinde allegedly hanged her daughter using an electrical cable from a tree branch and dumped the body in a disused hut.\n\nDuring interrogation, Mwiinde reportedly confessed to the crime, citing ridicule from the community for keeping a disabled child who had been disowned by the father as her motivation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Arrested-3.jpg",
            "description": "Online Reporter Police in Hwange arrested Melody Mwiinde, 23, in connection with the murder of her six-year-old daughter. The incident occurred on April 23, 2025, at Mujimba 9, Siabuwa. According to police reports, Mwiinde allegedly hanged her daughter using an electrical cable from a tree branch and dumped the body in a disused hut. During […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Centenarian liberation struggle war icon dies",
            "url": "https://www.chronicle.co.zw/centenarian-liberation-struggle-war-icon-dies/",
            "content": "Raymond Jaravaza, Online Reporter\n\nA LIBERATION struggle war icon, Elias Sikholiwe Njani Moyo, who was sentenced to life imprisonment by the brutal Rhodesian regime in 1976 after being accused of aiding terrorists has died.\n\nHe was 100 years old.\n\nMoyo is survived by his wife, several children, grandchildren and great grandchildren.\n\nHis family announced that Moyo passed away on Saturday morning at Mater Dei Hospital after a long illness.\n\nMr Elias Sikholiwe Njani Moyo, liberation struggle war icon and businessman, passed away on 26 April 2025 at Mater Dei Hospital in Bulawayo. He was 100 years old.\n\nMr Moyo dedicated his life selflessly to the liberation of Zimbabwe and the empowerment of its people. His unwavering commitment to the struggle for freedom resulted in his imprisonment for life by the Smith regime  a sacrifice emblematic of his deep love for the nation. His contributions remain a proud part of Zimbabwes history, said his great grandson and family spokesperson Mr Mkhululi Chimoio.\n\nMr Chimoio said his great grandfather was a local businessman in Mawabeni who was passionate about uplifting the lives of local community members.\n\nBeyond his role in the liberation movement, Mr Moyo was a pillar of the business sector, playing a significant role in uplifting communities through economic empowerment and business development, with many families benefiting from his wisdom, leadership, and foresight,\n\nMoyo, who was a branch treasurer of the Zimbabwe African Peoples Union (ZAPU) at the time, was 50 years old when he was sentenced following the alleged shooting of a white storekeeper, Mr Leonard Ashly, at Mbalabala on July 7, 1976.\n\nThe Rhodesian media reported that three freedom fighters had asked Moyo for food and shelter, and he harboured them at his home for four nights. The reports further alleged that on the fourth day, the freedom fighters murdered a white storekeeper not far from Moyos village.\n\nIn a story titled This man lost all  through helping the terrorists, Moyo was accused of making his family suffer by risking his business, losing his $50-a-week job, and selling cattle to pay $700 for lawyers fees.\n\nThe storys first line read: Elias Njani Moyo, who is 50 years old, has recently lost everything he has striven for in life because he gave help to some terrorists.\n\nSuch stories were obviously meant to deter the black majority from helping or supporting freedom fighters.\n\nThe majority Government eventually pardoned Moyo after independence, and his upcoming 100th birthday is a testament to his resilience and the long struggle for justice and freedom.\n\nMany freedom fighters were imprisoned under harsh conditions by the Rhodesian regime, which sought to maintain white minority rule.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/tt-1.jpg",
            "description": "Raymond Jaravaza, Online Reporter A LIBERATION struggle war icon, Elias Sikholiwe Njani Moyo, who was sentenced to life imprisonment by the brutal Rhodesian regime in 1976 after being accused of aiding “terrorists” has died. He was 100 years old. Moyo is survived by his wife, several children, grandchildren and great grandchildren. His family announced that […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        },
        {
            "title": "Young Flying Stars Show Skill and Nerve to Win Under-10 Title",
            "url": "https://www.chronicle.co.zw/young-flying-stars-show-skill-and-nerve-to-win-under-10-title/",
            "content": "Chronicle Writer\n\nYOUNG Flying Stars Soccer Academy Team were crowned champions of the Under-10 Toppers Uniforms Master Masiku Soccer Festival at Hartsfield Ground today, securing the Toppers Uniforms shield in spectacular fashion after a tense penalty shootout.\n\nThe closely contested final saw Young Flying Stars battle fiercely against Jadel Academy with both teams showcasing remarkable skill and determination. Despite several promising opportunities during open play, neither side managed to find the breakthrough, forcing the match into a dramatic penalty shootout.\n\nHolding their nerve under pressure, Young Flying Stars displayed composure and precision, clinching victory 3-2 to claim the prestigious title.\n\nYoung Flying Stars clinch Toppers Uniforms Master Masiku Soccer Festival title\n\nThe festival, backed by Toppers Uniforms, provided an outstanding platform for young footballers to hone their skills and compete at an elevated level.\n\nA total of six teams participated in the competition. Mountain Climbers Academy secured third place, overcoming La Masia Academy in the playoff. Young Flying Stars B-team finished as the fifth-best team, while The Brazilians Academy ended the tournament at the foot of the standings.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-6-4.jpg",
            "description": "Chronicle Writer YOUNG Flying Stars Soccer Academy Team were crowned champions of the Under-10 Toppers Uniforms Master Masiku Soccer Festival at Hartsfield Ground today, securing the Toppers Uniforms shield in spectacular fashion after a tense penalty shootout. The closely contested final saw Young Flying Stars battle fiercely against Jadel Academy with both teams showcasing remarkable […]",
            "time": "20:34",
            "date": "27 Apr 2025"
        }
    ]
}