{
    "news": [
        {
            "title": "Man steals from his mother",
            "url": "https://www.chronicle.co.zw/man-steals-from-his-mother/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 34-year-old Bulawayo man who allegedly stole from his mother has been dragged to court facing theft charges.\n\nMatthew Mutobaya, from Nketa suburb, appeared before Western Commonage Magistrate Mr Mehluli Moyo, who remanded him in custody to 27 January.\n\nHe is being charged with two counts of theft. Prosecutor Mrs Ellen Matenga said the first count occurred on 24 December 2024 when Mutobaya allegedly stole a DSTV decoder and sold it.\n\nThe offence is alleged to have occurred around 4pm when Mutobaya was sitting in the sitting room and his mother, Mrs Irene Mutobaya, was in her bedroom folding her clothes.\n\nThat is when she noticed that there was no longer any noise in the sitting room. She then went to check and noticed that the accused was no longer in the house, and the decoder was missing, said Mrs Matenga.\n\nAs for the other count, Mrs Matenga told the court that on 29 December 2024, Mutobaya went into his mothers bedroom, took a trunk claiming it was his, and sold it.\n\nTestifying in court, Mrs Mutobaya said that on the day in question, Mutobaya was pacing up and down in the sitting room while insulting and harassing her.\n\nHe was pacing up and down in the sitting room, and I asked him why he was doing that. He did not give me a proper answer; instead, he started to harass and insult me. I then went into my bedroom to do my chores, and after a few minutes, the noise in the sitting room had stopped. The television was no longer producing any sound. Thats when I decided to go and check what was happening, she said.\n\nMrs Mutobaya told the court that when she entered the sitting room, she found the television off and the accused was no longer in the house. She then noticed that the decoder was missing.\n\nFor the other count, she found her trunk missing in the house and was told that it had been taken by Mutobaya.\n\nIn his defence, Mutobaya pleaded not guilty to the first count but admitted to taking the trunk, claiming it was a gift from his cousin.\n\nI did not steal the decoder. I suspect that my mother might have taken the decoder and hidden it away from me so that I would not make noise in the house. As for the trunk, I did take it, as it belonged to me. I never thought I would be accused of stealing it as it was a gift from my cousin, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 34-year-old Bulawayo man who allegedly stole from his mother has been dragged to court facing theft charges. Matthew Mutobaya, from Nketa suburb, appeared before Western Commonage Magistrate Mr Mehluli Moyo, who remanded him in custody to 27 January. He is being charged with two counts of theft. Prosecutor Mrs Ellen Matenga said […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "Former Bulilima Councillor and liberation hero Cde Tony Mlotshwa laid to rest",
            "url": "https://www.chronicle.co.zw/former-bulilima-councillor-and-liberation-hero-cde-tony-mlotshwa-laid-to-rest/",
            "content": "Mthabisi Tshuma and Ronald Mpofu recently in Malisikwana, Bulilima\n\nFORMER Bulilima Rural District Council (RDC) councillor Cde Tonny Mlotshwa who was declared a liberation hero by President Emmerson Mnangagwa was on Sunday laid to rest at his rural home in Malisikwana village in Bulilima district.\n\nCde Mlotshwa died on January 18, at United Bulawayo Hospitals after a long illness.\n\nHe was voted into office as councillor for Ward 1 in 2013 and 2018 before he resigned due to illness in 2022.\n\nHe was 73.\n\nChief mourner, Bulilima MP Cde Dingumuzi Phuti said the district has lost a selfless and committed individual who wanted development for the district at large.\n\nIt is with a heavy heart that I stand before you after the untimely departure of a gallant son of the soil Cde Tonny Mlotshwa. It is a sad moment for the Mlotshwa family, the Kandana community and Bulilima District at large. I would like to express my deepest condolences for the loss of Cde Mlotshwa. The Government of Zimbabwe joins you in mourning his untimely death and celebrating his well lived life.\n\nZanu PF supporters dance and sing as they bid farwell to late former Bulilima Clr and liberation hero Cde Tonny Mlotshwa (Picture by Mthabisi Tshuma)\n\nI am very grateful that the President of Zimbabwe, His Excellency Cde E.D Mnangagwa has conferred a Liberation War Hero status to the late Cde Tonny Mlotshwa. Today we gather to honor the life and legacy of a true war and liberation hero, I stand before you as a representative of a grateful nation. Cde Tonny Mlotshwa and others were selfless warriors who fought tirelessly for our freedom and independence. Their bravery and sacrifice will never be forgotten. They faced unimaginable challenges and dangers, yet their dedication to the cause never waved, said Cde Phuti.\n\nBulilima MP Cde Dingumuzi Phuti (front: Second from left) and JOC members follow proceedings at the burial of former Bulilima Clr and liberation hero Cde Tonny Mlotshwa\n\nHe said through their unwavering courage and unrelenting spirit, Cde Mlotshwa and his fellow sons and daughters of the soil inspired countless others to join the fight for liberation.\n\nTheir contributions paved the way for the freedom and democracy we enjoy today. To the Mlotshwa family, may the love and support of those around you help you, through this difficult time. Cde Tonny Mlotshwa will be deeply missed but the memories of his contribution will live forever said Cde Phuti.\n\nMr Meluleki Mhlanga, a former teacher at Nyabane Primary School was directing proceedings with Chaplin Kambarami.\n\nMr Mhlanga who could be noticed being emotional, chronicled the work that was done by former Cllr Cde Mlotshwa to the society that include pushing agenda of bringing electricity to Nyabane, grading of road to Marula and Nyabane Clinic.\n\nThe late former ZANU PF Councillor for Ward 1 in Bulilima District, Cde Tony Mlotshwa\n\nHe also told the Minister that as if this was not enough Mrs Mlotshwa sourced donors who have built three cottages and sunk a borehole for Nyabane Clinic to add on to the wishes of her husband.\n\nHe pleaded with the Minister to ask relevant leaders not to forget the widow.\n\nMr Alister Mlotshwa a family member, spelt out the history of Cde Mlotshwa, the humble man who was a darling to the family and community. He is survived by wife Sithabile Mlotshwa, 8 children and 10 grandchildren.\n\nCde Mlotshwa was born on the 5th of May 1951 in Malisikwana Village, Tshankwa. He is survived by his wife Sithabile Mlotshwa, 8 children and 10 grandchildren.\n\nCde Mlotshwa worked for Supersonic for 21 years, then moved and worked at LabelClothing and finally the National Fence. He joined the Youth League from 1967-1974 and played an important role during the ZAPU anti colonial campaign. In 1974 he was elected to the position of Organizing Secretary and during this time he organised youth for Guerrilla training in Zambia till 1980.\n\nIn 2011 when he settled home, Cde Mlotshwa was elected District Chairman for Tshankwa District, which he led successfully and won the councillorship for ward 1 Tshankwa in the year 2013. In 2018, he worked so hard to retain the position of Councilor for ward 1 and he successfully did that.\n\nIn 2022 he stepped down from being a Councilor due to ill health but he remained a ZANU PF dedicated party member till the time of his death. He contributed immensely towards the development of Tshankwa ward.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-27-at-20.05.47-680x380.jpeg",
            "description": "Mthabisi Tshuma and Ronald Mpofu recently in Malisikwana, Bulilima FORMER Bulilima Rural District Council (RDC) councillor Cde Tonny Mlotshwa who was declared a liberation hero by President Emmerson Mnangagwa was on Sunday laid to rest at his rural home in Malisikwana village in Bulilima district. Cde Mlotshwa died on January 18, at United Bulawayo Hospitals […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "President Mnangagwa condemns cowardly M23 rebels attack in DRC",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-condemns-cowardly-m23-rebels-attack-in-drc/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa, who is also chairman of the Southern African Development Community (SADC) has strongly condemned the cowardly attacks on United Nations and SADC peacekeepers by M23 armed rebels in the Democratic Republic of Congo.\n\nRecent hostilities in the region have killed thousands, with millions fleeing their homes. In a statement on Monday, President Mnangagwa said the regional bloc will assume its full responsibility and take action to deal with the deteriorating security and humanitarian situation in Eastern DRC.\n\nThose responsible for the situation should be held accountable, he said.\n\nThe Chairman of SADC, His Excellency President Emmerson Dambudzo Mnangagwa expresses grave concern on the deteriorating security and humanitarian situation in the Eastern DRC occasioned by the offensive operations of the M23 rebels.\n\nThe Chairman condemns, unreservedly, the cowardly attacks on the UN and SADC peacekeepers that have resulted in some of them paying the ultimate sacrifice for the cause of peace in the Eastern DRC, reads part of the statement.\n\nPresident Mnangagwa has also conveyed his condolences to the victims.\n\nThe Chairman of SADC presents his condolences to the families of the deceased peace keepers and wishes those injured, a quick recovery, reads the statement.Both SADC and the African Union have issued statements denouncing the aggression by the rebel group.\n\nIn a statement at the weekend, the SADC Secretariat expressed concern at the recent attack on the SADC Force, the SAMIDRC, by the M23 armed group.SADC unequivocally condemns this act of aggression by the M23 operating in the Eastern DRC, such actions undermine the sovereignty, territorial integrity, and peace and security of the DRC and the SADC region, reads the statement.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ERYRFGDFGLG.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa, who is also chairman of the Southern African Development Community (SADC) has strongly condemned the cowardly attacks on United Nations and SADC peacekeepers by M23 armed rebels in the Democratic Republic of Congo. Recent hostilities in the region have killed thousands, with millions fleeing their homes. In a statement on Monday, […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "Victoria Falls residents call for greater involvement in service delivery",
            "url": "https://www.chronicle.co.zw/victoria-falls-residents-call-for-greater-involvement-in-service-delivery/",
            "content": "Leonard Ncube, in Victoria Falls\n\nAs the City of Victoria Falls awaits its budget to be approved by the Government, residents have expressed their expectation that the local authority will involve them in the implementation of service delivery activities.\n\nSpeaking in an interview, Victoria Falls Combined Residents Association (VIFACORA) chairperson Mr Kelvin Moyo said residents expect improved service delivery in 2025.\n\nHe emphasised the need for closer collaboration between councillors, local authority management, and residents to achieve better outcomes for the resort city.\n\nAs VIFACORA, we will continue participating in progressive meetings with the council and proffering solutions to address community challenges. We expect management and councillors to work together in collaboration, and councillors should maintain constant communication with the electorate by engaging residents on ongoing developments while providing regular feedback, said Mr Moyo.\n\nConcerns are often raised about office-bearers distancing themselves from the electorate after being ushered into office, only reconnecting during election time.\n\nMr Moyo urged councillors to familiarise themselves with the Urban Councils Act to ensure they make informed resolutions and effectively represent the interests of the residents who elected them.\n\nHe said that during the course of the year, the local authority should focus mainly on water and sewer reticulation, refuse collection, drainage, and other services.\n\nThe council submitted its US$22 million 2025 budget after revising it to include the 7 percent for sports facilities as directed by the Government.\n\nMr Moyo said residents were hopeful that their contributions during the budget-making process were considered in the financial statement.\n\nWe hope that the council took into consideration the contributions made by residents. We always support a participatory approach where residents are given room to speak about the actual needs of the community, like water-logging and flooding in Mkhosana.\n\nThe council management should guide councillors in coming up with a budget that includes the residents. Our wish is that they quickly address the issue of estimated water bills, which has been a persistent source of frustration for residents. We expect the perennial water problems plaguing the city to be addressed, he said.\n\nThe city is already constructing underground and elevated water reservoirs in Mkhosana after investing US$4 million into the water, sanitation, and hygiene project.\n\nMr Moyo commended the local authority for its efficient refuse collection, which has helped keep the city in its pristine state.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Kelvin-Moyo.jpg",
            "description": "Leonard Ncube, in Victoria Falls As the City of Victoria Falls awaits its budget to be approved by the Government, residents have expressed their expectation that the local authority will involve them in the implementation of service delivery activities. Speaking in an interview, Victoria Falls Combined Residents Association (VIFACORA) chairperson Mr Kelvin Moyo said residents […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "Delta contests Zimra tax amount assessment",
            "url": "https://www.chronicle.co.zw/delta-contests-zimra-tax-amount-assessment/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nLISTED beverages giant, Delta Corporation Limited, is contesting the tax assessments issued by the Zimbabwe Revenue Authority (ZIMRA) for amounts that they consider having been payable exclusively in foreign currency.\n\nThe group revealed the issue in its trading update for the quarter ended 31 December 2024 where it noted that the tax authoritys assessments do not consider the local currency payments made at the relevant time, which have since been debased through inflation and currency depreciation.\n\nAccording to Delta, the assessments have a material impact on the groups operations, if they materialise as per the exact assessments.\n\nThe firm has said that additional assessments were received in November 2024 adding to those assessed in 2022, to bring the disputed amount to US$73 million, which covers principal tax, penalties and interest for value added tax and income tax for periods 2019 to 2022.\n\nThe company said adverse judgements have been made by both the High Court and the Supreme Court, although there are appeals and new cases at various stages in the courts including the Constitutional Court and the Zimra appeals processes.\n\nThe group had paid a total of US$9,2 million as at 31 December 2024 in line with the pay now, argue later principle and pre-existing payment plans.\n\nThe firm pointed out that it believes any revisions to the payment plan will be rational, with due consideration of the financial health of the business and the fact that the principal amounts were fully paid in legal tender at the relevant periods, based on the best available interpretation of the legislation.\n\nMoreover, the group said it holds a significant amount in Treasury Bills receivable from the Government, which could be considered in the settlement of any tax liabilities that may finally be determined.\n\nThe group further noted reservations in the tax legislation which it said creates risks of further disagreements in interpretations and application to current taxes.\n\nThe company said management continues to engage with ZIMRA while appealing some legal and factual issues of the assessments and the judgments, with guidance from tax experts and legal counsel.\n\nThe ambiguities in the tax legislation are pervasive, thereby creating risks of further disagreements in interpretations and application to current taxes, said Delta.\n\nIt, however, expressed uncertainty on the timing of the resolution of the matter, citing that the current accounting treatment and disclosures of the assessments and the amounts paid so far are considered to be appropriate.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/02/delta.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmaiil.com LISTED beverages giant, Delta Corporation Limited, is contesting the tax assessments issued by the Zimbabwe Revenue Authority (ZIMRA) for amounts that they consider having been payable exclusively in foreign currency. The group revealed the issue in its trading update for the quarter ended 31 December 2024 where it noted that the tax […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "Council’s should embrace digitisation in order to achieve Vision 2030",
            "url": "https://www.chronicle.co.zw/councils-should-embrace-digitisation-in-order-to-achieve-vision-2030/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nCOUNCILS countrywide should fully embrace the digitisation process in order to achieve Vision 2030, which aims for an upper-middle-income economy, Zimbabwe Local Government Association (ZILGA) president Dr Aaron Shamu has said.\n\nThis comes in the wake of the Ministry of ICT, Postal and Courier Services, in collaboration with Potraz, donating 415 computers to 39 Rural District Councils (RDCs) on Monday.\n\nThe donation is expected to bridge the digital divide between RDCs and urban authorities.\n\nSpeaking at the handover ceremony, Dr Shamu said the donation of computers should ensure that councils carry out their duties effectively.\n\nThe donation is actually an enabler and a call to action to improve service delivery. It comes at a time when all authorities have just completed budget consultations and approvals. Four councils underwent performance appraisals, and one of the key components was e-Government. It was a key result that each council had to score.\n\nWith these gadgets, I would like to thank you as it will help councils to move at pace and get into the fourth generation that we are in. Equipping councils with such equipment will also help in lessening the burden of resource constraints that many of our councils face. I would also like to implore councils that this endeavour will help them move at pace towards Vision 2030. We cant move towards Vision 2030 if you are not digitalised, said Dr Shamu.\n\nDr Shamu commended the ICT Ministry and the Second Republic for their continued efforts in digitising the nation.\n\nHaving local authorities, especially the RDCs, remembered as the third tier of Government is quite an honour, Honourable Minister. We want to extend our heartfelt thanks to President Emmerson Mnangagwa for remembering this third tier of Government with this generous donation to 39 RDCs.\n\nWe hope the remaining 21 RDCs will also receive this significant donation, said Dr Shamu.\n\nFollow on X  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tgtg.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com COUNCILS countrywide should fully embrace the digitisation process in order to achieve Vision 2030, which aims for an upper-middle-income economy, Zimbabwe Local Government Association (ZILGA) president Dr Aaron Shamu has said. This comes in the wake of the Ministry of ICT, Postal and Courier Services, in collaboration with Potraz, donating 415 computers to […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "Cop up for rape of 13-year-old girl",
            "url": "https://www.chronicle.co.zw/cop-up-for-rape-of-13-year-old-girl/",
            "content": "Sinokubonga Nkala,[emailprotected]\n\nA 39-year-old police officer from Jambezi, Matabeleland North has been arrested for allegedly raping a 13-year-old girl.\n\nOn January 18, 2025, at approximately 12.30AM, the accused attacked a 13-year-old girl who was with her cousin at the time.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) in an official statement on X, said: The police officer then dragged the complainant behind the shops where he fondled her breasts and kissed her, before he raped her, read the statement.\n\nIn a bid to buy her silence, the police officer bought her soft drinks, biscuits and beer in a desperate bid to conceal his heinous crime.\n\nThe NPAZ said the police officer was remanded to February 7, 2025\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gavel.jpg",
            "description": "Sinokubonga Nkala, sinokubongapnkala@gmail.com A 39-year-old police officer from Jambezi, Matabeleland North has been arrested for allegedly raping a 13-year-old girl. On January 18, 2025, at approximately 12.30AM, the accused attacked a 13-year-old girl who was with her cousin at the time. The National Prosecuting Authority of Zimbabwe (NPAZ) in an official statement on X, said: […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "Zvishavane man caged 35 years for murder.",
            "url": "https://www.chronicle.co.zw/zvishavane-man-caged-35-years-for-murder/",
            "content": "Sinokubonga Nkala,[emailprotected]\n\nA Zvishavane man has been handed a hefty 35-year prison sentence for the savage murder of a 22-year-old, who was stabbed a staggering 14 times in a furious attack outside a local bottle store\n\nThe attack happened on June 10, 2019, around 10.45PM, where Solomon Ndlovu Mutombeni, Tinashe Siziba and several others were drinking together at Muneme Bottle Store.\n\nA dispute broke out between Mutombeni and Siziba.\n\nMutombeni pulled out a kitchen knife, prompting Siziba to flee, but Mutombeni gave chase and caught up to him just 50 meters away from the bottle store.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, The now-deceased was stabbed 14 times resulting in his bowls gashing out and collapsing to the ground.\n\nThe victim was taken to the hospital, but tragically died before arrival.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Sinokubonga Nkala, sinokubongapnkala@gmail.com A Zvishavane man has been handed a hefty 35-year prison sentence for the savage murder of a 22-year-old, who was stabbed a staggering 14 times in a furious attack outside a local bottle store The attack happened on June 10, 2019, around 10.45PM, where Solomon Ndlovu Mutombeni, Tinashe Siziba and several others […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "New appointments made to ZBC, BAZ and Transmedia boards",
            "url": "https://www.chronicle.co.zw/new-appointments-made-to-zbc-baz-and-transmedia-boards/",
            "content": "Online Reporter\n\nThe Ministry of Information, Publicity and Broadcasting Services has made new appointments to the Zimbabwe Broadcasting Corporation, the Broadcasting Authority of Zimbabwe, and the Transmedia Boards.\n\nIn a statement by the Acting Secretary for Information, Publicity and Broadcasting Services, Mr Jonathan Gandari, it was announced that on the ZBC board, Mr Tapson Zvetero has been appointed as the Acting Board Chair and Non-Executive Director, while Mr Martin Kweza has been appointed as a Non-Executive Board member.\n\nAt BAZ, Mr Valentine Maturu is the Board Chairman, while Mr Chaplin Chinyanga is a Non-Executive Director.\n\nMr Lawrence Nkala has been appointed as Board Chairman for Transmedia.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/ict.jpg",
            "description": "Online Reporter The Ministry of Information, Publicity and Broadcasting Services has made new appointments to the Zimbabwe Broadcasting Corporation, the Broadcasting Authority of Zimbabwe, and the Transmedia Boards. In a statement by the Acting Secretary for Information, Publicity and Broadcasting Services, Mr Jonathan Gandari, it was announced that on the ZBC board, Mr Tapson Zvetero […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        },
        {
            "title": "Nketa Honda Fit accident: Death toll rises to two; driver up for culpable homicide",
            "url": "https://www.chronicle.co.zw/nketa-honda-fit-accident-death-toll-rises-to-two-driver-up-for-culpable-homicide/",
            "content": "Ronald Mpofu, Online Reporter\n\nThe death toll has risen to two in the incident where a Honda Fit ploughed into 11 members of the Johanne Masowe Church who were returning from night prayers in Nketa, Bulawayo, on Sunday morning, police have confirmed.\n\nThe driver of the Honda Fit, police said, is facing charges of culpable homicide after losing control of his car.\n\nOne person died on the spot, and the other succumbed to their injuries after being hospitalised at Mpilo Central Hospital.\n\nThe victim who died on the spot was trapped underneath the vehicle and had to be extricated by members of the Bulawayo Fire Brigade, who arrived at the scene shortly after the tragic incident.\n\nActing Bulawayo Police Provincial Spokesperson Assistant Inspector Nomalanga Msebele said Monica Tichava (41) and Loraine Ruvarashe Shoko (17), both females from Nketa 6, were the victims of the accident.\n\nOn 26th January 2025, at approximately 5:00 a.m., a 29-year-old male driver from Gwabalanda, Bulawayo, lost control of his silver Honda Fit while driving along Nketa Drive with three passengers. The vehicle veered off the road and struck 11 pedestrians walking in the same direction.\n\nThe accident resulted in two pedestrian fatalities and nine others being injured. One passenger from the vehicle was also injured, bringing the total number of injured to 10. The injured were transported to Mpilo Hospital for treatment, while the deceased were taken to the United Bulawayo Hospitals (UBH) mortuary for post-mortem examinations, said Assistant Inspector Msebele.\n\nShe said the accident was caused by speeding, and the driver is facing charges.\n\nThe cause of the accident was due to speeding and the drivers failure to keep the motor vehicle under proper control, hence a charge of culpable homicide has been preferred against him, said Assistant Inspector Msebele.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ggffgg.jpg",
            "description": "Ronald Mpofu, Online Reporter The death toll has risen to two in the incident where a Honda Fit ploughed into 11 members of the Johanne Masowe Church who were returning from night prayers in Nketa, Bulawayo, on Sunday morning, police have confirmed. The driver of the Honda Fit, police said, is facing charges of culpable […]",
            "time": "20:39",
            "date": "27 Jan 2025"
        }
    ]
}