{
    "news": [
        {
            "title": "Shaka iLembe returns for Season 2 in June",
            "url": "https://www.chronicle.co.zw/shaka-ilembe-returns-for-season-2-in-june/",
            "content": "Arts Correspondent\n\nThe wait is over!\n\nShaka iLembe returns to claim its throne for an electrifying second season, premiering exclusively on Mzansi Magic on Sunday, 15 June at 20:00 CAT.\n\nFollowing a ground-breaking first season that captivated audiences across South Africa and beyond, the saga continues.\n\nMore than just a visual spectacle, Season 1 became a cultural phenomenon. Sparking conversations, evoking deep emotions, and leaving an indelible mark on the storytelling landscape.\n\nThe groundbreaking series that won a total of 12 South African Film and Television Awards (SAFTA), securing its place as a landmark in South African storytelling, continues with a powerful new chapter. Lemogang Tsipa once again embodies the formidable Shaka, while Thembinkosi Mthembu, SAFTA Best Actor winner for his role in Season 1, delivers another gripping performance as Dingiswayo. Together, they set the stage for a story driven by ambition, sacrifice, and unrelenting power.\n\nPreviously, audiences followed Shakas journey into manhood, shaped by trials that defined his destiny. Alongside his story, Dingiswayos exile and unwavering devotion to Baleka saw him fight against death and slavery itself to reclaim his place in history. Meanwhile, Queen Nandi refusing to be silenced by the will of men, stood resolute in her love for her son, defying expectations with unshakable determination.\n\nFrom university halls to social media, airwaves, and living rooms, the verdict was unanimous! This was storytelling at its most formidable, a triumph of history and cinematic excellence.\n\nSeason 2 picks up as Shaka and Nandi arrive at KwaNobamba, where he begins his reign as the new Zulu King. The stakes have never been higher.\n\nSeason 2 is a journey into the very soul of Shakas world, says Nomsa Philiso, CEO of General Entertainment at MultiChoice. We get to explore Shaka the King, the strategist, the visionary  as he builds an empire.\n\nThe returning cast delivers renewed intensity to the unfolding drama. Nomzamo Mbatha embodies resilience as Nandi, following her Best African Actress win at the 2024 Septimius Awards in Amsterdam for her role in season 1. Sheli Masondo also received Best Costume Design for her exceptional work on the series. The international recognition underscores the shows global impact.\n\nAlso returning are Wiseman Mncube as the ruthless Zwide, Dawn Thandeka King as the formidable Mkabayi and narrator. Indomitable in this role, she exudes authority while remaining utterly captivating, holding the audience in her hand and taking us on this journey. It is a spine-tingling experience when you hear her voice on screen, a svelte cinematic touch that enhances the drama. Khabonina Qubeka returns as the power-driven Ntombazi, and Mondli Makhoba as the steadfast Ngomane.\n\nSeason 2 expands the story, introducing new characters who will leave their mark on history.\n\nThe new cast members are an explosion of talent. They bring fresh energy, exploring the complexities of power, love, and loyalty in the turbulent era, says Desiree Markgraaff, partner and Executive Producer for Shaka iLembe.\n\nAnd there are many new stories we explore, taking us to the majestic mountains of the Swati kingdom through to the rolling hills of the Xhosa. South Africa is rich with characters, and were just beginning to uncover them. Stay tuned. Desiree concluded.\n\nThe stage is set. Shaka iLembe Season 2 premires Sunday, 15 June at 20:00 CAT, only on Mzansi Magic. dstv\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Tsipa.jpg",
            "description": "Arts Correspondent The wait is over! Shaka iLembe returns to claim its throne for an electrifying second season, premiering exclusively on Mzansi Magic on Sunday, 15 June at 20:00 CAT. Following a ground-breaking first season that captivated audiences across South Africa and beyond, the saga continues. More than just a visual spectacle, Season 1 became […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "Gwanda State University main campus approved, set to transform education and local economy",
            "url": "https://www.chronicle.co.zw/gwanda-state-university-main-campus-approved-set-to-transform-education-and-local-economy/",
            "content": "Nqobile[emailprotected]\n\nIn a landmark development for higher education and regional growth, Gwanda Municipality has approved the masterplan for the construction of Gwanda State Universitys main campus. The new campus, to be situated in Gwanda, will replace the universitys temporary base at the Epoch Mine Campus in Insiza, marking a significant step forward in the institutions expansion and development.\n\nThe approved masterplan outlines a state-of-the-art campus that will occupy 90 hectares of land and feature high-rise buildings, a medical school, an industrial park, and a multipurpose sporting facility designed to meet Olympic standards. Additionally, the campus will include a student services centre and a 5-megawatt solar plant, which will not only power the university but also supply excess energy to local communities.\n\nGwanda State Universitys Vice-Chancellor, Professor Bernard Nthambeleni, described the approval as a transformative milestone for the institution and the region. This development will not only enhance the quality of education we offer but also contribute significantly to the socio-economic development of Gwanda and surrounding areas. The inclusion of a medical school and industrial park will create opportunities for research, innovation, and job creation, he said.\n\nThe new campus is expected to bolster the universitys capacity to attract students and faculty while providing cutting-edge facilities for teaching, research, and community engagement. The industrial park, in particular, is envisioned as a hub for collaboration between academia and industry, fostering innovation and entrepreneurship.\n\nGwanda Mayor, Councillor Thulani Moyo, hailed the project as a game-changer for the town.The construction of the main campus will bring immense benefits to Gwanda, including job creation, infrastructure development, and increased economic activity. We are excited to see this vision come to life and look forward to the positive impact it will have on our community, he said.\n\nWhile the main campus will be established in Gwanda, the Epoch Mine Satellite Campus will remain operational, ensuring continuity for current students and staff. The universitys leadership has assured stakeholders that the transition will be seamless, with minimal disruption to academic activities.\n\nThe project is also expected to contribute to sustainable development through the construction of the 5-megawatt solar plant. This initiative aligns with national efforts to promote renewable energy and reduce reliance on traditional power sources.\n\nAs Gwanda State University prepares to break ground on its new campus, the development is being hailed as a testament to the governments commitment to expanding access to quality education and driving regional development. The project is set to position Gwanda as a hub for education, innovation, and economic growth in Matabeleland South Province.\n\nMore to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/UnMNBM.jpg",
            "description": "  Nqobile Tshilinqobile.tshili@chronicle.co.zw In a landmark development for higher education and regional growth, Gwanda Municipality has approved the masterplan for the construction of Gwanda State University’s main campus. The new campus, to be situated in Gwanda, will replace the university’s temporary base at the Epoch Mine Campus in Insiza, marking a significant step forward in […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "St Francis Home receives vital donation to support children with disabilities",
            "url": "https://www.chronicle.co.zw/st-francis-home-receives-vital-donation-to-support-children-with-disabilities/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nST Francis Home, a Government-owned institution in Bulawayo that cares for children with severe learning and physical disabilities, has received a significant boost through a donation of groceries, clothing, and detergents.\n\nThe donation was made by the National Organisation for Development and Empowerment (NODE), Bulawayo Province, an affiliate of the ruling Zanu PF.\n\nBulawayo Provincial Education Director (PED) presents a gift to one of the children housed at St Francis home in Bulawayo\n\nAn annex of Ingutsheni Central Hospital, the home, cares for 42 children.\n\nMatron Vongai Chimbindi, Senior Nursing Officer at St Francis Home, expressed gratitude for the donation, highlighting its timely nature as winter approaches.\n\nThe tracksuits will keep our children warm and cosy during the cold season. The groceries and detergents are a welcome addition, especially as we rely on well-wishers and the business community to complement Government efforts in running the home efficiently, said Matron Chimbindi.\n\nNODE Bulawayo Province Chairperson, Mr Edison Muchenje, explained that the donation aligns with President Mnangagwas call for collective action towards national development.\n\nNODE Bulawayo province members, government officials, and St Francis Home staff members pose for a photo at St Francis home.\n\nHe emphasised NODEs commitment to uplifting vulnerable communities and ensuring they live dignified lives.\n\nThis donation was made possible through the generous contributions of NODE members in Bulawayo Province and the local business community, said Mr Muchenje.\n\nHe revealed that Halsted Builders Express has pledged to drill a borehole at the home, while TelOne will provide free WiFi for educators and staff at St Francis Special School.\n\nSome of the groceries that NODE, Bulawayo province donated to St. Francis home\n\nEstablished in 1958, St Francis Home operates under the Ministry of Health and Child Care and continues to rely on donations and partnerships to meet the needs of its residents. The latest contribution marks a significant step in supporting the homes mission to provide care and comfort to children with disabilities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jkkjjk.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com ST Francis Home, a Government-owned institution in Bulawayo that cares for children with severe learning and physical disabilities, has received a significant boost through a donation of groceries, clothing, and detergents. The donation was made by the National Organisation for Development and Empowerment (NODE), Bulawayo Province, an affiliate of the ruling Zanu […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "President Mnangagwa addresses 381st Politburo Session, highlights progress and challenges",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-addresses-381st-politburo-session-highlights-progress-and-challenges/",
            "content": "Online WriterZIMBABWEs President and First Secretary of Zanu PF, Emmerson Mnangagwa, addressed the 381st Ordinary Session of the Politburo on 5 March 2025, reflecting on the partys achievements, ongoing challenges, and future priorities.\n\nThe session, the first of the year, focused on critical issues affecting the nation, including the ongoing cell verification exercise and preparations for the 45th National Independence Day celebrations.\n\nMnangagwa began by paying tribute to recently departed national heroes, including Major General (Rtd) Solomon Siziba, Cde Chenhamo Chimutengwende, and former Namibian President Sam Nujoma, urging attendees to observe a moment of silence in their honour.\n\nThe President highlighted ZANU PFs commitment to people-centred development, citing significant progress in infrastructure, agriculture, mining, tourism, and ICT sectors.He emphasised the importance of unity and hard work in achieving the partys goals, particularly in uplifting the livelihoods of Zimbabweans.Mnangagwa also warned against neo-colonial influences and divisive narratives, urging party members to remain vigilant in safeguarding the partys revolutionary principles.\n\nOn agriculture, Mnangagwa expressed optimism about a bumper harvest following favourable rains, commending farmers and stakeholders for surpassing planting targets.He praised Dr Anxious Masuka, Minister of Lands, Agriculture, Fisheries, Water, and Rural Development, for being named Best Minister at the World Governments Summit in Dubai.\n\nThe President reiterated Zanu PFs focus on youth and women empowerment, noting recent Memoranda of Understanding signed with South Africa and Rwanda in the area of Youth Affairs.He also addressed regional security concerns, particularly in the Democratic Republic of Congo, advocating for sustainable dialogue and conflict resolution mechanisms.\n\nPresident Mnangagwa emphasised the importance of unity, peace, and development, urging party members to remain steadfast in their service to the nation.The session set the tone for Zanu PFs agenda in 2025, with a focus on economic growth, national unity, and the implementation of party policies.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/mrp.jpg",
            "description": "Online Writer ZIMBABWE’s President and First Secretary of Zanu PF, Emmerson Mnangagwa, addressed the 381st Ordinary Session of the Politburo on 5 March 2025, reflecting on the party’s achievements, ongoing challenges, and future priorities.   The session, the first of the year, focused on critical issues affecting the nation, including the ongoing cell verification exercise […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "Mayor’s Anti-Litter Marathon hits 10-year milestone",
            "url": "https://www.chronicle.co.zw/mayors-anti-litter-marathon-hits-10-year-milestone/",
            "content": "Thupeyo Muleya Beitbridge BureauBEITBRIDGE Mayors anti-litter half marathon is set to mark its 10th anniversary this year, continuing its mission to promote a clean and safe environment in the border town and along major highways leading to Bulawayo and Harare.Scheduled for June 22, the event aims to address the persistent issue of littering, which remains a significant challenge for the local authority.\n\nBeitbridge reportedly generates over 1 000 tonnes of solid waste monthly, with the municipality managing to collect around 700 tonnes.The marathon will feature a variety of races, including a 21,1km run, 10km and 5km walks, and Paralympics events.Approximately 500 athletes are expected to participate.The Beitbridge Municipality, supported by several partners, has been preparing for the event since early this year to ensure a successful and well-attended race.The route will remain the same as in previous years, starting from Mutetenwa Business Centre and ending at the town centre house.\n\nRegistration for the event is now open, with a fee of US$10 or its equivalent in local currency.Participants can register at the Beitbridge Municipalitys main offices or the housing offices in the Dulivhadzimu Suburb.Additional registration platforms will be announced later.The organisers are encouraging disabled individuals and cyclists to participate in large numbers.\n\nRace spokesperson Raniel Ndou emphasised the importance of making this years event unique, given its 10th anniversary.The theme for this years marathon will be revealed at a later date.The event not only promotes fitness but also raises awareness about the importance of maintaining a clean environment, a critical issue for Beitbridge and its surrounding areas.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/frfrfr.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau BEITBRIDGE Mayor’s anti-litter half marathon is set to mark its 10th anniversary this year, continuing its mission to promote a clean and safe environment in the border town and along major highways leading to Bulawayo and Harare. Scheduled for June 22, the event aims to address the persistent issue of littering, […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "Beauty with a purpose: Sinokubonga Nkala champions women’s empowerment on the Miss Ebony Zimbabwe Pageant",
            "url": "https://www.chronicle.co.zw/beauty-with-a-purpose-sinokubonga-nkala-champions-womens-empowerment-on-the-miss-ebony-zimbabwe-pageant/",
            "content": "Online Writer\n\nIN a world where beauty pageants are often criticised for their superficiality, Sinokubonga Nkala, a 21-year-old semi-finalist in the Miss Ebony Zimbabwe pageant, is proving that beauty can be a powerful tool for positive change.\n\nThe Miss Ebony Zimbabwe pageant is a prestigious beauty and empowerment competition that celebrates the beauty, intelligence, and cultural heritage of Zimbabwean women.\n\nMiss Ebony has expanded to other African countries, including Zimbabwe.\n\nStunning, with a winning smile, Sinokubonga is vying for the prestigious award with a bevy of 20 other beauties.\n\nSinokubonga Nkala\n\nThe dynamic young woman has already made a name for herself as the Second Princess in the Miss 2K Bulawayo beauty pageant. Now, she is taking her passion for empowering women and giving back to the community to the national stage as a semi-finalist in the Miss Ebony Zimbabwe pageant.\n\nI am filled with a sense of pride, gratitude, and excitement, Sinokubonga said in a recent interview. Being in the semi-finals of Miss Ebony Zimbabwe is a dream come true, and Im honoured to have the opportunity to make a difference in the lives of women and girls in my community.\n\nThe vivacious beautys commitment to empowering women and supporting her community is nothing new.\n\nLast year, she served as an autism awareness ambassador, visiting Sibantubanye Primary School in Bulawayo and donating to support the education of children with autism.\n\nHer experience as an ambassador not only deepened her understanding of the challenges faced by marginalised communities but also instilled in her a sense of purpose and responsibility.\n\nNow, as she takes her striking beauty to the stage as a semi-finalist in the Miss Ebony Zimbabwe pageant, Sinokubonga is channelling her energy into empowering women and providing them with the tools and resources they need to succeed.\n\nHer dream is to establish a school that offers courses and training for women to become freelancers or start their own businesses.\n\nI want to provide women with the skills and knowledge they need to succeed in the business world, Sinokubonga explained.\n\nI want to host workshops and training sessions headlined by mentors that teach women how to be business experts, and then organise a business plan competition to fund women with the best ideas. Im keeping my fingers crossed that Miss Ebony Zimbabwe will make my dream come true, she said. Im asking everyone to register, sign in, and vote for me using the link provided.\n\nhttps://eventwiz.space/missebony/\n\nBy voting for Sinokubonga, youll not only be supporting a talented and dedicated young woman but also contributing to a larger movement of womens empowerment and community development.\n\nAs Sinokubonga is fond of saying, Modelling is not just about beauty; its about using your platform to make a positive impact on the world. Im proud to be a part of this movement, and I hope youll join me on this journey.\n\nKindly register now and vote for contestant number 4, Sinokubonga Nkala, the Miss Ebony Zimbabwe semi-finalist who is using her beauty and talent to empower women and give back to her community.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jkj..jpg",
            "description": "Online Writer IN a world where beauty pageants are often criticised for their superficiality, Sinokubonga Nkala, a 21-year-old semi-finalist in the Miss Ebony Zimbabwe pageant, is proving that beauty can be a powerful tool for positive change. The Miss Ebony Zimbabwe pageant is a prestigious beauty and empowerment competition that celebrates the beauty, intelligence, and […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "Muskwe up and about",
            "url": "https://www.chronicle.co.zw/muskwe-up-and-about/",
            "content": "Online Reporter\n\nWARRIORS attacking player Admiral Muskwe is set to return from injury ahead of the start of the 2025 Finnish top-flight league next month.\n\nMuskwe picked the injury in early February, just weeks after joining IFK Mariehamn.\n\nHe featured in one game, before suffering the setback at training.\n\nAccording to an IFK Mariehamn injury report on the leagues website, the Zimbabwean will return ahead of the season start.\n\nThe report states: There is also some light in the injury situation. Noah Nurmi, who was on the sick list early last season, is already in almost full training camp. Matias Kivikko Arrao is returning to the lineup this week and the attacking duo Olawale Tehe and Admiral Muskwe are also expected to be fit in time for the start of the Veikkausliiga season.\n\nThe Finnish top-flight league will start on 5 April.\n\nMeanwhile, Muskwe is likely to miss the Warriors World Cup Qualifiers Group C games against Nigeria and Benin later this month.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kiolkiolk.jpg",
            "description": "  Online Reporter WARRIORS attacking player Admiral Muskwe is set to return from injury ahead of the start of the 2025 Finnish top-flight league next month. Muskwe picked the injury in early February, just weeks after joining IFK Mariehamn. He featured in one game, before suffering the setback at training. According to an IFK Mariehamn […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "Watch : President Mnangagwa reaffirms commitment to disability inclusion at State House meeting",
            "url": "https://www.chronicle.co.zw/watch-president-mnangagwa-reaffirms-commitment-to-disability-inclusion-at-state-house-meeting/",
            "content": "Online Writer\n\nHARARE  President Emmerson Mnangagwa has reaffirmed the Governments commitment to the inclusion and empowerment of persons with disabilities (PWDs) during a high-level meeting at State House on 5 March 2025.\n\nThe event brought together PWDs, government officials, and stakeholders to discuss strategies for advancing disability rights and ensuring their full participation in national development.\n\nIn his address, President Mnangagwa highlighted the progress made since the launch of the National Disability Policy in June 2021, which aligns with international conventions such as the United Nations Convention on the Rights of Persons with Disabilities and the African Agenda 2063.He emphasised the importance of leaving no one behind in the countrys journey towards achieving Vision 2030, a blueprint for Zimbabwes socio-economic transformation.\n\nGuided by our mantra of leaving no one and no place behind, be assured that your voices will always be heard in the formulation of national development policies and programmes, said President Mnangagwa.He commended efforts to promote inclusivity, including the recognition of Sign Language as one of Zimbabwes 16 official languages and the adoption of braille and other accessible communication formats.\n\nThe President also outlined government initiatives to support PWDs, including the establishment of Departments for Gender Mainstreaming, Inclusivity, and Wellness across ministries.He urged the nation to embrace innovative and inclusive development models, particularly in sectors such as agriculture, mining, and business, to empower PWDs economically.\n\nSpecial Advisor on National Disability Issues, Cde Rose Mpofu, echoed the Presidents sentiments, pledging to roll out high-impact programmes for the empowerment of PWDs.She highlighted the success of the Zimbabwe National Disability Expo, which provides a platform for PWDs to showcase their talents and engage with government, private sector, and civil society stakeholders.\n\nPresident Mnangagwa called for the expedited enactment of the Persons with Disabilities Bill and challenged stakeholders to develop a credible database for effective programming and monitoring of disability-related initiatives.\n\nThe meeting concluded with a call for unity and collective action to build a modern, industrialised Zimbabwe. Together, in unity, let us rally our collective skills and willpower to build, modernise, and industrialise our beloved motherland, Zimbabwe. Brick by brick and stone upon stone, we are realising Vision 2030, said the President.\n\nThe event underscored the governments determination to ensure that PWDs are integral to the countrys development agenda, fostering a more inclusive and equitable society.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/THOXO-1.jpg",
            "description": "Online Writer HARARE – President Emmerson Mnangagwa has reaffirmed the Government’s commitment to the inclusion and empowerment of persons with disabilities (PWDs) during a high-level meeting at State House on 5 March 2025. The event brought together PWDs, government officials, and stakeholders to discuss strategies for advancing disability rights and ensuring their full participation in […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "President Mnangagwa chairs Zanu PF Politburo Meeting at party headquarters",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-chairs-zanu-pf-politburo-meeting-at-party-headquarters/",
            "content": "Online Writer\n\nHARARE  This afternoon, President Emmerson Mnangagwa, who is also the First Secretary of the ruling Zanu PF party, is chairing an Ordinary Session of the Politburo at the partys headquarters in Harare.The meeting brings together senior party officials to discuss key national and party issues, as well as strategies to advance the partys agenda.\n\nThe Politburo, Zanu PFs highest decision-making body outside of Congress, plays a critical role in shaping the partys policies and direction.The session comes at a time when Zanu PF is intensifying efforts to mobilise support and implement its vision for national development, aligned with the countrys Vision 2030 agenda.\n\nThe meeting is also expected to review progress on key party programmes and address challenges affecting the party and the nation.Zanu PF has consistently emphasised the importance of unity and collective action in achieving its goals, and todays session is likely to reinforce this message.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/nbmh.jpg",
            "description": "Online Writer HARARE – This afternoon, President Emmerson Mnangagwa, who is also the First Secretary of the ruling Zanu PF party, is chairing an Ordinary Session of the Politburo at the party’s headquarters in Harare. The meeting brings together senior party officials to discuss key national and party issues, as well as strategies to advance […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        },
        {
            "title": "54-year-old man convicted for assaulting 93-year-old father",
            "url": "https://www.chronicle.co.zw/54-year-old-man-convicted-for-assaulting-93-year-old-father/",
            "content": "Langelihle Nyathi,[emailprotected]\n\nA 54-YEAR-OLD man from Mwasaya Village, Chipinge, has been convicted of domestic violence after assaulting his 93-year-old father in a shocking incident that occurred on 23 February 2025.\n\nAccording to the National Prosecuting Authority of Zimbabwe (NPA), the incident took place around 1 AM when the offender returned home and began shouting at his elderly father. He forcibly entered the old mans room, destroyed property with a machete, and struck his father on the head with a metal object, causing a deep cut.\n\nThe elderly victim was medically examined, and a report was compiled as evidence. The offender, who is unemployed and resides in the same village as his father, was found guilty by the Chipinge Magistrates Court and sentenced to 210 hours of community service.\n\nThe case highlights the distressing reality of domestic violence, particularly against vulnerable elderly individuals. The NPA has reiterated its commitment to combating such crimes and ensuring justice for victims.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Virtual-lifers-banner-photo-680x380.jpg",
            "description": "Langelihle Nyathi,langae2001@gmail.com A 54-YEAR-OLD man from Mwasaya Village, Chipinge, has been convicted of domestic violence after assaulting his 93-year-old father in a shocking incident that occurred on 23 February 2025. According to the National Prosecuting Authority of Zimbabwe (NPA), the incident took place around 1 AM when the offender returned home and began shouting at […]",
            "time": "18:38",
            "date": "05 Mar 2025"
        }
    ]
}