{
    "news": [
        {
            "title": "Nkayi man jailed 20 years for axing fellow reveller to death",
            "url": "https://www.chronicle.co.zw/nkayi-man-jailed-20-years-for-axing-fellow-reveller-to-death/",
            "content": "Fairness Moyana in Hwange\n\nA MAN from Nkayi District who went berserk and fatally struck a fellow reveller with an axe following dispute over an unknown issue has been convicted of murder and sentenced to 20 years in jail.Mthabisi Ndimande (23) of Macala Village in Somakandana area under Chief Sikhobokhobo was convicted for murder of Xolisani Nkomo following a full trial by Bulawayo High Court judge, Justice Nokuthula Moyo at the Hwange circuit.The deceased was 39 years of age at the time of death and resided at Master Nkomos homestead, Lubanda Village 4 in Bubi District under Chief Mtshane.The court heard that on 5 August 2024 at around 10:30PM Mthabisi and the deceased were at DZ Sports Bar at Turk Mine Business Centre in Inyathi where they were drinking beer with other patrons.The two were later seen shouting at each other over an unknown issue. A security guard at the bar, Mlindeli Sibanda restrained them. The deceased sat down while the accused was standing.All of a sudden Mthabisi withdrew an axe from his waist and struck the deceased once on the head and he fell to the ground.The axe remained stuck in the head and the accused removed it and walked away leaving the deceased bleeding profusely.Ten minutes later he returned and shook the deceased before walking away again. The deceaseds father was called to the scene who ferried him to the hospital where he died on 6 May 2024.Police attended the scene and investigations led to the recovery of the axe. Mthabisi was subsequently arrested.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/07/behind-bars1.jpg",
            "description": "Fairness Moyana in Hwange A MAN from Nkayi District who went berserk and fatally struck a fellow reveller with an axe following dispute over an unknown issue has been convicted of murder and sentenced to 20 years in jail. Mthabisi Ndimande (23) of Macala Village in Somakandana area under Chief Sikhobokhobo was convicted for murder […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Man jailed for 24 years for raping and robbing a commercial sex worker",
            "url": "https://www.chronicle.co.zw/man-jailed-for-24-years-for-raping-and-robbing-a-commercial-sex-worker/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA 32-YEAR-OLD man from Tshitaudze suburb in Beitbridge has been sentenced to an effective 24 years in prison for robbing and raping a commercial sex worker at knifepoint.\n\nMoses Mukonowenzou denied charges of robbery and rape when he appeared before Beitbridge Regional Magistrate Ms Charity Maphosa but was convicted based on the strength of the States evidence.\n\nFor the charge of robbery, Mukonowenzou was sentenced to 8 and a half years in prison, while he received a 15-year sentence for rape. The sentences will run consecutively, resulting in an effective 24-year jail term.\n\nProsecuting, Mr Willbrought Muleya said on 9 January this year, during a rainstorm, the accused, who was known to the complainant, went to her house seeking sexual services.\n\nMukonowenzou knocked on the window of the house, asking the complainant to open the door for transactional sex.\n\nUpon entering the house, Mukonowenzou grabbed the woman by her neck and strangled her, demanding money and her cell phone.\n\nThe complainant handed over R200 and a Nokia C10 cellphone, with a total value of R800.\n\nAfter robbing her, Mukonowenzou raped the complainant while armed with an Okapi knife, threatening to fatally stab her if she screamed to alert neighbours.\n\nFollowing the assault, Mukonowenzou ordered the victim to open the door for him before leaving the premises.\n\nAs soon as he left, the woman informed another tenant about the incident and was advised to report the matter to the police. The authorities swiftly arrested Mukonowenzou.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A 32-YEAR-OLD man from Tshitaudze suburb in Beitbridge has been sentenced to an effective 24 years in prison for robbing and raping a commercial sex worker at knifepoint. Moses Mukonowenzou denied charges of robbery and rape when he appeared before Beitbridge Regional Magistrate Ms Charity Maphosa but was convicted based on […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "SADC leaders hold emergency summit on escalating DRC conflict",
            "url": "https://www.chronicle.co.zw/sadc-leaders-hold-emergency-summit-on-escalating-drc-conflict/",
            "content": "Online WriterHarare  Southern African Development Community (SADC) leaders convened an extraordinary virtual summit today, chaired by Zimbabwean President and SADC Chairperson Emmerson Mnangagwa, to address the worsening security crisis in the Democratic Republic of Congo (DRC).The high-level meeting brought together Heads of State and Government from across the region amid growing instability in the eastern DRC, where renewed clashes between government forces and armed groups have displaced thousands and heightened regional tensions.Fuelled by local and foreign-backed militias, the conflict has led to a humanitarian crisis, with reports of mass displacements and worsening conditions for civilians.The regional bloc has previously called for a diplomatic and military approach to stabilising the DRC, with SADC forces deployed alongside Congolese troops.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jhfyufygugu.jpg",
            "description": "Online Writer Harare – Southern African Development Community (SADC) leaders convened an extraordinary virtual summit today, chaired by Zimbabwean President and SADC Chairperson Emmerson Mnangagwa, to address the worsening security crisis in the Democratic Republic of Congo (DRC). The high-level meeting brought together Heads of State and Government from across the region amid growing instability […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "JSC to recruit eight Labour Court Judges, calls for public nominations",
            "url": "https://www.chronicle.co.zw/jsc-to-recruit-eight-labour-court-judges-calls-for-public-nominations/",
            "content": "Nqobile Bhebhe,Online Writer\n\nTHE Judicial Services Commission (JSC) is set to recruit eight Labour Court judges and has invited members of the public to nominate suitably qualified candidates to fill the vacancies.\n\nIn a notice issued by the commission, the candidates must be Zimbabwean citizens aged 40 years or older, qualified legal practitioners, and have practiced under the Roman-Dutch or English legal systems, among other requirements.\n\nThe Judicial Service Commission announces that eight (8) vacancies for Judges have arisen in the Labour Court of Zimbabwe. In terms of section 180 (4)(b) of the Constitution of Zimbabwe, members of the public are hereby invited to nominate suitably qualified persons to fill the above positions in the Labour Court, reads part of the notice.\n\nA person is qualified for appointment as a judge of the Labour Court, if he or she is at least forty years old and, in additionif he or she is or has been a judge of a court with unlimited jurisdiction in civil or criminal matters in a country in which the common law is Roman-Dutch or English and English is an officially recognised language, or for at least seven years, whether continuously or not, he or she has been qualified to practise as a legal practitioner.\n\nAdditionally, the commission noted that to be appointed as a judge of the Labour Court, a candidate must be a fit and proper person to hold judicial office.\n\nAspiring candidates are required to submit a medical report attesting to their mental and physical fitness to serve as a Labour Court Judge.\n\nFailure to disclose the required information will result in disqualification from the interviews, the commission warned.\n\nJSC advised that members of the public intending to nominate candidates can obtain nomination forms from the office of the Secretary, Judicial Service Commission at JSC House, or from the office of the Provincial Magistrate in charge of the province in Harare, Bulawayo, Masvingo, Bindura, Chinhoyi, Mutare, Gwanda, Marondera, Hwange, and Gweru. Forms can also be downloaded from the JSC website at www.jsc.org.zw.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/court-1.jpg",
            "description": "Nqobile Bhebhe, Online Writer THE Judicial Services Commission (JSC) is set to recruit eight Labour Court judges and has invited members of the public to nominate suitably qualified candidates to fill the vacancies. In a notice issued by the commission, the candidates must be Zimbabwean citizens aged 40 years or older, qualified legal practitioners, and have […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "SA-Zim border authorities start preps for 2025 Easter traffic",
            "url": "https://www.chronicle.co.zw/sa-zim-border-authorities-start-preps-for-2025-easter-traffic/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nZIMBABWEAN border officials and their South African counterparts have started working on contingent plans to clear increased traffic through Beitbridge border post during the forthcoming Easter and Independence holidays.\n\nThe plans will cover the period between 14 April and 23 April.\n\nThis years Easter will begin on April 18 which is also Zimbabwes Independence Day and end on 21 April.\n\nRegional Immigration Officer (RIO) in-charge of Beitbridge, Mr Joshua Chibundu said they had adequate manpower to clear traffic at all the three terminals.\n\nThese include the freight, bus and private cars and pedestrian terminals.\n\nWe have started working on plans to process traffic during the Independence and Easter holidays, most of which will include adopting the flow process we used during the festive period between December Last year and January this year, said Mr Chibundu.\n\nAs a department we have adequate manpower and we are ever ready to service traffic passing through all the three terminals.\n\nAt the same time we encourage travellers to avoid side dealings and they must note that Immigration counters do not require the use of agents. Those travelling with children should ensure that they have all the relevant documents.\n\nSouth Africas Border Management Authority spokesperson, deputy assistant commissioner Mmemme Mogotsi said all their Executives will be deployed at various ports of entry from 20 April to enhance seamless operation.\n\nWe are preparing for the Easter operations at ports of entry. Our apex dates and the exit leg is from 14-17 April 2025 and most travellers will return from 20-23 April 2025 from Easter holidays. The BMA will be in exactly two years and a lot of profiles of ports of entry will be done this year, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/fssf.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau ZIMBABWEAN border officials and their South African counterparts have started working on contingent plans to clear increased traffic through Beitbridge border post during the forthcoming Easter and Independence holidays. The plans will cover the period between 14 April and 23 April. This year’s Easter will begin on April 18 which is […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Watch: ZITF calls for official registration of events held alongside main trade showcase",
            "url": "https://www.chronicle.co.zw/watch-zitf-calls-for-official-registration-of-events-held-alongside-main-trade-showcase/",
            "content": "Nqobile Bhebhe, Online Reporter\n\nZimbabwe International Trade Fair Company (ZITF) chairman, Busisa Moyo has urged organisers of commercial and cultural events taking place alongside the main ZITF trade showcase to register with the company.\n\nThe 65th edition of the annual trade fair is set to run from April 2126, 2025, at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo under the theme Industrialisation: Crafting an Integrated Economic Landscape.\n\nDuring a press briefing on Thursday, Moyo noted that ZITF is curating a dynamic programme of commercial and cultural events to complement the main exhibition. The move is aimed at ensuring better coordination and maximising the impact of all events held during the ZITF period.\n\nIn previous years, several events, including musical shows, have been organised under the ZITF banner without official approval.To enhance the attendee experience, ZITF is curating a dynamic programme of commercial and cultural events taking place alongside the main exhibition. These are events that are not necessarily convened by the ZITF, but various interest groups and stakeholders.We invite organisations to host panel discussions, structured dialogues, research presentations, signing ceremonies of major commercial contracts, and events within the cultural and creative industries as well.These engagements offer valuable opportunities for knowledge exchange, collaboration, and showcasing industry advancements and developments.To have your event included in the official programme, please notify our executive team in writing, specifying the date and time of your event. So this is to open up so that we use the platform, said Moyo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/asddff.jpg",
            "description": "Nqobile Bhebhe, Online Reporter Zimbabwe International Trade Fair Company (ZITF) chairman, Busisa Moyo has urged organisers of commercial and cultural events taking place alongside the main ZITF trade showcase to register with the company. The 65th edition of the annual trade fair is set to run from April 21–26, 2025, at the Zimbabwe International Conference […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "WATCH: ZITF introduces customer-friendly measures to streamline entry and reduce congestion at 2025 trade fair",
            "url": "https://www.chronicle.co.zw/zitf-introduces-customer-friendly-measures-to-streamline-entry-and-reduce-congestion-at-2025-trade-fair/",
            "content": "Nqobile Bhebhe,Senior Business WriterTHE Zimbabwe International Trade Fair Company (ZITF) has announced a series of customer-friendly measures aimed at streamlining the entry process and reducing congestion at its upcoming 65th edition of the annual trade fair.The initiatives include the opening of a satellite office in Harare, expanded parking facilities, and the introduction of eco-friendly shuttle services.Speaking at a Press Briefing in Bulawayo on Thursday, ZITF Company chairman Mr Busisa Moyo highlighted the new measures, which are designed to improve the overall experience for exhibitors and visitors.The 65th edition of the Zimbabwe International Trade Fair is scheduled to take place from April 2126, 2025, at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo, under the theme Industrialisation: Crafting an Integrated Economic Landscape.\n\nZimbabwe International Trade Fair (ZITF) continues to prioritise visitor and exhibitor convenience through several key initiatives aimed at improving access, reducing congestion, and enhancing overall customer experience, Mr Moyo said.\n\nOne of the key initiatives is the opening of a satellite office in Harare, strategically located at the Confederation of Zimbabwe Industries (CZI) offices. This office will handle inquiries, bookings, and the collection of exhibitor badges and related documents in advance, helping to avoid the typical congestion at the main entry points during the first and second days of the show.\n\nThis initiative will help avoid typical congestion at the main entry points during the first and second days of the show, Mr Moyo explained.\n\nIn addition to the satellite office, ZITF has expanded its parking facilities to accommodate the increased number of visitors and exhibitors. The additional parking spaces are intended to alleviate pressure on the main parking areas and ensure a smoother arrival experience for all attendees.\n\nTo further enhance convenience and minimise vehicular congestion around the exhibition centre, ZITF will introduce eco-friendly shuttle services. These shuttles will transport guests between the exhibition centre and three key hotels, offering an efficient, convenient, and sustainable transport solution.\n\nWith these improvements, ZITF 2025 continues to set a new standard for customer experience, ensuring that exhibitors and visitors can enjoy a seamless and enjoyable event, Moyo said.\n\nThe 2025 ZITF is expected to attract a wide range of local and international exhibitors showcasing the latest innovations and products across various industries. The trade fair is a key event on Zimbabwes economic calendar, providing a platform for businesses to network, explore new opportunities, and promote trade and investment.\n\nAs the countdown to the event begins, ZITFs new measures are set to enhance the overall experience for all participants, reinforcing the fairs reputation as a premier international trade exhibition.The Zimbabwe International Trade Fair (ZITF) is one of the largest trade exhibitions in sub-Saharan Africa, attracting exhibitors and visitors from across the globe. The event serves as a platform for businesses to showcase their products and services, network, and explore new trade opportunities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/12345567.jpg",
            "description": "Nqobile Bhebhe, Senior Business Writer THE Zimbabwe International Trade Fair Company (ZITF) has announced a series of customer-friendly measures aimed at streamlining the entry process and reducing congestion at its upcoming 65th edition of the annual trade fair. The initiatives include the opening of a satellite office in Harare, expanded parking facilities, and the introduction of […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Meet Zaza: Dancer eager to mentor next generation, get kids off the streets",
            "url": "https://www.chronicle.co.zw/meet-zaza-dancer-eager-to-mentor-next-generation-get-kids-off-the-streets/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nEvery creative has a unique reason for pursuing their passion, and for dancer Zanele Zaza Maseko, her dream is to use her talent to get children off the streets.\n\nA proud member of the Hloseni Arts Ensemble, the Mpopoma-based artist has had a career spanning over two decades.\n\nChronicle Showbiz caught up with Zaza, who shared her journey and how dance is deeply embedded in her blood.I started pursuing arts in primary school, in Grade 4 at Mpumelelo Primary and Msiteli High School. My inspiration comes from our culture, especially in preserving isintu sethu and passing this knowledge on to the next generation.My journey wasnt easy when I decided to pursue art professionally in 2000. Growing up, our parents werent as open-minded as todays generation. I faced mockery at home, with people telling me to find a job that would guarantee me a paycheck at the end of the month. But I didnt listen to that. I pushed through until my art started to bring in some income, which was when I started getting full support, she said.\n\nZaza believes that performance has the power to heal.There are many challenges people face, but when someone watches a performance, they can relax their mind and focus on whats in front of them. If the performance is captivating, theyll always talk about it afterward.\n\nShe shared plans by Hloseni Arts to revive the group.Although I havent worked on my own projects exclusively, Im part of a dance ensemble. We have plans to revive the group and recruit more teenagers. Moving forward, I would love to mentor more kids, keeping them off the streets and away from drug and substance abuse, she said.\n\nFollow on X @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fdh.jpg",
            "description": "Mthabisi Tshuma, revvmthiretshuma@gmail.com Every creative has a unique reason for pursuing their passion, and for dancer Zanele “Zaza” Maseko, her dream is to use her talent to get children off the streets. A proud member of the Hloseni Arts Ensemble, the Mpopoma-based artist has had a career spanning over two decades. Chronicle Showbiz caught up […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "SADC announces withdrawal of peacekeeping mission from Eastern DRC",
            "url": "https://www.chronicle.co.zw/sadc-announces-withdrawal-of-peacekeeping-mission-from-eastern-drc/",
            "content": "Online writerHARARE, Zimbabwe  In a significant development, the Southern African Development Community (SADC) has announced the withdrawal of its peacekeeping mission from the eastern Democratic Republic of Congo (DRC), citing the need for a strategic reassessment of its role in the region.The decision was made during a virtual Extraordinary SADC Summit chaired by Zimbabwean President Emmerson Mnangagwa, who is also the SADC Chairperson.The SADC Mission in the DRC (SAMIDRC), deployed to address the escalating security crisis in the region, will now enter a withdrawal phase. President Mnangagwa said while the mission is being pulled out, SADC remains committed to monitoring the political and security situation in eastern DRC.The withdrawal of SAMIDRC notwithstanding, our august regional body will remain seized with the political and security situation in eastern DRC, President Mnangagwa said in his closing remarks.He called for the accelerated implementation of decisions made during the Joint SADC-East African Community (EAC) meeting, including the merger of the Luanda and Nairobi Peace Processes, which aim to foster dialogue and lasting peace in the region.The decision to withdraw comes after months of deliberation and reflects the complex challenges faced by the mission, including ongoing violence, resource constraints, and the need for a more sustainable approach to peacebuilding. The region has been plagued by armed conflict, with numerous rebel groups vying for control, displacing thousands, and creating a humanitarian crisis.President Mnangagwa expressed gratitude to the troop-contributing countries and all SADC member states for their support of SAMIDRC. He appealed for continued cooperation to ensure the safe withdrawal of troops and equipment from the region.As our Mission enters a withdrawal phase, we appeal for continued support to facilitate the safe withdrawal of all our troops and evacuation of our equipment, he said.The SADC Chairperson reaffirmed the blocs solidarity, saying, Our SADC solidarity is unshakable and must be upheld and safeguarded for generations to come. He declared the summit officially closed, marking the end of what he described as frank and productive deliberations.The SADC is a regional economic community comprising 16 member states, aimed at promoting socio-economic cooperation and integration, as well as political and security collaboration among its members.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jhfyufygugu.jpg",
            "description": "Online writer HARARE, Zimbabwe – In a significant development, the Southern African Development Community (SADC) has announced the withdrawal of its peacekeeping mission from the eastern Democratic Republic of Congo (DRC), citing the need for a strategic reassessment of its role in the region. The decision was made during a virtual Extraordinary SADC Summit chaired […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        },
        {
            "title": "Minister Masuka to headline the landmark AfCFTA -ACX Annual Conference",
            "url": "https://www.chronicle.co.zw/minister-masuka-to-headline-the-landmark-afcfta-acx-annual-conference/",
            "content": "Business Writer\n\nPREPARATIONS for the upcoming AfCFTA Association of Commodity Exchanges (A-ACX) Annual Conference, set to take place this month in Victoria Falls are progressing well.The inaugural programme is set to bring together key industry players from across the continent.The Zimbabwe Mercantile Exchange (ZMX) will host the event and has announced that Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, will be the guest speaker.His presence underscores the importance of the event in advancing Africas agricultural and trade agenda, as well as Zimbabwes commitment to fostering economic growth through commodity exchange platforms, said ZMX in a statement.A high-powered delegation from the AfCFTA led by the head of market access, directorate of trade in goods and competition, AfCFTA secretariat, Joyce Letswalo, would grace the prestigious event.Other key presenters include Ghana Commodity Exchange chief executive officer, Tucci Ivowi, global expert in commodity trade and finance, Adam Gross, ZIDA chief executive officer, Tafadzwa Chinamo, Johannesburg Securities Exchange (JSE) head of commodities in the capital markets division Anelisa Matutu, commodities and derivatives markets expert Dr Bharat Kulkarni and ZMX CEO, Mr Collen Tapfumaneyi.The conference will run under the theme: Scaling Intra-African Trade: Leveraging Commodity Exchanges for Economic Resilience and Growth, which highlights the role of commodity exchanges in strengthening regional trade and advancing the objectives of the African Continental Free Trade Area (AfCFTA).Delegates from all over the continent have already registered to attend, reflecting the growing interest in the discussions surrounding trade harmonization, investment opportunities, supply chain development, and policy frameworks to unlock Africas trade potential, said ZMX.The conference will serve as a vital platform for networking, business linkages, and strategic collaborations among policymakers, financial and logistics experts, and international organizations.As the host country, Zimbabwe is ready to showcase its contributions to Africas commodity markets, emphasizing its innovative market structures and strategic policies aimed at enhancing agricultural and resource-based trade.The event is expected to further position Zimbabwe as a key player in intra-African commerce and attract investments to its crucial economic sectors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Untitled-11-1.jpg",
            "description": "Business Writer PREPARATIONS for the upcoming AfCFTA Association of Commodity Exchanges (A-ACX) Annual Conference, set to take place this month in Victoria Falls are progressing well. The inaugural programme is set to bring together key industry players from across the continent. The Zimbabwe Mercantile Exchange (ZMX) will host the event and has announced that Lands, […]",
            "time": "18:09",
            "date": "13 Mar 2025"
        }
    ]
}