{
    "news": [
        {
            "title": "CZR warns against Monday protests",
            "url": "https://www.chronicle.co.zw/czr-warns-against-monday-protests/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHE Confederation of Zimbabwe Retailers (CZR) has warned the nation over the planned protests by none progressive elements noting that such protests had the danger of disrupting business operations and cause economic instability.\n\nThe national retailers body said while it recognise the right to peaceful demonstration as enshrined in theConstitution, it has been consistently seen that protests in Zimbabwe often result in unintended consequences, including disruptions to business operations, economic instability, and hardship for ordinary citizens.\n\nZimbabwe has experienced numerous protests in the past, and history shows that they have rarely led to constructive solutions but have instead caused significant damage to businesses and livelihoods, said the Confederation president Mr Denford Mutashu, citing the January 1998 protests, led by the Zimbabwe Congress of\n\nTrade Unions under the late Morgan Tsvangirai that resulted in widespread looting and destruction.\n\nHe said many businesses were targeted and shops were ransacked with essential goods such as meat being looted, forcing some enterprises to shut down permanently.Similarly, in October 2000, protests against price increases degenerated into violent riots, causing significant economic disruptions. More recently, in August 2016, demonstrations in Harare led to businesses being looted, property damaged, and innocent traders affected.\n\nThe reality is that protests have often harmed businesses and the economy more than they have addressed the concerns they were meant to highlight, said Mr Mutashu.CZR said those who do not participate in protests especially businesses and workers often bear the brunt of the disruptions, while the economic damage lingers long after the demonstrations have ended.\n\nCZR believes that dialogue remains the most effective way to address national concerns. Zimbabwes economy thrives on stability, investorconfidence, and a supportive business environment, all of which are undermined by unrest.\n\nHe said while grievances may exist, the Confederation strongly encourages engagement between all stakeholders; Government, business, civil society,and concerned groups to find lasting and inclusive solutions.\n\nMr Mutashu said the retail and wholesale sector plays a critical role in Zimbabwes economy,ensuring the availability of essential goods and services while supporting thousands of jobs.\n\nOur priority is to maintain an environment where businesses can operate smoothly, securely, and without disruption. Weurge all parties to consider the broader impact of protests especially on businesses that provide livelihoods for many Zimbabweans, said Mr Mutashu.\n\nHe said the CZR calls upon organizers and participants of the planned 31 March2025 protests to consider peaceful, lawful, and constructive avenues for addressing their concerns.\n\nHe urged stakeholders to come together for dialogue while ensuring that the interests of all Zimbabweans especially workers,consumers, and businesses are protected and prioritised.\n\nMr Mutashu said social unrest and disobedience are not the easy or effective routes topeaceful resolution of national political, socio-economic, and community challenges.\n\nDialogue remains the most viable and effective means ofresolving grievances. By working together, we can address challenges without resorting to actions that may cause long-term harm to businesses, communities, and the broader economy.\n\nThe CZR stands for peace, tranquility, and development and remains committed to fostering a Zimbabwe that thrives on collaboration andunderstanding. We believe that by working together, we can chart a path toward a prosperous and stable future for all, said Mr Mutashu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/dfbvkmgh.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Confederation of Zimbabwe Retailers (CZR) has warned the nation over the planned protests by none progressive elements noting that such protests had the danger of disrupting business operations and cause economic instability. The national retailers body said while it recognise the right to peaceful demonstration as enshrined in the Constitution, it has […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "WATCH: ICT Ministry, Potraz scales up bridging urban-rural digital divide",
            "url": "https://www.chronicle.co.zw/ict-ministry-potraz-scales-up-bridging-urban-rural-digital-divide/",
            "content": "Mthabisi Tshuma in Bulilima\n\nTHE Ministry of Information Communication Technology, Postal and Courier Services in conjunction with the countrys telecommunications regulator Potraz continues to pursue its mission of bridging the urban-rural digital divide through equipping schools with modernised ICT equipment.\n\nOn Friday, ICT Deputy Minister Dingumuzi Phuti handed over 10 computers, a projector, printer and whiteboard to Bezu Primary School in Bulilima District, Matabeleland South province.\n\nThe move is meant to ensure that rural pupils are at par with their counterparts considering the advancement of the technology and academic sector which is evolving rapidly.\n\nSpeaking at the handover ceremony ICT Deputy Minister Phuti said the donation is a fulfillment to President Emmerson Mnangagwas philosophy of leaving no one and no place behind.\n\nFollow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/qww.jpg",
            "description": "Mthabisi Tshuma in Bulilima THE Ministry of Information Communication Technology, Postal and Courier Services in conjunction with the country’s telecommunications regulator Potraz continues to pursue it’s mission of bridging the urban-rural digital divide through equipping schools with modernised ICT equipment. On Friday, ICT Deputy Minister Dingumuzi Phuti handed over 10 computers, a projector, printer and […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Newcomers Scottland FC Touch Down in Bulawayo for Highlanders Showdown",
            "url": "https://www.chronicle.co.zw/newcomers-scottland-fc-touch-down-in-bulawayo-for-highlanders-showdown/",
            "content": "Fungai MuderereFlamboyant Castle Lager Premier Soccer League debutants, Scottland FC arrived in Bulawayo on Friday afternoon ahead of their highly anticipated clash against Highlanders at Barbourfields Stadium on Sunday.\n\nThis will be the first time that Scottland play an away fixture outside Harare after dating CAPS United at Rufaro Stadium.\n\nIn their previous encounter, the star-studded Scottland were edged 1-0 by Ngezi Platinum Stars.Meanwhile, their weekend opponents, Highlanders posted a two-all away draw against GreenFuel.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/222222.jpg",
            "description": "Fungai Muderere Flamboyant Castle Lager Premier Soccer League debutants, Scottland FC arrived in Bulawayo on Friday afternoon ahead of their highly anticipated clash against Highlanders at Barbourfields Stadium on Sunday. This will be the first time that Scottland play an away fixture outside Harare after dating CAPS United at Rufaro Stadium. In their previous encounter, […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Miracle Baby: Premature infant born weighing 405g defies odds",
            "url": "https://www.chronicle.co.zw/miracle-baby-premature-infant-born-weighing-405g-defies-odds/",
            "content": "Robin Muchetu\n\nIn an extremely rare occurrence, a woman from Nketa suburb in Bulawayo gave birth to a baby weighing 405g in November last year.\n\nThe baby, christened Christwish Chingini was born severely preterm owing to infections the mother had in the uterus which induced early labour.\n\nThe baby was discharged from United Bulawayo Hospitals this Friday afternoon, where she and the mother were housed for the past four months.\n\nHospital officials confirmed the birth saying they are proud of the success story.\n\nThe mother Ms Rachel Mhlanga was excited to be going home after a long stay in hospital.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-28-at-14.05.01_7dfd1169-680x380.jpg",
            "description": "Robin Muchetu In an extremely rare occurrence, a woman from Nketa suburb in Bulawayo gave birth to a baby weighing 405g in November last year. The baby, christened Christwish Chingini was born severely preterm owing to infections the mother had in the uterus which induced early labour. The baby was discharged from United Bulawayo Hospitals […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Zimbabwe, Belarus Strengthen Tourism Ties at Minsk Exhibition",
            "url": "https://www.chronicle.co.zw/zimbabwe-belarus-strengthen-tourism-ties-at-minsk-exhibition/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nZimbabwe and Belarus took advantage of the Belarus International Tourism Exhibition at Minsk Arena to initiate a Memorandum of Understanding (MoU) on tourism cooperation.\n\nAccording to the Zimbabwe Tourism Authority (ZTA), Minister of Tourism and Hospitality Industry, Barbara Rwodzi, attended the expo to explore ways to enhance Zimbabwes tourism sector.\n\nThis exchange sought to learn how best Sanganani/Hlanganani can be improved to better standards from this year onwards, said the ZTA.\n\nSanganani/Hlanganani, an annual tourism exhibition organised by the Ministry of Tourism and Hospitality Industry in partnership with the ZTA, aims to showcase Zimbabwes unique tourism offerings, rich cultural heritage, and investment opportunities.\n\nIt also serves as a platform for global industry discussions and partnerships.\n\nThis years edition is being held in Manicaland.\n\nZTA added that Minister Rwodzi highlighted appreciation of the strong bilateral ties between Zimbabwe and Belarus.\n\nIn her remarks, Hon. B. Rwodzi commended the established warm relations between the Heads of State of Zimbabwe and Belarus. She emphasised the need for close cooperation between the two nations as crucial to the further development of the tourism industry for both countries.\n\nBelarus and Zimbabwe initialised a Memorandum of Understanding and cooperation in the field of tourism during the sidelines of the Belarus Expo.\n\nThe official ceremony was presided over by Belaruss Minister of Sports and Tourism and was attended by representatives from Russia, Uzbekistan, Cuba, Venezuela, Turkey, Oman, and India.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/opp.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter Zimbabwe and Belarus took advantage of the Belarus International Tourism Exhibition at Minsk Arena to initiate a Memorandum of Understanding (MoU) on tourism cooperation. According to the Zimbabwe Tourism Authority (ZTA), Minister of Tourism and Hospitality Industry, Barbara Rwodzi, attended the expo to explore ways to enhance Zimbabwe’s tourism sector. “This […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Miss Ebony Zimbabwe shifts to virtual format, promises spectacular show",
            "url": "https://www.chronicle.co.zw/miss-ebony-zimbabwe-shifts-to-virtual-format-promises-spectacular-show/",
            "content": "Zimpapers Entertainment & Arts Hub\n\nThe inaugural Miss Ebony Zimbabwe pageant, initially set to take place as a live public event in Harare today, will now be held virtually.\n\nIn a press statement, event organisers announced the change, citing unforeseen circumstances.Due to unforeseen circumstances, Miss Ebony Zimbabwe 2025 is adopting a virtual format, similar to Miss Worlds approach during the Covid-19 era. The safety of our contestants, guests, staff, and community remains our top priority. The good news? More fans, more reach, and more sparkle as we bring the magic to your screens!\n\nTicket holders were assured that their purchases remain valid.Keep your tickets safe! Were planning a massive send-off event. Thank you for your support  lets make this virtual edition unforgettabl, organisers said.\n\nThe pageant will feature 21 contestants from across Zimbabwe, including: Bulawayo: Noxolo Dube, Abigail Chinembiri, Sinokubonga Nkala, Samukele Dlamini, Buhlebenkosi Chimpevu; Harare: Rejoice Kazingizi, Blessmore Tombe, Ruvimbo Ndoro, Blessing Gwanzura, Sijabulile Msimanga, Anesu Shoko, Zandile Sibanda, Shylet Chiware, Daphney Mashoko; Masvingo: Lerato Masocha, Tinomudaishe Makumire; Gweru: Courtney Mpofu; Chitungwiza: Tanaka Nhamo; Hurungwe: Chengeto Kanyai; Bikita: Margaret Mangowe and Marondera: Rutendo Mupararano.\n\nUnder the theme Empowering through Diversity, the competition celebrates culture, heritage, unity, and empowerment. The event aims to highlight the intelligence, talent, and strength of Zimbabwean women while providing a platform for advocacy and leadership.Contestants will represent various backgrounds, using their voices to champion social causes that impact communities in Zimbabwe and beyond, organisers said.\n\nModels have already undergone boot camp training focused on cultural and leadership development. In a groundbreaking move, Miss Ebony Zimbabwe will replace the traditional swimwear segment with a farm-inspired fashion showcase designed by Ivhu Tribe.This segment aims to highlight Zimbabwes rural heritage while celebrating creativity and sustainability, the organisers revealed.\n\nThe eventual winner will represent Zimbabwe on a Pan-African platform in Johannesburg, promoting a message of decolonised beauty and empowerment across Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/op.jpg",
            "description": "Zimpapers Entertainment & Arts Hub The inaugural Miss Ebony Zimbabwe pageant, initially set to take place as a live public event in Harare today, will now be held virtually. In a press statement, event organisers announced the change, citing unforeseen circumstances. “Due to unforeseen circumstances, Miss Ebony Zimbabwe 2025 is adopting a virtual format, similar […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Gold production boosts Padenga Holdings’ revenue by 43 percent in 2024",
            "url": "https://www.chronicle.co.zw/gold-production-boosts-padenga-holdings-revenue-by-43-percent-in-2024/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nPadenga Holdings Limited, a diversified group with interests in agriculture and mining, reported a 29 percent increase in gold sales volumes, rising to 2 740 kg for the year ended 31 December 2024, up from 2 120 kg in the previous year.\n\nThe company attributed this growth to improved ore grades at both the Eureka and Pickstone Peerless mines, along with enhanced throughput resulting from plant capacity improvements and optimisations made since late 2023.\n\nThe full benefits of these upgrades were realised throughout 2024.\n\nAt Pickstone Peerless, open-pit mining operations ceased in October 2024 following the commissioning and ramp-up of underground operations.\n\nLooking ahead, the company remains focused on further developing the Pickstone Underground Project.\n\nIn addition, exploration drilling at Eureka will commence in 2025 with the aim of confirming the long-term underground potential. This work is expected to inform a comprehensive feasibility study in 2027, the company said.\n\nGold production for 2025 is forecast to align with 2024 volumes. The current expansion capital expenditure is anticipated to start contributing to increased production in 2026.\n\nOn the financial front, Padenga recorded a turnover of US$223 million for the reporting period, reflecting a 43 percent increase from US$155.58 million in the prior year.\n\nThe revenue growth was primarily driven by higher gold production volumes and strong gold spot prices.\n\nCash generated from operating activities stood at US$60 million, marking a 48 percent increase from US$40.67 million in the previous year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/pade-680x380.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter Padenga Holdings Limited, a diversified group with interests in agriculture and mining, reported a 29 percent increase in gold sales volumes, rising to 2 740 kg for the year ended 31 December 2024, up from 2 120 kg in the previous year. The company attributed this growth to improved ore grades […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Bindura Nickel Corporation to hold first creditors meeting",
            "url": "https://www.chronicle.co.zw/bindura-nickel-corporation-to-hold-first-creditors-meeting/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nBINDURA Nickel Corporation (BNC), currently undergoing reconstruction, is set to hold its first statutory meeting of creditors and members on 23 April in Harare.\n\nThe Victoria Falls Stock Exchange-listed firm was placed under administration on 2 May, 2024 following a Reconstruction Order issued by the Government.\n\nThis was enacted under the Reconstruction of State-Indebted Insolvent Companies Act [Chapter 24:27] (the Reconstruction Act).\n\nAccording to a notice issued by the company, the meeting of creditors will commence at 10 AM, followed by the meeting of members in the afternoon.\n\nThe creditors meeting is convened to prove claims. Both the creditors and members meetings shall include a presentation on the ongoing reconstruction work and a statement by the Administrator regarding the reasonable prospects of the Companies success pursuant to reconstruction, the company said.\n\nCreditors seeking to claim owed funds must submit an Affidavit Form for Proof of Claim, along with supporting documentation, in duplicate to the Master of the High Court at the Masters office, the company added.\n\nDuring the reconstruction process, all legal proceedings including enforcement actions against the company or any of its assets are prohibited without the express authorisation of the Administrator.\n\nMs Mutsa Mollie Jean Remba was appointed as the administrator.\n\nMr Ian Mtetwa is the assistant.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/02/BINDURA-Nickel-Mine.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter BINDURA Nickel Corporation (BNC), currently undergoing reconstruction, is set to hold its first statutory meeting of creditors and members on 23 April in Harare. The Victoria Falls Stock Exchange-listed firm was placed under administration on 2 May, 2024 following a Reconstruction Order issued by the Government. This was enacted under the […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Police officer gunned down while attending to a crime scene",
            "url": "https://www.chronicle.co.zw/police-officer-gunned-down-while-attending-to-a-crime-scene/",
            "content": "Peter Matika,[emailprotected]\n\nA Bulawayo police officer was shot and killed while attending to a crime scene on Thursday night in Tshabalala suburb.\n\nThe police officer has since been identified as Sergeant Abel Masava.\n\nReports indicate that Sgt Masava was attending a crime scene with another officer, accompanied by two complainants when he confronted a group of five men passing by.\n\nSources suggest that he inquired about their presence in the area before one of the suspects pulled out a firearm and shot him in the head.\n\nHe was rushed to a local hospital but succumbed to his injuries shortly after arrival.\n\nPolice are yet to release an official statement regarding the incident.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-28-at-10.45.57_5bd77f66-680x380.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw A Bulawayo police officer was shot and killed while attending to a crime scene on Thursday night in Tshabalala suburb. The police officer has since been identified as Sergeant Abel Masava. Reports indicate that Sgt Masava was attending a crime scene with another officer, accompanied by two complainants when he confronted a group […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        },
        {
            "title": "Government to pay invigilation allowances",
            "url": "https://www.chronicle.co.zw/government-to-pay-invigilation-allowances/",
            "content": "Ray Bande and Lovemore Kadzura\n\nGOVERNMENT is crafting modalities to start paying teachers for invigilating public examinations, a Ministry of Primary and Secondary Education official has confirmed.\n\nTeachers were not being paid for their work during examinations, while other service providers such as security providers were being paid for their duties during the Zimbabwe Schools Examination Council (ZIMSEC) examination processes.\n\nThis situation prompted some School Development Committees (SDCs) to step in and offer incentives to teachers to ensure that exams run smoothly as, without payment, some teachers refused to cooperate and invigilate external candidates, while those who did were often mocked by their colleagues for working for nothing.\n\nIn an interview on the sidelines of a Learning Passport tour of schools in some parts of Manicaland Province this week, Director of Communication and Advocacy in the Ministry of Primary and Secondary Education, Mr Taungana Ndoro confirmed that Government is seized with the matter.\n\nThe issue of invigilation and payment of teachers for that task (examination invigilation) has been discussed for a while. We are happy that the Zimbabwe Schools Examination Council led by Dr Nembaware has gone on a benchmarking exercise throughout Africa and other countries to find out how best to treat invigilators. So we are hopeful that they will come up with a win-win situation for the issues raised by the teachers about invigilators and their welfare. It is really under consideration, and we are hopeful that something positive will come out of that, said Mr Ndoro.\n\nZIMSEC spokesperson, Ms Nicky Dhlamini said the decision to pay the invigilators rests with the Primary and Secondary Education Ministry, which employees teachers.\n\nZIMSEC actually engaged teachers and the parent ministry way back in 2018 when this issue was first raised, to which the ministry gave a response. ZIMSEC stands guided by the ministry as the main shareholder and parent ministry. So, until such a directive is given by the ministry, ZIMSEC cannot give any direction. Teachers are invigilating at their stations of work so the direction comes from their employer, said Ms Dhlamini.\n\nApparently, some teacher representative organisations had raised with the Ministry of Primary and Secondary Education the issue of paying invigilators.\n\nIn its submission to ZIMSEC Strategic Planning Review Sessions of 2025, Progressive Teachers Union of Zimbabwe (PTUZ) noted: ZIMSEC must engage teachers through signed contracts. This protects the rights of teachers engaged in ZIMSEC business so that they will not be subjected to abuse. The contracts must clearly spell out the conditions of service and allowances to be paid thereafter.\n\nAll those engaged in ZIMSEC business must be paid as what happened with other parastatals which engage teachers each time they want their services. A case to note is the non-payment of invigilation by ZIMSEC. Invigilation must be paid for, and any teacher who is engaged in invigilation of ZIMSEC examinations must be paid reasonable allowances using standard rates. ZIMSEC has the temerity of paying police officers, resident monitors, item writers and others, but refuses to pay the invigilator who is subjected to a tempting and strenuous exercise which validates the whole examination process.\n\nIn addition to the above, invigilators are subjected to a barrage of rules and regulations, some of which are harsh for those with chronic diseases. For example, an invigilator is not supposed to sit down, is supposed to be standing even if the paper is two or three hours long. We view this as some form of punishment.\n\nPTUZ also submitted that teachers who design CALAs and supervised the recently introduced School Based Projects must also be paid.\n\nTeachers who designed CALAs and supervise the recently introduced School-Based Projects (SBPs) must be paid by ZIMSEC. Honestly, ZIMSEC cannot pay those moderating the CALAs and SBPs and deliberately ignore the teachers doing the donkey work, wrote PTUZ.\n\nZimbabwe Rural Teachers Union (ZRTU) president, Mr Martin Chaburumunda admitted that the issue of paying invigilators has been topical for a long time, and it is high time such concerns are addressed.\n\nThis is a very contentious issue in schools. It is long overdue as we have been complaining as unions that teachers who perform ZIMSEC duties should be paid. Some teachers, especially those teaching practical subjects, start the examination process two or three months before, monitoring learners and safe keeping their products.\n\nEveryone involved in the examination process must be paid because ZIMSEC charges learners to sit the examinations, yet teachers, who make sure that there is order before, during and after exams are not considered.\n\nTeachers work for Ministry of Primary and Secondary Education, and not ZIMSEC, which they are being made to provide services for free. If ZIMSEC pays the teachers who do the marking and compiling, why not those who invigilate. We will really appreciate if there are moves to bring this outstanding matter to fruition, said Mr Chaburumunda.\n\nWelfare and Educational Institutions Employers Association Manicaland regional officer, Mr Caiphas Maduku said SDCs should not be arm-twisted to pay for invigilation of ZIMSEC exams.He said it was inappropriate for SDCs to use school fees or centre fees to pay invigilators as all school budgets must be approved by the ministry.\n\nSchools using fees money to pay teachers for ZIMSEC examinations are breaking the law. Schools have budgets approved by the Permanent Secretary in the Ministry of Primary and Secondary Education, and if that component is highlighted in the budget then they can go ahead. If it is not highlighted and not approved, then it amounts to misappropriation of funds. It will be a good idea that ZIMSEC pays invigilators so that fees paid by parents is not touched. The fees paid by parents has nothing to do with ZIMSEC, said Mr Maduku.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Exam-invigilator-680x343-680x343.jpg",
            "description": "Ray Bande and Lovemore Kadzura GOVERNMENT is crafting modalities to start paying teachers for invigilating public examinations, a Ministry of Primary and Secondary Education official has confirmed. Teachers were not being paid for their work during examinations, while other service providers such as security providers were being paid for their duties during the Zimbabwe Schools […]",
            "time": "18:42",
            "date": "28 Mar 2025"
        }
    ]
}