{
    "news": [
        {
            "title": "Mushroom poisoning tragedy claims 2 lives",
            "url": "https://www.chronicle.co.zw/mushroom-poisoning-tragedy-claims-2-lives/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE death of two family members from a mushroom poisoning incident in the Mbembeswana area of Bubi District, Matabeleland North Province, has jolted the community while two minors are battling for their lives at Mpilo Central Hospital in Bulawayo after they consumed deadly mushrooms last week Monday.\n\nThe family of four, 52-year-old Mrs Sinothando Gwayi, her daughter Sanelisiwe Ndlovu (14) and two grand-children  Primrose Ndlovu (13) and three-year-old Precious Ndlovu  was rushed to Mbembeswana Clinic after eating the poisonous delicacy.\n\nThe family members were then transferred to Mpilo Central Hospital a day later.\n\nUnfortunately, Mrs Ndlovu passed away yesterday morning, two days after her granddaughter Primrose succumbed to illness caused by the poisonous mushrooms that they ate.\n\nSanelisiwe and little Precious are battling for their lives at the countrys second-largest referral hospital. A distraught Miss Prudence Ndlovu, daughter of the late granny and mother of the deceased teenager, who is based in South Africa, said she rushed back to Bubi as soon as she heard news that her family members were taken ill after eating the deadly mushrooms.\n\nShe is baffled at how her mother mistook poisonous mushrooms for edible ones, given that the elderly woman had been harvesting mushrooms for the family for years.\n\nEver since I was a young girl, my mother has always been the one who forages for the mushrooms in our area when it rains. I have no idea how this time around she harvested the wrong mushrooms.\n\nI have lost a mother and a daughter and I am at a loss of words, said Prudence at Mpilo Hospital yesterday.\n\nMy sister (Mrs Patience Ngwenya) is with her little girl at the childrens ward. Our prayer is for the little girl and my surviving young sister Sanelisiwe to recover. We cant lose more family members, she said in between sobs.\n\nMpilo Central Hospital public relations officer, Mrs Noma Mabhena, cautioned against the consumption of wild mushrooms, especially at a time when the delicacy is in abundance in the bush as a result of the recent rains.\n\nMs Prudence Ndlovu and Mr Ndumiso Luphahla at Mpilo Central Hospital\n\nShe confirmed the death of two patients at Mpilo Hospital from mushroom poisoning.\n\nUnfortunately, two patients lost their lives after eating poisonous mushrooms. We appeal to the residents of Bulawayo and villagers from across the region to avoid eating mushrooms without the proper knowledge of whether the mushrooms are safe for human consumption or not, said Mrs Mabhena.\n\nChronicle took a quick survey around the marketplace in Bulawayos city centre and observed that several vendors were selling a variety of mushrooms, some whitish while others were brightly coloured and came in various sizes.\n\nThe biggest mushrooms on sale in the streets of Bulawayo are bigger than an adults hand while the smallest are no bigger than a finger.\n\nMiss Ntombi Moyo, a vendor, said she travelled from Matobo early yesterday morning into Bulawayo to sell a 25 kilogram bag of mushrooms that she harvested from the mountains in her village over the weekend.\n\nMs Moyo said the type of mushrooms she was selling is known in IsiNdebele as indlebe zikagogo.\n\nThis type of mushroom is not poisonous. In fact, my family will eat the mushrooms tonight for dinner in my absence.\n\nI learned the difference between edible mushrooms and the poisonous ones from my mother who got that knowledge from my late grandmother, said Ms Moyo.\n\nShe said edible mushrooms are harvested from special places such as ant hills or in the mountains but warned that villagers without the knowledge to differentiate the poisonous from the non-poisonous types should not attempt harvesting the delicacy.\n\nWe had an incident a couple of years ago when a young girl in our village harvested poisonous mushrooms and cooked them for her siblings. They all died.\n\nChild-headed families are usually at the risk of eating poisonous mushrooms because there is no adult to harvest the right kind of mushrooms for the kids, she added. Another vendor, Mr Agrippa Mpande, said despite the mushroom business being lucrative, he will never sell the delicacy for fear of ending up with the poisonous type.\n\nI have no idea what to look for when separating the right type of mushrooms from the bad ones. What if someone brings bad mushrooms from their village and the next thing families start dying because they bought poisonous mushrooms from me? asked Mr Mpande.\n\nThe news crew observed about 12 vendors selling different kinds of mushrooms, just yesterday alone, around the marketplace area.\n\nAn oyster mushroom grower Mrs Fallon Sibanda, who also sells fresh produce at the city centre marketplace, said she sells mushrooms that she grows in Woodville suburb for US$1 per punnet.\n\nIt takes a month from the time she plants the mushrooms to the time when they are ready for harvest and for sale to customers in Bulawayo.\n\nMost people are skeptical about buying mushrooms outside formal shops such as supermarkets but I have a clientele base that I built over the years, to which I sell my home-grown mushrooms. This time of the year, when its raining is when mushrooms are in abundance in the streets of Bulawayo, so its important to buy from trusted vendors, said Mrs Sibanda.\n\nA mushroom expert, Mr Colet Nyakunu, also warned against the consumption of mushrooms harvested from the wild.\n\nWhile wild mushrooms can be tempting to forage, it is not advisable to pick them from the bush due to the risk of misidentification and potential toxicity, he said. Instead, cultivated mushrooms offer a safe and sustainable way to incorporate these nutritional powerhouses into our diets.\n\nMushrooms, packed with nutrients and antioxidants, offer a natural and sustainable way to enhance our diets and improve our health. By incorporating mushrooms into our daily meals, we can support immune function, reduce inflammation and provide essential nutrients for healthy growth and development.\n\nMr Nyakunu said in Zimbabwe, cultivated mushrooms are becoming increasingly popular with local farmers and entrepreneurs exploring the potential of the lucrative mushroom industry.\n\nFrom oyster, shiitake, button, and Portobello mushrooms, a wide range of species are being cultivated using sustainable methods.\n\nCultivated mushrooms are packed with nutrients that include protein, fiber, vitamins, minerals and antioxidants.\n\nIncorporating cultivated mushrooms into our diet can have a significant impact on our health and well-being, he added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/13.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com THE death of two family members from a mushroom poisoning incident in the Mbembeswana area of Bubi District, Matabeleland North Province, has jolted the community while two minors are battling for their lives at Mpilo Central Hospital in Bulawayo after they consumed deadly mushrooms last week Monday. The family of four, 52-year-old Mrs […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "‘Very unfortunate’ Government speaks on UBH baby swap",
            "url": "https://www.chronicle.co.zw/very-unfortunate-government-speaks-on-ubh-baby-swap/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nGOVERNMENT has described as very unfortunate the recent baby-swapping incident that occurred at the United Bulawayo Hospitals after a woman who had given birth to a baby boy received the shock of her life when a nurse handed her a baby girl.\n\nResponding to Chronicle yesterday, Health and Child Care Ministry permanent secretary, Dr Aspect Maunganidze, said the Government was aware of the incident and awaits the outcome of investigations, which have since been initiated.\n\nThe ministry is aware of the unfortunate incident of baby swapping that occurred at United Bulawayo Hospitals and awaits the results of the investigation that we instructed the hospital to undertake, said Dr Maunganidze.\n\nThe permanent secretary said the Government was also aware of the sensitivity of the matter hence the two families involved as well as hospital staff at the centre of the matter will undergo professional trauma counselling.\n\nWhile we expect the investigation to be concluded expeditiously, we acknowledge the sensitivities around the matter. Parallel to the investigative process, we have instructed the institution to assist with counselling all affected parties (including the staff), reorient or refresh our staff on the standard operating procedures during and after delivery, and reinforce the importance of good moral and ethical practice, said Dr Maunganidze.\n\nThe woman, who cannot be named for ethical reasons, had to resort to Deoxyribonucleic acid (DNA) testing, done at a private DNA laboratory in the city centre and the National University of Science and Technology (Nust) to prove her concerns that the baby girl was not hers after the nurse on duty had told her that her child was a girl and that since she had given birth through Cesarean Section, she may have been under sedation.\n\nNational University of Science and Technology\n\nThe hospital staffers allegedly reassured her that anaesthesia from the operation had caused her confusion. Frustrated but determined, the mother contacted her family for support.\n\nShe remembered that about 15 minutes before she went into theatre, another lady was also in the ward and was meant to undergo the same procedure.\n\nHowever, the lady had somehow been discharged and left for her home in Esigodini, Matabeleland South Province.\n\nHer family came to her support, especially since scan results a day earlier had revealed that her unborn baby was a boy.\n\nUnperturbed, the woman visited Global DNA lab at Bulawayo Centre and the results proved that the baby girl she was given was not hers.\n\nFurious, the family returned to the hospital, demanding answers and demanding the return of their biological son. Hospital staff were compelled to locate the other mother. A hospital vehicle was dispatched to retrieve her.\n\nHowever, the womans husband insisted that the child was his. The police were subsequently involved, and the couple was brought to Bulawayo.\n\nAt the insistence of the aggrieved family, the hospital engaged the National University of Science and Technology (Nust) for DNA testing. The results unequivocally confirmed that the two babies had been exchanged.\n\nZephania Dlamini, head of the Applied Genetics Testing Centre at Nust, confirmed the discovery.\n\nIn the Bulawayo cases, two women who were in the same ward at UBH delivered around the same time.\n\nThe complainant asserted that her baby was a boy, but when it was returned after cleaning, she was given a girl.\n\nDlamini further said that when confronted with the discrepancy, the other mother adamantly insisted that her child was indeed a boy, a claim vehemently supported by her husband.\n\nHe even insisted that the ultrasound scan had confirmed the sex of the child as male. Before approaching Nust, the complainant had sought testing at Global DNA lab in the city centre, which confirmed that the baby girl was not hers.\n\nOur results corroborated these findings. Subsequent testing on the couple claiming to be the parents of the boy yielded negative results, while the boys DNA matched that of the complainant, and the girls DNA matched that of the other woman, said Dlamini.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-7-copy-1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw GOVERNMENT has described as “very unfortunate” the recent baby-swapping incident that occurred at the United Bulawayo Hospitals after a woman who had given birth to a baby boy received the shock of her life when a nurse handed her a baby girl. Responding to Chronicle yesterday, Health and Child Care Ministry permanent […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "14-year-old excels in O-level exams through home schooling",
            "url": "https://www.chronicle.co.zw/14-year-old-excels-in-o-level-exams-through-home-schooling/",
            "content": "Ashley Phiri,[emailprotected]\n\nFOURTEEN-year-old Vicky Moyo has achieved an impressive milestone by passing five out of six O-level subjects in the 2024 Zimbabwe School Examinations Council (Zimsec) examinations.\n\nHer success comes after an unconventional educational journey that combined home schooling, online resources and dedicated tutoring.\n\nVicky, who stopped formal education at Sizane High School at the age of 13, took a bold step to pursue her O-level studies earlier than most of her peers.\n\nI was inspired by seeing other learners of my age from different provinces writing their O-levels earlier than expected and succeeding. That motivated me to take that route, she said.\n\nWith support from her mother, Ms Lindiwe Sithole and guidance from educators at Entumbane High School, Vicky prepared for subjects including Mathematics, Physics, Chemistry, Biology, Combined Science and English.\n\nHer hard work paid off as she earned a B in Combined Science, Cs in Mathematics, English and Chemistry and a D in Biology.\n\nVicky credited her success to the dedication of her teachers and the resources provided by ZimInclusive Learning, a free online platform that offers educational materials to students across the country.\n\nThe encouragement from my mother and a network of dedicated educators has proven that with the right support, success is attainable at any age, she said.\n\nThe journey was not without its hurdles. After dropping out of school at Form Two, Vicky began attending extra lessons in April 2024 to cover the syllabus. Her tutors played a crucial role in keeping her motivated.\n\nThey have been my rock throughout my O-level exams. Without them, I would have given up along the way. I am also grateful for the free online lessons I received from Mr Melulwazi Dlamini, founder of ZimInclusive. The resources he offered were invaluable and all for free, she said.\n\nMs Sithole, a strong advocate for home schooling, expressed her pride and joy in Vickys achievement.\n\nIf you can, try it. It can make a difference. I didnt hesitate to support my daughter in this new method of learning. She was assessed by teachers from Entumbane High School before being allowed to drop out of formal education completely, she said.\n\nI am a happy mother that everything worked out well. Vicky hopes her story will inspire other students to pursue their educational dreams despite challenges. She expressed gratitude to everyone who supported her, including her friends, family and mentors.\n\nHome schooling is gaining traction in the country as more families explore alternative educational paths.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/35.jpg",
            "description": "Ashley Phiri, ashleyphiri66@gmail.com FOURTEEN-year-old Vicky Moyo has achieved an impressive milestone by passing five out of six O-level subjects in the 2024 Zimbabwe School Examinations Council (Zimsec) examinations.  Her success comes after an unconventional educational journey that combined home schooling, online resources and dedicated tutoring. Vicky, who stopped formal education at Sizane High School at the […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "Siziba retained unopposed at Bosso",
            "url": "https://www.chronicle.co.zw/siziba-retained-unopposed-at-bosso/",
            "content": "Fungai Muderere,[emailprotected]\n\nHIGHLANDERS returning officer Peter Dube has revealed that three candidates have successfully been nominated to run for the positions of vice chairman and treasurer.\n\nThe elections will be held on February 2.\n\nOne candidate, Fiso Siziba, will go unopposed for the position of vice chairman while two candidates Israel Moyo and Nkani Khoza will fight for the position of treasurer.\n\nWe have two vacant positions, one for vice chairman and one for the treasurer. The Electoral College sat this morning (yesterday). Candidates that were willing to participate in these elections submitted their nomination forms by last Saturday. The cut off time was 12pm. So, all the three met the constitutional requirements.\n\nOne candidate, Fiso Siziba was successfully nominated for the position of vice chairman while Nkani Khoza and Israel Moyo were nominated for the treasurers position. The candidates have been called and notified of their successful nomination, so they can now go forward and campaign. This coming weekend (Sunday), they will be introduced to the clubs membership, said Dube.\n\nSiziba had already publicly declared his interest for another term as vice-chairman while Moyo had opted to keep his cards close to the chest.\n\nI feel humbled about the trust that has been shown to me by Highlanders members. I am happy that I have been nominated unopposed but that does not make me a special person. I will keep learning and pursue the Highlanders mandate. Naturally, elections are divisive in that regard, I pray for peace and unity in the club. Im looking forward to going back to work for the club ahead of what looks like it will be a difficult season, said Siziba.\n\nHighlanders bus\n\nContacted for a comment, Khoza could not open up saying he was busy with his home errands and was going to get back to this reporter.\n\nKhoza despite being a candidate, nominated Moyo for the position of treasurer.\n\nIm sorry, I cant comment for now. Im busy attending to my dog at home. Im with a doctor, we will talk later because my dog can actually die, said Khoza. Candidates ought to have been Highlanders members for an uninterrupted period of 24 months, had to get their nomination forms signed by a minimum of 10 Bosso members in good standing and were required to pay a nomination fee of US$200 to qualify as contestants in the elections.\n\nThe nomination fee is refundable if a candidate receives at least 10 percent of the total votes cast for the position they are contesting.\n\nAfter the closing of the nomination process, what follows is the verification process that took place yesterday that saw the three candidates go through the vetting procedure after fulfilling the constitutional demands to stand for elections.\n\nAccording to the Bosso constitution, the nomination and electoral review committee sits as a court on a set date but soon after the closure of nominations to verify and consider nominations, candidates or their agents may be present at the verification and may be allowed to make representations in support of their nominations at the end of which the Nomination and Electoral Review Committee shall publish the list of successful candidates for any contested position.\n\nThis election is part of the clubs tradition of holding staggered elections for continuity.\n\nLast year, elections were held for three positions, namely, the executive chairman, secretary and for the committee member and this year, the focus is on the remaining two.  @FungaiMuderere.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/1a.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw HIGHLANDERS returning officer Peter Dube has revealed that three candidates have successfully been nominated to run for the positions of vice chairman and treasurer. The elections will be held on February 2. One candidate, Fiso Siziba, will go unopposed for the position of vice chairman while two candidates Israel Moyo and Nkani […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "Zulu lithium final commissioning nigh",
            "url": "https://www.chronicle.co.zw/zulu-lithium-final-commissioning-nigh/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPremier African Minerals Limited has raised 1,2 million through the issuance of new ordinary shares to fund the final commissioning and optimisation of the Primary Flotation Plant, as well as the purchase of the Secondary Flotation Plant in Zimbabwe.\n\nAccording to the company, part of the proceeds will be used to settle immediate creditor obligations and pay essential staff salaries before operations resume.\n\nThe company has faced challenges with the commissioning of the lithium flotation circuit at its Zulu plant in Insiza District, Matabeleland South, which has been inactive since July 2024. A successful three-to-five-day test run of the plant, scheduled for late January or early February 2025, is critical to restarting production.\n\nZulu Lithium plant in Fort Rixon, Matabeleland South Province\n\nThe Zulu plants prolonged inactivity and the need for additional funding have raised concerns.\n\nHowever, the companys trade creditors have remained supportive, awaiting the completion of remedial work. Premier has indicated ongoing negotiations with certain creditors of the company and Zulu, exploring the possibility of settling liabilities through the issuance of new shares. The company expects to reach agreements with some of these parties soon.\n\nPremier stated that the net funds raised will also be used to support the completion of the three-to-five-day test run of the flotation plant and the acquisition and commissioning of the Secondary Flotation Plant.\n\nThe estimated cost is US$800000, inclusive of the purchase of the spodumene flotation plant, part payment to the Government of Zimbabwe for deferred VAT and other statutory requirements of US$250000, part payment of salary and wage arrears totalling US$400000 and part payment to specific suppliers for plant spares and maintenance of US$180000. Any remaining balance will be allocated towards part payments to contractors and other creditors to ensure ongoing commercial operations.\n\nLast week, Premier African Minerals Limited announced a fundraising initiative on Thursday, involving the issuance of up to 8,263 million new ordinary shares of no par value each at an issue price of 0,0275 pence per share to raise gross proceeds (before fees and expenses) of up to 2,3 million.\n\nIn addition to the Retail Offer, the company conducted a placing of new ordinary shares, raising gross proceeds of 1,2 million. The issue price represented a discount of approximately 30%.\n\nAs part of the fundraising, the company is launching a separate Retail Offer to raise the remaining balance of up to 2,3 million at the issue price.\n\nThe board values its retail shareholder base, which has continued to support the company alongside various institutional investors, the company said.\n\nA section of-the Zulu Lithium Mine plant in Insiza Matabeleland South Province\n\nGiven the strong support of our retail shareholders, the company believes it is appropriate to provide retail shareholders with the opportunity to participate in the Retail Offer. For the avoidance of doubt, the Retail Offer is not part of the Placing. The results of the Retail Offer are expected to be announced on January 21, 2025.\n\nIn December 2024, Premier amended its Offtake and Prepayment Agreement with Canmax Technologies Co., Ltd concerning the Zulu Lithium and Tantalum Project.\n\nThe updated agreement, originally established in August 2023, modifies settlement options for Canmax and extends security provisions due to production delays.\n\nA lithium reef\n\nUnder the revised terms, if any prepayment and interest remain outstanding as of 1 April 2025, Canmax will be entitled to a direct interest in Zulu, valued at US$100 million, or new Premier shares at a price based on the prior 20-day average.\n\nThe amendment reflects the capital investment in Zulu to date and provides an alternative settlement to cash or product delivery. Additionally, Premier has agreed to extend Canmaxs security by offering a fixed charge over the shares of Zulu Lithium, without affecting Premiers other assets.\n\nCanmax also retains the discretionary right to convert interest owed into new Premier shares, maintaining a 13.38% stake in the company post-funding.\n\nCanmax, which holds over 10 percent of Premiers issued share capital, is listed on the Shenzhen Stock Exchange under the ticker 300390. The company has a market capitalisation of approximately US$2,6 billion and has historically provided substantial support to Premier.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/a-1.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw Premier African Minerals Limited has raised £1,2 million through the issuance of new ordinary shares to fund the final commissioning and optimisation of the Primary Flotation Plant, as well as the purchase of the Secondary Flotation Plant in Zimbabwe. According to the company, part of the proceeds will be used to settle […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "WATCH: Defence Forces Commander honours late national hero Major-General Siziba",
            "url": "https://www.chronicle.co.zw/defence-forces-commander-honours-late-national-hero-major-general-siziba/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Zimbabwe Defence Forces (ZDF) Commander, General Phillip Valerio Sibanda, yesterday honoured the late national hero, Major-General (Retired) Solomon Siziba, describing him as a champion of justice, a distinguished diplomat, and a steadfast patriot.\n\nMaj-Gen (Rtd) Siziba, a former freedom fighter, played a pivotal role in the establishment of the National Prosecution Authority (NPA). During his tenure as a defence attach in Botswana, he was instrumental in forming the Botswana Military Attach Association (BMAA) and drafting its constitution.\n\nThe 67-year-old passed away last Wednesday at Josiah Magama Tongogara Barracks Camp Hospital after a battle with cancer. President Mnangagwa conferred national hero status upon him, and he will be laid to rest tomorrow at the National Heroes Acre alongside former Cabinet Minister Cde Chenhamo Chakedza Chimutengwende.\n\nA military parade was held yesterday in his honour, with General Sibanda as the chief mourner, accompanied by Commander of the Zimbabwe National Army (ZNA) Lieutenant General Anselem Nhamo Sanyatwe.\n\nThe ceremony included the laying of wreaths and eulogies celebrating Maj-Gen (Rtd) Sizibas illustrious military career and unwavering dedication to the country.\n\nGen Sibanda recounted the late Major-Generals painful final days, noting that his advanced cancer prevented him from attending his wifes burial in November.\n\nHe said his condition was so severe that doctors in India advised it was almost untreatable. After stabilising him, Gen Sibanda brought Maj-Gen (Rtd) Siziba home, where he was cared for by a dedicated team of doctors and nurses.\n\nHe was in that facility from December up to last Wednesday when he passed on. Unfortunately, he passed on without seeing where his wife was buried. That is a painful situation, said Gen Sibanda.\n\nHe said Maj-Gen (Rtd) Siziba is part of the pupils from Manama High School who chose the countrys independence over a chance to advance his education under an oppressive Smith regime.\n\nTo the late retired Major-General Siziba, as we bid you farewell, you will be remembered for your immense contribution to the liberation struggle, standing firm for justice and defending Zimbabwes interests in all spheres, said Gen Sibanda.\n\nToday, what remains in our minds are the memories of a warm, humble, patriotic, selfless team player whom the nation will dearly miss, he said.\n\ndelegates following proceedings at the Travel talk seminar in Bulawayo\n\nGen Sibanda challenged the nation to defend the gains of the liberation and emulate heroes and heroines like Maj -Gen (Rtd) Siziba.\n\nAs we pay our last respects to the late retired General Officer, we must not forget the sacrifices that he and other heroes and heroines paid for us to get Zimbabwe free. It remains a great challenge to us all to defend the values that they stood and fought for, he said.\n\nWe must therefore defend Zimbabwes independence and sovereignty at all costs taking a leaf from the life of the late retired General Officer. We must uphold the principles and values that define the efforts of his generation of fighters.\n\nHe said Maj-Gen Rtd Siziba was part of the pupils from Manama Mission who joined the armed struggle in 1977 under Zimbabwe Peoples Revolutionary Army (Zipra) forces when he was in Form One.\n\nSome of Solomons cadres who crossed the border with the late Major-General included retired Air Chief Marshal Elson Moyo, the late national hero, retired Lieutenant General SB Moyo, Air Vice Marshal Masera and the Member of Parliament for Beitbridge East, Cde Albert Nguluvhe, he said.\n\nBorn on April 25, 1958, in Nhwali, Gwanda, Matabeleland South, Maj-Gen (Rtd) Siziba began his education at Nhwali Primary School before enrolling at Manama High School. He joined the liberation struggle in 1977 while in Form One, crossing the border into Zambia to fight under ZIPRA.\n\nIn Zambia in 1977, Maj-Gen (Rtd) Siziba underwent basic guerrilla training at CGT1 in East Lusaka and that is where he met Gen Sibanda who was the Camp Commandant.\n\nLeft: Pallbearers lift a casket carrying the body of the late national hero Major-General (Rtd) Solomon Siziba from a military helicopter at Nhwali High School in Gwanda. Above: Mourners pay their last respects at the Siziba homestead in Gwanda yesterday\n\nThe late national hero was among the cadres who survived the Freedom Camp and Mkushi Camp bombings by Rhodesian forces in 1978. He later underwent specialist reconnaissance training in Moscow, USSR and served as a Reconnaissance Detachment Commander until the ceasefire.\n\nIn 1979, he was selected to undergo specialist training in the Union of Soviet Socialist Republics, Moscow as a Reconnaissance Officer. On completion of the course, he was deployed at MTD Solwezi as the Reconnaissance Detachment Commander up to the ceasefire, said Gen Sibanda.\n\nAfter independence, Maj-Gen (Rtd) Siziba was attested into the Zimbabwe National Army (ZNA) commissioned as a captain and appointed Adjutant for the 18 Infantry Battalion in Kezi.\n\nHe served in Mozambique during the campaign for peace and stability and was deployed to the Democratic Republic of Congo (DRC) as a Staff Officer during the SADC intervention.\n\nIn 2005, he was appointed Defence Attach to Botswana, where he established the BMAA and crafted its constitution.\n\nThroughout his career, he upgraded his skills within the military attending courses in unit administration, administration inspection, officers foundation, junior staff, command and staff, military observers, United Nations military observers and military diplomatic.\n\nHis academic and military achievements were outstanding, including diplomas in business and human resources management, a Bachelor of Science in Peace, Conflict and Governance and a Masters in Business Administration, noted Gen Sibanda.\n\nMaj-Gen (Rtd) Sizibas contributions extended beyond the military. He was instrumental in establishing the NPA, serving as its board secretary and administrator.\n\nFor his service, Maj-Gen (Rtd) Siziba received numerous awards, including the Liberation Medal, Independence Medal, Long and Exemplary Service Medal, the Mozambique Campaign Medal for his contribution towards the restoration of peace and stability in Mozambique as well as the Democratic Republic of Congo Campaign Medal for participating in restoring sovereignty in DRC, and the Grand Officer of the Zimbabwe Order of Merit for distinguishing himself as a principled, loyal, dedicated and competent leader.\n\nGeneral Sibanda urged Zimbabweans to honour the sacrifices of heroes like Maj-Gen (Rtd) Siziba by safeguarding the countrys independence and sovereignty.\n\nMaj-Gen (Rtd) Siziba held various military appointments, including Commanding Officer of the 43 Infantry Battalion, Defence Attach to Botswana and Deputy Commander of 1 Infantry Brigade, before retiring as Brigadier General Inspectorate at Army Headquarters.\n\nThe late Maj Gen (Rtd) Siziba held a number of appointments during his military service that included Adjutant, Company Second in Command, Wing Officer Commanding at Pay and Records, Administrative Staff Officer Grade Three (Personal Services) at Army Headquarters, Administrative Staff Officer Grade Two (Conditions of Service) at Army Headquarters, said Gen Sibanda.\n\nHe is survived by two children and several grandchildren. His body was flown to Harare after the parade, ahead of his burial tomorrow.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/6-2.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  THE Zimbabwe Defence Forces (ZDF) Commander, General Phillip Valerio Sibanda, yesterday honoured the late national hero, Major-General (Retired) Solomon Siziba, describing him as a champion of justice, a distinguished diplomat, and a steadfast patriot.  Maj-Gen (Rtd) Siziba, a former freedom fighter, played a pivotal role in the establishment of the National Prosecution Authority […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "Government hands over 415 computers to 39 RDCs",
            "url": "https://www.chronicle.co.zw/government-hands-over-415-computers-to-39-rdcs/",
            "content": "Mthabisi Tshuma in Harare\n\nTHE Ministry of Information Communication Technology (ICT), Postal and Courier Services and the telecommunications regulator, Potraz, yesterday handed over 415 computers to 39 rural district councils (RDCs) countrywide as part of efforts to foster inclusive development and bridge the rural and urban divide.\n\nZimbabwe has 60 RDCs and the remaining 21 local authorities are set to benefit in the next batch set for the coming months.\n\nSpeaking at the handover ceremony at Potraz headquarters here, ICT Minister, Dr Tatenda Mavetera, said Government was committed to empowering rural communities and capacitating them to tap into the technological advancements.\n\nThe handover of ICT equipment to 39 rural district councils is a significant step towards enhancing governance and service delivery in Zimbabwes rural areas, she said.\n\nHon T.A Mavetera\n\nThis bold initiative reflects a commitment to improving connectivity and access to information in our rural communities, ensuring that rural district councils can operate more efficiently.\n\nThe newly donated equipment will bolster the efficiency of rural district councils, allowing for streamlined communication and better co-ordination of services, said Dr Mavetera.\n\nThis donation is an actualisation of the Whole-of-Government Approach championed by President Mnangagwa, emphasising a united effort to improve the lives of citizens in rural regions.\n\nShe said the Ministry of ICT, Postal and Courier Services plays a crucial role in this process by collaborating with the Ministry of Local Government and Public Works to ensure that no council is left behind.\n\nBy working together, the minister said ministries can leverage their respective strengths and resources to tackle complex challenges more effectively.\n\nFurthermore, this move aligns with the broader goals of devolution as outlined in Vision 2030. By equipping rural district councils with the necessary tools, the Government is supporting the decentralisation of power and resources, which is essential for local development, she added.\n\nAdditionally, there are plans for more equipment donations to other councils, reinforcing the commitment to equitable access to technology across the country.\n\nThis donation is an initiative of the Ministry of ICT, Postal and Courier Services, through the Universal Services Fund (USF) where we are implementing the e-Government programme to enhance the use of ICTs in Government operations, ultimately aiming to improve service delivery and foster greater community engagement, said Dr Mavetera.\n\nReceiving the donation, Local Government and Public Works Deputy Minister, Engineer Benjamin Kabikira, expressed gratitude to the continuous support from the ICT Ministry.\n\nDeputy Minister Benjamin Kabikira\n\nThe ministry was fortunate enough to receive your support through a consignment of ICT gadgets, in the manner of laptops. I am happy to report that your donation has gone a long way in giving wings to our ministrys thrust of modernising and digitising our operations at all levels, he said.\n\nHowever, notwithstanding the foregoing, we will continue to knock on your doors, Honourable Minister, for more support, particularly given the huge need for ICT support in the ministry.\n\nTodays event marks and breaks new ground as it aptly shows Governments commitment to supporting local authorities, who are a third and important tier of Government.\n\nEng Kabikira said the donation of computers will essentially accelerate Governments modernisation and digitisation agenda as Zimbabwe pursues Vision 2030 compliant service delivery by local authorities in line with the Call to Action Blueprint.\n\nHe said in an era where ICT has become an undoubted pillar of national development, it is imperative that rural areas are not left behind in the digital transformation journey.\n\nThese computers will enable our rural district councils to streamline their operations, improve service delivery, and engage more effectively with the communities they serve, said Eng Kabikira.\n\nAs I humbly receive these computers on your behalf, I urge the leadership of rural district councils to make the most of this investment, embrace technology with open arms and let it be the catalyst for better and efficient service delivery.\n\nWhere training is required for efficient use of the machines, please do, so that you derive maximum benefit for your communities, he added.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/JJKLJKLGKKJG.jpg",
            "description": "Mthabisi Tshuma in Harare THE Ministry of Information Communication Technology (ICT), Postal and Courier Services and the telecommunications regulator, Potraz, yesterday handed over 415 computers to 39 rural district councils (RDC’s) countrywide as part of efforts to foster inclusive development and bridge the rural and urban divide.  Zimbabwe has 60 RDC’s and the remaining 21 […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "Trio arrested over Tsholotsho Presidential Input Scheme theft",
            "url": "https://www.chronicle.co.zw/trio-arrested-over-tsholotsho-presidential-input-scheme-theft/",
            "content": "Gibson Mhaka,Zimpapers Writer\n\nTHE case of the missing Presidential Input Scheme seeds meant for Ward Seven in Tsholotsho District in Matabeleland North Province has taken a new twist following the arrest of Lydia Moyo (52), a Grain Marketing Board (GMB) employee in charge of the depot, Abisanjo Mpofu (44), a police officer stationed at ZRP Tsholotsho and Justin Maparadze (40), a security officer at the depot.\n\nThe trio has appeared in court before Tsholotsho resident magistrate, Mr Lesigo Ngwenya, facing theft charges.\n\nThey were not asked to plead and were remanded in custody to January 22.\n\nAllegations are that Moyo instructed her subordinates to load the vehicle but failed to record any particulars of the loaded consignment.\n\nMpofu allegedly escorted the vehicle from the GMB Tsholotsho loading bay to an unknown destination and was reportedly not on duty while Maparadze, who was on duty at the gate, also failed to record details of the consignment upon leaving the GMB depot.\n\nRepresenting the State, Ms Netsai Toga, told the court that on January 4 at the GMB Tsholotsho depot, the three accused, in the company of their accomplices, Kwanele Dube, an extension officer from the Agriculture and Rural Development Advisory Services, Langton Ncube, a GMB supervisor and Jacob Gombera who are currently on the run allegedly, hatched a plan to steal Presidential Inputs, which were being kept at Moyos workplace.\n\nDube, who was responsible for maintaining a register for beneficiaries of the inputs, approached Ncube who was responsible for supervising the loading of inputs, documentation and distribution of inputs, to dispatch a load under the pretext that it was going to be distributed to Ward Seven in Tsholotsho District.\n\nThe court heard that one of the accused persons later approached Gombera, instructing him to come and load the consignment.\n\nGombera reportedly hired a DAF Truck driven by Brighton Mudzingwa, from Bulawayo to Tsholotsho.\n\nUpon his arrival at the GMB Tsholotsho depot, Maparadze opened the gate for him and directed the truck to the loading bay.\n\nWhile inside, Gombera disembarked from the truck and went to see Moyo in her office.\n\nGombera reportedly presented himself as a farmer who had come to collect the consignment for his ward.\n\nSoon after meeting her, Moyo and Ncube are alleged to have directed their subordinates to load the vehicle with 400 bags of 50kg Urea fertiliser, 30 bags of 10kg sunflower seeds and 100 bottles of 200ml Idacloprid chemicals.\n\nWhile the truck was being loaded, Mpofu and Dube arrived. Dube was driving a silver Toyota Fortuner, while Mpofu was walking.\n\nMaparadze reportedly did not record the vehicle and the drivers particulars in his visitors book.\n\nAfter the truck finished loading, Mpofu, Ncube and Gombera escorted it to the entrance gate, where Maparadze opened the gate for them and they left.\n\nIt is alleged that after travelling a distance of about five kilometres using the MbambaTshefunye Road, Mpofu and Ncube disembarked from the vehicle and joined Dube, who had come to pick them up with his Toyota Fortuner. They then left for an unknown destination.\n\nGombera led the truck to Best Blue Investments in Kelvin North, Bulawayo, where he offloaded the consignment valued at US$15680.\n\nThe arrests of the accused persons followed an investigation by the police at the behest of the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Gibson Mhaka, Zimpapers Writer THE case of the missing Presidential Input Scheme seeds meant for Ward Seven in Tsholotsho District in Matabeleland North Province has taken a new twist following the arrest of Lydia Moyo (52), a Grain Marketing Board (GMB) employee in charge of the depot, Abisanjo Mpofu (44), a police officer stationed at ZRP […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "Tanganda moves to address key operational issues",
            "url": "https://www.chronicle.co.zw/tanganda-moves-to-address-key-operational-issues/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTANGANDA Tea Company has moved in to address several key operational matters, including the proposed creation of Class A ordinary shares for listing on the Victoria Falls Stock Exchange (VFEX) as a secondary listing.\n\nThe company has said it is seized with preparing a circular to that effect, which will also cover details of a renounceable Rights Offer and convening of an Extraordinary General Meeting (EGM).\n\nLast year, the company expressed interest in migrating its listing from the Zimbabwe Stock Exchange to VFEX.\n\nTanganda Tea company estates\n\nHowever, it later decided to create a new class of shares to be listed on VFEX instead. Tanganda, listed on the ZSE, is an agribusiness company that produces, packs and distributes tea, coffee, avocados, macadamia nuts and spring water.\n\nIn a further cautionary announcement yesterday, Tanganda said it is finalising the preparation of a circular to shareholders.\n\nThe circular will contain details of the following interrelated transactions and will also include a notice to convene an Extraordinary General Meeting (EGM) of members to consider and approve the transactions.\n\nThe proposed creation of a new class of shares to be known as Class A ordinary shares, which will be subsequently listed on the Victoria Falls Stock Exchange (VFEX) as a secondary listing, and a Renounceable Rights Offer of the listed Class A ordinary shares to the existing ordinary shareholders in proportion to their shareholding in the company to raise eight million United States dollars (US$8 million).\n\nIt said the transactions, if successful, may have a material effect on its share price. A renounceable right is an offer issued by a corporation to shareholders to buy more shares of the companys stock, usually at a discount.\n\nVFEX, a US dollar-denominated stock exchange, is increasingly becoming the preferred stock exchange as it continues to evolve through new listings and new product development.\n\nSince its inception in October 2020, VFEX has attracted listings from various sectors such as mining, financial services, tourism and clothing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/aa.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw TANGANDA Tea Company has moved in to address several key operational matters, including the proposed creation of Class A ordinary shares for listing on the Victoria Falls Stock Exchange (VFEX) as a secondary listing. The company has said it is seized with preparing a circular to that effect, which will also cover […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        },
        {
            "title": "Tuskers, Rhinos tie drawn",
            "url": "https://www.chronicle.co.zw/tuskers-rhinos-tie-drawn/",
            "content": "Brandon Moyo,[emailprotected]\n\nTUSKERS were once again left reeling as another Logan Cup match ended in a draw due to persistent rain over the past couple of weeks.\n\nTuskers had hoped to capitalise on playing at home when they hosted Rhinos at Bulawayo Athletic Club (BAC), but rain played spoilsport yet again. Only 9.3 overs were bowled during the match.\n\nThere was no play on the first two days, and action was limited to a brief period on day three before play was suspended due to wet patches on the field. Despite hopes for play on the final morning, overnight rain rendered the ground unfit, and match officials eventually called for a draw, citing the outfield would only have been playable after 3pmtoo late to achieve any meaningful result.\n\nThis marked the second consecutive Logan Cup match for Tuskers affected by rain, following a rain-affected draw against Southern Rocks in Harare last week.\n\nSpeaking after the suspension of play on day three, Tuskers head coach Walter Chawaguta, expressed hope for improved results in future matches. While he praised the teams batting, he highlighted the need for better performances with the ball to secure victories and move off the bottom of the standings.\n\nThe Bulawayo side are yet to register a Logan Cup win this season, with three draws and two defeats in five matches.\n\nWalter Chawaguta\n\nWe still havent won a Logan Cup match, and Ive spoken to my players about this. Weve done well with the bat; the only problem is that we havent taken 20 wickets.\n\nIn Mutare, we batted well and put Mountaineers under pressure but couldnt take the 20 wickets and the game ended in a draw. Against Rocks, the rain didnt help, and we ended up just batting for most of the two days, putting on an imposing score but never getting an opportunity to bowl, said Chawaguta.\n\nThe coach added that their chances of securing a positive result hinge on their ability to take 20 wickets.\n\nWeve played reasonably well. If you look at the team second on the log, they havent won a match either. Theyve accumulated all their points through batting and bowling points, which we havent fully capitalised on. The main focus for us going into the second round is to work harder on our bowling to ensure we take 20 wickets, as that gives us the best chance of achieving a positive result.\n\nAfter the toss, conducted after lunch on day three, Rhinos elected to field first. When play was suspended, Tuskers were 17/0, with Tanunurwa Makoni on 11 runs off 28 balls and Nkosana Mpofu on 5 runs off 30. Play was eventually called off shortly after the tea break.\n\nTuskers Cricket players\n\nIn their previous Logan Cup match against Rocks, Tuskers ended with a commanding total of 557/5 after 136 overs, courtesy of centuries from Makoni and Mpofu. Mpofu scored 120 runs off 224 balls, while Makoni remained unbeaten on 185 off 281 deliveries.\n\nLuke Jongwe was nearing a century, finishing on 94 not out off 196 balls. Brian Chari contributed 77 runs from 122 balls, while Brian Mudzinganyama fell just short of a half-century with 46 runs off 69 deliveries. Rocks bowlers Keith Jaure (2/78), Sydney Murombo, Priviledge Chesa and Innocent Kaia, each claimed a wicket.\n\nTuskers next Logan Cup match is against Eagles in Harare, starting on January 28. Before that, they will play a Pro50 Championship match on January.26. @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/2a.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com TUSKERS were once again left reeling as another Logan Cup match ended in a draw due to persistent rain over the past couple of weeks. Tuskers had hoped to capitalise on playing at home when they hosted Rhinos at Bulawayo Athletic Club (BAC), but rain played spoilsport yet again. Only 9.3 overs […]",
            "time": "06:37",
            "date": "21 Jan 2025"
        }
    ]
}