{
    "news": [
        {
            "title": "Nama organisers respond to fashion oversight . . . share plans for dedicated fashion category",
            "url": "https://www.chronicle.co.zw/nama-organisers-respond-to-fashion-oversight-share-plans-for-dedicated-fashion-category/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nOrganisers of the National Arts Merit Awards (Nama) are exploring the introduction of a fashion category following criticism from the fashion community. The move comes after renowned traditional attire specialist Zana Kay expressed her disappointment with the Namas treatment of fashion as an art form.\n\nZana Kay, who designed the cowhide suit worn by National Arts Council of Zimbabwe (NACZ) executive director Napoleon Nyanhi at the 23rd Namas, called attention to the perceived oversight of fashion in the awards.\n\nIn her social media post, Zana Kay highlighted the cultural and creative value of fashion, pointing to Zimbabwean designs like the hut paintings of the Matobo women and Freddy Sozinio Jacksons Zimbabwean flag beading.Fashion is about creativity, aesthetic expression, and storytelling. Id have loved to see Miss Universe Zimbabwes famous National Dress (which she wore at the global contest) on the red carpet . . . it is wearable art and got the nation talking.\n\nIn response, NACZ communications manager Agga Nyabinde reassured that discussions are underway to introduce fashion as a stand-alone category in future editions. While the process may take time, Nyabinde stressed the NACZs commitment to elevating fashion as a recognised art form.We truly understand and appreciate the concerns, but as the NACZ, we cant decide what one wears to the award ceremony, he said.\n\nWe are not ghosting the fashion side of art. In fact, we are in talks with relevant authorities to have fashion as a stand-alone category in the future.\n\nThe recent Namas saw the addition of seven new awards, but the lack of a dedicated fashion category raised concerns. With Zimbabwes rich cultural heritage on display, the future of fashion at the Namas looks promising.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sfsf.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Organisers of the National Arts Merit Awards (Nama) are exploring the introduction of a fashion category following criticism from the fashion community. The move comes after renowned traditional attire specialist Zana Kay expressed her disappointment with the Namas’ treatment of fashion as an art form. Zana Kay, who designed the cowhide suit […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "Gweru business couple received prestigious international business award",
            "url": "https://www.chronicle.co.zw/gweru-business-couple-received-prestigious-international-business-award/",
            "content": "Patrick Chitumba[emailprotected]\n\nRIVER Valley Properties, led by renowned Gweru-based couple, Mncedisi Dube and Smelly Dube, has added another feather to its cap after receiving a prestigious international business award in the United Kingdom last Friday.\n\nThe company was named as one of the top 100 Emerging Global Businesses for 2025 at a ceremony held at the UK House of Lords.\n\nThere were over 200 leading companies open for collaborations with the River Valley Group to build partnerships, exchange ideas, and explore synergies to drive its business forward.\n\nDr Smelly Dube honoured in UK\n\nAt the event, global leaders, chief executive officers and business people engaged with some of the most influential decision-makers from around the world brought together by a distinguished audience, offering unparalleled opportunities to expand professional network.\n\nOrganisers of the event said the award for River Valley is a prestigious recognition of the next wave of innovative enterprises reshaping the global economy.\n\nThese companies represent the cutting edge of industry transformation, from pioneering technologies to game-changing strategies across diverse sectors.\n\nEach business on this list has shown outstanding growth, resilience, visionary leadership, and sustainability, setting the bar for excellence in the global marketplace, said the organisers.River Valley got an opportunity to gain exclusive visibility for its brand to an elite global audience and in the process gaining recognition on an international stage.\n\nAfter receiving the award, Dr Smelly Dube said as a group, they were humbled by such an international recognition.\n\nThis recognition is accepted with utmost humility and great appreciation. As a group we are indeed inspired and motivated to do more for our country and humanity, she said.\n\nWe continue to be inspired by our President Dr. Emmerson Mnangagwas vision 2030. Zimbabwe is indeed open for business for both foreign and domestic investors, she said.\n\nThe event was attended by high level business leaders and political leaders with Zimbabwe represented by the Minister of Finance, Economic Development and Investment Promotion Professor Mthuli Ncube and Zanu PF spokesperson and International Business Consultant, Ambassador Chris Mutsvangwa.\n\nRiver Valley Properties is a headquartered in Gweru and involved in private land development, mining under its subsidiary Tebekwe Mine, the retail business and security.\n\nIt has over a decade experience in the real estate sector where the firm has developed various housing projects in Gweru, Shurugwi, Zvishavane and Bulawayo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jhj.jpg",
            "description": "Patrick Chitumba patrick.chitumba@chronicle.co.zw RIVER Valley Properties, led by renowned Gweru-based couple, Mncedisi Dube and Smelly Dube, has added another feather to its cap after receiving a prestigious international business award in the United Kingdom last Friday. The company was named as one of the top 100 Emerging Global Businesses for 2025 at a ceremony held […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "2026 FIFA World Cup final will have a Super Bowl-style halftime musical show.",
            "url": "https://www.chronicle.co.zw/2026-fifa-world-cup-final-will-have-a-super-bowl-style-halftime-musical-show/",
            "content": "Online Reporter\n\nFIFA president Gianni Infantino has revealed that the 2026 FIFA World Cup final will have a Super Bowl-style halftime musical show.\n\nI can confirm the first ever half-time show at a FIFA World Cup final in New York New Jersey, in association with Global Citizen. This will be a historic moment for the FIFA World Cup and a show befitting the biggest sporting event in the world, he shared on Instagram.\n\nThe show will be held at MetLife Stadium in East Rutherford, New Jersey, on July 19, 2026.\n\nThis will be a historic moment for the FIFA World Cup and a show befitting the biggest sporting event in the world, Infantino further shared on Instagram, emphasising the scale of entertainment that fans can expect.\n\nThe introduction of a halftime show aligns FIFA with the entertainment driven model of American sports, particularly the NFLs Super Bowl, which has long set the gold standard for halftime performances.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/01/Infantino.jpg",
            "description": "Online Reporter FIFA president Gianni Infantino has revealed that the 2026 FIFA World Cup final will have a Super Bowl-style halftime musical show. “I can confirm the first ever half-time show at a FIFA World Cup final in New York New Jersey, in association with Global Citizen. This will be a historic moment for the […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "ZANU PF expels Central Committee member Blessed Geza",
            "url": "https://www.chronicle.co.zw/zanu-pf-expels-central-committee-member-blessed-geza/",
            "content": "Online ReporterZANU PF has expelled Central Committee member and war veteran Blessed Geza with immediate effect, the partys secretary for legal affairs, Cde Patrick Chinamasa, has announced.\n\nCde Chinamasa said the decision was made following internal party processes.\n\nLast month, the ZANU PF Mashonaland West province unanimously recommended Gezas expulsion, while the War Veterans League denounced him for attacking the party leadership.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dvfd.jpg",
            "description": "Online Reporter ZANU PF has expelled Central Committee member and war veteran Blessed Geza with immediate effect, the party’s secretary for legal affairs, Cde Patrick Chinamasa, has announced. Cde Chinamasa said the decision was made following internal party processes. Last month, the ZANU PF Mashonaland West province unanimously recommended Geza’s expulsion, while the War Veterans […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "Bulawayo man arrested with 2kg of crystal meth as Zimbabwe intensifies anti-drug crackdown",
            "url": "https://www.chronicle.co.zw/bulawayo-man-arrested-with-2kg-of-crystal-meth-as-zimbabwe-intensifies-anti-drug-crackdown/",
            "content": "Sinokubonga Nkala\n\nPOLICE in Bulawayo have arrested a man from Matsheumhlope suburb for possessing 1,9 killogrammes of Crystal Meth.\n\nTigors Tyron Seigfried (39), according to a police statement on X, was busted following a raid at his home along Chelsmford Road.\n\nCrystal Meth, short for crystal methamphetamine, is a powerful and highly addictive synthetic stimulant drug.\n\nIt belongs to the amphetamine class of drugs and is chemically similar to methamphetamine, a substance used in some medical treatments for conditions like ADHD and obesity.\n\nHowever, Crystal Meth is produced illegally and is far more potent, making it extremely dangerous.The drug typically appears as clear, crystal-like chunks or shiny blue-white rocks, which can be smoked, snorted, injected, or swallowed. Its street names include ice, crystal, glass, and Tik.Crystal Meth has profound and often devastating effects on the brain and body. Its impact can be both immediate and long-term, with severe consequences for physical health, mental well-being, and social functioning.\n\nShort-term effects include: euphoria and increased energy, increased heart rate and blood pressure, decreased appetite, hyperactivity and insomnia, aggression and paranoia.\n\nCrystal Meth can cause irritability, violent behaviour, and paranoid delusions, making users a danger to themselves and others.\n\nThe long term effects of taking the drug are life threatening and include; addiction, brain damage, physical deterioration, organ damage to the heart, liver, kidneys, and lungs, increasing the risk of chronic diseases and premature death.\n\nCrystal Meth abuse doesnt just affect individuals; it has far-reaching consequences for families and communities. It contributes to increased crime rates, strains healthcare systems, and undermines social cohesion. In Zimbabwe, where drug abuse is on the rise, the spread of Crystal Meth poses a significant threat to public health and national development.\n\nEfforts to combat the drugs proliferation, such as the recent arrest of Tigors Tyron Seigfried in Bulawayo, are critical in addressing this growing crisis. Public awareness campaigns, rehabilitation programmes, and stricter law enforcement are essential to curbing the spread of this destructive substance.\n\nThe arrest comes amid a nationwide crackdown on drug and substance abuse, which has become a growing concern in Zimbabwe.\n\nAccording to police statistics, drug-related arrests have surged in recent years.\n\nIn 2023, police reported over 5 000 drug-related arrests across the country, with a significant number of cases involving dangerous substances such as Crystal Meth, heroin, and marijuana. Bulawayo, Zimbabwes second-largest city, has seen a sharp rise in drug-related crimes, particularly among youths, prompting law enforcement agencies to intensify operations.\n\nThe Zimbabwean Government has adopted a zero-tolerance approach to drug abuse, with President Emmerson Mnangagwa declaring the fight against drugs a national priority.\n\nA National Drug Master Plan, launched in 2020, aims to curb drug trafficking, abuse, and related crimes through a multi-sectoral approach involving law enforcement, education, and community awareness campaigns.\n\nPolice have also called for collaboration with traditional leaders, religious institutions, and community organisations to raise awareness about the dangers of drug abuse. The hashtag #NotoDrugandSubstanceAbuse has gained traction on social media as part of a broader campaign to mobilise public support for the anti-drug initiative.\n\nA National toll-free number +263 714 647 002 has been established to assist those struggling with drug and substance abuse and for members of the public to report drug-peddlers.\n\nAs the country grapples with the drug menace, the arrest of Seigfried serves as a stark reminder of the ongoing battle against drug trafficking and the need for sustained efforts to safeguard the nations future.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hvfh.jpg",
            "description": "Sinokubonga Nkala POLICE in Bulawayo have arrested a man from Matsheumhlope suburb for possessing 1,9 killogrammes of Crystal Meth. Tigors Tyron Seigfried (39), according to a police statement on X, was busted following a raid at his home along Chelsmford Road. Crystal Meth, short for crystal methamphetamine, is a powerful and highly addictive synthetic stimulant […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "Watch: Kwela Rekording camp a success",
            "url": "https://www.chronicle.co.zw/watch-kwela-rekording-camp-a-success/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nLAST weekend, the quiet streets of Morningside in Bulawayo transformed into a hive of creativity as hip-hop artistes converged for the Kwela Initiative. Over three transformative days, from Friday to Sunday, these talented individuals gathered at a private Airbnb, resulting in an astonishing 32 tracks being recorded  a feat that resonates deeply within the heart of the Bulawayo rap scene.\n\nThis exceptional event was not merely a recording camp; it was a movement, sparked by the powerful themes explored during the, Conflict Transformation: Hip Hop vs Community Indaba. The Kwela Initiative served as a platform for selected artistes to delve into the complexities of their narratives, igniting a creative fire that would fuel their music for years to come.\n\nFarai\n\nAmong the illustrious names present were Swazy, Stones Moyo, Fuel The Don, Curtis Dee Rovar, Nsizwa Black, TBK, Farai, Ghawdzilla, Israel, CMK, Mike the Future, Salem Bhebhe, KidThrill, Philo Cliff, Canvus Ports, Kereng, and Rayzon. Each artist brought their unique flavor to the mix, embodying the rich tapestry of Bulawayos hip-hop culture.\n\nThe gathering was a response to the long-standing challenges plaguing the local sceneissues of support, recognition, and unity. The Kwela Initiative not only fostered dialogue among stakeholders, media, businesspeople, and creatives but also laid the groundwork for a more robust and united hip-hop community. This collaborative spirit was palpable as artistes shared ideas, inspirations, and their collective vision for the future of Bulawayo hip-hop.\n\nAsaph Afrika, one of the driving forces behind the Kwela Initiative, reflected on the experience with a sense of pride and optimism.\n\nTheres so much to learn and grow from this experience. It was thrilling to see the artistes organise themselves, showing the world that they are ready to work hard. Now weve got the music; the next step is sorting and finalising the mixes before the release and concert, he shared.\n\nhttps://youtube.com/shorts/AyGK1opQUtE\n\nThe magnitude of recording 32 tracks in just three days is nothing short of magnificent. It speaks to an unparalleled work ethic and a hunger for artistic expression that many believed was dormant.\n\nTrap artiste, TBK articulated this sentiment vividly, stating, Being surrounded by a collection of individuals representing different subgenres of hip-hop was surreal. The unity was unmatched; people were hungry and cooking like crazy.\n\nShe added, I found myself in a Kwaito track alongside MK BEATS, Ganyaz Jr, Brintz, and Fuel the Dona combination I never foresaw. This effort is crucial in reclaiming Bulawayos position as Zimbabwes hip-hop capital.\n\nFor Kereng, the experience was a much-needed catalyst for change.\n\nThe recording camp was everything the city needed. We had a chance to link up as brands to uplift the music scene in Bulawayo. We worked day and night without sleeping, which showed how serious we are about our careers. It motivated me to keep my head high and gave me hope. I wish the city could have more initiatives like these, he remarked.\n\nPhilo Cliff echoed this sentiment, describing the camp as an incredible opportunity for personal and artistic growth.\n\nI was able to tap into my creativity, learn from other talented artists, and push myself to new heights. The insights gained from industry professionals were invaluable, and I cant wait to share the music we created, he said.\n\nMichy Zee, one of the organisers, captured the essence of the weekend perfectly: It was the most fulfilling beautiful experience Ive ever had. To think that by Saturday morning we had already recorded nine tracksit was crazy. These artistes werent sleeping, literally. It couldve been more if we didnt check out early.The success of the Kwela Initiative serves as a beacon of hope for the Bulawayo hip-hop scene. It showcased not just the talent and dedication of its artistes but also the potential for growth and transformation within the community.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fv6u.png",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com LAST weekend, the quiet streets of Morningside in Bulawayo transformed into a hive of creativity as hip-hop artistes converged for the Kwela Initiative. Over three transformative days, from Friday to Sunday, these talented individuals gathered at a private Airbnb, resulting in an astonishing 32 tracks being recorded – a feat that resonates […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "Woman teams up with four men to kill boyfriend",
            "url": "https://www.chronicle.co.zw/woman-teams-up-with-four-men-to-kill-boyfriend/",
            "content": "Ronald Mpofu, Online ReporterPOLICE in Plumtree have arrested five suspects in connection with the murder of Mxolisi Ncube, who was killed at Phezulu Bar in Mathendele Extension on 27 February 2025.According to witnesses, Ncube had a fight with his girlfriend Christabel Mlambo (29) around 9 PM, which escalated when four men, Shephard Hikwa (41), Onesimo Moyo (37), Onesimo Ndlovu (23) and Mark Sandile Moyo (22), intervened.In the chaos, one of the suspects pushed Ncube, causing him to fall onto the concrete floor.In a bizarre attempt to revive the victim, the suspects poured a bucket of water on him before fleeing the scene. Police later found Ncubes body lying face down on the concrete floor, with a bleeding nose.Acting Spokesperson for Matabeleland South Province, Inspector Stanford Mguni, confirmed the incident and the arrest of the unnamed suspects.Yes, we have had an incident of a murder case, and five suspects have been arrested. Investigations are ongoing, he said.The five suspects, comprising four men and one woman, are currently in custody at Plumtree Police Station and are expected to appear in court soon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Ronald Mpofu, Online Reporter POLICE in Plumtree have arrested five suspects in connection with the murder of Mxolisi Ncube, who was killed at Phezulu Bar in Mathendele Extension on 27 February 2025. According to witnesses, Ncube had a fight with his girlfriend Christabel Mlambo (29) around 9 PM, which escalated when four men, Shephard Hikwa […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "Binga comes alive with launch of Presidential Borehole Scheme",
            "url": "https://www.chronicle.co.zw/binga-comes-alive-with-launch-of-presidential-borehole-scheme/",
            "content": "Raymond Jaravaza in Binga\n\nHUNDREDS of Binga villagers and Zanu PF supporters thronged Ndaliyoka Shopping Centre on Thursday to witness the launch of the borehole and housing scheme under the Presidential War Veterans Fund.\n\nA jubilant crowd welcomed Presidential Advisor Dr Paul Tungwarara, Secretary of Veterans in the Politburo Cde Douglas Mahiya, and Matabeleland North Minister of State for Provincial Affairs and Devolution Richard Moyo to the venue.\n\nA solar-powered borehole was drilled earlier on Thursday morning at Ndaliyoka Shopping Centre, which will serve the local community. War veterans in Binga and Matabeleland North are set to benefit from the Presidential War Veterans Fund.\n\nScores of war veterans from across the country have already had boreholes drilled at their homes under the ongoing Presidential Borehole Drilling Scheme.\n\nThe newly launched scheme, which also includes housing and solar power initiatives, aims to provide decent housing for war veterans while ensuring they benefit from solar energy. Each war veteran will have access to a solar-powered borehole at their home.\n\nWar veterans from Mashonaland East, Manicaland, Mashonaland West, Harare, and Matabeleland South have already had boreholes drilled at their homes under the programme.\n\nThe initiative, spearheaded by Presidential Adviser Dr Tungwarara, will cascade to every province in line with President Mnangagwas vision of leaving no one and no place behind.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Guest-of-honour-Cde-Mahiya-gives-his-remarks.jpg",
            "description": "Raymond Jaravaza in Binga HUNDREDS of Binga villagers and Zanu PF supporters thronged Ndaliyoka Shopping Centre on Thursday to witness the launch of the borehole and housing scheme under the Presidential War Veterans Fund. A jubilant crowd welcomed Presidential Advisor Dr Paul Tungwarara, Secretary of Veterans in the Politburo Cde Douglas Mahiya, and Matabeleland North […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "Harare Open Mic celebrates Women’s Day by uniting female acts",
            "url": "https://www.chronicle.co.zw/harare-open-mic-celebrates-womens-day-by-uniting-female-acts/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nAs Zimbabwe joins the world in celebrating International Womens Day this Saturday, the Harare Open Mic returns with a fresh line-up of both emerging and established artistes, creating a vibrant space for artistic expression.\n\nInternational Womens Day is a global occasion that recognises the social, economic, cultural, and political achievements of women while calling for action toward gender equality. Set to take place at The Garden in Newlands, Harare, from 2pm, Harare Open Mic continues to provide a platform for artistes to experiment with the stage, build confidence, and network with other creatives.\n\nNow in its fifth edition, the event has grown into a key space, particularly for young artistes seeking exposure and opportunities in the industry.\n\nThis years line-up features a dynamic mix of talent, including rising poets Tadana Nakai and Yvonne Matanhire, who will share the stage with seasoned wordsmiths such as Shingirai Manyengavana, Takudzwa Goniwa, Khadijah Finesse, Tamika, Momo Size, and Tawanda Vombo.Adding a musical touch to the evening, young and talented mbira player Aripheleng Kwela is expected to captivate the audience with her powerful vocals. The line-up also includes hip-hop sensation D-Blok, AneUnhu Gwatidzo, Tendai Mhlanga, Nicole Livet, The Breeze, and several other fresh voices making their Harare Open Mic debut.\n\nHarare Open Mic organiser Batsirai Chigama described the events journey as a rewarding challenge.I remember a time when spaces like this were made available to us by the Book Caf. It was an environment filled with endless networking opportunities, collaborations, and a chance for young artistes to find their voice before stepping onto bigger platforms.It excites me to be able to create such a space for young artistes to grow. This year, we have partnered with The Garden, One Billion Rising, and over 32 artistes who will showcase music, comedy, poetry, dance, and theatre, said Chigama.\n\nShe also revealed that registration for the event was oversubscribed, showing the growing demand for such platforms among emerging creatives.It is encouraging to see young artistes hungry to perform. If resources allow, I hope to organise more regular sessions so more artistes can benefit from this initiative, she added.Encouraging people to attend, Chigama said Harare Open Mic offers a laid-back, family-friendly atmosphere where young and aspiring artistes can be inspired.If you know someone who could benefit from this space, bring them along. They might learn a thing or two and be inspired to explore their talent, she said.\n\n@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2017/07/microphone-with-audience.jpg",
            "description": "Mthabisi Tshuma,revmmthiretshuma@gmail.com As Zimbabwe joins the world in celebrating International Women’s Day this Saturday, the Harare Open Mic returns with a fresh line-up of both emerging and established artistes, creating a vibrant space for artistic expression. International Women’s Day is a global occasion that recognises the social, economic, cultural, and political achievements of women while […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        },
        {
            "title": "Watch :Community panics as boy 13 poisons water source with herbicide",
            "url": "https://www.chronicle.co.zw/watch-community-panics-as-boy-13-poisons-water-source-with-herbicide/",
            "content": "Thupeyo Muleya,Beitbridge Bureau\n\nTHE COMMUNITY in Ward 7 in the Mutetengwa area in Beitbridge has been thrown into panic mode after a 13-year-old boy poured a poisonous herbicide into a river, which supplies water to livestock and to people from at least five villages on Monday.\n\nThe name of the herbicide is still being verified by experts.According to Mutetengwas senior village head, Mr Nelson Mohadi, the fish in the stream have started dying and a donkey that drank water from the same river died on the same day.\n\nHe said through the local disaster risk management committee they had since notified people staying downstream of the river not to use water from the river or to ensure their livestock use another water source.\n\nMr Mohadi said the local civil protection committee was already on the ground carrying out tests of the water between the point where the herbicide was poured into the river, and at selected water points down the river.The community is in panic mode following this incident and we have since notified the police and the local civil protection committee about the incident, he said.In the interim, we advise villagers not to drink or use the water for domestic chores until tests from the civil protection committee confirm the extent of the damage.A village head from Tshambudzi area, Mrs Siphiwe Muleya, where the boy lives said they were working with the police to establish the motive behind the incident.She said she has advised all community members in the area to make use of the borehole water and to avoid fishing from the river.\n\nMrs Muleya said since Monday, fish were still dying from the river and that a donkey had started decomposing after drinking suspected contaminated water.We picked up the container of the herbicide, which we have given to agriculture experts to verify and will also help in investigations, she said.The police are now handling the matter and the parents of the same boy have since been notified about this shocking incident.Mutetengwa Village Health worker, Mrs Lucy Chibi, said working with health experts they are already educating those living along the river to be extra vigilant.She said the dead fish from the river had been buried in the soil and that some people were already on the lookout for the fish to destroy them before some children may pick them since the river is located near a school and the local business centre.We are already moving around villages warning people about the imminent danger from the herbicide that was poured into the river. At the same time, I want to strongly encourage community members to avoid drinking water or fishing from this river until it has been confirmed to be safe by technocrats, said Mrs Chibi.A communal farmer living in the La Tenis area, Mrs Nyelisani Sibanda, said she was shocked to see purple water flowing in the river on Monday.I was working in my field, which is just close to the river and when I came here to get water it had turned into a purple colour, said Mrs Sibanda.A few minutes later some fish were dying on their own. I immediately called the local traditional leaders who then informed the rest of the community leaders about this incident. They then raised the alarm that we must not drink or fetch water from the same river.We chased away some livestock that were drinking water from this point, unfortunately one donkey died near our business centre.Police officer commanding Beitbridge District, Chief Superintendent Melusi Ncube, said the matter was now under investigation.We have sent our team on the ground, which is working with the civil protection committee members and we will share more information after getting feedback from them, he said.The issue comes a few months following the poisoning of fish ponds at Tshabili Secondary School in Beitbridge East leading to the death of thousands of fish that were part of the schools income generating projects.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/thrn.jpg",
            "description": "  Thupeyo Muleya,Beitbridge Bureau THE COMMUNITY in Ward 7 in the Mutetengwa area in Beitbridge has been thrown into panic mode after a 13-year-old boy poured a poisonous herbicide into a river, which supplies water to livestock and to people from at least five villages on Monday. The name of the herbicide is still being […]",
            "time": "20:26",
            "date": "06 Mar 2025"
        }
    ]
}