{
    "news": [
        {
            "title": "Empowering youths . . . President calls for full support",
            "url": "https://www.chronicle.co.zw/empowering-youths-president-calls-for-full-support/",
            "content": "Zvamaida Murwira, Harare BureauPRESIDENT Mnangagwa has directed Government Ministries, Departments, and Agencies to ensure that entrepreneurship initiatives spearheaded by youths are fully supported so they form part of mainstream businesses and economic development in the country. This is part of the Governments youth empowerment programme, which is the bedrock of the Second Republic.\n\nThe Head of State and Government said this last Friday in Bulawayo while delivering his keynote address at the National Youth Day commemorations. The celebrations were held under the theme, Empower Youths, Secure the Future.\n\nCommenting on the Zimbabwe Digital Skills Development Programme that he launched on the same day, President Mnangagwa said the programme will enhance digital literacy and skills among Zimbabweans and empower young people to contribute to the economy through entrepreneurship.\n\nI commend our youth for their entrepreneurial culture across various sectors of the economy. Ministries, Departments, and Agencies are directed to develop programmes which ensure that our youth enterprises graduate into large businesses. Meanwhile, I call upon the private sector, the youth, Empower Bank, and other development partners to develop and promote business linkages, said the President.\n\nEmpower Bank\n\nPresident Mnangagwa commended the consultative process for strengthening youth empowerment and skills development strategies.\n\nI challenge you to take up more initiatives to continually beautify the communities you live in.\n\nMeanwhile, the comprehensive and precise presentations from the youth, particularly on the support you require from Government and our ruling party, Zanu-PF, will continue to receive appropriate consideration.\n\nTo this end, the Ministry of Youth Empowerment, Development and Vocational Training must speed up the finalisation of the National Youth Act, which is a critical legislative tool for administering youth empowerment and skills development programmes.\n\nThe implementation of robust and complementary strategies to support and empower the youth must be scaled up. A nation which empowers and invests in the youth is guaranteed a prosperous future, said the President.\n\nHe urged young people to emulate yesteryear youths for their patriotism, coupled with courage that saw them taking up arms to fight for the liberation of the country.\n\nWe also have a chance to chart and refine the journey we are taking for a brighter future, particularly the role of you, our young people.\n\nIn undertaking this critical task, remain emboldened by the virtues of courage, selfless sacrifice, and bravery which were defining among the youths of yesteryear. They took up arms against the oppressive colonial regime and brought us independence, sovereignty, territorial integrity, freedom, and democracy.\n\nThese historical milestones, including our rich liberation war heritage, are indispensable and must be safeguarded as well as passed down from one generation to the next, said President Mnangagwa.\n\nThousands of young people from across the country and representatives of youths from other countries such as Burundi, Mozambique, and South Africa, among other nations, attended the National Youth Day celebrations held at the Zimbabwe International Exhibition Centre.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/thgrhf.jpg",
            "description": "Zvamaida Murwira, Harare Bureau PRESIDENT Mnangagwa has directed Government Ministries, Departments, and Agencies to ensure that entrepreneurship initiatives spearheaded by youths are fully supported so they form part of mainstream businesses and economic development in the country. This is part of the Government’s youth empowerment programme, which is the bedrock of the Second Republic. The […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "UBH baby swap investigation: Findings to be made public",
            "url": "https://www.chronicle.co.zw/ubh-baby-swap-investigation-findings-to-be-made-public/",
            "content": "Sikhumbuzo Moyo,[emailprotected]THE investigation into the distressing case of the baby swap at United Bulawayo Hospitals (UBH) is still underway, with the Government promising full transparency and publication of its findings.\n\nThe incident, which caused considerable upset and concern, prompted the Ministry of Health and Child Care to do a thorough review of procedures at the hospital, and the public awaits the outcome of the investigation with keen interest.\n\nDeputy Minister of Health and Child Care, Sleiman Kwidini, speaking after a tour of UBH last Thursday, said the ministry is still dealing with the matter and will leave no stone unturned.\n\nUnited Bulawayo Hospitals (UBH)\n\nHe acknowledged that while the families involved have been reunited, the incident is unacceptable and must never happen again.\n\nThat matter is still under investigation, but I can assure the nation that the findings will be made public. If charges are to be brought against anyone found guilty, they will be. And if it is proven that it was simply a mistake without ill intent, the public will also be informed. It must be clear that this matter will not be swept under the carpet, Deputy Minister Kwidini said.\n\nDeputy Minister Kwidini did not confirm whether the nurse involved is still working or has been suspended during the investigation.\n\nHowever, a source revealed that hospital authorities initially downplayed the incident until it was reported by Chronicle.\n\nThis was a closed chapter until you guys started making noise about it. This is why even the Provincial Medical Director (PMD) was not aware of the incident. How can such a matter not be reported to the authorities? If you keep a close eye on what happens at the hospital, you will be shocked, the source said.\n\nA post-partum mother who had given birth to a baby boy received a shock late last year when a nurse handed her a baby girl.\n\nThe young woman resorted to DNA testing at a private laboratory in the city centre and the National University of Science and Technology (Nust) to prove her concerns that the baby girl was not hers. The nurse on duty had told her that her child was a girl, suggesting that the anaesthesia from her Caesarean section may have caused confusion.\n\nThey allegedly reassured her that the anaesthesia had caused her confusion. Frustrated but determined, the mother contacted her family for support.\n\nShe recalled that about 15 minutes before she went into theatre, another woman was also in the ward, due to undergo the same procedure. However, that woman had been discharged and had gone home to Esigodini, Matabeleland South province.\n\nHer family supported her, especially as scan results from the previous day had shown that her unborn baby was a boy. Undeterred, the woman visited Global DNA lab at Bulawayo Centre, and the results confirmed that the baby girl she was given was not hers.\n\nFurious, the family returned to the hospital, demanding answers and the return of their biological son. Hospital staff were forced to locate the other mother, and a hospital vehicle was dispatched to retrieve her.\n\nHowever, the womans husband refused to co-operate, insisting that the child was his. The police were then called in, and the couple was brought to Bulawayo.\n\nAt the insistence of the aggrieved family, the hospital engaged Nust for DNA testing. The results unequivocally confirmed that the babies had been exchanged.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/sfd.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE investigation into the distressing case of the baby swap at United Bulawayo Hospitals (UBH) is still underway, with the Government promising full transparency and publication of its findings. The incident, which caused considerable upset and concern, prompted the Ministry of Health and Child Care to do a thorough review of procedures […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Zifa calls for action",
            "url": "https://www.chronicle.co.zw/zifa-calls-for-action/",
            "content": "Lovemore Dube,[emailprotected]\n\nLEGACY in Motion: Driving Excellence Forward\n\nThat is the driving theme by the newly elected Zifa executive led by Nqobile Magwizi.\n\nMagwizi has challenged the football family to engage in action and put to an end rhetoric and toxicity in the local game.\n\nThis was in his speech read on his behalf by executive member Thomas Marambanyika at the Zifa Southern Region Awards held in the city on Saturday.\n\nMarambanyika represented the Zifa president. Like Magwizi, Marambanyika a former Midlands and Central Region councillor was also voted into office on January 25.\n\nMagwizi said; Today, we assemble not merely to celebrate individual brilliance but to ignite a collective resolve. As we honour excellence from the 2024 season, let this ceremony mark the end of rhetoric and the beginning of action. The elections are over. The politicking is done. It is time  high time  we focus solely on one thing: WORK. Let me be unequivocal: we are not politicians; we are custodians of football. Politicians campaign perpetually  we deliver perpetually.\n\nMagwizi challenged selflessness among football stakeholders, urging them to shun -isms a cancer in sporting circles that has derailed some organisations. He spoke of his executives commitment to restoring pride in the Zimbabwean game after years of self-battering.\n\nTo those who seek to divide us with regionalism, personal agendas, or old grievances, hear this: the New Executive Committee (Exco) will go to the moon and back, dive to the deepest depths of the ocean, and break every barrier to restore the pride of Zimbabwean football, read the speech.\n\nUnity he said is key to operations.\n\nBut we cannot do this alone. Unity of purpose  oneness, teamwork, collaboration  is not a suggestion. It is non-negotiable. Look around this room. Administrators, legends, referees, players  we are threads in the same tapestry. If one thread frays, the fabric weakens. But together, we are unbreakable.\n\nHe said Zifa was committed to equity hence they had come up with sub-committees that had taken into consideration the games ecosystem and geography and competency.\n\nThe committees we have appointed reflect every region of this nation. No voice will be silenced; no talent will be sidelined. But inclusion is meaningless without integrity. That is why, for the first time in our history, a female referee chairs the Referees Committee.\n\nHe said female referees had been exploited in the game to the extent of some asking for sexual favours from them.\n\nThe speech also touched on manipulation.\n\nZimbabwe has had the Asiagate and Centralgate scandals where results were manipulated with teams and officials getting paid for a desired result.\n\nUnder the new committee, backed by monitoring and evaluation teams, there will be zero tolerance for manipulation. Every decision will be transparent. Every appointment will be merit-based.\n\nWe will restore professionalism, accountability, and above all, dignity to this sacred role. To those who fear this change: adapt or exit. Football has no room for predators.\n\nHe described committee members as engines of a transformation process.\n\nIn his speech he said meetings will not be tea-drinking ceremonies but battle rooms for strategising and execution.\n\nHe emphasised that programmes will be tracked and results will be demanded.\n\nFeedback will be relentless. We are in transformative mode  a revolution that demands your sweat, your creativity, and your unwavering commitment.\n\nA Fifa delegation arrives this week to induct the new executive. What they will learn as the executive committee he promised that it would cascade down the games leadership ladder.\n\nCouncillors should brace for a tough meeting on March 28 at the organisations annual general meeting where hard truths will be confronted and resolutions to shape the future be made.\n\nHarmony Nare who was the ZPC Hwange shot-stopper last season before joining Caps United at the beginning of this year, was crowned Soccer Star of the Year.\n\nHe was voted alongside Mbongeni Minezhi (Bulawayo City (1st runner-up), Wilfred Nzondo from Casmyn (Second runner-up), Nhlanhla Fumpano (Nkayi Utd), Hopewell Moyo (Zimbabwe Saints), Thabo Sibanda (Mainline FC), Tatenda Ushe from Casmyn, Tinotenda Chitete from Nkayi Utd, Justin Kaunda from ZPC Hwange, Trevor Mugwagwa from Zebra Revolution and Israel Mkahanana (ZPC Hwange).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dfsfe.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw “LEGACY in Motion: Driving Excellence Forward” That is the driving theme by the newly elected Zifa executive led by Nqobile Magwizi. Magwizi has challenged the football family to engage in action and put to an end rhetoric and toxicity in the local game. This was in his speech read on his behalf by […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Government begins formalising the informal sector",
            "url": "https://www.chronicle.co.zw/government-begins-formalising-the-informal-sector/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nTHE Government has launched a programme to register all informal sector traders, creating a database to facilitate their compliance with the countrys laws and ensure they receive adequate support to grow their businesses.\n\nThe initiative comes as the Government intensifies efforts to formalise the informal sector while tackling the influx of cheap imported goods, which negatively impacts the economy.\n\nDuring a parliamentary debate last week, legislators commended the Treasury, the Ministry of Industry and Commerce, the Zimbabwe Revenue Authority (Zimra), and other stakeholders for their firm stance against smuggling, saying it poses a major threat to economic stability.\n\nZimbabwe Revenue Authority (Zimra)\n\nLegislators noted that business owners are concerned that, while the revenue administrator is enhancing compliance, some shops, particularly SMEs, are closing.\n\nWomen Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, emphasised the importance of compliance.\n\nWhen we talk about compliance, we are aware that several companies are already complying and meeting their statutory requirements, but what we are calling for with vendors is registration. As a ministry, we are registering all vendors and traders so that they can become compliant.\n\nAs a Government, we are working to ensure this happens by providing workspace for our SMEs, providing digital money so that money circulates within the banks, and providing POS machines so that most people can make purchases using cards. It is about providing services so that SMEs can comply, she said.\n\nMinister Mutsvangwa said SMEs are ready to comply as they are well organised, but the issue of enforcement needs to be fine-tuned, as the Government needs the tax revenue, which plays a vital role in developing the country.\n\nSince the last festive season, Zimra has conducted a nationwide blitz targeting smuggled goods sold in shops and businesses.\n\nIn Bulawayo, the blitz resulted in numerous traders operating at Haddon and Sly Building and Amaya Mall in the city centre being locked out as Zimra closed the premises as part of the operation.\n\nThe blitz is part of a broader multi-agency initiative aimed at curbing smuggling and unethical business practices, protecting local industries, and ensuring consumer welfare.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/FDF.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com THE Government has launched a programme to register all informal sector traders, creating a database to facilitate their compliance with the country’s laws and ensure they receive adequate support to grow their businesses. The initiative comes as the Government intensifies efforts to formalise the informal sector while tackling the influx of cheap […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "COMMENT: Schools must implement what they lobbied for regarding school-based projects",
            "url": "https://www.chronicle.co.zw/comment-schools-must-implement-what-they-lobbied-for-regarding-school-based-projects/",
            "content": "For all its positives, the continuous assessment learning activities (Calas), was an immense challenge to learners, educators and pupils.\n\nKids had to do multiple standardised projects and researches, sometimes all at the same time.This meant a lot of work for them; they spent more of their time doing the projects and less on other subjects.\n\nIt, too, was difficult, especially, for resource-poor kids and parents who did not have a reliable internet connection to do the Calas. In many cases in urban areas, parents ended up doing the assignments for their day-school children, which meant that the projects ended up not improving learners capabilities.\n\nCalas actually amplified the divide between the rich and the poor, the urban learner and the rural learner.Elitism.\n\nTeachers complained bitterly, as did parents.\n\nAfter some consultations, the Government did the needful when scrapping Calas. The last classes to be examined using this model are writing their public tests in June. The Government directed that Calas be replaced by school-based projects with effect from last month.\n\nThe new system is set to be more impactful and relevant to the different school settings and resource profile of parents and their children. We dont foresee any serious teacher asking his or her class to do projects that he or she knows kids would be unable to do for lack of a reliable internet connection and so on.\n\nThe school-based projects are intended to be more practical, relevant, and aligned with the competencies we want our learners to develop. They provide a holistic approach to assessment, allowing students to apply their knowledge in real-world contexts, our sister paper, Sunday News cited Mr Taungana Ndoro, the Communication and Advocacy Director in the Ministry of Primary and Secondary Education as saying yesterday.\n\nHe, however, expressed concern over the slow switch by schools from Calas to school-based projects.\n\nThe new thrust focuses on practical applications, with the number of areas covered by the non-examination process reduced from about eight per subject to one.\n\nPrimary school learners will now engage with a maximum of six learning areas, down from a minimum of 27, while learners in Form One to Four will have five compulsory learning areas.\n\nAt early childhood development level to Grade Two, learning areas have been reduced from 11 to six, with similar reductions applying at the junior level for Grades Three to Seven.\n\nAt secondary school level, compulsory core learning areas are being reduced from seven to five, with an inclusive and integrated approach catering for learners with special needs, including the provision of assistive devices.\n\nSchools asked authorities to rethink Calas; authorities obliged, thus we urge schools to implement what they lobbied for by immediately making the switch to school-based projects.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Mr-Taungana-Ndoro.jpg",
            "description": "For all its positives, the continuous assessment learning activities (Calas), was an immense challenge to learners, educators and pupils. Kids had to do multiple standardised projects and researches, sometimes all at the same time.  This meant a lot of work for them; they spent more of their time doing the projects and less on other […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Cocoa’s rise continues with another Nama nod",
            "url": "https://www.chronicle.co.zw/cocoas-rise-continues-with-another-nama-nod/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nBulawayo-born dancer Cocoa (Ellain Ncube) is celebrating her second consecutive nomination at the National Arts Merit Awards (Nama), cementing her transition from modelling to dance.\n\nNow based in Harare, Cocoa has once again been nominated in the Outstanding Female Dancer category for her performance in Black Fever, a dance choreography. She will be competing against Tanaka Machikicho (Into the Light) and Celine Madziva (Respect My Team) for the award.\n\nA well-established name in the dance industry, Cocoa has showcased her talent at numerous high-profile events. She was the lead dancer at the 2023 Namas, performing alongside Ishan, and has also graced the stage at the Zimbabwe Music Awards. Additionally, she has performed with some of Zimbabwes top artistes, including Ammara Brown, ExQ, Juntal, Freeman, Volts, Leo, and Asaph.\n\nAmmara Brown\n\nExpressing her gratitude, Cocoa credited her success to divine intervention.\n\nIm humbled by the grace of God in my life. He planted a seed in me, and through unwavering faith, discipline, and consistency, I have nurtured it. Jesus Christ is faithful to His promise  glory be to God.\n\nShe shared the importance of perseverance in her journey.\n\nConsistency is key. I believe in myself, and God sees my efforts, growth, and desire to be an example of how hard work pays off. My mantra is to stay disciplined, kind, and trust in Gods timing.\n\nShould she claim the award after missing out last year, Cocoa remains steadfast in her faith.\n\nMy response would be  Jesus is in control of my life, and thats my biggest flex.\n\nA Zimbabwe Theatre Academy and Afrikera Arts Trust alumna, Cocoa has worked tirelessly to build her career.\n\nI have worked very hard to get to where I am today, and I want everyone following my journey to know that hard work pays. Trust the process and always be willing to go the extra mile for your goals. Its never an easy journey, but trust in yourself, she said.\n\nCocoas passion for the arts began in high school, where she was part of the Nketa High School choir. Her acting career saw her win several awards, including Outstanding Supporting Female Actress for her role in Isiphiwo Sami and Outstanding Supporting Actress at the NASH Drama Competition in 2018. This earned her a scholarship at the Zimbabwe Theatre Academy, where she performed at the Bulawayo Arts Festival and starred as the lead actress in the Econet @25 celebrations advert. In 2021, she received a dance scholarship at Afrikera Arts Trust, an opportunity that reshaped her artistic path.\n\nI truly never thought Id become a dancer, but Afrikera gave me the platform to explore that side of me. Through Afrikera, I performed at the ZICCA Festival (2022) and the Starlight Festival. The academy has indeed opened many doors for me.\n\nA graduate of Fingers Modelling Academy, she was crowned Miss Summer Strides First Princess (2020) and Miss Supra-eminence Second Princess (2022).  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gfvb.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Bulawayo-born dancer Cocoa (Ellain Ncube) is celebrating her second consecutive nomination at the National Arts Merit Awards (Nama), cementing her transition from modelling to dance. Now based in Harare, Cocoa has once again been nominated in the Outstanding Female Dancer category for her performance in Black Fever, a dance choreography. She will be […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "New school, no teachers, no lessons for Masuwe’s 33 students",
            "url": "https://www.chronicle.co.zw/new-school-no-teachers-no-lessons-for-masuwes-33-students/",
            "content": "Leonorah Ncube in Victoria FallsMASUWE Secondary School, a new build from last year, thanks to a local hospitality group, was supposed to transform the lives of its students. The goal was simple  shorten punishing commutes, reduce absenteeism and dropouts, and shield children from the dangers of human-wildlife conflict. Yet, halfway through its first term, a stark reality has emerged  all 33 enrolled pupils are still waiting for their first lesson. The school, it seems, cant find any teachers.\n\nMasuwe Secondary School is located in the Masuwe Resettlement area outside Victoria Falls and comprises a single block built by the owners of the Stanley and Livingstone Hotel, adjacent to Masuwe Primary School.\n\nIt was intended to serve secondary school learners from Masuwe and Sikabela. Matetsi Secondary School is the only secondary school in the Hwange Ward 1 area, covering all resettlement areas: Breakfast, Lubangwe, Railway Farm, Masuwe, Matetsi, and Sikabela.\n\nThe majority of children from these resettlement areas attend Matetsi Secondary, where they stay in makeshift boarding facilities, while some go to Ndlovu Secondary, which also has a small boarding facility.\n\nJabulani and Sizinda secondary schools are also distant, and walking or cycling there is impossible due to the presence of wild animals.\\\n\nMasuwe Secondary School\n\nBecause of the distance and the danger posed by wild animals, no one walks to these secondary schools from the resettlements. As a result, those who cannot afford boarding fees or have no relatives to move in within Victoria Falls have dropped out of school, contributing to early marriages and teenage pregnancies.\n\nThe opening of Masuwe Secondary was meant to bring education to the doorstep of these children, but this dream is fading fast.\n\nChronicle has learned that the school has enrolled 25 Form One and eight Form Two learners, a total of 33. The community has been told that a school needs a minimum of 80 learners to be allocated five teachers, the minimum requirement for a learning institution according to Ministry of Primary and Secondary Education standards.\n\nA shortage of teachers in the Hwange District is also compounding the situation. The 33 learners have been advised to enrol elsewhere pending the formalisation of the school.\n\nCommunity leaders recently visited ministry offices to express their concerns and seek guidance.\n\nThey pleaded with the Government to allow the school to open and avoid denying children their right to education.\n\nWoodlands headman, Mr Josphat Sipulila Mpofu, appealed to the authorities to consider the communitys unique circumstances and population, which makes it difficult to reach the required 80 children.\n\nSecondary schools are too far, and fees are beyond the reach of many, hence we need a local school here. Many children drop out of school after completing Grade Seven, and this contributes to the high number of uneducated young people and drug abuse, Mr Mpofu said.\n\nWard 1 Councillor Vulindlela Mhlanga said efforts were being made to open the school.\n\nThere is a lot of work to be done in collaboration with the Ministry and Hwange Rural District Council to facilitate the annexation process and the deployment of teachers through the mother school.\n\nEngagements have taken place, and it was decided that opening the school this term is not possible. Efforts will be made to open it next term. For now, parents can temporarily enrol their children in the nearest schools while keeping their registration at Masuwe Secondary, awaiting its opening. It is our hope that Masuwe Secondary School will open soon; we will make it happen, he said.\n\nClr Mhlanga said the ward has five primary schools and one secondary school.\n\nHe added that the opening of new schools is one of the projects he is pursuing, in line with the Governments vision of access to education for all.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/xzcfvdfv.jpg",
            "description": "Leonorah Ncube in Victoria Falls MASUWE Secondary School, a new build from last year, thanks to a local hospitality group, was supposed to transform the lives of its students. The goal was simple — shorten punishing commutes, reduce absenteeism and dropouts, and shield children from the dangers of human-wildlife conflict. Yet, halfway through its first […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Government, private sector efforts combat food insecurity",
            "url": "https://www.chronicle.co.zw/government-private-sector-efforts-combat-food-insecurity/",
            "content": "Precious Manomano, Harare BureauThe joint effort by the Government and private sector to ensure that Zimbabweans had enough food despite the crippling El Nino-induced drought last year has been a major success with no food shortages seen nor any market rigging.\n\nWhen it became obvious early last year that the maize harvest would be well below what was needed after the rains failed, the Government moved swiftly to ensure that there would be adequate supplies for its own major food relief programme and that there would be enough mealie-meal for all urban and commercial requirements.\n\nThe maize reserves held by the Grain Marketing Board from previous good seasons plus the modest commercial deliveries expected last year were committed to the Government programmes. The private sector, the millers, were told they would have to import all their requirements until this years harvest was being delivered to the GMB.\n\nSo between April last year and February 2 this year, the private sector has imported 1 349 877 tonnes of grain, including 1 127 411 tonnes of maize, 220 092 tonnes of wheat and 374 tonnes of wheat flour, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere announced after last Tuesdays Cabinet meeting.\n\nAnd there are still adequate stocks of maize with the GMB, he said, to supply the ongoing Government programmes for rural families that will continue until the new harvest starts being reaped in April, a harvest that is expected to be good considering the good rains, of late, that Zimbabwe is now enjoying.\n\nThe major Government programme ensured that all rural families who were going to be short of food had regular rations of grain, and the urban vulnerable received modest payments that allowed them to buy mealie-meal.\n\nWhile the private sector was responsible for the imports, the Government did not ration licences and was actively monitoring the import volumes, stock levels at mills and market prices to prevent any potential arbitrage opportunities that could arise from sudden price fluctuations. These did not happen.\n\nThe goal was to maintain a steady supply of grain, preventing any shortages. While almost all mealie-meal in Zimbabwe for some months has come from imported grain, there are no shortages in the shops and all brands are available for sale in the competitive market as the private millers did their share of the joint programme.\n\nMajor efforts were made before the present season to make sure all farmers had adequate inputs in light of the forecast reasonable rains so summer harvests could be boosted from 744 000 tonnes in the previous season to an ambitious target of 3,2 million tonnes this year.\n\nPreliminary data indicates that about 99 percent of the targeted maize area has been planted, raising hopes for a bountiful harvest.\n\nIn a recent interview, Lands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri underscored the importance of collaboration between the Government and private sector in tackling food insecurity.\n\nLands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri\n\nImpactful partnerships are critical in boosting food security in our country. The involvement of private players has been instrumental in complementing Government efforts to avert hunger, he said.\n\nGrain Millers Association of Zimbabwe national chairperson, Mr Tafadzwa Musarara said that imports had to be done carefully to ensure that there was enough food.\n\nBanks have been careful in loans for imports to ensure that supplies were adequate without the risk of oversupply through imports.\n\nHarsh trading terms from source markets in South Africa made importing more complex.\n\nDespite the hurdles, Mr Musarara remains optimistic about the private sectors ability to support Government efforts in combating hunger.\n\nWe are ready to continue supporting the Government to end hunger among our citizens, he said.\n\nIn response to the ongoing food challenges, the Government has implemented several strategies aimed at mitigating hunger and improving food security.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/xczfescx.jpg",
            "description": "Precious Manomano, Harare Bureau The joint effort by the Government and private sector to ensure that Zimbabweans had enough food despite the crippling El Nino-induced drought last year has been a major success with no food shortages seen nor any market rigging. When it became obvious early last year that the maize harvest would be […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Assembly elections in doubt",
            "url": "https://www.chronicle.co.zw/assembly-elections-in-doubt/",
            "content": "Lovemore Dube,[emailprotected]\n\nELECTIONS to bring in a new Zifa Assembly following the election of a new executive do not seem to be something on the horizon.\n\nThe Zifa board headed by advertising and marketing guru Nqobile Magwizi on January 25 appointed councillors who took part to key positions in sub-committees. This puts a damper on the prospect of elections being held.\n\nIn a surprise move they have also come up with adhoc committees.\n\nAdhoc committees are often put in place as and when need arises.\n\nZifa had been without a substantive board since April 2023 when members of the Felton Kamambo executive were fired by the Zifa Assembly. Vice-president of the association Gift Banda who had been suspended by the Kamambo executive then took over until July 11 of 2023 when Fifa stepped in and appointed Lincoln Mutasa as chairman of the Normalisation Committee.\n\nHe led a committee that had Nyasha Samanyandwe a young Harare-based lawyer, former Mighty Warriors player and coach Rosemary Mugadza, Sikhumbuzo Ndebele a former footballer and Fifa administration graduate and accountant Cynthia Malaba.\n\nThe Zifa Assembly members term of office expired in 2022 after four years having been voted in 2018.\n\nFifa keen to bring an end to their micro-management of Zimbabwe football, resolved to give the councillors a shelf life to vote the board in.\n\nConstitutionally, the councillors are out of term and Magwizi and team have a tough call on their lap.\n\nNqobile Magwizi\n\nFacilitate the football family choosing their new councillors or retaining the performers or keep the whole bunch that voted them into office.\n\nWorking with a new group of councillors may present a problem for the board as they would not have been voted by the new brooms.\n\nThe old ones demands may be a challenge. They may push for more beyond sub-committees appointments knowing they hold sway in numbers.\n\nZifa executive member Thomas Marambanyika who was in Bulawayo on Saturday for the Zifa Southern Region Awards, disclosed that the Zifa executive and councillors will meet on March 25.\n\nIf the matter of a new Assembly is brought up for debate it is unlikely that councillors will vote to seek a fresh mandate from their constituencies as they are deemed a low unto themselves.\n\nThere is a feeling that some councillors have overstayed in some constituencies and are adding no value at all to the game.\n\nContacted for comment the Zifa media office, promised to attend to the matter on Thursday. At the time of going to print they had not returned the favour.\n\nThe election of Magwizi with Kennedy Ndebele and Loveness Mukura as his deputies has given hope to a country whose football has been embroiled in turmoil since 2003 when Leo Mugabe left.\n\nBans and suspensions have been the order of the day at the expense of competent and merit-based leadership.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/ZIFA-2.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw ELECTIONS to bring in a new Zifa Assembly following the election of a new executive do not seem to be something on the horizon. The Zifa board headed by advertising and marketing guru Nqobile Magwizi on January 25 appointed councillors who took part to key positions in sub-committees. This puts a damper on […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "President to break ground on US$3,6bn Energy Park",
            "url": "https://www.chronicle.co.zw/president-to-break-ground-on-us36bn-energy-park/",
            "content": "Thupeyo Muleya, Beitbridge BureauPRESIDENT Mnangagwa is expected to visit Beitbridge today for the ground-breaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone, a US$3,6 billion energy industrial park being developed in collaboration with a Chinese mining company.\n\nThe project, located 20km west of Beitbridge town, aims to introduce the production of stainless steel. The energy and steelworks initiative has already employed 400 local workers in its first year, with the expectation that it will ultimately employ over 2000 people once it becomes fully operational.\n\nThe US$3,6bn Palm River Energy industrial Park shaping up some 20km west of Beitbridge Town\n\nThe establishment of the park as an integrated mining and energy hub follows discussions between the chairman of Palm River Energy, Mr Xong Xi Dong, and President Mnangagwa.\n\nThe project will cover 5100 hectares within a special economic zone (SEZ) and is expected to make substantial contributions to Zimbabwes mining and energy sectors.\n\nThe first phase of the project is being carried out through a joint venture between the Government, Xintai Resources, and Tuli Coal.\n\nThe park comprises a coking plant with an annual capacity of producing one million tonnes of coke, a ferro-chrome smelting plant that will produce 100000 tonnes of high-carbon ferro-chrome, and a 1200MW coal-fired thermal power plant.\n\nThe US$3,6bn Palm River Energy industrial Park shaping up some 20km west of Beitbridge Town\n\nAny surplus electricity will be transmitted to the national grid, while the ferro-chrome plant will facilitate the production of special and stainless steel and castings.\n\nCoal supply to the project will be obtained from Tuli Coal Mine and, in line with plans to export coal products to international markets, will yield significant foreign currency earnings.\n\nThe mining sectors role in Zimbabwes economy cannot be overemphasised, representing over 60 percent of the countrys export receipts and attracting more than 50 percent of foreign direct investment (FDI). It also contributes 13 percent to the national GDP, creating more business opportunities downstream, and generating tax revenue for the Government.\n\nThe US$3,6bn Palm River Energy industrial Park shaping up some 20km west of Beitbridge Town\n\nMinistry of Mines and Mining Developments Deputy Director of Communications Advocacy and Mining Community Sustainability, Mr Wilfred Mabiza Munetsi, said the stage has been set for the Head of States visit to Beitbridge.\n\nWe have covered a lot of ground in terms of planning and we are ready for the ground-breaking of the project by President Mnangagwa. The project covers an area of 5163 hectares and is planned to be constructed in five phases, with a total construction period of 12 years. The construction period of the first phase of the project is 2 years, with a total investment of $237 million, mainly used for the construction of an annual output of 200,000 tonnes of ferrochrome and supporting coal mines, coking, infrastructure and other projects.\n\nThe US$3,6bn Palm River Energy industrial Park shaping up some 20km west of Beitbridge Town\n\nIn order to meet the raw materials required for production in the park, resource guarantee bases have been established in Tuli and Wanji respectively.\n\nHe said upon completion of the Palm River Energy and Metallurgical Special Economic Zone, the project will become the worlds lowest comprehensive cost and the most competitive energy and metallurgical special economic zone of the whole industry chain.\n\nAmong other things, the project realises the recycling of energy, photovoltaic green power, coke oven, submerged heat furnace tail gas power generation, chromium iron water, liquid chromium slag, dust removal flue gas waste heat power generation, and the generated energy is reused for industrial projects in the park.\n\nThe US$3,6bn Palm River Energy industrial Park shaping up some 20km west of Beitbridge Town\n\nMr Munetsi said besides creating thousands of jobs, the project will also provide technical training to Zimbabwean employees, improve their professional ability, and realise the integration of teaching and practice of technology transfer and ability improvement.\n\nIn 2018, President Mnangagwa declared Beitbridge town a SEZ as part of the Second Republics drive to attract more investment under the Zimbabwe is open for business policy. The Governments adoption of the SEZ model aims to enhance FDI and improve local business viability, leading to increased employment and economic growth in targeted areas.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fzdgzxvcvxz.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau PRESIDENT Mnangagwa is expected to visit Beitbridge today for the ground-breaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone, a US$3,6 billion energy industrial park being developed in collaboration with a Chinese mining company. The project, located 20km west of Beitbridge town, aims to introduce the production of […]",
            "time": "08:41",
            "date": "24 Feb 2025"
        }
    ]
}