{
    "news": [
        {
            "title": "Zimdancehall Icon Killer Tee Strikes Gold with Smash Hit “Kana Ndanyura”",
            "url": "https://www.chronicle.co.zw/zimdancehall-icon-killer-tee-strikes-gold-with-smash-hit-kana-ndanyura/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nAs 2024 draws to a close, the music scene is buzzing with excitement as contenders for the coveted Song of the Year award emerge. One name dominating the airwaves and dance floors is Zimdancehall pioneer Killer Tee.\n\nWith a career spanning over two decades, Killer Tee has played a pivotal role in shaping Zimdancehall. His latest hit single, Kana Ndanyura, has cemented his status as a leading light in the genre.\n\nThe songs infectious beat and heartfelt lyrics, which speak to unconditional love and devotion, have resonated with fans across the country. From spiritual gatherings to fun-loving parties, Kana Ndanyura has become an anthem.\n\nKiller Tees recent performance at Phoenix Tshisanyama in Gwanda on Saturday was a testament to his enduring power. The crowd went wild as he performed his hit single, singing along and dancing in the aisles. The energy was electric, with fans of all ages begging for more.\n\nFor over two hours, Killer Tee held the audience captivated, his live band delivering a rhythmic and energetic performance. It was clear that Kana Ndanyura has become an anthem for Killer Tees loyal fans, and its impact on the live show was undeniable.\n\nIt remains to be seen if he will smile all the way into the new year with accolades in hand.\n\nFollow Mthabisi Tshuma on X  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hetju.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com As 2024 draws to a close, the music scene is buzzing with excitement as contenders for the coveted Song of the Year award emerge. One name dominating the airwaves and dance floors is Zimdancehall pioneer Killer Tee. With a career spanning over two decades, Killer Tee has played a pivotal role in […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "Chevrons break records with historic Boxing Day Test performance",
            "url": "https://www.chronicle.co.zw/chevrons-break-records-with-historic-boxing-day-test-performance/",
            "content": "Brandon Moyo,[emailprotected]\n\nLED by three centurions, Zimbabwe broke records on day two of the historic Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo.\n\nThe Chevrons began day two on 363/4 and ended their innings on a mammoth 586 runs from 135.2 overs.\n\nThe 586 runs scored over the five sessions of batting became their highest ever total in Test cricket, surpassing the previous best of 563/9 (declared) against the West Indies in Harare in 2001.\n\nFor the first time in Test history, Zimbabwe had three players score centuries in the same innings.\n\nSean Williams, captain Craig Ervine, and young Brian Bennett were the key contributors, leading Zimbabwe to their highest total in red-ball cricket.\n\nWilliams resumed day two on 145 runs, while Ervine was on 56.\n\nThe hometown hero, Williams, went on to score a career-best 154 runs from 174 balls.\n\nFollowing his departure, Bennett came in to bat at number seven.\n\nErvine reached his fourth Test century in the 109th over, taking 167 balls to bring up three figures.\n\nIt was his first century in four years, his last being 107 runs against Bangladesh in Mirpur in 2020.\n\nThe captain fell soon after his milestone, falling for 104 runs off 176 balls.\n\nTwo balls later, Brandon Mavuta was bowled for a duck, leaving Zimbabwe on 465/7 in 110.3 overs.\n\nAt that point, Bennett was on 42 runs, closing in on his maiden Test half-century.\n\nHe was joined by debutant Newman Nyamhuri, who chipped in with 26 runs off 38 balls.\n\nBennett soon found himself running out of partners as tailenders fell at the other end.\n\nWhen Muzarabani walked back to the pavilion, Bennett was on 78, and he managed to hold on, with another debutant, Trevor Gwandu, batting at number 11.\n\nZimbabwe passed their highest Test score in the 134th over, when they reached 566/9, with Bennett needing four more runs to bring up his century.\n\nHe achieved the milestone with a six, though the shot nearly resulted in his dismissal.\n\nThe fielder managed to catch Bennetts pull shot but stepped on the boundary rope while holding onto the ball.\n\nBennetts brilliant innings included five fours, four sixes, 39 singles, and 11 twos.\n\nAt 21, he became the second-youngest player to score a Test century for Zimbabwe, behind only Hamilton Masakadza, who achieved the feat at 17.\n\nBennett finished on an unbeaten 110 runs off 124 balls.\n\nAfghanistans debutant AM Ghazanfar was the pick of the bowlers, finishing with figures of 3/127 from 30.2 overs, while Naveed Zadran, Zahir Khan, and Zia-ur-Rehman took two wickets apiece.\n\nFollowing Zimbabwes innings, there was a slight rain delay, but play resumed promptly after an early tea. The Chevrons made a brilliant start with the ball, as Gwandu picked up his maiden Test wicket, dismissing Sediqullah Atal for three runs off six balls leaving the visitors on 3/1 in 1.5 overs.\n\nAt stumps, Afghanistan were on 95/2 from 30 overs, trailing by 491 runs.\n\nMuzarabani had claimed the other wicket, dismissing Abdul Malik for 23 runs off 55 balls.\n\nBad light forced play to be called off with nine overs remaining in the day.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dghh.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com LED by three centurions, Zimbabwe broke records on day two of the historic Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo. The Chevrons began day two on 363/4 and ended their innings on a mammoth 586 runs from 135.2 overs. The 586 runs scored over the five sessions of […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "Star-Studded Acts Set for Nizhe De Soul and Friends Outing",
            "url": "https://www.chronicle.co.zw/star-studded-acts-set-for-nizhe-de-soul-and-friends-outing/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nTOMORROW, the City of Kings and Queens will play host to the seventh edition of the Nizhe De Soul and Friends outing, a platform that brings music lovers together for a fun-filled day and night.\n\nStarting at 10 am, the event will be held at Marvel House, where families can attend with their children, although kids wont be allowed after 6 pm.\n\nAn array of artists set to perform include star acts Nizhe De Soul, Diliza, Nitefreak, Bryce DJ Klasiq, DJ Crazy Dee, Da Kudu & K Brizzy, DJ Ash T, DJ Dash SA, DJ Fifi, DJ Mufali, DJ Sands, DJ Sfiso, Kotwane Hikwa, LaBreez Maestro, Mellow DJ, Slimzar, Skaiva, Staffa and Zulu DHM.\n\nNizhe De Soul said the event was curated with the aim of bringing people from all walks of life together, where they can mingle while listening to great music.\n\nThe event was curated with the aim of celebrating African culture, food, art & accessories, whilst listening to great music. We have a lineup of activities like jumping castles, water slides, food, art, and fashion & accessories stalls. As this is a family-friendly event running from 10 am to 10 pm, we are catering for what seemed to be lacking in events in koNtuthu ziyathunqa.\n\nThe year has been smooth for me, personally, because Ive been releasing music on my label so that my students can have a platform to showcase their offerings on a stable with a solid foundation. Otherwise, DJ-wise, Ive rocked stages I never thought Id rock worldwide, so technically, with that point, the year has been successful, said Nizhe De Soul.\n\n@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-23.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com TOMORROW, the City of Kings and Queens will play host to the seventh edition of the Nizhe De Soul and Friends outing, a platform that brings music lovers together for a fun-filled day and night. Starting at 10 am, the event will be held at Marvel House, where families can attend with […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "Types of Accidents You Need to Be Prepared For",
            "url": "https://www.chronicle.co.zw/types-of-accidents-you-need-to-be-prepared-for/",
            "content": "Life is unpredictable, and accidents often serve as harsh reminders of just how quickly things can change. While nobody wants to think about such situations, being prepared can make an enormous difference. Here in this article, I will discuss seven common types of accidents, and how you can protect yourself and your loved ones.\n\nDriving is a daily activity for many, but even the most seasoned driver isnt immune to the risks on the road. A split second of distractionwhether from texting, fatigue, or another drivers errorcan lead to disaster. Minor scrapes, as well as life-altering collisions, and car accidents, remain one of the leading causes of injuries worldwide.\n\nTo prepare, always keep your vehicle in top shape. Regularly check your brakes, tires, and lights. Practice defensive driving by maintaining a safe distance, signaling your turns, and being mindful of your speed. Be particularly cautious during bad weather or in areas with heavy traffic. Most importantly, never drive under the influence of alcohol or drugs.\n\nWhen it comes to sheer size and weight, commercial trucks dominate the roads. Sharing the highway with these massive vehicles requires heightened caution. The consequences of a collision involving a truck are often severe due to their size, and the aftermath can be life-altering.\n\nLarge trucks have significant blind spots, longer stopping distances, and limited maneuverability, making them prone to accidents if other drivers are careless. Always avoid lingering in a trucks blind spots, and give them ample room when theyre turning or merging.\n\nIn the unfortunate event of an accident, seeking professional legal advice is crucial. As noted by the Chopin Law Firm, Truck accidents often lead to devastating injuries due to the sheer size and weight of these vehicles. Acommercial truck accident lawyercan guide you through the complexities of legal and insurance claims. Knowing how to navigate this process can be a lifeline when things go wrong.\n\nCities with activity can be a breeding ground for accidents involving bicycles and pedestrians. Cyclists, in particular, are vulnerable due to their limited protection and reliance on other road users to follow traffic laws. Similarly, pedestrians face risks from distracted drivers, speeding vehicles, or unsafe crossings.\n\nIf youre a cyclist, invest in safety gear such as helmets, gloves, and reflective clothing. Always use bike lanes where available and stay vigilant for turning vehicles. Pedestrians should stick to designated sidewalks and crosswalks, avoiding distractions like looking at their phones while crossing streets.\n\nFor drivers, the responsibility lies in paying attention to the surroundings. Always check your blind spots, especially in densely populated areas. Reducing speed in pedestrian-heavy zones and being courteous to others on the road can prevent tragic outcomes. Thus, the shared responsibility among all parties can drastically lower the likelihood of such accidents.\n\nAccidents at work can happen in any setting, like at a corporate office or a high-risk construction site. Slippery floors, faulty equipment, and poor safety protocols can all lead to serious injuries. While employers are legally obligated to maintain safe working conditions, employees must also take proactive steps to protect themselves.\n\nTo minimize risks, always adhere to workplace safety guidelines. If you work in a physically demanding job, ensure youre trained to handle tools and machinery properly. In office environments, report hazards like loose wires or wet floors promptly. Basic safety practices, such as wearing protective gear or lifting heavy objects correctly, can go a long way.\n\nBeing prepared for workplace accidents also means knowing your rights. Familiarize yourself with workplace safety regulations and ensure your employer complies with them. Should an accident occur, documenting the incident thoroughly and seeking appropriate medical attention are critical steps to take.\n\nYour home should be your sanctuary, but its also one of the most common places for accidents to occur. Falls are particularly prevalent, especially among children and the elderly. Fires, electrical mishaps, and accidental poisoning from household chemicals are other frequent hazards.\n\nTo make your home safer, conduct regular inspections. Check for loose carpeting, unstable furniture, and exposed wires. Install handrails in staircases and ensure that rooms are well-lit to avoid tripping hazards. Smoke detectors and fire extinguishers should be present in every household, and everyone should know how to use them.\n\nFor families with young children, childproofing the home is essential. Keep cleaning supplies, medicines, and sharp objects out of reach. By taking these preventive measures, you can significantly reduce the risk of accidents and create a safer environment for everyone.\n\nSports and outdoor activities bring joy and excitement but also carry an inherent risk of injury. A sprained ankle during a casual game or a more serious injury in a competitive sport, the potential for accidents is always there.\n\nPreparation is key. Warm up before engaging in physical activity, and always use the right equipment. For example, wearing helmets, pads, or proper footwear can shield you from harm. Listen to your body and dont push yourself beyond your limits. Rest and recovery are just as important as training, and ignoring pain can lead to more severe injuries.\n\nIf youre a parent, encourage your children to practice safety while playing sports. Teach them the importance of teamwork and following rules to minimize unnecessary risks.\n\nNatural disasters are among the most devastating accidents, as they often strike without warning and leave widespread destruction in their wake. Earthquakes, hurricanes, floods, and wildfires can displace communities and claim lives in mere moments. While these events cant be prevented, preparation can make a significant difference in their aftermath.\n\nStart by creating an emergency kit. This should include essentials such as water, non-perishable food, flashlights, batteries, and a first-aid kit. Know the specific risks in your region and have an evacuation plan in place. Staying informed through weather alerts and local authorities can give you precious time to act.\n\nIn the face of such forces, the human spirit shines brightest through preparation. By equipping yourself with the tools and knowledge to face these challenges, you can safeguard not just your life but also your peace of mind.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/old-new.jpg",
            "description": "  Life is unpredictable, and accidents often serve as harsh reminders of just how quickly things can change. While nobody wants to think about such situations, being prepared can make an enormous difference. Here in this article, I will discuss seven common types of accidents, and how you can protect yourself and your loved ones. […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "‘Mozambique is sovereign’",
            "url": "https://www.chronicle.co.zw/mozambique-is-sovereign/",
            "content": "Fungi Kwaramba, Harare Bureau\n\nThe international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, President Mnangagwa, who is also the chairperson of SADC, has said.\n\nThis follows the Mozambican Constitutional Councils Monday ruling that upheld the results of the October elections, re-affirming the governing Frelimo partys decades-long hold on power.\n\nIn a ruling on Monday, judges of the Constitutional Council named Cde Daniel Chapo as the next president, confirming that the Frelimo candidate won 65 percent of the vote while his main challenger Venancio Mondlane got a 24 percent share of the vote.\n\nSADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law and order which the country and people sorely need and deserve, the President said.\n\nThis year the SADC region, and Africa at large, have witnessed elections in several countries with the plebiscites largely peaceful save for a few exceptions.\n\nCde Daniel Chapo\n\nThe President said this is a loud testimony that democracy continues to find deeper roots and to flourish in our SADC Region.\n\nIn his statement, President Mnangagwa said the Constitutional Councils Monday ruling exhausted all lawful processes for determining election results, both under Mozambican laws and SADC Election Guidelines and expectations, and thus all parties need to abide by the countrys apex courts ruling.\n\nThe Southern Africa Development Community (SADC) notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election Results held in the Republic Mozambique on 9th October this year.\n\nThe ruling by that countrys top electoral court, which upheld Frelimo Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with SADCs Election Guidelines and expectations.\n\nSADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nFurther, the President said, the rule of law is sacrosanct and SADC, as the regional mother body, stands ready to assist the people of Mozambique in deepening and consolidating democracy.\n\nSADC stands ready to assist the incoming Government, and People of Mozambique, in consolidating their electoral democracy on the basis of the aforesaid Court decision which should be held sacrosanct by all. Indeed, this is what the rule of law is all about, the President said.\n\nIn the October elections, Cde Chapo won by a massive landslide; his party, Frelimo, also improved its parliamentary majority in the 250-seat legislature.\n\nHowever, the opposition led by Mr Modlane has refused to accept defeat, leading to sporadic protests in the gas-rich southern African country, concentrated mainly in the urban centres.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jhgj-680x380.jpg",
            "description": "Fungi Kwaramba, Harare Bureau The international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, President Mnangagwa, who is also the chairperson of SADC, has said. This follows the Mozambican Constitutional Council’s Monday ruling that upheld the results of the October elections, re-affirming the […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "All set for Bulawayo Shutdown Show . . . Artistes ready to deliver",
            "url": "https://www.chronicle.co.zw/all-set-for-bulawayo-shutdown-show-artistes-ready-to-deliver/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nIts all systems go for the Bulawayo Shutdown show, slated for today at the Zimbabwe International Exhibition Centre, Hall 1.\n\nThe stage is set, the programme is out and Bulawayo artistes are more than ready to showcase their talent to the people.\n\nThe event will kick off at 2 p.m.\n\nAttendees will also have the luxury of witnessing performances from Jah Prayzah, Winky D, Killer T, Boy Nino, Jaycee, Ma9ine, Silent Killer, Enzo Ishall, Freeman, Master H, Saint Floew and Nisha T.\n\nThe show, which is mainly aimed at empowering local artistes, will see 22 local artistes taking to the stage.\n\nDJ Kotwane\n\nUpcoming artistes will also not be left behind, as they will be given slots to perform as curtain-raisers for the main acts.\n\nIn interviews, some of the artistes said they are more than ready to give the people their best.\n\nDJ Kotwane Hikwa shared that he is eager to show the nation his expertise on the decks.\n\nIts an honour to grace the stage with artistes from all around Zimbabwe at this years Bulawayo Shutdown. My fans should expect a high-energy DJ set, as Ill be doing a back-to-back with DJ Ash T.\n\nI will definitely dish out the best music, which will stay in the memories of everyone who will be in attendance, said Kotwane.\n\nWinky D\n\nMusician Mzoe7, who will be one of the masters of ceremony at the event, also expressed his enthusiasm in ensuring that the mood is kept at a high level throughout the event:\n\nShutdown has always been a challenging stage for me, so I am very much prepared for it with every creative element I have.\n\nI am ready to ensure that everyone is enjoying the show, as I will be on stage for more hours than all the acts. I am staying fit and hydrated.\n\nEveryone should come ready to meet the ever-energetic creative Mzoe7, he said.\n\nThe Shutdown show is the talk of the town, with taxi drivers and other business people eager to make a killing on the day of the event.\n\nJah Prayzah\n\nThe event has been successfully running for seven years and has become a tradition during the April and December holidays.\n\nIt provides an entertainment space not only for Bulawayo but also for the nation and beyond, as the April edition attracts exhibitors who participate in the Zimbabwe International Trade Fair.\n\nThe April edition saw organisers bring in artistes from across the border, which gave local artistes a chance to network with their fellow South African artistes, serving as a cultural exchange space for all.\n\nThere is definitely something special for everyone at the Bulawayo Shutdown Show, as the organisers have ensured all genres are covered.\n\nSandra Ndebele\n\nThe DJs on rotation will dish out Amapiano and House music, among other genres. These include DJ Stout, DJ Sfiso, DJ Kotwane, Ash T, Zulu Da Maniac, Vito Bravo, Sancia and Feel G.\n\nRhumba fans will enjoy a performance from their favourite group, Insimbi Zezhwane.\n\nHosting the event will be Sandra Ndebele and taking turns as the masters of ceremony will be musician Mzoe7, DJ Nospa and content creator, Metty IntombiEmfitshane.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/swyhj.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com It’s all systems go for the Bulawayo Shutdown show, slated for today at the Zimbabwe International Exhibition Centre, Hall 1. The stage is set, the programme is out and Bulawayo artistes are more than ready to showcase their talent to the people. The event will kick off at 2 p.m. Attendees will […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "‘Support local products this festive season’",
            "url": "https://www.chronicle.co.zw/support-local-products-this-festive-season/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nTHE Ministry of Industry and Commerce has urged Zimbabweans to support local initiatives through the Buy Zimbabwe Campaign and Local Content Strategy during the festive season, promoting the procurement of locally produced goods to drive economic growth.\n\nIn his festive season message shared on the ministrys official X account, Industry and Commerce Minister Nqobizitha Mangaliso Ndlovu, commended the business community for its contributions to Zimbabwes economic progress. He encouraged consumers to prioritise local products, emphasising their role in achieving the nations Vision 2030 of becoming an upper-middle-income economy.\n\nAs you celebrate this festive season, please support local initiatives through the Buy Zimbabwe and Local Content Strategy, said Minister Ndlovu.\n\nThe minister also called on business membership organisations, development partners, the private sector, and Government agencies to collectively support the inter-ministerial taskforce on business malpractice.\n\nMinister Mangaliso Ndlovu\n\nI equally encourage your support for the inter-ministerial taskforce on business malpractice in combating counterfeiting and smuggling, which enables us to bring sanity to our business environment while enhancing consumer protection, he said.\n\nMinister Ndlovu highlighted the ministrys commitment to collaboration with the private sector and announced the launch of the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP) 2024-2025, which serves as a transitional framework aligning industrial policy with the National Development Strategy 2 (2026-2030).\n\nThe new year presents an opportunity to address challenges in industrial growth while optimising the strong macro-economic stability the sector has experienced to drive industrial growth going forward, he said.\n\nSince its inception, the Buy Zimbabwe Campaign has sought to correct market imbalances that favour foreign products over locally produced goods. The campaign has been central to the Governments development agenda, promoting local procurement and consumption as a key driver of economic self-sufficiency.\n\nThe Local Content Strategy, another vital intervention, aims to manage Zimbabwes import bill by reducing dependency on foreign goods and conserving foreign currency for critical imports such as raw materials, fuel, medicines, and equipment. Key sectors identified under the strategy include pharmaceuticals, oil seeds, dairy, horticulture, clothing and textiles, leather and leather products, fertilisers and chemicals, soaps and detergents.\n\nMinister Ndlovu reiterated that local initiatives are at the core of the National Development Strategy, urging stakeholders to actively engage in fostering industrial growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/FGTR.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com THE Ministry of Industry and Commerce has urged Zimbabweans to support local initiatives through the Buy Zimbabwe Campaign and Local Content Strategy during the festive season, promoting the procurement of locally produced goods to drive economic growth. In his festive season message shared on the ministry’s official X account, Industry and […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "Bulawayo’s  tourist spots  buzz with  festive cheer",
            "url": "https://www.chronicle.co.zw/bulawayos-tourist-spots-buzz-with-festive-cheer/",
            "content": "Families and friends visited various tourists destinations including the Matopos National Park on Christmas Day\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsd.jpg",
            "description": "Mashudu Netsianda, mashudu.netsianda@chronicle.co.zw  TOURIST attractions in and around Bulawayo were teeming with activity on Christmas Day as hordes of local and international visitors flocked to iconic destinations to celebrate the holiday in unique and memorable ways. From the serene granite hills of Matopos National Park to the ancient stone walls of Khami Ruins, the festive […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "Sibekiwe Ndlovu bids for Zifa board post",
            "url": "https://www.chronicle.co.zw/sibekiwe-ndlovu-bids-for-zifa-board-post/",
            "content": "Zimpapers Sports Hub\n\nSEASONED football administrator Sibekiwe Ndlovu, is running for a post on the Zimbabwe Football Association (Zifa) board, promising to champion the improvement of womens football in the country.\n\nNdlovu, a well-respected figure in local football circles, boasts a wealth of experience in football administration having served in various capacities within Zifa and other football organisations.\n\nSpeaking to Zimpapers Sports Hub, Ndlovu outlined her vision for the development of womens football in Zimbabwe, citing the need for increased investment, better infrastructure and more competitive leagues.\n\nAs a passionate advocate for womens football, I believe its time for us to take our game to the next level, Ndlovu said.\n\nWe need to create more opportunities for our female players, coaches and administrators to grow and succeed. This includes investing in better facilities, providing more resources for our national teams and promoting womens football through effective marketing and branding.\n\nNdlovus campaign is built around three core pillars, development, empowerment and excellence.She promises to work tirelessly to promote womens football, engage with stakeholders and drive positive change within Zifa.\n\nWomens football is not just a niche area; its a vital part of our sports ecosystem, Ndlovu emphasised.\n\nBy supporting and developing womens football, we can unlock new talent, inspire a new generation of players and grow the game as a whole.\n\nNdlovus journey in football spans over two decades, marked by her unwavering passion, dedication and leadership.\n\nAs a life member of Highlanders Football Club, Ndlovu has been an integral part of the clubs growth and development. Her commitment to the sport has earned her recognition and respect within the football fraternity.\n\nHighlanders bus\n\nNdlovus administrative acumen and expertise have been demonstrated through her various roles within football.\n\nShe has served as the chairperson of Highlanders Royals, a position that allowed her to play a pivotal role in the revival of the team.\n\nUnder her leadership, Highlanders Royals regained its status as a force to be reckoned with in womens football. Her success in this role is a testament to her ability to drive growth and development in football.\n\nAs the present director of Lobengula Queens, Ndlovu continues to be a driving force in womens football.\n\nHer experience in managing and administering womens football teams has equipped her with a deep understanding of the challenges and opportunities that exist within the sport.\n\nShe has been a vocal advocate for the development of womens football, working tirelessly to promote the sport and create opportunities for female players, coaches and administrators.\n\nHer commitment to gender equality and womens empowerment in football aligns with Zifas strategic objectives, making her an ideal candidate for the board.\n\nWith her extensive experience, leadership skills and passion for football, Ndlovu is an exceptional candidate for the Zifa board.\n\nNdlovu has been instrumental in promoting girls soccer in rural areas, identifying and nurturing talent that would otherwise go unnoticed. Her vision is to take girls soccer to the grassroots level, ensuring that every region is represented and every girl has access to equal opportunities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/etyj.jpg",
            "description": "Zimpapers Sports Hub SEASONED football administrator Sibekiwe Ndlovu, is running for a post on the Zimbabwe Football Association (Zifa) board, promising to champion the improvement of women’s football in the country. Ndlovu, a well-respected figure in local football circles, boasts a wealth of experience in football administration having served in various capacities within Zifa and […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        },
        {
            "title": "We hope the Mozambique poll suspense is settled",
            "url": "https://www.chronicle.co.zw/we-hope-the-mozambique-poll-suspense-is-settled/",
            "content": "For 75 long days Mozambicans, Sadc and watchers of that countrys politics had been in suspense.\n\nThe country staged a general election on October 9 and two weeks later, the election management body announced preliminary results which showed the Frelimo party retaining power with a crushing majority.\n\nBut Maputos electoral law requires the Constitutional Council to validate the results and formally declare the winner. As the supreme electoral body undertook its arduous task, the opposition in that country was staging violent protests, alleging without providing any evidence, that the election was flawed. A number of people have died in the disorder while business has suffered too.\n\nThe suspense ended on Monday when the council finally pronounced itself on the poll. It declared Frelimo candidate, Cde Daniel Chapo the victor with a 65 percent mandate. In second place is Mr Venancio Mondlane, a pastor-turned-politician who contested as an independent candidate and got 25 percent of the vote.\n\nCde Daniel Chapo\n\nIn parliament, Frelimo, in power since 1975, secured 195 seats versus Podemos, an opposition party which backed Mr Mondlane, which got 31. Renamo, a former rebel movement, came third with 20 constituencies, a 40-seat decline on its 2019 performance.\n\nGiven the suspense, and the disorder that accompanied that period, we hope that the Monday statement by the council has closed Mozambiques 2024 electoral contest. All the energies will now be channelled towards Cde Chapos inauguration and his formation of a new government to govern our sister republic for the next five years.\n\nMozambique, like Zambia and Tanzania, occupies a special place in the hearts of every Zimbabwean. Without Mozambique and Zambias support, our liberation war would most likely have struggled, even failed. The two countries served as trusted rear bases for our freedom fighters. They provided material and moral support as well. For that magnanimity towards our liberation movement, they actually suffered military retribution from the Rhodesian army.\n\nBecause of this formidable shared history and the fact that communities along our border with Mozambique have blood relatives on either side, we urge our brothers and sisters to find each other, shun violence, talk and practise peace for greater national development.\n\nMozambique is a massive country with abundant natural resources. From rubies to natural gas; from wildlife to a high-potential blue economy. She has ports that serve as vital links for her landlocked neighbours such as our country, Malawi and Zambia to global export markets.\n\nThese resources and geographical advantage will only bring tangibles to our sister republic if it enjoys peace.We are optimistic that, indeed, with the Constitutional Council having spoken, our brothers and sisters in Mozambique will listen and unite to build their great country.\n\nPresident Mnangagwa\n\nWe cite Sadc Chairperson, President Mnangagwa elsewhere on these pages noting the same.\n\nThe ruling by that countrys top electoral court, which upheld Frelimo Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with Sadcs Election Guidelines and expectations, he said.\n\nSadc thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Cde-Daniel-Chapo-portrait.jpg",
            "description": "For 75 long days Mozambicans, Sadc and watchers of that country’s politics had been in suspense. The country staged a general election on October 9 and two weeks later, the election management body announced preliminary results which showed the Frelimo party retaining power with a crushing majority. But Maputo’s electoral law requires the Constitutional Council […]",
            "time": "20:38",
            "date": "27 Dec 2024"
        }
    ]
}