{
    "news": [
        {
            "title": "Nation rallies behind President",
            "url": "https://www.chronicle.co.zw/nation-rallies-behind-president/",
            "content": "Chronicle Writers\n\nZIMBABWEANS, by snubbing calls to demonstrate from some shadowy terror groups on Monday, demonstrated their full support for President Mnangagwa and their appreciation of the prevailing peace in the country, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, has said.\n\nSpeaking during a post-Cabinet media briefing, Dr Muswere said the failure of the protests was a testament to the citizens confidence in the constitutionally elected Zanu-PF Government, led by President Mnangagwa.\n\nPresident Mnangagwa\n\nIn terms of what cyber terrorists had planned, which did not materialise yesterday (Monday), this is a clear demonstration that Zimbabweans fully support the Government they elected, that is the Zanu-PF Government, which is headed by His Excellency President Mnangagwa, and we still fully appreciate the peace and tranquillity in our country, he said.\n\nDr Muswere dismissed those who incited the protests as misguided and delusional figures with unrealistic ambitions.\n\nYes, these cyber-terrorists were led by one Mr (Blessed) Geza, a liberation war mistake with a lot of delusional hallucinations, in that he actually believed he could create an uprising in our country. This is a clear misdirection of ambition. We are here, and we can witness that peace and tranquillity continue to exist in our country, he said.\n\nDr Muswere emphasised the importance of collective responsibility in achieving national development goals and assured the nation that the security sector remains vigilant in addressing such activities.\n\nZimbabweans have a shared responsibility to achieve Vision 2030, which seeks to achieve an upper-middle-income society by the year 2030.\n\nSpeaking at a press conference yesterday, Zanu-PF spokesperson Cde Christopher Mutsvangwa said Zimbabweans showed restraint and discipline as they despised and rejected participating in mayhem and despondency.\n\nChristopher Mutsvangwa\n\nHe said those who planned the demonstration failed to execute their plans.\n\nTheir leaders, Tendai Biti and Saviour Kasukuwere, should understand the geopolitics of the world. The USA will never support the shenanigans of planning to topple the Zanu-PF Government, said Cde Mutsvangwa.\n\nHe said people want confidence in a leader before they follow him.\n\nThen Geza expected people to follow him; maybe it was those behind him who gave him courage. You cannot just wake up thinking you can change a Government in Africa; things and systems have changed, said Cde Mutsvangwa.\n\nPresident Mnangagwa has addressed the majority of challenges in Zimbabwe. For example, the marginalisation of the War veterans is being addressed.\n\nSomeone (Geza) was wearing a military uniform at the age of 70, trying to be a saviour. Zimbabweans are not interested in the farce that happened yesterday.\n\nZanu-PF, Cde Mutsvangwa said, reaffirms its commitment to the security, stability and economic progress of Zimbabwe.\n\nAs a Government that serves the interests of the people, we take security issues seriously and remain steadfast in ensuring that Zimbabweans continue to uplift their lives and livelihoods without disruption.\n\nZimbabweans, he said, are fully aware of the severe damage inflicted on the economy by so-called demonstrations, which served only to cripple progress and undermine national development in previous years.\n\nCde Mutsvangwa said the Government remains focused on implementing policies that empower its citizens, strengthen the economy and uphold peace and security.\n\nThe opposition also strongly condemned calls for illegal protests that ultimately failed to gain traction, saying engaging in dialogue and adherence to the countrys constitution should be the primary means of addressing grievances.\n\nThe condemnation was in response to efforts by political activists to mobilise demonstrations through online platforms, which Zimbabweans largely ignored on Monday, choosing instead to prioritise peace and stability.\n\nThe Citizens Coalition for Change (CCC), along with the Zimbabwe African National Congress (ZANC) and the Labour Economists and African Democrats (LEAD), expressed their disapproval of the attempted protests, commending citizens for their commitment to stability over potential violence.\n\nMeanwhile, CCCs acting secretary-general, Senator Sengezo Tshabangu called on Zimbabweans to engage in constructive dialogue instead of violence.\n\nZANC president Mr Timothy Mncube said his party doesnt believe protests are the preferred method for citizens to express their grievances.\n\nMr Mncube acknowledged citizens constitutional rights to express themselves but advocated for an approach where constructive dialogue between civil society and Government is favoured over violence and demonstrations.\n\nUltimately, ZANC believes that a combination of peaceful approaches that emphasise engagement over violence can help create a more inclusive, just and prosperous society for all Zimbabweans, he said.\n\nLEAD president Ms Linda Masarira cautioned against protests that do not directly serve the interests of the people, referencing the violent demonstrations of 2019.\n\nIn the past, such protests have led to loss of goods for vendors, looting of businesses and damage to critical infrastructure, leaving ordinary citizens worse off, she said.\n\nMs Masarira noted that the failure of the recent protests reflects a significant shift in public sentiment since the violent demonstrations of January 2019, which deeply affected informal traders and small business owners.\n\nThis situation also serves as a wake-up call for Zimbabweans in the diaspora, who often encourage protests from afar without understanding the daily realities on the ground, she said.\n\nThe failure of the M31 protest sends a clear message that people need sustainable solutions, not political games, added Ms Masarira. Meanwhile, 102 individuals who were involved in the failed demonstrations appeared before the magistrates courts in Bulawayo and Harare yesterday for participating in a public gathering with the intention of promoting violence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fgsgsn-.jpg",
            "description": "Chronicle Writers ZIMBABWEANS, by snubbing calls to demonstrate from some shadowy terror groups on Monday, demonstrated their full support for President Mnangagwa and their appreciation of the prevailing peace in the country, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, has said. Speaking during a post-Cabinet media briefing, Dr Muswere said the failure of […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "RBZ goes after  currency hoarders",
            "url": "https://www.chronicle.co.zw/rbz-goes-after-currency-hoarders/",
            "content": "Richard Muponde,Zimpapers Politics Hub\n\nTHE Reserve Bank of Zimbabwe (RBZ) will soon swoop on businesses and individuals hoarding money in cash deposit boxes in banks, homes and business premises.\n\nAuthorities are concerned that these practices leave millions of dollars lying idle, depriving the economy of much-needed cash for transactions.\n\nAnnouncing his 2025 Monetary Policy Statement in February, RBZ Governor Dr John Mushayavanhu termed the practice of hoarding cash in banks or company premises as financial disintermediation, which he said is stifling economic growth by depriving economic agents of much-needed liquidity.\n\nHe noted that some manufacturers are supplying goods to the informal market but are not banking their proceeds. Instead, they are keeping these funds in their cash deposit boxes, which violates the Anti-Money Laundering Act.\n\nDr Mushayavanhu stated that the Financial Intelligence Unit (FIU) of the RBZ will not stand by but take action to address this malpractice.\n\nIn an interview with Zimpapers Politics Hub on Tuesday, FIU Director General Mr Oliver Chiperesa confirmed the impending blitz, citing concerns raised by Dr Mushayavanhu.\n\nYou may recall that during the presentation of his 2025 Monetary Policy Statement, the RBZ Governor mentioned that businesses and individuals, especially manufacturers and informal retailers, were hoarding millions of dollars in their cash deposit boxes. This is depriving the economy of the much-needed liquidity, Mr Chiperesa said.\n\nReserve Bank of Zimbabwe (RBZ)\n\nWe are currently working on the regulations to ensure that we conduct this blitz within the confines of the law. Normally, cash deposit boxes are used to keep important documents, but the current trend is that they are being used to store large sums of money outside the banking system, which is illegal according to the Anti-Money Laundering Act, he added.\n\nMr Chiperesa said it was encouraging to see improved use of the official banking system, which promotes free financial flows.\n\nWe want to encourage growth and ensure that all transactions are accounted for in line with anti-money laundering and anti-terrorism regulations. We were removed from the FATF (Financial Action Task Force) grey list because of the clean flow of money in our economy, and we want to maintain that achievement to support economic growth through attracting Foreign Direct Investment, he said.\n\nThe FIU recently strengthened its operations by opening offices in Bulawayo to bolster ZiG stability. However, the widespread hoarding of millions of dollars in cash deposit boxes is a major challenge as it threatens financial stability.\n\nCurrently, as Dr Mushayavanhu indicated, there is stability in the exchange rate. He hinted that the continued stability of Zimbabwe Gold (ZiG) is expected to lead to more transactions being conducted in the local currency.These transactions are expected to include fuel sales as the market begins to embrace ZiG as a store of value and a reliable medium of exchange.\n\nDr Mushayavanhu also emphasised that keeping large sums of cash is an unnecessary risk given the upward revision in limits on prepaid credit and the attractive interest rates on savings.\n\nAs part of efforts to promote a culture of saving and bolster confidence in the local banking sector, the RBZ has implementedincremental increases in interest rates on savings accounts.\n\nThe stability of ZiG has led to an increase in ZiG transactions and deposits, signalling confidence and acceptance of the local currency by the market.\n\nThis development has also resulted in the proportion of local currency deposits held by banks increasing from less than 10 percent before the introduction of ZiG to current levels of around 15 percent.\n\nThe central bank also stated that new regulations, which stipulate that 50 percent of Quarterly Payment Dates.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dsccsd.jpg",
            "description": "Richard Muponde, Zimpapers Politics Hub THE Reserve Bank of Zimbabwe (RBZ) will soon swoop on businesses and individuals hoarding money in cash deposit boxes in banks, homes and business premises.  Authorities are concerned that these practices leave millions of dollars lying idle, depriving the economy of much-needed cash for transactions. Announcing his 2025 Monetary Policy Statement […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "COMMENT: Memorialisation of Zim’s liberation legacy highly commendable",
            "url": "https://www.chronicle.co.zw/comment-memorialisation-of-zims-liberation-legacy-highly-commendable/",
            "content": "MIDLANDS Province, often regarded as the bedrock of Zimbabwes liberation struggle, is now at the centre of a national effort to preserve and honour the regions rich historical legacy.\n\nThe National Museums and Monuments of Zimbabwe (NMMZ) is spearheading a series of projects aimed at memorialising the key sites that played a pivotal role in Zimbabwes fight for Independence.\n\nFrom the notorious detention camps of Wha Wha and Connemara to the iconic Mtapa Hall, where the first Zanu Congress was held in 1964, Midlands was a hotbed of resistance against colonial rule.\n\nThese locations stand as testament to the immense sacrifices made by nationalist leaders and ordinary Zimbabweans in the battle for freedom.\n\nUnder the stewardship of NMMZ, these historical sites will not only be preserved but also brought to life through exhibitions and memorials.\n\nActing executive director of NMMZ Mr Darlington Munyikwa highlighted the importance of Midlands in the broader narrative of Zimbabwes liberation struggle.\n\nHe noted that the province housed some of the most significant detention and restriction centres used by the colonial regime to suppress the nationalist movement.\n\nThese sites, such as Sikombela Restriction Camp, Mtapa Hall, and the infamous Wha Wha and Connemara Prisons, were where many prominent figures, including Cdes Robert Mugabe, Edson Zvobgo and Leopold Takawira, were held. Their imprisonment at these sites marked a dark chapter in the countrys history, one that NMMZ aims to immortalise.\n\nThe restoration and development of these sites, including the creation of a field museum at Sikombela Restriction Camp, will allow future generations to engage with this history. Mr Munyikwa explained that Sikombela, established in 1964, will feature a memorial plinth, a theme park, and displays of the original tin huts used by detainees.\n\nThe NMMZ is also working on the restoration of Mtapa Hall, where the Zanu Congress of 1964 marked a decisive shift towards armed resistance. The Hall will soon host exhibitions that tell the story of this momentous event and the leaders involved.\n\nEqually important is the ongoing restoration of Wha Wha and Connemara Prisons, both symbols of the brutal repression faced by Zimbabwes nationalist leaders. The NMMZs efforts at these sites, including refurbishing the penal detention blocks and developing exhibitions, are vital in conveying the harsh realities faced by detainees.\n\nAs part of Zimbabwes 2025 Independence celebrations, the Independence Flame will pass through all districts of Midlands, symbolising the regions central role in the liberation struggle. This marks an important milestone in ensuring that the regions legacy is remembered.\n\nIn preserving these sites and telling the stories of the men and women who fought for Zimbabwes Independence, the NMMZ is not merely safeguarding physical structures but also ensuring that the sacrifices of the past continue to inspire future generations. The Midlands projects remind us that the struggle for freedom was fought by many and their legacy will never be forgotten.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/eeew.jpg",
            "description": "MIDLANDS Province, often regarded as the bedrock of Zimbabwe’s liberation struggle, is now at the centre of a national effort to preserve and honour the region’s rich historical legacy.  The National Museums and Monuments of Zimbabwe (NMMZ) is spearheading a series of projects aimed at memorialising the key sites that played a pivotal role in […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "Chiefs celebrate progress",
            "url": "https://www.chronicle.co.zw/chiefs-celebrate-progress/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nCHIEFS from Matabeleland South have acknowledged the progress made across various sectors since independence, urging citizens to celebrate this achievement.\n\nThis year, the province will host its Independence Day celebrations in Plumtree, moving from the traditional venue  Phelandaba Stadium in Gwanda.\n\nThis decision aligns with the Governments devolution agenda, which advocates for a rotational hosting system. Plumtree High School will be the venue for this years celebrations.\n\nNationally, Gokwe North District in Midlands Province will host the 45th Independence Anniversary celebrations under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030.\n\nChief Sitaudze from Beitbridge\n\nChief Tshitaudze from Beitbridge District highlighted advancements in key sectors such as mining, agriculture, health and education.\n\nThe attainment of independence in 1980 allowed indigenous people to take the lead in shaping the countrys development. Over the years, we have seen empowerment across various sectors, and the province has made notable strides, he said.\n\nHe pointed to the US$300 million modernisation of the Beitbridge Border Post as a landmark achievement.\n\nWe have also witnessed the rehabilitation of the Beitbridge-Chirundu Road. In districts like Insiza and Gwanda, locals have played a key role in developing the mining sector, both on small and large scales, said Chief Tshitaudze.\n\nFarmers are excelling in both livestock and crop production, while women and youths are making an impact in governance and other fields.\n\nChief Tshitaudze also acknowledged improvements in the health and education sectors, with more facilities being established to enhance service delivery.\n\nChief Sebasa from Insiza District urged communities to participate in Independence Day celebrations and challenged parents to instil a sense of patriotism in young people.\n\nChief Matibe from Beitbridge\n\nAs elders, it is our duty to educate the younger generation about the importance of Independence Day so that this patriotic spirit continues. We must not take this day lightly, as it defines who we are as a nation, he said.\n\nYoung people need to understand the journey to independence and the transformation that has taken place since. They are the future leaders and should appreciate the sacrifices made.\n\nChief Matibe from Beitbridge District expressed gratitude for the development that has come with independence. He acknowledged the strides made under the Second Republic to ensure that communities across the province benefit from these gains.\n\nThe Minister of State for Matabeleland South Provincial Affairs and Devolution, Dr Evelyn Ndlovu, stated that preparations for the celebrations are progressing well.\n\nAs Independence Day approaches, preparations in Matabeleland South are on track. Local authorities and community leaders have been actively involved in organising events to ensure a memorable celebration, she said.\n\nKey preparations include securing venues, arranging performances by local artistes, planning parades and encouraging participation from schools, community groups and civic organisations.\n\nDr Ndlovu described hosting the celebrations in Plumtree for the first time as a milestone for the province, reflecting efforts to decentralise national events and allow more communities to experience the occasion first-hand.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dscasxas.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw CHIEFS from Matabeleland South have acknowledged the progress made across various sectors since independence, urging citizens to celebrate this achievement. This year, the province will host its Independence Day celebrations in Plumtree, moving from the traditional venue — Phelandaba Stadium in Gwanda.  This decision aligns with the Government’s devolution agenda, which advocates for […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "Bosso focus, fitness levels questioned",
            "url": "https://www.chronicle.co.zw/bosso-focus-fitness-levels-questioned/",
            "content": "Innocent Kurira,[emailprotected]\n\nFOOTBALL coach and analyst, Dalubuhle Bhebhe has called for Highlanders to improve their concentration in the final stages of matches.\n\nThis comes after Highlanders conceded a late equaliser against Scottland, settling for a 1-1 draw in a game they appeared to be on track to win.\n\nBosso also squandered a two-goal advantage against GreenFuel, drawing 2-2 after leading 2-0 at halftime. They allowed their opponents to regroup and equalise in the second half, with GreenFuels second goal coming in injury time. In their match against MWOS, Highlanders conceded in the 61st minute and lost 1-0.\n\nBhebhe believes Highlanders need to address their concentration levels, particularly in the dying minutes of matches.\n\nI feel it comes down to two things. First, its concentration  an issue of the players concentration span  and the other thing could be the players fitness levels. I feel the players tend to get tired as the game progresses. That fatigue could result in players losing concentration at key moments, said Bhebhe.\n\nDalubuhle Bhebhe\n\nThe issue of concentration in the final stages is often made worse when fatigue sets in. As players tire, their ability to focus diminishes, making them more vulnerable to lapses that can cost crucial points, he added.\n\nBhebhe stressed the importance of maintaining full concentration throughout the match.\n\nThis highlights the importance of both physical conditioning and mental focus, as the closing minutes of a match often decide the outcome. Coaches could implement specific training drills to improve concentration under pressure, ensuring players maintain sharpness throughout the full 90 minutes, said Bhebhe.\n\nHe further suggested that Highlanders technical team needs to address both the mental and physical endurance of the players in their training sessions.\n\nThe coaching staff needs to focus on improving both mental and physical endurance during training, he said.\n\nBhebhes observations suggest that addressing these aspects could help prevent costly mistakes in the final moments of games.\n\nIts not just about fitness but also about mental resilience. Players who are both physically prepared and mentally focused are more likely to avoid the mistakes that have led to these late-game slip-ups, he explained.\n\nFollowing the draw against Scottland, Bosso coach Kelvin Kaindu acknowledged the issue, stating that the team is working on improving their performance in the closing stages.\n\nI think, looking at the time we scored, we should have come out with maximum points. Once again, with the last kick, we conceded in added time. It is one area we need to work on, Kaindu said.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/grtgtg.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw  FOOTBALL coach and analyst, Dalubuhle Bhebhe has called for Highlanders to improve their concentration in the final stages of matches. This comes after Highlanders conceded a late equaliser against Scottland, settling for a 1-1 draw in a game they appeared to be on track to win. Bosso also squandered a two-goal advantage against […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "SA extends visa, permit deadline for Zimbabweans",
            "url": "https://www.chronicle.co.zw/sa-extends-visa-permit-deadline-for-zimbabweans/",
            "content": "Thupeyo Muleya,[emailprotected]\n\nSouth Africas Ministry of Home Affairs has extended the deadline for visa and permit holders whose documents expired at the end of March, citing delays in processing applications.\n\nThe new deadline is now 30th September, providing temporary relief to thousands of foreign nationals, including Zimbabweans, who are awaiting the finalisation of their immigration status.\n\nThis latest development was announced on Tuesday by South Africas Home Affairs Minister, Dr Leon Schreiber, under Immigration Directive Number 4 of 2025. The directive offers a temporary concession for foreign nationals affected by delays in processing visa appeals and manual applications.\n\nThe extension is particularly significant for holders of the Zimbabwe Exemption Permit (ZEP), who have faced uncertainty regarding their legal status in South Africa. The ZEP system, initially introduced as the Dispensation of Zimbabweans Project (DZP) in 2009, was later replaced by the Zimbabwe Special Permit (ZSP) in 2014 and, ultimately, the ZEP in 2017. These permits were designed to regularise the stay of Zimbabweans who had migrated to South Africa.\n\nAround 178 000 Zimbabweans were eligible to apply for the new exemption permits, which are set to expire at the end of November.\n\nHowever, delays in processing, particularly in the areas of printing and appeals, have left many individuals in a state of uncertainty.\n\nIn his announcement, Dr Schreiber acknowledged that despite efforts to address the backlog, numerous visa applications remain unprocessed due to delays in printing and administrative procedures.\n\nThe Department of Home Affairs has, since issuing Immigration Directive No. 16 of 2024, dated 18 December 2024, been working to clear the backlog in its visa and permitting regime. However, many applications will not be ready for collection before the deadline of 31st March 2025, as stipulated in the previous concession, primarily due to delays in the printing process, he said.\n\nFurthermore, the processing of the resultant appeals, as well as some manual category applications, will not be completed by the expiry of the current concession and is now the departments primary focus.\n\nThe extension will allow the Department of Home Affairs to process the applications and provide applicants the opportunity to collect their outcomes and submit applications for the appropriate visas.\n\nHe added that applicants who wish to abandon their waiver applications and leave South Africa before 30th September will not be declared undesirable under immigration laws. Visa holders awaiting the outcome of their waiver application can travel in and out of South Africa without being deemed undesirable until 30th September 2025.\n\nHowever, non-visa-exempt applicants with pending waiver applications must apply for a port of entry visa before returning to South Africa.\n\nThe minister clarified that the extension applies to long-term visa applicants, but they must continue to comply with the conditions of their visas.\n\nThe extension also applies to visa holders who have applied for long-term visas, as outlined in Section 11(1)(b) of the Immigration Act, up to and including Sections 20 and 22 of the Act, and whose visa application is still pending as of the date of this directive, he stated.\n\nHowever, Dr Schreiber made it clear that the temporary concession does not apply to individuals awaiting the outcome of permanent residence applications. These applicants must ensure their legal stay remains valid at all times while awaiting final approval.\n\nThe temporary measures will only apply to foreign nationals who have been legally admitted to South Africa and who have submitted applications via VFS Global. Applicants must be able to provide a verifiable receipt for their applications through the VFS tracking system.\n\nThis extension offers a crucial lifeline for many Zimbabweans and other foreign nationals whose legal status in South Africa was at risk due to administrative delays.\n\nWhile the concession provides temporary relief, the long-term future of Zimbabweans in South Africa remains uncertain, especially as the country moves towards phasing out exemption permits.\n\nThe Zimbabwean Government has previously urged its citizens to regularise their stay through South Africas mainstream visa system or prepare for repatriation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fhfrthjrtdy.jpg",
            "description": "Thupeyo Muleya, thupeyo.muleya@zimpapers.co.zw South Africa’s Ministry of Home Affairs has extended the deadline for visa and permit holders whose documents expired at the end of March, citing delays in processing applications.  The new deadline is now 30th September, providing temporary relief to thousands of foreign nationals, including Zimbabweans, who are awaiting the finalisation of their immigration […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "Tributes pour in for ‘music promoter’ Farai Taruvinga",
            "url": "https://www.chronicle.co.zw/tributes-pour-in-for-music-promoter-farai-taruvinga/",
            "content": "Mthabisi Tshuma,Zimpapers Arts and Entertainment Hub\n\nTHE Zimbabwean arts community is in mourning following the death of renowned music promoter, Farai Fimbo Taruvinga.\n\nTaruvinga, who was the proprietor of the popular Scooter Joint in Filabusi and the Member of the National Assembly for Insiza North, died on Monday in Bulawayo at the age of 53, after a long battle with cancer.\n\nAffectionately known as Fimbo or Ras Fatso, he played a vital role in promoting both established and emerging artistes through his arts promotions company, Prunella Promotions and the Scooter Joint. His venue hosted top acts such as South Africas Big Zulu, former Amaroto member Reece Madlisa, Jah Prayzah, Jay Cee, Kay Kid Umfanomsotho, Zhezhingtons and Utsheketsha Ogezayo, among others.\n\nThe venue had become a vibrant hub, providing a platform for up-and-coming musicians to showcase their talent and gain recognition through numerous hosted shows.\n\nSpeaking to Zimpapers Arts and Entertainment Hub, industry stakeholders who worked closely with him expressed deep sorrow, highlighting the impact he had on the arts sector. Most said his death marks a significant loss to the local arts industry, as he was a passionate advocate for local talent and a key figure in bringing entertainment to Filabusi.\n\nBig Zulu and Kay_Kid Umfanomsotho at a show that had been organised by Farai Taruvinga in Filabusi\n\nNational Arts Council of Zimbabwe (NACZ) Matabeleland South provincial manager Percy Vela, described Fimbo as a dedicated promoter who always followed the proper procedures in his work.\n\nHe was one of the few promoters who sought guidance in his work and ensured his management team adhered to industry standards. As both a businessman and an arts promoter, he brought top-tier artistes to his Insiza North constituency, particularly at Scooter Business Centre. His procedural integrity set him apart, and well dearly miss his support for the arts sector, said Vela.\n\nRising musician, Kay Kid Umfanomsotho, credited Fimbo for providing him with a platform to perform alongside his role model, Big Zulu.\n\nZhezhingtonz and the late Farai Fimbo Taruvinga\n\nLosing someone like him is incredibly painful. He was our promoter in Filabusi and through him, I got the opportunity to meet and share the stage with my role model, Big Zulu. He was a man of his word and always ensured everything was well-organised for artistes, said Kay Kid Umfanomsotho.\n\nFilabusi maskandi musician Blessing Bhankwe, popularly known as Utsheketsha Ogezayo, reflected on how Fimbo played a pivotal role in shaping his career since they met in 2017.\n\nI first met Hon Taruvinga in 2017 in Filabusi. As a Maskandi artiste, I worked with him in entertainment, especially during his campaigns and national gatherings like Independence Day celebrations. Despite language differences, he was a great man, who helped grow my brand. He gave me the opportunity to share the stage with big artistes, and he always treated me as a friend. I will forever miss him, said Utsheketsha Ogezayo.\n\nFellow musician Zhezhingtonz also paid tribute, posting on social media: You left too soon, boss. I am devastated. Rest easy, my boss. Thank you for your support, Mr Fimbo.\n\nThe loss of Farai Taruvinga has left an undeniable void in Zimbabwes music industry, and his contributions to the arts will be remembered for years to come. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dsaas.jpg",
            "description": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub THE Zimbabwean arts community is in mourning following the death of renowned “music promoter”, Farai “Fimbo” Taruvinga. Taruvinga, who was the proprietor of the popular Scooter Joint in Filabusi and the Member of the National Assembly for Insiza North, died on Monday in Bulawayo at the age of 53, […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "Matabeleland North eyes 4pc GDP growth as investments rise",
            "url": "https://www.chronicle.co.zw/matabeleland-north-eyes-4pc-gdp-growth-as-investments-rise/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nMATABELELAND North Province is targeting a four percent growth in its gross domestic product (GDP) this year, up from 3,9 percent in 2024, as it continues to attract promising investments, particularly in the mining sector.\n\nOn Friday, the province held its Provincial Development Committee meeting in Lupane, where various subcommittees presented their reports.\n\nKey topics discussed included value addition and economic development, social development, infrastructure development, management of productive and natural resources and food and nutrition.\n\nMatabeleland North Provinces permanent secretary, Ms Sithandiwe Ncube, said in an interview that all the priority thematic areas of work were drawn from the National Development Strategy.\n\nShe also mentioned that in 2024, the province recorded several significant investments, which are expected to boost its GDP.\n\nWe have seen large companies investing in Matabeleland North, and some that were already established here have expanded their operations, said Ms Ncube.\n\nWe have identified gaps in value addition, and as a province, we need to focus more on that because the investments we have are primarily in extractive industries rather than production. Therefore, we aim to improve in that area.\n\nWeve also realised that we have great potential to increase our exports because we receive a large number of tourists in the province, she added.\n\nOngoing expansion projects in Matabeleland North include the Zhongjin Heli Energy, which is building a coke oven plant and a thermal power station. The project is expected to be completed in the third quarter of 2025. The coke oven plant is 80 percent complete, up from 60 percent in the last quarter of 2024.\n\nAlso, the Kamativi Mining Company completed its second phase of the spodumene concentrate plant in December 2024 and has begun production. Dinson Colliery has completed the groundwork for the fifth and sixth phases of its coke battery expansion, while ZZCCs coke oven plant is now 95 percent complete, up from 90 percent in the fourth quarter of last year.\n\nHowever, despite the investment expansion and growth, some challenges remain, as highlighted by the subcommittees.\n\nThese include high regulatory fees, the intermediated money transfer tax (IMTT) on formal businesses, and value-added tax (VAT) returns due on the 15th of each month, with businesses requesting that the VAT deadline be moved to the 25th of each month.\n\nMs Ncube acknowledged that the province still faces gaps in infrastructure development, but expressed optimism about the efforts of the Second Republic.\n\nWe are grateful for the Governments efforts through the Second Republic led by President ED Mnangagwa to improve infrastructure. We now have the Gwayi-Tshangani Dam, one of the largest dams in the country, and we have been assured that its construction will be completed by the end of the year, said Ms Ncube.\n\nPresident Mnangagwa\n\nWhen the construction is completed, it will be a game changer for the economic development of the province. The master plan is finished, and we are now waiting for approval.\n\nAnother large dam is under construction in Nkayi. According to the Zimbabwe National Water Authority, the reservoir is 81 percent complete.\n\nIt includes an irrigation facility, so we still have gaps in health and education facilities, as well as in irrigation. We are working to increase the area under irrigation, Ms Ncube said.\n\nShe stated that the main priorities for NDS1 and the priority thematic areas include food security, with a focus on ensuring people can produce their own food and sell it, provided water is readily available.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dfgdsf.jpg",
            "description": "Sikhulekelani Moyo, sikhu.moyo@chronicle.co.zw MATABELELAND North Province is targeting a four percent growth in its gross domestic product (GDP) this year, up from 3,9 percent in 2024, as it continues to attract promising investments, particularly in the mining sector. On Friday, the province held its Provincial Development Committee meeting in Lupane, where various subcommittees presented their reports. […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "Shijie Li finally wins Mawegu Amateur",
            "url": "https://www.chronicle.co.zw/shijie-li-finally-wins-mawegu-amateur/",
            "content": "Brandon Moyo\n\nAFTER close misses at the Manicaland Amateur and Matabeleland Amateur Championships in recent weeks, Shijie Li finally managed to claim his first local championship with a comprehensive victory at the 2025 Mashonaland West Golf Union (Mawegu) Amateur, which was held at Norton Golf Club over the weekend.\n\nLi registered an impressive eight-shot victory over Munesu Chimhini to win his maiden title on the domestic circuit. This victory was particularly sweet for Li, who had led early on in two previous tournaments, only to relinquish his advantage and lose the championship.\n\nHe carded an impressive four-under-par 212 after 54 holes of golf, with runner-up Chimhini shooting four-over-par 220 across his three rounds. It was a welcome victory for Li, who had, on two previous occasions, failed to maintain his lead and ultimately lost the championship.\n\nTanaka Chatora finished in third place, shooting seven-over-par 223.\n\nLi had a brilliant start to the tournament, shooting a four-under-par 68 in round one, which saw him take an early lead. He, however, followed his brilliant Saturday morning start with a poor seven-over-par 79 in the second round, also on Saturday.\n\nFollowing a disappointing second round, which left him on an overall three-over-par 147, three shots ahead of second-placed Chatora, Li staged a remarkable third-round performance, shooting a brilliant seven-under-par 65 to complete his dominance and win the title.\n\nChimhini had round scores of 77, 74, and 69, while Chatora carded 72, 78 and 73.\n\nMeanwhile, the Southern Region All Africa Challenge Trophy teed off at Windhoek Country Club and Casino in Namibia on Tuesday.\n\nZimbabwe is one of the five Southern African nations competing for the top honours, which is part of the official regional qualifier for the continental All Africa Challenge Trophy finals. The other four nations are Eswatini, Lesotho, South Africa, and the hosts, Namibia.\n\nNext up on the Zimbabwe Golf Association (ZGA) calendar is the Masvingo Amateur, set for Masvingo Golf Club on April 5 and 6.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cvx-v.jpg",
            "description": "Brandon Moyo AFTER close misses at the Manicaland Amateur and Matabeleland Amateur Championships in recent weeks, Shijie Li finally managed to claim his first local championship with a comprehensive victory at the 2025 Mashonaland West Golf Union (Mawegu) Amateur, which was held at Norton Golf Club over the weekend. Li registered an impressive eight-shot victory […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        },
        {
            "title": "Industrialisation, Economic Development Research Indaba on the cards",
            "url": "https://www.chronicle.co.zw/industrialisation-economic-development-research-indaba-on-the-cards/",
            "content": "Mukudzei Chingwere\n\nTHE Research Council of Zimbabwe (RCZ) is set to make history by hosting the Inaugural Research for Sustainable Industrialisation and Economic Development Indaba on April 23.\n\nThis event will take place at the Zimbabwe International Trade Fair (ZITF) grounds pavilion in Bulawayo, coinciding with the 65th ZITF.\n\nExecutive Secretary of the RCZ Dr Partson Chikudza, announced the Indaba, highlighting its objective to leverage research findings to inform sustainable industrialisation and economic development across the country.\n\nThe Research Council of Zimbabwe is proud to host the Inaugural Research for Sustainable Industrialisation and Economic Development Indaba during the 65th Zimbabwe International Trade Fair, said Dr Chikudza.\n\nThe objective of the Indaba is to promote the utilisation of the research results in informing the countrys sustainable Industrialisation and economic development. There will be experience engaging presentations, valuable networking opportunities and interactive sessions, said Dr Chikudza.\n\nThe event promises a rich agenda featuring engaging presentations from thought leaders in the field as well as valuable networking opportunities for participants.\n\nAttendees will have the chance to partake in interactive sessions designed to foster collaboration and innovation.\n\nThe Indaba is expected to attract a diverse audience, underscoring the critical role of research in driving sustainable development initiatives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/ZITF.jpg",
            "description": "Mukudzei Chingwere THE Research Council of Zimbabwe (RCZ) is set to make history by hosting the Inaugural Research for Sustainable Industrialisation and Economic Development Indaba on April 23. This event will take place at the Zimbabwe International Trade Fair (ZITF) grounds pavilion in Bulawayo, coinciding with the 65th ZITF. Executive Secretary of the RCZ Dr […]",
            "time": "08:28",
            "date": "02 Apr 2025"
        }
    ]
}