{
    "news": [
        {
            "title": "EU hails Zimbabwe for abolishing death penalty",
            "url": "https://www.chronicle.co.zw/eu-hails-zimbabwe-for-abolishing-death-penalty/",
            "content": "Nqobile[emailprotected]\n\nTHE European Union (EU) has commended Zimbabwe for abolishing the death penalty, describing the move as a historic milestone in the protection of human rights, saying there is no compelling evidence to suggest that capital punishment acts as a deterrent to crime.President Mnangagwa last week signed the Death Penalty Abolition Bill into law, officially ending the practice of capital punishment in Zimbabwe. This decision places the country among a growing number of nations worldwide that have chosen to eliminate the death penalty.In a statement, the EU hailed the development as a significant step forward.\n\nThe European Union welcomes the abolition of the death penalty in Zimbabwe. With this historic step, Zimbabwe joins the majority of countries in the world having eliminated capital punishment. Zimbabwe had maintained a moratorium on the death penalty since the last execution in 2005, read part of the statement.The EU said death penalty is incompatible with the fundamental right to life, describing it as a cruel and inhumane punishment that denies human dignity.\n\nThe death penalty is incompatible with the inalienable right to life and a cruel and inhuman punishment, representing an unacceptable denial of human dignity and integrity. No compelling evidence exists to show that it serves as a deterrent to crime, while any miscarriages of justice are irreversible, the statement added\n\nThe European bloc reaffirmed its staunch opposition to the death penalty in all circumstances and pledged to continue advocating for its abolition in countries where it remains in force.Zimbabwes decision to abolish the death penalty is widely regarded as a progressive move that aligns the country with global human rights standards. It underscores a commitment to upholding the sanctity of life and fostering a justice system rooted in rehabilitation rather than retribution.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Mnangagwa-1-680x380.jpg",
            "description": "Nqobile Bhebhe-nqobile.bhebhe@chronicle.co.zw THE European Union (EU) has commended Zimbabwe for abolishing the death penalty, describing the move as a historic milestone in the protection of human rights, saying there is no compelling evidence to suggest that capital punishment acts as a deterrent to crime. President Mnangagwa last week signed the Death Penalty Abolition Bill into […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Beware of flash floods!Heavy rains till Saturday",
            "url": "https://www.chronicle.co.zw/beware-of-flash-floodsheavy-rains-till-saturday/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Meteorological Services Department (MSD) has warned that most parts of the country will experience heavy rains, thunderstorms, and flash floods up to Saturday, urging the public to avoid crossing flooded rivers.\n\nHeavy downpours exceeding 50 millimetres (mm) within 24 hours are anticipated across the country, with meteorologists cautioning that water as shallow as 30 centimetres can sweep away heavy vehicles.\n\nWhile the persistent rains bring hope for farmers and contribute to rising dam levels, they also pose significant risks to communities. In Bulawayo, where residents have been grappling with acute water shortages, many have turned to water harvesting to ease their challenges.\n\nIn an advisory issued yesterday, MSD forecast heavier rainfall from yesterday until Saturday.\n\nMeteorological Services Department\n\nAn abundance of moisture in the atmosphere, brought by a cloud system, has been causing rainfall across the country since late December 2024 and continues into January 2025. Matabeleland North, northern areas of Midlands, Harare Metropolitan, northern parts of Manicaland, and all Mashonaland Provinces are expected to receive scattered thunder showers from 5-8 January 2025, read the statement.\n\nThe MSD said on Wednesday evening, additional moisture from the south-east coast of Southern Africa would result in cloudy, windy, and cold conditions over Matabeleland South, Masvingo, and Manicaland Provinces.\n\nBy Friday, January 10, the rain showers are expected to intensify in the southern parts of Mashonaland West, Mashonaland East, and Harare Metropolitan Provinces, with rainfall exceeding 50mm in 24 hours, the statement continued.\n\nMSD warned of potential flooding, even in areas where heavy rains might not have occurred, as floods could result from rainfall upstream. Violent storms may cause trees to fall, rooftops to be blown off, and billboards to collapse due to strong winds.\n\nNational police spokesperson, Commissioner Paul Nyathi\n\nThe department advised the public to secure rooftops and properties, avoid parking vehicles under trees, refrain from standing under trees or being the tallest object to prevent lightning strikes and avoid using outdoor heavy machinery during storms.\n\nSeveral incidents have already been reported this rainy season. On December 23, a bus crossing the flooded Mletshane River in Gwanda District, Matabeleland South, missed a submerged bridge and was swept away, killing one person, with a three-month-old baby still missing.\n\nLast Friday, two people drowned in Lupane, Matabeleland North, while attempting to cross the flooded Tshangane River.\n\nNational police spokesperson, Commissioner Paul Nyathi, urged the public to adhere to safety measures to prevent further loss of life.\n\nWe encourage parents to be vigilant and ensure children do not play near water bodies, trenches, or rivers, as this poses a drowning risk. Parents should be proactive in ensuring the safety of their children, he said.\n\nComm Nyathi also cautioned motorists against attempting to cross flooded rivers or submerged bridges.\n\nMotorists, cart drivers, and pedestrians must exercise extreme caution. We might be conducting awareness campaigns with stakeholders, but everyone must play their part in ensuring safety during this rainy season, he said. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fgefr.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chroinicle.co.zw THE Meteorological Services Department (MSD) has warned that most parts of the country will experience heavy rains, thunderstorms, and flash floods up to Saturday, urging the public to avoid crossing flooded rivers. Heavy downpours exceeding 50 millimetres (mm) within 24 hours are anticipated across the country, with meteorologists cautioning that water as […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Built with NO storm drains! Rangemore residents grapple with flooding",
            "url": "https://www.chronicle.co.zw/built-with-no-storm-drains-rangemore-residents-grapple-with-flooding/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE heavy downpours that continue to drench Zimbabwe have become both a blessing and a curse for residents of Rangemore suburb in Umguza District on the outskirts of Bulawayo.\n\nResidents are grappling with the dual realities of life-saving rains and the havoc they wreak on their poorly planned settlement.\n\nWhile the rains bring much-needed relief for water supplies and agriculture, they have turned roads into muddy quagmires and left some homes partially submerged, raising concerns about the structural integrity of properties in the area. Rangemore is home to many residents who work or run businesses in Bulawayo. Some students at local tertiary institutions also commute daily to the city, making road access critical. However, the persistent rains have rendered many roads in the sprawling suburb impassable, causing frustration and disruptions.\n\nUmguza RDC Ward 17 Councillor Garikai Godwill Mhazo whose ward covers Rangemore suburb stretching to West Acre along Bulawayo-Plumtree Road, acknowledged the residents plight, citing limited control over some of the affected roads.\n\nMajor roads from Rangemore leading to other suburbs such as Nkulumane and Emganwini are under the jurisdiction of Umguza Rural District Council (RDC), and we consistently maintain those roads, he said.\n\nHowever, smaller roads leading to residents homes are still under the control of land developers or plot owners. Until these roads are officially handed over to the council, there is little we can do.\n\nClr Mhazo said the roads are inaccessible, especially during the rainy season.\n\nWe are aware that residents are not happy with the situation. Umguza RDC will continue to maintain the roads under its control, he said.\n\nFor residents like Mrs Noma Mhlanga, the rains have brought mixed blessings.\n\nThe rains are vital for drinking water and crops, but they also make life difficult. Walking less than half a kilometre to the main road to catch transport to work becomes a nightmare after heavy rains, she said.\n\nHaving lived in Rangemore for seven years, Mrs Mhlanga observed that the situation has worsened with each rainy season.\n\nThe dust road leading to the tarred main road gets so muddy making it almost impossible to walk out of the house, she said.\n\nMr Givemore Muneti, another resident, described how his yard turns into a pool of water during downpours.\n\nThere are no storm-water drainage systems here, so the rainwater has nowhere to flow. Ive resorted to using buckets to collect water from my yard and throw it into the streets, he said.\n\nCllr Mhazo explained that while the council is working on constructing storm-water drainage systems along major roads, the smaller roads remain the responsibility of private developers.\n\nThe challenges faced by Rangemore residents mirror those in other areas, such as Cowdray Parks Hlalani Kuhle/Garikai section, where perennial flooding has forced the Bulawayo City Council (BCC) to take drastic measures.\n\nTo address flooding in Cowdray Park, BCC has identified 17 properties for demolition to make way for a storm-water drainage system. These properties include completed homes, undeveloped stands, and houses at various construction stages. Some of the affected homes are over 15 years old.\n\nAffected residents have expressed frustration, citing a lack of clear communication and concerns over compensation.\n\nUrban flooding is a growing challenge in Zimbabwe, exacerbated by construction in wetlands and floodplains. Impervious surfaces such as roads, parking lots, and buildings prevent rainwater from seeping into the ground, causing even small amounts of rainfall to result in flooding.\n\nFor Rangemore residents like Mr Muneti, the fear of future displacement looms large.\n\nWho knows what will happen in 10 or 20 years? Maybe we will also be told to vacate our homes to make way for storm-water drainage systems, just like the residents of Cowdray Park, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/lack-of-storm-drains-affect-roads5.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com THE heavy downpours that continue to drench Zimbabwe have become both a blessing and a curse for residents of Rangemore suburb in Umguza District on the outskirts of Bulawayo. Residents are grappling with the dual realities of life-saving rains and the havoc they wreak on their poorly planned settlement. While the rains […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "COMMENT: Take heed of flood warnings",
            "url": "https://www.chronicle.co.zw/take-heed-of-flood-warnings/",
            "content": "The prolonged dry spell since November was getting us worried over this farming season.\n\nThe early crop was suffering substantial moisture stress while the southern parts of the country hadnt received any meaningful rainfall. The country actually experienced a two-week heatwave early last month.\n\nMeteorologists had, in August, correctly forecast normal to below-normal rainfall between October to December and normal to above normal rainfall between January and March this year, but, as we broiled, we all forgot that prognosis. We were beginning to lose hope in the performance of the entire season.\n\nThe festive period, however, brought with it heavy rainfall in most of the country, with fears that they may be much heavier this week to cause flooding.\n\nThe falls have settled our nerves and we are now hopeful that what we thought was yet another drought would turn out to be a successful agricultural season. Last summer was a failure  just 635 000 tonnes of maize harvested versus national annual consumption of about 1,8 million tonnes of the staple.\n\nDespite the initial dryness, farmers had, by the end of last week, planted 1,4 million hectares (ha) of maize, 322606ha of traditional grains and 85 000ha of tobacco. Government has a target of producing over 3,2 million tonnes of cereals this season to ensure national food security.\n\nWe continue to pray that the rains will continue falling so that the crop already in the ground regains its shape and thrives so that come March, the country will reap big.\n\nThat wetness should help pastures regenerate as well, particularly in Matabeleland South as well as the southern parts of Masvingo, Manicaland and Midlands provinces.\n\nUnfortunately, the high rainfall such as we are experiencing brings with it some headaches. As field crops and grazing thrive; weeds, diseases and pests do likewise.\n\nAs such, farmers need to be more vigilant against any pest and disease infestation. They must invest more in weed control through application of herbicides and or mechanical and manual weeding. They must ensure that they are well stocked with pesticides as well, to tackle, especially the ravenous armyworm.\n\nFurthermore, farmers have to be on the lookout for January disease. On this score, we know that farmers always need to work well in advance by vaccinating and regularly dipping their cattle right across the year. Those who have been doing this are not worried by this wet spell.\n\nAs we report elsewhere today, the Meteorological Services Department yesterday predicted heavier rainfall until Saturday, with a possibility of flooding. The warning has come early enough thus we hope authorities and the public are vigilant, ready to promptly and appropriately respond if flooding occurs so that lives and property are saved.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ergrt.jpg",
            "description": "The prolonged dry spell since November was getting us worried over this farming season. The early crop was suffering substantial moisture stress while the southern parts of the country hadn’t received any meaningful rainfall. The country actually experienced a two-week heatwave early last month. Meteorologists had, in August, correctly forecast normal to below-normal rainfall between […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Mpilo introduces post-basic nursing diploma for accidents and emergencies",
            "url": "https://www.chronicle.co.zw/mpilo-introduces-post-basic-nursing-diploma-for-accidents-and-emergencies/",
            "content": "Nqobile Tshili,[emailprotected]\n\nMPILO Central Hospital in Bulawayo has launched Zimbabwes first post-basic nursing diploma in accident and emergency management, a pioneering initiative aimed at elevating the handling of accident victims to international standards.\n\nApproved by the Ministry of Health and Child Care last year, the two-year postgraduate programme commenced in September and has already begun equipping nurses with specialised skills to manage emergency cases effectively.\n\nIn an interview, Mpilo Central Hospitals chief medical officer, Dr Narcisius Dzvanga, revealed that the programme is being conducted in partnership with South Africas Wits University, which provides mentorship and support.\n\nHeliDrive Zimbabwe air Ambulance technicians airlift a patient to Parirenyatwa Hospital in Harare from United Bulawayo Hospitals recently\n\nWe have introduced a post-basic nursing diploma in accident and emergency management. Its the first of its kind in the country, with mentorship and support from Wits University in South Africa, in addition to our local mentors, said Dr Dzvanga.\n\nThis two-year programme is not only designed to improve emergency patient care at Mpilo Central Hospital but also across the country. We have recruited staff from all corners of Zimbabwe, and as the number of trained professionals grows, we are confident more lives will be saved, he added.\n\nDr Dzvanga said the hospital seeks to tap into the skills from mentorship from the Wits University which is expected to provide material and human capital training.\n\nThe diploma curriculum includes training in patient management during air transport, aligning with the Governments Air Ambulance initiative launched last year. The service operates six helicopters stationed in Harare, Bulawayo, Victoria Falls, and Manicaland, providing emergency medical support nationwide.\n\nThe air ambulance service was launched in Zimbabwe in August in conjunction with the 44th SADC summit.\n\nThese specialised helicopters are equipped with advanced medical facilities and staffed by trained medical personnel. They are designed to overcome geographical barriers and provide the same level of medical care available in an intensive care unit.\n\nThe Second Republic has embarked on a mission to modernise the countrys healthcare system to achieve the goal of becoming a modern, prosperous, and industrialised country by 2030.\n\nPresident Mnangagwa visited Russia in June to seek investors to establish an air ambulance service.\n\nWith an air ambulance based at United Bulawayo Hospitals and this new diploma, we are better positioned to save more lives. Part of their curriculum is that nurses are learning how to manage patients in the air, said Dr Dzvanga.\n\nIm looking forward to good results. As the programme grows, we aim to increase student intake to meet national needs.\n\nZimbabwe experiences a high frequency of road traffic accidents, with incidents occurring every 15 minutes and five fatalities recorded daily.\n\nDr Dzvanga noted that the programme is critical for equipping medical professionals with advanced skills to handle various types of accidents.\n\nWhile all doctors and nurses have basic training in accident and emergency care, this programme takes it a step further, aligning with international best practices. It prepares our staff to handle any accident, whether its a fall, car crash, or domestic assault, he explained.\n\nThe programme has 20 students, but Dr Dzvanga expressed hope that other central hospitals will adopt similar initiatives to broaden its impact.\n\nThis is just the beginning. Its like planting a seed and you dont expect to harvest your seed immediately. The programme is only a few months old, and students are still in the theoretical phase and are yet to come to the casualty to practise what they are learning, he said.\n\nMy goal is to see two intakes per year and other central hospitals offering this diploma so that we can create a real impact. With only 20 professionals for the entire country, its a drop in the ocean.\n\nDr Dzvanga said expanding the programme is essential to ensure that every corner of Zimbabwe benefits from improved emergency care.\n\nHe said the introduction of the diploma marks a significant step in addressing the countrys emergency healthcare challenges and underscores Mpilo Central Hospitals commitment to enhancing patient outcomes through innovation and collaboration.@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Mpilo-hospital-introduces-trauma-course-6-Jan-1.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw MPILO Central Hospital in Bulawayo has launched Zimbabwe’s first post-basic nursing diploma in accident and emergency management, a pioneering initiative aimed at elevating the handling of accident victims to international standards. Approved by the Ministry of Health and Child Care last year, the two-year postgraduate programme commenced in September and has already […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Zesa boss backs ZPC Hwange:  workers petition board over franchise",
            "url": "https://www.chronicle.co.zw/zesa-boss-backs-zpc-hwange-workers-petition-board-over-franchise/",
            "content": "Lovemore Dube,[emailprotected]\n\nTHE ZPC Hwange Workers Committee has moved in quickly to clear the air on whether their club, winners of the Zifa Southern Region League title will play in the Premiership.\n\nThey, however, seem to have head office backing in their quest to play in the elite division. Last year, the team broke a 35-year jinx when it finished at the top of the standings to make history for itself.\n\nIt became the third team from Matabeleland North to qualify to play in the Premiership since Independence. Before only Hwange sponsored by the Colliery and Tsholotsho have been the provinces flag bearers at that level.\n\nIn the 1970s, when there was a regional First Division under the Rhodesia National Football League, Gwayi River Mine, Kamativi and Wankie played at the highest level.\n\nOn December 24 last year, Xolani Nyoni who is the workers committee chairman and his secretary, Mary Dube in a letter, referenced XN/md/2024, wrote to the companys executive chairman, Sydney Gata, who heads the holding company, Zesa on the matter.\n\nThey wanted to clear the air following reports that Fifa Club Licensing rules would not permit ZPC Hwange to play in the Premiership since there is already another club from the group.\n\nZPC Kariba whom the hydro electric plant in Kariba sponsors are playing in the Premiership.\n\nIt is not the first time two teams from the same organisation play in the Premiership as previously Tenax and Whawha both belonging to Zimbabwe Correctional Services have had a dance in the Premiership as has teams from the Defence Forces, Black Rhinos and Cranborne Barracks.\n\nAt one time there was also Blue Swallows and Chapungu from the Airforce of Zimbabwe. Writing to Gata, the workers committee said theirs was a plea regarding the future of the club.\n\nAs you are aware our beloved team has faced significant hurdles, particularly surrounding Fifa Article 18 of the Fifa Club Lincensing Regulations. This regulation has created barriers that are preventing our team from registering and participating in the PSL. We believe that with your esteemed support, we can legally resolve this impasse and enable our young stars to showcase their talents in the 2025 season.\n\nFor 34 long years, our community has poured its heart and soul into supporting ZPC Hwange Football Club. We have faced failures, but we have never given up. Our team is not just a group of players. It represents hope, pride, entertainment and recreation for Zesa, ZPC and Hwange community. The teams existence is integral to our collective identity and spirit, said the workers in their letter.\n\nZPC Hwange, if allowed to participate, will fill the void left by Hwange FC who were relegated for the umpteenth time.\n\nThe workers said if not allowed to play there would be a devastating effect in the community and clubs spirits and the companys corporate social responsibility.For years, sport and especially soccer has been the number one entertainment activity in the mining and power producing town.\n\nThe thermal power station in the coal mining town has sponsored ZPC Hwange. They implored Gatas office to find a solution to their fears.\n\nWe humbly request your assistance in finding a way, through legal channels, to allow our team to compete in the PSL, for at least one season. This opportunity would allow us to demonstrate just how important this team is to us and how it deeply resonates within our community, said the workers.\n\nGata, in his response on December 30 last year, referred the letter to the organisations Group Legal Advisor and Corporate Secretary for direction in a letter whose reference is SZG/30/12/24. Gata congratulated the team for winning promotion.\n\nI have learnt with utmost pride of the promotion of ZPC Hwange Football Club into the Premier Soccer League after many years of commitment and dedication to the sport.\n\nThe team exemplifies the true Zesa fighting spirit and we hope it will continue to showcase their talents and bring pride to both Zesa and the nation. I kindly request that you engage all relevant stakeholders to explore ways to support the teams aspirations, wrote Gwata in his letter to the legal department.\n\nWith Gatas support the team looks likely to play Premiership football as they can argue that the thermal plant is an entity of its own just like Kariba.Hwange FC are believed to be following proceedings with keen interest hoping to buy the franchise.\n\nFears are that even if the Colliery side buys it, they will still be relegated this season unless they engage in self-introspection and review what has made them the most relegated side.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/Dr-Sydney-Gata.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw THE ZPC Hwange Workers’ Committee has moved in quickly to clear the air on whether their club, winners of the Zifa Southern Region League title will play in the Premiership. They, however, seem to have head office backing in their quest to play in the elite division. Last year, the team broke […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Career guidance event inspires Bulawayo learners",
            "url": "https://www.chronicle.co.zw/career-guidance-event-inspires-bulawayo-learners/",
            "content": "Lesley Chikudo,[emailprotected]\n\nTHE Women Inspired Empowerment Institute (WIEI), in partnership with Lupane State University (LSU), Big Academy, ABMA Education, and the Pan African Leadership Institute, hosted a transformative career guidance event at the Zimbabwe International Exhibition Centre in Bulawayo on Saturday.\n\nThe initiative was aimed at equipping learners from various schools across Bulawayo with the knowledge and skills necessary to navigate their career paths effectively.\n\nThe event attracted a diverse audience, including high school students, educators, and members of the Junior Council, all eager to explore career opportunities and gain insights into thriving in a competitive job market.\n\nThroughout the day, participants engaged in interactive workshops and panel discussions led by industry leaders and career experts. Topics ranged from crafting compelling resumes and mastering interview techniques to understanding the power of networking in career advancement.\n\nWomen Inspired Empowerment Institute\n\nActing Bulawayo provincial police spokesperson Assistant Inspector Nomalanga Msebele who was among the guest speakers, delivered a keynote address, captivating the audience with her insights on community service and its impact on career growth.\n\nLaw enforcement is more than maintaining order; its about serving and protecting our communities. I encourage our youth to consider careers that contribute positively to society, she said.\n\nAsst Insp Msebele also tackled pressing social issues, such as drug abuse and gender-based violence, urging students to take a stand.\n\nAs future leaders, your choices today will shape tomorrow. Stand against violence and substance abuse, and you have the power to make a difference, she said\n\nSpeaking at the event Dr Nothando Moyo, founder of the WIEI, highlighted the importance of such initiatives in inspiring the younger generation.\n\nAssistant Inspector Nomalanga Msebele\n\nOur goal is to empower students with the tools to make informed career choices. With the right guidance, they can pursue their passions and achieve their aspirations, she said.\n\nDr Moyo encouraged students to follow their dreams and avoid succumbing to societal pressures.\n\nIts crucial to choose your own path. Dont let external expectations dictate your journey. Embrace your dreams and pursue them with confidence. Education unlocks doors, and we want our youth to dream big, she said.\n\nDr Thando Ndiweni, a medical professional, shared insights into the evolving nature of the medical field.\n\nIn todays rapidly changing world, we need more doctors, more leaders, and individuals who can think critically and adapt.\n\nIts not just about going to a medical school, its about understanding that you can have an impact no matter where you are, he said.\n\nEntrepreneur Mr Nkosana Mazibisa shared his journey, emphasising the importance of resilience and innovation.\n\nSuccess comes with challenges. Embrace failure as a stepping stone to achieving your dreams, he said.\n\nEngineers from local industries highlighted the growing demand for STEM (science, technology, engineering, and mathematics) careers, urging students to equip themselves with technical skills to drive the economy forward.\n\nLearners expressed their appreciation for the event, noting its value in broadening their career horizons.\n\nThis event opened my eyes to opportunities I hadnt considered before. The workshops were incredibly helpful, and I feel more confident about my future, said Thabo Ngwenya, a learner from a local school.\n\nThe collaboration between educational and leadership institutions underscores a collective commitment to supporting youth in their career journeys.\n\nBy connecting students with industry professionals, the event, not only provided valuable information but also created a platform for meaningful dialogue, ensuring the next generation is equipped to thrive in an ever-evolving job market.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Women-Inspired-Empowerment-Institute-3.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com THE Women Inspired Empowerment Institute (WIEI), in partnership with Lupane State University (LSU), Big Academy, ABMA Education, and the Pan African Leadership Institute, hosted a transformative career guidance event at the Zimbabwe International Exhibition Centre in Bulawayo on Saturday. The initiative was aimed at equipping learners from various schools across Bulawayo with […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Sipho ‘NaZoe’ Mazibuko’s annual cake day continues at Ingutsheni Central Hospital",
            "url": "https://www.chronicle.co.zw/sipho-nazoe-mazibukos-annual-cake-day-continues-at-ingutsheni-central-hospital/",
            "content": "Showbiz Correspondent\n\nTo blend holiday spirit with mental health advocacy, Sipho NaZoe Mazibuko is gearing up for her third Annual Cake Day at St Marys Ward of Ingutsheni Central Hospital.\n\nTomorrow, patients at Zimbabwes largest psychiatric institution will bask in the warmth of community support as they receive a much-needed dose of festive cheer.This initiative is not merely a celebration; its a testament to resilience and recovery, inspired by Mazibukos own journey with bipolar disorder.\n\nFifteen years ago, Mazibuko found herself admitted to St Marys, grappling with the chaos of bipolar disorder  a condition that brings unpredictable shifts in mood, energy, and focus.\n\nToday, she stands as a beacon of hope for others who find themselves in similar circumstances.\n\nThe idea behind this initiative is to help these patients see that being admitted to a mental health hospital isnt the end of the world but rather a detour, she shared in an interview with Chronicle Showbiz. Anyone can bounce back like I did and reclaim their life.\n\nMazibukos commitment to mental health activism stems from her personal experiences, and she embraces her past with pride.\n\nIm not ashamed that I was once admitted to Ingutsheni. Actually, my coming out has inspired a lot of people affected by mental health issues because it can affect anyone; it doesnt choose. This is why Im a proud mental health activist, she affirmed, underscoring the importance of breaking the stigma surrounding mental illness.\n\nSipho Mazibuko\n\nLast year, Mazibuko and her friends donated ten cakes to the patients, a gesture that resonated deeply with those who often feel abandoned and forgotten during the holiday season.\n\nThis year, she aims to enhance the experience by offering beauty therapy sessions, where professional beauticians will pamper patients with manicures and simple hairstyles, adding a touch of joy to their day.\n\nReflecting on her time at Ingutsheni, Mazibuko expressed immense gratitude for the staff who supported her during her lowest moments.\n\nThe hospitality I received here was incredible, and I want to give back to this community that played such a pivotal role in my recovery, she said.\n\nTo ensure that the patients enjoy a festive atmosphere, Mazibuko has partnered with Khaya Arts Productions, a talented ensemble from Tshabalala, promising entertainment that will uplift spirits.\n\nSipho Mazibuko\n\nAdditionally, she plans to invite esteemed guests and the winners of the Miss Rural Matabeleland South Provincial competition, aiming to foster a deeper understanding of mental health issues among young advocates.\n\nIn her heartfelt message to those battling mental disorders, Mazibuko emphasised the importance of seeking help.\n\nI tried all sorts of treatments, including witchdoctors, but nothing worked until I got assistance from Ingutsheni, she recounted. She urges families with loved ones facing mental health challenges to seek professional help, reinforcing the message that recovery is possible.\n\nAs the holiday season unfolds, Mazibuko leaves the patients with a powerful reminder: Never give up on yourself. Its okay not to be okay.Her Annual Cake Day is set to be more than just an event; its a celebration of resilience, a gathering of community spirit, and a reaffirmation that healing is a journey worth taking.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/kiyiu.jpg",
            "description": "Showbiz Correspondent To blend holiday spirit with mental health advocacy, Sipho “NaZoe” Mazibuko is gearing up for her third Annual Cake Day at St Mary’s Ward of Ingutsheni Central Hospital. Tomorrow, patients at Zimbabwe’s largest psychiatric institution will bask in the warmth of community support as they receive a much-needed dose of festive cheer. This […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Tourism sector eyes growth, with comprehensive new strategies",
            "url": "https://www.chronicle.co.zw/tourism-sector-eyes-growth-with-comprehensive-new-strategies/",
            "content": "Leonard Ncube,[emailprotected]\n\nFOLLOWING a successful year highlighted by the approval of a national tourism policy, Zimbabwes tourism and hospitality industry is gearing up to implement robust strategies aimed at boosting arrivals and enhancing the sectors performance in 2025.\n\nTourism, a key economic driver contributing 12 percent to the Gross Domestic Product (GDP), outperformed agriculture and mining in 2024. With Meetings, Incentives, Conferences, and Exhibitions (MICE) tourism anchoring growth, the Ministry of Tourism and Hospitality Industry plans to build on this momentum.Tourism and Hospitality Industry Minister, Barbara Rwodzi, outlined several strategies during a visit to Victoria Falls just before Christmas. Chief among these is an aggressive marketing campaign to position Zimbabwe as a premier travel destination.\n\nThere are a number of strategies, and number one among them is marketing. Roadshows are key for us, and you will see us conducting many in our key markets. We will also increase our presence in international media and build stronger relationships with journalists, she said.\n\nMinister Rwodzi said competitions for journalists will be introduced to encourage coverage of their roadshows, articles and TV features.\n\nMinister Barbara Rwodzi\n\nThe ministry has already deployed tourism attachs to 11 key source markets and plans to send six more in 2025. Locally, tourism officers will be stationed at ports of entry to promote the country as a hospitable, friendly and peaceful destination.\n\nMinister Rwodzi emphasised the importance of participating in international and regional tourism conferences, particularly those with a direct impact on the sectors growth.\n\nOne of the key milestones for the industry in 2024 was hosting the inaugural United Nations Tourism Regional Forum on Gastronomy Tourism for Africa in Victoria Falls in July last year. This event also paved the way for Zimbabwe to host the UN Tourism Gastronomy School, which will be built in Victoria Falls, further solidifying the countrys status as a global tourism destination.\n\nMinister Rwodzi attributed the sectors success to President Mnangagwas engagement and re-engagement policy, as well as the Zimbabwe is Open for Business approach.\n\nThese initiatives have attracted global personalities and celebrities, particularly to Victoria Falls, for both leisure and business.\n\nGovernments Tourism Growth and Recovery Strategy, introduced in 2020 to restore the sector to pre-Covid-19 levels, continues to guide these efforts. The country has attracted key personalities and celebrities from around the world who have visited particularly Victoria Falls for holiday and business.\n\nMinister Rwodzi said her ministry is committed to marketing destination Zimbabwe through all available channels, adding that the Zimbabwe Tourism Authority (ZTA) will intensify efforts to attract more visitors in 2025. @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Barbra-Rwodzi24.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw FOLLOWING a successful year highlighted by the approval of a national tourism policy, Zimbabwe’s tourism and hospitality industry is gearing up to implement robust strategies aimed at boosting arrivals and enhancing the sector’s performance in 2025. Tourism, a key economic driver contributing 12 percent to the Gross Domestic Product (GDP), outperformed agriculture […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        },
        {
            "title": "Bulawayo’s 2025 budget delayed amid tariff controversy",
            "url": "https://www.chronicle.co.zw/bulawayos-2025-budget-delayed-amid-tariff-controversy/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nBULAWAYO ratepayers will have to wait longer for the announcement of the citys 2025 budget after the recently formed budget review committee missed its January 7 deadline.\n\nThe delay has been attributed to the Bulawayo City Councils (BCC) slow progress in providing crucial documents and initially delegating junior staff to the committees first meeting.\n\nThe local authority was compelled to revise its proposed 2025 budget following widespread criticism of its controversial tariff adjustments. The adjustments reportedly stemmed from the council using an incorrect formula to index 2022 and 2023 tariffs to the US dollar.\n\nZimbabwe National Chamber of Commerce (ZNCC)\n\nIn early December, the Ministry of Local Government and Public Works convened a meeting at the council chambers to address concerns raised by the Confederation of Zimbabwe Industries (CZI), the Zimbabwe National Chamber of Commerce (ZNCC), and two major residents associations. The meeting, chaired by the ministrys director of local authorities inspectorate, Ms Priscillar Mudzinge, resolved to establish a budget review committee.\n\nThe committee comprises representatives from industry, residents associations (Bulawayo Residents Association, Bulawayo Progressive Residents Association, and Residents Chapter), tourism players, and tertiary institutions. Chaired by Residents Chapter chairperson Mr Thamsanqa Ndlovu, the committee was tasked with revising the budget within a week and presenting it by January 7.\n\nFollowing a progress review meeting on December 30, 2024, Mr Ndlovu revealed that a technical team of experts in statistics, mathematics, computer science, and accounting had been selected to analyse the councils financials, budgets, and tariffs.\n\nHowever, the councils failure to provide all the requested information hindered the teams work.\n\nDr Martin Rushwaya\n\nAt the special committee progress review meeting on December 30, 2024, the technical team reported that some requested information is still outstanding. Council representative committed to providing the necessary information by December 31, 2024, with the rest on January 6, 2025, said Mr Ndlovu.\n\nDue to the pending information, the technical team wont be able to meet the initial deadline of January 7. A revised target date for completing the review process will be announced once the outstanding information is received.\n\nThe revised budget will reportedly be based on 2017 tariffs.\n\nIn September 2024, BCC presented a US$309 million budget for 2025, focusing on service delivery, gender-specific projects, and revitalising recreational facilities.\n\nHowever, the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, directed the Ministry of Local Government and Public Works not to approve the budget until concerns raised by the business community regarding the 2024 budget were addressed.\n\nMinister Judith Ncube\n\nHe stressed the need for the council to engage with the business community, noting that the concerns raised by CZI were invaluable and required urgent attention.\n\nCZI Matabeleland Chamber accused BCC of using an incorrect formula under Statutory Instrument (51) 1184 of 2022, which mandates indexing goods and services prices to the US dollar and converting them to local currency using the prevailing bank rate.\n\nThis miscalculation led to exorbitant charges, prompting some companies in Bulawayo to reduce operating hours or relocate to other cities.\n\nDespite numerous meetings involving CZI, BCC officials, and Bulawayo Provincial Affairs and Devolution Minister Judith Ncube, no resolution was reached, resulting in a stalemate.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-1-copy-177.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw BULAWAYO ratepayers will have to wait longer for the announcement of the city’s 2025 budget after the recently formed budget review committee missed its January 7 deadline. The delay has been attributed to the Bulawayo City Council’s (BCC) slow progress in providing crucial documents and initially delegating junior staff to the committee’s […]",
            "time": "09:46",
            "date": "06 Jan 2025"
        }
    ]
}