{
    "news": [
        {
            "title": "‘Cabinet calendar a success’: President lauds Government 2024 milestones",
            "url": "https://www.chronicle.co.zw/cabinet-calendar-a-success-president-lauds-government-2024-milestones/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nGovernment has made headway in advancing a people-centred national development agenda through initiating policies and projects that had a great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said. The Head of State and Government said this yesterday at State House while addressing the last Cabinet meeting for this year.\n\nToday marks the last Cabinet Meeting for the 2024 Cabinet Calendar. A synopsis of the business transacted during the year reveals that, as Government, we have made notable headway in our people-centred national development agenda. In this respect, during the course of the year, we crafted, reviewed and implemented impactful policies, programmes as well as projects in our quest to fulfil the collective aspirations of our citizens. In a nutshell, the 2024 Cabinet Calendar was a success, with its robust and frank deliberations, said President Mnangagwa.\n\nThese discussions were facilitated by the greatly improved quality of memoranda submitted to Cabinet. Guided by the principle of collective responsibility, it was pleasing that as Ministers, you rose above your respective sectoral interests, in favour of objectivity and the common national good, with co-ordination being more seamless. Congratulations.\n\nPresident Mnangagwa chronicled several achievements registered during the year in different sectors that include, energy, agriculture and health.\n\nHe said adequate grain continued to be distributed to citizens under the food deficit mitigation programme following the declaration of a State of Disaster for the 2023/2024 Summer Season, due to the El Nino-induced drought.\n\nThe timely delivery of food aid as well as agriculture inputs to our people at the grassroots level must be prioritised while complaints that transport costs are sometimes passed on to our people, must be honestly addressed. I, therefore, challenge the relevant Ministries, Departments and Agencies to apply themselves and device strategies that will increase transport and logistical efficiency in getting aid and support to our people, he said.\n\nOn health, President Mnangagwa commended stakeholders in the sector for implementing multi-pronged intervention measures, which saw the country combat the cholera outbreak during the first half of the year.\n\nHe said mechanisms were in place to deploy the recently approved Multi-Hazard Contingency Plan to curtail the effects of floods and other national disaster emergencies.\n\nI call upon you to provide leadership and assist your communities to mitigate damage and harm to property and life in the wake of the ensuing rainfall season. On the economic front, the revision of economic growth projections, on the back of the El Nino-induced droughts negative impact on agricultural output, was inevitable. However, we remain resolute and optimistic that the fiscal and monetary reforms introduced during the year will increasingly underpin currency stability and usher economic rebound, he said.\n\nTurning to the energy sector, President Mnangagwa said while there was a shortage of power owing to low generation at Kariba Hydropower Station, the improved use and exploitation of renewable energy sources in the country, particularly solar by companies and households, continued to reduce national grid power demand.\n\nThe initiatives by Zesa through new models of Independent Power Producers are welcome moves to crowd in the private sector in power generation, specifically for their respective energy needs. More campaigns should be mounted to encourage our people, in both rural and urban areas to adopt renewable energy for domestic use,\n\nOn housing, President Mnangagwa said the Government will continue to channel resources towards housing delivery, as well as the upgrading and rehabilitation of both residential and institutional accommodation nationwide.\n\nThe strides made by local authorities during the course of the year are commendable. These include the conclusion of Master Plans by most local authorities. There are also glimpses of mindset change within that sector. Regrettably, cases of corruption emanating from the sector remain worrisome. The bold decision by Harare City Council to transfer waste disposal and management to private entities should be supported and replicated in other local authorities. Quality service delivery to our citizens remains the core objective, said President Mnangagwa.\n\nThe decentralisation and devolution agenda, said President Mnangagwa, has led to an improved standard of life and living environments for people with enhanced basic social services infrastructure.\n\nHe said the Government will continue prioritising the digital economy and empowerment of youths, women and small to medium enterprises.\n\nPresident Mnangagwa also called for innovative financing models to accelerate the reconstruction of the Mbare Traders Market following a fire incident that gutted the place recently.\n\nThe digital technology revolution is the cornerstone of modernisation, industrialisation and efficient service delivery to drive sustainable economic growth, he said.\n\nHowever, the digitalisation of Government information and services was occurring at a slow pace, something he said was worrisome. President Mnangagwa implored Ministers to ensure that Government continues to provide service to the public during the Cabinet break.\n\nAs Cabinet takes a well-deserved break, let us take note that we are not shutting down Government business and the subsequent delivery of service. Mechanisms must be put in place to balance the demands of a family and associated festivities with serving the people of our great motherland, Zimbabwe. The service delivery demands of the people of Zimbabwe must be responded to timely. After all, we are a Government by the people and for the people, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfdfdfd-680x380.jpg",
            "description": "Zvamaida Murwira, Harare Bureau Government has made headway in advancing a people-centred national development agenda through initiating policies and projects that had a great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said. The Head of State and Government said this yesterday at State House while addressing the last Cabinet meeting for […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "President lauds Government 2024 milestones…takes swipe at truancy in cabinet",
            "url": "https://www.chronicle.co.zw/president-lauds-government-2024-milestones-takes-swipe-at-truancy-in-cabinet/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nPresident Mnangagwa yesterday slammed some Cabinet Ministers for failing to attend Cabinet meetings and Committees saying they should toe the line or risk appropriate consequences.\n\nHe said it was critical for Cabinet Ministers to realise that Cabinet meetings take precedence over all other businesses they might have. The Head of State and Government said this yesterday while addressing the last Cabinet meeting for the year.\n\nHe said while most Ministers rose above their respective sectoral interests in favour of achieving the common national good, there was a worrisome tendency by some Ministers and senior Government officials who were not attending meetings.\n\nLet me however hasten to emphasise that Cabinet processes are anchored on the timely submission of vital documents and regular attendance by Ministers and officials. These include both ad-hoc as well as standing Cabinet Committees. The worrisome tendency by Ministers and senior officials to absent themselves from meetings is untenable, said President Mnangagwa.\n\nIn some cases, junior officials are delegated to attend and merely warm bench the meetings. This culture is tantamount to dereliction of duty. Permanent Secretaries should ensure that in their absence, only directors and above should attend working party meetings.\n\nHe directed the Chief Secretary in the Office of the President and Cabinet, Dr Martin Rushwaya to monitor Ministers attendance of the meetings.\n\nIn the 2025 calendar year, the Chief Secretary is directed to strictly monitor individual attendance and ensure that errant Ministers and officials toe the line or risk dire consequences. Ministers should remain mindful that Cabinet business takes precedence over all other business, said President Mnangagwa.\n\nHe said Deputy Ministers should be adequately briefed to help them represent the Government when they attend meetings.\n\nIn cases where Deputy Ministers are assigned, they should be adequately capacitated to enable active participation in the requisite deliberations. To this end, I direct that in the 2025 programme cycle and going forward, Deputy Ministers must now sign performance contractors. It is incumbent upon Ministers to ensure that their deputies are comprehensively briefed on Government business and given the latitude for effective involvement, he said.\n\nA few years ago, President Mnangagwa introduced performance contracts for Cabinet Ministers, Permanent Secretaries and heads of parastatals and State entities as a way of encouraging hard work and results oriented workmanship.\n\nHe has also been conferring awards to top-performing Ministers, Permanent Secretaries and heads of Government departments as the Second Republic continues to foster a culture of excellence, work ethic and servant leadership in its quest to attain Vision 2030.\n\nAmong the notable winners were Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka who took first place as the top-performing Cabinet Minister for the second time running.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Cabinet-49.jpg",
            "description": "Zvamaida Murwira, Harare Bureau President Mnangagwa yesterday slammed some Cabinet Ministers for failing to attend Cabinet meetings and Committees saying they should toe the line or risk appropriate consequences. He said it was critical for Cabinet Ministers to realise that Cabinet meetings take precedence over all other businesses they might have. The Head of State […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "Two pedestrians die in road accidents",
            "url": "https://www.chronicle.co.zw/two-pedestrians-die-in-road-accidents/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTWO men were fatally knocked down by vehicles in separate incidents that occurred in Matabeleland South Province.\n\nMatabeleland South provincial police spokesperson, Inspector Loveness Mangena confirmed the incidents, which occurred in Nsindi area in Gwanda District at the 116 km peg along the Bulawayo- Beitbridge Road and near Tshapo Business Centre in Matobo District.\n\nShe said in the first incident Regies Ncube (66) from Tshoboyi Village in Gwanda was cycling along the Bulawayo-Beitbridge Road on Saturday when he was hit by a vehicle.\n\nRegies Ncube was cycling towards Bulawayo while a Honda Fit vehicle was heading towards Beitbridge. The driver of the Honda Fit vehicle drove past a haulage truck that was coming from the opposite lane and came across the now deceased who was attempting to change lanes, said Insp Mangena.\n\nThe driver hit Ncube who fell to the ground and died on the spot. The matter was reported to the police who attended the scene. Ncubes body was taken to the Gwanda Provincial Hospital Mortuary for post-mortem.\n\nInsp Mangena said in another incident, which occurred in Matobo, the victim identified as Ndodana Mloyi (39) died after he was run over by an unidentified driver while on his way from a drinking spree in a suspected hit-and-run.\n\nShe said Mloyi was last seen alive on Saturday evening while drinking at Chapo Business Centre. He was found dead the following day at around 1 pm.\n\nNdodana Mloyi was last seen drinking at Chapo Business Centre in Matobo District on Saturday night. At around 1pm his body was found lying about 100 metres from the business centre. Mloyis body had injuries that indicated that he had been involved in a road accident, said Insp Mangena.\n\nThe matter was reported to the police who attended the scene. Mloyis body was ferried to United Bulawayo Hospitals for post-mortem and investigations are underway.\n\nInsp Mangena said as the festive season approaches, there is an increase in the volume of traffic, especially along major highways. She urged motorists to exercise caution and adhere to road regulations.\n\nInsp Mangena also urged other road users like cyclists and pedestrians to be cautious. She also urged motorists to report whenever they are involved in accidents.As police in Matabeleland South, we urge motorists to adhere to road regulations to preserve life and reduce road accidents. If a motorist hits a pedestrian they should report the matter so that the affected person can receive necessary assistance, she said.  @DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfcsdfdsf.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw TWO men were fatally knocked down by vehicles in separate incidents that occurred in Matabeleland South Province. Matabeleland South provincial police spokesperson, Inspector Loveness Mangena confirmed the incidents, which occurred in Nsindi area in Gwanda District at the 116 km peg along the Bulawayo- Beitbridge Road and near Tshapo Business Centre in […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "SA Amapiano star Aymos to thrill locals with 3-day tour",
            "url": "https://www.chronicle.co.zw/sa-amapiano-star-aymos-to-thrill-locals-with-3-day-tour/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nSOUTH Africa-based Amapiano superstar Aymos, famed for the Izenzo and Fatela hits is set to light up Zimbabwe this weekend with a three-day music tour of Bulawayo, Gwanda and Kwekwe.\n\nThe tour kicks off on Friday at Palace Hotel Gardens in Bulawayo, where Aymos will share the stage with local heavyweights, Uncle Epatan and Young Gemini.\n\nHosted by MC Empire and Mr Jaiva, the night will feature an exciting line-up of wheel spinners, including DJ Keitho, DJ Ayaxx, DJ Tetso and DJ Flexxy, who have all enjoyed a successful year entertaining audiences at the popular venue.\n\nYoung Gemini\n\nOn Saturday, the action moves to the gold-mining town of Gwanda at Phoenix Tshisanyama, where Aymos will headline alongside the Kana Ndanyura hitmaker, Killer T.\n\nKnown for his explosive performances, Killer T is a fan favourite and a strong contender for this years Song of the Year award at numerous musical awards.\n\nAdding a local flavour to the Gwanda show will be rising stars Zagoe Radge and Bry Eze, who are set to represent AmaJahunda. MC Freddy and Rich Flavour will host the event, while DJ Keitho and DJ Virus will provide the beats.\n\nDubbed the 2024 Shutdown Party, the tour wraps up on Sunday in Kwekwe at Magic Box, courtesy of bar and hotel proprietor Tapiwa Gandz Gandiwa.\n\nAymos will be supported by Kae Chaps, Hwindi President, and Uncle Epatan. The DJ line-up includes DJ Skimboh, MC Tiff, DJ Masterpiece, DJ Tylax, DJ Dreazy, and MC Cally Bee.\n\nPalace Entertainment publicist DJ Keitho expressed excitement about closing the year in style with this festive season celebration.\n\nIts been a year where, as an events company, weve managed to host big names across SADC while also promoting local artistes to stardom.\n\nThis weekend, we celebrate the festive season across Matabeleland and Midlands provinces. We call upon people to come in numbers and have a good time with us, said DJ Keitho.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Aymos.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com SOUTH Africa-based Amapiano superstar Aymos, famed for the Izenzo and Fatela hits is set to light up Zimbabwe this weekend with a three-day music tour of Bulawayo, Gwanda and Kwekwe. The tour kicks off on Friday at Palace Hotel Gardens in Bulawayo, where Aymos will share the stage with local heavyweights, Uncle […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "‘Starlink entry to enhance competition in Internet service’",
            "url": "https://www.chronicle.co.zw/starlink-entry-to-enhance-competition-in-internet-service/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE Competition and Tariff Commission of Zimbabwe (CTC) has said the entry of US satellite Internet service company Starlink in the country will ultimately enhance competition in the Internet service provider (ISP) industry.\n\nThe ISP industry is a vital cog in realising growth of the information, communication and technology (ICT) sector as Zimbabwe strives towards becoming an upper middle-income society.\n\nCTC is a statutory body under the Ministry of Industry and Commerce and was established through the Competition Act (Chapter 14:28). Its mandate is to promote and maintain fair competition and trade practices in Zimbabwe. It administers competition policy and law and trade tariffs policies in the country.\n\nStarlinks entry into the countrys ICT sector is expected to help cut the cost of digital and internet services, a critical element of business processes in the digital era.\n\nThis aligns with Government policy on technology and innovation-driven growth. President Mnangagwa is on record saying that innovation, science and technology are part of the strategic pillars that anchor the Second Republics developmental agenda in line with Vision 2030.\n\nA potential game-changer, Starlinks satellite internet service is expected to bring faster, cheaper and uninterrupted connectivity in a revolutionary manner that experts predict could redefine the future of data and digital services in the country.\n\nThe satellite technology is expected to revolutionise various facets of business activity, including marketing and home. In its third quarter newsletter, CTC said there are various benefits arising from competition due to the entrance of Starlink in the provision of Internet access in Zimbabwe for businesses, the Government and the general citizenry.\n\nIt noted that affordability, quality and access are critical in driving innovation and content creation and fostering more opportunities brought through the digital economy.\n\nUltimately, enhanced competition in the ISP industry is a vital cog in realising growth of the ICT sector as Zimbabwe strives towards becoming an upper middle-income society, said CTC.\n\nIt added that competition also drives ISPs to adopt the latest technology and innovations to differentiate their services, leading to better products such as fibre-optic connections, Long Term Evolution (LTE), 5G mobile networks and satellite services.\n\nThe entry of a new player, Starlink ushers in competition in this sector likely to lower prices thus promoting overall ICT sector growth. Increased competition often leads to lower prices as ISPs strive to attract the patronage of customers, said CTC.\n\nThis is crucial in a country like Zimbabwe, where high internet costs tend to be a barrier to widespread access. ISPs can offer a variety of packages targeting different income groups, allowing more people to afford internet access, especially in under-served rural areas.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/starlink.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw THE Competition and Tariff Commission of Zimbabwe (CTC) has said the entry of US satellite Internet service company Starlink in the country will ultimately enhance competition in the Internet service provider (ISP) industry. The ISP industry is a vital cog in realising growth of the information, communication and technology (ICT) sector as […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "COMMENT: Busting of smugglers must be intensified and be made permanent",
            "url": "https://www.chronicle.co.zw/comment-busting-of-smugglers-must-be-intensified-and-be-made-permanent/",
            "content": "SMUGGLING of goods into and out of our country is an immense challenge that authorities have been grappling with for a long time.\n\nIt is a serious criminal offence, which prejudices the economy of millions in potential tax revenue. In the case of smuggling out of the country, the crime prejudices the economy of foreign currency as well since someone who illegally sells goods and services abroad will naturally not declare their earnings to the Zimbabwe Revenue Authority (Zimra).\n\nThe crime can have health implications as well, for without Government oversight, traders can bring expired and substandard products into the country. Informal outlets selling mainly foreign foodstuffs have been exposed as among the biggest actors in the racket.\n\nThis is an old, pervasive problem, which we had normalised in the country. As promised in the proposed 2025 national budget, presented early this month, the Government has launched a crackdown against smuggling and sale of smuggled goods in the country.\n\nZimra has been stricter at the borders, its officials demanding documentation that items being brought into the country were legitimately secured and asking the importers to pay duty.\n\nThe revenue authority, together with its partners, which include police, Reserve Bank of Zimbabwe, Consumer Protection Commission officials and others are mounting roadblocks to verify if goods being moved around were legally imported with all relevant taxes paid.\n\nAs we reported yesterday, the clampdown has seen the law enforcement partnership door-stepping some outlets in towns and cities across the country. Some have been closed after being caught on the wrong side of the law.\n\nThis campaign is welcome and must be intensified and be made permanent if the economy is to defeat this malaise that is enriching criminals while adversely affecting local producers of the goods and services in question and prejudicing the economy.\n\nBut the clampdown must be strongest at border posts and across the countrys border with South Africa, Botswana and Mozambique, which are known to be the biggest sources of the contraband that is on the local market. The police, army, Zimra and their partners must tighten security at the border posts and the borders to prevent smuggling.\n\nIf security at the borders is as foolproof as it should be, there is no way any outlet in Bulawayo, Harare, Masvingo, Gweru and other markets would sell smuggled items simply because no one has the chance to smuggle them.\n\nAny business or individual that attempts to continue flouting the law must be severely punished.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/smuggled-goods.jpg",
            "description": "SMUGGLING of goods into and out of our country is an immense challenge that authorities have been grappling with for a long time. It is a serious criminal offence, which prejudices the economy of millions in potential tax revenue. In the case of smuggling out of the country, the crime prejudices the economy of foreign […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "Power outage cripples  businesses in Bulawayo CBD",
            "url": "https://www.chronicle.co.zw/power-outage-cripples-businesses-in-bulawayo-cbd/",
            "content": "Peter Matika,[emailprotected]\n\nSEVERAL businesses in Bulawayos central business district (CBD) have been forced to suspend operations due to a prolonged power outage caused by a technical fault on the Zesa network.\n\nThe outage, which had not been fixed by late yesterday since it started on Saturday morning, has disrupted operations for businesses such as fresh produce stores, butcheries, and fast food outlets, while also affecting residents in nearby residential flats.\n\nThe power cut has caught many establishments off guard, forcing them to close early and incur significant losses. I was right in the middle of serving customers when the lights went out, said a waitress at a popular city eatery.\n\nIt was chaotic for a few minutes, and we had to turn people away. Its frustrating, especially on a Saturday when we usually have a good crowd.\n\nRestaurants, nightclubs, and retail stores have been particularly hard hit, with some resorting to alternative power sources such as solar and fuel-powered generatorssolutions that are proving costly.\n\nSome eateries have resorted to using charcoal and wood to cook meals in makeshift kitchens set up in their backyards.\n\nFor those who buy in bulk, this is a catastrophe. Where are they going to store large amounts of meat and other perishables? This is a serious setback, lamented a business owner.\n\nBuying ice to keep meat cool is also very costly, especially with the high temperatures. The ice melts quickly, and we have to constantly clean the freezers to avoid damage.\n\nThe outage has also impacted residents in the CBD. A local soccer fan expressed his disappointment after missing out on his usual match-day experience.I wanted to watch the soccer game at my favourite sports bar, but the beer was warm, and the streets were dark. I opted to watch it from home instead, he said.\n\nThe disruption has raised concerns among business owners, particularly with the festive season approachinga critical period for sales and revenue generation.We depend on weekends to boost our sales, and losing a whole morning is tough. We just hope this doesnt become a regular occurrence, said another business owner.\n\nThe affected businesses urged Zesa to prioritise maintenance and upgrade the network to prevent similar disruptions in the future, particularly during peak trading seasons.\n\nIn a statement, the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) attributed the power outage to multiple underground cable faults at various locations in the CBD.\n\nZETDC said its technicians and engineers are working to restore power to affected areas.\n\nWe have multiple underground cable faults in the CBD. One part of the faulty area was identified, repaired, restored yesterday and some of the clients that were affected have had power restored, read the statement.\n\nCurrently we are carrying out fault location on the last part of the cable and expect to have completed all works latest on Friday. Any inconvenience caused by this outage is sincerely regretted.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/04/ZESAQ.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw SEVERAL businesses in Bulawayo’s central business district (CBD) have been forced to suspend operations due to a prolonged power outage caused by a technical fault on the Zesa network. The outage, which had not been fixed by late yesterday since it started on Saturday morning, has disrupted operations for businesses such as […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "Kweza, Machana & Magaya flagged",
            "url": "https://www.chronicle.co.zw/kweza-machana-magaya-flagged/",
            "content": "Zimpapers Sports Hub\n\nZIFAs watershed elections may be just over a month away from being staged but the build-up to the polls to elect a new substantive president for the football association has become a nasty and ugly battlefield characterised by smear campaigns on some presidential aspirants.\n\nIn what appears a war of attrition, the trio of Northern Region Soccer League chairman Martin Kweza, Yadah Stars club president Prophet Walter Magaya and ex-Zifa board member finance Philemon Machana have had their legitimacy to contest being challenged by three members of the public.\n\nThe challenges are contained in letters that were on Monday written to Zifa and copied to the Sports and Recreation Commission board.\n\nPhilemon Machana\n\nThe trio Terrance Pachirere, one MJ Chigwedere and a K Mugadzaweta wrote separately to Zifas Normalisation Committee headed by Lincoln Mutasa protesting against the bids by Kweza, Magaya and Machana.\n\nThey want the three administrators barred from contesting because of allegations of a criminal nature which they cited in their letters.\n\nAfter accepting the nominations, the Normalisation Committee, sitting as the Zifa electoral committee, are forwarding the names of the aspirants to the Ethics and Integrity Committee.\n\nThe Ethics and Integrity Committee, chaired by former Harare Mayor Muchadeyi Masunda, an attorney and international arbitrator with extensive experience in business, corporate law and governance, is expected to announce on December 23, those who would have passed to be candidates for the Zifa elections.\n\nBut before Masundas committee has finalised their list Pachirere, Chigwedere and Mugadzaweta have lodged their objections against Kweza, Magaya and Machana.\n\nThe issues were raised on Monday by stakeholders who wrote to Zifa and the Sport and Recreation Commission detailing the concluded and pending criminal and civil cases against the trio. There are case numbers and court records to buttress the matter.\n\nPachirere, sensationally claimed that Kweza, an employee of the Zimbabwe National Water Authority (Zinwa) was facing criminal, ethical and legal charges at his workplace.\n\nA report of work-related criminal abuse of office was lodged against Martin Kweza at the Zimbabwe Anti-Corruption Commission (Zacc) under reference HRC82/01/24 (January 2024), wrote Pachirere.\n\nAnother fraud complaint was filed against him at Zacc under reference RRB31/07/24 (July 2024) by Engineer T Maurukira, the Chief Executive Officer of the Zimbabwe National Water Authority (Zinwa), where Martin Kweza is employed.\n\nMartin Kweza\n\nThese on-going investigations raise serious questions about Martin Kwezas ethical standing and suitability for a leadership position. I trust the Committee will act in the best interest of the sport and ensure that only candidates of the highest ethical standing are permitted to contest.\n\nPachicheres bid, however immediately hit a snag yesterday with Zinwa CEO Engineer Taurai Maurukira dismissing the claims as malicious and fraudulent.\n\nTo say that I have lodged a complaint against Mr Kweza to Zacc is not only factually incorrect but also malicious and as Zinwa we have our systems of dealing with risk management which are actually complementary to Zacc and if there is a case at Zacc I am not aware of it as I have never authored any complaint against Mr. Kweza, said Maurukira.\n\nThe Zinwa boss then wrote to Masundas committee disowning Pachireres claims which had been widely circulated on social media platforms.\n\n. . . Reference is made to the above subject matter and a letter dated 16 December 2024 which has been widely circulated via social media and that inter alia alleges that I, as the Zinwa CEO, lodged a fraud complaint against Mr Kweza in July 2024 under reference RRB31/07/24.\n\nI wish to categorically state that I did not lodge a fraud complaint with Zacc against Mr Kweza as alleged or at all. This is factually incorrect and downright malicious.\n\nI trust that you will find this in order, wrote Maurukira.\n\nIn the claims against Magaya, which the football-mad Prophets camp has dismissed as a calculated ploy to soil his image while trying to influence the Ethics Committee, Chigwedere cited a number of civil and criminal cases which he alleged cast a shadow on his suitability to lead Zifa.\n\nHe said Magaya either had some previous convictions or pending cases against him, which warrant disqualification from the race.\n\nUnder case number CRB1848/19, PPs Ref 1695/19, Magaya is facing charges under Section 81 of the Income Tax Act for alleged tax violations. This matter is pending trial at the Rotten Row Magistrates Court and is scheduled for 21 January 2024 (sic), wrote Chigwedere.\n\nChigwedere added that Magaya was in 2018 convicted for violating the Medicines Control Act recorded under case number (CRB13219/18).\n\nMugadzaweta argued that Machana should be the thrown out of the race on accusations of misuse of Zifa funds as captured in a forensic audit conducted by BDO on the financial operations of Zifa.\n\nThe audit revealed that Zifa transferred $740,270 out of a $749,996 Fifa grant into an account owned and controlled by Conduit Investments, a company where Mr Machana is both a shareholder and director.\n\nThis transaction was in contravention of Fifa and Zifa statutes. Conduit Investments also received $25600 under the guise of a loan repayment.\n\nHowever, no loan agreements or supporting documents were provided to justify these payments or explain how the funds were utilised, he said.\n\nMachanas camp dismissed Mugadzawetas assertions as frivolously and unnecessary mudslinging that is unsporting and against the spirit of Fair Play.\n\nThe former Zifa finance guru was, together with some of his colleagues from the previous board recently acquitted by the Harare Magistrates Court of various charges some of which are related to those raised in the letter in question.\n\nMugadzaweta claimed that Machana had during his time in Zifa, failed to disclose his financial interests in Conduit Investments, violating principles of transparency and good governance.\n\nAmid the mudslinging which so far seems to have aimed at the perceived front-running trio of Kweza, Machana and Magaya, Normalisation Committees legal brains Nyasha Sanyamandwe gave some clarification on how they are going about the elections business.\n\nShe said they would follow the Zifa disciplinary and ethics code to come out with a determination about the elimination of candidates.\n\nAs Zifa, we have got the disciplinary and ethics code that we have and we have since put it in the nomination forms where candidates should declare that they have not been convicted of any offense. The answer that we wanted from that nomination form is a yes or a no. If its a yes, then a bit of notes to at least qualify what certain offences you were convicted of, said Sanyamandwe.\n\nThe ethics code will guide us but we also need to be guided by Art: 24 Para 8 of the Zifa statutes which talks about the bodies of Zifa and how they need not to be convicted of offences compatible with the positions that they are running for.\n\nSo, we will look into those offences and also in our criminal jurisprudence, we know there are minor and major offences, a road traffic accident surely will not stop someone from running for the election.\n\nThe Ethics committee will also assist us in completing that eligibility test for criminal or interpreting the ethics code, said Sanyamandwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Walter-Magaya.jpg",
            "description": "Zimpapers Sports Hub ZIFA’s watershed elections may be just over a month away from being staged but the build-up to the polls to elect a new substantive president for the football association has become a nasty and ugly battlefield characterised by smear campaigns on some presidential aspirants. In what appears a war of attrition, the […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "Rain washes out Chevrons-Afghanistan first ODI",
            "url": "https://www.chronicle.co.zw/rain-washes-out-chevrons-afghanistan-first-odi/",
            "content": "Zimpapers Sports Hub\n\nRAIN played spoilsport as the opening ODI between Afghanistan and Zimbabwe was called off after just 9.2 overs of play with the latter on 44/5.\n\nEarlier, persistent rain had delayed the start by close to four hours with the game reduced to a 28-overs-a-side affair. When the weather finally cleared, Afghanistan captain Hashmatullah Shahidi had no hesitation to bowl considering the overhead conditions.\n\nFor Afghanistan, Rahmanullah Gurbaz was ruled out of the series due to a Grade 2B quadriceps injury along with a bony hip flexor injury, while Mujeeb Ur Rahman was rested from the series.\n\nZimbabwe, meanwhile, handed debuts to left-hand batter Ben Curran and left-arm seamer Newman Nyamhuri.\n\nUmpires inspect the pitch at Harare Sports Club before the first ODI between Zimbabwe and Afghanistan was called off\n\nShahidis decision to field was vindicated with both Azmatullah Omarzai and Fazalhaq Farooqi getting oodles of movement both off the pitch and in the air.\n\nIt was a tough initiation for Curran, who was beaten by Farooqis away movement in the opening over. He got off the mark in international cricket with a clip to deep fine leg, but batting was always going to remain a task.\n\nTadiwanashe Marumani got Zimbabwes boundary counter running with a neat cover drive off Farooqi but was undone by a peach of an in-dipper from Omarzai that saw his middle pole flattened.\n\nBrian Bennett, the highest run-scorer in the preceding T20I series, then fell first ball to Omarzai with Mohammad Nabi holding onto a sharp chance to his right at second slip.\n\nDion Myers got a couple of drives away but was trapped in front of the stumps when he misread a Azmatullah Ghazanfar carrom ball and stayed back.\n\nOmarzai then removed Curran in the eighth over, who went for a flashing drive, only to get a thick outside edge through to the wicketkeeper.\n\nThree balls later, it was Sean Williams turn to depart. He hung his bat out to a fuller-length ball from Omarzai only to get a thick edge to Ikram Alikhil.\n\nThe floodlights were switched on right from the start and once rain arrived two balls into the ninth over, it was curtains for the game.\n\nEven in his short burst, Omarzai left a mark picking four for 18 off his four overs. The second ODI will be played at the same venue on Thursday.  ESPNCricinfo\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Zimbabwe-captain-Craig-Ervine-and-Sikandar-Raza-walk-off-the-field-after-the-first-ODI-against-Afghanistan-was-called-off-due-to.jpg",
            "description": "Zimpapers Sports Hub RAIN played spoilsport as the opening ODI between Afghanistan and Zimbabwe was called off after just 9.2 overs of play with the latter on 44/5. Earlier, persistent rain had delayed the start by close to four hours with the game reduced to a 28-overs-a-side affair. When the weather finally cleared, Afghanistan captain […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        },
        {
            "title": "Use ICTs to boost production: President",
            "url": "https://www.chronicle.co.zw/use-icts-to-boost-production-president/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nYOUNG people should take advantage of disruptive technologies as these will increase production and productivity across all sectors of the economy, President Mnangagwa has said.\n\nDisruptive technologies are innovations that significantly change the way businesses, industries and consumers operate.\n\nIn a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri at the Third Jobs for Young People and Women, Nyika Inovakwa Nevene Vayo, yesterday, President Mnangagwa said young people and women needed to be equipped with requisite skills to harness new technologies.\n\nAfrica was projected to be home to 42 percent of the worlds youth population by 2030, a demographic shift that the President said would reshape global market dynamics by 2050, positioning Africa as home to the worlds youngest workforce and a major marketplace for consumer goods and technology.\n\nIn this regard, our young people and women must be equipped with skills to make use of disruptive technologies brought about by technological advancements taking place day-by-day, globally. If our people can use disruptive technology to their advantage, our productivity as a nation will increase and so will our competitiveness.\n\nPresident Mnangagwa said the Second Republic was leaving no stone unturned in empowering young people and women through education and skills development so that the people could continue to compete and seize opportunities availed to them locally, regionally and globally.\n\nUnder our heritage-based Education 5.0 policy, my Government is fostering a system that empowers our learners to produce goods and services through the use of science, technology and innovation.\n\nSkills development should translate into more made in Zimbabwe goods on shop shelves as well as an increase in exports to regional and international markets.President Mnangagwa reiterated the philosophy, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nI challenge line ministries, departments and agencies, including the Ministry of Skills Audit and Development, the Vision 2030 Movement, development partners and other stakeholders to continue and intensify efforts in identifying skills shortages, mismatches and gaps in all sectors of the economy.\n\nThis skills gap presents both a challenge and an opportunity. For individuals, it entails taking proactive steps to upskill and reskill, making themselves indispensable in a competitive job market. For employers, it demands investing in the continuous skills development of their workforce to ensure they have the talent they need to succeed.\n\nWe should, thus, start witnessing the twining of our learning institutions with industry to ensure that industry and entrepreneurship ready graduates are produced by our institutions of education and training, said President Mnangagwa.\n\nGovernment entities, businesses and educational institutions should collaborate and form partnerships to develop inclusive policies. This would help young people to enhance and scout for work-based learning opportunities as well as advocate increased access to internships, apprenticeships and practical training for youth and women, said the President.\n\nThe conference ran under the theme, Aligning education with industry: Bridging the skills gap for the attainment of Vision 2030s goal of an upper middle income economy status.\n\nPresident Mnangagwa said the theme was in line with his Governments policy on youth and women empowerment through skills development and innovation, enabling them to thrive in a competitive job market and contribute to the sustainable socio-economic development of the country.\n\nThe theme also dovetailed with the African Union theme of the Year 2024, Educate and Skill Africa for the 21st Century.\n\nAdded the President: It further advances Sustainable Development Goals Eight and One, which focus on promoting decent work and fostering economic growth, ending poverty as well as achieving gender equity.\n\nPresident Mnangagwa commended the Vision 2030 Movement for spearheading initiatives that champion the development of leadership and skills among the youth and women.\n\nThe world of work, under the Fourth Industrial Revolution, is undergoing seismic shifts. Automation and artificial intelligence are transforming industries, rendering some jobs obsolete, while creating entirely new types of modern career fields.\n\nAs such, employers are increasingly looking for youth who are flexible, adaptable, proactive, creative and collaborative. These profound global changes in the use of technology and the nature of work, make development of the right skills a necessity, instead of an option.\n\nThis prepares the youth for the labour market through constantly learning and adapting, as well as acquiring new skills that align with the evolving needs of the job market, he said.\n\nThe Second Republic was committed to enhancing research and development initiatives to ensure that new goods and services were delivered, and production costs were reduced.\n\nGoing into the future, the Second Republic planned to continue investing in policies and programmes, which capacitated young people with the requisite skills for success in the ever-evolving global labour marketplace through future-ready skills and addressing how skilling could be scaled up.\n\nPresident Mnangagwa said it was essential that the nation prioritised collaborations and partnerships through working together to create a cohesive and effective skills development ecosystem.\n\nLet me reiterate that it is our collective duty to contribute towards the socio-economic development of our nation. Real growth will be achieved if we all participate in activities that promote social cohesion and economic growth, thereby improving the standards of living for all in line with our mantra of Leaving no one and no place behind, he said.\n\nSkills Audit and Development Minister, Professor Paul Mavima, said the development of skills was central to the achievement of Vision 2030.\n\nWe were formed following the wisdom of His Excellency the President who realised that the development of skills and competencies is central to the achievement of national aspirations.\n\nIn this particular case to the achievement of Vision 2030. Anywhere in the world, people are embracing the understanding that as we do general education it is actually the skills and competencies that educational architecture builds that lead to transformation, economic development, social development of a nation, he said.\n\nVision 2030 Movement chairperson Mr Paul Mavima Junior said the youth were indeed a vital cog in the continued development of the country.\n\nWe share a common goal of the establishment of an egalitarian society within our motherland Zimbabwe.\n\nWe share a common goal of seeing that the leadership of Zimbabwe succeeds, because we owe it to the generation that came before us, we owe it to the generation that is going to come after us, to say that in our time as young people, what exactly did we do? In our time as young people, what did we offer ourselves to Zimbabwe to do?\n\nI believe it is now our duty as a generation that is economically active now, to say that we are going to emancipate Zimbabwe, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgfgfgfgfgfgfg.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau YOUNG people should take advantage of disruptive technologies as these will increase production and productivity across all sectors of the economy, President Mnangagwa has said. Disruptive technologies are innovations that significantly change the way businesses, industries and consumers operate. In a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri […]",
            "time": "06:39",
            "date": "18 Dec 2024"
        }
    ]
}