{
    "news": [
        {
            "title": "Transmission West win ZITF Ingwebu Tug Of War National Championships",
            "url": "https://www.chronicle.co.zw/transmission-west-win-zitf-ingwebu-tug-of-war-national-championships/",
            "content": "Innocent Kurira ,Zimpapers Sports Hub\n\nTRANSMISSION West from Bulawayo are this years men winners of the Zimbabwe International Trade Fair Ingwebu Tug of War National Championships after a 2-0 victory over Zesa Holdings.\n\nAfter seeing off Bulawayo Metro 2-0 at the semifinal stage, Transmission West made light work of Zesa Holdings in the final with the contest lasting just a few minutes.\n\nA lot was expected from Mutare Board and Paper Mills who were the defending champions but they were knocked out at the semifinal stage by Zesa Holdings who won 2-0.\n\nIn the womens category, Glow A defended their title with a 2-0 victory over Glow B.\n\nOn their way to the final they knocked out Ingwebu with a 2-0 victory.\n\nThe other semifal pitted Glow B and BCC and Glow B won 2-0.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-26-at-5.34.03-PM-680x380.jpeg",
            "description": "Innocent Kurira ,Zimpapers Sports Hub TRANSMISSION West from Bulawayo are this year’s men winners of the Zimbabwe International Trade Fair Ingwebu Tug of War National Championships after a 2-0 victory over Zesa Holdings. After seeing off Bulawayo Metro 2-0 at the semifinal stage, Transmission West made light work of Zesa Holdings in the final with […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "Minister lauds Bulawayo for supporting successful ZITF showcase",
            "url": "https://www.chronicle.co.zw/minister-lauds-bulawayo-for-supporting-successful-zitf-showcase/",
            "content": "Judith Phiri,Business Reporter\n\nBULAWAYO Provincial Affairs and Devolution Minister Judith Ncube, has commended residents for turning out in large numbers and contributing to the success of the countrys flagship trade event, the Zimbabwe International Trade Fair (ZITF).We witnessed that the people of Bulawayo came out in their numbers to support this wonderful trade showcase, which was a resounding success. They showed great respect to visitors from other cities, the region and the international community, said Minister Ncube\n\nShe said ZITF continues to be a key driver of business for the city, with various sectors benefiting through the provision of goods and services. The Minister said the influx of visitors during the trade fair gave a significant boost to the citys economy, contributing positively to the provinces gross domestic product (GDP).Visitors also take the opportunity to explore tourism and entertainment attractions in and around Bulawayo. As we are known as the City of Kings and Queens, the people of Bulawayo embraced our visitors warmly, reflecting our rich culture of hospitality and togetherness, she said.\n\nMinister Ncube also noted that Bulawayo and Zimbabwe as a whole remain peaceful and friendly destinations, adding that it was pleasing that no incidents were reported during the ZITF.\n\nShe said the successful hosting of ZITF 2025 not only strengthens Bulawayos economic prospects but also places Zimbabwe firmly on the global map, gaining widespread recognition.Minister Ncube said the trade showcase created opportunities for individuals and investors to identify and explore various business prospects in Bulawayo and across the country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-26-at-4.04.50-PM.jpeg",
            "description": "Judith Phiri ,Business Reporter BULAWAYO Provincial Affairs and Devolution Minister Judith Ncube, has commended residents for turning out in large numbers and contributing to the success of the country’s flagship trade event, the Zimbabwe International Trade Fair (ZITF). “We witnessed that the people of Bulawayo came out in their numbers to support this wonderful trade […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "Varevi Claims Fourth Consecutive Four-Minute Mile Title at ZITF",
            "url": "https://www.chronicle.co.zw/varevi-claims-fourth-consecutive-four-minute-mile-title-at-zitf/",
            "content": "Innocent Kurira ,Zimpapers Sports Hub\n\nBLACK Rhinos middle-distance runner Wellington Varevi continued his dominance at the Coca-Cola Four-Minute Mile Challenge, winning the race for the fourth consecutive year at the ZITF Conference Centre main arena on Saturday afternoon.\n\nThe annual event, held on the last day of the Zimbabwe International Trade Fair, drew a competitive field of 19 athletes and an enthusiastic crowd.\n\nVarevi clocked a time of 4 minutes 28.81 seconds slightly slower than his 2024 winning time of 4:21.38 but enough to secure yet another victory and reinforce his status as a powerhouse in middle-distance running.\n\nElijah Mabhunu finished second with a time of 4:23.79, while Munyaradzi Zizhou came in third, crossing the line at 4:21.31.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-26-at-1.01.05-PM-680x380.jpeg",
            "description": "Innocent Kurira ,Zimpapers Sports Hub BLACK Rhinos middle-distance runner Wellington Varevi continued his dominance at the Coca-Cola Four-Minute Mile Challenge, winning the race for the fourth consecutive year at the ZITF Conference Centre main arena on Saturday afternoon. The annual event, held on the last day of the Zimbabwe International Trade Fair, drew a competitive […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "Corporates pull out all stops to captivate attendees on ZITF’s last day",
            "url": "https://www.chronicle.co.zw/corporates-pull-out-all-stops-to-captivate-attendees-on-zitfs-last-day/",
            "content": "Rutendo Nyeve ,Online Reporter\n\nTHE 65th edition of the Zimbabwe International Trade Fair (ZITF) has entered its final day, crackling with an electrifying atmosphere as corporates pull out all stops to captivate attendees with promotional shows outside their stands.\n\nFinancial service providers, funeral service providers and network service providers are some of the corporates that are running various promotional shows, marketing their products and services.\n\nTo further captivate and attract people, the companies have incorporated photo booths and costumed performers.\n\nVarious competitions are also being conducted with prizes being awarded.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ffghh.jpg",
            "description": "Rutendo Nyeve ,Online Reporter THE 65th edition of the Zimbabwe International Trade Fair (ZITF) has entered its final day, crackling with an electrifying atmosphere as corporates pull out all stops to captivate attendees with promotional shows outside their stands. Financial service providers, funeral service providers and network service providers are some of the corporates that […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "Internet Governance boot camp set for Solusi",
            "url": "https://www.chronicle.co.zw/internet-governance-boot-camp-set-for-solusi/",
            "content": "Amos Mpofu\n\nThe Internet Society Zimbabwe Chapter (ISOC-ZW) will in May, be hosting a School of Internet Governance Boot camp at Solusi University in a bid to strengthen internet governance in Zimbabwe.The boot camp will be held from 1 to 2 May 2025.\n\nThe initiative follows an earlier online training phase and is themed: Empowering the Underserved, Minority, Youth and Women in Shaping Internet Governance in Zimbabwe.In an interview, the Head of Policy and Governance for ISOC-ZW Mrs Charity Ncube, said this boot camp represents the second phase of the programme.\n\nParticipants were initially awarded fellowships to undertake an online course in internet governance. Upon successful completion, a selection was made for those eligible to attend this physical boot camp, she said.The in-person session will bring together individuals from marginalised communities, including women and youth, to deepen their understanding of their critical role in shaping Zimbabwes digital future.\n\nThe boot camp will cover pressing issues such as universal internet access, affordable connectivity, and the adoption of emerging technologies, including Artificial Intelligence, Blockchain, the Internet of Things, green and smart computing, and cybersecurity.We aim to equip these participants to actively contribute to the development of internet-related policies in Zimbabwe. We see them as future champions who will carry their voices to national and international platforms such as the Internet Governance Forum, Mrs Ncube said.\n\nThe boot camp aims to show ISOC-ZWs commitment to inclusive participation in digital policy-making, ensuring that no voice is left behind in the conversation about Zimbabwes technological development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-26-at-12.23.45-PM-540x380.jpeg",
            "description": "Amos Mpofu The Internet Society Zimbabwe Chapter (ISOC-ZW) will in May, be hosting a School of Internet Governance Boot camp at Solusi University in a bid to strengthen internet governance in Zimbabwe. The boot camp will be held from 1 to 2 May 2025. The initiative follows an earlier online training phase and is themed: […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "All Set for Coca-Cola ZITF Four Minute Mile Final on Saturday",
            "url": "https://www.chronicle.co.zw/all-set-for-coca-cola-zitf-four-minute-mile-final-on-saturday/",
            "content": "Innocent Kurira ,Zimpapers Sports Hub\n\nNINETEEN athletes are set to compete in the final of the Coca-Cola ZITF Four Minute Mile, which will take place on Saturday morning at the ZITF Conference Centre grounds.\n\nOriginally, twenty-six athletes had qualified for the semi-finals, which were scheduled for Friday. However, with only nineteen athletes showing up, the semi-finals meant to trim the field to twenty finalists were cancelled, and all present competitors were advanced directly to the final.\n\nThe final follows the qualifying rounds held across the country from the start of the year.\n\nAmong the top contenders is Defending champion Wellington Varewi, who recorded the fastest qualifying time of four minutes 17.02 seconds. He is not only aiming for victory but is also pursuing a remarkable milestone becoming the only athlete in recent history to win the title four times. In addition, he is edging closer to the long-standing national record of three minutes 58 seconds, set by Gray Mavhera twenty-eight years ago.\n\nOther athletes to watch include Elijah Mabunu, who qualified with a time of four minutes 17.93 seconds, Trust Hove with four minutes 19.03 seconds, and Trust Chidomaya, who posted a time of four minutes 28.71 seconds.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-26-at-12.01.29-PM-680x380.jpeg",
            "description": "Innocent Kurira ,Zimpapers Sports Hub NINETEEN athletes are set to compete in the final of the Coca-Cola ZITF Four Minute Mile, which will take place on Saturday morning at the ZITF Conference Centre grounds. Originally, twenty-six athletes had qualified for the semi-finals, which were scheduled for Friday. However, with only nineteen athletes showing up, the […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "NEW : Vice President Chiwenga in the Vatican for Pope Francis’ burial",
            "url": "https://www.chronicle.co.zw/new-vice-president-chiwenga-in-the-vatican-for-pope-francis-burial/",
            "content": "Mukudzei Chingwere at the Vatican City, in Rome Italy\n\nVice President Dr Constantino Chiwenga has arrived at the iconic and sacred St Peters Basilica ahead of official commencement of burial rites for Pope Francis.Pope Francis succumbed to stroke and irreversible cardiovascular collapse on Easter Monday at the age of 88, plunging the Christian movement into mourning.\n\nAhead of the burial, VP Chiwenga has had a tete--tete with former United States of America President Joe Biden, in what could be a gigantic diplomatic step towards normalising relations between Harare and Washington.President Mnangagwa is leading from the front in that regard and just last month removed tarrifs on all US imports as part of a broader and elaborate strategy to normalise relations.\n\nOfficial activities here began as early as 5.30am with the opening of St Peters Square to the public.At 10am, Cardinal Giovanni Battista  Dean of the College of Cardinals  presided over the funeral mass.\n\nAt 1pm, Pope Francis body will make its way into St Peters Basilica.In strict adherence to the Ordo Exsequiarum Romani Pontificis (Rite of Burial for Roman Pontiffs), the body will then make its way to Santa Maria Maggiore for burial.\n\nAt the burial site, the body will be received by a group of ordinary and common people who will have a chance to see off the servant of God.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-26-at-11.58.06-AM-680x380.jpeg",
            "description": "Mukudzei Chingwere at the Vatican City, in Rome Italy Vice President Dr Constantino Chiwenga has arrived at the iconic and sacred St Peters Basilica ahead of official commencement of burial rites for Pope Francis. Pope Francis succumbed to stroke and irreversible cardiovascular collapse on Easter Monday at the age of 88, plunging the Christian movement […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "“Yvonne Maphosa Returns with a Powerful Exploration of Grief, Betrayal, and Forgiveness”",
            "url": "https://www.chronicle.co.zw/yvonne-maphosa-returns-with-a-powerful-exploration-of-grief-betrayal-and-forgiveness/",
            "content": "Blessing Karubwa ,Online Reporter\n\nRENOWNED author Yvonne Maphosa returns with Heart in Two 2, the much-anticipated second instalment of her acclaimed contemporary fiction series.\n\nKnown for her emotionally charged storytelling and relatable characters, Maphosa continues to explore the complex layers of love, loyalty and identity.\n\nSpeaking about the new novel, Maphosa describes her process as grounded in authenticity and emotional truth.\n\nFiction is just for fun. Its entertainment. I dont write with the aim of teaching a lesson, she said. But if people take something meaningful from it, then Im happy, she said\n\nHer writing, however, is anything but surface-level.\n\nIn Heart in Two 2, Maphosa dives deep into grief, betrayal, loyalty, the haunting weight of secrets and the power of forgiveness.\n\nHer characters wrestle with not just matters of the heart, but also generational trauma, hidden legacies and the burden of blood ties.\n\nThese stories are fiction, yes, but theyre also a mirror. They are a reflection of the emotional reality many people live in silence, she said.\n\nReflecting on her previous works, Maphosa discussed the themes explored in her different books.\n\nIn The Y in Your Man is Silent series, she delves into the intricacies of relationships marked by infidelity, offering a rare perspective on the experience of being the other woman.\n\nThrough the eyes of a young woman entangled with a married man, Maphosa examines the emotional tension, identity struggles, and battles with self-worth that unfold in the shadows of secrecy.\n\nThe Y in Your Man is Silent navigates the blurred lines between love, desire and deception, revealing how loyalty and morality are tested when emotions run deep.\n\nThe Grasping at Straws series explores the clash between tradition and progress within a rural village context. It highlights the challenges of navigating patriarchal systems upheld by tradition, while striving for agency, education and self-determination. Themes of gender inequality, cultural expectations, the spiritual weight of ancestral beliefs, forgiveness, piety, and the role of African Traditional Religion are tackled, illustrating the deep emotional and cultural conflicts faced by those attempting to break free from societal constraints.\n\nIn the Heart in Two series, Maphosa explores the emotional and psychological aftermath of trauma, focusing on how violence, family secrets, betrayal, grief, and unresolved pain affect personal growth and relationships. The series delves into the complexities of gang life and social unrest, weaving themes of forgiveness, redemption, and resilience. It also explores the emotional challenge of being torn between two relationships and how love can develop across social divides and defy expectations. Heart in Two offers a powerful exploration of the emotional endurance required to confront the past, heal and move forward.\n\nMaphosa is also a dedicated literary mentor and advocate for emerging voices, passionate about making literature more accessible and relatable. Through initiatives like the Luvone Writing Competition, masterclasses, and regular X (Twitter) Spaces, she nurtures new talent and champions authentic African storytelling.\n\nMaphosa is a recipient of the Outstanding Author Award at the Zimbabwe Achievers Awards and Outstanding Literary Work at the Roil Bulawayo Arts Awards. These accolades recognise her compelling storytelling, cultural authenticity, and invaluable contributions to shaping modern African literature.\n\nOn the topic of adapting her books for the screen, she remains hopeful.Its still a dream at this point, but I have a good feeling. It will happen in due time, she said.\n\nCurrently, shes working on the third instalment of her acclaimed series: The y in your man is silent and on a non-fiction memoir reflecting on her childhood.\n\nMaphosas books are available in major bookstores in South Africa, online retailers such as TakeALot, Amazon and from book stores in Zimbabwe, Namibia, Botswana, Lesotho and Eswatini (Swaziland).\n\nReaders can interact with Yvonne Maphosa on social media:Twitter/X, Instagram, TikTok, Facebook: @Yvonne_Maphosa.\n\n-@TeamKarubwa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/baata.jpg",
            "description": "Blessing Karubwa ,Online Reporter RENOWNED author Yvonne Maphosa returns with ‘Heart in Two 2’, the much-anticipated second instalment of her acclaimed contemporary fiction series. Known for her emotionally charged storytelling and relatable characters, Maphosa continues to explore the complex layers of love, loyalty and identity. Speaking about the new novel, Maphosa describes her process as […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "We’re One people!… Mozambican leader lauds bilateral, economic ties with Zimbabwe",
            "url": "https://www.chronicle.co.zw/were-one-people-mozambican-leader-lauds-bilateral-economic-ties-with-zimbabwe/",
            "content": "Vusumuzi Dube, Deputy Radar Editor\n\nMOZAMBIQUE is Zimbabwe and Zimbabwe is Mozambique. We are one!What a powerful statement echoed multiple times by Mozambican President Daniel Francisco Chapo in his keynote address at the official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo yesterday.\n\nThe visiting Mozambican leader was the guest of honour at the countrys oversubscribed premier trade and investment expo.He emphasised that the two neighbouring states not only share a border, but also possess deep-rooted political, economic and cultural ties dating back to pre-independence era.\n\nSpeaking in Portuguese with the aid of an interpreter, President Chapo spoke at length about the relationship between the two countries, and urged further improvement to achieve mutually beneficial trade and foreign direct investment flows.Its a fact that co-operation with the Republic of Zimbabwe has great significance for Mozambique, not only because of the sharing of common borders, but also because of the deep historical ties of political, economic and cultural coexistence, which date back to the times of the national liberation struggle which, over the decades, have translated into active and mutual support in the defence and consolidation of our sovereignties and have crystallised in close co-operation at bilateral, regional and continental levels, said President Chapo.\n\nOur presence at this important fair represents our determination to boost and facilitate trade between Mozambique and Zimbabwe in particular, and with the world in general, as well as to attract foreign direct investment from Zimbabwe and the countries represented here in agriculture, industry, transport and logistics sectors, among other sectors.\n\nHe said the cordial bilateral relations between the two countries should stimulate higher commercial gains through economic complementarity and the creation of economies of scale leveraging available natural resources, existing infrastructure and logistical means, with emphasis on the Beira Corridor.\n\nPresident Chapo noted that the ZITF 2025 was being hosted just a few days after the celebration of the 45th anniversary of Zimbabwes Independence Day, similar to Mozambiques scheduled hosting of the 60th edition of the Maputo International Trade Fair, which takes place from August 25 to 31 this year in Maputo.\n\nThe neighbouring country will be celebrating 50 years of its independence, marking a point of intersection between the two countries.\n\nDespite the geographical proximity, the immense natural and strategic resources yet to be explored, and the historical political ties of friendship between our countries, our trade relations and investments are still incipient and consist of low value-added products, mostly commodities, and with no record of any notable change in their structure or composition over the last few years, as can be seen in the data we present below, in terms of the trade balance and foreign direct investment flows, said President Chapo.\n\nOur participation in this event has the central objective of gathering the experiences of the main stakeholders and interested parties in the industrial, agricultural, transport and logistics sectors, with emphasis on farmers, agribusiness operators, policy makers and international organisations, with a view to promoting economic recovery, innovation and the sustainability and resilience of the agricultural, industrial, transport and logistics sector for the benefit of our private sector, communities and the country in general, said President Chapo.\n\nHe revealed that Zimbabwe has been part of the traditional foreign investors in Mozambique for the last three decades, having reduced its participation in recent years, motivated by the well-known challenges that afflict not only Zimbabwe but most countries in the SADC region and the African continent in general.\n\nBetween 2015 and 2024, 37 projects were approved, which could create 1 649 jobs, involving private investors from Zimbabwe, for a total value of around US$120 million, of which the equivalent of around US$35 million was direct investment, said President Chapo.\n\nZimbabwes investment was directed at 31,7 percent in the aquaculture and fisheries sector, in second place, the tourism and hotel sector with 23,49 percent of the approved investment and, in third place, the industry sector with 21,1 percent.\n\nTherefore, in terms of private investment, between our two countries, we noted with satisfaction the presence of foreign direct investment from Zimbabwean companies in Mozambique, which, although modest, expresses the willingness of businesspeople from our countries to explore intra-African investment opportunities, said the Mozambican leader.\n\nHe further noted that the two nations had vast natural resources, which they could each exploit to boost their individual economies.\n\nZimbabwe has enormous reserves of natural resources, with emphasis on arable land, forests and wildlife reserves, known worldwide, such as Victoria Falls, strategic mineral resources such as gold, lithium, copper, among others that contribute to the positioning of its economy as an economic power and source of foreign direct investment in the region, without leaving aside the role of breadbasket of the region and the continent that it played in the past, said President Chapo.\n\nMozambique, like Zimbabwe, has immense reserves of soil and subsoil resources, including 35 million hectares of arable land, availability of water, natural gas, various types of minerals, a long coastline and logistical infrastructure that facilitates access to the sea for hinterland countries in the SADC region, he added.\n\nAll investors from Zimbabwe and other countries who decide to invest in Mozambique in the various sectors, particularly agribusiness, industry, energy, tourism and hotels, infrastructure, transport and logistics, benefit from the availability of untapped resources.\n\nTurning to the ZITF experience, President Chapo said the platform was critical in promoting opportunities for co-operation and exchange in key economic areas of agriculture and agribusiness, industry, transport and logistics.\n\nWe live in a globalised world, characterised by growing multilateralism in political and economic relations in the international arena, where economic diplomacy plays a fundamental role, he said.\n\nOur presence at this prestigious business event is part of this constant search to strengthen our economic diplomacy from a bilateral and multilateral point of view.\n\nOur participation in this event also aims provides us with a platform for promoting and facilitating business partnerships and investments for companies and investors from both countries, interaction between members of both Governments for the promotion and facilitation of cross-border trade and investment, as well as the creation of a platform for exchanging information on business between Mozambique and Zimbabwe, said President Chapo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/T5HJTH-680x380.jpg",
            "description": "Vusumuzi Dube, Deputy Radar Editor “MOZAMBIQUE is Zimbabwe and Zimbabwe is Mozambique. We are one!” What a powerful statement echoed multiple times by Mozambican President Daniel Francisco Chapo in his keynote address at the official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo yesterday. The visiting Mozambican leader was […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        },
        {
            "title": "Heart-warming gesture… President Mnangagwa’s surprise gift for young girls at ZITF",
            "url": "https://www.chronicle.co.zw/heart-warming-gesture-president-mnangagwas-surprise-gift-for-young-girls-at-zitf/",
            "content": "Gibson Mhaka, Zimpapers Politics Hub\n\nIT was just a cheerful shout from a little girl, but it lit up the day and earned her a cool US$100 from President Mnangagwa.As the countrys Head of State and his Mozambican counterpart, President Daniel Chapo, strolled past excited crowds on their way to the Zimbabwe Defence Forces stand at the Zimbabwe International Trade Fair (ZITF), seven-year-old Tinashe Tsekiso Mutemi couldnt hold back her excitement.\n\nWith eyes sparkling and her voice ringing with joy, she shouted, President Mnangagwa!The spontaneous greeting stopped the presidential entourage in its tracks. It caught the attention of the President himself, who paused mid-stride and turned with a smile.\n\nWho said that? he asked playfully, scanning the crowd. Tinashe, standing proudly beside her sister, waved enthusiastically. The President walked over, leaned in to greet her warmly, and, much to everyones surprise, reached into his jacket pocket and handed her a crisp US$100 note.\n\nTinashe Tsekiso Mutemi who was also given money by President Mnangagwa displays her gift\n\nA wide, beaming smile stretched across Tinashes face as she looked up at the President. Thank you so much, Your Excellency, she said, her voice filled with genuine gratitude.\n\nThe heart-warming moment sparked cheers, with some fairgoers clapping and others capturing the rare exchange on their phones.\n\nSpeaking afterwards, Tinashe could hardly contain her excitement. I was so happy to see the President in real life for the first time. I shouted his name hoping he would notice me, and he did! When he gave me the money, I was surprised and happy. This will help my family. I will never forget this day.\n\nHer 13-year-old sister, Kemuso, was equally moved.I tried to hold her back when she shouted, thinking it wasnt safe with all the security around. But she kept going. We never expected the President to stop, let alone walk over and give her money. It was such a kind gesture; it touched my heart, she said.\n\nPresident Mnangagwa is known for his warm connection with children, often demonstrated through his annual engagements with young people, particularly during the Independence Day Childrens Party.\n\nHosted together with the First Lady, Dr Auxillia Mnangagwa, the party celebrates the hopes and voices of the nations youngest citizens.\n\nAt these gatherings, the President is often met with cheers and affection, a reflection of the bond he has nurtured with the nations young citizens over the years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/RFWF.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub IT was just a cheerful shout from a little girl, but it lit up the day and earned her a cool US$100 from President Mnangagwa. As the country’s Head of State and his Mozambican counterpart, President Daniel Chapo, strolled past excited crowds on their way to the Zimbabwe Defence Forces […]",
            "time": "18:07",
            "date": "26 Apr 2025"
        }
    ]
}