{
    "news": [
        {
            "title": "BREAKING: Lieutenant General Sanyatwe replaces Kirsty Coventry as Sports Minister",
            "url": "https://www.chronicle.co.zw/breaking-lieutenant-general-sanyatwe-replaces-kirsty-coventry-as-sports-minister/",
            "content": "Online Reporter\n\nPresident Mnangagwa has appointed Lieutenant General Anselem Sanyatwe as Sport, Recreation, Arts and Culture Minister with immediate effect.\n\nHe replaces Kirsty Coventry who is set to assume her role as International Olympic Committee president in June.\n\nIn a statement, Chief Secretary to the President and Cabinet Dr Martin Rushwaya said President Mnangagwa has also retired Lieutenant General Sanyatwe from the Zimbabwe Defence Forces and as Commander of the Zimbabwe National Army with immediate effect.\n\nH.E. President @edmnangagwa relieves Hon Kirsty Coventry from her position as Minister of Sport, Recreation, Arts and Culture following her well deserved election as the President of the International Olympic Committee.\n\nThe President has also retired Lieutenant General Anselem Nhamo Sanyatwe from the Zimbabwe Defence Forces and as Commander of the Zimbabwe National Army with immediate effect.\n\nThe President appointed Lieutenant General (Retd) Anselem Nhamo Sanyatwe as Minister of Sport, Recreation, Arts and Culture with immediate effect.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ytd.jpg",
            "description": "Online Reporter  President Mnangagwa has appointed Lieutenant General Anselem Sanyatwe as Sport, Recreation, Arts and Culture Minister with immediate effect. He replaces Kirsty Coventry who is set to assume her role as International Olympic Committee president in June. In a statement, Chief Secretary to the President and Cabinet Dr Martin Rushwaya said President Mnangagwa has […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Bulawayo on edge as armed robbers target forex dealers and fuel stations",
            "url": "https://www.chronicle.co.zw/bulawayo-on-edge-as-armed-robbers-target-forex-dealers-and-fuel-stations/",
            "content": "Online Reporter\n\nBULAWAYO has been rocked by a surge in violent crime, with an illegal foreign currency dealer becoming the latest victim after being shot and robbed of thousands of US dollars by an armed suspect on Monday night.\n\nThe victim, Mthokozisi Nkomo, was attacked near Maplanka Shops in Luveve at around 9.30 PM soon after disembarking from a commuter omnibus from the city centre to Gwabalanda suburb.\n\nBulawayo acting police spokesperson Assistant Inspector Nomalanga Msebele, said Nkomo noticed a suspicious individual who had also disembarked from the kombi.\n\nSensing danger, he allowed the suspect to pass him along Intemba Road. However, the suspect suddenly pulled out a firearm and shot him in the stomach before making off with a bag containing US$5 700, BWP2 000, R1 400, and a Samsung A13 cellphone.\n\nThe complainant fell to the ground, bleeding profusely, as the suspect searched him and took his belongings before fleeing the scene, said Asst Insp Msebele.\n\nNkomo was rushed to Mpilo Central Hospital for treatment.\n\nAsst Insp Msebele said police have since launched a manhunt for the suspect. She warned residents against carrying large sums of money, especially at night, urging them to utilise banking services to minimise risk.\n\nAsst Insp Msebele said police are intensifying patrols and urging the public to provide any information that could help track down the perpetrators.\n\nThis incident comes amid a worrying increase in armed robberies in Bulawayo, particularly targeting fuel service stations and individuals handling large amounts of cash. Just a day before the forex trader was attacked, gunmen stormed a service station along Siyephambili Drive in Kelvin West, getting away with US$1 000 and R7 000.\n\nIn that case, three masked suspects armed with rifles and a pistol ambushed fuel attendants, firing a warning shot before forcing them into the cash office. The robbers seized all available cash and fled the scene.\n\nWe have witnessed an upsurge in armed robberies at fuel service stations. We urge operators to improve security measures, deposit daily earnings promptly, and minimise cash held on-site, said Asst Insp Msebele.\n\nThe escalating crime wave has prompted some fuel stations to revise their operating hours, shutting down at night to protect workers and customers. In recent months, a gang raided a Kelvin Industrial Area service station, escaping with US$2 374 and R115 235.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-07-at-8.48.50-AM.jpeg",
            "description": "Online Reporter  BULAWAYO has been rocked by a surge in violent crime, with an illegal foreign currency dealer becoming the latest victim after being shot and robbed of thousands of US dollars by an armed suspect on Monday night. The victim, Mthokozisi Nkomo, was attacked near Maplanka Shops in Luveve at around 9.30 PM soon […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Bulawayo socialite Brizzy and girlfriend convicted of forgery",
            "url": "https://www.chronicle.co.zw/bulawayo-socialite-brizzy-and-girlfriend-convicted-of-forgery/",
            "content": "Trish Mukwazo,[emailprotected]\n\nBULAWAYO socialite Brendon Shoko, popularly known as Brizzy, his girlfriend and an accomplice have been convicted for swindling a local woman of US$520, which was intended for her sons school fees, by forging bank deposit slips.\n\nShoko (28), his girlfriend, Priscah Chipeta (38), and Knowledge Mhlanga (41) were convicted of two counts of forgery by Bulawayo magistrate Mr Maxwell Ncube, who remanded them in custody until Wednesday for sentencing.\n\nThe trio forged CBZ deposit slips to falsely claim that Ms Phethekile Madonkos sons school fees at Gloag High School had been paid. Instead of depositing the money, they converted it for personal use and created fake CBZ deposit slips to mislead Ms Madonko. The scheme was uncovered when the school contacted Ms Madonko about unpaid fees, prompting her to file a police report.\n\nThe prosecutor, Ms Mufaro Ndirayire, said the first incident occurred on 7 February, when Ms Madonko handed Chipeta US$350 to deposit into the schools account. Chipeta then approached Shoko, who enlisted Mhlanga to forge a deposit slip using a fake stamp and printed confirmation slip. A second incident followed on 20 February, involving US$210, which Chipeta again failed to deposit.\n\nChipeta then approached Shoko and asked for a forged CBZ deposit slip. Shoko then engaged the services of Mhlanga, who forged the slip by designing a fake stamp and printing a CBZ bank confirmation of cash deposit slip, said Ms Ndirayire.\n\nTheir lawyer, Simon Mutandi of Sandi and Matshakaile Attorneys, pleaded for leniency, citing their status as first-time offenders and noting that they had compensated the complainant.\n\nChipeta faces additional charges of theft of trust property and fraud in connection with violating a trust agreement with Ms Madonko and misrepresenting the payment of school fees to Gloag High School. These charges stem from her role in producing fake deposit slips and deceiving both Ms Madonko and the school administration.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Brendon-Shoko-1.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com BULAWAYO socialite Brendon Shoko, popularly known as “Brizzy,” his girlfriend and an accomplice have been convicted for swindling a local woman of US$520, which was intended for her son’s school fees, by forging bank deposit slips. Shoko (28), his girlfriend, Priscah Chipeta (38), and Knowledge Mhlanga (41) were convicted of two counts […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Zimura open to revisiting US$150 cover bands tariff after stakeholder dialogue",
            "url": "https://www.chronicle.co.zw/zimura-open-to-revisiting-us150-cover-bands-tariff-after-stakeholder-dialogue/",
            "content": "Trust Khosa, Zimpapers Arts and Entertainment Hub\n\nFollowing lobbying from various music institutions addressing concerns over the Zimbabwe Music Rights Association (Zimura)s announcement that all cover bands should pay a US$150 licensing fee per show, a decision that faced opposition from some musicians and industry professionals, Zimura has expressed willingness to revisit the tariff if proper lobbying processes are followed.\n\nThis comes after the National Arts Council of Zimbabwe (NACZ) recently facilitated a productive dialogue with Zimura and various music industry stakeholders to address the controversial US$150 licensing fee imposed on cover bands. The meeting, held in Harare last week, focused on creating a fair and sustainable tariff structure for cover bands operating within the country.\n\nStakeholders present at the meeting included representatives from NACZ, Zimura, academics, associations, unions, composers, cover band leaders, and beneficiaries of intellectual property rights.\n\nNACZ communication and marketing manager Aggabu Nyabinde issued a statement following the meeting, expressing satisfaction with the outcome and the willingness of all parties to continue the dialogue. The National Arts Council of Zimbabwe is pleased to announce the successful conclusion of a productive stakeholder meeting with Zimura and other music industry representatives. This meeting was prompted by lobbying from various music institutions who sought to address concerns following Zimuras announcement that all cover bands should pay a US$150 licensing fee per show, Nyabinde said.\n\nHe added that Zimura has expressed openness to revisiting the tariff if the proper lobbying processes are followed, including engaging with the composers whose music is performed by the cover bands.Zimura indicated that there is room for revisiting the tariff if the proper lobbying process is followed. They will engage the composers whose music is being performed by the cover bands for their input.NACZ will work closely with Zimura to facilitate the necessary processes and come up with a solution that brings unity and harmony to the music industry, Nyabinde said.\n\nThe National Arts Council is committed to fostering a vibrant and inclusive arts sector. This meeting marks a significant step forward in addressing the concerns of cover bands while upholding the rights of copyright holders.The NACZ highlighted the importance of aligning all stakeholders understanding of intellectual property rights and incorporating international standards for royalty collection from cover bands.\n\nA key point of the discussion centred on reaching an agreement on fair fees that respect both the rights of composers and the operational realities of cover bands.All attending parties agreed that music is intellectual property and should be compensated when used in any form. It is both legal and just for composers to seek compensation for the public performance of their work, Nyabinde said.The conversation also addressed the role of venue owners and festival organisers, who typically handle royalty payments for cover bands as part of their copyright licenses.In Zimbabwe, our law provides for Collective Management Organizations (CMOs) to collect directly from artists, Nyabinde outlined.\n\nThe meeting aligned with the National Music Strategy launched in 2022, which advocates for a well-structured copyright system that ensures fair distribution of royalties to all contributors, including songwriters, performers, producers, and publishers.This collaborative approach will not only benefit all stakeholders but will also contribute to the growth of Zimbabwes creative economy in line with the national vision for 2030, Nyabinde added.\n\nNotable attendees included NACZ executive director Napoleon Nyanhi, Zimura executive director Polisile Chimhini, and Zimbabwe Musicians Union representative Chioneso Rutsito.\n\nThe meeting marked a significant step towards resolving the ongoing concerns surrounding the licensing tariffs for cover bands and further strengthening the music industrys copyright framework.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Zimura.jpg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub Following lobbying from various music institutions addressing concerns over the Zimbabwe Music Rights Association (Zimura)’s announcement that all cover bands should pay a US$150 licensing fee per show, a decision that faced opposition from some musicians and industry professionals, Zimura has expressed willingness to revisit the tariff if […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Army netball side fires warning shots",
            "url": "https://www.chronicle.co.zw/army-netball-side-fires-warning-shots/",
            "content": "Luckson Pasipanodya, CorrespondentZIMBABWE Defence Forces have taken an early lead after winning their opening three matches in the Nedbank Zimbabwe Premier Netball League In Bulawayo at the weekend.The Bulawayo bubble played at White City Stadium had four teams in action namely Manyame Falcons, Tongogara Queens, Black Rhinos and Imbizo Queens.Black Rhinos ended last season on second place while Falcons finished sixth.Tongogara and Imbizo are new kids in the league.The games started with Manyame Falcons versus Imbizo Queens. On the first quarter Manyame Falcons dominated but Imbizo Queens came back with a different strategy through the second and third quarters after half time. When they were almost closer to levelling the score line at 31-33, Manyame Queens transformed the game to a one sided affair which then took them to 42-31.The second game was Tongogara against Black Rhinos. With its youthful team of fast players, Black Rhinos inflicted early pain on Tongogara Queens which had old and young players. Besides being dominant last year in Division One, they found the going tough through the first, second and part of the third quarter before Rhinos hammered them 53-23.Black Rhinos were not finished as they locked horns with Manyame Falcons in the last game of the bubble. Manyame thrashed Black Rhinos 61-30 in a match that appeared balanced until after half time.Premier Netball League executive member and bubble co-ordinator, Tonderai Magaya said the games had a lot of pressure from other bubbles.The bubbles competitive nature was not influenced by what was happening at White City Stadium but by the pressure that comes at the thought of other teams that were playing in Harare and Mutare respectively.Results at a glanceBulawayo BubbleTongogara Queens 30-56 Imbizo Queens, Black Rhinos 53-23 Tongogara Queens, Manyame Falcon 42-31 Imbizo Queens, Black Rhinos 30-61 Manyame FalconMutare BubbleZDF Queens 106-10 Buffaloes, Aspindale 73-17 Mutasa Falcon, Mutare City 61-29 Mutasa Falcon, Aspindale 57-38 Bikita MineralsHarare BubbleMakate 47-Stars 27, Harare City 69-21 P Stars, Harare City 58-24 Brace 24Top 10 teamsLogP W D L F A GD PtsZDF Queens 3 3 0 0 304 41 263 6Aspindale 3 3 0 0 189 85 104 6Harare City 2 2 0 0 131 37 94 4Makate High Flyers 2 2 0 0 98 52 46 4Manyame Falcons 2 2 0 0 103 61 42 4Harare District 2 2 0 0 106 68 38 4Mutare City Queens 3 2 0 1 146 118 28 4Imbizo Queens 2 1 0 1 87 72 15 2Black Rhinos 2 1 0 1 83 84 -1 2Bikita Minerals 3 1 0 2 107 175 -68 2\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/black-rhino.jpg",
            "description": "Luckson Pasipanodya, Correspondent ZIMBABWE Defence Forces have taken an early lead after winning their opening three matches in the Nedbank Zimbabwe Premier Netball League In Bulawayo at the weekend. The Bulawayo bubble played at White City Stadium had four teams in action namely Manyame Falcons, Tongogara Queens, Black Rhinos and Imbizo Queens. Black Rhinos ended […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "SA musician Ayanda Shange calls out Vocal Ex for failing to credit ‘Phostoli Medley’",
            "url": "https://www.chronicle.co.zw/sa-musician-ayanda-shange-calls-out-vocal-ex-for-failing-to-credit-phostoli-medley2/",
            "content": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub\n\nBulawayo-based Gospel outfit Vocal Ex recently found themselves embroiled in a heated argument with former South African Joyous Celebration member Ayanda Shange after the group posted a cover of his song Phostoli Medley on their social media pages without giving proper credit to the original composer and producer.\n\nThe issue arose when Vocal Ex shared a video of their rendition of the popular track, prompting a response from Shange, who expressed his frustration over the lack of acknowledgment.Why is it so difficult for you to credit the owner of the song? This is the second time, if not the third time, you guys are doing this, Shange commented, visibly upset.\n\nAyanda Shange\n\nThe post, which was later edited and deleted by Vocal Ex, sparked further debate in the comments section, with some followers praising the groups talent while others pointed out the lack of originality, suggesting that Vocal Ex should focus more on their own compositions instead of posting constant cover songs.\n\nIn response to the criticism, Vocal Ex reassured their fans, asking them to be patient as they are working on original material.\n\nScreenshots from the argument between Vocal Ex and Ayanda Shange\n\nThank you. Keep watching this space for details on the projects in the pipeline, the group said.\n\nA lesson to creatives who often post cover songs on social mediaPosting cover songs on platforms like Facebook requires proper legal steps, including obtaining a mechanical license from the copyright owner (usually the music publisher) or a third-party licensing service. If the cover is used in a video, a synchronisation license is also necessary.\n\nScreenshots from the argument between Vocal Ex and Ayanda Shange\n\nFor those who wish to share cover songs without legal issues, it is important to give credit to the original artiste and songwriter by tagging them or including a disclaimer. A simple statement clarifying that the music is not owned by the poster and that no copyright infringement is intended can help avoid legal complications.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Vocal-Ex.jpg",
            "description": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub Bulawayo-based Gospel outfit Vocal Ex recently found themselves embroiled in a heated argument with former South African Joyous Celebration member Ayanda Shange after the group posted a cover of his song Phostoli Medley on their social media pages without giving proper credit to the original composer and producer. […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Cassava to upgrade data centres with NVIDIA supercomputers for AI in Africa",
            "url": "https://www.chronicle.co.zw/cassava-to-upgrade-data-centres-with-nvidia-supercomputers-for-ai-in-africa/",
            "content": "Cassava Technologies announced today that it plans to build Africas first AI factory  a powerful and super-secure data centre facility powered with NVIDIA AI computing technology.\n\nThis will give African businesses, governments and researchers access to cutting-edge AI computing capacity  helping them develop smarter AI products, streamline operations and stay competitive in a fast-changing world. It provides the supercomputers and software needed to train AI while keeping data within Africas borders.\n\nCassava plans to deploy NVIDIA accelerated computing and AI software using NVIDIA Cloud Partner (NCP) reference architectures, at its data centres in South Africa by June 2025, with expansion planned at its other data centre facilities in Egypt, Kenya, Morocco and Nigeria.\n\nCassavas AI Factory will leverage the companys pan-African high-speed, ultra-low-latency, fibre-optic network with sustainable data centres to deliver AI as a Service (AIaaS). Cassavas world-class data centres are designed to be energy efficient, using less electricity to power AI computing workloads.\n\nNVIDIA GPU-based supercomputers will power the AI factory, enabling faster AI model training, fine-tuning and advanced inference capabilities. Cassava aims to be the first to introduce these accelerated computing platforms to Africa as an NCP, playing a crucial role in the continents AI ecosystem.\n\nThe Cassava AI Factory will ensure businesses and researchers have access to the AI computing power required to scale, boost productivity and power innovation. By using this secure, high-performance AI Factory, African businesses and governments can develop local solutions to local challenges, enabling Africans to build, train, scale and deploy AI in a secure environment compliant with global and local regulations.\n\nBuilding digital infrastructure for the AI economy is a priority if Africa is to take full advantage of the fourth industrial revolution. Our AI Factory provides the infrastructure for this innovation to scale, empowering African businesses, startups and researchers with access to cutting-edge AI infrastructure to turn their bold ideas into real-world breakthroughs  and now, they dont have to look beyond Africa to get it, said Strive Masiyiwa, Founder & Chairman of Cassava. Collaborating with NVIDIA gives us the advanced computing capabilities needed to drive Africas AI innovation while strengthening the continents digital independence.\n\nAI is helping innovators solve our greatest challenges in agriculture, healthcare, energy, financial services and many other industries creating opportunity in Africa, said Jaap Zuiderveld, VP EMEA at NVIDIA. As an NVIDIA Cloud Partner, Cassava is providing essential infrastructure and software to help pioneering companies and organizations accelerate AI development to foster innovation across the continent.\n\nCassavas AI Factory marks the next step in the groups long-standing leadership in providing world class digital solutions, reinforcing its broader commitment to responsible AI adoption, innovation and productivity growth in Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/wreg-1.jpg",
            "description": "Cassava Technologies announced today that it plans to build Africa’s first AI factory — a powerful and super-secure data centre facility powered with NVIDIA AI computing technology. This will give African businesses, governments and researchers access to cutting-edge AI computing capacity — helping them develop smarter AI products, streamline operations and stay competitive in a […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Local peace committees drive establishment of police bases in communities",
            "url": "https://www.chronicle.co.zw/local-peace-committees-drive-establishment-of-police-bases-in-communities/",
            "content": "Sukulwenkosi Dube-Matutu\n\nLOCAL peace committees are promoting the establishment of police bases within communities as part of their ongoing peace-building efforts.\n\nTheZimbabwe Christian Alliance (ZCA)has successfully formed46 local peace committeesacrossMatabeleland North,Matabeleland South, andMidlands Provinces. Notably, theGwanda Local Peace Committeespearheaded the establishment of a police base in theSpitzkop areaof Ward 5, Gwanda Urban, last year.\n\nZCA executive director, Reverend Useni Sibanda said this initiative will be replicated by peace committees in other districts. He said peace committees do not only focus on creating dialogue but also proffering long-term solutions to address conflicts.\n\nReverend Sipho Mhizha\n\nLocal peace committees were designed to deal with local conflict issues and most of these local conflict issues will need collective effort between churches, police among other stakeholders for the root cause of the problem to be addressed. For example we have had the Gwanda Local Peace Committee work with the police to address conflicts in mining areas, which had escalated.\n\nIn their interventions, the peace committees dont only focus on dialogue but bringing long-term solutions to address conflict. It was important for a police base to be established in Spitzkop as it has brought the much needed relief. Its important for more police bases to be built in local communities as they help in maintaining order and ensure a faster reaction. We look forward to construction of more police bases through initiatives from our peace committees, working with police and other stakeholders, he said.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Reverend-Useni-Sibanda-1.jpg",
            "description": "Sukulwenkosi Dube-Matutu LOCAL peace committees are promoting the establishment of police bases within communities as part of their ongoing peace-building efforts. The Zimbabwe Christian Alliance (ZCA) has successfully formed 46 local peace committees across Matabeleland North, Matabeleland South, and Midlands Provinces. Notably, the Gwanda Local Peace Committee spearheaded the establishment of a police base in the Spitzkop area of Ward 5, Gwanda Urban, last year. ZCA […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "ZRP intercept 175kgs of Mbanje at Beitbridge Border",
            "url": "https://www.chronicle.co.zw/zrp-intercept-175kgs-of-mbanje-at-beitbridge-border/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nBorder Security officials have intercepted a vehicle loaded with 175kgs of mbanje that had been declared as groceries being imported from South Africa via Beitbridge border post.\n\nThe Toyota Hilux towing a trailer was travelling to Nkulumane in Bulawayo with eight people on board on Monday.\n\nSo far, Sydney Ndlovu (39), Delight Ndlovu (37) and Diana Moyo have been arrested for unlawful possession of 175 kilograms of dagga.\n\nThe police officer commanding Beitbridge district Chief Superintendent Melusi Ncube said they are still pursuing five more suspects who escaped arrest at the border.\n\nWe have their details and we will soon catch up with them, he said.\n\nThe suspects arrived from South Africa in a Toyota Hilux towing a trailer loaded with an assortment of goods and were heading for Bulawayo.\n\nWhile at the border, they declared that they were carrying groceries and a search of the vehicle was then conducted leading to the discovery of the daagga that had been concealed under a few packets of biscuits and noodles. Some were loaded in a kitchen unit.\n\nThe senior police official said five suspects vanished from the border after realising that three of their associates had been arrested.\n\nChief Supt Ncube said the police were out in full force to combat the illegal movement of goods among them drugs through the countrys boundary with South Africa.\n\nSecurity officials are not relenting on their crack down on smuggling activities with the Zimbabwe Revenue Authority (ZIMRA) working with other agencies recently intercepting South African truck driver at Beitbridge Border Post while trying to smuggle from his country a contraband of 163 kilograms of marijuana (mbanje), worth US$32,600.\n\nIt had been concealed within a South African-registered Hino Horse truck carrying vehicles that was in transit through Zimbabwe to the Democratic Republic of Congo (DRC).\n\nIt is understood that most of the drugs are destined for high density suburbs in Bulawayo and Harare.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-25-at-13.23.00_9addff16-680x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Border Security officials have intercepted a vehicle loaded with 175kgs of mbanje that had been declared as groceries being imported from South Africa via Beitbridge border post. The Toyota Hilux towing a trailer was travelling to Nkulumane in Bulawayo with eight people on board on Monday. So far, Sydney Ndlovu (39), […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        },
        {
            "title": "Japanese embassy commits to enhancing school infrastructure in Zimbabwe",
            "url": "https://www.chronicle.co.zw/japanese-embassy-commits-to-enhancing-school-infrastructure-in-zimbabwe/",
            "content": "Sikhumbuzo Moyo in Jotsholo\n\nThe commitment was made by the Japanese Embassy in Zimbabwe Ambassador, Mr Shinichi Yamanaka during the commissioning of two classroom blocks and a teachers cottage at Gobakhulu Primary School in Jotsholo, Lupane district on Tuesday.\n\nThe project was funded byJapans Grant Assistance for Grassroots Human Security Projects (GGP) programme, with an investment of approximately US$72,000.\n\nLet me take this opportunity to highlight that the support for this project is part of the broader approach of Japan on Zimbabwe that focuses on the provision of quality school infrastructure and promoting positive nurturing of young people in schools as our government believes education is key to the future development of this country, said Ambassador Yamanaka.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-25-at-12.20.41_ad70cb46-680x380.jpg",
            "description": "Sikhumbuzo Moyo in Jotsholo THE Japanese Embassy in Zimbabwe has reaffirmed its commitment to the improvement of school infrastructure and fostering a supportive environment for youth in education. The commitment was made by the Japanese Embassy in Zimbabwe Ambassador, Mr Shinichi Yamanaka during the commissioning of two classroom blocks and a teachers’ cottage at Gobakhulu Primary School […]",
            "time": "21:46",
            "date": "25 Mar 2025"
        }
    ]
}