{
    "news": [
        {
            "title": "ZACC arrests four ZIMRA officials for corruption",
            "url": "https://www.chronicle.co.zw/zacc-arrests-four-zimra-officials-for-corruption/",
            "content": "Online Writer\n\nFOUR Zimbabwe Revenue Authority (ZIMRA) officials have been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) on allegations of extorting a transport operator for the release of an impounded bus during an ongoing anti-smuggling operation.\n\nThe suspects, identified as Revenue Officers Maguta, Mitwira, Homera, and Gwatirinda, face charges of extortion or criminal abuse of duty as public officers.\n\nAccording to ZACC spokesperson Ms Simiso Mlevu, a bus belonging to Best Express Logistics was seized during the operation, and the company was instructed to pay Customs Duty of ZiG55 000 . Despite the duty being settled, the accused allegedly demanded a bribe of US$6 000 from Ms Beatrice Maramwidze, a director at the company, to facilitate the vehicles release from BAK Storage in Harare.\n\nMs Maramwidze reported the matter to ZACC, leading to an undercover investigation. The accused were apprehended after accepting a US$1 500 bribe in a ZIMRA-branded vehicle. A subsequent search of the vehicle uncovered an additional US$3 951, believed to be proceeds from other extortion activities.\n\nThe suspects are detained at Avondale Police Station and are expected to appear in the Harare Magistrates Court on Friday, 11 January 2025.\n\nZACC has urged the public and business community to report acts of corruption via WhatsApp at +263719529483 under the theme: Refuse, Resist, Report Corruption.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/08/Zacc.jpg",
            "description": "Online Writer FOUR Zimbabwe Revenue Authority (ZIMRA) officials have been arrested by the Zimbabwe Anti-Corruption Commission (ZACC) on allegations of extorting a transport operator for the release of an impounded bus during an ongoing anti-smuggling operation. The suspects, identified as Revenue Officers Maguta, Mitwira, Homera, and Gwatirinda, face charges of extortion or criminal abuse of […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "OK Zimbabwe assures stakeholders amid supply challenges",
            "url": "https://www.chronicle.co.zw/ok-zimbabwe-assures-stakeholders-amid-supply-challenges/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nLEADING retailer OK Zimbabwe has reassured stakeholders of its continued viability as a business despite experiencing intermittent product supply challenges during the festive season.\n\nThe company has pledged to restore normal supply levels while working to stabilise the trading environment in collaboration with key partners.\n\nIn a statement, Group Company Secretary Mrs Margaret Munyuru said the retailer remains committed to serving its customers and contributing to the countrys economic growth.\n\nAlthough the company faced intermittent product supply challenges during the festive period, we continue to serve our loyal customers and contribute to the economic growth and development of Zimbabwe, she said.\n\nMrs Munyuru expressed gratitude to supplier partners, bankers, and other stakeholders for their support during a period marked by a volatile operating environment.\n\nWe are actively engaged with our suppliers and key stakeholders, including industry associations and regulators, to restore supplies to normal levels. Simultaneously, we are working on long-term solutions to stabilize the trading environment, she added.\n\nMrs Munyuru also reaffirmed the companys commitment to transparency and open communication with all stakeholders.\n\nOur corporate pledge is to make happiness tangible by planting smiles on our employees, customers, suppliers, shareholders, and the communities we operate in. Should there be any updates or announcements regarding the companys financial status, they will be communicated through appropriate channels in a timely and responsible manner, she said.\n\nThe challenges faced by OK Zimbabwe highlight broader difficulties within the formal retail sector, which continues to grapple with competition from the growing informal economy. Calls for the formalisation of businesses have intensified as the informal sector increasingly undermines the viability of established retailers.\n\nMajor players across various sectors, including food, clothing, textiles, and footwear, have reported declining performance due to the influx of non-duty-paying imports and counterfeit goods.\n\nLast year, Truworths, a prominent player in the textile industry, revealed that its business was struggling to compete with cheap imports priced below local manufacturing costs. Similarly, hardware shops and other formal enterprises face stiff competition from informal traders importing goods without adhering to local tax and duty regulations.\n\nStakeholders have urged the government to take decisive action to address the informalisation of the economy, warning that the continued growth of the informal sector risks destabilising Zimbabwes formal retail and manufacturing industries.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Ok-Zimbabwe.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw LEADING retailer OK Zimbabwe has reassured stakeholders of its continued viability as a business despite experiencing intermittent product supply challenges during the festive season. The company has pledged to restore normal supply levels while working to stabilise the trading environment in collaboration with key partners. In a statement, Group Company Secretary Mrs […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "President urges students to raise Zimbabwe flag high",
            "url": "https://www.chronicle.co.zw/president-urges-students-to-raise-zim-flag-high/",
            "content": "Wallace Ruzvidzo,Harare Bureau\n\nPRESIDENT Mnangagwa has implored students on Government-to-Government scholarship programmes outside the country to raise the Zimbabwean flag as they are not just going to study but represent the country as its Ambassadors.\n\nYesterday, the President saw off five beneficiaries of an Algerian scholarship programme extended to him by his counterpart, Abdelmadjid Tebboune.\n\nThe five students are Natasha Deni, Bukhosi Maphosa, Albert Jakarasi, Melogina Mano and Tinovimbanashe Kamutero.\n\nThey will be studying in various fields including Science, Technology, Engineering and Medicine, areas which the President said were crucial in Zimbabwes development matrix.\n\nIn his send-off remarks at State House in Harare, President Mnangagwa charged the students to make the country proud in their endeavours.\n\nYou are now Ambassadors of our motherland Zimbabwe as you go for this programme in Science, Technology, Engineering and Medicine. These are very critical fields for developing countries like Zimbabwe so you must consider yourselves very lucky to have been selected. When you are there you individually and collectively become Ambassadors of our country. So never think that you are an individual, wherever you are, you are actually representing us, he said.\n\nZimbabweans are known the world over for their hard work and tenacity, something President Mnangagwa said the students should showcase.\n\nMukanyadzisa muri ikoko hamuna kunyadzisa vabereki venyu chete, matonyadzisa nesuwo ende kana madaro tinozonetsekana mangwana kuti titume here vamwe (If you act in an unbecoming manner during your stay in Algeria know that you have not only let your parents down but the nation at large and it will be difficult for us to send more students).\n\nSaka garai muchiziva kuti wakamirira nyika, hauna kuzvimirira pachako (You should always know that you are representing the country, you are not representing yourself).\n\nYou must go ahead and show the values of hard work. You must show that you are coming from a hard-working country. You must commit yourself to why you are there, he said.\n\nYou must go there with determination and courage and a sense of pride. Wherever Zimbabwean students go, they perform very well, we have that record across the world.\n\nPresident Mnangagwa said the scholarships were a testament to the cordial relations between Harare and Algiers.\n\nZimbabwe and Algeria have a longstanding relationship that continues to deepen. We have consolidated our relations and this is why we have this offer because our relationship is strengthening and is becoming more and more comprehensive.\n\nI wish to congratulate you students on your study assignment in Algeria.\n\nWe have a very long standing relationship with Algeria and the students that have gone before you behaved very well and upheld the good relations between us (Zimbabwe and Algeria), he said.\n\nI hope you will not be the group that will spoil that relationshipif that happens, our prisons are not full.\n\nPresident Mnangagwa shared a lighter moment with the students.\n\nPresident Mnangagwa\n\nJust think of it as you are representing ED, its a tall order so you must always keep that in mind. As you represent us in foreign lands, you should know you are not representing yourself. You are representing us.\n\nAnd before you sleep, you should pray and say, I am representing ED so I must do my best, said the President light-heartedly.\n\nwhen you come back here, its either I will give you a red carpet and congratulate you or you spend a few days behind bars for misrepresenting us.\n\nHe also encouraged the students to cherish the scholarship opportunity as it was not something to take for granted.\n\nSo as you go ahead, you must embrace every opportunity you find so that you can bring such experience back home for the benefit of developing our country. You are only very few.\n\nThe students in this country of your age, with your qualifications, are so many, but you have been found fit to take up this challenge.\n\nYou have been given guidance by your parents that you will not be representing your families but Zimbabwe, the President said.\n\nAs beneficiaries of the cordial relations between Zimbabwe and Algeria, President Mnangagwa encouraged the students to hoist the countrys flag high as this would see more scholarship opportunities being availed.\n\nYou see, these scholarships are a testament to the relationship between Zimbabwe and Algeria.\n\nIf you carry yourself in high esteem during your time there we will certainly get more scholarships because of our good mannerisms. If you do not represent us well then they will just reduce the number, he said.\n\nPresident Mnangagwa also had some words for the students parents and guardians who were present during the send-off.\n\nTo the parents, do not expect financial benefits while the children are in Algeria, these children are going to school so you are the ones who should actually send them money, he said.\n\nAlgerian Ambassador to Zimbabwe Mohamed Seoudi said Zimbabwe was more than a friend to Algeria hence the continuous extension of scholarships.\n\nOur relations (with Zimbabwe) are going on excellently and what is better than the building of human resources? That is why Algeria is giving Zimbabwe more than 100 scholarships each year including these ones extended to the President from his brother (Algerian President).\n\nLike the President says, nyika inovakwa nevene vayo. Algeria is very committed to countries on the African continent like Zimbabwe who are more than friends to us, he said.\n\nOne of the beneficiaries, Natasha Deni, said she was elated to have been accorded the scholarship.\n\nI am 20 and I was overjoyed, excited and most of all grateful to God for awarding me this opportunity and also to the President for this scholarship opportunity, she said.\n\nAnother student, Melogina Mano, said she was grateful for the opportunity.\n\nI am very happy because this is not an opportunity accorded to many, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-1-copy-3.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau PRESIDENT Mnangagwa has implored students on Government-to-Government scholarship programmes outside the country to raise the Zimbabwean flag as they are not just going to study but represent the country as its Ambassadors. Yesterday, the President saw off five beneficiaries of an Algerian scholarship programme extended to him by his counterpart, Abdelmadjid Tebboune.  […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "BCC identifies flooding hotspots: Urges teachers to release pupils early when it rains",
            "url": "https://www.chronicle.co.zw/bcc-identifies-flooding-hotspots-urges-teachers-to-release-pupils-early-when-it-rains/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nWITH schools set to reopen next Tuesday for the 2025 first term, the Bulawayo Fire Brigade has raised alarm over several rivers and streams that pose significant risks to schoolchildren crossing to and from school during this rainy season.\n\nThe Meteorological Services Department (MSD) has forecasted normal to above-normal rainfall, with intensifying rains expected between this month and March. Past incidents have seen the Fire Brigade rescuing children stranded or worse, drowning while attempting to cross flooded rivers and streams.\n\nTo prevent tragedies, Bulawayo chief fire officer Mr Mhlangano Moyo said they have identified nine high-risk waterways where parents and guardians should ensure their children take extra precautionsduring this rainy season.\n\nPhekiwe River, which separates Emganwini, Nketa and Nkulumane 12 suburbs and stretches to Rangemore, is one of the most dangerous streams. It has posed significant challenges for the Fire Brigade during past rainy seasons, said Mr Moyo.\n\nRangemore, a rapidly growing suburb, faces a shortage of schools, forcing parents to enrol their children in nearby areas such as Nketa and Nkulumane. Children are therefore forced to cross the Phekiwe River, increasing their risk when its flooded.\n\nKhami River just after Solusi turn off (along the Bulawayo-Solusi Road) has also claimed the lives of children staying at the plots around the area. Ngwenya Ponds between Pumula South and Pelandaba West suburbs is also another problematic stream when it rains in the area and parents should assist their children to cross it, said Mr Moyo.\n\nHe said residents, especially school children, should also avoid crossing a stream in Pumula South suburb near the Roman Catholic Church and another one in the Mthunzini suburb when flooded.\n\nIn Entumbane suburb between the C section and the Entumbane B area, there is another stream where the Fire Brigade has been called on numerous occasions to assist stranded residents, especially schoolchildren when the area receives significant rainfall, he said.\n\nIn the eastern areas, the Mahatshula North stream has also been cited as a dangerous waterway for kids crossing to Queenspark East and Woodville on their way to and from school well as Trenance Stream near Harrisvale suburb.\n\nMazayi River, which is one of the longest rivers that meanders across the city is another under estimated water body but extremely dangerous as it has claimed lives in the past.\n\nLast year Sakhile stream that separates Nketa and Nkulumane 9 suburbs claimed the life of a Grade Four pupil and we advise parents to be vigilant when that area receives rains,said Mr Moyo.\n\nHe urged parents to pick up their children from school during the rainy season to avoid cases of children taking risks by crossing flooded rivers or streams.\n\nTeachers and school authorities should also release children early when it is raining, said Mr Moyo.\n\nMeanwhile, Bulawayos Civil Protection Unit (CPU) in collaboration with several civic society groups is conducting awareness campaigns aimed at educating residents on flood safety.\n\nThe initiative, which involves key partners such as the World Food Programme, Ministry of Health and Child Care, Africa Ahead, Danish Church Aid (DCA) and Bulawayo Fire and Ambulance Services, is meant to empower communities with information to mitigate the risks associated with flooding.\n\nThe residents are urged to avoid crossing flooded streams or rivers and driving through submerged bridges.\n\nIt is also important for residents to ensure a perimeter wall has a weep hole to provide an outlet for water to drain and avoid flooding.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/65.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  WITH schools set to reopen next Tuesday for the 2025 first term, the Bulawayo Fire Brigade has raised alarm over several rivers and streams that pose significant risks to schoolchildren crossing to and from school during this rainy season. The Meteorological Services Department (MSD) has forecasted normal to above-normal rainfall, with intensifying rains […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": ". . . Homes and school damaged by rains",
            "url": "https://www.chronicle.co.zw/homes-and-school-damaged-by-rains/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE rainy season has left several homes in Bulawayo and a primary school damaged, although no injuries or fatalities have been recorded, according to statistics from the Bulawayo Fire Brigade.\n\nThe most significant damage occurred in Barbourfields suburb, where roofs were blown off several homes, and at Mahlabezulu Primary School in Tshabalala, which lost the roof of a classroom block. In addition, multiple trees were uprooted or fell in neighbourhoods such as Kumalo, Parklands, North End and Killarney.\n\nIn the citys central business district (CBD), a tree collapsed onto a parked commuter omnibus taxi at the corner of Sixth Avenue and Fort Street in November last year.\n\nThe Bulawayo Fire Brigade has responded to several calls in Barbourfields suburb, particularly at Ntabazinduna Flats, where the roofs of four homes have been damaged since the onset of the rainy season.\n\nMrs Lorraine Ndaba, a resident of Ntabazinduna Flats, recounted waking up to a deafening noise as strong winds tore off asbestos sheets from her roof.\n\nThe rains were accompanied by gusty winds, and asbestos sheets from our roof were ripped away. The Fire Brigade arrived and covered the exposed area with a green nylon fabric to protect our belongings from being soaked, said Mrs Ndaba, who lives with her sister and six children.\n\nA flooded house in Mahatshula North\n\nHowever, replacing the damaged asbestos sheets remains a challenge due to their unavailability at local hardware stores.\n\nSince our flats were built decades ago, the specific type of asbestos sheets we need is no longer in stock. I have no idea what Ill do if the Fire Brigade reclaims the nylon fabric covering the roof, said Mrs Ndaba.\n\nA stones throw from her house, another home at Ntabazinduna Flats lost a portion of its roof and is also covered by a huge nylon fabric.\n\nIn Tshabalala, Mahlabezulu Primary School suffered a similar misfortune when the roof of a classroom block was blown off last month. With schools reopening soon, pupils from the damaged classroom block will need to be accommodated elsewhere within the school during repairs. Miss Margaret Moyo, a parent, expressed her concerns.\n\nIts understandable that no one could have anticipated this damage. I hope parents are informed about how much we need to contribute for the repairs so they can be completed quickly, she said.\n\nBulawayo Fire Brigade chief fire officer Mr Mhlangano Moyo confirmed the damage across Barbourfields and Tshabalala suburbs since the onset of the rainy season.\n\nThe Fire Brigade responded to incidents at house numbers 190, 192, and 204 at Ntabazinduna Flats, another home at house number 127 in Barbourfields, and Mahlabezulu Primary School in Tshabalala, he said.\n\nLast November, six homes in Mahatshula North were submerged during a heavy downpour. Household property was damaged as water flooded the residences. The emergency teams had to create weep holes in perimeter walls to drain excess water effectively.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-2-copy-1.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  THE rainy season has left several homes in Bulawayo and a primary school damaged, although no injuries or fatalities have been recorded, according to statistics from the Bulawayo Fire Brigade. The most significant damage occurred in Barbourfields suburb, where roofs were blown off several homes, and at Mahlabezulu Primary School in Tshabalala, which […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "Depleted Simba Bhora replenish. . . new faces, new coach, new ambition",
            "url": "https://www.chronicle.co.zw/depleted-simba-bhora-replenish-new-faces-new-coach-new-ambition/",
            "content": "Innocent Kurira,[emailprotected]\n\nDEFENDING Castle Lager Premier Soccer League champions Simba Bhora have made a bold move by releasing 13 first-team players, including Soccer Star of the Year, Walter Musona, who has joined newcomers Scottland alongside goalkeeper Talbert Shumba, Tichaona Chipunza, Tymon Machope and Vassili Kawe.\n\nThe mass exodus also includes experienced players, Partson Jaure, Mthokozisi Msebe, Tymon Mvula, Perfect Chikwende, Valentine Musarurwa, Albert Manenji, Simbarashe Maramwidze, Onifade Obubaka, and Talent Chawapiwa.\n\nTo replenish their depleted squad, Simba Bhora secured the signatures of goalkeepers Tonderayi Mateyaunga from CAPS United and First Gandisani (Bikita Minerals), defenders Carlos Mavhurume (Ngezi Platinum Stars) and Kelvin Gwao, midfielder Liberty Chakaroma (Manica Diamonds), and striker Malvin Hwata (Chicken Inn). Additionally, Trevor Mavhunga, Donald Mudadi (Dynamos), and Never Tigere (Ngezi Platinum) have also joined the club.\n\nAccording to Simba Bhora spokesperson Charles Nyatsine, the club remains calm and focused despite the significant squad overhaul.\n\nSimba Bhora players salute fans after winning the 2024 PSL championship\n\nHe said they are confident in there ability to rebuild and compete at the highest level.\n\nWe have parted ways with some of our top players, but we have also brought in some exciting new talent. We believe our new signings will help us maintain our competitive edge and make a strong impression in the Caf Champions League, said Nyatsine.\n\nIn football, there are numerous talented players waiting for an opportunity to showcase their skills. Our challenge is that we often focus on established stars, neglecting the young and unknown players eager to make a name for themselves.\n\nWe have brought in a mix of experienced and new players, and I am confident they will seize the chance to prove themselves. Take Machope, for example, he was unknown before joining Simba Bhora, but he made an instant impact. Its all about what the coach, technical team, and entire squad offer to help players showcase their talent, he said.\n\nNyatsine is confident the team will excel despite losing several players.\n\nThe club has also appointed former Dynamos assistant coach Joel Luphahla as its new head coach, replacing Tonderai Ndiraya who joined Scottland.\n\nLuphahlas experience and expertise will be crucial in guiding Simba Bhora through their maiden Caf Champions League campaign.\n\nCoach Luphahla has a wealth of experience. Hes worked as an assistant coach and had a successful stint at Highlanders. With the support of the management, fans and the team, I believe he will make a significant impact next season.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/adg-1.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw DEFENDING Castle Lager Premier Soccer League champions Simba Bhora have made a bold move by releasing 13 first-team players, including Soccer Star of the Year, Walter Musona, who has joined newcomers Scottland alongside goalkeeper Talbert Shumba, Tichaona Chipunza, Tymon Machope and Vassili Kawe. The mass exodus also includes experienced players, Partson Jaure, […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "US$3 000 bribe seeking magistrate convicted",
            "url": "https://www.chronicle.co.zw/us3-000-bribe-seeking-magistrate-convicted/",
            "content": "Trish Mukwazo,[emailprotected]\n\nA GWANDA magistrate who solicited US$3 000 from a businessman has been convicted of bribery.\n\nTalent Phiri (35), of Mount Cazalet suburb, was convicted of criminal abuse of duty as a public officer by Harare regional magistrate Mr Farai Gwitima sitting at the Tredgold Magistrates Court in Bulawayo. Mr Gwitima heard the case after Bulawayo magistrates recused themselves.\n\nIn delivering the verdict, Mr Gwitima stated: All the witnesses presented sufficient evidence, and the offender was caught red-handed. The States case was credible, and accordingly, the accused is found guilty.\n\nPhiri was remanded in custody pending sentencing today. In mitigation, Phiris lawyer, Mr Prince Butshe Dube of Mathonsi Ncube Law Chambers, pleaded for a lenient sentence. He argued that Phiri was a first-time offender who had already lost his job and was the sole breadwinner for his wife and three children.\n\nProsecuting, Mr Acumen Khupe told the court that the offence occurred after Phiri granted an interim protection order to Mrs Qiniso Ncube against her former husband, Mr Lungisani Two minutes Ncube, on August 27 last year.\n\nAs per standard procedure, a warrant of arrest for Mr Ncube was attached to the protection order.\n\nOn September 4, around 5PM, Phiri called Mr Ncube, claiming he wanted to assist him in his domestic violence case. Phiri falsely alleged that officers from the Presidents Office, police, and the National Prosecuting Authority were involved in the case and wanted Mr Ncube jailed.\n\nPhiri then demanded a US$3 000 bribe to prevent Mr Ncube from being sent to remand prison.\n\nThe complainant informed Phiri that he would try to raise the money, but Phiri persistently called to demand it, said Mr Khupe.\n\nThe court heard that during one of their phone conversations, Mr Ncube negotiated the amount down to US$2 500. Phiri instructed him to deliver the money to his residence in Mount Cazalet at 6AM the following day.\n\nMr Ncube reported the matter to the police, providing audio recordings of his conversations with Phiri. A trap was set up, with the trap money photocopied and certified.\n\nThe following morning, the police accompanied Mr Ncube to execute the sting operation. Phiri was arrested at his residence after accepting the trap money. The cash was recovered from the right pocket of his boxer shorts.\n\nIn his closing arguments, Mr Khupe highlighted the severity of Phiris actions, saying Phiri abused his position as a judicial officer, exploiting court proceedings for personal gain.\n\nSuch conduct erodes public confidence in the justice system and warrants a fitting sentence, said Mr Khupe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/abg.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com  A GWANDA magistrate who solicited US$3 000 from a businessman has been convicted of bribery. Talent Phiri (35), of Mount Cazalet suburb, was convicted of criminal abuse of duty as a public officer by Harare regional magistrate Mr Farai Gwitima sitting at the Tredgold Magistrates Court in Bulawayo. Mr Gwitima heard the case […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "Unclaimed pension benefits surge",
            "url": "https://www.chronicle.co.zw/unclaimed-pension-benefits-surge/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nINSURANCE and Pensions Commission (Ipec) has revealed that unclaimed benefits in the pensions industry surged to US$10,18 million in the first nine months of 2024, marking a 69 percent increase compared to US$6,04 million recorded during the same period in 2023.\n\nIpec attributed the sharp rise in unclaimed benefits to under-reporting by some pension fund administrators in the prior year.\n\nUnclaimed benefits as of September 30, 2024 amounted to US$10,18 million (ZWG253,39 million) compared to US$6,04 million reported as of September 30, 2023, representing a nominal increase of 69, reads a report accompanying the sectors performance in the nine months of 2024.\n\nAdditionally, the total membership with unclaimed benefits increased by 7,6 percent to 102 882 members, compared to 95 619 members as at September 30, 2023.\n\nThe age analysis of unclaimed benefits revealed that 68 percent of the total liability pertained to benefits unclaimed for over 10 years. According to the Administration of Estates Act (Chapter 6:01), administrators are required to remit all unclaimed benefits exceeding five years to the Guardian Fund.\n\nThe commission continues to encourage the industry to comply with the above requirements by ensuring that all unclaimed benefits that are in the over five years category are remitted to the Guardian Fund as expected.\n\nThe third quarter of 2024 saw a decline in pension-related complaints, with 83 complaints lodged compared to 98 in the previous quarter. The complaints were distributed as follows: 33 in July, 35 in August and 15 in September.\n\nFor the period under review, 81 percent of the complaints related to either unpaid pension benefits (46 percent) or low pension benefits (35 percent), said Ipec.\n\nThe most common complaints are delays in payments of pension benefits, low monthly pension benefits as well as low full commutation values under the defined contribution schemes.\n\nIpec said 14 complex complaints, which is 17 percent of the total complaints were received during the quarter, mainly pertaining to the pre-2009 compensation, non-remittance of contributions as well as the 2019 currency conversion.\n\nCompensation payments to pensioners whose savings were eroded during the hyper-inflationary period between 2007 and 2009 were deferred due to non-compliant submissions. Payments were initially scheduled to commence in March 2023 under Statutory Instrument 162 of 2023 (Compensation for Loss of Pre-2009 Value of Pension Benefits Regulations).\n\nTrend of unclaimed benefits in US$ equivalent\n\nThe hyper-inflationary period between 2007 and 2009 severely eroded the value of savings, including pensions. In response to stakeholder concerns, the Government in 2025 established a commission of inquiry to investigate the causes and extent of the loss of value in life insurance policies and pensions following the 2009 currency conversion.\n\nThe commission, led by retired judge, Justice George Smith, found that many policyholders and pensioners were prejudiced during the conversion process. It recommended compensation for affected individuals.\n\nFollowing the gazetting of the compensation framework in 2023, Ipec urged the industry to submit compensation plans for approval. However, by March 2024, none of the 1 249 assessed compensation schemes had been approved due to non-compliance with Statutory Instrument 162 of 2023(compensation regulations).  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-5-copy.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  INSURANCE and Pensions Commission (Ipec) has revealed that unclaimed benefits in the pensions industry surged to US$10,18 million in the first nine months of 2024, marking a 69 percent increase compared to US$6,04 million recorded during the same period in 2023.  Ipec attributed the sharp rise in unclaimed benefits to under-reporting by some […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "Rescheduled Ingutsheni Annual Cake Day to be bigger and better – Mazibuko",
            "url": "https://www.chronicle.co.zw/rescheduled-ingutsheni-annual-cake-day-to-be-bigger-and-better-mazibuko/",
            "content": "Showbiz Correspondent\n\nSIPHO NaZoe Mazibuko has confirmed that her rescheduled third annual philanthropic endeavour at Ingutsheni Central Hospital will take place on January 31 and will be bigger and better than before.\n\nIngutsheni-Central-Hospital-in-Bulawayo\n\nOriginally scheduled for Tuesday, the Annual Cake Day at St Marys Ward at Ingutsheni Central Hospital has received a major boost, with Something Sweet Caf owner Gugu Dube pledging a donation of 10 cakes to feed 100 patients out of the total 120.\n\nIn an interview with Chronicle Showbiz, Dube explained that the institution is close to her heart, and that has been her motivation to help psychiatric patients.\n\nWell, Ive always had a heart for Ingutsheni, and with my team, were working on a soup kitchen project. Were not yet sure when it will start, but it will be soon.\n\nMy younger sister did her accounting attachment at Ingutsheni and shealways came home with sad, heartbreaking stories from there. It motivates us to help our fellow human beings, she said.\n\nMazibuko, a former model and mental health activist, was once admitted to the facility over a decade ago.\n\nMazibuko urged more bakers to join the initiative.\n\nThe rescheduling of the event was necessitated by the numerous pledges of donations set to arrive later this month. Most of the time, those with psychiatric problems are neglected and alienated, leaving them sad, which doesnt aid their recovery.\n\nThis is why I started this endeavour, and I would like to urge other bakers and well-wishers to join me in putting a smile on those who need it most. I anticipate a bigger and better event this year, with more donations, fun and cheer, she said.\n\nFurthermore, the initiative will now include creatives from Khaya Arts Productions, who will offer entertainment on the day.\n\nThese include Mzoe7 and Amaqaqa Music.\n\nMzoe7\n\nAmaqaqa Musics Khulekani Khabo said performing there would be part of their civic duty.\n\nYes, we will be doing a charity performance there (at Ingutsheni Central Hospital). It is one of our aims to have a hand in anything that gives back to the community.\n\nIt is important for creatives to be part of philanthropic work because it helps them stand out and shows that being less privileged means nothing, he said.\n\nHe also added that, musically, the Imbube and Isicathamiya ensemble will be touring in and around the country, as well as abroad and will record a piece next month, along with their Imbube Festival under the theme, Our Roots,Our Culture, with dates yet to be announced.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/awert.jpg",
            "description": "Showbiz Correspondent SIPHO “NaZoe” Mazibuko has confirmed that her rescheduled third annual philanthropic endeavour at Ingutsheni Central Hospital will take place on January 31 and will be bigger and better than before. Originally scheduled for Tuesday, the “Annual Cake Day” at St Mary’s Ward at Ingutsheni Central Hospital has received a major boost, with Something […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        },
        {
            "title": "Second Republic completes 8 000 projects",
            "url": "https://www.chronicle.co.zw/second-republic-completes-8-000-projects/",
            "content": "Farirai Machivenyika,Harare Bureau\n\nGOVERNMENT has completed over 8 000 projects countrywide since the advent of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday.\n\nSpeaking during a media tour of some of the projects in Manicaland Province, Dr Muswere said so much had been achieved in a short space of time.\n\nHe was accompanied by Manicaland Provincial Affairs and Devolution Minister, Advocate Misheck Mugadza.\n\nMinister of State for Provincial Affairs and Devolution for Manicaland Advocate Misheck Mugadza\n\nProjects toured include the far-reaching new National Pharmaceutical Company warehouse, the solar project at Victoria Chitepo Provincial Hospital, Mega Market, the new Registry Office and the site where two silos are being constructed.\n\nA total of 8 000 projects have been successfully completed from 2017, when His Excellency the President assumed office. You will all agree with me that so much has been achieved in a short space of time. We have had, for the year 2024, 346 projects that were completed, he said.\n\nDr Muswere said the thematic committee on National Development was also in the process of identifying some of the projects that were completed last year.\n\nSome of the projects also include, during the period when we had Cyclone Idai, when initiatives were put in place in order to reconstruct the infrastructure, especially the roads and the bridges, and the bulk of that work was done by the Government of Zimbabwe under the leadership of President Mnangagwa, he said.\n\nDr Muswere said some of the projects being implemented were a sign of the Governments commitment to devolution.\n\nWe are also travelling to the Passport Office, which also speaks to the devolution and decentralisation of services in our country. We know that decentralisation and devolution are part of the revolution that the Second Republic has put in motion and ensured that it becomes a success story, he said.\n\nDr Muswere said through decentralisation, Manicaland had hosted Independence Day celebrations in Murambinda, Buhera.\n\nAdv Mugadza said the opening of the Natpharm warehouse had addressed logistical challenges in the storage of medicines.\n\nWe are now able to safely store drugs and ensure their availability at our hospitals and clinics. We are also now in a position to store drugs coming through Beira, he said.\n\nManicaland Provincial Registrar, Ms Joyce Munamati, said their new offices would be completed in the first quarter of this year.\n\nThe construction of the building is expected to be complete by the end of the first quarter. The construction of the new offices is being done in line with the devolution policy and President Mnangagwas philosophy of leaving no one and no place behind, she said.\n\nCurrently, the Registry is operating from wooden cabins, with some Mutare residents travelling to Marondera or Chipinge to obtain identity documents.\n\nAllied Timbers chief operations officer, Mr Ian Zimunya, said their operations had benefited from equipment procured from Belarus.\n\nWe are now operating at between 80 and 85 percent through equipment procured from Belarus, he said.\n\nAt GMB, Engineer Willard Chirunga said they expect to complete the first silo before the end of the year.\n\nWe hope to complete the foundation works by April and install the prefabricated materials by October, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-2-copy.jpg",
            "description": "Farirai Machivenyika, Harare Bureau GOVERNMENT has completed over 8 000 projects countrywide since the advent of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday. Speaking during a media tour of some of the projects in Manicaland Province, Dr Muswere said so much had been achieved […]",
            "time": "09:29",
            "date": "10 Jan 2025"
        }
    ]
}