{
    "news": [
        {
            "title": "Alexander ‘Cool Ruler’ Maseko salutes DeMbare for VIP treat!",
            "url": "https://www.chronicle.co.zw/alexander-cool-ruler-maseko-salutes-dembare-for-vip-treat/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nFOOTBALL legend Alexander Cool Ruler Maseko has heaped praise on Harare giants Dynamos for rolling out the red carpet for him during their league clash against Simba Bhora at Rufaro Stadium on Sunday.\n\nThe revered former Highlanders defender, now based in South Africa, took to social media to express his gratitude for the VIP treatment.\n\nI would like to thank Dynamos officials who gave me a warm welcome when I was in Harare for a few days on family matters. I made one phone call to Mashingaidze, who then contacted Chikomo. In no time, I received a call back confirming their pleasure in inviting me to the game against Simba Bhora.\n\nThank you so much for hosting me, and keep up the good work, Maseko posted on his Facebook timeline.DeMbare, meanwhile, bagged their first three points of the season with a hard-fought 1-0 win, courtesy of a 54th-minute strike from midfielder Shadreck Nyahwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Alexander-Cool-Ruler-Maseko-1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw FOOTBALL legend Alexander “Cool Ruler” Maseko has heaped praise on Harare giants Dynamos for rolling out the red carpet for him during their league clash against Simba Bhora at Rufaro Stadium on Sunday. The revered former Highlanders defender, now based in South Africa, took to social media to express his gratitude for […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "ZEC appoints new Chief Elections Officer",
            "url": "https://www.chronicle.co.zw/zec-appoints-new-chief-elections-officer/",
            "content": "Peter Matika,[emailprotected]\n\nThe Zimbabwe Electoral Commission (ZEC) has appointed Mr Simbarashe Tongayi as the substantive Chief Elections Officer, effective April 1.\n\nThe appointment comes after the retirement of Mr Utoile Silaigwana in December last year.\n\nIn a statement, ZEC highlighted that Mr Tongayi had been serving as the acting CEO since Mr Silaigwanas retirement.\n\nHe previously held the position of Deputy CEO responsible for Administration, where he played a crucial role in streamlining administrative processes and enhancing organizational efficiency.\n\nMr Tongayi is an experienced expert in public administration and election management, with experience in both regional and international elections. His extensive background positions him well to lead ZEC in achieving its long-term objectives.\n\nBefore his tenure at ZEC, Mr Tongayi was the General Manager of Human Resources and Administration for the National Peace and Reconciliation Commission (NPRC).\n\nHe has over a decade of experience within the Public Service Commission (PSC) secretariat, where he served as both Deputy Manager and District Human Resources Manager.\n\nMr Tongayi is currently a final-year doctoral student in Strategic Management at Chinhoyi University of Technology. He holds a Masters Degree in Human Resources and a Masters Degree in Peace, Leadership, and Conflict Resolution.\n\nHe recently completed a Master of Science in Defence and Security Studies and earned a Bachelor of Science Degree in Social Work. He is also accredited as a facilitator in Building Resources in Democracy, Governance, and Elections (BRIDGE).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/zec.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw The Zimbabwe Electoral Commission (ZEC) has appointed Mr Simbarashe Tongayi as the substantive Chief Elections Officer, effective April 1. The appointment comes after the retirement of Mr Utoile Silaigwana in December last year. In a statement, ZEC highlighted that Mr Tongayi had been serving as the acting CEO since Mr Silaigwana’s retirement. He […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Tourism surpasses mining and agriculture in GDP contribution",
            "url": "https://www.chronicle.co.zw/tourism-surpasses-mining-and-agriculture-in-gdp-contribution/",
            "content": "Rutendo Nyeve,Online Reporter\n\nTHE Ministry of Tourism and Hospitality Industry has emerged as a top performer, contributing 15 percent to the nations Gross Domestic Product (GDP) in 2024, surpassing traditional economic pillars like mining and agriculture.\n\nThis revelation was made during the announcement of the 2024 Performance Evaluation Results for Senior Public Sector Officials, presided over by President Mnangagwa at the State House recently.\n\nThe Ministry of Tourism and Hospitality Industry was acknowledged for its exceptional performance, which included transforming tourism into one of the fastest-growing sectors in the economy among other attributes.\n\nThe Ministry of Tourism and Hospitality Industry is being acknowledged for hosting the inaugural Regional African Gastronomy Forum and facilitating provincial and national cookout competitions.\n\nIt also promoted Zimbabwes tourism through flagship international events such as the World Travel Market, ITB Berlin, and the Sanganai/Hlanganani Expo, which featured exhibitions and gastronomy showcases, reads the summary of results for top performers in the public sector.\n\nThis milestone underscores the sectors resilience and strategic importance in diversifying Zimbabwes economy, aligning with the governments Vision 2030 goals.\n\nMeanwhile, in the local authority category, Gwanda Municipality was recognised for significantly improving water availability for residents, increasing supply from 10 hours per day in 2023 to 17 hours in 2024.\n\nThis achievement reflects the municipalitys commitment to enhancing service delivery and addressing critical infrastructure challenges.\n\nThe Performance Contracting system, introduced in 2021, is a key tool under Vision 2030 to ensure accountability and results-oriented governance. Senior officials, including Ministers, Permanent Secretaries, CEOs, and Mayors, are evaluated quarterly, bi-annually, and annually by an independent consulting firm to maintain objectivity and credibility.\n\nAt the end of each fiscal year, a consolidated report is presented to the High-Level Forum on Public Sector Reforms, the President, and Cabinet.\n\nThe report highlights achievements, performance ratings, and policy recommendations. Top performers are awarded during an annual ceremony, as seen in the recent event.\n\n@nyeve14\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/jmfr.jpg",
            "description": "Rutendo Nyeve, Online Reporter THE Ministry of Tourism and Hospitality Industry has emerged as a top performer, contributing 15 percent to the nation’s Gross Domestic Product (GDP) in 2024, surpassing traditional economic pillars like mining and agriculture. This revelation was made during the announcement of the 2024 Performance Evaluation Results for Senior Public Sector Officials, presided […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Alexander Maseko hails DeMbare for VIP treatment",
            "url": "https://www.chronicle.co.zw/alexander-maseko-hails-dembare-for-vip-treatment/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nFOOTBALL legend Alexander Cool Ruler Maseko has taken to social media to thank Harare giants Dynamos for giving him VIP treatment during their league match against Simba Bhora played at Rufaro Stadium on Sunday.\n\nMaseko a revered Highlanders defender during his time, is now based in South Africa.\n\nI would like to give thanks to Dynamos officials who gave me VIP treatment when I was in Harare for a few days on family issues.I made one phone call to Mashingaidze, who then contacted Chikomo. In no time I received a call back confirming their pleasure of inviting me to the game against Simba Bhora.Thank you so much for hosting me and continue your good work, posted Maseko on his Facebook timeline.\n\nThe Glamour boys collected their first set of three points this season, winning 1-0 through a 54th-minute goal by midfielder Shadreck Nyahwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Alexander-Maseko.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw FOOTBALL legend Alexander Cool Ruler Maseko has taken to social media to thank Harare giants Dynamos for giving him VIP treatment during their league match against Simba Bhora played at Rufaro Stadium on Sunday. Maseko a revered Highlanders defender during his time, is now based in South Africa. “I would like to give […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "No Disruptions: Kombis, buses operate smoothly in Bulawayo",
            "url": "https://www.chronicle.co.zw/no-disruptions-kombis-buses-operate-smoothly-in-bulawayo/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nZIMBABWEANS continued moving about their normal business on Tuesday morning with Kombis plying the Luveve Road route getting to the road as early as 5am.\n\nIt is also normal business at the Entumbane long-distance bus terminus with buses loading passengers to their various rural homes.\n\nMost shops at Entumbane Shopping Complex have also opened for business.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-01-at-07.53.31_6862daad-680x380.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw ZIMBABWEANS continued moving about their normal business on Tuesday morning with Kombis plying the Luveve Road route getting to the road as early as 5am. It is also normal business at the Entumbane long-distance bus terminus with buses loading passengers to their various rural homes. Most shops at Entumbane Shopping Complex have also […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Zimra’s digital tax system TaRMS gains traction as registrations surge by 116%",
            "url": "https://www.chronicle.co.zw/zimras-digital-tax-system-tarms-gains-traction-as-registrations-surge-by-116/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe Zimbabwe Revenue Authoritys [Zimra] digital transformation is sweeping across the countrys tax landscape with nee registrations on the recently introduced Tax and Revenue Management System (TaRMS) surging by 116% since the year 2023.\n\nTaRMS was introduced in December 2023, replacing the e-service system plagued by technical woes.\n\nZimra commissioner General, Ms Regina Chinamasa said on Monday that TaRMS has not only achieved a remarkable 100% uptime but has also ignited a surge in taxpayer engagement, fundamentally changing how businesses and individuals interact with revenue collector.\n\nZimra remains committed to leveraging technology to enhance service delivery, and TaRMS is at the forefront of this transformation, she said.\n\nIn the past year and a half, TaRMS recorded a 116% increase in taxpayer registrations, demonstrating its widespread adoption and effectiveness.The systems impact extends far beyond mere registration figures.\n\nTaRMS has ushered in a new era of convenience and efficiency. All tax returns are now submitted online, eliminating the need for cumbersome manual processes.\n\nFor those without internet access, Zimras nationwide kiosks ensure no one is left behind.\n\nMs Chinamasa said the revenue collector continues to work on bringing a new wave of taxpayer experience.\n\nShe said TaRMS has streamlined registration through integrated validation, minimizing errors and duplication.\n\nReal-time data updates maintain the integrity of taxpayer information, ensuring accuracy and transparency.\n\nThe systems self-service platforms empower taxpayers to manage accounts, update details, and view ledgers 24/7, significantly reducing the need for physical visit, said the commissioner general.\n\nA key innovation is the automated processing of ITF263 (Tax Clearance Certificates), eliminating delays.\n\nFurthermore, the system has successfully registered 637 tax agents, enhancing professional engagement within the tax ecosystem.\n\nShe continued; The integrated payment systems ensure secure and accurate allocation of payments, fostering trust and transparency. TaRMS is not just a transactional tool; its a robust digital infrastructure supporting national revenue management and taxpayer engagement.\n\nThe commissioner general added that TaRMS was built on a foundation of strong cybersecurity, safeguarding sensitive taxpayer data.\n\nThe systems 100% uptime is a demonstration of its reliability and the rigorous testing it has undergone.\n\nShe said it has the ability to handle peak return submissions, coupled with its 24/7 accessibility and real-time account management.\n\nTaRMS is more than just a software upgrade; its a paradigm shift, signalling Zimras dedication to modernizing tax administration and fostering a more efficient and transparent tax environment for all Zimbabweans, she added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tyhythy.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The Zimbabwe Revenue Authority’s [Zimra] digital transformation is sweeping across the country’s tax landscape with nee registrations on the recently introduced Tax and Revenue Management System (TaRMS) surging by 116% since the year 2023. TaRMS was introduced in December 2023, replacing the e-service system plagued by technical woes. Zimra commissioner General, […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Bulawayo residents ignore protests call",
            "url": "https://www.chronicle.co.zw/bulawayo-residents-ignore-protests-call/",
            "content": "Chronicle WritersZIMBABWEANS overwhelmingly chose peace and stability, with daily life across the country remaining undisturbed despite calls for illegal protests by individuals attempting to destabilise the country through online platforms\n\nIn Bulawayo, it was business as usual yesterday with residents going about their normal business activities.\n\nWhile some businesses were initially cautious about opening, probably recalling the past destruction and looting that occurred during 2019 protests, normalcy prevailed as the day progressed. Transport operators continued to ply their routes without disruption and the city centre was a hive of activity in the afternoon.\n\nEarlier in the morning, Tshova Mubaiwa Transport Co-operative chief executive officer, Mr Ndaba Masunda, reassured commuters that there would be no interruption in transport services.\n\nWe did not withdraw our vehicles, we are operating normally as per our timetable and routes. We have no reason to ground our fleet, said Mr Masunda.\n\nA Chronicle news crew visited western suburbs to assess the situation and observed residents going about their daily routines undisturbed. In Cowdray Park, vendors set up their stalls at designated sites around 10AM, resuming their trade without incident.\n\nI wasnt sure what to expect in the morning, especially after what happened last time when shops were looted and cars were burnt. But after seeing that the situation was calm and the police were out in full force, I came to my stall, and its business as usual, said a vendor at the terminus site.\n\nAt Entumbane, Sai Mart Supermarket opened at its usual opening time, serving customers without interruption. Similarly, in Mpopoma, near the Western Commonage Magistrates Court, vendors and shops were fully operational. A similar atmosphere was observed at New Lobengula and the popular koChigumira Shopping Centre in Luveve, where businesses opened their doors to customers. In the city centre, big supermarkets, including OK Zimbabwe, Pick n Pay and Greens were open throughout the day.\n\nIn the Midlands Province, a peaceful atmosphere prevailed in Gweru as residents ignored calls for protests. Minister of State for Midlands Provincial Affairs and Devolution, Owen Ncube, later addressed the media, saying the planned demonstrations had failed to materialise.\n\nI have checked the situation and all districts have reported that its peaceful and people are going about their business,he said.\n\nMinister Ncube said the agenda of the countrys detractors who are calling for the demonstrations, is to disturb the prevailing peace and tranquility that the country is enjoying.\n\nOur people, who have a well-documented history of fighting colonialism know the value of peace and will never be part of this subversive agenda, he said.\n\nMinister Ncube said they will continue to stand with President Mnangagwa to lead the country adding that any attempts to remove a constitutionally elected Government is an insurrection and will be regarded as subversion.\n\nI therefore urge the entire Midlands community including business, public and private sector workers, residents, church fraternity, vendors and civic society to ignore the calls from these misguided individuals who want to destabilise the country, he said.\n\nMinister Ncube said Zimbabwe in general and the Midlands Province in particular, remains united, resolute in support of President Mnangagwas leadership.\n\nIt is, therefore, business as usual here in the Midlands province. Our security sector is on high alert and will deal decisively with any malcontents bent on undermining security, peace and tranquillity being enjoyed by our law-abiding citizens, he said.\n\nIn small towns such as Tsholotsho the shops and other businesses were open.\n\nMr Melusi Ndebele, who runs a lodge and a grocery shop at the business centre, said it was business as usual.\n\nThings are normal here, there was a slow start but shops are open, said Mr Ndebele.Police also issued a statement in the morning urging citizens to go about their normal business as their safety was not only assured but guaranteed.\n\nAt the weekend, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere urged Zimbabweans to go about their business saying law-enforcement agents were on high alert to guarantee security and ensure peace across the country.\n\nHe urged Zimbabweans to ignore calls for protests that are being made by cyber terrorists and fanned through social media, saying the countrys security sector is well-equipped to deal with any mischief.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/xbvnhjmchgmjnbn.jpg",
            "description": "Chronicle Writers ZIMBABWEANS overwhelmingly chose peace and stability, with daily life across the country remaining undisturbed despite calls for illegal protests by individuals attempting to destabilise the country through online platforms In Bulawayo, it was business as usual yesterday with residents going about their normal business activities. While some businesses were initially cautious about opening, […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "‘Let’s continue to ensure peace prevails’",
            "url": "https://www.chronicle.co.zw/lets-continue-to-ensure-peace-prevails/",
            "content": "Rutendo Nyeve,[emailprotected]THE Minister of State for Bulawayo Provincial Affairs and Devolution, Judith Ncube, yesterday commended the citys residents and business community for ignoring calls to participate in illegal protests across the country.\n\nSpeaking to the media at her offices at Mhlahlandlela Government Complex, Minister Ncube commended the province for maintaining peace and stability despite attempts to incite unrest.\n\nThe planned demonstrations orchestrated by former Zanu-PF Central Committee member Mr Blessing Geza, who was recently expelled from the ruling party, failed to materialise as residents chose to go about their daily activities undisturbed.\n\nWe had our meeting with Joint Operations Command (JOC) members trying to assess the situation on the ground. I am so happy to report to you as residents of Bulawayo that our province is peaceful and quiet, said Minister Ncube.\n\nShe acknowledged reports of some schools closing, possibly due to uncertainty surrounding the planned protests, but emphasised that the overall atmosphere in the city remained calm.\n\nOur schools were closed, maybe due to fear of the unknown and as such we are yet to get the details from our education director, said Minister Ncube.\n\nShe said Bulawayo did not experience any disturbances yesterday and commended residents for upholding peace.\n\nWe want to assure the residents of Bulawayo and to inform the entire nation that Bulawayo is peaceful and quiet.\n\nWe never saw and have not received any negative reports. I am happy because Bulawayo people know what they want, said Minister Ncube.\n\nShe urged citizens to continue safeguarding their city and country, emphasising the importance of unity and peace.\n\nI am happy that Bulawayo residents showed that they respect a peaceful environment.\n\nI want to commend our people and say keep it up, this is your Bulawayo, this is your Zimbabwe, let us continue to ensure peace prevails in our nation and city, said Minister Ncube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Minister-Judith-Ncube-1.jpg",
            "description": "Rutendo Nyeve, rutendo.nyeve@sundaynews.co.zw THE Minister of State for Bulawayo Provincial Affairs and Devolution, Judith Ncube, yesterday commended the city’s residents and business community for ignoring calls to participate in illegal protests across the country. Speaking to the media at her offices at Mhlahlandlela Government Complex, Minister Ncube commended the province for maintaining peace and stability […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "COMMENT: Zimbabweans refuse to be used  by detractors to disturb peace",
            "url": "https://www.chronicle.co.zw/comment-zimbabweans-refuse-to-be-used-by-detractors-to-disturb-peace/",
            "content": "Zimbabweans yesterday refused calls by the countrys detractors to stage demonstrations against the Government and instead it was business as usual in cities and towns.\n\nThe citizens whose thrust now is to turn around the economy, refused to be detracted by the countrys enemies who were calling on them to be on the streets to cause mayhem.\n\nThe countrys enemies who seem to have run out of ideas on how to remove the Zanu-PF-led Government through democratic means, hope they can cause anarchy by mobilising citizens to be on the streets demonstrating.\n\nThe Second Republics policies and programmes have made Zimbabwe an investment destination of choice for both foreign and local investors hence these futile attempts to destabilise the prevailing peace and tranquility in order to scare away potential investors.\n\nThe organisers of yesterdays failed demonstrations instilled fear in citizens when they staged mock arson scenes in Harare and Goromonzi last week hence some businesses decided to close to protect their properties. Some transport operators also withdrew their vehicles from the road, fearing they could be attacked by hooligans who take advantage of such demonstrations.\n\nWe want at this juncture to commend Zimbabweans who have refused to be used by selfish individuals who relish to see chaos in this country.\n\nIt has been proved in the past that such senseless demonstrations worsen the peoples plight and it is encouraging that citizens now realise this. Those who are usually hit hard by such demonstrations are businesspersons whose properties are damaged and vendors whose stalls are destroyed and wares looted.\n\nZimbabwe is not a doomed or failed state as alleged by the organisers of yesterdays failed demonstrations. It is a fact that Zimbabwe is endowed with abundant natural resources that can make a difference but this is only possible if investors are confident that their investments are secure.\n\nIt is therefore incumbent upon each and every Zimbabwean to act responsibly and refuse to be used by the countrys detractors to disturb peace, a prerequisite for economic development.\n\nLaw enforcement agents should continue to be on alert, to ensure peace prevails across the country. The organisers of yesterdays failed demonstrations might resort to other means of disturbing the prevailing peace and their efforts should be thwarted.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dvfd.jpg",
            "description": "Zimbabweans yesterday refused calls by the country’s detractors to stage demonstrations against the Government and instead it was business as usual in cities and towns. The citizens whose thrust now is to turn around the economy, refused to be detracted by the country’s enemies who were calling on them to be on the streets to […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        },
        {
            "title": "Who holds the power?…NACZ & Zimura at loggerheads",
            "url": "https://www.chronicle.co.zw/who-holds-the-power-nacz-zimura-at-loggerheads/",
            "content": "Mbulelo Mpofu,Zimpapers Arts and Entertainment Hub\n\nJust when it seemed that the heated debate surrounding the US$150 cover band tariff imposed by the Zimbabwe Music Rights Association (Zimura) had settled following a recent dialogue, new developments have reignited tensions.\n\nThe National Arts Council of Zimbabwe (NACZ) intervened yesterday, calling for the suspension of the contentious fee, but Zimura remains resolute in its stance.\n\nThis dispute stems from Zimuras decision to impose a US$150 licensing fee per show for cover bands, a sharp increase from the previous annual fee of US$50. This move comes despite a meeting two weeks ago that brought together key stakeholders, including representatives from NACZ, Zimura, academics, associations, unions, composers, cover band leaders and intellectual property beneficiaries. Discussions focused on establishing a fair and sustainable tariff structure for cover bands operating in Zimbabwe.\n\nAccording to NACZ, following lobbying from various music institutions addressing concerns over Zimuras proposed tariff, NACZ facilitated what seemed like a productive dialogue with Zimura and other music industry stakeholders. Following the meeting, NACZ expressed satisfaction with the progress and stated that Zimura had shown a willingness to reconsider the fee structure if proper lobbying processes were followed, including direct engagement with composers whose music is performed by cover bands.\n\nLast week, on March 27, NACZ followed this up with a meeting with representatives of copyright holders, who strongly expressed their views on the matter and challenged both NACZ and Zimura to arrive at a solution that holistically protects their rights, ensures copyright infringement is taken seriously and guarantees fair compensation.\n\nThe conclusion was that, at the wider consultation, users of copyrights would be adequately educated on the sanctity of copyrights and their views would be respected. They believe the $150 tariff should be the entry level, and Zimura should charge more for bigger concerts.\n\nNACZ said they had shared with Zimura their intention to invite rights users for this engagement before convening a broader dialogue forum.\n\nHowever, in an unexpected turn of events, Zimura issued a public notice on Friday, reaffirming its stance.\n\nEffective immediately, all performers and organisers must obtain the necessary licences before staging any event featuring protected musical works, Zimura communicated on their social media platforms.\n\nThey also warned they would be conducting nationwide monitoring in collaboration with law enforcement agencies, with legal action against those found violating copyright regulations.\n\nIn response, through a statement issued on Monday, March 31, NACZ executive director Napoleon Nyanhi, criticised the tariff, labelling it punitive. He raised concerns over its implementation process, the change in licence periods and its deviation from international best practices.\n\nNapoleon Napster Nyanhi\n\nFollowing this, NACZ suspended all directives regarding the US$150 tariff, pending further discussions and negotiations.\n\n. . . All directives for payment of the $150 tariff are suspended immediately, pending the conclusion of the registration, dialogue and negotiation processes, Nyanhi said in the statement.\n\nHe also directed Zimura to regularise its registration with NACZ as an arts association.\n\nWe direct that the Zimbabwe Music Rights Association regularises its registration with the NACZ as an arts association, in line with the National Arts Council of Zimbabwe Act Chapter 25:07, read in conjunction with section fourof Statutory Instrument 87 of 2006.\n\nThe National Arts Council of Zimbabwe takes seriously its mandate to foster, develop, and improve the knowledge, understanding, and practice of the arts in Zimbabwe, concluded Nyanhi in the statement.\n\nIn response, Zimbabwe Musicians Union (Zimu) founding president, Edith WeUtonga Katiji, welcomed NACZs intervention.\n\nWe are grateful for this stance by NACZ. It reinforces our concerns about Zimuras mismanagement. In the coming weeks, the real issues surrounding Zimura must be exposed in the best interests of the Zimbabwean music sector. They have acted in bad faith, and this must stop, she said.\n\nHowever, Zimuras executive director, Polisile Ncube-Chimhini, dismissed NACZs position, asserting that Zimura is not legally obligated to register with NACZ.\n\nThe NACZs press statement has no bearing on us. We are not an arts organisation; we are a royalty-collecting body registered under the Companies and Intellectual Property Office of Zimbabwe (CIPZ), a department within the Ministry of Justice, Legal and Parliamentary Affairs.\n\nWe do not report to the Ministry of Sport, Recreation, Arts and Culture.\n\nIn apparent response to Nyanhis claim that Zimura had been engaged regarding the meeting with rightsholders, Ncube-Chimhini said: We were not engaged in any discussions  NACZ simply posted their statement on social media. This holds no legal weight for us. We see this as more of a rant than a directive, she said.\n\nZimuras Board echoed this stance, stating that NACZ had misrepresented the legal requirements governing the organisation.\n\nZimura has operated for 43 years without NACZ registration because it has never been a statutory requirement. We are not obligated to register under two separate Acts of Parliament, the board asserted in a statement.\n\nAs NACZ attempts to mediate the issue, striking a balance between protecting copyright holders and fostering artistic growth remains a challenge. The suspension of the US$150 tariff marks a pivotal moment, but the broader conversation is far from over.\n\nNyanhi appealed for patience and professionalism in discussions surrounding the matter.\n\nWe urge restraint and civility on social media and in all engagements while we work to ensure the intellectual property of musicians is protected and fairly compensated.\n\nZimbabwes music industry is at a crossroads and with neither party willing to back down, the licensing debate continues to unfold with new twists and turns.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Zimura-NACZ-tiff-1.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub Just when it seemed that the heated debate surrounding the US$150 cover band tariff imposed by the Zimbabwe Music Rights Association (Zimura) had settled following a recent dialogue, new developments have reignited tensions. The National Arts Council of Zimbabwe (NACZ) intervened yesterday, calling for the suspension of the contentious […]",
            "time": "09:46",
            "date": "01 Apr 2025"
        }
    ]
}