{
    "news": [
        {
            "title": "Special treat for Mzilikazi kids",
            "url": "https://www.chronicle.co.zw/special-treat-for-mzilikazi-kids/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nLOCAL businessman Mr Terrence Hill of Hlalo Butchery and Supermarket brought smiles to hundreds of Mzilikazi children with Christmas hampers yesterday.\n\nFor the last six years, it has become a tradition for Mzilikazi kids to receive presents from their favourite Father Christmas.\n\nWe do this every year as a way of showing our appreciation to the support that Mzilikazi residents give to the butchery and supermarket.\n\nIts also a chance to tell the little ones to stay away from drugs and substance abuse.\n\nWe gave hundreds of food hampers to the kids, said Mr Hill.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/erh.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com LOCAL businessman Mr Terrence Hill of Hlalo Butchery and Supermarket brought smiles to hundreds of Mzilikazi children with Christmas hampers yesterday. For the last six years, it has become a tradition for Mzilikazi kids to receive presents from their favourite ‘Father Christmas.’ “We do this every year as a way of showing […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zimbabwean brilliance shines at Mister Africa 2024: Future Nyoni claims triple title",
            "url": "https://www.chronicle.co.zw/zimbabwean-brilliance-shines-at-mister-africa-2024-future-nyoni-claims-triple-title/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nIn a dazzling display of elegance and talent, Zimbabwean model Future Nyoni has made history by clinching a remarkable triple title at the prestigious Mister Africa 2024 pageant held in Freetown, Sierra Leone. Emerging as the 2nd Runner-Up Mister Africa International, Mister Southern Africa International, and Heart of Africa, Nyonis achievements highlight his status as a trailblazer in the modeling industry.\n\nThe Mister Africa International 2024 pageant, which took place from Saturday night to the early hours of Sunday, was not just a beauty contest but a comprehensive evaluation of contestants abilities in community engagement, public speaking, talent showcases, and charity initiatives. These challenges aim to foster social responsibility and leadership among participants, making the accolades even more significant.\n\nNyoni, hailing from the breathtaking Victoria Falls in Zimbabwe, has already built an impressive modeling career, previously holding titles such as Mister Zimbabwe and Mister Southern Africa. His latest triumph at Mister Africa 2024 further cements his position as a prominent figure representing Zimbabwe and Southern Africa on the international stage.\n\nThe timing of the pageant coincided with Unity Day in Zimbabwe, a moment that resonated with Nyonis personal mantra, Together we can. This motto underscores the importance of unity and collective action, values that Nyoni embodies through both his modeling career and philanthropic efforts.\n\nExpressing his gratitude, Nyoni said, I extend my sincerest gratitude to the organizers of the Mister Africa International 2024 pageant and the incredible team at House of Twitch for their tireless efforts in making this event a resounding success. Their dedication and passion for African excellence shone brightly throughout the pageant, and I am honored to have been a part of it.\n\nReflecting on his experience, Nyoni noted, Participating in Mister Africa 2024 was truly enriching. I immersed myself in Africas rich cultural heritage, forged lasting bonds with my fellow contestants, and was inspired by their remarkable stories. It was a regal experience, and I am deeply honored to have been part of it.\n\nNyoni also emphasised the importance of maintaining connections with his fellow contestants, stating, We have formed a strong bond, and I am excited to see the amazing things we will achieve together in the future.\n\nBeyond his modeling accolades, Nyoni is a committed philanthropist, focusing on advocating for refugee education. He is actively supporting the construction of classrooms in refugee camps in partnership with the PAWA Foundation, a non-profit dedicated to empowering vulnerable communities across Africa.\n\nEducation is the cornerstone of unlocking human potential, Nyoni asserted.\n\nI urge everyone to join me in supporting this noble cause. Together, we can create a brighter future for these deserving children and empower them to become the leaders of tomorrow.\n\nNyonis stunning success at Mister Africa 2024 is a resounding testament to his exceptional talent, relentless work ethic, and commitment to making a positive impact. This achievement comes on the heels of another remarkable performance by Zimbabwean beauty, Miss Universe Zimbabwe Sakhile Dube, who made it to the Top 30 semifinal of the Miss Universe pageant, narrowly missing the Top 12.\n\nAs Zimbabwe continues to make waves on the global stage, Future Nyonis accomplishments signal a bright future for the nation in the world of modeling and beyond.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/8468.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com In a dazzling display of elegance and talent, Zimbabwean model Future Nyoni has made history by clinching a remarkable triple title at the prestigious Mister Africa 2024 pageant held in Freetown, Sierra Leone. Emerging as the 2nd Runner-Up Mister Africa International, Mister Southern Africa International, and Heart of Africa, Nyoni’s achievements highlight […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Gweru Mayor’s Christmas Cheer Fund Draws Sold-Out Crowd",
            "url": "https://www.chronicle.co.zw/gweru-mayors-christmas-cheer-fund-draws-sold-out-crowd/",
            "content": "Midlands Bureau\n\nThe Gweru Mayors Christmas Cheer Fund moved into high gear, hosting a vibrant event at the Gweru Showgrounds that attracted a sold-out crowd of enthusiastic, fun-loving residents. The initiative, traditionally supported by the elderly and the business community, aimed to encourage younger generations to participate in spreading holiday cheer to the less fortunate.\n\nThe event was an entertainment extravaganza, featuring adrenaline-pumping burnouts, live music, and performances by popular artists Holly Ten and Poptain, who stole the show with their energetic sets. By incorporating exciting activities and contemporary music, the organisers successfully attracted a new wave of young supporters to the noble cause.\n\nThis years event marked a significant milestone in the Gweru Mayors Christmas Cheer Funds efforts to engage the youth and foster a sense of community and social responsibility. As the holiday season unfolds, the initiative is poised to make a lasting impact on the lives of the less privileged in Gweru.\n\nGweru Mayor, Councillor Martin Chivhoko, said they are targeting an ambitious figure of US$50,000 for the less privileged this year. He mentioned that they have introduced innovative ways to attract young people to become part of the noble cause.\n\nWe are aware of the many disadvantaged people in our society. Several households have been left in the hands of young people due to the HIV and AIDS pandemic. Recently, we have witnessed some parents succumbing to the coronavirus. This leaves us with the responsibility to help these families, as they also deserve to enjoy the Christmas holidays. We are happy with the response from the Gweru community towards this worthy cause, he said.\n\nThe Gweru community was amazed by the various activities on display during the fun-filled day.\n\nGweru resident Nobetter Chiweshe said, Its been an amazing experience watching the spins. We would love to see such events every weekend. The music was also great, and I enjoyed watching Holly Ten on stage.\n\nThe Gweru Mayors Christmas Cheer Fund, an annual event, aims to ensure that vulnerable communities can also enjoy the festive season with joy, dignity, and care.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/tw.jpg",
            "description": "Midlands Bureau The Gweru Mayor’s Christmas Cheer Fund moved into high gear, hosting a vibrant event at the Gweru Showgrounds that attracted a sold-out crowd of enthusiastic, fun-loving residents. The initiative, traditionally supported by the elderly and the business community, aimed to encourage younger generations to participate in spreading holiday cheer to the less fortunate. […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zimbabwe hosts Afghanistan in historic Boxing Day Test Match in Bulawayo",
            "url": "https://www.chronicle.co.zw/zimbabwe-hosts-afghanistan-in-historic-boxing-day-test-match-in-bulawayo/",
            "content": "Brandon Moyo, Sport Reporter\n\nZIMBABWE hosts Afghanistan in the first game of the historic two-match Test series at Queens Sports Club.\n\nThe series marks a momentous occasion for Zimbabwean cricket as the country is hosting its first Boxing Day Test at home in 28 years.\n\nThis game will be followed by Zimbabwes inaugural New Years Test, scheduled for 2-6 January 2025.\n\nTo date, the country has hosted only one Boxing Day Test, when Zimbabwe faced England in 1996 in a drawn match severely affected by rain at Harare Sports Club.\n\nSince then, Zimbabwes only other Boxing Day Tests have been played away from home  against New Zealand in Wellington in 2000 and against South Africa in the inaugural pink-ball, day-night, four-day Test in Port Elizabeth in 2017.\n\nZimbabwe also played Sri Lanka in a Test that started on December 27, 2001, in Colombo.\n\nZimbabwe has never played a New Years Test, either at home or abroad.\n\nGiven the significance of these events, Zimbabwe Cricket (ZC) announced that spectators will enjoy free entry to Queens Sports Club for the red-ball series.\n\nThis is an extraordinary milestone for Zimbabwe Cricket and our fans. By offering free entry, we want to share this historic occasion with as many cricket lovers as possible, creating an electric atmosphere to inspire our players and celebrate the spirit of the game, said ZC Managing Director Givemore Makoni.\n\nInterestingly, the last time either side won a Test match was against each other back in 2021. The series ended 1-1.\n\nTeam News:\n\nTrevor Gwanu, Newman Nyamhuri and Ben Curran make their debuts for Zimbabwe.\n\nAM Ghazanfar and Sediqullah Atal are Afghanistans new debutants.\n\nToss:\n\nZimbabwe won the toss and elected to bat first\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/IMG-20241226-WA0025-680x380.jpg",
            "description": "Brandon Moyo, Sport Reporter ZIMBABWE hosts Afghanistan in the first game of the historic two-match Test series at Queens Sports Club. The series marks a momentous occasion for Zimbabwean cricket as the country is hosting its first Boxing Day Test at home in 28 years. This game will be followed by Zimbabwe’s inaugural New Year’s […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Azerbaijan Airlines plane crashes in Kazakhstan, 38 dead, 29 injured",
            "url": "https://www.chronicle.co.zw/azerbaijan-airlines-plane-crashes-in-kazakhstan-38-dead-29-injured/",
            "content": "Mariya Gordeyeva, Gleb Stolyarov and Nailia Bagirova\n\nSummary\n\nASTANA/TBILISI/BAKU, Dec 25 (Reuters)  An Embraer (EMBR3.SA), opens new tab passenger jet flying from Azerbaijan to Russia crashed near the city of Aktau in Kazakhstan on Wednesday, killing 38 people while 29 survivors received hospital treatment, Kazakh authorities said.\n\nAzerbaijan Airlines flight J2-8243 had flown hundreds of miles off its scheduled route to crash on the opposite shore of the Caspian Sea, after what Russias aviation watchdog said was an emergency that may have been caused by a bird strike. But an aviation expert suggested that cause seemed unlikely.\n\nOfficials did not immediately explain why it had crossed the sea, but the crash came shortly after drone strikes hit southern Russia. Drone activity has shut airports in the area in the past and the nearest Russian airport on the planes flight path was closed on Wednesday morning.\n\nAzerbaijan President Ilham Aliyev said according to information he had received, the plane changed course due to poor weather, but he added the cause of the crash was unknown and must be fully investigated.\n\nThis is a great tragedy that has become a tremendous sorrow for the Azerbaijani people, he said.\n\nVideo of the crash showed the plane descending rapidly before bursting into flames as it hit the seashore, and thick black smoke then rising. Bloodied and bruised passengers could be seen stumbling from a piece of the fuselage that had remained intact.\n\nA map showing the path a passengers jet took from Azerbaijan to Russia, including a length stretch where the exact path was unknown before it crashed.\n\nReuters was able to verify from visible landmarks that the video was filmed on the Caspian shore near Aktau.\n\nSixty-two passengers and five crew were aboard. The death toll was disclosed by Deputy Prime Minister Kanat Bozumbayev in a meeting with an Azerbaijani delegation in Aktau, Russian news agency Interfax reported.\n\nKazakhstans emergencies ministry said in a statement that fire services had put out the blaze and that the survivors, including two children, were being treated at a nearby hospital. The bodies of the dead were being recovered.\n\nAzerbaijan Airlines said the Embraer 190 jet was flying from Baku to Grozny, capital of the Chechnya region in southern Russia, but had been forced to make an emergency landing around 3 kilometers (1.8 miles) from Aktau in Kazakhstan.\n\nPreliminary: after a collision with birds, due to an emergency situation on board, its commander decided to go to an alternate airfield  Aktau was chosen, Russias aviation watchdog said on Telegram.\n\nBut a collision with birds typically results in the plane landing in the nearest available field, said Richard Aboulafia, analyst at consultancy AeroDynamic Advisory. You can lose control of the plane, but you dont fly wildly off course as a consequence.\n\nRUSSIAN AIRPORT ON FLIGHT PATH WAS SHUT\n\nAktau is on the opposite shore of the Caspian Sea from Azerbaijan and Russia. Commercial aviation-tracking websites tracked the flight flying north on its scheduled route along the west coast before its flight path was no longer recorded. It then reappeared on the east coast, circling near Aktau airport before crashing into the beach.\n\nAuthorities in two Russian regions adjacent to Chechnya, Ingushetia and North Ossetia, reported drone strikes on Wednesday morning.\n\nAn official at Makhachkala airport in Russia on the west coast of the Caspian, the airport closest to where the flight disappeared from tracking, told Reuters it had been closed to incoming traffic for several hours on Wednesday morning. Reuters could not immediately reach officials at the airport in Grozny.\n\nAuthorities in Kazakhstan said a government commission had been set up to investigate what had happened and its members ordered to fly to the site and ensure that the families of the dead and injured were getting the help they needed.\n\nKazakhstan would cooperate with Azerbaijan on the investigation, the government said. Azerbaijan Airlines suspended flights from Baku to Russias Chechnya region until the investigation is complete. Russias state TASS news agency reported, citing the company.\n\nPresident Vladimir Putin expressed his condolences. Aliyev, the president of Azerbaijan, had decided to return home from Russia where he had been due to attend a summit on Wednesday, his office said.\n\nRamzan Kadyrov, the Kremlin-backed leader of Chechnya, expressed his condolences in a statement and said some of those being treated in hospital were in an extremely serious condition and that he and others would pray for their rapid recovery.\n\nIn a statement, planemaker Embraer expressed its condolences and said it would support authorities efforts.\n\nThe Reuters Daily Briefing newsletter provides all the news you need to start your day. Sign up here.\n\nReporting by Mariya Gordeyeva and Tamara Vaal in Astana, Nailia Bagirova in Baku and Ksenia Orlova in Moscow Additional reporting by Nailia Bagirova, David Gaffen, Ronald Popeski and Alberto Alerigi Writing by Andrew Osborn, Peter Graff and Rod Nickel, Editing by Emelia Sithole-Matarise, Ed Osmond and Howard Goller.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/USPKCMPSXJILFMFRJTDIA6OTA4-680x380.jpg",
            "description": "Mariya Gordeyeva, Gleb Stolyarov and Nailia Bagirova   Summary Plane diverted due to poor weather, cause still unknown Bird strike may have caused emergency, says aviation watchdog Aviation expert questions bird strike theory Nearest Russian airport on flight path was shut Crash came after southern Russia hit by drone strikes. ASTANA/TBILISI/BAKU, Dec 25 (Reuters) – […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "President urges restraint over Christmas holiday",
            "url": "https://www.chronicle.co.zw/president-urges-restraint-over-x-mas-holiday/",
            "content": "Wallace Ruzvidzo,Harare Bureau\n\nAs Zimbabwe celebrates Christmas and prepares for a new year President Mnangagwa has called for responsible behaviour among the general citizenry.\n\nThe President spread some holiday cheer by wishing Zimbabweans a merry Christmas and a prosperous new year.\n\nIn his Christmas and new year message delivered at State House at the weekend, the President urged the general citizenry to celebrate responsibly and safely, especially when travelling.\n\nPresident Mnangagwa expressed optimism for the countrys future, stating that Zimbabwe will achieve greater prosperity in the coming year.\n\nAs we celebrate this important national holiday, let us do so responsibly and safely, especially for the travelling and commuting public.\n\non my own behalf, that of Government and indeed my family, I wish all fellow citizens, at home and abroad, a Merry Christmas and a prosperous 2025. May the New Year ahead bring hope and greater prosperity for our motherland, Zimbabwe, he said.\n\nIn Zimbabwe, Christmas is a time for family, unity, and spirituality.\n\nZimbabweans are embracing the holiday season with enthusiasm and optimism, reflecting the countrys rich cultural heritage and strong sense of community.\n\nThe President said Zimbabwe remained a composite and solid unitary state despite its diverse norms, customs, languages and culture.\n\nFrom Zambezi to Limpopo, from Plumtree to Mutare, and across the most remote villages in our country, we sing with pride one national anthem and fly one national flag. We are diverse but one.\n\nTo this end, this past week saw my administration concretise the Constitutionally enshrined obligation to give rights to every Zimbabwean citizen to hold and occupy agricultural land.\n\nHence, the bold decision to empower the beneficiaries of the Land Reform Programme through the issuance of Deeds of Transfer that will unlock the value of our land.\n\nThrough this historic act, these new tenure documents will be issued to the over 23 500 A2 and over 360 000 A1 farmers.\n\nThe celebration of this years Unity Day is, therefore, equally a jubilant occasion affirming that the land is now irreversibly with its people, and the people with their land, said President Mnangagwa.\n\nPresident Mnangagwa\n\nUnity, patriotism, peace, love and respect, he said, remained indispensable values in the countrys development matrix.\n\nI, therefore, call upon all citizens to commemorate this National Unity Day with sober reflections and recommit to the rich national heritage embodied in the historic Accord of 1987.\n\nNever, never, never again, should anything ever divide us.\n\nUnited we must stand, strong and solid as the walls of Great Zimbabwe, from which we derive our nations name.\n\nHand in hand, in unity, from village to the provincial level; sector by sector and industry by industry, Vision 2030 shall surely become a reality, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jyukiyuiu-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau As Zimbabwe celebrates Christmas and prepares for a new year President Mnangagwa has called for responsible behaviour among the general citizenry. The President spread some holiday cheer by wishing Zimbabweans a merry Christmas and a prosperous new year. In his Christmas and new year message delivered at State House at the weekend, […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Traffic authorities call for zero carnage on roads",
            "url": "https://www.chronicle.co.zw/traffic-authorities-call-for-zero-carnage-on-roads/",
            "content": "Nqobile Tshili,[emailprotected]\n\nMOTORISTS have been urged to exercise caution on the roads during the festive season amid concerns that human error remains the leading cause of road accidents in Zimbabwe.\n\nStatistics reveal that a road accident occurs every 15 minutes, with an average of five fatalities daily.\n\nThe country loses approximately US$400 million annually due to road traffic accidents, with most victims being economically productive individuals.\n\nAs citizens travel for the Christmas and New year holidays, authorities have called for strict adherence to road rules and regulations to reduce carnage on the roads.\n\nTo raise awareness, the Zimbabwe Republic Police (ZRP) in collaboration with the Traffic Safety Council of Zimbabwe (TSC) and other stakeholders, yesterday conducted a road safety campaign along the Bulawayo-Gwanda Highway.\n\nMembers of the campaign team led by the officer commanding Bulawayo Province, Commissioner Wiklef Makamache, was stationed at Kensington police roadblock.\n\nDuring the event, motorists were cautioned about common road hazards, including stray animals and also warned against drinking and driving.\n\nToday, we are on the road meeting travellers. Some are heading to rural areas while others are travelling between cities. Our message is clear. We want safety on the roads and as such we should all observe road rules and regulations to avoid accidents. We should reduce the carnage on our roads cause mainly by reckless driving,said Comm Makamache.\n\nHe attributed most road accidents to human negligence and urged citizens to remain vigilant, especially during this festive season.\n\nComm Makamache also warned against criminal activities, noting that some individuals exploit the festive season to commit crimes like robbery and rape.\n\nTo the ordinary people, we say zero tolerance to crime. Criminals should watch out as we are in full force and our message is clearrespect human life, he said.\n\nTSC board member Mrs Tambudzai Madzivire emphasised the importance of driving to arrive safely.\n\nWe are here to promote road safety. Safety should always come first because there is no second chance if you fail to drive safely. We urge drivers to remain alert, avoid fatigue and be cautious of hazards like cattle on the roads, she said.\n\nMrs Madzivire said accidents cause economic losses and also strain the healthcare services.\n\nPublic service vehicle driver Mr Mengezi Ncube commended the campaign, stressing the need for adherence to road safety measures.\n\nThis campaign is crucial as it reminds us to drive safely by observing road rules and regulations. Potholes however remain a major concern, especially at night as drivers often try to avoid them resulting in them encroaching onto the lane of traffic coming from the opposite direction, he said.\n\nDuring the campaign motorists were given Ministry of Transport and Infrastructural Development fliers on the 10-point Decade of Action for Road Safety tips. The tips are: dont drink and drive, avoid using cellphones while driving, ensure your vehicle is roadworthy, obey road signs and markings, check tyre pressure regularly, carry a reflective triangle and vest, have a spare wheel, spanner and jack, take frequent rest breaks, invest in a fire extinguisher and obey the speed limit.\n\n-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/bngf.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  MOTORISTS have been urged to exercise caution on the roads during the festive season amid concerns that human error remains the leading cause of road accidents in Zimbabwe. Statistics reveal that a road accident occurs every 15 minutes, with an average of five fatalities daily.  The country loses approximately US$400 million annually due […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zimbabwean celebrities share Christmas Day plans",
            "url": "https://www.chronicle.co.zw/zimbabwean-celebrities-share-christmas-day-plans/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nAS people are out and about preparing for Christmas Day, some are travelling to be with their families, Zimbabwean celebrities are not left out in the rush as they too have plans for the day.\n\nBelow is a glimpse of what some of Zimbabwes celebrities have in store as the jingle bells ring.Jeys Marabini  Jazz Legend\n\nJeys Marabini\n\nFor Jeys Marabini, Christmas is a day to enjoy and celebrate with family. It is a time for thanksgiving and being grateful to be alive.\n\nChristmas is definitely a day for the family, he said.\n\nLaDee  Musician\n\nThe lady with the people at heart, LaDee said she will be spending Christmas with her family as the year has been so hectic that she could hardly spend time with them. She said she did not release any songs for December but has something fresh planned for her fans throughout 2025.\n\nLaDee\n\nLaDee also revealed that she has surprises for some of her fans, who will be recipients of some goodies. She said after the festive season she will be celebrating her birthday with family and friends.\n\nDJ Mzoe\n\nDJ Mzoe will be very busy on Christmas Day as he will be at work and at the same time trying to find time for the family. He said as a DJ, he will visit childrens carnivals around the city, playing music for them and giving out a few presents. He highlights that the first part of the day will be spent with family before he joins children around the city. In the evening, he will meet fans at KoSamuriwo Pub and Grill, where he will play fans favourite hits.\n\nMzoe7  MusicianOn Christmas Day, Zimbabwes Maradona will celebrate with families from all over Zimbabwe at Esigodini, Silver Diamond Sports Club, where there will be a family show. He will be joined by Ma9ine and Jaycee.\n\nMzoe 7\n\nSipho Mercent  Social Media InfluencerFor content creator Sipho, known to many for his signature chant Mina indaba zabantu ngyazizonda, Christmas will be spent with family and his fans. His morning will kick off with an appearance at Blessed Fashions followed by lunch with his family. In the evening, Sipho will mingle with his fans at KoSamuriwo Pub and Grill.\n\nSipho Mercent\n\nDJ Prince EskhosiniDJ Prince Eskhosini says he will be with his fans on Christmas Day. He has two bookings, one being a family function and the other a family fun day.\n\nDJ Prince Eskhosini\n\nI have a very supportive family that understands that I get to spend more time with my fans than with them, so I will definitely make up for that on Boxing Day and be with the family, he said.\n\nWelsh The Stylist  Fashion DesignerThe designer, famous for his vintage and unique designs, said Christmas Day will be a day he dedicates solely to his family.\n\nIyasa  Dance GroupPopular in Zimbabwe and beyond its borders, the group Iyasa will be doing what they know best  performing on Christmas Day. The group will head to Mberengwa where they will perform at the Tshuma family Christmas celebrations.\n\nWe will be working on Christmas Day, but we will definitely be with our families in January. Work comes first, said Mercy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/4ehj.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com AS people are out and about preparing for Christmas Day, some are travelling to be with their families, Zimbabwean celebrities are not left out in the rush as they too have plans for the day. Below is a glimpse of what some of Zimbabwe’s celebrities have in store as the jingle bells […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Communities must embrace correctional centres",
            "url": "https://www.chronicle.co.zw/communities-must-embrace-correctional-centres/",
            "content": "THE Ministry of Justice, Legal and Parliamentary Affairs and the Zimbabwe Prisons and Correctional Service (ZPCS), are working on establishing community correctional centres to facilitate the effective implementation of the parole system.\n\nZimbabwe has over the years spent resources on rehabilitation of prison inmates to prepare them for reintegration into society as opposed to punishing them.\n\nJustice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi said last week that his ministry in liaison with ZPCS was working on establishing community correction centres to enable ZPCS to effectively implement the parole system.\n\nThe Prisons and Correctional Service Act provides for the establishment of the State Parole Board and sets conditions for the releases of inmates from prison.\n\nAn inmate can be released through a decision by the President, the State Parole Board and the Commissioner-General of Prisons or Justice Minister.\n\nMinister Ziyambi Ziyambi\n\nMinister Ziyambi said effective implementation of the parole system will go a long way in decongesting Zimbabwes prisons.\n\nThe prisons have over the years been running programmes to equip inmates with different skills such as carpentry, welding, sewing, market gardening, livestock farming, building, spray painting and many other such skills to prepare the inmates for life after prison. This has drastically reduced cases of recidivism.\n\nThe establishment of community correctional centres will therefore speed up the inmates reintegration into society while at the same time reducing overcrowding in prisons.\n\nWe want to commend the Justice Ministry and ZPCS for their commitment to transform our prisons into rehabilitation centres for inmates as opposed to places to punish prisoners as was the case before independence.\n\nZimbabwe Prisons and Correctional Services (ZPCS)\n\nPrisoners under the present system are given another chance to contribute to the development of their communities using skills gained while in prison.\n\nPrisons across the country are running thriving farming projects and as such many of them are producing food not just for their own consumption but surplus, for sale.\n\nThe ZPCS is therefore saving Government a lot of money by producing food and other provisions for inmates such as uniforms.\n\nWe want at this juncture to implore communities to embrace the establishment of correctional centres in their areas to facilitate inmates quick reintegration into society.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/06/Untitled-1-copy-472.jpg",
            "description": "THE Ministry of Justice, Legal and Parliamentary Affairs and the Zimbabwe Prisons and Correctional Service (ZPCS), are working on establishing community correctional centres to facilitate the effective implementation of the parole system. Zimbabwe has over the years spent resources on rehabilitation of prison inmates to prepare them for reintegration into society as opposed to punishing […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        },
        {
            "title": "Improve player quality, Bosso told",
            "url": "https://www.chronicle.co.zw/improve-player-quality-bosso-told/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS 18-year wait for the league title can only be ended by improving the quality of players in the squad, according to two-time league championship winner, Noah Muvindi.\n\nMuvindi had exciting moments in his career, especially with the Bulawayo giants, which saw him lifting two consecutive Premiership championships and many other trophies in 2001 and 2002.\n\nMuvindi is now a keen observer of the local football scene and attributes Bossos struggles to lack of quality players.\n\nTo be honest, Bosso have not had the quality players needed to compete for the league title. When you look at the starting 11 and then the bench, there is a clear lack of depth that can win you a league title. During our days you had two quality players battling for each position, which is not the case now. For example, I personally had Gift Lunga (Jnr) as my competition for the left-back position and sometimes the coach would have a headache on who should start and would ask us to agree on who was to start. I dont think the players the team has now are the quality which can win you a championship, said Muvindi.\n\nHe believes that a strong and balanced squad is essential for winning the league and unfortunately, Bosso have been lacking in that department.\n\nMuvindis comments come at a time when Bosso fans are eagerly waiting for the team to reclaim its former glory.\n\nWith the teams rich history and passionate fan base, there is no doubt that Bosso has the potential to dominate the local football scene once again.\n\nHowever, according to Muvindi, this will require significant investment to get quality players.\n\nBosso needs to attract and retain top talent if they want to compete with the best teams in the league, said Muvindi who started his career at Giants in Division One before moving to Buffaloes two years later.\n\nHe believes Bossos player exodus in 2003 disrupted their dominance in the league and Caf Champions League.\n\nThe team lost Adam Ndlovu (late) and Stewart Murisa, who both joined South African clubs. The following season, it was worse because the team lost Dazzy Kapenya, Thabani Masawi, Siza Khoza, Charles Chilufya, Blessing Gumiso and myself, he said.\n\nThe late Warriors striker Adam Ndlovu\n\nHighlanders quest for league glory is set to suffer a major setback before the start of the next campaign as they are set to lose key players to newly-promoted Scottland FC.\n\nPeter Muduhwa, Godfrey Makaruse, Lynoth Chikuhwa and Marvelous Chigumira are reportedly bound for Scottland FC, leaving Bosso with a daunting task of finding suitable replacements.\n\nThis development comes at a time when Highlanders were showing signs of improvement, particularly in their attacking play.\n\nIn the 2024 season, they scored 43 goals, the third-highest tally in the league.\n\nThe teams attacking prowess was further emphasised by their player, Chikuhwa, winning the Golden Boot award after scoring 17 goals.\n\nLynoth Chikuhwa\n\nHowever, defensive frailties remain a major concern, with Highlanders boasting the 11th-best defence in the league.\n\nThe loss of key players will undoubtedly exacerbate this problem, and Bosso will need to spend money on the transfer market or promote from their development sides to beef up their defence.\n\nThe club leadership is on record stating that they will be beefing up their squad ahead of next season. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hy.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS’ 18-year wait for the league title can only be ended by improving the quality of players in the squad, according to two-time league championship winner, Noah Muvindi. Muvindi had exciting moments in his career, especially with the Bulawayo giants, which saw him lifting two consecutive Premiership championships and many other trophies […]",
            "time": "21:05",
            "date": "26 Dec 2024"
        }
    ]
}