{
    "news": [
        {
            "title": "Three armed robbers jailed for 10 years",
            "url": "https://www.chronicle.co.zw/three-armed-robbers-jailed-for-10-years/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThree men from Beitbridge who are believed to be part of an armed robbers gang that has been terrorising people around the border town have each been jailed for an effective 10 years by the local regional magistrate court.\n\nNkosi Nkomo (27), Majajama Ndlovu (24) and Hulisani Ndou (21) were sent to prison by regional magistrate Ms Charity Maphosa for a crime committed in September last year.\n\nAlthough they pleaded not guilty to a charge of robbery, they were convicted on the strength of overwhelming evidence.\n\nThey were left with 10 years effective in jail when Ms Maphosa set aside from the 12 years term one for five years on condition of good behaviour and another one year on condition of restitution of the stolen property.\n\nProsecuting, Mr Willbrought Muleya said on September 18 last year at around 1 am the trio along with two others still at large pounced on the complainant in the low density suburbs after finding him fixing his vehicle.\n\nThe gang scaled up the security wall and confronted the man and produced a firearm threatening to kill him if he resisted their demands.\n\nThey immediately took away two smartphones from him and marched him into his house at gunpoint.\n\nNkomo and his accomplices took a laptop and a hair clipper and fled from the scene.\n\nThe matter was reported to the police and the trio were tracked via a cell phone to Musina in South Africa where they were later arrested for violating immigration laws and were also found with the pistol, a hammer and the laptop.\n\nAfter Which they were deported and were arrested during security vetting in Beitbridge.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/01/ARMED-ROBBERY-680x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Three men from Beitbridge who are believed to be part of an armed robbers gang that has been terrorising people around the border town have each been jailed for an effective 10 years by the local regional magistrate court. Nkosi Nkomo (27), Majajama Ndlovu (24) and Hulisani Ndou (21) were sent […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "Zimborders calls for planned travelling during Easter",
            "url": "https://www.chronicle.co.zw/zimborders-calls-for-planned-travelling-during-easter/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe Zimborders Consortium which transformed the Beitbridge border post at a cost of US$300 million on partnership with the Government has called on travellers to properly plan for their journeys and to make use of the correct terminals during the Easter holidays to avoid unnecessary delays while crossing the countrys busiest Port of Entry (PoE).\n\nAlready Zimbabwe and South Africa border authorities are implementing integrated plans to clear a surge in traffic during this week, which has already started building up on both sides of the border.\n\nSoon after the border transformation traffic was permanently separated into cargo, buses, pedestrians and light vehicles (terminals) on the Zimbabwe side, while the South Africans are opening more service points to cater for customised traffic.\n\nAs part of the Government and Zimborders Consortium concession, the latter is managing the facility for a period of 17 and half years collecting its investment through border user fees.\n\nAfter which the Government will take over the building under the Build Operate and Transfer (BOT) model.\n\nZimborders Consortiums general manager Mr Nqobile Ncube said already transporters and travellers have started reaping the fruits of the project.\n\nHe said working with other Government agencies a final plan had been crafted and activated.\n\nThis includes the deployment of additional staffing, opening up of more service points, increased travel information dissemination, tightening security to flash out touts and irregular migrants at the port of entry and harmonising controls and operations amongst other strategies.\n\nYou will note that the Easter and Festive season are some of the major peak periods at this border and hence all stakeholders have put plans in place to ensure that travellers enjoy the premium of passing through this facility, said Mr Ncube.\n\nHe said Zimborders has created an information centre on their website www.zimborders.com where members of the public may access the general travel information about Beitbridge.\n\nWhere possible travellers are advised to use the pre-clearance facilities or make use of the electronic tip system for those who wish to travel into Zimbabwe with foreign registered vehicles so as to expedite their time at the border, he said.\n\nThe pre-clearance systems involve declaring imports and paying duty and the necessary levies prior to ones arrival at the desired port of entry, thus cutting physical border processes upon arrival.\n\nIn addition, we encourage travellers to plan their journeys and stagger movement so that they dont run into any congestion. They could possibly stagger movement and upon reaching the border we have marshals directing them to various terminals where they will get customised services depending on their needs.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/rggf-680x360.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The Zimborders Consortium which transformed the Beitbridge border post at a cost of US$300 million on partnership with the Government has called on travellers to properly plan for their journeys and to make use of the correct terminals during the Easter holidays to avoid unnecessary delays while crossing the country’s busiest […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "Police declare crackdown on road offenders and drug peddlers ahead of Easter, Independence Holidays",
            "url": "https://www.chronicle.co.zw/police-declare-crackdown-on-road-offenders-and-drug-peddlers-ahead-of-easter-independence-holidays/",
            "content": "Chronicle Reporter\n\nTHE Zimbabwe Republic Police (ZRP) has said they are conducting a nationwide security operation targeting rogue public transport operators, drug syndicates and criminal elements threatening public safety during the Easter and Independence holidays.\n\nCommissioner-General of Police Stephen Mutamba issued a stern warning to lawbreakers on Tuesday, vowing that police will enforce strict compliance with traffic laws, crack down on illegal drug activities and maintain law and order during the national holidays.\n\nThe Zimbabwe Republic Police remains committed to ensuring a peaceful and secure environment for all. We have made adequate arrangements for the safety and security of Independence commemorations at national, provincial and district levels, said Commissioner-General Mutamba.\n\nIn a clear message to pirate taxi operators (commonly known asmushikashika) and unlicensed buses, the Police Chief declared that such vehicles would not be allowed to pass through roadblocks and checkpoints during the holiday period.\n\nPolice commanders across the country have been instructed to take strong action against unlicensed buses and pirate taxis that operate without the required licenses or permits. Unroadworthy and defective vehicles will be impounded, and any driver found to be under the influence of alcohol will be arrested, he said.\n\nThe ZRP also emphasized that its current blitz on drug dealers and users will continue without let-up. Commissioner-General Mutamba called on communities to assist law enforcement by reporting known drug bases and suppliers.\n\nThe public is encouraged to report any drug-related activities. The police will not relent in bringing to book drug barons, suppliers, and users, he said.\n\nParents were also urged to closely monitor school children during the holidays to prevent them from falling victim to drug and substance abuse, which has become a growing concern nationwide.\n\nPolice have pledged to ensure all liquor outlets comply with the Liquor Act Chapter 14:12, warning that unlicensed bars and shebeens will be shut down and operators prosecuted.\n\nLicensed liquor outlets must adhere to stipulated operating times. Unlicensed operations will be closed and offenders arrested, he said.\n\nCautioning against the rising cases of robbery, Commissioner-General Mutamba advised the public not to carry large sums of money or store cash at home or business premises.\n\nCompanies must safeguard sensitive financial information and avoid sharing such details with all employees, as this can lead to inside jobs, he added.\n\nThe ZRP is set to intensify stop-and-search operations, traffic patrols, and public awareness campaigns across all provinces to combat crimes including armed robbery, rape, murder, and stock theft.\n\nAs the holidays approach, the police are calling on all citizens to act responsibly, cooperate with law enforcement, and report any suspicious or criminal activities through the ZRP National Complaints Desk on(0242) 703631or via WhatsApp on0712 800 197.\n\nMay I take this opportunity to wish all Zimbabweans and our esteemed visitors a blessed, crime and accident-free 2025 Easter and Independence Holidays, said Commissioner-General Mutamba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2015/12/STEPHEN-MUTAMBA-POLICE.jpg",
            "description": "Chronicle Reporter THE Zimbabwe Republic Police (ZRP) has said they are conducting a nationwide security operation targeting rogue public transport operators, drug syndicates and criminal elements threatening public safety during the Easter and Independence holidays. Commissioner-General of Police Stephen Mutamba issued a stern warning to lawbreakers on Tuesday, vowing that police will enforce strict compliance […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "Ipswich Town Sign Former Brighton Youngster Corbin Mthunzi on Two-Year Deal",
            "url": "https://www.chronicle.co.zw/ipswich-town-sign-former-brighton-youngster-corbin-mthunzi-on-two-year-deal/",
            "content": "Zimpapers Sports HubPREMIER League side Ipswich Town have signed former Brighton and Hove Albion youngster Corbin Mthunzi on a two-year professional contract following a recent trial.\n\nThe 17-year-old featured for the Under-21s in matches against QPR and Chelsea in March, playing at centre-half, though he is also capable of operating in central midfield.\n\nNew chapter, new dreams! Proud to sign with Ipswich Town! Mthunzi wrote on Instagram.\n\nHe has represented England at Under-15 and Under-16 level, alongside former Brighton Academy team-mate and fellow Zimbabwean Shumaira Mheuka.\n\nMheuka is now with Chelsea, having made the move two years ago.\n\nAlthough Mthunzi has played for England at youth level, he remains eligible to represent Zimbabwe through his father.\n\nThe versatile player was born in England to a British mother and a Zimbabwean father.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hh-680x360.jpg",
            "description": "Zimpapers Sports Hub PREMIER League side Ipswich Town have signed former Brighton and Hove Albion youngster Corbin Mthunzi on a two-year professional contract following a recent trial. The 17-year-old featured for the Under-21s in matches against QPR and Chelsea in March, playing at centre-half, though he is also capable of operating in central midfield. “New […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "African traditional leaders, heritage and sustainable development experts meet in Livingstone, Zambia",
            "url": "https://www.chronicle.co.zw/african-traditional-leaders-heritage-and-sustainable-development-experts-meet-in-livingstone-zambia/",
            "content": "Online Writer\n\nHERITAGE and sustainable development experts, and traditional leaders from across Africa are gathered in Livingstone, Zambia for a three-day expert meeting on world heritage and sustainable development in Africa.\n\nThe African World Heritage Fund and the Zambezi River Authority are jointly financing the meeting of experts.\n\nOther cooperating partners are Governments of Zimbabwe and Zambia, National Heritage Conservation Commission, UNESCO Zambia National Commission, and wildlife authorities from the two countries.\n\nParticipants are drawn from representatives from government ministries and agencies responsible for heritage conservation, environment and tourism, UNESCO and the World Heritage Centre (WHC), the African World Heritage Fund (AWHF), International conservation organisations, United Nations Development Programme (UNDP), universities and research centres, private sector, civic society and local communities.\n\nThe main objective of the three-day workshop which will end on Thursday, is to come up with a declaration that will guide heritage and conservation around the World Heritage Site, Victoria Falls.\n\nThe meeting seeks to discuss implementation practices and principles on world heritage conservation and sustainable development in Africa, identify successful ways in which integrated approaches between the pillars of sustainable development have been implemented at World Heritage sites in Africa, strengthen the inter-sectoral/interdisciplinary forum on balancing conservation and sustainable development at and around World Heritage sites, foster dialogue between governments, conservation agencies, and international organisations on policy frameworks and practical solutions, and develop an action plan for the implementation of collaborative projects between World Heritage sites and sustainable development issues in Africa.\n\nChief Whange from Hwange, Acting Chief Shana from Jambezi and Acting Chief Mvuthu from Victoria Falls whose areas are within the vicinity of ZRAs projects along Zambezi River, Chief Mukuni and Chief Simwatachela of Zambia are participating.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/thy-680x360.jpg",
            "description": "Online Writer HERITAGE and sustainable development experts, and traditional leaders from across Africa are gathered in Livingstone, Zambia for a three-day expert meeting on world heritage and sustainable development in Africa. The African World Heritage Fund and the Zambezi River Authority are jointly financing the meeting of experts. Other cooperating partners are Governments of Zimbabwe […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "Zimbabwe targets 3.1 million household electrification and 70 percent clean cooking access by 2030",
            "url": "https://www.chronicle.co.zw/zimbabwe-targets-3-1-million-household-electrification-and-70-percent-clean-cooking-access-by-2030/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nZIMBABWE has set a target to electrify 3.1 million households and ensure 70 percent clean cooking access by 2030, as part of a broader strategy to achieve universal energy access.\n\nThe Government says this will be supported by regulatory reforms designed to streamline investment processes, facilitate the adoption of mini-grid regulations by Independent Power Producers (IPPs) and unlock increased private sector participation.\n\nSpeaking during a post-Cabinet briefing on Tuesday, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, announced that Cabinet had considered and approved the Zimbabwe National Energy Compact, which was presented by the Minister of Energy and Power Development, July Moyo.\n\nZimbabwe aims to electrify 3.1 million households and reach 70 percent clean cooking access by 2030. Regulatory reforms will support this effort by streamlining investment processing, for Independent Power Producers adopting mini-grid regulations, and unlocking private sector investment, said Dr Muswere.\n\nThe strategic shift signals Zimbabwes commitment to energy transformation and sustainable development, aligned with continental and global climate and development goals.\n\nDr Muswere noted that the Compact aligns with the Dar-es-Salaam Declaration on the Africa Heads of State Energy Summit, held from 17 to 18 January 2025.\n\nZimbabwe is a signatory to the Declaration, whose central goalMission 300seeks to expand electricity access to 300 million African households by 2030.\n\nMember states are required to develop and submit their respective Energy Compacts to contribute to this continental mission.\n\nThe Zimbabwe National Energy Compact sets forth a strategic roadmap to achieve universal access to affordable, reliable, and sustainable electricity by 2030, said Dr Muswere.\n\nRooted in Vision 2030 and guided by the National Development Strategies, the Compact addresses critical energy challenges such as outdated infrastructure, generation shortfalls, and limited access in rural areas, said Dr Muswere.\n\nThe Compact is also aimed at enhancing energy security and building resilience against climate-related risks.\n\nThe Compact seeks to enhance energy security and build resilience in the face of climate-related risks.\n\nIt is anchored on five strategic pillars that include expanding generation and infrastructure, strengthening regional integration, promoting distributed renewable energy and clean cooking, catalysing private sector-led investment and ensuring the Financial Viability of Utilities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-15-at-16.19.41-680x380.jpeg",
            "description": "  Nqobile Bhebhe, Senior Business Reporter ZIMBABWE has set a target to electrify 3.1 million households and ensure 70 percent clean cooking access by 2030, as part of a broader strategy to achieve universal energy access. The Government says this will be supported by regulatory reforms designed to streamline investment processes, facilitate the adoption of mini-grid […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "Esigodini Agricultural College Innovation Hub boosts Agri-Education 5.0 goals",
            "url": "https://www.chronicle.co.zw/esigodini-agricultural-college-innovation-hub-boosts-agri-education-5-0-goals/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTHE Esigodini Agricultural College innovation centre will play a crucial role in enhancing the Agricultural Education for Development 5.0 curriculum which seeks to equip students transforming agricultural production.\n\nSpeaking recently during a visit to the innovation centre Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Director Agriculture Education, Dr Jotamu Dondofema said graduates will be able to adapt to the dynamic landscape and changing value chains.\n\nThe innovation centre has a feed analysis laboratory and a goat housing station. The two facilities will improve the animals health and nutrition while the feed analysis centre will enable the analysis of the nutritional content of farm-produced fodder for the goats.\n\nWe have a current running curriculum Agricultural Education for Development 5.0 where we have five pillars namely training, business advisory, services, research, innovation and entrepreneurship.\n\nThe students and staff members now have an opportunity to interact with such activities. As we deploy cadres from our colleges they will be relevant in various communities, he said.\n\nDr Dondofema said there is a need for similar projects to be established in their communities. He urged students and lecturers who have been equipped with these skills to implement these concepts in various communities.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-15-at-15.15.24-680x380.jpeg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw THE Esigodini Agricultural College innovation centre will play a crucial role in enhancing the Agricultural Education for Development 5.0 curriculum which seeks to equip students transforming agricultural production.   Speaking recently during a visit to the innovation centre Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Director Agriculture Education, Dr Jotamu Dondofema […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "New dawn for athletics in Kwekwe",
            "url": "https://www.chronicle.co.zw/new-dawn-for-athletics-in-kwekwe/",
            "content": "Zimpapers Sports HubEXCITING times lie ahead for athletics enthusiasts in the heart of the Midlands province, with the launch of the Kwekwe Runners Club, set for the weekend.\n\nThe club, formed in October 2024, was formally registered with the National Athletics Association of Zimbabwe (Naaz) in March this year.\n\nStarting off with three members, the club now boasts of more than a 100 athletes.In a statement, ahead of the April 29th launch, Kwekwe Runners Club said they were committed to encouraging runners in and around Kwekwe to partake in athletics and foster a culture of a healthy lifestyle.\n\nThe group comprises of passionate social runners, persons aspiring to join the professionals, the slow ones popularly known as the duck squad aspiring professional runners as well as professional ones.\n\nThe club seeks to encourage one another by posting routes and run paces of individuals. The end goal for all runners is fitness and a sense of belonging to a passionate community of runners as our famous motto goes #tirichinhuone, that is to say we leave no man behind, read the clubs statement.Meanwhile, it is expected that more than 150 runners from across the country will take part at the launch date race, at Queens Club.\n\nThe event seeks to attract over 150 runners from across the country with special guests from our sister club; the Gweru Runners Club, who will be driving the popular GRC Bus where singers run and sing cheerfully in unison. During the launch we are set to have vibrant aerobics as well as a band for entertainment.\n\nWe have hosted the Gweru- Kwekwe 65 km fun run which saw over 50 runners turning up and the Valentines Day fun run. The end goal is to grow in numbers and host even bigger yearly calendar events which attract runners from across Africa with the aim of promoting fitness and health, also have professional athletes born from the club who will raise our Kwekwe Runners club flag high. The sky for us is not the limit, the club said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gb-680x360.jpg",
            "description": "Zimpapers Sports Hub EXCITING times lie ahead for athletics enthusiasts in the heart of the Midlands province, with the launch of the Kwekwe Runners Club, set for the weekend. The club, formed in October 2024, was formally registered with the National Athletics Association of Zimbabwe (Naaz) in March this year. Starting off with three members, […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "Sport Minister Tours National Sports Stadium",
            "url": "https://www.chronicle.co.zw/sport-minister-tours-national-sports-stadium/",
            "content": "Zimpapers Sports Hub\n\nNEW Sport, Recreation, Arts and Culture Minister Anselem Sanyatwe on Monday afternoon conducted his first tour of the National Sports Stadium where he got firsthand appreciation of the progress made in the renovations at the facility.\n\nThe stadium was closed for renovations in 2022 after it was condemned by FIFA and the Confederation of African Football.\n\nThe Minister was shown around the stadium by officials from the Ministry led by Permanent Secretary Nicholas Moyo and representatives from the contractors. Sports and Recreation Commission Director General Eltah Nengomasha and other senior officials also took part in the tour.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-14-at-17.42.59-680x380.jpeg",
            "description": "Zimpapers Sports Hub NEW Sport, Recreation, Arts and Culture Minister Anselem Sanyatwe on Monday afternoon conducted his first tour of the National Sports Stadium where he got firsthand appreciation of the progress made in the renovations at the facility. The stadium was closed for renovations in 2022 after it was condemned by FIFA and the […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        },
        {
            "title": "Too hot to handle, Jah Prayzah’s album launch tickets vanish fast!",
            "url": "https://www.chronicle.co.zw/too-hot-to-handle-jah-prayzahs-album-launch-tickets-vanish-fast/",
            "content": "Trust Khosa,Zimpapers Arts and Entertainment Hub\n\nIts official  Jah Prayzah fever has hit again! Tickets for the superstars upcoming album launch, Ndini Mukudzeyi set for May 3 at Old Hararians Sports Club, are flying off the shelves  with the Early Bird standard tickets already sold out.\n\nIn a social media post that sent fans scrambling, Jah Prayzah announced: Early Bird tickets kuStandard Section sold out. Now onto First Release mhanya asati apera futi. Get your tickets now at www.wagwizi.jp.\n\nFans flooded the comments section with excitement, frustration, and urgency.Yuwii apa ndikuverengera kutenga nhaimi, wrote Lucy Precious Musokeri, regretting her delay.\n\nKubuda nekupera yoh, added Norleen Round, stunned by how fast tickets were selling.\n\nBut not everyones celebration came easy  some fans expressed difficulties with online purchases.Purchasing using the website ikuramba, toitasei, asked Mitchell Zondi.\n\nTakatenga online apana kuuya any message. Plz reply ku inbox kwenyu Jah Prayzah, added another concerned fan.\n\nStandard tickets have now moved to phase two, with the price being increased.\n\nWith demand skyrocketing, fans are urged to grab their tickets before the next batch disappears too.\n\nJah Prayzah, known for his genre-defining discography, is expected to deliver yet another unforgettable experience. His music journey spans hits like Rudo Nerunyararo (2007), Jerusarema (2015), Mdhara Vachauya (2016), Gwara (2021), and his dual 2023 releases Chiremerera and Maita Baba.\n\nWill Ndini Mukudzeyi top them all? If the ticket stampede is anything to go by, its already a hit.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ggb-680x360.jpg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub It’s official – Jah Prayzah fever has hit again! Tickets for the superstar’s upcoming album launch, “Ndini Mukudzeyi” set for May 3 at Old Hararians Sports Club, are flying off the shelves – with the Early Bird standard tickets already sold out. In a social media post that sent […]",
            "time": "20:36",
            "date": "15 Apr 2025"
        }
    ]
}