{
    "news": [
        {
            "title": "School Head collapses, dies during national athletics event",
            "url": "https://www.chronicle.co.zw/school-head-collapses-dies-during-national-athletics-event/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nIN a tragic turn of events, a Harare province primary school headmaster collapsed and died at Hwange Colliery Stadium while celebrating his provinces triumph at the National Association of Primary School Heads national athletics competitions this afternoon.\n\nMinistry of Primary and Secondary Education spokesperson Mr Taungana Ndoro confirmed the death of the Greystone Park Primary School headmaster Isaac Zheve.\n\nI can confirm that a headmaster Mr Isaac Zheve collapsed and died this afternoon at Hwange Colliery Stadium during a Naph national athletics competitions. At the moment, we have no confirmation of where his body is being kept, said Mr Ndoro.\n\nWhile requesting anonymity, Naph leadership said the school head, died in his car as he attempted to drive to the provinces base at Thomas Coulter Primary School soon after announcement of results around 4pm.\n\nWe are still in shock, its a dark, a very dark ending to our competitions and one can only feel for the learners. This is just so traumatic, said a school head.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/vcbtrxczzxcxv56347890p9i8uytre4321.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw IN a tragic turn of events, a Harare province primary school headmaster collapsed and died at Hwange Colliery Stadium while celebrating his province’s triumph at the National Association of Primary School Heads national athletics competitions this afternoon. Ministry of Primary and Secondary Education spokesperson Mr Taungana Ndoro confirmed the death of the […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "Investing in the future, US$17m projects jumpstart for youth",
            "url": "https://www.chronicle.co.zw/investing-in-the-future-us17m-projects-jumpstart-for-youth/",
            "content": "Zvamaida Murwira, Harare BureauGOVERNMENT has set aside US$10 million for youths in agriculture and will provide a US$5 million fund under the Presidential Youth Mining Equipment scheme for young artisanal miners, as the Second Republic continues to make huge strides in empowering young people, President Mnangagwa has said.\n\nLaunching the Presidential Youth Empowerment Scheme during an event attended by thousands of youths drawn from the countrys 10 provinces in Harare yesterday, the President said a US$2 million Revolving Fund to fund youth income-generating projects had been established.\n\nPresident Mnangagwa said following the establishment of youth desks in Government ministries and the ongoing quest to ensure a conducive ease of doing business environment for the youth, notable strides were evident in youth empowerment and inclusion in all sectors of the economy.\n\nTo advance this endeavour, today I am launching a US$2 million Presidential Youth Empowerment Revolving Fund that is earmarked to fund youth income generating projects. I am giving you 72 tractors,10 combine harvesters, 10 vehicles for provincial youth, and 10 rigs for boreholes, he said.\n\nIn addition, I am launching a US$5 million Presidential Youth Mining Equipment Scheme for our young artisanal miners. These two initiatives are just but a few of the many that will follow in due course. The Youth Empowerment Bank will administer the Fund.\n\nPresident Mnangagwa said Government will be mobilising more financial resources towards this initiative.\n\nAdditionally, from the US$50 million Financing Facility that my Government is mobilising to accelerate irrigation development, for climate-proofing agriculture, US$10 million will be reserved for the youth in agriculture.\n\nImage taken from Shutterstock\n\nPresident Mnangagwa called for transparency and accountability to ensure deserving youths get the money.\n\nAs you distribute these resources, I urge you to exercise high levels of morality and ethical consideration. The schemes must identify deserving and capable youth.\n\nNo to favouritism and corruption. I want this to be an enduring and sustainable fund which benefits the majority of our countrys youth.\n\nHence, the US$2 million Fund must not be taken as a free hand-out, but administered as a revolving one that issues loans, which are paid back for the benefit of many more people after.\n\nThe President said the relations between the Zanu-PF Youth League and the Ministry of Youth Empowerment, Development and Vocational Training, are mutually beneficial and serve the youth.\n\nHe added that as the programmes unfold, the Youth League national structures will be capacitated to offer technical assistance, as well as monitor and evaluate progress of the schemes for sustainability.\n\nTo this end, the use of technology is the way to go to enhance productivity. I acknowledge youth development and empowerment strategic partners who have heeded our call for partnerships in resource mobilisation for this scheme, said President Mnangagwa.\n\nThe Zanu-PF Government, he said, is walking the talk and delivering results to the people.\n\nAs we continue to explore avenues to deliberately empower the youth, who are our future leaders, the Second Republic has appointed many young people into strategic areas of governance and decision-making.\n\nThis is designed to create an ideologically sound and experienced cadership in all facets of our society. These young people are performing incredibly well so far. Well done.\n\nPresident Mnangagwa said his administration has implemented tangible youth empowerment projects such as the piggery, heifer and poultry schemes, among others.\n\nIn addition, land for both agriculture and housing has been availed and is currently being distributed to ensure that youths can run profitable agricultural businesses and also build decent homes.\n\nHard honest work pays, while focus, discipline and professionalism in all business endeavours are indispensable values for the success and prosperity of our nation. This culture should be preached and entrenched among you, our young people, he said.\n\nThe President urged youths in business to be good citizens in the management of the environment and communities.To this end, the Youth League and the Ministry of Youth were called upon to be more visible during National Clean Up days set aside as the first Friday of every month.\n\nI hardly see you. In the spirit of Ubuntu, I am because we are, I exhort the youth of our beloved motherland, Zimbabwe, to uphold the culture of voluntarism and community service in aid of the vulnerable, elderly and disabled, said President Mnangagwa.\n\nYouth-owned businesses should embrace innovation, emerging technologies and deployment of ICTs to create new product lines, and penetrate value chains and global markets, which have become essential ingredients to realise business success.\n\nYesterdays event was held under the theme, Fuel Youth: Ignite the Future.\n\nIt was attended by Defence Minister Oppah Muchiguri-Kashiri, Youth Empowerment, Development and Vocational Training Minister Tinoda Machakaire, Zanu-PF Politburo members, Presidential Investment Advisor Dr Paul Tungwarara, development partners, and senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/VXHTRHXVCB99999XCV.jpg",
            "description": "Zvamaida Murwira, Harare Bureau GOVERNMENT has set aside US$10 million for youths in agriculture and will provide a US$5 million fund under the Presidential Youth Mining Equipment scheme for young artisanal miners, as the Second Republic continues to make huge strides in empowering young people, President Mnangagwa has said. Launching the Presidential Youth Empowerment Scheme […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "President hails Coventry’s victory",
            "url": "https://www.chronicle.co.zw/president-hails-coventrys-victory/",
            "content": "Zimpapers Sports HubPresident Mnangagwa yesterday led Zimbabweans and international sporting bodies in hailing Sports Minister Kirsty Coventry for ascending to the apex of the International Olympic Committee (IOC).\n\nYesterday she was voted president of IOC to replace Thomas Bach.\n\nCongratulations to our own Kirsty Coventry on her historic election as the first female and first African President of the IOC. A proud achievement for Zimbabwe and the continent! Wishing her the greatest of success, wrote the President on X.\n\nThe International Paralympic Committee (IPC) congratulated Coventry on her election to become the 10th IOC president.\n\nCoventry was elected in Costa Navarino, Greece and will assume office after a handover from Bach on June 23. Andrew Parsons, IPC president, said: The IOC is the IPCs most important strategic partner and on behalf of the whole Paralympic Movement I would like to congratulate Kirsty on her election as IOC president.\n\nTo become the first woman and African to be president of the IOC is historic, and throughout her campaign Kirsty championed harnessing the power of sport to make a difference. Over the last weeks and months, we have spoken regularly on building an even stronger partnership between the IOC and IPC. We look forward to working with her from June when the handover to the new IOC president takes place.\n\nWorld Aquatics president Husain Al-Musallam was also among the early ones to congratulate the legendary former swimmer.\n\nOn behalf of World Aquatics, I sincerely congratulate Kirsty Coventry on this well-earned election as IOC president. This is a welcome result for all aquatic sports, athletes, and stakeholders within the Olympic Movement. I look forward to working closely with Coventry to further strengthen aquatics sports and ensure that the Olympic Games remain an unparalleled platform for excellence, fairness, and global unity, said Al-Musallam.\n\nThe 41-year-old multi-medal winner at the Olympics, became the first woman to land the post after beating six other contestants to the seat. She was the odds-on favourite polling 49 votes against Juan Antonio Samaranch who was also a strong candidate given that his father was at the helm of the same organisation for ages.\n\nYesterday the global Olympic family decided to vote for a woman for a change. They voted Africa for the first time a key element in fostering inclusivity in sport.\n\nPrince Feisal-Al Hussein polled two votes like Johan Eliasch, David Lappartient scored four with Morinari Watanabe and legendary former middle distance runner who like Coventry starred on the world stage, Sebastian Coe, had eight votes. Bulawayo Metropolitan Cricket Association (BMCA) chairperson Godwin Dube was among a host of sports association representatives to congratulate the Sports Minister.\n\nOn behalf of the Bulawayo Metropolitan Cricket Association and Tuskers Cricket, we would like to wish Honourable Kirsty Coventry the best of luck in her new role as the IOC president. It is our hope that as a nation cricket and sport in general will benefit from her latest assignment, Dube said.\n\nSquash Rackets Association of Zimbabwe (SRAZ) honorary president Lucky Mlilo, also weighed in.\n\nWhat an incredible achievement! Kirsty Coventry, the Zimbabwe Sports Minister, has made history by becoming the first female president of the International Olympic Committee (IOC). This is a monumental milestone not only for Zimbabwe but for Africa as a whole.\n\nMlilo, who is also the president of the Squash Federation of Africa (SFA) added that here election is a demonstration of her dedication, hard work and passion for sports.\n\nKirstys remarkable journey, from being a seven-time Olympic swimming medallist to becoming the IOC president, is an inspiration to many. Her leadership will undoubtedly bring a fresh perspective to the IOC, and we look forward to seeing the impact she will make, said Mlilo of the successful Olympic athlete, who won seven medals at three Olympics  the Sydney (2000), Athens (2004) and Beijing (2008).\n\nNational Athletics Association of Zimbabwe (Naaz) president Tendayi Tagara, described the win as a monumental achievement.\n\nI wish to extend my heartfelt congratulations to Kirsty Coventry for this monumental achievement. Having someone from Africa, and specifically Zimbabwe, rise to such a prestigious leadership position within the International Olympic Committee is a momentous occasion.\n\nIts not just a personal victory for Kirsty, but a victory for Africa as a whole. This is a significant step forward, and I truly believe this could be a catalyst for Africa to one day host the Olympics. As a nation and as a continent, we have shown that we are capable of producing world-class talent and leadership. This accomplishment underscores the potential that Africa holds in the global sporting arena. We deserve recognition, and we deserve to have our voices heard on the world stage, said Tagara.\n\nKirsty Coventry\n\nRugbys veteran administrator, Martin Shone said: This is a monumental feat for both Kirsty Coventry and for Zimbabwe. As a nation, we should take immense pride in her achievement. Kirstys elevation to such a prestigious role is a reflection of her incredible talent, dedication and vision. But this accomplishment goes beyond Zimbabwe this is something that benefits all of Africa. It demonstrates that Africa is not only capable of producing world-class athletes, but also exceptional leaders who can influence global sporting policy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/CVXGEXVCXCVX56565565565656565656.jpg",
            "description": "Zimpapers Sports Hub President Mnangagwa yesterday led Zimbabweans and international sporting bodies in hailing Sports Minister Kirsty Coventry for ascending to the apex of the International Olympic Committee (IOC). Yesterday she was voted president of IOC to replace Thomas Bach. “Congratulations to our own Kirsty Coventry on her historic election as the first female and […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "Warriors hold  leaders Benin",
            "url": "https://www.chronicle.co.zw/warriors-hold-leaders-benin/",
            "content": "Tadious Manyepo in Durban, South AfricaZimbabwe 2-2 Benin\n\nMARCH 20 was supposed to be the day. In part, it was.\n\nAfricas most successful female Olympian Kirsty Coventry put Zimbabwe on the map, becoming the first ever female and African president of the International Olympic Committee.\n\nThe news was wildly celebrated across the continent.\n\nAnd the breeze couldnt have been received better in here where the Warriors were to play Benin in a 2026 World Cup qualifier.\n\nThat was the inspiration they needed to breathe life into their faltering search for a maiden place at the World Cup.\n\nJust like Coventry, they could have written a piece of their own history by overturning a two-goal deficit to win the tie.\n\nThey did try but came just short on attaining that feat.\n\nZimbabwe needed to win this one to crawl back into the reckoning for a place in next years quadrennial finals to be co-hosted by Canada, Mexico and the United States of America.\n\nBut they didnt strike the right chords, with some calamitous mistakes at the back heavily weighing down on them to see off this stalemate.\n\nThey were bottom of Group C and they are still at the foot with just three points from five games.\n\nBut they deserve some great deal of appreciation over the manner in which they found a way back into a match they looked to have lost inside just 35 minutes.\n\nCaptain Marshal Munetsi halved the deficit with a minute before the break and returning veteran Knowledge Musona ensured a share of the spoils after 59 minutes.\n\nIt was a good pair of goals, scored by two top players.\n\nThe goals should have won Zimbabwe the three points they so needed. But then, they have to blame themselves for not being cautious enough in the early stages of the game.\n\nIt was a day veteran goalkeeper Washington Arubi once again decided to let himself and the nation down.\n\nWith the scales tipping in Zimbabwes favour on the 12th minute, the 38-year-old clumsily tapped a routine clearance against Aribi Dokou and the ball fell graciously on the feet of the ruthless Steve Mounie.\n\nThe Augsburg star doesnt miss from that distance.\n\nJust like that, the Warriors fell into panic mode. They allowed Benin to play and they could have added one more or even two inside 10 minutes of taking their lead.\n\nThe second would still come through Dokou after some good exchange of passes inside the Warriors box.\n\nIt was a huge stab that drowned all the noise coming from a strong band of supporters rallying Zimbabwe.\n\nBut nine minutes later, Munetsi restored the hope for Zimbabwe, hooking well from a good cut-back by the impressive Jordan Zemura.\n\nNees pulled out Prince Dube at the restart for Tawanda Chirewa and Zimbabwe dominated the exchanges well from then.\n\nPrince Dube\n\nThe dominance merited a goal, or two.\n\nInside that spell, Musona opened up well to stab a grounder home to spark wild celebrations across the massive venue.\n\nA third goal was a must from that point for the sake of revival.\n\nIt almost came but never did.\n\nThe continued dominance never turned into goals.\n\nZimbabwes chances of making it to next years global showpiece have diminished.\n\nBenin took the initiative and they are leading the group on eight points, at least for 24 hours.\n\nNees hailed his charges character but was typically disappointed.\n\nThe character was good for the team. And the match was on the edge. We risked more and more for the longer it went. And of course, it could have gone either way, but we wanted to win. We tried everything, and I think we can go out with that feeling, said Nees.\n\nWe gave everything, we put everything on the table, and that is what you will always need. You need to have that feeling.\n\nWe missed a lot of chances but the feeling that you put everything on your table must be there. And I think from that point of view, Im impressed. Maybe one more chance I think we would have changed the game completely.Teams\n\nZimbabwe: Washington Arubi, Munashe Garananga, Gerald Takwara, Emmanuel Jalai, Jordan Zemura, Divine Lunga, Andy Rinomhota, Marshal Munetsi, Khama Billiat (Terrence Dzvukamanja 81min), Knowledge Musona (Tawanda Maswanhise 80min), Prince Dube (Tawanda Chirewa 46min)\n\nBenin: Dandjinou Marcel, Roche Yohan, Jijan Mohamed, Moumini Rachid, Kiki David, Hossane Imourane, Dalmeida Sessi, Dokou Dodo, Steve Mounie, Andreas Hountondji, Junior Olaitan\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/uugy.jpg",
            "description": "Tadious Manyepo in Durban, South Africa Zimbabwe 2-2 Benin MARCH 20 was supposed to be the day. In part, it was. Africa’s most successful female Olympian Kirsty Coventry put Zimbabwe on the map, becoming the first ever female and African president of the International Olympic Committee. The news was wildly celebrated across the continent. And […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "Nust FM’s Bekezela Dube:  A voice for mental health",
            "url": "https://www.chronicle.co.zw/nust-fms-bekezela-dube-a-voice-for-mental-health/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nMENTAL health awareness has become an increasingly critical issue, and leading the charge is Bekezela Dube, affectionately known as MaDube Mthembo.\n\nAs the host, co-producer, and creator of the popular Brainwave Show on Nust FM  an urban campus radio station at the National University of Science and Technology  Bekezela has built a platform dedicated to tackling the pressing mental health challenges faced by young people.\n\nGrowing up in Victoria Falls, her childhood was filled with adventure and joy. However, the tragic loss of her sibling during her teenage years profoundly impacted her mental health and sparked her passion for mental health advocacy.\n\nLosing my brother took a significant toll on my mental well-being. I found solace in journalling, which became my therapy. This journey of self-reflection led to the publication of my first book, Titanium, which speaks about the importance of prioritising mental health, she said.\n\nBekezelas personal experiences ignited her passion for raising awareness about mental health issues. The personality, who is pursuing a Diploma in Media Studies at a college in South Africa, previously worked as a mental health consultant for a mental health organisation, where she facilitated workshops. She was invited to Nust FM to speak about depression and suicide among teenagers, and after her insightful discussion, the shows producers offered her the role of host.\n\nHer show was to be dedicated to mental health, so she seized the opportunity, giving birth to Brainwave Show. Every Wednesday, she engages in thought-provoking discussions with a diverse range of guests, including church leaders, psychologists, ex-prosecutors and human rights advocates.\n\nThrough the show, Bekezela strives to break mental health stigmas, cultivate empathy and understanding and drive positive change within communities.\n\nThe show highlights the psychological effects of drug abuse, explores the legal implications of substance use, and educates listeners about their constitutional rights, she explained.\n\nBeyond the radio studio, Bekezela is deeply involved in community outreach initiatives focused on combating drug and substance abuse, addressing sexual harassment and advocating for womens rights. She has partnered with various organisations, local churches, the Zimbabwe Republic Police,and the Zimbabwe Gender Commission.\n\nHer dedication to social justice and human rights is evident in her work both on and off the air as she is spearheading a donation drive to give back to the community.\n\nTo young people struggling with mental health challenges or feeling marginalised, she offered words of encouragement: Help is always available. Speak up. Seek help. You can rebuild and triumph over lifes challenges with the right mindset.\n\nAs the world commemorates Womens History Month, Bekezelas message to women and girls is one of empowerment and self-care.\n\nLets prioritise our mental health and well-being. Be intentional about taking care of yourself and remember that your mental peace is priceless, she urged.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/56EYT.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com MENTAL health awareness has become an increasingly critical issue, and leading the charge is Bekezela Dube, affectionately known as “MaDube Mthembo.” As the host, co-producer, and creator of the popular Brainwave Show on Nust FM – an urban campus radio station at the National University of Science and Technology – Bekezela has […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "Nssa commends Dinson Iron and Steel Company for safety, health standards",
            "url": "https://www.chronicle.co.zw/nssa-commends-dinson-iron-and-steel-company-for-safety-health-standards/",
            "content": "George Maponga,Masvingo Bureau\n\nTHE National Social Security Authority (Nssa) has commended the Manhize giant iron and steel making firm, Dinson Iron and Steel Company (DISCO) for upholding high occupational health and safety standards that has seen the iron producer recording zero fatalities at its plant in Chirumhanzu since its inception.\n\nExperts and engineers attending the annual Nssa Engineers Workshop in Masvingo, which kicked off on Wednesday made an industrial visit to Manhize yesterday to appreciate occupational health and safety standards at the steel-making behemoth.\n\nThe second group visited the Lake Mutirikwi mini-hydro power plant about 40 km south east of Masvingo City while the last group toured a Delta plant in the Masvingo industrial area.\n\nThe Nssa three-day workshop that ends tomorrow is being held under the theme: Occupational Safety and Health: Technology and the future for work.\n\nHowever, it was the tour of the world-acclaimed Dinsons Manhize steel plant that was an eye opener for experts and engineers attending the Nssa workshop.\n\nSpeaking after the tour, Nssa acting general manager Dr Charles Shava paid tribute to DISCO for high occupational, safety and health standards at its Manhize plant.\n\nWe had a tour of the iron and steel plant at Manhize while another group went to Lake Mutirikwi (for a tour of the hydro power plant) and the last group went to Delta plant in Masvingo City, he said.\n\nBut I think the tour of Manhize was an eye opener for us because here I think we are talking about (arguably) the largest steelworks plant in Africa, its a massive investment, it is a very big project but so far they have done well in terms of occupational safety and health because for the past three to four years they have been in operation, there have not recorded any fatalities at the workplace,said Dr Shava.\n\nThey have had only incidents where some workers have suffered some minor injuries but I think overall they have done very well because we are talking about a very big plant.\n\nDr Shava said Nssas Midlands team would work closely with DISCO to address some of the few challenges pertaining to the issue of occupational safety and health, which were identified during the engineers and experts tour of Manhize.\n\nWe are happy that they (DISCO) have a very good medical team on the ground, they are on top of the game and are able to deal with the issue of diseases, added Dr Shava.\n\nAccording to the Nssa acting general manager, the tour of Manhize by a team of engineers and experts had given them an excellent insight into the interrelationship between engineering and safety.\n\nAt Manhize we realised that they are producing about 50MW of electricity using coal but with very, very limited if not negligible pollution, the coal is emitting very little pollutants in the air and it was a very good insight for our team, it is a very good operation, which they are running at Manhize.\n\nThe tour of DISCOs plant comprised a high powered delegation that also included Nssa board members including the board chair Dr Emmanuel Fundira.\n\nMinister of Public Service Labour and Social Welfare, Edgar Moyo, officially opened the workshop on Wednesday where he lamented the high number of workplace deaths and injuries, which in 2024 averaged 300 and 5 000 respectively.\n\nThe minister disclosed that the Second Republic was working on an occupational, safety and health law that seeks to stem workplace deaths and injuries in Zimbabwe.\n\nZimbabwe, according to Nssa, loses around US$15 million annually from workplace injuries, diseases and deaths, which was too high.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/bfghf.jpg",
            "description": "George Maponga, Masvingo Bureau THE National Social Security Authority (Nssa) has commended the Manhize giant iron and steel making firm, Dinson Iron and Steel Company (DISCO) for upholding high occupational health and safety standards that has seen the iron producer recording zero fatalities at its plant in Chirumhanzu since its inception. Experts and engineers attending the […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "COMMENT: Coventry’s win a historic leap for Zimbabwe, Africa",
            "url": "https://www.chronicle.co.zw/comment-coventrys-win-a-historic-leap-for-zim-africa/",
            "content": "Kirsty Coventry, the Minister of Sport, holds a number of records.\n\nThe 41-year-old former swimmer is easily our countrys most successful Olympian with seven medals across two Olympics. She won three at the Athens Olympic Games in 2004 in Greece; a gold in the womens 200m backstroke, a silver in the 100m backstroke, and a bronze in the 200m medley.\n\nAt the Beijing Olympics in 2008, she defended the 200m backstroke title and also added three silver medals.\n\nThat medal haul makes her Africas most decorated Olympian as well.\n\nYesterday, she was back to the country where her global Olympic dominance started  Greece  to cement her position as the leading Olympian on the continent.Rather, she rose to world stage once again after her election as the president of the International Olympic Committee with a crushing majority.\n\nShe got 49 votes, almost doubling her closest challenger, Juan Antonio Samaranch, who received 28. Five other contestants got between two and eight votes each.\n\nFrom being Africas top individual Olympian to becoming the IOCs first African president, Minister Coventry has sealed her status in the Olympic movement on the continent, and worldwide.\n\nThe records do not end there.\n\nShe has become the first female IOC president in the organisations very, very long history. At the same time, she became the IOCs youngest president.\n\nShe succeeds Thomas Bach, probably, her strongest and most influential backer in the race, in June. The minister will serve for eight years.\n\nIndeed, hers is an illustrious story of success and firsts.\n\nWe are very happy that Minister Coventry has risen to this level. She will, as she proudly did as an athlete, fly the national flag high at the world stage. She will be our biggest sporting ambassador, marketing the country wherever she will go over the next eight years as IOC president.\n\nWe acknowledge that she has assumed an international post and is expected to be every sportspersons president but we are hopeful that her presence at the top would help her country compete for podium finishes in future Olympics.\n\nJust eight Olympic medals for our country, seven of which were won by her, is a woeful record for us.\n\nAlso, we are hopeful that her presence at the top will drive African Olympic performances as well.\n\nPresident Mnangagwa was really delighted yesterday that his ministerial appointment, the quality he saw when appointing her as minister in 2018, got a ringing global endorsement.\n\nPresident Mnangagwa\n\nCongratulations to our own Kirsty Coventry on her historic election as the first female and first African President of the IOC. A proud achievement for Zimbabwe and the continent! Wishing her the greatest of success, he wrote on X.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dfsdf.jpg",
            "description": "Kirsty Coventry, the Minister of Sport, holds a number of records. The 41-year-old former swimmer is easily our country’s most successful Olympian with seven medals across two Olympics. She won three at the Athens Olympic Games in 2004 in Greece; a gold in the women’s 200m backstroke, a silver in the 100m backstroke, and a […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "URL applauds Government’s  initiatives to reduce business costs",
            "url": "https://www.chronicle.co.zw/url-applauds-governments-initiatives-to-reduce-business-costs/",
            "content": "Sikhulekelani Moyo,Business Writer\n\nBULAWAYO-based edible oils processor, United Refineries Limited (URL), has commended ongoing Government policy interventions to reduce the high cost of doing business.\n\nInterventions have included tight monetary and fiscal policies, which have cut the gap between the formal and parallel market exchange rates from over 50 percent last year to around 25 percent.\n\nRecently, Finance, Economic Development, and Investment Minister Professor Mthuli Ncube said the Treasury would streamline taxes and review costs associated with regulatory compliance to improve the viability of business operations.\n\nThis followed President Mnangagwas directive for statutory bodies to ensure that their charges and regulatory requirements do not suffocate businesses but promote growth and investment.\n\nURL management hailed the Governments efforts to address challenges blighting businesses during a visit to Bulawayo by the Portfolio Committee on Industry and Commerce, led by Zaka South lawmaker, Mr Clemence Chiduwa.\n\nMr Blatch (left) explaining the production process to the Potfolio Committee Chairperson Hon Clemence Chiduwa during the committee visit ti URL yesterday\n\nThe visit, part of the committees nationwide fact-finding tour, is meant to assess the ease of doing business conditions across the country.\n\nURL is one of Zimbabwes largest cooking oil refineries with a capacity of 12 000 tonnes per year from soya bean seed, a combined 9 450 tonnes per year for laundry and bath soaps and further 30 000 tonnes per year for stock feeds.\n\nThe company currently employs 263 full-time employees along with seasonal labour, depending on the level of production activity, averaging 100 people each month.\n\nIt is one of the few manufacturing companies that remains operational at significant capacity utilisation levels in the southern region of the country.\n\nIn addition to its branded product lines, URL also produces soya meal and soya bean cake, both of which are ideal for poultry and pig production. Additionally, the company produces soya bean hulls, which are high in fibre and suitable for cattle, chicks and mushroom cultivation. These products are by-products of the cooking oil manufacturing process, with an annual production of 30 000 tonnes.\n\nURL has also branched into rice, maize meal and noodles production.\n\nIn an interview, during the tour, URL general manager Mr Benjamin Blatch said the narrowing gap between the parallel market and official exchange rates had also helped reduce the cost of doing business.\n\nExchange rate volatility made business planning difficult and distorted pricing. It also fuelled inflation, diminishing the value of the domestic currency and savings.\n\nExchange rate stability, since the introduction of the Zimbabwe Gold in April last year, has arrested rampant inflation, restoring predictability in business planning.\n\nWe are seeing the disparity between informal and formal (exchange rates) converging, which is allowing a better conversion through the willing buyer willing seller, which we appreciate.\n\nWe are looking forward to a stable environment, Mr Blatch said.\n\nHe, however, noted that the company was facing challenges accessing raw materials, due to delays in global logistics, delays at the countrys ports of entry and working capital constraints, among others.\n\nURL is one of the oldest companies that have withstood the test of time in Bulawayo and continues to be a shining example of resilience as it not only supplies critical products but also remains one of the biggest employers in the city.\n\nMr Chiduwa said the committee was happy with URLs operations, as this showed its desire to grow.\n\nHe said URL was doing well on the edible oils value chain, which had the positive effect of helping cut the cost of importing edible oils and promoting local value chains.\n\nWe came here as the Parliamentary Portfolio Committee on Industry and Commerce to assess the ease of doing business, specifically looking at the operations of URL, said Mr Chiduwa.\n\nWe are happy with the diversified portfolio that we have seen and URL is bullish about the future, in terms of capacity utilisation, they are on 52 percent and there are a number of things that they have mentioned to us, especially the exemption to pay tax on plastics and the preferences are for the plastics to be zero rated, which will assist them to claim the VAT.\n\nWe are also looking at the (working) capital (issues), they are very happy with the Targeted Finance Facility (TFF), they have utilised it, but we are looking at a situation where that TFF facility can be expanded, he said.\n\nThe TFF facility is a funding facility established by the Reserve Bank to redistribute existing excess liquidity in the market to cover the needs of other banks in short positions.\n\nMr Chiduwa also noted that URL was happy about the closing gap between the black market and the official exchange rates, which showed that the Government is doing well in terms of implementing business-friendly policies.\n\nThe committee has toured several companies in Harare, Mutare, Chiredzi and Bulawayo.\n\nIn terms of the disparity that is there between the parallel rate and the official rate, they are extremely happy to say, we are moving in the right direction.\n\nThe (high) cost of doing business was also mentioned, but it mainly has to do with electricity challenges, he said.\n\nWe are happy with the backward and forward linkages where they are promoting the whole value chain, starting from the farmers up to the point when we have our cooking oil.\n\nWe also say, as a committee, there is a need for us to minimise the importation of edible crude oil, we would want that to come from local production, but as a committee, we are very happy.\n\nHe said all the challenges raised by industrial companies would be tabled in Parliament for consideration and possible solutions.\n\nMr Chiduwa said the tour was part of the Governments efforts to address costs associated with regulatory compliance and other policy and economic challenges.\n\nThis follows lobbying from captains of industry and commerce that taxes and regulatory charges be reduced or eliminated.\n\nThis overhaul is intended to simplify the licensing system and reduce bureaucratic barriers, making it easier for businesses to operate and thrive.\n\nCabinet has since established a high-level committee to review the existing regulations and fees, taking into account the concerns of industry leaders regarding the burdensome financial costs and hindrances to growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/frvd.jpg",
            "description": "Sikhulekelani Moyo, Business Writer BULAWAYO-based edible oils processor, United Refineries Limited (URL), has commended ongoing Government policy interventions to reduce the high cost of doing business. Interventions have included tight monetary and fiscal policies, which have cut the gap between the formal and parallel market exchange rates from over 50 percent last year to around 25 […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "ED meets Adesina, Chissano",
            "url": "https://www.chronicle.co.zw/ed-meets-adesina-chissano/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nAFRICAN Development Bank (AfDB) president Dr Akinwumi Adesina has reassured President Mnangagwa that he will continue championing Zimbabwes Arrears Clearance and Debt Resolution programme beyond his tenure at the continental bank.\n\nDr Adesina, whose term as AfDB president ends in August, and former Mozambican President Joachim Chissano, yesterday paid a courtesy call on President Mnangagwa at State House in Harare.\n\nThe President described the visit as fantastic.\n\nI had a wonderful chat with my two younger brothers. Time after time they come to the old man to take wisdom and I enjoy it, President Mnangagwa said.\n\nSo I had a fantastic morning talking to my two younger brothers. What else would I want when my younger brothers find time to come talk to me.\n\nPresident Mnangagwa welcomes the Mozambican former President Chisano while AfDB president Akinwumi A. Adesina looks on at the Roundtable on Zimbabwe Debt Arrears Clearance meeting, in Sharm el-Sheikh, Egypt, yesterday.-Picture Tawanda Mudimu\n\nDr Adesina said his decision to stay on in the debt negotiations was influenced by Zimbabwes standing as a strategic country in the region.\n\nThe AfDB boss said he was personally and fully committed to seeing through the success of the arrears clearance platform.You know, this is a full commitment. I am personally committed to this. The African Development Bank is fully committed to this . . . you know, it goes beyond myself or my term because Zimbabwe is a very important part of the African Development Bank.\n\nZimbabwe is a critical country in the SADC region and, in fact, I was talking to His Excellency (President Mnangagwa) about how we look at regional trade, and the Zimbabwe railway network is critical in our centre for everything, he said.The AfDB, said Dr Adesina, remained a friend to Zimbabwe.\n\nSo, we clearly, as the African Development Bank, are committed to this. And this, of course, will continue. We are a friend of Zimbabwe, and everybody else is, he said.Zimbabwe has a debt overhang of US$21,1 billion.\n\nOf this, external debt stands at US$12,3 billion and domestic debt at US$8,7 billion, and the country has been making efforts to settle the arrears.\n\nDr Adesina said President Mnangagwa had shown tremendous goodwill from the onset towards the success of the arrears clearance process.\n\nPresident Mnangagwa chats with former Mozambique President Joaquim Alberto Chissano after a meeting at State House in Harare yesterday.  Picture: Justin Mutenda\n\nAll I can tell you is that the President is strongly supportive of this process and will do all it takes to make sure that this ends.We are excited about the progress we have madeall the bilateral partners that are here, World Bank, IMF and UNDP and everybody else, we are all working together for the same goal.\n\nAnd, you know, we are not fully there yet but we also, as African Development Bank, have been very supportive of this process, he said.\n\nDr Adesina said everything was being done to ensure everything goes well, including the roping in of financial and legal advisory firms.\n\nWe have a clear timeline that has been done. We have paid to secure a global financial advisory firm to support Zimbabwe towards that end.\n\nWe have also paid for a legal advisory firm that is advising the country and we are looking into how to get the bridge financing framework in place that will allow Zimbabwe to be able to clear some of the arrears that it has in multilateral financial institutions, he said.\n\nJoachim Chissano\n\nFormer President Chissano said there was progress being made in engaging international lending institutions and it was especially encouraging to note that the AfDB remained committed to Zimbabwes arrears clearance process.\n\nSo, it is about the progress that we are reaching in all the processes. It is a matter of continuation, and I think that soon, we will have better results.\n\nI also was worried that when he (Dr Adesina) leaves, what is going to happen but he reassured me that he personally will continue with us, but also the bank will continue with us.\n\nSo, we are satisfied with all the measures that are being taken to stabilise the country in all forms, he said.Former President Chissano said the future was bright for Zimbabwes continued economic growth.\n\nWe are happy that there is immense hope for economic growth in the country and that the agriculture sector will grow better.And we are expecting to have better wheat, and maybe we will buy from here, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/YWER.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau AFRICAN Development Bank (AfDB) president Dr Akinwumi Adesina has reassured President Mnangagwa that he will continue championing Zimbabwe’s Arrears Clearance and Debt Resolution programme beyond his tenure at the continental bank. Dr Adesina, whose term as AfDB president ends in August, and former Mozambican President Joachim Chissano, yesterday paid a courtesy […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        },
        {
            "title": "On the spotlight with DJ Prince Eskhosini. . . Dancer Punky on her path from Mpopoma High to global stage",
            "url": "https://www.chronicle.co.zw/on-the-spotlight-with-dj-prince-eskhosini-dancer-punky-on-her-path-from-mpopoma-high-to-global-stage/",
            "content": "Born and raised in Bulawayo, Benhilda Ngwenya, better known as Punky, has travelled the world through dance, establishing herself as a prominent ambassador of Zimbabwean arts and culture.\n\nWith over two decades in the industry, she has performed with circus show Mother Africa, and arts groups  Iyasa and Siyaya arts in countries such as Switzerland, Austria, UK and Italy, showcasing the richness of Zimbabwes cultural heritage. Based in the United Kingdom, Benhildas artistic journey spans dance, music and theatre.\n\nIn this weeks spotlight, we delve into the life and work of this multi-talented artiste.Q. Can you tell us about yourself and what influenced your love for art?A. I am the firstborn in a family of three children, though we lost my younger brother last July. I learnt at Nkulumane Primary School and Mpopoma High School. It was at Mpopoma High that I met Nkululeko Innocent Dube, my Ndebele teacher and class teacher for Forms Three and Four, who was to become a key figure in my artistic development. It was also at Mpopoma High that I discovered the Mpopoma High School Drama Club, which laid the foundation for my interest in the arts.\n\nBenhilda Ngwenya in Sheffield,England,UK with AfroShikisha (2023)\n\nQ. What do you think might have been your source of inspiration?A. My grandfather, a traditional herbalist, was a big influence. He used to host Imigido at home in Mpopoma, where I would wear traditional regalia and dance alongside him. This is where my passion for music and dance was born. While waiting for my Form Four results, I saw a performance by Hloseni Arts at the Vulindlela Youth Centre near my home. I asked to join, but my aunt disapproved of the arts, thinking they were unsuitable. Despite this, I snuck out to practice in our garage. Eventually, I joined a group that formed after a split in the Mpopoma High School drama club and over time, I learnt to overcome stage shyness while training in various forms of dance and vocal techniques.\n\nQ. Can you share how you became a member of Iyasa, your experience training with Iyasa and how Nkululeko Dubes guidance impacted your development as a performer?A. In February 2002, I joined Iyasa, as many of my high school peers had already joined and Nkululeko Dube was leading the group. Iyasa was intense, providing both training and exposure, marking the beginning of my professional arts career. During my time there (2002-2006), Dube helped me identify my strengths and weaknesses, shaping me into a well-rounded artiste. I also travelled all over Zimbabwe as a dancer and vocalist while learning arts management, working as Dubes secretary.\n\nIn 2002, Dube introduced me to Lwazi Tshabangu (jazz musician), who was looking for backing vocalists for his album Kumnyama. This led to my first professional experience working in Harare. In late 2006, I moved to South Africa but returned home in 2007. Thats when Dube introduced me to Winston Ruddle of Mother Africa Circus de Sinne. I auditioned as a musician and secured a role. I began touring internationally with Mother Africa, performing in Germany, Italy, Switzerland and Austria from December 2007 to April 2008. After the tour, I returned home briefly before resuming work with Iyasa.\n\nQ. How did you move from Iyasa to Siyaya?A. In late 2008, there was a planned tour to Spain with Mother Africa, but due to visa issues, it was cancelled. In January 2009, Dube introduced me and other Iyasa members to Siyaya Arts, where we auditioned for Zambezi Express. I secured a role and toured the UK and Europe with Siyaya from June to October 2009. In December 2009, I resigned from Iyasa and joined Siyaya full-time, focusing more on theatre and continuing my international tours.\n\nQ. Which other projects have you worked on?A. In 2013, I settled in the UK and have worked on numerous projects since. Some highlights include being a backing vocalist for, A Celebration of Paul Simons Graceland Live UK Tour (2019), recording a jingle for a Lionel Richie song with Lebo M under Sactuk and playing Nomsa in the Mandela Workshop at The Young Vic Theatre in 2021. I also worked on the 2024, Reuniting with Lebo M project, and recorded soundtrack music for Mufasa: The Lion King, in 2024. Through these experiences, I had the opportunity to work with renowned figures like Barry Jenkins and Lin-Manuel Miranda. I am also a member of AfroShikisha, an all-female arts group based in England and collaborate with artistes like Busi Mhlanga. Currently, I work full-time in the health sector in the UK.\n\nBenhilda Ngwenya with Lin-Manuel Miranda recording MUFASA:THE LION KING Soundtrack in AIR Studios,London,UK 2023\n\nQ. What would you consider to be your best moment in the industry?A. One of my best moments was meeting Gerry Cottle (British circus owner) and being on an episode of the Paul OGrady Show with Zambezi Express in 2009. Between 2009 and 2013, I had the privilede of performing at Womad in Malta and Spain, and I travelled extensively across the UK, making multiple appearances at the Edinburgh Fringe Festival and Glastonbury Festival.\n\nQ. What challenges have you encountered in the industry?A. One major challenge is the stereotyping and gender imbalance in the arts. Women are often included in casts as mere tokens or flowers to create the illusion of balance in a male-dominated industry, which undermines their contributions. Another challenge is balancing work and family life. The arts industry often requires extensive travel and long rehearsal hours, making it difficult to maintain a stable home life.\n\nQ. Can you share your overall view of the art scene in Zimbabwe and outside of Zimbabwe?A. In Zimbabwe, the arts industry was often seen as a hobby rather than a serious profession, especially for women. Female artists were frequently treated as interchangeable, with limited creative input. However, outside Zimbabwe, there is more empowerment for women in the industry. We have greater control over our treatment and more opportunities to create our own spaces. These environments enable us to challenge misrepresentation and redefine the role of women in the arts.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/TWRWRT5-1.jpg",
            "description": "Born and raised in Bulawayo, Benhilda Ngwenya, better known as “Punky,” has travelled the world through dance, establishing herself as a prominent ambassador of Zimbabwean arts and culture. With over two decades in the industry, she has performed with circus show Mother Africa, and arts groups – Iyasa and Siyaya arts in countries such as […]",
            "time": "08:29",
            "date": "21 Mar 2025"
        }
    ]
}