{
    "news": [
        {
            "title": "Top Bulawayo firms lead retooling drive",
            "url": "https://www.chronicle.co.zw/top-bulawayo-firms-lead-retooling-drive/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nBULAWAYOS manufacturing sector is experiencing a significant resurgence, driven by substantial capital investments from leading companies such as Treger Group, Edgars Stores Carousel Manufacturing, Arenel, Datlabs, and Innscor Africa Limited.\n\nThese investments, focused on retooling and enhancing production efficiencies, are paying off, with companies reporting increased capacity utilisation, job retention, and export growth.\n\nThe re-industrialisation drive is a key pillar of the Governments National Development Strategy (NDS), which aims to achieve an upper-middle-income economy by 2030.\n\nPermanent Secretary for Presidential Affairs and Devolution, Engineer Tafadzwa Muguti, recently visited top companies in Bulawayo and noted that the Governments business-friendly policies and incentives were yielding positive results.\n\nAs a result, Bulawayo is slowly regaining lost ground after years of failed attempts to reverse de-industrialisation and bring about sustainable business viability.\n\nTreger Group, a shining example of Bulawayos manufacturing potential, has invested US$4,5 million in modernising its production plants.\n\nTreger Group managing director, Mr Fitzpatrick Mawovera, stated: We aim to be one of the leading manufacturers not only in Zimbabwe but in the region.\n\nHe, however, appealed for Government intervention to regulate cheap imports and the informal sector, which provides unfair competition.\n\nHowever, there are issues that we would want authorities to look into. Cheap imports are coming into the country. We need that space to be regulated. The informal sector is growing and is unregulated, providing unfair competition, he said.\n\nMr Mawovera appealed for further Government intervention in the rollout of industrial incentives to accelerate the retooling drive.\n\nWe also want companies to be incentivised to employ bigger numbers and have access to cheaper loans to further retool factories, he said.\n\nThe Treger Group has become the largest manufacturer of household, industrial and hardware appliances in Africa through its different divisions.\n\nThe group is one of the largest manufacturers of window frames, door frames, wheelbarrows, geysers, kitchen furniture, and painted and galvanised hardware to the building and allied industries. Its products are of high quality and conform to the Standards Association of Zimbabwe (SAZ) standards.\n\nThe company also exports to several countries in Southern Africa and beyond.\n\nCarousel Manufacturing, another major player, has seen production units growing to 2 500 daily, up from less than 200 units a few years ago, following a US$1 million capital investment.\n\nDirector, Menfree Tanyanyiwa attributed the growth to an aggressive retooling exercise aimed at increasing capacity, efficiency, and product quality.\n\nWe have been interacting with customers in the retail sector for the last eight or so years, and recently we went on a very aggressive re-tooling exercise, mainly aimed at increasing capacity, improving efficiency, and improving the quality of our product. That exercise is still ongoing, he said.\n\nWe still have a few more pieces of machinery that we want to acquire, and we are hoping that in the first half of the year, funds permitting, we will be able to source it.\n\nWe are currently pursuing the Reserve Bank of Zimbabwe facility, and we are hoping to use the funds to acquire the last pieces of the machinery.\n\nOn production, Mr Tanyanyiwa said the broader aim is to get back to 1999 levels when the firm used to produce 100 000 units a month, and expressed confidence in reaching the volumes. In terms of employment levels, the bulk of approximately 700 workers are females constituting 60 percent.\n\nHe indicated that upgrading the laundry machine was being prioritised at an estimated cost of US$260 000, and the cutting room solution at US$250 000.\n\nPresident Mnangagwas commissioning of the new Bakers Inn factory in the Belmont industrial area last year, where Innscor Group invested nearly US$30 million, is a testament to the Governments efforts to revive Bulawayos industrial sector.\n\nEng Muguti noted that Edgars, which had downsized to about 30 employees, now employs 700 people in its Bulawayo plant, demonstrating the effectiveness of the Governments policies.\n\nAs we know, Bulawayo used to be the hub of industrial activity. One of the things we have seen is that Government policies are working, he said.\n\nBulawayos de-industrialisation, exacerbated by Western sanctions, has been reversed, with several companies reviving operations and increasing production.\n\nThe Governments assistance in retooling and diversifying operating models has led to significant job creation and economic growth.\n\nThe Ministry of Industry and Commerces allocation of ZWG509 million for implementation of the Zimbabwe Industrial Reconstruction and Growth Plan (2024-2025) will further enhance re-industrialisation programmes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/zdvv.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw BULAWAYO’S manufacturing sector is experiencing a significant resurgence, driven by substantial capital investments from leading companies such as Treger Group, Edgars Stores’ Carousel Manufacturing, Arenel, Datlabs, and Innscor Africa Limited.  These investments, focused on retooling and enhancing production efficiencies, are paying off, with companies reporting increased capacity utilisation, job retention, and export growth. […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "WATCH: VP Mohadi urges youths to chase their dreams",
            "url": "https://www.chronicle.co.zw/watch-vp-mohadi-urges-youths-to-chase-their-dreams/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nVICE-President Kembo Mohadi underlined the crucial role of youth empowerment in achieving Vision 2030, stressing that the future of Zimbabwe depends on the active participation of its young people.\n\nSpeaking at the inaugural sporting tournament held in his honour at Phelandaba Stadium in Gwanda yesterday, VP Mohadi urged public and private sector players to prioritise youth empowerment in their programming.\n\nI encourage the creation of youth focal desks and appointment of youth focal persons in every organisation so that youth development becomes a reality, not just rhetoric talk, he said.\n\nAs we strive to modernise our country, it is imperative that the youth play an active role in every aspect of nation development.\n\nVP Mohadi also highlighted the importance of youth involvement in national and community development programmes.\n\nThe youths should stand up and demand to be included in national and community development programmes.\n\nVP Mohadi commended the Second Republics commitment to youth empowerment, citing the creation of the Ministry of Youth Empowerment, Development and Vocational Training.\n\nUnder this ministry, various programmes and activities are offered for the development and empowerment of youths.\n\nHe also emphasised the significance of sports in shaping the future of young people and praised the tournament organisers for providing valuable lessons to youths through exhibitions and programmes.\n\nVP Mohadi expressed concern over the rising incidents of drug and substance abuse among youths and adults, urging communities to work together to reverse the trend.\n\nHe said many youths with a promising future had fallen victim to the scourge and urged communities to end the problem so they can realise their dreams.\n\nDrawing from his personal experience, he encouraged youths to persevere and work towards their dreams.\n\nWhat I learnt through my experience was that the road to a better tomorrow is not an easy one. It takes a dedicated person who is willing to sacrifice personal interests for the greater interests of the nation at large, he said.\n\nToday, I stand before you as a proud demonstration of what it means to overcome hardship and adversity. I want to encourage each one of you not to give up on your dreams no matter how impossible they might seem to be.\n\nIn reality, every dream is possible. It might take too much effort and time but through dedication, it is possible.\n\nThe tournament, which featured 12 football and netball teams representing different constituencies, was aimed at nurturing talent, promoting youth development, and combating drug and substance abuse.\n\nThe winning teams received R175 000 each, while the runners-up received R90 000.\n\nGwanda Tshitaudzes football and netball teams won the prize money by beating the Gwanda South teams in the finals.\n\nGwanda Tshitaudze beat Gwanda South 1-0 in football, while the netball side won 28-11.\n\nBeitbridge West Constituency was placed third in the football event while Mangwe was fourth. Umzingwane Constituency came third in netball and Insiza South was fourth.\n\nMatabeleland South Provincial Affairs and Devolution Minister, Dr Evelyn Ndlovu, praised VP Mohadis dedication to youth empowerment and community development.\n\nShe said his influence has been a driving force behind different initiatives, and his contributions have had a profound impact on the community, province and the nation at large.\n\nDr Ndlovu urged youths to embody the spirit of excellence, craftsmanship, entrepreneurship and sportsmanship.\n\nHonourable guest, we are grateful for your selfless efforts, your philanthropic endeavours and your passion to empower our youth and promote community development, she said.\n\nYour remarkable achievements serve as an example to us all. I hope this day will not only show our appreciation and affection but rather push us to follow in your footsteps.\n\nZanu-PF Matabeleland South Provincial Youth League chairperson Cde Moses Langa, emphasised the importance of emulating VP Mohadis hard work and dedication to serving the country.\n\nAs youths from the province, we have to be proud of the leaders we have in the province like our Honourable Vice-President KCD Mohadi, and we have to emulate their great works, he said.\n\nThis tournament is just a start as we will have more editions coming up, and in the process, several youths will be empowered. I call upon more youths to be part of this programme.\n\nCde Langa expressed his gratitude to all constituencies, sponsors and participants for making the tournament a success.\n\nDeputy Minister of Sport, Recreation, Arts and Culture, Emily Jesaya, stressed the significance of youth participation in sports, citing the National Development Strategy 1 (NDS1).\n\nShe encouraged youths to engage in sports, promoting good health, Unhu/Ubuntu values, entrepreneurship, and sporting excellence.\n\nThe tournament was a brainchild of the Zanu-PF Matabeleland South Provincial Youth League aimed at celebrating VP Mohadi as a revolutionary for dedicating his life to the defence of the sovereignty of Zimbabwe.\n\nIt is set to become an annual event and will play a crucial role in unearthing and nurturing sporting talent among the youth as well as helping in the fight against drug and substance abuse.\n\nThe initiative started in May last year with competitions being held at the ward level.  @DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/m.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw VICE-President Kembo Mohadi underlined the crucial role of youth empowerment in achieving Vision 2030, stressing that the future of Zimbabwe depends on the active participation of its young people.  Speaking at the inaugural sporting tournament held in his honour at Phelandaba Stadium in Gwanda yesterday, VP Mohadi urged public and private sector players […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "‘Africa must collaborate on mineral value addition policies’",
            "url": "https://www.chronicle.co.zw/africa-must-collaborate-on-mineral-value-addition-policies/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nFINANCE, Economic Development, and Investment Promotion Minister Professor Mthuli Ncube has urged African countries to collaborate and drive mineral beneficiation and value addition to improve the continents contribution to the global economy.\n\nSpeaking at a briefing on the World Economic Forum (WEF) meeting in Davos, Switzerland, Prof Ncube emphasised the importance of working together to maximise benefits from new energy minerals.\n\nZimbabwe has already taken steps in this direction by banning the export of raw lithium and promoting value addition and mineral beneficiation.\n\nHowever, Prof Ncube acknowledged that regulating these sectors is challenging due to smuggling but stressed that beneficiation and value addition are crucial for unlocking business potential and supporting local communities.\n\nMthuli Ncube\n\nThe future-led minerals are key in Zimbabwe and Africa must position itself appropriately to take advantage. It is the new oil since we dont have massive oil, said Prof Ncube. We should also collaborate with other countries that have similar endowments, be it South Africa, Botswana or DRC.\n\nWe collaborate to create regional policy positions that will help us all maximise benefits from new energy minerals.\n\nProf Ncube also stressed the importance of South Africas upcoming presidency of the G20 in promoting Africas interests, particularly in building resilience, accessing climate finance, and promoting investments in green economies. We look forward to Zimbabwes contribution to the G20 agenda. I have been contributing to some of the themes using my other hat as the chair of the Committee of African Finance Ministers this year where we had conversations on the future of energy minerals, how to reform the global financial system and also how to access climate finance, said Prof Ncube.\n\nAt the WEF annual meetings in Davos, Zimbabwe positioned itself to make a significant impact by advocating for crucial reforms to the global financial architecture.\n\nProf Ncube led the Zimbabwe delegation and emphasised the need to reform the international financial system to better serve developing nations, particularly in Africa.\n\nHe also discussed Zimbabwes plans to access climate funding, highlighting the need to invest in electric cars, cleaner railway infrastructure, and other initiatives.\n\nBy leveraging climate funding, Zimbabwe aims to turn climate challenges into opportunities for investment and growth.  @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-17-1.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com FINANCE, Economic Development, and Investment Promotion Minister Professor Mthuli Ncube has urged African countries to collaborate and drive mineral beneficiation and value addition to improve the continent’s contribution to the global economy. Speaking at a briefing on the World Economic Forum (WEF) meeting in Davos, Switzerland, Prof Ncube emphasised the importance of […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "4 brothers get life sentences for brutal murder",
            "url": "https://www.chronicle.co.zw/4-brothers-get-life-sentences-for-brutal-murder/",
            "content": "Patrick Chitumba,[emailprotected]\n\nHIGH Court judge, Justice Munamato Mutevedzi, on Friday handed down a life imprisonment sentence to five men, including four brothers, for the brutal murder of Mr Isabel Ndlovu (28).\n\nThe incident occurred on November 30, 2022, at Linda Business Centre in Silobela, Midlands province, where the gang stabbed Mr Ndlovu with knives, assaulted him with logs, and an empty beer bottle.\n\nThe four brothers, Mkhululi Ncube (26), Qhubekani Ncube (23), Cabangani Ncube (30), and Thulani Ncube (27), from Mabuthe Village, and Mexen Moyo (28) from Mthethehe Village under Chief Malisa, appeared before Justice Mutevedzi during a High Court circuit in Gweru.\n\nThey pleaded not guilty but were convicted of murder after a full trial.\n\nProsecutor, Mr Justin Uladi, presented evidence that the five attacked Mr Ndlovu, who later died upon arrival at Kwekwe District Hospital.\n\nHe said on November 30, 2022, at around 4pm, the deceased was at Linda Business Centre, Silobela at one Peter Marangas shop.\n\nThe five accused persons walked towards Peter Marangas shop armed with knives and the deceased then walked towards them, he said.\n\nMr Uladi said Cabangani grabbed Mr Ndlovu by the belt and Moyo struck him with an empty beer bottle before tripping him to the ground.\n\nMoyo then stabbed Mr Ndlovu twice with a knife on the buttocks.\n\nQhubekani stabbed the deceased with a knife in the thigh. All the accused then joined and stabbed the deceased indiscriminately on the legs and buttocks, said Mr Uladi.\n\nThulani hit the deceased with a log on the legs and arm. Mkhululi stomped the deceased on the neck and kicked him in the ribs.\n\nWitnesses testified to the brutal nature of the attack, with Mr Ndlovus mother, Ms Sawe Ncube, recounting how the five thugs showed no remorse, referring to her son as a dog.\n\nWhen I arrived at the shops and they saw me, Qhubekani and Thulani used logs to strike my sons legs and arms, while Mkhululi stomped on his neck and kicked him in the ribs, she recounted.\n\nAfter they were satisfied with the damage they had done to my son, the accused persons said, take your dog away, she said with tears streaming down her cheeks.\n\nMs Ncube said a well-wisher ferried her badly injured son to Kwekwe District Hospital, where he succumbed to his injuries.\n\nConstable Mhondiwa Chitima told the court that the accused brothers surrendered themselves at the police station on August 7, 2023, and Moyo did the same on August 26.\n\nJustice Mutevedzi stressed that the accused gang forfeited its right to a second chance in society due to the heinous nature of the murder.\n\nYou do not deserve to reintegrate into society. Your actions demonstrate a complete disregard for human life, and therefore, you forfeit your right to a second chance. Accused one to five are sentenced to life in prison each, ruled Justice Mutevedzi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw  HIGH Court judge, Justice Munamato Mutevedzi, on Friday handed down a life imprisonment sentence to five men, including four brothers, for the brutal murder of Mr Isabel Ndlovu (28).  The incident occurred on November 30, 2022, at Linda Business Centre in Silobela, Midlands province, where the gang stabbed Mr Ndlovu with knives, assaulted […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "Magwizi answers Zifa call",
            "url": "https://www.chronicle.co.zw/magwizi-answers-zifa-call/",
            "content": "Curtworth Masango\n\nBUSINESSMAN Nqobile Magwizi has been elected as the new president of Zifa, marking a significant turning point for Zimbabwean football.\n\nMagwizi secured a decisive 80 percent landslide victory, winning 61 out of 76 votes cast by the Zifa Assembly at a Harare hotel on Saturday.\n\nThe new Zifa board, comprising Magwizi, vice-presidents Kenny Ndebele and Loveness Mukura, and six ordinary members, is expected to work towards rebuilding the sport and restoring its reputation.\n\nWith Magwizi at the helm, Zimbabwean football is poised for a new dawn of growth, development and success.\n\nKennedy Ndebele\n\nIn his acceptance speech, Magwizi stressed the importance of partnerships in growing football in Zimbabwe.\n\nWe need to rebuild trust and partners. Partners are very critical in the growth of football in Zimbabwe, he said.\n\nMagwizi also underlined his commitment to collaboration and development, citing Ecobanks promise to work with Zifa and provide an office space while renovations are underway.\n\nMagwizis vision for Zimbabwean football includes commercialisation, success in the Afcon tournament, and transparency.\n\nWe have to make sure that we commercialise. We have Afcon coming up which becomes our primary purpose. If we dont do well there, it means we are failing and its our commitment to do well . . . If we dont do well there, it means we are failing, he said.\n\nAfcon Trophy\n\nSo we are very committed to hitting the ground running and we need to have the next matches played here. Its embarrassing to play outside the country.\n\nThis is a national project that needs all of us, where we err you should be able to tell us. You have the right to have a say in this administration.\n\nIf we are to be successful as a nation, transparency is important, so its about us working together not as individuals, said Magwizi.\n\nOne of his vice-presidents, Ndebele, concurred, calling for unity among stakeholders to support the presidents vision.\n\nIts a new paradigm and we need to chart the way forward. We need to support the president and the executive and all the committees as we engage all our key stakeholders from the presidium, ministry, and SRC, to make sure that we develop the game and ensure we compete and win trophies at the highest stage, he said.\n\nThe election marks a significant milestone for Zimbabwean football, which has faced numerous challenges in recent years, including a two-year Fifa ban and the effects of Covid-19.\n\nThe new Zifa board is expected to focus on rebuilding and restoring the sports reputation.\n\nThe other six elected board members are Tafadzwa Benza, Thomas Marambanyika, Kudzai Kadzombe, Brighton Ushendibaba, Davison Muchena and Alice Zeura.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fgcn.jpg",
            "description": "Curtworth Masango BUSINESSMAN Nqobile Magwizi has been elected as the new president of Zifa, marking a significant turning point for Zimbabwean football. Magwizi secured a decisive 80 percent landslide victory, winning 61 out of 76 votes cast by the Zifa Assembly at a Harare hotel on Saturday. The new Zifa board, comprising Magwizi, vice-presidents Kenny […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "COMMENT: Magwizi must work on rebranding Zifa and promote transparency, accountability, and inclusivity",
            "url": "https://www.chronicle.co.zw/comment-magwizi-must-work-on-rebranding-zifa-and-promote-transparency-accountability-and-inclusivity/",
            "content": "ZIFAS newly-elected president, Nqobile Magwizi, faces the daunting task of transforming the associations tainted image and reviving Zimbabwean football. For years, Zifa has been plagued by maladministration, corruption, and embezzlement allegations, leading to a decline in local teams competitiveness and a lack of transparency in financial activities.\n\nMagwizi was elected on Saturday with his two vice-presidents, Kennedy Ndebele and Loveness Mukura, as well as ordinary board members, Tafadzwa Benza, Thomas Marambanyika, Kudzai Kadzombe, Brighton Ushendibaba, Davison Muchena and Alice Zeura.\n\nThey will be joined by the chairs of the Premier Soccer League and Zimbabwe Women Soccer League respectively.\n\nMagwizi, who emerged as a virtual outsider in the Zifa presidential race on Saturday, has an uphill task ahead, but with the right strategies and a positive mindset, he could help take Zimbabwean football to new heights.\n\nOver the past years, Zifa has suffered from pervasive corruption and mismanagement, which has had a significant impact on the development of football in Zimbabwe.\n\nThe successive leadership crises have led to a sharp decline and a lack of competitiveness among local teams. This trend has been further fuelled by inadequate funding, irregularities in player transfers, and the lack of transparency in Zifas financial activities.\n\nIf Zifa is to have any hope of reversing this trend, Magwizi must provide a framework that promotes transparency, accountability, and inclusivity. The new leadership must take steps to ensure that it is free from the petty squabbles and bickering that have plagued Zifa for far too long. They need to work towards putting in place a culture that demands respect for the rule of law and good governance.\n\nHis impressive CV and passion for the game are promising, but he must prioritise grassroots development, womens football, and junior academies, with incentives offered to those who prove successful.\n\nHe must work towards the professionalism of Zimbabwean football and make it attractive to investors. Magwizi should also put adequate measures in place to ensure that his board is driven by a passion for the game rather than personal gain.\n\nAs we urge Magwizi to lead the charge in reviving Zimbabwean football, it is also important to remind him of the challenges that lie ahead. First, he should take immediate action to ensure that Zifa is free of corruption by instituting an independent auditor to scrutinise all financial activities of the association. He should also set up an anti-corruption unit, free from any interference. This unit should be tasked with investigating all suspected cases of irregularities in player transfers, match-fixing, and favouritism.\n\nIn addition to this, we also implore Magwizi to look at aligning Zimbabwean football with global standards and trends. He must work towards forging strong ties with international sports associations. This would give Zimbabwean football exposure and facilitate the transfer of technology, know-how, and resources across borders.\n\nMagwizi needs to be bold and decisive in his leadership. The challenges ahead require strong leadership and a willingness to make difficult decisions. He must be guided by the people of Zimbabwe and the love they have for the game. The new board must also be willing to accept and implement constructive criticism and suggestions from stakeholders, such as players, coaches, and fans.\n\nZimbabwean football is at a critical juncture, and Magwizi needs to lead the change. The new board must work on rebranding Zifa and promote transparency, accountability, and inclusivity to restore the associations reputation. With strong leadership and a willingness to change, Zimbabwean football can overcome its challenges and regain its position of pride in the African continent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fxgxxx.jpg",
            "description": "ZIFA’S newly-elected president, Nqobile Magwizi, faces the daunting task of transforming the association’s tainted image and reviving Zimbabwean football. For years, Zifa has been plagued by maladministration, corruption, and embezzlement allegations, leading to a decline in local teams’ competitiveness and a lack of transparency in financial activities. Magwizi was elected on Saturday with his two […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "WATCH: Sandra Ndebele kicks off 2025 with a bang!",
            "url": "https://www.chronicle.co.zw/watch-sandra-ndebele-kicks-off-2025-with-a-bang/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE Zimbabwe International Exhibition Centres Hall 2 in Bulawayo was transformed into a vibrant sea of denim and pearls as fans gathered to celebrate musician Sandra Ndebeles belated birthday party.\n\nThe Denim and Pearls themed event, which took place on a chilly January evening, was a resounding success, with attendees shaking off the post-holiday blues.\n\nDJ Tira\n\nRunning under the theme Embracing your inner shine as we celebrate life, the event lived up to its billing as people unleashed their inner joy.\n\nSouth African Afro-pop sensation Qwabe Twins, comprising Virginia and Viggy, took to the stage alongside renowned DJ, record producer, and Afrotainment boss DJ Tira (Mthokozisi Khathi).\n\nThe trio delivered electrifying performances, with the Qwabe Twins, making their debut performance in Bulawayo, showcasing their impeccable harmonies and DJ Tira treating the crowd to his signature blends.\n\nSandra Ndebele (second from right) poses for a picture with DJ Tira (second from left) and the Qwabe Twins at the Denim on Pearls event\n\nAs the night wore on, the energy in the room reached fever pitch, with fans singing along to hits like Hamba and Alusafani.\n\nThe Qwabe Twins perfectly choreographed dance routines added to the excitement, creating a carnival-like atmosphere.\n\nDJ Tira, a seasoned performer in Zimbabwe, took the crowd on a nostalgic journey, revisiting his iconic collaborations with Big Nuz.\n\nHis performance was a testament to his expertise as a DJ and performer, commanding the stage with confidence and charisma.\n\nIn a departure from the norm, where South African artistes are often criticised for brief performances, DJ Tira and the Qwabe Twins delivered extended sets, leaving the crowd enthralled and sweaty.\n\nBacktracks were seamlessly intertwined with live percussion, giving the performances a raw, organic feel that delighted fans.\n\nDJ Tira praised Sandra Ndebele for organising a unique and enjoyable event, saying: Shout out to Sandra Ndebele for putting together such a beautiful event. Its nice to do something different  were used to performing at parks and clubs, so being in a more relaxed and unique setting was a great change. I had a good time, DJ Tira told Chronicle Showbiz shortly after his performance.\n\nReflecting on the passing of Big Nuzs Mampintsha, DJ Tira acknowledged the profound impact of his loss on the music industry.\n\nIts been hard losing Mampintsha. He contributed so much to the music industry. He did exceptionally well while he was with us, and we definitely miss him a lot. But we continue to soldier on doing the work. May his soul rest in peace, Tira said.\n\nThe birthday girl, Sandra Ndebele, was radiant, taking selfies with fans and gracing the stage with her cheerleaders.\n\nDespite January typically being a financially tight month when people often avoid outings, Sandras celebration drew an impressive turnout.\n\nWhats a birthday party without a cake? Sandras blue cake, designed to resemble denim shorts, perfectly matched the partys theme and was a standout highlight.\n\nHer attention to detail ensured that every aspect of the event, from the seating arrangements to the meals, was unforgettable and deeply personal.\n\nLocal acts, including the No Name dance crew, DJ Eugy, Prince Eskhosini, and DJ Nospa, delivered impressive sets, keeping the crowd energised throughout the night.\n\nDancer Metty Intombi Emfitshanes mesmerising moves left a lasting impression, while comedian Ntando van Moyo and modelling instructor Sipho Mazibuko were among the notable attendees.\n\nSandra Ndebele must be given her flowers for ensuring a smooth event where the audience did not have to wait till the wee hours of the morning to see the artistes on stage.\n\nHer Denim and Pearls event set the tone for an exciting year in showbiz, with its unique blend of music, dance, and celebration.\n\nAs the curtains closed on this unforgettable night, fans left with memories that will last a lifetime, eagerly anticipating what 2025 has in store for the entertainment scene. Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-8-2.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE Zimbabwe International Exhibition Centre’s Hall 2 in Bulawayo was transformed into a vibrant sea of denim and pearls as fans gathered to celebrate musician Sandra Ndebele’s belated birthday party.  The “Denim and Pearls” themed event, which took place on a chilly January evening, was a resounding success, with attendees shaking off the […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "Raza in T20 Team of the Year",
            "url": "https://www.chronicle.co.zw/raza-in-t20-team-of-the-year/",
            "content": "SIKANDAR Razas reputation as one of Zimbabwes greatest cricket stars was further solidified on Saturday, as he was named in the ICC Mens T20 Team of the Year.\n\nThis prestigious recognition is a testament to Razas outstanding performances for both Zimbabwes national team and overseas franchise teams.\n\nRazas impressive stats  573 runs and 24 wickets  earned him a well-deserved spot among the worlds best T20 players.\n\nNotably, he is the only player from Africa to make the coveted list, underscoring his remarkable talent and dedication to the sport.\n\nIndias Arshdeep Singh and New Zealands Amelia Kerr triumph in T20I Cricketer of the Year awards after inspirational World Cup-winning feats in 2024\n\nIndias Arshdeep Singh was named the ICC Mens T20I Cricketer of the Year by the International Cricket Council and New Zealands Amelia Kerr was crowned the ICC Womens T20I Cricketer of the Year.\n\nSikandar Raza in action for Zimbabwe during the New Years Day Test match against Afghanistan at Queens Sports Club\n\nIn a pair of hotly contested categories, both players emerged victorious after a prolific year of international competition that saw them make historic contributions in their respective World Cup-winning campaigns.\n\nArshdeep enjoyed sustained success throughout the year in the shortest format, and peaked during a sensational stint at the ICC Mens T20 World Cup in June, topping the wicket-taking charts as India surged to glory in the West Indies and USA.\n\nICC Mens T20I Cricketer of the Year, Arshdeep Singh: I am delighted to win the ICC Mens T20I Cricketer of the Year 2024 award. The shortest format of the game poses various challenges for bowlers but I consider it as an opportunity to test my skillset and provide success with the ball for my team.\n\n2024 was indeed a great year individually and collectively for us as a unit. Winning the ICC Mens T20 World Cup 2024 was surreal and I am glad I could contribute to a successful and memorable World Cup campaign for my country.\n\nSikandar Raza\n\nThere is no bigger motivation than representing the nation at the biggest stage. I am extremely excited for the journey ahead and I am looking forward to giving my best for the team.\n\nOvercoming fellow nominees Babar Azam, Travis Head and Sikandar Raza, Arshdeeps win ensures the award goes to India for the third year in a row, following his teammate Suryakumar Yadavs back-to-back success in 2022 and 2023.\n\nICC Mens T20I Team of the YearRohit Sharma (Ind) (c)Travis Head (Aus)Phil Salt (Eng)Babar Azam (Pak)Nicholas Pooran (WI) (wk)Sikandar Raza (Zim)Hardik Pandya (Ind)Rashid Khan (Afg)Wanindu Hasaranga (SL)Jasprit Bumrah (Ind)Arshdeep Singh (Ind)ICC Womens T20I Team of the Year:Laura Wolvaardt (SA) (c),Smriti Mandhana (Ind),Chamari Athapaththu (SL),Hayley Matthews (WI),Nat Sciver-Brunt (Eng),Amelia Kerr (NZ),Richa Ghosh (Ind) (wk),Marizanne Kapp (SA),Orla Prendergast (Ire),Deepti Sharma (Ind),Sadia Iqbal (Pak)  icc-cricket.com/Sports Reporter\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-18-1.jpg",
            "description": "SIKANDAR Raza’s reputation as one of Zimbabwe’s greatest cricket stars was further solidified on Saturday, as he was named in the ICC Men’s T20 Team of the Year. This prestigious recognition is a testament to Raza’s outstanding performances for both Zimbabwe’s national team and overseas franchise teams. Raza’s impressive stats — 573 runs and 24 […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "Diasporan praises Second Republic policy reforms",
            "url": "https://www.chronicle.co.zw/diasporan-praises-second-republic-policy-reforms/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nDUBAI-BASED Zimbabwean tourism expert, Mr Bhekokuhle Dube, has praised the Second Republic for introducing policy reforms that create a favourable environment for Zimbabweans in the diaspora to invest back home.\n\nSpeaking on the side-lines of the Travel Talk seminar in Bulawayo, Mr Dube stressed the importance of diasporans investing in Zimbabwe, where their properties and businesses are secure.\n\nAs chief executive officer of Easy Travelex, a travel agency registered in Zimbabwe, South Africa, and UAE, Mr Dube noted that Zimbabweans abroad are the countrys ambassadors, showcasing its potential to the world.\n\nHe encouraged them to invite visitors to invest in Zimbabwe and to copy good practices from other countries to bring back home as investments.\n\nOur President has allowed us to copy good things that are being done by other countries, we bring them home, we invest and we develop our country, Mr Dube said.\n\nHe also highlighted the benefits of investing in Zimbabwe, citing the low cost of land compared to other countries.\n\nFor everyone who is a Zimbabwean based in other countries, it is very important to invest in your own country because if you are to invest in other countries, we have seen rules of immigration changing resulting in people losing their properties. If you are in your country, it is very rare to lose your investment, Mr Dube explained.\n\nHis positive experience with investing in Zimbabwe is shared by other diasporans, who are eager to invest in various sectors, including agriculture, real estate, tourism, education, and health.\n\nPresident Mnangagwa has taken steps to support diaspora investment, directing relevant ministries to set up a working committee on diaspora affairs to address concerns and facilitate investment.\n\nPresident Mnangagwa\n\nWith the Governments efforts to mobilise Zimbabweans abroad to invest back home paying off, Mr Dubes sentiments echo the growing optimism among diasporans.\n\nAs he aptly put it, For me, investing back home has been a wonderful experience because registering a company in Zimbabwe is not hard as compared to other countries.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/asds.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com DUBAI-BASED Zimbabwean tourism expert, Mr Bhekokuhle Dube, has praised the Second Republic for introducing policy reforms that create a favourable environment for Zimbabweans in the diaspora to invest back home. Speaking on the side-lines of the Travel Talk seminar in Bulawayo, Mr Dube stressed the importance of diasporans investing in Zimbabwe, where […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        },
        {
            "title": "Sadc repels DRC aggression",
            "url": "https://www.chronicle.co.zw/sadc-repels-drc-aggression/",
            "content": "Zvamaida Murwira,Harare Bureau\n\nTHE SADC Mission in the Democratic Republic of Congo (DRC) has successfully repelled aggression by M23 armed rebels, marking a significant step towards restoring normalcy in the Great Lakes region.\n\nThis achievement comes after President Mnangagwa, chairperson of SADC, convened an Extraordinary Summit in November last year to address the unrest in the North Kivu region of DRC.\n\nIn a statement, the SADC secretariat condemned the M23s actions.\n\nSADC unequivocally condemns this act of aggression by the M23 operating in the Eastern DRC. Such actions undermine the sovereignty, territorial integrity, and peace and security of the DRC and the SADC region, reads the statement.\n\nThe pursuit of territorial expansion by M23 only exacerbates the already existing dire humanitarian and security situation in the Eastern DRC, which has left thousands of people dead and forced millions in North Kivu, particularly women, children, the elderly and persons with disabilities, to flee their homes.\n\nThe rebel group M23 attacked the SAMIDRC in Goma to which SAMIDRC retaliated and successfully repelled the armed group. SADC commends the actions of the brave men and women from SAMIDRC who sacrificed their lives for the Region.\n\nSADC also noted that M23 aggression violated the peace agreement struck by Angolan President Joo Manuel Goncalves Lourenco.\n\nThe actions of the M23 armed group contravenes the Nairobi Peace Process and is a clear violation of the agreed ceasefire brokered through the Luanda Process led by His Excellency Joo Manuel Gonalves Loureno, President of the Republic of Angola in his capacity as the African Union Champion for Peace and Reconciliation in Africa.\n\nWe, therefore, call upon all parties in the conflict to adhere to their obligations in the ceasefire, calling for immediate cessation of hostilities and atrocities perpetrated by M23, as well as unconditional withdrawal from all occupied positions.\n\nSADC further encourages all parties in the conflict in Eastern DRC to comply with the terms and conditions of the existing peace agreements and engage through dialogue for everlasting peace, security and stability in the DRC and the Region.\n\nTo this end, the SAMIDRC will remain resolute in supporting efforts aimed at addressing the unstable and deteriorating security and humanitarian situation prevailing in the Eastern DRC. We call upon the international community, including the United Nations, to join us in denouncing these unlawful actions by the M23.\n\nSADC region reiterates its solidarity with the people of the DRC and commends them for resilience against brutal actions perpetrated by the M23 and other armed groups, reads the statement.\n\nThe African Union (AU) has also denounced the M23s actions, with Commission chairperson Dr Moussa Faki Mahamat expressing deep concern over the deteriorating security and humanitarian situation in the East of the DRC.\n\nDr Mahamat called for the strict observance of the ceasefire agreed between the parties and the immediate cessation of all hostilities.\n\nDr Mahamat expressed his unreserved support for such efforts, which are the only way to resolve the persistent tension between the DRC and Rwanda, on the one hand, and between the government of the DRC and its political-military opposition, on the other.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/df.jpg",
            "description": "Zvamaida Murwira, Harare Bureau  THE SADC Mission in the Democratic Republic of Congo (DRC) has successfully repelled aggression by M23 armed rebels, marking a significant step towards restoring normalcy in the Great Lakes region.  This achievement comes after President Mnangagwa, chairperson of SADC, convened an Extraordinary Summit in November last year to address the unrest in […]",
            "time": "09:08",
            "date": "27 Jan 2025"
        }
    ]
}