{
    "news": [
        {
            "title": "‘No retreat, no surrender’. . . the unwavering resolve of Zimbabwe, Cuba",
            "url": "https://www.chronicle.co.zw/no-retreat-no-surrender-the-unwavering-resolve-of-zimbabwe-cuba/",
            "content": "Zvamaida Murwira, Senior ReporterZIMBABWE and Cuba should never surrender the fight to improve their peoples livelihoods despite the yoke of illegal sanctions and blockades imposed on them by the United States and Western countries, visiting president of the Cuban National Assembly, Esteban Lazo Hernandez, has said.\n\nBriefing journalists at State House in Harare yesterday soon after holding bilateral talks with President Mnangagwa, Mr Hernandez said Zimbabwe and Cuba should instead upscale their political relations to stronger economic ties for the good of the people.\n\nCuba has always been able to count on the support of Zimbabwe in our fight against the blockade, sanctions, against all the abuse of imperialism and the inclusion of Cuba on the list of so-called countries sponsoring terrorism. That has been creating difficulties for the life of our people because it touches on our incomes, our access to financial bodies and all that impacts the living conditions of our people, he said.\n\nBut we will never surrender. We are going to keep fighting. It has been 63 years since the blockade was imposed on our country, but we have never surrendered. With the support of our brothers and sisters in Africa and particularly Zimbabwe, we will continue to move forward.\n\nTurning to yesterdays discussions with President Mnangagwa, Mr Hernandez said they explored ways to deepen co-operation in several areas.\n\nWe exchanged ideas on the relations between Cuba and Zimbabwe that have been based on fights and battles, that have been the fruits and friendship between Commander in Chief (Cuban founding leader) Fidel Castro and the founding father of Zimbabwe Robert Mugabe, he said.\n\nLate former President Robert Mugabe\n\nWe have been discussing a lot of things and we have also condemned all the sanctions that have been imposed on Zimbabwe by Western powers that have impeded the development of your country. Our main objective is to continue fostering, developing and deepening relations that are currently at their best moments. We have been discussing reinforcing relations between political parties, our parliaments and our Governments and more importantly, we are convinced that we should take our economic relations to the same level that our political ties are at.\n\nMr Hernandez said Zimbabwe and Cuba enjoy long-standing warm bilateral relations, which have seen a deepening of co-operation in health and education.\n\nThere is a deep connection and friendship between our two peoples. Many Cubans were sent on missions here to Zimbabwe and over 3 000 Cubans have come here. And there are over 3 000 sons and daughters of Zimbabwe who have been able to study and graduate in Cuba as evidence of our warm bilateral relations, he said.\n\nBoth Zimbabwe and Cuba have held reciprocal solidarity engagements through enhanced co-operation where Havana has trained more than 3 000 teachers in Mathematics and Science coupled with the help it rendered in pharmaceuticals.\n\nThe training programme is now being undertaken at Bindura University of Science Education. There have been reciprocal visits at the highest level in the two countries aimed at exploring ways to deepen co-operation.\n\nYesterdays meeting was attended by the Speaker of Parliament, Advocate Jacob Mudenda, Foreign Affairs and International Trade Minister, Professor Amon Murwira, Members of Parliaments Portfolio Committee in Foreign Affairs led by Cde Webster Shamu and Cuban Ambassador to Zimbabwe, Ms Suseleys Perez Mesa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/efdw.jpg",
            "description": "Zvamaida Murwira, Senior Reporter ZIMBABWE and Cuba should never surrender the fight to improve their people’s livelihoods despite the yoke of illegal sanctions and blockades imposed on them by the United States and Western countries, visiting president of the Cuban National Assembly, Esteban Lazo Hernandez, has said. Briefing journalists at State House in Harare yesterday […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "Sir Alex Ferguson’s visit boosts Victoria Falls’ tourism appeal",
            "url": "https://www.chronicle.co.zw/sir-alex-fergusons-visit-boosts-victoria-falls-tourism-appeal/",
            "content": "Leonard Ncube,[emailprotected]Victoria Falls, one of the Seven Natural Wonders of the World, was abuzz with excitement as the legendary former Manchester United manager, Sir Alex Ferguson, made a surprise visit to the resort town.\n\nThe 83-year-old football icon arrived in Zimbabwes tourism capital on Sunday, leaving locals and tourists star-struck. His two-day visit was a testament to the countrys growing reputation as a premier tourist destination, attracting high-profile figures from around the world.\n\nSir Alex Ferguson with some locals in Victoria Falls\n\nSir Alexs presence in Victoria Falls was a significant event, with fans and locals alike clamouring for photo opportunities. Despite his private holiday, he graciously posed for pictures with staff and guests at the Victoria Falls Safari Lodge, and later, while exploring the breathtaking Victoria Falls rainforest.\n\nThe media, however, was kept at bay, with his handlers ensuring that he was not disturbed during his visit.\n\nSir Alexs name is etched in football history, having transformed Manchester United into a global powerhouse during his 27-year tenure. His impressive legacy includes 13 English Premier League titles, five FA Cups, and two UEFA Champions League trophies, earning him a revered status among football fans worldwide. Even in retirement, his influence remains strong, with Manchester United fans holding him in high regard.\n\nSir Alex Ferguson visited Victoria Falls\n\nVictoria Falls has become a magnet for global sports icons and celebrities, with Sir Alex joining an elite list of visitors that includes Springboks captain Siya Kolisi, Barcelonas Rayco Garcia and Hollywood stars such as Paris Hilton, Michael Douglas, and Catherine Zeta-Jones. The steady stream of high-profile visitors is a testament to the countrys success in positioning tourism as a key economic driver.\n\nThe Governments initiatives aimed at revitalising the tourism sector have been instrumental in positioning Victoria Falls as a must-visit destination for high-profile individuals. With its pristine landscapes, rich wildlife, world-class hospitality and a blend of traditional and modern luxury experiences, the city offers an unmatched African safari experience.\n\nSir Alex Ferguson visited Victoria Falls\n\nThe tourism sector is considered one of the countrys economic mainstays, contributing approximately 5,7 percent to Gross Domestic Product (GDP) and 3,5 percent to national employment.\n\nThe Governments goal of developing the tourism sector into a US$5 billion industry by the end of the year is in line with the national vision of Zimbabwe becoming an upper middle-income society by 2030.\n\nThe National Tourism Recovery and Growth Strategy, launched by President Mnangagwa in August 2020, aims to position Zimbabwe as a prime international tourist destination, based on the judicious and sustainable exploitation of the countrys unique natural, cultural, and built environment assets.\n\nSir Alex Ferguson visited Victoria Falls\n\nSir Alexs surprise visit to Victoria Falls is a significant endorsement of Zimbabwes tourism potential, highlighting the countrys ability to attract high-profile visitors from around the world.\n\nAs the country continues to grow its tourism sector, it is essential to ensure that the sectors growth is sustainable, responsible and benefits local communities. By doing so, Zimbabwe can cement its position as a premier tourist destination, attracting visitors from around the world and driving economic growth and development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cxbver.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw Victoria Falls, one of the Seven Natural Wonders of the World, was abuzz with excitement as the legendary former Manchester United manager, Sir Alex Ferguson, made a surprise visit to the resort town. The 83-year-old football icon arrived in Zimbabwe’s tourism capital on Sunday, leaving locals and tourists star-struck. His two-day visit […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "The crumbling road network of Bulawayo",
            "url": "https://www.chronicle.co.zw/the-crumbling-road-network-of-bulawayo/",
            "content": "THE once-thriving city of Bulawayo is now grappling with a severe road network crisis, brought on by the relentless pounding of heavy rains, deepening potholes and the subsequent abandonment of smaller roads by commuter omnibus operators.\n\nThis has led to a plethora of problems, not only for commuters but also for transport operators, who are forced to navigate treacherous roads that are taking a toll on their vehicles.\n\nIt is imperative that the authorities take immediate action to address this crisis, lest it spirals out of control, further exacerbating the already dire situation.\n\nThe impact on commuters is palpable, with many being forced to walk long distances, often in the dark, due to the unavailability of public transport on smaller roads. This has led to an increase in crime, as vulnerable individuals become easy prey for criminals.\n\nThe story that we carried in yesterdays edition of Mrs Martha Ncube, a vegetable vendor in Magwegwe North, is a testament to the daily struggles faced by many. Her daily commute has become a gamble, with the constant fear of being mugged or attacked while walking to and from the terminus. This is unacceptable and demands immediate attention from the authorities.\n\nFurthermore, transport operators are also bearing the brunt of the crisis, with vehicle maintenance costs skyrocketing due to the constant damage caused by potholes.\n\nThe experience of Mr Anesu Muvima, a kombi driver, is a stark reminder of the financial burden that operators are shouldering. He has had to repair his suspension three times in two months, a cost that is simply unsustainable.\n\nThe Bulawayo United Passenger Transporters Association (Bupta) chairman, Mr Morgan Msipa, has painted a bleak picture of the impact of the road crisis, highlighting the fact that operators are not refusing to take people closer to their homes out of malice, but rather due to the prohibitive costs of damages.\n\nThe crisis extends beyond the suburbs and into the heart of the city, with even the city centre becoming a minefield of potholes. The intersection of Lobengula Street and 3rd Avenue is a prime example, with a crater-like pothole wreaking havoc on drivers and pedestrians alike. The city council must take immediate action to address this crisis, lest it leads to more accidents and damage to vehicles.\n\nWhile Ward 17 Councillor Sikhululekile Moyo has acknowledged the crisis and promised efforts to improve the situation, more needs to be done to address the scale of the problem. The city has over 2400km of roads, much of which is in dire need of rehabilitation. Patchwork repairs are not enough; complete reconstruction is required to restore the roads to a usable state.\n\nThe crumbling road network of Bulawayo is a crisis that demands immediate attention and action. The authorities must take a comprehensive approach to address this issue, one that involves not only patchwork repairs but also a long-term plan to reconstruct and maintain the roads.\n\nThe people of Bulawayo deserve better, and it is the responsibility of the City Fathers to ensure that they are provided with a safe and reliable transportation system.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/EW.jpg",
            "description": "THE once-thriving city of Bulawayo is now grappling with a severe road network crisis, brought on by the relentless pounding of heavy rains, deepening potholes and the subsequent abandonment of smaller roads by commuter omnibus operators. This has led to a plethora of problems, not only for commuters but also for transport operators, who are […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "Unlocking opportunities| ZimTrade, Bata join forces to propel leather sector into global markets",
            "url": "https://www.chronicle.co.zw/unlocking-opportunities-zimtrade-bata-join-forces-to-propel-leather-sector-into-global-markets/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nNATIONAL trade development and promotion agency, ZimTrade, has partnered with Bata Shoe Company to unlock new markets for locally manufactured footwear and positioning the country competitively on the global village.\n\nThe leather sector is one of the priority value chains viewed as a long-hanging fruit for exports.\n\nA recent survey by the Confederation of Zimbabwe Industries (CZI) has revealed that Zimbabwe imported close to US$4 million worth of leather products from 2021 to 2023, which represents a significant market opportunity for local companies.\n\nBata is already exporting its products into the region but is facing some challenges being imposed by cheap imports, which has reduced its capacity over the years.\n\nBata shoe company workers and the shoe making machinery that was commissioned by President Mnangagwa\n\nZimTrade recently visited the company premises in Gweru and discussed potential partnerships aimed at helping reposition the countrys leather sector.\n\nWe recently had the privilege of visiting Bata, Zimbabwes leading footwear manufacturer, known for its diverse and high-quality products, said ZimTrade in the latest update.\n\nAs a key exporter, Bata is already making waves across Africa, from Malawi to Zambia and supporting an extensive international franchise network.\n\nThrough ZimTrades new strategy, were proud to partner with Bata to unlock new market opportunities, expand exports and strengthen its presence in Central Africa and beyond.\n\nTogether, were committed to accelerating Batas growth and positioning Zimbabwean footwear competitively on the global stage.\n\nIn 2022, Bata Shoe Company invested over US$5 million in new plant and machinery in sheer demonstration of confidence in the economy.\n\nThe company installed a polyurethane pouring plant, which produces safety shoes that the company has been importing in the past.\n\nBata management could not readily comment on the outcome of their meeting with ZimTrade as they were engaged in meetings yesterday.\n\nThe launch of the Zimbabwe Leather Sector Strategy (2021-2030) has also expressed the Governments strong desire to transform the leather sector from a producer of primary products to value-added goods for domestic and export markets.This has seen ZimTrade working closely with the leather cluster under what is known as the Zimbabwe Leather Collective (ZLC), an initiative meant to steer collective marketing efforts of leather and leather products\n\nZimtrade\n\nThe overall goal of the Zimbabwe Leather Sector Strategy (2021-2030), launched in 2020, is to improve the competitiveness of the leather value chain by building stakeholders production capacities and improving their access to regional and international markets.\n\nThe objectives of the strategy are to increase the capacity utilisation of value-added products from 30 to 75 percent by the end of 2030 and enhance the application of sustainable production technologies by manufacturing companies from the current 10 percent to 60 percent by 2030.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/efa.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com NATIONAL trade development and promotion agency, ZimTrade, has partnered with Bata Shoe Company to unlock new markets for locally manufactured footwear and positioning the country competitively on the global village. The leather sector is one of the priority value chains viewed as a long-hanging fruit for exports. A recent survey by the […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "COMMENT: Radical feminists are waging an undeclared war against men",
            "url": "https://www.chronicle.co.zw/comment-radical-feminists-are-waging-an-undeclared-war-against-men/",
            "content": "Cuthbert Mavheko,[emailprotected]ON March 8, Zimbabwe joins the rest of the world in celebrating International Womens Day. The day, which is celebrated annually, focuses mainly on issues such as violence and abuse against women, reproductive rights and gender equality.\n\nAs a signatory to the United Nations Convention on the Elimination of Discrimination Against Women, Zimbabwe has, over the years, crafted several policies that redress past imbalances and ensure that women are not abused and enjoy equality before the law. The Governments efforts to end the abuse and discrimination of women are quite commendable because women have not only been abused, but have also been subdued and relegated to the margins of society since time immemorial. Hindsight shows that in times past, womens rights were often overlooked in a degenerate and disunited, male-dominated society. If indeed the truth be told without fear of criticism or contradiction whatsoever, women were treated as second-class citizens, not only in Zimbabwe, but all over the world.\n\nIt is indeed extremely worrisome that while the Government has done much to create equality between the sexes, radical feminists seem to have completely misunderstood and misconstrued the concept of gender equality. As a long-standing journalist, I have listened to many debates and seminars on gender issues. I have also perused through feminist literature on the same issue of gender equality. Reading feminist literature, one gets the impression that feminists are actually waging an undeclared war against men.\n\nWhat feminists reveal in their literature is not only thought-provoking, but does not leave one to any imagination whatsoever as regards to their goals and objectives. Feminists have outlined clear-cut policies towards attaining their goal of equality with men at work, in the family and in society in general. They argue that marriage is, by its very nature, oppressive since women are always at the bottom, in submission to their husbands. In light of this, they view marriage as exploitative and designed in such a manner that it denies a woman the full evolution of her human potential since all her energy is directed towards serving her husband.\n\nFeminists openly challenge the age-old maxim, which stipulates that a woman can only be accepted within the family institution as long as she remains subservient sexually, submissive and obedient to her husband.\n\nIt is common knowledge that a womans role in a marital relationship is that of servitude. It can thus be seen that the marriage institution discriminates against women. We are not waging a war against men as such, but against a system which not only oppresses women, but dehumanises them. In light of this, women must not rest on their laurels until the institution of marriage is revamped because its structures promote and sustain male domination, said a 56-year-old divorced feminist from Old Lobengula suburb, who requested anonymity.\n\nWhile womens quest for gender equality is, in my own view, a noble cause, the heart-wrenching reality is that it has not only lost direction, but has actually been hijacked by radical feminists, whose apparent goal is to stage a coup detat against the man and usurp his God-given role as father and head of the family. In their fervent desire to reverse roles in the family unit, some feminists are already positioning themselves as heads of their families, thereby taking over their husbands roles. In so doing, they are unwittingly inviting the ire of their husbands. One writer aptly observed that: Man, like any creature, does not delight in someone crossing into his territory.\n\nHe feels threatened and will strike in defence of his territorial rights. A woman who provokes her husband by being unruly and rebellious, ignites a fire that will be too difficult to put out without her experiencing the heat.\n\nWhat adds a chilling dimension to the whole scenario is that feminists have now become so radical in their approach to gender-based issues that they have misconstrued gender equality as a licence for married women to have boyfriends and to cohabit. For the benefit of the uninformed, cohabitation is a relationship, where a man and a woman stay together as husband and wife without observing any formalities of marriage, whether customary or otherwise. Although this is not classified as a marriage, it is now a popular trend in Zimbabwe.\n\nThe truth that must be told without prejudice is that most men are not comfortable with the concept of gender equality and this is causing friction in many families, leading to divorce. It is of paramount importance to mention that in the past, people knew nothing about equal rights. Men and women knew their rightful places in the family and society in general. In fact, people believed in the sanctity of marriage  that a mans role as a father and head of the family- was God-given and therefore immutable. Because men and women knew and respected their rightful places in marriage and society, there was stability in most marriages and divorce was a rare phenomenon.\n\nWhen couples took their marriage vows, it was always till death do us part. But this is no longer the case nowadays. Marriage is no longer a lifetime union for many couples.\n\nIt can safely be argued that in these modern times, society still regards women as inferior human beings. This is in conflict with basic human rights. Women are not second class citizens. Feminine traits are not inferior to masculine ones, they are complementary. God created us male and female so that theres a balance of life on earth. One pertinent observation that I have personally made is that most men, who despise and deny women their rights, perceive them in the physical sense only and totally ignore the fundamental aspects of their being, like their intellectual abilities. This is because women have always been regarded as the weaker sex and therefore inferior to men. This has not only eroded the dignity and liberty of many women, but has actually reduced them to mere objects of lust.\n\nSober, discerning and analytical observers are in agreement that radical feminists are using gender equality as a springboard to topple the man from his God-given right as father and head of the family. God created humans male and female for an incredible transcendent potential, which remains enigmatic to most people today. Genesis 2 verse 18 shows that God created a woman to be a helper and companion to a man. Genesis 3 verse 16 also states clearly that after Adam and Eve had partaken of the fruit of the knowledge of good and evil, which God had forbidden them to eat, God said to Eve:  Your desire shall be for your husband. And he shall rule over you.\n\nLet us put things into perspective in clear language here. It certainly would be naivety of elephantine proportions to blind ourselves to the hard, cold facts of reality. Most people do not realise that it was the very Creator of mankind who made a man to be the head of the family and to properly lead his wife, but emphatically not as an overbearing master. Marriage is not a master  slave relationship; it is a sharing and complementing relationship, where each mate recognises and appreciates the God-ordained role of his/her partner.\n\nOne cannot be totally off the mark to surmise that the scourge of divorce, which is raging in the country like an uncontrolled veld fire, cannot be extinguished as long as society continues to trample on the structure of government that God ordained in the marriage institution. It is both ironic and tragic that in these permissive modern times, society is vying for 50-50 marriages. These are marriages where a husband and his wife are supposed to share the responsibility of running the affairs of their families on an equal basis. Society is smugly ignorant and unaware that this doesnt solve marital problems, but only serves to compound them.\n\nAs I have already said, according to the Bible, a husband should be the leader in a marriage, but neither the husband nor his wife should act in ways that antagonise each other. Marital couples should learn to recapture the wonderful attitudes that lead mates to build each other, instead of tearing each other down. Over and above this, they should learn to communicate their feelings and needs to each other, so that they can tackle their marital problems and difficulties in a constructive way.\n\nWhen all is said and done, it is essential to understand that in the past, most parents adopted a lackadaisical approach in terms of educating their daughters because of the misconception that a girls future was in the kitchen, as a housewife. Against this sense of things, its heartening to note that things have since changed and girls are now getting educated on an equal footing with boys.\n\nThis has seen scores of female students climbing to the very top of the academic ladder to become respected lawyers, medical practitioners, judges, political leaders, journalists, military officers, corporate executives etc. Over the years, a significant number of these women have been praised, even adored, for their purity, patience, loyalty, their long-suffering, gentleness and love. These are priceless values that are lacking in most people today.\n\nMy fellow Zimbabweans, as we joyfully join hands with our womenfolk in celebrating International Womens Day, let us take time to applaud the government for its tireless efforts to end the discrimination and abuse of women in the country. As a Christian nation, may we also remind disgruntled and crestfallen feminists, who are waging an undeclared, gender  driven war, against men that they will never win. Marriage is not something that evolved through the reasoning and gradual civilisation of mankind, as proponents of the evolutionary theory would have us believe.\n\nRather, marriage is a sacred institution that was designed and created by a benevolent Creator and its primary purpose is to make a man and a woman complete with a man as the head. For a woman is incomplete without a man and vice- versa.\n\nAs ordained by God, the marriage union is a holy thing. It is so holy that in His Word, Almighty God likens the marriage union to the relationship between Jesus Christ and His church. The spiritual depth of marriage was amplified by the Apostle Paul when he wrote: For this reason, a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh.\n\nThis is a great mystery, but I speak concerning Christ and the church (Ephesians 5 verses 31-32).\n\nThese verses make it unequivocally clear that marriage goes beyond the physical and actually pictures the eternal, loving and great spiritual relationship of Jesus Christ and His church. I rest my pen.\n\nl Cuthbert Mavheko is a freelance writer and theologian. He can be reached on 0773963448/0775522095.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cdxcvcx.jpg",
            "description": "Cuthbert Mavheko, mavhekoc@gmail.com ON March 8, Zimbabwe joins the rest of the world in celebrating International Women’s Day. The day, which is celebrated annually, focuses mainly on issues such as violence and abuse against women, reproductive rights and gender equality. As a signatory to the United Nations Convention on the Elimination of Discrimination Against Women, […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "Highlanders await Fifa’s ban reversal",
            "url": "https://www.chronicle.co.zw/highlanders-await-fifas-ban-reversal/",
            "content": "Lovemore Dube,[emailprotected]HIGHLANDERS have been kept waiting over their appeal to have a transfer ban reversed by Fifa after settling their debt with former coaches Baltemar Brito and his assistant, Antonio Joao Torres.\n\nWhat could clear the path is that Torres has gone on social media to confirm that they have been paid and paid tribute to the benefactor, Harare-based businessman, Wicknell Chivhayo.\n\nHe cleared the debt for Highlanders to save the situation a fortnight ago.\n\nBosso were suspended by Fifa after they failed to pay the duo US$27,000 owed in allowances and winning bonuses from their 2022-23 stint with the club.\n\nThe transfer ban came at a bad time when the club had just lost Peter Muduhwa, Lynoth Chikuhwa, Godfrey Makaruse and Marvelous Chigumira. The quartet joined Premier Soccer League side Scottland.\n\nLynoth Chikuhwa\n\nHighlanders were without their new signings and returnee, Never Rauzhi.\n\nZifa confirmed that Highlanders had appealed against the ban after paying. They said it was now up to Fifa to lift the ban following Chivhayos intervention.\n\nHighlanders appealed directly to Fifa on the portal that they have been communicating on. We are not involved at all as Zifa.\n\nThe onus is on them and Fifa and as an association we hope they get the ban lifted and be able to engage in transfer business before the window closes, said Zifa.\n\nZifa disclosed that the transfer window will close on March 31.\n\nOur prayers are that they will be able to make business before the window closes on 31 March.\n\nAfter that, they will not be able to do so until the next transfer window. Basically, the matter is between them and Fifa and we confirm that Highlanders have engaged Fifa directly, said Zifa.\n\nHighlanders are under pressure to strengthen their team which started with a loss at MWOS home at Baobab Stadium in Ngezi.\n\nA howler by goalkeeper, Raphael Pitisi, who tried fancy stuff against a MWOS striker only to come out second best, resulting in the solitary goal, was enough to decide the destiny of the three points.\n\nBosso will be at home against new league boys Kwekwe United this weekend.\n\nHighlanders spokesperson Nozibelo Maphosa confirmed that the ban was yet to be lifted by Fifa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xczxcwas.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw HIGHLANDERS have been kept waiting over their appeal to have a transfer ban reversed by Fifa after settling their debt with former coaches Baltemar Brito and his assistant, Antonio Joao Torres. What could clear the path is that Torres has gone on social media to confirm that they have been paid and […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "Ash T, Sfiso spread wings",
            "url": "https://www.chronicle.co.zw/ash-t-sfiso-spread-wings/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nBulawayo-based wheel spinners DJ Ash T and DJ Sfiso are reaching new heights in their careers as they continue to secure gigs at notable events.\n\nThe DJs known for rocking crowds at events in Bulawayo, are part of a stellar line-up at Carpe Diem, a DJ-driven music experience set to take place in Harare in May. They will share the stage with other headline acts, including South Africas Thakzin and Kalvin Momo as well as Tapiwa from Harare.\n\nChronicle Showbiz caught up with the two DJs, who acknowledged that performing outside the City of Kings and Queens is a significant milestone in their careers.\n\nPerforming outside Bulawayo is always an exciting opportunity. It allows me to connect with a broader audience, experience different music cultures and showcase the sound and energy that define my sets.\n\nIts also a great way to represent Bulawayos vibrant music scene on a larger stage, proving that our talent can hold its own anywhere, said DJ Ash T.\n\nHe attributed his success to consistency, a unique music selection and the ability to create an unforgettable vibe.\n\nLanding such gigs comes down to a combination of hard work and understanding what keeps the crowd engaged. Over the years, Ive built a strong brand by delivering high-energy performances that captivate audiences.\n\nNetworking, professionalism and adaptability are also key. Promoters look for DJs who not only have skill but also understand how to create memorable experiences.\n\nFor the upcoming Carpe Diem event, DJ Ash T promised a thrilling performance.\n\nDJ Sfiso\n\nPeople should expect nothing but an electrifying set filled with high-energy mixes, smooth transitions and a selection of music that keeps the crowd moving. I want to curate an experience that blends familiarity with fresh sounds, ensuring everyone in the audience is engaged and leaves with great memories. The vibe will be unmatched, he said.\n\nFemale DJ sensation, Sfiso, who is on the rise, sees performing outside Bulawayo as a crucial step in expanding her reach and growing as an artiste.\n\nWith the help of my management team, Ive been able to secure gigs in new places, ensuring everything from bookings to logistics runs smoothly. Their support allows me to focus on delivering the best performance while also building my brand beyond the city, she said.\n\nShe attributed her success to a combination of hard work, consistency and having a strong support system.\n\nMy management plays a big role in handling bookings and networking while I focus on perfecting my craft and connecting with my audience. Staying versatile, professional and delivering memorable sets helps me stand out and attract more opportunities.\n\nDJ Sfiso promised a high-energy, unforgettable experience for the Harare show.\n\nI always bring a unique vibe, blending different sounds to keep the crowd engaged and on their feet. Whether its Amapiano, house, or Afro beats, my set is all about creating a fun and electric atmosphere that keeps people dancing all night, she said.\n\nCarpe Diem event producer, Walter Wanyanya, said the event is designed to offer an immersive audio-visual experience like no other.\n\nCarpe Diem is about living in the moment and were bringing that to life in a way Harare has never seen before. People should expect top-tier production, state-of-the-art sound and an electrifying crowd to make this a night to remember.\n\nThis is going to be one of the biggest events on the entertainment calendar as were creating an experience where people can lose themselves in the music and energy of the night, said Wanyanya. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xzcxzxc.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Bulawayo-based wheel spinners DJ Ash T and DJ Sfiso are reaching new heights in their careers as they continue to secure gigs at notable events. The DJs known for rocking crowds at events in Bulawayo, are part of a stellar line-up at Carpe Diem, a DJ-driven music experience set to take place in […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "Zambia backs President peace efforts",
            "url": "https://www.chronicle.co.zw/zambia-backs-president-peace-efforts/",
            "content": "Leonard Ncube,[emailprotected]ZAMBIA has pledged its unwavering support for SADC chairperson, President Mnangagwa, in his efforts to ensure peace and security prevail across the region.\n\nThis gesture of solidarity is crucial in the face of emerging security threats in the region, particularly the Eastern DRC conflict, which has resulted in the loss of lives and displacement of thousands of people.\n\nAs a member of the SADC Organ and Troika on Politics, Defence and Security Co-operation, Zambias backing of Zimbabwes leadership is a testament to the strength of bilateral relations between the two nations.\n\nThe 34th Session of the Zimbabwe-Zambia Joint Permanent Commission on Defence and Security, recently convened by the two countries, serves as a platform to reinforce their commitment to mutual peace, stability and development.\n\nThe meeting, co-chaired by Zimbabwes Minister of State for National Security, Lovemore Matuke and Zambias Minister of Home Affairs and Internal Security, Jacob Jack Mwiimbu, demonstrated the resolve of both nations to collaborate in the areas of defence and security.\n\nIn addition to addressing regional security challenges, the meeting also provided an opportunity for the two countries to pay tribute to the founding fathers of SADC, who envisioned a united and prosperous region.\n\nThe passing of former Namibian President Sam Nujoma on February 8, 2025, was also mourned by the delegates, who recognised his contributions to the liberation struggle and regional integration.\n\nSpeaking at the event, Minister Matuke, who was accompanied by Defence Minister Oppah Muchinguri-Kashiri, said the two sister republics enjoy excellent bilateral relations.\n\nMinister Oppah Muchinguri-Kashiri\n\nOur relationship has stood the test of time and continues to grow. It is our hope that this relationship continues to be nurtured and passed on to the next generation in the spirit of togetherness, oneness and harmony, he said.\n\nOur sister republics remain seized with efforts to counter traditional and non-traditional issues confronting our two nations, as well as exchange of information on issues of mutual interest.\n\nThese include food and energy insecurity, transnational organised crime including human and drug trafficking and cross border malpractices, among others.\n\nIts, therefore, my fervent hope that this JPCDS will offer some solutions to the challenges confronting our two countries, which require our countries to put heads together.\n\nHe thanked Zambia for its support of Zimbabwes call for the removal of illegal sanctions, which continue to have adverse effects on the region\n\nHis co-chair Mwiimba said the meeting was a sign of comradeship.\n\nWe must remain aware of the various threats that have the potential to undermine internal border or regional security, he said.\n\nIts imperative for security personnel for both countries to intensify collaboration to fight security threats and promote common interest.\n\nZambia remains resolute in promoting this commission and remains committed to supporting Zimbabwe as chair of the SADC he said.\n\nIn the communique that was produced at the end of the meetings, Zambia re-affirmed its commitment as a member of the SADC Organ Troika on Politics, Defence and Security Cooperation.\n\nAs Zambia, we will always give support to the chairperson of SADC in his efforts of ensuring peace and security in the region and beyond, read the communique.\n\nThe joint commission emphasised the need to implement outstanding resolutions and further strengthen collaboration in these areas of mutual interest.\n\nIt also noted that despite the general peace and stability in the SADC region, there was a need to weed out terrorism, transnational crimes, poaching, irregular migration, human and drug trafficking, smuggling and other related cross-border vices.\n\nIn this regard, the Commission agreed to continue co-operating and devising new strategies to address these security threats, reads the communique.\n\nThe Commission further expressed concern about the security situation in Cabo Delgado Province in Mozambique and called for the unconditional removal of the illegal economic sanctions imposed on Zimbabwe.\n\nIt also noted Zimbabwes policy of engagement and re-engagement and concerted solidarity efforts from SADC and friendly countries.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hgtrwgfn.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw ZAMBIA has pledged its unwavering support for SADC chairperson, President Mnangagwa, in his efforts to ensure peace and security prevail across the region. This gesture of solidarity is crucial in the face of emerging security threats in the region, particularly the Eastern DRC conflict, which has resulted in the loss of lives […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "AfriForum: A bastion of Caucasian privilege in southern Africa",
            "url": "https://www.chronicle.co.zw/afriforum-a-bastion-of-caucasian-privilege-in-southern-africa/",
            "content": "Marshall Ndlela,[emailprotected]\n\nIN South Africas fragile democracy, where Nelson Mandelas vision of a Rainbow Nation sought to heal centuries of racial division, AfriForum and its ally, Solidarity, stand as polarising forces.\n\nFar from being mere advocates for minority rights, these organisations are accused of preserving Caucasian privilege, rooted in colonial legacies and sustained through legal cunning, international meddling and divisive tactics. This article dissects their actions  from their pursuit of Zimbabwes former First Lady Dr Grace Mugabe to their entanglement with Elon Musk (or Ellon Muskey) and United States president Donald Trump  arguing they represent a treasonous affront to South Africas national interest and Africas broader aspirations, all while clinging to a confused identity that undermines democratic progress.\n\nPresident Donald Trump\n\nA sanctuary for white settler remnantsAfriForum is explicitly based on the protection of white Afrikaners, Rhodesians and Portuguese remnants in South Africa. It positions itself as a defender of Afrikaner culture  descendants of Dutch, French and German settlers who dominated during apartheid  but its mission stretches beyond this group. Rhodesians, displaced after Zimbabwes 1980 independence, and Portuguese descendants from Angola and Mozambique, uprooted by post-colonial conflicts, find a sympathetic home in AfriForums rhetoric. Critics argue this broad coalition reveals an intent to safeguard not just culture, but the entrenched privileges of white settler communities across southern Africa.\n\nSolidarity, another confusing organisation also created to promote white supremacy in Africa, mirrors this agenda. Ostensibly a trade union, it overwhelmingly represents white workers, opposing affirmative action and other redress policies in a nation where economic power remains skewed towards the Caucasian minority.\n\nTogether, these entities exploit legal provisions in the Constitution of South Africa to create colonial and white supremacy-justified organisations  namely AfriForum and Solidarity. By invoking minority rights clauses, they challenge land reform and equity measures, framing their resistance as a defence of justice while entrenching a neo-colonial hierarchy.\n\nTheir continuous use of law to justify the independence of minority cultures has led to the creation of Orania, a whites-only Afrikaner enclave in the Northern Cape and similar initiatives. Promoted as self-determination, Orania is a glaring rejection of Mandelas Rainbow Nation plan or agenda, which envisioned a unified, multiracial society. Instead, these legal manoeuvres resurrect apartheids segregationist ethos under a modern veneer, prioritising white autonomy over collective healing.\n\nExtremist ties and selective justice.\n\nThe proximity of AfriForum and Solidarity leaders to the Afrikaner Weerstandsbeweging (AWB), a racist, anti-progressive Boer organisation, casts a dark shadow over their claims of moderation. Founded in 1973 by Eugene TerreBlanche, the AWBs swastika-like insignia and calls for a Boer state, echo AfriForums own rhetoric of cultural survival and resistance to black governance. Although AfriForum rejects the AWBs violence, the ideological overlap and personal connections between their leaders suggest a shared lineage of racial exclusivity.\n\nThis hypocrisy is laid bare in their attempt to arrest Dr Mugabe and ignore her diplomatic immunity. In August 2017, Zimbabwes then-First Lady assaulted Gabriella Engels, a South African model, with an extension cord in a Johannesburg hotel. AfriForum leapt into action, filing a legal case to prosecute Dr Mugabe and arguing her diplomatic immunity  granted as the spouse of former President Cde Robert Mugabe  was invalid for a private visit.\n\nThey pressed the issue even after she fled to Zimbabwe, securing a 2018 High Court ruling that deemed South Africas immunity grant unlawful. Although Dr Mugabe evaded arrest, AfriForums pursuit was relentless, framed as a stand against impunity  yet critics saw it as a racially charged vendetta against a prominent black African figure. Contrast this with their stance on Benjamin Netanyahu.\n\nThe late Nelson Mandela\n\nDespite South Africas 2024 accusation of war crimes against the Israeli Prime Minister at the International Court of Justice, AfriForum continues to protect Netanyahu in the event he comes to South Africa, either through silence or tacit support. This double standard  aggressively targeting Dr Mugabe while shielding Netanyahu  exposes a bias favouring white or Western-aligned figures, undermining their credibility as impartial defenders of justice.Musks capture of Trump and sanctions fallout\n\nAfriForums influence extends globally through their continuous investment or support of Elon Musks devastating advice to Trump to issue sanctions to South Africa. Musk, a South Africa-born billionaire, has long echoed AfriForums false narrative of white persecution, particularly over land expropriation. His sway over United States President Donald Trump  described here as Musk effectively capturing Trumps policy direction  culminated in a February 7, 2025, executive order slashing US aid to\n\nSouth Africa. Citing the Expropriation Act and South Africas anti-Israel stance, Trumps decision bore Musks imprint, a direct result of AfriForums lobbying efforts in the US since 2018.\n\nThis capture of Trump by Musk, fuelled by AfriForums backing, amplifies their reach, turning domestic grievances into international punishment. Yet, this alliance has dire domestic consequences. Critics argue AfriForums failure to recognise that their approach is treasonous and against the national interest of South Africa and Africa reflects a profound disconnect. By inviting sanctions that harm the broader population, they replicate colonial strategies of external domination, betraying the sovereignty Mandelas struggle secured.\n\nFormer First Lady Mrs Grace Mugabe\n\nThe uMkhonto weSizwe (MK) party filed treason charges against AfriForum on February 10, 2025, accusing them of undermining the nation for selfish ends  a charge they dismiss, clinging to their legalistic defences. Adding to their contradictions, Trumps offer for asylum to them and their refusal show they are confused. Labelling Afrikaners as victims of racial discrimination, Trump extended refuge  yet AfriForum and Solidarity rejected it, insisting their future lies in South Africa. This refusal baffles observers: if their persecution narrative holds, why not flee? It suggests a refusal to relinquish the privileges they retain, exposing a muddled identity neither fully oppressed nor reconciled with a transformed nation.\n\nDividing to conquerMost troubling is their sponsorship of black-on-black violence just to divert land expropriation, leading to current xenophobic hatred in South Africa against fellow African blacks. Critics allege AfriForum and Solidarity amplify crime narratives with racial undertones, stoking tensions between black South Africans and African migrants. Recent xenophobic attacks reflect this strategys success, diverting public outrage from land inequities where whites still own over 70 percent of agricultural land  to internecine conflict. This divide-and-conquer tactic preserves their economic dominance by fracturing black unity, a cynical betrayal of African solidarity.\n\nUmkhonto we Sizwe (MK) Logo\n\nA treasonous relic in a democratic ageAfriForum and Solidarity embody a tenacious remnant of Caucasian privilege, wielding law, extremist ties, and international allies like Musk who has captured Trumps ear  to resist South Africas transformation. Their pursuit of Dr Mugabe contrasts starkly with their protection of Netanyahu, while their rejection of asylum reveals a confused refusal to abandon local power.\n\nBy sponsoring division and inviting sanctions, they pursue a treasonous path against the national interest, clashing with Mandelas Rainbow Nation vision. In the interest of democracy and freedom of speech, their actions demand scrutiny  not as mere minority advocates, but as relics of a colonial past fracturing a nation striving for equity. South Africas future hinges on confronting such forces, lest they undermine the democratic promise Mandela died for.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/Elon-Musk-24-1.jpg",
            "description": "Marshall Ndlela, marsh@marshfin.com IN South Africa’s fragile democracy, where Nelson Mandela’s vision of a “Rainbow Nation” sought to heal centuries of racial division, AfriForum and its ally, Solidarity, stand as polarising forces. Far from being mere advocates for minority rights, these organisations are accused of preserving Caucasian privilege, rooted in colonial legacies and sustained through […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        },
        {
            "title": "TSL snaps stake from Nampak SA",
            "url": "https://www.chronicle.co.zw/tsl-snaps-stake-from-nampak-sa/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nAMALGAMATED agriculture-listed company, TSL Limited, says a process to acquire 51,4 percent shareholding in Nampak Zimbabwe Limited from Nampak Southern Africa Holdings Limited is underway as part of its strategic expansion drive.\n\nIn a statement accompanying the companys financial results for the year ended 31 October 2024, board chairman Mr Antony\n\nMandiwanza said several key strategic initiatives were being pursued and should be concluded before the end of the current financial year.\n\nHe said the group is well positioned to capitalise on emerging opportunities as part of its growth strategy with considerable efforts on restructuring the balance sheet to preserve value.\n\nMr Mandiwanza said the preservation of shareholder value will be maintained as the cornerstone of the groups operations and strategic initiatives.\n\nAs part of the groups expansion drive in strategically aligned businesses, TSL Limited is engaged in the acquisition of 51,43 percent shareholding in Nampak Zimbabwe Limited from Nampak Southern Africa Holdings Limited, said Mr Mandiwanza.\n\nProcesses to finalise and execute the sale and purchase agreement are at an advanced stage.To preserve cash for the impending acquisition of the shareholding, Mr Mandiwanza said the board of directors has decided to forego a dividend for the financial year that ended, 31 October 2024.\n\nHe said the board believes that the value uplift from the acquisition will significantly benefit shareholders soon.Meanwhile, Mr Mandiwanza said the group revenue from continuing operations, at US$36,9 million was one percent ahead of the prior year with most units, except Agricura, achieving budgeted volumes.\n\nHe said volumes for Agricura were adversely affected by the projection of a drought in the first half of the 2023/24 agricultural season.\n\nThe groups profitability was adversely affected by the dollarisation of most operating expenses, which was worsened by an emerging US dollar inflation in the economy.\n\nProfit before tax from continuing operations closed the year at US$7,1 million compared to US$9,8 million in the previous year, said Mr Mandiwanza.\n\nResultantly, interest cover dropped while headline earnings per share dropped from US$2,48 cents to US$0,69 cents.Adjustments have already been made in the 2025 financial year to address the dollarisation of all operating expenses.\n\nHe said the groups financial position remains strong and continues to grow despite the drop in profitability in the financial year.\n\nThe group generated positive cash flows from its operations. Gearing levels remain acceptable and will be managed downwards from the groups cash flows in the coming year. TSLs agricultural trading division was the worst affected by the El Nino-induced drought.\n\nHowever, Mr Mandiwanza said that despite these challenges, the company increased its gross profit ratio from 38 percent to 49 percent, driven by a high-value product mix and strategic procurement. @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/CZXWASASC.jpg",
            "description": "Sikhulekelani Moyo, mskhulekeani16@gmail.com AMALGAMATED agriculture-listed company, TSL Limited, says a process to acquire 51,4 percent shareholding in Nampak Zimbabwe Limited from Nampak Southern Africa Holdings Limited is underway as part of its strategic expansion drive. In a statement accompanying the company’s financial results for the year ended 31 October 2024, board chairman Mr Antony Mandiwanza […]",
            "time": "06:09",
            "date": "04 Mar 2025"
        }
    ]
}