{
    "news": [
        {
            "title": "Strong start for Zimtile in BSCL",
            "url": "https://www.chronicle.co.zw/strong-start-for-zimtile-in-bscl/",
            "content": "Fungai Muderere,[emailprotected]ZIMTILE had a strong start in the Bulawayo Corporates Social League (BCSL) after they dismissed Chibuku 4-0 in an opening match of the season that was played at Cement Primary School on Saturday.Simbisa dismissed Coca-Cola 2-0.There were goals galore in the match between ZETDC and Evergold after the former edged the latter 5-4.WD and Overnight drew two all. Macdonald Bricks and Ostrich played a one all draw while Nust thumped Millennium 3-1.The game between Speed Shipping and Proton was postponed.BCSL Week One ResultsCoca-Cola 0 vs Simbisa 2, ZETDC 5 vs EverGold 4, WD 2 vsOvernight 2, Macdonald bricks 1 vs Ostrich 1, Nust 3 vs Millennium 1, Chibuku 0 vs Zimtile 4Bulawayo Social Soccer LeagueMatch Day 5 ResultsGroup AOld Timers 1-1 Edgars , Stars FC 7-0 Patapata , Brotherhood1-2 Vulavale , Fireworks 3-2 Tigers, Zulu Chiefs 3-3 Iminyela Timers , ManU 7-2 FC Pirates, Glenkara 6-2 Creamtata, Mthala 5-0 Magwegwe Bullets, Cowdray Masters 0-2 Fundukulinda, Makwee 3-2 70 CombinationGroup BDelta 2-0 Pelandaba Legends, Bombers 3-2 94 Strivers, Congo Chiefs 0-3 Hyde Park, Nketa 6-0 Pioneer , Nkulumane Legends 0-3 Santos, B.C.T 2-9 Ndola, Mabuthweni 1-2 Robert Sinyoka, Khami Hydon 3-3 Wembley, West Comm 4-0 Gwabalanda, Happy Valley 3-1 Emganwini LegendsGroup CKhami Rehabilitation FC 1-2 Sekusile, Zobha 2-3 Abangane,New Jack City 1-2 Luveve, Real Magwegwe vs Nkulumane 12 (Postponed), Emganwini Celtics 1-1 Skippers, South Gunners 4-0 Osiphatheleni , Siyabangena 3-3 CIWU Legends, 11 Stars 0-2 Real Shiwelele , Matshobane 2-3 Wolves, Finance 2-1 Street Strikers\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-10-at-17.56.34.jpeg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw ZIMTILE had a strong start in the Bulawayo Corporates Social League (BCSL) after they dismissed Chibuku 4-0 in an opening match of the season that was played at Cement Primary School on Saturday. Simbisa dismissed Coca-Cola 2-0. There were goals galore in the match between ZETDC and Evergold after the former edged the […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "Duo nabbed by police with 200kg of dagga in transit",
            "url": "https://www.chronicle.co.zw/duo-nabbed-by-police-with-200kg-of-dagga-in-transit/",
            "content": "Ronald Mpofu\n\nMASVINGO Police have arrested two individuals caught in unlawful possession of 200kgs worth of dagga.\n\nTwo men, Limbikani Mwanandi (36) and Speakmore Mhonda (39) were arrested at the Harare-Masvingo and Bulawayo-Masvingo roads intersection while offloading 200kg worth of dagga from a broken-down cross-border bus to Nissan Caravan.\n\nThe suspects were arrested on March 8, 2025. Said the Police on X\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-10-at-15.13.05-1.jpeg",
            "description": "Ronald Mpofu MASVINGO Police have arrested two individuals caught in unlawful possession of 200kgs worth of dagga. Two men, Limbikani Mwanandi (36) and Speakmore Mhonda (39) were arrested at the Harare-Masvingo and Bulawayo-Masvingo roads intersection while offloading 200kg worth of dagga from a broken-down cross-border bus to Nissan Caravan. The suspects were arrested on March […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "Zimra shuts down Unity Village Flea Market in Bulawayo amid nationwide crackdown on smuggled goods",
            "url": "https://www.chronicle.co.zw/zimra-shuts-down-unity-village-flea-market-in-bulawayo-amid-nationwide-crackdown-on-smuggled-goods/",
            "content": "THE Zimbabwe Revenue Authority (Zimra) has locked up Unity Village Flea Market in Bulawayo as part of a nationwide blitz targeting smuggled goods and counterfeit products.\n\nThe flea market, which houses dozens of traders, is one of the busiest in the city centre, offering a variety of products ranging from clothing and footwear to mobile phones, accessories, and kitchenware.\n\nThis move comes as Zimra intensifies its crackdown across the country, targeting smuggling syndicates and tax evasion practices to boost Government revenue for national development.\n\nWhen the Zimpapers Business Hub visited the market this afternoon, crowds of people were milling around, unsure of where to go after their shops had been closed.\n\nIn an interview, the head of security at Unity Village, Mr Gilter Manasidze, confirmed that shops selling clothing, kitchenware, phones, and phone accessories had been closed. However, he clarified that Zimra had stated that those offering phone repair and other services were not being targeted.\n\nThey are targeting those who are not paying duty, especially those who deal with clothing, mobile phones, and accessories. However, those who repair phones do not seem to be affected, said Mr Manasidze.They have instructed us to compile all the stock and submit it to them so they can calculate how much duty is owed.\n\nAffected traders, who were gathered outside the closed market, expressed their frustration, stating that the shutdown was a significant blow to their livelihoods. Many now face an uncertain wait for Zimra officials to resolve the issue.\n\nI dont know what to do; I will just wait for Zimra officials to see what they say next. I am hoping for an immediate resolution to this unexpected shutdown, said one trader, who chose to remain anonymous.\n\nOthers voiced concerns about losing customers and struggling to provide for their families due to the uncertainty of when they would be able to resume business.\n\nMeanwhile, retail outlets adjacent to the Central Police Station, among others, have also been closed in recent weeks as part of the same operation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WTHNHNH.jpg",
            "description": "THE Zimbabwe Revenue Authority (Zimra) has locked up Unity Village Flea Market in Bulawayo as part of a nationwide blitz targeting smuggled goods and counterfeit products. The flea market, which houses dozens of traders, is one of the busiest in the city centre, offering a variety of products ranging from clothing and footwear to mobile […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "Bulawayo plans US$1 Million deep well to address water crisis",
            "url": "https://www.chronicle.co.zw/bulawayo-plans-us1-million-deep-well-to-address-water-crisis/",
            "content": "Nqobile Bhebhe ,[emailprotected]\n\nBulawayo City Council is considering a substantial investment of up to US$1 million to drill a single deep well in the proposed Matobo Aquifer, as part of its Bulawayo Groundwater Resources strategy to address the citys ongoing water crisis.\n\nThe proposed well, estimated to be between 800 metres to 1.2 kilometres deep, could produce a water yield equivalent to 10 shallow wells, providing a significant boost to the citys water supply.\n\nThe Matobo Aquifer is located in the Matobo District of Matabeleland South Province and is known for its pressurised nature, allowing water to rise naturally to a certain level and flow by gravity from the bottom hole to the wellhead.\n\nAccording to the local authority, the aquifer is recharged by moderate to low rainfall in the region, with water percolating through the soil and rocks.\n\nThe estimated yield from the aquifer is between 20 to 40 megalitres per day, with the proposed boreholes expected to reach depths of 1 to 3 kilometres.\n\nAccording to the latest council agenda, the Future Water Supplies and Water Action Committee has recommended to the Finance and Development Committee to drill at least one deep well in the Matobo Aquifer to evaluate its potential yield.\n\nA single deep well (800m to 1.2 km in depth and over 1.5m width) could achieve yield equivalent to 10 shallow wells.\n\nThe water quality was improved as the well was tapping from depths over 800m into the ground.\n\nCost of siting, drilling and equipping each borehole was estimated between US$500,000 to US$1,000,000 depending on borehole depth, reads part of the report.\n\nThe council also emphasised the need for a detailed hydrogeological assessment of the aquifers to better understand groundwater systems and ensure sustainable management.\n\nThis approach would integrate multiple disciplines, including geology, hydrology, chemistry, and environmental science, and involve collaboration with various stakeholders to effectively address water resource challenges.\n\nThe report recommended engaging with key stakeholders to formulate a comprehensive plan for the development and management of Bulawayos potential groundwater resources.\n\nThe need for new water sources is critical as Bulawayo continues to grapple with a severe water crisis, driven by declining water levels in supply dams and rapid population growth over the past two decades.\n\nThe city currently relies on six surface water sourcesInsiza, Inyankuni, Lower Ncema, Upper Ncema, Umzingwane, and Mtshabeziand one groundwater source, with a combined total yield of 181.5 megalitres per day.\n\nAs the city explores new solutions to its water challenges, the proposed deep well in the Matobo Aquifer represents a potentially transformative project for Bulawayos water security.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/LOLKMJMJ.jpg",
            "description": "Nqobile Bhebhe ,nqobile.bhebhe@chronicle.co.zw Bulawayo City Council is considering a substantial investment of up to US$1 million to drill a single deep well in the proposed Matobo Aquifer, as part of its Bulawayo Groundwater Resources strategy to address the city’s ongoing water crisis. The proposed well, estimated to be between 800 metres to 1.2 kilometres deep, […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "WATCH: Inmates join formal external football structures",
            "url": "https://www.chronicle.co.zw/watch-inmates-join-formal-external-football-structures/",
            "content": "Lovemore DubeINMATES from Khami Prison have affiliated under the Bulawayo Social Soccer League as part of their rehabilitation and reintegration into society.Zimbabwe Prisons have adopted a worldwide trend of inmates going for rehabilitation to correct their past mistakes so that they can return to be of positive influence in society. While at correctional service centres, they are exposed to different trades and skills, to leave the institutions ready for life outside.\n\nMkhulunyelwa Ngwenya, the Bulawayo Metropolitan Province Officer Commanding for the Zimbabwe Correctional and Prison Services, told Zimpapers Sports Hub on the sidelines of a 12-inmate teams tournament, that soccer had been identified as a key tool towards rehabilitation and reintegration into society.The commander said they were no longer running punitive centres but now wanted to see inmates correct their ways and return to life with communities.As an organisation we have transformed from a punitive approach we used to have to a rehabilitative approach, we realise if we take that route we want to have a citizen who comes out motivated to develop the most popular game, said Ngwenya.\n\nHe said playing in the Bulawayo Social Soccer League allowed inmates to get an appreciation of the outside world and prepare into being integrated back to society.We have registered a team of inmates with the Bulawayo Social Soccer League. This is part of our rehabilitation and reintegration exercise. They prepare gradually for life after when they go back to society. We are now rehabilitation centres and this approach has proved a success and we are working with organisations such as City Football Development Trust, said Ngwenya.On Saturday the inmates side clashed with Sekusile in a league match at Khami Prison Stadium.The venue is outside the prisons, officers and their officers watched the match.Commissioner Ngwenya was the guest of honour at a tournament held to launch a league in which inmates from 12 centres in Bulawayo will battle it out.The day marked the beginning of a partnership with City Football Development Trust that has been formed by football legends Sikhumbuzo Ndebele and Zenzo Moyo.Another member of the organisation is Thandolwenkosi Nyathi an accounting graduate and Bulawayo City FC chief executive officer.Those legends, are role models we want inmates to copy from them, how they behave and how they engage with community. We want them to go out and be useful citizens, said Ngwenya.City Football Development Trust donated balls and uniforms for 12 teams that will play in the league.We appreciate our legends we have received uniforms and balls from them, he said.Sikhumbuzo Ndebele said they would love to assist inmates come out as qualified coaches and referees so that they can fend for themselves outside prison.Ndebele said very good players will be recommended to professional teams after serving time at the Correctional Centres.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WERTGTGT.jpg",
            "description": "Lovemore Dube INMATES from Khami Prison have affiliated under the Bulawayo Social Soccer League as part of their rehabilitation and reintegration into society. Zimbabwe Prisons have adopted a worldwide trend of inmates going for rehabilitation to correct their past mistakes so that they can return to be of positive influence in society. While at correctional […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "Paedophile ordered to perform community service",
            "url": "https://www.chronicle.co.zw/paedophile-ordered-to-perform-community-service/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 50-YEAR-OLD Bulawayo man was yesterday ordered to perform 420 hours of community service after being convicted of having sexual intercourse with a 16-year-old girl.\n\nInnocent Kakarahwa from Magwegwe North suburb appeared before Western Commonage regional magistrate, Mrs Sibongile Marondedze.Kakarahwa was initially sentenced to 24 months in prison. However, 12 months were suspended for five years on the condition that he does not commit a similar offence during that period. The remaining 12 months were further suspended, contingent on his completion of 420 hours of community service at Magwegwe Police Station.\n\nIn passing sentence, Mrs Marondedze expressed concern over the rising tide of sexual crimes involving juveniles. She emphasised the courts duty to protect the girl child.Cases that involve sexual relationships with juveniles are now on the rise, hence the need to send a clear message to would-be offenders that the law does not tolerate such behaviour, she said.\n\nThe incident goes back to December last year when Kakarahwa lured the victim with a promise of a trip to Harare.\n\nProsecuting, Mr Milton Moyo said the accused arranged to meet the girl at Lobengula West Business Centre. Instead of heading to the capital, Kakarahwa diverted to Donnington West, where he held the girl in a single room for three days and engaged in sexual acts with her. Initially, he faced a kidnapping charge alongside the sexual offence, but the former was dropped due to insufficient evidence.\n\nThe matter came to light after the girls father reported her missing, prompting a police investigation. The victim was eventually located and brought to the station, where she recounted her ordeal.In his defence, Kakarahwa claimed the girl had misrepresented her age, insisting she told him she was 19.\n\nThe Criminal Law (Codification and Reform) Act criminalises sexual activity with a child below the age of 18. This was after the Government last year raised from 16 to 18 years, the threshold within which one can make valid sexual consent.\n\nAccording to the law, there is no defence to a charge of sexual intercourse or performing an indecent act with a young person to prove that he or she consented to such sexual intercourse or indecent act.\n\nAccording to the Zimbabwe Gender Commission, sexual offences against minors have spiked in urban areas, with perpetrators sometimes exploiting trust or offering false promises. Advocacy groups have long called for stronger community education and enforcement of child protection laws to stem the trend.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2013/08/court-hammer.jpg",
            "description": "  Lesley Chikudo,chikudolesley@gmail.com A 50-YEAR-OLD Bulawayo man was yesterday ordered to perform 420 hours of community service after being convicted of having sexual intercourse with a 16-year-old girl. Innocent Kakarahwa from Magwegwe North suburb appeared before Western Commonage regional magistrate, Mrs Sibongile Marondedze. Kakarahwa was initially sentenced to 24 months in prison. However, 12 months […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "Villagers in Ward 21, Bulilima District, accuse traditional leaders of illegally selling grazing land",
            "url": "https://www.chronicle.co.zw/villagers-in-ward-21-bulilima-district-accuse-traditional-leaders-of-illegally-selling-grazing-land/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nVILLAGERS in Ward 21, Bulilima District, Matabeleland South Province, are up in arms against traditional leaders in the area, accusing them of illegally selling their grazing land to suspected senior civil servants and businesspersons.\n\nThe villagers have approached the District Development Coordinator (DDC) to intervene in the potentially explosive matter, which threatens their livestocks pastures.\n\nIn a letter to the Bulilima DDC, Mr Onisimo Togara, seen by the Chronicle, the villagers called on the Zimbabwe Anti-Corruption Commission (ZACC) to be engaged in the matter.\n\nThis third note is being submitted to your office as a follow-up to the above matter (sold grazing land). The land has been and is still being allocated to these settlers, who are believed to be buying from the top traditional leadership. Please help us recover our grazing land, from which our forefathers were relocated without compensation, for grazing purposes, reads the letter from the villagers.\n\nThey said the land that was meant to cater for grazing space has been targeted for sale, leaving them landless.\n\nThe situation in Ward 21 is so volatile and now needs your prompt response as we submit this letter, said the villagers.\n\nThis publication also has a response from Mr Togara, in which he notifies the villagers that a meeting to deliberate on the contentious matter has been set for 19 March.\n\nChief Mphini, whose area of jurisdiction is Ward 21, denied that the traditional leadership was parcelling out grazing land to strangers for kickbacks, saying the area under dispute was no longer used as livestock pastures but is just a thick forest.\n\nThis is an old story, something which was done by village heads. In any event, the area which people are complaining about was no longer used for pastures, as the livestock are grazing at a nearby farm, Sibantubanye, said Chief Mphini.\n\nHe said the Bulilima Rural District Council had targeted the same land for development, as it is closer to their sub-office in the area.\n\nHowever, Bulilima RDC Acting Chief Executive Officer, Mr Billiat Mlauzi, said the council is not involved in the allocation of the land under dispute.\n\nAs council, we are not involved. In fact, we are disappointed that the piece of land has been allocated to some villagers because it was part of our long-term plan as we expand. But on this particular matter, we are nowhere near the allocation of the stands, said Mr Mlauzi.\n\nWard 21 Councillor, Dolly Dube, said she was aware of the dispute but is not privy to who is involved in the illegal allocation of the stands.\n\nCllr Dube said she will be attending the stakeholders meeting, which has been called by the DDC.\n\nContacted for comment, Bulilima DDC, Mr Togara, confirmed that he has been approached by the villagers over the land dispute.\n\nWe are seized with the matter as an office, and a meeting has been scheduled to see how best this issue can be resolved. As you are aware, communal land is state land, which is not for sale, said Mr Togara.\n\nCommunal land refers to land set aside under an Act of Parliament and held in accordance with customary law by members of a community under the leadership of a Chief.\n\nThe Government has consistently warned traditional leaders and individuals who are parcelling out state land to desperate land seekers in return for kickbacks, saying such behaviour is a criminal offence. They have vowed to dismiss and prosecute those found on the wrong side of the law.\n\nThe warnings were fuelled following an increase in the parcelling out and selling of state land countrywide. Four village heads from Dema in Mashonaland East Province were recently convicted after appearing in court for selling stands in undesignated places and pocketing the proceeds.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-10-at-10.43.18.jpeg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw VILLAGERS in Ward 21, Bulilima District, Matabeleland South Province, are up in arms against traditional leaders in the area, accusing them of illegally selling their grazing land to suspected senior civil servants and businesspersons. The villagers have approached the District Development Coordinator (DDC) to intervene in the potentially explosive matter, which threatens their […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "WATCH: Victoria Falls signs US$1.6M deal to develop BB5 and Railway Loop Stands",
            "url": "https://www.chronicle.co.zw/watch-victoria-falls-signs-us1-6m-deal-to-develop-bb5-and-railway-loop-stands/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nThe City of Victoria Falls has entered into a US$1.6 million agreement with Integrated Construction Projects (ICP), a civil engineering company, to service the BB5 and Railway Loop stands.\n\nBB5 is a prime piece of land comprising approximately 90 commercial stands located along Livingstone Way, behind Sawanga Mall. The Railway Loop, situated behind Shearwater Village, offers around 20 stands. Given BB5s location in the central business district, the council aims to enhance the citys ambiance through this development.\n\nThe agreement was signed on Friday in Victoria Falls by the Citys Town Clerk, Mr Ronnie Dube, and ICP Director, Mr Tawanda Muchineripi. The council will fully fund the project, with ICP committing to complete all works within a record six-month timeline.\n\nFollowing the agreement, ICP is set to begin work immediately, undertaking essential infrastructure developments, including water, sewer, roads, and stormwater drainage systems.\n\nMr Dube highlighted the projects benefits, stating, As the responsible authority, it is fair that we develop that area to enhance the ambiance of our city and, of course, to benefit the people who were allocated the stands. Hence, we advertised the tender for the works to be done, and ICP won the tender for US$1.6 million, which we are going to fund using our resources.\n\nUpon completion of the servicing, beneficiaries will be able to occupy the site.\n\nICP has previously completed projects for the city, including the BB7 residential development, and is currently constructing a water reservoir in Victoria Falls.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-10-at-10.27.49.jpeg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw The City of Victoria Falls has entered into a US$1.6 million agreement with Integrated Construction Projects (ICP), a civil engineering company, to service the BB5 and Railway Loop stands. BB5 is a prime piece of land comprising approximately 90 commercial stands located along Livingstone Way, behind Sawanga Mall. The Railway Loop, situated […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "Wife stabs husband, flees",
            "url": "https://www.chronicle.co.zw/wife-stabs-husband-flees2/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nPolice are searching for a Beitbridge woman, Shorai Dube, after she allegedly stabbed her husband multiple times, causing near-fatal injuries, on Saturday morning. The attack reportedly occurred while the man was asleep.\n\nThe motive remains unclear. Beitbridge District Police Commander, Chief Superintendent Melusi Ncube, confirmed the incident, stating, She allegedly stabbed him several times on the throat and abdomen. He is seriously injured and hospitalised. Investigations are ongoing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/01/knife-robbery-680x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Police are searching for a Beitbridge woman, Shorai Dube, after she allegedly stabbed her husband multiple times, causing near-fatal injuries, on Saturday morning. The attack reportedly occurred while the man was asleep. The motive remains unclear. Beitbridge District Police Commander, Chief Superintendent Melusi Ncube, confirmed the incident, stating, “She allegedly stabbed […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        },
        {
            "title": "President officially gazettes Zimbabwe, Belarus tax agreement",
            "url": "https://www.chronicle.co.zw/president-officially-gazettes-zimbabwe-belarus-tax-agreement/",
            "content": "Farirai Machivenyika,Harare Bureau\n\nPRESIDENT Mnangagwa has officially gazetted the tax agreement between Zimbabwe and the Republic of Belarus, which was concluded in January 2023.\n\nThis announcement appears in Proclamation 2 of 2025, included in Statutory Instrument 18 of 2025, published in an Extraordinary Government Gazette last week.\n\nThe agreement aims to avoid double taxation and prevent tax evasion concerning income and property taxes. It seeks to regulate tax relations between the two nations and promote trade and economic co-operation on mutually beneficial terms.\n\nThe proclamation states: Whereas, it is provided for by section 91 of the Income Tax Act that the President may enter into agreements with the government of any other country or territory to prevent, mitigate, or discontinue the levying of taxes on the same income . . . \n\nThe agreement was finalised with the Belarusian Government on January 31, 2023, and has now been officially proclaimed.\n\nIn the previous year, Zimbabwe hosted the inaugural session of the Zimbabwe-Belarus Joint Permanent Commission on Cooperation (JPCC) in Harare, leading to several memoranda of understanding, agreements, and commercial contracts between the two countries.\n\nCo-operation spans various sectors, including mining, infrastructure development, science and innovation, agriculture, and industry. Belarus has supplied Zimbabwe with tractors, earth-moving trucks, and fire-fighting equipment.\n\nPresident Mnangagwa and his Belarusian counterpart, Aleksandr Lukashenko, have engaged in State visits and met at various international forums, further strengthening their diplomatic and economic ties.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/y8rg79rg789frg789f4.jpg",
            "description": "Farirai Machivenyika, Harare Bureau PRESIDENT Mnangagwa has officially gazetted the tax agreement between Zimbabwe and the Republic of Belarus, which was concluded in January 2023.  This announcement appears in Proclamation 2 of 2025, included in Statutory Instrument 18 of 2025, published in an Extraordinary Government Gazette last week. The agreement aims to avoid double taxation and […]",
            "time": "20:40",
            "date": "10 Mar 2025"
        }
    ]
}