{
    "news": [
        {
            "title": "Rains rekindle hope",
            "url": "https://www.chronicle.co.zw/rains-rekindle-hope/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE recent downgraded Cyclone Chido brought a glimmer of hope to farmers in Zimbabwes southern regions.\n\nThe much-needed rainfall has rejuvenated crops, pastures, and water sources, providing relief from the soaring temperatures experienced over the past few weeks.\n\nThe dry spell threatened to cause severe moisture stress to crops and livestock deaths due to the dwindling pastures and drying water sources.\n\nFortunately, Cyclone Chido, although dissipated, delivered significant rainfall to parts of Bulawayo, Matabeleland South, Midlands, Masvingo, and Matabeleland North provinces.\n\nThe rain started over the weekend in Bulawayo, bringing relief to farmers like Mr Obert Mlalazi from the Redwood area of Umguza District.\n\nThe first rains in November gave us some hope, but the last three weeks were tough with high temperatures and no rainfall. The current rains are a welcome relief, and our cattle will no longer have to walk long distances for water, and the pastures will improve, benefiting the general health of the animals, he said.\n\nAt Cement Siding, farm workers took advantage of the moisture to remove weeds from carrot fields.\n\nUrban farmers weeding in Bulawayo yesterday\n\nA farm worker, who only identified himself as Mr Mpofu, said neighbouring farmers had already begun planting maize and groundnuts.\n\nThe fields were dry before the rains and it was difficult to pull out weeds from the carrot field. Some of our neighbours have already started planting crops such as maize and groundnuts, said a farm worker.\n\nUrban farmers in suburbs such as Mahatshula, Killarney, Magwegwe, Emganwini, Pumula, and Nketa also seized the opportunity to plant maize.Mr Alwyne Mahamba, who farms along the Bulawayo-Harare Road, shared his optimism.\n\nWe dug Intwasa holes last month, but the rains disappeared, so we couldnt plant. Now that the rains are back, were planting maize, sweet potatoes, and beans, he said.\n\nMatabeleland Norths acting provincial director for the Agricultural and Rural Development Advisory Services, Mr Thulani Ndlovu, said the recent rains have brought optimism to farmers and communities across the provinces.\n\nHe said 90 percent of the province received rainfall with totals ranging from 15mm to 40mm. However, parts of Binga and Hwange remain dry and hot.\n\nTo farmers who have not yet planted, we advise planting short-season crop varieties to ensure harvest by March. We also recommend traditional grains, sweet potatoes, sunflower, and sugar beans, he said.\n\nMr Ndlovu said no crop losses had been recorded due to moisture stress, and the rains are expected to improve livestock conditions as pastures and water sources replenish.\n\nWe also expect the body conditions of livestock to improve due to improved pastures and easily accessible water in rivers, streams, and dams.\n\nOur hope is for the rainfall to continue for the next few days and we will see a great improvement in the conditions of livestock and pastures, he said.\n\nAccording to the Meteorological Services Department (MSD), Cyclone Chidos intensity diminished as it moved inland, with increased friction reducing wind speeds and rainfall.\n\nCivil Protection Unit director, Mr Nathan Nkomo, said: We expect moderate rainfall ranging from 30mm to 80mm across much of the country as moisture from the cyclone interacts with the Inter-Tropical Convergence Zone (ITCZ), which typically brings rain to Zimbabwe in mid-December.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgbfgfgf-680x380.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com THE recent downgraded Cyclone Chido brought a glimmer of hope to farmers in Zimbabwe’s southern regions. The much-needed rainfall has rejuvenated crops, pastures, and water sources, providing relief from the soaring temperatures experienced over the past few weeks. The dry spell threatened to cause severe moisture stress to crops and livestock deaths […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "Government launches door-to-door blitz on smuggled goods",
            "url": "https://www.chronicle.co.zw/government-launches-door-to-door-blitz-on-smuggled-goods/",
            "content": "Remember Deketete, Harare Bureau\n\nThe Government has initiated a door-to-door crackdown to confiscate smuggled goods that are increasingly flooding the country, especially during the festive season.\n\nIndividuals found in possession of smuggled items will face imprisonment without the option of bail.\n\nThis operation comes in response to huge losses of up to US$1 billion due to smuggling activities along the borders that the country is incurring annually.\n\nThe crackdown coincides with the peak season for smuggling, as many Zimbabweans return home for the Christmas and New Year holidays, often bringing goods from South Africa and other neighbouring countries.\n\nAddressing journalists yesterday, Engineer Tafadzwa Muguti, the Permanent Secretary for Presidential Affairs in the Office of the President, announced that a taskforce has been deployed to all major border posts and key roads to prevent the entry of smuggled goods.\n\nThis December, we will have inter-governmental agencies stationed at our major border posts to ensure zero tolerance for smugglers. The taskforce will conduct door-to-door inspections of all goods in wholesale and retail shops, he said.\n\nThe operation will also target wholesalers, supermarkets, and tech shops, with smuggled products including a variety of food items, clothing, drugs, beverages, fertilisers, cement, vehicles, electrical gadgets, and solar panels.\n\nEng Muguti said the Governments goal is to ensure that the local industry is promoted against cheap, often counterfeit products that pose a health risk to consumers.\n\nI want to issue a stern warning to diasporans returning for the holidays. We often see rising prices and increased black market trading as they come back. Many choose not to declare their groceries and attempt to smuggle in illicit alcohol and other items, be aware that there will be no fines for violations at roadblocks; rather, those caught will be arrested on the spot. You risk spending Christmas behind bars if you engage in these activities, he said.\n\nLast month Government formed a taskforce led by the Ministry of Industry and Commerce to lead the crackdown on smuggling.\n\nThe taskforce includes various Government agencies such as the Zimbabwe Revenue Authority (Zimra), the Zimbabwe Republic Police, the Reserve Bank of Zimbabwe (RBZ), and the Consumer Protection Commission.\n\nEng Muguti warned Government officials against engaging in corrupt practices, stating that surveillance systems have been implemented across roadblocks and within the transport sector.\n\nSince January, authorities have arrested 15 181 individuals for smuggling. The crackdown also targets businesses that use parallel market exchange rates and sell counterfeit, underweight, or unlabelled products. To enforce compliance, 24-hour roadblocks have been established along highways leading into major cities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgfgffhgh.jpg",
            "description": "Remember Deketete, Harare Bureau The Government has initiated a door-to-door crackdown to confiscate smuggled goods that are increasingly flooding the country, especially during the festive season. Individuals found in possession of smuggled items will face imprisonment without the option of bail. This operation comes in response to huge losses of up to US$1 billion due […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "The Barcelona coaching saga: Machazani’s side of the story",
            "url": "https://www.chronicle.co.zw/the-barcelona-coaching-saga-machazanis-side-of-the-story/",
            "content": "Innocent Kurira,[emailprotected]\n\nMARSHALL Machazani, a former Zimbabwe footballer, has responded to allegations that he falsified information about a trip to Barcelona last year.\n\nThe Barcelona Innovation Hub had accused Machazani of misrepresenting his visit to the city, claiming that he had never attended their premises or participated in any of their coaching programmes.\n\nSpeaking to Zimpapers Sports Hub from Harare, Machazani acknowledged that he had visited Spain for a private vacation, during which he was impressed by the citys approach to football.\n\nHe decided to further his coaching education by enrolling in an online course with the Barcelona Innovation Hub.\n\nI do acknowledge that I was in Spain for a vacation and it was private. While I was there I liked how they do their things at Barcelona. I then decided to take up a coaching course with their Innovation Hub after the Barcelona tour. The three courses were How to Train, The Basics of our style of Play and What To Train.\n\nI did these online and attained the certificates between July-December 2023. Everything that was published after my Barcelona trip was just a domino effect, said Machazani.\n\nA statement from the Barcelona Innovation Hub alleged that Machazani had misrepresented his visit to Barcelona and had never actually participated in any coaching activities with the club.\n\nAn investigation by the hub found that Machazani was in Barcelona for just one week in January 2023, on a vacation sponsored by his girlfriend.\n\nThe investigation, based on visa application records, sponsor affidavits, and flight itineraries, debunked Machazanis assertions that he had spent several months in Spain honing his coaching skills at the renowned Barcelona Innovation Hub.\n\nThe hubs findings also revealed that Machazanis claims of meeting Robert Lewandowski, the Barcelona and Poland striker, were allegedly false.\n\nWe take great pride in our academys reputation for excellence, and its disappointing to see individuals seeking to exploit that reputation for personal gain, a statement from the Barcelona Innovation Hub read.\n\nThe controversy has sparked a flurry of interest, with several individuals applying for non-existent coaching attachments at the academy.\n\nThe Barcelona Innovation Hub has urged Machazani to retract his false statements and apologise for any harm caused to the academys reputation.\n\nDespite the controversy, Machazani remains committed to his coaching career and is eager to put the experience behind him.\n\nIm just focused on moving forward and continuing to learn and grow as a coach, said Machazani. Machazani is a former Dynamos and Highlanders player.-@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Marshall-Machazani.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw MARSHALL Machazani, a former Zimbabwe footballer, has responded to allegations that he falsified information about a trip to Barcelona last year. The Barcelona Innovation Hub had accused Machazani of misrepresenting his visit to the city, claiming that he had never attended their premises or participated in any of their coaching programmes. Speaking […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "Mazibuko shortlisted for SHE Global 2024 Awards",
            "url": "https://www.chronicle.co.zw/mazibuko-shortlisted-for-she-global-2024-awards/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nThe founder of Mr and Miss Rural Zimbabwe, Esteemed Businesswomen Zimbabwe and Mental Voices Trust, Sipho Mazibuko, has been nominated for the SHE Global 2024 Awards.\n\nThe non-monetary business awards ceremony for female entrepreneurs in Africa, launched in 2021, honours African women founders who create jobs, inspire change and drive economic growth through their entrepreneurial endeavours.\n\nSipho Mazibuko\n\nWith her impressive track record of founding impactful organisations, Sipho Mazibuko, nominated in the Social Founder of the Year category, stands as an ideal candidate for the award.\n\nIn an interview, Mazibuko expressed her disbelief and gratitude for the nomination.\n\nSipho Mazibuko\n\nThis is a huge milestone for me  a first for a woman from Matabeleland South and Zimbabwe. Im shocked! Please vote for me as a win is not just for me, but for everyone who supports this cause, she said.\n\nMazibuko who runs Esteemed Businesswomen Zimbabwe, Mr and Miss Rural Zimbabwe and Mental Voices Trust emphasised the significance of her initiatives. She expressed her heartfelt gratitude to everyone who has supported her vision of empowering women over the years.\n\nThis nomination is not just mine; it belongs to everyone who has walked this journey with me, she said.\n\nShe also highlighted her dedication to caring for orphaned girls, many of whom are HIV-positive and were abandoned by their families.\n\nI look after 76 rural girl orphans from their grandmothers, aunties and guardians. I assist by paying school fees and providing necessities, largely funded by the diaspora community, she explained.\n\nSome of the girls live with Mazibuko at Lavinia Gardens, where she has created a nurturing home.\n\nMazibuko shared the nomination letter from the SHE Global Awards, which reads: We are thrilled to inform you that you have been shortlisted for the prestigious SHE Global 2024 Awards. Your outstanding contributions to entrepreneurship and your role in shaping the future of women-led businesses in Africa have earned you a nomination in the following category: Social Founder of the Year.\n\nSipho Mazibuko\n\nThe SHE Awards is more than just a recognition. It is a celebration of women founders like you, who are creating jobs, inspiring change and driving economic growth through entrepreneurship. By overcoming gender-based barriers and leading with innovation, you are not only transforming your own business but also empowering other women to follow in your footsteps.\n\nVoting for the nominees is now open.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fghfghf.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com The founder of Mr and Miss Rural Zimbabwe, Esteemed Businesswomen Zimbabwe and Mental Voices Trust, Sipho Mazibuko, has been nominated for the SHE Global 2024 Awards. The non-monetary business awards ceremony for female entrepreneurs in Africa, launched in 2021, honours African women founders who create jobs, inspire change and drive economic growth […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "Government launches US$23,7million  project to curb mercury use",
            "url": "https://www.chronicle.co.zw/government-launches-us237m-project-to-curb-mercury-use/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nGOVERNMENT has launched a US$23,7 million initiative aimed at reducing mercury use in artisanal and small-scale gold mining, a sector that significantly contributes to mercury pollution globally.\n\nThe five-year planetGOLD Zimbabwe project, supported by the Global Environment Facility (GEF) and implemented by the United Nations Environment Programme (UNEP), is being executed in partnership with the international non-profit organisation IMPACT and the Government.\n\nAccording to planetGOLD, the project seeks to improve the health and livelihoods of local mining communities by reducing mercury use in artisanal mining, the largest source of mercury emissions worldwide. Zimbabwe joins a global programme implemented in 25 countries.\n\nThe planetGOLD Zimbabwe project aims to directly benefit 7 500 artisanal miners in 11 districts in Zimbabwe, reducing mercury use by 4,85 tonnes. It also seeks to promote the formalisation of the artisanal gold mining sector, increase miners access to finance, facilitate the adoption of mercury-free technologies and establish responsible and traceable gold supply chains.\n\nDuring the official launch on November 14 in Harare, stakeholders gathered for an inception workshop to discuss the projects implementation and how it will contribute to creating a more sustainable artisanal gold mining sector.\n\nIn his keynote address, acting Permanent Secretary in the Ministry of Environment, Climate, and Wildlife, Mr Edward Samuriwo, said Zimbabwe is committed to the Minamata Convention on Mercury.\n\nThe country ratified the convention in 2021 and has committed to implementing its National Action Plan to eliminate mercury use in artisanal gold mining.\n\nIMPACT deputy executive director, Mr Yann Lebrat, echoed these sentiments, highlighting the projects role in fostering sustainable change.\n\nThrough the launch of the planetGOLD project, Zimbabwe moves towards more responsible artisanal gold mining. We look forward to working with all stakeholders to create a sustainable change in the sector, he said.\n\nZimbabwe Miners Federation (ZMF) chief executive officer, Mr Wellington Takavarasha, praised the initiative, saying there is a need for awareness about the dangers of mercury and available alternatives among small-scale miners.\n\nWe are grateful for this move because many countries are going green and the use of mercury has been a topical issue the world over. So far, nine countries have benefited from this project with Zimbabwe becoming the 10th, said Mr Takavarasha.\n\nAwareness will help miners transition to alternatives, especially as mercury production is expected to cease globally in the next decade.\n\nMercury is a toxic chemical used to extract gold from ore. It poses severe health risks, including damage to the lungs, skin, and eyes, and can bio-accumulate in the food chain, affecting ecosystems far from its source.\n\nIn Zimbabwe, over 300 000 people work in artisanal gold mining, which contributes more than 40 percent of the countrys mineral exports. However, 96 percent of artisanal gold mining sites use mercury, releasing over 24 tonnes of the chemical annually.\n\nMiners often work without protective equipment, exposing them to toxic fumes. The planetGOLD Zimbabwe project aims to address these challenges by providing resources, technology, and education to artisanal miners, paving the way for a greener and more sustainable mining sector.  @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Mr-Wellington-Takavarasha.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com GOVERNMENT has launched a US$23,7 million initiative aimed at reducing mercury use in artisanal and small-scale gold mining, a sector that significantly contributes to mercury pollution globally. The five-year planetGOLD Zimbabwe project, supported by the Global Environment Facility (GEF) and implemented by the United Nations Environment Programme (UNEP), is being executed in […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "Disciplinarian mum contemplated suicide in prison",
            "url": "https://www.chronicle.co.zw/disciplinarian-mum-contemplated-suicide-in-prison/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nMS Panashe Mpofu spent a month of despair while incarcerated at Mlondolozi Prison in the Khami Maximum Prison Complex. She received a two-year sentence for disciplining four teenagers, including her son, who hosted a Vuzu party during school hours.\n\nThis punishment pushed her to her lowest point, and she even contemplated suicide as she could not understand how her actions, as a caring mother, could extend to such a harsh penalty.\n\nMs Mpofu is a single mother residing in the New Luveve suburb of Bulawayo.\n\nShe was initially given a five-year sentence, with three years suspended, for disciplining the Form Two teenagers and had been condemned to Mlondolozi Prison since November 14.\n\nPanashe Mpofu\n\nHowever, Bulawayo High Court judge, Justice Evangelista Kabasa, reviewed her case and ordered her release on Monday. In an interview with Chronicle from her New Luveve home, Ms Mpofu reflected on the events that led to her arrest.\n\nI had just returned from an afternoon church service when I was told my son and his friends were drinking alcohol and watching X-rated movies at a neighbours house. I rushed to the house and found members of the community already there. In a fit of rage, I picked up a stick and disciplined them, she said.\n\nThe teenagers, including her 15-year-old son, were all under 17. Ms Mpofu insists she acted as any concerned parent would, ensuring no one was harmed.\n\nI dragged my son home so he could sleep off the alcohol. The next thing Luveve police called me to the station. I spent a night in the cells and was taken to West Commonage Court where I was sentenced without being allowed to call witnesses who were present when I disciplined the children, she said.\n\nMs Mpofu was accused of severely injuring the girl who hosted the party. She offered to pay for the girls medical bill to secure a public hospital report but the magistrate rejected her request.\n\nPanashe Mpofu\n\nThe magistrate said I was lucky to get two years because he could have sentenced me to eight. I felt like I was dreaming when the sentence was passed, she said.Ms Mpofu said she struggled to cope at Mlondolozi Prison.\n\nWe would work in the gardens, and I often thought of ending my life. I know suicide is not the answer, but I felt like my life was over, she said. Her month-long incarceration also cost her a job as a general hand at a local company, leaving her uncertain about how she will provide for her 15-year-old son.\n\nIm a single mother trying to give my son a better life. Losing my job means I dont know where to start. I have to pay school fees, rent and put food on the table, she said. Ms Mpofus release came after Justice Kabasa reviewed her case.\n\nDespite her ordeal, Ms Mpofu expressed gratitude to those who supported her. To everyone who stood by me, I cannot thank you enough. Your prayers and words of encouragement meant a lot to me, she said. As she begins rebuilding her life, Ms Mpofu hopes to put the traumatic experience behind her and focus on providing for her son.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghjghjghjh.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com MS Panashe Mpofu spent a month of despair while incarcerated at Mlondolozi Prison in the Khami Maximum Prison Complex. She received a two-year sentence for disciplining four teenagers, including her son, who hosted a Vuzu party during school hours. This punishment pushed her to her lowest point, and she even contemplated suicide […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "Families of children with hydrocephalus share their struggles",
            "url": "https://www.chronicle.co.zw/families-of-children-with-hydrocephalus-share-their-struggles/",
            "content": "Trish Mukwazo,[emailprotected]\n\nMRS Nontando Muchikura from Nguboyenja suburb in Bulawayo was overwhelmed with emotion as she shared the story of her son, Simbarashe, who has been battling hydrocephalus and spina bifida right from birth.\n\nHydrocephalus is a condition wherein there is an excessive build-up of fluids in the brain while spina bifida is a congenital disability that occurs when the spinal cord doesnt develop properly.\n\nUnfortunately, due to these conditions, Simbarashe has been wheelchair-bound for his entire life and has had to face discrimination and stigma from society.Initially, Mrs Muchikura struggled to come to terms with her sons condition and was in denial but with her husbands unwavering support, she finally accepted it.\n\nHowever, even after accepting it, the family struggles to meet Simbarashes basic needs, such as diapers and soap, due to financial constraints. This is a challenge the family faces on a daily basis.\n\nHydrocephalus belated commemorations at MpiloHospital\n\nMy son is very intelligent. A psychologist once recommended enrolling him at King George School, but due to financial constraints, I had to enrol him in a local school in Nguboyenja, she said.\n\nMrs Muchikura said managing her sons health has been an uphill battle due to the high cost of medication and her inability to secure employment.\n\nMs Skhululiwe Ncube, another mother, shared her story of raising her seven-year-old son, who was also diagnosed with spina bifida. Her son has used a wheelchair and diapers his entire life.\n\nWeve faced all forms of discrimination. Some landlords have denied us accommodation because they cant accept my sons condition, she said. Ms Ncube said her son has never attended school due to his condition, and she struggles to find work because there is no one to look after him.\n\nWhenever I go out to earn a living, I have to take my son with me. We seek a society that is inclusive and doesnt discriminate against children like mine, she said.To support children living with these conditions, the Hydrocephalus and Spina Bifida Foundation, in collaboration with Matabeleland Nomads, yesterday donated 44 shunts worth US$5 000 to Mpilo Central Hospitals paediatric ward during the belated International Spina Bifido and hydrocephalus Day commemorations.\n\nSpeaking at the event, Pastor Lynn Ndlovu, founder of the Hydrocephalus and Spina Bifida Foundation, said the donation coincided with Hydrocephalus Awareness Day, which highlights the need for accessible healthcare for children with neurological conditions.\n\nEvery child deserves the right to treatment, care and a chance to thrive. My personal journey began when I met a brilliant child with hydrocephalus who, unfortunately, passed away due to a lack of resources and proper care. That experience ignited my passion to make a difference, she said.\n\nPastor Ndlovu commended Mpilo Hospital for its partnership, which has been instrumental in improving the lives of affected children. Our collaboration is driving us closer to finding better treatments and improving care for these children, she said.\n\nHydrocephalus and Spina Bifida Foundations research director, Professor Greanious Alfred, said he partnered with the foundation to serve humanity and make life better for those battling the condition.\n\nAs we continue to work together, our goal is to achieve our shared objectives and create a positive impact in the community and Im thrilled to see our collaboration bearing fruit, he said.\n\nWere committed to allocating resources to mitigate the challenges posed by hydrocephalus. We appreciate the efforts of the association in setting aside funds specifically for this condition. Its rare to find dedicated support, and were grateful for this initiative.\n\nChildren diagnosed with these conditions in future stand to benefit from ongoing research conducted by the National University of Science and Technology (Nust) Faculty of Medicine, which is working to develop improved treatments.\n\nBulawayo Provincial Affairs and Devolution Minister, Judith Ncube, praised the foundations efforts in a speech read on her behalf by Ms Boetsoarelo Noko, director of provincial co-ordination in her office.\n\nThe Hydrocephalus Foundation has made significant strides in improving healthcare services for children with hydrocephalus in the southwest region of Zimbabwe. Their work aligns with the Governments vision to leave no one behind, she said.\n\nMinister Ncube commended the foundation for sourcing essential medical equipment, renovating facilities and providing ongoing support to children across the country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgffff.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com MRS Nontando Muchikura from Nguboyenja suburb in Bulawayo was overwhelmed with emotion as she shared the story of her son, Simbarashe, who has been battling hydrocephalus and spina bifida right from birth. Hydrocephalus is a condition wherein there is an excessive build-up of fluids in the brain while spina bifida is a […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "COMMENT: Let us have competent and dedicated people in our  football administration",
            "url": "https://www.chronicle.co.zw/comment-let-us-have-competent-and-dedicated-people-in-our-football-administration/",
            "content": "THE concerns raised by veteran football administrator Vincent Pamire over the large number of candidates vying for posts in the new Zifa board should be taken seriously.\n\nPamire has warned that anti-football elements may infiltrate the countrys number one sport and we should not allow this to happen.\n\nFootball is a sport loved and adored by millions of Zimbabweans, and it is essential that the right individuals are in control of the sport. We cannot allow individuals with ulterior motives and hidden agendas to hijack the beautiful game.\n\nPamires warning highlights the importance of having competent and dedicated individuals in football administration. We must ensure that those elected to the new Zifa board are committed to promoting the growth and development of the game in Zimbabwe.\n\nIt is also important to note that those who have contributed to the growth and development of football such as former players and coaches should not just sit back and watch.\n\nThey should have been actively participating in the selection process and vocal in their support of individuals who have the best interests of the game at heart.\n\nThe warning by Pamire to chase away those with ulterior motives should be taken seriously. Football stakeholders should unite in identifying these individuals and do everything in their power to keep them away from Zifa.\n\nHowever, we also need to remind Pamire that there is no special clique ordained to run football in our country. People with new ideas must be allowed to plant more fruit trees to increase the fruit yield.\n\nIt is clear that there must be transparency in the selection process and football lovers need to have confidence in the individuals who will be elected to oversee the game.\n\nIt is crucial that the Zifa board selection process is free from any interference. The individuals elected must be accountable to the public in every sense of the word, as their decisions will affect the growth and development of our football.\n\nIt is no secret that our football standards have been dropping alarmingly in recent years, and it is high time that competent and capable individuals take charge and steer the game towards a brighter future.\n\nThis election should not be about popularity or volume but about merit so that only the best-qualified individuals will be tasked with driving the growth of our game.\n\nFootball is a unifying sport that brings together people from all walks of life. It has the power to unite the nation, and it is important that we do not allow it to be manipulated for personal gain.\n\nLet us, therefore, ensure that our football is run by the best and remains a unifying sport that brings the nation together.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Vincent-Pamire.jpg",
            "description": "THE concerns raised by veteran football administrator Vincent Pamire over the large number of candidates vying for posts in the new Zifa board should be taken seriously. Pamire has warned that “anti-football elements” may infiltrate the country’s number one sport and we should not allow this to happen. Football is a sport loved and adored […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "Holiday Inn spreads festive cheer to Percy Ibbotson Children’s Home",
            "url": "https://www.chronicle.co.zw/holiday-inn-spreads-festive-cheer-to-percy-ibbotson-childrens-home/",
            "content": "Trish Mukwazo,[emailprotected]\n\nHOLIDAY Inn showed their heart-warming generosity by organising a special luncheon and donating food hampers to over 80 juveniles from Percy Ibbotson Childrens Home in Luveve, Bulawayo.\n\nThis thoughtful gesture was part of the Mayors Christmas Cheer Fund to bring joy and happiness to the less fortunate during this festive season. The hotel also donated linen and toiletries to the girls and staff at the Luveve Training School for Girls.\n\nMs Ntokozo Ndlovu, acting superintendent of Luveve Training School for Girls, expressed her gratitude for the donations. She said the items would go a long way in alleviating some of the institutions challenges.\n\nWe are a rehabilitation centre catering for children in contact with the law, which often leads to discrimination from communities. As a result, many donors shy away from supporting us. This donation from Holiday Inn and the Mayors Christmas Cheer Fund is a beacon of hope for our children, helping them feel loved and valued, she said.\n\nMs Ndlovu stated the dire challenges faced by the institution, including a lack of basic necessities, infrastructure issues and a critical water shortage that has persisted for three months.\n\nOur children are engaged in educational programmes, including vocational training in gardening, poultry and sewing. However, these programmes are currently non-functional due to financial constraints and water shortages, she said.\n\nBulawayo mayor, Councillor David Coltart, stressed the importance of community support for vulnerable children, particularly during the festive season.\n\nThe children at these institutions are among the most vulnerable in our society. As a community, we must show them love and compassion. Many families have been affected by the El Nio-induced drought and are facing hunger and hardship. Its our duty to assist the most vulnerable, he said.\n\nClr Coltart commended Holiday Inn for its generosity in hosting the luncheon and providing gifts.\n\nAs a parent and grandfather, I understand the importance of nurturing and supporting young people. The food and gifts youre enjoying today are courtesy of Holiday Inn and their kindness is a testament to their commitment to our community, he said.\n\nClr Coltart also delivered an uplifting message to the children, encouraging them to remain hopeful and resilient.\n\nAs we celebrate Christmas and look to the New Year, I want to remind you that you are the future of our city and our nation. Regardless of your circumstances, you are important and special in Gods eyes. Work hard, trust in God, and He will bless you, he said.\n\nHoliday Inn general manager, Mr Nkosi Moyo, reaffirmed the hotels dedication to positively impacting the community.\n\nChristmas is a time for giving, and we are thrilled to share this special occasion with you. We hope our gifts and the lunch prepared for you will bring joy and create lasting memories, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgfgfggf.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com HOLIDAY Inn showed their heart-warming generosity by organising a special luncheon and donating food hampers to over 80 juveniles from Percy Ibbotson Children’s Home in Luveve, Bulawayo. This thoughtful gesture was part of the Mayor’s Christmas Cheer Fund to bring joy and happiness to the less fortunate during this festive season. The […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        },
        {
            "title": "Holiday road safety campaign launched",
            "url": "https://www.chronicle.co.zw/holiday-road-safety-campaign-launched/",
            "content": "Freeman Razemba, Harare Bureau\n\nAS the festive season approaches, law enforcement agencies are gearing up for a significant deployment on the countrys major roads to ensure compliance with traffic regulations.\n\nSenior police officers, alongside the Ministry of Transport and Infrastructural Development, will take decisive action against motorists who flout traffic rules.\n\nAt yesterdays launch of the 2024 festive season road safety awareness campaign, it was announced that officers from the Vehicle Inspection Department, Road Motor Transportation, and the Traffic Safety Council of Zimbabwe, will be supported by the Zimbabwe Republic Police.\n\nThis initiative aims to curb reckless driving and enhance road safety during a period known for increased travel. The Police General Headquarters will also deploy senior officers to monitor ground operations across the country.\n\nThese officers will ensure that any issues arising from roadblock management are addressed promptly.\n\nTransport and Infrastructural Development Minister, Felix Mhona, said they will deal decisively with any situations they believe have not been properly handled by the officers manning roadblocks.\n\nThis underscores the Governments commitment to ensuring road safety during the busy festive period.\n\nThe theme for this years campaign, Normal speed meets every need, emphasises the critical importance of adhering to safe driving speeds and fostering responsible driving attitudes.\n\nMinister Mhona said there was a need for motorists and public transporters to drive to arrive alive during the festive season, which is synonymous with excessive excitement, as people celebrate the gift of life and reunions with relatives and friends.\n\nHe warned that heightened road traffic densities and competition for space on highways can expose travellers to significant risks of road accidents, particularly during the peak of the rainy season.\n\nReflecting on road traffic statistics from previous festive seasons, Minister Mhona noted a positive trend.\n\nIt gives hope to note that we achieved a reduction in the total number of road traffic accidents from 2 689 in the 2022 festive season to 2 228 in the 2023 festive season, he said.\n\nHowever, he warned that road crashes lead to injuries and fatalities, which burden families and the health sector, creating a strain on the economy.\n\nResearch indicates that Africa is the least motorised continent, possessing only 2 percent of the global vehicle population while contributing to 16 percent of global road traffic fatalities.\n\nTo combat this alarming trend, the Government has been collaborating with neighbouring countries to raise cross-border road safety awareness, including the recent Cross Alive Campaign launched with South Africa.\n\nMinister Mhona urged drivers to maintain vigilance and adhere to traffic regulations, listing key behaviours to avoid, namely speeding, overloading, neglecting road signs, multi-tasking while driving, and operating defective vehicles.\n\nThe police were under strict instruction to arrest and refer for prosecution motorists who violate laid down regulations, he said.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe said law enforcement is important to ensure all vehicles on the road are roadworthy. He expressed concern regarding the high accident rates and the need for accountability among police officers manning roadblocks.\n\nI have discussed this issue with the Commissioner General of Police and senior police officers and clearly expressed that from now onwards, such incidents must be thoroughly investigated, he said.\n\nTraffic Safety Council of Zimbabwes board chairperson, Mr Kura Sibanda, said the poor behaviour displayed on roads has had a direct and indirect impact on road safety.\n\nHe highlighted the opportunity to save lives by addressing key risk factors, such as speeding and inadequate vehicle maintenance.\n\nMaramba-Pfungwe legislator Cde Tichaona Karimazondo, who is a member of the Parliamentary Portfolio Committee on Transport and Infrastructural Development, urged drivers to exercise caution and obey traffic rules.\n\nTogether, we can implement better road infrastructure, promote stricter law enforcement, and ensure that road safety education becomes an integral part of our curricula, he said.\n\nAs the festive season approaches, it is crucial for all stakeholders including Government institutions, law enforcement agencies, non-governmental organisations and the private sector, to collaborate in promoting road safety.\n\nChairman of the Zimbabwe Public Transport Organisation Dr Sam Nhanhanga, called on everyone to join us in this campaign. Government and law enforcement agencies are taking significant measures to promote road safety and reduce traffic-related incidents.\n\nBy fostering a culture of compliance and responsible driving, the aim is to protect lives and minimise the burden of road accidents on families and the economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/yjuyujyy.jpg",
            "description": "Freeman Razemba, Harare Bureau AS the festive season approaches, law enforcement agencies are gearing up for a significant deployment on the country’s major roads to ensure compliance with traffic regulations. Senior police officers, alongside the Ministry of Transport and Infrastructural Development, will take decisive action against motorists who flout traffic rules. At yesterday’s launch of […]",
            "time": "06:30",
            "date": "19 Dec 2024"
        }
    ]
}