{
    "news": [
        {
            "title": "Zimpapers hosts Festive Christmas Cheer Lunch for Bulawayo Orphanages",
            "url": "https://www.chronicle.co.zw/zimpapers-hosts-festive-christmas-cheer-lunch-for-bulawayo-orphanages/",
            "content": "Online writerBulawayo,  In the spirit of giving and festive joy, Zimpapers will bring smiles to the faces of 300 orphaned children in Bulawayo with a Christmas Cheer Lunch at Kings Kraal tomorrow .\n\nThe event, co-hosted by the Office of the Mayor of Bulawayo, is a collaborative Corporate Social Responsibility (CSR) initiative aimed at spreading holiday cheer to vulnerable children from various local orphanages.\n\nThe festive gathering will feature a variety of Christmas-themed activities, including games, gift distributions, and a delicious lunch provided by Kings Kraal. Participating partners include Nova Inflatables, which will set up jumping castles; Yanna Events for event coordination; and Wood Affairs for outdoor seating and a stretch tent. Contributing to the festive feast are Tryies Cakes, Lobels, Cheeseman, Schweppes, and National Foods, offering biscuits, sweets, yoghurt, juices, and snacks. Econet will also play a key role in supporting the initiative.\n\nThe event underscores Zimpapers commitment to giving back to the community, particularly during the holiday season. Christmas is a time of joy and togetherness, and we are honoured to create a memorable experience for these children, read a Zimpapers statement.\n\nLogistical arrangements for the event include venue decoration, sound and music equipment, and professional photography to capture the days highlights. Zimpapers media channels have been actively promoting the initiative to raise awareness and inspire further community support.\n\nThrough this initiative, Zimpapers and its partners aim to uplift the spirits of orphaned children, foster a sense of belonging, and enhance their well-being during the festive season. The event also reflects Zimpapers dedication to social responsibility and community engagement.\n\nThe Christmas Cheer Lunch is expected to leave a lasting impact on the children and highlight the importance of collaborative efforts in creating a brighter future for those in need.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/02/zimpapers.jpg",
            "description": "Online writer Bulawayo, – In the spirit of giving and festive joy, Zimpapers will bring smiles to the faces of 300 orphaned children in Bulawayo with a Christmas Cheer Lunch at King’s Kraal tomorrow . The event, co-hosted by the Office of the Mayor of Bulawayo, is a collaborative Corporate Social Responsibility (CSR) initiative aimed […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "Bulawayo City Council forced to benchmark 2025 budget to 2017 tariffs",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-forced-to-benchmark-2025-budget-to-2017-tariffs/",
            "content": "Sikhumbuzo Moyo[emailprotected]\n\nBULAWAYO City Councils yet-to-be-approved 2025 budget is now a nullity after an all-stakeholders committee, whose mandate is to come up with a new budget based on the 2017 tariffs was set up today.\n\nBCC stakeholders meeting on exorbitant tariffs\n\nThe new committee was set up during a meeting held at the council chambers between the local authority, representatives of the Confederation of Zimbabwe Industries (CZI), Zimbabwe National Chamber of Commerce (ZNCC), the two major residents associations and was chaired by the Ministry of Local Government and Public Works director of local authorities inspectorate Ms Priscillar Mudzinge.It is composed of captains of industry, residents associations, tourism players and tertiary institutions and was given a one-week timeline up to December 20 to come up with a revised budget before presenting it on January 7 next year.\n\nBCC has been under siege from rate payers who accused the local authority of using an incorrect formula indexing the 2022 and 2023 tariffs to the United States dollar that resulted in exorbitant tariffs.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/u7pl.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw BULAWAYO City Council’s yet-to-be-approved 2025 budget is now a nullity after an all-stakeholders committee, whose mandate is to come up with a new budget based on the 2017 tariffs was set up today. The new committee was set up during a meeting held at the council chambers between the local authority, representatives […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "Mbanje transporter jailed 10 years",
            "url": "https://www.chronicle.co.zw/mbanje-transporter-jailed-10-years/",
            "content": "Thupeyo Muleya Beitbridge Bureau\n\nA 32-YEAR-OLD truck driver from Beitbridge has been sentenced to 10 years imprisonment after he was caught transporting 78 kgs of Mbanje/cannabis in a South African registered commercial truck.Tapson Madziyanise who is employed by Docfin Trading was convicted on his own plea of guilty to contravening a section of the Dangerous Drugs Act when he appeared before Beitbridge resident magistrate Mr Takudzwa Gwazemba on Thursday.His accomplice Never Ndambakuwa is set to stand trial separately before the same magistrate.Madziyanise was left with nine years imprisonment after Mr Gwazemba conditionally suspended one year of the 10-year sentence for five years.Prosecuting, Mr Ronald Mugwagwa said on December 10, at around 1030 am, Madziyanise entered his employers truck stop in Beitbridge driving a South African registered commercial truck.The court heard that a search of the truck was conducted by a security guard who was on duty leading to the discovery of three green sacks which were loaded in the trucks trailer.The guard then informed the police who rushed to the scene where they were offloaded leading to the arrest of Madziyanise and Ndambakuwa.The three sacks were taken for weighing and it was discovered they contained Mbanje valued at US$7 8000.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2017/08/Man_Arrested.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 32-YEAR-OLD truck driver from Beitbridge has been sentenced to 10 years imprisonment after he was caught transporting 78 kgs of Mbanje/cannabis in a South African registered commercial truck. Tapson Madziyanise who is employed by Docfin Trading was convicted on his own plea of guilty to contravening a section of the […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "Zimra to engage stakeholders over tax compliance",
            "url": "https://www.chronicle.co.zw/zimra-to-engage-stakeholders-over-tax-compliance/",
            "content": "Sikhulekelani Moyo[emailprotected]The Zimbabwe Revenue Authority (Zimra) is set to engage taxpayers to address tax compliance across all tax categories.Some of the stakeholders include churches, and all subsectors of the construction sector, where the revenue authority has already published notices to inform them about the engagements.In a Public Notice 98 of 2024, Zimra said this forum is part of Zimras ongoing efforts to promote transparency and provide compliance support.The date and venue of the engagement will be communicated in due course, reads the notice.Churches are reminded of the following important tax guidelines:The following types of income streams are exempt from income tax: donations, tithes, offerings, and contributions.The authority said Non-Trading Receipts include any income that does not arise from trade or investment activities conducted by or on behalf of the church or its institutions.Income derived from trading activities is subject to income tax. Examples of taxable income include but are not limited to proceeds from the sale of church literature, books, or music, revenue from the sale of church-branded merchandise (e.g., apparel, anointing oils, artefacts, etc.), income from the sale of meals, clothing, or similar items.Additionally, such sales may attract value-added tax (VAT) depending on the sales thresholds.Zimra also reminds all taxpayers to register for all the applicable taxes and submit any outstanding returns as soon as possible.They said timely submission of returns and payments helps avoid penalties, interest and litigation.By staying compliant, you contribute to building a stronger and more sustainable economy, said Zimra.@SikhulekalaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/ZIMRA.jpg",
            "description": "Sikhulekelani Moyo mskhulekelani16@gmail.com The Zimbabwe Revenue Authority (Zimra) is set to engage taxpayers to address tax compliance across all tax categories. Some of the stakeholders include churches, and all subsectors of the construction sector, where the revenue authority has already published notices to inform them about the engagements. In a Public Notice 98 of 2024, […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "President Mnangagwa celebrates road resurfacing , promises continued development under Second Republic",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-celebrates-road-resurfacing-promises-continued-development-under-second-republic/",
            "content": "Online WriterIN a significant step towards enhancing infrastructure in Zimbabwe, President Emmerson Mnangagwa unveiled a plaque marking the reopening of the resurfaced Shurugwi-Mhandamabwe Road, a project aimed at revitaliing local communities and boosting economic growth. The unveiling took place in President Mnangagwas childhood neighbourhood, where he recalled the dire state of roads and social amenities during his youth.\n\nDuring a brief interview following the ceremony, President Mnangagwa expressed his enthusiasm for the progress achieved under the Second Republic. I am happy with the milestones being registered, he said, highlighting the Governments commitment to infrastructure development as a catalyst for sustainable economic growth.\n\nThe road project, completed in partnership with local contractor Road Trackers Construction (RTC), is part of the Governments broader infrastructure strategy, which aims to enhance connectivity and productivity across various sectors. President Mnangagwa emphasised that improving infrastructure is pivotal for the countrys Vision 2030, which seeks to transform Zimbabwe into a middle-income economy.\n\nThis initiative reflects the Governments focus on addressing long-standing issues related to rural infrastructure, which has historically hindered access to education and essential services. President Mnangagwa noted that the area previously had insufficient educational facilities, with schools located in distant districts.\n\nAs the country grapples with economic challenges, the emphasis on infrastructural improvements signifies a renewed commitment to uplift ordinary citizens and foster community development. The successful completion of this project could serve as a model for future initiatives aimed at enhancing the quality of life for Zimbabweans across the nation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/4rb.jpg",
            "description": "Online Writer IN a significant step towards enhancing infrastructure in Zimbabwe, President Emmerson Mnangagwa unveiled a plaque marking the reopening of the resurfaced Shurugwi-Mhandamabwe Road, a project aimed at revitaliing local communities and boosting economic growth. The unveiling took place in President Mnangagwa’s childhood neighbourhood, where he recalled the dire state of roads and social […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "President Mnangagwa to commission resurfaced Shurugwi-Mhandamabwe Highway, boosting regional connectivity",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-to-commission-resurfaced-shurugwi-mhandamabwe-highway-boosting-regional-connectivity/",
            "content": "Online WriterSHURUGWI, Zimbabwe  President Emmerson Mnangagwa has arrived in Shurugwi to officially commission the newly resurfaced Shurugwi-Mhandamabwe Highway, a significant milestone in Zimbabwes infrastructural development under the National Development Strategy 1.\n\nThis vital road connects Beitbridge with key border posts, including Chirundu and Nyamapanda, enhancing regional trade and connectivity.The President is set to unveil a plaque at Chachacha Business Centre, marking the commencement of the highways use, before proceeding to Mlandapi Business Centre to deliver his address. The resurfacing of the highway is part of the Second Republics broader commitment to stimulate economic growth through improved infrastructure, which is critical for facilitating movement and commerce across the region.\n\nPresident Mnangagwas focus on infrastructure reflects a strategic vision to bolster Zimbabwes economy by enhancing transport networks that support both local and international trade. The commissioning event is expected to draw attention to the Governments efforts in rebuilding and modernising the nations road systems, which are essential for connecting communities and fostering economic development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/zxzx.jpg",
            "description": "Online Writer SHURUGWI, Zimbabwe – President Emmerson Mnangagwa has arrived in Shurugwi to officially commission the newly resurfaced Shurugwi-Mhandamabwe Highway, a significant milestone in Zimbabwe’s infrastructural development under the National Development Strategy 1. This vital road connects Beitbridge with key border posts, including Chirundu and Nyamapanda, enhancing regional trade and connectivity. The President is set […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "Father Mukonori urges young politicians to embrace mediation and dialogue for lasting peace",
            "url": "https://www.chronicle.co.zw/father-mukonori-urges-young-politicians-to-embrace-mediation-and-dialogue-for-lasting-peace/",
            "content": "Bongani Ndlovu, Online Reporter\n\nFATHER Fidelis Mukonori has emphasised the importance of mediation, negotiation and dialogue as essential skills for young people in politics.\n\nHe said this during the launch of the Youth Council for Peace and Development at a local hotel in Bulawayo.\n\nThe launch was hosted by 4-H Zimbabwe Foundation and brought together youth from 11 political parties such as ZANU-PF, MDC Alliance, CCC, DOP, NCA, Free Zim, UANC, NPC, ZIPP, UZA and ZCPD.\n\nIn his remarks about the importance of mediation and sustainable dialogue in the National Peace Building process, Father Mukonori said these skills are crucial for fostering sustained peace and preventing conflict in the country.\n\nYoung people must develop the aforementioned skills and understand your role in the building of sustainable peace and also actively partake in local and national peace-building initiatives, said Father Mukonori.\n\nConsidering mediation, negotiation and dialogue as necessary skills that young people in politics need. So there is sustained peace and absence of conflict in the country.\n\nFormer National Peace and Reconciliation Commissioner Dr Tinashe Rukuni, Zimbabwes Attorney General Mrs Virginia Mabiza (represented by the Executive Secretary Mr Johane Gandiwa) and Zimbabwe National Elders Forum Board member Father Fidelis Mukonori will attend the launch.\n\nThis ground-breaking initiative seeks to foster dialogue, promote peaceful resolutions to challenges, and actively contribute to the development of Zimbabwe.\n\nThe formation of the Youth Council for Peace and Development marks a vital moment in Zimbabwes ongoing efforts to unite its citizens, regardless of political affiliation, for the common good of the country.\n\nBy providing young people with a platform to voice their concerns and collaborate on solutions, the initiative aims to pave the way for a more harmonious and prosperous Zimbabwe.\n\nThe council will bring together a wide range of youth leaders, offering them the opportunity to tackle pressing issues such as social justice, economic development, and national unity.\n\nThe focus will be on creating a sustainable and peaceful future, ensuring that Zimbabwes young people are active participants in the countrys growth.\n\nWith this initiative, Zimbabwe takes a bold step towards an inclusive, peaceful, and progressive future, with the youth at the forefront of development and conflict resolution.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/w11.jpg",
            "description": "Bongani Ndlovu, Online Reporter FATHER Fidelis Mukonori has emphasised the importance of mediation, negotiation and dialogue as essential skills for young people in politics. He said this during the launch of the Youth Council for Peace and Development at a local hotel in Bulawayo. The launch was hosted by 4-H Zimbabwe Foundation and brought together […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "Flamboyant Chipunza to spend Christmas and New Year behind bars",
            "url": "https://www.chronicle.co.zw/flamboyant-chipunza-to-spend-christmas-and-new-year-behind-bars/",
            "content": "Peter Matika[emailprotected]\n\nIN a twist that sounds more like the plot of a crime drama, suspected car thief Brighton Chipunza, the man whose name has become synonymous with high-stakes car theft, will spend the festive holidays locked up, after the court further remanded him to January 9, 2024.\n\nChipunza popularly known as Dash in the streets, is facing two counts of vehicle theft, with the first one being of a car that disappeared from a city car wash last month, while for the second he is accused of nabbing another ride, this one belonging to the well-known businessman, Mr Gift Banda.\n\nChipunzas exploits have catapulted him into an unwelcome sort of fame, with his every move closely followed by both the public and the press.\n\nBrighton Chipunza\n\nThe case of the missing car wash vehicle alone has gripped the nation, not just because of its high value, but because of the audacity of the theft.\n\nAfter all, its not every day that someone manages to swipe a car right out from under the noses of those supposed to be cleaning it.\n\nBut who is Brighton Chipunza, really?\n\nBeyond the headlines and the courtroom drama, details about the man behind the alleged crimes remain elusive.\n\nWhat drives someone to take such risks? Is it the thrill of the chase, a desperate need, or something else entirely?\n\nAs January 9 approaches, all eyes will be on the court as it decides the fate of the suspected car thief.\n\nWill Chipunza manage to clear his name, or will he be found guilty as charged?\n\nOne things for sure: this high-profile case has all the elements of a story that will be talked about for years to come.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Brighton-Chipunza-arrivesjpg.jpg",
            "description": "Peter Matika peter.matika@chronicle.co.zw IN a twist that sounds more like the plot of a crime drama, suspected car thief Brighton Chipunza, the man whose name has become synonymous with high-stakes car theft, will spend the festive holidays locked up, after the court further remanded him to January 9, 2024. Chipunza popularly known as “Dash” in […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "President Mnangagwa declares the Iron and Steel Industry a cornerstone of Zimbabwe’s Economic Revival",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-declares-the-iron-and-steel-industry-a-cornerstone-of-zimbabwes-economic-revival/",
            "content": "Patrick ChitumbaKWEKWE, Zimbabwe  President Emmerson Mnangagwa has said the Iron and Steel Industry is a cornerstone of Zimbabwes economic revival.\n\nHe said the iron and steel industry has great potential to transform Zimbabwes economy.President Mnangagwa was speaking to a gathering of industry leaders and policymakers at the Iron and Steel Indaba in kwekwe this morning.The President described the sector as the cornerstone for sustainable growth, highlighting the nations current status as the largest importer of steel products, spending over $1 billion annually.President Mnangagwa criticised the illegal sanctions that led to the closure of Zisco Steel, which he said severely impacted steel supplies in the country.He pointed to the recent arrival of Dinson Holding Company in Manhize as a transformative opportunity for the local industry, positioning it to become one of the largest steel producers in Sub-Saharan Africa.This investment is a testament to the confidence in Zimbabwes potential, President Mnangagwa said, urging stakeholders to harness the nations abundant natural resources for economic betterment.He called for a collective effort to rebuild the industry brick upon brick and stone upon stone, advocating for a robust investment strategy as part of the Vision 2030 initiative aimed at industrialising Zimbabwe.\n\nThe Presidents remarks reflect a renewed determination to revitalise local production capabilities and reduce reliance on imports, marking a significant shift in Zimbabwes economic strategy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/seqg.jpg",
            "description": "Patrick Chitumba KWEKWE, Zimbabwe – President Emmerson Mnangagwa has said the Iron and Steel Industry is a cornerstone of Zimbabwe’s economic revival. He said the iron and steel industry has great potential to transform Zimbabwe’s economy. President Mnangagwa was speaking to a gathering of industry leaders and policymakers at the Iron and Steel Indaba in […]",
            "time": "2024-12-12 21:59:29"
        },
        {
            "title": "Dinson chairman highlights growth potential of Zimbabwe’s Iron and Steel Industry",
            "url": "https://www.chronicle.co.zw/dinson-chairman-highlights-growth-potential-of-zimbabwes-iron-and-steel-industry/",
            "content": "Online writerKWEKWE, Zimbabwe  The chairman of Zhejiang Dinson Holding Company Limited, Mr Chen Shangsong, emphasised the promising growth trajectory of Zimbabwes iron and steel industry during the Iron and Steel Indaba held at the King Solomon Hotel today.He attributed the establishment of Dinson in Zimbabwe to the countrys open for business policy under President Emmerson Mnangagwa.\n\nMr Chen said Zimbabwe is on track to becoming an upper middle-income economy by 2030, driven by the resurgence of the iron and steel sector. This development is seen as crucial for economic growth and job creation, with the industry poised to play a significant role in enhancing the nations industrial capacity.\n\nThe remarks come as industry leaders gather to explore investment opportunities and strategies aimed at revitalising a sector that has faced numerous challenges in recent years. The optimism surrounding the iron and steel industry reflects a broader commitment to economic development and sustainability in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/7OI6O.jpg",
            "description": "Online writer KWEKWE, Zimbabwe – The chairman of Zhejiang Dinson Holding Company Limited, Mr Chen Shangsong, emphasised the promising growth trajectory of Zimbabwe’s iron and steel industry during the Iron and Steel Indaba held at the King Solomon Hotel today. He attributed the establishment of Dinson in Zimbabwe to the country’s “open for business” policy […]",
            "time": "2024-12-12 21:59:29"
        }
    ]
}