{
    "news": [
        {
            "title": "Three jailed 75 Years after Masvingo robbery spree",
            "url": "https://www.chronicle.co.zw/three-jailed-75-years-after-masvingo-robbery-spree/",
            "content": "Trish Mukwazo,[emailprotected]\n\nA notorious group of three men who went on a robbery spree armed with weapons, targeting multiple victims and stealing phones, cash, a vehicle, and electronics, and who are facing an additional charge of attempted murder, have each been sentenced to 75 years in prison.\n\nVusumuzi Bhebhe (20), Yasin Joseph (21), and Never Simbakurasha appeared at Masvingo Magistrates Court charged with 19 counts of robbery.\n\nBhebhe was initially sentenced to 95 years, with 20 years suspended for five years, while Joseph and Simbakurasha were each sentenced to 125 years, with 50 years suspended for five years.\n\nThe trio committed the robberies in Victoria Range, Masvingo, between 9 and 15 January this year.\n\nAccording to the National Prosecuting Authority (NPA), the trio committed the offences armed with machetes, iron bars, and catapults, targeting multiple victims and stealing mobile phones, cash, electronics, and a vehicle.\n\nThey also faced an additional charge of attempted murder, the NPA said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/armed-robbers-used-gun-robbery-600nw-1495712093-600x380.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com A notorious group of three men who went on a robbery spree armed with weapons, targeting multiple victims and stealing phones, cash, a vehicle, and electronics, and who are facing an additional charge of attempted murder, have each been sentenced to 75 years in prison. Vusumuzi Bhebhe (20), Yasin Joseph (21), and Never […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "Man strangled to death in front of his son",
            "url": "https://www.chronicle.co.zw/man-strangled-to-death-in-front-of-his-son/",
            "content": "Trish Mukwazo,[emailprotected]\n\nThe police are investigating a murder that occurred along Randun Road, Upper Rangemore, Bulawayo, where a 50-year-old man died.\n\nThe deceased, Albert Tshuma and his son were travelling in a Honda CRV when they decided to offer a lift to an unknown suspect. The suspect then produced a firearm and instructed them to follow an unregistered BMW car that was in front of them.\n\nIn a statement on X (formerly Twitter), the police confirmed the incident, saying the suspect strangled the deceased with a seatbelt after the car ran out of fuel, and then drove off in the BMW.\n\nSubsequently, the deceased passed away, and his body was conveyed to a Bulawayo hospital for a post-mortem, the statement read.\n\nThe police are appealing to anyone with information to report to the nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2014/12/robbery.jpg",
            "description": "Trish Mukwazo, trishmukwazo@gmail.com The police are investigating a murder that occurred along Randun Road, Upper Rangemore, Bulawayo, where a 50-year-old man died. The deceased, Albert Tshuma and his son were travelling in a Honda CRV when they decided to offer a lift to an unknown suspect. The suspect then produced a firearm and instructed them to […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "Ex Deputy Chief Secretary Justin Mupamhanga declared National Hero",
            "url": "https://www.chronicle.co.zw/ex-deputy-chief-secretary-justin-mupamhanga-declared-national-hero/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE late Deputy Chief Secretary in the Office of the President and Cabinet, Cde Justin Mupamhanga, has been declared a National Hero.\n\nThis was announced by Acting President Dr Constantino Chiwenga through a statement on Tuesday.\n\nMr Mupamhanga died on Tuesday morning at Arundel Clinic in Harare after a battle with diabetes and high blood pressure.\n\nIn his condolence message, Dr Chiwenga said: In recognition of his distinguished role in the struggle for Independence and in the development of our nation, especially in laying the foundations and growing the agriculture and energy sectors, His Excellency President Dr ED Mnangagwa, in consultation with the Politburo, has directed that he be accorded National Hero status.\n\nDr Chiwenga said he learned with a deep sense of grief and sadness of the passing of Cde Justin Mupamhanga at Arundel Clinic this morning after a brave fight against diabetes and high blood pressure.\n\nOn behalf of the President, Dr ED Mnangagwa, and the First Family, the nation, the ruling ZANU PF Party, the Government, and my family, I express my deepest and heartfelt condolences to the Mupamhanga family, including Amai Mupamhanga and the children, including our Deputy Minister for Youth Empowerment, Development, and Vocational Training, Hon Kuda Mupamhanga, on their saddest loss, said the Acting President.\n\nActing President Dr Constantino Chiwenga\n\nHe urged the family to derive solace from the knowledge that the nation today joins them in mourning the sad and untimely demise of Cde Mupamhanga, whom he described as an illustrious son of the soil.\n\nIn recognition of his distinguished role in the struggle for Independence and in the development of the nation, especially in laying the foundations and growing the agriculture and energy sectors, Dr Chiwenga said President ED Mnangagwa, in consultation with the Politburo, has directed that he be accorded National Hero status. May his dear soul rest in eternal peace, said Dr Chiwenga.\n\nCde Mupamhanga was a veteran of the Liberation Struggle, having joined the Zimbabwe African National Liberation Army (ZANLA) in 1975.\n\nThe late Cde Mupamhanga later played a critical role in driving the implementation of government programmes as the Deputy Chief Secretary responsible for Monitoring and Evaluation in the Office of the President.\n\nHe later held important positions in the Zimbabwe African National Union (ZANU) and ZANLA commissariat and education departments.\n\nAfter Independence, he began his civil service career in the Government in 1983 in the Economics Division of the Presidents Department, and he rose through the ranks, occupying critical Government and ministerial positions, amongst other duties.\n\nBelow is the Acting Presidents full statement:\n\nI learned with a deep sense of grief and sadness of the passing of Cde Justin Mupamhanga at Arundel Clinic this morning after a brave fight against diabetes and high blood pressure.\n\nA veteran of the Liberation Struggle who sacrificed his studies at the then University of Rhodesia in 1975 to join the Zimbabwe African National Liberation Army (ZANLA), the late Cde Mupamhanga would later play a critical role in driving the implementation of government programmes as the Deputy Chief Secretary responsible for Monitoring and Evaluation in the Office of the President and Cabinet, working under the then Chief Secretary, Dr MJM Sibanda.\n\nHe oversaw numerous strategic and key government programmes in agriculture, energy, and infrastructure development. He was my point man for programmes that we implemented to improve development in the Kanyemba area of Mbire District, in Mashonaland Central Province.\n\nHe was a fireball workhorse and go-getter who, despite suffering a stroke, continued to drive government programmes and projects with conviction, zeal, and determination.\n\nCde Mupamhanga joined the Liberation Struggle in Mozambique and was allowed to complete his university studies soon after finishing his initial military training. He later held important positions in the Zimbabwe African National Union (ZANU) and ZANLA commissariat and education departments.\n\nAfter Independence, he began his civil service career in the Government in 1983 in the Economics Division of the Presidents Department. He rose through the ranks, first establishing and heading the Economics Branch, serving as Minister Counsellor at our Diplomatic Mission in London, United Kingdom, and later being elevated to the position of Deputy Director in the Presidents Department, then under His Excellency President Dr ED Mnangagwa, who was the Minister responsible for State Security.\n\nIn times of the El Nio-induced droughts that have from time to time devastated the Southern African region, Cde Mupamhanga was part of a Taskforce that included the then Air Force Commander, Air Marshal Perrance Shiri, Major General Amoth Chimombe, and Ngoni Masoka, the then Secretary for Agriculture, that was charged with the responsibility to import grain and avert hunger in the country.\n\nCde Mupamhanga was later appointed Secretary for Energy and Power Development. During his tenure as Secretary, he played a key role in the liberalisation of the fuel industry, which eliminated fuel shortages and increased participation by indigenous businesses in that sector.\n\nIn that role, he also led the restructuring of the National Oil Company of Zimbabwe. He restructured the power utility, the Zimbabwe Electricity Supply Authority (ZESA), into self-contained business units and introduced the Zimbabwe Energy Regulatory Authority.\n\nAs Deputy Chief Secretary responsible for Monitoring and Evaluation in the Office of the President and Cabinet, Cde Mupamhanga oversaw the implementation of major projects such as the construction of the Tugwi-Mukosi Dam. The highlight of his career was as Chairman of Command Agriculture, during which he laid the framework for agricultural productivity, thus helping Zimbabwe to reclaim its breadbasket status in the region. He retired in 2019 after 36 years of dedicated service to Government and country but continued as Chairman of Kuvimba Mining House.\n\nAt a personal level, Cde Mupamhanga valued land, one of the major grievances that drove him and other youth to the struggle and carried out successful farming operations in Mashonaland Central Province.\n\nMay I, on behalf of His Excellency the President, Dr ED Mnangagwa, and the First Family, the nation, the ruling ZANU PF Party, the Government, and my family, express my deepest and heartfelt condolences to the Mupamhanga family, including Amai Mupamhanga and the children, including our Deputy Minister for Youth Empowerment, Development, and Vocational Training, Hon Kuda Mupamhanga, on their saddest loss.\n\nMay they derive solace from the knowledge that the nation today joins them in mourning the sad and untimely demise of this illustrious son of the soil.\n\nIn recognition of his distinguished role in the struggle for Independence and in the development of our nation, especially in laying the foundations and growing the agriculture and energy sectors, His Excellency President Dr ED Mnangagwa, in consultation with the Politburo, has directed that he be accorded National Hero status.\n\nMay his dear soul rest in eternal peace.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/uhijko.jpg",
            "description": "  Sikhulekelani Moyo, mskhulekelani16@gmail.com THE late Deputy Chief Secretary in the Office of the President and Cabinet, Cde Justin Mupamhanga, has been declared a National Hero. This was announced by Acting President Dr Constantino Chiwenga through a statement on Tuesday. Mr Mupamhanga died on Tuesday morning at Arundel Clinic in Harare after a battle with […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "Mzoe 7 takes well-deserved vacation after hectic festive season",
            "url": "https://www.chronicle.co.zw/mzoe-7-takes-well-deserved-vacation-after-hectic-festive-season/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nAfter a whirlwind festive season filled with performances and hosting gigs across the country, multi-talented artiste Mzoe 7 has taken a much-needed break, jetting off for a solo vacation outside Zimbabwe.\n\nKnown for his boundless energy as a musician, MC and marketing manager, Mzoe 7 had a packed schedule during the holiday season. He performed at numerous events, both in and outside Bulawayo, and shared stages with artistes from Zimbabwe and beyond. Notably, he served as the MC for major events such as the Bulawayo Shutdown and the Bulawayo Piano Festival, where he impressed audiences with his professionalism and infectious energy.\n\nReflecting on his hectic schedule before his departure, Mzoe 7 revealed his need for rest and rejuvenation.Ive been busy right through the festive season. I can even feel that my body is yearning for a rest. A holiday is needed so I can relax and get away from home. Ill be going alone and will be away for a week only, he shared.\n\nAlthough he chose to keep the destination under wraps, Mzoe 7 has been treating his fans to glimpses of his vacation on social media, sharing stunning photos from his getaway.\n\nThe break is undoubtedly well-deserved for the artiste, who has proven himself as a tireless entertainer and a dynamic force in the industry. Fans eagerly await his return, recharged and ready to take on the new year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yghj.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com After a whirlwind festive season filled with performances and hosting gigs across the country, multi-talented artiste Mzoe 7 has taken a much-needed break, jetting off for a solo vacation outside Zimbabwe. Known for his boundless energy as a musician, MC and marketing manager, Mzoe 7 had a packed schedule during the holiday […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "Mushikashika driver robbed of car at knifepoint",
            "url": "https://www.chronicle.co.zw/mushikashika-driver-robbed-of-car-at-knifepoint/",
            "content": "Midlands Bureau\n\nPOLICE in Zvishavane are appealing for information that might lead to the recovery of a stolen motor vehicle and the arrest of the suspects involved in the car-jacking case.Midlands provincial police spokesman, Inspector Emmanuel Mahoko, said the vehicle was stolen on Monday at around 9pm along Mberengwa  Zvishavane road.The complainant Malex Tafa (29) of Izaya Park, Zvishavane is a Mushikashika driver operating between Mberengwa and Zvishavane, he said.On the night in question, he was driving his white Toyota Probox motor vehicle with registration number AGG 6723 when he was approached by three unknown men who hired him to take them from Mberengwa to Zvishavane. They promised to pay US$15, he said.Upon reaching Mberengwa turn-off, Insp Mahoko said Tafa asked for the trip fare so that he could refuel and was handed over $15, he said.However, Insp Mahoko said, when they reached Oreti turn-off, one of the passengers ordered the complainant to turn right towards Oreti Business Centre.Suddenly one of the suspects who was sitting behind the driver placed an okapi knife on the complainants neck threatening to stab him if he refuses to park the motor vehicle. Tafa complied and the other suspects tied his hands and legs using cable tyres and threw him out of the car before driving away,  he said.Insp Mahoko said Tafa sustained a bruise on the neck and was treated and discharged at Zvishavane District Hospital.He said the total value of the stolen motor vehicle is US$8 500.We are appealing for information that might lead to the arrest of the perpetrators of the crime and recovery of the motor vehicle, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/MAHOKO.jpg",
            "description": "Midlands Bureau POLICE in Zvishavane are appealing for information that might lead to the recovery of a stolen motor vehicle and the arrest of the suspects involved in the car-jacking case. Midlands provincial police spokesman, Inspector Emmanuel Mahoko, said the vehicle was stolen on Monday at around 9pm along Mberengwa – Zvishavane road. “The complainant […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "Victoria Falls former Mayor Somveli Dhlamini loses appeal against conviction, sentence",
            "url": "https://www.chronicle.co.zw/victoria-falls-former-mayor-somveli-dhlamini-loses-appeal-against-conviction-sentence/",
            "content": "Online Reporter\n\nFORMER Victoria Falls Mayor Somveli Dhlaminis appeal to overturn his conviction and sentence for fraud has been dismissed by the High Court.\n\nDhlamini was sentenced to 30 months in prison by the Victoria Falls Magistrates Court in October 2023 for defrauding the Victoria Falls Town Council of US$15 000.\n\nHe sought to have his conviction quashed, arguing that it was excessively harsh and induced a sense of shock.\n\nIn his appeal, Dhlamini argued that the council suffered no significant prejudice and a fine of US$500 would have been a more appropriate punishment.\n\nThe High Court, however, upheld the lower courts decision, with Justice Munamato Mutevedzi ruling that both the conviction and sentence were appropriate.\n\nThere is, in our considered view, nothing that induces a sense of shock with the sentence imposed, Justice Mutevedzi said.\n\nIf anything, what is shocking is the leniency.\n\nBetween August 1 and 6, 2022, Dhlamini fraudulently applied for a residential stand under the Wood Road Residential Scheme using the name of Valentine Munyaradzi Maseko, a close family friend.\n\nDespite knowing that he was ineligible for the scheme, Dhlamini manipulated the process to secure stand number 1771 Wood Road in Victoria Falls.\n\nAs a result, the council suffered a direct loss of US$15 000 and faced a potential prejudice of US$66 462.75.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Somveli-Dlamini.jpg",
            "description": "Online Reporter FORMER Victoria Falls Mayor Somveli Dhlamini’s appeal to overturn his conviction and sentence for fraud has been dismissed by the High Court. Dhlamini was sentenced to 30 months in prison by the Victoria Falls Magistrates’ Court in October 2023 for defrauding the Victoria Falls Town Council of US$15 000. He sought to have […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "NEW: Man demands US$50 he spent on ex-girlfriend",
            "url": "https://www.chronicle.co.zw/new-man-demands-us50-he-spent-on-ex-girlfriend/",
            "content": "A HARARE woman on Wednesday sought legal protection from her ex-boyfriend, accusing him of harassment and physical abuse over the US$50 he spent on her while they were still dating.\n\nTendai Chawadzwera told Harare Civil Court that her former partner Takudzwa Shumba repeatedly visits her residence and her parents home, demanding repayment of US$50 he gave her for her hairdo.\n\nHe constantly visits my house and my parents house, claiming that he wants his money back, Chawadzwera said.\n\nHe gave me the money when we were still dating, and now he wants it back. I am not going to give him the money because he used me, promising that he wanted to marry me and introduce me to his parents.\n\nIn his defence, Shumba admitted to visiting Chawadzwera but argued that he only wanted his money back.\n\nI have no issue with the peace order being granted, but I just want my US$50 back, Shumba said.\n\nWe dated for a year, and I gave her the money for her hair. Now that we are no longer together, she needs to pay it back.\n\nPresiding magistrate Ms Meenal Naratam granted the peace order, instructing Shumba to cease visiting Chawadzweras home and to refrain from publicly insulting her.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gavel.jpg",
            "description": "Sharon Masocha A HARARE woman on Wednesday sought legal protection from her ex-boyfriend, accusing him of harassment and physical abuse over the US$50 he spent on her while they were still dating. Tendai Chawadzwera told Harare Civil Court that her former partner Takudzwa Shumba repeatedly visits her residence and her parents’ home, demanding repayment of […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "“Corruption undermines national interest” – Acting President Chiwenga",
            "url": "https://www.chronicle.co.zw/corruption-undermines-national-interest-acting-president-chiwenga/",
            "content": "ACTING President Dr Constantino Chiwenga has condemned corruption and unethical business practices, asserting that such actions threaten the foundational ideals of Zimbabwes liberation struggle.\n\nDr Chiwenga was speaking while presiding over the burial of national heroes Major General (Rtd) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura at the National Heroes Acre in Harare this morning.\n\nVice President Kembo Mohadi and other senior Government officials also attended the burial of the three national heroes.\n\nUnder the Second Republic, Zimbabwe is working towards achieving an upper-middle income economy by 2030, with several capital and infrastructure projects taking shape or already completed.\n\nIt is through the selfless sacrifices and dedication of the late three gallant sons of the soil that we are laying to rest today, as well as many other departed and living cadres, that Zimbabwe continues to enjoy its sovereignty, said the Dr Chiwenga.\n\nWe can only realise our vision of attaining an empowered and prosperous upper middle-income society by guarding against all forms of actions that undermine the national interest.\n\nAt the forefront is corruption and all forms of related unethical and selfish conduct in small, medium or large economic units.\n\nAny shady dealing and acts of deceit undermine what these gallant national heroes sacrificed for, said the Acting President.\n\nThe triple heroes burial was the third ever in Zimbabwes history.\n\nSuch an occasion first took place on January 26, 2021, when Lieutenant General (Rtd) Dr Sibusiso Busi Moyo, Dr Joel Biggie Matiza, and Major General (Rtd) Paradzai Zimondi were laid to rest on the same day.\n\nThe second occasion was on April 29 last year when Cde Nash Nyasha Dzimiri, Brigadier General Shadreck Vezha and Cde Tsitsi Grace Jadagu were buried at the national shrine.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-22-at-16.51.56-680x380.jpeg",
            "description": "Mukudzei Chingwere ACTING President Dr Constantino Chiwenga has condemned corruption and unethical business practices, asserting that such actions threaten the foundational ideals of Zimbabwe’s liberation struggle. Dr Chiwenga was speaking while presiding over the burial of national heroes Major General (Rtd) Solomon Siziba, Cde Chenhamo ‘Chen’ Chakezha Chimutengwende and Ambassador John Shumba Mvundura at the […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "Nama partners with Miss Deaf Zimbabwe Trust to promote inclusion in the arts",
            "url": "https://www.chronicle.co.zw/nama-partners-with-miss-deaf-zimbabwe-trust-to-promote-inclusion-in-the-arts/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nThe National Arts Merit Awards (Nama) has taken a significant step towards inclusivity by partnering with the Miss Deaf Zimbabwe Trust.\n\nThis collaboration aims to ensure that the annual awards ceremony embraces people living with disabilities and fosters greater participation in the arts.\n\nNama director Tinashe Kitchen expressed enthusiasm for the partnership, stressing its alignment with the goals of the 23rd edition of the awards.The 23rd Edition of the National Arts Merit Awards has partnered with Miss Deaf Zimbabwe Trust. Nama always strives to promote diversity, growth, and innovation in the arts. With our theme of #Afrofuturism, we believe we have the opportunity to lead the charge into the future of the arts in Zimbabwe and beyond.As such, Nama is proud to announce that this years event will make deliberate efforts to include the differently abled in its programming. Miss Deaf Zimbabwe Trust will provide sign language interpretation, performances, and model showcases for our build-up events and the main awards ceremony. This partnership will foster inclusion in the arts and encourage greater participation, in line with our theme of Afrofuturism, said Kitchen.\n\nThe collaboration is expected to set a precedent for the integration of differently-abled individuals in the arts, creating a more inclusive and diverse artistic landscape.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/02/kitchen-630x380.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com The National Arts Merit Awards (Nama) has taken a significant step towards inclusivity by partnering with the Miss Deaf Zimbabwe Trust. This collaboration aims to ensure that the annual awards ceremony embraces people living with disabilities and fosters greater participation in the arts. Nama director Tinashe Kitchen expressed enthusiasm for the partnership, […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        },
        {
            "title": "NAMA dance auditions set to uncover Zimbabwe’s next big talent",
            "url": "https://www.chronicle.co.zw/nama-dance-auditions-set-to-uncover-zimbabwes-next-big-talent/",
            "content": "Mbulelo Mpofu[emailprotected]\n\nTHE National Arts Council of Zimbabwe (NACZ) is on the hunt for the countrys most talented dancers to take centre stage at the prestigious National Arts Merit Awards (NAMA) set for March 1.\n\nIn a social media post, the organisers of the NAMAs invited aspiring dancers to audition this Friday morning.\n\nThe auditions are a chance for dancers to showcase their skills and potentially perform at the NAMA, one of Zimbabwes most celebrated annual arts events.\n\nWe are excited to discover new talent and provide a platform for dancers to shine, read a social media post.\n\nThe auditions are open to all dancers, regardless of style or experience level. We encourage anyone with a passion for dance to come and showcase their skills.\n\nThe post also noted that for those unable to attend the auditions in person, the NACZ is accepting video submissions to +263 773 395 000.\n\nThe NAMAs recognise and celebrate excellence in the arts, and the dance auditions are a key part of the event.\n\nThis year, they will be held under the theme, Afrofuturism at a venue yet to be announced in Harare.\n\nBy providing a platform for emerging talent, NACZ aims to promote the development of the arts in Zimbabwe and inspire a new generation of artistes.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/detw.jpg",
            "description": "Mbulelo Mpofu mbulelo.smpofu@gmail.com THE National Arts Council of Zimbabwe (NACZ) is on the hunt for the country’s most talented dancers to take centre stage at the prestigious National Arts Merit Awards (NAMA) set for March 1. In a social media post, the organisers of the NAMAs invited aspiring dancers to audition this Friday morning. The […]",
            "time": "18:29",
            "date": "22 Jan 2025"
        }
    ]
}