{
    "news": [
        {
            "title": "NEW: Mozambican President Daniel Chapo to officially open ZITF",
            "url": "https://www.chronicle.co.zw/new-mozambican-president-daniel-chapo-to-officially-open-zitf/",
            "content": "Online Reporter\n\nMOZAMBICAN President Daniel Chapo is scheduled to officially open the 65th edition of the Zimbabwe International Trade Fair (ZITF, this year, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has announced.\n\nSpeaking at the post-Cabinet media briefing, Minister Muswere said this years fair will be held between April 21-26.\n\nIt.11 run under the theme Industrialisation: Crafting an Integrated Landscape,\n\nThis year, event has been extended to six days.\n\nNinety-five percent of the space has been booked to date, compared to 87 percent during the same period last year.\n\nInternational exhibitor space uptake has increased, with 29 countries having registered.\n\nThese include Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the European Union delegation, Egypt, Ethiopia, France, German, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the Unit. Kingdom, the Unit. States of America, Unit. Arab Emirates and Zambia.\n\nThis surpasses 27 participating countries in 2024.\n\nAsian giant India 11 also be participating.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Daniel-Chapo.jpg",
            "description": "Online Reporter  MOZAMBICAN President Daniel Chapo is scheduled to officially open the 65th edition of the Zimbabwe International Trade Fair (ZITF, this year, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has announced.  Speaking at the post-Cabinet media briefing, Minister Muswere said this year’s fair will be held between April 21-26.  It.11 run under […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Gamecocks dominate in Byo Div Two season opener tournament",
            "url": "https://www.chronicle.co.zw/gamecocks-dominate-in-byo-div-two-season-opener-tournament/",
            "content": "Zimpapers Sports Hub\n\nCHICKEN Inn were crowned champions in the Zifa Bulawayo Province Division Two League season opener tournament that was played over the weekend.\n\nThe contest featured young Gamecocks, Bulawayo Stars, Nkulumane, Mposa Academy, Khami and Corn Cob.\n\nIn their first match, Chicken Inn, who are under the guidance of Nkosana Sancho Gumbo and Ben Nyaunzi, beat Bulawayo Stars 3-0 before they went on to account for Mposa Academy after a penalty lottery that ended 10-9.\n\nIn their semi-final match, Gamecocks dismissed Khami 4-2. The former went on to defeat Corn Cob in the final match. For their tireless efforts Chicken Inn got a floating trophy, playing kit plus a prize money of US$300.\n\nTo show their dominance, Chicken Inns three players Makhosiwonke Chitungwiza, Lucky Kumwenda and Thabani Mandaba were named the Goalkeeper of the Tournament, Top Goal Scorer and Player of the Tournament respectively.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-17.14.00_093889e3-680x380.jpg",
            "description": "Zimpapers Sports Hub CHICKEN Inn were crowned champions in the Zifa Bulawayo Province Division Two League season opener tournament that was played over the weekend. The contest featured young Gamecocks, Bulawayo Stars, Nkulumane, Mposa Academy, Khami and Corn Cob. In their first match, Chicken Inn, who are under the guidance of Nkosana “Sancho” Gumbo and […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Gwanda Municipality launches initiative to rehabilitate Old People’s Home",
            "url": "https://www.chronicle.co.zw/gwanda-municipality-launches-initiative-to-rehabilitate-old-peoples-home/",
            "content": "Sukulwenkosi Dube-Matutu\n\nTHE Gwanda Municipality has engaged in a drive to mobilise resources to rehabilitate Gwanda Old Peoples Home which is in a dilapidated state.\n\nThe council has engaged members of the business community as part of efforts to mobilise resources. Some of the works that need to be done include replacing doors, repairing the ceiling and roof, repairing the floors and the sewer system.\n\nLocal business, Doveline Enterprises has donated doors and cement towards rehabilitating the facility.\n\nSpeaking recently during a handover of the building material Doveline Enterprises director, Mr Martin Mhlanga said the gesture is part of their corporate social responsibility.\n\nGwanda mayor, Alderman Thulani Moyo said the council will continue to engage more partners to ensure the elderly have a proper living space.\n\nWe have engaged in a drive to mobilise resources to rehabilitate the Gwanda Old Peoples Home. We have noticed that most of the time donations that have been coming having been mainly food items while the infrastructure has been neglected.\n\nAs council we do will our part to ensure there is proper sewer reticulation among other interventions. We urge the business community and other stakeholders to join in this noble cause, he said@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-17.02.14_63692e3a-676x380.jpg",
            "description": "Sukulwenkosi Dube-Matutu THE Gwanda Municipality has engaged in a drive to mobilise resources to rehabilitate Gwanda Old People’s Home which is in a dilapidated state. The council has engaged members of the business community as part of efforts to mobilise resources. Some of the works that need to be done include replacing doors, repairing the […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Solgas Project impresses energy experts",
            "url": "https://www.chronicle.co.zw/solgas-project-impresses-energy-experts/",
            "content": "Nqobile Bhebhe in Hwange\n\nDelegates attending the 6th edition of the International Renewable Energy Conference have expressed satisfaction with the Solgas independent power producer (IPP) project, describing it as a model worth replicating across the country\n\nThe solar energy project, located in Cross Mabale in Hwange District, is already feeding several megawatts into the national grid.\n\nPlans are underway to expand capacity to 50 megawatts by the end of the year.\n\nDuring a pre-conference tour of the expansive site on Tuesday, delegates commended the initiative as a shining example of a private sector-led renewable energy development.\n\nOne delegate noted the projects alignment with national goals to address energy shortages through diversification and private investment.\n\nThe project is worth replicating countrywide considering that the country enjoys vast sunlight, said the delegate.\n\nAs the country transitions towards renewable energy, the private sector should be at the forefront in investing in solar projects. By so doing, pressure on the national grid will be eased.\n\nDelegates heard that at peak hour, the plant produces 5.3 megawatts and on a good day an average of 27 megawatts are produced.\n\nThe International Renewable Energy Conference is being held under the theme Sustainable Energy Investments for a Better Future.\n\nThe renewable energy conference underscores the countrys growing commitment to renewable energy as a pillar of inclusive and resilient economic development.\n\nThe Solgas project, a wholly locally funded initiative, holds significant potential to mitigate electricity shortages and reduce the countrys dependence on costly power imports.\n\nAccording to Zimbabwe Power Company daily Power generation updates, IPPs collectively injected 71 megawatts to the national grid.\n\nThe country has been accelerating its shift towards renewable energy in recent years, with the government targeting 1100 megawatts of renewable energy capacity by 2030.\n\nSeveral solar projects have been launched across the country, including the Nyabira solar farm and initiatives in Gwanda, Mutoko and Marondera.\n\nThe National Renewable Energy Policy, launched in 2019, provides a framework to attract investment and promote independent power producers, particularly in solar and mini-hydro energy.\n\nThese efforts aim to diversify the energy mix, reduce load shedding and increase access to electricity in both urban and rural communities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-16.14.18_aed1410d-680x380.jpg",
            "description": "Nqobile Bhebhe in Hwange Delegates attending the 6th edition of the International Renewable Energy Conference have expressed satisfaction with the Solgas independent power producer (IPP) project, describing it as a model worth replicating across the country The solar energy project, located in Cross Mabale in Hwange District, is already feeding several megawatts into the national […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Mangwe District tobacco farmers start harvesting",
            "url": "https://www.chronicle.co.zw/mangwe-district-tobacco-farmers-start-harvesting/",
            "content": "Raymond Jaravaza, Online Reporter\n\nTOBACCO farmers in Mangwe District in Matabeleland South Province, who are part of a pioneer commercial tobacco project, have started harvesting their cash crop.\n\nNow in its second season, the tobacco growing project continues to grow in leaps and bounds as more than 160 communal farmers have joined the scheme, according to tobacco specialist Mr Rodrick Musiiwa.\n\nMrs Ellen Sibanda planted over 8 000 plants on a halfhectare piece of land and together with five other villagers from Greenfield village started harvesting the golden leaf three weeks ago.\n\nThe 2025 tobacco marketing season opened with promising record prices with the highest-quality leaf fetching US$4.95 per kilogram, exceeding last years peak of US$4.92.\n\nThe season kicked off on 5 March 2025.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-16.11.05_264122d9-680x380.jpg",
            "description": "Raymond Jaravaza, Online Reporter TOBACCO farmers in Mangwe District in Matabeleland South Province, who are part of a pioneer commercial tobacco project, have started harvesting their cash crop. Now in its second season, the tobacco growing project continues to grow in leaps and bounds as more than 160 communal farmers have joined the scheme, according […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Stanbic Bank sponsors successful St George’s College Hockey 5’s Tournament",
            "url": "https://www.chronicle.co.zw/stanbic-bank-sponsors-successful-st-georges-college-hockey-5s-tournament/",
            "content": "Zimpapers Sports Hub\n\nSTANBIC Bank Zimbabwe has once again shown its commitment to supporting grassroots sports by sponsoring the St Georges College Stanbic Hockey 5s tournament with a generous US$10,000 contribution.\n\nThe two-day event, held over the weekend at St Georges College, saw 48 boys and girls high schools from around the country come together to compete in the exciting, fast-paced format of Hockey 5s.\n\nFor over three years, Stanbic Bank has been the main sponsor of the internationally recognised Hockey 5s festival, which serves as a curtain raiser to the schools hockey season.\n\nThis years tournament witnessed an impressive increase in participation, with 48 schools taking part compared to just 33 in the previous year.\n\nDenford Kumundati, the head of hockey at St Georges College, expressed his gratitude for the support provided by Stanbic Bank, emphasizing the significance of their sponsorship in ensuring the events success.\n\nThe sponsorship by Stanbic Bank was pivotal in the smooth running of the event, which continues to grow in leaps and bounds each year, said Kumundati.\n\nThe number of participating schools grew from last years 33 to 48 this year, and this is a testament to the growing popularity and significance of the tournament.\n\nKumundati highlighted the importance of the sponsorship in facilitating the participation of both elite and development schools. Schools such as Kutama College, St Ignatius College, and Mbare Academy were able to showcase their hockey talents alongside top-tier institutions like St Georges College, Hellenic Academy, and Christian Brothers College from Bulawayo.\n\nThe tournament is significant towards the development of hockey in the country and is the only tournament outside of key national hockey matches and competitions, Kumundati added.\n\nOne of the key elements that made the tournament possible was the provision of perimeter boards by Stanbic Bank. These boards are crucial for the Hockey 5s format, as they allow the ball to rebound back into the court, keeping the game flowing smoothly without interruption.\n\nWe used to have two fields for Hockey 5s in the past, but thanks to Stanbic Banks support, we now have perimeter boards for four fields. This has allowed us to host more schools and teams, making the tournament even more successful and well-attended, said Kumundati.\n\nTariro Memo, Stanbic Banks acting head of Brand and Marketing, also expressed her enthusiasm about the banks role in promoting youth sports. Memo emphasized that supporting the tournament aligns with the banks broader Corporate Social Investment (CSI) strategy, which includes initiatives in health, education, the environment, sanitation, and sports.\n\nStanbic Bank is proud to play a pivotal role in promoting the skills of young and upcoming hockey players, said Memo. We understand the importance of nurturing talent at a young age, and through our sponsorship, we hope to contribute to the development of future national team players and competitive individuals in the sport.\n\nMemo also noted that the sponsorship of Hockey 5s is part of the banks ongoing commitment to supporting hockey at the grassroots level, with the goal of fostering a more competitive environment for the sport in Zimbabwe.\n\nThe tournament was attended by a wide array of schools, including Allan Wilson, Churchill, Convent, Eaglesvale, and Prince Edward. It has grown to become one of the most important events on Zimbabwes hockey calendar, providing young players with an invaluable opportunity to develop their skills and compete at a high level.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-15.27.37_270955c2-680x380.jpg",
            "description": "Zimpapers Sports Hub STANBIC Bank Zimbabwe has once again shown its commitment to supporting grassroots sports by sponsoring the St George’s College Stanbic Hockey 5’s tournament with a generous US$10,000 contribution. The two-day event, held over the weekend at St George’s College, saw 48 boys’ and girls’ high schools from around the country come together […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "President leaves for Uganda",
            "url": "https://www.chronicle.co.zw/president-leaves-for-uganda-2/",
            "content": "Joseph Madzimure,Zimpapers Politics Hub\n\nPresident Mnangagwa has left for Kampala, Uganda, to attend the eleventh session of the Africa Regional Forum on Sustainable Development (ARFSS11).\n\nHe is accompanied by the Minister of Foreign Affairs and International Trade, Professor Amon Murwira; the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube; Presidential spokesperson Mr George Charamba and other Government officials.\n\nVice President Kembo Mohadi, Minister of State for Harare Metropolitan Province, Senator Charles Tawengwa, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, service chiefs and other senior Government officials saw off the President at the Robert Gabriel Mugabe International Airport.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/01294ce6-7bc7-4fe6-8664-f9bd2586908d-1536x1024-680x380.jpeg",
            "description": "Joseph Madzimure, Zimpapers Politics Hub President Mnangagwa has left for Kampala, Uganda, to attend the eleventh session of the Africa Regional Forum on Sustainable Development (ARFSS11). He is accompanied by the Minister of Foreign Affairs and International Trade, Professor Amon Murwira; the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube; Presidential spokesperson Mr […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Government eyes revival of abandoned Gold Milling Centres",
            "url": "https://www.chronicle.co.zw/government-eyes-revival-of-abandoned-gold-milling-centres/",
            "content": "Faith Ndlovu\n\nTHE Ministry of Mines and Mining Development is hinted that it is working on plans to revive or repurpose the abandonment of Gold Milling Centres in Bubi and Makaha.\n\nThis was discussed during an oral evidence between the Portfolio Committee on Mines and Mining Development in Zimbabwe received from the Ministry of Mines and Mining Development.\n\nIn an update, Parliament said, The Portfolio Committee on Mines and Mining Development in Zimbabwe received oral evidence from the Ministry of Mines and Mining Development, with the Acting Permanent Secretary, Mr. Tahwa, highlighting key areas of focus.\n\nThe ministry is working to finalize the Cadastre System, a computerized system that aims to streamline mining claims and registrations, reducing disputes and increasing efficiency. Additionally, efforts are being made to formalize artisanal and small-scale miners, providing support and resources for them to operate sustainably.\n\nParliament added that the committee was also updated on the Mining Loan Industry Fund, which provides financial support for mining projects and initiatives.\n\nFurthermore, the ministrys position on the abandonment of Gold Milling Centres in Bubi and Makaha was discussed, with potential plans for reviving or repurposing these sites.\n\nThe committee explored possibilities for opening new areas for small-scale mining, potentially increasing opportunities for local miners. Finally, actions taken to address the underutilisation of disbursed funds and high vacancy rates within the ministry were clarified, reflecting the committees efforts to improve the mining sector in Zimbabwe.\n\nMining is a critical pillar in the national economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Makaha-Gold-Service-Centre-679x380-679x380.jpg",
            "description": "Faith Ndlovu THE Ministry of Mines and Mining Development is hinted that it is working on plans to revive or repurpose the abandonment of Gold Milling Centres in Bubi and Makaha. This was discussed during an oral evidence between the Portfolio Committee on Mines and Mining Development in Zimbabwe received from the Ministry of Mines […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Gospel sensation Xolly Mncwango set for Bulawayo debut",
            "url": "https://www.chronicle.co.zw/gospel-sensation-xolly-mncwango-set-for-bulawayo-debut/",
            "content": "Langalakhe Mabena Zimpapers Arts and Entertainment Hub\n\nAward-winning South African gospel songstress Xolly Mncwango is set to make her first solo appearance in Bulawayo on May 10, with a performance at the National University of Science and Technology (Nust) Ceremonial Hall.\n\nOrganised by the Nust Student Representative Committee, the gospel show will also feature popular Bulawayo ensemble Vocal Ex, who are among the event organisers.\n\nXolly Mncwango\n\nOther acts expected to grace the stage from 4pm include Snowy, Tehilla Testament, Spirit Praise Choir, Lorraine Maplanka-Stot, Faith Machu, Mthandazo Qongo and Siza Mdlongwa.\n\nBorn in Richards Bay, KwaZulu-Natal, Xolly Mncwango is a celebrated contemporary gospel musician and a former member of the renowned Joyous Celebration (JC) choir. She was part of the JC cast that toured Zimbabwe in 2014.\n\nThroughout her career, Mncwango has collaborated with gospel heavyweights such as Benjamin Dube, Dr Tumi, Xoli Thabethe and Ayanda Ntanzi.\n\nFamed for songs, Alikho Igama, Liyabasebenzela, Ukubonga, and Yebo Nkosi, her solo journey took off with the release of her debut album *Jesus Is Enough* in 2020, following nearly a decade of working with respected gospel artistes and choirs, including Joyous Celebration and Spirit of Praise.\n\nThe album earned her two Sama nominationsBest Contemporary Faith Music Album and Best Newcomeras well as five nominations at the Crown Gospel Music Awards in 2021.\n\nHer latest project, *Unusual* (2024), won Best Contemporary Faith Album at the 2024 South African Music Awards and secured multiple wins at the Crown Gospel Awards in November last year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-14.59.35-680x380.jpeg",
            "description": "Langalakhe Mabena Zimpapers Arts and Entertainment Hub Award-winning South African gospel songstress Xolly Mncwango is set to make her first solo appearance in Bulawayo on May 10, with a performance at the National University of Science and Technology (Nust) Ceremonial Hall. Organised by the Nust Student Representative Committee, the gospel show will also feature popular […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Lets make other dreams of nine-year olds come true: Kirsty Coventry",
            "url": "https://www.chronicle.co.zw/lets-make-other-dreams-of-nine-year-olds-come-true-kirsty-coventry/",
            "content": "Online Reporter\n\nA FORTNIGHT after her historic election, the International Olympic Committee (IOC)s President-elect, Kirsty Coventry, was warmly welcomed by IOC President Thomas Bach, IOC Director General Christophe De Kepper and IOC staff at Olympic House in Lausanne on Tuesday.\n\nWhen entering the building, the staff started a long and resounding round of applause for the President-elect. President Bach presented her with a bouquet of flowers. The entire staff joined the IOC President and President-elect for a group picture on the symbolic staircase of Olympic House.\n\nIn her address to the staff, the President-elect said: Wow. This is going to be etched in my memory for a long time. I am incredibly humbled to be here. I think as a nine-year-old girl, I did not think Id ever be standing here getting the opportunity to give back to this Movement and to work with all of you to make sure that other nine-year-olds realise their dreams.\n\nCoventrys first visit to Olympic House as President-elect comes ahead of an IOC Executive Board meeting on Wednesday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-10.32.42-680x380.jpeg",
            "description": "Online Reporter A FORTNIGHT after her historic election, the International Olympic Committee (IOC)’s President-elect, Kirsty Coventry, was warmly welcomed by IOC President Thomas Bach, IOC Director General Christophe De Kepper and IOC staff at Olympic House in Lausanne on Tuesday. When entering the building, the staff started a long and resounding round of applause for […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        }
    ]
}