{
    "news": [
        {
            "title": "Watch: Body of national hero Major-Gen (Rtd) Siziba arrives in Bulawayo – ZBC NEWS",
            "url": "https://www.chronicle.co.zw/body-of-national-hero-major-gen-rtd-siziba-arrives-in-bulawayo-zbc-news/",
            "content": "Story by Yolanda Moyo\n\nThe body of the late national hero, Major General (Rtd) Solomon Siziba has arrived at Khumalo Barracks in Bulawayo.\n\nThe body was received by Bulawayo Minister of State for Provincial Affairs and Devolution, Hon Judith Ncube, service chiefs, family members and the Bulawayo community.Major General (Rtd) Siziba died on the 15th of this month in Harare after a long battle with cancer.\n\nThe late national hero will be taken to his home area in Gwanda tomorrow where hundreds are expected to bid farewell to the liberation stalwart.On Monday, a funeral parade will be held at the Lookout Masuku Barracks.Funeral arrangements will be announced in due course.\n\nSource-ZBC NEWS\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jfjf.jpg",
            "description": "Justin Mahlahla ~1 minute Story by Yolanda Moyo The body of the late national hero, Major General (Rtd) Solomon Siziba has arrived at Khumalo Barracks in Bulawayo. The body was received by Bulawayo Minister of State for Provincial Affairs and Devolution, Hon Judith Ncube, service chiefs, family members and the Bulawayo community. Major General (Rtd) […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "Alarming Rise in HIV infections among young women in Plumtree despite overall decline",
            "url": "https://www.chronicle.co.zw/alarming-rise-in-hiv-infections-among-young-women-in-plumtree-despite-overall-decline/",
            "content": "Ronald Mpofu\n\nPLUMTREE Town District Hospital has recorded an alarming increase in new HIV infections among young women aged 2039, despite a general decline in the rate of new infections and an increase in the number of individuals tested.Hospital data shows that between January 2023 and November 2024, 5 235 individuals underwent HIV testing, with 287 new HIV-positive cases recorded. A disproportionate number of these infections were among women aged 2039, highlighting a concerning trend in this demographic.\n\nIn 2023, 2 527 individuals were tested for HIV, leading to 157 new positive cases, with the majority of infections recorded in young women aged 2029. In contrast, data from January to November 2024 indicates that 2 708 individuals were tested, resulting in 130 new infections, with most cases affecting women aged 3039.This represents a decline in new infections from 6,2 percent in 2023 to 4,8percent in 2024, even as the number of individuals tested increased by 7,16 percent.\n\nHowever, the hospital has observed a decrease in the number of patients on antiretroviral therapy (ART). In 2023, there were 3,960 patients on ART, but this number dropped to 3,864 by November 2024.The decline in ART numbers could be attributed to patients lost to follow-up, deaths, or transfers, said Miss Samukeliso Moyo, the Health Information Assistant for Plumtree District Hospital. She also noted that a newly established clinic at Izimnyama opened in August 2023, might help address some of these issues by improving accessibility.\n\nThe data highlights the need for targeted interventions to address the high prevalence of HIV among young women in Plumtree and to ensure sustained ART coverage for all affected individuals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ggsg.jpg",
            "description": "Ronald Mpofu PLUMTREE Town District Hospital has recorded an alarming increase in new HIV infections among young women aged 20–39, despite a general decline in the rate of new infections and an increase in the number of individuals tested. Hospital data shows that between January 2023 and November 2024, 5 235 individuals underwent HIV testing, […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "Bosso elections nomination process closes",
            "url": "https://www.chronicle.co.zw/bosso-elections-nomination-process-closes/",
            "content": "Innocent Kurira -Online Reporter\n\nTHE Highlanders election nomination process for the positions of vice-chairman and treasurer has closed.The elections returning officer, Peter Dube, will announce the names and number of candidates on Monday after the electoral college verifies the nominations.\n\nTo qualify, candidates must have been club members for 24 months, obtain signatures from 10 members in good standing, and pay a US$200 nomination fee. The fee is refundable if the candidate receives at least 10% of the total votes cast.\n\nThe verification process will take place on Monday, after which the Nomination and Electoral Review Committee will publish the list of successful candidates.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/highlanders-580x380.jpg",
            "description": "Innocent Kurira -Online Reporter THE Highlanders election nomination process for the positions of vice-chairman and treasurer has closed. The elections returning officer, Peter Dube, will announce the names and number of candidates on Monday after the electoral college verifies the nominations. To qualify, candidates must have been club members for 24 months, obtain signatures from […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "Bulawayo grapples with vehicle shortages, waste management challenges , and by-law enforcement",
            "url": "https://www.chronicle.co.zw/bulawayo-grapples-with-vehicle-shortages-waste-management-challenges-and-by-law-enforcement/",
            "content": "Online Writer\n\nTHE City of Bulawayo is battling significant challenges in waste management, including vehicle shortages, landfill hazards, and by-law enforcement issues, as highlighted during the November 2024 council meeting, contained in the latest council report.\n\nCouncillors and officials outlined a series of logistical and environmental issues requiring urgent attention to safeguard public health and maintain the citys reputation for cleanliness.\n\nA report tabled during the meeting revealed that only half of the citys 16 refuse trucks are operational, while the other half are out of service. The lone skip hauler, critical for managing high-volume waste areas, remains non-functional, alongside other vital machinery such as tipper trucks.\n\nThese shortages are severely affecting service delivery, noted the Director of Health Services Dr Edwin Mzingwane. Efforts are underway to assemble our own skip hauler, but this will not address the immediate challenges of waste accumulation in high-demand areas.\n\nCouncillor S. Moyo expressed frustration over the lack of progress: High-volume areas no longer have skip bins, and residents are resorting to illegal dumping. This is unacceptable for a city like Bulawayo, which prides itself on cleanliness.\n\nThe Trenance Landfill site, which has been plagued by recurring fires, is posing serious health hazards for nearby residents. Councillor A.R. Moyo raised the alarm during the meeting: The smoke from these fires is affecting the surrounding communities. This is a health disaster waiting to happen.\n\nCllr Moyo proposed innovative solutions to mitigate the risks. The only sustainable way forward is waste-to-energy generation, he said. Relocating the landfill is not an option as it would cost over US$1.8 million. Instead, maintaining the current site and procuring equipment for US$950,000 is more feasible.\n\nThe Director of Health Services added that improved recycling could significantly reduce waste going to the landfill. Currently, only 5 percent of waste is being recycled, yet this could dramatically decrease the volume of waste and reduce fire risks, he said.\n\nStaff shortages in the Central Business District (CBD) have also been blamed for worsening waste management. We currently have only two cleansing supervisors for the entire CBD, said the Dr Mzingwane. This is clearly insufficient.\n\nCllr Moyo praised the citys enforcement of anti-littering by-laws but pointed out obstacles. Political interference is making enforcement difficult, she said. We need a stronger presence on the ground and more support from stakeholders to address lawlessness.\n\nThe council confirmed that it is recruiting security guards to enhance by-law enforcement, with training expected to begin later this month.\n\nA consultative meeting involving stakeholders is planned for January 2025 to address landfill management and explore waste-to-energy partnerships. For these initiatives to succeed, we need partners, Cllr Moyo said.\n\nIn the interim, the council has approached the Procurement Regulatory Authority of Zimbabwe (PRAZ) to expedite the hiring of equipment. Additionally, skip bins will be reinstated in high-demand areas, particularly as waste levels increase during the farm produce season.\n\nWhile Bulawayos leadership remains committed to addressing these challenges, councillors stressed the need for swift action. If we do not invest in adequate machinery and enforce our by-laws more effectively, these problems will only escalate, Cllr Moyo warned.\n\nWith solutions such as recycling, waste-to-energy initiatives, and enhanced enforcement, Bulawayo has the opportunity to set a benchmark for sustainable urban waste management in Zimbabwe. However, success will depend on timely implementation and collective effort.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/03/Untitled-4-copy.jpg",
            "description": "Online Writer THE City of Bulawayo is battling significant challenges in waste management, including vehicle shortages, landfill hazards, and by-law enforcement issues, as highlighted during the November 2024 council meeting, contained in the latest council report. Councillors and officials outlined a series of logistical and environmental issues requiring urgent attention to safeguard public health and […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "West Ham may hijack Marcus Rashford deal amid ‘huge’ claim – ‘watch this space’",
            "url": "https://www.chronicle.co.zw/west-ham-may-hijack-marcus-rashford-deal-amid-huge-claim-watch-this-space/",
            "content": "West Ham could look to hijack any potential deal for Marcus Rashford with a foreign team as they look to keep him in the Premier League.\n\nSpeaking on the latest edition ofFootball Insiders Inside Track podcast, former Leeds goalkeeper Paul Robinson admitted he believes United would ideally like to explore their options outside of the Premier League.\n\nThe 20-time champions would prefer the England international to move away from the Premier League to avoid any potential embarrassment if he rediscovers his form away from Old Trafford.\n\nThe 27-year-old has been deemed surplus to requirement under Ruben Amorim which has alerted top European teams such as AC Milan, Napoli, and PSG.\n\nThe Hammers are also keeping tabs on Rashford, but industry insider Mick Brown revealed toFootball Insiderthat he believes they are unlikely to complete a deal for him.\n\nWatch this space is what Ill say on that one,Robinson toldFootball Insider.\n\nManchester United would ideally like to explore their options outside of the Premier League.\n\nThey could well end up with egg on the face because hes a top player and we know the potential that he can reach.\n\nThere is nothing to say that Marcus Rashford couldnt go into another Premier League side and score 15, 20 goals before now on the end of the season because hes that type of player, he could do that.\n\nIf he goes to Serie A, the Bundesliga or elsewhere, then maybe not so apparent that hes in everybodys face there, he carries a huge salary.\n\nWe know theres a huge financial obligation when it comes with Marcus Rashford. We know that his representatives are scouring Europe.\n\nIf we get to that last weekend before February and theres no deal in place and theres no set destination for Marcus Rashford, then dont rule out West Ham.\n\n[They have a] real chance at nicking him.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/west-ham.jpg",
            "description": "West Ham could look to hijack any potential deal for Marcus Rashford with a foreign team as they look to keep him in the Premier League. Speaking on the latest edition of Football Insider’s Inside Track podcast, former Leeds goalkeeper Paul Robinson admitted he believes United would “ideally like to explore their options outside of the […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "Baby swap at Bulawayo hospital",
            "url": "https://www.chronicle.co.zw/baby-swap-at-bulawayo-hospital/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nShocked to be discharged with a baby girl after giving birth to a boy via Caesarean section, a new mother from Bulawayos Cowdray Park suburb confirmed her suspicions through DNA testing about a month later.\n\nThe incident happened at United Bulawayo Hospitals (UBH) where the mother, who cannot be named due to ethical concerns, was discharged with a baby girl whose parents had already travelled to Esigodini in Matabeleland South with her son.\n\nThe testing, which cost a considerable US$220, was conducted at a laboratory in Bulawayos city centre to prove that the child given to the insistent mother by a maternity nurse at the hospital was not her biological offspring.\n\nThe day before the birth, she underwent a scan which confirmed she was expecting a boy. After the delivery, a nurse took the child for cleaning and returned it to the mother.\n\nThe mother, who had been taking photographs of her son, noticed the babys identification tag indicated it was a girl, said the source close to the woman, who lives in Cowdray Park.\n\nInitially unaware of the discrepancy, the new mother immediately alerted the nurse, expressing her concern. However, the nurse dismissed her concerns, suggesting that the effects of the anaesthesia for the Caesarean section might have clouded her judgment.\n\nAccording to the source, another expectant mother had been admitted to the ward just fifteen minutes before the operation, but she had already been discharged by the time the alert mother raised the alarm.\n\nShe contacted her relatives to inform them of the situation. Her uncle suggested DNA testing, but the nurse vehemently opposed the idea, claiming it was too expensive and unaffordable for the family. However, the uncle insisted, and they proceeded with the testing at a laboratory in the Bulawayo city centre. The results unequivocally confirmed that the baby girl was not her biological child.\n\nFurious, the family returned to the hospital, demanding answers and demanding the return of their biological son. Hospital staff were compelled to locate the other mother, who resided in Esigodini, Umzingwane District.\n\nA hospital vehicle was dispatched to retrieve her.However, the womans husband was unco-operative, adamantly insisting that the child was his.The police were subsequently involved, and the couple was brought to Bulawayo.\n\nAt the insistence of the aggrieved family, the hospital engaged the National University of Science and Technology (Nust) for DNA testing. The results unequivocally confirmed that the two babies had been exchanged.\n\nZephania Dlamini, head of the Applied Genetics Testing Centre at Nust, confirmed this shocking discovery.In the Bulawayo cases, two women who were in the same ward at UBH delivered around the same time.\n\nThe complainant asserted that her child was a boy, but when it was returned after cleaning, she was given a girl.Dlamini further said that when confronted with the discrepancy, the other mother adamantly insisted that her child was indeed a boy, a claim vehemently supported by her husband.\n\nHe even insisted that the ultrasound scan had confirmed the sex of the child as male. Before approaching Nust, the complainant had sought testing at Global DNA lab in the city centre, which confirmed that the baby girl was not hers.Our results corroborated these findings. Subsequent testing on the couple claiming to be the parents of the boy yielded negative results, while the boys DNA matched that of the complainant, and the girls DNA matched that of the other woman, said Dlamini.\n\nDr William Busumani\n\nDlamini revealed that the entire hospital administration was present at the laboratory during the testing process. UBH chief medical officer, William Busumani, declined to comment on the incident.\n\nWe do not discuss patient information, he stated.Maphios Siamuchembu, Provincial Medical Director for Bulawayo Metropolitan Province, said he was not aware of any reports of baby swapping from UBH.\n\nRenowned medical expert, Solwayo Ngwenya, described baby-swapping errors as tragic but avoidable with proper diligence.Receiving a child who is not your own is a devastating experience, particularly from a cultural perspective. In private medical practice, staff are rigorously trained to prevent such occurrences, and the lower volume of deliveries facilitates closer monitoring. We strive to ensure such errors never occur in private healthcare settings, as they would severely damage the institutions reputation, said Ngwenya.\n\nProfessor Solwayo Ngwenya\n\nHe stressed the importance of rigorous procedures in ensuring that each newborn is correctly identified and returned to their biological mother.\n\nImmediately after birth, each baby should be assigned a unique identification tag. This, combined with meticulous attention to detail and adherence to established protocols, is crucial in preventing these tragic errors.\n\nThere are likely many individuals who have been unknowingly raised by parents who are not their biological parents due to similar incidents. These individuals may have grown up in entirely different environments, speaking different languages, leading to profound and unforeseen consequences.\n\nNgwenya urged healthcare institutions to prioritise staff training on the importance of accurate newborn identification.These tragic incidents are entirely preventable. By adhering to strict protocols and maintaining a vigilant approach, we can ensure that such errors do not occur, Ngwenya stressed.\n\nThe case raises serious concerns about the potential for similar incidents to have occurred undetected, particularly among families who may not have the financial resources to pursue DNA testing.\n\nRichard Ndebele, a cultural expert, said that baby swapping was unheard of in the past due to the traditional system of village midwives.\n\nThose involved in such an act must be prepared to face the consequences, as misfortune may befall both the child and themselves. The child may experience difficulties throughout their life, and the perpetrators may face the wrath of their ancestors, Ndebele warned.\n\nHe further explained that traditional birth rites cannot be effectively performed for a child who is not biologically related to the family, as the ancestors would not recognise the child.\n\nThere can be no righteousness in such an act of deception. You may deceive mortal beings, but the ancestors will be aware of your actions, and any rituals performed will be rendered meaningless.\n\nMargaret Makumbe, a retired nurse with a distinguished career spanning four decades and delivering over 10 000 babies, stressed the unwavering commitment to excellence that characterised her profession.\n\nShe highlighted the paramount importance of meticulous attention to detail, a skill that every nurse and supervisor had to master to prevent any medical errors, such as the tragic case of a mother being mistakenly given the wrong baby.\n\nIn my entire career, I never experienced that wherever I was deployed, neither did I hear of it anywhere else and I think this was because we did what we did out of love. I just wonder how such a mistake can happen because once a baby is delivered the mother is shown the child before its taken away for cleaning with a name tag already strapped on the wrist, said Makumbe who at one time while at Mpilo delivered an incredible 15 babies in a single night.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-1-11.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw Shocked to be discharged with a baby girl after giving birth to a boy via Caesarean section, a new mother from Bulawayo’s Cowdray Park suburb confirmed her suspicions through DNA testing about a month later. The incident happened at United Bulawayo Hospitals (UBH) where the mother, who cannot be named due to […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "Siziba, Chimutengwende declared national heroes",
            "url": "https://www.chronicle.co.zw/siziba-chimutengwende-declared-national-heroes/",
            "content": "Nqobile Tshili and Joseph Madzimure\n\nPRESIDENT Mnangagwa yesterday conferred National Hero status on Major General (Retired) Solomon Siziba and former Information, Posts and Telecommunications Minister Cde Chenhamo Chen Chakezha Chimutengwende, in recognition of their contributions to the country before and after independence.\n\nMaj-Gen Siziba died on Wednesday and will be buried at the National Heroes Acre in Harare next week while burial arrangements for Cde Chimutengwende will be announced in due course as his family is expected to meet Government representatives today.\n\nThe National Heroes Acre\n\nMaj-Gen Siziba died at the Josiah Magama Tongogara Barracks Camp Hospital in Harare after battling cancer.He was 67.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube delivered the national hero status to the Siziba family at his Killarney residence in Bulawayo yesterday evening after receiving communication from the Presidents Office.\n\nThis message comes from Dr Martin Rushwaya, the Chief Secretary in the Office of the President and Cabinet, and is referenced: National Hero Status, the late Maj-Gen (Rtd) Solomon Siziba. His Excellency, the President and First Secretary of Zanu PF, Cde. Dr. E.D Mnangagwa, has conferred national hero status on the late Cde Maj Gen (Rtd) Solomon Siziba, who died on the 15th of January 2025.\n\nMourners are gathered at 527 Bulawayo Drive, Killarney, Bulawayo. The late Maj Gen (Rtd) Siziba will be interred at the National Heroes Acre in Harare at a date to be announced. I shall be most grateful if you would make the usual arrangements for his burial and payment of benefits to his family, said Minister Ncube.\n\nMinister Judith Ncube\n\nShe described Maj-Gen Sizibas death as a great loss, saying her office had started to initiate the processes expected with the handling of a funeral of a national hero.\n\nMaj-Gen Sizibas brother, Mr Leonard Siziba, expressed gratitude to the President for declaring his brother a national hero. He said the status was befitting for a man who served the country since his childhood as a learner at Manama High School, where he and other learners joined the armed struggle.\n\nWe want to thank His Excellency, the President, for declaring my brother a national hero. We also want to thank the Minister of State for Provincial Affairs and Devolution for delivering the message to the family. My brother joined the armed struggle when he, together with other learners from Manama, left school and crossed into Botswana.\n\nHe did his primary level at Nhwali Primary School and proceeded to Manama High School in 1976, where he started his Form One.\n\nHe was part of the group that joined the armed struggle from Manama Mission in 1977. He did his military training in Zambia, and during the ceasefire, he was attested to the Zimbabwe National Army. He was stationed at the Zimbabwe Military Academy, where he rose to the rank of Captain. He was then transferred to the ZNA, where he worked until 2005, rising to the position of Lieutenant-Colonel. He was posted to Botswana as Defence Attach from 2005 to 2013, stationed at the Zimbabwean Embassy, he said.\n\nProvincial Affairs and Devolution Ministers for Bulawayo and Matabeleland South console each other at the funeral of the late Retired-Major General Solomon Siziba in Bulawayo yesterday\n\nMr Siziba said upon his return to Zimbabwe in 2013, Rtd Maj Gen Siziba was appointed the Deputy Commander of One Brigade and had been elevated to the rank of Colonel.\n\nFrom 2013 until 2018, he was appointed Director of Administration at the National Prosecuting Authority.Mr Siziba said Maj-Gen Siziba returned to the ZNA in 2018 and was elevated to the rank of Brigadier General and was assigned to the Brigadier General Inspectorate position, a post he held until he retired from the military last year. He said his brother was elevated to the position of Maj-Gen upon his retirement.\n\nHe described his death as a great loss, saying Maj-Gen Siziba had become a father figure in the family. The Government has already taken over the funeral processes, including the provision of meals, tents, and other necessities.Maj-Gen Sizibas body is expected to arrive in Bulawayo today and will be received at HQ One Brigade Barracks (Mzilikazi Barracks). After that, it will be taken to Doves Funeral Parlour. Tomorrow, a send-off funeral service will be held at his rural home in Nhwali, Gwanda, Matabeleland South.\n\nMatabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu, service chiefs, and other senior government officials were among the mourners at the familys residence.\n\nCde Chimutengwende died on Thursday and was declared a national hero last night.Zanu PF National Political Commissar Cde Munyaradzi Machacha delivered the message to the family at their Milton Park, Harare, home.\n\nCde Machacha was accompanied to the Chimutengwende family home by Home Affairs and Cultural Heritage Minister Kazembe Kazembe, who is also the Zanu PF Mashonaland Central provincial chairman.Earlier in the day, Zanu PF National Chairman and Defence Minister Oppah Muchinguri-Kashiri had told the media that Mashonaland Central province had written to the national leadership requesting national hero status for Cde Chimutengwende.She described Cde Chimutengwende as a strong member of the ruling party Zanu PF, who played a major role before and after independence.\n\nHe was a principled person who persevered and was consistent and these are some of those values that we consider (when declaring one a national hero), Cde Muchinguri-Kashiri said.\n\nCde Chimutengwende served as a Government Minister, Member of Parliament for Mazowe and a Politburo member.He succumbed to chronic kidney disease.\n\nBorn on August 28, 1943, Cde Chimutengwende first became a Zanu PF Member of Parliament in 1985 in Mazowe, and served as a legislator for over 25 years.\n\nHe also served for 14 years as a Cabinet Minister.Cde Chimutengwende served as Senator and Deputy President of the Senate, Member of the Pan-African Parliament (PAP) and Head of the Zimbabwe delegation to the PAP.He earned a Masters degree in Social Science and a PhD from the University of Bradford in the UK.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-2-3.jpg",
            "description": "Nqobile Tshili and Joseph Madzimure PRESIDENT Mnangagwa yesterday conferred National Hero status on Major General (Retired) Solomon Siziba and former Information, Posts and Telecommunications Minister Cde Chenhamo ‘Chen’ Chakezha Chimutengwende, in recognition of their contributions to the country before and after independence. Maj-Gen Siziba died on Wednesday and will be buried at the National Heroes […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "Public proposal pays off: Bulawayo couple begins their forever",
            "url": "https://www.chronicle.co.zw/public-proposal-pays-off-bulawayo-couple-begins-their-forever/",
            "content": "Sipepisiwe Moyo,moyosipepisiwe@gmail\n\nTHE year 2024 concluded on a romantic note for lovebirds Alois Mutambu and Siphilisiwe Mangena. In a display of both love and remarkable bravery, Alois publicly proposed to Siphilisiwe at her workplace at So Sweet in Bulawayo on December 28.\n\nWitnessing the heartfelt moment were her superiors. Alois, aware of the potential for public rejection that often goes viral on social media, meticulously planned this special moment over two weeks, aiming for a truly unforgettable and cherished experience.\n\nTheir love story began six years prior, on December 28, 2018, within the sacred walls of their church. While their journey together has not been without its challenges, their unwavering love has endured.\n\nSiphilisiwe Mangena and Alois Mutambu on the day he proposed\n\nOver the past five years, I have been nurturing the woman I wish to spend the rest of my life with. We faced numerous obstacles, with many disapproving of our relationship, said Alois.\n\nSiphilisiwe echoed his sentiments, revealing that their bond blossomed from friendship.\n\nI first met my fianc in early 2018 at church. Back then, he was just another face in the crowd, and I paid him little attention. Every girl seemed infatuated with him, but I couldnt see what they saw in him. I wasnt particularly interested in dating at the time.\n\nThen, one of his friends introduced us, and we began to converse. Our friendship deepened, and eventually, he expressed his interest in me. Thats when I started to understand the appeal he held for others. It was on December 26 that he asked me out, and I agreed to a date on the 28th. He was my first boyfriend, she recounted.\n\nWith the help of Siphilisiwes boss, her uncle, and Aloiss brother, a beautiful surprise was orchestrated. Siphilisiwe vividly recalls the day.\n\nAlois informed me that he had an event to MC, so he needed to look his best. I assisted him in selecting shoes and an outfit, you know, the usual preparations. He told me the event was on December 28 and that I should also prepare myself. He wanted me to accompany him. So, I ensured I looked my best. On the day, I was at work  Im a barista at So Sweet Coffee Shop.\n\nWe finished work, but we were instructed to stay for a meeting with the boss, even though no meeting was scheduled. I was becoming impatient, eager to join my boyfriend. Suddenly, my uncle and a friend arrived at the workplace. I bombarded them with questions, and then I saw Alois enter, looking dapper, though there was something slightly off about his demeanour.\n\nSiphilisiwe said that despite the unexpected nature of the proposal, which left her speechless, she never hesitated in her response.\n\nHe presented me with roses, and before I could even react, he was kneeling. I was completely taken aback. I didnt know what to say, and when I saw the red box, I was simply staring at him, unable to utter a word until everyone started shouting yes! And there I was, saying yes before he even asked.\n\nI didnt feel nervous or pressured because Im accustomed to being in the spotlight  I sing in church. However, in that moment, I felt completely frozen.\n\nSiphilisiwe beamed as she described the ring.\n\nSiphilisiwe Mangena stunned\n\nI adore everything about it. It reflects my personality, exuding elegance and maturity. Im completely smitten with it. The amusing part is that it fit perfectly. This proposal holds immense significance for me because it marked our fifth anniversary. He has been an incredible partner throughout these years, making me feel cherished and valued.\n\nThe fact that he chose my workplace, the place where I pour my heart and soul into my work, to create this unforgettable memory makes it even more special. This proposal has positively impacted our relationship. We now command greater respect from those around us and have grown even closer. Being engaged is the most incredible feeling. If I feel this way now, I can only imagine how Ill feel on my wedding day.\n\nAlois acknowledged that proposing in public was a daunting prospect, filled with uncertainty about the outcome. He also faced financial challenges but persevered.\n\nAs the moment approached, my foot was tapping nervously, and my mind was racing. I was constantly wondering if it would go well, and my heart was pounding. When I knelt down, my mind went blank for a moment as I tried to gauge her reaction.\n\nI remember calling my brother to discuss my plan to propose to her at her workplace. He advised me to speak with her boss and explain my intentions, as a sign of respect for my partner. The entire planning process took two weeks. The most challenging aspect was when I lost the money I had saved for the event. However, by the grace of God, I was able to recover it, and everything went according to plan.\n\nI received invaluable support from my friends, and her boss was incredibly helpful. Even my pastors stood by me. The event was a complete surprise, and I am grateful to everyone for keeping it a secret.\n\nHe shared his thoughts on his partner and their relationship.\n\nMy partner is someone I can trust and rely on completely. She embodies 90 percent of the qualities I desire in a woman. No one is perfect, but I feel safe with her. My favourite moments are those early days of our relationship  you know how girls are when a relationship is new, those moments are priceless.\n\nWe are praying for Gods guidance and alignment with His plan. As the scripture says, For I know the plans I have for you, declares the Lord. My partner is honest, respectful, empathetic, courageous, responsible, kind, humble, confident, hardworking, and a woman of prayer, he said.\n\nAlois further expressed his apprehension leading up to the proposal.\n\nThe thought of being rejected was nerve-wracking. I experienced moments of anxiety, constantly praying for a positive response. Thankfully, she said yes before I could even utter the words, and it was a dream come true.\n\nAlois voiced his gratitude to the individuals who have been pillars of support throughout their journey:\n\nI am deeply grateful to my pastors, Keith Bhehane and Talent Bhehane of Rhema Word Ministries. They have provided us with unwavering support, along with all our friends who came to celebrate with us. And, of course, my family  they are the best team ever.\n\nHe concluded by sharing that plans for the traditional bride price and a grand wedding are currently underway.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/vfffvv.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail  THE year 2024 concluded on a romantic note for lovebirds Alois Mutambu and Siphilisiwe Mangena. In a display of both love and remarkable bravery, Alois publicly proposed to Siphilisiwe at her workplace at So Sweet in Bulawayo on December 28. Witnessing the heartfelt moment were her superiors. Alois, aware of the potential for […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "O-level pass rate increases",
            "url": "https://www.chronicle.co.zw/o-level-pass-rate-increases/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHE 2024 Zimbabwe School Examinations Council (Zimsec) Ordinary Level examinations saw a slight improvement in the national pass rate, with 33,19 percent of the 199 258 candidates who wrote five or more subjects achieving a pass. This represents a modest increase compared to the previous years results.\n\nThe results were released yesterday, with Zimsec board chairperson Professor Paul Mapfumo announcing that the results portal, www.zimsec.co.zw, will remain open until Tuesday for candidates to access their results.\n\nHeads of examination centres will be able to collect the results for their respective schools/centres from the provincial offices from Monday.\n\nPresident Mnangagwa and Professor Paul Mapfumo\n\nProf Mapfumo stated that a total of 291 341 candidates sat for the examinations compared to 270 129 candidates in 2023, signalling an increase of 21 212 in candidature, which translates to a 7,85% increase.\n\nA total of 199 258 candidates wrote five or more subjects, and 66 130 passed five or more subjects with a grade C or better. The national pass rate for November 2024 is therefore 33,19 percent. In comparison, 185 021 candidates wrote five or more subjects in 2023, with 54 420 passing five or more subjects with a Grade C or better, yielding a percentage pass rate of 29,41.\n\nThis translates to a percentage increase of 3,78 in the national pass rate in November 2024, said Prof Mapfumo.He noted that 199 270 school candidates sat for the examinations, and of these, 171 695 wrote five or more subjects, with 57 860 obtaining Grade C or better in five or more subjects, yielding a percentage pass rate of 33,70. In comparison, 163 533 school candidates wrote five or more subjects in 2023, with 49 373 obtaining a Grade C or better in five or more subjects, resulting in a percentage pass rate of 30, 19.\n\nThis figure translates to a percentage increase of 3, 51 in the pass rate for school candidates in 2024.Private candidates who sat for the examinations were 92 071, with 27 974 writing five or more subjects, and 8 270 obtained Grade C or better in five or more subjects, yielding a percentage pass rate of 29,60.\n\nIn comparison, 23,095 candidates wrote five or more subjects, with 5 047 obtaining a Grade C or better in five or more subjects, resulting in a percentage pass rate of 21,85, translating to a percentage increase of 7,75, said Prof Mapfumo.\n\nThere were 154 391 female candidates who sat for the 2024 examinations, with 104 930 writing five or more subjects, and of these, 35 203 got five or more subjects, translating to a percentage pass rate of 33,54.\n\nA total of 323 special needs candidates sat for a range of subjects from one to 12. Of these, 198 wrote five or more subjects, and 72 passed five or more subjects, yielding an overall percentage pass rate of 36,36.\n\nWe would like to acknowledge and appreciate the Ministry of Primary and Secondary Education, the board and staff, state security agencies, teachers, markers, and all our valued stakeholders who collaborated with Zimsec, said Prof Mapfumo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/10/zimsec1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE 2024 Zimbabwe School Examinations Council (Zimsec) Ordinary Level examinations saw a slight improvement in the national pass rate, with 33,19 percent of the 199  258 candidates who wrote five or more subjects achieving a pass. This represents a modest increase compared to the previous year’s results. The results were released yesterday, […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        },
        {
            "title": "COMMENT: A new era for Zimbabwe’s political landscape laudable",
            "url": "https://www.chronicle.co.zw/comment-a-new-era-for-zimbabwes-political-landscape-laudable/",
            "content": "During the past few days the country has witnessed a new culture of opposition politics that respects and advances the countrys interests as opposed to being stooges of the West. This is as it should be because members of opposition political parties are Zimbabweans first and foremost hence should work for Zimbabwes development and prosperity.\n\nZimbabweans should have a shared vision when it comes to national interests regardless of ones political affiliation. The engagement between the ruling party Zanu-PF and opposition political parties is very commendable as it is meant to promote the countrys development.\n\nThe ruling party and opposition Members of Parliament should be guided by what is in the best interest of Zimbabweans because they were elected into office to serve all citizens.\n\nDelegates at the Zanu-PF Gwanda inter-district party meeting\n\nWe totally agree with the interim secretary-general of the Citizen Coalition for Change (CCC), Senator Sengezo Tshabangu that engaging the ruling party Zanu-PF does not only enhance democracy but also promotes national development. Sen Tshabangu who is also the leader of the opposition in Parliament, dismissed claims that engaging the ruling party was tantamount to betrayal.\n\nIt is certainly strange reasoning to suggest that an opposition party which engages the ruling party is selling out, said Mr Tshabangu.\n\nIn the past the opposition political parties were criticised for their penchant for confrontation and violence which caused destruction. The situation has completely changed now, much to the chagrin of the countrys detractors.\n\nPresident Mnangaggwa has said the opposition legislators must give their ruling party counterparts a hard time in Parliament to build and develop Zimbabwe.\n\nHe said the ruling party MPs must be made to account so that they deliver for the general citizenry. The developments witnessed during the past few days confirm that the opposition political parties now realise that they have an obligation to contribute to the social and economic development of the country and this is very encouraging.\n\nZimbabwe is endowed with abundant natural resources that can make a difference and what is required is for citizens to unite and exploit these resources regardless of their political persuasions.\n\nIt is therefore incumbent upon each and every Zimbabwean to act responsibly and refuse to be used by the countrys detractors to disturb peace, a prerequisite for economic development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/President-Mnangagwa.jpg",
            "description": "During the past few days the country has witnessed a new culture of opposition politics that respects and advances the country’s interests as opposed to being stooges of the West. This is as it should be because members of opposition political parties are Zimbabweans first and foremost hence should work for Zimbabwe’s development and prosperity. […]",
            "time": "21:26",
            "date": "18 Jan 2025"
        }
    ]
}