{
    "news": [
        {
            "title": "Boy (8) drowns in Tsholotsho",
            "url": "https://www.chronicle.co.zw/boy-8-drowns-in-tsholotsho/",
            "content": "Leonard Ncube[emailprotected]AN eight-year-old boy from Nhlangano in Tsholotsho District, Matabeleland North drowned while attempting to cross a flooded Godzo stream near the Jahe area.The boy, who was playing with other children, was swept away by the strong current.The incident occurred in Nhlangano Village under Chief Magama. The childs body was recovered days later in the Gwayi River after an extensive search involving villagers and the Zimbabwe Republic Police (ZRP) sub-aqua unit.Godzo Stream, where the incident occurred, flows into the Gwayi River. The Civil Protection Unit (CPU) Tsholotsho District chairperson, Mr Aaron Gono, reiterated the importance of exercising caution near water bodies during the rainy season.The incident happened in Nhlangano Village under Chief Magama. A male juvenile was playing with other children, and due to heavy rains, Godzo Stream was flooded. He was swept away, he said.Mr Magama noted that the other children, likely panicked and confused, only reported the incident a day later when questions arose about the boys whereabouts. Villagers immediately alerted the police, and a search party was formed to locate the childs body.The search party, comprising local villagers and the police sub-aqua unit, combed through the flooded stream and downstream areas. The boys body was eventually retrieved from the Gwayi River by villagers.\n\nMr Gono commended the communitys disaster risk reduction structures for their ongoing efforts to raise awareness and improve safety.This is an unfortunate incident, but we strongly believe our local disaster risk reduction structures have been effective in disseminating information. We encourage people not to attempt crossing flooded rivers or streams, especially at night, as this increases the risk of being swept away, he said.Mr Gono added that siltation and muddy, slippery bridges pose additional dangers during the rainy season.Tsholotsho is one of Zimbabwes districts most prone to flooding. The area has experienced heavy rainfall since last month, with the Meteorological Services Department (MSD) warning of potential flooding across the country.A few years ago, severe floods in Sipepa displaced hundreds of villagers and caused widespread destruction. The Government responded by relocating affected families to safer, higher ground and constructing modern houses for them.The CPU has activated its local structures to respond to incidents in the district during this rainy season@ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/drown-680x354.jpg",
            "description": "Leonard Ncube leonard.ncube@chronicle.co.zw AN eight-year-old boy from Nhlangano in Tsholotsho District, Matabeleland North drowned while attempting to cross a flooded Godzo stream near the Jahe area. The boy, who was playing with other children, was swept away by the strong current. The incident occurred in Nhlangano Village under Chief Magama. The child’s body was recovered […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "Mangezi faces uncertainty at SuperSport United as loan move to Pretoria Callies is considered",
            "url": "https://www.chronicle.co.zw/mangezi-faces-uncertainty-at-supersport-united-as-loan-move-to-pretoria-callies-is-considered/",
            "content": "Welldone Ndlovu, Online Reporter\n\nNINETEEN-YEAR-OLD Zimbabwean striker Nokutenda Mangezi, who joined SuperSport United from the Real Betis Academy in Zimbabwe at the beginning of the season, is struggling to secure a place in the team. Despite being registered, Mangezi has yet to score a goal, putting his position in jeopardy.\n\nAccording to KickOff, SuperSport United is considering loaning Mangezi to Pretoria Callies in the Motsepe Foundations National First Division.\n\nThis move would create space for Samir Nurkovi, who has been waiting for his paperwork to be finalised, granting him local player status due to his eligibility for permanent residency after living in South Africa for several years. Nurkovi was initially signed as a foreign player.\n\nMangezis contract with SuperSport United is set to expire in June.\n\n",
            "image_url": null,
            "description": "Welldone Ndlovu, Online Reporter NINETEEN-YEAR-OLD Zimbabwean striker Nokutenda Mangezi, who joined SuperSport United from the Real Betis Academy in Zimbabwe at the beginning of the season, is struggling to secure a place in the team. Despite being registered, Mangezi has yet to score a goal, putting his position in jeopardy. According to KickOff, SuperSport United […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "Crossborders for ED to donate solar-powered borehole to Beitbridge Hospital",
            "url": "https://www.chronicle.co.zw/crossborders-for-ed-to-donate-solar-powered-borehole-to-beitbridge-hospital/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA Group of cross-border transporters, operating under the banner Crossborders for Economic Development (Crossborders for ED), has pledged to mobilise resources to drill a solar-powered borehole to augment water supplies at Beitbridge District Hospital.The group has also committed to providing a water tank and offering additional support to the health institution, which has faced intermittent water supply challenges, adversely affecting the quality of care provided to patients.The 140-bed hospital serves a local population of 250 000, alongside approximately 13 000 people transiting through the town daily and others from neighbouring districts such as Gwanda, Mberengwa, and Mwenezi. In addition, the hospital handles an average of 350 baby deliveries per month, including caesarean sections, which require consistent and adequate water supplies.Crossborders for ED chairperson, Mr Blessing Mureyani, said the group had decided to collaborate with fellow transporters to help restore and enhance health services at the hospital.We have started mobilising resources, and our immediate plan is to drill one solar-powered borehole with a water tank, said Mr Mureyani.We believe this initiative is critical in complementing the Governments efforts to provide quality services at the hospital.He added: As Crossborders for ED, we are deeply concerned about the challenges faced by members of our community, which is why we are stepping in. We also intend to fundraise to provide further support to this vital institution, which serves not only Beitbridge but also a significant number of travellers, including cross-border transporters and visitors from various SADC countries.Mr Mureyani appealed to other community members to join in supporting the hospital to ensure the continuity of quality health services.In addition to their planned borehole project, the group has already donated over 500 plates and cups to the local correctional facility and 10 bicycles to traditional leaders in the district.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/kgjjkgb.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A Group of cross-border transporters, operating under the banner Crossborders for Economic Development (Crossborders for ED), has pledged to mobilise resources to drill a solar-powered borehole to augment water supplies at Beitbridge District Hospital. The group has also committed to providing a water tank and offering additional support to the health […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "South Africa border authorities intercept R500k Zimbabwe-bound contraband",
            "url": "https://www.chronicle.co.zw/2south-africa-border-authorities-intercept-r500k-zimbabwe-bound-contraband/",
            "content": "Thupeyo Muleya Beitbridge BureauSOUTH African border authorities on Saturday intercepted an assortment of goods worth an estimated R500 000 that were being smuggled into Zimbabwe via the Limpopo River in inflatable boats.\n\nThe Limpopo River is swollen and smuggling syndicates are using inflatable boats to smuggle goods between the two countries.\n\nLimpopo police spokesperson Lieutenant Colonel Stephen Thakeng said the suspects escaped to Zimbabwe in eight boats after being cornered by security officials.\n\nThe South African Police Service (SAPS) Operation Vala Umgodi National Intervention (Roving)Team has successfully thwarted a major smuggling operation along the Limpopo River, in the Musina policing area leading to the confiscation of goods valued at approximately R500 000, he said.\n\nOn the Saturday morning of, at around 11:20 AM, the team was conducting a routine patrol near Tshirundu village when they received a tip-off about approximately eight small boats loading goods.\n\nUpon noticing the police presence, the suspects quickly got into the boats and fled back into Zimbabwe, abandoning most of the goods behind.\n\nHe said the contraband included alcoholic beverages, energy drinks, baked goods, flour, and other consumer goods, along with a fridge.\n\nAll seized items have been registered at the Musina SAPS for further investigation and processing.\n\nThe development comes as Zimbabwean authorities are cracking down on smuggling syndicates operating between Zimbabwe and South Africa.\n\nThe crackdown is being led by the Ministry of Industry and Commerce, alongside the Zimbabwe Revenue Authority (Zimra), the Zimbabwe Republic Police, the Reserve Bank of Zimbabwe (RBZ), and the Consumer Protection Commission.\n\nThe goal is to halt the influx of illicit goods into local markets.\n\nRecent efforts have resulted in the interception of numerous intercity buses loaded with suspected smuggled goods.\n\nAccording to security officials, smugglers are avoiding the border and using the border flanks. They then load the goods into intercity buses or cargo trucks in Beitbridge before transporting them to various destinations in Zimbabwe.\n\nTo enhance surveillance, authorities are deploying high-tech security systems, including drone surveillance.\n\nSince the introduction of these systems and fast cargo scanners in January, Zimra has been able to intercept more people planning to smuggle imported goods.\n\nThe crackdown has intensified in known smuggling hotspots, with additional drones and scanners set to be deployed to other entry points like Forbes and Chirundu.\n\nEnds\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/bjb.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau SOUTH African border authorities on Saturday intercepted an assortment of goods worth an estimated R500 000 that were being smuggled into Zimbabwe via the Limpopo River in inflatable boats. The Limpopo River is swollen and smuggling syndicates are using inflatable boats to smuggle goods between the two countries. Limpopo police spokesperson […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "Zifa president to earn US$4 200 a month",
            "url": "https://www.chronicle.co.zw/zifa-president-to-earn-us4-200-a-month/",
            "content": "Online Reporter\n\nONE of the six candidates eligible for the Zifa presidency, stands to earn US$4 200 a month after the Confederation of African Football increased from US$1 700.THE Zifa president who takes over on January 25, will be entitled to US$50 000 a year from the Confederation of African Football as compensation.Zimbabwe will hold its elections for the Zifa board at the end of the month to bring a sad chapter of the local game to an end where for almost two years, there has not been a substantive board chosen by Assembly members.Lincoln Mutasa appointed by Fifa as head of a five-member Normalisation Committee has been in charge.In October of 2024, national association heads got a hefty hike to US$50 000 from US$20 000.The decision was taken unanimously by all 54-member countries last year.At the announcement, Caf president Patrice Motsepe called the US$50 000 insignificant.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Zifa-680x380.png",
            "description": "Online Reporter ONE of the six candidates eligible for the Zifa presidency, stands to earn US$4 200 a month after the Confederation of African Football increased from US$1 700. THE Zifa president who takes over on January 25, will be entitled to US$50 000 a year from the Confederation of African Football as compensation. Zimbabwe […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "The past can never be buried… Bulawayo man arrested for murder he committed 15 years ago",
            "url": "https://www.chronicle.co.zw/the-past-can-never-be-buried-bulawayo-man-arrested-for-murder-he-committed-15-years-ago/",
            "content": "Sinokubonga Nkala[emailprotected]IN a dramatic turn of events, a 39-year-old man has been apprehended for his alleged involvement in a 2010 murder.The incident unfolded during a brazen robbery at a local bottle store, where he and his accomplices unleashed violence, leading to the tragic death of a patron.On 14 April 2010, Peter Sithole (35) was enjoying a beer with others at a local bottle store when three armed men including the accused burst in.They fired shots into the ceiling and the crowd while bellowing orders for patrons to lie on the ground. Amid the pandemonium Peter Sithole was fatally shot.After the shooting, the aggressors leapt over the counter, making off with the till containing R528, as well as speakers and an amplifier. They also stole two cell phones before fleeing the scene.One of the aggressors, Thabani Solomon Mahlaba was apprehended in Zvishavane on 24 April 2010, following a shootout with detectives. He subsequently led authorities to his residence, where they seized two pistols, speakers, and an amplifier, linking him to the crime.Fifteen years after the crime, detectives received a tip on 11 January 2025, that the accused was planning a secret visit to his in-laws home in Nkulumane, Bulawayo, prompting police to act swiftly and apprehend him.In an official Press Statement Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele said, A search was carried out in his white Toyota Mark X resulting in the recovery of a black pellet pistol and a silver flip knife. He was also found in possession of a valid Zimbabwean plastic drivers license with his portrait in the name of Ryan Ncube.Same was interviewed about the whereabouts of his co-accused Shadreck Zvigo and he mentioned that he last saw him during the commission of the murder offence.\n\nShe appreciated members of the public for supplying information that led to the arrest of the accused person.We also warn the public that no matter how long one plans to flee after committing an offence, they should bear in mind that the long arm of the law will finally catch up with them.The accused person thought that he is clever by running away for 15 years not knowing that his case is still pending as they say Icala aliboli. We urge members of the public to desist from violent conduct as this lead to unnecessary loss of lives. We appeal to anyone with information that may lead to the arrest of Shadreck Zvigo to visit any nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com IN a dramatic turn of events, a 39-year-old man has been apprehended for his alleged involvement in a 2010 murder. The incident unfolded during a brazen robbery at a local bottle store, where he and his accomplices unleashed violence, leading to the tragic death of a patron. On 14 April 2010, Peter […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "Entumbane community unites to support orphans’ education",
            "url": "https://www.chronicle.co.zw/entumbane-community-unites-to-support-orphans-education/",
            "content": "Amos Mpofu[emailprotected]\n\nRESIDENTS of Entumbane have once again demonstrated their generosity and solidarity by helping four underprivileged children continue their education despite financial challenges that threatened to bar them from proceeding to secondary school.The children, who achieved impressive Grade Seven results last year, are now assured of a brighter future thanks to this community-driven initiative.\n\nThe project is spearheaded by local resident Mr Nkosikhona Mlilo, who is dedicated to supporting these children throughout their secondary education, enabling them to plan for better prospects. This charitable endeavour, unique in both the suburb and the wider Bulawayo area, is poised to make a transformative impact on the lives of talented but disadvantaged children.\n\nTwo colleges which agreed to take two orphans each who are being assisted by the Entumbane community.\n\nMr Mlilo reached out to two local institutionsZenith Christian College and Bright Future Collegeboth of which welcomed his request to provide the children with an opportunity to continue their studies. Each college has committed to supporting two children, ensuring they receive the same quality education as their peers.There is no formal committee for this project, said Mr Mlilo. Im simply the coordinator, and its the community that makes the donations. People contact me, and I collect the contributions. I approached the colleges, and Im grateful to Zenith Christian College, led by Mr Desire Maguta, and Bright Future College, led by Mr Ndethi, for agreeing to help. They understand the potential these children have, and they also recognise that as orphans, these children belong to the entire community.Mr Mlilo continues to tirelessly seek donations from both the local community and other potential supporters, hoping to expand the programme to include more children.My goal is to find more donors so that we can send even more orphans to school, he said. I speak to schools, and if they agree to participate, I then approach the community for contributions. I also use my personal contacts to gather support. The more people donate, the more orphans we can help. Its fulfilling to know that were making a difference at the community level.Mr Mlilo has a list of 15 orphans eager to attend school but unable to afford the fees.Whats particularly heart-breaking is that these children are exceptionally talented. For instance, two sisters recently enrolled passed their Grade Seven exams with outstanding resultsone with 10 units and the other with seven. Unfortunately, financial constraints almost stopped them from continuing their education. We appeal to more donors to help us support these children, he said.One beneficiary of the programme, Mrs Nokuthula Ncube, whose orphaned niece has now returned to school, expressed her heartfelt gratitude to the community.I am deeply thankful to the people of Entumbane, especially Mr Mlilo, for hearing our plea and ensuring our niece can go to school, she said. She lost her mother, and her father is unable to care for her. The community has truly shown love and care, and we are confident that she now has a bright future ahead. We pray that those who are donating will be blessed abundantly.This latest initiative follows another recent charitable effort in which Entumbane residents donated Christmas hampers to 50 disabled community members. The continued support for orphans and other vulnerable groups highlights the unwavering commitment of the Entumbane community to uplift those in need.Ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jnj.jpg",
            "description": "Amos Mpofu mpofuamos41@gmail.com RESIDENTS of Entumbane have once again demonstrated their generosity and solidarity by helping four underprivileged children continue their education despite financial challenges that threatened to bar them from proceeding to secondary school. The children, who achieved impressive Grade Seven results last year, are now assured of a brighter future thanks to this […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "Bulawayo High Court achieves case management turnaround, handles record numbers in 2024",
            "url": "https://www.chronicle.co.zw/bulawayo-high-court-achieves-case-management-turnaround-handles-record-numbers-in-2024/",
            "content": "Nqobile Tshili[emailprotected]THE High Court in Bulawayo has achieved a remarkable turnaround in case management, addressing long-standing concerns about delayed justice.In 2024, the court made significant strides, particularly in handling serious criminal and civil cases, marking a new era of efficiency and collaboration.Chief Justice Luke Malaba revealed that the court successfully handled 137 murder cases from the Midlands province, a feat made possible by the concerted efforts of multiple stakeholders.I extend my gratitude to the Prosecutor General, the Zimbabwe Law Society, and private lawyers for their active participation in the swift handling of these cases, he said.The courts achievements were not limited to criminal cases.Over 120 000 civil cases were processed last year, further underscoring the institutions commitment to restoring public confidence in the justice system.The Chief Justice also praised the collaborative efforts of various stakeholders in delivering justice in the Midlands region. This success demonstrates the power of partnerships in achieving efficient justice delivery, he noted.The High Court in Bulawayo, which had previously struggled with case backlogs, has become a model for improving judicial efficiency. The improvements are part of a broader strategy to address systemic delays across the countrys courts.As the judiciary looks ahead to 2025, the success of the High Court in Bulawayo serves as a blueprint for other regions grappling with similar challenges. It reflects a renewed commitment to ensuring justice is not only delivered but delivered promptly and fairly.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/5w345.jpg",
            "description": "Nqobile Tshili nqobile.tshili@chronicle.co.zw THE High Court in Bulawayo has achieved a remarkable turnaround in case management, addressing long-standing concerns about delayed justice. In 2024, the court made significant strides, particularly in handling serious criminal and civil cases, marking a new era of efficiency and collaboration. Chief Justice Luke Malaba revealed that the court successfully handled […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "Harare Courts split to ease case backlog as new complexes planned nationwide",
            "url": "https://www.chronicle.co.zw/harare-courts-split-to-ease-case-backlog-as-new-complexes-planned-nationwide/",
            "content": "Nqobile Tshili[emailprotected]IN a significant restructuring aimed at addressing case backlogs, Harare has been divided into two administrative courts: Harare North and Harare South Magistrate Courts.The split comes in response to the overwhelming number of cases handled by the citys magistrates courts, with Mbare Magistrate Court alone processing more cases than some entire provinces.Chief Justice Luke Malaba announced the changes as the 2025 legal year in Zimbabwe began this morning in Bulawayo, under the theme: Building Public Confidence in the Judiciary through Stakeholder Participation.\n\nHe said the division will improve efficiency and accessibility within the justice system.This adjustment will enable courts to deliver timely and effective justice by reducing congestion and streamlining case management, he said.The reforms are part of a broader effort to expand and modernise Zimbabwes judicial infrastructure.A new magistrate court is set to be constructed in Brunaberg, Matabeleland South, to address the regions growing legal needs. Additionally, the Gwanda Court Complex and Cowdray Park Court Complex, key projects in the justice systems expansion, are expected to be completed this year.These new facilities will bring justice closer to communities and ensure that no region is left behind in accessing judicial services, Chief Justice Malaba said.The changes reflect an ongoing commitment to improving the judiciarys efficiency, particularly in high-demand areas like Harare. The introduction of Harare North and South Magistrate Courts is expected to serve as a model for addressing similar challenges in other urban centres.With these developments, Zimbabwes judiciary is striving to balance the scales of justice by tackling systemic delays and ensuring equitable access to legal services across the nation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/sdfsdfs.jpg",
            "description": "Nqobile Tshili nqobile.tshili@chronicle.co.zw IN a significant restructuring aimed at addressing case backlogs, Harare has been divided into two administrative courts: Harare North and Harare South Magistrate Courts. The split comes in response to the overwhelming number of cases handled by the city’s magistrates’ courts, with Mbare Magistrate Court alone processing more cases than some entire […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        },
        {
            "title": "Man jailed for impregnating minor",
            "url": "https://www.chronicle.co.zw/man-jailed-for-impregnating-minor/",
            "content": "Lesley Chikudo[emailprotected]A 23-YEAR-OLD Bulawayo man has been sentenced to an effective 18 months in prison for impregnating a 15-year-old girl. The man, from Cowdray Park suburb was convicted of having sex with a minor by West Commonage magistrate, Mrs Lenia Khumalo.He was sentenced to 24 months imprisonment, with six months suspended for five years on the condition that he does not commit a similar offence within this period. In passing the sentence, Mrs Khumalo expressed concern over the prevalence of sexual offences, emphasising the need for the court to protect the girl child by imposing harsh sentences on perpetrators.Cases that involve sexual relationships with juveniles are now on the rise; there is a need to send a clear message to would-be offenders that the law does not tolerate such behaviour, she said.The prosecutor, Ms Mandrela Chisiiwa, stated that the incident occurred sometime in August last year when the girl visited Moyo at his residence.The complainant would visit the offender at his house and sleep with him, and this happened several times, she said.The court heard that the two would sleep together without protection until the complainant fell pregnant. The matter came to light when the complainant discovered that she was pregnant and informed her mother.A report was made to the police, leading to Moyos arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Lesley Chikudo chikudolesley@gmail.com A 23-YEAR-OLD Bulawayo man has been sentenced to an effective 18 months in prison for impregnating a 15-year-old girl. The man, from Cowdray Park suburb was convicted of having sex with a minor by West Commonage magistrate, Mrs Lenia Khumalo. He was sentenced to 24 months’ imprisonment, with six months suspended for […]",
            "time": "20:41",
            "date": "13 Jan 2025"
        }
    ]
}