{
    "news": [
        {
            "title": "THE RETURN OF THE NINJA: Bulawayo Chiefs appoint Javas as new CEO",
            "url": "https://www.chronicle.co.zw/the-return-of-the-ninja-bulawayo-chiefs-appoint-javas-as-new-ceo/",
            "content": "Raymond Jaravaza, Online Reporter\n\nITS full circle for Thulani Javas Sibanda after he retraced his way back to Bulawayo Chiefs as the club new chief executive officer.\n\nSibanda was recently in charge of Scottland FCs social media space.\n\nKnown for revolutionising local football social media space with Bulawayo Chiefs, earning the club the title of Twitter Kings, Sibanda announced his departure from the Harare-based team on Facebook and X (formerly Twitter).\n\nBulawayo Chiefs welcomed Sibanda in a short statement on Wednesday morning.\n\nWE HAVE A NEW CEO, Thulani Javas Sibanda. The Ninja is back\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/javas-1-630x380.jpg",
            "description": "Raymond Jaravaza, Online Reporter ITS full circle for Thulani ‘Javas’ Sibanda after he retraced his way back to Bulawayo Chiefs as the club new chief executive officer. Sibanda was recently in charge of Scottland FC’s social media space. Known for revolutionising local football social media space with Bulawayo Chiefs, earning the club the title of […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Bulawayo woman jailed for 2 years in US$4,100 housing stand scam",
            "url": "https://www.chronicle.co.zw/bulawayo-woman-jailed-for-2-years-in-us4100-housing-stand-scam/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 50-YEAR-OLD Bulawayo woman has been sentenced to 24 months in prison for defrauding another woman of US$4,100 in a failed housing stand deal.\n\nLucia Sibanda, of Pumula South suburb, was convicted of fraud and sentenced to 24 months imprisonment by Western Commonage magistrate Mrs Learnear Khumalo. However, eight months of the sentence were suspended for five years, on condition that she does not commit any offence involving dishonesty during that period.\n\nThe remaining 16 months were also suspended on the condition that she restitutes the complainant, Mrs Agnes Banda, a sum of US$3,400 through the clerk of court. Sibanda will only be released after full restitution has been made.\n\nIn sentencing her, Mrs Khumalo said fraud cases were on the rise in Bulawayo and there was a need to send a strong message to deter would-be offenders.The complainant said she suffered financially because of this. Cases involving dishonesty are on the increase in the city. There is a need to deter would-be offenders and show them that the law does not tolerate such behaviour, she said.\n\nAccording to the State, represented by Ms Mandrela Chisiiwa, the incident occurred in June 2024 when Mrs Banda approached Sibanda at her home, having been referred by someone who claimed Sibanda could assist her in acquiring a residential stand from Bulawayo City Council.\n\nSibanda claimed she had connections within the council and charged Mrs Banda US$4,100 for the stand. Mrs Banda initially paid US$100 and later cleared the balance in instalments, said Ms Chisiiwa.\n\nAfter completing the payments by the end of July last year, Mrs Banda requested receipts as proof of payment. Sibanda responded by sending a photo of a receipt via WhatsApp.\n\nMrs Banda then went to Cowdray Park housing offices to verify the receipt. Housing officers informed her that the receipt was fake, said the prosecutor.\n\nA total of US$4,100 had been paid, but only US$700 was recovered. The matter was reported to the police, leading to Sibandas arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 50-YEAR-OLD Bulawayo woman has been sentenced to 24 months in prison for defrauding another woman of US$4,100 in a failed housing stand deal. Lucia Sibanda, of Pumula South suburb, was convicted of fraud and sentenced to 24 months’ imprisonment by Western Commonage magistrate Mrs Learnear Khumalo. However, eight months of the […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Zimbabwean college athletes in US earn high praise",
            "url": "https://www.chronicle.co.zw/zimbabwean-college-athletes-in-us-earn-high-praise/",
            "content": "Online Reporter\n\nZimbabwes rising stars continue to make their mark on the US collegiate athletics scene this season, and their outstanding performances have earned the Governments glowing praise.\n\nDeputy Tourism Minister Tongai Mnangagwa has hailed the athletes as the pride of Zimbabwe for their record-breaking achievements that are putting the nation firmly on the global sports map.\n\nThe remarkable performances speak for themselves.\n\nSeveral Zimbabwean athletes are excelling in the US, particularly in track and field.\n\nMakanakaishe Charamba is a standout sprinter at Auburn University, achieving personal bests and competing in major NCAA championships.\n\nOther notable athletes include Vimbayi Maisvorewa, also at Auburn, who is ranked high in the world for the 400m and has qualified for NCAA championships. Donald Chiyangwa has shaterted national records and is just shy of the African record in the 300m.\n\nOther Zimbabwean athletes like Chengetayi Du Mapaya, Tinotenda Matiyenga, and Kundai Maguranyanga have contributed to high team rankings at Texas Christian University.\n\nThese young athletes are not just competing  they are dominating, Deputy Minister Mnangagwa said on the sidelines of the ongoing Zimbabwe Intwrnational Trade Fair.\n\nEvery time they step onto the track, they carry our flag high and remind the world what Zimbabweans are capable of. Their discipline, talent and relentless drive embody the spirit of our nation. We are immensely proud and will continue to support their journeys.\n\nThe ministers comments underscore how these athletic achievements transcend sport, serving as powerful ambassadors for Zimbabwes potential. With the NCAA Championships looming large on the horizon, the nations collegiate representatives have positioned themselves as genuine podium contenders. Their performances have already sparked serious conversations about possible Olympic medals, suggesting this might be just the beginning of Zimbabwes track and field renaissance.\n\nAs the season continues, one thing has become abundantly clear  these student-athletes are writing an exciting new chapter in Zimbabwes sporting history, one record-breaking run at a time.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vcx.jpg",
            "description": "Online Reporter Zimbabwe’s rising stars continue to make their mark on the US collegiate athletics scene this season, and their outstanding performances have earned the Government’s glowing praise. Deputy Tourism Minister Tongai Mnangagwa has hailed the athletes as “the pride of Zimbabwe” for their record-breaking achievements that are putting the nation firmly on the global […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Delta, Ingwebu’s sports sponsorships elevate ZITF experience, says Dep Min Mnangagwa",
            "url": "https://www.chronicle.co.zw/delta-ingwebus-sports-sponsorships-elevate-zitf-experience-says-dep-min-mnangagwa/",
            "content": "Online Reporter\n\nThe Zimbabwe International Trade Fair (ZITF) isnt just about commerce and industryits also a stage for thrilling sporting spectacles that captivate crowds and showcase local talent.\n\nThis year, Deputy Minister of Tourism and Hospitality Industry, Tongai Mnangagwa, has singled out beverage giants Delta Beverages and Ingwebu Breweries for their pivotal roles in sustaining two of the events most electrifying attractions: the 4-minute mile race and tug-of-war competitions.\n\nIn a statement, Deputy Minister Mnangagwa lauded the companies for their unwavering commitment to sports development, which he said enhances the ZITFs appeal as a must-attend event on Zimbabwes cultural and economic calendar.\n\nDelta Beverages, a longstanding sponsor of athletics in Zimbabwe, has once again thrown its weight behind the 4-minute mile challenge a grueling test of speed and endurance that harks back to the legendary feats of runners like Roger Bannister. The race, a highlight at ZITF, draws elite athletes and enthusiastic spectators, adding a pulse of adrenaline to the trade fairs lineup.\n\nThe 4-minute mile is more than just a race; its a symbol of pushing boundaries, Hon. Mnangagwa said.\n\nDeltas support ensures that this event remains a marquee attraction, inspiring young athletes and entertaining crowds.\n\nMeanwhile, Ingwebu Breweries, the Bulawayo-based traditional beer manufacturer, continues to champion tug-of-war, a sport deeply rooted in Zimbabwean communal culture. The raw, visceral contest of strength between rival teams has become a fan favorite at ZITF, blending competition with nostalgia.\n\nTug-of-war is more than just a gameits a celebration of teamwork, heritage, and sheer determination, Deputy Minister Mnangagwa remarked. Ingwebus dedication to preserving and promoting this sport ensures that it remains a cornerstone of our national exhibitions.\n\nThe Deputy Tourism Minister emphasised that such sponsorships are vital in bridging commerce, encouraging sports tourism and community engagement, helping to position ZITF as a multifaceted event that goes beyond trade.\n\nWhen companies like Delta and Ingwebu invest in sports, theyre not just funding eventstheyre fostering national pride, creating unforgettable experiences, and driving sports and domestic tourism, he said.\n\nTheir contributions amplify the ZITFs status as a premier showcase of Zimbabwean talent and enterprise.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Dep-Min-Tongai-Mnangagwa-at-JMN-Nkomo-airport-1.j4pg.jpg",
            "description": "Online Reporter The Zimbabwe International Trade Fair (ZITF) isn’t just about commerce and industry—it’s also a stage for thrilling sporting spectacles that captivate crowds and showcase local talent. This year, Deputy Minister of Tourism and Hospitality Industry, Tongai Mnangagwa, has singled out beverage giants Delta Beverages and Ingwebu Breweries for their pivotal roles in sustaining […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Value Creation Challenge 5 Launches Nationwide clinics",
            "url": "https://www.chronicle.co.zw/value-creation-challenge-5-launches-nationwide-clinics/",
            "content": "Zimpapers Business Hub\n\nThe Value Creation Challenge (VCC) is conducting a series of nationwide business clinics aimed at helping entrepreneurs refine their business models and uncover new growth opportunities.\n\nThe Value Creation Challenge 5th Edition is a flagship nationwide incubation program spearheaded by the Eight2Five Innovation Hub, and powered by Old Mutual Zimbabwe in partnership with a distinguished group of collaborators.\n\nThese include the British Council, the British Embassy, the Zimbabwe Agricultural Development Trust (ZADT), SNV, Delta Corporation, the Swiss Embassy, and the Embassy of Sweden.\n\nIn a statement, Ms Lillian Mbayiwa, Group Marketing, Public Affairs and Sustainability Executive at Old Mutual Zimbabwe, underscored the importance of the initiative.\n\nThe Value Creation Challenge is a testament to our commitment to nurturing homegrown talent. We believe that with the right support, these entrepreneurs can not only succeed but also contribute significantly to the economy.\n\nAs the program celebrates its fifth anniversary, it remains focused on empowering startups and early-stage businesses by providing critical resources and support structures.\n\nOver the years, VCC has played a pivotal role in guiding entrepreneurs through the complex process of launching and scaling innovative ventures.\n\nSpecifically designed for entrepreneurs with innovative prototypes or minimum viable products (MVPs), the program targets businesses in the early market stage.\n\nIt accelerates growth through strategic business development, product incubation, and connections to valuable networks  including potential investors and pre-seed funding opportunities.\n\nCurrently, the VCC team is traveling across Zimbabwe to conduct business clinics aimed at helping entrepreneurs refine their business models and discover new opportunities, the statement added. The business clinics have already taken place in locations such as Kadoma, Murehwa, Mutare, Masvingo, Mwenezi, Zvishavane, Gweru, Gokwe, Harare, Chinhoyi, Marondera, Nyanga, and Rusape.\n\nIn May, the team will bring the Business Clinics to Matabeleland, focusing on Bulawayo, Esigodini, Matopos, and Lupane. By engaging directly with entrepreneurs, VCC provides personalized guidance and fosters a sense of community among participants, added the statement.\n\nMs Mbayiwa further emphasised the broader impact of empowering local innovators:\n\nThe Value Creation Challenge (VCC 5) is not just about supporting businesses, its about fostering a culture of innovation and resilience in Zimbabwe. We are excited to witness the transformative impact that the participating businesses will have on their communities.\n\nThe VCC continues to position itself as a dynamic force for entrepreneurial development in Zimbabwe, promoting sustainability, inclusivity and innovation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/5y.jpg",
            "description": "Zimpapers Business Hub The Value Creation Challenge (VCC) is conducting a series of nationwide business clinics aimed at helping entrepreneurs refine their business models and uncover new growth opportunities. The Value Creation Challenge 5th Edition is a flagship nationwide incubation program spearheaded by the Eight2Five Innovation Hub, and powered by Old Mutual Zimbabwe in partnership […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "European Union makes whirlwind ZITF return",
            "url": "https://www.chronicle.co.zw/european-union-makes-whirlwind-zitf-return/",
            "content": "Peter Matika, Senior Reporter\n\nA high-powered delegation of seven ambassadors from the European Union (EU), will visit Bulawayo this week for key investment talks as the bloc commits to restoring vibrant investment and trade relations with Zimbabwe, demonstrated by the increased participation at the ongoing Zimbabwe International Trade Fair (ZITF).\n\nThe engagements will be followed by the launch of the first-ever EU-Zimbabwe Business Forum, aimed at consolidating win-win private sector partnerships and bolstering mutually beneficial trade gains.The forum has been slated for May 20 to 22 this year and will be held in Harare.\n\nThe development reflects positively on the Second Republics economic diplomacy-focused Engagement and Re-Engagement Policy, which has seen Zimbabwe normalise relations with the global community.\n\nThe increased EUs presence at the ZITF also underscores a broad, collaborative effort to accompany Zimbabwe towards its ambition of becoming an upper-middle income society by 2030.\n\nThe EU is back at the ZITF for the third consecutive year, with its now-flagship pavilion being one of the largest international stands.\n\nFollowing two consecutive wins for Best and Most Outstanding Foreign Display, the EU says its return to ZITF this year is significant in showcasing a strengthened focus on private-sector partnerships and sustainable investment under the Global Gateway Strategy.\n\nEU Ambassador to Zimbabwe, Mr Jobst von Kirchmann expressed excitement over the blocs return to ZITF this year with a strengthened focus on private sector engagement, which is critical in unlocking formidable business growth.\n\nPrivate sector engagement is vital to every economy. Through our Global Gateway strategy, the EU has placed business development at the core of economic development, job creation and prosperity, he said.\n\nBuilding on the success of 2024, the EU said its pavilion features an expanded #TeamEurope presence, with contributions from several EU member states, including France, Germany, Italy, Sweden, Romania, Netherlands, Belgium representing European member states, European businesses and implementing partners.\n\nThe EU stand also hosts various #TeamEurope projects underway in Zimbabwe, it said in a statement.This year, during ZITF week, the EU launches a new phase of its Global Gateway campaign with the theme: Silani, Tinemi, EU with you that will raise awareness on the impact of the Global Gateway initiatives falling under the theme: The European Union and Zimbabwe, partnering for inclusive and sustainable business development.\n\nIn line with this years ZITF theme: Industrialisation: Crafting an Integrated Economic Landscape, the EU said the ZITF thrust closely aligns with the blocs commitment to inclusive and sustainable business development in Zimbabwe.\n\nIt also reinforces the shared ambition to promote an integrated and competitive economic landscape goals that are central to Zimbabwes National Development Strategy 1 (NDS1) and Vision 2030, said the EU.\n\nIn this context, the EUs increased focus on private sector engagement, highlighted at this years Pavilion, sets the stage for meaningful co-operation, ahead of the first ever upcoming EU-Zimbabwe Business Forum to be held from May 20  22, 2025 in Harare, which will convene public and private sector stakeholders to unlock further investment opportunities.\n\nIn tandem with the improving diplomatic relations between the two partners, the EU has vowed to continue its long-term commitment to growing investments in the private sector through intermediate lending facilities.\n\nFor instance, in the last three years, the EU said it has extended financing to Zimbabwean commercial banks by EU financial institutions (European Investment Bank and Proparco) to about 90 million comprising intermediate credit facilities, portfolio guarantees, and trade finance.\n\nThis partnership between the EU and Zimbabwean banks is a prime example of our collective efforts to create jobs, promote financial inclusion and ultimately contribute to sustainable economic growth, said the bloc.\n\nEuropean Investment Bank\n\nFurthermore, the EU-Zimbabwe Economic Partnership Agreement (EPA) and the EUs Global Gateway, offer a framework for increased trade and investment, which presents a great opportunity to Zimbabwean companies who have the possibility to export to the EU on a 100 percent duty-free, quota-free basis.\n\nThe agreement offers Zimbabwean companies the possibility to modernise and transform their manufacturing processes through the importation of machinery duty-free from Europe, while allowing Zimbabwean companies to export duty and tariff free to the EU.\n\nWith a trade volume of US$700 million, and a positive trade balance in favour of Zimbabwe, this is a significant area of cooperation as the EU represents Zimbabwes fifth-largest trading partner and number one destination for horticultural exports, said the bloc.\n\nIn a common space, the EU will feature information about the European Unions trade and investment opportunities in Zimbabwe alongside other EU member States, this year being Italy, France, The Netherlands, Sweden, Germany, Romania and Belgium, it said.\n\nAs the ZITF progresses, the EU has said its Pavilion will be a meeting and exchanging point between European and Zimbabwean stakeholders on trade and investment where visitors can access information on: export requirements, support to agriculture machinery imports, technical assistance, lending facilities with the European Investment Bank, as well as locating European business partners and exploring new markets.\n\nThe potential for growth of trade between Zimbabwe and the EU is substantial, and visitors to the #TeamEurope stand will gain valuable insights into maximizing the benefits of current free trade arrangements and much more, said the bloc.\n\nThe EU Pavilion will also come alive with a series of interactive activities and engagements led by the EU Delegations Global Gateway Ambassadors.\n\nThe #TeamEurope Pavilion also promises to be a dynamic hub for strengthening Zimbabwe-EU trade and investment links.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cgfeds.jpg",
            "description": "Peter Matika, Senior Reporter A high-powered delegation of seven ambassadors from the European Union (EU), will visit Bulawayo this week for key investment talks as the bloc commits to restoring vibrant investment and trade relations with Zimbabwe, demonstrated by the increased participation at the ongoing Zimbabwe International Trade Fair (ZITF). The engagements will be followed […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Government ups preparations for successful winter cropping",
            "url": "https://www.chronicle.co.zw/government-ups-preparations-for-successful-winter-cropping/",
            "content": "Nqobile Bhebhe, Zimpapers Business Hub\n\nGOVERNMENT has stepped up preparations for a successful winter wheat production, by ensuring that critical inputs are delivered to farmers on time.\n\nLast year, the country achieved a record-breaking wheat harvest of 563 961 tonnes, surpassing the previous years 467 000 tonnes.\n\nThis marked the highest wheat yield since the advent of commercial wheat farming in 1966, securing Zimbabwes wheat self-sufficiency for the third consecutive year.\n\nRiding on this momentum, Zimbabwe seeks to leverage the upcoming winter cropping season to further expand output.\n\nSpeaking yesterday at the Winter Crop Revolution Conference in Bulawayo, which was hosted by the Zimpapers Group, in partnership with the Ministry of Lands, Agriculture, Water, Fisheries, and Rural Development, chief director in the ministry, Mr Leonard Munamati, said it was critical for the country to adequately prepare.\n\nThe recent record-breaking wheat harvest of 563 961 metric tonnes, surpassing last years 467 000 metric tonnes against the national requirement of 360 000 metric tonnes, is a testament to our commitment to sustainable food production, he said.\n\nThe country has made remarkable strides in winter crop production, securing its place as a formidable agricultural force.\n\nBuilding on this success, the ministry, in collaboration with Zimpapers and other key stakeholders/partners, now seek to expand this achievement to potatoes, barley and other vital winter crops in the upcoming 2025 planting season, he said.\n\nMr Munamati said the consumption basket now largely includes potatoes, essential to Zimbabwes food security, offering nutritious and affordable food nationwide.\n\nAs such, this conference serves as a platform to explore strategies to sustain our successes in wheat production while scaling up the cultivation of potatoes and other winter crops, he said.\n\nOur collective goal is to increase wheat production to 600 000MT this season, by expanding the cultivated area to 120 000ha and improving productivity from 4.7t/ha to 5t/ha.\n\nVarious stakeholders including Arda  estates, irrigation schemes, Joint Ventures banks (AFC, CBZ Agro-Yield, NMB), PIP; self-financed farmers; and FCCA  are playing a crucial role in achieving this milestone.\n\nAdditionally, our Wheat-Based Food Security Strategy aims to meet national wheat demand, generate surplus for export and stablish a strategic wheat reserve of 250 000MT, as approved by the Cabinet.\n\nMr Munamati said on barley production, the country was targeting 6 500ha, with an estimated yield of six tonnes per hectare, translating to 39 000mt.\n\nPotato production is set to cover 8 750ha, with an ambitious yield target of 27t/ha, culminating in 236 250mt.Achieving these production goals requires critical enablers, including reliable power supply, with wheat production clusters ring-fencing 150 megawatts for winter cropping, adequate water resources, with Zinwa ensuring seasonal billing and efficient irrigation management.\n\nAccess to essential inputs, such as high-quality seeds, fertilisers, fuel and mechanisation, financial support, ensuring timely farmer payments and adequate funding for expansion, enhanced security, infrastructure development and land management is critical.\n\nMore importantly, there is need to strengthen partnerships amongst government, farmers, processors, academia, and industry stakeholders, which is the backbone for these enablers.\n\nThrough these partnerships, working together, Zimbabwe is poised to achieve Vision 2030, ensuring food security for every household, everywhere, everyday, said Mr Munamati.\n\nIn his remarks during the conference, Zimpapers Intake Editor in Bulawayo and Acting Principal of the Zimpapers Training Institute, Limukani Ncube, stressed the need for more collaboration, innovation and shared learning.\n\nWe are truly delighted to have such a dedicated group of Government officials, farmers, researchers, agronomists, policymakers, and industry leaders gathered here today, united by a shared commitment to advancing winter crop production, said Ncube.\n\nThis conference is not just an event  its a platform for collaboration, learning, and innovation, he reiterated.Ncube said as Zimbabwe faces increasingly complex climate conditions, shifting market dynamics and mounting pressure on agricultural systems, there is a pressing need to focus on sustainable and high-yield winter cropping strategies.\n\nAs we face evolving climate conditions, market dynamics and growing demands on our agricultural systems, the importance of resilient, productive, and sustainable winter cropping has never been greater, he said.\n\nThe conference explored the latest research, cutting-edge technologies, and practical strategies that are shaping the future of winter crop production in Zimbabwe.\n\nThe one-day conference gathered to a broad cross-section of agricultural stakeholders, including farmers, tertiary institutions, seed companies, agricultural parastatals, and representatives from water and power utilities.\n\nThe gathering sought to strengthen collective understanding of both the challenges and untapped opportunities in Zimbabwes winter cropping sector, with a particular focus on actionable, scalable solutions to enhance productivity and food security.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fgset.jpg",
            "description": "Nqobile Bhebhe, Zimpapers Business Hub GOVERNMENT has stepped up preparations for a successful winter wheat production, by ensuring that critical inputs are delivered to farmers on time. Last year, the country achieved a record-breaking wheat harvest of 563 961 tonnes, surpassing the previous year’s 467 000 tonnes. This marked the highest wheat yield since the […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Mangwe, Bulilima tobacco farmers get Timb thumbs up",
            "url": "https://www.chronicle.co.zw/mangwe-bulilima-tobacco-farmers-get-timb-thumbs-up/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nFARMERS in the Mangwe and Bulilima districts involved in a pioneering commercial tobacco farming project, have been given the thumbs up by the Tobacco Industry and Marketing Board (Timb), in recognition of their work to spread tobacco production across Zimbabwe.\n\nThe initiative, which has spread to several villages in the Matabeleland Province, is now in its second season. In the 2023/24 season, 17 villagers joined the pioneer tobacco production project launched at Syringavale Farm, Marula in Mangwe District.\n\nThe project has now grown to accommodate over 170 farmers, who heeded the call to switch from traditional small grains and maize to commercial tobacco farming.\n\nIn the 2024/25 tobacco season, the project has expanded to villages deep in the Mangwe District, including areas such as Ingwizi and Tshitshi. Additionally, more farmers from the neighbouring Bulilima District have joined the project.\n\nTobacco Industry and Marketing Board\n\nTobacco is predominantly grown in Mashonaland provinces, with only a few farmers involved in the Midlands Province and a sprinkling in the Matabeleland regions, which major in cattle ranching, doing the crop.\n\nTimb said the expansion of tobacco farming beyond the traditional strongholds of Manicaland and the Mashonaland provinces was a potential game-changer in changing the national economic balance.\n\nThe Tobacco Industry and Marketing Board (Timb) is proud to announce a significant milestone in the decentralisation of tobacco production in Zimbabwe. For the second consecutive season, tobacco is being successfully grown in Marula, Mangwe District, Matabeleland South, an important step in expanding the crop beyond its traditional strongholds in Manicaland and the Mashonaland provinces.\n\nThis regional expansion is more than a geographical shift, it represents Timbs commitment to inclusive growth, sustainability and national economic balance, said Timb in a statement.\n\nTimb said a local tobacco sales floor that it approved and inspected had been established in Mangwe.Small-scale farmers are currently growing 84 hectares of Natural Cured Virginia (NCV) tobacco under a contract system with Atlas Agri, one of Zimbabwes leading tobacco contractors. The contractor has also established a local tobacco sales floor, which has been inspected and approved by Timb and will facilitate sales this season.\n\nThe establishment of a local tobacco sales floor in the southern region will drastically reduce the distance farmers must travel to market their harvest, lowering costs and increasing access to markets, said Timb.\n\nUnlike traditional Flue-cured Virginia (FCV) tobacco, the one being grown in Marula requires no firewood or coal for curing. Farmers use sunshades and drying racks, which significantly reduce production costs and environmental impact, making the crop a sustainable option.\n\nBy removing the need for curing fuel, the tobacco in Mangwe offers a cost-effective and climate-smart alternative. The tobacco produced still shares the same chemical composition and smoking characteristics as flue-cured tobacco, offering buyers a viable, high-quality product.\n\nTimb is exploring solar-powered borehole systems to improve seedbed irrigation for the 2025/26 season. With proper infrastructure, training and support, Timb said, Matabeleland South Province had the potential to become a force to be reckoned with in Zimbabwes tobacco industry.\n\nUnder Timbs Tobacco Value Chain Transformation Plan, which aims to grow national production to 300 million kilogrammes by 2025, tobacco farming in the southern region is key to meeting the target. As of April 16, the country had sold 81 million kilogrammes of tobacco worth US$279 million, averaging US$3.43 per kg, against a target of 280 million kilogrammes.\n\nWomen make up the majority of local farmers, who are part of the tobacco revolution in Mangwe and Bulilima districts. One such female farmer is Mrs Ellen Sibanda, a first-time tobacco farmer at Greenfield Farm, who planted half a hectare for a start.\n\nI started planting on December 17, 2024 and in a week, I had planted 8 300 plants, although the figure fell short of my target of over 9 000 plants. Tobacco farming is hard, but together with the one employee that I hired, we persevered and finished planting on time as advised by Mr Rodrick Musiiwa, Mrs Sibanda told Chronicle two months ago.\n\nMr Musiiwa is a tobacco specialist, who has been leading the tobacco revolution in Mangwe and Bulilima since the inception of the pioneer project two years ago.\n\nAnother farmer, Mrs Sibonele Mathe, planted 14 900 tobacco plants on one hectare and is confident she will reap the rich pickings of the cash crop.\n\nIm a first-time tobacco farmer and I was inspired to try the crop when I walked past a tobacco farm at Syringavale Farm in Marula, last year. I told other villagers that I would try tobacco farming but they did not take me seriously.\n\nThere was a time when we had a long dry spell and I almost lost hope. We are happy now because we have been receiving good rains during the past few weeks. Im hopeful that we will get a good harvest, said Mrs Mathe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fgf.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.com FARMERS in the Mangwe and Bulilima districts involved in a pioneering commercial tobacco farming project, have been given the thumbs up by the Tobacco Industry and Marketing Board (Timb), in recognition of their work to spread tobacco production across Zimbabwe. The initiative, which has spread to several villages in the Matabeleland Province, […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Miss & Mr Rural Zimbabwe bring tribal pride to ZITF",
            "url": "https://www.chronicle.co.zw/miss-mr-rural-zimbabwe-bring-tribal-pride-to-zitf/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nTHE Miss and Mr Rural Zimbabwe pageant is proudly representing the 16 tribes of Zimbabwe at this years edition of the Zimbabwe International Trade Fair (ZITF), underway at the Zimbabwe International Exhibition Centre in Bulawayo.\n\nTheir vibrant stand attracts immediate attention, thanks to the array of cultural dance attire worn by the models, each proudly showcasing the heritage of the tribe they represent. The display is adorned with traditional reed mats, crocheted hats and a variety of utensils typical of a rural African homestead.\n\nAccording to Sipho Mazibuko, founder of the pageant, the initiative aims to celebrate and educate the world about Zimbabwes rich and diverse cultural heritage.\n\nWere here to showcase the richness of Zimbabwean culture, and Ive brought along models, who represent 16 of the countrys tribes. We have representatives from the Kalanga, Xhosa, Tonga, Ndebele, Ndau, Sotho, Jahunda, and Karanga communities, with more models expected to arrive from their respective rural homes, said Mazibuko.\n\nMany of the participating models expressed their excitement and gratitude at being part of the event, which, for most, marks their first time attending the exhibition.\n\nMbwalimuumi Simugwagwa, a finalist for Mr Rural Zimbabwe Matabeleland North from Binga, expressed his appreciation for the opportunity.\n\nIm grateful to be part of this pageant. As rural youth, were often overlooked and many of us face financial challenges that hinder our ability to pursue further education. This often pushes some of my peers towards risky paths, such as illegal mining or immoral behaviour, out of desperation.\n\nMusawenkosi Nkala from Tshabanda in Tsholotsho said her participation is inspired by a passion for combating drug and substance abuse among rural youth, while also promoting Kalanga culture.\n\nIve seen many of my peers fall victim to alcohol and drug abuse. In my village and neighbouring communities, many young people also lack access to basic amenities like education, clean water and decent shelter, which is a violation of their rights, said Nkala.\n\nThrough this pageant, weve been given a platform to shine and access opportunities usually reserved for urban youth. Its a stepping stone towards achieving my dreams and building a career. Weve even been introduced to scholarship opportunities and skills development programmes to help us create sustainable futures.\n\nDeborah Munkuli from Hwange, representing the Nambya culture, echoed similar sentiments.\n\nShe said the pageant had not only allowed her to showcase her cultural identity, but also offered the chance to network with her urban counterparts and highlight her talents.\n\nRepresenting the Xhosa tribe, Mbongeni Hadebe from Mbembesi said the pageant helped him discover a hidden talent, modelling.\n\nI never knew I had it in me until I joined this pageant. If I win Mr Rural Zimbabwe, Ill use the title to empower young people in my community, advocate against drug abuse, and push for the establishment of rehabilitation centres in rural areas.\n\nIf we dont address these issues now, we risk losing an entire generation.He added, This platform has given me a sense of purpose. I want to inspire other young people to embrace our culture and believe in their dreams.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dfas.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com THE Miss and Mr Rural Zimbabwe pageant is proudly representing the 16 tribes of Zimbabwe at this year’s edition of the Zimbabwe International Trade Fair (ZITF), underway at the Zimbabwe International Exhibition Centre in Bulawayo. Their vibrant stand attracts immediate attention, thanks to the array of cultural dance attire worn by the […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Pope death a global blow — President",
            "url": "https://www.chronicle.co.zw/pope-death-a-global-blow-president/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nPOPE Francis death is a global blow as his voice transcended the boundaries of the Vatican to touch hearts and minds across the world, President Mnangagwa has said.\n\nPope Francis died on Monday morning at the Vatican City in Rome, Italy, aged 88. In a condolence message, addressed to the acting Head of the Vatican, His Holiness Cardinal Kevin Farrell, yesterday, the President said the pontiff had greatly impacted global spirituality and moral leadership. He described him as a dedicated servant of the Apostolic See.\n\nIt is with a heavy heart and profound sadness that I extend, on behalf of the Government and people of the Republic of Zimbabwe, as well as on my own behalf, our most sincere and deepest condolences on the passing of The Holy Father, His Holiness, Pope Francis.\n\nIn this solemn hour, the world reflects, with reverence, on the life and legacy of a devoted servant of the Apostolic See, who dedicated himself to the service of God and humanity at large, President Mnangagwa said.\n\nPresident Mnangagwa\n\nHe highlighted how Pope Francis spirit of grace and theological insight had elevated the spiritual consciousness of the world.\n\nThe late Pope, President Mnangagwa said, had left behind a legacy that will continue to inspire future generations.\n\nHis voice, which resonated within and beyond the hallowed walls of the Vatican, shall, forever, remain an embodiment of his spirit of grace, moral leadership and theological insight that uplifted the spiritual consciousness of our time.\n\nAs we join you in this time of mourning, we pray that Almighty God grant eternal rest to his soul and give the entire Catholic family strength and comfort to overcome this loss.\n\nPlease accept, Your Holiness, the assurances of my sympathy and highest consideration, said the President.The Pope was admitted to the Agostino Gemelli Polyclinic Hospital in mid-February due to bronchitis.\n\nHis health worsened, and by the end of February, he was diagnosed with bilateral pneumonia. After spending 38 days in hospital, he returned to his residence at Casa Santa Marta in the Vatican, where he later passed away.\n\nAgostino Gemelli Polyclinic Hospital\n\nTomorrow, the Popes body will be moved to St Peters Basilica for public mourning. His funeral will take place at the Vatican on Saturday. Tributes continue pouring in from across the world. Pope Francis, born Jorge Mario Bergoglio on December 17, 1936, in Argentina, was known for his humility and progressive views. He was a champion of interfaith dialogue and environmental stewardship.\n\nHis advocacy for the poor resonated with many, making him a beloved figure beyond the Catholic Church.\n\nAs the eldest of five children, he grew up in a loving family that instilled strong values in him from an early age.\n\nIn 1969, he was ordained as a Jesuit priest, embarking on a path that would lead him to significant challenges and triumphs. During Argentinas brutal dictatorship from 1976 to 1983, he took on the leadership of the Jesuit order in the country, navigating a perilous landscape where faith and courage were paramount.\n\nHis dedication and leadership earned him the position of Archbishop of Buenos Aires in 1998. Just a few years later, in 2001, he was elevated to cardinal by Pope John Paul II, marking a pivotal moment in his ecclesiastical career.On March 13, 2013, he was elected the 266th pope of the Roman Catholic Church, taking the name Francis.\n\nThis choice was significant; he became the first pope from the Americas, the first to hail from the Jesuit order, and the first to adopt the name of St. Francis of Assisi, a symbol of humility and compassion.\n\nPope Franciss commitment to humility and simplicity was evident even before his papacy.As Archbishop, he chose to forgo the luxuries enjoyed by his predecessors, opting to ride the bus, cook his own meals, and regularly visit the slums of Buenos Aires.\n\nThis lifestyle of simplicity continued as a Pope. He lived in a Vatican hotel instead of the opulent Apostolic Palace, wore his old orthotic shoes instead of the traditional red loafers, and used compact cars, setting a powerful example for the clerical community.\n\nThroughout his papacy, Francis made headlines for his efforts to promote peace and dialogue. Notably, in 2021, he became the first pope to visit Iraq, where he met with the countrys top Shiite Muslim cleric, fostering interfaith understanding and co-operation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/webRNS-Pope-Francis1-091719-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau POPE Francis’ death is a global blow as his voice transcended the boundaries of the Vatican to touch hearts and minds across the world, President Mnangagwa has said. Pope Francis died on Monday morning at the Vatican City in Rome, Italy, aged 88. In a condolence message, addressed to the acting […]",
            "time": "09:46",
            "date": "23 Apr 2025"
        }
    ]
}