{
    "news": [
        {
            "title": "WATCH: Zvikomborero Sibanda’s body arrives at Mpopoma family home as mourners pay final respects",
            "url": "https://www.chronicle.co.zw/watch-zvikomborero-sibandas-body-arrives-at-mpopoma-family-home-as-mourners-pay-final-respects/",
            "content": "Sipepisiwe Moyo/Mbulelo Mpofu\n\nThe late Zvikomborero Sibandas body has arrived at the family home in Mpopoma, Bulawayo, where it is lying in state ahead of the burial service at Athlone Cemetery tomorrow.\n\nThe burial service is scheduled for 8am at the Salvation Army Mpopoma branch.\n\nChronicle Showbiz visited the family home, where neighbours, friends, and relatives had gathered to bid farewell to the late veteran broadcaster.\n\nHer friends, who spoke to the publication, shared that Sibanda  popularly known as Kombo or Zviko  was a kind and considerate person who was always there for them in both good and bad times.\n\nBarbara Samudzi Katsande, who met Zviko in high school and later lived with her in South Africa, reflected on their friendship.\n\nWe were together in South Africa, and I never thought shed leave us so soon, Katsande said.\n\nIll always miss the moments I spent with her. She was a kind friend who was always there. She had a big heart and was very caring.\n\nMoreblessing, another close friend, shared how deep their bond was.\n\nI first met Zviko on an airplane to China. Ever since then, we became close. I didnt only lose a friend, but a mother to my son, as she always preferred to be called by my sons name, Mai Gary.\n\nGo well, my friend, till we meet again, she said.\n\nAnother friend, Silibaziso Chizwina, described Kombo as a bubbly and full-of-life individual who maintained great working relationships with everyone.\n\nHer high school classmate, Nyasha Museki, explained how much of an influence Kombo was to her.\n\nIn 1993, I transferred from St Francis and Claire Secondary School to SOS Herman Gmeiner Secondary School. Thrust into Form 3A, I met a lot of new friends and classmates, and among them was Zvikomborero Sibanda.\n\nShe was the younger sister of our teacher, Farasina Sibanda. Kombo, as we used to call her, was a friend to all and an enemy to none. She was ever-smiling, a thorough student who competed with the boys, and an incredibly smart and highly intelligent person.\n\nShe was one of our top students, earning multiple As and passing all her subjects. After our Ordinary Level exams, we parted ways, only for me to later hear that she was studying Journalism at Harare Polytechnic. Soon after, I saw her on television as the Midlands Bureau Chief for ZBC.\n\nI later ran into her in town, driving a nice Mazda. Casually, I asked where she was working, and she told me she was with Noczim doing PR work. She was truly a torchbearer in terms of career advancement for our classmates, she said.\n\nMuseki also shared that earlier this month, she had texted Kombo to ask about her whereabouts and learnt that she was back in Bulawayo. They had planned to meet in Harare, but that meeting never happened.\n\nThat was our last conversation, and I had no idea she was unwell.\n\nPublic relations specialist Lennox Mhlanga, who has over two decades of experience in the field, described Kombo as a lively person whose personality will be sorely missed.\n\nZvikomborero was a very lively and engaging person who made everyone around her feel at ease.\n\nIts an essential trait in broadcasting to make your interview subjects comfortable. Kombo was a natural at this, which explains why she touched so many lives throughout her career.\n\nShe was an endearing friend and confidante to those in her circle. Even when she was in pain, she kept everyones spirits high. She will be deeply missed, he said.\n\nZvikomborero Sibanda passed away on Wednesday morning after battling an illness for years. Mourners are gathered at Block 75/2300, Mpopoma.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vdfg.jpg",
            "description": "Sipepisiwe Moyo/Mbulelo Mpofu The late Zvikomborero Sibanda’s body has arrived at the family home in Mpopoma, Bulawayo, where it is lying in state ahead of the burial service at Athlone Cemetery tomorrow. The burial service is scheduled for 8am at the Salvation Army Mpopoma branch. Chronicle Showbiz visited the family home, where neighbours, friends, and […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "Apostolic Faith duo kills man who stops them from sprinkling “holy ashes”",
            "url": "https://www.chronicle.co.zw/apostolic-faith-duo-kills-man-who-stops-them-from-sprinkling-holy-ashes/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nTwo men from Kadoma have been arrested for allegedly killing a resident who tried to stop them from scattering holy ashes in the residential area.In a statement the police said on 31 January 2025 Misheck Muperiwa (22) and Costain Tshuma (28) fatally attacked Shepherd Mphofu (48) who was against their sprinkling of what they called holy ashes in Mupamombe Phase 1, Kadom\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/2303-1-1-MURDER-CHARGE-680x380.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com Two men from Kadoma have been arrested for allegedly killing a resident who tried to stop them from scattering “holy ashes” in the residential area. In a statement the police said on 31 January 2025 Misheck Muperiwa (22) and Costain Tshuma (28) fatally attacked Shepherd Mphofu (48) who was against their sprinkling […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "“Always bubbly and kind”: A friend’s heartfelt tribute to Zvikomborero Sibanda",
            "url": "https://www.chronicle.co.zw/always-bubbly-and-kind-a-friends-heartfelt-tribute-to-zvikomborero-sibanda/",
            "content": "Melissa Mpofu,[emailprotected]\n\nShanitha Singh, a close friend of the late veteran broadcaster Zvikomborero Kombo Sibanda, has reflected on their friendship following Sibandas passing on Wednesday. Kombo will be laid to rest tomorrow in Bulawayo.\n\nIn an interview, Singh, who is based in South Africa where Kombo had been residing, shared fond memories of their bond, which began more than a decade ago.I met Kombo over 10 years ago through my sister, who was her gym buddy. We became friends, and when I was getting married in 2014, she travelled with me to India to help with my wedding shopping. She also attended my wedding, Singh recalled.\n\nKombo at Singhs wedding\n\nDescribing Kombo as always bubbly and a great listener, Singh said, We used to share so much. I would confide in her about my problems, and she did the same with me. But she was always optimistic, always had a smile on her face, and was always there to listen.\n\nThe late Zvikomborero Kombo Sibanda with friend Shanitha Singh\n\nShe reminisced about their frequent meetups at Bedford Centre in Johannesburg.My sister and I often went there, and sometimes wed sit down for coffee or breakfast. Since Kombo lived at the centre, we would call her to join us, and wed have great laughs and long conversations.\n\nKombo with Singhs late mum\n\nOne of Singhs fondest memories was in January 2015, when Kombo unexpectedly played a role in discovering her pregnancy.I was having breakfast with her and mentioned that I always needed to relieve myself. She immediately said, Youre pregnant, but I laughed it off. She insisted on buying me a pregnancy test, saying that in her culture, doing so would bring good luck as she had been trying to conceive herself. We went to her apartment, and thats where I took the test.She was the first to know I was expecting. From then on, Kombo became like a sister to me, and we shared so many special moments.\n\nSingh last spoke to Kombo just over a week ago.I checked in on her, asked how she was feeling, and when she was coming back home to South Africa. I never imagined it would be our last conversation.\n\nShe added that Kombo had a close relationship with her family.When my daughter was born in 2015, she started calling me Mama Jazz because of my daughters name. Her passing has been such a shock to us, even to my daughter. She was also very close to my late mom, and they shared many laughs. We will definitely miss her.Kombos passing has left a void in the lives of those who knew her, and her friends and family will cherish the fond memories they shared with her.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/sdfaes.jpg",
            "description": "Melissa Mpofu, mellisa.mpofu@chronicle.co.zw Shanitha Singh, a close friend of the late veteran broadcaster Zvikomborero “Kombo” Sibanda, has reflected on their friendship following Sibanda’s passing on Wednesday. Kombo will be laid to rest tomorrow in Bulawayo. In an interview, Singh, who is based in South Africa where Kombo had been residing, shared fond memories of their […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "Bulawayo man arrested for unlawfully selling ivory",
            "url": "https://www.chronicle.co.zw/bulawayo-man-arrested-for-unlawfully-selling-ivory/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nIn a dramatic bust, a 29-year-old man was taken into custody after being caught red-handed with a stash of raw, unmarked, and unregistered ivory at the Amakhosi Service Station, a popular pit stop along the bustling Bulawayo-Victoria Falls Road.\n\nIn a statement the police said on 31 January 2025 they seized a hidden elephant tusk from Blessed Matibenga who was attempting to sell it, discovering the tusk concealed in a white sack.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/02/Ivory-2.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com In a dramatic bust, a 29-year-old man was taken into custody after being caught red-handed with a stash of raw, unmarked, and unregistered ivory at the Amakhosi Service Station, a popular pit stop along the bustling Bulawayo-Victoria Falls Road. In a statement the police said on 31 January 2025 they seized a […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "Real Madrid still up for title fight despite shock loss, says Ancelotti",
            "url": "https://www.chronicle.co.zw/real-madrid-still-up-for-title-fight-despite-shock-loss-says-ancelotti/",
            "content": "Real Madrid coach Carlo Ancelotti said his side are still in the driving seat in the LaLiga title race despite a shock 1-0 defeat by Espanyol on Saturday.Real lead the Spanish top flight on 49 points, one ahead of Atletico Madrid, who beat Mallorca 2-0, with the city rivals set to meet next weekend.We had chances and could have scored, but despite the defeat we are still in the fight. We have to focus on the next game, Ancelotti told a press conference.Advertisement  Scroll to continueWe could have done better, the result was deserved, he added.The Italian manager also criticised the decision not to show a red card to eventual goalscorer Carlos Romero for a foul on Kylian Mbappe, who was running up the field on a breakaway attack.It was a clear foul, a very ugly tackle, but fortunately nothing happened, Ancelotti added.Defender Antonio Rudiger left the pitch with a muscle problem and Ancelotti said it was too early to tell for how long the German may be out.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jkjk.jpg",
            "description": "Real Madrid coach Carlo Ancelotti said his side are still in the driving seat in the LaLiga title race despite a shock 1-0 defeat by Espanyol on Saturday. Real lead the Spanish top flight on 49 points, one ahead of Atletico Madrid, who beat Mallorca 2-0, with the city rivals set to meet next weekend. […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "DR Congo asks clubs to end Visit Rwanda sponsorship",
            "url": "https://www.chronicle.co.zw/dr-congo-asks-clubs-to-end-visit-rwanda-sponsorship/",
            "content": "THE Democratic Republic of Congos foreign minister Therese Kayikwamba Wagner has urged soccer clubs Arsenal, Bayern Munich and Paris St Germain to end their blood-stained sponsorship agreements with Visit Rwanda following the worsening humanitarian crisis in the country.The DR Congo health ministry said on Saturday there were almost 800 bodies in hospital morgues around Goma following the offensive by Rwanda-backed M23 rebels to seize east Congos largest city, home to lucrative gold, coltan and tin mines.The latest escalation has worsened a long-standing humanitarian crisis that has driven hundreds of thousands to seek shelter in Goma after fleeing fighting between M23 and Congolese troops.The fighting has led to human rights violations including summary executions, the bombing of displacement camps, and reports of gang rape and other sexual violence, according to the United Nations.Wagner wrote to the three clubs this week and questioned the morality of their sponsorship deals, citing a U.N. report that suggested there were 4,000 Rwandan troops active in DR Congo.Thousands are currently trapped in the city of Goma with restricted access to food, water, and security, Wagner said in her letters to the clubs, according to a media statement from her ministry on Sunday.Countless lives have been lost; rape, murder and theft prevail. Your sponsor is directly responsible for this misery. If not for your own consciences, then the clubs should do it (end their sponsorship agreement) for the victims of Rwandan aggression.I was then effectively buried in the delivery of a London Games, either winning or.Rwanda says it is defending itself, accusing Congos military of joining forces with ethnic Hutu-led militias bent on slaughtering Tutsis in Congo and threatening Rwanda, where Hutus targeted Tutsis in a 1994 genocide and some later fled to Congo.Congo denies this and accuses Rwanda of using M23 to pillage valuable minerals from Congolese territory.Visit Rwanda began their sponsorship of Arsenal in 2018, with the latest deal reported to be worth more than 10 million pounds ($12.39 million) per year.Bayern Munich signed a five-year football development and tourism promotion partnership with Rwanda in 2023, while Visit Rwanda has been a sponsor of PSG since 2019.Reuters has contacted the three clubs and Visit Rwanda for comment.British foreign minister David Lammy told parliament on Tuesday Rwanda received over $1 billion in global aid every year, including around 32 million pounds of bilateral UK assistance, but all of that is under threat when you attack your neighbours.\n\nReuters\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/yuht.jpg",
            "description": "THE Democratic Republic of Congo’s foreign minister Therese Kayikwamba Wagner has urged soccer clubs Arsenal, Bayern Munich and Paris St Germain to end their “blood-stained” sponsorship agreements with “Visit Rwanda” following the worsening humanitarian crisis in the country. The DR Congo health ministry said on Saturday there were almost 800 bodies in hospital morgues around […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "Barcelona women lose to Levante, ending 46-match unbeaten league run",
            "url": "https://www.chronicle.co.zw/barcelona-women-lose-to-levante-ending-46-match-unbeaten-league-run/",
            "content": "By Reuters\n\nBarcelona women lost for the first time in 46 Liga F games on Saturday, suffering a shock 2-1 defeat at home by lowly Levante.Barca, who thrashed Real Madrid 5-0 in the Super Cup last Sunday, crashed to their first league loss since May 2023.Levante took the lead in the 50th-minute with Maria Alharillas thunderous strike and doubled their advantage in stoppage time through Ivonne Chacon. Barcelona pulled one back through Fridolina Rolfo a minute later but it was too late.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/okk.jpg",
            "description": "By Reuters Barcelona women lost for the first time in 46 Liga F games on Saturday, suffering a shock 2-1 defeat at home by lowly Levante. Barca, who thrashed Real Madrid 5-0 in the Super Cup last Sunday, crashed to their first league loss since May 2023. Levante took the lead in the 50th-minute with […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "Man caught red handed cutting cables at a mine",
            "url": "https://www.chronicle.co.zw/man-caught-red-handed-cutting-cables-at-a-mine/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nPolice in Zimbabwe have arrested a suspect linked to multiple cases of copper cable theft from ZESA in Harare, Mashonaland East, and Mashonaland Central.\n\nThe man, according to Police on X, is likely involved in eight incidents in areas including Ruwa, Erasmus Park and Bindura.\n\nThe Police arrested the suspect at Arcturus Mine, where he was caught severing and removing seven meters of armoured cable. More details to follow, read an official statement on X\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/thyu.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com Police in Zimbabwe have arrested a suspect linked to multiple cases of copper cable theft from ZESA in Harare, Mashonaland East, and Mashonaland Central. The man, according to Police on X, is likely involved in eight incidents in areas including Ruwa, Erasmus Park and Bindura. “The Police arrested the suspect at Arcturus […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "Watch: Bosso elect new treasurer",
            "url": "https://www.chronicle.co.zw/watch-bosso-elect-new-treasurer/",
            "content": "Innocent Kurira,[emailprotected]\n\nNKANI Khoza has been elected as the new treasurer of Highlanders after securing 83 votes in the election held at the Clubhouse on Sunday morning.\n\nA total of 154 members participated in the voting, where Khoza triumphed over his rival, Israel Moyo who got 71 votes.\n\nDespite the significance of the election, voter turnout was relatively low, with no visible queue forming since the voting process started at 9 a.m. The election for the vice-chairman position was scheduled but Fiso Siziba was unopposed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/uop.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw NKANI Khoza has been elected as the new treasurer of Highlanders after securing 83 votes in the election held at the Clubhouse on Sunday morning.   A total of 154 members participated in the voting, where Khoza triumphed over his rival, Israel Moyo who got 71 votes. Despite the significance of the […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        },
        {
            "title": "Broadcasting icon Zvikomborero Sibanda to be buried tomorrow",
            "url": "https://www.chronicle.co.zw/broadcasting-icon-zvikomborero-sibanda-to-be-buried-tomorrow/",
            "content": "Showbiz Reporter\n\nVeteran broadcaster Zvikomborero Kombo Sibanda, who passed away on Wednesday due to an illness she had been battling, will be buried tomorrow.\n\nFamily members have announced that a prayer vigil and reception of Kombos body will take place at the family home in Bulawayo today, beginning at 5pm.Dear family and friends, we want to share the arrangements for our beloved Zvikos funeral services. On Sunday evening, there will be a prayer vigil and reception of Kombos body at the family home, beginning at 5pm, the family shared on Kombos Facebook page.\n\nThe funeral service is scheduled for Monday morning at the Salvation Army Church in Mpopoma, starting at 8am. This will be followed by burial at Athlone Cemetery in Bulawayo.\n\nMourners are gathered at the family home, Block 75/2300, Mpopoma.\n\nBorn on April 5, 1978, Kombo grew up in Mpopoma and attended Nkulumane Primary School in Bulawayo. She later completed her high school education at Usher High and Hermann Gmeiner High School before pursuing a qualification in Mass Communication and Journalism at Harare Polytechnic.\n\nHer media career began at Chronicle, where she completed her attachment, before moving on to ZBCtv. She later worked with the National Oil Company of Zimbabwe before relocating to South Africa after marrying a South African national.\n\nShe returned to Zimbabwe in November last year, struggling with long-term health issues related to fibroids, a condition for which she had previously undergone surgery. Sadly, she lost her battle on Wednesday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/sdvzsv.jpg",
            "description": "Showbiz Reporter Veteran broadcaster Zvikomborero “Kombo” Sibanda, who passed away on Wednesday due to an illness she had been battling, will be buried tomorrow. Family members have announced that a prayer vigil and reception of Kombo’s body will take place at the family home in Bulawayo today, beginning at 5pm. “Dear family and friends, we […]",
            "time": "20:38",
            "date": "02 Feb 2025"
        }
    ]
}