{
    "news": [
        {
            "title": "Illegal miners invade  pedigree beef ranch",
            "url": "https://www.chronicle.co.zw/illegal-miners-invade-pedigree-beef-ranch/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nGOVERNMENT has deployed security and environment agencies to the Rhodes Estate in the Matopos National Park to address concerns over rampant illegal gold mining activities, which is threatening livestock production at one of the countrys biggest pedigree cattle farms.\n\nKnown for its famed Brahman and Beefmasters breeds produced by the Pilossof brothers, the farm has been invaded by illegal gold panners whose indiscriminate digging in recent years has caused severe environmental degradation.\n\nSome illegal miners arrogantly continue with their activities despite the presence of Minister Ndlovu and her entourage yesterday\n\nMany cattle have died after falling into the pits dug by the panners. The sprawling 4 000-hectare enterprise, is run by the Pilossof brothers, a household name in the pedigree cattle and genetics business in the country.\n\nIn 2014 the Pilossof brothers entered into an agreement with the Zimbabwe Parks and Wildlife Management Authority (ZimParks) to run their pedigree business in the Rhodes Estates as means to preserve parts of the Matopos National Park  a world heritage site  while at the same time operating a commercially viable livestock project in the park.\n\nFor years, the Pilossof family has been battling an ever growing influx of illegal gold panners who have been digging pits and deep trenches where the cattle are falling in.\n\nYesterday Matabeleland South Provincial Affairs and Devolution Minister, Dr Evelyn Ndlovu and her delegation of heads of key Government departments visited the farm to have first-hand appreciation of the problem the cattle farmers are facing as a result of the illegal gold mining activities.\n\nHead of the farm project, Mr Paul Pilossof, estimated that close to 200 pedigree cattle have died in the last couple of years after falling into the open pits left by the illegal gold panners or from drinking water contaminated with chemicals such as cyanide, whose use is now outlawed in the extraction of gold. The pedigree cattle at the farm can cost between US$4 000 to US$8 000 each.Some Pilossof Ruvale Brahman bulls from the farm have in the past been sold for as much as US$13 000 each.\n\nOne of the pits of death left by the illegal mining activities at the ranch\n\nOn one end of the farm, at the base of a small mountain, the news crew saw over 30 pits concentrated in a very small area. A few illegal panners were brave enough to stick around as Minister Ndlovu and her entourage together with officials from ZimParks, Ministry of Mines and Mining Development, Ministry of Lands, Agriculture, Water, Fisheries and Rural Development, the Environment Management Authority (EMA), the police and other stakeholders assessed the damage.\n\nThe rest of the omakorokoza fled or hid in their deep pits to evade possible arrest as the entourage approached.\n\nWe have been at the farm since 2014 after signing an agreement with ZimParks and we have been encountering problems with illegal miners invading our farm and digging for gold, said Mr Pilossof.\n\nThe illegal mining has been happening for years and it appears nothing is being done to stop the activities. We fenced off a large area where illegal mining is taking place in order to keep our cattle away but the mining just keeps spreading and the panners are cutting the fence.\n\nMr Pilossof said they are now being forced to move their cattle from the farm because its no longer safe to keep them there.\n\nWe lose an average of 60 pedigree cattle per year from snares, stock theft, cattle falling into pits or dying after drinking cyanide contaminated water, said Mr Pilossof.\n\nMinister Ndlovu said the province is dependent on agriculture and livestock farming contributes significantly to the regions economy.\n\nThe illegal mining activities that are taking place at this farm are counter-productive and cannot be allowed to continue, said Dr Ndlovu.\n\nShe ordered officials from the mines ministry to report back to her office with a list of miners that were allowed to mine at the Rhodes Estates under special permits issued with the consent of ZimParks.\n\nMining and agriculture can be done side by side but only when both parties are working within the confines of the law. I want a list of everyone who is mining legally so that we flush out the illegal miners, said Dr Ndlovu.\n\nMr Chancellor Chidziva, Matabeleland South acting provincial mining director, said his office can only issue out a special mining permit to a miner after the approval of ZimParks.\n\nZimParks are custodians of the Matopos National Park so anyone who wishes to carry out mining in the national park must first seek a special permit from them, he said.It is only after Zimparks issues out the special permit that we do the necessary paperwork and grant the individual the right to mine, said Mr Chidziva.\n\nHe however said he could not immediately provide the number of miners who hold the special permits to mine in the Matopos National Park.\n\nThe special permits expire after two years and are only renewed when the miner meets all the necessary conditions.\n\nZimParks senior area manager, Mr Thembelani Sibanda, said the majority of gold panners did not have special permits to mine in the area and as such were mining illegally.\n\nThe farm was set aside as a reserved area for cattle rearing and only miners with special grants are allowed to work here. ZimParks acknowledges the growing problem of illegal mining in this area and our plea is for all the stakeholders to work together to flush out the illegal gold panners, he said.\n\nConflict of interest between mining and farming is not peculiar to this farm alone so a holistic approach is needed to solve problems that emanate from such situations,According to the EMA provincial manager, Mr Decent Ndlovu, the area in and around the Pilossof farm is one of the worst degraded places in the province as a result of illegal mining activities.\n\nWe classify this area as a hotspot in terms of illegal mining because it is one of the worst degraded places in the province. The farmers have been here since 2014 and have invested a lot in terms of rehabilitating the area and today it keeps thousands of cattle. So, its sad when all that good work is destroyed by illegal mining activities, said Mr Ndlovu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/1-18-680x380.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com GOVERNMENT has deployed security and environment agencies to the Rhodes Estate in the Matopos National Park to address concerns over rampant illegal gold mining activities, which is threatening livestock production at one of the country’s biggest pedigree cattle farms. Known for its famed Brahman and Beefmasters breeds produced by the Pilossof brothers, […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "Sadc convenes Extraordinary  Summit on DRC",
            "url": "https://www.chronicle.co.zw/sadc-convenes-extraordinary-summit-on-drc/",
            "content": "\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Proffessor-Amon-Murwira.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter PRESIDENT Mnangagwa is tomorrow expected to preside over a SADC Extraordinary Summit of Heads of State and Government in Harare, whose deliberations will centre on the security situation in the Democratic Republic of Congo (DRC). On Monday, President Mnangagwa, who is chair of SADC, said the bloc will take full responsibility […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "COMMENT: More should invest in Zimbabwe’s infrastructural development",
            "url": "https://www.chronicle.co.zw/comment-more-should-invest-in-zimbabwes-infrastructural-development/",
            "content": "THE upgrading of the 120km Bulawayo-Old Gwanda Road is expected to start soon after Government and the contractor, Zwane Enterprises Private Limited on Tuesday finally signed the long-awaited concession agreement.\n\nCabinet approved the construction of the road in May last year but work could not start before the signing of the concession agreement between Government and the contractor, Zwane Enterprises.\n\nThe Ministry of Transport and Infrastructure Development permanent secretary, Engineer Joy Makumbe signed the agreement on behalf of Government while Zwane Enterprises was represented by its chief executive officer, Eng Bekithemba Mbambo.\n\nThe project estimated to cost $150 million is being implemented under the Build, Operate and Transfer (BOT) arrangement.Speaking after the signing of the agreement, Eng Mbambo said preparatory work for the Public-Private Partnership project will start soon. The project involves upgrading, construction and tolling of the 120km stretch joining Bulawayo City and Gwanda town via Matobo.\n\nRoad Construction\n\nEng Mbambo said last year that he had secured US$150 million loan from an American partner to fund the project.The road which passes through Matopo High School is in a terrible state hence Eng Mbambo approached Government seeking its approval for his company to upgrade the road under BOT.\n\nHe said now that an agreement has been signed, its all systems go and work will start soon. The construction of the road which will have two tollgates, is expected to be completed in 12 months.\n\nEng Mbambo said although the waiting has been long, they were happy that they have finally been given the green light to start work following the signing of the concession agreement on Tuesday.\n\nMore than 40 homesteads will be relocated to pave way for the construction of the road. Zwane Enterprises will recoup its costs from the tolling fees.\n\nFile photo: Road Construction\n\nEng Mbambo is among Zimbabwean professionals that have gained valuable experience working in the diaspora and has returned home to help build the country.\n\nGovernment has appealed to Zimbabwean professionals working in the diaspora to return home and contribute to the building of the Zimbabwe we all want. Ilizwe lakhiwa ngabaninilo (Nyika inovakwa nevene vayo). We want to commend Eng Mambo and other Zimbabwean professionals that have returned home to contribute to the development of their country.\n\nGovernment announced last year that it is engaging the private sector to construct major roads across the country under the BOT arrangement.\n\nWe therefore call upon other companies to come on board and invest in infrastructural development like what Zwane Enterprises is doing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-21-1.jpg",
            "description": "THE upgrading of the 120km Bulawayo-Old Gwanda Road is expected to start soon after Government and the contractor, Zwane Enterprises Private Limited on Tuesday finally signed the long-awaited concession agreement. Cabinet approved the construction of the road in May last year but work could not start before the signing of the concession agreement between Government […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "Bosso confirm BetterBrands deal… Highlanders Royals, junior teams left out",
            "url": "https://www.chronicle.co.zw/bosso-confirm-betterbrands-deal-highlanders-royals-junior-teams-left-out/",
            "content": "Fungai Muderere,[emailprotected]\n\nTHE Highlanders sponsorship deal with BetterBrands for the year 2025 has been retained, albeit with a slight shift of focus, the club chairman Kenneth Mhlophe has revealed.\n\nBosso were in the past season under the sponsorship of Sakunda Holdings, Better Brands, Nyaradzo Life Assurance Company and Sanctuary Insurance.\n\nIn this difficult economy and unpredictable operating environment, Highlanders is indebted to its corporate partners for their financial and material support. While it is not easy to get sponsorships, it is twice as difficult to maintain them.\n\nI therefore humbly appeal to all of us as Highlanders at various levels and positions to ensure we help each other preserve the partnerships we have and always keep our club clean in order to attract more. For the year 2025, the Better Brands deal has been retained, albeit with a slight shift of focus.\n\nYou will remember that last year the BettterBrands covered our youth teams as well as the Highlanders Royals. This time around the deal covers only the senior team, meaning we have a gap with regards to Bosso 90, Royals and junior teams respectively, said Mhlophe.\n\nSome of the Highlanders FC members captured during the annual general meeting (AGM) at the club house on Sunday. (Picture by Nkosizile Ndlovu)\n\nAhead of their centenary celebrations Mhlophe informed club members that the development side, Bosso 90, will be rebranded Bosso 99 in preparation for the clubs Centennial Celebrations next year.\n\nMhlophe said: Our club will celebrate 100 years of existence in 2026. This is a significant milestone and we are all privileged to be part of both the club and the upcoming celebrations. Amhlophe to all.\n\nThe celebrations will begin in earnest this year, with a series of events kicking off this very season. Bosso 90 will transition to Bosso 99 and as an institution, the club will engage with its members as various subcommittees for the celebrations are formed.\n\nFounded in 1926, Highlanders is the countrys oldest football club. Over the years, the club has evolved into one of Zimbabwes two biggest football institutions, boasting a massive following both locally and internationally, particularly among those in the Diaspora.\n\nDouglas British Mloyi\n\nOn the field, the Bulawayo giants have enjoyed significant success, winning numerous league titles and cup competitions while producing some of the countrys finest football talent.\n\nThe club has provided home to celebrated former players that include the famous Ndlovu brothers Madinda, the late Adam and Peter, Zenzo Moyo, Benjamin Konjera, Peter Oxo Nkomo, Douglas Mloyi, the late Willard Khumalo, the late Rahman Gumbo, Johannes Tshuma, Johannes Ngodzo, Thabani Masawi, Charles Chilufya, Collin Nyambiya, Makwinji Soma Phiri, Amini Soma Phiri, Sizabantu Khoza, Gilbert Banda, Honour Gombami, Mthulisi Maphosa, and Thulani Biya Ncube among other gifted yeasteryear greats. -@FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/1-6.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw THE Highlanders sponsorship deal with BetterBrands for the year 2025 has been retained, albeit with a slight shift of focus, the club chairman Kenneth Mhlophe has revealed. Bosso were in the past season under the sponsorship of Sakunda Holdings, Better Brands, Nyaradzo Life Assurance Company and Sanctuary Insurance. “In this difficult economy […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "Church’s drought response bails out Bulilima villagers",
            "url": "https://www.chronicle.co.zw/churchs-drought-response-bails-out-bulilima-villagers/",
            "content": "Ashley Phiri,[emailprotected]\n\nABOUT 2 248 households from Bulilima District in Matabeleland South Province have benefitted from the Zimbabwe Council of Churches (ZCC)s Strengthening Drought Response and Recovery (SDRR) programme.\n\nAmong those who benefitted are 312 from Hingwe, 304 in Bambadzi, Makhulela 255, Ndolwane 319, Madlambuzi 306, Nathane 438 and Huwana 314. Each household received 20kgs mealie-meal, 3kgs sugar beans and two litres cooking oil.\n\nFunded by Christian Aid, the initiative has provided essential services such as water, sanitation and livelihood support since its launch in September 2024. The programme is set to conclude in February this year.\n\nAs the province continues to battle the devastating impacts of recurrent droughts, the SDRR programme was developed to address the urgent needs of affected communities through a multi-faceted approach.\n\nIt focuses on enhancing livelihoods, promoting gender equality and supporting vulnerable groups, including women, children, the elderly and persons with disabilities.\n\nOne of the programmes key achievements has been the rehabilitation of 21 defective boreholes in Bulilima, ensuring reliable access to lifesaving, multipurpose water supplies. To guarantee the sustainability of these water points, 21 water point management committees were trained in the management and maintenance of the boreholes.\n\nSince its inception, the project has strengthened lifesaving, multipurpose water access for drought-affected households through the repair and rehabilitation of 21 defective boreholes. For the repaired boreholes, 21 water point management committees were trained in the management and maintenance of water sources to ensure sustainability, said the ZCC in a statement.\n\nThe programme also focused on boosting income generation through training on sustainable agricultural practices, livestock management, water harvesting techniques and composting technologies. Beneficiaries were introduced to the production of traditional grains and livestock emergency guidelines, equipping them with the skills to build resilience in the face of climate challenges.\n\nThe drought-affected households received enhanced income generation options through training in farm and off-farm livelihood activities, including livestock emergency management, sustainable agricultural practices, conservation technologies, composting technologies and the production of traditional grains, along with livestock emergency guidelines, the statement added.\n\nTo complement these efforts, the programme provided financial literacy training, teaching community members about internal savings and lending concepts, fostering economic empowerment within the community.\n\nChristian Aid Zimbabwe Country Director Aulline Chapisa hands over food donations in Bulilima\n\nFor four months, the ZCC provided in-kind food assistance to the most vulnerable households in Bulilima, ensuring food security during the critical period.\n\nIn addition, the programme addressed gender-based violence (GBV) and promoted gender equality by conducting gender assessments, establishing referral pathways for GBV survivors and training community leaders on protection issues. These efforts aim to create safer, more inclusive communities.\n\nThe ZCC highlighted the importance of collaboration in addressing the complex challenges posed by drought. The organisation worked closely with government ministries, rural district councils, other faith-based organisations and local leaders to ensure a co-ordinated response.\n\nBuilding on insights from the earlier Anticipatory Action Project, which ended in July 2024, the SDRR initiative prioritised vulnerable groups, including women, children and persons with disabilities from food-insecure households.\n\nAs the SDRR programme nears its conclusion, the ZCC remains committed to not only providing immediate relief but also building long-term resilience within the affected communities. The initiative represents a comprehensive approach to addressing the intertwined challenges of drought, food insecurity and social inequities, paving the way for a sustainable future in Matabeleland South.\n\nThrough the combined efforts of the Zimbabwe Council of Churches, Christian Aid and local stakeholders, the hope is to empower communities to recover and withstand future adversities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Zimbabwe-Council-of-Churches-Christian-Aid-Zimbabwe-Personnel-showcase-one-of-the-rehabilitated-boreholes-in-Bulilima.jpg",
            "description": "Ashley Phiri, ashleyphiri66@gmail.com ABOUT 2 248 households from Bulilima District in Matabeleland South Province have benefitted from the Zimbabwe Council of Churches (ZCC)’s Strengthening Drought Response and Recovery (SDRR) programme. Among those who benefitted are 312 from Hingwe, 304 in Bambadzi, Makhulela 255, Ndolwane 319, Madlambuzi 306, Nathane 438 and Huwana 314. Each household received […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "Banks urged to beef up data security",
            "url": "https://www.chronicle.co.zw/banks-urged-to-beef-up-data-security/",
            "content": "Leonorah Ncube in Victoria Falls\n\nBANKS have been challenged to comply with the Cyber Data Protection Act (CDPA) and other related security statutes to effectively safeguard customers personal information and regain their trust.\n\nParticipants at the second edition of the Postal and Telecommunications Regulatory Authority of Zimbabwe (Potraz) Data Privacy Symposium that is underway in Victoria Falls expressed concern over safety of their data in financial institutions.\n\nThey felt that while banks had invested in outward security where clients have to jealously guard against sharing their personal details to third parties, banks had not done enough to security-proof their systems as most information, mostly to fraudsters and card cloners leak from within.\n\nPotraz director-general, Dr Gift Machengete, urged banks to have an inward looking strategy saying customers were sceptical about the safety of their personal data in banks hence the financial institutions should make sure they protect them.\n\nPotraz director general Dr Gift Machengete\n\nHe was speaking during a question and answer session following a panel discussion on Putting the Customer First: Challenges and Opportunities for the Banking Industry in the Age of Data Protection.\n\nThe session was moderated by Advocate Komborerai Manenji while the panel of data protection officers and bankers included Ms Violet Bayiwa who is head of compliance at Steward Bank, Mr Collins Mutambira, the head of compliance FBC, Ms Moira Chipandu, head of compliance at NMB and Ms Farirai Machawira from CABS.\n\nThe panellists concurred on the need for banks to comply with the Cyber Data Protection Act but at the same time serving the clients needs.\n\nBanks should balance between protecting data and delivering service to customers. The banking landscape is ever evolving and new technologies are coming up with alternative banking systems. So, as banks we must comply with the CDPA. Yes, we can talk about cost of compliance but there is also a cost for non-compliance, said Mr Mutambira.\n\nHe said failure to comply could have attract financial penalties, legal and reputational risks, especially if banks do not keep data in a private manner.\n\nMs Muchawira said compliance would build trust.We stand on what we know as data protection officers and we need to appreciate why we need to enhance privacy. You need customers trust now. It is very important for us to familiarise with the legislation and be prepared to train at higher level for compliance. Banks should embrace customer human rights, she said.\n\nMs Chipandu concurred saying trust is key because all banks subscribe to consumer protection.Banks need to constantly protect customers and constantly communicate with them because data subjects need to be updated through effective communication, she said.\n\nWe need to be innovative in terms of how we put across our information.Another data protection officer, Ms Bayiwa said there is a need to understand the laws of the land and ensure information is protected.\n\nShe said everyone has a right to control personal information and banks should also play a part. Banks collect personal data when people open personal banking accounts and through the Know Your Customer service.\n\nThere was consensus on the need to raise awareness and educating both employees and clients on data protection.Those from the banking sector said they sign declaration of confidentiality, which is renewed annually highlighting new trends.\n\nThey said most banks now verify identity documents through direct connection with the Civil Registry Office.Risks in the banking sector, which clients are afraid of, include card cloning and identity theft.\n\nA representative from the Central Bank said there was room for improvement, urging banks to embrace new systems such as Zeepay that allow validation of data.\n\nHe reiterated on the need for all banks to comply and balance between compliance and service and not to inconvenience customers.\n\nThe symposium started on Tuesday and it is being attended by the data protection ecosystem including policy makers, regulators, business, academics, researchers, bankers, security services and others who in the information communication technology departments of organisations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Dr-Machengete.jpg",
            "description": "Leonorah Ncube in Victoria Falls BANKS have been challenged to comply with the Cyber Data Protection Act (CDPA) and other related security statutes to effectively safeguard customers’ personal information and regain their trust. Participants at the second edition of the Postal and Telecommunications Regulatory Authority of Zimbabwe (Potraz) Data Privacy Symposium that is underway in […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "Hwange Power Station breaches 1 000MW output",
            "url": "https://www.chronicle.co.zw/hwange-power-station-breaches-1-000mw-output/",
            "content": "Raymond Jaravaza and Sikhulekelani Moyo,Chronicle Writers\n\nCONSUMERS have commended the Government for the recent improvement in power supplies following the successful completion of maintenance works at the giant Hwange Power Station, which has breached 1 000MW daily electricity output.\n\nWhile load shedding remains amid growing demand with the country bridging the gap through imports from regional producers, increased domestic output has brought relief to business, industry, and households across the country.\n\nDaily updates from the Zimbabwe Power Company (ZPC) indicate that Hwange Power Station dominates supplies, hovering around 1 000MW with Kariba trailing at 185MW due to the limited water levels while Independent Power Producer (IPPS) pump an average of between 53MW and 66MW daily.\n\nAs of yesterday, electricity generation stood at a combined 1 175MW compared to 1 267MW on Tuesday and 1 165 on Monday.\n\nThis, however, falls short of the daily maximum demand of about 1 825MW. In November last year, electricity generation was at its lowest with a daily average of 850MW combined, which dropped further to 866MW, causing severe load shedding as consumers experienced prolonged power cuts after a technical fault was reported at Hwange.\n\nThe El Nino-induced drought significantly dwindled water levels at Lake Kariba forcing the Zambezi River Authority, which jointly owns Kariba Dam between Zimbabwe and Zambia, to curtail power generation for both countries.\n\nIn an interview, Permanent Secretary in the Ministry of Energy and Power Development, Engineer Gloria Magombo, said normal electricity generation has been restored and Hwange was now back at full throttle hence the improved output.\n\nAs a ministry, we deal with policy issues but at the same time we appreciate the improved power supply situation that the country is currently experiencing, she said.\n\nThe ministry is aware that the Class C maintenance work on Units 7 and 8 in Hwange was successfully completed and the units are now back in service.\n\nEng Magombo said the Government will continue working around the clock to make sure that electricity generation in the country stays on an upward trajectory as evidenced by its commitment to sign contracts for consultancy work to support IPPs in the country.\n\nThe move is aimed at addressing the crippling power outages and supporting economic growth.Hopes are high that given the positive summer season projections in the region, prospects for enhanced power generation are high as inflows to Lake Kariba are expected to rise, thereby boosting hydroelectricity generation in the course of the year.\n\nIn separate interviews, analysts said the improved power situation was commendable. Economist and National University of Science and Technology (NUST) lecturer Mr Stevenson Dlamini said increasing domestic supplies was significant for the business community, particularly the manufacturing sector, as it ensures uninterrupted production.\n\nThis leads to higher output, increased sales, and greater customer satisfaction. Ultimately, these advancements enhance business viability, competitiveness, and resilience, he said.\n\nMs Juliana Mujuru, who leads small businesses operating at the SMEs Centre in Bulawayo, said improved power supply will assist them to increase operating capacity.\n\nThis also gives us time to rest since we used to work at night trying to finish orders, she said.\n\nWe hope the situation will remain positive, which will also reduce the cost of production.\n\nEconomist, Mr Reginald Shoko, said consistent power availability reduces downtime and minimizes disruptions, allowing for smoother production processes.\n\nIt can also lower operational costs by decreasing the need for backup generators and maintenance. Furthermore, reliable electricity supports the adoption of advanced technologies and automation, driving innovation and competitiveness, he said.\n\nUltimately, improved electricity supply fosters a more conducive environment for growth, attracting investment and enabling businesses to meet customer demands effectively.\n\nIn Bulawayo, some residents expressed optimism about the improved state of power supply.\n\nThe situation has not reached a point where we can say that electricity is now available in our homes most of the time but we are seeing an improvement.I remember last year we would go for close to 20 hours a day without power in our homes, said Mr Nqobani Masuku of Nguboyenja suburb.\n\nA vendor at Sixth Avenue who identified herself as Marilyn said she can now go back to her business of selling chicken feet as the electricity situation has improved since the beginning of the year.\n\nMy business requires that my products are in a frozen state before I leave home in the late afternoons so that I can sell the meat while it is still fresh at night in the city centre.\n\nNow that the electricity situation is slowly improving, I can now start selling chicken feet again, she said.\n\nLast year African Development Bank (AfDB) in its update of a project titled Zimbabwe Energy Sector Reform Support, which it is funding, said all the consultancy contracts had been signed and implementation was progressing well.\n\nThe implementation period for the wind resource assessment is until June 2026 and the consultancy contracts were signed by the Government as part of the implementation of the AfDB project.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Hwange-power-Station-Unit-7-and-8.jpg",
            "description": "Raymond Jaravaza and Sikhulekelani Moyo, Chronicle Writers CONSUMERS have commended the Government for the recent improvement in power supplies following the successful completion of maintenance works at the giant Hwange Power Station, which has breached 1 000MW daily electricity output. While load shedding remains amid growing demand with the country bridging the gap through imports from […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "Aspiring actors get a glimpse into film industry with Luthuli’s expertise",
            "url": "https://www.chronicle.co.zw/aspiring-actors-get-a-glimpse-into-film-industry-with-luthulis-expertise/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nUp-and-coming thespians and aspiring actors got a glimpse into the film industry yesterday as Bulawayo-born South African actor, Luthuli Dlamini, shared his insights at a local conference centre in Bulawayo.\n\nDue to high public demand and scheduling conflicts, Dlamini is set to host another session on Sunday to accommodate those who were unable to attend the midweek event.\n\nKnown for his acting stints in South Africa, Dlamini said the masterclass aims to help aspiring theatre practitioners understand the intricacies of the industry while equipping them with the skills to monetise their craft.\n\nActor Luthuli Dlamini teaching acting students during a masterclass session on Wednesday. (Pic by Pride Moyo)\n\nTopics covered during the two-session masterclass included acting for television and film, script breakdown, audition techniques, the business of film as well as a question and answer session.\n\nDuring the masterclass, Dlamini urged attendees to master their script lines.As an actor, you need to know your lines, rehearse them in front of a mirror and master them for auditions. Acting is rooted in conflict, and as a performer, you must understand this to deliver a performance that resonates with the audience.\n\nActors perform for an audience, and to fully embody a character, you need to understand their essence and look the part, he said.\n\nHe used the example of the late, Mary Twala, mother to Somizi Mhlongo as someone who was a natural actress who would get in character any time of the day.\n\nThe seasoned actor, who has spent a lot of time in the UK and South Africa behind the camera, has vast experience and recently morphed into an independent film producer, releasing The Cold Father where he also features as an actor.\n\nPart of the attendees were Khaya Arts Productions director, Future Dube as well as songstress, Bhekiwe. Speaking on the sidelines, Dube said understanding the art of listening was his major take away.\n\nI learnt a lot from Dlamini, especially the importance of always listening and learning. I also appreciate the lesson on being my own boss  writing my own scripts and producing my own movies, he said.\n\nActor Luthuli Dlamini teaching acting students during a masterclass session on Wednesday. (Pic by Pride Moyo)\n\nAnother attendee, Nomaswazi Tshongwe said the masterclass was an eye-opener.Im happy I attended the masterclass. From what I learnt, theres a significant difference between theatre acting and acting for television.\n\nThe insights on how to excel in auditions and approach acting as a business helped me better understand the film industry.Id like to thank Luthuli Dlamini, and Im grateful to have been part of it all, she said.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fgrfe.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Up-and-coming thespians and aspiring actors got a glimpse into the film industry yesterday as Bulawayo-born South African actor, Luthuli Dlamini, shared his insights at a local conference centre in Bulawayo. Due to high public demand and scheduling conflicts, Dlamini is set to host another session on Sunday to accommodate those who were […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "New deadline for Lake Gwayi-Tshangani",
            "url": "https://www.chronicle.co.zw/new-deadline-for-lake-gwayi-tshangani/",
            "content": "Leonard Ncube,[emailprotected]\n\nGOVERNMENT has expressed confidence that the 650-million-cubic-metre Lake Gwayi-Tshangani in Matabeleland North Province will be completed before the next rainy season after engineers gave assurance that the dam gates will be closed by October to begin water impoundment.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, has revealed that the dam is now 70 percent complete. The project is among the flagship infrastructure developments under the Second Republic, aligning with Vision 2030.\n\nLake Gwayi-Tshangani is a multi-faceted initiative, incorporating the construction of a dam wall, a mini-hydropower station, a 10-hectare irrigation scheme, and a 252km conveyance pipeline to Bulawayo.\n\nIts anticipated benefits include resolving Bulawayos persistent water challenges, establishing a greenbelt in Matabeleland North, and boosting national food security through the irrigation of 10 000 hectares.\n\nThe project is also expected to enhance the tourism sector and benefit Matabeleland South. Once the lake is operational, Bulawayos six current supply dams in Matabeleland South will be repurposed for irrigation, contributing to food security in the province.\n\nDr Masuka acknowledged that progress had been delayed due to resource constraints. However, the 2025 national budget has allocated ZiG3,1 billion to ensure the projects completion.\n\nConstruction of Lake Gwayi-Tshangani has been at a standstill because we have not been receiving resources. We are at 70 percent completion, and if funding is made available on time, we aim to finish by October or November this year, which will be in time for the 2025/2025 rainy season so we can begin to close the gates to impound water, he said during a recent visit to Lubangwe, Hwange.\n\nDr Masuka, who was in Matabaleland North last week,said engineers advised against closing the dam wall during the current rainy season to avoid structural damage due to excessive water pressure.\n\nDesigned by the Zimbabwe National Water Authority (Zinwa) and constructed by China Water and Electric Corporation, the dam will hold up to 650 million cubic metres of water.\n\nLocated 6,5km from the confluence of the Gwayi and Tshangani rivers, the concrete gravity arch dam will serve multiple purposes, including permanent water supply for Bulawayo via a 252km pipeline feeding into a treatment plant in Cowdray Park, a 10-megawatt hydropower station, development of 10 000 hectares of irrigated farmland to create a greenbelt in Matabeleland North and rural industrialisation under the Presidential Rural Development Programme.\n\nThe pipeline will also feature offtakes for 200-hectare irrigation projects along its route, enhancing food security and creating employment opportunities.\n\nDr Masuka said the project is critical in achieving Vision 2030 goals, as it will spur development in Binga and Hwange districts, while surrounding schools, clinics, and business centres will benefit from piped water. Irrigation schemes under the Vision 2030 Accelerator Model will make Matabeleland North food sufficient.\n\nOnce operational, Lake Gwayi-Tshangani will permanently address Bulawayos water challenges while transforming Matabeleland North into an agricultural and economic hub.\n\nDr Masuka said the Government has also taken measures to prevent flooding along the Gwayi River, ensuring the safety of infrastructure such as the Bulawayo-Victoria Falls highway.\n\nWhere we are now is that if we get enough resources, we hope by October we will be able to close the dam wall to block water.\n\nThis year we couldnt close because engineers said there is too much rain hence closing might cause flooding and damage to the structure, but this coming season we will be able to close and start impounding water, he said.\n\nDr Masuka said the project will create employment and development opportunities for local communities, making it a cornerstone of the Second Republics development agenda.  @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Dr-Anxious-Masuka.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw GOVERNMENT has expressed confidence that the 650-million-cubic-metre Lake Gwayi-Tshangani in Matabeleland North Province will be completed before the next rainy season after engineers gave assurance that the dam gates will be closed by October to begin water impoundment. Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, has revealed that […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        },
        {
            "title": "Teacher finally gets help  for chronic kidney ailment",
            "url": "https://www.chronicle.co.zw/teacher-finally-gets-help-for-chronic-kidney-ailment/",
            "content": "Trish Mukwazo,[emailprotected]\n\nMRS Isabel Mavengano, a 52-year-old Bulawayo teacher who has been battling a chronic kidney ailment for several years has finally secured a matching organ donor and is expected to leave the country today for surgical procedure in India.\n\nThe procedure, which is not readily available in Zimbabwe, will be performed in India at a cost of about US$40 000.\n\nThe Chronicle published Mrs Mavenganos appeal for help sometime in July last year, which helped raise awareness of her plight and influenced more public responses for her support.\n\nAs a result, she has managed to raise over US$29 000 for the surgical procedure and the amount is supposed to cover the surgery, post-operative care, travel and accommodation expenses.\n\nHer initial kidney donor had to pull out due to some health complications and she managed to get another one who is a family member and they will travel together.\n\nMrs Mavenganos friend, Mrs Nomathuli Makwenzi, who has assisted her during the whole course of seeking funds by fundraising events confirmed the journey.\n\nFortunately, we have a family member donating a kidney. The original donor had to pull out last minute due to health challenges. We have managed to get just over US$29 000. So, we have just decided to take the step and make the lifesaving trip, she said.\n\nThey will be taking the trip tomorrow and would depart from the Joshua Mqabuko Nkomo International Airport.\n\nMrs Mavengano, who teaches children with learning difficulties had been on peritoneal dialysis for the past three years, a treatment that has kept her condition stable but is not a long-term solution.\n\nShe is now on hemodialysis and her doctors have recommended a kidney transplant as the best option for her survival and well-being.\n\nShe needs the immediate medical intervention to improve her quality of life and prevent further health complications.\n\nMrs Mavengano has been on insulin treatment since the age of 16 when she was diagnosed with diabetes.\n\nDue to her ailment, Mrs Mavengano said she has since stopped undertaking some of her daily household chores, among other activities.\n\nThis condition took a toll on me as I couldnt take as much fluid as I wanted to. My kidney condition has made me prone to anaemia and I have lost the energy, she said.\n\nWith kidney problems, it meant I had to avoid food high in phosphorus and iodine like choumoellier and sweet potatoes. Peritoneal dialysis meant that I had to have my day properly planned.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dfef.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com MRS Isabel Mavengano, a 52-year-old Bulawayo teacher who has been battling a chronic kidney ailment for several years has finally secured a matching organ donor and is expected to leave the country today for surgical procedure in India. The procedure, which is not readily available in Zimbabwe, will be performed in India […]",
            "time": "09:08",
            "date": "30 Jan 2025"
        }
    ]
}