{
    "news": [
        {
            "title": "Man uses slasher to kill mother",
            "url": "https://www.chronicle.co.zw/man-uses-slasher-to-kill-mother/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nA 32-YEAR-OLD man from Sandton Park, Harare, has been taken into custody for allegedly committing a heinous act of violence, brutally slashing his own mothers head.\n\nA familys darkest hour unfolded on 8 February 2025, when Michael Mandigo, allegedly committed an unthinkable act of violence, striking his own mother, Jenia Mandigo (53) on the head with a slasher.\n\nIn a statement on X, the police said, The victim was found dead with multiple wounds on the head.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A 32-YEAR-OLD man from Sandton Park, Harare, has been taken into custody for allegedly committing a heinous act of violence, brutally slashing his own mother’s head. A family’s darkest hour unfolded on 8 February 2025, when Michael Mandigo, allegedly committed an unthinkable act of violence, striking his own mother, Jenia Mandigo (53) […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Cde Makombe elected National Chair of CZLWVA",
            "url": "https://www.chronicle.co.zw/cde-makombe-elected-national-chair-of-czlwva/",
            "content": "Johnsias Mutonhori\n\nCde Phinious Makombe from Midlands Province has been elected as the new National Chairman of the Children of Zimbabwe Liberation War Veterans Association (CZLWVA).\n\nThe election took place this Saturday in Victoria Falls. Makombe takes over from Cde Kholwani Mbambo, who had been serving as Acting Chairman since 2022.\n\nThe last congress was held in 2020, during which Cde Raymond Chiwara was elected chairman. He was removed two years later following allegations of corruption.\n\nCde Makombe garnered 78 votes, narrowly defeating Cde Lenin Samhembere from Mashonaland West Province, who received 68 votes. Another candidate, Tawanda Chenana from Mashonaland East Province, was disqualified from the chairman race after failing to provide proof that he is the son of a war veteran.\n\nOther candidates elected include Cde Darlington Ndlovu as Vice Chairman, Cde Mbuso Mpofu as Secretary General, Cde Prince Mfudza as Secretary for Commissariat, Cde Flint Matenda as Secretary for Security, and Cde Emmanuel Musabaikana as Secretary for Transport and Welfare.\n\nCde Makombe commented that the election went well and that he is ready to lead the Children of War Veterans.\n\nIndeed, it was a tight contest, but I am happy the election was held freely and fairly, and that everyone was satisfied with the results. Its time to chart a new era, addressing the plights of the Children of Liberation War Veterans and supporting the vision of our nation, he said.\n\nCZLWVA is an offshoot of the Liberation War Veterans, a wing of the revolutionary party, ZANU-PF.\n\nThe Children of Liberation War Veterans are hopeful that the new leadership will push for their welfare, including access to education through school fee assistance and economic empowerment initiatives such as access to land and business opportunities.\n\nI am happy with the outcome of the election, which was decided by all provinces. I hope that our concerns, such as access to land, mines, and other development projects, will be addressed, commented Chiedza Maraire, one of the voters from Mashonaland West.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Cde-Phinious-Makombe.jpg",
            "description": "Johnsias Mutonhori Cde Phinious Makombe from Midlands Province has been elected as the new National Chairman of the Children of Zimbabwe Liberation War Veterans Association (CZLWVA). The election took place this Saturday in Victoria Falls. Makombe takes over from Cde Kholwani Mbambo, who had been serving as Acting Chairman since 2022. The last congress was […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Man stabs wife with screwdriver",
            "url": "https://www.chronicle.co.zw/man-stabs-wife-with-screwdriver/",
            "content": "Trish Mukwazo[emailprotected]A BULAWAYO man was fined US$120 or two months in jail for stabbing his wife with a screwdriver following a domestic feud.The victim sustained lacerations on the chest as a result of the attack and had to be rushed to hospital.Tushonupane Mwembe (28) of Cowdray Park was convicted of physical abuse by Western commonage magistrate Mr Archie Wochihunga.In passing the sentence Mr Wochihunga noted that cases of physical abuse are on the rise.The courts should frown upon such offenders so that the community will see that the courts do not condone such behaviour, he said.The prosecutor Ms Audrey Kufandikamwe told the court that the incident occurred on 13 December last year around 9 pm when Mwembe stabbed his wife Ms Anna Mleya with a screwdriver on her back after the two had a misunderstanding.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Trish Mukwazo trishmukwazo515@gmail.com A BULAWAYO man was fined US$120 or two months in jail for stabbing his wife with a screwdriver following a domestic feud. The victim sustained lacerations on the chest as a result of the attack and had to be rushed to hospital. Tushonupane Mwembe (28) of Cowdray Park was convicted of physical […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Mbuyiseni Ndlozi resigns from EFF",
            "url": "https://www.chronicle.co.zw/mbuyiseni-ndlozi-resigns-from-eff/",
            "content": "Mbuyiseni Ndlozihas become the latest member of theEconomic Freedom Fighters(EFF) to resign from the party following his suspension.\n\nNdlozi confirmed his resignation in an interview with the SABC on Sunday night, saying he had decided to leave party politics and make contributions outside that arena.\n\nI have handed over my resignation. I have left the EFF, I have left party politics. EFF is a political party. I have handed in my resignation as a member, and it is because where I want to go and contribute, I cant hold a single-party membership, he said.\n\nBut overall, I think that Ive made my contribution, and I think that there are brilliant young men and women, old men and women in the space who will continue in that category, as it were, of party politics.\n\nNdlozis move comes after months of speculation about his future in the Red Berets.\n\nHis departure follows those of other high-profile EFF members this year, including former deputy leader Floyd Shivambu, former national chairperson Dali Mpofu, former public protector Busisiwe Mkhwebane and former government spokesperson Mzwanele Manyi, all of whom defected to Jacob ZumasuMkhonto weSizwe (MK) party.\n\nIn January, Ndlozi resigned as an MP after losing his position in the EFFs central command team during the partys national elective conference in December. The rift between Ndlozi and the Red Berets came after thedeparture of his close ally Shivambu, which saw the former being sidelined from EFF discussions.\n\nEFF leader Julius Malema criticised party members for not pledging allegiance to the party after alleging that Ndlozi was aware of Shivambus plans to defect to the MK party but did not say anything.\n\nIn one instance, Malema indirectly criticised Ndlozis wife, actress Mmabatho Montsho, after she liked an Instagram post by Shivambu announcing his defection.\n\nIn his interview, Ndlozi confirmed that he was barred from attending the EFF national peoples assembly in December and had been suspended six weeks before it. He said this was because of reports that he was among the EFF leaders waiting for the right moment to defect to the MK party. Ndlozi said it was not his responsibility to inform the EFF leadership of Shivambus plans to leave the party.\n\nHe described the suspension as irregular, arguing that it did not align with the partys constitution.\n\nI was told to stay at home and not participate in parliament and the rest of the activities of the EFF. It was very important for me because they said that the investigation is still ongoing; when it is finished, Ill then be given an opportunity to respond. I think we can agree that these are very serious allegations, he said.\n\nNdlozi said his decision to speak out was aimed at clearing his name.\n\nThe EFF has not issued a formal response to his resignation, but party spokesperson Sinawo Thambo said his public pronouncements constituted a resignation and that the party wished him well.\n\nNdlozi was a founding member of the party and previously served as its national spokesperson and an MP.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Mbuyiseni-Ndlozi-1_1200x675-1000x563-680x380.jpg",
            "description": "Mbuyiseni Ndlozi has become the latest member of the Economic Freedom Fighters (EFF) to resign from the party following his suspension. Ndlozi confirmed his resignation in an interview with the SABC on Sunday night, saying he had decided to leave party politics and make contributions outside that arena. “I have handed over my resignation. I have left the […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Soulful vibes: Mzoe 7 readies ‘Ungamthanda’ single, visuals release",
            "url": "https://www.chronicle.co.zw/soulful-vibes-mzoe-7-readies-ungamthanda-single-visuals-release/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nMusician Mzoe 7 is set to release his latest track, Ungamthanda, on Wednesday, accompanied by visuals.\n\nThe song features fast-rising artistes Smashmaker and Macala, while the music video was shot by Brooklyn Films at Lavinia Gardens, Tshabalala, and Chiefs Village. The visuals will also feature model and fitness trainer Klate alongside dancer Siya.\n\nSpeaking to Chronicle Showbiz Online, Mzoe 7 said this release is part of his promise to fans to drop new projects every month.\n\nI had the honour of working with Smashmaker on the song Tshilamoya, and I realised how talented he is  he brought out the soulful side of my music. After that, he sent me another beat just as I was returning from a seminar, where a speaker emphasised the importance of loving without expecting anything in return.Inspired by that, I crafted the lyrics for Ungamthanda, flipping the message to highlight the pain of loving someone who doesnt love you back.\n\nI also featured the incredibly talented Macala. Nurturing young talent is crucial because we wont be here forever. Its important to leave behind a solid legacy, and I believe these two artistes represent the future of our music industry. Their talent is out of this world.\n\nMzoe 7 further explained that the song tells the story of a young man who has given up on love, only for his friend to encourage him to remain hopeful but not to expect the same level of affection in return.\n\nOn the choice of locations for the video shoot, Mzoe 7 said it was important to showcase local landmarks and tell authentic stories.This soulful song speaks to the inner person, and Im confident that people will love it. As promised, I will be releasing a music video every month, as fans have been asking for more content.\n\n@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/llmmk.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Musician Mzoe 7 is set to release his latest track, Ungamthanda, on Wednesday, accompanied by visuals. The song features fast-rising artistes Smashmaker and Macala, while the music video was shot by Brooklyn Films at Lavinia Gardens, Tshabalala, and Chiefs Village. The visuals will also feature model and fitness trainer Klate alongside dancer […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Robbers caught by neighbours",
            "url": "https://www.chronicle.co.zw/robbers-caught-by-neighbours/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nTWO men have been arrested in connection with a robbery that occurred at a house in Greystone Park, Borrowdale, Harare.\n\nKnowledge Maturuguru (35) and Luckmore Nhau (46) were arrested for allegedly attacking a complainant and stealing US$220 cash on 8 February 2025.\n\nThe complainants scream for help alerted neighbours who quickly mobilized and assisted in the apprehension of the suspects, said the police on a statement on X.\n\nThe arrest led to the recovery of the stolen money.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/robbery-680x340.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com TWO men have been arrested in connection with a robbery that occurred at a house in Greystone Park, Borrowdale, Harare. Knowledge Maturuguru (35) and Luckmore Nhau (46) were arrested for allegedly attacking a complainant and stealing US$220 cash on 8 February 2025. “The complainant’s scream for help alerted neighbours who quickly mobilized […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "SA-based author Kudakwashe Muganu nominated for Emerge Africa Awards",
            "url": "https://www.chronicle.co.zw/sa-based-author-kudakwashe-muganu-nominated-for-emerge-africa-awards/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nZimbabwean-born author Kudakwashe Muganu, who is based in South Africa, has been nominated for the 2025 edition of the Emerge Africa Awards.\n\nNow in its fourth edition, the Emerge Africa Awards celebrates and honours some of the most influential individuals, brands, and organisations across the continent.\n\nMuganu, a writer, transformation speaker, certified life coach, philanthropist, and entrepreneur is vying for the Best Motivational Speaker of the Year award, competing against fellow author Mohammed Talks. He is calling on Zimbabweans to rally behind him and cast their votes to help secure the accolade.\n\nExpressing his excitement about the nomination, he told Chronicle Showbiz Online: Im very excited to be nominated and recognised  it truly shows that hard work pays off. I strongly believe I can bring the award home as I represent my beloved country, Zimbabwe.\n\nMuganu has authored two books: The Power of Wisdom and Who Does Not Want to Quit School?These books opened doors for me, leading to invitations to speak at high-profile platforms. City of Ekurhuleni and the Gauteng Province Department invited me as a guest speaker. I have also addressed several local schools and appeared on Soweto TV and radio stations such as Radio Pulpit, Jozi FM, Alex FM, Kasie FM, Vumani FM, and Nzhelele FM for motivational sessions, he said.\n\nMuganu is proud that his message has reached audiences beyond Zimbabwe, inspiring communities across Southern Africa. He urged his fellow Zimbabweans to support his bid for the award.I cannot do this alone  your votes matter. Lets bring this award home and put Zimbabwe on the map!\n\nTo vote for Muganu, South African-based supporters can send an SMS to 37587 with the text AFRICA 230.\n\nFollow Mthabisi Tshuma on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ugb.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Zimbabwean-born author Kudakwashe Muganu, who is based in South Africa, has been nominated for the 2025 edition of the Emerge Africa Awards. Now in its fourth edition, the Emerge Africa Awards celebrates and honours some of the most influential individuals, brands, and organisations across the continent. Muganu, a writer, transformation speaker, certified […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Mlue Jay collaborates with Flash Ikumkani for “Lotto” song",
            "url": "https://www.chronicle.co.zw/mlue-jay-collaborates-with-flash-ikumkani-for-lotto-song/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nSometimes, dreams feel just out of reach, and lotteries have become a beacon of hope for millions, offering the promise of unimaginable wealth and transforming lives overnight.\n\nNow, stepping into this narrative is Johannesburg-based rapper Mlue Jay, who seeks to capture the essence of this phenomenon in his new song, Lotto which features South African hip-hop sensation Flash Ikumkani.\n\nThe YeahWeLit Entertainment studios boss explosive collaboration titled, Lotto is set to drop on February 21 accompanied by visuals.\n\nMlue Jay told Chronicle Showbiz that the song, is an anthemic trap song that delves into the universal desire to succeed and rise above the struggles of everyday life. The tracks themes of perseverance and determination are reflected in our artistes gritty verses, which explore the notion of working tirelessly to achieve success  even if it means winning the lottery.\n\nProduced by US-based producer N1, who previously collaborated with Mlue Jay on the Impumelelo Intro featuring Vusa Mkhaya, Lotto boasts an infectious beat and masterful production. The song was mixed and mastered by Mlue Jay at YeahWeLit Entertainment Studios.\n\nThe Izono hit-maker said Flash Ikumkani, a prominent figure in South African hip-hop, brings his signature style to the track and boasts over a million streams across platforms and a stint at Emtee Records.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/zxaxsq.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Sometimes, dreams feel just out of reach, and lotteries have become a beacon of hope for millions, offering the promise of unimaginable wealth and transforming lives overnight. Now, stepping into this narrative is Johannesburg-based rapper Mlue Jay, who seeks to capture the essence of this phenomenon in his new song, “Lotto” which […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Nust FC wins Zifa Byo, Mat South D2 champions tournament",
            "url": "https://www.chronicle.co.zw/nust-fc-wins-zifa-byo-mat-south-d2-champions-tournament/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nBULAWAYO based soccer outfit Nust FC were the toast of the day when they won all their games at the Zifa Division Two champions tournament that was held on Saturday at Phelandaba Stadium in Gwanda.\n\nFour teams battled it for the honours and these were Zifa Matabeleland South Division Two champions Gwanda Pirates runner-ups Mawabeni FC, Zifa Bulawayo Division Two champions Eagle Life FC and runner-ups Nust FC.\n\nGwanda Pirates and Mawabeni FC will play in the Zifa Central Region Division One League this year while Nust and Eagle Life FC will play in the Zifa Southern Region Division One League.\n\nStarting off the tournament, Gwanda Pirates faced off with Eagle Life FC to a one-all draw before the latter won 4-2 on penalties.\n\nNust FC beat the Mawabeni side two goals to nil earning their spot in the finals where one goal against Eagle Life FC saw them emerge as the tournaments winners.\n\nFor third place, Mawabeni and Gwanda Pirates were in a goalless draw before being separated by penalties where Mawabeni won 3-2.\n\nNust FC head coach Lima Khabo said:\n\nIt was a good tournament, well organised and all the four teams played well. The tournament gave us a chance to pick out the positives and negatives in our team and areas where we should improve, said Khabo.\n\n-@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/NUST-FC.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com BULAWAYO based soccer outfit Nust FC were the toast of the day when they won all their games at the Zifa Division Two champions tournament that was held on Saturday at Phelandaba Stadium in Gwanda. Four teams battled it for the honours and these were Zifa Matabeleland South Division Two champions Gwanda Pirates […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        },
        {
            "title": "Job seekers flock to Pioneer House as Nexus Rooftop recruits ahead of launch",
            "url": "https://www.chronicle.co.zw/job-seekers-flock-to-pioneer-house-as-nexus-rooftop-recruits-ahead-of-launch/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nScores of job seekers gathered on Monday morning at Pioneer House in Bulawayo, where the new restaurant and bar, Nexus Rooftop, was recruiting staff.\n\nThe establishment is looking to hire hostesses, waiters/waitresses, chefs, bottle girls, cleaners and security personnel ahead of its highly anticipated soft opening this Friday, Valentines Day.\n\nThe scores of people mostly made up of the youth handed over their CVs as they wanted to get the jobs that were on offer. The day started off with screening people on which jobs they wanted to apply for before the final list of those who are going to be interviewed during the week.\n\nIn an interview, Nexus Rooftops Operations Manager, Wushe Wushe, said the venue aims to become the ultimate destination for entertainment and food enthusiasts in the city.\n\nFriday is our soft opening, which also coincides with a special day for lovers. It will be an evening of good wine, good food, and good fun, said Wushe.\n\nHe said they had combined food and entertainment, creating a multifaceted establishment that will include a bar, restaurant, and coffee shop.\n\nIt will be a bar, restaurant, and coffee shop, but the idea is to create the ultimate entertainment destination in Bulawayo, he said.\n\nAdditionally, he highlighted that there is no other place in Bulawayo with a rooftop like theirs, nor is there any other entertainment venue in the city that offers a garden setting like Nexus Rooftop.\n\nWe are also located in one of Bulawayos iconic buildings, the Pioneer Building. Essentially, we will be offering good foodthe best food in town will be served here, he added.\n\nRegarding operating hours, Wushe mentioned that they will be open from Monday to Sunday, starting at 7AM and closing at 12AM.\n\nYou should be able to enjoy your cup of coffee at 7:30 am and have breakfast available all day, he said.\n\nIn addition to providing a new spot for entertainment and dining, the establishment has created employment opportunities for locals, further boosting the community.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-10-at-10.28.24-680x380.jpeg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com Scores of job seekers gathered on Monday morning at Pioneer House in Bulawayo, where the new restaurant and bar, Nexus Rooftop, was recruiting staff. The establishment is looking to hire hostesses, waiters/waitresses, chefs, bottle girls, cleaners and security personnel ahead of its highly anticipated soft opening this Friday, Valentines Day. The scores […]",
            "time": "21:26",
            "date": "10 Feb 2025"
        }
    ]
}