{
    "news": [
        {
            "title": "Biden holds final Medal of Freedom ceremony, honoring Hillary Clinton, Bono and more",
            "url": "https://www.chronicle.co.zw/biden-holds-final-medal-of-freedom-ceremony-honoring-hillary-clinton-bono-and-more/",
            "content": "President Joe Biden awarded the nations highest civilian honor, the Presidential Medal of Freedom, to 19 people on Saturday, recognizing a broad swath of luminaries across politics, culture and the arts, including former Democratic presidential nominee Hillary Clinton, designer Ralph Lauren, U2 frontman Bono and philanthropist and megadonor George Soros.\n\nFor the final time as president I have the honor of bestowing the Medal of Freedom, our nations highest civilian honor, to a group of extraordinary  truly extraordinary people who gave their sacred effort to shape the culture and the cause of America, Biden said in brief remarks.\n\nThe medal is presented to people who have made exemplary contributions to the prosperity, values, or security of the United States, world peace, or other significant societal, public or private endeavors, according to a White House statement. Biden himself is a recipient, having been presented with the medal by then-President Barack Obama in the closing days of the latters administration.\n\nPresident Biden believes great leaders keep the faith, give everyone a fair shot, and put decency above all else, the White House said in the statement. These nineteen individuals are great leaders who have made America a better place. They are great leaders because they are good people who have made extraordinary contributions to their country and the world.\n\nTwo prominent American political figures were posthumously honored: former Attorney General Robert F. Kennedy and former Michigan Gov. George Romney, the father of former Sen.Mitt Romney.\n\nKerry Kennedy accepted the award on her fathers behalf. As Kennedy pointed out the family members in the crowd, Biden joked, Anyone not a Kennedy, stand up. Romney likewise accepted the honor on behalf of his father.\n\nIn remarkseulogizing Robert F. Kennedys wife, Ethel, last year, Biden said he had only two political heroes in my life: Dr. (Martin Luther King Jr.) and Bobby Kennedy, while noting hed decorated his Oval Office with a bust of Kennedy. The storied political family made national headlines in recent months with the Kennedys second-eldest son, Robert F. Kennedy Jr., controversially chosen by President-elect Donald Trump as his pick for the nextDepartment of Health and Human Services secretary.\n\nBiden has previously recognized a number of political allies with the award,including former House Speaker Nancy Pelosi and South Carolina Rep. Jim Clyburn last year.\n\nClinton, who was joined by her husband, former President Bill Clinton, received a standing ovation during the ceremony Saturday.\n\nThe presidents decision to honor Hillary Clinton caps off a long history of mutual admiration between the two Democratic leaders and comes after the Clintons honored Biden with the Clinton Global Citizen Award in a surprise ceremony in New York last September. Accepting the award, an emotional Biden thanked the former secretary of state for the way you have helped me, the way youve spoken up for me with such passion.\n\nI cant tell you, you can ask Jill, I  anyway, I love you. I love you, Biden said.\n\nThe president also recognized Soros, a liberal megadonor who the White House says has supported organizations, and projects across the world that strengthen democracy, human rights, education, and social justice, and famed Vogue Editor-in-Chief Anna Wintour, who hosted political fundraisers for the Biden campaign.\n\nLauren, a design industry titan, was also among the honorees Saturday. Laurens clothing has long been a favorite of the Biden family, including first lady Jill Biden,who wore a Ralph Lauren design on the cover of Vogue in August, and first granddaughter Naomi Biden,who wore a Ralph Lauren dress for her White House wedding in 2022.\n\nCelebrity chef, humanitarian and outspoken Trump critic Jos Andrs was recognized for his work with the World Central Kitchen, which the White House says has revolutionized the way food aid reaches communities affected by natural disasters and conflict around the world.\n\nIn entertainment, actors Michael J. Fox and Denzel Washington were honored, along with retired NBA player Earvin Magic Johnson. Washingtonwas scheduled to be among those honored in 2022, but he had to pull out of the ceremony after testing positive for Covid-19.\n\nWhen Biden put Johnsons medal on him, the 6-foot-9 basketball star crouched down, which drew laughter from the crowd.\n\nOne honoree not in attendance Saturday was soccer superstar Lionel Messi, who the White House said had scheduling conflicts that prevented him from attending the ceremony. Messi still received his award, the White House said.\n\nBono, a musician and humanitarian Bono, last year joined Jill Biden in her box at the State of the Union address, where he was recognized for his work fighting AIDS and building support for the US Presidents Emergency Plan for AIDS Relief, which celebrated its 20th anniversary last year. Bono and his U2 bandmates were also among the honorees for 2022s Kennedy Center Honors ceremony.\n\nIn the field of science, Biden recognized Planetary Society CEO and television host Bill Nye and world-famous conservationist Jane Goodall. Nye has partnered with the administration in the past to further the Biden White Houses climate initiatives.\n\nPosthumous medals were awarded to civil rights icon Fannie Lou Hamer and former Defense Secretary Ash Carter. LGBT advocate Tim Gill, private equity leader David Rubenstein, and American Film Institute and Kennedy Center Honors founder George Stevens Jr. rounded out the list of honorees.\n\nSource : CNN\n\nSource : CNN\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/BHJ.jpg",
            "description": "President Joe Biden awarded the nation’s highest civilian honor, the Presidential Medal of Freedom, to 19 people on Saturday, recognizing a broad swath of luminaries across politics, culture and the arts, including former Democratic presidential nominee Hillary Clinton, designer Ralph Lauren, U2 frontman Bono and philanthropist and megadonor George Soros. “For the final time as […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "Seh Mac hangs up his mic to pursue DJ dreams",
            "url": "https://www.chronicle.co.zw/seh-mac-hangs-up-his-mic-to-pursue-dj-dreams/",
            "content": "Mthabisi Tshuma[emailprotected]\n\nDancehall musician Seh Mac (born Macnore Sibanda) has dropped the mic as a singer and decided to pursue his long-time dream of becoming a DJ.\n\nThe artist, who had a nine-year music career, was steadily growing in the industry, eventually gaining national and regional recognition.\n\nThroughout his music career, he managed to collaborate with internationally acclaimed artists, including Jamaican-born Natural Image on the track Whine Your Waist. Some of his notable tracks include Mangoma Takapasa and Mumwe Musikana.\n\nSpeaking from his South African base, Seh Mac shared that he had decided to focus on DJing.\n\nIt has always been my dream to be a DJ, and that dream has finally come to pass as I have learnt the ropes and now do my art properly. As a DJ, I focus on deep house, 3-step, Afro-tech, and hip-hop music, and I have managed to land gigs where I spin tracks at a number of Maboneng and Sandtons hottest clubs. Clubs I have played at include Maracana in Sandton, Jojo Rooftop in Maboneng, Sheba Lounge in Kempton Park, Kitcheners Braai, Love Revo in Maboneng, Bubbles in Braai, and EJaradin Lounge in Germiston.\n\nMy fans in Zimbabwe should get ready for the new change as Im coming to Zim in April to showcase my eclectic beats. I am still working on finding a good venue, said Seh Mac.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yuk5.jpg",
            "description": "Mthabisi Tshuma revmmthiretshuma@gmail.com Dancehall musician Seh Mac (born Macnore Sibanda) has dropped the mic as a singer and decided to pursue his long-time dream of becoming a DJ. The artist, who had a nine-year music career, was steadily growing in the industry, eventually gaining national and regional recognition. Throughout his music career, he managed to […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "WATCH: Unity, Rhythm and Joy: The 6th edition of the Kokota Festival leaves a lasting impression",
            "url": "https://www.chronicle.co.zw/watch-unity-rhythm-and-joy-the-6th-edition-of-the-kokota-festival-leaves-a-lasting-impression/",
            "content": "Mthabisi Tshuma[emailprotected]\n\nThe sixth edition of the Kokota Festival was bigger and better, uniting young artists and party lovers from the City of Kings and Queens when it was held on Unity Day.\n\nThe leisure spot, The Vista, came alive with pulsating beats and energetic performances from up-and-coming artists across genres, primarily hip hop and Amapiano. The spectacular event was a testament to the power of music, dance, and community spirit.\n\nThe festivals exciting lineup featured dance groups, musicians, electrifying DJs, charismatic MCs, and stunning models, all of whom came together to create an unforgettable experience.\n\nThe crowd was wowed by the impressive performances, which showcased the best of local talent. Notable performances came from Amakruger, Smokey, Blaq Oops, and Browny aka Mr Kokota.\n\nCommenting on this years edition, the brainchild of the Kokota Festival, Browny, said the event was more than just a showcase of artistic expression.\n\nIt was a celebration of community, a reminder that music and dance have the power to unite us all. The 6th edition of the Kokota Festival was a resounding success, a shining tribute to the power of rhythm, joy, and community.\n\nAs we reflect on the magic of that unforgettable day, we are reminded that the true spirit of Kokota lives on, inspiring us to come together and celebrate our shared humanity, said Browny.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/87.jpg",
            "description": "Mthabisi Tshuma  revmthiretshuma@gmail.com The sixth edition of the Kokota Festival was bigger and better, uniting young artists and party lovers from the City of Kings and Queens when it was held on Unity Day. The leisure spot, The Vista, came alive with pulsating beats and energetic performances from up-and-coming artists across genres, primarily hip hop […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "Multiple airports close runways as snow batters Britain amid dire warnings up to 16 inches could…",
            "url": "https://www.chronicle.co.zw/multiple-airports-close-runways-as-snow-batters-britain-amid-dire-warnings-up-to-16-inches-could/",
            "content": "Heavy overnight snow has caused several airports to close their runways this morning as up to 16 inches could fall in parts of the country today.\n\nThe UK was plunged into chaos this weekend after anArctic blast brought heavy snow,freezing rain, and ice that has shut roads, halted travel and caused power outages.\n\nTheMet Officeupdated severe weather warnings covering areas of the Midlands, Wales and much of northern England today.\n\nBoth Manchester andLiverpool airporthave been forced to shut their runways this morning due to snowy weather conditions, they announced on social media.\n\nMeanwhile,BirminghamAirport confirmed it has now reopened its runway after snow clearing, but passengers are advised to check with their airlines for updates.\n\nBristol Airportreopened at around 11pm after an earlier closure but warned of delays this morning due to aircraft being out of position.\n\nNational Highways warned up to 25cm of snow could hit roads in northern England, including the A628 Woodhead Pass, which connects Greater Manchester and South Yorkshire through the Peak District and was closed overnight in both directions.\n\nThe A66 in County Durham and Cumbria was also closed between the M6 and A1M due to the conditions.\n\nHeavy snow has caused disruption and runways to close at Manchester Airport this morning\n\nSnow is seen surrounding aircraft at Manchester Airport in the early hours of this morning\n\nThe Met Office updated severe weather warnings covering areas of the Midlands, Wales and much of northern England today\n\nDue to snow, the runway is temporarily closed but the airport remains open, please contact your airline for flight information. We are working hard to clear the runway and will provide an update at 07:45pic.twitter.com/XBMJU5h9a0\n\n Liverpool John Lennon Airport (@LPL_Airport)January 5, 2025\n\nMotorists struggle to drive as snow covers Newcastle city centre\n\nAs well as snow, National Highways warned rain may initially fall on frozen ground and lead to ice with areas of high ground, including the Cotswolds and Peak District, most at risk.\n\nPeople of Newcastle woke up to their first snow covering in 2025 as the country prepared itself for a freezing cold snap.\n\nSunday morning commuters were forced to wrap up warm as they braved the elements in the city centre during zero degree temperatures.\n\nTwo cars had already collided by 7am close to the citys Quayside as the icy weather made for hazardous driving conditions.\n\nLocals shielded themselves with umbrellas as they walked past Newcastles Greys Monument which stood against the wintry backdrop.\n\nResidents of Gateshead were also greeted to a winter wonderland this morning after heavy snowfall overnight.\n\nThe head of the famous Angel of the North statue was pictured covered in white against the backdrop of grey skies.\n\nMeanwhile, rain has been causing concern in Devon, with the Environment Agency issuing two flood warnings  with flooding expected this morning on the River Taw and the River Torridge.\n\nThe National Grid said they had been working to restore power after outages across the Midlands, south-west England and South Wales on Saturday.\n\nPeople wheel their suitcases through snow at Manchester Airport this morning\n\nOne person reported being stuck on a plane at Manchester Airport for two hours this morning\n\nSnow falls in Newcastle city centre this morning as bad weather batters the UK\n\nCars are hit by snow in the early hours of the morning in Newcastle city centre\n\nA person walks their dog along a snow covered road in Bradford this morning\n\nSnow falling in Newport. Large parts of the country will face disruption from heavy snow and freezing rain over the weekend after forecasters issued two amber weather warnings\n\n As a result of resilience teams working throughout the night, the start up to the schedule remains business as usual.\n\nPassengers travelling to the airport are advised to allow plenty of time, we will continue to update passengers throughout the morning. Please check our\n\n Birmingham Airport (@bhx_official)January 5, 2025\n\nThe companys live map showed power cuts across the region this morning including in Birmingham, Bristol and Cardiff.\n\nNational Highways previously reported major disruptions on roads, including the M5 in Somerset, where a series of crashes led to long delays last night.\n\nOn the A303 in Wiltshire, a stretch of road is closed in both directions due to heavy snow, and the M62 in Greater Manchester has been severely disrupted by snow and ice, with multiple accidents blocking lanes.\n\nThe weather is also affecting rail travel, with National Rail Enquiries confirming that the line between Inverness and Dingwall in Scotland remains closed due to flooding and landslips.\n\nTrain services between Inverness and other destinations in northern Scotland are also experiencing delays.\n\nWhile theNHSBlack Country integrated care board has warned the public to avoid going out early when the frost is thick or late at night when its dark, adding people should keep hands free and wear shoes with a good grip.\n\nAnd in Herefordshire, the Wye Valley NHS Trust told people to have sufficient food and medicine and take measures to reduce draughts in your home.\n\nHowever, that didnt stop revelers in Leeds going out on the town in the freezing cold without coats on.\n\nThe weather didnt stop revelers in Leeds going out on the town in the freezing cold without coats on\n\nSnow begins to fill in Leeds as party goers brave the arctic conditions\n\nThe Met Office has issued new snow warnings for Sunday, with even more snow expected to fall\n\nSnow also blanketed London overnight. Pictured is one of the citys famed red buses picking up a passenger\n\nStreets in Londons Hampstead Heath area of were covered in snow overnight\n\nA person wraps up warm in their coat as cars brave the snow in London\n\nThe gritters were out in force across the country last night. Pictured is one in London\n\nThe Met Office has issued new snow warnings for Sunday, with even more snow expected to fall. In addition to the snow, freezing rain is expected to cause dangerous ice conditions across Wales, the Midlands, and parts of northern England.\n\nA Met Office spokesperson confirmed that temperatures reached as low as -8.6C in Aboyne, Aberdeenshire, on Saturday night.\n\nOn Sunday, temperatures are expected to range from 2-5C in most areas, with some southern parts of the UK seeing highs of 7C. However, conditions will remain cold, with the wind chill making it feel even colder.\n\nUp to 40cm of snow could accumulate in higher ground areas, including parts of Wales and the southern Pennines.\n\nSnow and ice will continue to disrupt travel, with the potential for more road closures and delays to public transport services.\n\nThe Met Offices amber warnings for snow and ice will remain in effect until Sunday afternoon in some areas, while yellow warnings cover most of England, Wales, and parts of Scotland.\n\nForecasters predict that, as milder air moves in from the south, the snow will turn to rain in some areas, but freezing rain will persist in others, worsening the risk of hazardous conditions on the roads.\n\nChildren play in the snow as their father keeps watch from his car\n\nAn ambulance drives through the freshly laid snow on January 04, 2025 in Blackwood, Wales\n\nVehicles negotiating the snow in dangerous conditions\n\nThe health impact of the cold snap is also a concern, with the UK Health Security Agency (UKHSA) issuing cold weather health alerts for all of England.\n\nThe elderly and those with pre-existing health conditions are particularly vulnerable to the severe cold, which could increase the risk of heart attacks, strokes, and chest infections.\n\nEmergency services are urging people to avoid unnecessary travel, particularly in high-altitude areas such as the Cotswolds and Peak District, where snow is expected to fall heavily.\n\nThe NHS has also warned the public to be cautious of icy conditions, and to avoid going out early in the morning or late at night when frost is thick.\n\nHealth SecretaryWes Streetingsaid that Britons should take precautions, advising people to layer up and ensure their heating is on during the cold snap.\n\nHe told BBC Breakfast: We are heading into a cold snap this weekend and I know there are lots of concerns, not just amongst charity leaders, but also among NHS and social care leaders as well, about the particular risks and vulnerabilities this weekend as temperatures drop, both in terms of risk of accident and injury, but also risk from the cold itself.\n\nA house is illuminated with Christmas lights as snow falls. Temperatures reach -10 C this weekend in some parts of the UK with Amber weather warnings issued by the Met office\n\nA car navigates his way down a hill through snow\n\nOngoing ! Bristol International Airport (BRS) in West England has suspended flights due to heavy snowfall, Many parts of the UK and Ireland will have snow and rain this evening and overnight.\n\nWhile Seventeen flights have been diverted so far, 10 flights have been canceled.\n\nSnow falling in Basingstoke. Large parts of the country will face disruption from heavy snow\n\nThis is a weekend to wrap up and keep warm, to take sensible precautions about going out and about.\n\nCouncils across London and southern England have also activated emergency measures including additional accommodation to help rough sleepers stay safe during the cold snap.\n\nSunday will bring a slight respite for some areas as milder conditions move in, with temperatures potentially rising to 13C (55F) in southern England.\n\nHowever, these conditions will be short-lived, as another cold front is expected to bring sub-zero temperatures and more snow by Monday.\n\nBy Sunday afternoon, areas such as the Midlands and northern England will experience further snow showers, and heavy snow is likely to continue affecting parts of Wales.\n\nA series of weather warnings will come into effect, with status orange snow and ice warnings issued\n\nPeople out walking at the Wicklow Gap mountain pass in Co Wicklow\n\nUK set for icy and snowy weekend as Met issues Amber weather warning\n\nThe Met Office has warned that conditions could remain hazardous into Monday, with ice, snow, and freezing rain still affecting travel.\n\nDan Stroud, a meteorologist at the Met Office, said: Although Sunday will bring some milder conditions, the cold weather will return next week. We expect temperatures to remain below average for much of the country, with widespread frost and the risk of more snow showers in northern Scotland.\n\nThis comes after a walker diedafter falling 70m from a mountain ridge in the Lake District.\n\nKeswick Mountain Rescue said their first callout of the year ended in tragedy after the man died after falling from Sharp Edge on Blencathra on January 2.\n\nThe team were joined by the Great North Air Ambulance Service, Coastguard Helicopter R199, and the police.\n\nOur thoughts and condolences go to the mans family and friends, the team wrote on Facebook.\n\nSource: Dailymail\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dbgc.jpg",
            "description": "Heavy overnight snow has caused several airports to close their runways this morning as up to 16 inches could fall in parts of the country today. The UK was plunged into chaos this weekend after an Arctic blast brought heavy snow, freezing rain, and ice that has shut roads, halted travel and caused power outages. The Met […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "Young Miners for Economic Development (YMED) calls for policies to enhance Zimbabweans’ benefits from mining sector",
            "url": "https://www.chronicle.co.zw/1ymed-calls-for-policies-to-enhance-zimbabweans-benefits-from-mining-sector/",
            "content": "THE president of Young Miners for Economic Development (YMED), Mr Nyasha Magadhi, has urged the Government to adopt policies that maximise the benefits Zimbabweans derive from the countrys mining sector.Mr Magadhi, a vocal advocate for youth and local participation in mining, stressed the importance of creating robust frameworks that prioritise skills transfer, local employment, and economic inclusion throughout the mining value chain.Speaking on the need for greater local involvement, Mr Magadhi identified three critical areas where Government intervention could make a significant impact.These include skills transfer to ensure that mining companies employ local human resources managers who are empowered to make independent employment decisions, promote the inclusion of local businesses in the mining value chain by prioritising Zimbabwean suppliers and mandating that all contractors operating in the mining sector be registered in Zimbabwe and contribute to the local tax base.\n\nMr Magadhi emphasised the pivotal role of local HR managers in fostering fair employment practices and enhancing opportunities for Zimbabweans.\n\nThe human resources managers should be locals who understand our workforce and can ensure fair opportunities for Zimbabweans. Companies can provide the qualifications and criteria they are looking for, and it is up to the HR manager to handle the recruitment process, he said.CKED\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/6yq4.jpg",
            "description": "THE president of Young Miners for Economic Development (YMED), Mr Nyasha Magadhi, has urged the Government to adopt policies that maximise the benefits Zimbabweans derive from the country’s mining sector. Mr Magadhi, a vocal advocate for youth and local participation in mining, stressed the importance of creating robust frameworks that prioritise skills transfer, local employment, […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "WATCH: Help from the skies: Critically-ill child flown to Harare",
            "url": "https://www.chronicle.co.zw/watch-help-from-the-skies-critically-ill-child-flown-to-harare/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nJUST over two weeks ago, four-and-a-half-year-old Tatenda Machezera was a picture of health. But on a seemingly ordinary Sunday morning, December 22, 2024, a sudden and terrifying change occurred. Tatenda began complaining of a severe headache and dizziness, and within hours, her condition dramatically deteriorated.\n\nAlarmed by her nosebleeds and unexplained bleeding from the mouth, her grandparents swiftly rushed her from their home in Bulawayos Emganwini suburb to the nearest clinic in Nketa.\n\nThe picture shows Tatenda Machezera being airlifted from Bulawayo to Harare by HeliDrive crew.\n\nStaff at the local clinic referred the little girl to the United Bulawayo Hospitals (UBH), where her grandparents, Alexander Tirimboyi and Sphephile Ncube, began a near-fortnight stay at the referral health facility. This continued until yesterday afternoon when the ailing child was airlifted to Parirenyatwa Hospital in Harare.\n\nAccompanied by her granny, Ncube, young Tatenda will undergo a barrage of tests to determine exactly what she is suffering from  the type of disease that would render a healthy child bedridden and in excruciating pain.\n\nTatenda was born without any complications and was a healthy child until December 22 when she got sick to an extent that she was bleeding from the nose and mouth. We spent the festive season at UBH as doctors and nurses tried to figure out what exactly is wrong with our grandchild. The doctors suspect she could be suffering from bone marrow cancer, but they said its better she is transferred to Harare for more tests, said Tirimboyi.\n\nOn the right is Mrs Siphephile Ncube,Tatenda Machezeras grandmother\n\nJust before noon yesterday, UBH staff, patients, and visitors were taken aback by the sounds of rotor blades of an Ansat helicopter whirring in the air, announcing the arrival of the life-saving air ambulance in the city. The helicopter, a flying intensive care unit, is one of two air medical rescue service ambulances that will be stationed at UBH to offer swift medical responses for emergencies, such as the critically injured in road accidents.\n\nThe air ambulance will also be used to airlift patients from hard-to-reach areas, which would typically take hours to get to by road. Yesterday, HeliDrive Zimbabwe, the air ambulance service, had two passengers  little Tatenda and her granny, Ncube, who was travelling as the legal guardian of the child. Tatendas parents work in South Africa, and her mother is expected to be in Harare this evening.\n\nWe will know exactly what it is our granddaughter is suffering from when the doctors are done with the tests, said Tirimboyi.\n\nHe expressed his gratitude to HeliDrive Zimbabwe for the swift and efficient services that ensured young Tatenda was airlifted to the capital city at no cost to the family.\n\nThe staff at UBH has been amazing. Tatenda was in a bad state when she arrived at UBH, but they made sure that she gets the best assistance. Im grateful to HeliDrive Zimbabwe and the Government for introducing such a life-saving service that will ensure that patients are transferred from one hospital to another in a short space of time, he said.\n\nIt takes about six hours to drive from Bulawayo to Harare, a long drive that is not suited for someone in a precarious condition such as Tatenda. By helicopter air ambulance, the journey can be completed in slightly more than an hour. Typically, HeliDrive Zimbabwe carries a single adult patient, but in the case of a minor, a legal guardian is also accommodated in the air ambulance. In total, six people  Tatenda, Ncube, a medical doctor, a technician, pilot, and co-pilot  were aboard the air ambulance as it made its way into the skies to Harare.\n\nOnce the helipad at UBH is complete, the HeliDrive Zimbabwe crew  doctors, pilots, technicians, and other personnel  will be housed in a building at the hospital. The ideal response time is 15 minutes from the time a call is received to the air ambulance taking off, as explained to Saturday Chronicle by HeliDrive Zimbabwe accountable manager Ellemencia Nyasha Makosa last year. In the event that the air ambulance is summoned to an area where there is no helipad, the pilots use their discretion to use an open space such as a sports field to land.\n\nAir medical ambulances play a crucial role in healthcare by transporting patients, often in critical condition, from one location to another using aircraft specially equipped with medical equipment and staffed by trained medical professionals. The importance of air medical transport lies in its ability to provide rapid and efficient transportation for patients who require immediate medical attention or specialised care that may not be available locally.\n\nThe service allows for timely access to advanced medical facilities and specialised healthcare providers that may be located far away. This is particularly significant for individuals residing in remote areas or regions with limited healthcare resources. By bridging the geographical gap, air medical transport ensures that patients receive the necessary medical interventions promptly, potentially saving lives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dfgdfgfgf-680x380.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com JUST over two weeks ago, four-and-a-half-year-old Tatenda Machezera was a picture of health. But on a seemingly ordinary Sunday morning, December 22, 2024, a sudden and terrifying change occurred. Tatenda began complaining of a severe headache and dizziness, and within hours, her condition dramatically deteriorated. Alarmed by her nosebleeds and unexplained bleeding […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "Journalist helps deliver baby in the dead of night",
            "url": "https://www.chronicle.co.zw/journalist-helps-deliver-baby-in-the-dead-of-night/",
            "content": "Chronicle Writers\n\nIN the dead of night, around 2AM on Christmas Eve, a chance encounter transformed two friends  journalist, Patrick Chitumba and Tinashe Chikwata  into unlikely heroes. After a night out in Mkoba 15 suburb, they were approached by Lewis Simbarashe Ngazire, a frantic husband pleading for help. His wife, Lilian (19), was in active labour and needed to be rushed to Mkoba Polyclinic in Mkoba 13 suburb.\n\nAs Ngazire recounted his wifes situation in the car, they both assumed they would simply drop her off at the nearby clinic, conveniently located en route to where Chitumba stays. However, upon arriving at the house, they met a scene of escalating panic. A group of concerned neighbours had gathered outside, urgently informing them that Lilians labour had progressed rapidly, and she was already in the throes of childbirth.\n\nWe quickly sprang into action, entering the room to find her in labour. Despite having no prior experience, we knew we had to act fast to ensure the safety of both Lilian and her baby. Perhaps it was the courage gained from our earlier evening out that prompted us to take charge of the situation, said Chitumba.\n\nChitumba with Ngazire\n\nWith a power outage plunging the house into darkness, they relied on their phone torches to navigate the situation. Though lacking medical training, Chikwata quickly called his friend, Dr Tafara Gapare, a medical practitioner at Claybank Hospital in Gweru, for emergency guidance.\n\nFollowing Dr Gapares instructions over the phone, Chitumba and Chikwata assisted with the delivery. They donned surgical gloves and, with the doctors precise directions, successfully tied and cut the umbilical cord.\n\nAfter this dramatic birth, the duo transported the exhausted mother and her newborn to Mkoba Polyclinic for further medical care, ensuring a safe and happy ending to their unexpected Christmas Eve adventure.\n\nGweru Mayor Councillor Martin Chivhoko commended the selfless act and quick thinking of the two friends, calling it a true Christmas miracle.\n\nIt was on the 24th around 2.30AM when a healthy baby girl was brought in by Patrick Chitumba and his friend. The baby was fit, pink and wrapped in a blanket. The mother and baby are fine and have since been discharged, he said.\n\nA recently released Zimbabwe Demographic Health Survey (ZDHS) has revealed alarming figures  nearly one in five births in the past five years occurred at home, a stark reminder of the challenges faced by the countrys healthcare system. Experts have unanimously condemned this figure as unacceptably high.\n\nThe report indicates that only 77 percent of births took place in healthcare institutions, a far cry from the desired level. When contacted for comment, Dr Gapare said he thought the call was random.\n\nIt is the first time I have received such a call. I am used to receiving such calls from hospitals that are equipped. So, I had to quickly think outside the box and assist by giving instructions to save the baby and the mother.\n\nA wave of relief washed over him when Chikwata called moments later, confirming their safe arrival at the clinic and reporting that both mother and baby were stable.\n\nI felt happy and relieved as well, said the doctor.\n\nDr Gapare stressed the importance of hospital deliveries, explaining that numerous complications can arise during pregnancy and childbirth, and having access to qualified medical professionals is essential for both mother and baby.\n\nBefore delivery, the baby might get distressed while in the womb. The mother might start bleeding while in labour and sometimes the baby might be big such that the mother will not be able to do a normal delivery. If such things are encountered, there will be a need for an emergency Caesarean section to save both the mother and the baby and this can only be done at a health facility, he said.\n\nChitumba, Chikwata and Lilian with the baby\n\nDr Gapare explained that immediately after delivery, it is crucial to separate the baby from the placenta using sterile equipment. This procedure is essential to prevent any risk of the baby bleeding to death.\n\nSoon after delivery, the mother will need to get medication known as oxytocin which helps to contract the womb so that she does not bleed to death. The mother also has to be examined to check if there are tears in the birth passage; these are very common. There are situations where the baby might become breathless soon after birth and, in such situations, oxygen will be needed. These are just a few examples to show that deliveries should be done in health facilities under supervision, he said.\n\nA wide smile spread across Lilians face as she spotted Chitumba and Chikwata approaching her lodgings in Mkoba 13. She was busy washing dishes outside their rented room, but her joy was evident.\n\nI remember you two; you are the ones who assisted me and my baby, she said with a smile on her face. Lilian shared that she married Ngazire early last year and that they had named their daughter Lilian Miguel.\n\nWe got married last year and we are very happy with this blessing from God. She is our first born. When asked how she felt while waiting for her husband to return with an ambulance or any vehicle, she said she tried to remain calm and avoid panicking.\n\nI tried not to panic or make unnecessary movements. I had this belief that everything would be fine and yes, everything went on well, she said. Chikwata remarked that divine intervention was at work during those early hours.\n\nImagine if we had not stopped for that man? He frantically stopped our vehicle as if he wanted to throw himself in front of our car. At the house, upon seeing that no assistance was coming, I had to call a medical doctor who assisted us. I am grateful that the mother and the baby are safe, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yjuyuyyyi.jpg",
            "description": "Chronicle Writers IN the dead of night, around 2AM on Christmas Eve, a chance encounter transformed two friends — journalist, Patrick Chitumba and Tinashe Chikwata — into unlikely heroes. After a night out in Mkoba 15 suburb, they were approached by Lewis Simbarashe Ngazire, a frantic husband pleading for help. His wife, Lilian (19), was […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "COMMENT: Zimbabwe starts New Year with a promise of life",
            "url": "https://www.chronicle.co.zw/comment-zimbabwe-starts-new-year-with-a-promise-of-life/",
            "content": "The local penal code has been transforming markedly over the past 30 years.\n\nFrom a largely punitive, tit-for-tat, an-eye-for-an-eye one, it is becoming increasingly corrective and rehabilitative.\n\nYes, it still sends the message to criminals that their ways are wrong and punishable, but at the same time, attempts to give them a second chance.\n\nIn 1996, the countrys first open prison for male convicts was opened at Connemara near Kwekwe. In June 2021, the Government opened the second such prison in Marondera, this one to serve female convicts.\n\nInmates in open prisons are allowed to visit friends and relatives on off-days and can host them; they wear personal clothes, cook for themselves and have keys to their prison rooms.\n\nIn addition, the Zimbabwe Prisons and Correctional Service (ZPCS) is intensifying educational and skills training for thousands of inmates. Some of them are actually working at MacDonald Bricks here in Bulawayo, earning wages part of which they can send out to their families.\n\nThe ZPCS also has regular open days on which prisons countrywide are opened for people to visit their jailed friends and relatives.\n\nIn December, Justice, Legal and Parliamentary Affairs Minister, Ziyambi Ziyambi said the Government is reviewing its laws with a plan to implement a parole system. This will allow, subject to one meeting a range of stringent conditions, a prisoner to be released before they complete their sentences.\n\nOn the whole, this model helps inmates to reintegrate into society more smoothly at the point of their release. It corrects and rehabilitates.\n\nOn New Years Eve, President Mnangagwa signed the Death Penalty Abolition Bill into law, ensuring the country joined a global movement that rejects capital punishment. This means that the 48 men who had been on death row have had their lives spared. Their punishments have now been commuted to life in jail.We have become the 24th African nation and 127th globally to scrap the ultimate penalty from its criminal code.\n\nComing almost 20 years since the last execution in the country and the ranks of the condemned growing to 62 by 2022 before falling to 48 now, we laud the Government for launching the country into the New Year with a promise of life.\n\nWe understand that some of us, especially those whose relatives were murdered in aggravating circumstances, would have felt a sense of justice being delivered if those who killed their relatives also got killed.\n\nThe case of Rodney Jindu, who murdered two people in Bulawayo in January 2017, dismembering and setting body parts of one of his victims on fire, comes to mind.\n\nWithout belittling the crimes that sent them to jail in the first place, we are of the considered view that no one deserves to lose their life on the basis of a court ruling. That is vindictive, cold and worse-than-animalistic. That does not make our society any different from the Jindu type.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/HTRTY.jpg",
            "description": "The local penal code has been transforming markedly over the past 30 years. From a largely punitive, tit-for-tat, an-eye-for-an-eye one, it is becoming increasingly corrective and rehabilitative. Yes, it still sends the message to criminals that their ways are wrong and punishable, but at the same time, attempts to give them a second chance. In […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "Hildar Foromozo: Building fabulous and smart homes for women",
            "url": "https://www.chronicle.co.zw/fab-fabsmart-homes-how-it-all-started/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nHILDAR Foromozo, driven by the belief that every woman deserves a fabulous and stylish home, regardless of her financial circumstances, founded Fabsmart Homes in Bulawayo in 2019. This venture, born from a desire to empower women, offers a curated selection of high-quality kitchenware and luxurious blankets designed to infuse a touch of royalty into every home.\n\nLocated in one of the busiest shopping malls in Bulawayo, Ascot, Fabsmart has managed to create a database of more than 2000 women who have been sourcing different home items from Foromozo.\n\nHildar Foromozo collecting her order from Kango Products\n\nIn her explanation, Foromozo said her business idea came after losing a job from her former employer. Being a person who loved kitchen items, she owned multiple sets of kitchen utensils, and people started relying on her when they hosted parties and gatherings. This made her think of selling the wares she had in her house.\n\nShe then saw that people were willing to buy, and she came up with the idea to be a supplier of quality and classy items to fellow ladies so that they have fabulous and smart homes. She shortened this into Fabsmart Homes, a brand name for her business.\n\nThere was a time when I was unemployed, and I told myself I had to create a job for myself. But I asked myself, what business should I do? I looked around my house and I had pots in excess.\n\nI dont know if I can say I have a weakness or a soft spot for pots. Because of that, my friends would abuse that privilege, coming to my house and borrowing the pots when hosting parties and gatherings. Sometimes they brought my pots back burnt or soiled, so instead of borrowing them, I thought of selling the pots to them. So, I can say I started selling used pots, said Foromozo.\n\nFrom selling used pots, Foromozo opened her first shop in the CBD in 2019, where she could stock a few items since she didnt have enough capital. However, due to support from different platforms, she got tenders to supply some local hotels in Bulawayo, which was her major boost. Foromozo also said that during the Covid-19 lockdown, she approached a local pots producer, Kango Products, and opened a distributor account, which she then did well with.\n\nAfter Covid-19, business went down, and I came up with a club initiative, where ladies would pay whatever they could afford and collect their pots after they finished paying.\n\nhow Fabsmart Homes started\n\nThe initiative is to give every lady an opportunity to buy classy items for their home. An empowered woman is a happy woman, and it reduces chances of gender-based violence. I also managed to supply women with classy blankets in 2024, and if you joined the clubs last year, you have classy pots and blankets, and we are going to the next level, she said.\n\nTaking advantage of the information and experience she has with many ladies she worked with, Foromozo said this year she will engage different ministries and organisations to empower women with business ideas and initiatives so that they can own cars, houses, and sustainable businesses.\n\nWe have a database of about 2 000 women who are willing to be empowered and they are ready. We are not going to ask for exorbitant inputs, but we are going to ask them to avail themselves when we knock on their doors. We are not going to ask for money, because the little we have, we will try to work with it. Im not a public speaker, but what I know is Im good at talking and will convince ladies so that we do some impactful projects beyond blankets, said Foromozo.\n\nMeanwhile, Foromozo, who is a medical lab scientist at one of the local hospitals, has applauded the Second Republic led by President Mnangagwa, saying that it has come up with favourable policies that allow small businesses to flourish. She also said that President Mnangagwas initiatives to empower women will see them being empowered and create employment for others.\n\nI want to thank the Second Republic for affording such an environment to entrepreneurs. Its not rosy, just like every venture, there are obstacles here and there, but being small with the mind to start from the ground and having a Government with policies that allow us to create employment and opportunities for ourselves, as a woman, how was I going to be able to own a business?\n\nFabsmart Homes now\n\nThe policies are for the people, she said, and even ordinary Zimbabweans benefit from them. With these policies, I have managed to empower myself, employ more than five people in my name, and I have managed to empower other ladies, all thanks to President Mnangagwas Second Republic, she said.\n\nForomozo said her business is flourishing through e-commerce, which she also attributed to Government policies allowing everyone access to different social platforms used for business purposes. Now, she boasts a customer base across the country, which has seen her not bothered by opening branches in other places as she does her business online using online payment.\n\nIn the same vein, Foromozo has called upon potential business people to consider investing in Bulawayo, saying that the city still has the potential to become the countrys industrial and business hub.\n\nI want to call upon everyone who has an idea or a project to invest in the city. No one will provide jobs to our youths if we move and invest in other cities. Bulawayo was an industrial hub, and I believe the city still has that potential. I want to thank my friends and family who supported me to be where I am, and I want to thank my husband for his support. He believes in me, and for that, my phenomenal gift, Im grateful.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yujiuuiu.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com HILDAR Foromozo, driven by the belief that every woman deserves a fabulous and stylish home, regardless of her financial circumstances, founded Fabsmart Homes in Bulawayo in 2019. This venture, born from a desire to empower women, offers a curated selection of high-quality kitchenware and luxurious blankets designed to infuse a touch of […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        },
        {
            "title": "Injury-hampered Williams fuels Zimbabwe to 86-run lead",
            "url": "https://www.chronicle.co.zw/injury-hampered-williams-fuels-zimbabwe-to-86-run-lead/",
            "content": "Brandon Moyo,[emailprotected]\n\nZIMBABWE secured a valuable 86-run first-innings lead on day two of the New Years Day Test against Afghanistan at Queens Sports Club, but the hosts couldnt help but ponder what might have been had talismanic all-rounder Sean Williams been fully fit.\n\nWilliams, visibly hampered by injury throughout his innings, made a crucial contribution, but his discomfort undoubtedly impacted Zimbabwes ability to fully capitalise on a strong start.\n\nThe team undoubtedly believes that a fully fit Williams could have significantly bolstered their first-innings total, potentially shifting the momentum of the match even further in their favour.\n\nWilliams has been nursing back pain since the opening day of the Test match and was forced to come in and bat at number nine. He scored a well-batted 49 runs off 52 balls before he was caught behind by Afghanistan wicketkeeper Afsar Zazai.\n\nWilliams, however, was not given out by the umpires but decided to walk. The 38-year-olds injury turned out to be a bad omen for the Chevrons, who could not take maximum advantage of Afghanistans batting woes. Zimbabwe had bundled out Afghanistan for just 157 runs but could not capitalise on their upper hand.\n\nChevrons celebrate a wicket\n\nWilliams injury on the first day turned out to be a sign of the batting struggles that would soon follow as they failed to take maximum advantage of their bowlers exploits. It was Williams, Sikandar Raza (61), and Craig Ervine (75) who had to save the day, with the other two scoring all-important half-centuries after the top-order batters failed to come to the party.\n\nSpeaking after the days play, head coach Justin Sammons said Williams knock was the difference maker between them getting a lead going into the second innings.\n\nThe impetus shifted when Sean came to the crease. Actually, Newman, when he came to the crease you could see the change in Craig, in the way he went about his business. When Sean came in, that partnership was key, and ultimately is the key and difference to us having a lead or not. And, Craig being able to come through and go through various stages of the game and to take the responsibility. It was good to see, said Sammons.\n\nHe said he was pleased with the character shown by Williams while he was playing in pain.\n\nOur medical team did a lot of work in trying to get him to the park today. We are going to have to continue doing that but its going to be tough because he is in a lot of pain. He showed his courage to go out there, he showed what hes about and what it means to him to play for Zimbabwe. We cant look too far ahead, we will take it step by step with him to try and get him into the best physical state, he said.\n\nThe Chevrons were in all sorts of trouble on 41/4 and the three seniors managed to help Zimbabwe reach a decent lead. Raza came in to bat at number four  in place of Williams who was struggling with back pain  and made the most of his return to red-ball cricket. The all-rounder, playing his first Test match since 2021, scored his ninth half-century in the format.\n\nRaza was bowled by Zia-ur-Rehman for 61 runs off 104 deliveries, putting an end to his 71-run fifth-wicket partnership with the skipper Ervine. Williams, coming in to bat at number nine, scored a gallant 49 runs off 52 balls as he looked unsettled in the middle due to back pain. After Williams fell, he received applause from the Afghanistan players.\n\nWilliams enjoyed a 73-run stand with the skipper, Ervine, who earlier had brought up his sixth Test half-century off 122 balls. The skipper, accelerating the innings, was the last to fall as he was caught on the boundary for a brilliantly batted 75 runs off 165 balls.\n\nDay-two resumed with Zimbabwe batting on 6/0, trailing by 151 runs. The Chevrons quickly started losing wickets with the first to fall on the day being Joylord Gumbie, caught behind for eight runs in the eighth over, leaving the team on 19/1.\n\nIn the next over, Takudzwanashe Kaitano was caught behind for a two-ball duck, a wicket which brought Raza into the middle. The third wicket was that of opener Ben Curran, who was trapped in front for 15 runs off 34 balls. At that point, Zimbabwe were on 36/3, trailing by 121 runs. After hitting one boundary, Dion Myers fell, caught behind for five runs from nine balls, leaving Zimbabwe trailing by 116 runs on the verge of a batting collapse.\n\nHowever, Raza and Ervine managed to play gritty innings, bringing Zimbabwe back into the game with a brilliant partnership. Raza was bowled in the 38th over, leaving the team on 112/5, trailing by 45 runs.\n\nThe wicket brought Brian Bennett into the middle and the youngster only added two runs to the board off 22 balls before he was caught. Newman Nyamhuri walked in to join Ervine in the middle and the teenage star managed to add 11 runs on the board before he was bowled by Rashid Khan with Zimbabwe now trailing by just 10 runs.\n\nWilliams limped in to bat at the time and by the time he walked off, Zimbabwes lead was now 63 runs. After a short rain delay, Richard Ngarava joined the skipper in the middle. Ngarava was bowled by Yamin Ahmadzai for one run in the 71st over with Zimbabwe now leading by 68 runs.\n\nErvine and Blessing Muzarabani managed to have a 14-run stand for the 10th wicket before the veteran captain fell. Rashid Khan finished with figures of 4/94 in 27,3 overs while Yamin Ahmadzai took three for 62 runs in 18 overs.\n\nThe Chevrons bowlers once again proved a class above as they took three wickets before stumps were called. Afghanistan were on 46/3, trailing by 40 runs after Muzarabani struck twice and Raza once before bad light brought play to a halt.\n\nMuzarabani took the wickets of Afghanistans openers, Abdul Malik (one run) and Riaz Hassan (11), while Raza bowled Hashmatullah Shahidi for 13 runs. Play resumes at 09:30 am today for the third day.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Sean-Williams.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com ZIMBABWE secured a valuable 86-run first-innings lead on day two of the New Year’s Day Test against Afghanistan at Queens Sports Club, but the hosts couldn’t help but ponder what might have been had talismanic all-rounder Sean Williams been fully fit. Williams, visibly hampered by injury throughout his innings, made a crucial […]",
            "time": "18:32",
            "date": "05 Jan 2025"
        }
    ]
}