{
    "news": [
        {
            "title": "‘Let’s build a country envisioned  by our heroes’",
            "url": "https://www.chronicle.co.zw/lets-build-a-country-envisioned-by-our-heroes-2/",
            "content": "Mukudzei Chingwere,Harare Bureau\n\nTHE true honour we can bestow on our national heroes and heroines lies in building a prosperous Zimbabwe free from corruption, unethical behaviour and selfish dealings, Acting President Dr Constantino Chiwenga has said.\n\nSpeaking at the triple burial of National Heroes  Major-General (Retired) Solomon Siziba, Cde Chenhamo Chakezha Chen Chimutengwende and Ambassador John Shumba Mvundura at the National Heroes Acre in Harare yesterday  Acting President Chiwenga said each generation must take the nation forward.\n\nThe late Major-General (Retired) Solomon Siziba\n\nLet us all strive to build habitable, peaceful, economically stable and secure Zimbabwe as a legacy for future generations, he said.\n\nEach generation must take our nation forward  that way, the trajectory of our nation will remain on an upward path, with each generation leaving a wholesome legacy for the one coming after it.\n\nThe only way we can honour these heroes and heroines is to make sure that we all build the Zimbabwe they envisioned, indeed the great Zimbabwe we want which is peaceful, secure, prosperous and always moving forward.\n\nActing President Chiwenga took a swipe against corruption and other illicit activities.\n\nA loud and clear NO to corruption by whomsoever; corruption aborts our quest for sustainable economic development, peace and stability, he said.\n\nThe Acting President said Zimbabwes struggle for independence was rooted in values of unity and love  principles that must guide us today.\n\nHe also called on various stakeholders, including the media, civil society and political parties, to foster nation-building and unity.\n\nLet us not forget that it is through the selfless sacrifices and dedication to duty by the late three gallant sons of the soil we are laying to rest today, and many other departed and living cadres, that Zimbabwe continues to enjoy its sovereign nationhood as a State.\n\nChenhamo Chakezha Chen Chimutengwende\n\nWe can only realise our vision of attaining an Empowered and Prosperous Upper-Middle Income Society by guarding against and desisting from all forms of actions and misdeeds which undermine the national interest, said Acting President Chiwenga.\n\nForemost is corruption and all forms of related unethical and selfish conduct, especially in respect of business transactions at whatever level  small, medium to large economic units.\n\nAny act of shady dealings and acts of deceit go towards undermining the ideals for which these gallant national heroes sacrificed their lives.\n\nHe said values of unity and love are timeless and must personify today and tomorrow and be passed on to future generations.\n\nThey make a nation, they give character to a people. Above all, they make us winners in every sphere of human endeavour.\n\nAs we strive to develop our country, what must always guide us is the need to shun hatred, and embrace each other through love, tolerance and forgiveness.\n\nIf you become a false witness, then you are betraying these three comrades we are laying to rest today.\n\nLack of respect for each other and petty jealousies are mortal sins which cannot be forgiven here on earth and in Heaven.\n\nWe should respect one another and continue to be guided by the principle of Ubuntu, taking cognisance of the fact that every Zimbabwean who was born as we fought for our Independence contributed in different yet important capacities towards this one sacred goal which motivated us all and built solid unity in struggle.\n\nActing President Chiwenga called on different sectors of society, particularly the media and communications fraternity at large, civil society and national-interest driven opposition political parties and other social interest groups to play a positive role in the promotion of nation-building and unity of purpose.\n\nAmbassador John Shumba Mvundura\n\nDespite our divergent political views, we should always remember that we are one people who should be guided by the ethic of transformative politics where tolerance, forgiveness and ubuntu take precedence in our quest to build a prosperous, secure and stable Zimbabwe that we will continue to be patriotically proud of.\n\nHe implored the citizenry to make the most of the rains we are currently receiving by growing short-season variety crops to enhance the Governments food security efforts.\n\nBrigadier-General Mpulaeng Siziba, young brother to the late Major-General (Rtd) Siziba, hailed the legacy left by his brother.\n\nHe said his late brother contributed wholeheartedly to the growth and development of the agricultural sector in the region.\n\nMr Cleopas Nyangoni, brother to Cde Chimutengwende, said the family had lost a pillar who assisted in the education and development not only of his immediate family but extended family.\n\nHe said his brother was a hard worker and an easygoing man who enjoyed his free time through music and dance.\n\nMs Jayne Mvundura, daughter to Ambassador Mvundura, said her late father was a loving family man but at the same time a strict disciplinarian who demanded the very best from his children and family.\n\nShe said Ambassador Mvundura also contributed to the education and personal development of several people who are not his family.\n\nThe burial of the three national heroes was attended by Vice-President Kembo Mohadi, Cabinet Ministers, Service Chiefs and other senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ddddd.jpg",
            "description": "Mukudzei Chingwere, Harare Bureau  THE true honour we can bestow on our national heroes and heroines lies in building a prosperous Zimbabwe free from corruption, unethical behaviour and selfish dealings, Acting President Dr Constantino Chiwenga has said. Speaking at the triple burial of National Heroes — Major-General (Retired) Solomon Siziba, Cde Chenhamo Chakezha Chen Chimutengwende and […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "Tax clearence requirement for individual professionals",
            "url": "https://www.chronicle.co.zw/tax-clearence-requirement-for-individual-professionals/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nINDIVIDUAL professionals are now required to obtain valid tax clearance certificates from their professional bodies before renewal or registration of their membership in line with the latest Zimbabwe Revenue Authority (Zimra) regulations and licensing guidelines.\n\nA tax clearance certificate is a document that is issued by the Commissioner-General of Zimra to a person liable to pay tax under any of the Acts administered by Zimra. The certificate is issued upon request to a person whose tax affairs are up-to-date or who has made satisfactory tax compliance arrangements with Zimra.\n\nSome of the benefits of having valid tax clearance certificates are that no 30 percent withholding tax is deducted when payments are made for goods and services supplied, and no presumptive tax will be levied on importations.\n\nTax clearance is usually required when bidding for tenders, and this is a pre-requisite when applying for licenses issued by local authorities, while business players have confidence in compliant taxpayers.\n\nIn a recent Public Notice 92 of 2024 issued last month, and in accordance with the amendment to Section 80A of the Income Tax Act (Chapter 23:06), Zimra listed the nine affected bodies as Architects, Engineers and Technicians, Land Surveyors, Legal Practitioners, Auditors and Accountants, Health Practitioners, Veterinary Surgeons, Real Estate Agents and Quantity Surveyors.\n\nAll individuals seeking certification, registration, or licensing with their respective professional bodies must present a valid tax clearance certificate at the time of application or renewal, reads the notice.\n\nThe tax clearance certificate must be valid no earlier than 30 days prior to its submission. Zimra encourages all professionals in these fields to ensure compliance with this new requirement to avoid any disruptions in their practice.\n\nThe tax authority further stated that all new registrants have to register through the Zimra Service Portal (SSP), mytaxselfservice.zimra.co.zw.\n\nZimbabwe Revenue Authority (Zimra)\n\nWhen sampled, the given application portal showed that one needs to sign in or sign up first before being taken to the main page upon which they are asked whether they want to register as individuals or as an organisation.\n\nAfter clicking on the correct box, a new page opens with further requests such as ones taxpayer information number (TIN), employment period, and type of employment, among other requests.\n\nThere is no payment required for one to get a tax clearance certificate.\n\nIn compliance with the directive, the Nurses Council of Zimbabwe (NCZ) on Tuesday advised all health institutions and organisations to submit a list of their Zimra tax-cleared personnel ahead of registration or renewal, warning that no NCZ practicing certificate shall be issued without the valid tax clearance.\n\nIn line with the requirements of Public Notice 92 of 2024, issued on the 5th of December 2024 by the Zimbabwe Revenue Authority (Zimra), the Nurses Council of Zimbabwe wishes to advise all nurses to produce a valid tax clearance as part of the registration and renewal requirements, said the professional body.\n\nAll health institutions and organisations are hereby required to submit a list of their Zimra tax-cleared personnel to the NCZ as a prerequisite for renewal. Please note that all nurses residing outside Zimbabwe are exempted from this requirement, it said.\n\nA member of the Engineers Council of Zimbabwe said they would be engaging Zimra over the matter, while Mr Lyndon Kashangura, chairperson of the Council of Land Surveyors said he was still in consultation with members of the council on a position about the Zimra directive.\n\nZimra communications manager Mr Francis Chimanda requested to have questions in writing yesterday afternoon but had not responded by time of going to print.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/ZIMRA.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw INDIVIDUAL professionals are now required to obtain valid tax clearance certificates from their professional bodies before renewal or registration of their membership in line with the latest Zimbabwe Revenue Authority (Zimra) regulations and licensing guidelines. A tax clearance certificate is a document that is issued by the Commissioner-General of Zimra to a person […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "New era for Miss Teen of the Universe Zimbabwe",
            "url": "https://www.chronicle.co.zw/new-era-for-miss-teen-of-the-universe-zimbabwe/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nThe Miss Teen of the Universe Zimbabwe (MTOUZ) organisation is entering a new chapter with the announcement of a leadership change. Effective January 1, 2025, renowned choreographer Mthokozisi Philip Masuku has officially taken on the role of national director.\n\nMasuku succeeds modelling instructor Pardon Khanye, who played a pivotal role in guiding the organisation through a period of significant growth and increased recognition on both the national and international stage.\n\nKhaya-elihle Pardon Khanye\n\nThis transition marks an exciting era for MTOUZ as it continues its mission to empower young Zimbabwean women and showcase their talents on a global platform.\n\nIn a press statement, the MTOUZ board expressed their enthusiasm for the new leadership, stating:\n\nThis new leadership marks an exciting chapter in our organisations history as we strive to take our national pageants to new heights.\n\nWere thrilled to announce the appointment of Mr Masuku, whose wealth of experience and passion for empowering individuals make him the ideal candidate to lead our organisation into a new era of growth and excellence.\n\nMasuku commented: Im honoured to be a part of this journey. I look forward to working with our talented team, sponsors and partners to make our national pageants the premier events in the industry.\n\nThe board also took the opportunity to express their gratitude to Khanye for his tireless efforts, highlighting the popularity and prestige MTOUZ achieved under his leadership.\n\nWe appreciate the foundation he has laid for our future success, they noted.\n\nThe newly structured MTOUZ organisation includes a board of advisors, led by patron Nokuthaba Sibanda-Manungo.\n\nThe organisational structure is as follows:\n\nPatron: Nokuthaba Sibanda-Manungo\n\nNational Director: Mthokozisi Philip Masuku\n\nDeputy National Director: Mavis Koslek\n\nProvincial Heads:\n\nZanele Moyo (Bulawayo)\n\nElda Chitate (Harare)\n\nNatasha Masunda (Masvingo)\n\nPauline Marere (Mashonaland)\n\nDuncan and Arthur Nkomponi (Matabeleland South)\n\nFuture Nyoni (Matabeleland North)\n\nLyfe Matunzeni (Manicaland)\n\nKoslek, assisted by Midfinest (Midlands)\n\nWith this leadership transition, MTOUZ is poised for greatness, setting the stage for another successful year in showcasing and empowering young talent across the nation.\n\nLast year was an exceptional one for Zimbabwean models, with MTOUZ Queen Victoria Ncube winning the title of Miss Teen of the Universe Africa and receiving the Miss Photogenic award at the international pageant held in India.\n\nMister Zimbabwe, Future Nyoni also made waves, securing the second runner-up position at the Mister Africa International pageant, while Sakhile Dube placed in the top 30 at the Miss Universe competition in Mexico.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/rtgfgfg.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com The Miss Teen of the Universe Zimbabwe (MTOUZ) organisation is entering a new chapter with the announcement of a leadership change. Effective January 1, 2025, renowned choreographer Mthokozisi Philip Masuku has officially taken on the role of national director. Masuku succeeds modelling instructor Pardon Khanye, who played a pivotal role in guiding the […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "Graves cave in at Luveve",
            "url": "https://www.chronicle.co.zw/graves-cave-in-at-luveve/",
            "content": "Flora Fadzai Sibanda,f[emailprotected]\n\nMRS Sibusisiwe Dubes tears rolled down her cheeks as she stood before her sons sunken grave at Luveve Cemetery in Bulawayo.\n\nHer eldest son, who passed away two years ago, was laid to rest there, but heavy rains over the past weeks have caused significant damage to the gravesite.\n\nI heard from my neighbour that some graves had sunk and filled with water, with some headstones destroyed. I hesitated to check my sons grave because it survived last year, she said. However, her fears were confirmed when she arrived and saw the damage.\n\nHad he not been buried next to a tree, I dont think I would have recognised the grave. This is supposed to be his resting place, but how does he rest in a place like this? Its as if the land is trying to re-bury him, Mrs Dube lamented.\n\nFor families like Mrs Dubes, the rainy season brings not just memories of loss but also the added burden of restoring their loved ones final resting places.\n\nThis is not the first time graves at Luveve Cemetery have been affected by the rains. Many families have faced similar heartache over the years.\n\nMrs Dube, said the council cannot be blamed, as the unpredictability of weather and soil conditions makes it difficult to prevent such occurrences.\n\nShe expressed gratitude for the councils willingness to supply soil for repairs but acknowledged that families must take responsibility for maintaining their loved ones graves.\n\nIve heard the council usually helps by supplying soil to fill the graves. As a family, well fix it by the weekend because, culturally, its not right for a loved one to rest in a grave with water, she said.\n\nHowever, while the city councils provision of soil is a helpful gesture, the recurring nature of this issue calls for more sustainable solutions to prevent further damage during future rainy seasons.\n\nA cemetery worker, speaking on condition of anonymity, confirmed that the issue has persisted for years. While some graves suffer minor damage, others are severely affected.\n\nAnother problem is that families dont maintain their loved ones graves. Tombstones erected long ago lose their strength over time, leading to destruction and sinking, the worker explained.\n\nBulawayos ongoing infrastructure challenges, particularly in drainage management, have a ripple effect on many aspects of urban life, including the preservation of cemeteries. The councils efforts to address drainage issues citywide, including in cemeteries, remain critical.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gdf7dr789errt79de.jpg",
            "description": "Flora Fadzai Sibanda, florafadzaisibz@gmail.com  MRS Sibusisiwe Dube’s tears rolled down her cheeks as she stood before her son’s sunken grave at Luveve Cemetery in Bulawayo.  Her eldest son, who passed away two years ago, was laid to rest there, but heavy rains over the past weeks have caused significant damage to the gravesite. “I heard from […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "Zimplats sees sharp decline in profit, tax contributions",
            "url": "https://www.chronicle.co.zw/zimplats-sees-sharp-decline-in-profit-tax-contributions/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPLATINUM group-metals (PGMs) giant, Zimplats, says depressed global metal prices and increased capital investments impacted its fiscal contributions, which were around US$100 million in taxes in the 2024 financial year down from US$150 million in FY2023.\n\nDuring the year, PGM prices remained subdued, resulting in Zimplats gross revenue per 6E oz declining by 25 percent to US$1 196 (FY2023: US$1 595).\n\nAs a result, the companys turnover declined by 20 percent to US$767,1 million from US$962,3 million recorded last year.\n\nProfit before tax declined by 87 percent to US$37,6 million from US$286,8 million achieved in FY2023, largely due to the impact of depressed metal prices on revenue.\n\nAccording to Zimplats FY2024 annual report, Zimplats chairman, Professor Fholisani Sydney Mufamadi said the mining entity is committed to maintaining strong relations with Zimbabwes tax authorities.\n\nThe decline in fiscal contributions in FY2024 is mainly attributable to the negative impact of depressed metal prices on the companys profitability, coupled with increased capital investment, he said.\n\nHe noted that despite challenges posed by the economic environment, the future of the firm is bright.\n\nProf Mufamadi said investment in capital projects during the year amounted to US$439,5 million, a 44 percent year-on-year increase, reflecting increased project activity.\n\nChief executive officer, Mr Alexander Mhembere, said expansion capital increased by 105 percent to US$199,2 million (FY2023: US$97,1 million) as spending on the smelter expansion and SO2 abatement plant accelerated, with a total of US$181,5 million spent on the projects in the period.\n\nAs at June 30, 2024, cumulative investment in the project was US$272,6 million, with a further US$114,1 million incurred on managing SO2 emissions from the existing smelting operations, he said.\n\nThe full SO2 abatement project will manage both current and expanded smelter facilities at Zimplats, with spend allocated between expansion and SIB capital as a result.\n\nThe new furnace will increase smelting capacity from the current capacity of 135 000 tonnes of concentrate (equivalent to circa 535 000 oz 6E in converter matte) to circa 380 000 tonnes of concentrate (equivalent to 1,1 million 6E oz in converter matte).\n\nDuring the year, US$15 million was spent on the project to refurbish the SMC Base Metal Refinery (BMR), bringing the project-to-date expenditure to US$28,4 millionagainst a project budget of US$190 million.\n\nThe report notes that the first 35 megawatt phase of the 185MWAC solar project is scheduled for commercial power generation in the first quarter of this year.\n\nThis will go a long way in further reducing the companys carbon footprint and complement national power generation efforts, a business imperative given the power deficit facing the southern African region.\n\nTotal ore mined increased by four percent to 7,9Mt, with higher production at Mupani and Rukodzi mines. Grade was adversely affected by the higher contribution of lower-grade development ore from Mupani Mine and dilution from mining across geological structures.\n\nA total of US$81,6 million was spent on the replacement mines during the year, 12 percent less than the spend incurred inFY2023, with cumulative expenditure of US$407 million as at June 30, 2024.\n\nThe development of Mupani Mine, which replaces the depleted Rukodzi and Ngwarati mines, is progressing well and remains on schedule, with full production of 3,6Mt per annum planned for H1 FY2029.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/htrs.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PLATINUM group-metals (PGMs) giant, Zimplats, says depressed global metal prices and increased capital investments impacted its fiscal contributions, which were around US$100 million in taxes in the 2024 financial year down from US$150 million in FY2023. During the year, PGM prices remained subdued, resulting in Zimplats’ gross revenue per 6E oz declining by […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "Crops, livestock situation improves",
            "url": "https://www.chronicle.co.zw/crops-livestock-situation-improves/",
            "content": "Chronicle Writers\n\nTHE Government and farmers across the country have expressed excitement over the significant improvement in the state of crops and livestock in response to the good rains being received in many areas since last month.\n\nUnlike last year, when the agriculture sector was decimated by the El Nio-induced drought, the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development is convinced the 2025 farming season will be a huge success, especially for maize and other cereal crops, some of which are already at the flowering stage.\n\nAccording to the Meteorological Services Department (MSD), the country is forecast to receive intense rainfall in the coming days. The rains have not only rejuvenated crops but also improved pastures and water availability, offering a lifeline to livestock farmers.\n\nCommunal farmers have also expressed gratitude for the Governments input support, saying that most inputs were delivered on time this farming season.\n\nGiving an update on the crop and livestock situation in the country, the Permanent Secretary in the Ministry of Lands, Professor Obert Jiri, said generally, the condition of crops and livestock was impressive nationwide. He stated that the country looks set to surpass targets in terms of land planted and yields.\n\nPermanent Secretary in the Ministry of Lands, Professor Obert Jiri\n\nThe country has been receiving some good rains nationwide, and we have seen a great improvement in crops and livestock. Generally, the condition of crops is now adequate and good across all provinces, and the livestock situation has also vastly improved, said Prof Jiri.\n\nThe bulk of the crop, more than 65 percent, is now at the late vegetative stage, and we have no doubt that maize will make it. The crop that was planted early in November is now also at the flowering stage, while the late-planted crop, which accounts for about 20 percent, is now at the early vegetative stage. All these crops are looking very good.\n\nProf Jiri said 85 percent of traditional grains, which were planted in December, were also looking very good, as were soya beans, cotton, and tobacco. He said the maize target is on 98 percent, according to reports from extension officers, and a crop and livestock assessment is underway.\n\nThis amounts to about 1,78 million hectares under maize across the provinces, based on what has already germinated.\n\nExperts have advised that the planting season for maize is over, but farmers can continue planting small grains and sunflowers.\n\nFarmers can also plant sweet potatoes and sunflowers, but they should spend more time now weeding, scouting for pests, and applying fertiliser. We have dispatched 60 directors to districts to ensure that they encourage farmers to implement the correct agronomics for every crop because what is left is to convert that crop into high yields, said Prof Jiri.\n\nHe said Zimbabwe was on course to meet targets and that as of yesterday, the Government was focused on conducting crop, livestock, and fisheries assessments, expecting the report to come in the first week of February.\n\nFor traditional grains, we are also on course to meet our target because they are still being planted, and as of today, we were sitting on more than 400 000 hectares of traditional grains, said Prof Jiri.\n\nHe said the target for tobacco has been surpassed, with more than 167 000 hectares now under tobacco.\n\nProf Jiri said the country is almost certain of a bumper harvest for maize and traditional crops, which will ensure food security, while tobacco, the leading foreign currency earner, is also on track.\n\nA thriving maize crop at Emganwini suburb in Bulawayo yesterday. (Picture by Nkosizile Ndlovu)\n\nIn the Midlands Province, communal farmers are celebrating the recent wet spell, which has renewed hopes for a bumper harvest this year. The province, known for its thriving crop and livestock farming, is expecting a bumper harvest of most crops.\n\nChief Ngungumbane of Mberengwa District expressed optimism about the prospects of the farming season, noting that early-planted crops are doing well.\n\nThe wet spell across the country has brought hope for a good harvest this year. Crops are at various stages, and the early-planted maize is at the tasselling stage, he said.\n\nChief Ngungumbane also commended the Government for the timely distribution of farming inputs, which has enabled many farmers to plant early. However, he highlighted challenges faced by those who delayed planting.\n\nSome farmers who were slow to plant are now struggling to do so because of the persistent rains, said Chief Ngungumbane.\n\nIn Gokwe South, Chief Njelele said his area has been receiving rainfall for the past two weeks.\n\nEveryone is happy. We now have water for livestock, and our pastures have improved. If the rains persist, dams will soon spill, he said.\n\nChief Njelele praised the Governments Pfumvudza/Intwasa smart farming initiative, which has gained traction in his area.\n\nMany farmers in my area have adopted smart agricultural techniques. They received inputs on time, and their fields are a marvel to watch. We are confident of a bumper harvest this year, he said.\n\nChief Chireya of Gokwe North shared similar sentiments, emphasising the importance of the rains in supporting irrigation schemes.\n\nWith water bodies filling up, we can fully utilise irrigation schemes to enhance food security and nutrition, aligning with Vision 2030, he said.\n\nSeedco sales manager, Mr Ronnie Chingome, highlighted the positive impact of the rains on crops and livestock.\n\nThe maize crop is doing well in many communal areas, and those farmers at irrigation schemes now have adequate water, he said.\n\nAgricultural and Rural Development Advisory Services (Ardas) acting director for Matabeleland North province, Mr Thulani Ndlovu, said livestock was now in good condition due to improved pastures. He, however, said leaching due to incessant rains was the biggest challenge facing crop farmers.\n\nWe are also encouraging farmers to scout for the fall armyworm and African armyworm, which are common when there is green vegetation. Once identified, farmers must use pesticides to kill the worms or seek guidance from local extension officers, said Mr Ndlovu.\n\nOn livestock, he said there is a high level of tick infestation, which may lead to an outbreak of tick-borne diseases, and encouraged regular dipping.\n\nZimbabwe Commercial Farmers Union (ZCFU) Matabeleland North provincial chairman, Mr Winston Babbage, said the crops were doing well and stressed the need to control weeds and scout for pests. He encouraged farmers to vaccinate their animals and ensure regular dipping to control tick-borne diseases.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/cdecxs.jpg",
            "description": "Chronicle Writers THE Government and farmers across the country have expressed excitement over the significant improvement in the state of crops and livestock in response to the good rains being received in many areas since last month. Unlike last year, when the agriculture sector was decimated by the El Niño-induced drought, the Ministry of Lands, […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "Ndebele leaves PSL, as DeMbare dump Mashingaidze",
            "url": "https://www.chronicle.co.zw/ndebele-leaves-psl-as-dembare-dump-mashingaidze/",
            "content": "Zimpapers Sports Hub\n\nAspiring Zifa vice-president, Kennedy Ndebele, has resigned from his position as the Premier Soccer League (PSL) Chief Executive Officer.\n\nHis departure coincides with Dynamos parting ways with their Chief Executive Officer, Jonathan Mashingaidze. Ndebele is now concentrating on his bid for a Zifa office in the forthcoming elections.\n\nThe PSL will also hold elections in March to elect a new executive to succeed the previous leadership under Farai Jere, who resigned in December. To ensure continuity during this transitional period, Rodwell Thabe has been appointed as Acting CEO.\n\nThe PSL has reassured stakeholders that the league will continue to operate smoothly throughout this phase. Further details regarding the recruitment of a permanent CEO will be announced in due course.\n\nIn a statement released on Wednesday, Kudzai Bare, PSLs communications and media liaison officer, expressed gratitude for Ndebeles exceptional leadership and dedicated service, which played a significant role in the leagues growth and success.\n\nWe would like to take this opportunity to thank Mr Ndebele for his outstanding leadership and dedicated service to the PSL, the statement read. His contributions have been vital in driving the leagues growth and success. We wish him the best in his future endeavours. Ndebele assumed the role of PSL CEO in 2011.\n\nMeanwhile, veteran administrator Jonathan Mashingaidze has become the latest figure to leave the 2024 Chibuku Super Cup champions Dynamos, following the Harare giants decision not to renew his contract. Mashingaidze joined Dynamos in December 2022, and his two-year contract expired on 31st December 2024.\n\nHe joins former DeMbare assistant coach Joel Luphahla and analyst Ashley Ndebele on the departure list.\n\nJonathan Mashingaidze\n\nFollowing the expiration of the contract of employment for the club Chief Executive Officer, Mr Jonathan Mashingaidze, on 31st December 2024, the two parties amicably agreed not to renew or extend the contract, Dynamos stated.\n\nMashingaidze, who is a sports consultant, will be engaged on a needs basis to offer consultancy services to the club. Dynamos Football Club would like to thank Mashingaidze for the services he rendered to the club during the subsistence of his contract. We wish him success in his sports consultancy field.\n\nDynamos have also lost a number of key players, including the midfield trio of Tanaka Shandirwa, Donald Mudadi and Emmanuel Ziocha.\n\nThe club has also suffered the departures of skipper Frank Makarati, Emmanuel Paga, Sadyney Urikhob and Issa Sadiki. Goalkeeper, Martin Mapisa is also set to leave.\n\nDespite the loss of key players, Dynamos coach Lloyd Chigowe has remained resolute, expressing confidence in the teams ability to rebuild and remain competitive.\n\nChigowe believes the Harare giants can still assemble a team capable of competing in both the domestic Premiership and the 2025/2026 TotalEnergies Caf Confederation Cup. Dynamos will represent Zimbabwe in Africa after retaining the Chibuku Super Cup.\n\nChigowe has so far recruited former Scotland FC and CAPS United winger, Leeroy Mavhunga. The technical team has also been strengthened with the addition of former Harare City and Highlanders coach, Mark Mathe.\n\nFormer star player Ronald Gidiza Sibanda has also returned to DeMbare as team manager. The 48-year-old Sibanda, who played Caf Champions League football with Dynamos in 1999, is a former Warriors key player.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fghdffg.jpg",
            "description": "Zimpapers Sports Hub Aspiring Zifa vice-president, Kennedy Ndebele, has resigned from his position as the Premier Soccer League (PSL) Chief Executive Officer. His departure coincides with Dynamos parting ways with their Chief Executive Officer, Jonathan Mashingaidze. Ndebele is now concentrating on his bid for a Zifa office in the forthcoming elections. The PSL will also […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "Gwanda District to roll out disaster risk reduction training in rural wards",
            "url": "https://www.chronicle.co.zw/gwanda-district-to-roll-out-disaster-risk-reduction-training-in-rural-wards/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nGwanda District is set to implement a comprehensive disaster risk reduction (DRR) training programme across its 24 rural wards as part of efforts to equip communities with the skills and knowledge needed to identify, mitigate, prepare for, and respond effectively to disasters.\n\nThe district revised its DRR plan last year to address the growing threat of climate change and to align with updated statistics and ward boundaries. The revised plan incorporates three key documents: the districts disaster risk profile, disaster risk mitigation and adaptation plan, and the emergency response plan.\n\nIn aninterview, Gwanda District Development Co-ordinator, Ms Nomathemba Ndlovu, said the training programme represents a critical step in empowering DRR committees at the ward level.\n\nWe now have a DRR plan at the district level, but implementation is done at the ward level, hence the need to train DRR committees within communities. All 24 wards will be covered. We will first train ward extension officers from various ministries and departments, as well as councillors, she said.\n\nThese ward extension officers will then train DRR committee members, who are made up of community members. The DRR committees are chaired by councillors, while the ward extension officers are also members of the committees.\n\nMs Ndlovu explained that the ward extension officers will play a crucial role in monitoring the implementation of DRR plans by communities.\n\nWe want this training to commence at the beginning of next month. The training, funded by Catholic Relief Services (CRS) to the tune of US$150 000, will empower ward extension officers to train DRR committee members. These committees will be pivotal in implementing and monitoring DRR plans at the community level, she said.\n\nDuring the training, participants will be equipped with knowledge on climate-smart agriculture, livelihoods, disaster mitigation and prevention, water harvesting, water-logging, and other disaster-related issues.\n\nEach ward will develop an active DRR plan to identify potential hazards and implement strategies to mitigate risks. These ward-level plans will feed into the districts overarching disaster risk mitigation and adaptation plan, as well as its emergency response plan.\n\nThe DRR initiative aims to enhance community resilience, enabling them to cope with and recover from disasters while steering the district towards a more sustainable and disaster-resistant future.\n\nGwanda District is particularly vulnerable to various hazards, including prolonged dry spells, floods, unpredictable weather patterns, public health emergencies, and environmental degradation. Technological hazards, such as mining accidents and road traffic incidents, also pose significant risks.\n\nPublic health emergencies, including epidemics, livestock diseases, and drug and substance abuse, further threaten community livelihoods and health.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/02/Untitled-4-6.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw  Gwanda District is set to implement a comprehensive disaster risk reduction (DRR) training programme across its 24 rural wards as part of efforts to equip communities with the skills and knowledge needed to identify, mitigate, prepare for, and respond effectively to disasters. The district revised its DRR plan last year to address the […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "Mupamhanga a national hero",
            "url": "https://www.chronicle.co.zw/mupamhanga-a-national-hero/",
            "content": "Rumbidzayi Zinyuke, Harare Bureau\n\nPRESIDENT Mnangagwa has bestowed National Hero status on former Deputy Chief Secretary responsible for monitoring and evaluation in the Office of the President and Cabinet, Cde Justin Mupamhanga.\n\nCde Mupamhanga died yesterday at Arundel Clinic in Harare after a long fight against diabetes and high blood pressure.\n\nZanu-PF national Political Commissar, Cde Munyaradzi Machacha, delivered the message of national hero status to the Mupamhanga family at their Harare home last night.\n\nCde Machacha was accompanied by Zanu-PF Mashonaland Central Politburo members, Central Committee members and provincial executive members, including provincial chairman Cde Kazembe Kazembe, among others.\n\nMinister Kazembe Kazembe\n\nIn his remarks, Cde Machacha said Cde Mupamhanga led an exemplary life, hence the decision to declare him a national hero.\n\nZanu-PF and His Excellency Dr ED Mnangagwa are happy to announce to the family and to the nation that Cde Mupamhanga has been accorded National Hero status, he said.\n\nWhen the party looked at the work he has done over the years; it was not difficult for the President to bestow upon him this status. He earned it through his hard work.\n\nCde Machacha said the work done by the late national hero started during the liberation war where he selflessly worked alongside other cadres to liberate the country.\n\nEven after the war, he said, Cde Mupamhanga remained a positive person and supported the ruling party in every way possible, together with his wife, where they participated in various thematic committees, giving progressive ideas and opinions.\n\nCde Mupamhanga had depth of knowledge of the socialist ideology of the ruling party and he held this until his death.\n\nHe was a hard worker and a team player. He was good at research and made sure that he would thoroughly dig for facts around any issue before making a presentation.\n\nThe family may have lost a great man but I think the greatest loss is to the country, Zanu-PF and all the ZANLA cadres who knew and worked with him all these years, Cde Machacha said.\n\nEarlier yesterday, Acting President Dr Constantino Chiwenga had sent a condolence message to the Mupamhanga family.\n\nHe said the decision to bestow national hero status on Cde Mupamhanga was in recognition of his role in the struggle for Independence and in national development, especially in laying the foundation and growing the agriculture and energy sectors.\n\nMay l on behalf of His Excellency the President Dr ED Mnangagwa and the First Family, the nation, the ruling Zanu-PF party, Government and my family, express my deepest and heartfelt condolences to the Mupamhanga family including Amai Mupamhanga and the children who include, our Deputy Minister for Youth Empowerment, Development and Vocational Training, Hon Kuda Mupamhanga, on their saddest loss.\n\nMay they derive solace from the knowledge that the nation today joins them in mourning the sad and untimely demise of this illustrious son of the soil, Acting President Chiwenga said.Cde Mupamhangas last-born son, Mr Kumbirai Justin Mupamhanga, expressed gratitude for the honour bestowed on his father.\n\nToday is a dark day. We have lost a great man as a family, the country lost a great man. As a father, he was the best.\n\nThe intention is to give him a great send-off, what he deserves, and carry on his legacy. He is gone but through us his sons and his grandchildren, he lives, he said.\n\nHis granddaughter Makanaka Mupamhanga (11) said life would not be the same without her grandfather.\n\nI frequently used to visit his office and we have a lot of great memories. The fact that hes gone makes us really sad, but we know that he is in a better place. One thing he always told us was, always remember me, even when Im in my grave, and we will fulfill his wishes, she said.\n\nFamily friend, Mr Denias Zaranyika, said he had lost a good friend and brother.He stayed in Mozambique for a long time, fighting for the freedom of this country. He wanted Zimbabwe to be free so that we would be able to self-determine our future.\n\nI have no words today; we are celebrating the passing on of a great man. We know that he worked very hard for this country to liberate it, and I want to say to him, well done, Justin, well done, my friend, he said.\n\nCde Mupamhanga was a veteran of the liberation struggle who sacrificed his studies at the then University of Rhodesia in 1975 to join Zanla forces at the battle front.\n\nHe played a critical role in driving the implementation of Government programmes as Deputy Chief Secretary responsible for monitoring and evaluation in the Office of the President and Cabinet, working under then Chief Secretary, Dr Misheck Sibanda.\n\nHe superintended over numerous strategic and key Government programmes in agriculture, energy and infrastructure development.\n\nCde Mupamhanga joined the liberation struggle in Mozambique and was allowed to complete his university studies soon after completing his initial military training.\n\nHe later held important positions in the Zimbabwe African National Union (ZANU) and ZANLA commissariat and education departments.\n\nAfter Independence, he began his civil service career in Government in 1983 in the Economics Division of the Presidents Department.\n\nHe rose through the ranks, first establishing and heading the Economics Branch, serving as Minister Counsellor at the Diplomatic Mission in London, United Kingdom, and later being elevated to the position of Deputy Director in the Presidents Department under President Mnangagwa, who was then the Minister of State Security.\n\nIn times of the El Nino-induced droughts that have from time to time devastated the Southern African region, Cde Mupamhanga was part of a taskforce that included the then Commander Air Force of Zimbabwe, Air Marshal Perrance Shiri, who is now late, Major General Amoth Chimombe and Mr Ngoni Masoka, the then Secretary for Agriculture, that was charged with the responsibility to import grain and avert hunger in the country.\n\nZanu-PF National Political Commissar Cde Munyaradzi Machacha announces the National Hero status of fomer Deputy Chief Secretary to the President and Cabinet Justin Mupamhanga, to his family in Harare, yesterday\n\nCde Mupamhanga was later appointed Pemanent Secretary for Energy and Power Development. During his tenure, he played a key role in the liberalisation of the fuel industry, which eliminated fuel shortages and increased participation by indigenous businesses in that sector.\n\nIn that role, he also led the restructuring of the National Oil Company of Zimbabwe.He also restructured Zesa into self-contained business units and introduced the Zimbabwe Energy Regulatory Authority.\n\nAs Deputy Chief Secretary responsible for monitoring and evaluation in the Office of the President and Cabinet, Cde Mupamhanga oversaw the implementation of major projects such as the construction of Tugwi-Mukosi Dam.\n\nThe highlight of his career was as Chairman of Command Agriculture during which he laid the framework for agricultural productivity, thus helping Zimbabwe to reclaim its breadbasket status in the region.\n\nHe retired in 2019 after 36 years of dedicated service to Government and country but continued as Chairman of Kuvimba Mining House.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/Mr-Justin-Mupamhanga-680x380.jpg",
            "description": "Rumbidzayi Zinyuke, Harare Bureau PRESIDENT Mnangagwa has bestowed National Hero status on former Deputy Chief Secretary responsible for monitoring and evaluation in the Office of the President and Cabinet, Cde Justin Mupamhanga. Cde Mupamhanga died yesterday at Arundel Clinic in Harare after a long fight against diabetes and high blood pressure. Zanu-PF national Political Commissar, […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        },
        {
            "title": "From Bulawayo, Hustling and Thriving. . . Bruce Ncube’s ambitious plan for local stars",
            "url": "https://www.chronicle.co.zw/from-bulawayo-hustling-and-thriving-bruce-ncubes-ambitious-plan-for-local-stars/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nOutspoken UK-based Zimbabwean artist, Bruce Njube Giant Ncube, known for his unique workshops teaching traditional Zimbabwean songs in diverse harmonies, is proposing an exciting new reality TV show to take place in Bulawayo.\n\nThis concept draws inspiration from the latest edition of the Netflix reality series Young, Famous and African, which features renowned and affluent stars as they work, play, flirt and feud in Johannesburg, South Africa.\n\nBruce Njube Giant Ncube\n\nThe first episodes of the show, featuring musicians Diamond Platnumz and Nadia Nakai, also introduced a new face: local personality Zodwa Mnkandla, a successful businesswoman and prominent member of the rich cousins circle.\n\nAccording to Ncube, the series he envisions, titled From Bulawayo, Hustling and Thriving, aims to spotlight local talent while fostering a strong sense of community.\n\nIt came to my mind to think, Why dont we have our own reality show, since we have so many artistes who have done amazingly well? Ncube stated on his social media platforms.\n\nBruce Njube Giant Ncube\n\nWhy dont we tell their stories by bringing them together in one place to share ideas and get to know each other in a more intimate space?\n\nThe proposed show aims not only to celebrate the artistry of local personalities but also to introduce some drama, as Ncube plans to bring together individuals who may have existing feuds, adding a layer of controversy to the mix.\n\nI would pose a question to clear the drama and end the tension, he added, suggesting that the show could delve into the dynamics of relationships within Bulawayos creative scene.\n\nTo launch the show, Ncube is seeking financial support and has initiated a GoFundMe campaign.\n\nAwa Khiwe\n\nI need your help to raise 5,000 through GoFundMe, so we can make this a reality, he told his followers.\n\nIts important to celebrate people in the creative, sporting, entrepreneurial and fashion industries. Think about the filmmakers who could benefit from producing such a significant show and showcasing what Bulawayo can achieve when resources are available. Imagine the fashion designers dressing the cast  its an opportunity to spotlight incredible talent.\n\nPicture the drama and chaos, he continued, with everyone sharing their stories  how theyve reached this point in their journeys, their family dynamicsand their love lives.\n\nAwa Khiwe\n\nNcube revealed that he envisions one season of the show, consisting of around five episodes, featuring 18 of Bulawayos most influential movers and shakers. These could potentially include Lorraine Maphala-Phiri, Fadzai Chinyanga, Mzoe Seven, Awa Khiwe, Nitefreak, Leroy Waps, Ntandoyenkosi Moyo, Vuyo Brown, MJ Sings, Charmaine Mainey Mudau, Taboka Patience Nleya, Nkanyeziyethu Malunga, Novuyo Seagirl, Madlela Skhobokhobo, and Sipho Mercent Nyathi.\n\nThe idea has already garnered support from fellow artistes, including Germany-based rapper Awa Khiwe, who joined Ncubes live session on Facebook to express enthusiasm for the project.\n\nThis is an amazing idea. We dont have enough content to entertain ourselves and most of the time, social content creators from other countries are making it. We need to level up as well, said the Rap- Gandaganda hitmaker.\n\nAwa Khiwe\n\nReality television has been gaining traction in Zimbabwe, with shows like the Foodie Lovers Dating Show, airing on 3Ktv, demonstrating an appetite for local content. Ncubes proposed reality show could further contribute to this growing trend, providing a platform for personalities from Bulawayo to shine.\n\nNcubes recent work includes participation in major festivals and events, such as The Natural Voice Network Annual Gathering, Womad and the Edinburgh Fringe Festival. His experience in these high-profile settings lends credibility to his vision for a locally-produced reality show.\n\n @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/6ttytytytyty.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Outspoken UK-based Zimbabwean artist, Bruce “Njube Giant” Ncube, known for his unique workshops teaching traditional Zimbabwean songs in diverse harmonies, is proposing an exciting new reality TV show to take place in Bulawayo. This concept draws inspiration from the latest edition of the Netflix reality series Young, Famous and African, which features renowned […]",
            "time": "06:37",
            "date": "23 Jan 2025"
        }
    ]
}