{
    "news": [
        {
            "title": "Woman loses over US$6 000 to bogus housing agent",
            "url": "https://www.chronicle.co.zw/woman-loses-over-us6-000-to-bogus-housing-agent/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nPolice in Bulawayo are investigating a case of fraud in which a 27-year-old woman from Paddonhurst was defrauded of a total of US$6,350 by an unscrupulous housing agent.\n\nJacob Rabatwa, who is employed as a housing agent, went to Upper Rangemore to show the unnamed complainant stands for sale on 21 June 2024.\n\nThe complainant selected a 250 square metre stand priced at US$6,250 and paid a US$1,400 cash deposit the next day. She subsequently made additional payments totalling US$4,950, and they signed a sales agreement for the stand.\n\nIn a statement, Inspector Nomalanga Msebele said that on 25 January, the complainant visited the stand she had purchased and discovered a foundation already dug there. A neighbour informed her that the stand actually belonged to someone in South Africa.\n\nAfter confirming with the real owner, she questioned the accused, who provided an unsatisfactory response. A police report was filed, but the accused has not yet been arrested. The total loss is US$6,350, with no recovery.\n\nPolice urge the public to verify the authenticity of agents before making transactions to avoid financial loss and to seek any information leading to the accuseds arrest, said Inspector Msebele.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Assistant-Inspector-Nomalanga-Msebele.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com Police in Bulawayo are investigating a case of fraud in which a 27-year-old woman from Paddonhurst was defrauded of a total of US$6,350 by an unscrupulous housing agent. Jacob Rabatwa, who is employed as a housing agent, went to Upper Rangemore to show the unnamed complainant stands for sale on 21 June 2024. […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "New Toll Fees at Beitbridge Border Post",
            "url": "https://www.chronicle.co.zw/new-toll-fees-at-beitbridge-border-post/",
            "content": "Online Reporter\n\nAS from February 1, toll fees at Beitbridge Border post will be adjusted upwards for some vehicles, Zim Borders has announced.\n\nIn a statement, Zimborders revealed that there will be no increase in fees for non-commercial vehicles, including motorcycles, light vehicles, and minibuses.\n\nThis decision reflects the companys commitment to absorbing the inflationary impacts for these vehicle categories in 2025, read the statement.\n\nHowever, Zimborders said a modest increase will be applicable to commercial vehicles, including light goods vehicles, coaches, heavy vehicles, goods vehicles, abnormal vehicles, and parking bays. The respective toll fee adjustments are available on the Zimborders website.\n\nThe new toll fees, effective February 1, 2025, are as follows: motorcycles will be charged $6.00, light vehicles US$28, minibuses US$41, coaches US$85, light goods vehicles US$85, heavy vehicles US$122, and goods vehicles US$213. Parking fees for freight and abnormal vehicles will be US$49 and US$61, respectively.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/A-birds-view-of-the-transformed-Beitbridge-Border-Post-at-night-Picture-Zimborders1.png",
            "description": "Online Reporter  AS from February 1, toll fees at Beitbridge Border post will be adjusted upwards for some vehicles, Zim Borders has announced. In a statement, Zimborders revealed that there will be no increase in fees for non-commercial vehicles, including motorcycles, light vehicles, and minibuses. “This decision reflects the company’s commitment to absorbing the inflationary […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "Police intensify crack down on illegal kombis",
            "url": "https://www.chronicle.co.zw/police-intensify-crack-down-on-illegal-kombis/",
            "content": "Online Reporter\n\nThe Zimbabwe Republic Police (ZRP) has intensified its ongoing operation, No to Mushikashika and Lawlessness on the Roads, aimed at restoring order and promoting public safety in the country.\n\nThis comes amid growing concerns over the proliferation of unregistered kombis and pirate taxis disrupting traffic and endangering lives.\n\nIn a statement, ZRP national spokesperson, Commissioner Paul Nyathi said there is need for compliance and warned operators that are flouting the law.\n\nWe want to make it clear that only registered kombis with verifiable documentation will be allowed to operate as public service vehicles, said Commissioner Nyathi.\n\nUnregistered kombis and pirate taxis have no place on our roads, and we urge operators to comply with the law to avoid facing legal consequences.\n\nThe police have also highlighted that unroadworthy vehicles, illegal pick-up and drop-off points and corruption have exacerbated road safety concerns.\n\nCommissioner Nyathi called on the public to exercise caution when choosing transporters.\n\nPassengers must avoid boarding ramshackled kombis, especially those without registration plates or with windows covered by makeshift materials like cardboard boxes. Public safety is a collective effort and we urge everyone to play their part, he said.\n\nThe ZRP has also vowed to address internal corruption within its ranks.\n\nCommissioner Nyathi said the police are determined to root out corrupt elements and restore public trust.\n\nThe police are also focusing on illegal operations along high-traffic routes such as the Chitungwiza-Harare Central Business District corridor.\n\nUnregistered kombis dropping passengers near Seke Bridge have come under scrutiny, with the police pledging decisive action.\n\nZRP Commissioner-General Stephen Mutamba has also directed Police Commanders to facilitate the smooth passage of fully compliant kombis at checkpoints to avoid unnecessary delays.\n\nMeanwhile, the public has been encouraged to report any instances o\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/sdfafdcx.jpg",
            "description": "Online Reporter The Zimbabwe Republic Police (ZRP) has intensified its ongoing operation, “No to Mushikashika and Lawlessness on the Roads,” aimed at restoring order and promoting public safety in the country. This comes amid growing concerns over the proliferation of unregistered kombis and pirate taxis disrupting traffic and endangering lives. In a statement, ZRP national […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "Man (28) “assaults” girlfriend (58)’s father (77)",
            "url": "https://www.chronicle.co.zw/man-28-assaults-girlfriend-58s-father-77/",
            "content": "Trish Mukwazo,[emailprotected]\n\nA 28-YEAR-old man who is dating a 58-year-old woman was dragged to court for allegedly assaulting his girlfriends 77-year-old father.\n\nMilton Mpala of Mzilikazi suburb appeared before Bulawayo magistrate Mr Abednico Ndebele facing an assault charge.\n\nMpala denied the allegations, claiming he did not assault the victim but only pushed him.\n\nHe was remanded in custody until 4 February.\n\nPresenting the case for the State, Ms Mufaro Ndiraire said the incident occurred on 25 January around 1 AM after Mpala stormed the complainant Mr Peter Mgunis bedroom and indiscriminately assaulted him with an unknown object all over the body.\n\nMguni was rushed to the hospital for medical assistance, and the matter was reported to the police station, leading to Mpalas arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/05/tyh56y54.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com A 28-YEAR-old man who is dating a 58-year-old woman was dragged to court for allegedly assaulting his girlfriend’s 77-year-old father. Milton Mpala of Mzilikazi suburb appeared before Bulawayo magistrate Mr Abednico Ndebele facing an assault charge. Mpala denied the allegations, claiming he did not assault the victim but only pushed him. He was […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "Police impound truck filled with smuggled goods",
            "url": "https://www.chronicle.co.zw/police-impound-truck-filled-with-smuggled-goods/",
            "content": "Midlands Bureau\n\nPolice in Gweru have impounded a truck that was travelling from South Africa to Kadoma with smuggled goods worth thousands of United States dollars.\n\nThe syndicate evaded police roadblocks through a surveillance car that was travelling ahead and communicating with those in the truck through a radio.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-28-at-14.43.28-680x380.jpeg",
            "description": "Midlands Bureau Police in Gweru have impounded a truck that was travelling from South Africa to Kadoma with smuggled goods worth thousands of United States dollars. The syndicate evaded police roadblocks through a surveillance car that was travelling ahead and communicating with those in the truck through a radio.",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "Kwekwe man jailed 26 years for rape and robbery",
            "url": "https://www.chronicle.co.zw/kwekwe-man-jailed-26-years-for-rape-and-robbery/",
            "content": "Online Reporter\n\nA Kwekwe man has been sentenced to 26 years in prison for raping a woman five times before robbing her.\n\nThe 40-year-old man appeared before the Kwekwe Magistrates Court facing charges of rape and robbery.\n\nThe court heard that on January 18, the man forcefully entered the complainants workplace while she was sleeping.\n\nHe threatened her with a knife and raped her five times without protection. On the same day, the man hurt the complainant on her pelvis with an iron bar before forcefully taking US$80 and groceries worth US$623.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Online Reporter A Kwekwe man has been sentenced to 26 years in prison for raping a woman five times before robbing her. The 40-year-old man appeared before the Kwekwe Magistrates Court facing charges of rape and robbery. The court heard that on January 18, the man forcefully entered the complainant’s workplace while she was sleeping. […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "In pictures: Empowering Communities – The Impact of Zimbabwe Council of Churches’ SDRR Programme in Bulilima",
            "url": "https://www.chronicle.co.zw/in-pictures-empowering-communities-the-impact-of-zimbabwe-council-of-churches-sdrr-programme-in-bulilima/",
            "content": "Ashley Phiri,[emailprotected]\n\nThe Bulilima community in Matabeleland South Province has significantly benefited from the Zimbabwe Council of Churches (ZCC) Strengthening Drought Response and Recovery (SDRR) programme.\n\nFunded by Christian Aid, the initiative has provided essential services such as water, sanitation, and livelihood support since its launch in September 2024. The programme is set to conclude in February this year.\n\nAs the province continues to battle the devastating impacts of recurrent droughts, the SDRR programme was developed to address the urgent needs of affected communities through a multi-faceted approach.\n\nIt focuses on enhancing livelihoods, promoting gender equality, and supporting vulnerable groups, including women, children, the elderly, and persons with disabilities.\n\nOne of the programmes key achievements has been the rehabilitation of 21 defective boreholes in Bulilima, ensuring reliable access to lifesaving, multipurpose water supplies.\n\nTo guarantee the sustainability of these water points, 21 water point management committees were trained in the management and maintenance of the boreholes.\n\nThe Bulilima community in Matabeleland South faces the harsh realities of recurrent droughts.\n\nLaunched in September 2024, the SDRR programme, funded by Christian Aid, set out to provide crucial services to drought-affected communities.\n\nRehabilitation of 21 boreholes has provided reliable access to water for families in Bulilima. Defective boreholes were repaired to ensure clean water for drinking and daily use.21 water point management committees were trained to ensure sustainable maintenance of the water sources.\n\nLivelihood support initiatives have helped communities cope with the economic impact of drought.\n\nThe programme focuses on promoting gender equality and supporting vulnerable groups such as women, children, and the elderly.\n\nBy addressing water, sanitation, and livelihoods, the SDRR programme has made a lasting impact on the community.\n\nThe SDRR programme concludes in February 2025, but its legacy of resilience and empowerment continues.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-28-at-20.06.54-680x380.jpeg",
            "description": "Ashley Phiri, ashleyphiri66@gmail.com The Bulilima community in Matabeleland South Province has significantly benefited from the Zimbabwe Council of Churches (ZCC) Strengthening Drought Response and Recovery (SDRR) programme. Funded by Christian Aid, the initiative has provided essential services such as water, sanitation, and livelihood support since its launch in September 2024. The programme is set to conclude […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "Big Zulu out of the woods, discharged after car accident",
            "url": "https://www.chronicle.co.zw/big-zulu-out-of-the-woods-discharged-after-car-accident/",
            "content": "Showbiz Reporter\n\nSouth African hip-hop artiste, Big Zulu (real name Siyabonga Nene), has been discharged from Alberton Netcare after being involved in a car accident on Sunday.\n\nProviding an update to his Nkabi Nation fans this afternoon, Big Zulu shared, I would like to take this opportunity to express my heartfelt gratitude for all the prayers. I am safe and well.\n\nThe artiste also extended his appreciation to the medical staff at Alberton Netcare for their exceptional care.I sincerely thank the doctors and nurses here at Alberton Netcare for the love they have shown me. Thank you so much to the sisters and brothers who took care of me. I am deeply grateful.\n\nReassuring fans who had been asked by his team to pray for his recovery, Big Zulu confirmed that he is now safe and doing well.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/big-zulu.jpg",
            "description": "Showbiz Reporter South African hip-hop artiste, Big Zulu (real name Siyabonga Nene), has been discharged from Alberton Netcare after being involved in a car accident on Sunday. Providing an update to his Nkabi Nation fans this afternoon, Big Zulu shared, “I would like to take this opportunity to express my heartfelt gratitude for all the […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "Unregistered kombis will not be allowed to operate – Police",
            "url": "https://www.chronicle.co.zw/unregistered-kombis-will-not-be-allowed-to-operate-police/",
            "content": "Harare Bureau\n\nTHE Zimbabwe Republic Police has called on all commuter omnibus operators to register their vehicles with the relevant authorities, reiterating that unregistered kombis will not be allowed to operate on the countrys roads.\n\nIn a statement, police spokesperson Commissioner Paul Nyathi said: The Zimbabwe Republic Police expresses appreciation to the public for the support and cooperation given towards the ongoing operation, No to mushika-shika and lawlessness on the roads.\n\nThe police reiterate that only duly registered kombis with all the relevant and verifiable documents will be allowed to carry passengers from one point to another.\n\nIn this regard, no unregistered or unlicensed kombi or pirate taxi will be allowed to conduct business as a public service vehicle.\n\nThe police urges all kombi owners to lead by example and ensure that anyone intending to operate a public service vehicle duly complies with the countrys road rules and regulations.\n\nCommissioner Nyathi implored the public to use designated places to board kombis.\n\nHe said they will take decisive action against police officers that are involved in corrupt activities on the roads.\n\nThe Zimbabwe Republic Police Command is taking decisive action on corrupt elements within the rank and file of the police, he said.\n\nThis includes some unregistered kombi operators who are now working in cahoots with unruly elements to perpetuate corrupt activities on the roads.\n\nThe Zimbabwe Republic Police is taking decisive action on unregistered kombis that are picking up passengers on the Chitungwiza-Harare Central Business District route and dropping them off before the Seke Bridge.\n\nThe Commissioner-General of Police, Stephen Mutamba, has directed police commanders to ensure that duly registered and compliant kombis are allowed passage at police checkpoints without being inconvenienced, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Paul-Nyathi-.jpg",
            "description": "Harare Bureau THE Zimbabwe Republic Police has called on all commuter omnibus operators to register their vehicles with the relevant authorities, reiterating that unregistered kombis will not be allowed to operate on the country’s roads. In a statement, police spokesperson Commissioner Paul Nyathi said: “The Zimbabwe Republic Police expresses appreciation to the public for the […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        },
        {
            "title": "Meet rising voice in spoken word, Bradley Nsukuzokuduma Moyo",
            "url": "https://www.chronicle.co.zw/meet-rising-voice-in-spoken-word-bradley-nsukuzokuduma-moyo/",
            "content": "Lubelihle Mathe,[emailprotected]\n\nIn the world of spoken word, a new voice is making waves  meet Bradley Nsukuzokuduma Moyo. At just 21 years old, this talented and creative poet is leaving audiences captivated with his compelling verses and profound storytelling.\n\nBorn in September 2003 at Alexandra Clinic in South Africa, Moyo, the eldest of three siblings, relocated to Zimbabwe, where he was raised by his grandparents in Sizinda suburb in Bulawayo.\n\nHis creativity was nurtured early by his grandfather, a railway worker who introduced him to painting. Tragically, his grandfather passed away when he was still young. Reflecting on his childhood, Moyo shared, I grew up in Sizinda under the care of my grandparents, and my grandfather, a cultured man, taught me painting. His passing was a huge loss.\n\nBradley attended Intunta Primary School in Sizinda, where he was part of the school choir and discovered his love for music. He later moved to Ihlathi High School, where he joined the debate club and continued singing tenor whenever there were opportunities to form a choir. Raised in a Christian home, he actively participated in the Scripture Union Club and eventually became its president. Additionally, he captained the first aid team while excelling academically.\n\nGrowing up, I transitioned from being a naughty kid to a reserved and outspoken one, he said.\n\nThis newfound confidence allowed him to participate in workshops like those hosted by the Higher Life Foundation. These experiences broadened his perspective on the arts, especially as he struggled with science subjects like Chemistry and Physics.\n\nI used to love Biology, but numbers were not my strength, so I shifted to Arts, he explained.\n\nMoyo sought to explore other creative outlets beyond music, experimenting with unique art forms such as writing extracts, short stories, and poetry.\n\nMusic has always been a part of me, but because it was what everyone was doing, I wanted something different, he said.\n\nAfter completing his O-levels, Moyo pursued A-levels at Milton High School, where he discovered a passion for literature, particularly poetry. A turning point in his life came when he lost his best friend, a tragedy that inspired him to channel his grief into poetry. This led to the creation of his first book, Thalitha Koumi: The Prayers We Never Say.\n\nSince then, Moyo has remained steadfast in his poetry journey, achieving numerous milestones in 2024. He was nominated twice in the Third Edition of the Poetry Red Carpet Awards for Best Page Poet and Best Promising Poet. Additionally, he secured second runner-up in the Dreams Discovery Publishers Awards under the Best English Poetry category. These accolades motivated him to publish Thalitha Koumi, which is now available on the market.\n\nThe artist envisions a future where his work amplifies the voices of Africans, particularly the black majority, Ndebele people, and youth.\n\nI address a lot of issues. What I can say is I am a conscious writer passionate about telling the stories of Africans, blacks, Ndebele people, and young people, he explained.\n\nHe is now focused on creating more poetry and short stories that highlight these narratives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/hjbjnbjnjnj.jpg",
            "description": "Lubelihle Mathe, Lubelihlel79@gmail.com In the world of spoken word, a new voice is making waves – meet Bradley Nsukuzokuduma Moyo. At just 21 years old, this talented and creative poet is leaving audiences captivated with his compelling verses and profound storytelling. Born in September 2003 at Alexandra Clinic in South Africa, Moyo, the eldest of […]",
            "time": "21:06",
            "date": "28 Jan 2025"
        }
    ]
}