{
    "news": [
        {
            "title": "Zimpapers, Ministry of Agriculture collaborate to host Women in Agriculture Conference, celebrates their successes | Permanent Secretary Professor Obert Jiri to grace the event",
            "url": "https://www.chronicle.co.zw/zimpapers-ministry-of-agriculture-collaborate-to-host-women-in-agriculture-conference-celebrates-their-successes-permanent-secretary-professor-obert-jiri-to-grace-the-event/",
            "content": "Judith Phiri, Business Reporter\n\nZIMBABWES largest integrated media house, Zimbabwe Newspapers (Zimpapers) in partnership with the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development are set to host Women in Agriculture Conference in Harare on 26 March.The event taking place during Womens Month aims to increase recognition and celebration of womens contributions to agriculture, while the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri is set to grace the event at the Keynote Speaker.\n\nZimbabwe has made significant progress in promoting gender equality and empowering women in various sectors, including agriculture. However, despite their significant contributions, women in Zimbabwe continue to face numerous challenges that hinder their full participation and benefit from agricultural development.\n\nSome of the key challenges faced by women in agriculture in Zimbabwe include limited access to land and resources, lack of training and capacity building, limited market access as well as cultural and social barriers among others.This exclusion perpetuates poverty, inequality, and food insecurity, undermining the countrys efforts to achieve sustainable development and economic growth.\n\nIn recognition of these challenges, the Government of Zimbabwe has committed to promoting gender equality and empowering women in agriculture.\n\nThe Zimpapers conference in partnership with the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development will create a platform for knowledge sharing, networking and advocacy to support womens empowerment in agriculture.In an interview, Permanent Secretary Prof Jiri said it was important to recognise and celebrate womens contribution in agriculture.\n\nWomen constitute 52 percent of the population in the country and they are the bulk of farmers in communal areas. With such a demography they need to be taken on board and their contribution cannot be ignored, he said.He said women continue to prove their mettle in farming and they continue to rise fast to levels unparalleled by their male counterparts.\n\nThe event co-ordinator Mrs Hilda Marijeni said the conference will provide a platform for women in agriculture to share their experiences, challenges, and successes.\n\nShe said: It will also explore access to finance for women in agriculture, opportunities for womens empowerment through agricultural training and capacity building as well as promote gender equality and womens empowerment. This is a platform to advocate for policies and programmes that promote gender equality and womens empowerment in agriculture.\n\nMrs Marijeni said it was important to promote partnerships and collaborations between women in agriculture, government, private sector, and civil society.\n\nShe said the event will bring together women farmers that include smallholder farmers, rural women, and urban women involved in agriculture.\n\nIt will also include agricultural experts such as researchers, extension workers, and professionals working in agricultural development as well as policy makers such as Government officials, parliamentarians, and decision-makers responsible for agriculture, gender, and womens empowerment.\n\nAmong them will be civil society organisations such as NGOs, community-based organisations, and womens groups working on agriculture, gender, and womens empowerment.Mrs Marijeni said in attendance will be private sector representatives such as companies and businesses involved in agriculture, agribusiness, and rural development as well as youth and womens groups that are interested in agriculture.\n\nShe said media representatives of journalists and media professionals interested in covering womens empowerment and agricultural development stories will be in attendance at the event.Mrs Marijeni added: The conference agenda will include a Keynote Address that will address The Role of Women in Agriculture: Challenges and Opportunities. While the panel discussion will tackle Womens Experiences in Agriculture: Successes and Challenges.\n\nShe said a presentation on Government Initiatives Supporting Women in Agriculture will also be done as well as a networking session on Connecting Women in Agriculture: Building Partnerships and Collaborations.\n\nMrs Marijeni said the expected outcome will be improved understanding of the challenges faced by women in agriculture and potential solutions, strengthened partnerships and collaborations between women in agriculture, government, private sector, and civil society.\n\nAs well as empowering women farmers with knowledge, skills, and resources to improve their agricultural productivity and livelihoods.\n\nWe are calling on women in agriculture to register and come in their numbers for this important event as well as agricultural experts, civil society organisations and private sector representatives. Let us identify and come up with solutions to address challenges faced by women in agriculture.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Professor-Obert-Jiri.jpg",
            "description": "Judith Phiri, Business Reporter ZIMBABWE’S largest integrated media house, Zimbabwe Newspapers (Zimpapers) in partnership with the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development are set to host Women in Agriculture Conference in Harare on 26 March. The event taking place during Women’s Month aims to increase recognition and celebration of women’s contributions to […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Judah Nsingo dies",
            "url": "https://www.chronicle.co.zw/judah-nsingo-dies/",
            "content": "Online Reporter\n\nFORMER Zifa panel referee Judah Nsingo has died at the age of 79.\n\nA nephew of Nsingo, George Sibanda, confirmed on Friday that his uncle passed on on Wednesday after a battle with diabetes and prostate cancer.\n\nHe is no more. He died on Wednesday and will be buried on Sunday in Gwatemba, Filabusi. There will be a church service tomorrow (today) followed by his farewell at his Bellevue home, said Sibanda.\n\nHe said the family had lost a pillar.\n\nNsingo started his refereeing in the 1970s and was among the top referees in Bulawayo and region at Independence and officiated well into the 1990s.\n\nHe was a member of the provincial executive handling appointments.\n\nHe will be buried at Gwatemba on Sunday.\n\nHis church service will be held at Doves this afternoon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/edww.jpg",
            "description": "Online Reporter FORMER Zifa panel referee Judah Nsingo has died at the age of 79. A nephew of Nsingo, George Sibanda, confirmed on Friday that his uncle passed on on Wednesday after a battle with diabetes and prostate cancer. “He is no more. He died on Wednesday and will be buried on Sunday in Gwatemba, […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Grey Ncube buried",
            "url": "https://www.chronicle.co.zw/grey-ncube-buried/",
            "content": "Lovemore Dube\n\nBLACK Horrors legend Grey Ncube has been buried at Plumtrees MaDubes Cemetery.\n\nNcube died in Plumtree on Tuesday at the age of 73.\n\nHe had fought cancer since February 2023.\n\nNcube played for Black Horrors, considered the most successful club to emerge from Plumtree.\n\nThey played in the Zifa South Zone Soccer League in the 1970s.\n\nHe is remembered for a devastating combination with Onias Musana and Lemmy Mnenekwa.\n\nHe was an influential attacking midfielder, strong with balance, pace and intelligent on and off the ball.\n\nHe was part of the team that defied the odds and reached the semi finals of the Chibuku Trophy in 1979.\n\nA strong performance saw the unheralded Plumtree side dumped out of the tournament in the semi finals.\n\nThey won the hearts of many after bowing out 2-0 to one of the most exciting football projects of the time Caps United.\n\nIt was no ordinary outfit but one with the likes Stix Mtizwa, Joel Shambo, Shaky Tauro, Isaac Mafaro and Stanley Ndunduma.\n\nNcube shunned big clubs and kept his job in Plumtree.\n\nAn ardent Tottenham supporter, Ncube was described by many speakers as a great footballer and a man of great humility.\n\nChief Kiwa said: He was a good man who was vert humble and lived well with community.\n\nJoseph Nkomazana of the coaches association, said he was inspired by Ncube and his generation of Plumtree football heroes.\n\nHundreds of mourners attended the funeral that lasted six hours.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-08-at-10.14.08-AM-680x380.jpeg",
            "description": "Lovemore Dube BLACK Horrors legend Grey Ncube has been buried at Plumtree’s MaDubes Cemetery. Ncube died in Plumtree on Tuesday at the age of 73. He had fought cancer since February 2023. Ncube played for Black Horrors, considered the most successful club to emerge from Plumtree. They played in the Zifa South Zone Soccer League […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Headlands Farm workers gain insight into NSSA contributions and benefits",
            "url": "https://www.chronicle.co.zw/headlands-farm-workers-gain-insight-into-nssa-contributions-and-benefits/",
            "content": "Langelihle Nyathi,[emailprotected]\n\nTHE National Social Security Authority (NSSA) has launched an outreach initiative in Headlands to educate farm workers about their contributions and entitlements under the NSSA scheme.\n\nThe programme, a collaborative effort between Harare and Mutare Liaison Officers, aims to improve compliance, registration, and awareness of benefits among farm workers.\n\nAs part of the initiative, workers are being encouraged to verify their registration status and provide their national identity cards (IDs) to ensure proper enrollment. However, the campaign has encountered a significant hurdle: many farm workers lack national IDs, which are essential for NSSA registration.\n\nLiaison Officers are working closely with the workers to address these challenges and ensure they understand the importance of NSSA contributions and the benefits they can access. The outreach underscores NSSAs commitment to extending social security coverage to all workers, including those in remote and often underserved farming communities.\n\nDespite the progress made, the lack of IDs among farm workers remains a barrier to full participation in the scheme. NSSA has called for increased collaboration with relevant authorities to help workers obtain the necessary documentation, ensuring they can access the social security benefits they are entitled to.\n\nThis initiative highlights the ongoing efforts to bridge gaps in social security coverage and empower workers with the knowledge and tools needed to secure their futures.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/nssa-558x380.jpg",
            "description": "Langelihle Nyathi, langae2011@gmail.com THE National Social Security Authority (NSSA) has launched an outreach initiative in Headlands to educate farm workers about their contributions and entitlements under the NSSA scheme. The programme, a collaborative effort between Harare and Mutare Liaison Officers, aims to improve compliance, registration, and awareness of benefits among farm workers. As part of […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Presidential War Vets Fund launched in Masvingo",
            "url": "https://www.chronicle.co.zw/presidential-war-vets-fund-launched-in-masvingo/",
            "content": "George Maponga in Masvingo\n\nHundreds of war veterans in Masvingo province have gathered today at Gwengavi Primary School in Charumbira communal lands for the launch of the Presidential War Veterans Fund.\n\nThe event will also witness the simultaneous launch of the Presidential War Veterans Borehole Scheme and the Presidential Housing Scheme in the province.\n\nSenior Zanu PF officials, including Secretary for Veterans of the Liberation Struggle in the Politburo Cde Douglas Mahiya, Zanu PF Secretary for Security Cde Lovemore Matuke, Minister of State for Provincial Affairs and Devolution Ezra Chadzamira and Presidential Advisor on Investment Dr Paul Tungwarara, are headlining the event.\n\nPart of the crowd gathered for the launch of the Presidential war veterans fund,borehole and housing scheme at Gwengavi Primary school in Masvingo.\n\nThe launch also coincided with the unveiling of a goat pass-on scheme for Masvingo province.\n\nBefore the official proceedings began, Cdes Mahiya, Matuke, Chadzamira and Dr Tungwarara each took turns planting a tree at Gwengavi Primary School in a symbolic gesture.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ereg.jpg",
            "description": "George Maponga in Masvingo Hundreds of war veterans in Masvingo province have gathered today at Gwengavi Primary School in Charumbira communal lands for the launch of the Presidential War Veterans Fund. The event will also witness the simultaneous launch of the Presidential War Veterans Borehole Scheme and the Presidential Housing Scheme in the province. Senior […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "When a grown man fails to move on… Man sets ex-wife’s home on fire",
            "url": "https://www.chronicle.co.zw/when-a-grown-man-fails-to-move-on-man-sets-ex-wifes-home-on-fire/",
            "content": "Sinokubonga Nkala,[emailprotected]\n\nA 50-YEAR-OLD man from Mutare has been sentenced to 16 years in prison for attempted murder and criminal damage after setting his ex-wifes home on fire.\n\nOn 9 June 2024, Zvenyika Gomo broke into his ex-wifes home, where his unsuspecting stepdaughters were peacefully asleep.\n\nHe doused their bedroom in petrol, and with the strike of a match, flames erupted. Gomo fled the scene, leaving devastation in his wake.\n\nFortunately, the girls managed to escape the inferno. Quick-thinking neighbours rushed to their aid, helping to extinguish the fire.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said:\n\nThe blaze destroyed property worth US$4 500 and US$1 500 in cash.\n\nGomo was sentenced to 16 years in prison, with 4 years suspended. He will therefore serve 12 years behind bars.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Sinokubonga Nkala, sinokubongapnkala@gmail.com A 50-YEAR-OLD man from Mutare has been sentenced to 16 years in prison for attempted murder and criminal damage after setting his ex-wife’s home on fire. On 9 June 2024, Zvenyika Gomo broke into his ex-wife’s home, where his unsuspecting stepdaughters were peacefully asleep. He doused their bedroom in petrol, and with […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Zimbabwe hosts 12 Asian travel agents on familiarisation tour",
            "url": "https://www.chronicle.co.zw/zimbabwe-hosts-12-asian-travel-agents-on-familiarisation-tour/",
            "content": "Senior Business Writer\n\nZIMBABWE is hosting 12 travel agents from key Asian markets, including Singapore, Hong Kong, and the Philippines, for a familiarisation tour designed to showcase the countrys tourism offerings.\n\nThe agents, who are in Victoria Falls, will visit iconic attractions such as the Rain Forest, enjoy a traditional meal at The Boma, and conduct site inspections at premier properties including the Victoria Falls Safari Lodge and the Victoria Falls Hotel.\n\nIn an update on X, the Ministry of Tourism and Hospitality Industry said the initiative, supported by Qatar Airways, Thompsons Africa, and Gateway Singapore, aligns with Zimbabwes strategic focus on tapping into the lucrative Asian market.\n\nThe Asian market is one we are actively exploring, as it is a highly lucrative segment. Hong Kongs outbound tourism market for 2025 is estimated to reach US$863.2 million, said the Ministry.\n\nThe familiarisation trip highlights the growing appeal of Zimbabwe as a travel destination for both traditional and emerging markets.\n\nThe Ministry is prioritising market diversification and strengthening the domestic tourism sector to bridge low-season gaps.\n\nTourism, a key economic driver contributing 12 percent to the Gross Domestic Product (GDP), outperformed agriculture and mining in 2024.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/tytyt-1.jpg",
            "description": "Senior Business Writer ZIMBABWE is hosting 12 travel agents from key Asian markets, including Singapore, Hong Kong, and the Philippines, for a familiarisation tour designed to showcase the country’s tourism offerings. The agents, who are in Victoria Falls, will visit iconic attractions such as the Rain Forest, enjoy a traditional meal at The Boma, and […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "SADC urges member states to accelerate action for gender equality",
            "url": "https://www.chronicle.co.zw/sadc-urges-member-states-to-accelerate-action-for-gender-equality/",
            "content": "Nqobile Bhebhe, Senior Reporter\n\nSOUTHERN African Development Community (SADC) member states have been urged to take swift and decisive action to achieve gender equality by addressing systemic barriers and biases across all sectors.\n\nRobust education and awareness-raising initiatives are crucial to challenging stereotypes and empowering women and girls.\n\nIn a statement marking this years International Womens Day, held under the theme Accelerate Action, SADC Executive Secretary Dr Elias Magosi emphasised that gender equality is a fundamental human right and essential for a peaceful, prosperous, and sustainable world.\n\nHowever, Dr Magosi noted that the world, including the SADC region, is not on track to achieve gender equality by 2030, as outlined in the Sustainable Development Agenda targets.\n\nAt the regional level, the SADC Protocol on Gender and Development underscores integrating gender issues into the SADC Programme of Action and Community Building Initiatives, he said.\n\nYet, negative social, cultural, and religious practices, along with mindsets that impede womens progression and exacerbate gender-based violence, continue to hinder gender equality and equity.\n\nLet us therefore take swift and decisive steps to achieve gender equality, addressing systemic barriers and biases in all spheres.\n\nRobust education and awareness-raising are needed to challenge stereotypes and empower women and girls.\n\nDr Magosi noted ongoing reforms in the region to promote gender equality and empowerment, including the creation of special banks or grants for women to start businesses and the enactment of laws and policies that support womens participation in decision-making and address gender-based violence.\n\nFor instance, Zimbabwe has a Zimbabwe Womens Microfinance Bank.\n\nFinance, Economic Development, and Investment Promotion, Professor Mthuli Ncube, in November last year, allocated ZiG1,02 billion to the Ministry of Women Affairs, Community, Small and Medium Enterprises to facilitate empowerment programmes across the country, key among the targets being women and marginalised groups.\n\nHowever, Dr Magosi pointed out that low implementation of policies and lack of enforcement remain a persistent challenge.\n\nTo accelerate progress, the SADC regional bloc outlined several effective strategies, including forging partnerships for resource mobilisation, supporting women and girls in leadership roles, and developing interventions to prevent gender-based violence.\n\nThe bloc also emphasiaed the importance of promoting Science, Technology, Engineering, and Mathematics (STEM) education for women and girls and empowering them to make informed health decisions.\n\nAdditional strategies include involving women and girls in sustainable agriculture and food security, providing access to quality education and training, and facilitating their participation in peace and security negotiations.\n\nWhile reaffirming the SADC regions commitment to gender equality, Dr Magosi acknowledged that barriers such as societal roles, legal frameworks, limited access to resources, and discriminatory practices persist.\n\nHe urged member states to fully implement the protocols, legal frameworks, and policies they have adopted as a region.\n\nLet us all take responsibility and actively participate in accelerating action for gender equality, whether through advocacy, education, or supporting initiatives that empower women and girls. Every effort does count!\n\nThe potential for the region to create a more equitable and just society is huge and ever-present.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-31-at-21.56.52-680x380.jpeg",
            "description": "Nqobile Bhebhe, Senior Reporter SOUTHERN African Development Community (SADC) member states have been urged to take swift and decisive action to achieve gender equality by addressing systemic barriers and biases across all sectors. Robust education and awareness-raising initiatives are crucial to challenging stereotypes and empowering women and girls. In a statement marking this year’s International […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Government accountant arrested in alleged medical funds scam",
            "url": "https://www.chronicle.co.zw/government-accountant-arrested-in-alleged-medical-funds-scam/",
            "content": "Online writer\n\nTHE Zimbabwe Anti-Corruption Commission (ZACC) has arrested Dorothy Mauchaza, an Assistant Accountant at the Ministry of Public Service, Labour and Social Welfare, on charges of Criminal Abuse of Duty.\n\nThe arrest follows allegations that Mauchaza corruptly issued an Assisted Medical Treatment Order (AMTO) to cover hospital bills amounting to ZiG 16 253 for Robson Chisango, a patient admitted at Victoria Chitepo Provincial Hospital in Mutare.\n\nAccording to ZACC communications manager Ms Simiso Mlevu, Mauchaza is accused of colluding with Phillip Sofirinyoto, an employee at the hospital, to fraudulently issue the AMTO. The order, which was billed to the Ministry of Public Service, Labour and Social Welfare, covered Chisangos medical expenses from 10 to 17 December 2024.\n\nAMTOs are a government initiative under the Department of Social Welfare, designed to assist individuals who cannot afford medical treatment by covering their expenses in government hospitals. However, ZACC alleges that Mauchaza and Sofirinyoto abused this system for personal gain.\n\nMauchaza appeared in court and was remanded out of custody, with the case set to resume on 13 March 2025. ZACC has reiterated its commitment to rooting out corruption in public institutions, warning that those who abuse their positions for personal enrichment will face the full force of the law.\n\nThis case highlights growing concerns over the misuse of public funds in Zimbabwe, particularly in sectors meant to support vulnerable citizens. ZACC has urged members of the public to report any suspicious activities as part of efforts to safeguard public resources.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Arrested-3.jpg",
            "description": "Online writer THE Zimbabwe Anti-Corruption Commission (ZACC) has arrested Dorothy Mauchaza, an Assistant Accountant at the Ministry of Public Service, Labour and Social Welfare, on charges of Criminal Abuse of Duty. The arrest follows allegations that Mauchaza corruptly issued an Assisted Medical Treatment Order (AMTO) to cover hospital bills amounting to ZiG 16 253 for […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        },
        {
            "title": "Fuel fraudster jailed for 20 years as court seizes assets in multi-million dollar scam",
            "url": "https://www.chronicle.co.zw/fuel-fraudster-jailed-for-20-years-as-court-seizes-assets-in-multi-million-dollar-scam/",
            "content": "Langelihle Nyathi,[emailprotected]\n\nTHE High Court of Zimbabwe, sitting in Harare, has handed down a 20-year prison sentence to Tinashe Sibanda and ordered the confiscation of assets belonging to Centenary Tobacco Company (Pvt) Ltd after convicting them of fraud.\n\nSibanda was found guilty of forging documents to illegally import 4,47 million litres of duty-free diesel between October 2022 and February 2023, resulting in a staggering US$2,8 million revenue loss to the Zimbabwe Revenue Authority (ZIMRA).\n\nAccording to the National Prosecuting Authority (NPA), Sibanda misrepresented to CMED (Pvt) Ltd that his company had Government authorisation to import duty-free fuel for agricultural purposes. He allegedly presented fake letters from the Ministry of Agriculture and ZIMRA, enabling his company to evade duty payments.\n\nThe scam unravelled in January 2023 when ZIMRA discovered the documents were forged and demanded payment from CMED. Following a trial, Sibanda was sentenced to 20 years in prison, with five years suspended on condition of good behaviour, leaving him with an effective 15-year jail term.\n\nIn addition to the prison sentence, Centenary Tobacco Company (Pvt) Ltd has been ordered to pay ZIMRA USD 2.1 million. The Sheriff of the High Court has been directed to promptly seize company property to recover the funds.\n\nThe NPA emphasised its commitment to combating crime and corruption, saying the case serves as a stern warning to those engaging in fraudulent activities. The authority reiterated its zero-tolerance stance on corruption, urging the public to report suspicious activities to relevant authorities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jail.jpg",
            "description": "Langelihle Nyathi, langae2021@gmail.com THE High Court of Zimbabwe, sitting in Harare, has handed down a 20-year prison sentence to Tinashe Sibanda and ordered the confiscation of assets belonging to Centenary Tobacco Company (Pvt) Ltd after convicting them of fraud. Sibanda was found guilty of forging documents to illegally import 4,47 million litres of duty-free diesel […]",
            "time": "06:28",
            "date": "09 Mar 2025"
        }
    ]
}