{
    "news": [
        {
            "title": "At least 120 dead and dozens missing after plane crashes at South Korea airport",
            "url": "https://www.chronicle.co.zw/at-least-120-dead-and-dozens-missing-after-plane-crashes-at-south-korea-airport/",
            "content": "At least 120 people have been killed as a plane crash-landed at an airport in South Korea.\n\nRescuers are attempting to pull people from the wreckage of the plane after it veered off a runway at Muan International Airport and crashed into a wall, bursting into flames.\n\nThe plane, which was carrying 175 passengers and six crew members, was making a second attempt at a crash landing after its landing gear failed to open, local media reports.\n\nDozens of people remain missing as a local fire chief said that two crew members had been rescued.\n\nOfficials say a collision with a bird may have caused the malfunction, reports Yonhap News Agency.\n\nA passenger texted a relative to say a bird was stuck in the wing of the plane, News1 reports.\n\nTheir final message was said to have been: Should I say my last words?\n\nAt least 120 dead and dozens missing in South Korea plane crash\n\nSouth Koreas parliament impeaches acting president\n\nSouth Koreas president facing second impeachment vote over martial law order\n\nWeather conditions were also being looked into as a suspected cause of the crash.\n\nFootage aired by YTN television showed the moment the plane slammed into the wall at the airport and burst into flames, after skidding off the runway without its landing gear deployed.\n\nFurther photos shared by local media showed smoke and flames engulfing much of the plane.\n\nLee Jeong-hyeon, chief of the Muan fire station, said rescue teams were searching for bodies scattered by the impact of the crash.\n\nThe plane was completely destroyed with only the tail recognisable among the wreckage, he added.\n\nRead more from Sky News:Benjamin Netanyahu to have prostate removedChampion boxer dies at 35Model and actress Dayle Haddon dies\n\nOfficials said the fire has been extinguished and South Koreas transport ministry said the incident happened at 9.03am local time on Sunday (shortly after midnight in the UK).\n\nJeju Air flight 7C2216, a Boeing 737-800 jet, was on its way back from Bangkok, Thailand, at the time of the crash.\n\nAmong those on board were 173 South Koreans and two Thai people, local media reports.\n\nAll domestic and international flights from Muan International Airport have been cancelled.\n\nThe incident marks one of the deadliest disasters in South Koreas aviation history.\n\nThe last time the country suffered a large-scale air disaster was in 1997 when a Korean Airlines plane crashed in Guam, killing 228 people.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Screenshot-2024-12-29-at-08-12-02-At-least-120-dead-and-dozens-missing-after-plane-crashes-at-South-Korea-airport-World-News-Sky-News-680x380.png",
            "description": "4–5 minutes At least 120 people have been killed as a plane crash-landed at an airport in South Korea. Rescuers are attempting to pull people from the wreckage of the plane after it veered off a runway at Muan International Airport and crashed into a wall, bursting into flames. The plane, which was carrying 175 […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "WATCH: President arrives in Bulawayo for the Thanksgiving service",
            "url": "https://www.chronicle.co.zw/watch-president-arrives-in-bulawayo-for-the-thanksgiving-service/",
            "content": "Rutendo Nyeve,Sunday News Reporter\n\nPRESIDENT Mnangagwa has arrived at the Joshua Mqabuko Nkomo International Airport in Bulawayo ahead of the 8th edition of the National Thanksgiving and Dedication Service set for the Zimbabwe International Exhibition Centre (ZIEC) tomorrow.\n\nPresident Mnangagwa touched done at 4.50 pm and was welcomed by the Minister of Defence and Security Oppah Muchinguri, Minister of State for Provincial Affairs and Devolution Judith Ncube ZANU PF Provincial leadership and members of the Joint Operations Command.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe\n\nThe service which has been held annually since 2017 does not only demonstrate the symbiotic relationship between the Church and the Government, but presents a platform for the two to celebrate the progress which the country is witnessing in its various socio-economic sectors.\n\n@nyeve14\n\n",
            "image_url": null,
            "description": "Rutendo Nyeve, Sunday News Reporter PRESIDENT Mnangagwa has arrived at the Joshua Mqabuko Nkomo International Airport in Bulawayo ahead of the 8th edition of the National Thanksgiving and Dedication Service set for the Zimbabwe International Exhibition Centre (ZIEC) tomorrow.   President Mnangagwa touched done at 4.50 pm and was welcomed by the Minister of Defence and […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "President arrives in Bulawayo for the Thanksgiving service",
            "url": "https://www.chronicle.co.zw/president-arrives-in-bulawayo-for-the-thanksgiving-service/",
            "content": "Rutendo Nyeve\n\nPRESIDENT Mnangagwa arrived on Saturday afternoon at the Joshua Mqabuko Nkomo International Airport in Bulawayo ahead of the 8th edition of the National Thanksgiving and Dedication Service set for the Zimbabwe International Exhibition Centre (ZIEC) tomorrow.\n\nPresident Mnangagwa touched done at 4.50 pm and was welcomed by the Minister of Defence and Security Oppah Muchinguri, Minister of State for Provincial Affairs and Devolution Judith Ncube ZANU PF Provincial leadership and members of the Joint Operations Command.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe\n\nThe service which has been held annually since 2017 does not only demonstrate the symbiotic relationship between the Church and the Government, but presents a platform for the two to celebrate the progress which the country is witnessing in its various socio-economic sectors.\n\n@nyeve14\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/WhatsApp-Image-2024-12-28-at-17.10.28_5037acc5-680x380.jpg",
            "description": "Rutendo Nyeve PRESIDENT Mnangagwa arrived on Saturday afternoon at the Joshua Mqabuko Nkomo International Airport in Bulawayo ahead of the 8th edition of the National Thanksgiving and Dedication Service set for the Zimbabwe International Exhibition Centre (ZIEC) tomorrow. President Mnangagwa touched done at 4.50 pm and was welcomed by the Minister of Defence and Security […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "Scotland FC Bulawayo supporters chapter gives back to community",
            "url": "https://www.chronicle.co.zw/scotland-fc-bulawayo-supporters-chapter-gives-back-to-community/",
            "content": "Innocent[emailprotected]\n\nTHE Scottland FC Bulawayo Supporters Chapter has made a kind-hearted donation of foodstuffs to Emthunzi WeLanga Childrens Home.Additionally, the chapter has provided sanitary wear to young girls in Mizilikazi, which was sourced by national supporters chapter chairperson Edith Majama and handed over at the suburbs Youth Center.Thabani Mthizozo Gumbo, Chairman of the Bulawayo Scotland Chapter, highlighted the importance of giving back to the community. As Scotland FC supporters, we believe that charitable donations are a vital part of our social corporate responsibility. We take pride in making a positive impact on the lives of those around us. Our goal is not only to support our team but also to uplift our community.Gumbo encouraged other clubs to follow their lead, promoting unity and kindness through similar charitable activities.Takudzwa Murebwa, Organising Secretary of the Bulawayo Chapter, expressed optimism about the teams prospects for the upcoming year.2025 is shaping up to be an incredible year for Scotland FC. Were hopeful that our team will excel on the pitch, and were committed to supporting them every step of the way. With unity and determination, were confident that we can achieve great things together. We would like to pay gratitude to our club president Scott Sakupwanya, said Muremba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/t6hy6u6.jpg",
            "description": "Innocent Kurira-innocent.kurira@chronicle.co.zw THE Scottland FC Bulawayo Supporters Chapter has made a kind-hearted donation of foodstuffs to Emthunzi WeLanga Children’s Home. Additionally, the chapter has provided sanitary wear to young girls in Mizilikazi, which was sourced by national supporters chapter chairperson Edith Majama and handed over at the suburb’s Youth Center. Thabani “Mthizozo” Gumbo, Chairman of […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "Day 3 Test: Afghanistan dominates Zimbabwe",
            "url": "https://www.chronicle.co.zw/day-3-test-afghanistan-dominates-zimbabwe/",
            "content": "Stumps on day three at Queens Sports ClubAfghanistan 425/2 (125 overs)Trail by 161 runsRahmat Shah 231 (416)Hashmatullah Shahidi 141 (276)\n\nAfghanistans total at stumps is now their second-highest in Test cricket. The highest is 545/4 (declared) which was against Zimbabwe in 2021.The 361-run partnership between Rahmat Shah and the captain, Hashmatullah Shahidi is now the highest for Afghanistan for any wicket.Shah now holds the record for the highest individual score for Afghanistan in Tests, surpassing Shahidis 200 not out which he made against Zimbabwe in 2021.They are the only to batters to have scored a double century for Afghanistan in red-ball cricket.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghfghg.jpg",
            "description": "Stumps on day three at Queens Sports Club Afghanistan 425/2 (125 overs) Trail by 161 runs Rahmat Shah 231 (416) Hashmatullah Shahidi 141 (276) Afghanistan’s total at stumps is now their second-highest in Test cricket. The highest is 545/4 (declared) which was against Zimbabwe in 2021. The 361-run partnership between Rahmat Shah and the captain, […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "Maqhawe Masuku’s Mhla Zinhlanu kuLwezi: A Novel Igniting the Fight Against Drug Abuse",
            "url": "https://www.chronicle.co.zw/maqhawe-masukus-mhla-zinhlanu-kulwezi-a-novel-igniting-the-fight-against-drug-abuse/",
            "content": "Blessing Karubwa -Showbiz Reporter\n\nIn a dazzling display of culture, Maqhawe Masuku from Sibantubanye village has unveiled his powerful new novel, Mhla Zinhlanu kuLwezi, tackling the urgent crisis of drug abuse. This electrifying launch promises to captivate hearts and minds!\n\nThe launch event, held in August at the Filabusi Centre District Hall, drew a substantial crowd, marking a significant step in the fight against the rampant drug crisis in Zimbabwe.\n\nSpeaking exclusively to Chronicle Showbiz, Masuku expressed his elation over the successful turnout, stating, It was heartwarming to see so many people come together under the theme Kasiphumeni kuzidakamizwaLets desist from drugs and substance abuse. This shows that our community is ready to engage in this crucial conversation.\n\nThe 202-page novel not only aligns with the governments zero-tolerance approach to drug abuse but also aims to resonate with readers on a personal level.\n\nMasuku, who serves as a Poultry and Piggery Supervisor at Gwanda State University, has ambitious plans to translate the novel into other languages, including Venda, Nambya, and Shona.\n\nThese languages are predominantly spoken in the border towns where drug abuse is most prevalent. I believe that translating this work will help reach a wider audience and make a more significant impact, he explained.\n\nHe, however, stated that his vision does not stop at the written word, adding that he is already in talks to adapt Mhla Zinhlanu kuLwezi into a thrilling movie.\n\nWhile there are no auditions yet for the film crew, Masuku is optimistic about starting the filming process early next year, pending the completion of translation discussions.\n\nI want to partner with donors to bring this story to the big screen. The idea is still on paper for now, as we are working on securing finances for the project.The film will be released in episodes, allowing us to engage viewers in a unique way. As soon as an episode is completed, well release it based on industry advice and audience feedback, he added with enthusiasm.\n\nAs the conversation around drug awareness continues to grow, Masukus novel and upcoming film promise to be powerful tools in the fight against substance abuse. Were not just telling a story; were igniting a movement, he concluded, embodying the spirit of change that is so desperately needed in todays society.\n\nStay tuned for more updates on Mhla Zinhlanu kuLwezi as it makes its way from page to screen, inspiring hope and resilience in the face of adversity. @TeamKarubwa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsfdsfds.jpg",
            "description": "Blessing Karubwa -Showbiz Reporter In a dazzling display of culture, Maqhawe Masuku from Sibantubanye village has unveiled his powerful new novel, Mhla Zinhlanu kuLwezi, tackling the urgent crisis of drug abuse. This electrifying launch promises to captivate hearts and minds! The launch event, held in August at the Filabusi Centre District Hall, drew a substantial […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "Bulawayo Children’s Choir debuts with visuals for “Banolila”",
            "url": "https://www.chronicle.co.zw/bulawayo-childrens-choir-debuts-with-visuals-for-banolila/",
            "content": "Mbulelo[emailprotected]\n\nIN a world where art often serves as a catalyst for change, the Bulawayo Childrens Choir, under the visionary direction of Trevor Mawaka, has taken a bold step forward.\n\nEarlier this week, the choir released the visuals for their debut song, Banolila (Mother Earth is Crying), a heartfelt plea for environmental conservation.\n\nDrawing inspiration from iconic tracks like UB40s The Earth Dies Screaming and Michael Jacksons Earth Song, Banolila resonates deeply in the context of todays urgent climate crisis.\n\nThe song serves as a poignant SOS, urging listeners and viewers to recognise the pressing need for environmental stewardship amidst the ongoing global warming challenges.\n\nThe choir, composed of young talent from various institutionsincluding Dominican Convent Primary School, Charleston Trust Primary School, Petra High School, and Hillside Primary Schoolembarks on a mission to advocate for the Earth.\n\nTheir collective voice not only showcases vocal excellence but also embodies a powerful message of change.\n\nIn an exclusive interview, Mawaka shared his vision for the choir.\n\nOur Choir is not only concerned with vocal excellence but rather, being a vehicle for change, advocating for diverse causes. Our ballad is a cry for help, asking the masses to save our environment to combat climate change, he stated passionately.\n\nThe production of Banolila was handled with care; recorded, mixed, and mastered at PlayOn Studios, the visuals were expertly captured by filmmaker Corey.\n\nThe resulting video poignantly illustrates the choir members actively engaging in environmental cleanup, picking up litter and disposing of it responsiblyan inspiring image of youth taking action.\n\nDespite the choirs noble intentions and the quality of their work, the video has faced a disappointing reception, garnering less than 300 views on YouTube at the time of writing.\n\nThis lack of visibility raises concerns about how effectively the choirs message is reaching the community.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fdffhfh.jpg",
            "description": "Mbulelo Mpofu-mbulelo.smpofu@gmail.com IN a world where art often serves as a catalyst for change, the Bulawayo Children’s Choir, under the visionary direction of Trevor Mawaka, has taken a bold step forward. Earlier this week, the choir released the visuals for their debut song, “Banolila (Mother Earth is Crying),” a heartfelt plea for environmental conservation. Drawing […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "President Mnangagwa honours Mbare Chimurenga Choir",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-honours-mbare-chimurenga-choir/",
            "content": "Mukudzei Chingwere,Harare Bureau\n\nPRESIDENT Mnangagwa said high-density suburbs like Mbare, Highfields, Makokoba, Mpopoma, Mtapa and Sakubva played a pivotal role in the liberation struggle.\n\nHe said these neighbourhoods were the breeding grounds for resistance and the spirit of freedom that ultimately led to Zimbabwes independence. The President expressed these sentiments during a festive Boxing Day gathering where he honoured the Mbare Chimurenga Choir for its invaluable contributions to Zimbabwes rich tapestry of culture and national identity.\n\nThe President also underscored the significance of the cultural creative industries, highlighting their role as engines of economic growth and innovation. He emphasised that these sectors not only foster artistic expression but also promote social cohesion and preserve Zimbabwes unique identity.\n\nAs you are aware, the cultural creative industries play a vital role in society by fostering economic growth through creative outputs such as music, art, design, fashion, and film, among others. They also contribute significantly to social cohesion, cultural identity, innovation, and individual well-being by nurturing creativity, expression, and engagement within communities.\n\nHonouring the Mbare Chimurenga Choir is appreciation, through them, of the many musicians and artistes who continue to use their artistic talents to defend the gains of our Independence and advance our national development identity, image, and culture.\n\nIt was in residential areas such as Mbare, Highfields, Makokoba, Mpopoma, Mtapa, and Sakubva, among others, where the flames for Independence were kept ablaze before and during our protracted war of liberation, said President Mnangagwa.\n\nHe said through song and dance, young people were mobilised to go for military training and subsequently to fight for the freedom of the country.\n\nIn the post-Independence era, said President Mnangagwa, it is groups and musicians such as the Mbare Chimurenga Choir who used their exceptional talent to promote cultural diversity and rally younger generations around the various national development periods.\n\nHe congratulated the Mbare Chimurenga Choir for the consistency with which it has utilised its musical talent for the good of the country and the ruling Zanu-PF party.\n\nYour music with its educating lyrics is a symbol of the hope and resilience that inspires countless individuals to remain patriotic and safeguard our beloved nation. The performance you have delivered over the years inculcates the values of unity, resilience, and love. Your revolutionary spirit is a beacon of light and hope.\n\nIt is also a reminder of our collective history, our shared struggles, as well as a celebration of our resilience and determination to build a better Zimbabwe. I applaud you for your current efforts and music compilations which highlight our ongoing national development agenda, vision, policies, and programmes. Through your efforts along with others in the creative cultural industries, the nation must remain galvanised towards the attainment of our vision of a prosperous and empowered upper-middle-income economy, said President Mnangagwa.\n\nHe also handed over gifts to the choir and encouraged them to carry the message of love, unity, and the need to accelerate development in the country, continuing to uplift one another and embrace the values being nurtured by the Second Republic.\n\nGoing forward, I urge you to continue infusing the new crop of musicians, particularly the youth, into your groups. It is equally important that you broaden the reach of your music, riding on the diversity of ICT platforms.\n\nAs I hand over these gifts, we acknowledge the tireless efforts of each and every one of you. Your dedication to Zanu-PF programmes is commendable and your performances have been a source of joy and entertainment for many, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-14-1.jpg",
            "description": "Mukudzei Chingwere, Harare Bureau  PRESIDENT Mnangagwa said high-density suburbs like Mbare, Highfields, Makokoba, Mpopoma, Mtapa and Sakubva played a pivotal role in the liberation struggle.  He said these neighbourhoods were the breeding grounds for resistance and the spirit of freedom that ultimately led to Zimbabwe’s independence. The President expressed these sentiments during a festive Boxing Day […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": "Bulawayo healthcare gets airborne: Help from above as air ambulances arrive",
            "url": "https://www.chronicle.co.zw/bulawayo-healthcare-gets-airborne-help-from-above-as-air-ambulances-arrive/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nHELIDRIVE Zimbabwe unveiled the first of its two air ambulances for Bulawayo yesterday, delivering a significant boost to emergency medical services in the Matabeleland region.\n\nThe helicopter, bound for the United Bulawayo Hospitals (UBH), landed at Joshua Mqabuko Nkomo International Airport at 11am, accompanied by a skilled crew of four, including pilots Aleksander Rusanov and Denis Salikhov. The second helicopter is anticipated to arrive in Bulawayo shortly.\n\nTogether, the two air medical rescue service helicopters will provide rapid medical assistance for serious incidents such as road traffic accidents throughout the Matabeleland region.\n\nThese helicopters are part of a larger fleet of six that will be dispatched across four stations, including Harare, Manicaland, Victoria Falls, and Bulawayo.\n\nThe helicopter will be based here in Bulawayo. This is a Presidential project and we are working on his instructions, said Rusanov.\n\nPresident Mnangagwa and the Government have embarked on a mission to modernise Zimbabwes healthcare systemto achieve the goal of becoming a modern, prosperous, and industrialised country by 2030.\n\nTo this end, the President visited Russia in June to seek investors to establish an air ambulance service.\n\nRussian HeliDrive Air Ambulance Medical Services promptly collaborated with Zimbabwe to establish an efficient air ambulance service equipped with highly skilled medical doctors, nurses, engineers, dispatchers, and pilots.\n\nThe Russian Air Ambulance Service has been in operation for nine years and has a fleet of over 100 medical helicopters, dedicated to saving lives throughout Russia.\n\nThe company has recruited and trained local personnel, including 40 pilots, 50 doctors, 100 nurses, 100 dispatchers, and 10 engineers, to handle the air medical services.\n\nAir ambulances are typically reserved for transporting patients from inadequate levels of care to higher levels of care or for patients who are unable to use commercial flights due to their medical condition.\n\nThese specialised aircraft are designed to overcome geographical barriers and provide the same level of medical care available in an intensive care unit.\n\nThe air ambulance service was launched in Zimbabwe in August in conjunction with the 44th SADC summit.\n\nThe helicopters are equipped with advanced medical facilities and staffed by trained medical personnel. One of the first successful missions was the transportation of a cardiac arrest patient from Chegutu to Harare in 20 minutes, which is significantly faster than the two-hour road journey.\n\nAlthough Winos Dube, chairperson of the Bulawayo Residents Association (Bura), recognised the significance of the arrival of the air ambulance, he emphasised the importance of providing equitable access to critical services.\n\nWe applaud the Government on this. We, however, hope that every person who needs emergency medical attention will access this. It must not be based on ones position in society but generally, we are excited as its presence will indeed save lives, said Dube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-5-1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw  HELIDRIVE Zimbabwe unveiled the first of its two air ambulances for Bulawayo yesterday, delivering a significant boost to emergency medical services in the Matabeleland region.  The helicopter, bound for the United Bulawayo Hospitals (UBH), landed at Joshua Mqabuko Nkomo International Airport at 11am, accompanied by a skilled crew of four, including pilots Aleksander […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        },
        {
            "title": ". . . Craig Ervine ends four-year drought with century in historic Boxing Day Test",
            "url": "https://www.chronicle.co.zw/craig-ervine-ends-four-year-drought-with-century-in-historic-boxing-day-test/",
            "content": "Brandon Moyo,[emailprotected]\n\nCRAIG Ervine, Zimbabwes red-ball captain, ended his four-year wait for a Test century on day two of the Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo.\n\nErvine had gone seven innings without a century but kept his composure to score his fourth Test ton. His last century came in Mirpur against Bangladesh, where he made 107 runs. After the Mirpur century, Ervines scores were not very impressive, with only one half-century. However, he put an end to the dry spell, bringing up a brilliant century in a Boxing Day Test  his first in Zimbabwe.\n\nErvine made a patient 104 runs from 176 balls, including 10 boundaries, mostly consisting of singles as he kept the scoreboard ticking and rotated the strike with his partners, Sean Williams and Brian Bennett.\n\nErvine had emphasised before the series that playing at the familiar Queens Sports Club would work in Zimbabwes favour, and his innings proved him right.\n\nQueens Sports Club\n\nHe came to the crease with Zimbabwe in a strong position on 220/4, following the fall of Dion Myers. He then formed a 163-run partnership with Williams for the fifth wicket, before adding 82 runs for the sixth wicket with Bennett.\n\nErvines century was even more memorable as it came alongside Williamss career-best 154 runs, making it the first time in 10 years that Zimbabwe had two centurions in an innings.\n\nThe last time this happened was in 2014 against Bangladesh in Khulna, where Hamilton Masakadza and Regis Chakabva made 158 and 101 runs respectively.\n\nErvine now shares the joint seventh-most Test centuries for Zimbabwe, alongside Dave Houghton, after playing in 21 Test matches. Ervines other centuries in Test cricket came against Sri Lanka in 2017 (160 runs), New Zealand in 2016 (140 runs), and Bangladesh (107 runs) in 2020.\n\nOverall he has 1 344 runs under his belt at an average of 33.60, including five half-centuries.\n\n@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dghh.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com  CRAIG Ervine, Zimbabwe’s red-ball captain, ended his four-year wait for a Test century on day two of the Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo. Ervine had gone seven innings without a century but kept his composure to score his fourth Test ton. His last century came in Mirpur […]",
            "time": "08:25",
            "date": "29 Dec 2024"
        }
    ]
}