{
    "news": [
        {
            "title": "Miss Fabulous Zimbabwe celebrates Independence with national fabric giveaway",
            "url": "https://www.chronicle.co.zw/miss-fabulous-zimbabwe-celebrates-independence-with-national-fabric-giveaway/",
            "content": "Faith Ndlovu, Zimpapers Arts & Entertainment Hub\n\nAs Zimbabwe marks 44 years of Independence on April 18, the Miss Fabulous Zimbabwe International pageant is honouring the occasion by giving away national fabric, branded T-shirts, and caps in a spirited campaign to promote patriotism, unity, and cultural pride.\n\nThe initiative, spearheaded by the pageants organisers, is part of a broader effort to engage with communities while celebrating Zimbabwes hard-won freedom.\n\nAccording to the pageants executive director, Simbarashe Gwawawa, the gesture is more than just a giveaway; its a call to embrace national identity.This initiative is a way for us to give back to the community and promote national pride. By celebrating our independence, we can foster a sense of unity and solidarity among citizens, said Gwawawa.\n\nThe campaign also ties into the pageants mission to empower women through innovation and technology, aligning national celebration with social impact.\n\nThe Miss Fabulous Zimbabwe 2025 pageant is currently open for entries for women aged 18 to 30. It will be held in Bulawayo from October 26 to November 1, 2025, with the winner set to walk away with a grand prize of US$1 500, project funding, endorsement deals, and other perks. The reigning queen is Evidence Gabi from Bulawayo.\n\nTo participate in the Independence giveaway, citizens can follow the Miss Fabulous Zimbabwe International pageant on their social media platforms.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gbfdb.jpg",
            "description": "Faith Ndlovu, Zimpapers Arts & Entertainment Hub As Zimbabwe marks 44 years of Independence on April 18, the Miss Fabulous Zimbabwe International pageant is honouring the occasion by giving away national fabric, branded T-shirts, and caps in a spirited campaign to promote patriotism, unity, and cultural pride. The initiative, spearheaded by the pageant’s organisers, is […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "Gokwe awakens! logistical preparedness for Uhuru excites cabinet",
            "url": "https://www.chronicle.co.zw/gokwe-awakens-logistical-preparedness-for-uhuru-excites-cabinet/",
            "content": "Gibson Mhaka / Peter Matika, Zimpapers WritersALL systems are in place for the successful hosting of the 45th main Independence Day celebrations to be held this Friday in Nembudziya, Gokwe North, with final touches being carried out on various infrastructure that will be used during the gathering of the expected 60 000 people from the countrys 10 provinces.\n\nThe celebrations commence on April 17 with the traditional Childrens Party at Nyamuroro High School, hosted by President Mnangagwa and First Lady, Dr Auxillia Mnangagwa.\n\nOver 3 000 children are expected to attend the event, which features entertainment, educational activities and a luncheon. New hostels have been constructed at the school, specifically for this event.\n\nAn Independence Gala is scheduled for the Independence Eve at Nembudziya Government High School. The main event on April 18 will be held at the Nembudziya Growth Point Open Ground, highlighted by President Mnangagwas address. Following the official proceedings, a football match between Simba Bhora and FC Platinum will entertain the crowds.\n\nCabinet was yesterday briefed about the smooth preparations with Government expressing excitement about the logistical readiness for the successful hosting of the event.\n\nInformation, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, told journalists in a post-Cabinet media briefing that major preparatory works were almost complete, with significant infrastructural developments already transforming the outlook of the district.\n\nHe said construction of the football stadium and other facilities have been completed.\n\nOther key milestones include the completion of educational legacy projects at Nembudziya Government High School, Nyamuroro High School, Nyamuroro Primary School and Nyamuroro Vocational Training Centre. The completed projects include classroom blocks, ablution blocks, teachers houses, science laboratories, boreholes and facilities for School Business Units, said Dr Muswere.\n\nThe external ambience of the schools has been vastly transformed through re-painted walls, renovated buildings and improved water and sanitation facilities, he added.\n\nDr Muswere said road networks in the Gokwe North and South districts, as well as the surrounding districts, have since been rehabilitated.\n\nThese include the surfacing of Nembudziya Growth Point, re-gravelling and surfacing of portions of the Kadoma-Sanyati-Nembudziya Road, Gokwe Jahana Road and the Chakari, Hovani, Copper Queen and Jakani roads.\n\nAccessibility of the venue site from all major centres such as Gokwe Town, Chinhoyi, Binga, Kadoma and others have been enhanced. Other notable developments include the renovation of a mortuary at Nembudziya Hospital, installation and upgrading of 3G and 4G base stations; training of local communities in digital skills; refurbishment of computer laboratories and the establishment of a telemedicine clinic, said Dr Muswere.\n\nHe said a total of 132 graves across heroes shrines in the Midlands Province are being adorned with concrete slabs. At the same time, the construction of a field museum and a memorial plinth at the former Sikombela Restriction Camp was completed.\n\nOther places of significance to the countrys Liberation Struggle such as Connemara Prison and Mutapa Hall, have already been facelifted, said Dr Muswere.\n\nMeanwhile, all the necessary logistical arrangements, sporting and cultural performances are on course\n\nSpeaking in an interview from Nembudziya Growth Point, the venue for the Independence Day celebrations, where she was also assessing progress, Gokwe-Nembudziya Member of Parliament, Cde Flora Buka said the political leadership from the Midlands Province was working around the clock to ensure all works were completed timeously.\n\nShe said road works are in their final stages, with several roads already open and fully accessible to traffic.\n\nConstruction at the grounds where the main celebrations will be held is almost complete. Everything is in place: bucket seats have been installed, the lawn has been laid, and schoolchildren are busy with their rehearsals.\n\nThe infrastructure intended for the grounds is now ready and fitted for public use. There are a few final touches underway but everything is largely complete and in place.\n\nAs the Gokwe-Nembudziya constituency, we are now fully prepared and filled with electric anticipation to host the expected 60 000 people for the Independence Day celebrations. The mood is vibrant, and the entire community is ready to commemorate this significant day, said Cde Buka.Regarding transport and infrastructure, she said everything is now in place to ensure a smooth and successful Independence Day celebrations.\n\nThe rehabilitation of key roads, particularly the one from Kadoma to Nembudziya and all roads linking to Nembudziya, is complete, making previously inaccessible areas now reachable and ensuring a smooth flow of traffic to the venue.\n\nThe Hovano Road, connecting Gokwe South and Nembudziya, has also been rehabilitated, with contractors working on the final touches. We urge all drivers, local and those travelling to the celebrations, to exercise extreme caution on these newly improved roads to prevent any unnecessary loss of life during this celebratory time, she said.\n\nCde Buka said mobilisation efforts have been highly successful, with everyone eager to celebrate independence.\n\nWhile buses have been arranged to ferry people to the venue, the overwhelming response means that lorries will also be used to accommodate all those wishing to attend, including women, children and the elderly. The enthusiasm and readiness of the community are palpable.\n\nIn terms of entertainment, our talented schoolchildren, who will be providing performances, are putting the final touches on their rehearsals. Additionally, the schools designated to host the gala and childrens party have undergone construction, renovations, and repainting, ensuring a welcoming and festive environment for our younger attendees.\n\nBeyond the immediate preparations for the day itself, our broader community projects, such as borehole drilling and village business units, have also been established, demonstrating the ongoing progress and development within the constituency, said Cde Buka.\n\nCulturally, the traditional leaders in Gokwe are performing their rites in preparation for the Independence Day celebrations, underscoring the importance of our heritage in this national event. Church leaders have also actively engaged the community, encouraging widespread participation in the celebrations.\n\nFurthermore, the political leadership from the province is working tirelessly to ensure efficient and effective mobilisation.\n\nIn a departure from the four-decade tradition of hosting the national event in Harare, this year marks the fourth consecutive year the commemorations have been decentralised, having been previously held in Bulawayo, Mt Darwin and Murambinda.\n\nThe move underscores the Governments commitment to devolution and inclusive development.\n\nIn an interview on Friday, Local Government and Public Works Minister Daniel Garwe also confirmed that work at the main venue in Gokwe Nembudziya was progressing well.\n\nHe said beyond the main arena, significant infrastructure upgrades have been undertaken, designed to benefit the Gokwe North community long after the celebrations. These sustainable development projects include a new, fully equipped stadium capable of hosting Division One football matches.\n\nRenovations have been undertaken at the local district hospital, including the VIP ward and a new mortuary, while new boys and girls hostels have been constructed at Nyamuroro High School to accommodate visiting children.\n\nThere have also been extensive upgrades at Nembudziya High School, including new classroom blocks, renovated existing ones, new science labs and administration block improvements.\n\nEnhanced water supply has also been achieved through three new boreholes and water tanks, alongside secured electricity and backup generators.\n\nGokwe and surrounding areas have also seen road improvements managed by the Ministry of Transport and Infrastructural Development.\n\nLogistical arrangements are being streamlined, with 369 buses mobilised to transport attendees from across the country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-3-2.jpg",
            "description": "Gibson Mhaka / Peter Matika, Zimpapers Writers ALL systems are in place for the successful hosting of the 45th main Independence Day celebrations to be held this Friday in Nembudziya, Gokwe North, with final touches being carried out on various infrastructure that will be used during the gathering of the expected 60 000 people from […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "BCC debunks Bulawayo water utility",
            "url": "https://www.chronicle.co.zw/bcc-debunks-bulawayo-water-utility/",
            "content": "Raymond Jaravaza,[emailprotected]The establishment of a water and sanitation utility in Bulawayo is intended to improve service delivery, attract funding and investment, enhance accountability reduce water shortages, and boost efficiency.\n\nIt is therefore not a move towards privatising water services.\n\nThis was clarified by the acting Director of Water and Sanitation, Engineer Kwanele Sibanda during a stakeholder consultative meeting held yesterday at the City Hall to discuss the proposed establishment of an independent water management utility.\n\nThe Bulawayo City Council (BCC) has proposed the formation of a Private Limited Corporate Organisation, aimed at unlocking external financing opportunities, with US$17 million earmarked to upgrade the citys water infrastructure.\n\nThe initiative seeks to tackle long-standing infrastructure challenges and is expected to benefit from the technical expertise and resources of partners such as the Veolia Environment Institute (VEI).\n\nThe proposed utility would function as a specialised, professionally managed entity wholly owned by the City of Bulawayo to improve operational efficiency and service delivery.\n\nThe consultative meeting drew participation from a wide range of stakeholders including residents, civil society organisations, human rights lawyers and business community representatives.\n\nAlso in attendance were the Minister of State for Provincial Affairs and Devolution, Judith Ncube; Deputy Mayor Councillor Edwin Ndlovu; Town Clerk Mr Christopher Dube and the Permanent Secretary for Provincial Affairs and Devolution in Bulawayo, Mr Paul Nyoni.\n\nSome residents expressed concerns that the establishment of the Water and Sanitation Utility was tantamount to privatisation  a move they feared would result in increased tariffs and make water services unaffordable for vulnerable groups.\n\nMs Nomalanga Vundla from Makokoba asked whether or not water tariffs will increase under the new utility arrangement.\n\nWater is a public resource and the right to access it is enshrined in our Constitution. I would like to know if the proposed utility will make water accessible only to those who can afford it, she asked.\n\nIn response, Eng Sibanda explained that a financial feasibility study indicated that the utilitys viability does not depend on increasing water tariffs.\n\nResidents are encouraged to understand the need for a utility and the benefits it brings. Tariff hikes are not the basis for its sustainability, she said.\n\nAnother resident raised concerns about the impact on pensioners and the elderly, who are already struggling to pay their rates.\n\nOther attendees voiced strong opposition, claiming that the decision-making process has excluded the views of ordinary citizens.\n\nEng Sibanda insisted that the council is not privatising water services.\n\nThe proposed utility will be owned entirely by the people of Bulawayo, with 100 percent shareholding by the City of Bulawayo.\n\nIt will be professionally run to enhance service delivery and not to transfer ownership or control to private entities, she said.\n\nEng Sibanda further clarified that the council is not entering into a public-private partnership or creating a charter. Instead, a private limited company will be registered solely to safeguard the utility from external threats such as hostile takeovers or dilution of control.\n\nThis is not privatisation. The companys shares will not be tradable. It will not be profit-driven but focused on delivering efficient and affordable water and sanitation services, she said.\n\nAn eight-member board comprising public and council representatives will oversee the operations of the utility. A residents representative will also sit on the board to ensure public accountability.\n\nThe City of Bulawayo will retain ownership of the utilitys assets and will delegate the management, operations and maintenance to the 100 percent council-owned company, said Eng Sibanda.\n\nShe assured residents that the council will continue its pro-poor approach.\n\nResidents aged 70 and above can still approach the council for assistance. We offer discounted tariffs for vulnerable groups and that policy will not change with the creation of the new utility, she said.\n\nHowever, Eng Sibanda noted that setting up the utility may require tariff adjustments in line with prevailing economic conditions.\n\nIf not properly structured, the utility could face risks of mismanagement or inefficiency. Initial setup costs and loan repayments could place strain on council finances. However, as of February 2025, the water and sanitation department has no outstanding loans, she said.\n\nThe council continues to grapple with persistent water supply disruptions, ageing infrastructure, rising demand due to urban expansion and procurement delays, all of which make the establishment of a dedicated Water and Sanitation Utility a necessity, according to officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/wdabf.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw The establishment of a water and sanitation utility in Bulawayo is intended to improve service delivery, attract funding and investment, enhance accountability reduce water shortages, and boost efficiency. It is therefore not a move towards privatising water services. This was clarified by the acting Director of Water and Sanitation, Engineer Kwanele Sibanda […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "Midlo irrigation farmers embrace business approach to agriculture",
            "url": "https://www.chronicle.co.zw/midlo-irrigation-farmers-embrace-business-approach-to-agriculture/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nFARMERS at the Midlo Irrigation Scheme in Matobo District, Matabeleland South Province, have adopted a business model approach to agriculture, a shift expected to boost production and improve livelihoods.\n\nPreviously, individual plot holders operated independently, but they have now united to work as a collective. This change follows the rehabilitation of the scheme and training in climate-smart agriculture and agribusiness management.\n\nThe schemes farmers have planted 2,5 hectares of maize, which is now ready for harvesting and two hectares of sugar beans. Plans are already underway to introduce wheat farming, with eight hectares prepared for planting this May.\n\nEstablished in 2019, the Midlo Irrigation Scheme comprises 47 farmers; 30 women and 17 men, including the elderly and people with disabilities.\n\nThe scheme was recently expanded from eight to 20 hectares, bringing relief to farmers who previously relied on labour-intensive methods, using hosepipes to water crops.\n\nIn the past, we would spend the entire day at the scheme, taking turns connecting hosepipes to taps to water our crops. It was exhausting and often forced our children to skip school to help. Now, with the new system, things have changed for the better, said Ms Hleziphi Moyo, a member of the scheme.\n\nThanks to the installation of a centre pivot and drag hose sprinklers, irrigation is now more efficient and less labour-intensive.\n\nThe system we have now is convenient. It doesnt require much labour or supervision. I can go home and attend to other chores while the machinery does the watering. We are excited about the potential to grow more crops and increase our income. This winter, well plant wheat for the first time since the scheme was established, said Ms Moyo.\n\nMs Moyo added that they were looking forward to improved yields that would help support their families.\n\nSpeaking during a recent visit to the scheme, Engineer Bezzel Chitsungo, the Director for Irrigation Development in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, said the Government was promoting the Vision 2030 Accelerator Model, which aims to uplift communities into an upper-middle-income economy.\n\nUnder this model, irrigation farmers must form companies and become shareholders. The Arda scheme manager will assist in running the scheme as a business and developing a five-year business plan, he said.\n\nEngineer Chitsungo said that, with the guidance of scheme managers, farmers would have improved access to Government support, such as machinery and inputs.\n\nGovernment is moving to capacitate irrigation schemes, as they have a crucial role to play in enhancing agricultural production because they can produce year-round, he said.\n\nAmbassador Tadeous Tafirenyika Chifamba, Permanent Secretary in the Ministry of Environment, Climate and Wildlife, commended Midlo Irrigation Scheme farmers for embracing the project. He said irrigation farming is vital for food security, especially in the face of climate change.\n\nAmbassador Chifamba also announced that the farmers would be supported with a fish farming project to complement their crop production.\n\nMidlo Irrigation Scheme was rehabilitated under the Building Climate Resilience of Vulnerable Agricultural Livelihoods in Southern Africa programme, which is being implemented by the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development in partnership with the Green Climate Fund and the United Nations Development Programme (UNDP).\n\nA solar-powered plant has been installed to pump water from Midlo Dam. The centre pivot irrigates 15 hectares, while the drag hose sprinkler covers the remaining five hectares.\n\nThe Government, in collaboration with development partners, is rehabilitating idle irrigation schemes in Matabeleland South as part of a broader national effort to enhance food and nutrition security in line with Vision 2030.\n\nTo support this transformation, farmers have received agricultural inputs and training on how to run their operations as businesses. These efforts are part of the Governments ambitious plan to rehabilitate and develop 350 000 hectares of irrigated land by 2025, thereby building resilience against climate change and boosting food security.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fchnf.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw FARMERS at the Midlo Irrigation Scheme in Matobo District, Matabeleland South Province, have adopted a business model approach to agriculture, a shift expected to boost production and improve livelihoods. Previously, individual plot holders operated independently, but they have now united to work as a collective. This change follows the rehabilitation of the […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zimbabwe Business Hall of Fame inducts Moyo",
            "url": "https://www.chronicle.co.zw/zimbabwe-business-hall-of-fame-inducts-moyo/",
            "content": "Sikhulekelani Moyo,[emailprotected]GROWING up in rural Bulilima District, Matabeleland South, where he got exposure to business through his grandfathers venture as a young boy, prominent industrialist, Mr Busisa Moyo, has risen to become a towering business leader in Zimbabwe.\n\nRecently, he was inducted into the Zimbabwe Business Hall of Fame 2025, a milestone recognition of his outstanding business leadership credentials and contribution to the local economy and beyond.\n\nThe award was presented on April 4, 2025, recognising his impactful contributions to the Zimbabwean business landscape.\n\nIn an interview, Mr Moyo said he was excited by the accolade, which he regards as a positive reflection on the need to do more for all the organisations he represents including United Refineries Limited, where he is the chief executive officer, the nation and the region at large.\n\nIts a mile marker, I didnt expect it, and I didnt work up and say I want to be at the Zimbabwe Business Hall of Fame. But they took notice of what we do and what we have done and we can still do more, said Mr Moyo.\n\nI turned 50 this year, so for me, its a mile marker to say whats next for our country, for the sub-region, for URL and the other entities that I am involved with.\n\nSo, thats what it means to me to say, we have done what we have done, but this is just a platform, its a foundation to then build the future and to have wide impact, depth of impact and to change our continent because there is still a lot of work to be done to make it better for future generations.\n\nThe former Confederation of Zimbabwe Industries (CZI) president, emphasised the need for a new era of African business, characterised by new names, new proverbs, new stories across the African landscape, different models of sharing wealth prosperity with allies, stakeholders, consumers and communities.\n\nReflecting on his journey, Mr Moyo acknowledged reaching his 50th year as a mile marker, recognising the significant work that still lies ahead.\n\nThe induction into the Zimbabwe Business Hall of Fame serves as a testament to Busisa Moyos leadership, innovation and dedication to the growth and development of the Zimbabwean economy.\n\nHis vision for continental and global expansion signals an exciting future for his ventures and underscores the increasing ambition of African businesses on the world stage.\n\nRising through the ranks, Mr Moyo worked for auditing firm, Deloitte and Touche and had a stint with TA Holdings before joining Aroma Bakeries as group accountant and later Blue Ribbon. He rose through the ranks, being assigned senior positions.\n\nI was in charge of the investments and monitoring on the manufacturing side. So, l had always been on the foods type of businesses and investments and finance, he said.\n\nThat is how l ended up here at United Refineries as the finance director in 2007 and 2008. We did a management buy-in for shares in the business, for manager owners and I made various partners from there. I also became chairman for the\n\nMatabeleland Chamber of Industries.\n\nHe also became the national president of the Confederation of Zimbabwe Industries and now chairs the ZITF and Zida boards.\n\nI am not after fame but rather opportunities that can help me to make a difference. I value contribution, I want to make my country better and also contribute to the development of industries, said Mr Moyo.\n\nI am grateful that people do take note of the fact that l am focused and I work hard on tough assignments that have been given to me. I work with integrity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-1-6.jpg",
            "description": "Sikhulekelani Moyo, sikhu.moyo@chronicle.co.zw GROWING up in rural Bulilima District, Matabeleland South, where he got exposure to business through his grandfather’s venture as a young boy, prominent industrialist, Mr Busisa Moyo, has risen to become a towering business leader in Zimbabwe. Recently, he was inducted into the Zimbabwe Business Hall of Fame 2025, a milestone recognition […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "COMMENT: Steel industry back on track",
            "url": "https://www.chronicle.co.zw/steel-industry-back-on-track/",
            "content": "The developments taking place at Dinson Iron and Steel Company (Disco) in Manhize area near Mvuma town confirm that the countrys steel industry is back on track.\n\nThe company, which started producing pig iron and steel billets last year, is now producing steel bars. This is a major development in the countrys efforts to revive the steel industry, which is critical for Zimbabwes modernisation and industrialisation.\n\nThe country has been spending an estimated US$1 billion annually on steel imports, which are mainly steel bars, which are now being produced by Disco. The company is producing about 9 000 tonnes of steel products per month and has a target to produce 600 000 tonnes a year.\n\nWe are now producing 16mm, 20mm and 25mm bars, which are mostly used in the construction industry, said the companys public relations manager, Mr Joseph Shoko. He said the company was committed to meeting local demand for steel products thereby completely substituting imports.\n\nThe company has already created 2 000 jobs and has a potential to create 10000 jobs when operating at full throttle. Most of the employees are locals from Manhize and surrounding areas. What is very encouraging about Disco is that it is not only substituting imports, but is also a leader in upholding high occupational health and safety standards, that has seen the steel producer recording zero fatalities since its inception.\n\nThe company, a subsidiary of Chinese global investment group, Tsingshan Holdings, is one of the Second Republics signature projects that are transforming livelihoods of communities. The national Social Security Authority (Nssa), said for the past four years that Disco has been in operation, it has not recorded a single death at the workplace.\n\nSpeaking after the tour of the giant steel plant, by experts and engineers that were attending the annual Nssa Engineers Workshop in Masvingo recently, Nssa acting general manager Dr Charles Shava, commended Disco for upholding high occupational health and safety standards. He said Disco, which has the potential to be the largest steel plant in Africa, has done well in terms of occupational health and safety.\n\nThey have had only incidents where some workers have suffered some minor injuries, but I think overall, they have done very well because we are talking about a very big steel plant, said Dr Shava.\n\nHe said Nssa was happy that Disco has a very good medical team on the ground, a confirmation that they are on top of the game and are able to deal with the issue of diseases. The company is producing 50MW of electricity using coal but has very limited pollution. The coal is emitting very little pollutants in the air. What is obtaining at Disco should be emulated by other companies so that we reduce fatalities at the workplace. We want to applaud Disco for not just creating thousands of jobs, but also ensuring that its employees work under a conducive working environment.\n\nThe company has invested a lot of money in occupational health and safety hence it has recorded zero fatalities since it started operating. Disco has demonstrated that it is possible to drastically reduce fatalities at the workplace and as already stated, other companies should learn from this giant steel producer.\n\nOccupational health and safety should be a priority for all companies, if we are to reduce fatalities at the workplace. We want to once again applaud Disco for accelerating the revival of the local steel industry and saving the country the much needed forex by substituting imports.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/thggtfdssfd.jpg",
            "description": "The developments taking place at Dinson Iron and Steel Company (Disco) in Manhize area near Mvuma town confirm that the country’s steel industry is back on track. The company, which started producing pig iron and steel billets last year, is now producing steel bars. This is a major development in the country’s efforts to revive […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "Musicians promise fireworks at 45th Uhuru bash",
            "url": "https://www.chronicle.co.zw/musicians-promise-fireworks-at-45th-uhuru-bash/",
            "content": "Trust Khosa & Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub\n\nITS all systems go for the 45th Uhuru Musical Gala set to take place in Gokwe North this Friday, with artistes eagerly anticipating the opportunity to perform and promising spectacular displays.\n\nThis years event will be hosted at Nembudziya Government High School, where some of the countrys top performers will share the stage. Running under the theme Zim@45: Devolve and Develop Together Towards Vision 2030, the celebrations promise to be a vibrant showcase of Zimbabwean history, culture and talent.\n\nRepresenting the host province are Midlands-born artistes, Admire Chief Hwenje Sibanda and Peter Young Igwe Moyo, who will be joined by an impressive line-up including Sulumani Chimbetu, Sandra Ndebele, Simon Mutambi, Tendai Dembo, Clement Magwaza, DT Bio Mudimba, Shantel Sithole,\n\nAndy Muridzo\n\n, Mark Ngwazi, the Mbare Chimurenga Choir and Jah Signal.\n\nWith just days to go before the gala expected to awaken Gokwe from its slumber, fans can anticipate a night of unforgettable entertainment.\n\nBeitbridge-based Amapiano/house artiste Bhadilah, who will be performing at a national gala for the first time, described the opportunity as a dream come true.\n\nIt feels amazing to be part of this years national Independence Gala; its truly a dream realised. I used to watch these galas on TV, hear about them on the radio, and read about them in newspapers. I never imagined Id one day perform on that stage, he said.\n\nThis is a win for Matabeleland South. Ill be representing the Rainbow Province, and weve been preparing thoroughly. I want to raise our flag high and make both the country and our global supporters proud. Im grateful to the organisers for recognising talent from all corners of the nation. Events like these foster unity and reinforce our national identity.\n\nFast-rising Bulawayo musician Mzoe 7, fresh from a successful performance at the Piano Festival, echoed the excitement.Its a privilege to be part of the celebrations once again. I last performed at a gala in Esigodini, so Im well aware of the high standards expected. Its a grand stage that demands nothing but excellence, he said.\n\nSharing the stage with some of Zimbabwes finest musicians at such a significant national event is always an honour. It drives me to continue pushing boundaries in my career.Veteran dance troupe Iyasa, also fresh from a performance at Harares Doek and Slay event, are raring to go.Weve played a key role at many national events, and we take that responsibility very seriously. We aim to refresh our audiences and brighten their experience with each show. Every performance is treated like our first and our last. The forthcoming gala will be no exception. Were ready to give it our all, said group director, Nkululeko Dube.\n\nSandra Ndebele\n\nPeter Moyo, heir to the Utakataka Express legacy, promised nothing short of fireworks.Its an amazing feeling to perform in my home area, where I have deep roots. I last performed in Gokwe last year, and this time, Im back for a national celebration.\n\nIll be giving it everything Ive got.\n\nChief Hwenje, a regular at state functions, is equally confident of delivering a stellar show.\n\nIts going to be an epic night for me and my team. Performing in the Midlands, where I hail from, is always a privilege. I commend the organisers for decentralising national events. For many in Gokwe, this will be their first time witnessing such renowned performers live. Its a night not to be missed, from 6pm to 6am, Nembudziya will be buzzing.\n\nSulumani Chimbetus camp, through his manager Solo Chimbetu, also promised fireworks.\n\nWere going to show them exactly what were made of. National events like this provide a brilliant platform to showcase our musical diversity.\n\nWith such an extensive and diverse line-up, entertainment is guaranteed. Sungura fans can look forward to performances from Mutambi, Ngwazi, Mudimba, Magwaza and Moyo. Dendera enthusiasts will enjoy Sulumani Chimbetu, while Shantel Sithole will cater to fans of Kanindo.\n\nSasha Amadhube, who refined her mbira craft under the mentorship of her late aunt, Edna Mbuya Mdhuve Chizema, is set to captivate traditional music lovers.Sandra Ndebele, affectionately known as Sandy, returns to Gokwe a decade after her last performance and promises a show to remember. A crowd favourite, famed for her electric stage presence, Sandy rarely disappoints.\n\nNgwazi, backed by the talented Njanja Express, brings a blend of humour and melody and is set to remind fans why he remains one of the scenes most exciting acts, despite a recent quiet spell. Tendai Dembo, who continues to mature like fine wine, is also expected to impress.\n\nCompleting the star-studded bill are crowd-pullers Andy Muridzo and Jah Master, both renowned for their high-energy shows. For gospel fans, Argatha Murudzwa will be on hand to deliver a soul-stirring performance as her illustrious career continues to flourish.\n\n@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sese.jpg",
            "description": "Trust Khosa & Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub IT’S all systems go for the 45th Uhuru Musical Gala set to take place in Gokwe North this Friday, with artistes eagerly anticipating the opportunity to perform and promising spectacular displays. This year’s event will be hosted at Nembudziya Government High School, where some of […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "Nust turns to police as panners invade campus",
            "url": "https://www.chronicle.co.zw/nust-turns-to-police-as-panners-invade-campus/",
            "content": "Raymond Jaravaza,[emailprotected]THE National University of Science and Technology (Nust) has enlisted the assistance of the police to help deter the influx of illegal gold miners who have invaded its main campus in Bulawayo.\n\nThe university has recently become a target for illegal gold panners, who are increasingly encroaching on residential areas in suburbs such as Killarney, resulting in extensive land degradation.\n\nLast year, six Bulawayo men were arrested and brought before the courts for illegal gold panning activities on the Nust campus.\n\nThe panners were caught conducting illicit mining operations in pits located within the university grounds. The arrests followed a raid by the Zimbabwe Republic\n\nPolice (ZRP), which included officers from the canine unit who swooped on the site where dozens of illegal miners were digging for the precious mineral.\n\nThe majority of the miners fled but six were apprehended. They were each sentenced to six months imprisonment.\n\nDespite strengthening its internal security systems, Nust security personnel continue to clash with persistent intruders, known colloquially as Omakorokoza, who have escalated their operations in recent months.\n\nThe Nust campus was recently invaded by illegal artisanal miners from nearby Old Nic Mine and the Zimbabwe School of Mines area.\n\nTo address the issue, the university sought the assistance of the ZRP in addition to reinforcing our internal security to intensify patrols around the campus, said the universitys Vice-Chancellor, Professor Mqhele Dlodlo.\n\nHe was briefing the Minister of Higher and Tertiary Education, Innovation, Science and Technology Development, Dr Frederick Shava, who visited the university last week and toured key projects on the campus.\n\nDr Frederick Shava\n\nProfessor Dlodlo said although the university has applied for a special grant from the Ministry of Mines and Mining Development to legally undertake mining operations through its own company, the application has not yet been approved.\n\nWe applied for a special grant, and the ministry referred the university to the Bulawayo City Council for a letter of consent.\n\nThis was denied, but we will continue to seek the ministrys intervention for special mining rights, he said. Acting Bulawayo provincial police spokesperson, Assistant Inspector Nomalanga Msebele, confirmed that Nust has requested police intervention to rid its campus of illegal miners.\n\nThe illegal miners usually operate at night to avoid detection by Nusts internal security. At the universitys request, the police have been conducting regular raids to apprehend those involved in the illicit activities, she said.\n\nOn the issue of illegal mining in suburbs such as Mqabuko Heights and Killarney, among others, Assistant Inspector Msebele urged members of the public to report such activities to the police.\n\nInformation from the public regarding illegal mining operations in city suburbs is treated in strict confidence and greatly assists police in planning effective raids, she said.\n\nIllegal mining causes extensive environmental damage and often attracts criminal elements hence police will continue raiding the affected areas.\n\nGold panning has persisted for years despite repeated police efforts to clamp down on the widespread violence and environmental destruction associated with such operations.\n\nAt Mqabuko Heights, atop a hill that overlooks immaculately built homes, gold panners have wreaked havoc by digging deep pits and cutting down trees to use as timber in their illicit mining activities.\n\nConcerned residents in the suburb say the panners invaded the hill roughly a year and a half ago and fear their property values will plummet as a result.\n\nIn Killarney suburb, in an area known locally as the squatter camp, gold panners armed with compressors, picks and shovels have been operating for years.\n\nIn the area between Mahatshula and Queens Park suburbs, under electricity pylons, there are heaps of rubble and trenches confirming panning activities.\n\nAccording to the Chief Executive Officer of the Zimbabwe Miners Federation, Mr Wellington Takavarasha, mines must be located at least one kilometre away from residential areas, whether urban or rural.\n\nA blasting licence issued by the Ministry of Mines and Mining Development clearly stipulates that any mining activity must be conducted at least one kilometre away from human settlements to ensure safety during blasting operations, he said.\n\nAdditionally, miners must obtain the consent of the community in which they wish to operate. In extreme cases, some communities are relocated to make way for mining developments.\n\nNUST now joins a growing list of Bulawayo suburbs suffering from severe land degradation due to rampant illegal gold mininga destructive practice driven by gold panners who disregard both environmental regulations and legal mining requirements, engaging in both open-cast and, in extreme cases, shaft mining.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/NUST-introduces-Agric-engineering.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw THE National University of Science and Technology (Nust) has enlisted the assistance of the police to help deter the influx of illegal gold miners who have invaded its main campus in Bulawayo. The university has recently become a target for illegal gold panners, who are increasingly encroaching on residential areas in suburbs […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zimbabwe streamlines oil, gas agreements",
            "url": "https://www.chronicle.co.zw/zimbabwe-streamlines-oil-gas-agreements/",
            "content": "Nqobile Bhebhe,Senior Business Writer\n\nIN a major policy breakthrough poised to enhance Zimbabwes investment appeal in the oil and gas sector, the Government and Invictus Energy have agreed to consolidate the Petroleum Production Sharing Agreement (PPSA) and the Petroleum Exploration Development and Production Agreement (Pedpa) into a unified and streamlined legal framework.\n\nThis landmark decision was reached during a high-level in-country visit by the Invictus Energy Board of Directors at the end of March.\n\nThe delegation held extensive engagements with senior Government officials, the Mutapa Investment Fund, traditional leaders, local investors and key project partners.\n\nTheir discussions centred on accelerating progress in the Cabora Bassa Project, Zimbabwes flagship petroleum exploration initiative.\n\nFollowing in-depth legal and technical consultations involving Invictus Energy, external legal counsel to Zimbabwe and relevant Government ministries, all parties unanimously agreed that amalgamating the PPSA and Pedpa would provide long-term regulatory clarity and administrative efficiency.\n\nThe consolidated agreement is expected to streamline approval processes, reduce bureaucratic duplication and enhance governance as the project transitions from exploration to commercial production.\n\nWhile the move has prompted a slight revision in project timelines, it is viewed as a strategic step that positions Zimbabwe as a regional leader in petroleum regulation.\n\nSeparately, the consolidation of the Petroleum Exploration Development and Production Agreement and the Petroleum Production Sharing Agreement provides a clearer path forward and reflects the shared commitment to enabling a successful development, said Invictus Energy managing director, Mr Scott Macmillan in an update.\n\nOur recent site visit to Zimbabwe marks another important milestone in the development of the Cabora Bassa Project and reinforces the strong support from all levels of Government and the broader Zimbabwean community.\n\nDuring the visit, Invictus also confirmed Musuma-1 as the next high-impact exploration well, following the landmark Mukuyu gas discovery.\n\nThe selection of Musuma-1 as the next high-impact exploration well beyond the Mukuyu discovery, is a major achievement for Invictus. Musuma is a technically compelling prospect, underpinned by multiple lines of seismic evidence, including consistent flat spots across different surveys, which are indicative of hydrocarbons, said Mr Macmillan.\n\nThe well has been designed as a low-cost, low-risk vertical well to test a shallow target with significant upside.\n\nMr Macmillan added that success at Musuma could unlock a new play fairway, substantially expand the projects resource base and fast-track the transition from exploration to commercial development.\n\nThe unified agreement is also expected to unlock further investment opportunities in the Cabora Bassa Basin, sending a strong signal to global energy markets that Zimbabwe is committed to managing large-scale energy projects with transparency, professionalism and stability.\n\nIn 2023, Invictus Energy confirmed significant natural gas and oil reserves in the Cabora Bassa Basin in Mbire, Mashonaland Central Province.\n\nThese discoveries marked a substantial leap towards energy security, opening up new avenues for economic growth through the development of downstream industries, job creation, increased export earnings and higher Government revenue.\n\nThere is growing optimism that early monetisation of the oil and gas finds could offer meaningful relief to Zimbabwe, which faces a national power deficit, peaking at 2 200MW, especially during the winter months.\n\nThe deficit, often met through costly imports, has resulted in prolonged power outages that disrupt both business operations and household life.\n\nTo address the energy gap, Invictus has signed two separate agreements with Eureka Gold Mine and Mbuyu Energy for gas-to-power projects, initiatives expected to create further job opportunities beyond primary production.\n\nThe two gas-to-power projects will see Invictus supplying 12MW to Eureka Gold Mine, and this figure can be raised to 50MW, while a local firm in the energy space, Mbuyu Energy, signed an offtake agreement with Invictus for 500MW.\n\nThe agreement with Mbuyu Energy project holds the potential to scale up to 1 000MW, which would require approximately 1,4 trillion cubic feet of natural gas.\n\nThis level of power generation is expected to relieve pressure on Zimbabwes overburdened electricity grid and support the Southern African Power Pool, while also enabling better integration of renewable energy sources.\n\nIn a further vote of confidence, global petroleum research firm, Wood Mackenzie, classified the Mukuyu gas discovery as the second-largest petroleum find in Africa in 2023.\n\nThe estimated resource at Mukuyu stands at 230 million barrels of oil, equivalent to 1,3 trillion cubic feet of gas.\n\nWith a structural closure of over 200 square kilometres, independent estimates suggest the Mukuyu field could hold up to 20 trillion cubic feet of gas and 845 million barrels of conventional gas condensate.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/frtdf∆¥f.jpg",
            "description": "Nqobile Bhebhe, Senior Business Writer IN a major policy breakthrough poised to enhance Zimbabwe’s investment appeal in the oil and gas sector, the Government and Invictus Energy have agreed to consolidate the Petroleum Production Sharing Agreement (PPSA) and the Petroleum Exploration Development and Production Agreement (Pedpa) into a unified and streamlined legal framework. This landmark decision […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        },
        {
            "title": "Action  packed  Easter football fiesta",
            "url": "https://www.chronicle.co.zw/action-packed-easter-football-fiesta/",
            "content": "Fungai Muderere, Zimpapers Sports Hub\n\nITS set to be an action-packed Easter football fiesta and Bulawayo giants, Highlanders, will be right at the heart of it.\n\nBosso make the long trip to Mhondoro for a potentially explosive Castle Lager Premier Soccer League (PSL) Week Seven clash against former champions, Ngezi Platinum Stars at Baobab Stadium, on Easter Monday.\n\nThe extended weekend promises a feast of local football, with fans across the country expected to turn out in numbers for games that will stretch from Good Friday right through to Easter Monday.\n\nIn the build-up to their Mhondoro assignment, Highlanders are coming off a morale-boosting 10 win over traditional rivals CAPS United at Barbourfields Stadium  a result that re-energised their early season momentum.\n\nZimbabwe senior national team assistant coach Takesure ChiragwiChiragwi\n\nNgezi, meanwhile, are smarting from a surprise 21 defeat to PSL returnees TelOne  a result that underscored the unpredictability of this seasons race.\n\nTelOne, one of the early pacesetters, will spend their Easter Saturday in the Eastern Highlands where they take on in-form Manica Diamonds at Mutares Sakubva Stadium.\n\nTriangle United will look to make home advantage count when they host Yadah Stars at Gibbo Stadium, while CAPS United aim to bounce back when they welcome Bikita Minerals at Rufaro Stadium.\n\nOn Easter Monday, Chicken Inn  guided by seasoned gaffer Joey Antipas  will be buoyed by their first win of the season after edging Dynamos 10. They will host Simba Bhora at Luveve Stadium in a fixture expected to draw a strong local turnout.\n\nAt Ngoni Stadium, MWOS will clash with a wounded Dynamos side, still licking their wounds after that narrow defeat in Bulawayo.\n\nKwekwe United are set to host Herentals College at Bata Stadium while big-spending newcomers Scottland FC face a stern test against former champions FC Platinum at Rufaro Stadium.\n\nLast Weekends Results\n\nTelOne 21 Ngezi PlatinumBikita Minerals 21 Triangle UnitedYadah 11 Scottland MabvukuFC Platinum 00 Green FuelZPC Kariba 50 Kwekwe UnitedSimba Bhora 14 Kwekwe UnitedManica Diamonds  (No result listed)Highlanders 10 CAPS UnitedHerentals 01 MWOSDynamos 01 Chicken InnEaster Weekend FixturesGood Friday: GreenFuel v ZPC Kariba (GreenFuel Arena)Easter SaturdayTriangle United v Yadah Stars (Gibbo Stadium)Manica Diamonds v TelOne (Sakubva Stadium)CAPS United v Bikita Minerals (Rufaro Stadium)Easter MondayChicken Inn v Simba Bhora (Luveve Stadium)MWOS v Dynamos (Ngoni Stadium)Kwekwe United v Herentals College (Bata Stadium)Scottland FC v FC Platinum (Rufaro Stadium)Ngezi Platinum Stars v Highlanders (Baobab Stadium)\n\n@FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-13-at-22.31.14-1.jpeg",
            "description": "Fungai Muderere, Zimpapers Sports Hub IT’S set to be an action-packed Easter football fiesta and Bulawayo giants, Highlanders, will be right at the heart of it. Bosso make the long trip to Mhondoro for a potentially explosive Castle Lager Premier Soccer League (PSL) Week Seven clash against former champions, Ngezi Platinum Stars at Baobab Stadium, […]",
            "time": "09:31",
            "date": "16 Apr 2025"
        }
    ]
}