{
    "news": [
        {
            "title": "Dambo joins Chiefs",
            "url": "https://www.chronicle.co.zw/dambo-joins-chiefs/",
            "content": "Innocent Kurira, Online Reporter\n\nBULAWAYO Chiefs have secured the signature of Zibusiso Dambo, the captain of Arenel, in a major boost to their midfield ahead of the new season. His arrival adds to a growing list of experienced players joining the club, as Chiefs work to strengthen their squad following relegation from the Top-flight league last year.\n\nIn addition to Dambo, Chiefs have also secured the services of other notable players, including Kelvin Madzongwe from Zebra Revolution, Malvin Mkolo from Simba Bhora, and Arthur Musiyiwa from Dynamos. Chiefs have also welcomed goalkeeper Matripples Mleya, defender Polite Mwenda, and Gabriel Dlodlo, along with the addition of promising striker Tatenda Ushe, who netted 15 goals in Division One last season.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jbnjnjnn.jpg",
            "description": "Innocent Kurira, Online Reporter BULAWAYO Chiefs have secured the signature of Zibusiso Dambo, the captain of Arenel, in a major boost to their midfield ahead of the new season.  His arrival adds to a growing list of experienced players joining the club, as Chiefs work to strengthen their squad following relegation from the Top-flight league […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Suspected $280 000 copper thieves released on bail",
            "url": "https://www.chronicle.co.zw/suspected-280-000-copper-thieves-released-on-bail/",
            "content": "Trish Mukwazo,[emailprotected]\n\nEIGHT men accused of stealing 60 metres of armoured copper cable worth over US$280 000 from the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) Richmond substation have been granted bail.\n\nRonald Moyo (32), Qhubekani Nyathi (28), Kudakwashe Ndlovu, Eddie Mishiri Dube (20), Tafadzwa Ncube (18), Sydney Moyo (22), Prince Ntonga (35), and Simon Chamhudze (36) appeared before Bulawayo regional magistrate Joseph Mabeza, facing charges of contravening a section of the Electricity Act. They were each granted ZWG6 000 bail and remanded to February 12.\n\nThey are being represented by Mr Tinashe Runganga of Tanaka Law Chambers\n\nThe prosecutor Mr Dominic Moyo, said the accused broke into the ZETDC Glenville substation in Richmond suburb at around 8pm on January 25. They allegedly used a ladder to gain entry before employing a hacksaw and bolt cutter to cut the cables.\n\nOnce inside, they used a hacksaw and bolt cutter to remove 60 metres of 185mm-squared, three-core armoured copper cable, which was used to distribute electricity to Richmond suburb, said Mr Moyo.\n\nThe case came to light when Ntonga and Chamhudze were caught with 92kg of copper, leading to an additional charge of possessing copper cables without a licence. Their arrest led to a full scale investigation, which resulted in the arrest of the other accused persons.\n\nPolice later discovered burnt armoured copper cables inside a Toyota Hilux driven by Ntonga and Chamhudze. A ZETDC engineer confirmed that the stolen cables were essential for electricity distribution.\n\nThe total value of the stolen and burnt cables was US$283 000. Upon their arrests, police recovered overhead copper cables, a makeshift ladder, bolt cutter and Toyota Hilux used in the alleged crime.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/02/bail.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com EIGHT men accused of stealing 60 metres of armoured copper cable worth over US$280 000 from the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) Richmond substation have been granted bail. Ronald Moyo (32), Qhubekani Nyathi (28), Kudakwashe Ndlovu, Eddie Mishiri Dube (20), Tafadzwa Ncube (18), Sydney Moyo (22), Prince Ntonga (35), and […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Ex-Zimbabwe Saints chairman takes wife to court over alleged abuse",
            "url": "https://www.chronicle.co.zw/ex-zimbabwe-saints-chairman-takes-wife-to-court-over-alleged-abuse/",
            "content": "Trish Mukwazo,[emailprotected]\n\nFORMER Zimbabwe Saints chairman, Lazarus Magwaro (83), has taken his wife, Molly Magwaro (73), to court, accusing her of physically abusing him.\n\nMolly of Morningside suburb in Bulawayo, on Tuesday appeared before Bulawayo magistrate Abednico Ndebele, facing a charge of physical abuse. She was remanded out of custody to February 19.\n\nThe prosecutor, Ms Josephine Gurazhira said the alleged incident occurred on January 29 at around 11am, while the couple was receiving counselling from three officers at their home.\n\nDuring the session, Molly allegedly sprang from her seat and slapped Lazarus on the head, causing him to fall.\n\nLazarus had invited the counselling officers from Mhlahlandlela Government Complex in an effort to resolve their marital issues. Following the assault, a police report was made, leading to Mollys arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com FORMER Zimbabwe Saints chairman, Lazarus Magwaro (83), has taken his wife, Molly Magwaro (73), to court, accusing her of physically abusing him. Molly of Morningside suburb in Bulawayo, on Tuesday appeared before Bulawayo magistrate Abednico Ndebele, facing a charge of physical abuse. She was remanded out of custody to February 19. The […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Miss SA launches education initiative for people with disabilities",
            "url": "https://www.chronicle.co.zw/miss-sa-launches-education-initiative-for-people-with-disabilities/",
            "content": "Miss South Africa (SA) Mia le Roux has launched a programme to empower individuals living with disabilities by offering them opportunities for education and skills development.\n\nWhen I was crowned Miss SA last year, I dedicated myself to being a voice for those who, like me, have experienced the challenges of being differently-abled and feeling excluded, said Le Roux.\n\nHer passion for inclusivity has been at the forefront of her reign, and it was a natural progression for her to launch the Mia Le Roux Movement.\n\nThe movement aims to advocate for South Africas estimated four million deaf individuals while raising awareness about the many forms of exclusion that persist in society.\n\nIt became my mission to break barriers for all who are excluded, whether by ability, poverty, gender or location, she said.\n\nI am proud today to announce an exciting and impactful collaboration between the B4i Academy and Initiative of the B4i project alongside the Mia Le Roux Movement to empower disabled communities through education, said Le Roux.\n\nThe collaboration brings an opportunity for skills development through learnership programmes that will benefit people living with disabilities.\n\nLe Roux said: The partnership with the B4i Academy, a Seta and QCTO accredited training institution, aims to enhance educational opportunities for people with disabilities across South Africa through learnership programmes that enable skills development. I am honoured to make a difference in the lives of those who often face significant barriers.\n\nLe Roux said the learnership programmes are designed to provide pathways to dignity, independence and economic participation for people who struggle to access education and employment due to their disabilities.\n\nThe initiative is a step towards a more inclusive society where everyone, regardless of their abilities, has access to opportunities to succeed. Our purpose is to change lives, she said.\n\nThe pilot programme for the partnership kicked off in October last year, and successfully facilitated 120 learnerships.\n\nToday we are officially launching our first public learnership application campaign. Application tour opened on February 1 and closes on February 28.\n\nLe Roux also outlined the application requirements: You need to apply with a motivation letter explaining why you should be chosen, that you have South African citizenship, are in the age range of 18 to 45, have completed grade 10, the ability to read and write in English, and a doctors letter confirming your disability.\n\nOn successful completion of the programme, all learners will receive an NQF 2-5 accredited qualification, making them employable in a wide range of industries from business administration to sales.\n\nI cant wait to walk this journey with you, said Le Roux.\n\n TimesLive\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/yiuuuuuuuuuu.jpg",
            "description": "Miss South Africa (SA) Mia le Roux has launched a programme to empower individuals living with disabilities by offering them opportunities for education and skills development. “When I was crowned Miss SA last year, I dedicated myself to being a voice for those who, like me, have experienced the challenges of being differently-abled and feeling […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Tanzania to host joint EAC-SADC summit on Congo crisis",
            "url": "https://www.chronicle.co.zw/tanzania-to-host-joint-eac-sadc-summit-on-congo-crisis/",
            "content": "Tanzania will host a joint summit of two regional blocs to which the Democratic Republic of Congo belongs, signaling a new step to try and find common ground on the crisis caused by a war between M23 rebels and the Congolese army.\n\nThe meeting will bring together the Southern African Development Community (SADC) and the East Africa Community (EAC) on Friday and Saturday and will discuss the conflict in the Eastern Democratic Republic of Congo, a statement from the State House Nairobi said.\n\nThis follows an agreement between the Chairman of SADC chair, President Emmerson Mnangagwa of Zimbabwe, and EAC counterpart, President William Ruto of Kenya\n\nPresident Samia Suluhu Hassan has graciously agreed to host the summit to deliberate on the situation in Eastern DRC, President Ruto said.\n\nHe said President Felix Tshisekedi (DRC) and President Paul Kagame (Rwanda)have confirmed attendance at the meeting that will be preceded by a ministerial meeting on Friday before the Heads of State convene on Saturday.\n\nThe meeting will take place following the decision by both regional blocs during separate meetings held last week to discuss the conflict in eastern Congo.\n\nRuto confirmed that he has engaged President Cyril Ramaphosa (South Africa), President Yoweri Museveni (Uganda), and President Hassan Sheikh Mohamud (Somalia) who have confirmed participation at the extraordinary summit.\n\nThe EAC under the chairmanship of President Ruto held a virtual meeting on Wednesday where they resolved to engage with the SADC leaders who also held their summit on Friday in Harare, Zimbabwe.\n\nThe 16-nation bloc SADC, which includes the DRC, resolved to meet with its East African counterpart 8-member EAC  to discuss the conflict in eastern DRC between the government and M23 rebels.\n\nThe recent eruption of lashes has seen hundreds of thousands displaced as the Congolese rebels vow to march on for more territory, despite condemnations from regional organisations such as the African Union, and the European Union.\n\nDRC is a member of the SADC and the East Africa Community, or EAC, while Rwanda is an EAC member.During the Friday SADC summit, President Mnangagwa, who is the chairman of the SADC, said, I am confident that the concrete decisions adopted today will further propel forward the joint ongoing efforts to find lasting solutions to restore peace and normalcy in the eastern Democratic Republic of the Congo.\n\nDRC President Tshisekedi did not attend an EAC meeting earlier in the week. He did not attend Fridays SADC meeting, either, but was said to be following it online.Nation.Africa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-1.jpg",
            "description": "Tanzania will host a joint summit of two regional blocs to which the Democratic Republic of Congo belongs, signaling a new step to try and find common ground on the crisis caused by a war between M23 rebels and the Congolese army. The meeting will bring together the Southern African Development Community (SADC) and the […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Coldplay’s Music of the Spheres tour sets record for highest attendance",
            "url": "https://www.chronicle.co.zw/coldplays-music-of-the-spheres-tour-sets-record-for-highest-attendance/",
            "content": "With over 10.3 million tickets already sold and eight months of touring still left to go, British band Coldplay has broken the record for highest attendance for a music tour. The Music of the Spheres Word Tours total attendance exceeds Taylor Swifts The Eras Tour. For now, Eras Tour remains the highest- grossing music tour at $2,077,618,725.\n\nOn the weekend of 2526 January, Coldplay performed the largest-ever stadium show of the 21st century in Ahmedabad, India. More than 223,000 fans attended the show across the two nights.\n\nA fan who attended Coldplays concert in Ahmedabad told us the record-breaking show was mesmerizing. She described the atmosphere as being a conduit to experiencing the bands music meaningfully.\n\nThe stadium is massive and you really feel like a little speck when youre in there, she told us. [That] worked out really well with their setlist because a lot of songs require you to be in a mindset where youre one with the crowd.\n\nWhen the band started playing Human Heart , the sixth song on the Music of the Spheres album, a couple shared their wholesome proposal.\n\nIts an incredibly moving song, the fan told us. Both of them had rings for each other because they had both planned to propose on the same day which was very sweet.\n\nThe tour commenced in March 2022 with a show in Costa Rica, marking Coldplays first ever show in the country. The bands next show will take place in April in Hong Kong, followed by Seoul before heading to the United States.\n\nPlaying live and finding connection with people is ultimately why we exist as a band, the group said when they announced the tour. Weve been planning this tour for years, and were super excited to play songs from across our whole time together.\n\nThe Music of the Spheres album came out in 2021 and was a UK Number 1 album within two weeks of its release.\n\nColdplays latest tour adds itself to the lists of some extraordinary concerts that have claimed Guinness World Records titles. To list a few, Outside Lands broke the record for highest-grossing music concert in 2019 and in 2010, Bon Jovis Circle Tour set the record for the most expensive concert VIP packageThough Music of the Spheres is the second-highest grossing tour after the Eras Tour, Coldplay will be performing through September. If the band crosses $2,077,618,725 in terms of overall gross, it could take over the Eras Tour as the highest-grossing tour ever.Guinness World Records\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/coldplay-6678.jpg",
            "description": "With over 10.3 million tickets already sold and eight months of touring still left to go, British band Coldplay has broken the record for highest attendance for a music tour. The Music of the Spheres Word Tour’s total attendance exceeds Taylor Swift’s The Eras Tour. For now, Eras Tour remains the highest- grossing music tour […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mr Nambini explores emotional turmoil in ‘Uzobuya’",
            "url": "https://www.chronicle.co.zw/mr-nambini-explores-emotional-turmoil-in-uzobuya/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nSouth Africa-based Zimbabwean musician Mr Nambini has kicked off 2025 with his latest project, an Afro-pop and dancehall fusion track titled Uzobuya, featuring the talented Fab G Umshanakagogo and Altag.\n\nProduced by T-Flow Da Producer, the track delves into the emotional turmoil many experience after losing loved ones.\n\nUpon its premiere on Skyz Metro FM, Uzobuya won two challenges against other new releases, securing a spot in the Top 20. On Khulumani FM, the track currently sits at number 14, while it has also made its way onto Breeze FMs Top 20. In neighbouring South Africa, Uzobuya ranks at number 18 on Demag Radios Top 20 hits.\n\nSpeaking from abroad, Mr Nambini shared that the song aims to soothe the hearts of those dealing with emotional heartbreak.\n\nUzobuya is a heartfelt track that explores the pain of broken promises and the emotional struggle of losing someone who was meant to stay. Whether its about a fractured relationship or a loved one lost to illness despite hopeful assurances, the song resonates deeply with anyone who has experienced loss, he said.\n\nOn collaborating with Fab G Umshanakagogo, Mr Nambini said:\n\nIve always admired Fab Gs style, and his music catalogue is incredibly rich. One day, I reached out to him with an idea, and after listening to it, he agreed to collaborate.\n\nHe also spoke about working with Altag, saying: I first discovered Altag when he was being profiled on Earground. I loved his energy and decided to bring him on board for this track.\n\n Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jukukui.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com South Africa-based Zimbabwean musician Mr Nambini has kicked off 2025 with his latest project, an Afro-pop and dancehall fusion track titled Uzobuya, featuring the talented Fab G Umshanakagogo and Altag. Produced by T-Flow Da Producer, the track delves into the emotional turmoil many experience after losing loved ones. Upon its premiere on […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Police nab 5 suspects, including one female, over ZESA transformer vandalism",
            "url": "https://www.chronicle.co.zw/police-nab-5-suspects-including-one-female-over-zesa-transformer-vandalism/",
            "content": "Ronald Mpofu, Online Reporter\n\nThe police have confirmed the arrest of five suspects for vandalising a 100kW transformer at Mazezuru Secondary School in Mutoko.\n\nPhillip Chitawa (43), Steven Nyakabau (31), Patson Gurupira (28), Clayton Nyakatonje (24), and Mary Ngono (33) were arrested on 23 January 2025, resulting in the recovery of 60 kilograms of copper windings.\n\nAt the time of arrest, the suspects were found with various tools, including two bolt cutters, a shifting spanner, and two kitchen knives. A Toyota Chaser (registration number ADD 1539), which allegedly served as their getaway vehicle, was impounded by the police.\n\nThe suspects are also linked to a case of vandalism of a ZETDC transformer which occurred at Chingwena Secondary School, Nyamapanda, in December 2024, read the police statement on X.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Police-wanted-edit-by-Ronald-Mpofu-copy-1-copy.jpg",
            "description": "Ronald Mpofu, Online Reporter The police have confirmed the arrest of five suspects for vandalising a 100kW transformer at Mazezuru Secondary School in Mutoko. Phillip Chitawa (43), Steven Nyakabau (31), Patson Gurupira (28), Clayton Nyakatonje (24), and Mary Ngono (33) were arrested on 23 January 2025, resulting in the recovery of 60 kilograms of copper […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Chirewa joins Huddersfield Town",
            "url": "https://www.chronicle.co.zw/chirewa-joins-huddersfield-town/",
            "content": "Innocent Kurira, Online Reporter\n\nAS the January transfer window drew to a close, Huddersfield Town made a significant move to strengthen their attacking options by announcing the loan signing of 21-year-old Tawanda Chirewa from Premier League side Wolverhampton Wanderers.\n\nThe highly regarded Zimbabwean international joined the club until the end of the 2024/25 season, a move that both the club and the player were eager to make happen.\n\nChirewas arrival marks an exciting new chapter in his career. Born in Chelmsford, England, he began his youth career at Ipswich Town before moving to Wolverhampton Wanderers in September 2023. His journey with Wolves saw him quickly rise through the ranks, making eight Premier League appearances, and even playing in the fierce Black Country derby against West Bromwich Albion. His international debut for Zimbabwe in March 2024 was another milestone in what looked set to be a bright future.\n\nHaving spent the first half of the 2024/25 season on loan at Derby County in the Sky Bet Championship, Chirewa returned to Wolves only to find himself on the move again.\n\nI am delighted to be here and feel blessed to have been given the opportunity to join such a big Club ahead of a really important part of the season. I have heard amazing things from Nigel and Joe about what its like to play here, the facilities, coaches and the supporters, and cant wait to experience all of that for myself.\n\nThere were a few different options available to me, but coming to Huddersfield Town always felt like the right decision, said Chirewa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gjgjghjh.jpg",
            "description": "Innocent Kurira, Online Reporter AS the January transfer window drew to a close, Huddersfield Town made a significant move to strengthen their attacking options by announcing the loan signing of 21-year-old Tawanda Chirewa from Premier League side Wolverhampton Wanderers. The highly regarded Zimbabwean international joined the club until the end of the 2024/25 season, a […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        },
        {
            "title": "Yadah FC part ways with coach Ruzive",
            "url": "https://www.chronicle.co.zw/yadah-fc-part-ways-with-coach-ruzive/",
            "content": "Fungai Muderere,[emailprotected]\n\nCASTLE Lager Premier Soccer League side Yadah has parted ways with their head coach Thomas Ruzive.\n\nThe Miracle Boys announced their divorce with gaffer in a statement that was released on Tuesday.\n\nYadah FC wishes to inform the concerned football fraternity that recently they mutually parted ways with coach, Thomas Ruzive. Ruzives disciplinarian tendencies, shrewd tactics and professionalism shall be dearly missed. Yadah FC is grateful for the memories created in 2024 when Ruzive was the mentor of the team, said Yadah.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/SDXSX.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw CASTLE Lager Premier Soccer League side Yadah has parted ways with their head coach Thomas Ruzive. The Miracle Boys announced their divorce with gaffer in a statement that was released on Tuesday. “Yadah FC wishes to inform the concerned football fraternity that recently they mutually parted ways with coach, Thomas Ruzive. Ruzive’s […]",
            "time": "20:39",
            "date": "04 Feb 2025"
        }
    ]
}