{
    "news": [
        {
            "title": "WATCH: From border flanks to Zimra warehouses, Seized smuggled goods fill Condep to rafters",
            "url": "https://www.chronicle.co.zw/from-border-flanks-to-zimra-warehouses-seized-smuggled-goods-fill-condep-to-rafters/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE Container Depot (CONDEP) in Bulawayo loudly attests to the Governments unwavering resolve to combat illicit tarade.\n\nWarehouses in the city are brimming with a staggering array of confiscated items such as vehicles, stoves, refrigerators, alcohol, diapers, and many more goods all seized during a relentless crackdown on smuggling during the festive season.\n\nThe persistent multi-agency task forcecrackdown led by the Ministry of Industry and Commerce endeavours to stem the flow of illegal imports that threaten local industries and undermine the national economy.\n\nThe taskforce also comprises the Zimbabwe Republic Police, Reserve Bank of Zimbabwe, Zimbabwe Revenue Authority (Zimra), and Consumer Protection Commission.\n\nPermanent Secretary for Presidential Affairs and Devolution Eng Tafadzwa Muguti (third from left) and other stakeholders inside the Zimra Container Depot (CONDEP) full of confiscated goods in Bulawayo on Thursday\n\nThe Government has announced that the anti-smuggling campaign is now standard procedure, directing implementing agencies to execute it assertively and impartially to stop the influx of illicit goods and protect local industries.\n\nThe taskforce is tactically intercepting smuggled goods at various entry points. Notably, intercity buses carrying suspected contraband have been detained in some of the latest operations.\n\nEngineer Tafadzwa Muguti, the Permanent Secretary forPresidential Affairs and Devolution, witnessed the sheer scale of the problem first-hand when he toured the CONDEP on Thursday.\n\nThe warehouses were teeming with diverse items from household appliances like stoves and refrigerators to everyday necessities like diapers, alcohol, and tinned foods.\n\nMuguti reinforced that no one is above the law in the fight against illicit trade, emphasising that the crackdown would not tolerate any exceptions.\n\nThe anti-smuggling campaign is now a lifestyle. We are simply saying zero tolerance to smuggling. We are aware that we have porous borders as a country. We are aware that some villages along the borders are now leasing out storage space to smugglers and we will deal with them decisively, said Muguti.\n\nWe are aware that we also have political elements who tried to politicise His Excellencys vision of rebuilding the economy by stopping smuggling. We can confirm that this has nothing to do with politics.\n\nHe said going forward, all confiscated goods would be forfeited to the State.\n\nAs you can see behind me, we have hundreds of thousands worth of alcohol in this warehouse, which was confiscated, and as you saw outside, we have many vehicles, which were also impounded for smuggling. What we are simply saying, according to the Customs and Excise Act, is that anyone who tries to import, export, introduce, or anyhow put something onto the Zimbabwean economy or market without following the relevant customs and excise laws, the law says they are stealing from the State.\n\nSo, we are done with the days when we confiscate things and ask you for a nice, friendly fine in return.\n\nFrom now going forward, you smuggle something into the country, we catch you, you forfeit it to the State, and that becomes a State asset. Essentially, when people are smuggling, its a criminal enterprise, Muguti said.\n\nHe questioned the logic of smuggling electric stoves which are readily available in the country.\n\nWhy should we have refrigeration being smuggled into the country when weve got companies in Bulawayo and Harare, which are now manufacturing these appliances?\n\nWe are not saying we do not want imports. You can import,but we want a fair playing ground. Pay your dues and pay your taxes.\n\nAccording to security officials, smugglers are avoiding the border and using the border flanks.\n\nThey then load the goods into intercity buses or cargo trucks in Beitbridge before transporting them to various destinations in Zimbabwe. To enhance surveillance, authorities are deploying high-tech security systems, including drone surveillance.\n\nGoods can be held for 60 to 90 days under the Customs and Excise Act. Various disposal methods, including rummage sales and destruction, are also used to clear warehouses.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/FDGFG.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  THE Container Depot (CONDEP) in Bulawayo loudly attests to the Government’s unwavering resolve to combat illicit tarade.  Warehouses in the city are brimming with a staggering array of confiscated items such as vehicles, stoves, refrigerators, alcohol, diapers, and many more goods all seized during a relentless crackdown on smuggling during the festive season. […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "WATCH: ‘It was traumatic but a blessing’, Luthuli Dlamini opens up",
            "url": "https://www.chronicle.co.zw/watch-it-was-traumatic-but-a-blessing-luthuli-dlamini-opens-up/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nLUTHULI Dlamini, known for his prolific online presence, presented a persona of a man who could talk for hours.\n\nHowever, as he sat down for an interview with the Saturday Chronicle at Banff Lodge in Bulawayos Hillside suburb, he quickly established some ground rules.\n\nPersonal life? Off-limits! Family matters? Strictly private! And rumours circulating about his financial status? Absolutely not for discussion!\n\nBorn 59 years ago at Mpilo Central Hospitalin Bulawayo, Dlaminis life took an early turn when he emigrated to the United Kingdom at the tender age of one. Returning to Zimbabwe in 1974, he spent his formative years shuttling between Mhlahlandlela and his rural roots in Emanxeleni, Ntabazinduna.\n\nDlaminis journey then led him to South Africa, where he quickly rose to prominence through his captivating performances in various television productions.\n\nWhile his portrayal of Stan Nyathi in the popular eTV soapie, Scandal, undoubtedly garnered him widespread recognition, it might surprise many to learn that this isnt necessarily his most cherished role.\n\nNo, it would be the role of Christopher in astage play I did at the LibertyTheatre on Mandela Square in Sandton. This is because the play was based on an award-winning book in London that I had never read before.\n\nWhen I was offered the role, I was drawn to it because it was challenging and complex, it was a lovely piece for all of us. I understand why he won the award because it was a lovely piece, he said.\n\nAsked to encourage the new generation of thespians, Dlamini said: Continue to love what you do, and continue being passionate about chasing new ideas, and education. Be passionate about innovation, ingenuity, (and) invention in your craft. Be knowledgeable about your craft. Love your craft so much so that you wake up in the morning and Google more about your craft.\n\nLearn more and have the attitude that youll never stop learning. Things are developing so fast in the world today so you have to keep up.\n\nThe seasoned actor expressed his optimism about the potential of Zimbabwes film industry. After spending years abroad, Dlamini is eager to reconnect with the creative scene in his home country.\n\nEver since Ive been here, Ive seen a lot of potential within the film sector and other facets of art. As I was watching a play at the Bulawayo Theatre, I could see how invested these young ones are. Theres so much more we could do to help them, said Dlamini.\n\nQuizzed on whether he will feature in a soapie soon, Dlamini cheekily said: Yes, no, definitely, well . . . look, I dont know. The space Im currently in and have always been in is that I will work until the day I die, doing what I love doing.\n\nDlamini is a spiritual, scientific, and astronomic man.\n\nIsintu is a religion that existed before all other religions and it worked. Those values of humanity, empathy, I feel like we are losing and that they arent emphasised enough in other secular religions. Isintu sethu is as old as the stars and was developed because it worked for its society, that is, abantu.\n\nDlamini, who spent over two decades in the UK specialising in dramatics and theatre before moving to South Africa, reflected on his roots with pride.\n\nFrom a young age, it has all been theatre, stage work. Acting was what everyone else was doing. I tried football, but it didnt work out. I was always acting, he reminisced.\n\nHis first acting gig was at the Bulawayo Theatre in the 1970s, where he played two roles in the play The Baobab Tree, being a wise owl and the monkey.\n\nWith an impressive career that includes memorable roles in popular television series such as Scandal, Jacobs Cross, and Generations, Dlamini has become a well-respected figure in the South African entertainment industry. Though he doesnt know much about the current crop of actors now, Dlamini vehemently remembers the Harare International Festival of the Arts (Hifa).\n\nHis parents, grounded in culture, nurtured Dlamini on the education ethos where Dlamini and his siblings were taught to value their culture and education. He is not just an actor; he is also an engineer, scientist, and a devoted fan of Highlanders.\n\nDlamini revealed that he is set to participate in this years Imiklomelo kaDakamela, hosted by Chief Mbusi Bekithemba Dakamela of Nkayi on April 4-5.\n\nIm even embarrassed that its been this long since I was away. I need to come back and reacquaint myself with the scene. Theres a lot I have to learn and see, he said.\n\nDespite refusing to comment about rumours that he is homeless, Dlamini previously addressed the claims on Instagram.\n\nIm fine, I promise Im not homeless. Be sure of your sources of information. Dont compromise your integrity for 15 cheap minutes of fame.\n\nRecently, Dlamini assumed a new role as an independent film producer, an endeavour which saw him release The Cold Father, a move he described as traumatic.\n\nIt was traumatic in the sense that Ive never wanted to be behind the camera. I left paperwork in business when I left the corporate world and decided to be an actor. It was traumatic in the sense that it was also by force but a blessing in disguise because Ive learnt so much about my industry, he said.\n\nWith the nicely-trimmed lawn serving as a backdrop to our conversation, Dlamini alluded to such a place as a perfect specimen to his ideal resting spot after a long day at work.\n\nI relax in a garden, a pretty garden like this. With friends, family, I love my grandchildren, just the serenity of a beautiful environment. I look for this kind of serenity, he said.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gghddghghgh.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com  LUTHULI Dlamini, known for his prolific online presence, presented a persona of a man who could talk for hours.  However, as he sat down for an interview with the Saturday Chronicle at Banff Lodge in Bulawayo’s Hillside suburb, he quickly established some ground rules.  Personal life? Off-limits! Family matters? Strictly private! And rumours […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "Artistic traffic drums: Beautifying Bulawayo’s streets",
            "url": "https://www.chronicle.co.zw/artistic-traffic-drums-beautifying-bulawayos-streets/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nIN a bold move that merges art and urban planning, the Bulawayo City Council (BCC) has introduced an innovative approach to traffic management.\n\nStrategically placed large drums now regulate traffic flow at major intersections such as Robert Mugabe Way and 8th Avenue, as well as Fort Street from 9th to 11th Avenue.\n\nHowever, local artists envision more  they want to transform these functional structures into vibrant works of art.\n\nBy commissioning artists to embellish the drums, the citys streets can become not only safer and more efficient but also a reflection of Bulawayos rich cultural heritage.\n\nNational Art Gallery of Zimbabwe in Bulawayo regional director, Silenkosi Moyo, underlined the significance of involving local artists in such projects.\n\nThis collaboration will foster growth in the citys creative sector, showcasing Bulawayos artistic talent and solidifying its reputation as Zimbabwes cultural heart, she said.\n\nClifford Zulu, an independent curator who brought up the idea on social media and received positive feedback, said the idea of incorporating art into the citys yellow traffic control barricades stems from a desire to blend functionality with creativity, making Bulawayos urban landscape both practical and visually appealing.\n\nThese bollards serve an essential role in traffic control and are prominently visible throughout the city.\n\nWhile I understand that their installation was carefully considered within budgetary constraints, as creatives in the city, we see the potential for these structures  whether temporary or permanent  to also contribute aesthetically to the urban environment.\n\nClifford Zulu\n\nIn the future, a collaborative approach could be explored. Local artists could be invited to design traffic barricades that are not only functional and effective but also visually engaging. This would bring about a sense of pride and ownership within the community, transforming these utilitarian objects into cultural symbols that celebrate Bulawayos artistic and cultural identity, said Zulu.\n\nZulu said BCC has taken commendable steps to uphold the citys reputation as Zimbabwes cultural hub.\n\nInitiatives such as providing platforms for cultural events and supporting heritage preservation demonstrate their commitment. However, there is still room to expand and strengthen this role to meet the evolving needs of the cultural sector. For example, the establishment of an Arts and Culture Office is a positive step toward engaging with creatives, but more can be done. Integrating public art projects into urban planning, such as incorporating artistic elements into infrastructure like traffic barricades or public spaces, can further enhance Bulawayos identity as a creative city.\n\nAdditionally, the BCC could prioritise the allocation of spaces for artists to create and exhibit their work. This would help elevate the citys cultural profile both nationally and internationally. By promoting public-private partnerships, supporting community festivals, and embedding art into infrastructure projects, the BCC is ensuring that Bulawayo continues to thrive as a vibrant centre of cultural expression and innovation, said Zulu.\n\nRenowned visual artist, Picasso, said he believes incorporating art into public spaces can be a great way to enhance the aesthetic appeal of the city and promote local talent.\n\nIf BCC were to consider such a project, I think it would be a wonderful opportunity for local artists to showcase their skills and contribute to the beautification of our city. It could also help foster a sense of community pride and identity. Murals on traffic control drums can be a fantastic way to add vibrancy and character to Bulawayos CBD. Not only can they help to beautify the area, but they can also provide a unique platform for local artists to showcase their talents.\n\nBy engaging local artists to create murals on these drums, BCC can help to promote the citys rich cultural heritage and support the local art community. Additionally, the murals can also serve as a form of social commentary, raising awareness about important issues affecting the community.\n\nI think this initiative has the potential to make a positive impact on the citys aesthetic appeal and cultural landscape. Id be excited to see how local artists can transform these ordinary traffic control drums into vibrant works of art, said Picasso.\n\nArts enthusiast and Culxure Mag founder, Kudakwashe Takundwa, said: The idea of engaging artists to create murals on the yellow traffic drums is brilliant and aligns with global trends where art is used to beautify urban spaces. These drums, often seen as dull or purely functional, can become vibrant canvases that reflect the culture, identity, and creativity of Bulawayo, he said.\n\nFollow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/29-2.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com IN a bold move that merges art and urban planning, the Bulawayo City Council (BCC) has introduced an innovative approach to traffic management. Strategically placed large drums now regulate traffic flow at major intersections such as Robert Mugabe Way and 8th Avenue, as well as Fort Street from 9th to 11th Avenue. […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "Endorsed by the best",
            "url": "https://www.chronicle.co.zw/endorsed-by-the-best/",
            "content": "Stanford Chiwanga,[emailprotected]\n\nTHE Zimbabwe Football Association (Zifa) elections kick off today and not surprisingly the excitement and anticipation within the football community are palpable.\n\nAmong the candidates vying for the presidency, Nqobile Magwizi and Kenny Ndebele stand out as the ideal team to lead Zifa into a new era of transparency, development, and success. The dynamic duo stands out as the perfect team to usher Zifa into a transformative era of transparency, development, and unparalleled success.\n\nKenny Ndebele\n\nMagwizi brings a wealth of knowledge and expertise to the table, with impressive academic credentials that include an MPhil in Development Finance from the University of Stellenbosch, an MSc in International Banking and Finance from the University of Salford, and a Certificate in Property Development and Investment from the University of Cape Town. This strong educational foundation is complemented by his extensive experience in finance, marketing, and property development, making him well-equipped to handle the complexities of football administration.\n\nNdebele, with over 25 years of experience in football administration, has held various influential positions, including his tenure as the CEO of the Premier Soccer League (PSL). Under his leadership, the PSL saw significant growth and stability, securing substantial sponsorship deals and enhancing the leagues overall profile.\n\nMagwizi and Ndebeles involvement in football administration is marked by significant achievements. As a board committee member of the Sports and Recreation Commission (SRC), Magwizi has played a crucial role in shaping national sports policies and overseeing strategic marketing and commercial initiatives. His efforts have been instrumental in securing substantial sponsorship deals for major football clubs, namely Highlanders and Dynamos, ensuring their financial stability and promoting grassroots development.\n\nSimilarly, Ndebeles ability to navigate the complexities of football administration and his strategic approach to marketing and commercial initiatives have been instrumental in the PSLs success.\n\nTogether, they form a formidable team with a shared vision for the future of Zimbabwean football.\n\nOne of Magwizi and Ndebeles core beliefs is that the future of Zimbabwean football lies in nurturing young talent. Magwizi has been actively involved in grassroots football, co-organising the Hellenic Junior Football Tournament and supporting youth football clubs like Christ Kingdom Rumhuma Football Club. His dedication to grassroots development ensures that young players have the opportunities and resources they need to succeed, which is vital for the long-term growth of the sport.\n\nNdebele, too, has been actively involved in nurturing young talent, recognising that the future of Zimbabwean football lies in the hands of the youth.\n\nHis dedication to grassroots football ensures that young players have the opportunities and resources they need to succeed, which is vital for the long-term growth of the sport.\n\nMagwizi and Ndebeles vision for Zifa is built on the principles of transparency, integrity, and good governance.\n\nThey advocate for a football administration that is accountable and fair, restoring trust among fans, players, and sponsors. Their commitment to these values is evident in their plans to implement proper governance frameworks, conduct regular audits, and ensure that all stakeholders have a voice in the decision-making process. This approach will create a more inclusive and democratic environment within Zifa. Recognising the importance of international collaboration, Magwizi and Ndebele aim to forge strategic partnerships to uplift Zimbabwean football infrastructure.\n\nBy engaging with international partners, they plan to secure investments that will modernise stadiums and facilities, making them safe and welcoming for fans and players alike. These upgrades will not only enhance the spectator experience but also attract international matches and tournaments, putting Zimbabwe back on the global football map.\n\nMagwizi and Ndebele are strong advocates for the inclusion and empowerment of women in football.\n\nThey believe that promoting womens involvement in the sport is not just about equality but also about enriching the game with diverse perspectives and talents.\n\nTheir initiatives to support womens football will create more opportunities for female athletes, coaches, and administrators, contributing to the overall development of the sport in Zimbabwe.\n\nTheir candidacy has received significant endorsements from key figures in the football community. Their ability to secure major sponsorship deals and their vision for the future of Zimbabwean football have earned them the support of influential stakeholders. These endorsements are proof of their capability and the confidence that the football community has in their leadership.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/zzzzzzz.jpg",
            "description": "Stanford Chiwanga, stanford.chiwanga@chronicle.co.zw THE Zimbabwe Football Association (Zifa) elections kick off today and not surprisingly the excitement and anticipation within the football community are palpable. Among the candidates vying for the presidency, Nqobile Magwizi and Kenny Ndebele stand out as the ideal team to lead Zifa into a new era of transparency, development, and success. […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "COMMENT: BCC must adopt proactive NOT reactive approach to infrastructure management",
            "url": "https://www.chronicle.co.zw/comment-bcc-must-adopt-proactive-not-reactive-approach-to-infrastructure-management/",
            "content": "THE Bulawayo City Council (BCC)s recent decision to clear the clogged drainage system after the rains subsided rather than before the onset of the rainy season has left many residents scratching their heads. Why did BCC wait until it was too late?\n\nIt is shocking that the council waited until the rains had receded and some houses had already been flooded and property damaged before moving in to clear the clogged drainage system. This reactive approach is not only ineffective but also raises questions about the councils commitment to proactive management of the citys infrastructure.\n\nFurthermore, the council workers decision to leave the extracted dirt, bottles, plastic, and other waste piled next to the drainage system is astonishing. This is not only an eyesore but if there were to be another heavy downpour, the same waste could be washed back into the drainage system, where it would clog the trenches, rendering the councils efforts futile.\n\nIt is a never-ending cycle of clearing and re-clogging, which is not only impractical, but also a waste of resources.\n\nThe cost of neglecting the clogged drainage system is enormous. Floods not only damage property but also expose residents to a variety of diseases.\n\nThe failure of BCC to dispose of waste properly is no less serious. When waste is left to rot, it creates a breeding ground for vermin, which can spread diseases.\n\nWe cannot help but wonder what was so difficult about clearing the clogged system and collecting the trash. Is it a lack of resources, expertise, or simply a lack of will?\n\nThis is not an isolated incident. BCCs failure to cut long grass along major residential area roads is another example of its reactive approach to management. It would seem the council is waiting for accidents and robberies to occur before taking action. This is unacceptable and puts the lives of residents at risk.\n\nWe urge BCC to adopt a proactive approach to managing the citys infrastructure. This includes regular maintenance of the drainage system, clearing of waste, and cutting of long grass. These are not complex problems that require extensive resources or expertise. They are simple, low-hanging problems that require a commitment to effective management and a willingness to take action before disasters occur.\n\nIts absurd to think that council workers cannot maintain the citys infrastructure unless residents complain. Its the councils basic responsibility to ensure that Bulawayos infrastructure is functioning correctly by clearing garbage, cutting long grass and maintaining drains regularly.\n\nResidents should not have to beg for these basic services. Continued neglect of such basic services could result in businesses moving elsewhere, and residents also relocating, leading to a vicious cycle of decline.\n\nBCC should take its responsibilities seriously and act promptly to rectify the glaring problem of the clogged drainage system and proper disposing of waste. The council must step up and fulfil its obligations to the residents of Bulawayo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/bcc.jpg",
            "description": "THE Bulawayo City Council (BCC)’s recent decision to clear the clogged drainage system after the rains subsided rather than before the onset of the rainy season has left many residents scratching their heads. Why did BCC wait until it was too late? It is shocking that the council waited until the rains had receded and […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "Pride Mpofu: The man who visited his own grave",
            "url": "https://www.chronicle.co.zw/pride-mpofu-the-man-who-visited-his-own-grave/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nPRIDE Mpofu (45) has endured a truly bizarre ordeal. In a twist of fate that borders on the surreal, he was declared dead and buried, only to discover the chilling truth 15 years later.\n\nThe bizarre saga began in 2008 when Prides aunt inexplicably agreed to allow her younger brother, Stanley Mpofu (born in 1971), to assume the identity of her nephew, Pride (born in 1980). The reasons behind this astonishing decision remain shrouded in mystery.\n\nPride Mpofu\n\nThe tragic consequences soon unfolded. Stanley, living under Prides identity, tragically passed away. Today, Pride finds himself in a Kafkaesque nightmare, stripped of his identity and forced to confront the chilling reality of his own burial. He struggles to obtain a new identity document, a bureaucratic hurdle compounded by the fact that two of his children remain undocumented, while his eldest, now in Grade Seven, is forced to use her mothers surname.\n\nPrides attempts to rectify this situation have been met with frustration. In 2012, while trying to obtain a new identity card at Efusi Primary School in Gwabalanda, he was met with disbelief. A Civil Registry Department officer informed him that records indicated he had died on February 27, 2010, and was buried on March 3, 2010, with a burial order issued by the Mpilo civil registry department.\n\nAdding to the bewilderment, Moonlight Funeral Services, who handled the funeral arrangements, confirmed that they had paid out a death benefit to Prides aunt, who was the beneficiary.\n\nThe mystery deepens further when one considers that Stanley possessed his own original birth certificate. Why, then, did he choose to assume Prides identity? And how did he manage to secure employment as Pride Mpofu at Clan Transport? These questions continue to plague Pride, leaving him trapped in a Kafkaesque nightmare of his own making.\n\nThey called me while I was still in South Africa and told me about their plan, but I flatly refused even though they persisted. They never gave me any reason why they were doing that. In 2008, I came home for a visit and decided to give my ID to my friend for safekeeping. I didnt want to take it to South Africa lest I lose it, said Pride.\n\nA few months after his return to South Africa, Pride got a call from his friend, a headmaster at a school in Matabeleland North, who told him that he was now being pestered by the paternal aunt and his uncle, constantly demanding the identity card.\n\nPride Mpofus burial order\n\nHe told me that they were always at his house, telling him that he had no right to keep my documents, after all, he was not even a member of our family. Eventually, he succumbed to pressure and surrendered the document to them.\n\nI was so hurt and angry about what they did. I phoned them, telling them that they must immediately return the document to my friend or give it to my maternal aunt. I asked my maternal aunt why they were doing that, but she didnt give me any answer, just telling me that I must not worry. I told her that many things may happen, including death, and what would they do when that happened, but she would hear nothing of it, said Pride.\n\nTrue to his word, Stanley passed away at Mpilo Hospital on February 27, 2010, but hospital authorities recorded that Pride was the one who died. The burial order, however, does not show the cause of death.\n\nSince I was not there, I am told that they went to Moonlight Funeral Services to claim since my aunt was a policyholder and her younger brother, one Pride, was a beneficiary. However, they presented his correct name, and the company refused to process the policy.\n\nUnjani malume?, Pride Mpofu seems to be asking as he sees his uncles grave for the first time\n\nThey returned a few days later, now having a different beneficiary in the name of Pride, and the policy was processed, he said.\n\nHe does not know what they said at the time of identifying the body because the person who was in the mortuary was certainly not him, but the funeral services company knew the person as Pride Mpofu. During the funeral service, all speakers were speaking of Stanley, including what was written on the grave signage.\n\nHowever, when Saturday Chronicle visited the grave in the company of Pride on Thursday, the signage was no longer there, and the grave is the only one with no signage and has grass growing over it.\n\nIts my first time coming here. I relocated from South Africa in 2019, and I have not had any zeal to come and see where my uncle was buried. Nevertheless, ngiyamxolela umalume ngoba usezilalele, and I hope he, too, regrets whatever he did, said a now emotional Pride at the graveside.\n\nBulawayo provincial registrar, Jane Peters, said the matter can only be solved if those at the centre of it admitted to their act through an admission of guilt form available at any police station.\n\nWhat we do here is we send fingerprints to the National Fingerprints Bureau (NFB), who then advise on the situation, but from what you have said, an admission of guilt form will be needed for us to reverse everything, but we obviously cant reverse death. What we see here is an act of criminality if what you are saying is really what transpired, said Peters.\n\nAn identity fraud expert said situations like this happen when someone has committed a serious crime and wants to evade justice. Identity fraud (also known as identity theft or crime) involves someone using another individuals personal information without consent, often to obtain a benefit.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/9-3.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw  PRIDE Mpofu (45) has endured a truly bizarre ordeal. In a twist of fate that borders on the surreal, he was declared dead and buried, only to discover the chilling truth 15 years later. The bizarre saga began in 2008 when Pride’s aunt inexplicably agreed to allow her younger brother, Stanley Mpofu (born […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "President to honour outstanding citizens",
            "url": "https://www.chronicle.co.zw/president-to-honour-outstanding-citizens/",
            "content": "Blessings Chidakwa,Harare Bureau\n\nPRESIDENT Mnangagwa is set to honour outstanding citizens and organisations this year, recognising their invaluable contributions to Zimbabwes growth and development.\n\nThis initiative is part of the Second Republics efforts to celebrate inspirational role models, personalities, and organisations that have made a significant impact on the country.\n\nNominations are now open for individuals and organisations deserving of this honour. The awards will acknowledge those who have provided exceptional service to the people and elevated Zimbabwes profile.\n\nLast year, President Mnangagwa conferred prestigious awards on seven individuals who excelled in various fields.\n\nThe recipients included Dr Misheck Sibanda, former Chief Secretary to the President and Cabinet, who received the Order of the Star of Zimbabwe in Platinum.\n\nDr Misheck Sibanda\n\nOthers recognised were Mr Sirizani Butau and Jubilee Utsiwegota with the Gold Cross of Zimbabwe, Peace Magaya and Luckmore Magaya with the Silver Cross of Zimbabwe, Mr Devnanda Popatial with the Royal Order of Munhumutapa, and the musical group Black Umfolosi with the Order of the Star of Zimbabwe in Bronze.\n\nIn a statement yesterday, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, called for nominations for conferment with honours and awards, inviting citizens to recognise and celebrate the achievements of deserving individuals and organisations.\n\nThe Government intends to award eligible and deserving Zimbabwean citizens across our range of Honours and Awards. The individuals should be luminaries who meet the eligibility criteria for the award under which they are nominated, he said.\n\nAmong the honours and awards is the Order of the Great Zimbabwe, to be conferred on Zimbabwes gallant sons and daughters for their supreme sacrifice in connection with the liberation, survival, and development of Zimbabwe.\n\nThe Royal Order of Munhumutapa will be conferred in honour of brothers and sisters from other states for their exceptional sacrifice and commitment towards the liberation and well-being of Zimbabwe as a nation.\n\nThere is also the Order of the Star of Zimbabwe series of medals, symbolising the yearnings and aspirations that propel Zimbabweans in their quest to achieve the highest possible goals in various spheres of human endeavour, making it a fitting honour for superlative achievements.\n\nThe National Historical Legacy Award will be conferred on Zimbabweans who have selflessly and relentlessly dedicated themselves to the preservation of Zimbabwes peace, order, sovereignty, integrity, and unity, thereby fostering the countrys socio-economic development.\n\nThere are also Bravery Awards, including the Gold Cross of Zimbabwe, awarded to members of the Uniformed Forces and civilians for conspicuous bravery in circumstances of extreme peril.\n\nIt is the highest award and heads the order of precedence, followed by the Silver Cross of Zimbabwe, awarded for conspicuous bravery in circumstances of great peril, and the Bronze Cross of Zimbabwe, awarded for acts of bravery in hazardous circumstances.\n\nCommendation Awards include the Robert Gabriel Mugabe Commendation Award for Service in Human Capital Development, conferred for outstanding, transformative service in human capital development that has opened up and achieved growth in new economic sectors while ensuring inclusivity.\n\nThe Joshua Mqabuko Nyongolo Nkomo Commendation Award for Community Development, Peace Building, and Fostering Unity is conferred for outstanding and consistent transformative service in improving livelihoods at the community level, engendering peace-making and fostering unity.\n\nThe Herbert Wiltshire Pfumaindini Chitepo Commendation Award for Justice and Human Rights is conferred for distinguished and consistent pursuit of justice and human rights for the greater good of humanity.\n\nThe Jairos Jiri Humanitarian Award is conferred on individuals who have worked and dedicated their lives to the betterment of humanity through rendering humanitarian service. It recognises the spirit of humanism exhibited by the recipient, while honouring the virtues of concern for the disadvantaged and vulnerable members of society.\n\nThe Medal for Meritorious Service is conferred on members of the Uniformed Forces and civilians for meritorious service to Zimbabwe or humanity at large.\n\nThe Commendation Medal is conferred on any person for a commendable act of bravery, commendable service, or continuous devotion to duty that deserves recognition.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ERYRFGDFGLG.jpg",
            "description": "Blessings Chidakwa, Harare Bureau PRESIDENT Mnangagwa is set to honour outstanding citizens and organisations this year, recognising their invaluable contributions to Zimbabwe’s growth and development.  This initiative is part of the Second Republic’s efforts to celebrate inspirational role models, personalities, and organisations that have made a significant impact on the country. Nominations are now open for […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "A CEO’s journey from Bosso to Scottland",
            "url": "https://www.chronicle.co.zw/a-ceos-journey-from-bosso-to-scottland/",
            "content": "SATURDAY Chronicles News Editor, Stanford Chiwanga (SC), recently had the opportunity to sit down with Ronald Moyo (RM), the newly appointed CEO of Scottland FC. In an engaging and insightful conversation, they discussed Moyos vision for the club, his strategic plans, and the challenges he anticipates. Below are some key excerpts from their interview:\n\nSC: Can you share a bit about your journey from Highlanders to Skyz Metro and now to Scottland FC?\n\nRM: My journey has been an exciting one. I began my career in football administration at Bantu Rovers FC before joining Highlanders FC, where I gained valuable experience and skills over an interesting six-year period. I then moved to Fairtalk Communications, where I continued to develop my expertise as a leader. Now, Im thrilled to be leading Scottland FC as their CEO, and Im looking forward to this new challenge.\n\nSC: How and why did Scottland FC approach and appoint you as their CEO?\n\nRM: I would like to assume the club was looking for a professional who is innovative, energetic, and ambitious, with experience and a track record in football administration. They sought someone with a background in club management, marketing, and communications. I am not perfect, but I believe I am not too far from the person the club needed to take up this challenge.\n\nSC: What motivated you to transition from media to football management?\n\nRM: My passion for football and my desire to make a meaningful impact on the sport drove my transition. Dr Lyton Ncube, one of my lecturers at Midlands State University, noticed my passion and took the time to sit down with me and convince me to make a career out of something I was passionate about. Thats where it all started. Along the way, I met people who further encouraged me to pursue sports administration as a career.\n\nSC: What is your vision for Scottland FC as it enters the top league?\n\nRM: My vision is to establish Scottland FC as a competitive and respected sporting brand. This can be achieved by building a strong squad to compete in the top-flight league, developing a loyal fan base, implementing a vibrant youth policy, and creating a sustainable business model that will ensure the clubs long-term success.\n\nSC: What do you foresee as the biggest challenges in your new role, and how do you plan to address them?\n\nRM: Managing expectations.\n\nSC: What are your short-term and long-term goals for the club?\n\nRM: In the short term, we aim to establish a competitive team, set up youth teams, develop our brand, and build a loyal fan base. Long-term, we envision Scottland FC becoming a dominant force in Zimbabwean football, competing for domestic and international honours, and building a sustainable business model to ensure the clubs commercial success.\n\nSC: How would you describe your management style, and how do you think it will benefit Scottland FC?\n\nRM: There are different styles of management, and I believe all are applicable in different situations and set-ups. However, I believe in a visionary style of leadership  where you mobilise people towards a vision. At Scottland FC, our leadership style is centred around a clear and compelling vision for the clubs future. We are committed to creating a culture of excellence, innovation, and teamwork that will drive our success on and off the pitch.\n\nSC: How do you plan to engage with the local community and fans to build a strong support base?\n\nRM: We will engage with the local community through outreach programmes, charity initiatives, and fan events. We are already leveraging social media and partly traditional media, as you have seen with our partnership with 3Ktv. We want to fully leverage traditional media and match-day experiences to build a loyal fan base.\n\nSC: Who or what has been your biggest inspiration in your career?\n\nRM: My biggest inspiration has been FC Barcelona president Joan Laporta. I have always been fascinated by his leadership style, his vision for the club, and his ability to balance the business and sporting aspects of the organisation. The way he transformed Barcelona into a global brand while maintaining the clubs values and traditions is truly inspiring. What I admire most about Laporta is his commitment to developing young talent, his focus on creating a strong team culture, and his willingness to take calculated risks to achieve success. His leadership has been instrumental in Barcelonas dominance on the pitch over the years, and I believe there are many lessons that can be applied to our own context at Scottland FC. While I have had the privilege of learning from local football administrators who have played a significant role in my development, Laportas vision, leadership, and achievements have been a constant source of inspiration for me.\n\nSC: What advice would you give to aspiring football managers and executives?\n\nRM: My advice would be to gain as much experience as possible, develop a strong network, and stay up to date with industry trends and best practices. Its also essential to be passionate, dedicated, and resilient in the face of challenges.\n\nSC: How do you see the future of football in Zimbabwe, and what role do you think Scottland FC will play in it?\n\nRM: I am optimistic about the future of football in Zimbabwe. With the emergence of new teams and investments in the sport, I believe we will see significant growth and improvement. Scottland FC will play a key role in this growth, competing at the highest level, developing young players, and contributing to the sports development.\n\nSC: Are there any plans to develop youth programmes or academies under your leadership?\n\nRM: Yes, we are committed to developing youth programmes and academies. We believe in investing in the next generation of players and providing opportunities for young Zimbabweans to develop their skidills and pursue their dreams.\n\nSC: Scottland has recently acquired a number of high-profile and experienced players. Given this significant investment in talent, do you believe the club has the potential to win the league in its debut season?\n\nRM: While we are happy with our technical team and our player recruitment, we are also realistic about the challenges that come with competing in the top flight. Our primary focus is on ensuring that we are well prepared and competitive in every match, and then we will take it from there.\n\nWe are not looking to make any bold predictions or put unnecessary pressure on our technical team. Our goal is to make a positive impact, learn from our experiences, and build a strong foundation for future success.\n\nUltimately, the league title is a lofty goal, but we will take it one step at a time and see where the season takes us.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/zzzzzzzzzzz.jpg",
            "description": "SATURDAY Chronicle’s News Editor, Stanford Chiwanga (SC), recently had the opportunity to sit down with Ronald Moyo (RM), the newly appointed CEO of Scottland FC. In an engaging and insightful conversation, they discussed Moyo’s vision for the club, his strategic plans, and the challenges he anticipates. Below are some key excerpts from their interview: SC: […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "All local authorities deserve strict surveillance",
            "url": "https://www.chronicle.co.zw/all-local-authorities-deserve-strict-surveillance/",
            "content": "Stephen Mpofu\n\nPerspective\n\nAh! Ah! Ah . . .\n\nHarare City Council, just a stones throw away from the nose and scanning eye of the headquarters of our government and now trending under the trade name rotten also shared by sections of workers at Zimbabwes second largest city, Bulawayo.\n\nIt surely makes every right-thinking person wonder if worse is not happening in councils away in the sticks and if thoroughgoing surveillances should not take place out there to flash out any rot perpetrated away from the range of the eye of Local Government Ministry in our capital city.\n\nIn fact, do ministry officials in Harare who surely rub shoulders with top workers in the city council there not smell the rot in the council under their nose for action to have been taken long, long ago before the corruption now being talked about in public spilled out of the bin, or are their noses and ears congested or are city council officials now being lambasted for the alleged ill deeds buddies of some ministry gurus?\n\nBut surely, should our State President be expected to scan local authorities in order to ferret out workers whose ill deeds tarnish the image of our Government and above that of our country abroad with potential investors remaining too close with their hard-earned money instead of planting it in our country for potential, handsome dividends?\n\nThat one city council executive earns a five-figure salary in a city suffering serious want in service deliveries surely makes any right-thinking person wonder if not worse happens in that council with ministry officials who surely must know every nitty-gritty of what goes on in council under their very eyes and noses.\n\nBulawayo City Council, where some officials have been arrested for alleged ill-deeds, deserves a commission of enquiry such as that which opened a can of worms in the city of Harare to flush out any more worms wriggling under cover of darkness.\n\nAs of now, who knows for sure without surveillance by commissions of enquiries if the exposed rottenness by some Bulawayo and Harare City Council employees is not the order of thingscrippling operations in smaller councils around the country to the peril of our Presidents philosophy: Nyika inovakwa nevene vayo/Ilizwe lakhiwa ngabaninilo/ A country is built (developed) by its owners.\n\nTherefore in this communicologists humble opinion, Members of Parliament out there in the countryside should not only work to retain support for their tenure in the August House but must also ensure that councils in their constituencies deliver on developmental issues and not grow pot-bellies by corruption.\n\nThe independence that Zimbabweans won from racist white colonial rule in 1980 should not be translated by corrupt workers anywhere in our country to mean independence from strict government rules against misdeeds.\n\nTo round it all up, Zimbabweans shouldshun corruption in every sector of our society as abominable and the devils work.\n\nThat way our Zimbabwean society will surely be regarded as a shining star in the global village, for all to emulate.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/04/Harare-City-Council-has-a-critical-role-to-play-in-infrastructural-rehabilitation-and-development-640x380.jpg",
            "description": "Stephen Mpofu Perspective Ah! Ah! Ah . . . Harare City Council, just a stone’s throw away from the nose and scanning eye of the headquarters of our government and now trending under the trade name “rotten” also shared by sections of workers at Zimbabwe’s second largest city, Bulawayo. It surely makes every right-thinking person […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        },
        {
            "title": "Mavis Muchena inspires women to thrive through education and mentorship",
            "url": "https://www.chronicle.co.zw/mavis-muchena-inspires-women-to-thrive-through-education-and-mentorship/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nCERTIFIED life, business, and wellness coach Mavis Tsamwise Muchena (42) remains steadfast in her commitment to empowering women and girls, tirelessly working to equip them with the knowledge, skills, and resources they need to thrive personally and professionally.\n\nIn an interview, Muchena highlighted that she believes every individual deserves access to opportunities, which is why she launched an initiative aimed at empowering women through business training, mentorship, and hands-on coaching.\n\nGrowing up, I was surrounded by strong, independent women who instilled in me the importance of education, hard work, and resilience. These values have shaped my passion for empowering women and girls, and Im committed to creating opportunities for them to thrive. My mum was also an entrepreneur, and I could watch her doing it so well, she said.\n\nHaving launched the Mavis Empowerment Programme in September 2024 in South Africa, Muchena revealed plans to scale the initiative to Zimbabwe, Zambia, and Africa as a whole.\n\nMavis Women Empowerment has exciting plans for expansion in 2025. The programme will be extended beyond South Africa to other countries, ensuring that even more women in Africa have access to the resources and support they need to thrive as entrepreneurs.\n\nAccording to Muchena, the Mavis Women Empowerment Programme kicked off an exciting new venture by offering practical training in the production of detergents, skincare products, and fragrances from scratch. The programmes included five in-person sessions that provided participants with the knowledge and skills needed to create high-quality, marketable products.\n\nThis hands-on training experience is designed to help women tap into the growing demand for eco-friendly cleaning and skincare products as well as fragrances while building sustainable businesses, she said.\n\nIn addition, Muchena believes her programme will contribute to shifting the mindset of young girls and women in Africa by providing them with access to education, mentorship, and economic opportunities.\n\nBy empowering them with the skills and knowledge they need to succeed, we can help create a more equitable and just society, she said.\n\nAfter completing her Ordinary Level in 1999, Muchena also did digital marketing courses with Google Coursera and Meta. She noted that her educational background has provided her with a solid foundation in entrepreneurship, marketing, and personal development, which has been instrumental in shaping her career and entrepreneurial journey.\n\nHaving a marketing company and a hair and beauty academy where she trains people on how to acquire skills in the beauty industry, Muchena said becoming an entrepreneur has given her the freedom to pursue her passions and create innovative solutions to real-world problems.\n\nSpeaking on the marketing company, she said after training people on various skills, including how to do digital marketing, those who cant or dont have time to do it themselves are on-boarded as clients, and they do marketing for their companies.\n\nMuchena lamented that navigating the complexities of funding and resource allocation has been one of the biggest challenges she encountered as an entrepreneur. She highlighted that another challenge is identifying the target market and turning leads into sales, citing that one can have a very good product, but putting it out and making sales is a challenge hence, she has spent most of her time acquiring knowledge on how its done. However, Ive learnt to be resilient and adaptable, and to seek out opportunities for collaboration and partnership, she said.\n\nShe further pointed out that she has learned that success is not a solo endeavour, but rather a collective effort that requires the support and contributions of many individuals.\n\nI have also learnt the importance of staying true to my vision and values, even in the face of challenges and setbacks, she said.\n\nBeing a single mother of three, balancing personal and professional life for her is all about prioritising self-care and setting clear boundaries.\n\nI make time for activities that nourish my mind, body, and soul, such as exercise, meditation, and spending time with loved ones. I am a single mother of three, and I understand that I have to play both roles of being a mother and father at the same time, she said.\n\nSharing her long-term goals, she said she envisions the programme expanding to reach more communities and providing a comprehensive range of products that are made in Africa for Africans.\n\nWe are planning to build plants around Africa where women will collectively make the products and share the overheads. We also want to stock our packaging in China so that we can get them cheaper and have a positive impact on our pricing, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/z-1.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com CERTIFIED life, business, and wellness coach Mavis Tsamwise Muchena (42) remains steadfast in her commitment to empowering women and girls, tirelessly working to equip them with the knowledge, skills, and resources they need to thrive personally and professionally. In an interview, Muchena highlighted that she believes every individual deserves access to […]",
            "time": "06:08",
            "date": "25 Jan 2025"
        }
    ]
}