{
    "news": [
        {
            "title": "WATCH: Help from the skies: Critically-ill child flown to Harare",
            "url": "https://www.chronicle.co.zw/watch-help-from-the-skies-critically-ill-child-flown-to-harare/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nJUST over two weeks ago, four-and-a-half-year-old Tatenda Machezera was a picture of health. But on a seemingly ordinary Sunday morning, December 22, 2024, a sudden and terrifying change occurred. Tatenda began complaining of a severe headache and dizziness, and within hours, her condition dramatically deteriorated.\n\nAlarmed by her nosebleeds and unexplained bleeding from the mouth, her grandparents swiftly rushed her from their home in Bulawayos Emganwini suburb to the nearest clinic in Nketa.\n\nThe picture shows Tatenda Machezera being airlifted from Bulawayo to Harare by HeliDrive crew.\n\nStaff at the local clinic referred the little girl to the United Bulawayo Hospitals (UBH), where her grandparents, Alexander Tirimboyi and Sphephile Ncube, began a near-fortnight stay at the referral health facility. This continued until yesterday afternoon when the ailing child was airlifted to Parirenyatwa Hospital in Harare.\n\nAccompanied by her granny, Ncube, young Tatenda will undergo a barrage of tests to determine exactly what she is suffering from  the type of disease that would render a healthy child bedridden and in excruciating pain.\n\nTatenda was born without any complications and was a healthy child until December 22 when she got sick to an extent that she was bleeding from the nose and mouth. We spent the festive season at UBH as doctors and nurses tried to figure out what exactly is wrong with our grandchild. The doctors suspect she could be suffering from bone marrow cancer, but they said its better she is transferred to Harare for more tests, said Tirimboyi.\n\nOn the right is Mrs Siphephile Ncube,Tatenda Machezeras grandmother\n\nJust before noon yesterday, UBH staff, patients, and visitors were taken aback by the sounds of rotor blades of an Ansat helicopter whirring in the air, announcing the arrival of the life-saving air ambulance in the city. The helicopter, a flying intensive care unit, is one of two air medical rescue service ambulances that will be stationed at UBH to offer swift medical responses for emergencies, such as the critically injured in road accidents.\n\nThe air ambulance will also be used to airlift patients from hard-to-reach areas, which would typically take hours to get to by road. Yesterday, HeliDrive Zimbabwe, the air ambulance service, had two passengers  little Tatenda and her granny, Ncube, who was travelling as the legal guardian of the child. Tatendas parents work in South Africa, and her mother is expected to be in Harare this evening.\n\nWe will know exactly what it is our granddaughter is suffering from when the doctors are done with the tests, said Tirimboyi.\n\nHe expressed his gratitude to HeliDrive Zimbabwe for the swift and efficient services that ensured young Tatenda was airlifted to the capital city at no cost to the family.\n\nThe staff at UBH has been amazing. Tatenda was in a bad state when she arrived at UBH, but they made sure that she gets the best assistance. Im grateful to HeliDrive Zimbabwe and the Government for introducing such a life-saving service that will ensure that patients are transferred from one hospital to another in a short space of time, he said.\n\nIt takes about six hours to drive from Bulawayo to Harare, a long drive that is not suited for someone in a precarious condition such as Tatenda. By helicopter air ambulance, the journey can be completed in slightly more than an hour. Typically, HeliDrive Zimbabwe carries a single adult patient, but in the case of a minor, a legal guardian is also accommodated in the air ambulance. In total, six people  Tatenda, Ncube, a medical doctor, a technician, pilot, and co-pilot  were aboard the air ambulance as it made its way into the skies to Harare.\n\nOnce the helipad at UBH is complete, the HeliDrive Zimbabwe crew  doctors, pilots, technicians, and other personnel  will be housed in a building at the hospital. The ideal response time is 15 minutes from the time a call is received to the air ambulance taking off, as explained to Saturday Chronicle by HeliDrive Zimbabwe accountable manager Ellemencia Nyasha Makosa last year. In the event that the air ambulance is summoned to an area where there is no helipad, the pilots use their discretion to use an open space such as a sports field to land.\n\nAir medical ambulances play a crucial role in healthcare by transporting patients, often in critical condition, from one location to another using aircraft specially equipped with medical equipment and staffed by trained medical professionals. The importance of air medical transport lies in its ability to provide rapid and efficient transportation for patients who require immediate medical attention or specialised care that may not be available locally.\n\nThe service allows for timely access to advanced medical facilities and specialised healthcare providers that may be located far away. This is particularly significant for individuals residing in remote areas or regions with limited healthcare resources. By bridging the geographical gap, air medical transport ensures that patients receive the necessary medical interventions promptly, potentially saving lives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dfgdfgfgf-680x380.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com JUST over two weeks ago, four-and-a-half-year-old Tatenda Machezera was a picture of health. But on a seemingly ordinary Sunday morning, December 22, 2024, a sudden and terrifying change occurred. Tatenda began complaining of a severe headache and dizziness, and within hours, her condition dramatically deteriorated. Alarmed by her nosebleeds and unexplained bleeding […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Journalist helps deliver baby in the dead of night",
            "url": "https://www.chronicle.co.zw/journalist-helps-deliver-baby-in-the-dead-of-night/",
            "content": "Chronicle Writers\n\nIN the dead of night, around 2AM on Christmas Eve, a chance encounter transformed two friends  journalist, Patrick Chitumba and Tinashe Chikwata  into unlikely heroes. After a night out in Mkoba 15 suburb, they were approached by Lewis Simbarashe Ngazire, a frantic husband pleading for help. His wife, Lilian (19), was in active labour and needed to be rushed to Mkoba Polyclinic in Mkoba 13 suburb.\n\nAs Ngazire recounted his wifes situation in the car, they both assumed they would simply drop her off at the nearby clinic, conveniently located en route to where Chitumba stays. However, upon arriving at the house, they met a scene of escalating panic. A group of concerned neighbours had gathered outside, urgently informing them that Lilians labour had progressed rapidly, and she was already in the throes of childbirth.\n\nWe quickly sprang into action, entering the room to find her in labour. Despite having no prior experience, we knew we had to act fast to ensure the safety of both Lilian and her baby. Perhaps it was the courage gained from our earlier evening out that prompted us to take charge of the situation, said Chitumba.\n\nChitumba with Ngazire\n\nWith a power outage plunging the house into darkness, they relied on their phone torches to navigate the situation. Though lacking medical training, Chikwata quickly called his friend, Dr Tafara Gapare, a medical practitioner at Claybank Hospital in Gweru, for emergency guidance.\n\nFollowing Dr Gapares instructions over the phone, Chitumba and Chikwata assisted with the delivery. They donned surgical gloves and, with the doctors precise directions, successfully tied and cut the umbilical cord.\n\nAfter this dramatic birth, the duo transported the exhausted mother and her newborn to Mkoba Polyclinic for further medical care, ensuring a safe and happy ending to their unexpected Christmas Eve adventure.\n\nGweru Mayor Councillor Martin Chivhoko commended the selfless act and quick thinking of the two friends, calling it a true Christmas miracle.\n\nIt was on the 24th around 2.30AM when a healthy baby girl was brought in by Patrick Chitumba and his friend. The baby was fit, pink and wrapped in a blanket. The mother and baby are fine and have since been discharged, he said.\n\nA recently released Zimbabwe Demographic Health Survey (ZDHS) has revealed alarming figures  nearly one in five births in the past five years occurred at home, a stark reminder of the challenges faced by the countrys healthcare system. Experts have unanimously condemned this figure as unacceptably high.\n\nThe report indicates that only 77 percent of births took place in healthcare institutions, a far cry from the desired level. When contacted for comment, Dr Gapare said he thought the call was random.\n\nIt is the first time I have received such a call. I am used to receiving such calls from hospitals that are equipped. So, I had to quickly think outside the box and assist by giving instructions to save the baby and the mother.\n\nA wave of relief washed over him when Chikwata called moments later, confirming their safe arrival at the clinic and reporting that both mother and baby were stable.\n\nI felt happy and relieved as well, said the doctor.\n\nDr Gapare stressed the importance of hospital deliveries, explaining that numerous complications can arise during pregnancy and childbirth, and having access to qualified medical professionals is essential for both mother and baby.\n\nBefore delivery, the baby might get distressed while in the womb. The mother might start bleeding while in labour and sometimes the baby might be big such that the mother will not be able to do a normal delivery. If such things are encountered, there will be a need for an emergency Caesarean section to save both the mother and the baby and this can only be done at a health facility, he said.\n\nChitumba, Chikwata and Lilian with the baby\n\nDr Gapare explained that immediately after delivery, it is crucial to separate the baby from the placenta using sterile equipment. This procedure is essential to prevent any risk of the baby bleeding to death.\n\nSoon after delivery, the mother will need to get medication known as oxytocin which helps to contract the womb so that she does not bleed to death. The mother also has to be examined to check if there are tears in the birth passage; these are very common. There are situations where the baby might become breathless soon after birth and, in such situations, oxygen will be needed. These are just a few examples to show that deliveries should be done in health facilities under supervision, he said.\n\nA wide smile spread across Lilians face as she spotted Chitumba and Chikwata approaching her lodgings in Mkoba 13. She was busy washing dishes outside their rented room, but her joy was evident.\n\nI remember you two; you are the ones who assisted me and my baby, she said with a smile on her face. Lilian shared that she married Ngazire early last year and that they had named their daughter Lilian Miguel.\n\nWe got married last year and we are very happy with this blessing from God. She is our first born. When asked how she felt while waiting for her husband to return with an ambulance or any vehicle, she said she tried to remain calm and avoid panicking.\n\nI tried not to panic or make unnecessary movements. I had this belief that everything would be fine and yes, everything went on well, she said. Chikwata remarked that divine intervention was at work during those early hours.\n\nImagine if we had not stopped for that man? He frantically stopped our vehicle as if he wanted to throw himself in front of our car. At the house, upon seeing that no assistance was coming, I had to call a medical doctor who assisted us. I am grateful that the mother and the baby are safe, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yjuyuyyyi.jpg",
            "description": "Chronicle Writers IN the dead of night, around 2AM on Christmas Eve, a chance encounter transformed two friends — journalist, Patrick Chitumba and Tinashe Chikwata — into unlikely heroes. After a night out in Mkoba 15 suburb, they were approached by Lewis Simbarashe Ngazire, a frantic husband pleading for help. His wife, Lilian (19), was […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "COMMENT: Zimbabwe starts New Year with a promise of life",
            "url": "https://www.chronicle.co.zw/comment-zimbabwe-starts-new-year-with-a-promise-of-life/",
            "content": "The local penal code has been transforming markedly over the past 30 years.\n\nFrom a largely punitive, tit-for-tat, an-eye-for-an-eye one, it is becoming increasingly corrective and rehabilitative.\n\nYes, it still sends the message to criminals that their ways are wrong and punishable, but at the same time, attempts to give them a second chance.\n\nIn 1996, the countrys first open prison for male convicts was opened at Connemara near Kwekwe. In June 2021, the Government opened the second such prison in Marondera, this one to serve female convicts.\n\nInmates in open prisons are allowed to visit friends and relatives on off-days and can host them; they wear personal clothes, cook for themselves and have keys to their prison rooms.\n\nIn addition, the Zimbabwe Prisons and Correctional Service (ZPCS) is intensifying educational and skills training for thousands of inmates. Some of them are actually working at MacDonald Bricks here in Bulawayo, earning wages part of which they can send out to their families.\n\nThe ZPCS also has regular open days on which prisons countrywide are opened for people to visit their jailed friends and relatives.\n\nIn December, Justice, Legal and Parliamentary Affairs Minister, Ziyambi Ziyambi said the Government is reviewing its laws with a plan to implement a parole system. This will allow, subject to one meeting a range of stringent conditions, a prisoner to be released before they complete their sentences.\n\nOn the whole, this model helps inmates to reintegrate into society more smoothly at the point of their release. It corrects and rehabilitates.\n\nOn New Years Eve, President Mnangagwa signed the Death Penalty Abolition Bill into law, ensuring the country joined a global movement that rejects capital punishment. This means that the 48 men who had been on death row have had their lives spared. Their punishments have now been commuted to life in jail.We have become the 24th African nation and 127th globally to scrap the ultimate penalty from its criminal code.\n\nComing almost 20 years since the last execution in the country and the ranks of the condemned growing to 62 by 2022 before falling to 48 now, we laud the Government for launching the country into the New Year with a promise of life.\n\nWe understand that some of us, especially those whose relatives were murdered in aggravating circumstances, would have felt a sense of justice being delivered if those who killed their relatives also got killed.\n\nThe case of Rodney Jindu, who murdered two people in Bulawayo in January 2017, dismembering and setting body parts of one of his victims on fire, comes to mind.\n\nWithout belittling the crimes that sent them to jail in the first place, we are of the considered view that no one deserves to lose their life on the basis of a court ruling. That is vindictive, cold and worse-than-animalistic. That does not make our society any different from the Jindu type.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/HTRTY.jpg",
            "description": "The local penal code has been transforming markedly over the past 30 years. From a largely punitive, tit-for-tat, an-eye-for-an-eye one, it is becoming increasingly corrective and rehabilitative. Yes, it still sends the message to criminals that their ways are wrong and punishable, but at the same time, attempts to give them a second chance. In […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Hildar Foromozo: Building fabulous and smart homes for women",
            "url": "https://www.chronicle.co.zw/fab-fabsmart-homes-how-it-all-started/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nHILDAR Foromozo, driven by the belief that every woman deserves a fabulous and stylish home, regardless of her financial circumstances, founded Fabsmart Homes in Bulawayo in 2019. This venture, born from a desire to empower women, offers a curated selection of high-quality kitchenware and luxurious blankets designed to infuse a touch of royalty into every home.\n\nLocated in one of the busiest shopping malls in Bulawayo, Ascot, Fabsmart has managed to create a database of more than 2000 women who have been sourcing different home items from Foromozo.\n\nHildar Foromozo collecting her order from Kango Products\n\nIn her explanation, Foromozo said her business idea came after losing a job from her former employer. Being a person who loved kitchen items, she owned multiple sets of kitchen utensils, and people started relying on her when they hosted parties and gatherings. This made her think of selling the wares she had in her house.\n\nShe then saw that people were willing to buy, and she came up with the idea to be a supplier of quality and classy items to fellow ladies so that they have fabulous and smart homes. She shortened this into Fabsmart Homes, a brand name for her business.\n\nThere was a time when I was unemployed, and I told myself I had to create a job for myself. But I asked myself, what business should I do? I looked around my house and I had pots in excess.\n\nI dont know if I can say I have a weakness or a soft spot for pots. Because of that, my friends would abuse that privilege, coming to my house and borrowing the pots when hosting parties and gatherings. Sometimes they brought my pots back burnt or soiled, so instead of borrowing them, I thought of selling the pots to them. So, I can say I started selling used pots, said Foromozo.\n\nFrom selling used pots, Foromozo opened her first shop in the CBD in 2019, where she could stock a few items since she didnt have enough capital. However, due to support from different platforms, she got tenders to supply some local hotels in Bulawayo, which was her major boost. Foromozo also said that during the Covid-19 lockdown, she approached a local pots producer, Kango Products, and opened a distributor account, which she then did well with.\n\nAfter Covid-19, business went down, and I came up with a club initiative, where ladies would pay whatever they could afford and collect their pots after they finished paying.\n\nhow Fabsmart Homes started\n\nThe initiative is to give every lady an opportunity to buy classy items for their home. An empowered woman is a happy woman, and it reduces chances of gender-based violence. I also managed to supply women with classy blankets in 2024, and if you joined the clubs last year, you have classy pots and blankets, and we are going to the next level, she said.\n\nTaking advantage of the information and experience she has with many ladies she worked with, Foromozo said this year she will engage different ministries and organisations to empower women with business ideas and initiatives so that they can own cars, houses, and sustainable businesses.\n\nWe have a database of about 2 000 women who are willing to be empowered and they are ready. We are not going to ask for exorbitant inputs, but we are going to ask them to avail themselves when we knock on their doors. We are not going to ask for money, because the little we have, we will try to work with it. Im not a public speaker, but what I know is Im good at talking and will convince ladies so that we do some impactful projects beyond blankets, said Foromozo.\n\nMeanwhile, Foromozo, who is a medical lab scientist at one of the local hospitals, has applauded the Second Republic led by President Mnangagwa, saying that it has come up with favourable policies that allow small businesses to flourish. She also said that President Mnangagwas initiatives to empower women will see them being empowered and create employment for others.\n\nI want to thank the Second Republic for affording such an environment to entrepreneurs. Its not rosy, just like every venture, there are obstacles here and there, but being small with the mind to start from the ground and having a Government with policies that allow us to create employment and opportunities for ourselves, as a woman, how was I going to be able to own a business?\n\nFabsmart Homes now\n\nThe policies are for the people, she said, and even ordinary Zimbabweans benefit from them. With these policies, I have managed to empower myself, employ more than five people in my name, and I have managed to empower other ladies, all thanks to President Mnangagwas Second Republic, she said.\n\nForomozo said her business is flourishing through e-commerce, which she also attributed to Government policies allowing everyone access to different social platforms used for business purposes. Now, she boasts a customer base across the country, which has seen her not bothered by opening branches in other places as she does her business online using online payment.\n\nIn the same vein, Foromozo has called upon potential business people to consider investing in Bulawayo, saying that the city still has the potential to become the countrys industrial and business hub.\n\nI want to call upon everyone who has an idea or a project to invest in the city. No one will provide jobs to our youths if we move and invest in other cities. Bulawayo was an industrial hub, and I believe the city still has that potential. I want to thank my friends and family who supported me to be where I am, and I want to thank my husband for his support. He believes in me, and for that, my phenomenal gift, Im grateful.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yujiuuiu.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com HILDAR Foromozo, driven by the belief that every woman deserves a fabulous and stylish home, regardless of her financial circumstances, founded Fabsmart Homes in Bulawayo in 2019. This venture, born from a desire to empower women, offers a curated selection of high-quality kitchenware and luxurious blankets designed to infuse a touch of […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Injury-hampered Williams fuels Zimbabwe to 86-run lead",
            "url": "https://www.chronicle.co.zw/injury-hampered-williams-fuels-zimbabwe-to-86-run-lead/",
            "content": "Brandon Moyo,[emailprotected]\n\nZIMBABWE secured a valuable 86-run first-innings lead on day two of the New Years Day Test against Afghanistan at Queens Sports Club, but the hosts couldnt help but ponder what might have been had talismanic all-rounder Sean Williams been fully fit.\n\nWilliams, visibly hampered by injury throughout his innings, made a crucial contribution, but his discomfort undoubtedly impacted Zimbabwes ability to fully capitalise on a strong start.\n\nThe team undoubtedly believes that a fully fit Williams could have significantly bolstered their first-innings total, potentially shifting the momentum of the match even further in their favour.\n\nWilliams has been nursing back pain since the opening day of the Test match and was forced to come in and bat at number nine. He scored a well-batted 49 runs off 52 balls before he was caught behind by Afghanistan wicketkeeper Afsar Zazai.\n\nWilliams, however, was not given out by the umpires but decided to walk. The 38-year-olds injury turned out to be a bad omen for the Chevrons, who could not take maximum advantage of Afghanistans batting woes. Zimbabwe had bundled out Afghanistan for just 157 runs but could not capitalise on their upper hand.\n\nChevrons celebrate a wicket\n\nWilliams injury on the first day turned out to be a sign of the batting struggles that would soon follow as they failed to take maximum advantage of their bowlers exploits. It was Williams, Sikandar Raza (61), and Craig Ervine (75) who had to save the day, with the other two scoring all-important half-centuries after the top-order batters failed to come to the party.\n\nSpeaking after the days play, head coach Justin Sammons said Williams knock was the difference maker between them getting a lead going into the second innings.\n\nThe impetus shifted when Sean came to the crease. Actually, Newman, when he came to the crease you could see the change in Craig, in the way he went about his business. When Sean came in, that partnership was key, and ultimately is the key and difference to us having a lead or not. And, Craig being able to come through and go through various stages of the game and to take the responsibility. It was good to see, said Sammons.\n\nHe said he was pleased with the character shown by Williams while he was playing in pain.\n\nOur medical team did a lot of work in trying to get him to the park today. We are going to have to continue doing that but its going to be tough because he is in a lot of pain. He showed his courage to go out there, he showed what hes about and what it means to him to play for Zimbabwe. We cant look too far ahead, we will take it step by step with him to try and get him into the best physical state, he said.\n\nThe Chevrons were in all sorts of trouble on 41/4 and the three seniors managed to help Zimbabwe reach a decent lead. Raza came in to bat at number four  in place of Williams who was struggling with back pain  and made the most of his return to red-ball cricket. The all-rounder, playing his first Test match since 2021, scored his ninth half-century in the format.\n\nRaza was bowled by Zia-ur-Rehman for 61 runs off 104 deliveries, putting an end to his 71-run fifth-wicket partnership with the skipper Ervine. Williams, coming in to bat at number nine, scored a gallant 49 runs off 52 balls as he looked unsettled in the middle due to back pain. After Williams fell, he received applause from the Afghanistan players.\n\nWilliams enjoyed a 73-run stand with the skipper, Ervine, who earlier had brought up his sixth Test half-century off 122 balls. The skipper, accelerating the innings, was the last to fall as he was caught on the boundary for a brilliantly batted 75 runs off 165 balls.\n\nDay-two resumed with Zimbabwe batting on 6/0, trailing by 151 runs. The Chevrons quickly started losing wickets with the first to fall on the day being Joylord Gumbie, caught behind for eight runs in the eighth over, leaving the team on 19/1.\n\nIn the next over, Takudzwanashe Kaitano was caught behind for a two-ball duck, a wicket which brought Raza into the middle. The third wicket was that of opener Ben Curran, who was trapped in front for 15 runs off 34 balls. At that point, Zimbabwe were on 36/3, trailing by 121 runs. After hitting one boundary, Dion Myers fell, caught behind for five runs from nine balls, leaving Zimbabwe trailing by 116 runs on the verge of a batting collapse.\n\nHowever, Raza and Ervine managed to play gritty innings, bringing Zimbabwe back into the game with a brilliant partnership. Raza was bowled in the 38th over, leaving the team on 112/5, trailing by 45 runs.\n\nThe wicket brought Brian Bennett into the middle and the youngster only added two runs to the board off 22 balls before he was caught. Newman Nyamhuri walked in to join Ervine in the middle and the teenage star managed to add 11 runs on the board before he was bowled by Rashid Khan with Zimbabwe now trailing by just 10 runs.\n\nWilliams limped in to bat at the time and by the time he walked off, Zimbabwes lead was now 63 runs. After a short rain delay, Richard Ngarava joined the skipper in the middle. Ngarava was bowled by Yamin Ahmadzai for one run in the 71st over with Zimbabwe now leading by 68 runs.\n\nErvine and Blessing Muzarabani managed to have a 14-run stand for the 10th wicket before the veteran captain fell. Rashid Khan finished with figures of 4/94 in 27,3 overs while Yamin Ahmadzai took three for 62 runs in 18 overs.\n\nThe Chevrons bowlers once again proved a class above as they took three wickets before stumps were called. Afghanistan were on 46/3, trailing by 40 runs after Muzarabani struck twice and Raza once before bad light brought play to a halt.\n\nMuzarabani took the wickets of Afghanistans openers, Abdul Malik (one run) and Riaz Hassan (11), while Raza bowled Hashmatullah Shahidi for 13 runs. Play resumes at 09:30 am today for the third day.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Sean-Williams.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com ZIMBABWE secured a valuable 86-run first-innings lead on day two of the New Year’s Day Test against Afghanistan at Queens Sports Club, but the hosts couldn’t help but ponder what might have been had talismanic all-rounder Sean Williams been fully fit. Williams, visibly hampered by injury throughout his innings, made a crucial […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Top of the class! Matetsi Victoria Falls ranked among world’s best hotels",
            "url": "https://www.chronicle.co.zw/top-of-the-class-matetsi-victoria-falls-ranked-among-worlds-best-hotels/",
            "content": "Leonard Ncube,[emailprotected]\n\nLUXURIOUS Matetsi Victoria Falls, located just outside the resort city, has earned a coveted spot on the 2025 Gold List, which highlights the worlds best hotels. This prestigious accolade reaffirms Matetsi Victoria Falls as a premier destination for discerning travellers.\n\nThe rating was conducted by Conde Nast Traveller, an esteemed international index that gathers responses from readers and travellers around the globe.\n\nConde Nast Traveller is celebrated as the tourism industrys longest-running and most prestigious accolade, symbolising excellence within the travel sector.\n\nThe five-star facility is located in the Matetsi Game Reserve, approximately 40km from Victoria Falls along the Zambezi River. It features unique stone structures reminiscent of the Great Zimbabwe Monument, with intricate stonework at the main gate and detached deck rooms, offering a blend of historical charm and modern luxury.\n\nThe rooms are constructed from stone, brick, mortar, and poles, with most floors covered in cosy carpets. What was once an old structure has been transformed over the past decade by the Gardiner family, who invested US$12 million to modernise and renovate the property, creating a highly sought-after destination.\n\nMatetsi Victoria Falls is likely the first hotel in the country to employ in-house game scouts, with the primary goal of protecting the environment and wildlife, which are key attractions for tourists. A decade ago, the over 55000-hectare private concession was decimated by poaching, with no wildlife remaining and the lodge itself in disrepair.\n\nThe Gardiner family took over the property, investing over US$12 million in refurbishment, including the installation of solar-powered boreholes. The lodge now boasts 16 suites and two family villas, all with stunning views of the Zambezi River.\n\nA diverse array of animal species, including four of the Big Five, now inhabit the sanctuary, making it one of the top destinations in Victoria Falls.\n\nMatetsi Victoria Falls private concession stretches over 15km along the Zambezi River, bordering Zambezi National Park to the east and extending towards Kazungula.\n\nThe proprietors hold a 25-year lease from the Zimbabwe Parks and Wildlife Management Authority, exemplifying the partnerships encouraged by the Government in its Vision 2030.\n\nThe facility has also developed a private airstrip and helipad for clients flying directly into the conservancy. It targets high-end travellers from Western countries, with world celebrities and royal families having stayed there.\n\nRenowned for its distinctly African exquisite interiors, Matetsi Victoria Falls offers the ultimate safari experience and an idyllic accommodation retreat. This makes it a preferred destination for high-ranking personalities and celebrities seeking privacy and a natural experience.\n\nBusinessman Wicknell Chivhayo recently stayed at the facility during a visit to Victoria Falls. This is not the first time Matetsi Victoria Falls has been recognised, as it consistently shines as a top destination, earning major accolades annually.\n\nThe facility was named among the top 15 resorts in the world in 2024 and was also voted among the top five facilities in Africa and the Worlds Best Africa Resort Hotel, based on Travel + Leisure Readers views in 2024.\n\nIn its latest study, Conde Nast Traveller readers choice 2024 named Matetsi Victoria Falls in the Gold List for 2025.Sara Gardiner, co-founder and representative of the Gardiner family that runs Matetsi Victoria Falls Lodge, expressed her joy at the recognition, which she described as a testament to the quality of service at the facility and the destination at large.\n\nWe are overjoyed to share the news that Matetsi Victoria Falls has been featured on the Gold List 2025; the definitive edit of the standout, best-of-the-best hotels around the globe as chosen by editors of Cond Nast Traveller magazine. It is a profound honour to receive this accolade in addition to being chosen as one of the best resorts in Africa by the magazines readers earlier [last] year, which followed our accolade in the Travel + Leisure Worlds Best Awards, where we were named the No. 1 Resort Hotel in Africa. It is a wonderful way to celebrate the hard work of our team who pour their heart, soul and warm Zimbabwean hospitality into bringing Matetsi Magic to life every day, said Gardiner.\n\nShe reflected on the Matetsi journey and paid tribute to clients and stakeholders. Gardiner noted that the accolade coincides with the hotels 10th anniversary since the Gardiner family first set foot on the land that would become the home of Matetsi Victoria Falls.\n\nWhat began as a dream has evolved into a thriving community  a team of over 200 now, dedicating themselves to working together to bring the vision to life. As 2024 draws to a close, were reflecting with deep gratitude on a year filled with milestones, including one of the ultimate in the travel industry, meaningful connections, and moments of true Matetsi Magic.\n\nCelebrating the land we love and continuing our conservation and community efforts, we are so thankful for the role each of you has played in our shared journey. We want to take this opportunity to extend our heartfelt gratitude to each and every one of you, our extended Matetsi family. Your continued support and encouragement energise us, and we feel this recognition is a celebration of the journey we are undertaking together, she said late last month.\n\nThe hotels secret to success has been its commitment to core values of Respect, Integrity, and Exceptional Hospitality  in every experience offered. It is such facilities that have made Victoria Falls, one of the Seven Natural Wonders of the World, a top-rated destination.  @ncubeleon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/2-1.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw LUXURIOUS Matetsi Victoria Falls, located just outside the resort city, has earned a coveted spot on the 2025 Gold List, which highlights the world’s best hotels. This prestigious accolade reaffirms Matetsi Victoria Falls as a premier destination for discerning travellers. The rating was conducted by Conde Nast Traveller, an esteemed international index […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "President promotes six ZNA Colonels to Brigadier General",
            "url": "https://www.chronicle.co.zw/president-promotes-six-zna-colonels-to-brigadier-general/",
            "content": "Columbus Mabika, Harare Bureau\n\nPRESIDENT Mnangagwa, who is also the Commander-in-Chief of the Zimbabwe Defence Forces, has promoted six Colonels in the Zimbabwe National Army to the rank of Brigadier-General.\n\nThe President made the promotions in terms of the Defence Act (Chapter 11:02) Section 20, as read with Statutory Instrument 257 of 2020, Section 19c, Sub-section 2c, which reads: His Excellency the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces may on the advice of the Minister of Defence, acting on the recommendations of the Commander Zimbabwe Defence Forces, reward any member for distinguished service or gallant conduct on active service by promoting an officer to a higher rank.\n\nThe six new Brigadier-Generals, who were promoted with effect from December 16, 2024, are Oscar Tshuma, Raban Nikisi, Benjamin Sabata, Passmore Taruodzera, Million Ndlovu and Lawrence Munzararikwa.\n\nSpeaking during the conferment of badges ceremony at Josiah Magama Tongogara Barracks in Harare yesterday, Commander Zimbabwe National Army (ZNA), Lieutenant-General Anselem Sanyatwe, said the nation cannot continue to overlook drug and substance abuse which has become a national security threat undermining economic activity as the country moves towards realising an Upper Middle Income economy status.\n\nLt-Gen Sanyatwe said drug and substance abuse was undermining the values and foundations of society and the military is not spared hence the need to take urgent action against the scourge.\n\nIn addition to the challenges of training and operational readiness, we must also confront a scourge of drug and substance abuse. The entire nation is grappling with the scourge and our organisation has not been spared, he said.\n\nThe threat of drug and substance abuse is a challenge we cannot continue to overlook. It undermines the very foundations and values of military effectiveness and the trust placed upon us by the entire nation.\n\nTurning to the promotions, Lt-Gen Sanyatwe said they were a testimony of hard work and loyalty. Promotions are characterised by any increase in duties and responsibilities, yours will not be an exception.\n\nThe promotions are a true testimony of selfless service you have shown to this country, he said.\n\nLt-Gen Sanyatwe called on the newly promoted officers to continue enhancing systems that ensure personnel are equipped not only to serve but to thrive. You must ensure that personnel under your command are empowered, encourage their growth and foster an environment where they can thrive, he said.\n\nThe country, Lt-Gen Sanyatwe said, was going through a transitional economic and institutional revitalisation phase which undoubtedly requires complementary efforts.\n\nBrig-Gen Sabata, who has been assigned to the position of Brigadier General Quarter Master Staff at Army Headquarters, said he will continue to be loyal to the Constitution and Command Establishment.\n\nHe thanked President Mnangagwa for the confidence he showed by elevating him to a higher rank.\n\nWe undertake to be always loyal to the Constitution and Command Establishment of the ZDF and at the same time we always undertake to serve the people of Zimbabwe. May I also take this rare opportunity to heartily thank Commander ZNA together with his Command Element for tirelessly mentoring us throughout our military career spanning several years.\n\nIt is through your tireless efforts and consistent guidance that we have got to where we are today, said Brig Gen Sabata. Brig-Gen Ndlovu concurred saying they will continue to work hard for the betterment of the army and nation at large.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/JKYUKU.jpg",
            "description": "Columbus Mabika, Harare Bureau PRESIDENT Mnangagwa, who is also the Commander-in-Chief of the Zimbabwe Defence Forces, has promoted six Colonels in the Zimbabwe National Army to the rank of Brigadier-General. The President made the promotions in terms of the Defence Act (Chapter 11:02) Section 20, as read with Statutory Instrument 257 of 2020, Section 19c, […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Make SADC chairmanship a game-changer",
            "url": "https://www.chronicle.co.zw/make-sadc-chairmanship-a-game-changer/",
            "content": "Stephen Mpofu\n\nTHE Southern African Development Communitys chairmanship must not be merely decorative but a catalyst for economic and social change in the regional bloc, making it a true game-changer.\n\nZimbabwe assumed the rotational chairmanship in August last year for a year, and one hopes that the country will proudly have something to show for its tenure when it vacates the chair this coming August. Otherwise, a countrys tenure in that chair translates into a vanity of vanities if other countries that assume the chair have nothing to emulate from their predecessors.\n\nFortunately, in Zimbabwe, we boast a policy by our Second Republic government that exhorts not only Zimbabwean nationals but also fellow SADC members and others elsewhere to improve their lot with: nyika inovakwa nevene vayo/ ilizwe lakhiwa ngabaninilo/ a country is built (developed) by its owners.\n\nIn his address at the National Thanksgiving and Dedication Service in Bulawayo on 29 December last year, the current chairman of SADC, President Mnangagwa, called on every Zimbabwean to play a part in building our nation.\n\nSADC\n\nThis obviously sets an example of the kind of indefatigable determination that other people in the regional bloc should demonstrate to transform their economic and social well-being, thereby enhancing national and ultimately regional peace and stability for people elsewhere in the global village to emulate.\n\nIn his Thanksgiving address, President Mnangagwa said: In the year ahead (this year), unflinching focus on our national vision, goals and aspirations, coupled with hard honest work; production and productivity; should see us live up to the instruction given to us in Genesis Chapter 1 verse 28:\n\nThen God blessed them, and God said unto them, Be fruitful and multiply; fill the earth and subdue it; have dominion over the fish of the sea, over the birds of the air, and over every living thing that moves on the earth.\n\nIt therefore behoves each and every government assuming the regional blocs chairmanship to spearhead political, economic, and social change in fellow member states by following Gods commandment as spelt out in the book of Genesis, as demonstrated above.\n\nAs such, and as the current SADC chair, Zimbabwe is determined to set an example for other states if reports about Harare, our capital city and seat of Government, finally coming up with long-awaited solutions to housing needs, as well as to water pollution solutions currently haunting people in the capital, not to mention residents elsewhere in Bulawayo where borehole water is reportedly contaminated.\n\nAbove that, our countrys agro-based economy seriously needs to be complemented industrially so that the current scourge of smuggled goods from outside the country comes to an end and free trade among SADC countries takes centre stage as regional economies grow. Let Zimbabwes agenda lead the way for the SADC bloc in everything stated above.\n\nIn the final analysis, therefore, each SADC countrys tenure in the blocs chair should be memorable by the tangible and lasting innovations it leaves behind for citizens of the region as part of the global village.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/President-Mnangagwa.jpg",
            "description": "Stephen Mpofu THE Southern African Development Community’s chairmanship must not be merely decorative but a catalyst for economic and social change in the regional bloc, making it a true game-changer. Zimbabwe assumed the rotational chairmanship in August last year for a year, and one hopes that the country will proudly have something to show for […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Traditional leaders and parents call for corporal punishment law revision",
            "url": "https://www.chronicle.co.zw/traditional-leaders-and-parents-call-for-corporal-punishment-law-revision/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE ongoing debate surrounding the use of corporal punishment in schools and homes in Zimbabwe has intensified, with traditional leaders and parents advocating for a revision of the current legislation that prohibits such disciplinary measures. Concerns have been mounting over rising levels of indiscipline among children, prompting calls for a more balanced approach that acknowledges both child rights and the importance of responsible behaviour. Critics argue that the current law excessively favours child rights while overlooking the crucial role of discipline in shaping responsible citizens.\n\nThe law prohibits corporal punishment, and two parents were recently jailed for violating childrens rights after they beat up their children as a way of disciplining them. Some parents have vowed to continue beating their children, saying it is an effective way of instilling discipline.\n\nTraditional leaders have also weighed in, saying the law is not in sync with Zimbabwean values and needs to be amended to allow parents to beat their children for correctional purposes. National Council of Chiefs president Chief Mtshane Khumalo said the country has leaned towards Western laws, neglecting the tried and tested systems that were used in disciplining children.\n\nIf you check, children are no longer as respectful as they used to be in the past. Parents and guardians used to beat up children, not as a way of harming them but to correct them. Children used to respect all the elderly people in the community like their parents, but not anymore. We have adopted a Westernised lifestyle where only biological parents can discipline children, and if anyone who is not their parent does, it becomes a problem. These days you cant even reprimand a neighbours child, said Chief Mtshane Khumalo.\n\nHe said there is a need to strengthen customary law as a way of upholding the countrys cultural beliefs. Chief Mtshane Khumalo noted that as it stands, Westernised general law is given credence over customary law.\n\nA child counsellor with Family of God, Bishop Etresh Hove, said while the law seems to protect children, religious leaders are concerned with the death of young people.\n\nWe are being called to bury young people; that is one of our major concerns as the church at the moment. These days we are burying a lot of children from the age groups of 16 to 25 years. We are connecting some of the deaths to children abusing drugs, being involved in abortion, unsafe sex among other things. Some of the children are joining gangs. The plot is lost at home and we believe that children should be disciplined. As the church, we dont spare the rod. Disciplining children starts at home. We cannot allow social media, WhatsApp, or television to dictate childrens behaviour, said Bishop Hove.\n\nHe also called on parents and guardians to learn to understand children, saying beating them is not the only way of disciplining minors.\n\nSheikh Ismail Abu from the Muslim community in Bulawayo said beyond disciplining children, parents need to be role models for their children.\n\nIn a nutshell, parents need to be role models for their children. At the moment, it does not seem like a lot of parents are being role models to children. There are few people that children can look up to. The home has an important role to play in the upbringing of children, said Sheikh Abu.\n\nHe said there is no harm in parents responsibly spanking their children.\n\nOne parent, Daniel Banda, said it only makes sense to continue beating up children as a way of reprimanding them. He said children will lose their way if parents and guardians do not beat them up.\n\nBeating children is a good way of disciplining them because if we dont do that, a lot of things will go wrong. We use moderate things like sticks; we dont have to use excessive force in disciplining children. We mean no harm to them and I dont think its fair to have parents being arrested for beating up their children, he said.\n\nAnother parent, Sibongile Moyo, said while she appreciates that the Government enacted a law to protect children, she will continue to administer corporal punishment on her own children.\n\nIm fully aware of what the law says but I also have a responsibility of raising a disciplined child. Im a mother of two; I find beating up my children very effective. When we beat them they easily comprehend what is right from wrong so I will continue to raise my children the best way I understand, she said.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/GHMJHJ.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE ongoing debate surrounding the use of corporal punishment in schools and homes in Zimbabwe has intensified, with traditional leaders and parents advocating for a revision of the current legislation that prohibits such disciplinary measures. Concerns have been mounting over rising levels of indiscipline among children, prompting calls for a more balanced […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "New era of fashion and culture: House of Lumiére lights up Blues",
            "url": "https://www.chronicle.co.zw/new-era-of-fashion-and-culture-house-of-lumiere-lights-up-blues/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nBULAWAYO ushered in the New Year with a dazzling debut: the House of Lumire (HOL). This ambitious venture, the vision of Australian-based entrepreneur Sikhanyisiwe Khanyi Moyo, officially opened its doors on New Years Eve, illuminating the city with a revolutionary concept.\n\nHOL is a multi-faceted oasis, seamlessly blending fashion, delectable cuisine, rejuvenating spa treatments, and impeccable salon services, promising to redefine the local entertainment and lifestyle landscape.\n\nVictoria Ncube\n\nLumire, a French word meaning light, perfectly encapsulated the launch event, which was a spectacular affair. The evening seamlessly intertwined music, modelling, and gastronomic delights, making it a night to remember.\n\nAmid the glamour and glitz, it was nine-year-old Vuyelwa Mhlanga who truly stole the show. With the poise of a seasoned professional, this Grade 4 student from Tennyson Primary School in Bulawayo made her debut on the runway, showcasing not just her talent, but also the potential of the next generation of models.\n\nWhile her peers typically engage in games, arts and crafts, reading, and team sports, Vuyelwa has shown a distinct love for the runway. Trained meticulously by renowned modelling choreographer Mthokozisi Phillip Masuku of Clout Inc, she captured the hearts of the audience with her confident strides and infectious smile.\n\nAs part of Sikhanyisiwe Moyos initiative to identify and nurture young talent, Vuyelwa showcased HOLs designs with remarkable poise. The event saw HOL Managing Director, Terrence Mduduzi Moyo, setting a warm and inviting tone for the evening. He welcomed guests and emphasised the vision of HOL as a hub where African and Western fashion coalesce.\n\nThe designers behind the stunning array of garments included local talents like Theodore Mhlanga, Mlungisi Moyo, Andy Nkiwane, Sibonginkosi Ncube, Siphiwe Nyoni, Nkosi Dube, Linton Nungu, and Lillian Chasokela, each bringing their unique flair to the runway under the watchful eye of their head designer, Khanyi.\n\nThe culinary experience was equally impressive, with head chef Blue and his talented team  Prisca, Susan, and Ndumiso  crafting exquisite dishes that tantalised the taste buds of attendees. The fusion of flavours was a testament to HOLs commitment to excellence across all fronts.\n\nVuyelwa Mhlanga\n\nNotable VIPs in attendance included former beauty queen Nokuthaba She Devil Sibanda-Manungo, who drew a loud cheer when she strutted down the runway, Miss Rural founder Sipho Mazibuko, Nomvelo Mpofu from Mbalabala, and the Miss Rural matron/chaperone, NaZivimbo.\n\nRural models Nomvula Maduze and Nomvelo Mpofu also fared well in diverse categories, including street-wear, ready-to-wear collections, business/office wear, cocktail looks for the ladies, evening classy looks, Afrocentric wear (African prints), and the national look incorporating national dress fabric.\n\nEntertainment overflowed at the launch, showcasing a line-up of up-and-coming acts that included MandyBird, Celine Dee, Crazy Masters, Trizzy Letwin, and Unspoken E, among others.\n\nThe infectious energy of the performers added to the celebratory atmosphere, further solidifying HOLs position as a cultural hub in Bulawayo. Directing proceedings were Mdala Foundations Dumisani Nkosi Mcijo-Nxumalo and Angie.\n\nFaizil Terry\n\nWith over 100 employees both Down Under and in Zimbabwe, HOL is poised to make a significant impact on the local market. In just a few short months since its soft launch, the brand has already dressed notable figures, including Deputy Minister for Sports, Recreation, Arts, and Culture, Emily Jesaya.\n\nSome of its designs have even graced the prestigious South African Music Awards (Samas), showcasing the global aspirations of this ambitious project.\n\nAs the night unfolded, it became clear that HOL is not just another business venture; it is a movement aimed at uplifting the local community by providing a platform for talent, creativity, and cultural exchange. The promise of bringing every product and service under one roof creates a sense of anticipation for what lies ahead.  Follow on X @MbuleloMpofu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Nomvula-Mafu.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com BULAWAYO ushered in the New Year with a dazzling debut: the House of Lumiére (HOL). This ambitious venture, the vision of Australian-based entrepreneur Sikhanyisiwe “Khanyi” Moyo, officially opened its doors on New Year’s Eve, illuminating the city with a revolutionary concept. HOL is a multi-faceted oasis, seamlessly blending fashion, delectable cuisine, rejuvenating […]",
            "time": "20:37",
            "date": "04 Jan 2025"
        }
    ]
}