{
    "news": [
        {
            "title": "ICT Deputy Minister Phuti tours Bulilima schools to assess dilapidated infrastructure",
            "url": "https://www.chronicle.co.zw/ict-deputy-minister-phuti-tours-bulilima-schools-to-assess-dilapidated-infrastructure/",
            "content": "Mthabisi Tshuma in Bulilima\n\nThe Deputy Minister of Information Communication Technology, Postal and Courier Services, Cde Dingumuzi Phuti, who is also the Member of Parliament for Bulilima, on Monday embarked on a two-day tour of schools in Bulilima District, Matabeleland South Province, to assess dilapidated infrastructure.\n\nThe tour, which began on Monday morning at Bambadzi Primary School in Bambadzi Ward, concluded on the first day at Muke Primary School in Masendu Ward. On Tuesday, Cde Phuti is scheduled to visit Phumuza Primary School in Natani Ward.\n\nThe primary objective of the tour is to engage stakeholders and ensure their full participation in resuscitating infrastructure at schools in the district.\n\nA dilapidated classroom block at Bambadzi Primary School in Bulilima District\n\nAt Bambadzi Primary School, one of the classroom blocks has been without a roof for some time after it was blown away. Additionally, the teachers cottages are in a poor state, prompting several educators to transfer to schools with better working conditions.\n\nThe tour at Bambadzi Primary School was attended by Bulilima District Schools Inspector Mr. Gobile Gobile, Bulilima District Schools Inspector official Mr. Sibanda, Headman Mbimba, Bambadzi Ward Councillor Mr. Sikhumbuzo Dube, the Bambadzi Primary School School Development Committee (SDC), local traditional leaders, and community leadership.\n\nA Bambadzi Primary School classroom block in Bulilima district that had its roof blown away by winds\n\nAt Muke Primary School, Chief Masendu, represented by his secretary Mr. Freeman Dube, was in attendance. The school also faces challenges, with one classroom block in need of roofing.\n\nCde Phuti emphasized the importance of collaborative efforts to address the infrastructure challenges, ensuring a conducive learning environment for students and better working conditions for teachers.\n\nMore updates to follow\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tyu5.jpg",
            "description": "Mthabisi Tshuma in Bulilima The Deputy Minister of Information Communication Technology, Postal and Courier Services, Cde Dingumuzi Phuti, who is also the Member of Parliament for Bulilima, on Monday embarked on a two-day tour of schools in Bulilima District, Matabeleland South Province, to assess dilapidated infrastructure.   The tour, which began on Monday morning at […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Five-year-old learner swept away by flooded stream in Matobo District",
            "url": "https://www.chronicle.co.zw/five-year-old-learner-swept-away-by-flooded-stream-in-matobo-district/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nAN Early Childhood Development (ECD-A) female learner at Donkwe Donkwe Primary School in Kezi, Matobo district in Matabeleland South was on Friday afternoon swept away by a flooded stream while on her way home from school.\n\nFive-year-old Promise Ncube was travelling together with two other five-year-olds after dismissing from school at midday before heavy rains pounced when they had traveled for about five kilometres from school to Sigwaza village.\n\nAccording to Matabeleland South acting police spokesperson, Assistant Inspector Stanford Mguni, the three learners started running towards home but along the road, they encountered a stream with running water.\n\nThe other two learners managed to cross but the now-deceased was swept away as she attempted to follow her colleagues.\n\nHer colleagues rushed home to inform their parents who quickly attended to the scene where they managed to retrieve the body some metres away from the road, said Ast Insp Mguni.\n\nHe said police attended the scene and took the body where it is awaiting a postmortem.\n\nInvestigations are ongoing but as police we continue to urge parents and guardians to always escort the little children especially during rain season. Even school authorities are urged not to release such young learners on their own, said Ast Insp Mguni.\n\nLast week, a three-year-old toddler from New Lobengula suburb, Sibusiso Methembe Moyo died after being swept away by floodwaters in a drainage system while on his way home with his elder brother from an errand they had been sent to by their mother.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/12/drowning_647_091816122313-647x363-680x380.jpeg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw AN Early Childhood Development (ECD-A) female learner at Donkwe Donkwe Primary School in Kezi, Matobo district in Matabeleland South was on Friday afternoon swept away by a flooded stream while on her way home from school. Five-year-old Promise Ncube was travelling together with two other five-year-olds after dismissing from school at midday before […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "So, you are wondering, why cardboard boxes on injured persons?",
            "url": "https://www.chronicle.co.zw/so-you-are-wondering-why-cardboard-boxes-on-injured-persons/",
            "content": "MANY Zimbabweans rely on social media platforms such as WhatsApp, Facebook and X for their news, exposing themselves to misinformation and biased sources. A recent social media frenzy centred around the use of cardboard boxes as makeshift plaster in first aid management following a tragic accident that claimed the lives of 25 people when an Urban Connect bus collided with a truck near the Lutumba tollgate along the Masvingo-Beitbridge highway.\n\nMajor talking point:The use of cardboard boxes on injured patients has sparked debate, with some experts defending the practice.\n\nIs there anything wrong with using cardboard box makeshift plasters?\n\nAccording to a Harare-based surgeon, it is common to use cardboard box slabs to immobilise an injured limb or suspected fracture during patient transportation or while waiting for X-rays.\n\nNo there isnt! This approach is widely accepted for immediate coverage of limbs in emergencies.\n\nResponding to Farai Maguwu on X, Australia-based medical practitioner, Thabisa Sibanda, cautioned against invading privacy when sharing images of patients with makeshift slabs.\n\nFirst, I wish to express my displeasure at the apparent invasion of privacy viz a viz this photo. Secondly may I offer a word of caution. This lady may be waiting for surgery and the surgeon felt no need to remove the prehospital makeshift slab in place.\n\nWhats the advantage of this? Does it work?\n\nIn emergencies where victims may be far from healthcare facilities, cardboard boxes are crucial to prevent further injury and stabilise fractures during transport. Community healthcare workers and first aid responders can easily utilise cardboard boxes to immobilise limbs and provide temporary support until patients receive proper medical care.\n\nVerdict:Using cardboard boxes for emergency handling of accident victims is cost-effective, widely accepted, and practical in Zimbabwe. These makeshift plasters help prevent further injury and facilitate the initial treatment of fractures before patients receive proper medical attention. Ultimately, patients will require a real plaster cast to hold the fracture in place while it heals, but cardboard boxes play a vital role in the initial stabilisation process.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fghfghfghfghf.jpg",
            "description": "(Zimpapers) Fact Checking Desk MANY Zimbabweans rely on social media platforms such as WhatsApp, Facebook and X for their news, exposing themselves to misinformation and biased sources. A recent social media frenzy centred around the use of cardboard boxes as makeshift plaster in first aid management following a tragic accident that claimed the lives of […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Burombo Flats murder accused taken for police indications",
            "url": "https://www.chronicle.co.zw/burombo-flats-murder-accused-taken-for-police-indications/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nMurder accused Meluleki Ndlovu of Burombo Flats in Bulawayo, who allegedly assaulted his wife before she jumped from their third-floor apartment window, was taken for police indications on Monday afternoon.\n\nNdlovu, under police guard, arrived at the scene where his wife, Siphiwe Ndlovu, fell before being rushed to the hospital. A coffin containing the body of the late Siphiwe, a mother of one, was also transported in the police van used to bring Ndlovu for the indications.\n\nPolice indications involve taking an accused person back to the crime scene as detectives reconstruct the events leading to the crime.\n\nMeluleki is expected to appear in court on Tuesday. Meanwhile, mourners have gathered at number G159 in Mzilikazi suburb to pay their respects to Siphiwes family.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/rgs.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com Murder accused Meluleki Ndlovu of Burombo Flats in Bulawayo, who allegedly assaulted his wife before she jumped from their third-floor apartment window, was taken for police indications on Monday afternoon. Ndlovu, under police guard, arrived at the scene where his wife, Siphiwe Ndlovu, fell before being rushed to the hospital. A coffin […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "President Mnangagwa meets editors",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-meets-editors/",
            "content": "President Mnangagwa today held an interactive meeting with editors from both the public and private media to share national issues and developments in the country.\n\nThe meeting provided an opportunity for the President to share his strategic vision while reflecting on the several achievements that his administration has recorded.\n\nIt was a no-holds-barred two-hour meeting that saw editors asking an array of questions on the economy, politics, and the media industry, among other issues.\n\nThe interaction was facilitated by the Department of Presidential Communications in the Office of the President and Cabinet, headed by Deputy Chief Secretary, Mr George Charamba.\n\nI want to warmly welcome you to State House. I do so mindful of the fact that this is our first meeting and that you represent different ownerships, editorial paths, and tendencies, which, in sum, constitute our national media industry, said President Mnangagwa.\n\nYet I am aware that one common denominator you have in that diversity and even competition is being Zimbabwean.\n\nHe said he is aware that the media industry is operating in a complex and challenging environment where many things, including technology, are evolving.\n\nNot least among these is a seismic shift in reader/viewer/listener interest and behaviour. Much of it is caused, motivated, or aided by giant technological changes and possibilities, he said.\n\nThe old media is dead and with it, old models and ways of doing your craft. We feel the impact and repercussions of these changes of technologies even in our own sphere of Government which is supposed to be stable and traditionally change-averse.\n\nThe Second Republic has made significant milestones in the areas of infrastructure, mining, and agriculture among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-17-at-17.32.56-680x380.jpeg",
            "description": "Zvamaida Murwira, Harare Bureau  President Mnangagwa today held an interactive meeting with editors from both the public and private media to share national issues and developments in the country. The meeting provided an opportunity for the President to share his strategic vision while reflecting on the several achievements that his administration has recorded. It was […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Bulawayo man in court for raping and robbing 28-year-old woman",
            "url": "https://www.chronicle.co.zw/bulawayo-man-in-court-for-raping-and-robbing-28-year-old-woman/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 30-YEAR-OLD Bulawayo man has appeared in court for allegedly raping and robbing a 28-year-old woman.\n\nTedious Makani from Pumula South suburb who appeared before Western Commonage regional magistrate Mrs Sibongile Marondedze, was remanded in custody to February 25.\n\nProsecutor, Ms Christine Manyika, said the incident occurred on December 31 last year at around 10pm at Jabulani Car Park in Pumula South.\n\nMs Manyika told the court that Makani and his accomplice who is on the run, approached the complainant while armed with an okapi knife.\n\nThe two accused demanded that the complainant hand over her belongings but she refused. Makani then threatened to stab her and slapped her once. Fearing for her life, the complainant surrendered her cellphone, she said.\n\nMakani and his accomplice then allegedly dragged the woman to an unfinished house where they ordered her to undress.\n\nMakani and his accomplice then took turns to rape the complainant, the court heard.\n\nAfter the rape the two accused fled, leaving the complainant at the scene.\n\nThe court heard that after the ordeal, the complainant managed to leave the building and reported the rape to the man she met a few meters from the building.\n\nThe man called the complainants husband, who rushed to the scene and took her to the police station where she reported the rape, said Ms Manyika.\n\nInvestigations led to Makanis arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com   A 30-YEAR-OLD Bulawayo man has appeared in court for allegedly raping and robbing a 28-year-old woman. Tedious Makani from Pumula South suburb who appeared before Western Commonage regional magistrate Mrs Sibongile Marondedze, was remanded in custody to February 25. Prosecutor, Ms Christine Manyika, said the incident occurred on December 31 last […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Warriors to Face Benin in Durban",
            "url": "https://www.chronicle.co.zw/warriors-to-face-benin-in-durban/",
            "content": "Innocent Kurira[emailprotected]\n\nThe Warriors will take on Benin in a crucial Matchday 5, Group C FIFA World Cup qualifier on Thursday, 20 March 2025, at the iconic Moses Mabhida Stadium in Durban, South Africa, with kick-off scheduled for 18:00hrs.\n\nThis announcement ends weeks of speculation regarding the venue for the match, as Zimbabwe continues to face challenges with having a CAF-certified stadium to host international fixtures.\n\nOriginally, the Zimbabwe Football Association (ZIFA) had planned to host the match in Polokwane. However, following a reallocation of Bafana Bafanas January fixtures, alternative venues had to be considered. Johannesburgs approved stadiums were unavailable due to rugby and other events, while Cape Town Stadium is currently undergoing pitch renovations.\n\nAfter an extensive search, Moses Mabhida Stadium emerged as the ideal venue. Known for hosting top international matches, the stadium offers world-class facilities and the perfect conditions for the Warriors playing style.\n\nWe are confident that Moses Mabhida will provide the best environment for our team to perform and deliver a memorable result for the fans, Zifa said in a statement released on Monday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Warriors.jpg",
            "description": "Innocent Kurira innocent.kurira@chronicle.co.zw The Warriors will take on Benin in a crucial Matchday 5, Group C FIFA World Cup qualifier on Thursday, 20 March 2025, at the iconic Moses Mabhida Stadium in Durban, South Africa, with kick-off scheduled for 18:00hrs. This announcement ends weeks of speculation regarding the venue for the match, as Zimbabwe continues […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Woman jumps to death fleeing beating by her husband",
            "url": "https://www.chronicle.co.zw/woman-jumps-to-death-fleeing-beating-by-her-husband/",
            "content": "Ronald Mpofu, Online ReporterA 33-year-old woman died after jumping from the third floor of her apartment in a desperate attempt to escape an assault by her husband, at Burombo Flats in Bulawayo.The woman, Siphiwe Ndlovu, was reportedly fleeing her husband Meluleki Ndlovu, 44, on Saturday during a domestic argument that had turned violent.In a statement, Acting Bulawayo Police spokesperson Assistant Inspector Nomalanga Msebele, the incident took place at around 8.00 PMMeluleki, who was reportedly intoxicated, engaged in a violent argument with his wife over alleged infidelity.During the confrontation, Meluleki assaulted his wife with open hands while the door to their room was locked from the inside.In an attempt to escape the assault, Siphiwe jumped from the third-floor window, landing on her stomach. She was holding the keys to their home in her right hand at the time of the fall.Neighbours who witnessed the incident rushed to her aid, taking the keys from her hand and unlocking the door for the Meluleki to exit.Meluleki reportedly called an ambulance and took his wife to Mpilo Central Hospital, where she was admitted with serious injuries, including a fractured leg, a swollen stomach, and bleeding from the nose and mouth.On the following day, the police were notified, and an investigation was launched. Authorities visited the hospital, where they were informed that Siphiwe had died from her injuries. Meluleki was arrested and is now in police custody.Assistant Inspector Msebele expressed sorrow over the tragic incident, urging couples to resolve their differences peacefully.It is disheartening that a life has been lost in such a way, said Assistant Inspector Msebele. We urge couples to solve their differences in an amicable manner and not to resort to violence. We also call on members of the public to avoid violence, especially when under the influence of alcohol.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Police-wanted-edit-by-Ronald-Mpofu-copy-2-copy-1.jpg",
            "description": "Ronald Mpofu, Online Reporter A 33-year-old woman died after jumping from the third floor of her apartment in a desperate attempt to escape an assault by her husband, at Burombo Flats in Bulawayo. The woman, Siphiwe Ndlovu, was reportedly fleeing her husband Meluleki Ndlovu, 44, on Saturday during a domestic argument that had turned violent. […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Nexus Rooftop Lounge opens with unforgettable exclusive Valentine’s Day experience",
            "url": "https://www.chronicle.co.zw/nnnexus-rooftop-lounge-opens-with-unforgettable-exclusive-valentines-day-experience/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nLast week Friday, the people of Bulawayo welcomed the new Nexus Rooftop Restaurant and Lounge, which has taken over The Vista at Pioneer House.\n\nThe lounge offered a fresh and conducive space for couples to celebrate their love, coinciding with the Valentines Day festivities.\n\nNexus rooftop, Restaurant and Pub staff members\n\nThe venue was set to a high standard, featuring spacious couches in the VIP section. A bonus free photoshoot added to the opening activities, delighting many attendees. Nexus offered two serving points: the VIP bar served bottles of whiskey and wine, while the other bar had a wide selection of ice-cold ciders.\n\nNexus Rooftop manager, Wushe Wushe\n\nWaiters and waitresses greeted attendees with friendly smiles, dressed impeccably in black and white uniforms. Bottle girls, dressed in black, white, and red, added to the lounges vibrant atmosphere. They not only served drinks but also ensured guests were entertained while enjoying their premium whiskey.\n\nGuests shared their excitement about Nexus and its potential to become one of the citys top venues. Bhekisizwe Dube, an attendee, said, I had doubts that this place could come alive like this. I love the service here the staff, food, and drinks were on point. We hope they maintain the standards as we were welcomed with smiles by active people who made sure we were comfortable.\n\nNexus rooftop, Restaurant and Pub staff members\n\nAnother guest, Ingrid Dube, expressed how she had the best Valentines Day celebration with her partner.This will be one of my best Valentines Day celebrations. I thank my boyfriend for bringing me here. Ill forever cherish the time we spent here. The security, music, and delicious food were top-notch. Im definitely coming back for more meals here, she said.\n\nNexus operations manager, Wushe Wushe, shared plans for a grand launch.Were yet to have a grand launch for Nexus, and we plan to bring in artistes from both local and international scenes for live performances. The environment were creating will cater to mature revellers who will frequent the place, Wushe said.\n\nThe venue also ensured the safety of its guests, with tight security actively patrolling the premises throughout the evening.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/featured.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com Last week Friday, the people of Bulawayo welcomed the new Nexus Rooftop Restaurant and Lounge, which has taken over The Vista at Pioneer House. The lounge offered a fresh and conducive space for couples to celebrate their love, coinciding with the Valentine’s Day festivities. The venue was set to a high standard, […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Two vehicles stolen from patrons who were drinking KoSamuriwo",
            "url": "https://www.chronicle.co.zw/two-vehicles-stolen-from-patrons-who-were-drinking-kosamuriwo/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTWO patrons at a popular drinking spot in Old Luveve, Bulawayo, lost their vehicles to car thieves on Saturday in a suspected organised car theft syndicate targeting drinkers.\n\nIn a statement, Acting Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele said a 36-year-old man from Cowdray Park parked his silver Mazda CX5 (Registration number AFZ 2541) in front of a bottle store at Chigumira Shopping Centre before entering KoSamuriwo Pub and Grill for a drink.\n\nHe drank beer until he became heavily intoxicated and could not recall what happened later. He only remembered waking up in a drainage trench in front of Matsika Bottle Store on February 16, 2025, at around 4 AM, said Asst Insp Msebele.\n\nThe man discovered his vehicle and car keys missing. After a futile search in Luveve and Gwabalanda, he reported the theft to the police. CCTV footage from the pub showed an unknown man entering the vehicle, reversing it, and driving off towards Huggins Road. The stolen vehicle is valued at US$10,000, and nothing has been recovered.\n\nIn a separate incident the same night, a 21-year-old man and his 23-year-old friend parked their black Honda Fit (Registration number AEJ 6321) behind a sports bar at Chigumira Shops. They locked the doors but left the front passenger window open before entering KoSamuriwo Pub and Grill.\n\nThey returned at around 3 AM to find the vehicle stolen, despite the complainant still having the car keys. The stolen vehicle is valued at US$3,000, and nothing has been recovered, said Asst Insp Msebele.\n\nShe urged the public to report any information leading to the suspects arrest and advised business owners to employ security guards to safeguard patrons vehicles.\n\nWe also advise the public to ensure all windows are closed and vehicles are properly locked before entering drinking spots, she added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-07-at-8.48.50-AM.jpeg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw TWO patrons at a popular drinking spot in Old Luveve, Bulawayo, lost their vehicles to car thieves on Saturday in a suspected organised car theft syndicate targeting drinkers. In a statement, Acting Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele said a 36-year-old man from Cowdray Park parked his silver Mazda CX5 (Registration […]",
            "time": "18:34",
            "date": "17 Feb 2025"
        }
    ]
}