{
    "news": [
        {
            "title": "Matebeleland North flash floods disrupt 22 schools",
            "url": "https://www.chronicle.co.zw/matebeleland-north-flash-floods-disrupt-22-schools/",
            "content": "Nqobile Tshili,[emailprotected]\n\nLEARNERS at several schools in Matabeleland North missed lessons last week while some are yet to attend class two weeks into the first term due to flash flooding, which has affected 22 primary and secondary schools in the province as incessant rains continue to pound the country.\n\nHeavy rains have intensified since the start of the year, raising hopes for an improved farming season as the country emerges from an El-Nino-induced drought.\n\nThe downpours have resulted in 23 deaths through drowning while over 800 households have been affected countrywide, according to the Civil Protection Unit.\n\nThe education sector has also been affected with Matabeleland North Provincial Education Director, Mr Jabulani Mpofu, saying only schools in Nkayi and Binga districts have not recorded any rain-related disruption so far.\n\nAt Sabelo Primary School in Bubi, the river was flooded affecting mostly the teachers who were coming from Bulawayo.\n\nIn Hwange District, Nekabandama and Kuribalila Primary Schools were affected. In Lupane, it is Daluka Primary School, the area is swampy so pupils coming from St Lukes are affected, said Mr Mpofu.\n\nWe have a serious problem in Tsholotsho, the district has poor drainage. So Tshabanda primary and secondary schools were affected. Dikili, Dogwe, Nhlangano, Mbalibali, Bubude, and Nshaba primary schools were also affected by the floods.\n\nHe said in Umguza District, Sawmills, Igusi, Zimdabule, Umguza, Bhuda, Zikhululeni, Ndazini, Dundubala, Sikhanyiso, and Lukukwe primary schools have had their opening affected due to rains.\n\nA bus belonging to Tshabanda High School stuck in the mud in Tsholotsho\n\nMr Mpofu said the ministry still discourages members of the public and learners from crossing flooded rivers with the Government pledging to compensate for lost time.\n\nWe still discourage pupils and teachers from crossing flooded rivers. We discourage even motorists from crossing flooded rivers, he said.\n\nSchools should find a way of compensating these learners. Some of them are giving assignments using cellphones. Some of the areas are not badly affected.\n\nA Chronicle news crew yesterday visited Tshabanda Village in Tsholotsho where school authorities and communities narrated how flash floods had disrupted learning.\n\nAs the news crew approached the village it observed that due to the lack of a proper drainage system, there was water on the sides of the road and also some ditches of water with boys even swimming in them.\n\nSome of the ponds cover over 100 metres. Mr Mthabisi Sibanda, a deputy head at Tshabanda High School, said the school failed to receive learners last week on Thursday as rains pounded the area.\n\nWe were seriously affected by the rains last week. We experienced floods all over the school. The water was flowing from the north passing through the school as there is no proper drainage in this area, said Mr Sibanda.\n\nAs a result, we were forced to turn away the learners because the school was not accessible. Also, other learners from Dugwi, Denge Jibhi, and Chefunye were not able to come to school.\n\nEven our boarders were not able to go to their classes as there was water all over the school.\n\nMr Sibanda said even teachers were marooned in their homes with community members expressing shock at the amount of rain that was received.\n\nWhen it comes to the flooding, we only know of what happens in the Sipepa area but we never thought it would be experienced here. Even our school bus got stuck in the mud on Tuesday opening day, he said.\n\nWe were anticipating having to conduct two trips during the opening of the school but our bus got stuck in the mud and we are still consulting with the community members to assist us with a tractor to pull it out.\n\nMr Sibanda said the school has already extended learning hours to compensate for the lost time stating that the safety of learners remains a priority.\n\nMrs Simangaliphi Moyo, a senior teacher at Tshabanda Primary School said school authorities are in constant communication with parents in case rains start pounding when they are in school.\n\nShe said when it rains a quarter of the pupils cannot report for school as they cross flooded rivers.\n\nWe have contacts for the parents and when we receive downpours during the learning hours, we inform them to come and collect the learners. Some of them wait for the learners in those streams to ensure that the children make it safe at home, she said.\n\nOne of the villagers, Mr Henry Ndebele, showed the news crew a video they captured when the rains had pounded the area. The water reached knee level and was flowing over the road to some of the houses.\n\nWe have not received this amount of rain in a long time. The last time we experienced such heavy downpours I was still a boy. As you can see there is water all over the place, he said.\n\nThe water was covering my knees. We have to divert the water so that it does not flow into our house. But in other homes, the water was flowing into their houses. Some houses built using poles and dagga collapsed, said Mr Ndebele.\n\nHe said it was unusual to see children being turned away from school due to flooding at the local schools.\n\nFor the children, they could not go to school for two days. We were marooned, our children were not able to leave our homes and others failed to even gain entrance into the school and they were told to return home, he said.\n\nDirector of communication and advocacy in the Ministry of Primary and Secondary Education, Mr Taungana Ndoro, said the ministry has taken an inclusive approach to ensure childrens education is not disrupted.\n\nTo ensure that learners catch up, we are implementing several strategies, including extended school hours where feasible, additional classes on weekends, and provision of online resources for remote learning, he said.\n\nWe are also coordinating with local authorities and community organisations to provide support to affected families and ensure that students can return to school safely.\n\nWhile the ministry has identified the most affected schools, it is reported that due to flooded rivers, there are learners who are still to report for school in other areas.\n\n-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-6-copy-3.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw LEARNERS at several schools in Matabeleland North missed lessons last week while some are yet to attend class two weeks into the first term due to flash flooding, which has affected 22 primary and secondary schools in the province as incessant rains continue to pound the country. Heavy rains have intensified since the […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Worker stabs supervisor in wage dispute",
            "url": "https://www.chronicle.co.zw/worker-stabs-supervisor-in-wage-dispute/",
            "content": "Patrick Chitumba,[emailprotected]\n\nTEMPERS flared at Bijour Farm in Lower Gweru, Midlands Province, leading to violent scenes after an excavator operator, allegedly dismissed from his job, stabbed one of his supervisors in a fit of rage.\n\nThe incident, which occurred on Tuesday at the farm owned by Ming Chang Sino-Africa Mining Investments, was widely circulated on social media. Videos show the worker, Kholwani Dube (38), demanding unpaid wages while shouting: Give me my money. I want my money. Shoot me!\n\nThe confrontation escalated, with supervisors restraining Dube, binding his hands and legs with wire, and threatening him with a pistol.\n\nAccording to sources, Dube had gone to the mine demanding US$600 in unpaid wages. Upon arrival, he was informed of his dismissal, sparking a heated argument with his supervisors.\n\nDube came to work demanding his dues, but his bosses refused to pay him, leading to the confrontation, said an employee who requested anonymity.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the altercation in a statement.\n\nCommissioner Paul Nyathi\n\nThe Zimbabwe Republic Police is investigating an assault and pointing of a firearm incident that occurred at Bijour Farm, Lower Gweru, on 21 January 2025. Kholwani Dube stabbed a Chinese national with an okapi knife on the leg following a labour dispute, while the Chinese national pointed a firearm at Dube, he said.\n\nHe said both Dube and the Chinese national are facing criminal charges.\n\nMing Chang Sino-Africa Mining Investments released a statement providing their account of the incident.\n\nThe company alleged that Dube had been warned and suspended for repeatedly disregarding instructions from his supervisors. Despite this, he reportedly seized the keys to an excavator and drove it toward two supervisors, endangering employees and equipment.\n\nMr Dube even attempted to run over the manager with the excavator, putting other employees and assets at risk, the statement read.\n\nThe company claimed that Mr Liu Haifeng, the farm manager, fired a warning shot into the air to de-escalate the situation. However, the confrontation escalated into a physical altercation during which Dube allegedly stabbed Mr Liu in the leg.\n\nMr Liu fired a warning shot into the sky, taking into account all firearm handling and safety procedures and without harming anyone. During the skirmish, Mr Hu contacted the police at Gweru Rural Police Station who were unfortunately unable to respond immediately due to transport challenges, said the company.\n\nThe injured supervisor was taken to the hospital, while Dube was handed over to the police.\n\nMr Dube then suddenly attacked Mr Liu who defended himself out of instinct, grabbing the driver by the collar. It was during the fistfight that Mr Dube stabbed and seriously injured Mr Liu on his left leg, said the company.\n\nFellow employees disarmed Mr Dube. Mr Liu was taken to the hospital for medical treatment, while other employees took the driver to the police.\n\nThe Zimbabwe Diamond and Allied Minerals Workers Union (ZDAMWU) has expressed outrage over the incident, calling for Government intervention to protect workers rights.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/01/knife-robbery-680x380.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw  TEMPERS flared at Bijour Farm in Lower Gweru, Midlands Province, leading to violent scenes after an excavator operator, allegedly dismissed from his job, stabbed one of his supervisors in a fit of rage.  The incident, which occurred on Tuesday at the farm owned by Ming Chang Sino-Africa Mining Investments, was widely circulated on […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Magaya challenge crumbles",
            "url": "https://www.chronicle.co.zw/magaya-challenge-crumbles/",
            "content": "Eddie Chikamhi and Yeukai Karengezeka, Zimpapers Sports Hub\n\nTHE highly anticipated Zifa elections are now set to go ahead tomorrow without any worry of legal hurdles in the formal courts after High Court judge Justice Tawanda Chitapi, yesterday dismissed an urgent chamber application for review filed by disqualified presidential aspirant, Walter Magaya.\n\nMagaya, was seeking the court to set aside the decision by the Zifa Ethics Committee and be allowed to contest the ballot after challenging the clause in the associations new statutes, which says the president and the two vice-presidents of the executive committee shall have passed a minimum of five O-level subjects or any equivalent educational level.\n\nThe Yadah owner, who is among the five disqualified candidates, had not submitted an O-level certificate but argued that the decision by Zifa not to accept his alternative qualifications was unreasonable, discriminatory and unlawful.\n\nHe cited Zifa Normalisation Committee chairman, Lincoln Mutasa, as the first respondent, the Zifa Electoral Committee and the Zifa Normalisation Committee, which he also leads as the second and third respondents.\n\nMagaya had wanted the court to set aside the Zifa Ethics Committee decision. However, Justice Chitapi dismissed the review application after going through the submissions by the two parties.\n\nIn his ruling, Justice Chitapi stated that Magayas application lacked merit and upheld the decision made by the Zifa Ethics Committee, which disqualified the clergyman on the basis that he did not submit the requisite O-level certificate with five subject passes.\n\nThe court, before setting aside a decision, must be satisfied that anyone with common sense and logic and who is rational would not have reached the decision of getting authority and legitimacy. The applicants challenge cannot succeed in the circumstances of this case, said Justice Chitapi.\n\nThe High Court ruled that the applicant did himself a huge disservice by not availing the required certificate.\n\nThe judge also criticised Magaya for failing to provide sufficient evidence to challenge the Zifa Electoral Committees decision or to demonstrate how the committees process was flawed.\n\nThere was nothing grossly unreasonable and irregular in the decision reached to disqualify the applicant who has not done himself good by withholding facts and not being candid to the court with information, which he says, if this decision is set aside and he places it before the vetting committee, the decision may be deferred. Accordingly, the challenge by the applicant cannot succeed.\n\nIt is my view that the challenge by the applicant was not frivolous or vexatious and involved a matter of public interest. I am of the view that the appropriate order in relation to costs is one in which each party must pay its own costs.\n\nAccordingly, I dispose of this matter as promised. This application is dismissed and each party will pay its own costs, said Justice Chitapi.\n\nMagaya and his legal counsel insisted the committee had failed to consider his tertiary qualifications, which included diplomas from the University of South Africa (Unisa).\n\nThe applicant contended that his higher qualifications, a Higher Certificate in Marketing and another in Theology should have been sufficient under Zifas statutes, which allow for equivalent qualifications.\n\nHe argued that the Electoral Committee erred by failing to consider his tertiary qualifications and not informing him in writing, within seven days that additional documents were required.He also argued that the committee lacked a clear appealing structure.\n\nThe issue is not whether a diploma is higher than O-level, but that the minimum requirement of five O-level passes must still be met. Even a PhD holder must produce an O-level certificate, Chitapi stated.\n\nThe requirement to have O-levels or their equivalent must be met. The effect that holds a degree, which is a higher qualification, does not, unless the requirements absolve the applicant from producing an O-level qualification or equivalent.\n\nIt is incorrect as established by the applicants that O-levels are a minimum requirement. The minimum refers to a number of subjects, which is given as five O-levels. Thus, if a candidate has passed less than five subjects, he cannot qualify.\n\nWhat this means is that the applicant will have to produce the equivalent educational certificates, which shows that the education qualification is indeed equivalent to a minimum of those five O-level subjects and must give an indication of the curriculum that is covered by that equivalent.\n\nThe applicant will be required to produce the O-level certificate or equivalent, even if he holds a PhD. That is the spirit behind Article 38 (of the Zifa constitution), Justice Chitapi explained.\n\nThe ruling means that the Zifa are now set to go ahead without having to worry about legal challenges in the formal courts after Justice Chitapi earlier this week also dismissed another High Court application that had been made by another disgruntled office aspirant, Temba Mliswa.\n\nMr. Temba Mliswa\n\nHowever, Magaya, Mliswa, Benjani Mwaruwari and Gift Banda, who had wanted to contest the vice-presidency, still have pending cases after approaching the Court of Arbitration for Sport in Switzerland, as stipulated by Article 65 of the new Zifa constitution.\n\nSix candidates  Philemon Machana, Nqobile Magwizi, Marshall Gore, Martin Kweza, Makwinji Soma-Phiri and Twine Phiri  have been cleared to run for the associations hot seat.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Magaya.jpg",
            "description": "Eddie Chikamhi and Yeukai Karengezeka, Zimpapers Sports Hub THE highly anticipated Zifa elections are now set to go ahead tomorrow without any worry of legal hurdles in the formal courts after High Court judge Justice Tawanda Chitapi, yesterday dismissed an urgent chamber application for review filed by disqualified presidential aspirant, Walter Magaya. Magaya, was seeking […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Confiscate, burn second-hand clothing: Government",
            "url": "https://www.chronicle.co.zw/confiscate-burn-second-hand-clothing-government/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nThe importation and sale of second-hand clothing remain banned in Zimbabwe, with the Government directing all provinces to burn confiscated smuggled consignments to protect local producers, an official has said.\n\nFollowing intense lobbying by captains of industry and commerce at various fora, the Government banned second-hand clothing imports in 2015 and has now moved in to curb the influx of such products, which are blamed for frustrating the viability of formal businesses.\n\nDespite these measures, the selling of second-hand clothing (amabhele/mabhero) has, however, gained popularity in recent years in Zimbabwe and across the region, amid enforcement challenges in the wake of rampant smuggling, and is seen as a source of livelihood for thousands of people.\n\nThe ridiculously low prices for various Kokhothama clothing items are a customer magnet, offering lucrative gains for traders who are usually unregistered and hence not compliant with tax regulations or city by-laws.\n\nEstablished textile, leather, and clothing factories have suffered huge losses to cheap second-hand products as a result, while citing unfair competition as they have to meet statutory obligations, salaries, rentals, and utilities, among other operating costs, which tend to affect their final product pricing.\n\nIndustry experts partly blame this scenario for the closure and collapse of established businesses and continue to call upon the Government to widen protectionist policies to safeguard the existing investments and preserve jobs.\n\nYesterday Permanent Secretary for Presidential Affairs and Devolution in the Office of the President and Cabinet, Engineer Tafadzwa Muguti, who conducted a tour of the giant clothing factory in Bulawayo, Carousel Manufacturing, a subsidiary of the listed Edgars Stores Group, opened up on the need to take stern measures to curb the influx of cheap second-hand clothes and reverse the adverse impact on established firms.\n\nedgars store\n\nHe clarified that the ban on these products remains in place and that further to that, the items confiscated by authorities across the country must be incinerated across provinces at Government hospitals.\n\nThis is an industry that has been affected by second-hand clothes. As Government we have banned the sale of second-hand clothing, said Eng Muguti.\n\nMy office has directed all provinces to confiscate second-hand clothing immediately. We have been doing that since December and we are now burning them at the provincial hospitals.\n\nThe directive comes at a time when the growth of the informal market is higher in Zimbabwe, especially in major cities and towns, with some formal players dipping their hands into trading smuggled goods, including flea markets and some retail shops selling used clothes. Health experts have said that smuggled used clothes not only pose a threat to businesses and the economy but also have adverse health implications for end users. In that regard, Eng Muguti the fight against smuggled products must be intensified and expressed satisfaction with how Bulawayo is implementing the anti-smuggling drive.\n\nI am happy with the anti-smuggling campaign in Bulawayo. It is the most successful in the country, he said.\n\nBulawayo did way better than the capital (Harare) itself, and we are seeing that more of the formal businesses are getting the right support from Government.\n\nThe second-hand clothing trade is a problem for the whole of Africa and last year in July, the Council of Ministers for the African Continental Free Trade Area (AfCFTA), embraced a new protocol to ban trade in second-hand clothes within the region.\n\nMost countries in Africa these days are seen as suitable dumping grounds for second-hand clothes, most of which come from Europe considering the near absence of the specific Asian cultural styles within the bales, and the slight American differences and specific styles.\n\nThe trade is fairly new, just a few decades old, and arises from the growing prosperity of Europeans, largely as a result of their free trade area, and the fact that many replace a lot of their clothing when fashion changes, a frequent occurrence, rather than when clothes wear out.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-8-copy-2.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  The importation and sale of second-hand clothing remain banned in Zimbabwe, with the Government directing all provinces to burn confiscated smuggled consignments to protect local producers, an official has said. Following intense lobbying by captains of industry and commerce at various fora, the Government banned second-hand clothing imports in 2015 and has now […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Navigating January’s challenges: Finding strength in adversity",
            "url": "https://www.chronicle.co.zw/navigating-januarys-challenges-finding-strength-in-adversity/",
            "content": "Tasunungurwa Matinhira\n\nJanuary often arrives with the promise of new beginnings but for some, it can feel like the weight of the world is resting on their shoulders. The financial strain, the pressures of school fees, uncertainty over food and businesses struggling to stay afloat in a challenging economic landscape can make this month one of the toughest.\n\nHowever, amidst these challenges, there lies a powerful opportunity for growth, resilience and hope.\n\nAs we navigate through this difficult season, it is essential to recognise that we are not alone. While it may seem that the road ahead is uncertain, there are ways to find peace and strength to get through these trying times.\n\nFrom a psychological perspective, the key lies in understanding our mental and emotional responses to adversity and adopting practical, positive strategies that empower us to cope better.\n\nRecognising and accepting the emotional strain\n\nFinancial difficulties, school fees pressures and food insecurity can create overwhelming feelings of anxiety, helplessness and fear. These feelings are normal human responses to crisis situations. Allowing ourselves to feel these emotions is not a sign of weakness  its a sign of our humanity. The challenge lies in how we process and respond to these emotions.\n\nInstead of suppressing your emotions or pretending everything is fine, give yourself permission to feel. Express your feelings through conversation, journalling or creative outlets. Speaking with someone you trust about your worries can reduce the emotional burden and remind you that you are not alone. Psychologists call this emotional validation, which helps to reduce stress and anxiety by simply acknowledging how you feel.\n\nShifting the focus from what we cannot control\n\nWhile many circumstances are beyond our control, such as rising school fees or challenges in business, we do have control over how we respond to these challenges. Shifting our mindset can help us regain a sense of empowerment.\n\nFocus on small, manageable actions that can help you regain stability. If youre struggling with finances, break down your expenses and identify areas where you can reduce costs. Can you barter goods or services in your community? Sometimes, the solution lies in community collaboration and creativity. Local networks of support can provide a safety net for those who are truly struggling.\n\nPrioritising mental health\n\nWith external pressures mounting, its easy to neglect your mental health. However, prioritising your well-being is critical during tough times. Take time to practice self-care, even in small ways. Simple activities such as taking a walk, meditating, or engaging in prayer can help restore balance and clear the mind.\n\nRemember that its okay to take breaks and practice mindfulness. One of the most powerful tools in dealing with stress is staying present. When you focus on the here and now, you often find that the overwhelming anxiety about the future can diminish.\n\nEmbracing Resilience: A strength we all have\n\nResilience isnt about being unbreakableits about bending without breaking. Its about adapting, finding new ways forward and accepting that setbacks do not define your future. As Zimbabweans, we have a rich history of resilience in the face of adversity, from the struggle for independence to overcoming economic challenges. This resilience runs deep in the collective psyche.\n\nThis January, lean into that strength. Recognise that the hardships youre facing now, though painful, are temporary. Remind yourself of past times when youve overcome challenges. Draw strength from those experiences. Building resilience isnt an overnight process; its a daily practice of embracing adversity and learning from it.\n\nSeeking professional help: A lifeline\n\nIn times of hardship, seeking professional help can be a game-changer. Whether its speaking to a psychologist, counsellor, or financial advisor, reaching out for help is not a sign of weaknessits a step towards empowerment. Professionals can help you navigate through the emotional turmoil, guide you through coping strategies and offer practical solutions to your challenges.\n\nIf you feel overwhelmed and unable to cope with the pressures, dont hesitate to seek support. Many organisations and individuals are available to provide assistance, whether through counselling, support groups, or social services. Reaching out doesnt just help youit also creates a space for others to share their struggles, building a sense of solidarity.\n\nCreating new pathways to success\n\nIts easy to get discouraged when the future seems uncertain. But this is also a time to re-imagine new possibilities. Your business may be facing tough times but perhaps there are new opportunities to diversify, to innovate, or to pivot in response to shifting conditions. Consider finding alternative income streams, collaborating with others, or learning new skills that could open new doors.\n\nIn a world where the only constant is change, adaptation is key. If you are a parent struggling with school fees, consider looking into community support programmes, scholarships, or creative ways to reduce the financial burden without sacrificing your childs education.\n\nThe power of unity and community support\n\nIn Zimbabwe, community is everything. Reach out to family, friends and neighbours who may be going through similar struggles. There is great power in collective actionwhether its pooling resources, sharing advice, or offering emotional support. If youre a business owner, consider joining local business networks to share ideas and help one another thrive.\n\nUnity is strength. By supporting each other, we rise together. Even a small act of kindness can help uplift someone who is struggling. You may find that giving, in any form, brings a sense of purpose and fulfillment during difficult times.\n\nA time for hope\n\nAlthough January may seem like a month full of challenges, it is also an opportunity for renewal, growth and finding new pathways forward.\n\nBy acknowledging your emotions, shifting your mindset, prioritising self-care and drawing on the strength of resilience, you can weather this storm and emerge stronger.\n\nTo all those facing hardship this month, remember that you are not defined by your circumstances. You have the power to rise above adversity, to adapt and to find hope in the most unlikely places.\n\nLean on your community, take things one day at a time, and know that better days are ahead. Together, we can turn these challenges into a springboard for future success.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/vcbvcfcb.jpg",
            "description": "Tasunungurwa Matinhira January often arrives with the promise of new beginnings but for some, it can feel like the weight of the world is resting on their shoulders. The financial strain, the pressures of school fees, uncertainty over food and businesses struggling to stay afloat in a challenging economic landscape can make this month one […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Industry leaders applaud digitising of public services",
            "url": "https://www.chronicle.co.zw/industry-leaders-applaud-digitising-of-public-services/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Zimbabwe National Chamber of Commerce (ZNCC) has commended the automation of company and tax registration processes saying this has reduced business costs and helps improve the ease of doing business.\n\nIn its 2024 State of the Industry Survey, the business lobby group said several issues have continued to be flagged by businesses as factors increasing the cost of doing business in Zimbabwe.\n\nAmong these are bureaucracy and red tape caused by unautomated processes, inefficient legal and regulatory framework, inadequate infrastructure, high taxes, limited access to finance and information, corruption tendencies, restrictive labour regulations and macro-economic limitations.\n\nWith regard to the automation of company and tax registration, there are significant improvements. For instance, in the past, company registration was cumbersome with 90 percent of the work including the processing of documents like CR5, CR6 and Memorandum and Articles of Association done manually, said the business lobby groups.\n\nHowever, introducing the Companies and Intellectual Property Office of Zimbabwe (CIPZ) has significantly improved the ease of company registration.\n\nZNCC\n\nThe 100 percent automated CIPZ system allows a faster, more efficient and zero interaction with officials. This also reduces corruption.\n\nIn addition to the CIPZ system, ZNCC said the Zimbabwe Revenue Authority (Zimra) recently introduced the Tax and Revenue Management System (TaRMS), which allows one to obtain a tax clearance certificate within two hours of application if all the required documents are accurately captured.\n\nThe TaRMS encompasses various modules including debt management, payment options and agent registration.\n\nThese modules are introduced gradually. What is also good news for the ease of business is that the TaRMS has been integrated with the CIP, said ZNCC.\n\nThe business lobby group said infrastructure, particularly, unreliable power supply and poor road infrastructure continue to be a major problem in Zimbabwe.\n\nHowever, the business leaders commended Governments efforts on infrastructure development saying that spending US$300 million in 2024 is recommended for improving infrastructure.\n\nOn a positive note, the trading across borders climate is continuously improving as the infrastructure at the main ports of entry is being upgraded as well as the airports and the major highways, said ZNCC.\n\nA case in point is the upgrading of the Robert Mugabe International Airports domestic terminal. The clearing work at the ports was assigned only to Zimra to speed the process by reducing the number of authorities that have to inspect cargo and reducing corrupt tendencies in the process.\n\nWith the African Continental Free Trade Area (AfCFTA) now in the operationalisation phase, ZNCC said improving the countrys standing on trade facilitation needs to be improved further. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/06/Untitled-24-10.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com THE Zimbabwe National Chamber of Commerce (ZNCC) has commended the automation of company and tax registration processes saying this has reduced business costs and helps improve the ease of doing business. In its 2024 State of the Industry Survey, the business lobby group said several issues have continued to be flagged by businesses […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Legislator calls for rehabilitation of Gwanda-Manama Road",
            "url": "https://www.chronicle.co.zw/legislator-calls-for-rehabilitation-of-gwanda-manama-road/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nGWANDA South legislator who is also Deputy Minister for Information, Publicity and Broadcasting Services, Dr Omphile Marupi has called for the rehabilitation of the Gwanda- Manama Road which is in a terrible state.\n\nDr Marupi yesterday toured the road together with Ministry of Transport and Infrastructural Development officials and transport operators to assess the extent of damage.\n\nThe road which is the busiest in Gwanda District is a link to Mlambapele Border Post, irrigation schemes, Manama Hospital, and cattle sales pens. It also links Gwanda to Beitbridge and Kezi.\n\nThe road has been severely damaged over the past years, creating a headache for motorists and public transport operators. Heavy rains worsened the state of the road.\n\nAbout 10km of the road between Garanyemba and Ntepe areas has been severely damaged while certain sections of the road leading to Manama are also in a terrible state.\n\nI had to engage engineers from the Ministry (of Transport) to come and assess the road so that they can have an appreciation of the extent of damage and the urgency of the matter. This is a major road and it is critical in terms of economic activities in the district, said Dr Marupi.\n\nWe have several irrigation schemes that have been revived in this area. The produce from these irrigations needs to be delivered to the markets using this road. We also have sales pens in this constituency and for trade to take place there is a need for a good road.\n\nDr Marupi said he would lobby with the responsible ministry to expeditiously release funds for the rehabilitation of the road.\n\nHe said he will work tirelessly to ensure that the project is treated as a matter of urgency.\n\nMatabeleland South provincial roads Engineer Mangisi Nkomo said seven kilometres of the road require urgent reconstruction while other sections from Gwanda to Manama require resealing.\n\nHe said maintenance of the road is among the projects which are earmarked for this year.\n\nWe have assessed the road which is in a bad state. As a department, we have placed the road in our 2025 programme and the road is scheduled for reconstruction, said Dr Marupi.\n\nThe Department of Roads working with Zinara is working on the recapacitation of our maintenance units. We are also resuscitating all our maintenance units, and will be procuring graders and all the equipment required for road maintenance.\n\nThe owner of Greenhorse Bus Company, Mr Patrick Dube said the state of the road is impacting negatively on the transport business.\n\nI have three buses that ply this route and the state of the road is causing severe damage to the vehicles.\n\nWe now have to take them for frequent servicing to ensure that the buses can operate, he said.\n\nI have been plying this route for decades and passengers have been dependent on our services.\n\nA motorist, Mr John Sibanda from Manama area who uses the road daily, expressed concern over its state.\n\nA villager, Mr Jethro Ndlovu said they have tried several times to patch the road using sand but it has not helped.\n\nThis road is not a problem to motorists only but also pedestrians. Vehicles are now forced to divert from the road, he said.\n\nThis poses a huge threat, especially to children who will be walking to and from school. We really need this road to be rehabilitated as a matter of urgency.\n\nThe Second Republic is committed to rehabilitating the road network as infrastructural development is key to attaining an upper middle-income economy by 2030.  @DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/21-3.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw GWANDA South legislator who is also Deputy Minister for Information, Publicity and Broadcasting Services, Dr Omphile Marupi has called for the rehabilitation of the Gwanda- Manama Road which is in a terrible state. Dr Marupi yesterday toured the road together with Ministry of Transport and Infrastructural Development officials and transport operators to […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Journalist’s sanitary pad initiative empowers rural girls",
            "url": "https://www.chronicle.co.zw/journalists-sanitary-pad-initiative-empowers-rural-girls/",
            "content": "Moreblessing Phiri,Chronicle Correspondent\n\nGIRLS in rural areas continue to face substantial challenges during their menstrual cycles, with many resorting to using newspapers, tissue, or other unhygienic materials due to limited access to sanitary wear.\n\nThis issue affects their school attendance and performance, as some are forced to miss critical learning time.\n\nRecognising this pressing need, Zimpapers journalist Mkhululi Ncube launched a campaign to provide sanitary pads to underprivileged girls at Gwambe Secondary School in Bulilima District, Matabeleland South Province.\n\nThe initiative, marking his 40th birthday in December last year, has brought hope and relief to many learners.\n\nOriginally aimed at supporting 40 girls throughout 2025, the campaign surpassed expectations, raising over 860 packs of sanitary pads. These were distributed to 44 girls at Gwambe Secondary School on Wednesday, with an additional 190 packs donated to Gwambe Primary School. Each selected girl at the secondary school received 15 packs, while some were reserved for emergency use at the school.\n\nThis initiative is about more than just providing sanitary pads. Its about empowering young girls to stay in school, promoting health and hygiene, and boosting their confidence, said Ncube, who hails from Gwambe.\n\nHe said the campaign was his way of giving back to his community.\n\nI didnt want my birthday celebration to be about me. I wanted to make a meaningful impact. I used my social media platforms to rally support, and Im grateful to everyone who contributed to this success, said Ncube\n\nBefore the handover, a health club session with the learners highlighted the harsh realities they face. Many shared stories of using makeshift materials like newspaper, tissue, or cloth during their periods.\n\nWeve been using newspapersand amalembu (pieces of cloth), even though we know its not good. Sometimes, we have to miss school if our period starts at home. This donation is a huge relief  it means we can focus on our studies without worrying about pads, said Imaniinkosi Nkomo, a Form 3 learner.\n\nThe acting head of Gwambe Secondary School, Mr Nhlanhla Dube, praised the initiative, noting its significant impact on the learners.\n\nMany of our girls have great potential, but their circumstances often hold them back. This initiative will help keep them in school and reduce the risks associated with using unhygienic materials. We hope this effort inspires more support for rural schools, he said.\n\nGwambe Primary School head, Mr Chadreck Nkobi, revealed that the need for sanitary pads begins as early as Grade 5, with many learners maturing earlier due to dietary changes.\n\nSome of our learners come from challenging backgrounds where even basic needs like sanitary pads and books are hard to afford. This donation is a lifeline for them, he said.\n\nNcube plans to establish a Pads Education Trust to ensure the sustainability of the initiative and expand its reach to other communities.\n\nMy ultimate goal is to keep young girls in school, restore their dignity, and inspire others to contribute to this cause, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/8-3.jpg",
            "description": "Moreblessing Phiri, Chronicle Correspondent GIRLS in rural areas continue to face substantial challenges during their menstrual cycles, with many resorting to using newspapers, tissue, or other unhygienic materials due to limited access to sanitary wear.  This issue affects their school attendance and performance, as some are forced to miss critical learning time.  Recognising this pressing need, […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "‘So far so good: All set for FUZ Awards’  Billiat, Musona and Chikuhwa are favourites for top gong",
            "url": "https://www.chronicle.co.zw/so-far-so-good-all-set-for-fuz-awards-billiat-musona-and-chikuhwa-are-favourites-for-top-gong/",
            "content": "Lovemore Dube,[emailprotected]\n\nKHAMA Billiat, Walter Musona and Lynoth Chikuhwa are favourites for the Footballers Union of Zimbabwe (FUZ) Soccer Star of the Year Award set for Harare tonight.\n\nWonder Sithole the secretary-general of FUZ confirmed that they will have their awards at a plush Harare hotel this evening.\n\nInvitations to winning players have already been sent and several guests have confirmed their availability for the event.\n\nFUZ has not revealed what prizes are on stake but both men and women will be honoured tonight for their exploits in 2024.\n\nBilliat, the fans favourite, who set the local league ablaze with some good football for club and country, is tipped to win the award. Playing for a modesty side, Yadah, he showed that class is permanent, bullying his opponents at will throughout the campaign in which he was a second runner-up in the Soccer Star of the Year race, contributed 24 goals to his team, 13 of which he scored and the rest being assists.\n\nHe was also influential in the Warriors qualifying for the Morocco Afcon finals set for later this year.\n\nMusona was an influential element for both Simba Bhora, the Castle Lager reigning champions and Warriors. He is one player endowed with technique, a temperament to rise to the occasion and deliver with ease and his ability to play as an outright striker or decoy, was a marvel to watch on the offensive. He scored in several deadball situations.\n\nChikuhwa finished the season as the top goalscorer in the Premiership with 17 goals and was the 2024 Castle Lager Soccer Star of the Year first runner-up.\n\nAll three are at Scottland as Tonderai Ndiraya looks set to unleash a lethal strikeforce in the Premiership this year. He has also added Tymon Machope, a double-figure scorer last season and Mbongeni Minezhi who finished as the top goalscorer in the Zifa Southern Region, Division One.\n\nTonderayi Ndiraya\n\nOther outstanding players from last season include Chicken Inns Michael Charamba, Raphael Pitisi of Highlanders, Cris Mverachena of TelOne, Brian Banda of FC Platinum, Dynamos Emmanuel Jalai and Goalkeeper of the Year Donovan Bernard.\n\nAnother FUZ official, Herbert Dick said all was in place for a colourful event with the organisation having used its resources. However, he said sponsors and partners were still welcome on board.\n\nWe are still open to partners for the event. So far so good, players are already in Harare ahead of the event, said Dick.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ds-1.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw KHAMA Billiat, Walter Musona and Lynoth Chikuhwa are favourites for the Footballers Union of Zimbabwe (FUZ) Soccer Star of the Year Award set for Harare tonight. Wonder Sithole the secretary-general of FUZ confirmed that they will have their awards at a plush Harare hotel this evening. Invitations to winning players have already […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        },
        {
            "title": "Trump proposes controversial renaming of Gulf of Mexico to ‘Gulf of America’",
            "url": "https://www.chronicle.co.zw/trump-proposes-controversial-renaming-of-gulf-of-mexico-to-gulf-of-america/",
            "content": "Beln Fernndez,Correspondent\n\nThis month during a rambling news conference at his Mar-a-Lago estate, United States President, Donald Trump, announced his latest vision for revising the map of the world: Were going to be changing the name of the Gulf of Mexico to the Gulf of America, which has a beautiful ring.\n\nHe went on to reiterate approvingly: That covers a lot of territory, the Gulf of America. What a beautiful name.\n\nThe Gulf of Mexico, which runs along much of Mexicos eastern coastline and abuts five southern US states, is a key international hub for shipping, fishing, oil drilling and other commercial activity. The body of water was christened as such more than four centuries ago before either the US or Mexico existed.\n\nOf course, a unilateral renaming of the gulf by the US president would not require endorsement by Mexico or any other country. Additional cartographic adjustments recently floated by President Trump include seizing the Panama Canal, wresting away control of Greenland and annexing Canada.\n\nApart from the beautiful ring President Trump has detected in the Gulf of Mexicos impending new name, the proposed move is consistent with his track record of overzealous antagonism of Mexico, a country he has said is disproportionately composed of rapists and other criminals. And speaking of beautiful, Trump repeatedly demanded during his first term as president that Mexico foot the bill for the big, beautiful wall he envisioned erecting on the US-Mexico frontier.\n\nIndeed, Trump viciously blames the United Statess southern neighbour for the northbound flow of illegal migrants and drugs  as though US demand for illicit substances and the bipartisan US habit of destroying other peoples countries have nothing to do with fuelling drug trafficking and migration. Nor, surely, does the US economic reliance on undocumented and exploitable labour play any sort of role in the equation.\n\nNever one to pass up an opportunity for repetitive hypocrisy, Trump appended the following warning to his Gulf of Mexico announcement at Mar-a-Lago: And Mexico has to stop allowing millions of people to pour into our country. Anyway, the rebranding of the gulf will most certainly put the Mexicans in their place.\n\nIn the very least, the Gulf of America project is less invasive than previous ideas that have sprung from Trumps brain, such as the firing of missiles at Mexico to combat the drug cartels  organisations that happen to owe their very existence to the simultaneous US demand for and criminalisation of drugs.\n\nThe hullaballoo over the renaming also provides a convenient distraction from, you know, actual problems  which is what Trumps signature bombastic xenophobia is meant to do in the first place.\n\nFar-right US Representative Marjorie Taylor Greene, for one, wasted no time heeding Trumps call to arms. Just two days after the Mar-a-Lago news conference in Florida, she introduced a bill that would rename the Gulf of Mexico in accordance with the presidents wishes.\n\nAs per the political website The Hill, the bill would direct the chair of the Board on Geographic Names under the secretary of the Interior to rename all federal documents and maps within 180 days of being signed into law. Greene added her own convincing sales pitch: Its our gulf. The rightful name is the Gulf of America, and its what the entire world should refer to it as.\n\nAs it turns out, this is not the first time that US politicians have suggested renaming the Gulf of Mexico. An Associated Press article recalls an episode in 2012 when a member of the legislature of the state of Mississippi put forth a bill to assign the name Gulf of America to portions of the body of water touching Mississippi beaches  a move the bill author later referred to as a joke.\n\nMeanwhile, quite a bit further back on the regional timeline, the Gulf of Mexico played host to another egregious example of imperial hubris that transpired in 1914 on the watch of Democratic US President Woodrow Wilson. The website of the Woodrow Wilson Presidential Library and Museum has memorialised that years Incident at Tampico, named for the port city in the Mexican state of Tamaulipas on the Gulf of Mexico where American warships were sitting just off the coast to protect American oil interests.\n\nThe previous year, a coup against Mexican President Francisco I Madero had taken place with assistance from the then-US ambassador to Mexico, producing the reign of General Victoriano Huerta. By 1914, the new US ambassador to Mexico was backing the opposition to Huerta, whose forces had the audacity to detain nine US sailors while the fleet of American warships continued to sit innocently off the coast.\n\nIn the version of the incident provided by the Woodrow Wilson Presidential Library and Museum, the commander of US forces in the area demanded a 21-gun salute and an apology from Huerta after the sailors were quickly released. The Mexican government rejected these demands, and President Wilson used the events as a reason to request permission from Congress for an armed invasion of Mexico.\n\nAnd voila: Events soon led to the occupation of (the port city of)Veracruz by US forces.\n\nIn other words, there are plenty of reasons folks might be opposed to renaming the Gulf of Mexico.\n\nAnd while Trumps insistence on behaving like a caricature of himself makes it easier to cast him as some sort of aberration in US foreign policy, at the end of the day, its imperialism plain and simple  and that is one thing you just cant rename.  Al Jazeera\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-11-copy-2.jpg",
            "description": "Belén Fernández, Correspondent  This month during a rambling news conference at his Mar-a-Lago estate, United States President, Donald Trump, announced his latest vision for revising the map of the world: “We’re going to be changing the name of the Gulf of Mexico to the Gulf of America, which has a beautiful ring.” He went on to […]",
            "time": "08:34",
            "date": "24 Jan 2025"
        }
    ]
}