{
    "news": [
        {
            "title": "Bulawayo city centre turning into haven of criminality – Councillor",
            "url": "https://www.chronicle.co.zw/bulawayo-city-centre-turning-into-haven-of-criminality-councillor/",
            "content": "Raymond Jaravaza, Online ReporterTHE Bulawayo city centre is slowly turning into a haven of criminal activities such as illegal selling of alcohol from the boot of vehicles, public drinking and public urinating, Councillor Tavengwa Zidya has bemoaned.\n\nCllr Zidya is the Bulawayo City Council (BCC) local representive for Ward 24, which covers Nketa 7, portions of Nketa 8 and 9, and runs businesses in the city centre.Cllr Zidya says he has witnessed first-hand city by-laws being broken with impunity in broad day light.\n\nHe is of the view that if left unchecked the illegal activities will drive businesses out of the city centre, leaving it a white elephant.Legitimate businesses such as bottle stores are losing clients to individuals who sell alcohol from the boot of their cars right in front of their doorsteps. We see their clients urinating on trees and street corners in the middle of the city centre during the day. That kind of behavior is not good for the image of the City of Bulawayo.\n\nThe city centre is already losing businesses that are opting to rent premises in Suburbs and Khumalo and if the illegal activities continue the CBD will soon be deserted, said Cllr Zidya.Cllr Zidya has raised the issue with the Zimbabwe Republic Police (ZRP) who have showed their willingness to rid the city of the illegal activities.I applaud the police for conducting regular raids but more needs to be done, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/okok.jpg",
            "description": "Raymond Jaravaza, Online Reporter THE Bulawayo city centre is slowly turning into a haven of criminal activities such as illegal selling of alcohol from the boot of vehicles, public drinking and public urinating, Councillor Tavengwa Zidya has bemoaned. Cllr Zidya is the Bulawayo City Council (BCC) local representive for Ward 24, which covers Nketa 7, […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "BREAKING: Brian Moyo, Andrew Mandigora granted bail",
            "url": "https://www.chronicle.co.zw/breaking-brian-moyo-andrew-mandigora-granted-bail/",
            "content": "Peter Matika, Online Reporter\n\nFORMER Highlanders Football Club Chief Executive Officer Brian Busani Moyo and Bulawayo Chiefs administrator Andrew Mandigora have been granted bail.The pair was arraigned before the courts on Saturday on charges of fraud.\n\nBulawayo magistrate Beverly Madzikatire granted them US$200 bail each before remanding the matter to April 28.\n\nThey were also ordered to report to the police once every week, not to interfere with State witnesses and to reside at their provided residential addresses until conclusion of the trial.The two are accused of fraud in a controversial player transfer deal with Bulawayo Chiefs.At the heart of the controversy is an alleged shortfall of US$5 000 in the transfer fees for two players acquired from Bulawayo Chiefs.\n\nWhile official records within Highlanders reflect a transaction of US$23 000, evidence suggests that only US$18 000 reached Chiefs coffers, raising alarm over possible embezzlement.Investigations have uncovered two invoices  one reflecting the entire US$23 000 sent to Highlanders internal accounts, while another, reduced to US$18 000, was presented to Bulawayo Chiefs.It is alleged that Moyo pocketed US$2 000 from the deal, while Mandigora took US$3 000.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hnyh.jpg",
            "description": "Peter Matika, Online Reporter FORMER Highlanders Football Club Chief Executive Officer Brian Busani Moyo and Bulawayo Chiefs administrator Andrew Mandigora have been granted bail. The pair was arraigned before the courts on Saturday on charges of fraud. Bulawayo magistrate Beverly Madzikatire granted them US$200 bail each before remanding the matter to April 28.   They […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "Moyo, Mandigora granted bail",
            "url": "https://www.chronicle.co.zw/moyo-mandogora-granted-bail/",
            "content": "Peter Matika,Online Reporter\n\nFORMER Highlanders Football Club Chief Executive Officer Brian Busani Moyo and Bulawayo Chiefs administrator Andrew Mandigora have been granted bail.The pair was arraigned before the courts on Saturday on charges of fraud.\n\nBulawayo magistrate Beverly Madzikatire granted them US$200 bail each before remanding the matter to April 28.\n\nThey were also ordered to report to the police once every week, not to interfere with State witnesses and to reside at their provided residential addresses until conclusion of the trial.The two are accused of fraud in a controversial player transfer deal with Bulawayo Chiefs.At the heart of the controversy is an alleged shortfall of US$5 000 in the transfer fees for two players acquired from Bulawayo Chiefs.\n\nWhile official records within Highlanders reflect a transaction of US$23 000, evidence suggests that only US$18 000 reached Chiefs coffers, raising alarm over possible embezzlement.Investigations have uncovered two invoices  one reflecting the entire US$23 000 sent to Highlanders internal accounts, while another, reduced to US$18 000, was presented to Bulawayo Chiefs.It is alleged that Moyo pocketed US$2 000 from the deal, while Mandigora took US$3 000.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hnyh.jpg",
            "description": "Peter Matika,Online Reporter FORMER Highlanders Football Club Chief Executive Officer Brian Busani Moyo and Bulawayo Chiefs administrator Andrew Mandigora have been granted bail. The pair was arraigned before the courts on Saturday on charges of fraud. Bulawayo magistrate Beverly Madzikatire granted them US$200 bail each before remanding the matter to April 28.   They were […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "EuroFilmFestZW launches Ultra Shorts Competition for young Zimbabwean filmmakers",
            "url": "https://www.chronicle.co.zw/eurofilmfestzw-launches-ultra-shorts-competition-for-young-zimbabwean-filmmakers/",
            "content": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub\n\nTHE European Film Festival Zimbabwe (EuroFilmFestZW) is continuing to celebrate a decade in existence in style having announced the launch of its inaugural Ultra Shorts Competition, calling on young emerging Zimbabwean filmmakers to showcase their talents.\n\nThe competition, themed The Hustle: Through Her Eyes, seeks films that highlight the resourcefulness and creativity of women in navigating challenges and creating opportunities that uplift themselves, their families, and communities.\n\nAccording to Alex Gwaze, representing EuroFilmFestZW, the theme was inspired by the unbreakable spirit of Zimbabwean women who are the backbone of the economy.\n\nFrom street vendors to entrepreneurs, their hustle is real, and their determination is inspiring, Gwaze said.\n\nWe want to shine a spotlight on their innovative minds, celebrating their triumphs and stories of resilience in all aspects of Zimbabwean life.\n\nThe competition is open to aspiring filmmakers aged 18-35 based in Zimbabwe, who are invited to submit films no longer than 1 minute 30 seconds.\n\nThe judging criteria will focus on innovative, direct, and bold storytelling that reflects the world we live in.\n\nBrevity is the new currency. Were looking for filmmakers who can tell impactful stories within a 90-second time frame, he emphasised.\n\nThe competition promises to be an exciting opportunity for emerging filmmakers, particularly women, to make a splash in the film industry.\n\nGwaze noted that with just a phone and a story to tell, the playing field is levelled.\n\nWere calling on women and young filmmakers to seize this opportunity, to break rules, and to tell their stories unapologetically, he said.\n\nThe top contender will win a brand new iPhone, while the first and second runners-up will receive vouchers.\n\nThe deadline for submissions is May 9 and interested filmmakers can enter by scanning the QR code on the poster or by visiting https://docs.google.com/forms/d/e/1FAIpQLSe6k8FkuXYAXt4nqFE44rHin26-vxHwWK0xVgDirVKc8p-HVw/viewform?usp=preview\n\nThis initiative is expected to provide a platform for young Zimbabwean filmmakers to showcase their talents, tell powerful stories, and leave their mark on the film industry.  Follow on X@MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-12-at-11.29.17-680x380.jpeg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub THE European Film Festival Zimbabwe (EuroFilmFestZW) is continuing to celebrate a decade in existence in style having announced the launch of its inaugural Ultra Shorts Competition, calling on young emerging Zimbabwean filmmakers to showcase their talents. The competition, themed “The Hustle: Through Her Eyes,” seeks films that highlight […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "Bulawayo Chiefs coach speaks ahead of league start",
            "url": "https://www.chronicle.co.zw/bulawayo-chiefs-coach-speaks-ahead-of-league-start/",
            "content": "Media Mpofu\n\nIN a candid briefing, Bulawayo Chiefs head coach Maxwell Takaendesa Jongwe expressed a need to be cautious ahead of the start of the Zifa Southern Region One League start on Saturday.\n\nBulawayo Chiefs will open their season with a fixture against Talen Vision and Jongwe, a veteran gaffer has acknowledged the intense competition his team will face.\n\nJongwe is well aware of the challenges that lie ahead since the southern region has lost a number of teams in the premiership which means that most of the most experienced coaches have gone down to division one.\n\nWere not naive to the fact that we are in a difficult league that has strong teams and many experienced coaches and that makes it very tough but we will try by all means, he said.\n\nHe added: We are completely in a new territory, what happened last year is already the past and we cannot dwell on that, lets talk about how we are prepared for division one, said Jongwe.\n\nJongwe said that they are prepared enough to keep a fight in division one and even the baddest grounds will not be an excuse.\n\nHe believes that his team is balanced since they have a mixture of veteran players like Kelvin Madzongwe, Malvin Mkoko and youngsters like Alfred Matonsi who is 17 years old.\n\nAs the league approaches, Bulawayo Chiefs fans will be watching anxiously to see how their team performs under Jongwes leadership. While a win may not be imminent, the teams determination and resilience will undoubtedly be put to the test.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/coach.jpg",
            "description": "Media Mpofu IN a candid briefing, Bulawayo Chiefs’ head coach Maxwell Takaendesa Jongwe expressed a need to be cautious ahead of the start of the Zifa Southern Region One League start on Saturday. Bulawayo Chiefs will open their season with a fixture against Talen Vision and Jongwe, a veteran gaffer has acknowledged the intense competition […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "President opens Mbare market",
            "url": "https://www.chronicle.co.zw/president-opens-mbare-market/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nSMALL to Medium Enterprises (SMEs) are a key driver of economic growth, broad-based empowerment, job and wealth creation, contributing significantly to the countrys Gross Domestic Product, President Mnangagwa has said.\n\nCommissioning the Mbare Musika Traders Market Phase 1, a state-of-the-art facility that is set to benchmark the modern SMEs trading environment, President Mnangagwa said the importance of the Small and Medium Enterprises sector to the growth of the economy cannot be over-emphasised.\n\nCompletion of the first phase of the market paved the way for 1 628 traders to begin operations and comes as a timely relief for traders who lost their stalls and stock last year in a fire outbreak.\n\nHE commissions Mbare Msika\n\nThe President said the SMEs sector stands as one of the critical pillars of the economy, contributing significantly to the total Gross Domestic Product.\n\nMy Government, thus, recognises that SMEs are a key driver of economic growth, job creation, wealth creation and broad-based empowerment, he said.\n\nPresident Mnangagwa said his just-ended visit to the 11th Session of the Africa Regional Forum on Sustainable Development in Uganda, as Chairman of SADC, discussed the importance of driving job creation and economic growth, mainly through young people and women.\n\nHE commissions Mbare Msika\n\nI, therefore, challenge the entrepreneurs of our country to scale up the establishment of small businesses and start-ups in line with emerging trends and digital technologies.\n\nAs a Government, we are ready to support solutions and new products related to agriculture, financial and climate technologies among others that must propel the industrialisation of our country, he said.President Mnangagwa said the facilitation of more opportunities and windows of support such as low-interest financing, business development services, transfer of skills and technologies as well as market access for the sector, will be availed.\n\nHE commissions Mbare Msika\n\nHe directed all partners to the Mbare Musika Traders Market and future projects to ensure that levies and rentals are pegged at competitive and affordable levels.\n\nOccupants and customers of the markets were also called upon to be responsible custodians of the modern facilities. The President called for collaborative synergies between SMEs and relevant ministries, departments and agencies, saying such collaboration was important towards the formalisation of small businesses and start-ups.\n\nAs we continue to diversify our economy, the formalisation of this sector must never be viewed as a direct threat to the survival and sustainability of your respective businesses.\n\nOn its part, my Government will continue to improve the ease of doing business, through reducing barriers to entry, as well as streamlining business registration, licensing and compliance levies.\n\nHE commissions Mbare Msika\n\nDialogue with the SMEs sector is an essential building block for enhanced business productivity. There should not be a them and us mentality, said President Mnangagwa.\n\nHe added that the Government and SMEs sector must act as one for the good of the country.\n\nThe Ministry of SMEs was challenged to deploy innovative initiatives that will see more SMEs becoming fully fledged business entities with footprints beyond Zimbabwe and the SADC region.\n\nGovernment is determined to see the realisation of the Urban Transformation Agenda designed to primarily focus on addressing rapid urbanisation by prioritising safe, inclusive, resilient and sustainable cities and human settlements, in line with Sustainable Development Goal (SDG) Number 11.\n\nPresident Mnangagwa said Phase 2 of the New Mbare Musika is designed to be a multi-storey complex with improved sanitation, fire safety features and organised trading spaces, thus resonating with Vision 2030 and the SDGs.\n\nMbare Musika\n\nHe applauded Masimba Construction and Mkambo Misika Hubs, who partnered the Government in the project, for their professionalism and work ethic, which have ensured the completion of Phase 1 of the Market.\n\nEarlier on, President Mnangagwa commended Mbare residents for their consistent support of Zanu PF that saw the revolutionary party winning in that constituency in the 2023 harmonised elections.\n\nBe assured that the interests of the people of our great motherland, Zimbabwe, remain at the core of my Administration. Two weeks ago, I was pleased to receive, at State House, representatives of Vendors and Tuckshops Associations from across the country.\n\nThat engagement, among many others I have had in the recent past, gave me general insights into matters that concern you and the broader Micro, Small and Medium Enterprises sector. Government is seized with facilitating an environment where your businesses can thrive for an improved standard of living for all, he said.\n\nHE commissions Mbare Msika\n\nDefence Minister Oppah Muchinguri-Kashiri said the construction of the market resonated with President Mnangagwas national vision spelt out in the National Development Strategy 1 and Governments ultimate goal of elevating Zimbabweans to a prosperous and empowered upper-middle-income society by 2030.\n\nThis bustling market has been a cornerstone of Zimbabwes SMEs and a vital source of livelihood for traders and their families.\n\nThis initiative has not only restored the markets infrastructure but also upgraded it to a cutting-edge facility, demonstrating Governments commitment to creating an enabling environment for businesses to thrive, she said.\n\nLocal Government and Public Works Minister, Daniel Garwe, said the commissioning of the market was a precursor to the second phase of another market to accommodate more people.\n\nThis event also marks the ground-breaking ceremony of the main market, which is going to accommodate 10 000 traders, he said.\n\nMinister Garwe said following the fire disaster that destroyed stock and stalls, President Mnangagwa directed the engagement of domestic investor, Masimba Holdings, in terms of the urban transformation policy to undertake reconstruction works.\n\nHE commissions Mbare Msika\n\nThe infrastructure, as you have witnessed, Your Excellency, is augmented by social amenities such as banks, Zimbabwe Republic Police Post, advanced security services, CCTV, advanced ablution facilities, advanced fire suppression systems, and availability of water infrastructure, among others, he said.Women Affairs, Community, Small and Medium Enterprises Development Minister, Senator Monica Mutsvangwa, said the new market was set to transform the SMEs sector that has been looked down upon over the years.\n\nMinister of State for Provincial Affairs and Devolution for Harare Metropolitan, Charles Tawengwa, commended President Mnangagwa for restoring the livelihood of traders following the fire outbreak.Yesterdays event was attended by Cabinet Ministers, permanent secretaries, Harare City councillors, captains of industry, Zanu PF leadership, and traders, among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/5RY6-680x380.jpg",
            "description": "Zvamaida Murwira, Harare Bureau SMALL to Medium Enterprises (SMEs) are a key driver of economic growth, broad-based empowerment, job and wealth creation, contributing significantly to the country’s Gross Domestic Product, President Mnangagwa has said. Commissioning the Mbare Musika Traders Market Phase 1, a state-of-the-art facility that is set to benchmark the modern SMEs trading environment, […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "Cannibal killer Jindu goes back to court",
            "url": "https://www.chronicle.co.zw/cannibal-killer-jindu-goes-back-to-court/",
            "content": "Danisa Masuku\n\nRODNEY TONGAI JINDU. The very name conjures a chilling picture of unimaginable horror of a serial killer.\n\nHis confession to the gruesome murders of his two friends  a macabre narrative amplified by the unthinkable admissions of eating their raw liver and cooking their brains  now casts a long, dark shadow once more.\n\nNext week, his re-sentencing appearance at the Bulawayo High Court threatens to tear open the wounds of the families who suffered the irreparable loss of their loved ones to Jindus murderous rampage, that had started to scab.\n\nAs the legal process revisits the horrific details, a fresh wave of raw grief and trauma is inevitable, forcing the relatives to relive the terrifying final moments of their loved ones, a cruel and unwelcome reminder of the monstrous depravity that stole them away.\n\nThe path to this re-sentencing has been long and fraught. Haunted by two counts of murder, Jindu was initially brought before the courts, where Justice Nokuthula Moyo, at the Bulawayo High Court, delivered a sentence of death. This pronouncement in 2018 condemned Jindu to a life contemplating his final reckoning.\n\nHowever, the immutable hand of fate, in the form of the abolition of the death penalty, has irrevocably altered his destiny.\n\nPresident Mnangagwas signing of the Death Penalty Abolition Bill has granted Jindu and 48 other inmates on death row a new, albeit grim, prospect. The gazetted Act now dictates that individuals convicted of murder in aggravating circumstances shall face a lengthy jail term, ranging from 20 years to life imprisonment.\n\nNow, Jindu, incarcerated within the unforgiving walls of Khami Maximum Prison, is scheduled to reappear in court on April 14 at the Bulawayo High Court for re-sentencing.\n\nThis once flamboyant young man, known for his expensive tastes, designer suits, and top-of-the-range vehicles, first seared his name into public consciousness on February 3, 2017. This publication broke the chilling news of his cold-blooded murder of his childhood friend, Cyprian Kudzurunga, a young man of just 28, whose remains he callously buried in a shallow grave on a plot in Bulawayos affluent Burnside suburb.\n\nJindu disturbingly disclosed to investigators that he murdered Kudzurunga out of fear  the fear of exposure. Kudzurunga, it was alleged, had stumbled upon evidence of Jindus ritualistic murder of Mboneli Ncube. In a calculated attempt to conceal his heinous acts, Jindu even sent a deceitful message to Kudzurungas mother, impersonating her son and claiming a sudden departure from the country.\n\nWhile the public reeled from the sheer horror of this revelation, Jindu, already the subject of morbid fascination both within Zimbabwe and beyond, struck again, plunging the nation into further despair.He chillingly recounted to detectives from the Homicide section how a cross-border transporter had approached him, offering a macabre exchange: US$20 000 or a Toyota Quantum for the body parts of Mboneli Ncube. This grotesque proposition, he claimed, ignited his desire to murder his friend Mboneli Ncube, a 30-year-old who lived a mere four houses away in Bulawayos Glengarry suburb.\n\nSoon after, he delivered Ncubes lifeless body to the transporter, who proceeded to harvest the head, hands, and both legs, leaving Jindu with the torso. This he placed in a plastic bag, transported on a wheelbarrow to the same plot in Burnside, and there, with chilling indifference, burnt and buried the remains in four separate shallow graves, mere metres from Kudzurungas final resting place. The gruesome discovery was swiftly reported to the police, triggering an urgent manhunt that culminated in Jindus arrest.\n\nWith a disturbing lack of remorse, Jindu led detectives to the scene, where the fragmented remains of Ncube were exhumed. When questioned by Homicide detectives, he confessed to the dismemberment. Following this horrifying revelation, he was brought before the court.\n\nHis initial court appearance in 2018 was marked by macabre drama as he openly confessed to shooting his two friends and the unspeakable act of consuming their flesh. This prompted Justice Moyo to order a psychiatric evaluation by two state doctors to ascertain his mental state under the provisions of the Mental Health Act.\n\nThe accused persons conduct is prima facie bizarre and abnormal. It is for these reasons that the court finds it fit that a mental examination be conducted to rule out any possibility of mental issues. This will allow the court to proceed to try the accused person after having been satisfied that he is mentally stable, ruled Justice Moyo.\n\nFollowing that, armed with a medical report certifying his mental soundness and fitness to stand trial, he returned to court. He appeared before Justice Moyo again, and during his initial trial appearance, he confessed to hiring his two neighbours to dig the graves. He also claimed to have been intoxicated by heroin and methamphetamine, a synthetic stimulant at the time of the murders.\n\nHowever, Justice Moyo ultimately rejected this defence, convicting Jindu on two counts of murder with actual intent, committed under aggravating circumstances. In delivering the sentence, Justice Moyo deemed capital punishment the most fitting and appropriate for Jindus heinous crimes.\n\nThe accused person is convicted of two counts of murder with actual intent. You killed two people in a space of three weeks. You mutilated the body of the deceased in count one; you took away property belonging to the deceased in count two.\n\nHe executed the murders meticulously by first of all carrying a gun which should have been kept at his mothers home. He then tried in a very clever way to conceal the murders by first sending text messages to the relatives of his victims as to the deceaseds whereabouts. He also deceived the police.\n\nHe even refused to divulge intricate details of the murders hiding behind his fabricated Lucifer image. He cannot be found to be remorseful. His Lucifer version means that he is still bent on tricking the court right up to the end.\n\nIf the accused person does not deserve capital punishment or if he is spared capital punishment then it means the relevance of capital punishment as enshrined in our law will become meaningless, ruled Justice Moyo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/tfhty.jpg",
            "description": "Danisa Masuku RODNEY TONGAI JINDU. The very name conjures a chilling picture of unimaginable horror of a serial killer. His confession to the gruesome murders of his two friends — a macabre narrative amplified by the unthinkable admissions of eating their raw liver and cooking their brains — now casts a long, dark shadow once […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "COMMENT: Zero tolerance to corruption commendable",
            "url": "https://www.chronicle.co.zw/comment-zero-tolerance-to-corruption-commendable/",
            "content": "President Mnangagwa has urged accountants in both the private and public sector to take a firm stand against corruption which he said is an enemy of development. He said Zimbabwe does not tolerate corruption hence the need to unite in fighting the scourge.\n\nPresident Mnangagwa who was addressing delegates to the Charted Accountants Conference hosted by the Public Accountants and Auditors Board (PAAB) Zimbabwe in Harare on Thursday, said accountants are the gatekeepers of the countrys national resources and it was therefore incumbent upon the accounting profession to take a firm stand against corruption.\n\nAs accountants, you play a crucial role in strengthening Public Financial Management (PFM). Further, you are key cogs that enhance financial transparency, accountability and efficiency in both the public and private sectors, he said. President Mnangagwa said Government recognises the role of accountants in supporting private sector growth and Investment through maintaining accurate financial records.\n\nI challenge you, the accountants in both the public and private sectors to be trustworthy gatekeepers of national resources. Every dollar spent must be accounted for, he said.\n\nPresident Mnangagwa\n\nPresident Mnangagwa said accountants are not mere record-keepers of financial transactions but are the architects of economic transformation, custodians of corporate and public finances as well as enablers of national development.\n\nPresident Mnangagwa said loopholes that allow financial mismanagement, illicit financial flows and corporate fraud must be closed with no exceptions.\n\nThe President has said in the past that there is a need for the private sector and other stakeholders to complement Government efforts to fight corruption. He said Government on its part has embarked on a robust programme to strengthen good corporate governance and accountability in the management of public resources. Integrity committees have been set up at public institutions to prevent corruption and promote good corporate governance.\n\nPresident Mnangagwa said the private sector, civil society and other stakeholders should also prioritise transparency and accountability through in-house anti-corruption efforts. The Chartered Governance and Accountancy Institute of Zimbabwe (CGAIZ) has trained police officers and Zimbabwe Anti-Corruption Commission (Zacc) officials in forensic accounting, auditing and cyber security.\n\nPresident Mnangagwa said such collaboration goes a long away in strengthening public institutions to effectively and efficiently deliver on their mandate. He also urged members of the security sector to constantly upgrade their skills to keep abreast with criminals and corrupt elements modern techniques to evade the law.\n\nGovernment has already announced that plans are underway to introduce anti-corruption curricula from ECD to tertiary education as the nation steps up its fight against corruption.\n\nPresident Mnangagwa has said his administration will not shy away from taking corruption by the horns as the scourge has debilitating effects of retarding economic growth and development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ccccccccccccccccccc.jpg",
            "description": "President Mnangagwa has urged accountants in both the private and public sector to take a firm stand against corruption which he said is an enemy of development. He said Zimbabwe does not tolerate corruption hence the need to unite in fighting the scourge. President Mnangagwa who was addressing delegates to the Charted Accountants Conference hosted […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "WATCH: Vice President demands restoration of Mpilo radiotherapy machines",
            "url": "https://www.chronicle.co.zw/watch-vice-president-demands-restoration-of-mpilo-radiotherapy-machines/",
            "content": "Robin Muchetu, Lifestyle Health and Gender Editor\n\nCLOSE to R1 million is required to buy a new Uninterrupted Power Supply (UPS) machine at Mpilo Central Hospital in Bulawayo that will enable cancer patients to receive radiation sessions uninterrupted by power outages.\n\nPatients undergoing cancer treatment with the radiotherapy machine need continuous power supply as the machinery is very sensitive to power fluctuations and any sudden changes or fluctuations with power damages the machine, experts say.\n\nAlready, two of the cancer treatment machines at the hospital are down. This emerged during a visit to the referral hospital by Vice-President Kembo Mohadi on Friday who directed the Treasury to urgently look into the issue and avail the R1 million for the servicing of radiotherapy machines to save lives.\n\nVP Mohadi said critical cancer machinery that services the Southern region must always be functional as patients are incurring huge costs travelling to places like South Africa, India and other destinations.\n\nVice President Mohadi tours Mpilo Central Hospital\n\nMpilo Central Hospital chief medical officer, Dr Narcisius Dzvanga, said the UPS at Mpilo Central Hospital requires 24 batteries to keep it functional and the batteries now need to be replaced. He said according to quotations from South Africa, the set of batteries cost just over R1 million.\n\nDr Dzvanga said the hospital had been told to downsize their UPS machine to match that of Parirenyatwa Group of Hospitals, a proposal that VP Mohadi vehemently rejected.\n\nThat is about US$100 000 needed for the machine. The machine was made like that and it has to run like that. We need to get this machine running, we cannot fail to raise this amount as a country, said the Vice-President. Why do they say it (UPS) machine is too big? No, we do not want that, we want the US$100 000 and Mthuli (Minister of Finance, Economic Development and Investment Promotion) has got to act, said VP Mohadi.\n\nAlmost 50 percent of the cancer patients that visit Mpilo Hospital require radiotherapy but these are not being treated as the machines are down with revelations that the radiotherapy machines were procured and left in storage for many years, causing some of the faults and deterioration of the machines.\n\nThe machines are said to have been locked up at Beira, Mozambique for three years before they were eventually delivered to Bulawayo. All patients requiring radiotherapy are being referred to Parirenyatwa Hospital in Harare and are having to endure long waiting periods of up to five months as the hospital is overwhelmed by the demand for the service.\n\nVP Mohadi said it was too much of a burden for one public institution to be treating cancer in the country.\n\nVice President Mohadi tours Mpilo Central Hospital\n\nParirenyatwa cannot carry the entire nation, it is impossible. We need to have other referral hospitals offering the same service. People are dying every day; they are dying because we cannot avail US$100 000 to have these things fixed. We need to get these machines to function, people pay a lot of money to go to India and the Government also pays a lot of money too, that is foreign currency, which is being wasted, said VP Mohadi.\n\nHe said if the ministry wants to buy new machines its fine but what is urgent at the moment is to fix the machines that the hospital has so that people can start receiving the service.\n\nVP Mohadi said the hospital and cancer patients cannot wait for the promised new machines because it is not known when these will be bought.\n\nWe dont know when the new ones will come or when the money will be available. There is no radiotherapy taking place here and we cannot allow that as a Government, he said.\n\nEverybody cannot go to Harare to seek the services as Harare is already overwhelmed hence the long wait, said VP Mohadi.\n\nHead of Radiotherapy Dr Tatenda Chingonzoh said the waiting periods for treatment were too long.The waiting period for a patient to get on the machine at Parirenyatwa is four to five months because of their own burden plus ours from Mpilo. When we treat cervical cancer, a patient receives treatment for up to six weeks and they need to be in Harare,he said.\n\nDr Chingonzoh said in January engineers came to try and get things running but the problem was the issue of power.\n\nThe cancer machines are down again and we have not managed to treat anybody. For the first quarter of the year, we have seen about 1 200 cancer patients and usually about 50 percent of these patients require radiotherapy services, she said.\n\nDr Dzvanga said the hospital was servicing their machines via a South African company but it later engaged local technicians who unfortunately failed to repair the broken-down machines.We got a local company whose technicians came and spent a week here, only to tell us that they had failed to repair the machines, he said.\n\nDr Dzvanga said to address the problem, Mpilo Central Hospital must have comprehensive service contracts.\n\nA service contract mandates that if there is a minor fault to machinery, they (manufactures) come and attend to that fault and without this, no service can be done and institutions have to pay cash upfront for spare parts, he said.\n\nAbout US$80 000 was at one time disbursed for diagnosing the problem when the radiation machines were down but there was no extra funding for the procurement of spare parts for repairs.\n\nWe have a sort of service contract in place, the engineers have been coming but not quite getting things working. They once came but due to power fluctuation, they could not test the machines, said Dr Dzvanga.\n\nDr Chingonzoh said the hospital was offering chemotherapy only yet many of the cancers that they have such as cervical cancer, require radiotherapy.@NyembeziMu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ty5y5.jpg",
            "description": "Robin Muchetu, Lifestyle Health and Gender Editor CLOSE to R1 million is required to buy a new Uninterrupted Power Supply (UPS) machine at Mpilo Central Hospital in Bulawayo that will enable cancer patients to receive radiation sessions uninterrupted by power outages. Patients undergoing cancer treatment with the radiotherapy machine need continuous power supply as the […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        },
        {
            "title": "Chief’s humility inspires Lulu",
            "url": "https://www.chronicle.co.zw/chiefs-humility-inspires-lulu/",
            "content": "Mbulelo Mpofu\n\nSOUTH AFRICAN travel and lifestyle writer, Lulama Lulu Njapa, was among the over 5000 attendees who graced the Chief Dakamela Achievers Award ceremony in Nkayi, Matabeleland North last Saturday. Lulu found herself particularly moved by Chief Mbusi Bekithemba Dakamelas unassuming nature and his palpable dedication to the preservation of Ndebele culture, a sentiment that resonated deeply with her.\n\nLulu, known for her work across social media platforms and YouTube, shared with Saturday Chronicle that she was born in Umzimkhulu, a region to the south-east of Durban, 42 years ago.\n\nLulu Njapa at the Chale Wote Street Festival\n\nI was born in Durban and I lived there before going to Johannesburg where this journey of mine began. Ive always loved writing from a tender age which was fuelled by my English teacher who would award us if we did well at school. She taught us how to write poetry pieces.\n\nLulu Njapa (centre) attending the Chale Wote Street Festival in Ghana\n\nWhat started the travel writing in particular was through a friend who was writing for American monthly lifestyle magazine, Essence and she was interviewing travel writers and she knew my obsession with travelling around Africa and encouraged me to go for it after she sent me pieces of how the travel writers went about their business and this was in 2018. Since then, I havent turned back, she narrated.\n\nWriting across lifestyle, tourism, and culture, her portfolio also encompasses the arts and fashion, earning her by-lines in prominent publications such as the Mail & Guardian, Sunday Times, City Press, and The Informer Independent Digest Malawi, where she has contributed features and regular columns.Her travels have taken her to numerous African nations, including Namibia, Zambia, and Ghana on several occasions, the latter being a place where her deep appreciation for the continent first took root.\n\nLulu Njapa (right) with Umntwana uGcina Zulu at the Imiklomelo KaDakamela event. (Picture by Adept Dazz Siziba)\n\nMy first trip outside South Africa was to Ghana (where she attended the Chale Wote Street Art Festival) after I quit my job at a telecoms company, and I felt a profound sense of anticipation. My fascination with Ghana was ignited in 2002 when I met the renowned poet, Atukwei Okai, in Durban. At 20 years old, his words stirred something within me, sparking a desire to explore the heart of Africa, a journey that has shaped my identity ever since, she shared.\n\nLulu Njapa\n\nZimbabwe holds a special affection for her, owing to the warm welcome she consistently receives from its people and the linguistic similarities between iSiNdebele and her native IsiXhosa. Lulu recounted her enjoyment of Imiklomelo KaDakamela, noting that it provided her with a novel experience  her first night spent under canvas, albeit one tinged with a confessed fear of spiders.\n\nKoDakamela was quite a different experience for me, firstly because it was my first time to be in Zimbabwe for a significant amount of time and I had to camp. What intrigued me the most is that the chief himself is one with the people. He doesnt consider himself up there.\n\nLulu Njapa arriving in Zimbabwe for the Imiklomelo KaDakamela event\n\nWhen we slept, I didnt notice that he was there with us but in the morning, I realised that he actually slept where everyone else did, a humble gesture if you ask me. The way he was interacting with everyone showed that he is well-grounded. He didnt treat people like his subjects but rather, people he holds dear, she said.\n\nLulu loves culture but wouldnt call herself a cultural activist or ambassador because in as much as she loves it, there are some parts that she doesnt resonate with, especially those that dont uplift women.Follow on X@MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-21.36.46-3.jpeg",
            "description": "Mbulelo Mpofu SOUTH AFRICAN travel and lifestyle writer, Lulama “Lulu” Njapa, was among the over 5 000 attendees who graced the Chief Dakamela Achievers’ Award ceremony in Nkayi, Matabeleland North last Saturday. Lulu found herself particularly moved by Chief Mbusi Bekithemba Dakamela’s unassuming nature and his palpable dedication to the preservation of Ndebele culture, a sentiment […]",
            "time": "08:36",
            "date": "13 Apr 2025"
        }
    ]
}