{
    "news": [
        {
            "title": "President urges global dialogue",
            "url": "https://www.chronicle.co.zw/president-urges-global-dialogue/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nZIMBABWE stands firm in its commitment to peaceful international relations, President Mnangagwa declared yesterday, urging a culture of constructive dialogue to resolve global conflicts.\n\nAddressing diplomats at State House, he emphasised Zimbabwes friend to all, enemy to none approach and its readiness for progressive engagement.\n\nMy Governments Foreign Policy thrust of Engagement and Re-engagement has yielded responsive policies that harness opportunities and manage divergence.\n\nUndoubtedly, the ongoing engagements have opened new frontiers of co-operation and partnerships. I commend you all for your role in advancing this focus area.\n\nTogether, let us do more as we entrench a culture of dialogue within our international relations cooperation frameworks, he said.\n\nOn the subject of dialogue, President Mnangagwa further stated, Zimbabwe remains open for dialogue aimed at the total removal of illegal sanctions.\n\nThe illegal economic sanctions, coupled with the prevalence of climate change-induced natural disasters and weather phenomena, are negatively impacting our economy.\n\nHowever, domestic resource mobilisation, diaspora remittances, and inflows of Foreign Direct Investments are augmenting the national fiscus.\n\nOur people and the economy are demonstrating extraordinary resilience, unity of purpose, innovation, and resourcefulness, he said.\n\nPresident Mnangagwa\n\nThe President then expressed gratitude to SADC and other partners for their continued support in advocating for the unequivocal removal of the illegal embargo.\n\nI extend gratitude to our SADC family and African brothers and sisters for their principled support and solidarity, as they amplify calls for the lifting of sanctions. We also acknowledge the support we are receiving from the Group of Friends in Defence of the United Nations Charter, the Like-Minded Group, and the Non-Aligned Movement, he said.\n\nPresident Mnangagwa said the Government was committed to inclusive growth, democracy, constitutionalism and ensuring peace and stability for economic prosperity.\n\nThrough our multifaceted and people-centred development strategies, we are lifting more of our people out of poverty into prosperity. We look forward to journeying along this exciting path with you and the countries as well as organisations you represent. Together, let us navigate the complex challenges affecting our world and the immense opportunities presented before us, he stated.\n\nYesterdays gathering of ambassadors and international organisations fostered closer interaction between mission heads and the Government. The President encouraged them to submit objective and factual reports about Zimbabwe to their countries.\n\nMay you find satisfaction and pride in taking our relations to a new level. Our doors remain open and arms outstretched as we dialogue and work in harmony towards a shared prosperity and brighter future for our peoples, President Mnangagwa said.Zimbabwe, he stressed, maintains its stance as a friend to all and an enemy to none, reiterating that the country is very much open for business.\n\nZimbabwe is a friend to all and an enemy to none. We are open for business, and your nationals are welcome to pursue investments in our mining sector. Further, leveraging our strategic central location in the southern region, we are determined to work with our neighbours and investors to expand and modernise the North-South Corridor, to enhance global supply chains and logistics, he said.\n\nPresident Mnangagwa said Zimbabwe is committed to multilateralism and the principles of the United Nations Charter, while seeking support for a non-permanent United Nations Security Council seat.\n\nThe principles of equality and respect for each others interests should always guide us in our interactions. There are no big or small nations. Zimbabwes candidature for a non-permanent seat on the United Nations Security Council for the term 2027 to 2028 has been endorsed by SADC and the African Union. Our candidacy is deeply rooted in our commitment to global peace and security, an inclusive, fair, and equitable international rule-based system, he said.\n\nPresident Mnangagwa said the Second Republic is implementing comprehensive reforms to achieve an upper-middle-class economic status by 2030.\n\nThis has resulted in various political, economic and legislative reforms, as well as the implementation of a broad array of people-centred projects to guarantee household food security, improve incomes, and develop critical enablers to propel the modernisation and industrialisation of our economy.\n\nThe projected recovery in agricultural output is expected to drive economic growth to six percent, buoyed by the expected bumper harvest, following a successful summer season, he said.\n\nPresident Mnangagwa informed the diplomats about the Governments initiatives to achieve national goals.Government introduced the concept of Village Business Units and Nutrition Gardens. Under the Presidential Drilling Programme, we are drilling boreholes in all our 35 000 villages. We, thus, invite your Missions to partner these initiatives from the perspective of training and capacity building as well as value addition and sourcing of export markets as we promote market-driven productivity.\n\nUnder our Agriculture Transformation Strategy and the Village Business Unit Concept, Zimbabwe envisions improved incomes and higher standards of living for our grassroots communities and to also contribute to global food security and nutrition.\n\nIn mitigating climate change, we are expanding dam construction, water conveyance, and resuscitating irrigation schemes. These initiatives provide scope for further partnerships, co-operation, and investments. The growth of the agriculture sector, as the bedrock of our agriculture-based industry, entails the need for retooling, expansion, and diversification of our manufacturing sector. I challenge you, Your Excellences, in your respective missions, to promote investments along related value chains.\n\nPresident Mnangagwa praised ambassadors for promoting Zimbabwe as a tourist destination. He noted that Africa, the SADC region, and Zimbabwe are focusing on modernisation, value addition, and industrialisation of their economies.Riding on our abundant natural resources, Science, Technology, and Innovation solutions, I exhort your Missions to deliberately promote co-operation from your capitals around these aspects, as we create stronger synergies for the Africa we all want.\n\nMeanwhile, my Government looks forward to positive outcomes of engagements with the international community under the Arrears Clearance and Debt Resolution Process, he said.\n\nMaize crop affected by intense El Nio-induced dryness\n\nRegarding last years El Nio-induced drought, the President expressed gratitude for the timely humanitarian aid, technical expertise, and moral support received from different countries and organisations.President Mnangagwa who is the chairman of SADC, said Zimbabwe will continue promoting innovation to unlock opportunities for sustainable economic growth and development towards an industrialised SADC.\n\nOn the peace and security challenges in the region, particularly in the Eastern Democratic Republic of Congo, he said Zimbabwe is playing its part through SADC and East African Community initiatives to find lasting peace.\n\nOn his part, Dean of the diplomatic corps, Rwandan Ambassador James Musoni, said they will continue rallying behind President Mnangagwas leadership.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-3-5-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau ZIMBABWE stands firm in its commitment to peaceful international relations, President Mnangagwa declared yesterday, urging a culture of constructive dialogue to resolve global conflicts. Addressing diplomats at State House, he emphasised Zimbabwe’s “friend to all, enemy to none” approach and its readiness for progressive engagement. “My Government’s Foreign Policy thrust of […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "From die-hard to disloyal: Shifting sands of football support",
            "url": "https://www.chronicle.co.zw/from-die-hard-to-disloyal-shifting-sands-of-football-support/",
            "content": "Innocent Kurira,[emailprotected]\n\nFOOTBALL has always been more than just a game; its a culture, a way of life, and a form of expression. But as the sport evolves, so does the relationship between fans and the teams they support. The loyalty, passion, and deep connections that have defined football fandom are now being tested like never before. Fans who once followed their teams through thick and thin are beginning to question their allegiance. Do they remain loyal when times are tough, or do they jump ship at the first sign of trouble?\n\nHistorically, the bond between fans and their clubs was built on unwavering loyalty. But as expectations rise and clubs struggle financially or face performance challenges, that bond starts to crack. In Zimbabwes local league, a surge in fan defections from traditional powerhouses to newly-formed clubs is a clear sign of changing loyalties.\n\nBoban, a long-time Dynamos supporter, recently made headlines when he publicly declared his split from the club in favour of Scottland FC, a newly promoted team. In a viral video, he explained his decision:\n\nThe traditional teams are abusing players by not paying them. That is why they hate Scottland FC. I have left Dynamos.The defections didnt stop there. Ogege, another die-hard Dynamos fan, was spotted attending matches for MWOS FC, a rival club. When confronted, he admitted to supporting both teams, sparking a debate about what loyalty truly means. Then came Richard Sande, known as CheMhofela, who made a dramatic switch to Scottland FC during a match at Rufaro Stadium.\n\nI am sorry, I no longer support CAPS United. I have a family to feed. I was the second-best supporter in the land last season, and I didnt get any recognition from CAPS United. What else do you expect from me?\n\nBoban and CheMhofela\n\nFor their moves to Scottland the duo of Boban and CheMhofela received cars from Scottland.The defections are not limited to local football. In 2021, South African fan favourite Mama Joy shocked fans when she left Orlando Pirates to join Royal AM, an unexpected move that highlighted the growing trend of supporters shifting their allegiances for personal or financial reasons. This shift in loyalty poses a challenge for traditional clubs such as Dynamos, CAPS United and Highlanders, which have long boasted large numbers of fans. But as financial struggles and a lack of recognition from these clubs take their toll, their once-steadfast supporters are increasingly drawn to newer, more ambitious clubs.\n\nThe trend reflects a broader, global shift in football fandom. Clubs that fail to offer what fans need  whether its financial incentives, recognition, or a sense of community  are seeing their support base dwindle. Newer clubs like Scottland FC, with their attractive fan packages, are gaining traction as they make a case for the shifting nature of loyalty.\n\nProsper Ndebele, a Bulawayo-based football fan, weighed in on the trend:Theres always a benefit to supporting a football club, whether its excitement, community, or even financial incentives. But for many fans, loyalty is becoming increasingly transactional. If the team cant offer what fans need, theyll look elsewhere.\n\nThe growing trend of fan defections raises important questions about the future of football. As financial pressures and changing expectations reshape the relationship between fans and clubs, the question remains: will loyalty survive, or will the sport evolve into something more transactional? Only time will tell.@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/iuoyi.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw FOOTBALL has always been more than just a game; it’s a culture, a way of life, and a form of expression. But as the sport evolves, so does the relationship between fans and the teams they support. The loyalty, passion, and deep connections that have defined football fandom are now being tested […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "Midnight murder:  Sergeant shot in Sizinda",
            "url": "https://www.chronicle.co.zw/midnight-murder-sergeant-shot-in-sizinda/",
            "content": "Peter Matika / Danisa Masuku\n\nA domestic violence call in Bulawayos Sizinda suburb turned deadly yesterday morning when one of the officers who responded to the distress call was shot dead. Sergeant Abel Masava (43), stationed at ZRP Tshabalala was shot in the head and he died while being rushed to hospital.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident and said investigations were underway.The incident occurred at approximately 00:30 hours and the suspects disappeared into the darkness soon after the shooting.\n\nThe Zimbabwe Republic Police is investigating the fatal shooting of a police officer in Sizinda suburb, Bulawayo, on March 28, 2025. The officer was in a police vehicle with a colleague, said Comm Nyathi.\n\nThe blood near the gate of the house where the incident took place\n\nHe said that the officers had responded to a domestic violence complaint when Sergeant Masava was shot. Upon arriving at the residence, the officers found the gate locked. While the other officer only identified as Constable Magaya was knocking on the gate, the late Sergeant Masava, who was leaning against the police vehicle, noticed five men dressed in black walking past. He stopped them, requesting identification and inquiring about their movements.\n\nSuddenly, one of the men produced a firearm and shot Sergeant Masava in the head. He collapsed and the suspects fled the scene. Constable Magaya immediately reported the incident to the Officer-in-Charge at ZRP Tshabalala.\n\nOfficers from the station, the Dog Section and the Criminal Investigation Departments Homicide Unit attended the scene. They found Sergeant Masava lying on the ground outside the gate where they intended to assist the caller. He was still breathing at the time.\n\nSergeant Masava was rushed to United Bulawayo Hospitals (UBH), where he was pronounced dead on arrival. An investigation into the fatal shooting is underway, and authorities are appealing for any information that may lead to the arrest of the suspects.\n\nThe Zimbabwe Republic Police is appealing for information that may lead to the arrest of the suspects, said Comm Nyathi.Sizinda residents said they heard the gunshots but were too frightened to investigate.\n\nIt happened in the dead of the night. We heard a loud crack like a gunshot, followed by the sound of people running. We didnt dare come out to see what was happening because we were terrified. We only noticed later a heavy police presence and knew something serious had occurred. In the morning, we saw blood near the gate of the house where the incident took place, said a resident who refused to be named.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/gder.jpg",
            "description": "Peter Matika / Danisa Masuku A domestic violence call in Bulawayo’s Sizinda suburb turned deadly yesterday morning when one of the officers who responded to the distress call was shot dead. Sergeant Abel Masava (43), stationed at ZRP Tshabalala was shot in the head and he died while being rushed to hospital. National police spokesperson […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "Zambezi River Authority’s increased water allocation for electricity cuts load shedding",
            "url": "https://www.chronicle.co.zw/zambezi-river-authoritys-increased-water-allocation-for-electricity-cuts-load-shedding/",
            "content": "Debra Matabvu, Harare Bureau\n\nTHE Zambezi River Authority (ZRA) has increased water allocation for electricity generation at Kariba Dam, resulting in the countrys power generation surging to over 1 600 MW daily and a noticeable reduction in nationwide load shedding.\n\nThe ZRA, which manages the Kariba Dam on behalf of the Zimbabwean and Zambian Governments, recently authorised an increased water release for power generation, allowing each country to produce 485 MW per day, up from 185 MW.\n\nThis increase follows the rise in water levels at the dam over the past few months, attributed to normal to above-normal rainfall across the region during the 2024/25 rainy season. As of yesterday, the country was generating 1 622 MW, with Hwange contributing 1066 MW, Kariba 485 MW, and Independent Power Producers (IPPs) 71 MW.\n\nPeak energy demand stands at 2 000 MW.In an interview, Energy and Power Development Minister July Moyo stated that the power situation is poised to improve further in the coming months, thanks to various Government initiatives.\n\nWe received an increased water allocation for both Zimbabwe and Zambia, allowing each country to generate 485 MW, up from 185 MW, significantly boosting power generation. We expect Unit 7, which was undergoing routine maintenance to return to the grid in the next few days thereby further enhancing power generation.\n\nAdditionally, we expect that from April onwards, some IPPs such as Chiredzi Green Fuel, will begin feeding their power into the national grid, he said.\n\nZimbabwe has faced persistent power shortages in recent years, exacerbated by El Nio-induced droughts and the ongoing refurbishment of older units at Hwange. Despite reduced power generation at Kariba Hydropower Station, national power generation has averaged 800-1 000 MW daily, thanks to Government measures, particularly the expansion of Hwange Units 7 and 8 last year.\n\nThe synchronisation of Units 7 and 8 in 2023 led to a substantial improvement in power generation. The Zimbabwe Power Company (ZPC) is refurbishing six power generation units at Hwange funded by a loan from the Export-Import Bank of India.Improved power generation will enable Zimbabwe to reduce electricity imports, alleviate power cuts, and stimulate industrial production.\n\nFurthermore, increased local power generation will save the country millions of US dollars spent on monthly electricity imports.\n\nZimbabwe has been importing electricity from Zambia, Mozambique and South Africa to bridge the supply gap.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/Untitled-53-1.jpg",
            "description": "Debra Matabvu, Harare Bureau THE Zambezi River Authority (ZRA) has increased water allocation for electricity generation at Kariba Dam, resulting in the country’s power generation surging to over 1  600 MW daily and a noticeable reduction in nationwide load shedding. The ZRA, which manages the Kariba Dam on behalf of the Zimbabwean and Zambian Governments, […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "COMMENT: Performance contracting will definitely keep public sector on its toes",
            "url": "https://www.chronicle.co.zw/comment-performance-contracting-will-definitely-keep-public-sector-on-its-toes/",
            "content": "President Mnangagwa said the performance contracting that Government introduced in 2021 has had a propelling effect and enabled stakeholders including ordinary citizens, to assess progress by ministries, Departments and Agencies (MDAs).\n\nHe said since its introduction, the system, which has cascaded to Deputy Ministers, has registered notable milestones across all sectors including steady economic growth, introduction of ZiG, launch of the Presidential Title Deeds Programme and the establishment of Village Business Units among other initiatives.\n\nIn his address at the announcement of the 2024 Performance Evaluation Results and 2025 Performance Signing Ceremony held at State House in Harare on Monday, President Mnangagwa said the Second Republic was committed to achieving an agile, innovative, responsive and resilient governance system, pursuant to delivering what is needed by the general citizenry.\n\nRiding on the current momentum, more reforms will continue to be implemented, guided by the global best practice which takes into account the unique needs and challenges of our country, he said.\n\nPresident Mnangagwa said those serving in the public sector must resist the temptation of complacency and comfort as both betray the sacred trust and confidence bestowed on the Government and other departments by the general citizenry.\n\nPresident Mnangagwa presents the Second Best Performing Chief Executive Officer Rural Local Authorities Award for 2024 to Umguza Rural District Council CEO Mr Collen Moyo at State House in Harare during a signing ceremony for performance contracts and an awards ceremony for ministers and senior public sector officials.  Picture: Believe Nyakudjara\n\nHe said as Government continues to roll out results-based management initiatives across the public service spectrum, it was disappointing to note that some Government officials were yet to adopt performance contracting.\n\nIt is disappointing that there are some officials who are yet to acquaint themselves and adopt performance contracting and the formulation of strategic plans, he said.\n\nPresident Mnangagwa said it was important for public sector officials to keep up with the ongoing reforms. He said the Second Republics foremost duty is to uplift Zimbabweans livelihoods.\n\nWe want at this juncture to commend Government for introducing performance contracting whose objective is to improve service delivery.\n\nIt is our hope that those given the responsibility to implement this system will continue to improve it so that every public sector worker is made accountable for his or her performance.\n\nPublic sector service delivery has direct impact on the countrys economic performance hence the need for all public sector workers to strive to improve service delivery.Zimbabwe can only become an investment destination of choice if the investors are happy with the public sector workers services.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/90.jpg",
            "description": "President Mnangagwa said the performance contracting that Government introduced in 2021 has had a propelling effect and enabled stakeholders including ordinary citizens, to assess progress by ministries, Departments and Agencies (MDAs). He said since its introduction, the system, which has cascaded to Deputy Ministers, has registered notable milestones across all sectors including steady economic growth, […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "SCOTT’S HUGE GAMBLE… Four reasons why Bosso/Scottland will win tomorrow’s match",
            "url": "https://www.chronicle.co.zw/scotts-huge-gamble-four-reasons-why-bosso-scottland-will-win-tomorrows-match/",
            "content": "Innocent Kurira,[emailprotected]\n\nFEW encounters in the Castle Lager Premier Soccer League carry the weight of this one. Tomorrow, Barbourfields Stadium prepares to host an epic clash, as Highlanders welcome ambitious Harare side, Scottland FC, in a match that promises fireworks.\n\nThere is already tension fuelled by Scottlands owner, Pedzisayi Scott Sakupwanyas, audacious prediction of a 4-0 victory on enemy turf.\n\nThe question hangs heavy: can the nouveau riche of Zimbabwean football truly breach the once formidable fortress, Barbourfields Stadium? Inspired by Sakupwanyas 4-0 prediction, here are four compelling reasons why each team holds the potential for victory.\n\nWhy Highlanders can conquer ScottlandThe underdogs biteHighlanders enter this fixture as perceived underdogs, a label that could prove their greatest asset. Freed from the burden of expectation, Bosso may unleash a raw, unbridled spirit. Football, after all, is a theatre of unpredictability, and the underdogs defiance could ignite a fire within the players.\n\nMidfielder , Mason Mushore\n\nThe roar of the 12th manBossos most potent weapon on Sunday might not be on the pitch, but in the stands. Coach Kelvin Kaindu, aware of a challenging start to the season, has placed his faith in the Black and White Army, their secret weapon. The electric atmosphere of a packed Barbourfields Stadium could propel Bosso to extraordinary heights. Moreover, the unexpected alliance of Dynamos fans, publicly pledging their support, further amplifies the home sides resolve. This surprising unity, reminiscent of the united front against Scottland at Rufaro Stadium, could prove a decisive factor.\n\nBosso fans\n\nThe weight of expectationScottland, reeling from a humbling defeat to Ngezi Platinum, bear the heavy mantle of expectation. Anything less than a victory will dent their burgeoning reputation. Highlanders, plagued by injuries and early-season struggles, carry a lighter burden, potentially thriving under less intense scrutiny.\n\nSakupwanyas provocationSakupwanyas bold, some might say reckless, 4-0 prediction could serve as the perfect catalyst for Highlanders. Such bravado, bordering on disrespect, could ignite a fierce determination to prove that financial muscle cannot overshadow the clubs pride and legacy. Highlanders are Highlanders, and no amount of bluster can diminish their standing in Zimbabwean football.\n\nWhy Scottland can overpower HighlandersSeasoned warriorsScottlands squad boasts a wealth of experience, with players like Khama Billiat, Walter Musona, and Talbert Shumba bringing invaluable PSL know-how. They have weathered the storm of Barbourfields intimidating atmosphere before, and are unlikely to be daunted by the occasion. Highlanders, in contrast, are still forging their identity, with many new faces acclimating to top-flight football.\n\nKhama Billiat\n\nSheer quality\n\nThe gulf in quality between the two sides is undeniable. Scottlands roster is a constellation of Zimbabwean talent, including former Bosso stars Peter Muduhwa and Lynoth Chikuhwa. A simple glance at the line-ups reveals Scottlands edge in individual brilliance, moments of magic that could prove decisive.\n\nPeter Muduhwa\n\nA statement of intentFor Scottland, a victory is more than just three points; its a resounding declaration of their title ambitions. Conquering Highlanders at their fortress would send a chilling message to the rest of the league: Scottland are here to dominate.\n\nThe ghosts of BarbourfieldsThe return of Muduhwa and Chikuhwa adds a layer of dramatic intrigue. These former Bosso stalwarts, returning to the stage where they made their name, will be driven to prove their worth against their old club. Their intimate knowledge of Barbourfields and its atmosphere could prove a crucial advantage.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-999.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw FEW encounters in the Castle Lager Premier Soccer League carry the weight of this one. Tomorrow, Barbourfields Stadium prepares to host an epic clash, as Highlanders welcome ambitious Harare side, Scottland FC, in a match that promises fireworks. There is already tension fuelled by Scottland’s owner, Pedzisayi “Scott” Sakupwanya’s, audacious prediction of […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "School dropout, gun-runner, inmate… Gumede’s harrowing tale of crime and loss",
            "url": "https://www.chronicle.co.zw/school-dropout-gun-runner-inmate-gumedes-harrowing-tale-of-crime-and-loss/",
            "content": "Givemore Muzariri\n\nMEET Jethro Mthokozisi Gumede, a man whose life has been marred by loss and regret. Once a loving father and husband, his world was turned upside down when he was sentenced to 28 years in prison for armed robbery and car hijacking, later reduced to 20 years on the condition he wouldnt re-offend within five years.\n\nDuring his sentence, Gumedes life continued to unravel. His wife left him, taking their only child. The family home was sold to pay off debts, and three cars disappeared without a trace. To make matters worse, his parents passed away while he was incarcerated, leaving him without a support system. Upon his release, he had no family, no home, and no clear direction, forcing him to start from scratch after 20 years in prison.\n\nMy brother, to be honest I am a failure and I am failing to forgive myself for what I did to myself and even to those close to me. If it was not for lack of patience I would be a better person living a better life. It was unfortunate that I grew up in a society that had a lot of omalayitsha and whenever they came back from South Africa, they used to share their best moments across Limpopo River.\n\nThat information really inspired me to an extent that I decided to drop out of school to join these guys. Little did I know that my decision would land me in a place like Khami Maximum Prison, he said.Gumede revealed that after dropping out of school, he went to South Africa, where his friends trained him in handling guns.\n\nThis training led him to high-profile crimes, specialising in robberies and car hijackings.I got to South Africa and I was given a guy to teach me how to handle guns and in the process they told me that my money was supposed to come out of that weapon. So it was time to graduate from childhood to manhood within a short space of time.\n\nI was taken through a rigorous training of weapon handling for about a year and in the process I was also equipped with the best skills to escape from any situation without being hurt or caught,he said.\n\nJethro Mthokozisi Gumede\n\nAfter completing his training, he quickly took to the field, enjoying his work robbing people and hijacking vehicles. They targeted high-value SUVs, particularly Toyota and Isuzu models, which fetched up to $30000 in the Mozambican market.After four years with his team, Gumede gained enough experience to break away and form his own group based in Botswana, raiding various parts of Southern Africa. His former teammates saw this move as a betrayal.\n\nI really enjoyed working with my home boys, who initiated me into the game of crime but after having spent four years together I discovered the importance of growing up and with that in mind I later thought of leaving the group to start my own thing. Like any other leader I went back home to recruit the guys that I felt comfortable working with in all the operations that had a potential of giving us money, he said.\n\nFeeling betrayed, the leader of the group informed police in Zimbabwe that Gumede was behind the Bellevue garage robbery, which resulted in a police officer being shot. The Zimbabwe Republic Police (ZRP) reported this to Interpol Pretoria, leading to Gumedes arrest and imprisonment for 20 years.\n\nWhen I got to prison I actually attempted to commit suicide but while in the process I asked myself what my daughter would say about my actions. I immediately calmed myself down and accepted the situation that was on the ground. This later saw me adjusting to the new environment with the aim of realigning my life which had gone way ward. The chaplain section at Khami Remand Prison took me for a number of counselling sessions and it really helped me to understand that I was in prison to change my behaviour, he said.\n\nThrough counselling sessions in prison, Gumede realised that his incarceration was an opportunity to reflect on his life and transform into a productive citizen. He returned to school, starting from Grade Three up to form four, although he couldnt sit for his final exams due to lack of funds.\n\nI would like to thank the opportunity that I was given by Zimbabwe Prisons and Correctional Service to go back to school and at least have an opportunity to have an appreciation of what would be happening in class. Just being in class really helped me to think like a normal human being, knowing the difference between the good and the bad as we interact with other people in our society.\n\nSoon after attending my school classes up to Form Four, I discovered that I had the potential to change my life for the best. While at school I realised that I was a talented musician so I decided to join a group called Abahambi. While with the group we performed to entertain and educate other inmates who were following our music while in prison and from that platform I developed confidence to start a group of my own, he said.\n\nJethro Mthokozisi Gumede and his daughter\n\nWhile in prison, Gumede learned that his wife had been evicted from their home by his relatives, leading to a long period of depression. To rediscover himself, he became a full-time accapella musician. The eviction forced his family to return to her parents house.\n\nI went through the most difficult times whilst in prison and I think you can imagine, you in prison and your family is evicted from your house by your selfish relatives. Honestly, I had no control over what was happening but to simply watch and as a counter measure to that stress I decide to join Abahambi. The music might have been entertaining but to me it was a way of trying to console myself from what I was going through and of interest three cars that I left disappeared with no trace to this day, he said.\n\nIn 2020, Gumede was transferred from Khami Remand Prison to Khami Maximum Prison, where he formed a group called Amabhubesi Sons of Asegai. They competed on various platforms and were later invited to participate in imbube celebrations organised by Black Umfolosi.\n\nJethro Mthokozisi Gumede\n\nGumede said he left a legacy with Amabhubesi Sons of Asegai in prison before benefiting from the presidential amnesty in 2024. After his release, he moved back to South Africa to start over, having lost everything at the time of his arrest.\n\nSoon after being released from prison I travelled to my rural home to see where my parents had been laid to rest while I was still serving my sentence. It was not an easy thing for me to accept that I had lost all my beloved ones while in prison. I recently located my daughter in South Africa and it is painful that she only got to see me physically after 22 years.\n\nWhen we interact I can tell that I am dealing with a broken child, who never had an opportunity to grow up and experience the love of her father. I would like to urge my young brothers and sisters out there to avoid crime as it has got long term effects, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/rttg.jpg",
            "description": "Givemore Muzariri MEET Jethro Mthokozisi Gumede, a man whose life has been marred by loss and regret. Once a loving father and husband, his world was turned upside down when he was sentenced to 28 years in prison for armed robbery and car hijacking, later reduced to 20 years on the condition he wouldn’t re-offend […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "Let’s rejoice, yes, rejoice",
            "url": "https://www.chronicle.co.zw/lets-rejoice-yes-rejoice/",
            "content": "Stephen Mpofu, Perspective\n\nEARLIER this week, representatives from an education coalition expressed concern on a local radio station about the fatigue experienced by children walking 8 kilometres one way to school. This was a subtle suggestion that measures should be taken to reduce the distances children travel in their pursuit of education and, consequently, skills for national development, in line with our Presidents philosophy: Nyika inovakwa nevene vayo/ilizwe lakhiwa ngabanikazi balo/a country is built by its owners.\n\nIn response to the reported plight of the schoolchildren, a spokesman for the Ministry of Primary and Secondary Education stated: The Government is constructing more schools through public-private partnerships to ensure that there is a primary school within 5 kilometres and a secondary school within 10 kilometres.\n\nThis news from the ministry deserves celebration by all Zimbabweans, particularly those in rural areas where the majority of the population resides and where learners have to walk long distances to access education, unlike their counterparts in urban areas where schools are present in virtually every residential area.\n\nZimbabwe is rated among the African countries with the highest literacy rates. The governments reported moves to bring schools, and thus education, closer to more people will undoubtedly boost our nations literacy rates to even higher levels on the continent. However, high literacy not matched by job skills will not overcome developmental challenges.\n\nOur independent government is addressing what the colonial and racist Rhodesian regime either deliberately or ignorantly failed to do. As a result, many black Zimbabweans who could not access basic, let alone higher, education migrated to the diaspora, especially South Africa, where the Boers in power needed cheap labour that oppressed fellow blacks in that country could not provide.\n\nAs someone born and raised in rural Rhodesia, I was among the pupils who travelled long distances to school from our villages, riding donkeys that were tethered to trees and released when classes were over. The hungry mounts would gallop back home much faster, with the riders clinging tightly to their backs.\n\nThere are still areas in the countryside, dubbed the sticks by colonial rulers, where schools built by missionaries are not easily accessible to learners.\n\nThe racist colonial Rhodesian regime preferred an uneducated population to provide cheap labour, fearing that educated blacks would challenge it, which indeed happened, leading to our self-governance today.With our majority Government and private partners bringing education closer to the people, primary and secondary schools will eventually become accessible to everyone. Therefore, patience is essential.\n\nPatriotism, unity, and peace should help accelerate the provision of education closer to Zimbabweans wherever they live, equipping them with the skills to develop our motherland for the benefit of every citizen and to enjoy a brighter future.So, let us all patriots celebrate whenever our government, on its own or with the help of good Samaritans, fills unsightly potholes, cuts down trees, and levels anthills obstructing our path to independence and sovereignty, leading to a brighter future.\n\nBut to return to the subject of this discourse, education, all progressive Zimbabweans should crack sumptuous smiles at reports that a total of 8 000 teachers would be recruited this year alone as that literally amounts to the icing on Zimbabwes education cake.\n\nEpela  or end, as some people in neighbouring Zambia would say.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/12/Longwalk.jpg",
            "description": "Stephen Mpofu, Perspective EARLIER this week, representatives from an education coalition expressed concern on a local radio station about the fatigue experienced by children walking 8 kilometres one way to school. This was a subtle suggestion that measures should be taken to reduce the distances children travel in their pursuit of education and, consequently, skills […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "Regent Chief Mabhikwa vows to serve despite legal battle",
            "url": "https://www.chronicle.co.zw/regent-chief-mabhikwa-vows-to-serve-despite-legal-battle/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nWITH unwavering resolve, Regent Chief Mabhikwa of Lupane has declared that, notwithstanding a High Court application lodged by some of her clan members challenging her appointment, she will proceed with her duties, undeterred and without pause.\n\nThe chieftainship became vacant following the tragic road accident that claimed the life of Chief Mabhikwa (Vusumuzi Khumalo) on 22 May 2022. Initially, his uncle, John Khumalo, was appointed acting chief. However, earlier this year, Zanele was named regent chief by the Government, tasked with serving for nine years until Vusumuzis son, Wayne Makhosemvelo Khumalo, reaches adulthood and assumes the position of substantive chief.\n\nA faction of the family has rejected the appointment of Ms Zanele Khumalo (35) as regent chief, citing cultural traditions that allegedly preclude women from assuming such roles.\n\nI will not comment on the statements made by some of my family members, as the matter is now before the courts. We will await the courts decision, but in the meantime, I am proceeding with my duties to serve the community. The work continues unabated, and I have encountered no obstacles in carrying out my responsibilities, said the composed regent chief during a brief interview at the commissioning of two classroom blocks at Gobakhulu Primary School in Jotsholo on Tuesday.\n\nThe two blocks were constructed by Hand in Hand Zimbabwe, funded by the Japanese Embassy in Zimbabwe to the tune of US$72,000 under its Grant Assistance for Grassroots Human Security Projects (GGP) scheme.\n\nRegent Chief Mabhikwa addresses villagers at Gobakhulu Primary School in Jotsholo on Tuesday\n\nDuring the ceremony, Regent Chief Mabhikwa received traditional recognition from dignitaries, including the guest of honour, Deputy Minister of Local Government and Public Works, Albert Mavhunga. As she was introduced by the Lupane District Development Coordinator (DDC), Ennerty Sithole, local women knelt and began singing Khumalo clan praise songs, while men broke into whistles, as is customary to show respect to chiefs.\n\nThroughout, the elegantly dressed regent chief remained composed in her chair.She was later asked to give a vote of thanks and, with her peoples needs in mind, made an impassioned plea to the Government and other stakeholders to provide piped water to Gobakhulu Primary School.\n\nI am grateful to all parties who contributed to this project, particularly the Embassy of Japan and Hand in Hand Zimbabwe. However, I appeal to the Honourable Deputy Minister Mavhunga to assist in providing piped water to the school. As you can see, there is no water here, and the young learners and our teachers are facing difficulties, said Khumalo.\n\nShe noted that teachers, while appreciative of the cottage, were concerned about the lack of piped water, a situation that might lead some to seek transfers to schools with clean water.\n\nAccording to our sister publication, Sunday News, legal challenges by John Khumalo also delayed the installation of the previous Chief Mabhikwa, Vusumuzi Khumalo. At that time, John and his supporters within the family alleged that Nicholas Khumalo, Vusumuzi and Zaneles father, had not been the rightful Chief Mabhikwa.\n\nTheir challenge stemmed from the long-held belief that, as Nicholass mother, the original Chief Mabhikwas first wife, was a Mabhena, she could not be designated as the mother of his rightful heir. Chief Mabhikwas first three wives were all Mabhena, and therefore their children could not be considered first in line for succession. According to claimants to the throne, the heir should have come from MaMkhwananzi, a wife he married later, as per tradition. However, when he died in 1983, Nicholas, the son of the most senior Mabhena woman, assumed the chieftaincy until his death.\n\nIn the latest chapter of this long-running saga, 32 family members, through their lawyers Dube, Mguni and Dube Legal Practitioners, allege that Zaneles appointment was irrational and unreasonable.\n\nLocal Government Minister Daniel Garwe\n\nIn their application, the Minister of Local Government and Public Works, Daniel Garwe, is named as the First Respondent, the president of the National Council of Chiefs, Mtshane Khumalo (Second Respondent), the chairperson of the Matabeleland North provincial assembly of chiefs, Chief Siansali (Third Respondent), Zanele (Fourth Respondent), and President Mnangagwa as the Fifth Respondent.\n\nThey accuse the Chief Nkalakatha-led Government delegation, which discussed the succession matter, of being biased and having a conflict of interest.\n\nJohn, in his founding affidavit, argues that Zaneles appointment has resulted in two acting chiefs in the area (including himself), contending that the Traditional Leaders Act and the Constitution of Zimbabwe do not provide for a regent chief. He argues that the chieftaincy dispute dates back to December 2009, when the High Court delineated the lawful process for appointing a Chief within the Mlonyeni Khumalo chieftaincy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jrts.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw WITH unwavering resolve, Regent Chief Mabhikwa of Lupane has declared that, notwithstanding a High Court application lodged by some of her clan members challenging her appointment, she will proceed with her duties, undeterred and without pause. The chieftainship became vacant following the tragic road accident that claimed the life of Chief Mabhikwa […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        },
        {
            "title": "The enduring human touch: Why automation can’t replace us",
            "url": "https://www.chronicle.co.zw/the-enduring-human-touch-why-automation-cant-replace-us/",
            "content": "Jacqueline Ntaka, Feature\n\nTHE relentless march of automation, with its self-service checkouts and intricate AI algorithms, paints a picture of a world increasingly managed by machines. This has, understandably, sparked anxieties about the potential obsolescence of human labour. Yet, while the efficiency and power of automation are undeniable, the idea that it could completely eradicate the need for human input in all aspects of life is a significant oversimplification.\n\nThe benefits of automation are clear: increased productivity, reduced errors, and the ability to handle tasks that are either repetitive or hazardous.\n\nIndustries across the board, from manufacturing to customer service, are adopting these technologies, leading to substantial gains. However, beneath this veneer of streamlined efficiency lies a fundamental truth: automation, for all its sophistication, is inherently limited.\n\nHuman interaction, in its complexity, presents a challenge that machines struggle to overcome. Empathy, compassion, and the ability to interpret subtle social cues are uniquely human qualities. Sectors such as healthcare, social work, and education, which rely heavily on these attributes, are unlikely to be fully automated. Consider a doctor diagnosing a patient; while AI can analyse medical data, it cannot provide the reassurance and emotional support that a human physician can.\n\nSimilarly, creativity and innovation, which require abstract thinking, intuition, and the ability to connect seemingly unrelated ideas, remain firmly within the human domain. While AI can generate data-driven art or music, it lacks the genuine emotional expression and originality that human artistes bring to their work.\n\nFurthermore, complex decision-making, often involving ambiguous situations and ethical considerations, demands critical thinking and sound judgement. Machines, bound by their programming, struggle with these subjective evaluations. In fields like law and politics, human judgement is crucial for interpreting context and ensuring fairness.\n\nUnforeseen circumstances necessitate flexible thinking and the ability to adapt to changing environments, qualities at which humans excel. Machines, on the other hand, often falter when confronted with unexpected variables. During a natural disaster, for example, human first responders are needed to make on-the-spot decisions that no algorithm could anticipate.\n\nRather than perceiving automation as a threat, we should embrace it as a tool to enhance human capabilities. The most effective approach is a collaborative partnership, where machines handle routine tasks, freeing humans to focus on what they do best.\n\nAI can provide valuable insights and data analysis, empowering humans to make more informed decisions, and automation can streamline workflows, allowing humans to dedicate their time to more meaningful and creative endeavours.\n\nl Jacqueline Ntaka is the CEO of Mviyo Technologies, a local tech company that provides custom software development, mobile applications and data analytics solutions. She can be contacted on[emailprotected]\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/02/Untitled-1-9.jpg",
            "description": "Jacqueline Ntaka, Feature THE relentless march of automation, with its self-service checkouts and intricate AI algorithms, paints a picture of a world increasingly managed by machines. This has, understandably, sparked anxieties about the potential obsolescence of human labour. Yet, while the efficiency and power of automation are undeniable, the idea that it could completely eradicate […]",
            "time": "08:34",
            "date": "29 Mar 2025"
        }
    ]
}