{
    "news": [
        {
            "title": "Two nabbed in Bulawayo for possession of US$1 500 in counterfeit notes",
            "url": "https://www.chronicle.co.zw/two-nabbed-in-bulawayo-for-possession-of-us1-500-in-counterfeit-notes/",
            "content": "Trish Mukwazo,[emailprotected]\n\nTWO Bulawayo men who were found with US$1 500 in counterfeit notes appeared in court on Wednesday.Pardon Chinhengo (29) of Barharm Green suburb and Clifford Sidingani Ndlovu (49) of Nketa 7 suburb were convicted on their own pleas of guilty to violating section 40 of the Criminal Law (Reform and Codification) Act, which prohibits possession of articles intended for criminal use, by Bulawayo magistrate Mrs Evia Matura on Tuesday.\n\nThe duo was remanded in custody to Thursday for sentencing.The prosecutor, Ms Josephine Gurazhira said the offence came to light after Chinhengo attempted to purchase fuel using one of the fake notes.\n\nOn 19 April, Ndlovu handed Chinhengo 15 counterfeit US$100 notes, fully aware that the money was fake, said Ms Gurazhira.\n\nThe serial numbers of the forged notes included: CJ61755895A, PF51255585H, LD69490713B, LF976283336A, LF91572048A, LF05673244, LD69490713X2, LF97628336A, LF94652189A, LD69490625B x2, LF73572418A and LD69490373B x3.\n\nChinhengo later used one of the fake notes to buy fuel from Glow Petroleum Garage, handing it to an attendant, Mr Salim Abdul, who quickly suspected it was counterfeit. Chinhengo admitted receiving the money from Ndlovu, leading to the discovery of the remaining fake notes.\n\nThe case adds to a growing trend of counterfeit currency incidents across the country. In 2023, police in Gweru arrested two other Bulawayo men, Chrispen Kutira (42) of Fourwinds and Everson Kabura (38) of Cowdray Park who were reportedly part of a syndicate circulating fake currency across the country. The pair was apprehended at an apostolic shrine in Mtapa suburb, where police recovered counterfeit money stashed in their vehicle.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2012/06/jailed.jpg",
            "description": "Trish Mukwazo,trishmukwazo515@gmail.com TWO Bulawayo men who were found with US$1 500 in counterfeit notes appeared in court on Wednesday. Pardon Chinhengo (29) of Barharm Green suburb and Clifford Sidingani Ndlovu (49) of Nketa 7 suburb were convicted on their own pleas of guilty to violating section 40 of the Criminal Law (Reform and Codification) Act, […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "Maswanhise’s three goals nominated for Goal of the Season award in Scotland:",
            "url": "https://www.chronicle.co.zw/maswanhises-three-goals-nominated-for-goal-of-the-season-award-in-scotland/",
            "content": "TAWANDA Maswanhises three goals have been nominated for Motherwell FCs Goal of the Season award for the 2024/2025 season.\n\nMaswanhises nominated goals were scored against Dundee United, St Johnstone, and Aberdeen.The nominations mark a strong debut season for the Zimbabwean international, who joined Motherwell in August 2024.\n\nMaswanhise is competing for the award alongside other five nominees, with voting open for fans to select the winner.The 22-year-old has scored five goals and recorded three assists in 27 Scottish Premiership appearances this season, earning him the G4 Claims November Player of the Month award.-Soccer24\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-23-at-16.36.30-571x380.jpeg",
            "description": "TAWANDA Maswanhise’s three goals have been nominated for Motherwell FC’s Goal of the Season award for the 2024/2025 season. Maswanhise’s nominated goals were scored against Dundee United, St Johnstone, and Aberdeen. The nominations mark a strong debut season for the Zimbabwean international, who joined Motherwell in August 2024. Maswanhise is competing for the award alongside […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "Watch: Little smiles, big fun: ZITF delivers on kids’ holiday thrills",
            "url": "https://www.chronicle.co.zw/watch-little-smiles-big-fun-zitf-delivers-on-kids-holiday-thrills/",
            "content": "Zimpapers Arts & Entertainment Hub\n\nWhile the Zimbabwe International Trade Fair (ZITF) is known as a hub for business and innovation, it is also fast becoming one of the most anticipated fun-filled outings for kids during the April holidays.\n\nThe latest addition to the entertainment line-up, adding to the carnival vibe, is Cybertrust Kids Events, a mobile leisure-ride centre setting up right across the ZITF showgrounds. Its director, Godfrey Gwangwara, said the setup will feature kiddie train rides, water-based fun, and various leisure activities designed especially for the little ones.Were inviting parents to bring their children out to enjoy a safe and entertaining space, Gwangwara said.\n\nTheir kid-friendly zone will be open from April 24 to 26, aligning with the public days of the ZITF buzz.\n\nA ZITF staple, Luna Park Family Amusement Park, rolled into Bulawayo at the start of the month and is offering an unforgettable experience for young thrill-seekers. From adrenaline-pumping quad bike rides to bouncy trampolines, water walker adventures, and classic toffee apples, the park promises endless excitement for families visiting the trade fair.\n\nZITF has long been a space for business networking and cultural exchange, but it is also proving to be a time where families can bond, laugh, and make lasting memories. With fun zones like these, the trade fair truly becomes an all-ages affair, where kids can play while adults explore the exhibitions.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-23-at-16.18.14-1-680x380.jpeg",
            "description": "Zimpapers Arts & Entertainment Hub While the Zimbabwe International Trade Fair (ZITF) is known as a hub for business and innovation, it is also fast becoming one of the most anticipated fun-filled outings for kids during the April holidays. The latest addition to the entertainment line-up, adding to the carnival vibe, is Cybertrust Kids Events, […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "Boost for Hwange Coal mining as groundbreaking coal tar innovation is unveiled",
            "url": "https://www.chronicle.co.zw/boost-for-hwange-coal-mining-as-groundbreaking-coal-tar-innovation-is-unveiled/",
            "content": "Rutendo Nyeve,Online Reporter\n\nTHE Ministry of Transport and Infrastructural Development, in partnership with the Research Council of Zimbabwe, has unveiled a pioneering project that is set to revolutionise road construction and rehabilitation towards more sustainable and cheaper means.\n\nDubbed the Coal Tar Project, the innovation harnesses locally sourced materials to produce fiber-modified tar, offering a cost-effective, durable and eco-friendly alternative to imported road binders.\n\nSpeaking during the Inaugural Research for Sustainable Industrialisation and Economic Development Indaba held at ZITF on Wednesday, the Ministry of Transport and Infrastructural Development Chief Research and Testing Officer and Principal Investigator of the project Mr Actor Zonde said the initiative leverages crude tar from Hwange coking ovens and chrysotile fibers recycled from Shabanie-Mashava mines.\n\nHe said a ZIMCHEM industrial plant in Redcliff with a monthly production capacity of 150 tonnes is already operational, supplying the Department of Roads for critical projects such as the ongoing Kwekwe-Gokwe road reseal.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Mr-Actor-Zonde-680x380.jpg",
            "description": "Rutendo Nyeve, Online Reporter THE Ministry of Transport and Infrastructural Development, in partnership with the Research Council of Zimbabwe, has unveiled a pioneering project that is set to revolutionise road construction and rehabilitation towards more sustainable and cheaper means. Dubbed the Coal Tar Project, the innovation harnesses locally sourced materials to produce fiber-modified tar, offering a […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "WATCH: Vice President Chiwenga tours innovations at Research Indaba at the ZITF",
            "url": "https://www.chronicle.co.zw/watch-vice-president-chiwenga-tours-innovations-at-research-indaba-at-the-zitf/",
            "content": "Rutendo Nyeve, Online Reporter\n\nVICE President Constantino Chiwenga has arrived at the Inaugural Research for Sustainable Industrialisation and Economic Development Indaba, being held on the sidelines of the ongoing Zimbabwe International Trade Fair (ZITF).\n\nUpon arrival, Vice President Chiwenga toured various innovations on exhibition, including a solar-powered automated irrigation system with a solar-powered sirena local innovation by the Coghlan Primary School Robotics Club.\n\nVice President Chiwenga is accompanied by the Minister of Higher and Tertiary Education, Innovation, Science and Technology Development, Dr Fredrick Shava, and Bulawayo Minister of State for Provincial Affairs and Devolution, Cde Judith Ncube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-23-at-15.11.03-680x380.jpeg",
            "description": "Rutendo Nyeve, Online Reporter VICE President Constantino Chiwenga has arrived at the Inaugural Research for Sustainable Industrialisation and Economic Development Indaba, being held on the sidelines of the ongoing Zimbabwe International Trade Fair (ZITF). Upon arrival, Vice President Chiwenga toured various innovations on exhibition, including a solar-powered automated irrigation system with a solar-powered siren—a local […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "Chevrons seal record chase in Sylhet",
            "url": "https://www.chronicle.co.zw/chevrons-seal-record-chase-in-sylhet/",
            "content": "Brandon Moyo\n\nZIMBABWE held their nerves to register a three-wicket victory on day four of their first Test match against Bangladesh at Sylhet International Cricket Stadium on Wednesday.\n\nChasing a target of 174 runs, Zimbabwe looked set to complete the chase comfortably following a 95-run first wicket partnership before the hosts crawled back into the match with wickets at regular intervals, giving the Chevrons a scare.\n\nHowever, Wessly Madhever (19 runs not out) and Richard Ngarava (four runs not out) managed to see the team through with the former securing a famous win with four. They finished on 174/7.\n\nThe Chevrons now lead the two-match Test series 1-0.\n\nThis was Zimbabwes fourth overseas Test victory, and their highest successful run chase in red-ball cricket. Coincidentally, Zimbabwes previous overseas Test win, in 2018, also came in Sylhet.\n\nBrian Bennett top scored for the Chevrons with 54 runs. Blessing Muzarabani was named player of the match for his figures of 9/122 with best innings figures of 6/72 in the second innings. His match figures are the best by a Zimbabwean bowler in Bangladesh.\n\nMuzarabani also equaled Heath Streaks record of fastest to 50 Test wickets (11 matches) after he took five-wicket hauls in his previous three matches.\n\nThe second Test is scheduled to start on April 28 in Chattogram. @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-23-at-14.58.24-680x380.jpeg",
            "description": "  Brandon Moyo ZIMBABWE held their nerves to register a three-wicket victory on day four of their first Test match against Bangladesh at Sylhet International Cricket Stadium on Wednesday. Chasing a target of 174 runs, Zimbabwe looked set to complete the chase comfortably following a 95-run first wicket partnership before the hosts crawled back into […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "Easter traffic surges at Beitbridge border",
            "url": "https://www.chronicle.co.zw/easter-traffic-surges-at-beitbridge-border/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe volume of travellers who used the Beitbridge border post during the Easter holidays increased to nearly 70 000 this year compared to the 47 000 which passed through the same Port of Entry (PoE) in 2024.\n\nUsually an average 8000 travellers use Sadc and the countrys busiest PoE daily during off peak periods and the number peaks to between 15 000 and 20 000 daily during major holidays.\n\nStatistics from the Department of immigration show that the number of people crossing into either Zimbabwe or South Africa through Beitbridge has been gradually increasing at the freight, bus and private cars and pedestrians terminals.\n\nBorder authorities attribute this to improved efficiencies due to automation of services and the removal of the human element in most services.\n\nThe Department of Immigration is using an online border management system and automated gates (eGates) which make the processing of travellers quicker.\n\nOn the other hand, the Zimbabwe Revenue Authority [Zimra] is using the pre-clearance and electronic Temporary Import Permits (eTIP) processing system that has seen cargo spending less than three hours at the border.\n\nIn addition, the Zimborders Consortium which is managing the infrastructure at Beitbridge following its transformation under a US$300 million private public partnership concession with the Government is using an online system to track turnaround time of all vehicles (commercial and light vehicles) traffic.\n\nThis has resulted in authorities being able to clear at least 60 % of all traffic within three hours.\n\nRegional immigration officer in charge of Beitbridge Mr Joshua Chibundu said they were equal to the task and that they had deployed enough manpower at the freight, buses, and light vehicles terminals.\n\nBetween April 17 and April 21 we processed a total of 32 901 travellers on entries and 34 915 on exits, giving us a total of 67 816, he said.\n\nMr Chibundu advised travellers to follow all the laid down legal channels to process their clearance at the border pots to avoid unnecessary inconveniences.\n\nAs a department we dont have intermediaries and hence we encourage travellers to ensure their passports are cleared by immigration officers in their presents, he said.\n\nHe said they had deployed enough security at all crime hot spot areas to prevent the illegal movement of travellers.\n\nMr Chibundu said during the Easter period they arrested 456 people for violating immigration laws including touts and vendors whom they have handed over to police for further management.\n\nHe added that three migrants were refused entry into Zimbabwe while they stopped 598 from going into South Africa for not having proper travel documents among them the right permits or having expired documents.\n\nThose guardians or parents travelling with children under the age of 18 years should have valid passports of themselves and the child and necessary supporting documents such as affidavits from the parents giving consent to have the minors travel with them, said Mr Chibundu.\n\nIn addition, they also need a copy of the childs birth certificate and for one parent travelling with the child, an affidavit of the non-travelling parent is required, together with copies of ID/passport of the parents.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-23-at-14.51.57-680x380.jpeg",
            "description": "  Thupeyo Muleya, Beitbridge Bureau The volume of travellers who used the Beitbridge border post during the Easter holidays increased to nearly 70 000 this year compared to the 47 000 which passed through the same Port of Entry (PoE) in 2024. Usually an average 8000 travellers use Sadc and the country’s busiest PoE daily […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "VP Chiwenga headlines Inaugural Research for Sustainable Industrialisation and Economic Development Indaba",
            "url": "https://www.chronicle.co.zw/vp-chiwenga-headlines-inaugural-research-for-sustainable-industrialisation-and-economic-development-indaba/",
            "content": "Rutendo Nyeve,Online ReporterVICE President General (rtd) Constantino Chiwenga is set to grace the Research Council of Zimbabwe (RCZ)s inaugural Research for Sustainable Industrialisation and Economic Development Indaba at the on going ZITF on\n\nWednesday afternoon where he is set to give the key note address.Being held under the theme: Research for Sustainable Industrialisation and Economic Development, the high-profile research indaba aims to bridge cutting-edge research with national economic priorities featuring presentations, panel discussions and keynote addresses by leading policymakers, researchers, and international dignitaries.\n\nPresentations on critical projects such as the Mining Reagents Initiative, High Energy Lithium Battery Project will provide feedback which underscores Governments commitment to research-driven industrialisation.\n\nThe indaba will also feature a panel discussion of experts on innovation solutions.The Chinese Ambassador to Zimbabwe, Ambassador Zhou Ding and Vice President Chiwenga are expected to give the keynote addresses.\n\nWith participation from various ministries, international partners and the academia, the Indaba is set to outline actionable strategies for sustainable growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hero-680x380.jpg",
            "description": "Rutendo Nyeve,Online Reporter VICE President General (rtd) Constantino Chiwenga is set to grace the Research Council of Zimbabwe (RCZ)’s inaugural Research for Sustainable Industrialisation and Economic Development Indaba at the on going ZITF on Wednesday afternoon where he is set to give the key note address. Being held under the theme: ‘Research for Sustainable Industrialisation […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "ICTs Ministry to host digital economy conference",
            "url": "https://www.chronicle.co.zw/icts-ministry-to-host-digital-economy-conference/",
            "content": "Peter Matika,[emailprotected]\n\nThe Ministry of Information, Communication Technology, Postal and Courier Services will host a digital economy conference this afternoon to foster collaboration with key players in the ICT sector and other notable industry stakeholders.\n\nThe conference is running under the theme, Digital Synergy  Crafting Connected Economic Futures.\n\nThe Minister of Information Communication Technology, Postal and Courier Services, Dr Tatenda Mavetera, is expected to deliver a keynote address.\n\nThis premier event will gather thought leaders, industry experts, and innovators from across the country to explore the evolving landscape of the digital economy.\n\nParticipants will hear from renowned speakers who are shaping the future of technology and digital innovation. They will also engage in discussions on the latest trends, challenges, and opportunities in the digital economy.\n\nThe event will also connect professionals, entrepreneurs, and policymakers to foster collaboration and partnerships.\n\nDuring the conference, participants will take part in hands-on workshops designed to equip them with the skills needed to thrive in todays digital world.\n\nMore to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/fddfsdfdfssdf.jpg",
            "description": "Peter Matika,peter.matika@chronicle.co.zw The Ministry of Information, Communication Technology, Postal and Courier Services will host a digital economy conference this afternoon to foster collaboration with key players in the ICT sector and other notable industry stakeholders. The conference is running under the theme, “Digital Synergy – Crafting Connected Economic Futures”. The Minister of Information Communication Technology, […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        },
        {
            "title": "VP Chiwenga urges industry to lead in research and academia collaboration",
            "url": "https://www.chronicle.co.zw/vp-chiwenga-urges-industry-to-lead-in-research-and-academia-collaboration/",
            "content": "Nqobile Bhebhe, Zimpapers Business Hub\n\nVice President Chiwenga has challenged Zimbabwes industrial sector to invest in research and forge stronger partnerships with academia to drive sustained economic growth.\n\nDelivering the keynote address at the International Business Conference (IBC) in Bulawayo, VP Chiwenga emphasised that the responsibility to initiate collaboration should lie with industry, not academia.\n\nI have heard during the first panel discussion, it is not the academia that is the most important sector that must go to industry, actually, it is vice versa.\n\nIndustry, the manufacturing sector, must go to our researchers, to our institutions of higher and tertiary education, and say, we are producing ten pieces of equipment, we want to accelerate them to produce 100 pieces of equipment, can you give us a solution and then fund those researchers as the private sector because you are the beneficiaries.\n\nThis is how we should go. Because the researchers, those young boys and girls who have been gifted, cannot dream of what they need. But if you go to them and you tell them what you need, they will crack their minds and you will have solutions, he said to a round of applause.\n\nThe Vice President stressed that as the nation transitions from National Development Strategy 1 (NDS1) to National Development Strategy 2 (NDS2), there must be a deliberate and accelerated shift to enhance productivity, remove bottlenecks, and enable full private sector participation.\n\nHe further noted that Zimbabwes push toward industrialisation must be reinvigorated with targeted efforts that will position the country as a competitive player in regional and continental trade.\n\nRunning under the theme Revitalising Industrialisation for Zimbabwes Economic Resurgence, the IBC stands as the countrys premier business forum, drawing together government leaders, policymakers, and industry experts.\n\nThe conference provides a vital platform for engaging on key economic issues, such as integrated industrialisation, sustainable growth, and unlocking global business opportunities.\n\nAttended by top business leaders and decision-makers, the IBC continues to serve as a critical space for shaping Zimbabwes economic trajectory.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hero-680x380.jpg",
            "description": "Nqobile Bhebhe, Zimpapers Business Hub Vice President Chiwenga has challenged Zimbabwe’s industrial sector to invest in research and forge stronger partnerships with academia to drive sustained economic growth. Delivering the keynote address at the International Business Conference (IBC) in Bulawayo, VP Chiwenga emphasised that the responsibility to initiate collaboration should lie with industry, not academia. […]",
            "time": "20:45",
            "date": "23 Apr 2025"
        }
    ]
}