{
    "news": [
        {
            "title": "Chipezeze breaks silence on being snubbed by Warriors coach Michael Nees",
            "url": "https://www.chronicle.co.zw/chipezeze-breaks-silence-on-being-snubbed-by-warriors-coach-michael-nees/",
            "content": "Online Reporter\n\nELVIS Chipezeze has broken his silence on being snubbed by Warriors head coach Michael Nees ahead of the 2026 World Cup Qualifiers Group C encounters against Benin and Nigeria last month.\n\nChipezeze has been in great form at his South African top-flight side Magesi FC after keeping eleven clean sheats in the Betway Premiership so far.\n\nDespite being in top form, the seasoned Gweru bred goalkeeper was not included in the Warriors squad that recently played their games in the 2026 World Cup Qualifiers.\n\nNees preferred to keep Washington Arubi as the first choice, with Martin Mapisa of MWOS FC and rookie goalie Marley Tavaziva of Brentford B deputising him.\n\nIn an interview with South Africas FarPost.co.za, Chipezeze said he will not get distracted by the snub, but is motivated, instead.\n\nWe all want to play for our different countries. But when its not possible then we can only support those doing duty. Of course, I want to play for my country but with the current situation, I am motivated to do more and keep more clean sheets, said Chipezeze.\n\nHe added: Its very important at this stage that I work hard and maintain this form so that I can be able to help my team. And not getting a national team call-up cannot leave me distracted but I can only be confident and be motivated to work hard. The level of competition that I have seen this season has been very high. I know it has contributed a lot to my performances and game. But it has not been a one man effort. The whole team has made this possible. And I know we will keep rising because we are working for it.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-02-at-17.16.41_5b4b00bc.jpg",
            "description": "Online Reporter ELVIS Chipezeze has broken his silence on being snubbed by Warriors head coach Michael Nees ahead of the 2026 World Cup Qualifiers Group C encounters against Benin and Nigeria last month. Chipezeze has been in great form at his South African top-flight side Magesi FC after keeping eleven clean sheats in the Betway […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "Watch: earGROUND MEDIA celebrates 7 years of amplifying creative voices",
            "url": "https://www.chronicle.co.zw/watch-earground-media-celebrates-7-years-of-amplifying-creative-voices/",
            "content": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub\n\nArts entity, earGROUND MEDIA, recently marked a significant milestone, celebrating seven years of amplifying creative voices across Zimbabwe and Africa.\n\nSince its establishment in 2018, earGROUND MEDIA has evolved into a premier platform for arts and culture, renowned for its insightful storytelling, exclusive content, and transformative live experiences.\n\nPlot Mhako, founder of earGROUND MEDIA, reflected on the journey, noting that the past seven years have been instrumental in spotlighting emerging talent, fostering a dynamic artistic community, and championing the creative economy.The impact weve made goes beyond Zimbabwe. Weve celebrated and promoted diverse artistic expressions across the African continent, Mhako said.\n\nhttp://https://youtube.com/shorts/22VugnrTBCo\n\nAs earGROUND MEDIA embarks on its eighth year, it remains committed to its mission of elevating creative expression and providing a platform where diverse artistic voices can thrive and be heard globally.Beyond storytelling and content creation, earGROUND MEDIA has become a transformative force in Zimbabwes creative landscape. As an innovative startup, we have been pivotal in amplifying the voices, talents, and stories of Zimbabwean and African creatives, he added.\n\nMhako highlighted that Zimbabwes creative economy has long been constrained by limited access to resources, platforms, and professional development opportunities  especially for artistes in marginalised and remote communities.Many creatives struggle to monetise their talents and fully contribute to the economy due to a lack of entrepreneurial knowledge and industry exposure. earGROUND MEDIA is reshaping the creative landscape by offering ground-breaking solutions that connect artists with audiences and industry players, Mhako said.\n\nAs the platform continues to evolve, earGROUND MEDIA remains dedicated to empowering the next generation of African creatives, ensuring their voices are heard both locally and internationally.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Plot-Mhako.jpg",
            "description": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub Arts entity, earGROUND MEDIA, recently marked a significant milestone, celebrating seven years of amplifying creative voices across Zimbabwe and Africa. Since its establishment in 2018, earGROUND MEDIA has evolved into a premier platform for arts and culture, renowned for its insightful storytelling, exclusive content, and transformative live experiences. […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "BCC commissions four refuse compactors",
            "url": "https://www.chronicle.co.zw/bcc-commissions-4-refuse-compactors/",
            "content": "Raymond Jaravaza, Online Reporter\n\nBULAWAYO City Council (BCC) on Wednesday afternoon commissioned four new refuse compactors.\n\nThe trucks will add to the existing fleet to be bring the total number to 17 refuse compactors.\n\nBulawayo City council commissions 4refuse truck compactors\n\nBCC Director of Health Services Dr Edwin Mzingwane said the city needs 30 refuse compactors to adequately service residential areas, industrial area, businesses and the city centre.\n\nTo make up for the shortfall of refuse compactors, BCC constructed private players whose trucks collect refuse in the western areas and city centre in order to keep Bulawayo clean.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/m.jpg",
            "description": "Raymond Jaravaza, Online Reporter BULAWAYO City Council (BCC) on Wednesday afternoon commissioned four new refuse compactors. The trucks will add to the existing fleet to be bring the total number to 17 refuse compactors.   BCC Director of Health Services Dr Edwin Mzingwane said the city needs 30 refuse compactors to adequately service residential areas, […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "Plumtree gears up for National Clean-Up: Border post area gets a facelift!",
            "url": "https://www.chronicle.co.zw/plumtree-gears-up-for-national-clean-up-border-post-area-gets-a-facelift/",
            "content": "Ronald Mpofu,[emailprotected]\n\nTHE Plumtree local authority has reminded residents of the upcoming National Clean-Up Day, scheduled for Friday, 4 April 2025.\n\nThe local authority has made a strategic decision to focus development efforts on the Plumtree Border Post area, approximately 10km from the town centre.\n\nFollowing the successful clean-up campaign in the Central Business District last December, which was made possible with resident support, the authority is now turning its attention to the border post area.\n\nIn a statement, the local authority said: The general public is reminded of the Presidential National Clean-Up campaign scheduled for Friday, 4th April 2025.\n\nTargeted area: Plumtree Border Post. Time: 08:00 hours to 10:00 hours. You are all encouraged to clean your surroundings, both residential and commercial.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/PTC.jpg",
            "description": "Ronald Mpofu, itsronaldrox@gmail.com THE Plumtree local authority has reminded residents of the upcoming National Clean-Up Day, scheduled for Friday, 4 April 2025. The local authority has made a strategic decision to focus development efforts on the Plumtree Border Post area, approximately 10km from the town centre. Following the successful clean-up campaign in the Central Business […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "VBA champions drug abuse awareness through theatre, music in Pumula",
            "url": "https://www.chronicle.co.zw/vba-champions-drug-abuse-awareness-through-theatre-music-in-pumula/",
            "content": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub\n\nOn April 19, the Old Pumula Bus Terminus will be more than just a transport hub  it will transform into a vibrant centre of artistic expression as Vutha Buciko be-Africa (VBA) presents the Drugs Ends All Dreams event.\n\nThis community-driven initiative aims to harness the power of art to raise awareness about the devastating effects of drug and substance abuse.\n\nAccording to Lucky Ncube, VBAs representative, Vutha Buciko be-Africa is a theatre-based arts group from Old Pumula which was formed to use arts as a tool to educate via entertainment to address social ills such as drugs and substance abuse and gender-based violence among others.The event is a community initiative aimed at showcasing talented artists, connecting them with relevant authorities, and educating the community about the dangers of drug abuse, Ncube said.\n\nArts awareness plays a pivotal role as everyone loves music and performance which attracts a wide range of public from young generations to the old.\n\nLocal artistes have till Monday to freely register.Their performances will convey the message about the dangers of drug abuse through poetry, music, dance, and theatre, catering to diverse genres and audiences.\n\nThe events theme, Drugs Ends All Dreams is a poignant reminder of the destructive power of drug abuse.\n\nAs Ncube elaborated, Drugs are a central point of ones downfall. It doesnt only kill the body but shatters dreams. Drugs dont only affect the user but the whole family, community, and country at large.\n\nAccording to Ncube attendees can expect a diverse range of artistic performances and installations, including poetry, music, dance, theatre, comedy, and craft work.\n\nRenowned comedian Ankela Zex Mdawini Sibanda Tshuma will take the stage as the leading MC.\n\nTo sustain the momentum generated by the event, VBA plans to seek funding, partner with like-minded organisations, and develop sustainable projects that promote healthy lifestyles and prevent drug abuse.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/VBAs-Lucky-Ncube-1.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub On April 19, the Old Pumula Bus Terminus will be more than just a transport hub – it will transform into a vibrant centre of artistic expression as Vutha Buciko be-Africa (VBA) presents the “Drugs Ends All Dreams” event. This community-driven initiative aims to harness the power of […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "Police arrest one suspect in Nyamandlovu roadside rape and armed robbery",
            "url": "https://www.chronicle.co.zw/police-arrest-one-suspect-in-nyamandlovu-roadside-rape-and-armed-robbery/",
            "content": "Online Reporter\n\nPOLICE in Bulawayo have arrested a 21-year-old man in connection with a violent armed robbery and rape incident that occurred along Nyamandlovu Road on Monday afternoon.\n\nKhumbulani Vincent Gama of Njube was apprehended today following an intensive manhunt by CID Vehicle Theft Squad detectives. He is alleged to have been part of a three-man gang that attacked a couple parked along the Mbuyazwe stretch of Nyamandlovu Road at around 5pm on 31 March.\n\nNarrating the details of the couple, Bulawayo Provincial Police Spokesperson Assistant Inspector Nomalanga Msebele said: On 31 March 2025 at around 1700 hours, the complainant, a male adult aged 37 years of Pelandaba West, Bulawayo, was with his girlfriend, a female adult aged 26 years of Nketa 7, Bulawayo, driving out of town along Nyamandlovu Road. While they were in Mbuyazwe along Nyamandlovu Road, they parked their car on the side of the road, disembarked, opened the load box and sat on it.\n\nAssistant Inspector Msebele said the couple were then approached by three accused persons who appeared from the western direction along Nyamandlovu Road and accused the complainant of stealing cattle in their area.The accused persons grabbed the complainant and wrestled with him for about 10 minutes. One of the accused persons then produced a black pistol and hit the complainant twice on the back of the head with the butt of the pistol. Another accused person produced an okapi knife and stabbed the complainant twice on each side of the buttocks, resulting in him sustaining two deep cuts on the back of the head and stab wounds on the buttocks.\n\nAssistant Inspector Msebele said the accused persons then force-marched the complainant and his girlfriend into the bush, where they tied their hands and legs with cables and string. One accused person went back to the car, leaving the others guarding the complainants. He ransacked the car, took four Samsung Galaxy mobile phones and cash amounting to US$1,000 from a wallet in the dashboard.\n\nAssistant Inspector Msebele added that: The accused person guarding the complainants then took the complainants girlfriend to a secluded place and raped her. The accused person who had gone to the car returned, gave the complainant his bank cards and drivers licence, and they drove away in the complainants car, leaving the victims behind.\n\nThe victims eventually freed themselves and walked approximately 3KM along Nyamandlovu Road towards Bulawayo before getting assistance from passing motorists who took them to police.\n\nAssistant Inspector Msebele said on Tuesday, CID Vehicle Theft Squad detectives in Bulawayo received information about the suspects whereabouts, leading to Khumbulani Vincent Gamas arrest.During questioning, he admitted committing the offence and led police to recover two iPhones and a Huawei P40 mobile phone hidden in grass in the bush said Assistant Inspector Msebele.\n\nShe said police are searching for two accomplices: Darlington Gama, a 24-year-old male from Cowdray Park, Bulawayo, and Lunga Runtsweke, whose details remain unknown.\n\nAssistant Inspector Msebele appealed to anyone with information that may lead to the arrest of the accomplices to visit their nearest police station.Members of the public are advised not to park their vehicles in secluded areas as they risk being targeted by robbers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Online Reporter POLICE in Bulawayo have arrested a 21-year-old man in connection with a violent armed robbery and rape incident that occurred along Nyamandlovu Road on Monday afternoon. Khumbulani Vincent Gama of Njube was apprehended today following an intensive manhunt by CID Vehicle Theft Squad detectives. He is alleged to have been part of a […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "South Africa cops intercept another Zimbabwe bound stolen car",
            "url": "https://www.chronicle.co.zw/south-africa-cops-intercept-another-zimbabwe-bound-stolen-car/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nCross border vehicle theft syndicates operating between Zimbabwe and South Africa are gradually resurfacing with security authorities from both countries tightening screws on border crime.\n\nThe rackets are stealing vehicles in South Africa and smuggling them into Zimbabwe destined for the local market by moving them in transit to either Malawi and Mozambique.\n\nIn some cases the project is being run by insurance fraudsters who sell vehicles and reclaim payouts claiming they will have been hijacked.\n\nLimpopo police spokesperson Brigadier Hlulani Mashaba said in a major breakthrough in the fight against vehicle smuggling, a joint intelligence-driven operation successfully intercepted a stolen luxury vehicle destined for illegal export on Tuesday.\n\nOn Tuesday, 01 April 2025, an anti-smuggling operation was conducted along the N1 North, near Peter Mokaba Stadium, following intelligence regarding a stolen Toyota Fortuner VX traveling from Gauteng Province towards the Beitbridge Port of Entry for smuggling, he said.\n\nThe operational teams, comprising the Anti-Smuggling Team, Polokwane LCRC, and external law enforcement partners from Tshimollo Security and Investigation, were deployed to monitor the suspected vehicle. The vehicle was spotted traveling northbound on the N1 and was swiftly stopped for investigation.\n\nUpon verification on-site, it was confirmed that the Toyota Fortuner had been reported stolen over the weekend at Pretoria Central. The driver, a 43-year-old South African male, was immediately arrested. The vehicle, valued at R800,000, was seized as part of the investigation.\n\nThe suspect is set to appear before the Polokwane Magistrates Court on Thursday, facing charges of possession of a suspected stolen motor vehicle.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-02-at-11.53.31_e13a227b-680x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau ​Cross border vehicle theft syndicates operating between Zimbabwe and South Africa are gradually resurfacing with security authorities from both countries tightening screws on border crime. ​The rackets are stealing vehicles in South Africa and smuggling them into Zimbabwe destined for the local market by moving them in transit to either Malawi […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "30-year jail term for Chivhayo in-laws’ armed robbery",
            "url": "https://www.chronicle.co.zw/30-year-jail-term-for-chivhayo-in-laws-armed-robbery/",
            "content": "Harare Bureau\n\nOne of the suspects who robbed businessman Wicknell Chivhayos in-laws of US$85 558 and property valued at US$3 900 at their farm in Marondera will spend 30 years in jail after he was convicted of six counts of armed robbery.\n\nBigboy Nampungo had pleaded guilty to the charges.\n\nThe State was represented by Ms Shambadzeni Fungura.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/11/handcuff1-680x380-680x379.jpg",
            "description": "Harare Bureau  One of the suspects who robbed businessman Wicknell Chivhayo’s in-laws of US$85 558 and property valued at US$3 900 at their farm in Marondera will spend 30 years in jail after he was convicted of six counts of armed robbery. Bigboy Nampungo had pleaded guilty to the charges. The State was represented by […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "Bulilima district schools face alarming theft of donated computers",
            "url": "https://www.chronicle.co.zw/bulilima-district-schools-face-alarming-theft-of-donated-computers/",
            "content": "Mthabisi Tshuma,Online Reporter\n\nSCHOOLS in Bulilima district have seen several computers donated to them in the governments schools computerisation programme being stolen, a situation that has sparked significant concern regarding the security of educational resources and the impact on students access to technology.\n\nAccording to statistics provided by theMinistry of Information Communication Technology, Postal and Courier Services and the Ministry of Primary and Secondary Education, the district has documented60 stolen laptops, with36 recoveredwhile24 remain missing.\n\nAtNopemano Primary School, out of30 donated laptops,nine were stolen, and none have yet been recovered.\n\nSimilarly,Mathambo Primary Schoolreported the loss of all10 computers, with onlyonefound.Malalume Secondary Schoolexperienced a theft offourout of30 laptops, andMangubo Primary Schoolreported the loss ofthreefrom their set of10laptops, with no recoveries to date.\n\nNotably,Mnigau Primary Schoolemerged as one of the largest beneficiaries nationwide, receiving40 laptops; however,37 were stolen, 35 were successfully recovered.\n\nAddressing attendees at the handover ceremony of 10 laptops, one printer, one whiteboard and one projector at Bezu Primary School recently, ICT Deputy Minister urged the school stakeholders to safeguard the donation as the world now evolves around such gadgets.\n\nHe said President Emmerson Mnangagwa is making strides in ensuring that all schools countrywide have a computer laboratory, and such is a mission his Ministry is pursuing.\n\nBulilima District Schools Inspector Mr Gobile Gobile said:\n\nWe are urging the School Heads to secure all computer rooms so that thieves do not get access to the gadgets, he said.\n\nFollow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-02-at-14.50.57_2fe43da9-676x380.jpg",
            "description": "Mthabisi Tshuma, Online Reporter SCHOOLS in Bulilima district have seen several computers donated to them in the government’s schools’ computerisation programme being stolen, a situation that has sparked significant concern regarding the security of educational resources and the impact on students’ access to technology. According to statistics provided by the Ministry of Information Communication Technology, Postal and […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        },
        {
            "title": "Gwanda woman jailed for unlawful possession of dagga",
            "url": "https://www.chronicle.co.zw/gwanda-woman-jailed-for-unlawful-possession-of-dagga/",
            "content": "Langelihle S Nyathi,[emailprotected]\n\nA 34-year-old Gwanda woman has been sentenced to an effective six months in prison, after being convicted of unlawful possession of dangerous drugs by the Gwanda Magistrates Court.\n\nShe had been sentenced to twelve months in prison but six months were suspended for five years on condition of good behaviour.\n\nAccording to a statement from the National Prosecuting Authority on March 27, 2025, at around 7 PM, detectives stationed at Blanket Mine Compound received information that the woman had dagga.\n\nActing on the tip-off, the detectives visited her residence, where she willingly led them to her room.\n\nShe handed over a blue plastic bag containing 73 sachets of dagga, weighing 0.26kg and valued at ZWG 2,600, as well as three additional sachets she had on her, leading to her arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/10/dagga.jpg",
            "description": "Langelihle S Nyathi, langae2001@gmail.com A 34-year-old Gwanda woman has been sentenced to an effective six months in prison, after being convicted of unlawful possession of dangerous drugs by the Gwanda Magistrates’ Court. She had been sentenced to twelve months in prison but six months were suspended for five years on condition of good behaviour. According […]",
            "time": "18:34",
            "date": "02 Apr 2025"
        }
    ]
}