{
    "news": [
        {
            "title": "President Mnangagwa honours Mbare Chimurenga Choir",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-honours-mbare-chimurenga-choir/",
            "content": "Mukudzei Chingwere,Harare Bureau\n\nPRESIDENT Mnangagwa said high-density suburbs like Mbare, Highfields, Makokoba, Mpopoma, Mtapa and Sakubva played a pivotal role in the liberation struggle.\n\nHe said these neighbourhoods were the breeding grounds for resistance and the spirit of freedom that ultimately led to Zimbabwes independence. The President expressed these sentiments during a festive Boxing Day gathering where he honoured the Mbare Chimurenga Choir for its invaluable contributions to Zimbabwes rich tapestry of culture and national identity.\n\nThe President also underscored the significance of the cultural creative industries, highlighting their role as engines of economic growth and innovation. He emphasised that these sectors not only foster artistic expression but also promote social cohesion and preserve Zimbabwes unique identity.\n\nAs you are aware, the cultural creative industries play a vital role in society by fostering economic growth through creative outputs such as music, art, design, fashion, and film, among others. They also contribute significantly to social cohesion, cultural identity, innovation, and individual well-being by nurturing creativity, expression, and engagement within communities.\n\nHonouring the Mbare Chimurenga Choir is appreciation, through them, of the many musicians and artistes who continue to use their artistic talents to defend the gains of our Independence and advance our national development identity, image, and culture.\n\nIt was in residential areas such as Mbare, Highfields, Makokoba, Mpopoma, Mtapa, and Sakubva, among others, where the flames for Independence were kept ablaze before and during our protracted war of liberation, said President Mnangagwa.\n\nHe said through song and dance, young people were mobilised to go for military training and subsequently to fight for the freedom of the country.\n\nIn the post-Independence era, said President Mnangagwa, it is groups and musicians such as the Mbare Chimurenga Choir who used their exceptional talent to promote cultural diversity and rally younger generations around the various national development periods.\n\nHe congratulated the Mbare Chimurenga Choir for the consistency with which it has utilised its musical talent for the good of the country and the ruling Zanu-PF party.\n\nYour music with its educating lyrics is a symbol of the hope and resilience that inspires countless individuals to remain patriotic and safeguard our beloved nation. The performance you have delivered over the years inculcates the values of unity, resilience, and love. Your revolutionary spirit is a beacon of light and hope.\n\nIt is also a reminder of our collective history, our shared struggles, as well as a celebration of our resilience and determination to build a better Zimbabwe. I applaud you for your current efforts and music compilations which highlight our ongoing national development agenda, vision, policies, and programmes. Through your efforts along with others in the creative cultural industries, the nation must remain galvanised towards the attainment of our vision of a prosperous and empowered upper-middle-income economy, said President Mnangagwa.\n\nHe also handed over gifts to the choir and encouraged them to carry the message of love, unity, and the need to accelerate development in the country, continuing to uplift one another and embrace the values being nurtured by the Second Republic.\n\nGoing forward, I urge you to continue infusing the new crop of musicians, particularly the youth, into your groups. It is equally important that you broaden the reach of your music, riding on the diversity of ICT platforms.\n\nAs I hand over these gifts, we acknowledge the tireless efforts of each and every one of you. Your dedication to Zanu-PF programmes is commendable and your performances have been a source of joy and entertainment for many, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-14-1.jpg",
            "description": "Mukudzei Chingwere, Harare Bureau  PRESIDENT Mnangagwa said high-density suburbs like Mbare, Highfields, Makokoba, Mpopoma, Mtapa and Sakubva played a pivotal role in the liberation struggle.  He said these neighbourhoods were the breeding grounds for resistance and the spirit of freedom that ultimately led to Zimbabwe’s independence. The President expressed these sentiments during a festive Boxing Day […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": "Bulawayo healthcare gets airborne: Help from above as air ambulances arrive",
            "url": "https://www.chronicle.co.zw/bulawayo-healthcare-gets-airborne-help-from-above-as-air-ambulances-arrive/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nHELIDRIVE Zimbabwe unveiled the first of its two air ambulances for Bulawayo yesterday, delivering a significant boost to emergency medical services in the Matabeleland region.\n\nThe helicopter, bound for the United Bulawayo Hospitals (UBH), landed at Joshua Mqabuko Nkomo International Airport at 11am, accompanied by a skilled crew of four, including pilots Aleksander Rusanov and Denis Salikhov. The second helicopter is anticipated to arrive in Bulawayo shortly.\n\nTogether, the two air medical rescue service helicopters will provide rapid medical assistance for serious incidents such as road traffic accidents throughout the Matabeleland region.\n\nThese helicopters are part of a larger fleet of six that will be dispatched across four stations, including Harare, Manicaland, Victoria Falls, and Bulawayo.\n\nThe helicopter will be based here in Bulawayo. This is a Presidential project and we are working on his instructions, said Rusanov.\n\nPresident Mnangagwa and the Government have embarked on a mission to modernise Zimbabwes healthcare systemto achieve the goal of becoming a modern, prosperous, and industrialised country by 2030.\n\nTo this end, the President visited Russia in June to seek investors to establish an air ambulance service.\n\nRussian HeliDrive Air Ambulance Medical Services promptly collaborated with Zimbabwe to establish an efficient air ambulance service equipped with highly skilled medical doctors, nurses, engineers, dispatchers, and pilots.\n\nThe Russian Air Ambulance Service has been in operation for nine years and has a fleet of over 100 medical helicopters, dedicated to saving lives throughout Russia.\n\nThe company has recruited and trained local personnel, including 40 pilots, 50 doctors, 100 nurses, 100 dispatchers, and 10 engineers, to handle the air medical services.\n\nAir ambulances are typically reserved for transporting patients from inadequate levels of care to higher levels of care or for patients who are unable to use commercial flights due to their medical condition.\n\nThese specialised aircraft are designed to overcome geographical barriers and provide the same level of medical care available in an intensive care unit.\n\nThe air ambulance service was launched in Zimbabwe in August in conjunction with the 44th SADC summit.\n\nThe helicopters are equipped with advanced medical facilities and staffed by trained medical personnel. One of the first successful missions was the transportation of a cardiac arrest patient from Chegutu to Harare in 20 minutes, which is significantly faster than the two-hour road journey.\n\nAlthough Winos Dube, chairperson of the Bulawayo Residents Association (Bura), recognised the significance of the arrival of the air ambulance, he emphasised the importance of providing equitable access to critical services.\n\nWe applaud the Government on this. We, however, hope that every person who needs emergency medical attention will access this. It must not be based on ones position in society but generally, we are excited as its presence will indeed save lives, said Dube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-5-1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw  HELIDRIVE Zimbabwe unveiled the first of its two air ambulances for Bulawayo yesterday, delivering a significant boost to emergency medical services in the Matabeleland region.  The helicopter, bound for the United Bulawayo Hospitals (UBH), landed at Joshua Mqabuko Nkomo International Airport at 11am, accompanied by a skilled crew of four, including pilots Aleksander […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": ". . . Craig Ervine ends four-year drought with century in historic Boxing Day Test",
            "url": "https://www.chronicle.co.zw/craig-ervine-ends-four-year-drought-with-century-in-historic-boxing-day-test/",
            "content": "Brandon Moyo,[emailprotected]\n\nCRAIG Ervine, Zimbabwes red-ball captain, ended his four-year wait for a Test century on day two of the Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo.\n\nErvine had gone seven innings without a century but kept his composure to score his fourth Test ton. His last century came in Mirpur against Bangladesh, where he made 107 runs. After the Mirpur century, Ervines scores were not very impressive, with only one half-century. However, he put an end to the dry spell, bringing up a brilliant century in a Boxing Day Test  his first in Zimbabwe.\n\nErvine made a patient 104 runs from 176 balls, including 10 boundaries, mostly consisting of singles as he kept the scoreboard ticking and rotated the strike with his partners, Sean Williams and Brian Bennett.\n\nErvine had emphasised before the series that playing at the familiar Queens Sports Club would work in Zimbabwes favour, and his innings proved him right.\n\nQueens Sports Club\n\nHe came to the crease with Zimbabwe in a strong position on 220/4, following the fall of Dion Myers. He then formed a 163-run partnership with Williams for the fifth wicket, before adding 82 runs for the sixth wicket with Bennett.\n\nErvines century was even more memorable as it came alongside Williamss career-best 154 runs, making it the first time in 10 years that Zimbabwe had two centurions in an innings.\n\nThe last time this happened was in 2014 against Bangladesh in Khulna, where Hamilton Masakadza and Regis Chakabva made 158 and 101 runs respectively.\n\nErvine now shares the joint seventh-most Test centuries for Zimbabwe, alongside Dave Houghton, after playing in 21 Test matches. Ervines other centuries in Test cricket came against Sri Lanka in 2017 (160 runs), New Zealand in 2016 (140 runs), and Bangladesh (107 runs) in 2020.\n\nOverall he has 1 344 runs under his belt at an average of 33.60, including five half-centuries.\n\n@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dghh.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com  CRAIG Ervine, Zimbabwe’s red-ball captain, ended his four-year wait for a Test century on day two of the Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo. Ervine had gone seven innings without a century but kept his composure to score his fourth Test ton. His last century came in Mirpur […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": "WATCH: SADC delegates to grace Zim National thanksgiving service",
            "url": "https://www.chronicle.co.zw/watch-sadc-delegates-to-grace-zim-national-thanksgiving-service/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHIS years National Thanksgiving and Dedication Service, now in its eighth year, will take on a regional dimension with the attendance of representatives from all SADC member states.\n\nPresident Mnangagwa, the current SADC Chairperson, is set to preside over this significant event, which will be held tomorrow at the Zimbabwe International Trade Fair (ZITF) arena in Bulawayo.\n\nCongregants follow proceedings during a Family of God (FOG) church service at ZITF yesterday\n\nThe annual National Thanksgiving and Dedication Service, a cornerstone event since 2017, underscores Zimbabwes profound appreciation for divine guidance in its journey of progress and development.\n\nThis year, the service is anticipated to draw a diverse congregation from various denominations, united in gratitude for the peace, prosperity, and advancements that have graced the nation.\n\nInitiated by President Mnangagwa following the establishment of the Second Republic, the service has become an annual tradition, fostering a powerful platform for spiritual communion between the nations leadership and its people.\n\nThe event, a collaborative effort between the Faith for the Nation Campaign and the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), provides a crucial space for believers to intercede for continued blessings and prosperity of Zimbabwe, recognising the vital role of faith in national advancement.\n\nSpeaking to Saturday Chronicle yesterday, Shuvai Wutawunashe, a prominent gospel musician and member of the Faith for Nation campaign committee, said that the occasion serves as a time to express heartfelt gratitude to God for the numerous milestones achieved throughout the past year.\n\nSunday, December 29 is a big day for the nation as we come together for the 8th edition of the National Dedication Service. It happens annually and the nation looks forward to the event. The nation will come together with one voice, one heart, one mind to give thanks to God for all the milestones, achievements, and successes that have taken place in the past year, she said.\n\nThis years theme is Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nWutawunashe underscored the unique significance of this years event, highlighting that it coincides with President Mnangagwas tenure as the Chairperson of SADC.\n\nPresident Mnangagwa assumed this esteemed position in August.\n\nThis years edition has an advantage in that our President, the chairman of SADC, will have many people from almost every SADC country. Its a wonderful opportunity for President Mnangagwa to make statements and share hopes for SADC, where he will lead us and many SADC members will be in attendance.\n\nWe will be having key musicians from SADC to celebrate the day and its not just for Zimbabwe, we have faith for Zimbabwe but also we have faith for the nations of SADC. Its a day for SADC as well.\n\nWutawunashe said that President Mnangagwa will lead the nation in prayer, offering thanksgiving for the blessings bestowed upon hardworking Zimbabwean families.\n\nThis occasion also presents a unique opportunity for the President to dedicate national projects and personal endeavours to the Almighty.\n\nWutawunashe further underscored the profound significance of this interaction, underlining the importance of fostering a strong relationship between national leaders and the Church. She believes that dedicating oneself to God is essential for the spiritual and moral well-being of any nation.\n\nThis is an event that brings our national leaders, community leaders, from business and every sector of the nation including traditional leaders will be well represented. Every last Sunday of the year, Zimbabwe gives thanks for everything God has given us. We say Ebenezer.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-12-1.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  THIS year’s National Thanksgiving and Dedication Service, now in its eighth year, will take on a regional dimension with the attendance of representatives from all SADC member states.  President Mnangagwa, the current SADC Chairperson, is set to preside over this significant event, which will be held tomorrow at the Zimbabwe International Trade Fair […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": ". . . Brian Bennett silences critics with historic ton",
            "url": "https://www.chronicle.co.zw/brian-bennett-silences-critics-with-historic-ton/",
            "content": "Brandon Moyo,[emailprotected]\n\nAT just 21 years old, Brian Bennett has cemented his status as a rising star in Zimbabwean cricket.\n\nHis phenomenal performance in the first innings of the historic Boxing Day Test match against Afghanistan at Queens Sports Club has left fans and critics alike in awe.\n\nBennetts batting masterclass on day two of the match saw him score a brilliant 110 runs not out off just 124 balls, etching his name into the annals of Zimbabwean cricket history.\n\nThis achievement makes him the second-youngest player to score a century for Zimbabwe, behind only Hamilton Masakadza, who achieved the feat at just 17 years old.\n\nBennetts impressive innings included five fours and four sixes, along with 39 singles and 11 twos. His century was brought up in style, with a six in the 135th over while batting with Trevor Gwandu.\n\nThe shot almost resulted in his dismissal, but the fielder stepped on the boundary rope while holding onto the ball.\n\nThis historic feat is not only a testament to Bennetts individual talent but also a milestone for the Zimbabwean team. Alongside captain Craig Ervine and Sean Williams, Bennett is part of a team that has made history by posting their highest-ever Test score, with three centurions in an innings for the first time.\n\nBennetts rise to prominence has been swift. He made his First-Class debut for Mega Market Mountaineers in 2022, scoring 28 runs in his first match. To date, he has played 12 First-Class matches, accumulating 725 runs, including two centuries and four half-centuries. His best score in four-day cricket is 264 not out, and he boasts an impressive average of 40.21.\n\nBennett made his Test debut against Ireland in Belfast in July and has been widely touted as Zimbabwes next big thing across all three formats. He is already a mainstay of Zimbabwes white-ball squads.\n\nThe Chevrons were eventually bowled out for 586 runs in 135.2 overs, surpassing their previous best of 563/9 (declared) against the West Indies in Harare in 2001.\n\nAs Bennett continues to make waves in the cricket world, fans cant help but wonder what the future holds for this talented young batsman.\n\n@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-24.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com  AT just 21 years old, Brian Bennett has cemented his status as a rising star in Zimbabwean cricket.  His phenomenal performance in the first innings of the historic Boxing Day Test match against Afghanistan at Queens Sports Club has left fans and critics alike in awe. Bennett’s batting masterclass on day two of […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": "Victoria Falls still thundering: Tourists flock despite misleading reports",
            "url": "https://www.chronicle.co.zw/victoria-falls-still-thundering-tourists-flock-despite-misleading-reports/",
            "content": "Leonard Ncube,[emailprotected]\n\nVICTORIA Falls, the thunderous heart of Zimbabwe, pulsated with life as the festive season unfolded.\n\nDespite persistent rumours of the majestic waterfalls drying up, tourists from across the globe and a wave of returning locals, flocked to witness its awe-inspiring beauty.\n\nThe Ministry of Tourism and Hospitality Industry anticipated a record-breaking year, with visitors expected to surge close to 3 million, fuelled largely by the homecoming of Zimbabweans from the diaspora.\n\nFrom adrenaline-pumping adventures like bungee jumping, gorge swings, and the Flight of Angels, to serene game drives, wildlife interactions, tours of the Falls, and tranquil moments surrounded by breath-taking beauty  these have been the experiences of tourists this festive season. Tourists enjoyed an array of experiences, from bungee jumping and gorge swings to the thrilling Flight of Angels helicopter ride. Others took in game drives, interacted with wildlife, or simply marvelled at the magnificent waterfall. Victoria Falls delivered something for everyone  whether it was adrenaline or relaxation.\n\nVictoria Falls proved once more why it remains a top destination for holidaymakers seeking both relaxation and adventure. The resort city welcomed a mix of visitors including groups, families, schools, and individuals. Home to one of the Seven Natural Wonders of the World, known locally as Mosi-oa-Tunya (The Smoke That Thunders), Victoria Falls boasts unparalleled natural beauty, wildlife, and adventure opportunities.\n\nIn recent months, misleading reports have circulated, claiming the waterfall is drying up. However, these claims dont reflect the true picture. The Zambezi River, which feeds the Victoria Falls, experiences seasonal fluctuations and while water levels are lower between October and January, this is completely natural. According to the Zambezi River Authority, water levels are expected to rise again in February, bringing Victoria Falls back to its thunderous grandeur just in time for the rainy season.\n\nThough water levels were lower this season due to the effects of climate change and El Nio, Victoria Falls remained a vibrant, thriving destination. Despite recent negative publicity suggesting that the Falls are dry, these claims are misleading, considering the Zambezi Rivers seasonal flow patterns and the influx of tourists.\n\nVisitors were undeterred by the reduced flow, continuing to flock to the area to enjoy the lush landscapes, abundant wildlife, and thrilling experiences. Victoria Falls continues to draw visitors year-round, offering unforgettable experiences that highlight its enduring magnificence.\n\nAccording to the Zambezi River Authority, the amount of water in the Falls is low between October and January as part of its natural cycle.\n\nThe Zambezi River, Africas fourth-longest, flows through Zambia, Angola, Namibia, Botswana, Zimbabwe, and Mozambique.\n\nVictoria Falls, the worlds largest curtain of falling water, sees its flow down the waterfall dip below 1 000 cubic metres per second during the dry season extending between October and January, with levels expected to rise again by late February.\n\nThe worst seasons were 2016-2017 and 2023-2024 as a result of the devastating climate change and El Nio-induced drought, with this years levels in the same range. The 2008-2009 season had the highest low levels compared to other years during the period October to January. Water levels are expected to pick up next month and reach a peak at the end of February when the river will be full until May when it will start falling again. The long-term mean was highest in the 1961-1962 rainy season when water flowing down the waterfall between March and May reached a peak of more than 8 000 cubic metres per second. Every year there is less than 1 000 cubic metres per second of water falling down the waterfall between October and December.\n\nCurrent water levels on the Zambezi River are 475,83 metres compared to 477,16 metres last year during the same period, according to the Zambezi River Authority.\n\nThe dry season, which occurs annually, is a natural part of the Victoria Falls seasonal cycle which tourists flock to witness while enjoying the lush green landscapes and abundant wildlife within the Victoria Falls National Park. During the rainy season, the waterfall returns to its thundering grandeur, with its mist visible from miles away  an experience that continues to leave visitors in awe. Despite these natural fluctuations and the misleading reports, Victoria Falls remains a bustling hub of activity. Visitors have not been deterred as hotels and lodges on either side of the river reported steady bookings, and tour operators were busier than ever, showing that the destination offers much more than just its water levels.\n\nEphias Mambume, president of the Employers Association for the Tourism and Safari Operators, highlighted the surge in local and regional tourists during the festive season.\n\nWe have experienced a healthy percentage around 80 to 90 percent occupancy, he said, noting significant bookings in AirBnBs and a bustling Rainforest area with regional visitors. Popular activities included sunset cruises and tours of the Victoria Falls, with operators fully booked, said Mr Mambume. He implored the Government to urgently rehabilitate the Bulawayo-Victoria Falls highway for seamless travel.\n\nElephant and Cheetah Experience marketing manager Janice Ncube noted that the majority of clients this season were locals eager to interact and walk with cheetahs and elephants.\n\nThe local market has been awesome. If it wasnt for the local market, December would be a low season for us, she said.\n\nTourism and Hospitality Industry Minister Barbara Rwodzi, who spent nearly a week in Victoria Falls until Christmas Eve, affirmed that the influx of visitors was a result of vigorous marketing and President Mnangagwas policy of engagement and re-engagement.\n\nMinister Barbara Rwodzi\n\nIt shows that people love Zimbabwe and they have been waiting to hear whats good about Zimbabwe. The foreign policy that President Mnangagwa has been running with for the past seven years, Zimbabwe is Open to Business is paying dividends, she said.\n\nThe festive seasons vibrancy in Victoria Falls demonstrated the destinations resilience and enduring appeal, ensuring it remains a top choice for holidaymakers from around the globe. @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-41.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw  VICTORIA Falls, the thunderous heart of Zimbabwe, pulsated with life as the festive season unfolded.  Despite persistent rumours of the majestic waterfalls drying up, tourists from across the globe and a wave of returning locals, flocked to witness its awe-inspiring beauty.  The Ministry of Tourism and Hospitality Industry anticipated a record-breaking year, with […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": "Gog’ Bekezela’s transformative journey. . . leading the charge in cultural and spiritual revival",
            "url": "https://www.chronicle.co.zw/gog-bekezelas-transformative-journey-leading-the-charge-in-cultural-and-spiritual-revival/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nIN a blurring of lines thats unsettling to some and exhilarating to others, the worlds of entertainment and spirituality are colliding.\n\nSouthern Africa, a region where cultural identity and ancestral reverence are deeply ingrained, has become a fertile ground for this convergence. Entertainers, once solely purveyors of pleasure, are increasingly positioning themselves as spiritual authorities.\n\nCase in point, musician and culturist Bothwell Bekezela Nkomo, now known as Gog Bekezela. His transformation exemplifies this trend, raising profound questions about the erosion of traditional spiritual practices and the potential for exploitation within this increasingly blurred landscape.\n\nGogo traditionally carries maternal significance, representing wisdom and nurturing. However, within spiritual circles, it embodies a higher, supernatural power. Celebrities like Genesis Gabriella Tina Manney  better known as Gigi Lamayne  Evias Bhebhe, and Zodwa Wabantu have also embraced roles as spiritual guides. This growing phenomenon raises questions about the impact of spiritualism on the entertainment industry and the responsibilities of those who adopt these roles.\n\nEarlier this year, during the National Arts Merit Awards (Nama) held at the Zimbabwe International Exhibition Centre (ZIEC) in Bulawayo, a Saturday Leisure crew encountered Gog Bekezela, who made a striking impression with an outfit reminiscent of a spiritual healer. His appearance was not merely a fashion statement but a significant transformation in his identity.\n\nI am now Gog Bekezela, he announced, revealing that his new name reflects a spiritual calling that has reshaped his life and career.\n\nThis announcement surprised many who believed he had faded from the music scene, unable to replicate the success of his hit song Bekezela, which had captivated audiences.\n\nContrary to these assumptions, Gog Bekezela explained that he had spent the last two years in search of spiritual clarity. This journey took him across Southern Africa, including South Africa, Zimbabwe, and Botswana, as he sought answers to the troubling questions that haunted his soul.\n\nI was laying low, seeking spiritual clarity, he shared, emphasising that this period of introspection was crucial for his transformation.\n\nUpon completing his initiation, Gog Bekezela returned to the public eye, co-ordinating the Inxwala Memorial performance lecture at the Bulawayo Arts Festival (BAF) in June. This event was not merely a showcase of cultural performance but a platform for education and remembrance of the traditional ceremonies associated with the Inxwala. Attendees included cultural enthusiasts and respected figures such as Chief Dakamela and Dr Gasolo, all of who celebrated the rich tapestry of their heritage.\n\nIn a revealing interview with Culxure Mag, Gog Bekezela elaborated on the implications of his new identity.\n\nWhen I came back from the initiation process, I had to return to the music stream but in a different dimension. I am no longer an entertainer like before; I am now more of an educator, he explained.\n\nThis statement underscores a significant shift in his role as an artiste  moving from mere performance to cultural stewardship.\n\nFor Gog Bekezela, being called Gogo is a spiritual affirmation.\n\nWhen you see me, you see only the flesh, but there are ancestors that govern me on this path, he explained.\n\nHe acknowledged that while his previous persona as Bothwell or Bekezela may have been entertaining, it lacked the spiritual depth he now embodies.\n\nI cant heal a person or help you grow spiritually, but my spirit is the one that can perform those things, he stated, illustrating the duality of his existence.\n\nThis duality is not unique to Gog Bekezela; it reflects a broader trend among artistes who feel a deep connection to their cultural roots.\n\nWhen you see me, you see two versions: the Bekezela you grew up with in the flesh, but spiritually I am a gobela (healer). The spirits that I walk with are the ones leading me in doing these cultural events where you see me singing traditional songs and these lectures, he noted, highlighting the importance of spiritual lineage in his work.\n\nGog Bekezela\n\nHistorically, the anointing of leaders, whether kings or chiefs, involved special traditional rituals that connected them with the spirits of their ancestors. Gog Bekezela draws parallels between these historical practices and his own spiritual journey, suggesting that his work is part of a long-standing tradition of cultural leadership.\n\nAs I walk here, I am not representing myself. Those who are blessed with the spiritual eye can see the people I am walking with, he stated, referring to the ancestral spirits guiding him.\n\nAs he embraces his new role, Gog Bekezela is committed to conducting more traditional lectures and events aimed at preserving and promoting cultural practices.\n\nI am doing this to help those in genuine need, he affirmed, distancing himself from the notion that his spiritual journey is merely a publicity stunt.\n\nHis dedication to educating others about their cultural heritage underscores the potential for artists to play a vital role in the spiritual and cultural awakening of their communities.\n\nThis trend of artistes adopting spiritual roles raises important questions about authenticity and responsibility. As spiritualism gains traction in mainstream media, those in the spotlight need to approach their roles with sincerity and respect for the traditions they represent. Case in point is when sungura musician, Gift Amuli decided to abandon his traditional healing calling, barely two months after being initiated into the craft two years ago.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/bekezela-2.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com IN a blurring of lines that’s unsettling to some and exhilarating to others, the worlds of entertainment and spirituality are colliding. Southern Africa, a region where cultural identity and ancestral reverence are deeply ingrained, has become a fertile ground for this convergence. Entertainers, once solely purveyors of pleasure, are increasingly positioning themselves […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": "Well done Chevrons, what a splendid performance!",
            "url": "https://www.chronicle.co.zw/well-done-chevrons-what-a-splendid-performance/",
            "content": "THE Zimbabwe senior mens cricket team has etched its name in history books with a phenomenal achievement of three players scoring centuries in a single innings.\n\nSean Williams, skipper Craig Ervine, and Brian Bennett demonstrated unwavering resilience, collectively defying expectations to steer the Chevrons to a record-breaking 586 runs in the ongoing Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo.\n\nThis monumental feat shattered the doubts of many Zimbabwean fans, who had anticipated a lacklustre performance from the Chevrons following their dismal showing in the limited-overs series against Afghanistan.\n\nThe Chevrons were whitewashed in both the one-day internationals and T20I series at Harare Sports Club.\n\nThe significance of this achievement cannot be overstated. For the first time in Zimbabwean cricket history, three batsmen scored centuries in one innings, underscoring the exceptional talent and unyielding determination of the current squad. Williams spearheaded the charge with an impressive 154 runs, showcasing his mastery with the bat.\n\nHe was well supported by Ervine, who batted brilliantly to score 104 runs while Bennett finished off the innings with an unbeaten 110. Together, they ensured that Zimbabwe batted their way to a commanding position against Afghanistan.\n\nThis performance is not only remarkable for the individual achievements of the three batsmen but also for the teams success as a whole. The Chevrons have struggled in recent years to compete on the international stage, and this innings showed that they are capable of standing toe-to-toe with the best teams in the world if the right players are selected and apply the correct techniques.\n\nWe could not be prouder of our team. This historic feat is not only a highlight for Zimbabwean cricket but also for cricket as a whole. It is a reminder that the sport is about more than just individual brilliance but also about teamwork, perseverance, and passion.\n\nThis innings has set a benchmark for Zimbabwean cricket, and we hope to see more performances like this in the future.\n\nWe encourage the players to build on this success and to continue to work hard towards achieving their goals. With performances like this, we do not doubt that Zimbabwean cricket has a bright future.\n\nCongratulations to Williams, Ervine, and Bennett, as well as the rest of the team and coaching staff, on this remarkable achievement.\n\nNow, its time for the bowlers and fielders to step up and take inspiration from their teammates. With the historic win within reach, they must use this momentum to their advantage.\n\nThey should focus on bowling tight lines and executing their plans while also maintaining sharp fielding standards. If they can do this, they can surely clinch a notable Test victory that will serve as a reminder of their resilience and talent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dghh.jpg",
            "description": "THE Zimbabwe senior men’s cricket team has etched its name in history books with a phenomenal achievement of three players scoring centuries in a single innings. Sean Williams, skipper Craig Ervine, and Brian Bennett demonstrated unwavering resilience, collectively defying expectations to steer the Chevrons to a record-breaking 586 runs in the ongoing Boxing Day Test […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": "Mother appeals jail term for disciplining teenagers",
            "url": "https://www.chronicle.co.zw/mother-appeals-jail-term-for-disciplining-teenagers/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nQINISO Ndlovu, a 35-year-old woman from Tsholotsho, has filed an appeal with the High Court after being sentenced to an effective 20 months in prison by Magistrate Lesigo Ngwenya for disciplining two teenage girls.\n\nThe incident stemmed from an altercation where the girls, known for their disruptive behaviour and frequenting local bars, allegedly used vulgar and provocative language. Ndlovu, angered by their conduct, reportedly beat them up using a stick.\n\nThe trial presented conflicting evidence. A medical report submitted to the court claimed the girls suffered serious injuries, including near-broken limbs, allegedly inflicted with a pick handle, although this alleged weapon was not produced in court.\n\nNdlovu, represented by Makiya and Partners, argues in her appeal that the magistrate erred by failing to consider community service as a more suitable punishment. Zimbabwean law allows for community service as an alternative to imprisonment for sentences of two years or less, a range that encompasses the sentence imposed in this case.\n\nThe court a quo erred in passing a custodial sentence to the appellant despite her having pleaded to the charge and being a first offender. The effective sentence of 20 months was so excessive as to induce a sense of shock for a first-time female offender who pleaded to the charge, where the sentencing guidelines provide for a non-custodial sentence in the form of a fine not exceeding Level 14, argued Ndlovu.\n\nNdlovu contends that the court erred by failing to adequately consider her mitigating circumstances. She stressed her status as a widow, a single mother, and the sole provider for three young children. Despite these significant factors, the magistrate imposed a custodial sentence, effectively separating her from her dependants.\n\nNdlovu implored the court to grant her appeal, setting aside the current sentence and remitting the case back to the lower court for a more appropriate and just sentencing.\n\nThis case echoes a recent High Court ruling in Bulawayo, where Panashe Mpofu was released from prison after serving time for disciplining teenagers, including her own child, who attended a Vuzu party during school hours.\n\nVuzu parties are notorious for promoting under-age drinking, substance abuse, and risky sexual behaviour, posing significant health risks to young people.\n\nFile picture\n\nMpofu, a resident of Luveve, discovered the teenagers, all in Form Two, engaged in this harmful activity.\n\nWhile some viewed her actions as justified parental discipline, she was ultimately sentenced to two years imprisonment, sparking public outcry and raising concerns about the appropriate response to juvenile delinquency.\n\nFollowing a successful appeal, Justice Evangelista Kabasa of the Bulawayo High Court overturned the conviction, recognising the potential dangers of such parties and acknowledging the complexities of parental responsibility.\n\nIn her own account, Mpofu explained that she discovered her son and his friends engaged in the party after returning home from church. Disturbed by their behaviour, she intervened and disciplined them.\n\nHowever, a complaint from one of the parents led to her arrest and subsequent imprisonment at Mlondolozi Prison.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/rwqg.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw QINISO Ndlovu, a 35-year-old woman from Tsholotsho, has filed an appeal with the High Court after being sentenced to an effective 20 months in prison by Magistrate Lesigo Ngwenya for disciplining two teenage girls. The incident stemmed from an altercation where the girls, known for their disruptive behaviour and frequenting local bars, […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        },
        {
            "title": ". . . Sean Williams’ glorious 154:  A veteran’s showcase",
            "url": "https://www.chronicle.co.zw/sean-williams-glorious-154-a-veterans-showcase/",
            "content": "Brandon Moyo,[emailprotected]\n\nIN a monumental Boxing Day Test match, Zimbabwean cricket saw history being made as the Chevrons scored their highest ever Test innings of 586 runs.\n\nSean Williams, a veteran of Zimbabwe cricket, delivered an outstanding performance, worthy of the occasion at Queens Sports Club.\n\nFacing a boisterous crowd and the weight of history on his shoulders, Williams produced a masterful century.\n\nThe veteran all-rounder has been a significant figure in Zimbabwean cricket for over a decade.\n\nHe captivated the nation with a scintillating innings, culminating in a career-best 154 runs on the second day of the Test match.\n\nThis innings cemented his place among the pantheon of Zimbabwean cricketing greats.\n\nAt 38, Williams finds himself playing alongside an exciting crop of young talents in the Chevrons team. He believes that the current generation of players must stick to the tried and tested principles and methods that have worked in the past to achieve success. Williams has taken on the mantle of mentor for the upcoming players, providing invaluable guidance and support.\n\nBasically, Craig, myself, and Raza have been around for a very long time. Some of these guys are new on the block, and for me, as a senior, its like going back to Grade One.\n\nSikandar Raza\n\nIts actually really refreshing as a senior player to revisit all of those things we used to do in team meetings  taking notes, analysing, checking videos.\n\nThese are some of the things we encourage the youngsters to do, and the coaching staff is backing us on this. Its amazing that something like that came up because not so long ago, I found notes from 2008 in my house. So, it works, and we will continue to do that, said Williams.\n\nIn his 11-year Test career, Williams has played just 16 matches, with an impressive average of 41. For him, preparing for matches doesnt start at international level; its something the youngsters need to develop from the domestic franchise level upwards.\n\nIn the longer format, its about intent. I think having that intent is crucial. But it doesnt start at Test level, it starts at franchise level, where I try to create my own pressure so that I can play the way Im going to play at international level. I would do something at franchise level, putting myself under pressure, so Im constantly training hard. From there, match situations become easier because youve already experienced the pressure you created yourself, and you grow from that, he said.\n\nOver the past few weeks, the veteran campaigner has witnessed both the worst and the best of Zimbabwean cricket. The Chevrons lost back-to-back white-ball series to Pakistan and Afghanistan, and Zimbabwes batting in the white-ball games left much to be desired.\n\nThey, however, managed to turn their fortunes around in the ongoing Test series, with Williams crediting the coaches and the instructions given during team meetings leading up to the match. Another highlight for him has been watching youngsters, such as Dion Myers and Brian Bennett, showing the kind of intent required to succeed.\n\nBrian Bennett celebrates reaching his maiden Test ton for Zimbabwe  Pictures by MK Thobela\n\nThe message from the coaches has been clear; have well-defined plans. You go into training, attend a meeting, and be absolutely clear on what you need to do. Keep the good ball out and score off the bad ball  thats the intent. Every bowler bowls a bad ball, and you have to put it away. You need to be brave enough to put it away. The youngsters are starting to show that, and Im very happy to see that, as is the coaching staff. The intent one batter shows allows others to score. He ends up benefiting from that intent, and thats what we want for the team.\n\nThe all-rounder has amassed 1 109 Test runs in 11 matches, including five centuries and three half-centuries. In the first innings against Afghanistan, Williams played a composed knock, which included 10 fours and three sixes, at a strike rate of 88.5.\n\nHis innings was characterised by smart running between the wickets and taking singles. For Williams, his batting approach is a way of showing the youngsters that they can play freely and express themselves.\n\nI just want to show the kids that bravery is okay. You can do it. Thats all I want to do. Im playing with them, and if I can lead by example  not just by words  I think the kids will grow from that really fast. They will start doing similar things, both off the field and on it, and that for me is the best I can do as a senior player, while also maintaining discipline and professionalism, he said.\n\nWilliams century on day one came three years after his last, which, coincidentally, was also against Afghanistan in Abu Dhabi in 2021.\n\nIt was his third century against Afghanistan. He now shares the joint fourth-most Test centuries for Zimbabwe with Hamilton Masakadza, trailing only Andy Flower (12), Brendan Taylor (6), and Grant Flower (6).\n\nWilliams performance in the Boxing Day Test will forever be etched in Zimbabwean cricketing history. He has shown that he still has the skills and determination to perform at the highest level, and his contribution in guiding the next generation of players will undoubtedly have a significant impact on the future of Zimbabwean cricket.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ju.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com  IN a monumental Boxing Day Test match, Zimbabwean cricket saw history being made as the Chevrons scored their highest ever Test innings of 586 runs.  Sean Williams, a veteran of Zimbabwe cricket, delivered an outstanding performance, worthy of the occasion at Queens Sports Club.  Facing a boisterous crowd and the weight of history […]",
            "time": "06:08",
            "date": "28 Dec 2024"
        }
    ]
}