{
    "news": [
        {
            "title": "Nigerian pastor acquitted of rape after eight years in South African jail",
            "url": "https://www.chronicle.co.zw/nigerian-pastor-acquitted-of-rape-after-eight-years-in-south-african-jail/",
            "content": "After spending eight years in jail, a Nigerian televangelist accused of raping young women from his South African church has been found not guilty of all charges.\n\nTimothy Omotoso had denied the 32 charges in a trial that was broadcast live and gained huge interest across the country.\n\nIn 2018, one witness told the court she had been raped by the pastor  who ran a church in the city of Port Elizabeth  when she was 14 years old.\n\nWhen delivering the verdict on Wednesday, the judge presiding over the trial said that Mr Omotoso had been found not guilty because prosecutors had mishandled the case.\n\nThe NPA said it would now consider its legal options and that the drawn-out nature of the trial was partly down to Mr Omotoso filing numerous legal challenges.\n\nFor his part, Mr Omotoso told the media he thanked God for the verdict.\n\nHi co-accused, Lusanda Sulani and Zikiswa Sitho, were also found not guilty.\n\nMr Omotoso was dramatically arrested at an airport in 2017 as he sought to leave the country.\n\nHis trial was the first prominent rape case to be broadcast live in a country where sexual violence is rampant.\n\nThe hearings attracted huge interest, and raised difficult questions about victims rights, impartiality and whether justice is best served by having television cameras in courtrooms.\n\nFollowing Wednesdays verdict, Mr Omotoso will be deported to Nigeria, South African media outlet News24 reported. -BBC\n\n",
            "image_url": null,
            "description": "After spending eight years in jail, a Nigerian televangelist accused of raping young women from his South African church has been found not guilty of all charges. Timothy Omotoso had denied the 32 charges in a trial that was broadcast live and gained huge interest across the country. In 2018, one witness told the court […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "President for Africa Education Summit",
            "url": "https://www.chronicle.co.zw/president-for-africa-education-summit/",
            "content": "Mashudu Netsianda in Victoria FallsPRESIDENT Mnangagwa is expected to officially open the 3rd Africa Education Summit 2025 in Victoria Falls today, reaffirming Zimbabwes commitment to transformative education and regional collaboration in advancing the sector.\n\nThe highlight of the event is the keynote address by President Mnangagwa while several distinguished speakers have been lied up to make presentations on different topics.\n\nThe high-profile event, which started on Thursday, brought together education ministers, policymakers and stakeholders from across Africa to deliberate on strategies for enhancing the continents education systems in line with Agenda 2063 and Vision 2030.\n\nVision 2030\n\nIt is running under the theme: Translating our Educational Advancement to Continental Development.\n\nThe 3rd Africa Education Summit is a premier event dedicated to fostering educational advancement across the continent, being jointly hosted by Global Skills Hub United Kingdom, Africa Education Stakeholders and the Government of Zimbabwe.\n\nIt seeks to create a transformative experience that will drive educational and developmental progress across Africa.\n\nAccording to organisers, President Mnangagwa is expected to arrive at the venue of the summit at 9.30 AM followed by a briefing by Primary and Secondary Education Minister Torerayi Moyo.\n\nVice-Presidents Dr Constantino Chiwenga and Cde Kembo Mohadi are also expected to attend the official opening ceremony.\n\nVice President Constantino Chiwenga\n\nThe Second Republic, under the leadership of President Mnangagwa continues to prioritise education as a key driver of socio-economic transformation with the summit providing a platform to share best practices and innovative solutions.\n\nDiscussions are expected to focus on curriculum innovation, funding strategies and digital education, setting the stage for transformative policies that will shape Africas education landscape for years to come.\n\nThe first Africa Education Summit was held in Rwanda and the second in Nottingham in the UK. The second Summit was held under the theme: Entrepreneurship and Skills Development in the 21st Century Education System: The African-European Perspectives.\n\nIt made a clarion call for governments, civic society organisations and international partners to prioritise investments in education infrastructure, teacher training and targeted support for marginalised groups.\n\nThe Summit also identified the need for a paradigm shift in education systems towards a knowledge-based economy, driven by technological advancements and globalisation and the re-imagining of education curricula to foster creativity, problem-solving, critical thinking, adaptability and pursuing innovative solutions to complex challenges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/xcvesdvcsedxcx.jpg",
            "description": "Mashudu Netsianda in Victoria Falls PRESIDENT Mnangagwa is expected to officially open the 3rd Africa Education Summit 2025 in Victoria Falls today, reaffirming Zimbabwe’s commitment to transformative education and regional collaboration in advancing the sector. The highlight of the event is the keynote address by President Mnangagwa while several distinguished speakers have been lied up […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "ANC Youth League pays  courtesy call on President",
            "url": "https://www.chronicle.co.zw/anc-youth-league-pays-courtesy-call-on-president/",
            "content": "Joseph Madzimure, Zimpapers Politics HubZIMBABWE remains committed to building a future where young people are empowered to lead, protect and develop the nation, President Mnangagwa has said.South Africas ANC Youth League President, Cde Collin Malatji, paid a courtesy call on President Mnangagwa at State House yesterday expressing gratitude for his efforts to empower youth.\n\nSouth Africas ANC Youth League President, Cde Collin Malatji\n\nHe is in the country to endorse and prepare the upcoming International Youth Summit on Land and Economic Development which will be held in Harare from May 23-26 this year.\n\nWriting on his X handle President Mnangagwa said the discussions focused on Zimbabwes youth empowerment policies in land access, entrepreneurship and economic inclusion.\n\nOur discussions also laid the foundation for the upcoming International Youth Summit on land and Economic Freedom to be held in Harare from May 2023-26, said President Mnangagwa.\n\nSpeaking soon after the meeting Cde Malatji hailed President Mnangagwa who is the SADC chairman for spearheading youth empowerment programmes.He highlighted that they discussed a number of issues such as empowerment programmes, how the Zimbabwe operated under the Government of National Unity in 2008 and the Africa Youth summit.\n\nOne of the issues we discussed with the President is how they survived the Government of National Unity in 2008, as you are aware in South Africa we are facing that challenge now where we have invited different political parties to come and form a Government in South Africa,.\n\nHe also said that he was impressed with how the Government is supporting the youth to participate in the mainstream economy.\n\nOn the issue of land, I have seen there is progress, I witnessed President Mnangagwa giving farming equipment to the youth on Wednesday. The youth are expected to run the food basket of Zimbabwe in terms of food security, he said.\n\nPresident Mnangagwa\n\nHe commended Zimbabweans for taking the issue of land seriously.\n\nWe are here to learn how the party and the state operate. We are happy to hear that the role of the State is to implement the resolutions of the party made at conferences. The party and the Government are not separated, he said.\n\nFurther, he said they also discussed the Africa Youth Congress which they are working together with Zimbabwean leadership led Cde Taurai Kandishaya. The summit will be held here in Zimbabwe.\n\nWe are here to set up a strong team to organise this congress to be a success. We are going to travel to SADC countries and some parts of Africa meeting youth and share the same vision and objectives such as that of Zanu-PF, he said.\n\nHe challenged Zimbabweans who are in South Africa to come and work with the Government instead of organising unnecessary protests in foreign land.\n\nThe chairperson of Africa Youth Congress president Cde Taurai Kandishaya said preparations are going-on well.\n\nWe are winding up our preparations working together with our South African counterparts, he said.\n\nCde Malatji said President Mnangagwa was very excited to see the youth from Zanu PF and ANC working together.\n\nHe told us to continue working together saying that our future is bright, he said.\n\nPresident Mnangagwa has been actively promoting youth empowerment through various initiatives, including the Presidential Youth Empowerment Scheme, which aims to provide opportunities for young Zimbabweans to contribute to the countrys development.\n\nThe delegation witnessed the handover of over 72 high-tech tractors and 10 combine harvesters valued at US$7,4 million in Hatcliff on Wednesday to youth agricultural groups from the different provinces which is being championed by President Mnangagwa.\n\nThe handover is a follow-up to the Presidential Youth Empowerment Scheme that was recently launched, with the President pledging to pay 50 percent of the total cost of the equipment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vjdgf90ufg.jpg",
            "description": "Joseph Madzimure, Zimpapers Politics Hub ZIMBABWE remains committed to building a future where young people are empowered to lead, protect and develop the nation, President Mnangagwa has said. South Africa’s ANC Youth League President, Cde Collin Malatji, paid a courtesy call on President Mnangagwa at State House yesterday expressing gratitude for his efforts to empower […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Euphoria as Amai’s Traditional  Cookout returns with a big bang",
            "url": "https://www.chronicle.co.zw/euphoria-as-amais-traditional-cookout-returns-with-a-big-bang/",
            "content": "Sikhulekelani Moyo,[emailprotected]THE Amai Traditional Cookout Competition returned for 2025 with a new and all-encompassing category, including people living with disabilities, as part of efforts to promote gastronomy, township tourism, and community empowerment, while leaving no one and no place behind.\n\nIt was a hive of activity at United College of Education (UCE) in Bulawayo on Thursday, as hundreds of people gathered to witness the Bulawayo leg of the provincial cookout competition, which featured professional chefs, tertiary students, community members and individuals with disabilities.\n\nThe cookout programme is a concept introduced by First Lady Dr Auxillia Mnangagwa in 2019.\n\nSince then, the Ministry of Tourism and Hospitality Industry has been tasked to coordinate the implementation of the programme together with provinces and other line ministries.\n\nTourism and Hospitality Industry Minister Barbara Rwodzi was the guest of honour at the event, accompanied by Bulawayo Minister of State for Provincial Affairs and Devolution, Judith Ncube.\n\nOther notable attendees included senior Government officials from various ministries such as Women Affairs, Community, Small and Medium Enterprise Development, Higher and Tertiary Education, Innovation, Science and Technology Development.\n\nMinister Rwodzi highlighted that Amais Traditional Cookout Competition has made notable strides in inclusivity this year by introducing persons living with disabilities.\n\nAmai has introduced a new approach this year, bringing together people with disabilities and men who can cook for their families, promoting unity and inclusivity.\n\nThis move aligns with the Presidents vision of leaving no one and no place behind, which promotes unity and inclusivity.\n\nThe cookout competition was divided into four categories, comprising community participants, professional chefs, students and people living with disabilities.\n\nAt the centre of the competition was Zimbabwes signature dish, the highfiridzi, a delicious mix of beef and leafy greens (rape/covo or tsunga) simmered to perfection.\n\nThe stage was set for a showdown of flavours, as participants from Bulawayo took to the stoves to prepare one of Zimbabwes favourite dishes, the renowned highfiridzi.\n\nThis beloved Zimbabwean delicacy is usually served with sadza/isitshwala, and its name traces back to Highfield, one of Harares oldest high-density suburbs, where lush backyard gardens supply the fresh vegetables that give this dish its authentic, natural flavours.\n\nWe want to thank our First Lady for this initiative and for being a patron who is giving us a good direction that is even recognised by the UN (United Nations) Tourism, which has given our destination an endorsement, Minister Rwodzi said.\n\nShe also revealed that since the inaugural United Nations Regional Forum on Gastronomy for Africa was held last year in Victoria Falls, there has been a significant improvement in the tourism sector, with the number of visitors continuing to increase.\n\nFrom July 2024 up to now, as we are speaking, we are experiencing several tourists that are coming from international markets because UN Tourism has endorsed our destinations.\n\nMinister Rwodzi said that gone were the days when restaurants displayed notices advertising traditional foods on Wednesdays.\n\nInstead, she said it should be an everyday thing, and foreign dishes should be the ones put on the rosters.\n\nShe said Zimbabweans should be proud of themselves in every respect, from tradition, culture, food, dressing and music to local/traditional dances.\n\nFrom the four categories, the judges selected the top three winners, who will proceed to the national cookout competition once all provincial competitions have been completed.\n\nThe winners shared their excitement in separate interviews, eager to advance to the national cookout competition.\n\nI didnt expect to win, as I had hastily prepared these dishes, but surprisingly, I emerged as the winner, said Mrs Sithabisile Sibanda, a 42-year-old who is visually impaired, making her debut participation in this years competition and scooping the first prize.\n\nI would like to thank Amai (Dr Auxillia Mnangagwa) for including persons with disabilities; now we feel included, and this keeps us going.\n\nAs a person living with disability, most of the time we used to be left out and we were not able to participate with other women, but with this, I feel great.\n\nAnother participant, Mrs Fortunate Mapfunde-Ndlovu, who came first in the community category, said the cookout competition was a learning curve for her.\n\nIm looking forward to owning my business, which will be focusing more on traditional dishes. I also recommend those in the catering sector to embrace our local dishes, she said\n\nChef Sharon Ngoma from Enterprise Hotel won in the professional chef category. She said, I wasnt expecting to be a winner. The process was tough because we started cooking at 2AM, but it was worth it.\n\nI give thanks to Amai, this cookout competition is a game changer for the industry.\n\nFor the tertiary student category, the winner and first runner-up were students from Bulawayo Polytechnic School of Tourism and Hospitality.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fdghknuidrfd.jpg",
            "description": "Sikhulekelani Moyo, sikhu.moyo@chronicle.co.zw THE Amai Traditional Cookout Competition returned for 2025 with a new and all-encompassing category, including people living with disabilities, as part of efforts to promote gastronomy, township tourism, and community empowerment, while leaving no one and no place behind. It was a hive of activity at United College of Education (UCE) in […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "COMMENT: Residents’ vigilance needed to flush out gun-toting elements in Bulawayo",
            "url": "https://www.chronicle.co.zw/comment-residents-vigilance-needed-to-flush-out-gun-toting-elements-in-bulawayo/",
            "content": "Bulawayo is witnessing an upsurge in armed robberies, a confirmation that guns are now in wrong hands.\n\nIn the past two weeks alone, police in Bulawayo were engaged in a number of shoot-out incidents with armed robbers resulting in the death of eight robbers.\n\nLast week a police officer sergeant Abel Masava was shot dead by armed robbers after he confronted them in Sizinda suburb while a neighbourhood watch committee member from Nketa suburb recently escaped death by a whisker when one of the three armed men he confronted during a night patrol, fired at him and missed.\n\nThe armed robbers continue to change their modus operandi hence the need for the police to take advantage of the modern policings advanced technologies to monitor their activities and swiftly respond to distress calls.\n\nThe police should be on top of the game and there is an urgent need to conduct another exercise to check on gun licences. We have every season to believe that most of the guns being used by robbers were either stolen or smuggled into the country from neighbouring countries such as South Africa.\n\nThe criminals committing the robberies live in communities and it is therefore incumbent upon each and every citizen to report these criminals to the police. Residents should assist the police to flush out these undesirable elements that are terrorising them by providing information.\n\nIn a bid to fight crime, police in Bulawayo in October last year launched closed-circuit television (CCTV) and Artificial Intelligence (AI) systems in the city to enhance their policing activities.\n\nThe system leverages artificial intelligence and other advanced technologies to reduce reliance on physical police presence. Under the system which at the moment just covers the Central Business District (CBD), cameras which have sophisticated features such as facial recognition, night vision and vehicle plate recording devices are strategically positioned to record data.\n\nThis is in line with modern policing that provides real-time monitoring and analysis of activities in a given area. Due to limited resources, it is not feasible to have the entire city monitored by CCTVs hence the need for residents to continue complementing police efforts to fight crime by providing information. We have already alluded to the fact that the armed robbers that are terrorising residents live in communities and these communities should reject them.\n\nCommunities, we want to emphasise, should not be safe havens for criminals. At this juncture, we want to once again implore the police to undertake another clean up exercise to get rid of guns in wrong hands.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/cctv-630x380.jpg",
            "description": "Bulawayo is witnessing an upsurge in armed robberies, a confirmation that guns are now in wrong hands.  In the past two weeks alone, police in Bulawayo were engaged in a number of shoot-out incidents with armed robbers resulting in the death of eight robbers.  Last week a police officer sergeant Abel Masava was shot dead […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Former POSB CEO Kandlela hailed for transforming bank",
            "url": "https://www.chronicle.co.zw/former-posb-ceo-kandlela-hailed-for-transforming-bank/",
            "content": "Business Writer\n\nThe late former POSB chief executive officer, Mr Admore Kandlela, who was laid to rest at Glen Forest Cemetery on Friday, March 28, 2025, has been hailed for his visionary leadership and dedication, which left an indelible mark on the Peoples Own Savings Bank (POSB).\n\nThe POSB family and the broader community gathered to honour and celebrate the life of Mr Kandlela, who passed away on March 25, and was laid to rest at Glen Forest Cemetery.\n\nThe burial was attended by colleagues in the financial services sector, friends and family members.\n\nIn a speech at the burial, POSB CEO, Mr Garainashe Changunda, highlighted the profound impact Mr Kandlela had on POSB and the financial services sector in Zimbabwe.\n\nMr Kandlelas tenure at POSB began in October 2003 and he retired in October 2022 after nearly two decades of transformative leadership.\n\nHe was mandated to transform the bank from a mere postal savings bank to the commercial bank that POSB is today.\n\nTHE Peoples Own Savings Bank (POSB)\n\nMr Kandlelas contributions extend far beyond the walls of POSB. He leaves behind an enduring legacy that has profoundly impacted the entire Zimbabwean financial services sector.\n\nOur nation, and the banking industry in particular, has lost a visionary leader, a man of unwavering principle, known for his adherence to policy, respect for authority, and keen analytical mind.\n\nHis influence is a source of inspiration, a beacon guiding us forward, said Mr Changunda.\n\nUnder Mr Kandlelas guidance, POSB achieved significant milestones, including the establishment of a comprehensive network of the banks service centres across all provinces, the creation of an extensive agency network, and the integration of modern technologies and digital platforms.\n\nHis visionary leadership helped POSB become a leading provider of sustainable and impactful financial services in Zimbabwe.\n\nThe POSB family and the financial services sector at large expressed their deep sorrow at the loss of Mr Kandlela. Mr Changunda added: His presence resonated with warmth and wisdom, fostering a spirit of unity and purpose.\n\nTinonzwa moyo yedu kurwadziwa nekurasikirwa kwataita naVaKandlela (We feel the deep pain of our hearts).\n\nHis legacy of innovation, integrity, and compassion will continue to resonate in the hearts and minds of those who knew him and his visionary leadership and unwavering dedication will inspire ongoing efforts to transform POSB and effectively serve its stakeholders, he added.\n\nMr Kandlela is survived by wife, Kudakwashe and son, Admore Kandlela Junior.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dsada.jpg",
            "description": "Business Writer The late former POSB chief executive officer, Mr Admore Kandlela, who was laid to rest at Glen Forest Cemetery on Friday, March 28, 2025, has been hailed for his visionary leadership and dedication, which left an indelible mark on the People’s Own Savings Bank (POSB). The POSB family and the broader community gathered […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Cowdray Park suburb expansion stretches social amenities",
            "url": "https://www.chronicle.co.zw/cowdray-park-suburb-expansion-stretches-social-amenities/",
            "content": "Raymond Jaravaza,[emailprotected]WITH a population of over 75 000, the continued expansion of Bulawayos biggest suburb  Cowdray Park  is piling pressure on already stretched social amenities amid growing demand for new schools, clinics and judicial services, among others.\n\nCowdray Park has a population of more than 75 000 residents, much bigger than Gwanda Town, according to the 2022 Population and Housing Census, making it the second most populous urban ward in Zimbabwe, after Harares Budiriro, which has over 89 000 residents.\n\nThe suburbs population is larger than that of towns like Gwanda (27 000 residents) and Hwange (40 000 residents). As the population continues to grow, the demand for essential services like education, healthcare, and shopping facilities is becoming increasingly urgent.\n\nWard 15 Councillor, Ashton Mhlanga, whose area covers Cowdray Parks Phase I and 2, as well portions of Phase 3 called upon Government to expedite the construction of a new magistrates court to decentralise judicial services.\n\nCowdray Park is facing a sharp increase in crime and desperately needs a big police station, similar to what residents of suburbs such as Nkulumane and Pumula have, and a magistrates court so that our residents can easily access essential services.\n\nThe suburb keeps growing leading some people to call it a city within a city and we are calling for Government to decentralise essential services such as the judiciary and the registrars offices, said Clr Mhlanga.\n\nOn the education front, he said his ward only has two primary schools, an untenable situation that forces pupils to attend classes in the afternoon under trees because of shortages of classrooms.\n\nWe cannot continue having a situation where our children attend classes in the afternoon under the hot-sitting arrangement where grades are divided into morning and afternoon classes.\n\nTo address the shortage of schools in my ward, we need about four new primary schools to cater for the ever growing population, he added.\n\nClr Mhlanga also bemoaned poor roads and lack of sewer reticulation system in some sections of the suburb where residents are still using Blair toilets and access into the suburb is difficult as a result of poor roads.\n\nThe Member of Parliament for the area Cde Arthur Mujeyi, concurred that the rapid growth of the suburb has resulted in a severe shortage of schools, clinics and other essential amenities.\n\nWhile the suburbs population continues to expand rapidly, infrastructure development has failed to keep pace with the growing demand.\n\nGovernment is aware of the challenges of social amenities faced by Cowdray Park residents hence the construction of Cowdray Park Clinic which has seen residents accessing services at their doorsteps, said Cde Mujeyi.\n\nHe said individuals had identified investment opportunities in the education sector and were building primary and secondary schools in the suburb to complement Government and Bulawayo City Council (BCC)s efforts to build schools.\n\nThe growth of Cowdray Park is presenting business opportunities in the health and education sectors with the establishment of private schools and privately run clinics and pharmacies, said Cde Mujeyi.\n\nHe said there were two clinics built by Government and council but there is still a lot that Government must do to provide essential services to the people.\n\nThe shortage of schools in the suburb is forcing many parents to send their children to schools in Luveve, Emakhandeni or town.\n\nIn the Hlalani Kuhle/Garikai area, a makeshift secondary school  Onxy Academy  was established last year to fill the gap. The school has 100 students.\n\nA resident, Mr Orlando Mlilo, expressed concern over the shortage of schools in the suburb.\n\nCowdray Park is growing at an alarming rate but the construction of schools is not keeping pace.\n\nTwo years ago, I tried to enrol my son at Luveve High but they told me that the school only accepts children from their suburb, he said.\n\nAccording to 2023 statistics from the Ministry of Primary and Secondary Education, Zimbabwe has 10 517 schools. Ideally, the ratio of schools to population in the country should be about one school for every 1 500 people, based on a 95 percent gross enrolment rate in primary education and a national population of 16 million.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/zxcasczxcawszx.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw WITH a population of over 75 000, the continued expansion of Bulawayo’s biggest suburb — Cowdray Park — is piling pressure on already stretched social amenities amid growing demand for new schools, clinics and judicial services, among others. Cowdray Park has a population of more than 75 000 residents, much bigger than […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Zifa evoke Warrior pride",
            "url": "https://www.chronicle.co.zw/zifa-evoke-warrior-pride/",
            "content": "Eddie Chikamhi,Zimpapers Sports Hub\n\nEXCITING times beckon for domestic football following the launch of a national campaign by Zifa yesterday, appealing to local designers and the games enthusiasts to design unique and inspiring brands and kits that reflect national identity.\n\nThe groundbreaking initiative, dubbed the Warrior Pride: Brand Design Battle, was announced by Zifa president Nqobile Magwizi in Harare, and will run for the next six weeks.\n\nThe winning design will not only become the official brand and kit for the national teams, but also earn the designer a US$3 000 cash prize, and an all-expenses paid trip to watch the Warriors opening match against Egypt at the 2025 Africa Cup of Nations in Morocco.\n\nMagwizi said submissions will be evaluated by a panel of industry experts, and fans will have their say by voting on the final four designs via social media.\n\nIt is a groundbreaking national campaign that puts the creative power into the hands of Zimbabweans, he said.\n\nFor the first time, we are inviting graphic designers, artists, football fans, and creative minds across Zimbabwe to shape the future identity of our national football teams.\n\nThis is your chance to design a brand and kit that truly represents the spirit, resilience, and unity of Zimbabwe in football.\n\nThis initiative is designed to engage the nation in the creative process of branding our national teams. Of course, encourage creativity and participation from designers and football enthusiasts, as well as showcase our national pride through unique and inspiring designs, said Magwizi.\n\nAccording to Zifa, the competition is open to graphic designers and artists, football fans, Zimbabwean youth, social media creatives, advertising agencies and all talented Zimbabweans.\n\nParticipants will be asked to submit a brand name and a logo/icon design with a description of the inspiration behind it; three jersey designs  a home kit (yellow), an away kit (green), and an alternative kit (white), incorporating the colours of the Zimbabwean flag, and additional branded merchandise like caps, souvenirs and t-shirts.\n\nDeadline for the submissions is May 15.\n\nThe adjudication panel is led by renowned academic and branding expert Christopher Sachikonye.\n\nIt also includes communications industry entrepreneur Sapi Bachi, Faithwear founder Brett van Rooyen, Ebenezer Ayisa, Danayi Madondo, Carl Joshua Ncube and Footballers Union of Zimbabwe president Desmond Maringwa.\n\nMagwizi said the campaign was more than just a competition as it seeks to rally the cross-section of Zimbabweans behind the national teams.\n\nThis is more than a competition . . . It is a celebration of our national pride, our creativity and our passion for football.\n\nWith the hashtags #WarriorPride and #ZimKitChallenge, let us turn this into a national movement that unites Zimbabweans through design and football. This is our opportunity to leave a lasting legacy for Zimbabwe and football.\n\nOf course, I will expect people to submit their designs before the 15th of May and be part of this history. I hope we are all up for the challenge. The countdown starts now, said Magwizi.\n\nHe said the winning brand and kit designs could be on display when Zimbabwe play at the upcoming Afcon 2025 in Morocco this December.\n\nThe first aspect we are looking at is a brand that will be owned by Zifa. This brand will then be applied to the kits. The first assignment or the primary application that were looking to proliferate this brand is on the 2025 Afcon kits.\n\nSo, were going to have a brand which were going to own for a long time as an association and this brand will be applied to various merchandise. But our first product will be the kits, said Magwizi.\n\nWe are looking at a situation whereby annually we design new kits. But the brand wont change.\n\nAnnually, well be looking to have new kits and of course, we are going to look at the various teams, the Under-17s etc.\n\nI know we are looking at the 2028 Olympics as well, where we need to start building those teams again and they must also have their own kits.\n\nBut, at this point, we are looking at the national team thats going to Afcon.\n\nThose are the three kits that have been requested by the competition. But beyond that, of course, other designs can then be applied elsewhere, added Magwizi.\n\nThe Zifa executive committee have since their election in January come up with various initiatives aimed at giving the national game a professional outlook and commercial value.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/sdfd-1.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub EXCITING times beckon for domestic football following the launch of a national campaign by Zifa yesterday, appealing to local designers and the game’s enthusiasts to design unique and inspiring brands and kits that reflect national identity. The groundbreaking initiative, dubbed the “Warrior Pride: Brand Design Battle”, was announced by Zifa president […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Kirsty Coventry receives heartfelt send-off as she prepares for new role at IOC",
            "url": "https://www.chronicle.co.zw/kirsty-coventry-receives-heartfelt-send-off-as-she-prepares-for-new-role-at-ioc/",
            "content": "Trust Khosa,Zimpapers Arts and Entertainment Hub\n\nFormer Sports, Recreation, Arts and Culture Minister Kirsty Coventry, was given an emotional farewell on Wednesday night at the Heritage Village in Harare.\n\nThe National Arts Council of Zimbabwe (NACZ), in collaboration with various stakeholders, organised a remarkable banquet that celebrated not onlyCoventrys achievements but also the unity and spirit within Zimbabwes arts and sports community. The event transformed into a grand celebration, bringing together stars, sports administrators, and music lovers for an evening of delicious food and heartfelt camaraderie.\n\nVarious speakers offered glowing tributes to Coventry, who is set to leave Zimbabwe soon to take up her new role as the president of the International Olympic Committee (IOC). This historic achievement, following her victory on March 20, saw her become the first woman and the first African to assume the role of IOC president, succeeding Thomas Bach of Germany.\n\nHaving served in the Cabinet of Zimbabwe for seven years, Coventrys contributions have left a lasting mark on the countrys sporting and cultural landscape.\n\nLieutenant General (Retired) Anselem Nhamo Sanyatwe, the new Minister of Sports, Recreation, Arts and Culture, was the guest of honour. He expressed his admiration for Coventry, noting her immense contribution to both sports and society.\n\nKirsty Coventry joins in dance with the new Minister of Sports, Recreation, Arts, and Culture, Lieutenant General (Retired) Anselem Nhamo Sanyatwe (left), and the Ministrys Permanent Secretary, Nicholas Moyo (right)\n\nIts a special night for all of us as we gather to celebrate a remarkable individual. This is your life  a true champion both on and off the field, a beloved friend and sister, the golden girl. We are here to bid you farewell and not goodbye, as you embark on a new and profoundly significant chapter as the president-elect of the International Olympic Committee, he said.\n\nThe minister showered her with praise, recognising her Olympic achievements.\n\nAs a swimmer, she graced the world stage with exceptional talent, bringing immense pride and glory to Zimbabwe. Her Olympic medals are a testament to her sheer determination and hard work. She has inspired generations of young athletes to pursue their dreams and strive for excellence.\n\nShe brought a fresh perspective and a deep understanding of how sports can unite and uplift communities, he added.\n\nIn an emotional farewell speech, Coventry expressed her deep affection for young talent in Zimbabwe.\n\nI was so priviledged to see young people in our country who have an extraordinary amount of talent, and its our job to ensure that we create an environment for those young talents to succeed and reach their dreams. So, please, keep working hard on their behalf; keep pushing forward the Ministry.\n\nVeteran filmmakers Joe Njagu and Eddie Sandifolo attentively following proceedings\n\nKeep pushing forward all of the different councils and boards because every decision you make today will ensure that the youth of our community reach their full potential.\n\nDeputy Minister of Sports, Recreation, Arts and Culture, Emily Jesaya, who introduced the guest of honour, reflected on the privilege of working with Dr Coventry.\n\nI got to know you when I was young, and I never thought I would work with you one day. It has been a priviledge working under you all these years, Jesaya said.\n\nRenowned musician, Jah Prayzah delivered a flawless performance that left the audience in awe. The night was made even more special when Minister Sanyatwe and Coventry were seen dancing in the auditorium alongside Permanent Secretary Nicholas Moyo, who later delivered a heartfelt vote of thanks.\n\nCoventry, visibly enjoying the moment, danced to Jah Prayzahs songs, demonstrating her love for Zimbabwean music. The auditorium was alive with top artistes, including Albert Nyathi, Hope Masike, Chirikure Chirikure, Sarah Dhliwayo, Peter Churu and award-winning music promoter Partson Chimbodza. Soccer administrators, including new Zifa president Nqobile Magwizi and Simba Bhora Football Club owner Simba Ndoro, also attended.\n\nRepresentatives from the Ministry of Sports, Recreation, Arts and Culture, as well as the National Cultural and Creative Industries, attended the event, underscoring the importance of collaboration in enriching Zimbabwes cultural landscape.\n\nThis gathering was not just a farewell; it was a celebration of Coventrys remarkable achievements and the collective spirit of Zimbabwes sports and arts communities. She was presented with gifts, including artefacts and portraits, which she will keep as mementos from the memorable evening.\n\nCredit for the successful event goes to NACZ director Napoleon Nyanhi, and his team, who worked tirelessly to organise the affair.\n\nI want to thank everybody who came on board on short notice as we organised this event. I had a lot of faith that it was going to be a success, as it turned out to be, Nyanhi said, expressing his gratitude to all who attended.\n\nAs Coventry embarks on her new role at the IOC, she has every reason to reflect on her journey with pride. The night was a fitting tribute to a woman whose dedication to sports and arts administration has left an indelible mark on Zimbabwe and inspired countless young athletes and artists.\n\nWith her leadership, the IOC is poised for transformative changes that reflect inclusion and diversity  values that Coventry holds dear. The world now looks forward to seeing how she will shape the future of the global sporting community.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/saas.jpg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub Former Sports, Recreation, Arts and Culture Minister Kirsty Coventry, was given an emotional farewell on Wednesday night at the Heritage Village in Harare. The National Arts Council of Zimbabwe (NACZ), in collaboration with various stakeholders, organised a remarkable banquet that celebrated not only  Coventry’s achievements but also the unity […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Gweru City Council begins water disconnections",
            "url": "https://www.chronicle.co.zw/gweru-city-council-begins-water-disconnections/",
            "content": "Patrick Chitumba,[emailprotected]THE cash-strapped Gweru City Council (GCC) has started disconnecting water supplies in several suburbs across the city as the local authority intensifies its crackdown on defaulters owing over ZWG1,5 billion.\n\nIndustry alone owes the local authority ZWG1,1 billion.\n\nThe local authority is struggling to meet its financial obligations as a result of declining revenue inflows as most ratepayers including residents, businesses, churches, Government departments, schools and colleges are failing to pay their bills.\n\nGCC said some residents last paid their rates 10 years ago making it difficult for the local authority to meet operational costs as well as paying its workers on time.\n\nThe local authority has also been failing to collect refuse on time, including providing water to residents due to a depressed pumping capacity at its Gwenhoro water treatment plant.\n\nIn an interview yesterday, GCC spokesperson Ms Vimbai Chingwaramusee said the move to disconnect water is aimed at forcing defaulters to settle their bills.\n\nWe have recorded 1 536 disconnections for water consumers owing council over ZWG$36 million. We are taking this route to force defaulters to clear their arrears, she said.\n\nZimbabwe Gold\n\nMs Chingwaramusee said GCC needs revenue to enable it to provide services to ratepayers.\n\nAs council, we are taking all measures including water disconnections to force residents to pay their bills.\n\nDomestic consumers owe ZWG207 million, industry ZWG1,1 billion, commerce ZWG$68 million, Government ZWG79,7 million, Midlands State University ZWG 52,3 million, she said.\n\nMs Chingwaramusee said schools owe council ZWG3,5 million, hotels ZWG2,7 million and churches ZWG5,3 million.\n\nShe urged residents and stakeholders to settle their bills to enable the local authority to provide the required services.\n\nWe remain committed to exploring innovative solutions to reduce our debt and ensure long-term financial sustainability. These figures are a concern and we urge our residents and stakeholders to settle their debts to enable us to deliver on services provision, said Ms Chingwaramusee.\n\nShe said those whose water supplies were disconnected should visit council offices to pay their arrears or submit payment plans.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-1-copy-143.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw THE cash-strapped Gweru City Council (GCC) has started disconnecting water supplies in several suburbs across the city as the local authority intensifies its crackdown on defaulters owing over ZWG1,5 billion. Industry alone owes the local authority ZWG1,1 billion. The local authority is struggling to meet its financial obligations as a result of […]",
            "time": "09:46",
            "date": "04 Apr 2025"
        }
    ]
}