{
    "news": [
        {
            "title": "Hwange town comes to a standstill as Mat North hosts Naph national athletics competitions",
            "url": "https://www.chronicle.co.zw/hwange-town-comes-to-a-standstill-as-mat-north-hosts-naph-national-athletics-competitions/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nHWANGE Town is set to come to a standstill this week as Matabeleland North plays hosts to the National Association of Primary School national track and field athletics competitions at the Colliery Stadium.\n\nThe competitions will be held as from March 17 to March 21st with provinces expected to check in on March 17 and check out on March 21st.\n\nAccording to the Matabeleland North provincial Naph sports chairperson and Lortondale Primary School headmaster, Wilson Ndlovu vetting will be done in the morning of March 18 before competitions start in the afternoon. The next two days will be pound for pound competition.\n\nIn terms of preparedness, Matabeleland North is more than ready, the stadium is in excellent condition thanks to the Hwange Colliery staff as well as our own teams. All the equipment for the meet has been secured, said Ndlovu.\n\nHe said teams will be housed in five different games villages. The host province will be at St Ignatius Primary School together with Harare, Bulawayo and Mashonaland West will be housed Lwendulu Primary School, Midlands and Masvingo at Thomas Coulter Primary School, Mashonaland East and Manicaland will be at Megawatt Primary School in Chibondo suburb while Nechibondo Primary School in Empumalanga suburb will be home to Matabeleland South and Mashonaland Central respectively.\n\nWith regards to team Matabeleland North, Ndlovu said athletes were in good shape after an intense training program.\n\nWe remain in high spirits and hopeful that we will make the province proud, he said.Mashonaland West Province are the defending champions having bagged 28 medals at Kyle College in Masvingo last year.\n\nThey amassed 18 gold, four silver and six bronze medals.Midlands Province settled for second position with only eight gold, 10 silver and 14 bronze.Matabeland North were a disappointing ninth with eight medals being three gold, one silver and four bronze.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/er345.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw HWANGE Town is set to come to a standstill this week as Matabeleland North plays hosts to the National Association of Primary School national track and field athletics competitions at the Colliery Stadium. The competitions will be held as from March 17 to March 21st with provinces expected to check in on […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Bulawayo City Council approves free use of venues for half marathon",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-approves-free-use-of-venues-for-half-marathon/",
            "content": "Online WriterBulawayo City Council has approved the use of its facilities for the upcoming Bulawayo Half Marathon, granting organisers free access to key venues for the event, which is set to take place on 19 April 2025.According to the latest council minutes, Event Coordinator Mr Themba Mhlophe submitted a request for the use of council venues and support in hosting the marathon. The event, last held in 2005 as the Coca-Cola Bulawayo Half Marathon, is set to return as a major sporting and promotional event for the city.The marathon will begin and end at White City Stadium, with a route covering nearly half of Bulawayos western suburbs. Organisers highlighted the events potential to market the city both locally and internationally through extensive media coverage.As part of the approved request, the Large City Hall was initially proposed for the official launch on 28 February 2025 at 18:00. However, due to a prior booking, the council agreed to provide the Small City Hall instead. Additionally, all 29 ward councillors will be involved in fundraising efforts for the event.Council stipulated several conditions for the event, including the requirement for police clearance, traffic and crowd control measures, and indemnification against property damage or injuries. Organisers must also ensure proper sanitation throughout the event and formally book the facilities as per standard procedures.The decision marks a significant step in promoting sporting activities in Bulawayo, with the council acknowledging the marathons role in enhancing the citys visibility and fostering community participation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/Untitled-48.jpg",
            "description": "Online Writer Bulawayo City Council has approved the use of its facilities for the upcoming Bulawayo Half Marathon, granting organisers free access to key venues for the event, which is set to take place on 19 April 2025. According to the latest council minutes, Event Coordinator Mr Themba Mhlophe submitted a request for the use […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Slain cop’s daughter pens letter to mum: ‘I can’t live without you’",
            "url": "https://www.chronicle.co.zw/slain-cops-daughter-pens-letter-to-mum-i-cant-live-without-you/",
            "content": "Peter Matika,[emailprotected]\n\nTHE tragic death of Detective Constable Cassandra Hove, a victim of suspected friendly fire, has been compounded by the deeply affecting words of her ten-year-old daughter.\n\nIn a letter that has moved many to tears, the child, grappling with immeasurable loss, penned a message to her mother, an ethereal communication that she hopes would reach her in Heaven.\n\nThe emotional letter, now in possession of Saturday Chronicle, reveals the depths of her sorrow and the enduring bond between mother and child, highlighting the personal tragedy behind the headlines.\n\nI didnt know that this day would come, you posted me on your status saying that you want to see me growing up, please come back to me, I cant live without you . . . , she wrote.\n\nThe sheer vulnerability of the childs letter, read aloud during Hoves funeral, proved too much for the mourners, who openly wept at her words.\n\nThe air grew heavy with unspoken love and emotions as the letter revealed a childs honesty. It spoke of the games they played, and the memories evoking the warmth and closeness of their relationship.\n\n. . . We used to play together games such as playing cards. . . I used to get sad and also cry, I love you, mom. The best in the whole world. I want to see you because you made me cry. Rest in peace mum, she wrote.\n\nLetter wrote by the daughter\n\nBeyond its emotional impact, the letter has also become a focal point, amplifying the familys insistent demands for a transparent investigation into the precise circumstances surrounding Detective Constable Hoves death.\n\nThe letters impact was further evident during her emotional funeral service held at Nyaradzo Funeral Parlour last Sunday, where heightened emotions among mourners and close family members led to verbal confrontations.\n\nThey insulted police officers who were present, and the familys calls for accountability grew stronger, demanding to know whether Detective Constable Hoves death was an accident or deliberate.\n\nLetter wrote by the daughter\n\nShe was shot dead in what police had initially reported to be a shoot-out with armed robbers in Bulawayos Pumula South suburb during a covert operation. However, it has since emerged that she was allegedly shot by a colleague and not armed robbers.\n\nAccording to the police, Detective Constable Hove sustained gunshot wounds to her upper limbs during the exchange of fire with robbers at around 8:40PM on Thursday last week and was rushed to a nearby private clinic, where she was pronounced dead upon arrival.\n\nIt was only following the incident and after her family raised concerns as to how she was killed that the matter raised eyebrows.The familys pursuit of the truth intensified, demanding to know the identities of the officers deployed in the Pumula South raid and the individual who authorised Detective Constable Hoves post-mortem. They stated that they were not involved in the process and were shocked to learn that someone else had signed documents at the hospital as her next of kin.\n\nDetective Constable Hove was 37 at the time of her death and is survived by four children.Police Commissioner-General Stephen Mutamba has since ordered a comprehensive investigation into the circumstances surrounding her death while assuring the family that no stone will be left unturned, and that justice will be served.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hnjfghf.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw THE tragic death of Detective Constable Cassandra Hove, a victim of suspected friendly fire, has been compounded by the deeply affecting words of her ten-year-old daughter. In a letter that has moved many to tears, the child, grappling with immeasurable loss, penned a message to her mother, an ethereal communication that she […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Zanele rises: Lupane celebrates new era of chieftainship",
            "url": "https://www.chronicle.co.zw/zanele-rises-lupane-celebrates-new-era-of-chieftainship/",
            "content": "Nqobile Tshili,[emailprotected]\n\nLUPANE yesterday celebrated a historic occasion as Zanele Khumalo was publicly acknowledged as Regent Chief Mabhikwa, taking on the responsibilities of her ancestral role. Dressed in a magnificent blue African print, she displayed a quiet dignity and carried herself with an assured grace as she faced her community.\n\nThe event was held at the Mabhikwa Chieftaincy homestead in Jotsholo, where hundreds gathered to witness her unveiling.Born at Mpilo Central Hospital in Bulawayo 35 years ago, Zanele is no stranger to the Jotsholo community.\n\nShe grew up within its bounds, attending Jotsholo Primary and Secondary Schools before migrating to South Africa for further studies and subsequent employment.\n\nThe mother of two returns home to temporarily step into the shoes of her late brother, Vusumuzi Khumalo, the late Chief Mabhikwa, who tragically died in a car crash along the Bulawayo-Victoria Falls Road in 2022.\n\nShe will serve as regent Chief for nine years, until Vusumuzis son, Wayne Makhosemvelo Khumalo, whom President Mnangagwa confirmed as substantive chief, reaches adulthood.\n\nRegent Chief Mabhikwa Zanele Khumalo\n\nYesterday was not a day for her to dominate the speeches. She was only requested to greet the community, which she did with warmth, expressing her love for her people.\n\nMatabeleland North Provincial Council of Chiefs chairperson, Chief Siansali, who was the main speaker, explained to the community the processes leading to Zaneles appointment as regent chief.\n\nHe clarified that in line with Nguni customs, Vusumuzis firstborn son was appointed substantive Chief Mabhikwa, but cannot serve as he is a minor. The family chose Zanele, his aunt, to serve in that capacity. He emphasised that Zanele should understand she was assuming a challenging role.\n\nAs you take up this role, understand that this is not an easy role. As a chief, you have to know that you no longer have the luxury of making jokes. Whatever statement you make will be taken seriously, and people may ignore whatever issue of substance you say and focus on the perceived joke. You will have people without food coming to you seeking assistance. These are issues that become your reality as a chief. You have to earn the respect of your people, said Chief Siansali.\n\nScenes from the introduction ceremony in Jotsholo yesterday\n\nHe acknowledged that not everyone supported her ascension to the position and stressed that she must accommodate and even embrace everyone including her opponents. Chief Siansali affirmed that Zanele, although a regent, will execute the duties of a substantive chief.\n\nI know there were some people who thought this programme would not sail through. But with what we have done today, anything else becomes just noise. May your God and ancestors guide you as you lead your community, said Chief Siansali.He encouraged her to emulate her late brother Vusumuzi, who worked closely with the Government to advance the development of his community.\n\nI would like to encourage the regent chief to work hand in glove with Government, the rural district council, and other developmental agencies in all matters of development. As Government, we take note of the need to marry the elected local Government structures with the traditional leadership structures so as to alleviate tension and conflict between the two. As a traditional leader, you are strategically positioned due to your closeness to the people, he said.\n\nChief Menyezwa described the selection of Zanele as a milestone for Matabeleland North in terms of gender inclusivity within the traditional leadership institution.\n\nWe were only seeing this happening in Matabeleland South. So badala, just know that you will be answerable to her traditional court. Work well with her, said Chief Menyezwa.\n\nVillage heads and other traditional leaders in the community also pledged allegiance to the regent chief.Lupane District Development Coordinator Ennet Sithole read the appointment letter, which was signed on January 13, directing that she receives relevant allowances.@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/r3.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw LUPANE yesterday celebrated a historic occasion as Zanele Khumalo was publicly acknowledged as Regent Chief Mabhikwa, taking on the responsibilities of her ancestral role. Dressed in a magnificent blue African print, she displayed a quiet dignity and carried herself with an assured grace as she faced her community. The event was held […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "COMMENT: Dialogue must urgently address DRC’s quest for sustainable peace",
            "url": "https://www.chronicle.co.zw/comment-dialogue-must-urgently-address-drcs-quest-for-sustainable-peace/",
            "content": "The Democratic Republic of Congo (DRC) is a blessed country.It has probably all the key minerals under the sun. It is the worlds biggest cobalt producer and its second biggest producer of copper. It has about 700 million carats in proven diamond reserves and ranks among the worlds top five in terms of endowment and production.\n\nIt is the worlds number one coltan producer. It met 41 percent of global tantalum demand in 2023, making the country the top producer of the mineral.\n\nYet, this abundance of every valuable mineral in that expansive Sadc country could, instead of it being a blessing, be the proverbial curse.\n\nEveryone, from local villagers, militias, politicians and businesses to regional figures and nabobs on Wall Street and the New York Stock Exchange wants a share of that everything. Most unfortunately the demand is not orderly, but a stampede where guns and bombs rule.\n\nThus, DRC has a protracted history of instability and war, the latest phase of which is underway in the east of that great country. The most prominent protagonist in the flare up which started in 2022 is the Tutsi-led M23, which has active support from one of DRCs eastern neighbours. In recent weeks, the rebels toppled government forces out of two major cities in that direction  Goma and Bukavu  and are marching further towards the west.\n\nSadc has always been seized with the security situation in DRC over almost the past 30 years. On a Sadc mandate, our army got involved there in 1998 when rebels backed by Rwanda and Uganda threatened to overthrow President Laurent Kabila. It demonstrated that supreme Zimbabwean strength when whipping the rebels and their backers out of key positions. Peace deals were signed as well. Substantial stability returned but after our troops left in 2002, new rebellions erupted everywhere in the east.\n\nM23\n\nSadc continued supporting the DRC government to achieve durable peace. In December 2023, the bloc deployed 5000 soldiers drawn from South Africa, Malawi and Tanzania to support the army against the M23.\n\nUnfortunately, the past few months have been difficult for the Sadc mission, resulting in the M23 advancing so fast that Goma and Bukavu fell within 20 days of each other.\n\nAs the guns boomed, Sadc was busy exploring a political solution to the conflict. Angola is leading the Luanda Process. The East African Community (EAC), of which DRC is a member too, as well as Rwanda, has its own peace process. Sadc and the EAC recently agreed to collaborate towards peace.Next week, Angola will host the DRC government and the The Democratic Republic of Congo (DRC)for peace talks.\n\nJust on Thursday, President Mnangagwa, as Sadc chairman, hosted an extraordinary summit to discuss the security situation in the DRC. The summit resolved to withdraw its troops as dialogue intensifies. This was an important step which we hope must be reciprocated by the M23 and its regional backer.\n\nHowever, we strongly urge the leadership of DRC and the Congolese people to lead in the quest for sustainable peace and security instead of acquiescing to foreign fortune hunters.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/12/Job-cuts-in-UN-mission-in-DRC-upset-local-workers.jpg",
            "description": "The Democratic Republic of Congo (DRC) is a blessed country. It has probably all the key minerals under the sun. It is the world’s biggest cobalt producer and its second biggest producer of copper. It has about 700 million carats in proven diamond reserves and ranks among the world’s top five in terms of endowment […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Women in Anime: CherHyuga leads the charge in Bulawayo’s cultural shift",
            "url": "https://www.chronicle.co.zw/women-in-anime-cherhyuga-leads-the-charge-in-bulawayos-cultural-shift/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE calendar flips to April 15, and across Japan, a celebration erupts, echoing around the globe. Its the birthday of Osamu Tezuka, the titan of manga and animation, affectionately known as the Godfather of Anime, whose legacy has ignited a worldwide devotion to the art form, marked by Anime Day. But Bulawayo, ever keen to carve its own cultural niche, isnt content to simply follow the global rhythm. Instead, the city is poised to unleash its very own inaugural Anime Day, at the National Gallery of Zimbabwe (NGZ) in Bulawayo.\n\nCherHyuga\n\nAnime, a distinct style of Japanese animation, has captivated audiences worldwide, gaining immense popularity. The event, spearheaded by Bulawayos own Lizzie Cherish Waldman, a female animator, digital artist, and webcomic creator known as CherHyuga, will see anime enthusiasts gather to celebrate their shared passion. They will indulge in screenings of their favourite anime series and engage in cosplay, embodying their beloved characters.\n\nCherHyuga\n\nIn an insightful interview, CherHyuga explained why Bulawayos first anime festival diverges from the global observance.Anime Day Bulawayo was initially intended to align with the international Anime Day on April 15. However, given the proximity of the Zimbabwe International Trade Fair, March proved a more suitable window. We retained the 15th for its symbolic link to the official date and its falling on a Saturday, allowing greater accessibility for attendees, including students.\n\nCrucially, this decision grants Bulawayo its own distinct day to celebrate anime, rather than rigidly adhering to the global calendar. It also harmonises with Bulawayos event schedule, ensuring anime fans have their dedicated space without conflicting with major events like the ZITF.\n\nAccording to CherHyuga, Anime enjoys a robust and expanding fan base in Bulawayo. Its commonplace to see individuals sporting anime merchandise, and casual inquiries reveal a widespread affinity for the genre. Yet, there remains a gap in understanding animes true essence. Many unfamiliar with it still perceive it as mere cartoons, overlooking the depth of storytelling, artistry, and cultural impact it embodies.\n\nEven on our social media platforms, some comment, Youre celebrating cartoons? Thats childish. This misconception stems from a lack of exposure, as anime isnt as mainstream in Zimbabwe as in other regions. Thats why Anime Day exists  to demonstrate that anime transcends mere entertainment. Its a culture, an art form, and a wellspring of inspiration.She promised attendees an immersive experience.\n\nFans can anticipate stepping into an anime-inspired realm, complete with life-sized standees, themed props, and a stage setting that brings their favourite series to life. Cosplay opportunities will abound, enabling fans to dress as their cherished anime characters.\n\nThe event will feature diverse stalls offering anime merchandise, fashion, food, and more. Were also thrilled to announce the inaugural Zimbabwean appearance of international organisations like We The Free at Anime Day. The day will be packed with activities such as anime scene recreation challenges, giveaways, and much more. Anime Day is about bringing convention-style anime energy to Bulawayo, the festival weve all been eagerly awaiting!\n\nCherHyuga\n\nAs the world commemorates Womens History Month, CherHyugas role as a female animator and curator of this event is particularly noteworthy.\n\nIts never been my primary motivation to inspire other women or to transform a male-dominated space. I pursue this because of my passion, my love for it, and my aspiration to bring events like Anime Day to Bulawayo. It just so happens that in following my passion, Im also creating space for other women in a predominantly male industry. Seeing how my passion has encouraged others, especially women, to embrace anime and creativity makes it even more meaningful.\n\nInterestingly, when we established the Anime Day WhatsApp group, many assumed the event would be male-dominated. Some even questioned whether women would attend, and they were surprised to learn that the organiser, myself, is a female anime fan who draws manga-style comics, animates, reads manga and manhwa, cosplays, and is hosting an anime event. This reaction underscores how rare it is to see women leading in these spaces, but Im delighted to be breaking that barrier.\n\nAnime Day is also about introducing students to digital art and animation, providing young creators, particularly girls, with opportunities to explore these fields while they have ample time. Once they leave school, the time for practice diminishes, and the window to become industry-ready narrows significantly. If I were to relate this passion to Womens History Month, it would serve as a reminder that progress is being made, and I hope to inspire other women to embrace their love for anime, create freely, and claim their space in this industry.\n\nCherHyuga showcasing her works\n\nCherHyugas creative journey has evolved into multiple ventures, including Cherhyuganime, a brand dedicated to anime-inspired art and fashion, and Anime Anime Anime, a platform fostering an anime enthusiast community in Bulawayo. Her ambition extends further; she plans to open an anime merchandise boutique in Zimbabwe, fulfilling a long-standing demand for authentic anime goods.\n\nIve been an anime fan for as long as I can recall. As a child watching anime on television, Id rush outside after an episode of Dragon Ball Z to re-enact the Kamehameha, I thought it was the coolest thing ever. But anime wasnt just something I watched; it inspired me to start creating. I was particularly influenced by Naruto, with my drawings still reflecting elements inspired by it and its characters.\n\nThe artistry in anime and manga ignited my desire to tell my own stories. It introduced me to digital art and animation early enough to fully explore them, something that might not have happened otherwise. My greatest inspiration has always been how anime made me feel, how it took me on an emotional journey through its art and storytelling, and how the animation was visually stunning while staying true to its unique style and characters. I want to share that same inspiration with others, whether through Anime Day or my own creative work.\n\nCherHyuga showcasing her works\n\nShe said that her work revolves around bringing anime culture to life through creative projects, be they illustrations, comics, animations, or events. To CherHyuga, Anime Day Bulawayo is more than just an event; its a cultural shift, a step towards making anime culture more recognised and appreciated locally, while also introducing digital art and animation to new audiences.\n\nUltimately, my goal is to grow these initiatives into something lasting, proving that anime can be more than just entertainment. It can be a career path, a source of inspiration, and a thriving part of our creative industry.\n\nFor a long time, animation has been treated as a foreign art form, but recently, in the precinct, animation has been a burgeoning cultural movement pushed by the likes of Kadelwa Ndlovu, Wayne Left Hand Animation Ndebele, as well as Zenzele Ndebele.Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-14-at-20.42.07-18.jpeg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE calendar flips to April 15, and across Japan, a celebration erupts, echoing around the globe. It’s the birthday of Osamu Tezuka, the titan of manga and animation, affectionately known as the “Godfather of Anime,” whose legacy has ignited a worldwide devotion to the art form, marked by “Anime Day.” But Bulawayo, […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "From London to Jutshume: Starlink and CCTV bridge the rural divide for expat",
            "url": "https://www.chronicle.co.zw/from-london-to-jutshume-starlink-and-cctv-bridge-the-rural-divide-for-expat/",
            "content": "Nqobile Tshili,[emailprotected]\n\nACROSS continents, a Zimbabwean in the United Kingdom has forged an ingenious link to his ancestral home. In the remote reaches of Jutshume, Bulilima, Matabeleland South, his family homestead now falls under the watchful eye of a state-of-the-art closed-circuit television (CCTV) system, a digital tether stretching thousands of miles.\n\nDifference Difa Dube, a seasoned computer engineering expert with 24 years of UK residence, has effectively shrunk the vast geographical and temporal divide. By seamlessly integrating the CCTV system with his mobile phone, he maintains an intimate, real-time connection to his rural roots. He can now observe the daily rhythms of his homestead, a silent guardian, ready to alert those within to any hint of impending danger, irrespective of the miles or the time difference.\n\nDifference Difa Ndlovu\n\nJutshume, situated within Chief Madlambuzis jurisdiction, suffers from a lack of reliable telecommunications connectivity, with many residents relying on neighbouring Botswana for services. However, the Governments decision to license Starlink, a satellite internet service provider, has proved a watershed moment for previously unconnected communities, including Dubes.\n\nIn December of the previous year, Dube installed a CCTV surveillance system at his homestead, attributing the initiative to his exposure to technological advancements in the developed world. A computer engineering graduate, he has always been an advocate for cutting-edge technology. He recalls being the first in his community to introduce a mobile phone.\n\nHis modest homestead is now solar-powered, equipped with an electric gate, and features modern amenities typically found in urban environments. During a recent visit to his homestead by the Saturday Chronicle, he readily shared live footage, demonstrating his remote monitoring capabilities.\n\nThey say travel broadens the mind. As we travel and see the lives lived by other people, especially white farmers, that is where I drew my inspiration and mentality on connecting modern devices. Ive asked myself why we cant do the same to our rural homes.\n\nI remember when the mobile phone revolution started, I became the first person from the village to own a mobile phone. Its also the same thing with solar installation, inverters; I am the one who introduced the gadgets to the community, to the shock of the community. So this is a journey that has taken some time; those who are close to me will understand where I come from with issues of adopting technologies, Dube said.\n\n(CCTV) system at Dubes home in Jutshutshume\n\nHe said prior to the CCTV installation, he experienced significant property losses, as only workers resided at the homestead. Dube now feels constantly connected, as his CCTV system is linked directly to his mobile phone.At some point, I had four wheelbarrows in the homestead, but I lost all of them. No one could account for them. Some people would just trespass and steal as there would be no one at home, but the CCTV has given me confidence, and Im more settled now.\n\nAlthough Im not at my homestead, to be quite honest, I feel Im there as well. Im in control of everything. I can even give directions and monitor the implementation of projects, regardless of the distance. Im in control of my home, regardless of the distance, Dube said.\n\nHe said that while distance can often lead to feelings of homesickness, he now feels closer than ever to his home, particularly through the internet-connected homestead monitoring. Dube watches and listens to every detail at the homestead. He also revealed that his surveillance system has contributed to the protection of livestock within the community.\n\nOne night, I managed to save a neighbours donkey from being attacked by a hyena, as I was able to call the people at home, who were indoors, while the hyena attacked the animal just within the vicinity of my home. So this system is very helpful. The cameras are so advanced and sophisticated, as they can detect sound, and can be connected to Artificial Intelligence applications. They can detect fire as well. The cameras also have a tracking mode, meaning if someone comes in, the camera will follow that individual, and the recording is always 24-hour, he said.\n\nDube expressed concern that, while his homestead is connected, the wider community still lacks access to reliable local internet services. He believes this deprives the community of internet-based solutions to their problems.\n\nThere is still a lot that needs to be done, but I have managed to connect using Starlink. We have a stock theft problem, and there is a device to track stock thieves. I designed a device which a cow should swallow and track its movement. It can dictate the boundaries which the animal should cover, and when it exceeds those boundaries, it will alert the farmer. But without the internet connection, it defeats the purpose, he said.\n\nDube stressed the numerous advantages of installing home surveillance systems.I will encourage my brothers and sisters, as we look at the criminality that occurs within our homes, that we install CCTV. After installing the CCTV, you will see the difference; people will respect your home, knowing that each and every step that they take, you will be watching. This brings peace of mind all the time. We record a lot of break-ins and theft, so CCTV wards off criminals. I will advise those who are capable to try and install CCTVs in their homes, as is done by white farmers in their homes, said Dube.\n\nDubes relative, Rasheed Dube, confirmed that the family is experiencing the benefits of the CCTV system.Well, since it was connected, we are recording fewer theft cases at home. The system is ever on, and in case it gets disconnected, he alerts me from his UK base. So generally, this system has increased the security within the home, said Rasheed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-14-at-22.24.37.jpeg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw ACROSS continents, a Zimbabwean in the United Kingdom has forged an ingenious link to his ancestral home. In the remote reaches of Jutshume, Bulilima, Matabeleland South, his family homestead now falls under the watchful eye of a state-of-the-art closed-circuit television (CCTV) system, a digital tether stretching thousands of miles. Difference Difa Dube, […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Ngezi crash the Scottish dream",
            "url": "https://www.chronicle.co.zw/ngezi-crash-the-scottish-dream/",
            "content": "Innocent Kurira\n\nNGEZI Platinum delivered Scottland their first defeat of the season with a slender 0-1 victory, secured by Kudzai Chigwidas second-half penalty. The result not only brought Scottlands flawless start to a halt but also marked the first time they have conceded a goal in this top-flight league campaign.\n\nThe matchs decisive moment arrived in the 77th minute when Chigwida calmly converted from the penalty spot. This followed Frederick Botchways adjudged foul on Tinashe Muvhudzi in the penalty area.\n\nReferee Brighton Chimene immediately pointed to the spot, and despite a noticeable delay from Scottland goalkeeper Talbert Shumba, Chigwida maintained his composure to slot home the games solitary goal.\n\nNgezi Platinums win represented a significant stride forward after their opening-day draw with Kwekwe United and a narrow 1-0 victory over GreenFuel.\n\nScottland coach Tonderayi Ndiraya felt his team were below their usual standard.We had a very good game, which was balanced, but we were not ourselves today. We started very slowly. We could not create chances, and if you dont create chances, you dont win the game. I thought a draw would have been a good result, said Ndiraya.\n\nNgezi Platinums Takesure Chiragwi was effusive in his praise for his sides performance, asserting that the result was a testament to the teams effective tactical approach.\n\nIt was a well-deserved win. Our game plan worked. We wanted to keep possession and make them suffer without the ball, and I think we did that, said Chiragwi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ryj.jpg",
            "description": "Innocent Kurira NGEZI Platinum delivered Scottland their first defeat of the season with a slender 0-1 victory, secured by Kudzai Chigwida’s second-half penalty. The result not only brought Scottland’s flawless start to a halt but also marked the first time they have conceded a goal in this top-flight league campaign. The match’s decisive moment arrived […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Police vow enforcement against all illegal vendors",
            "url": "https://www.chronicle.co.zw/police-vow-enforcement-against-all-illegal-vendors/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE Zimbabwe Republic Police (ZRP) stands ready to collaborate with municipal security and other security agencies across the countrys towns and cities to clear vendors from the streets. This decisive action follows a 48-hour ultimatum issued by Local Government and Public Works Minister Daniel Garwe on Wednesday.\n\nThe directive comes in response to a significant surge in night vending over recent months, which has led to increased pedestrian traffic, widespread littering, and disruption to established businesses operating within central business districts.\n\nThe ZRP stands ready to assist municipalities and towns to enforce the ultimatum given to vendors by the Government. No one is above the law and ZRP will make sure that vendors abide by the laws of the country, said national police spokesperson Commissioner Paul Nyathi.\n\nLocal Government and Public Works Minister Daniel Garwe\n\nIn the past, council police in cities such as Bulawayo and Harare, alongside the ZRP, have engaged in running battles with illegal vendors in attempts to clear them from central business districts.\n\nCommissioner Nyathi emphasised that there will be no preferential treatment in the vendor clean-up across all municipalities and towns. The ZRP, working in conjunction with municipal police and other security agencies, will enforce the Government directive without exception.\n\nIn Bulawayo, vendors are a persistent problem in several streets, including Fort Street and the corner of Leopold Takawira Street, opposite Tredgold Building, where they sell cooked food to overnight travellers to Harare, as well as taxi drivers and touts. Sixth Avenue has also become a problematic area, transforming into a haven for illegal vendors selling cooked food, beef products, chicken cuts, and even illicit alcohol.\n\nVendors have also encroached upon the corner of Joshua Mqabuko Nkomo Street and Fifth Avenue, where shoppers queue for dairy products such as yoghurt, milk, and amasi, as well as juices.\n\nOpposite TM/Pick n Pay Hyper, the area becomes a hive of activity as darkness falls, with numerous vendors descending onto street pavements to sell groceries and second-hand clothes. At the corner of Leopold Takawira and Herbert Chitepo, vendors selling sneakers, vegetables, bread, and eggs on street pavements feel secure once municipal police finish their shift at 5PM.Bulawayo City Council has announced that vendors operating illegally will be allocated vending bays at Egodini Terminus and the Bhaktas Taxi Rank along Lobengula Street.\n\nFor the last two months, council has been working on modalities to relocate illegal vendors to bays at Egodini Terminus and Bhaktas Taxi Rank where there are enough vending bays. The ultimatum by Government to clear all illegal vendors came at the right time and council will abide by the directive.\n\nIn the next few hours (yesterday evening) council municipal police chiefs will be meeting other security agencies to work out how the Government directive will be enforced. Illegal vending is a scourge that brings with it chaos in the city, makes driving in the streets a nightmare and causes a lot of littering, which is unhealthy, said Bulawayo Deputy Mayor Councillor Edwin Ndlovu.\n\nMinister Garwe highlighted that illegal vending perpetuates unsanitary conditions as vendors operate in areas without potable water and ablution facilities.\n\nThe unsanitary conditions pose significant risks for disease outbreaks such as typhoid, dysentery and cholera. Furthermore, the accumulation of waste from these vendors has rendered some roads, sanitary lanes, and sidewalks impassable, exacerbating public health and security issues.\n\nIn light of these pressing issues, the Government is directing all local authorities to clear vendors from undesignated points within 48 hours. During this operation, local authorities will be supported by law enforcement agents to ensure the maintenance of law and order, said Minister Garwe.\n\nMinister Garwe reiterated the Governments commitment to creating a safe, clean, and orderly environment for all citizens.In the matrix of small to medium enterprises, even in our laws, there is no provision for night trading in our cities.\n\nThere is no room for creating capacity for night vendors. Zimbabwe is an economy which operates during the day so we are not going to create a night economy which is driving hate, drug abuse, illicit deals and a lot of ugly issues. For our vendors who operate during the day, we have existing facilities where they can go and operate from, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sx.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com THE Zimbabwe Republic Police (ZRP) stands ready to collaborate with municipal security and other security agencies across the country’s towns and cities to clear vendors from the streets. This decisive action follows a 48-hour ultimatum issued by Local Government and Public Works Minister Daniel Garwe on Wednesday. The directive comes in response […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        },
        {
            "title": "Male chauvinists take heed, comply",
            "url": "https://www.chronicle.co.zw/male-chauvinists-take-heed-comply/",
            "content": "Stephen MpofuPerspective\n\nTHE heading above is a significant challenge for male chauvinists to change their mindsets for the benefit of both men and women and the development of our beloved motherland.\n\nThe voices of women plaiting each others hair or doing dishes in urban areas, crushing grain in mortars or grinding it on stones, fetching water from wells, or doing their laundry at rivers can be heard, calling on men  a minority in this country  to play ball as the time for positive change and equality has come, thanks to our God-sends.\n\nThe God-send in question is the Forum for African Women Educationalists in Zimbabwe (FAWEZ), which is part of the Forum for African Women Educationalists (FAWE), with membership in 10 countries in Africa. FAWE is a pan-African institution that brings together influential women on the continent in support of the continental development agenda and has partnered with the MasterCard Foundation to bring positive change to the continent.\n\nIn our country, women account for 52% of the population of 16 million, yet they play second fiddle to the male minority in all aspects of national development, with vending as their purview. Meanwhile, men dominate politics, governance, and various commercial industries due to their superior educational and professional qualifications.\n\nIn homes, women do all the donkeywork: doing dishes, overseeing the upkeep of their residences and families, while husbands are away soaking it in at drinking places or tending crops in rural areas.\n\nGenerally, women in Zimbabwe are not given the academic and professional opportunities that men enjoy to play influential roles in the development of our country, despite the critical role played by the girl child alongside the boy child in the armed revolution that freed our motherland from white racist colonial rule.\n\nIn these circumstances, women should ideally play a pivotal role in the affairs of our nation, in compliance with the governments policy nyika inovakwa nevene vayo/ ilizwe lakhiwa ngabanikazi balo/ a nation is built by its owners. This way, FAWE will be encouraged to help fund the development and empowerment of women for the development of the African continent.\n\nThis pen also challenges parents to change their primitive and negative beliefs that educating the girl child to equip her with skills brings no benefit to them, as it enriches her husbands family.\n\nYes, yes, it is time that Zimbabwean women run with advanced technologies to move our motherland forward and into brave new futures developmentally and not be made by their minority counterparts, men, to perpetually ride on mundane chores.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/bbf.jpg",
            "description": "Stephen Mpofu Perspective THE heading above is a significant challenge for male chauvinists to change their mindsets for the benefit of both men and women and the development of our beloved motherland. The voices of women plaiting each other’s hair or doing dishes in urban areas, crushing grain in mortars or grinding it on stones, […]",
            "time": "09:46",
            "date": "15 Mar 2025"
        }
    ]
}