{
    "news": [
        {
            "title": "BREAKING NEWS . . . Madodana “Horsepower” Tshabangu is no more",
            "url": "https://www.chronicle.co.zw/breaking-news-madodana-horsepower-tshabangu-is-no-more/",
            "content": "Online Reporter\n\nFORMER Bulawayo social soccer kingpin Madodana Horsepower Tshabangu is no more.\n\nHe was in his 60s.\n\nHis son Maradona confirmed from Johannesburg, South Africa that his dad had breathed his last at 5.50PM on Monday. He could not disclose the doctors diagnosis.\n\nA former Bulawayo Rockets, Meikles and Gweru United centreback came into recognition in 1997 when he convinced the late Nhamo Rusamo to sponsor the inaugural Horsepower tournament which featured teams from the Western Suburbs.\n\nFor years it was a popular end of season get together for the Bulawayo football loving community and many players including Benjani Mwaruwari got exposure from the tournament and were snapped up by clubs.\n\nTshabangu at some stage had 78 teams affiliated to his own social soccer league in the city.\n\nMaradona said since it has just happened, he will have a clearer picture about burial arrangements tomorrow.\n\nHe died at a time when his son had sent Zimpapers Sports Hub an SOS seeking assistance for his medical bills.\n\nDoctors in Johannesburg had advised the family that he could not be operated on because he was very weak.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/02/Madodana-Horsepower-Tshabangu-njube.jpg",
            "description": "Online Reporter FORMER Bulawayo social soccer kingpin Madodana ‘Horsepower’ Tshabangu is no more. He was in his 60s. His son Maradona confirmed from Johannesburg, South Africa that his dad had breathed his last at 5.50PM on Monday. He could not disclose the doctors’ diagnosis. A former Bulawayo Rockets, Meikles and Gweru United centreback came into […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Radio icon Ishmael Mzilethi remembered at 14th anniversary tombstone unveiling",
            "url": "https://www.chronicle.co.zw/radio-icon-ishmael-mzilethi-remembered-at-14th-anniversary-tombstone-unveiling/",
            "content": "Leonard Ncube,[emailprotected]\n\nFORMER Radio 2 (now Radio Zimbabwe) presenter Ishmael Simiso Mzilethi was remembered on Saturday when his children held a tombstone unveiling ceremony for him, 14 years after his death.\n\nThe ceremony, held at Pelandaba Cemetery and the family house in Pumula, evoked nostalgic memories of the presenter, then known as Isilo Somsakazo, particularly how he captivated radio audiences and made Pumula proud.\n\nIshmael Simiso Mzilethi\n\nBorn in Bulawayo, Mzilethi died on 19 September 2010, aged 52.\n\nAt the time of his death, he had left ZBC and ventured into farming, but he remains one of the finest and crme de la crme of radio presenters in the country, having worked for both the Rhodesia Broadcasting Corporation before independence and the Zimbabwe Broadcasting Corporation after 1980.\n\nHis four children, Gugulethu, Hlengiwe, Zimiso, and Phiwokuhle, decided to honour their father with a tombstone, and the unveiling was marked with nostalgic memories as Pumula residents, family, and friends from elsewhere took turns to imitate his voice on radio.\n\nThe widow of the late Ishmael Simiso Mzilethi Mrs Immaculate Mzilethi (second from left) flanked by the late broadcasters three daughters and one of the grandchildren\n\nMzilethi was well-known for his trademark introduction, Town ePumula, sangena Isilo, which made him a household name, as he would always include Pumula in most of his radio broadcasts.\n\nHe worked alongside many presenters before and after independence in Harare and Bulawayo, including Sam Mkhithika, Inglam Nyathi, Jonathan Mutsinze, Lazarus Tembo, Nhlanganiso Mathimba, Nsukukazifani Ngwenya, Jabulani Mangena, Elias Mange Ndebele, Eric Knight, Ezra Tshisa Sibanda, Aby Dube, Sam Sibanda, Nonceba Mnkandla, Gift Msipha, Grey Gambiza Moyo, Joe Panganai, Simon Pashoma Ncube, Itai Godfrey Muchada, Brenda Moyo, Tilda Moyo, Malaki Nkomo, Deans Patrick Mutume, Regina Mpofu, Elizabeth Chengeta, Haile Velaphi Mlangeni, and others.\n\nA majority of them have since passed on.\n\nWhile his former colleagues could not attend the tombstone unveiling, Mzilethis four children decided to continue from where he left off 14 years ago. The ceremony reminded people of the old Radio 2.\n\nFr Leonard Baa of the Roman Catholic Church Nkulumane 12 Parish led the unveiling.\n\nThe late Mzilethis sister, Mrs Sikhanyisiwe Mzilethi-Ndlovu, said he had shown an interest in radio from a young age, at Hauke Primary School in Nkosikazi and Luveve High School.\n\nHe used to imitate radio presenters of the time at home and at school, and would also write news about his community and read it to his siblings.\n\nHe joined radio as a young boy in 1973, after his father, who had retired from teaching due to a bus accident and joined the Civil Registry Department as a registrar in Bulawayo, passed away.\n\nA friend of his father helped him secure a job at Rhodesian Broadcasting Corporation as a presenter, and he worked there until after independence, in both Harare and Bulawayo.\n\nWhen he retired from radio, he worked for Progressive Insurance.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Simiso-Mzilethi2.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw FORMER Radio 2 (now Radio Zimbabwe) presenter Ishmael Simiso Mzilethi was remembered on Saturday when his children held a tombstone unveiling ceremony for him, 14 years after his death. The ceremony, held at Pelandaba Cemetery and the family house in Pumula, evoked nostalgic memories of the presenter, then known as Isilo Somsakazo, particularly […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "ZIFA Elections list out! Big names axed",
            "url": "https://www.chronicle.co.zw/zifa-elections-list-out-big-names-axed/",
            "content": "Online Reporter\n\nPROPHET Walter Magaya, Gift Banda, Farai Jere, Temba Mliswa, and Benjani Mwaruwari are missing from the list of candidates just released by the ZIFA Electoral College as eligible to take part in the January 25 elections.\n\nThe list of those who will contest for ZIFA president, vice president, and ordinary member was released on Monday evening.\n\nOver the past two weeks, the electoral body has been focused on checking the curriculum vitae of all the candidates to ensure they meet the integrity and ethics standards set.\n\nIn the list just released, the five do not appear. While Mwaruwari confirmed he did not make it, it could not be ascertained whether, in the first place, Banda and Magayawho were touted as favouriteshad thrown their names into the hat.\n\nJere, who is set to step down from the PSL chairmans post on December 31, and Mliswa had confirmed their candidacy.\n\nIn a statement, the ZIFA Normalisation Committee, acting as the ZIFA Electoral Committee in accordance with Article 85(9), said it was pleased to announce the names of all the candidates who have met the eligibility criteria stipulated in the ZIFA Statutes, 2024.\n\nBelow is the full list:\n\nPresidential Candidates:\n\nVice President Candidates:\n\nOrdinary Members:\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/zifa-cc.jpg",
            "description": "Online Reporter PROPHET Walter Magaya, Gift Banda, Farai Jere, Temba Mliswa, and Benjani Mwaruwari are missing from the list of candidates just released by the ZIFA Electoral College as eligible to take part in the January 25 elections. The list of those who will contest for ZIFA president, vice president, and ordinary member was released […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mozambique top court confirms ruling party’s win in disputed election",
            "url": "https://www.chronicle.co.zw/mozambique-top-court-confirms-ruling-partys-win-in-disputed-election/",
            "content": "Mozambiques top court has confirmed the ruling party Frelimos victory in an October election which sparked massive protests by opposition groups who say the vote was rigged.\n\nThe Constitutional Council reaffirmed that Daniel Chapo, Mozambiques ruling party candidate, was declared victor after securing more than 65 percent of the vote. The courts decision revises down the National Election Commissions (CNE) results in thedays after the election which had Chapo with 71 percent of the vote.\n\nThe party increased its majority in parliament.\n\nThe 47-year-old Chapo will officially take office in January. He will be the first President born after independence.\n\nOpposition leader Venancio Mondlane claims the October 9 vote was rigged in favour of Frelimo and that a separate count shows he won enough votes to take the office.\n\nThe latest news from around the world. Timely. Accurate. Fair.\n\nDuring the election outside observers said the election was not free or fair. At the timeEuropean Union poll observers noted the unjustified alteration\n\nThe nations top court has the final say over the electoral process and its ruling is likely to spark further protests in Mozambique, a Southern African country of close to 35 million people which Frelimo has governed since independence from Portugal in 1975.\n\nAt least 130 people have been killed in clashes with police, according to the civil society monitoring group Plataforma Decide since Octobers election.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/bhj.jpg",
            "description": "Mozambique’s top court has confirmed the ruling party Frelimo’s victory in an October election which sparked massive protests by opposition groups who say the vote was rigged. The Constitutional Council reaffirmed that Daniel Chapo, Mozambique’s ruling party candidate, was declared victor after securing more than 65 percent of the vote. The court’s decision revises down […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Announcement of Zifa candidates today",
            "url": "https://www.chronicle.co.zw/announcement-of-zifa-candidates-today/",
            "content": "Online ReporterZIFA have confirmed that the announcement of legitimate candidates for the January 25 elections will be made today.Todays announcement from the ELECTORAL COMMISSION will come in the form of a PRESS RELEASE. There will be *NO PRESS CONFERENCE, Zifa Media announced this morning.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/ZIFA-LOGO.jpg",
            "description": "Online Reporter ZIFA have confirmed that the announcement of legitimate candidates for the January 25 elections will be made today. “Today’s announcement from the ELECTORAL COMMISSION will come in the form of a PRESS RELEASE. There will be *NO PRESS CONFERENCE,” Zifa Media announced this morning.",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "50kgs gold-loaded carbon stolen at gunpoint",
            "url": "https://www.chronicle.co.zw/50kgs-gold-loaded-carbon-stolen-at-gunpoint/",
            "content": "Ronald Mpofu, Online Reporter\n\nAN investigation is ongoing for eight suspects who stole eleven 50kgs of gold-loaded carbon at a mine in Bindura.\n\nThe unidentified suspects were armed with a rifle when they attacked a security guard on duty before breaking into the carbon room.\n\nThe police said in a statement on X that on December 22, 2024, a case of a robbery occurred at a mine in Bindura where eight suspects stole gold-loaded carbon valued at US $36 000 after assaulting the security guard who was on duty.\n\nAnyone with information to report at any nearest Police Station, said the Police in a statement.\n\nWhat is gold-loaded carbon?\n\nIt is just carbon (like charcoal) that has gold stuck to it. Gold in Ore: When gold is found in the ground, its mixed with other materials, so you cant just pick up gold chunks. Its in a form thats hard to get to.\n\nUsing Carbon to Catch Gold: To separate the gold from the rest of the materials, one common method is to use a special kind of carbon. This carbon is very porous (kind of like a sponge), which allows it to catch or trap tiny particles of gold from a solution where the gold is dissolved.\n\nGold-Loaded Carbon: Once the carbon has trapped the gold particles, its called gold-loaded carbon. Its like a sponge holding gold.\n\nGold Recovery: To get the gold back from the carbon, the gold-loaded carbon is treated in a way that lets the gold come off, and then it can be refined and turned into pure gold.\n\nIn short, gold-loaded carbon is carbon thats been used to collect gold from a solution, often during a mining process.\n\nWhy is gold-loaded carbon valuable?\n\nEfficient Gold Extraction: In the mining industry, gold is often found in low concentrations in ore (rock) and must be separated from other materials.\n\nThe carbon used in gold-loaded carbon is highly effective at capturing tiny particles of gold from a liquid solution, making it a crucial part of processes like Carbon-in-Leach (CIL) or Carbon-in-Pulp (CIP).\n\nThis allows miners to extract gold efficiently, even from ores that contain only small amounts of gold.\n\nCost-Effective: The process of using carbon to capture gold (through adsorption) is relatively inexpensive compared to other methods of gold extraction.\n\nOnce the gold is bound to the carbon, it can be easily removed and refined, which saves money for the mining operation.\n\nRecovery of Precious Gold: Gold is a rare and precious metal with high value, so anything that helps recover gold from ore more effectively or efficiently has intrinsic value.\n\nThe carbon itself may not be valuable until it holds the gold, and once its loaded with gold, it can be treated to recover the metal.\n\nReusability: After the gold is recovered from the carbon, the carbon can often be reused in the process, which makes it an economical material for gold extraction.\n\nGold-loaded carbon is valuable because it is an effective tool for extracting gold from ore in a cost-efficient way, helping to recover precious gold that would otherwise be difficult to access.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/GOLD.jpg",
            "description": "Ronald Mpofu, Online Reporter AN investigation is ongoing for eight suspects who stole eleven 50kgs of gold-loaded carbon at a mine in Bindura. The unidentified suspects were armed with a rifle when they attacked a security guard on duty before breaking into the carbon room. The police said in a statement on X that on […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "City Link celebrates 16 years of service",
            "url": "https://www.chronicle.co.zw/city-link-celebrates-16-years-of-service/",
            "content": "Online writer\n\nCity Link Coaches is celebrating its 16th anniversary with the addition of two new luxury coaches to its fleet, further enhancing passenger comfort and convenience.\n\nThe company, which launched its inaugural trip on December 15, 2008, connecting Harare and Bulawayo, has consistently strived to provide a superior travel experience.\n\nThis year marks a significant milestone for City Link, said Nobuhle Gwemende, City Links Operations Manager.\n\nWe are grateful for the unwavering support of our passengers over the past 16 years. These new coaches, the fourth additions this year, demonstrate our commitment to continuous improvement and investing in a top-tier travel experience.\n\nThe state-of-the-art coaches feature luxurious seating, onboard entertainment, free WiFi and USB charging ports, spacious luggage storage, and Improved climate control systems.\n\nTo enhance travel flexibility, City Link has introduced a new 10:00 am service, operating from Thursday to Monday. Passengers on this service will enjoy a complimentary meal from Steers and refreshments.\n\nCity Link continues to connect communities between Harare and Bulawayo with comfort, convenience, and a commitment to excellence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/city-link-bus.jpg",
            "description": "Online writer City Link Coaches is celebrating its 16th anniversary with the addition of two new luxury coaches to its fleet, further enhancing passenger comfort and convenience. The company, which launched its inaugural trip on December 15, 2008, connecting Harare and Bulawayo, has consistently strived to provide a superior travel experience. “This year marks a […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "‘Unity Accord pillar of national cohesion’",
            "url": "https://www.chronicle.co.zw/unity-accord-pillar-of-national-cohesion/",
            "content": "Nqobile Tshili,[emailprotected]\n\nPRESIDENT Mnangagwa has described the 1987 Unity Accord as the cornerstone of Zimbabwes sustainable and inclusive development, which provides a strong foundation for national cohesion and peace in line with the Second Republics development agenda of leaving no one and no place behind.\n\nZimbabwe annually commemorates Unity Day on December 22 to mark the signing of the Unity Accord between Zanu (PF), led by the late former President Robert Mugabe and PF-Zapu, led by the late Vice-President Dr Joshua Nkomo. The agreement ended the post-independence conflict of the early 1980s, ushering in an era of peace that endures today.\n\nWhile the Unity Accord is credited with addressing political challenges, some social issues stemming from the conflict remained unresolved. President Mnangagwas Second Republic has taken further steps to address these challenges, including mandating traditional leaders to spearhead the Gukurahundi Community hearings as the Second Republic takes a bold step towards finding a lasting solutions to the Gukurahundi disturbances. Government is presently procuring resources to facilitate these hearings, which aim to address the lingering social effects of the conflict.\n\nIn October 2022, President Mnangagwa launched a manual on the Gukurahundi community engagement processes by chiefs including a report on their consultative meetings. The manual, which is a product of inclusive engagements between chiefs and various stakeholders, is a culmination of traditional leaders meetings with President Mnangagwa, which started in March 2019. The document will guide chiefs on how to conduct the consultative and engagement process.\n\nIn his Unity Day speech on Saturday, President Mnangagwa acknowledged that the post-independence unrest disrupted Zimbabwes development trajectory. However, he emphasised that the signing of the Unity Accord paved the way for sustainable peace and national development.\n\nThe late President Mugabe and the late Vice-President Nkomo hold hands after signing the Unity Accord on 22 December, 1987\n\nThe accord ushered in unity, peace and stability in our great motherland, Zimbabwe, and laid a firm foundation for national cohesion and development that subsists to this day. Those early years of post-independence unrest unnecessarily delayed our socio-economic growth and cast a dark cloud of disharmony among our people, said President Mnangagwa.\n\nHe said Unity Day serves as a reminder of the collective duty to uphold peace, unity and love as the guarantors of sustainable development.This day, therefore, will forever be etched on our national calendar as a sombre reminder of our individual and collective duty to defend, promote and consolidate the grand national heritage of peace, unity and love. This is the guarantor for sustainable multi-pronged development, said President Mnangagwa.\n\nSince the 1987 Unity Accord, our nation has stood firm and united even in difficult times.\n\nPresident Mnangagwa said the Second Republic is leveraging the prevailing peace to promote inclusive development, ensuring that no one and no place is left behind.\n\nPresently, our nation is moving forward with fervent hope and determination to build a more prosperous future for all Zimbabweans, leaving no one and no place behind. We remain inspired to continue demonstrating unparalleled national strength, resilience and unflinching patriotism to our country, he said.\n\nPresident Mnangagwa commended Zimbabweans for their resilience in the face of external attempts to sow division, noting that self-belief and confidence remain key to the countrys progress.\n\nHe reiterated his administrations commitment to transforming Zimbabwe into an upper middle-income economy by 2030.\n\nThis national consciousness is now imprinted in our individual and collective mindset, embodied by our national development philosophy: Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, he said.\n\nPresident Mnangagwa added that the policies and programmes of the Second Republic are driving increased production and productivity, propelling the country toward Vision 2030.\n\nBrick by brick, stone upon stone and step by step, we are unapologetically marching forward. As the people of Zimbabwe, we are entrenching our identity as an independent, sovereign, free, united and truly liberated African people, he declared.\n\nPresident Mnangagwa highlighted the implementation of the devolution policy as a key driver of inclusive development. The policy has facilitated the funding of development projects across all districts, including the construction of clinics, schools, roads and the installation of piped water systems in rural areas. Additionally, the Government has increased social protection for vulnerable communities, further demonstrating its commitment to inclusive growth. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jyukiyuiu-680x380.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw PRESIDENT Mnangagwa has described the 1987 Unity Accord as the cornerstone of Zimbabwe’s sustainable and inclusive development, which provides a strong foundation for national cohesion and peace in line with the Second Republic’s development agenda of leaving no one and no place behind. Zimbabwe annually commemorates Unity Day on December 22 to […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "Festive season rush hits Bulawayo’s bus termini",
            "url": "https://www.chronicle.co.zw/festive-season-rush-hits-bulawayos-bus-termini/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nMAJOR bus termini in Bulawayo were bustling with activity yesterday as scores of travellers jostled to board long-distance buses to their rural homes ahead of the Christmas holiday.\n\nThe festive season is in full swing, with Unity Day celebrations marking the start of the holiday period across the country yesterday. The hustle and bustle at Bulawayos bus termini reflected the excitement and determination of travellers eager to spend the holidays with loved ones in their rural homes.\n\nWhen a Chronicle news crew visited long-distance bus termini in Makokoba, Entumbane and Nkulumane suburbs, the scenes were vibrant as passengers sought transport to destinations such as Binga, Nkayi, Tsholotsho, Plumtree, Filabusi and Gwanda.\n\nMost passengers expressed excitement about reuniting with their families for Christmas and New Year celebrations.\n\nUnlike in previous years when bus operators took advantage of the high demand for transport to hike fares, this year fares have not been increased.\n\nWe could make more money by increasing fares during this busy period but we must not forget that these are the same people who support our businesses throughout the year, said Mr Michael Khabo, a CAG bus driver on the Bulawayo-Nkayi route.\n\nMr Khabo said his companys management had instructed crews not to increase the fares despite the high demand for transport.\n\nOur customers have been loyal to us and its unfair to take advantage of the high demand for transport during the Christmas season to increase the fares, he said.A trip from Bulawayo to Nkayi costs US$10, with additional charges for luggage. At Renkini Bus Terminus, Mr Emmanuel Phiri, who was transporting a newly purchased scotch cart to his rural home in Gwelutshena, Nkayi, shared his excitement.\n\nThey charged me US$60 for the scotch cart. Ive been saving for months to buy it, and Im happy to finally take it home, he said. Vendors at Old Renkini Bus Terminus also enjoyed brisk business, capitalising on the surge in travellers.\n\nAt Entumbane Complex Bus Terminus, buses to Lupane, Binga, and Tsholotsho were packed with passengers, many of whom had bought groceries for their families back home.\n\nMiss Lisa Bukhosi, travelling to Lupanes Sivalo Village, said: I bought sugar, cooking oil, mayonnaise, flour and rice so that my family can enjoy on Christmas. Ill get bread from the local shops at Sivalo. Christmas and New Year are about family, and I cant wait to see my grandparents.\n\nHowever, some travellers, especially those heading to Binga, faced challenges due to high demand and limited transport availability. Mrs Elina Zombe, travelling with her three children, had been waiting for a bus since early morning.\n\nThe bus we usually use broke down on its way from Binga last night. Theyve promised it will arrive by noon but if not, well take any bus that can drop us at Binga Centre and then we look for transport to our area, she said.\n\nA Galaxy Bus Company driver, who identified himself as Kudzi, said business had picked up significantly since Friday.\n\nThis time of the year is always busy. We have another bus on standby for passengers travelling on the Bulawayo-Victoria Falls route, he said.\n\nAt Nkulumane Complex Bus Terminus, a similar rush was observed, with passengers heading to places such as Matopo, Plumtree, Filabusi and Gwanda.\n\nMr Isaac Mlalazi, travelling to Plumtree, said he preferred buses for their convenience, especially when carrying heavy luggage. It costs me US$3 or R50 to get to Plumtree. Its affordable and convenient, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/RTGTHTY.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com MAJOR bus termini in Bulawayo were bustling with activity yesterday as scores of travellers jostled to board long-distance buses to their rural homes ahead of the Christmas holiday. The festive season is in full swing, with Unity Day celebrations marking the start of the holiday period across the country yesterday. The hustle […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        },
        {
            "title": "‘Local is Lekker’ initiative promotes Zimbabwean products",
            "url": "https://www.chronicle.co.zw/local-is-lekker-initiative-promotes-zimbabwean-products/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nLOCAL producers have praised Budget Cash and Carry for its continued support through the Local is Lekker programme, which showcases locally manufactured products and promotes the Governments import substitution strategy.\n\nThe initiative, hosted at the Budget Cash and Carry in Belmont industrial area in Bulawayo, features exhibition stands displaying a wide range of products made in Zimbabwe. It aims to encourage consumers to buy local products which are of high quality compared to imports.\n\nSpeaking at the Local is Lekker event on Saturday, exhibitors expressed gratitude for the platform, which they said helps them expand their market reach.\n\nBudget Cash and Carry is helping us immensely. Every time we display our products here, we interact with customers and receive positive feedback, said Mr Fahad Maniyar from Kreckle Foods.\n\nThe event attracted both emerging businesses seeking market penetration and established enterprises introducing new products.\n\nAllied Security Company operations manager, Mr Simon Bota, highlighted the significance of the initiative.\n\nIts a good move because it gives us exposure, people can get more information about Allied Security as a provider of security guards and electronic security systems, he said.\n\nFinancial service providers like NMB Bank also participated.\n\nWhat is being done by Budget Cash and Carry around here is commendable, there are other businesses that have new products that are not yet on the market so they are given an opportunity to try and showcase these products, said NMB Bulawayo branch manager Ms Ntombizami Nyathi.\n\nShe said NMB has a lot of financial initiatives that are targeting micro and women-led businesses. Budget Cash and Carry managing director, Mr Raeez Lunat, said the programme plays a critical role in fostering local economic growth.We are trying to promote local products and assist some companies to launch new products, he said.\n\nNew businesses like Chemicare are already reaping the benefits of the initiative.\n\nWith Budget Cash and Carrys help, weve connected with local customers and are gaining popularity, said Mr Dennis Mtoki from Chemicare. Mamas Sauces representative, Ms Thobile Nkomo, echoed similar sentiments.\n\nThe quality of local products is excellent but consumers are unaware of their availability. This initiative bridges that gap and allows us to interact directly with customers, she said.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Budget-Cash-And-Carry-Promotion-1.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com LOCAL producers have praised Budget Cash and Carry for its continued support through the “Local is Lekker” programme, which showcases locally manufactured products and promotes the Government’s import substitution strategy. The initiative, hosted at the Budget Cash and Carry in Belmont industrial area in Bulawayo, features exhibition stands displaying a wide range […]",
            "time": "20:33",
            "date": "23 Dec 2024"
        }
    ]
}