{
    "news": [
        {
            "title": "Government reaffirms commitment to protect industry",
            "url": "https://www.chronicle.co.zw/government-reaffirms-commitment-to-protect-industry/",
            "content": "Judith Phiri, Business Reporter\n\nTHE Ministry of Industry and Commerce has reaffirmed its commitment to continue developing policies that promote industrial development and improve consumer welfare, key to a more conducive environment for sustained business growth.\n\nThe development comes as the Ministry is also implementing President Mnangagwas directive to enhance the ease of doing business to ensure competitiveness and drive sustainable economic growth.\n\nIn his keynote address at the Doing Business in Matabeleland breakfast meeting in Bulawayo on Thursday, Minister of Industry and Commerce, Mangaliso Ndlovu said to protect the local industry, the country will no longer be a dumping site.\n\nWe are strengthening our reserve sectors, people will think we are being unfair to our foreign friends but we aspire to see Zimbabwean creating employment for Zimbabweans. We aspire to see foreigners getting employment from Zimbabweans, he said.\n\nThe Government is resolutely committed to intensifying the fight against smuggling and business malpractices. This is done to protect our vital local industries, create a level playing field for fair competition and ensure consumer protection.\n\nHe said the taskforce on smuggling and business malpractices has registered significant progress across all provinces, as of to date, inspections stand at 1 907, prosecutions at 137, compliance notices at 247 and 3 987 units of products have been seized.\n\nThe Minister said they have now witnessed improvements in sales and shelf occupancy of locally produced goods due to these efforts\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/them.jpg",
            "description": "Judith Phiri, Business Reporter THE Ministry of Industry and Commerce has reaffirmed its commitment to continue developing policies that promote industrial development and improve consumer welfare, key to a more conducive environment for sustained business growth. The development comes as the Ministry is also implementing President Mnangagwa’s directive to enhance the ease of doing business […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "‘Accountants key to economic transformation’",
            "url": "https://www.chronicle.co.zw/accountants-key-to-economic-transformation/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nACCOUNTANTS are the gatekeepers of the countrys national resources and their financial insights must support business growth ultimately contributing to modernisation, industrialisation, and broad-based economic development, President Mnangagwa has said.\n\nHe emphasised that it is the duty of accountants to uphold discipline and integrity, ensuring the nation is safeguarded against unethical financial practices such as manipulation of financial reports and money laundering, among other vices.\n\nThe Head of State and Government made the remarks yesterday in Harare while officially opening the Chartered Accountants Conference, hosted by the Public Accountants and Auditors Board (PAAB) Zimbabwe.\n\nPresident Mnangagwa shows off a token of appreciation from Public Accountants and Auditors Board (PAAB) chairman, Valentine Mushayakarara at the official opening of the Zimbabwe Accountants Conference (ZAC) in Harare yesterday.- Picture: Edward Zvemisha\n\nMy Government recognises the role of accountants in supporting private sector growth and Investment through maintaining accurate financial records, helping businesses to attract investment, access funding, and comply with financial regulations.\n\nAccountants are also key in driving digital transformation and financial inclusion as well as enhancing corporate governance and ethical standards.\n\nYour strategic financial insights must support business growth so that enterprises are competitive, innovative, and sustainable. The role you play in our economy should ultimately facilitate industrialisation, modernisation and overall economic growth across all sectors, he said.\n\nI challenge you, the accountants in both the public and private sectors, to be trustworthy gatekeepers of national resources. Every dollar spent must be accounted for.\n\nHe described accountants as architects of economic transformation, who must carry out their duties with the utmost transparency.\n\nAs you are aware, accountants are not mere record-keepers of financial transactions.\n\nYou are architects of economic transformation, custodians of corporate and public finance, and enablers of national development. Whether in the private sector or the public domain, your work directly influences the efficiency, transparency, and accountability of Zimbabwes economic activities, he said.\n\nPresident Mnangagwa called for stronger regulation in the accounting and auditing professions.\n\nLoopholes that allow financial mismanagement, illicit financial flows, and corporate fraud must be closed with no exceptions. We must ensure that financial professionals operate within the highest ethical and professional standards, in line with the International Federation of Accountants (IFAC) Code of Ethics.\n\nIntegrity, discipline, and ethics must define the Zimbabwean accountant. I, therefore, challenge the Public Accountants and Auditors Board (PAAB) and other regulatory bodies to strengthen all oversight mechanisms that govern your profession. Our economy cannot afford manipulation of financial reports, money laundering, and tax evasion, as these malpractices erode investor confidence and derail development efforts.\n\nHe also called on the PAAB to protect the integrity of the profession by ensuring only those who are qualified and registered practice as professional accountants.\n\nSome of the delegates at the conference in Harare yesterday\n\nThe Public Accountants and Auditors Act should be enforced to the letter and other stakeholders engaged in dealing with unlicensed and rogue practitioners in our market. As a nation, we cannot suffer from the consequences of unethical financial practices, including mismanagement of public funds, insolvency, and stalled economic progress. Corruption is an enemy of development, and it is incumbent upon the accounting profession to take a firm stand against it. Zimbabwe will not tolerate corruption, said President Mnangagwa.\n\nAs accountants, you play a crucial role in strengthening Public Financial Management (PFM). Further, you are key cogs that enhance financial transparency, accountability and efficiency in public sector entities. Government counts on professionals in this field to ensure the proper implementation of our budget, the reduction of corruption and improvements in audit processes throughout all our institutions.\n\nHe implored accountants to act with propriety and fiduciary mind in the fight against corruption.As accounting professionals, you are in almost every facet of our economy, including in Government institutions, private corporations, financial services, and development projects. You see the numbers.\n\nYou know when financial irregularities occur. It is, therefore, your duty to speak out and refuse to be complicit in fraudulent activities. I urge you to act with propriety and fiduciary in the fight against corruption by upholding the principles of transparency, accountability and good governance, he said.\n\nThe future of accounting is evolving, shaped by digital transformation, artificial intelligence, and global financial trends. A future-ready profession must embrace innovation, while ensuring financial sustainability. Zimbabwes accountants must be at the forefront of integrating technology, improving financial reporting systems, and enhancing management frameworks that align with international best practices.\n\nSpeaking at the same occasion, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube commended the Public Accounts and Auditors Board for representing the accounting profession, providing technical and regulatory assistance.\n\nProfessor Mthuli Ncube\n\nAs the authoritative body overseeing the profession, the PAAB ensures that Zimbabwes accounting standards align with global best practices, thereby fostering trust in our financial systems. Through its mandate to set and enforce high-quality auditing, accounting, and financial reporting standards, the PAAB safeguards public interest and strengthens corporate governance.\n\nMy message to you as professionals is that as professionals tasked with ensuring financial propriety and corporate governance, you are the backbone of Zimbabwes financial system, said Prof Ncube. PAAB chairperson Valentine Mushayakarara commended the Government for its commitment towards the success of the accounting profession. The event was attended by Government Ministers, captains of industry, heads of parastatals and state entities, private sector representatives among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-3-680x380.jpg",
            "description": "Zvamaida Murwira, Harare Bureau ACCOUNTANTS are the gatekeepers of the country’s national resources and their financial insights must support business growth ultimately contributing to modernisation, industrialisation, and broad-based economic development, President Mnangagwa has said. He emphasised that it is the duty of accountants to uphold discipline and integrity, ensuring the nation is safeguarded against unethical […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "Vice President Mohadi urges pharma investment in Zimbabwe",
            "url": "https://www.chronicle.co.zw/vice-president-mohadi-urges-pharma-investment-in-zimbabwe/",
            "content": "Robin Muchetu, Lifestyle Health and Gender Editor\n\nZIMBABWES pharmaceutical manufacturing sector is poised to play a pivotal role in strengthening the countrys health system and revitalising Bulawayos industrial base if given adequate support and investment, Vice-President Kembo Mohadi said.\n\nSpeaking during a tour of Zimbabwe Pharmaceuticals (ZimPharm) in the Belmont industrial area in Bulawayo on Thursday, VP Mohadi called for increased backing of the local pharmaceutical industry as part of the Governments broader economic recovery and healthcare resilience agenda.\n\nWe would like such firms like ZimPharm to grow so that it can provide adequate medicines and pharmaceuticals to our health sector. We are importing quite a lot of pharmaceuticals from other countries because we do not have the requisite numbers to produce locally, he said.\n\nMy encouragement is that we need to grow them and support them so that they produce enough for the health sector locally.\n\nVice President Mohadi tour Zimpharm\n\nVP Mohadis remarks align with the Second Republics goal of transforming Zimbabwe into an upper-middle-income economy by 2030 in line with the mantra leaving no one and no place behind.\n\nThe Vice-President applauded ZimPharm for remaining operational under difficult economic conditions, including limited space, outdated machinery and foreign currency shortages.\n\nCurrently, Zimbabwe imports up to 70 percent of its pharmaceutical products, mostly from India, China, and South Africa. This heavy reliance on imports makes the country vulnerable to global supply chain disruptions, foreign currency shortages and inflated drug prices.\n\nAccording to the Ministry of Health and Child Care, revitalising domestic drug production is a key component of Zimbabwes National Health Strategy (2021-2025), which promotes pharmaceutical self-sufficiency and the use of locally manufactured essential medicines. They are doing a commendable job. But we need to support them more, especially in accessing raw materials and modern machinery, because the medicines they produce are critical for our populations health, said VP Mohadi.\n\nThe Vice-President said reviving Bulawayos industrial capacity, particularly in key sectors like pharmaceuticals, textiles and manufacturing, was essential for national economic revival. He noted that Bulawayo used to be the heartbeat of our industry.\n\nSmoke used to rise from these factories. KoNtuthu ziyathunqa. Thats no longer the case, but were working on bringing that back through re-industrialisation, said VP Mohadi.\n\nHe urged both public and private sectors to invest in underutilised industrial infrastructure in the city to restore Bulawayos status as Zimbabwes industrial capital.\n\nWe need to go back to where we were and even do better. If we create jobs and produce locally, the GDP will grow, disposable incomes will improve, and Government revenue for infrastructure development will also increase, said VP Mohadi.\n\nWe used to be the head of textile industries here and many other industries and produced quite a lot.ZimPharm general manager, Mr Donald Mabhiza, said the industry urgently needs long-term capital investment to retool and expand operations.\n\nzimpharm workers\n\nWe are operating in an environment where long-term capital to fund pharmaceutical development and retooling of facilities is scarce. The products that are available are short-term and expensive, he said.Pharmaceutical development of products is lengthy, time consuming and costly so we need patient money that can walk with us that path to develop products that are relevant to the public health needs of the country.\n\nMr Mabhiza said disease burdens have since evolved over the years and the medicines also evolve, stressing the need for them as an industry to remain relevant to health needs of the country.\n\nMedicines that we used to take in the 1980s are no longer the same that we are taking now so that investment is required to continue to be on the same level in terms of the disease burdens. Today we have non-communicable diseases that are burdensome to the population, he said.\n\nSo, we need to develop medicines and manufacture them locally along with the critical mass, costs will come down and quality will improve.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube welcomed the Vice-Presidents visit, saying it allowed national leaders to better understand local industrial challenges.\n\nIts encouraging that the Vice-President took time to engage with our industries directly. It means that when he speaks in Harare, he does so with first-hand knowledge of our situation, she said.\n\nThe visit to ZimPharm was part of a broader two-day tour in Bulawayo, where VP Mohadi met with various stakeholders to explore industrial revival strategies.  @NyembeziMu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-10-at-23.47.54-1-1.jpeg",
            "description": "Robin Muchetu, Lifestyle Health and Gender Editor ZIMBABWE’S pharmaceutical manufacturing sector is poised to play a pivotal role in strengthening the country’s health system and revitalising Bulawayo’s industrial base if given adequate support and investment, Vice-President Kembo Mohadi said. Speaking during a tour of Zimbabwe Pharmaceuticals (ZimPharm) in the Belmont industrial area in Bulawayo on […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "Zimbabwe explores nuclear energy. . . prioritises value-addition of transition minerals",
            "url": "https://www.chronicle.co.zw/zimbabwe-explores-nuclear-energy-prioritises-value-addition-of-transition-minerals/",
            "content": "Nqobile Bhebhe in Victoria Falls\n\nVICE-President Constantino Chiwenga has reaffirmed the Governments active exploration into the utilisation of nuclear energy, with a particular focus on small modular reactors, as a component of a well-rounded energy portfolio for the nation.\n\nHe emphasised that the country is also strategically prioritising the value-addition of energy transition minerals, encompassing manganese, nickel, copper, cobalt, and lithium.\n\nThese concerted efforts are anticipated to stimulate the domestic production of crucial energy technologies.\n\nZimbabwe is understood to possess significant uranium deposits within the Zambezi Valley, a potentially valuable resource that could underpin future nuclear power production initiatives.\n\nVP Chiwenga delivered these remarks during his keynote address at the official opening of the 6th International Renewable Energy Conference in Victoria Falls on Wednesday.\n\nThe conference, which extends through to Thursday, is being held under the pertinent theme Sustainable Energy Investments for a Better Future and serves as a clear indication of Zimbabwes increasing commitment to integrating renewable energy solutions into its broader economic transformation and climate resilience strategy.\n\nDuring his address to the assembled delegates, VP Chiwenga conveyed that the Government is actively investigating a diverse spectrum of energy solutions to achieve a more balanced and resilient national energy mix.\n\nThis includes the development of gas-to-power projects, notably those leveraging the Muzarabani gas reserves, which are envisioned to play a transitional role in the ongoing efforts to reduce greenhouse gas emissions.\n\nWe are also investigating nuclear energy, particularly small modular reactors, as part of a balanced energy portfolio, he said.\n\nMinistry of Energy and Power Development, Dr Gloria Magombo\n\nOn the sidelines of the conference, Permanent Secretary in the Ministry of Energy and Power Development, Dr Gloria Magombo, told Zimpapers Business Hub that the use of a modular nuclear system is a possibility.\n\nWe are also looking in the future at the use of renewable energy and modular nuclear systems, which are clean because nuclear by its nature is an enclosed system. So its clean, it doesnt emit. But what you then have to deal with is how to manage nuclear waste. And there are established systems for that. And as a country, we are looking at taking on board this technology in the next 10 to 15 years, she said.\n\nAs part of its strategy to transition to cleaner energy, Zimbabwe, like many other African nations, is exploring alternative energy sources such as wind, solar, and methane gas to enhance power generation and decrease carbon emissions from fossil fuel-based power production.\n\nVP Chiwenga pointed out that Zimbabwe holds the largest lithium reserves in Africa and ranks fifth globally.\n\nWe are prioritising the value addition of energy transition minerals such as manganese, nickel, copper, cobalt, and lithium, which will drive the production of locally manufactured energy technologies, he said.\n\nThese efforts are crucial for reducing energy costs and maximising the value of the countrys natural resources.\n\nHe also informed delegates that Zimbabwe has attracted significant investment in the production of coke, which is used as a key input in metallurgical processes, including steel production, for both local and export markets.\n\nHowever, he noted that while coke production generates an important by-product, coke oven gas, this by-product has not been fully utilised, resulting in its release into the atmosphere with negative environmental impacts.\n\nHowever, as a country, we believe that a low-hanging fruit in addressing our challenges is for coke producers to strategically invest in the conversion of this waste gas into fuel for power generation. This would allow self-supply, with any excess available to be supplied to the national grid, he said.\n\nFurther opportunities exist in using the gas for boiler flame support in existing thermal power stations near coke production operations.\n\nHe also commended companies such as Dinson Iron and Steel in Manhize, which are constructing a 20-megawatt water heat recovery cogeneration power plant.\n\nSimilarly, Hwange Zhong Zhing Heli has been licensed to build a 240-megawatt thermal power plant fuelled by coke oven gas.\n\nWe also appreciate the recently commissioned Palm River Metallurgy Company in Beitbridge, whose integrated systems and processes highlight the drive toward sustainable mining, low greenhouse gas emissions, low waste production, and energy self-sufficiency through recycling of waste, he said.\n\nAs a result, we encourage other companies in this sector to adopt similar technologies, which will enhance the countrys energy security and foster economic growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-11.56.39_5968a28b-680x380.jpg",
            "description": "Nqobile Bhebhe in Victoria Falls VICE-President Constantino Chiwenga has reaffirmed the Government’s active exploration into the utilisation of nuclear energy, with a particular focus on small modular reactors, as a component of a well-rounded energy portfolio for the nation. He emphasised that the country is also strategically prioritising the value-addition of energy transition minerals, encompassing […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "Nothing feels as special as being honoured by your own people: Iyasa founder",
            "url": "https://www.chronicle.co.zw/nothing-feels-as-special-as-being-honoured-by-your-own-people-iyasa-founder/",
            "content": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub\n\nIN a moment of well-deserved recognition, Iyasa founder Nkululeko Dube, was honoured at the Imiklomelo KaDakamela Awards held in Nkayi this past weekend.\n\nA revered figure within the arts community, Dube has overseen the remarkable transformation of his group from its humble beginnings as a school dance and drama club at Mpopoma High School in Bulawayo into an internationally acclaimed platform. He was presented with an award for his outstanding contribution to the creative sector.\n\nUnder Dubes expert stewardship, Iyasa has become a vital launchpad for young talent, providing invaluable opportunities in dance, music, and theatre  with many of its alumni going on to enjoy successful solo careers on both national and international stages.\n\nThe award recognised Dube as a multifaceted artiste, serving as a composer, writer, director, and choreographer  the driving force behind Iyasa, a non-profit organisation that continues to make a significant impact on local arts development.\n\nPresented with a certificate by the events organiser, Chief Dakamela, Dube expressed heartfelt gratitude, noting the deep significance of local recognition and community support.\n\nChief Dakamela\n\nI feel honoured and appreciated, especially considering that this recognition comes from a cultural and local initiative. Often, we look forward to being acknowledged abroad, but when appreciation begins at home, it feels more authentic and truly gratifying, said Dube.\n\nHe emphasised that the award is not merely a personal milestone but a celebration of the collective effort behind Iyasas journey.\n\nThis shows that our people see and appreciate our efforts to uplift young people through the arts. For me, Iyasa is a collective. While I may have originated the idea, it has thrived because of the many individuals  artistes, parents, stakeholders, promoters, the community and governmentwho have believed in and supported our mission. They, too, deserve this and every other accolade, he said.\n\nDube also praised the Imiklomelo KaDakamela Awards for their role in safeguarding cultural heritage.Awards are important. They allow us to say thank you and to recognise each others contributions. I commend Chief Dakamela for giving these awards a strong cultural identity, rooted in African and Zimbabwean values.\n\nWe could celebrate each other daily, and it would still be worthwhile. But above all accolades, nothing feels as special as being honoured by your own people and your own country, Dube said. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-10-at-22.51.20-1.jpeg",
            "description": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub IN a moment of well-deserved recognition, Iyasa founder Nkululeko Dube, was honoured at the Imiklomelo KaDakamela Awards held in Nkayi this past weekend. A revered figure within the arts community, Dube has overseen the remarkable transformation of his group from its humble beginnings as a school dance and […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "Kaindu fumes‘. . . Soft goals avoidable’",
            "url": "https://www.chronicle.co.zw/kaindu-fumes-soft-goals-avoidable/",
            "content": "Innocent Kurira, Zimpapers Sports Hub\n\nHIGHLANDERS coach, Kelvin Kaindu has voiced deep concern over his sides persistent defensive lapses, warning that their habit of conceding soft goals is undermining their ambitions ahead of a high-stakes Castle Lager Premier Soccer League clash against CAPS United, at Barbourfields Stadium on Sunday.\n\nBosso have looked lively in attack but remain worryingly fragile at the back  leaking five goals in as many matches, a statistic Kaindu finds unacceptable. The goals, he argues, havent come from moments of brilliance by the opposition, but from glaring errors within his own ranks.\n\nWe have been conceding goals we shouldnt be conceding, a visibly frustrated Kaindu said. It has been a major concern for us. Our opponents have punished us for the mistakes we have made and its something we need to address. These are soft goals  avoidable ones.\n\nCaps United Fc\n\nThe Highlanders defence, once their hallmark, has faltered under pressure this season. Goalkeeping mistakes have contributed to their vulnerability, with the backline often caught flat-footed. While Bosso have found the net eight times, averaging a goal per game, their inability to protect leads has been their Achilles heel.\n\nKaindu, whose side has collected just six points from five outings, knows the margin for error is narrowing. And with pressure mounting from a restless Bosso fanbase, Sundays showdown against old rivals CAPS United now carries extra weight.\n\nAdding to Kaindus worries is the fitness of versatile defender Andrew Mbeba, who was stretchered off during Highlanders 1-1 draw with Triangle United at Gibbo, last weekend. The influential defender has not returned to training and remains doubtful for the CAPS United clash. We have almost a full squad that is training apart from Andrew Mbeba, who picked up an injury in the last game against Triangle, said Kaindu. He was stretchered off, and we are yet to get feedback from the doctor. He hasnt been training, but hes feeling slightly better. We will assess him and see if he will be ready for the game.\n\nMbebas potential absence would be a big blow, not only for his defensive reliability but also for his contributions going forward, particularly on set-pieces.\n\nAndrew Mbeba\n\nMbeba has been instrumental in our games, and his absence would be felt, Kaindu acknowledged. But we are hopeful that we will get positive feedback from the doctors.\n\nDespite their shaky start, both Highlanders and CAPS United remain among the countrys most followed clubs  and whenever they clash, the stakes are rarely low. This weekends fixture, though early in the season, already carries the urgency of a six-pointer.\n\nCAPS United, languishing in the relegation zone with just four points from five matches, are under pressure to bounce back. Highlanders, just two points better, are only slightly more comfortable. CAPS United are one of the giants in this league. They have pedigree, experience and are very dangerous going forward, warned Kaindu. Their wide players are key, and we know that they will raise their game against us. Its always a tough match when we face them.\n\nLast season, the fixture produced fireworks. Highlanders triumphed 2-0 at Barbourfields in the first leg, but CAPS United returned the favour with a dramatic 3-2 win at Rufaro Stadium in the reverse encounter. Another tightly contested battle is expected.\n\nFor Kaindu, the path to victory is clear: plug the defensive holes and hold the lead when they get in front. Weve been good going forward  weve scored in almost every game apart from one. Our main issue is defending our leads, Kaindu said. We need to be more disciplined and avoid the errors that have led to the goals we have conceded.\n\nBosso fans will be hoping their side can rise to the occasion and that Barbourfields, their spiritual fortress, becomes the setting for a defensive turnaround  and perhaps the first victory statement of their season.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/xzcawczxcszx-1.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub HIGHLANDERS coach, Kelvin Kaindu has voiced deep concern over his side’s persistent defensive lapses, warning that their habit of conceding “soft” goals is undermining their ambitions ahead of a high-stakes Castle Lager Premier Soccer League clash against CAPS United, at Barbourfields Stadium on Sunday. Bosso have looked lively in attack […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "COMMENT: One million housing units target achievable",
            "url": "https://www.chronicle.co.zw/comment-one-million-housing-units-target-achievable/",
            "content": "Access to urban housing is generally a huge challenge in our country, as it is in most developing nations.That is the case because of the high costs involved. For an average person therefore, buying a residential stand is difficult. Developing it is just as difficult. It is costlier when buying a fully developed property.\n\nEconomic difficulties between 2000 and around 2019, seen in high inflation and currency instability, tended to discourage financial institutions from providing mortgage finance. A few banks and building societies are, however, resuming, but again, the deposits required and monthly instalments cost an arm and a leg.\n\nAs a result, a substantial proportion of the urban population takes the decision to rent. By November last year, the Government measured the national housing backlog at 1,25 million units. While it is ordinarily difficult for most of us to buy or build residential properties in towns and cities, we have seen progress since 2021 when the Government launched the National Human Settlements Policy. The document envisions provision of 220 000 housing units by the end of this year.\n\nEncouragingly, the goal had been exceeded as at December last year after more than 700 000 had been delivered nationwide.\n\nThat target was exceeded because of strong collaboration between the Government, prospective home owners and the private sector. One of the initiatives which is contributing is the Accelerated Presidential Housing Scheme (APHS), which assists civil servants to have decent residential accommodation.\n\nAs we report elsewhere today, 236 houses have been completed at the Emthunzini development under the APHS in Bulawayo out of 4 000 planned for the suburb. There are similar developments in other urban areas nationwide.\n\nThis is a very important intervention, which is facilitating access to decent urban housing by civil servants who would ordinarily be too resource-constrained to be able to build homes for themselves.The Government and its partners are encouraged to keep up the momentum.\n\nApart from the APHS, there are multiple other private initiatives underway, or that are being considered across the country to improve public access to housing. These too, must be intensified.\n\nWith all the work that is being done, we see no reason why a revised target to have built one million housing units by the end of this year cannot be achieved, and exceeded.\n\nThis tells us that even if there are challenges, our people, their Government and the private sector are working very hard so that more of us can have a roof of their own, not just a roof, over their heads.\n\nThis gives the new home owners a huge amount of dignity and self-worth that renting doesnt. It engenders inner peace in the new landlords. It gives them a sense of belonging, and permanence. It removes the stress of a life on the edge, rather, a life on the move.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Housing-Scheme-For-Civil-Servants-6.jpg",
            "description": "Access to urban housing is generally a huge challenge in our country, as it is in most developing nations. That is the case because of the high costs involved. For an average person therefore, buying a residential stand is difficult. Developing it is just as difficult. It is costlier when buying a fully developed property. […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "Government sets new target, eyes a million housing units by year-end",
            "url": "https://www.chronicle.co.zw/government-sets-new-target-eyes-a-million-housing-units-by-year-end/",
            "content": "Sikhumbuzo Moyo\n\nTHE Government has set a new target to construct one million houses by the end of this year, having already surpassed its initial goal of 220 000, as it intensifies efforts to address the countrys housing challenges in line with Vision 2030.\n\nThe ambitious new target falls under the Zimbabwe National Human Settlements Policy (ZNHSP), which was adopted by Cabinet in November 2020 and officially launched by President Mnangagwa in September 2021.\n\nThe policy aligns with both national and global development frameworks, including the countrys Vision 2030 to achieve upper-middle-income status.\n\nSpeaking during a tour of the Accelerated Presidential Housing Scheme in Emthunzini, on the outskirts of Bulawayo yesterday, the Minister of National Housing and Social Amenities, Zhemu Soda, said the Government had exceeded the initial target and was optimistic that the one million mark would be achieved before the conclusion of the National Development Strategy 1 (NDS1) later this year.\n\nWe have surpassed the 220,000 target. This milestone was reached during the mid-term review of the NDS1, and through the wisdom of President Mnangagwa, our target was revised to one million, said Minister Soda.\n\nNDS1, the countrys first five-year medium-term economic plan running from 2021 to 2025, lists housing and social amenities as one of its key pillars. The housing initiative is being driven by a collaborative effort involving the Ministry of National Housing and Social Amenities, the Ministry of Public Service, Labour and Social Welfare, the National Social Security Authority (Nssa), and the National Building Society (NBS). Hawkflight Construction and Marhaber Construction are the main developers for the Emthunzini project.\n\nMinister Soda revealed that by the end of 2024, the Government had constructed over 700 000 houses under the NDS1 framework, representing a 70 percent success rate.\n\nThis project primarily benefits civil servants as part of the Governments non-monetary incentive programme, he said.\n\nJoining the tour, the Minister of Public Service, Labour and Social Welfare, Edgar Moyo, expressed his satisfaction with the progress made, describing the housing scheme as a vital intervention for civil servants. This initiative, under the guidance of President Mnangagwa, seeks to ensure that our civil servants have access to decent, affordable housing. In the past, it was almost impossible for a civil servant to own a house, but under this scheme, they simply move in and begin paying an affordable mortgage, said Minister Moyo.\n\nHe added that funding for the project is being mobilised through Nssa, NBS, and the Public Service Pension Fund, ensuring that civil servants benefit from their contributions during their working years, while also helping to curb the flight of skilled personnel in the public sector.\n\nThe ultimate goal is to roll this out nationwide, in line with the leaving no one and no place behind philosophy.\n\nWe are engaging local authorities to identify affordable land, as high land prices contribute to the elevated cost of housing, which we aim to avoid, he said.\n\nAt Emthunzini, a total of 236 houses have been completed out of a planned 4,000.\n\nMost of the units are ready for occupation, with the developers assuring Government that all service roads will be tarred by mid-May. One of the beneficiaries, Ms Sinikiwe Sibanda, shared her joy and gratitude at becoming a homeowner.\n\nI am now a proud owner of a four-roomed house  something I never imagined in my lifetime. Thanks to the visionary leadership of President Mnangagwa, this dream has become a reality, she said. The only amount I paid was a US$250 administration fee. The house is complete and Ive already moved in. I now pay US$190 a month for the next six years, which is far better than paying rent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-6-2.jpg",
            "description": "Sikhumbuzo Moyo THE Government has set a new target to construct one million houses by the end of this year, having already surpassed its initial goal of 220 000, as it intensifies efforts to address the country’s housing challenges in line with Vision 2030. The ambitious new target falls under the Zimbabwe National Human Settlements […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "Heroes and heroines who died in April",
            "url": "https://www.chronicle.co.zw/heroes-and-heroines-who-died-in-april/",
            "content": "Gibson Mhaka, Zimpapers Politics Hub\n\nAS Zimbabwe prepares for its 45th Independence Day celebrations next week, it also pauses to remember and pay tribute to the numerous heroes and heroines who tragically passed away during this historically significant month.\n\nCde Alexander Gora KanengoniInternationally acclaimed author and ex-combatant Cde Alexander Gora Kanengoni passed away on April 12, 2016, and was declared a liberation war hero, subsequently being buried at his farm in Centenary.\n\nBorn on September 17, 1951, Cde Kanengoni trained as a teacher and briefly taught at several schools before joining the liberation struggle in 1974.\n\nAfter receiving training in guerrilla warfare, he saw combat on the battlefront, before returning to Doeroe, Mozambique, in 1976, where he held the position of Camp Political Commissar, being also the Deputy to then Camp Commander Cde Chihambakwe (Moses Mvenge).\n\nHe distinguished himself in various positions he held throughout the struggle in a manner which his unfortunate brush with authority during the Vashandi Saga in 1977 did nothing to sway his unwavering commitment to Zimbabwes sovereignty, its nationalistic ideals and ZANU-PFs ideology.\n\nAfter Independence in 1980, Cde Kanengoni enrolled at the University of Zimbabwe, where he majored in English Literature.\n\nLater, in 1983, he joined the Ministry of Education and Culture as a Project Officer responsible for the education of former combatants and refugees.\n\nIn 1988, he joined the Zimbabwe Broadcasting Corporation and worked there until 2002, when he became a farmer and deputy editor of The Patriot weekly newspaper.\n\nCde Nash Nyasha Dzimiri\n\nOn April 29, 2024, Zimbabweans witnessed a solemn triple burial at the National Heroes Acre for Cde Nash Nyasha Dzimiri, Brigadier General Shadreck Vezha, and Cde Tsitsi Grace Jadagu.Their passing occurred within a short period: Cde Dzimiri succumbed to a brief illness on April 16, while Brigadier General Vezha tragically died in a road traffic accident on the same day. Two days later, on April 18, Cde Jadagu also passed away after a short illness.\n\nCde Dzimiri, whose Chimurenga name was Cde Tambaoga Mwanangu, joined the liberation struggle as a young man and rose through the ranks to become a commander overseeing intelligence. At the time of his passing, he held the position of Director of Investments in the Presidents office.\n\nAfter Independence, Cde Dzimiri continued his service with the intelligence department, leading to postings in various countries. He also progressed through the ranks to become a director within the CIO.Cde Dzimiri was born on June 24, 1958, in the Shurugwi District. His early education began in 1966 at Kwarire Primary School in Shurugwi for Sub A. In 1967, he transferred to Matamba Primary School, also in the same province, where he completed Grade 5.\n\nFrom 1971 to 1972, Cde Dzimiri attended Hanke Mission in Shurugwi for Grade 6 and 7. From 1973 to 1976, he did his secondary education at Lower Gweru College, now Lower Gweru Adventist High School.Outraged by the racial segregation in the then Rhodesia, Cde Dzimiri left the country in 1976 for Mozambique to join the liberation struggle, under Zanla.\n\nHe left the country on foot via Chicualacuala. Upon crossing into Mozambique, Cde Dzimiri stayed at Nyadzonia Camp on the banks of Pungwe River for a few months.This is where he received political orientation that was to become his moral compass for his future political exploits.\n\nOn August 9, 1976, he survived the Nyadzonia massacre that left hundreds of liberation fighters dead.Following the Nyadzonya massacre, Cde Dzimiri was selected to undertake security and intelligence training at the famous Nanking Military Academy in China, where he attained a Diploma in Military Intelligence and Guerrilla Warfare.\n\nIt was also at Nanking Military Academy where revered liberation stalwarts such as President Mnangagwa and the late General Josiah Magama Tongogara, among others, trained.\n\nPresident Mnangagwa\n\nBrigadier-General Shadreck VezhaBrigadier-General Vezha was born on August 10, 1961, in the Chivi District of Masvingo province. He did his primary education at Chihaya, Runesu, and Chitanga Primary Schools between 1968 and 1975.He attended Lundi High School for his secondary education. After completing his O Level examinations, Brig-Gen Vezha joined the liberation struggle as a Zanla combatant and received his initial training at the front lines.\n\nDuring the 1979 ceasefire, he was stationed at Dzapasi Assembly Point Base 2, where he underwent further military training. In December 1979, Brig-Gen was then moved to Rushinga.\n\nIn early January 1980, he was nominated to proceed to North Korea for further military training at Kim Chong Ju Military Academy and Kim Il Sung Military University until 1982, where he trained with Brigadier General J Zingoni, Brigadier-General E Shamu and many others. On completion of military training in North Korea, he returned home and was attested into the Zimbabwe National Army on August 1, 1982.\n\nBrig-Gen Vezha also made an indelible mark in the diplomatic circles when he led international officers as team leader in United Nations Observer Missions in Angola and Syria.\n\nCde Tsitsi Grace JadaguNational heroine Cde Tsitsi Grace Jadagu was a dedicated and fearless individual who made immense contributions both during and after the liberation struggle. She worked closely with fellow prominent figures such as Cdes Shuvai Mahofa, Ruth Chinamano, Sabina Mugabe, and Pamela Tungamirai.\n\nShe also worked closely with ZANU PF Politburo members, Cdes Omega Hungwe, Cde Idah Mashonganyika, and Tsitsi Munyati, among others.\n\nCde Jadagu was born on 11 March 1943 in Murehwa, Mashonaland East province. She attended Murehwa Mission School and Domboshava Training Centre. She trained as a police officer before she switched and trained as a teacher at Nyadire Mission in 1960.\n\nDuring the struggle, she was a war collaborator and after independence, she served as councillor for Chitungwiza Municipality Ward 16 and was later appointed Special Interest Councillor in 2013.She was appointed a Senator in 2014.\n\nCde Jadagu started her political career when she was 17 years old in Mangwende Village, where her fathers brother was a chief and an active member of Zapu. During the time her family, led by Chief Mangwende, had a conflict with the Rhodesian native commissioner over national politics.\n\nThe whole family was then forced out of the village over that issue, which resulted in them seeking refuge in Old Highfield.\n\nThat is when she became a member of the Youth in Zapu, together with the late Cdes Sabina Mugabe, Tsitsi Munyati, Ruth Chinamano and others.\n\nThe national heroine was a Womens League Political Commissar in 1983, a Central Committee member, and a member of the National Consultative Assembly. She worked closely with President Mnangagwa and the late national hero Cde Solomon Mujuru to set up Zanu-PF political party offices at 88 Manica Road. The national heroine Cde Jadagu was honoured as the Best Woman Sergeant, Best Councillor (1999), and Best Leader of Netball Social Club (1999) in Chitungwiza.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-7-1.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub AS Zimbabwe prepares for its 45th Independence Day celebrations next week, it also pauses to remember and pay tribute to the numerous heroes and heroines who tragically passed away during this historically significant month. Cde Alexander Gora Kanengoni Internationally acclaimed author and ex-combatant Cde Alexander Gora Kanengoni passed away on […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        },
        {
            "title": "Hundreds witness lighting of Independence Flame",
            "url": "https://www.chronicle.co.zw/hundreds-witness-lighting-of-independence-flame/",
            "content": "Patrick Chitumba,[emailprotected]\n\nVICE-PRESIDENT Constantino Chiwenga yesterday officially lit and handed over the Independence Flame to the Midlands Province, marking a significant milestone in the build-up to the 45th national Independence Day celebrations.\n\nThe symbolic ceremony took place at the historic Mtapa Hall in Gwerus Mtapa suburb, drawing hundreds of people. The Independence Flame will now tour districts across the province  including Mberengwa, Zvishavane, Shurugwi, Kwekwe and Gokwe  before arriving at Nembudziya Open Grounds for the main celebrations on April 18.\n\nThis years commemorations are being held under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030.\n\nVP Chiwenga was accompanied by senior Government officials, among them Minister of Home Affairs and Cultural Heritage Kazembe Kazembe, Minister of Sports and Recreation Anselem Sanyatwe, Minister of Veterans of the Liberation Struggle Monica Mavunga and Midlands Provincial Affairs and Devolution Minister Owen Ncube.\n\nIn his keynote address, VP Chiwenga described the Independence Flame as a lasting symbol of Zimbabwes struggle, sacrifice, triumph and national spirit.\n\nVice President Chiwenga\n\nWe gather at this significant site  Mtapa Hall  the venue of the inaugural Zimbabwe African National Union (Zanu) Congress held from May 21 to 23, 1964, he said.\n\nBut let us not forget that the party had been formed earlier on 8 August 1963 in Highfields, at the home of the late Cde Enos Nkala, following the split from Zapu.\n\nVP Chiwenga emphasised that the formation of Zanu, followed by the later unification with Zapu under the Unity Accord of December 22, 1987, was instrumental in the countrys path toward independence.It is only in unity that we uphold the idealism of a unitary state  one that embraces all people from the north, south, east, and west as one nation, he said.\n\nVP Chiwenga described the 1964 Zanu Congress as a pivotal moment in Zimbabwes history, the turning point where the decision to take up arms against colonial rule was made under the banner: We are our own liberators through the barrel of the gun.\n\nThe Congress elected key founding leaders of the liberation movement, including Cde Ndabaningi Sithole (President), Cde Leopold Takawira (Vice-President), Cde Robert Mugabe (Secretary), Cde Herbert Chitepo (National Chairman), Cde Enos Nkala (Treasurer), Cde Michael Mahwema (Organising Secretary) and Cde Edson Zvobgo (Deputy Secretary General), among others.\n\nVP Chiwenga said these comrades played crucial roles in the liberation struggle. Todays ceremony provides a rare opportunity to reflect on the significance of that Congress. We recall and celebrate the contributions of those who came before us, both the living and those resting in marked and unmarked graves in Zimbabwe and neighbouring countries, their sacrifices towards our liberation, he said.\n\nVP Chiwenga noted that among the delegates at the 1964 Congress was President Mnangagwa, then a young nationalist recently trained in China. Another one was Cde Shadreck Chipanga, a former CIO Director-General, who had been released from Wha Wha Prison after being detained for civil disobedience and acts of sabotage.\n\nThey later escaped for training in Ghana after Zanu was banned in September 1964, he said.The Vice President said the Congress helped shape the collective vision of the liberation movement, rekindling national resolve and a desire for self-determination.\n\nChange chiri chitsidzo chekudeurwa kwe ropa kuti nyika isununguke (It was a commitment to launch the armed struggle towards national independence), he said, highlighting the depth of commitment required for independence.\n\nVP Chiwenga stressed that the 1964 Congress also laid the foundation for alliances with other African nationalist movements and international organisations, a vital step in gaining support for the liberation war.\n\nMore importantly, it marked a turning point in Zanus relationship with colonial authorities, as the leadership adopted more radical and confrontational tactics, he said.\n\nIt was here, at Mtapa Hall, that the commitment to armed struggle gained prominence. It defined Zanus ideology and objectives, centred on achieving freedom and social justice for the people of Zimbabwe.\n\nLest we forget that Zanu and Zapu, now Zanu-PF, and only Zanu-PF liberated Zimbabwe. Let no one ever attempt to vulgarise and rewrite that history which no person or any party for that matter can ever take away.\n\nVP Chiwenga said as the nation prepares to celebrate 45 years of independence, it is vital to look back at the 1964 Congress, which demonstrated unity and solidarity among Zimbabwes nationalists, paving the way for a co-ordinated effort against colonial rule.\n\nThis Congress, he noted, established connections with other African nationalist movements and international organisations, crucial for securing the support needed for Zimbabwes liberation struggle.More importantly, the 1964 Congress marked a turning point in Zanus relationship with colonial authorities, as the partys leadership began to adopt more radical and confrontational tactics. It was here, at Mtapa Hall, that the commitment to armed struggle gained prominence, said VP Chiwenga.I am pleased to note that an exhibition has been mounted in this hall to honour the iconic participants of the 1964 Congress whose personal sacrifices and lasting legacies we shall continue to cherish as a nation.\n\nVP Chiwenga said the decision to take up arms against the oppressive regime was not taken lightly, as it was a response to the persistent denial of basic rights and the overwhelming injustices faced by the Zimbabwean populace.\n\nAs we celebrate Independence Day, let us remember the bravery of our freedom fighters, the wisdom of our leaders, and the sacrifices of our people. We must continue to honour their memory by working towards a brighter future for all Zimbabweans, he said.\n\nAs we move forward, let us draw inspiration from our history and heritage, striving to build a nation that is just, equitable, and prosperous for all, he said.\n\nVP Chiwenga said the Independence Flame represents the spirit and undying hope which guided the struggle for freedom.\n\nThe Flame, he added, symbolises the resilience and determination of the Zimbabwean people, including their resolve to win and defend their sovereignty by all means necessary.\n\nAs we celebrate 45 years of Independence, we acknowledge our progress as a people, and challenges that remain. It embodies the promise that, despite the challenges we face, our commitment to upholding the ideals of our liberation will never waver, said VP Chiwenga.\n\nThe Independence Flame also represents the spirit of unity, hope, and determination that has fuelled our journey as a nation. This flame serves as a guiding light, illuminating our path forward and reminding us of the values we cherish: freedom, dignity and respect for our sovereignty, he said.\n\nVP Chiwenga urged Zimbabweans to recommit to the values and principles that defined the liberation struggle.\n\nLet us strive to build a brighter future for ourselves, our children, and generations to come. May the Independence Flame burn brighter in our hearts and throughout our great nation, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-10-at-23.57.22.jpeg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw VICE-PRESIDENT Constantino Chiwenga yesterday officially lit and handed over the Independence Flame to the Midlands Province, marking a significant milestone in the build-up to the 45th national Independence Day celebrations. The symbolic ceremony took place at the historic Mtapa Hall in Gweru’s Mtapa suburb, drawing hundreds of people. The Independence Flame will […]",
            "time": "09:46",
            "date": "11 Apr 2025"
        }
    ]
}