{
    "news": [
        {
            "title": "Performance contracts for deputy ministers",
            "url": "https://www.chronicle.co.zw/peformance-contracts-for-deputy-ministers/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nExcellence is not an option but a guaranteed necessity to propel the countrys national development agenda, hence all Cabinet Ministers should recommit to the duty of transforming Zimbabweans livelihoods, President Mnangagwa has said.\n\nIn his opening address at the first meeting of the 2025 Cabinet Year held at State House yesterday, the President charged his team to prioritise outcomes that positively affect the lives of the general citizenry.All Zimbabweans, including those in the diaspora, he added, should be well catered for.\n\nAt the outset, all members are reminded of the need to once again recommit ourselves to the duty of transforming livelihoods and developing our great nation towards the achievement of Vision 2030.The mandate before us is clear: we must deliver quality services to our citizens, ensuring that their needs are met and lives improved.\n\nAll our collective efforts should be geared towards creating a better future for all, leaving no one and no place behind. In this pursuit, it is critically important to engage with our people, listening to their concerns and responding to their needs.\n\nThe culture of accountability, transparency and excellence within our Ministries should be nurtured with a greater sense of urgency for the ultimate objective of achieving transformational results. You must lead by example.\n\nWe must serve all our people from across all the four corners of our country including those in the diaspora he said.President Mnangagwa reiterated that all Cabinet meetings must be attended without fail.Where Ministers fail to attend due to approved reasons, they should delegate authority to Deputy Ministers and Permanent Secretaries, who should submit their Ministerial positions thereat.\n\nIn the same vein, Cabinet Members should ensure that Permanent Secretaries attend Working Party Meetings and brief them ahead of Cabinet Committee Meetings.\n\nAs I stated at the closing meeting of 2024 attendance at Cabinet Committee and Working Party meetings will form part of the performance evaluation criteria.\n\nWhile members are required to be abreast with programme implementation at the community level through regular field visits, these should not disrupt and unduly affect workflow in our provinces and districts, he said.\n\nThe President said he demanded boldness and decisiveness in the execution of Ministers duties.I urge all of us to remain aware that ours is a selfless service to the people of our great motherland Zimbabwe.\n\nI challenge us to undertake our work with utmost humility, sacrifice and commitment. Cabinet is run on the basis of collective responsibility; we must pull in one direction. There is no room for lethargy, fence sitting and dragging of feet, he said.Performance contracting, said President Mnangagwa, remained a vital cog in the Second Republics strategy to enhance service delivery and drive the attainment of Vision 2030.\n\nAs such, he announced that, Deputy Ministers must now also sign performance contracts as part of Governments endeavour to enhance accountability and efficiency.\n\nthis year will see us strengthen our focus on measurable outcomes, timely execution of policies, and responsiveness to the needs of our citizens.\n\nI have directed that Deputy Ministers should also sign performance contracts as part of our endeavour of accountability and efficiency.\n\nEvery Ministry, Department, and Agency must uphold the highest standards of professionalism and servant leadership. Excellence is not an option; but a guaranteed necessity to propel our national development agenda.\n\nLet us, therefore, approach 2025 with renewed vigour, guided by our shared vision of progress, prosperity, and people-centred governance, said President Mnangagwa.\n\nOn the economic growth front, the President said emphasis should be put towards ensuring that business is not hindered by prohibitive regulations as well as punitive administrative licenses and fees required by Ministries.Fees, licences, permits and regulations, he added, should instead promote economic development and improve the livelihoods of Zimbabweans.\n\nTo enhance the overall performance of our economy, the Ease of Doing Business Agenda continues to be an important aspect of our programming.\n\nIn that regard, concerted efforts must be made to revisit all the areas that hinder the start or growth of all investments, whether local or foreign. I commend the entrepreneurial spirit among our people. By nature, Zimbabweans are hardworking, he said.\n\nSADC Chairperson President Mnangagwa\n\nGoing forward, President Mnangagwa said there would be no tolerance for corruption.The awarding of Government projects and business should be one merit, he said.\n\nAs we progress with our work in the year ahead, merit and performance must be the basis for awards of Government projects and business.\n\nChicanery, manipulation of processes and outright corruption of any kind, will not be tolerated within Ministries, Departments and Agencies. Ministers are therefore directed to maintain an interest and oversight role over their span of control.\n\nAlways ensure value for money in the implementation of programmes and projects as well as in procurement processes. By the same token, the appointment of persons into public sector boards must be based on merit, competence and the requisite experience, he said.\n\nOn Agriculture, President Mnangagwa said the 2024/2025 farming season was offering hope albeit after a shaky start.In light of floods experienced in some parts of the country causing distress, he assured those affected that no community would be left unsupported.\n\nRegrettably, some regions of our country continue to experience floods, causing distress to many families and communities.School infrastructure has suffered extensive damage, while roads, bridges and clinics have not been spared. Infrastructure upgrading, therefore, remains a priority, right from the districts.\n\nProjects will resume with greater momentum once the current wet conditions subside. No community will be left in distress and Government will do its best to support those in need.\n\nThe Ministers of Local Government and Public Works; as well as Public Service, Labour and Social Welfare will soon update us on the extent of the damage and the relief efforts which are underway, he said.\n\nSADC Chairperson President Mnangagwa\n\nOn international relations, President Mnangagwa said as SADC Chair, Zimbabwe would continue to champion peace initiatives in the region as well as further the engagement and re-engagement drive on the global stage.\n\nOn the international relations front, efforts to promote and entrench regional peace, unity and solidarity will continue to occupy our schedule as the current Chair of SADC.\n\nThe Osaka 2025 Expo, among other high profile international events, requires us, along with the private sector, to apply ourselves fully so that our country reaps optimal socio-economic benefits from this premier global extravaganza, he said.\n\nOverall, the year will be characterised by numerous high profile local, regional and international engagements which will require us all to redouble our efforts to achieve seamless coordination and a result-oriented work ethics.\n\nThe President said the Second Republic would continue with its thrust of decentralising national events.Of special note are the 45th Independence Day Commemorations which will be held in Gokwe-Nembudziya in line with the thrust of the Second Republic to hold national events rotationally at the grassroots level, he said.\n\nHe also promised that the water supply situation in Bulawayo, Harare and other major cities would continue to be closely monitored.\n\nA firm approach was also required on issues of waste management and disposal beginning at the household level and extending to communities, local councils as well as industry and commerce, said President Mnangagwa.Councils must comply with requirement for the approval of their budgets and service delivery plans towards greater efficiency and enhanced accountability.\n\nGoing forward, I am directing that all outstanding budget approvals be concluded, without exception, within the First Quarter of every year, as we build momentum to deliver world-class services to all ratepayers and the general populace, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/BHTRgh-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau Excellence is not an option but a guaranteed necessity to propel the country’s national development agenda, hence all Cabinet Ministers should recommit to the duty of transforming Zimbabweans’ livelihoods, President Mnangagwa has said. In his opening address at the first meeting of the 2025 Cabinet Year held at State House yesterday, […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zinara allocates ZWG62m for Bulawayo roads rehabilitation",
            "url": "https://www.chronicle.co.zw/zinara-allocates-zwg62m-for-bulawayo-roads-rehabilitation/",
            "content": "Nqobile Tshili,[emailprotected]\n\nThe Zimbabwe National Road Administration (ZINARA) has allocated nearly ZWG62 million to the City of Bulawayo for its road rehabilitation programme.\n\nHowever, the local authority has raised concerns over inflated pricing by contractors and their insistence on foreign currency payments, which are affecting the projects budget and implementation timeline.Bulawayo City Council (BCC) has identified major roads earmarked for rehabilitation in collaboration with the Department of Roads.\n\nThis comes as approximately 70 percent of the citys roads have outlived their lifespan and require a complete overhaul. Due to limited resources, the council has mainly been conducting routine road maintenance rather than full-scale rehabilitation.According to the latest council minutes, ZINARA has allocated ZWG61,986,822 for both routine and periodic maintenance works in 2025. The council intends to utilise 70 percent of the funds (ZWG43,390,775.40) for periodic maintenance, including overlay works on Matopos Road. The remaining 30 percent (ZWG18,596,046.60) will be used for routine citywide maintenance, such as pothole patching, crack sealing, and slurry sealing.\n\nLast year, ZINARA disbursed nearly ZWG12 million for road rehabilitation, which was used for hiring an asphalt batching plant, procuring pothole patching materials, overlay works, pavement reconstruction, road marking, and installing traffic signs.\n\nProcurement Regulatory Authority of Zimbabwe\n\nHowever, project implementation was stalled as some contractors and suppliers only accepted payments in US dollars. BCC has encountered difficulties in procuring materials and hiring necessary equipment, as many key players in the sector are not registered under the Procurement Regulatory Authority of Zimbabwe (PRAZ). This has resulted in inflated prices, exceeding the citys budget allocation.\n\nThe presence of unregistered suppliers and contractors who demand foreign currency payments has significantly affected project implementation. Many of these companies also inflate prices, leading to cost overruns, read the council minutes. Most companies that participate tend to inflate prices, resulting in costs exceeding the budget.\n\nThe ongoing rainy season has worsened the already poor state of Bulawayos road network, increasing the number of potholes. The council noted that despite the introduction of the Emergency Road Rehabilitation Programme 2 (ERRP2), which was extended to 2026, significant progress is yet to be achieved in addressing the citys road infrastructure crisis.\n\nThe Government declared the countrys roads a state of disaster in 2021 after rains caused significant damage to the road network. This resulted in the launch of the Emergency Road Rehabilitation Programme 2 (ERRP2), read the minutes.This was initially set to end in 2023, but was extended to 2026. A total of 34.1 km of roads were rehabilitated under the ERRP2 out of 1800 km of roads that are in poor condition citywide.\n\nThe council added that pothole repairs cannot be effectively carried out during the rainy season, as the presence of water affects the durability of repair materials. BCC said the potholes need to be drained first, cleaned of debris, and primed before applying asphalt concrete.\n\nThe presence of water hinders the effectiveness of repair materials, making it difficult to achieve a durable fix. The potholes have to be drained first and cleaned of any debris and loose materials before priming, which takes a bit of time. The preferred patching material was asphalt concrete, hot mix, reads the minutes.\n\nThe council said it will be engaging private players to augment council staff in pothole patching throughout the year. BCC said it will prioritise the city centre, public transport routes, major collector roads, roads leading to institutions, and finally local streets in its road rehabilitation programme.\n\nAccording to the minutes, the council will rehabilitate a section of Wellington Road, Murchison Road, Luveve 5 Roads, Fort Street between 1st Avenue and 6th Avenue, Maduma Drive, Luveve Road, Chinamano Street, and Caxton to Wingrove.\n\nThe Ministry of Transport and Infrastructure Developments Department of Roads will rehabilitate a section of Matopos Road from 23rd Avenue to the city centre, Khami Road, Lobengula Street to Mpopoma Avenue, Steel Works Road from Lobengula Street to Nketa Drive, Fairbridge Way from Philips Drive to Cecil Road, and Lobengula Street from 1st Avenue to 6th Avenue.\n\nLuveve Road Repairs Construction Picture\n\nIn an effort to complement council efforts, Davies Granite, in partnership with Neddick Industries and Asphalt Products, has proposed to adopt the intersection of Khami Road and Nketa Drive as part of their Corporate Social Responsibility (CSR) initiative. The companies intend to fully rehabilitate the intersection and install recognition signs in line with the Councils Adopt-a-Road Scheme.\n\nActing director of works, Engineer Methusi Dibidi, stated that engagements with these companies are ongoing to finalise the details of their contribution to the road rehabilitation programme.\n\nThey intend to carry out a complete rehabilitation of the intersection and also erect recognition signs at the islands. This was in order as per the Councils Adopt-a-Road Scheme, he said.-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/07/Untitled-23-1.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw The Zimbabwe National Road Administration (ZINARA) has allocated nearly ZWG62 million to the City of Bulawayo for its road rehabilitation programme. However, the local authority has raised concerns over inflated pricing by contractors and their insistence on foreign currency payments, which are affecting the project’s budget and implementation timeline. Bulawayo City Council […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "Bosso confident of clearing Brito debt",
            "url": "https://www.chronicle.co.zw/bosso-confident-of-clearing-brito-debt/",
            "content": "Innocent Kurira,[emailprotected]\n\nHighlanders Chief Executive Officer, Brian Moyo, has confirmed that the club is working tirelessly to clear a debt of US$27 000 owed to former coach Baltemar Brito and his assistant Antonio Joo Torres after Fifa imposed a ban on the club from registering new players.\n\nMoyo stated that the club is in discussions with sympathisers, sponsors, and partners, all of whom have expressed interest in helping to resolve the debt issue.\n\nWhile Moyo expressed confidence that the debt would be settled soon, he did not specify a timeline or reveal the exact parties with whom they are in discussion.\n\nBrian Moyo\n\nZimpapers Sports Hub understands that businessman Wicknell Chivhayo has been approached by the club after pledging to pay off the debt. It is expected that the funds will be transferred soon.\n\nAlthough the club was somewhat cautious about revealing the details, it was anticipated that the payment would have been made to the foreign coaches by the end of the day yesterday.\n\nWe are working around the clock to ensure the debt is cleared. We are consulting with our sponsors, partners, and sympathisers to resolve the situation as soon as possible.\n\nWe also have transfer business to handle; we really need reinforcements. The coaches have identified the players they want, and its crucial that we bring them in, said Moyo.\n\nMr Wicknell Chivayo\n\nFifa has warned that the debt will continue to accrue interest at a rate of five percent per annum until the club settles its dues.\n\nThe coaches took their case to Fifa after several unsuccessful attempts to engage with Highlanders. This issue has been ongoing since last year. Highlanders were given a 45-day window to settle their debt with the Brazilian coaches but failed to meet the deadline.\n\nThe club owes Brito US$14 778, which has accumulated an additional US$237,71 in interest as of 17 October 2024. Torres is owed US$11 788, with interest of US$193,74 as of the same date.\n\nThese amounts are related to outstanding winning bonuses, which are directly paid by the club, while the coaches salaries are covered by sponsors.\n\nHighlanders cannot afford to miss out on the window, as they are already reeling from the loss of four key players: Peter Muduhwa, Lynoth Chikuhwa, Godfrey Makaruse, and Marvelous Chigumira, who have all joined Scotland FC.\n\nThe club has also released defender Andrew Tandi and midfielder Brian Gaucho Ndlovu. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Baltemar-Brito.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw Highlanders Chief Executive Officer, Brian Moyo, has confirmed that the club is working tirelessly to clear a debt of US$27 000 owed to former coach Baltemar Brito and his assistant Antonio João Torres after Fifa imposed a ban on the club from registering new players. Moyo stated that the club is in […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zim eyes 2027Africa Trade Fair",
            "url": "https://www.chronicle.co.zw/zim-eyes-2027africa-trade-fair/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWE has taken a significant step towards securing the rights to host the prestigious Intra-Africa Trade Fair (IATF) in 2027, with a high-level delegation from the events bid evaluation committee in the country to assess its readiness and suitability as a host nation.\n\nThe delegation, led by Mr Gainmore Zanamwe from Afreximbank, comprises representatives from key continental and international institutions, including the African Union Commission (AUC), the African Export-Import Bank (Afreximbank), the African Development Bank (AfDB), the United Nations Economic Commission for Africa (UNECA), the African Continental Free Trade Area (AfCFTA) Secretariat, the Arab Bank for Economic Development in Africa (BADEA), and Reeds Exhibitions, among others.\n\nDuring a media briefing in Bulawayo yesterday, Deputy Minister of Industry and Commerce, Raj Modi, expressed optimism about Zimbabwes chances, citing the countrys strategic location, economic resilience, and track record in hosting large-scale events.\n\nThe Intra-Africa Trade Fair host bid evaluation committee is in Zimbabwe for a due diligence process from 10 to 12 February 2025. I am 99.9 per cent sure that we are going to get the opportunity to host this prestigious event, he said.\n\nDeputy Minister Modi said hosting the IATF would significantly boost the countrys economy by attracting thousands of visitors, promoting tourism, creating employment opportunities, and driving infrastructure development.Zimbabwe successfully submitted its bid to host the fifth edition of the IATF in November last year and was subsequently shortlisted alongside Malawi and Nigeria.\n\nThe countrys bid is centred on the Zimbabwe International Exhibition Centre in Bulawayo, a key hub for trade and investment events.\n\nIndustry and Commerce Deputy Minister Raj Modi (right) chats with the head of delegation for the Intra-Africa Trade Fair Bid Evaluation Committee Mr Gainmore Zanamwe after touring The Elander Hotel in Bulawayo.\n\nAs part of the evaluation process, the committee toured the Zimbabwe International Exhibition Centre to assess its suitability as the main venue. They inspected the exhibition halls, conference facilities, and surrounding amenities to ensure they meet international standards.\n\nThe delegation also assessed Joshua Mqabuko Nkomo International Airport to evaluate the facilitys capacity to handle international flights and the expected influx of visitors.\n\nThe committee reviewed accommodation facilities, including hotels and lodges in Bulawayo, to determine their ability to host high-profile delegates and exhibitors from across the continent and beyond.\n\nOn Monday, the bid evaluation committee held a crucial meeting in Bulawayo with government officials and key stakeholders to deliberate on Zimbabwes bid. The discussions focused on infrastructure development, logistics, financial preparedness, and security measures.\n\nDeputy Minister Modi said the engagement was essential in addressing any concerns raised by the evaluation team.Let me highlight that the meeting provided an opportunity for the committee to seek clarification on various aspects of the bid, including infrastructure, logistics, finance, and security, he said.\n\nZimbabwe has demonstrated its capability to host large-scale events, with Bulawayo successfully managing the Zanu-PF 21st National Peoples Conference, which attracted over 4,000 delegates last year. The city is home to the annual Zimbabwe International Trade Fair (ZITF), one of Africas leading business exhibitions, further showcasing its ability to host international trade events.\n\nZITF\n\nHosting the IATF would not only solidify Zimbabwes reputation as a Meetings, Incentives, Conferences, and Exhibitions (MICE) tourism destination but also unlock immense economic benefits. Past hosts of the IATF have experienced substantial infrastructure development, increased investor interest, and a boost in tourism.\n\nOrganised by Afreximbank in collaboration with the AUC and the AfCFTA Secretariat, the IATF is a premier platform for facilitating intra-African trade and investment. The fair provides businesses and governments with opportunities to engage in trade deals, explore new markets, and strengthen economic cooperation.\n\nThe inaugural IATF was held in Egypt in 2018, followed by a second edition in South Africa in 2021. The third edition took place in Egypt in 2023, while Algeria is set to host the fourth IATF in 2025.\n\nIf successful, Zimbabwes hosting of the IATF in 2027 would mark a major milestone in the countrys trade and investment landscape. The event is expected to draw thousands of exhibitors, investors, and government representatives from across the continent, fostering new business partnerships and boosting the countrys economic standing.\n\nThe countrys bid aligns with the governments strategy of leveraging MICE tourism and its vast tourism attractions to position itself as a leading business and leisure destination in Africa.@SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jghjut.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com ZIMBABWE has taken a significant step towards securing the rights to host the prestigious Intra-Africa Trade Fair (IATF) in 2027, with a high-level delegation from the event’s bid evaluation committee in the country to assess its readiness and suitability as a host nation. The delegation, led by Mr Gainmore Zanamwe from Afreximbank, […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "Growth in technology sparks call for data protection officers",
            "url": "https://www.chronicle.co.zw/growth-in-technology-sparks-call-for-data-protection-officers/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nCOMPANIES have been urged to employ data protection officers in light of the rapid growth of technology, which continues to advance at a remarkable pace.\n\nThis comes as 92 data protection officers recently graduated under the Data Protection Officer Certification Training Programme, a collaborative initiative between the Postal and Telecommunications Regulatory Authority of Zimbabwe (Potraz) and the Harare Institute of Technology (HIT).\n\nA total of 92 individuals graduated in the second cohort, following the inaugural group of 57 graduates last year.\n\nThe event coincided with the three-day Potraz Data Privacy Symposium, recently held in the resort city of Victoria Falls.\n\nThe symposium, themed Bridging Technology, Policy, Law, and Practice: Towards Strengthening Data Protection in Zimbabwe, brought together key stakeholders, including policymakers, regulators, academics, researchers, security agencies, private sector players, and data subjects.\n\nAddressing delegates during the graduation ceremony, which was attended by Information Communication Technology (ICT), Postal and Courier Services Minister Tatenda Mavetera and Deputy Minister Dingumuzi Phuti, Harare Institute of Technology Vice-Chancellor Professor Engineer Quinton Chamunorwa said the graduation marked the culmination of months of hard work, dedication, and learning, as well as the beginning of a new chapter in Zimbabwes data protection and privacy sector.\n\nIn todays digital age, the role of a data protection officer is more critical than ever. With the exponential growth of data and the increasing complexity of data privacy regulations, organisations across the globe are in dire need of professionals who can navigate these challenges with expertise and integrity, safeguarding the privacy and security of personal data, he said.\n\nOn 25 October 2023, HIT and Potraz signed a Memorandum of Agreement, marking a significant step towards promoting training, research, and development on cyber and data protection issues.\n\nThis partnership is crucial in our journey towards a more secure digital future. Therefore, we agreed to implement the following key initiatives: training and certification of data protection officers; programme content development; academic research and development in cyber and data protection issues; and cooperation in any other areas of mutual interest identified for the benefit of both parties, said Prof Eng Chamunorwa.\n\nProfessor Engineer Quinton Chamunorwa\n\nHe noted that HIT is Zimbabwes growing innovation and technopreneurial university.\n\nGranted university status in 2005 through the promulgation of the Harare Institute of Technology Act {Chapter 25:26}, its mandate is to develop, incubate, transfer, and commercialise technology to drive Zimbabwes rapid industrialisation.\n\nThe HIT mandate does not include producing graduates in the traditional sense. However, it has embarked on a robust process of providing cutting-edge tools aligned with the countrys modernisation and industrialisation agenda, said Prof Eng Chamunorwa.\n\nHIT integrates technopreneurial and innovation strands across all its programmes, including Artificial Intelligence and big data analytics, equipping its students with the resilience and expertise to champion the formation of high-tech enterprises that create employment and generate revenue for the national economy.\n\nProf Eng Chamunorwa highlighted that HIT offers a comprehensive, innovation-driven curriculum through unique academic programmes, centres of excellence, and an innovation hub that transforms research and development, innovation outputs, and intellectual property into commercial goods and services.\n\nWe have five schools: Engineering and Technology, Allied Health Sciences, Industrial Sciences and Technology, Business and Management Sciences, and Information Science and Technology. Among these, we have specialised departments producing experts in fields such as cybersecurity, machine design, biomedical engineering, materials technology, polymer technology, and financial engineering, to name a few, he said.\n\nHIT is part of a national and international ecosystem, guided by fundamental social, economic, legal, philosophical, and geopolitical principles that drive our work as a technological institution.\n\nProf Eng Chamunorwa stated that HIT now offers the highest number of computing and engineering disciplines at undergraduate and postgraduate levels in Zimbabwe.\n\nWe have produced more than 6,000 graduates in the ICT sector, who are now key players in driving Zimbabwes industrialisation and modernisation agenda. Due to our shared vision and goals, Potraz remains a valued partner, enabling meaningful contributions to national development, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/csdafa.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com COMPANIES have been urged to employ data protection officers in light of the rapid growth of technology, which continues to advance at a remarkable pace. This comes as 92 data protection officers recently graduated under the Data Protection Officer Certification Training Programme, a collaborative initiative between the Postal and Telecommunications Regulatory Authority […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zifa councillors await  fate in upcoming AGM",
            "url": "https://www.chronicle.co.zw/zifa-councillors-await-fate-in-upcoming-agm/",
            "content": "Lovemore Dube,[emailprotected]\n\nZifa councillors will know their fate next month when the national association holds its first extraordinary general meeting.\n\nNqobile Magwizi took over the reins at the national association on 25 January after almost 18 months of Zifa Normalisation Committee management.\n\nZifa was run by a normalisation committee from 11 July 2023, following the termination of Gift Bandas term as interim president, which came a year after he took over from Felton Kamambo, who was dismissed by Zifa councillors.\n\nThe 25 January elections resulted in a new board, with nine members voted into office, joining the Premier Soccer League boss (who has yet to be voted in) and representatives from Womens Soccer.\n\nFelton Kamambo\n\nYesterday afternoon, Zifa announced that the fate of the councillors would be determined at the extraordinary meeting, the exact date of which will be announced soon.\n\nZifa will hold an annual general meeting in March. The meeting will determine whether the councillors stay or if elections are held. At this time, I cannot provide the exact date of the meeting as Zifa is yet to decide, said Zifa in a statement yesterday afternoon.\n\nThe councillors terms expired in 2022, and the suspension of Zifa by FIFA led to an awkward situation where the terms of office-bearers ran out of time.\n\nBecause FIFA insisted on holding the board elections first to exit its involvement with the Zifa Normalisation Committee and allow Zimbabwean football to be managed autonomously, elections proceeded.\n\nHowever, there is now a need to normalise the entire situation regarding Zimbabwe football and establish a legitimate Assembly.\n\nThe extraordinary general meeting may face some challenges. None of the sitting councillors would be happy to feel used and discarded by the new administration, and if a vote is allowed, it is unlikely that they will vote in favour of elections.\n\nThey are not guaranteed a return to the Zifa structures, as some constituencies have been advocating for fresh elections.\n\nOnly the Assembly can grant an extension to the councillors terms.\n\nThe arrival of Magwizi and his team has given Zimbabwean football hope for better times.\n\nTwo months ago, Zifa legal officer Nyasha Samanyandwe told Zimpapers Sports Hub that the councillors future depends on the new dispensation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/sdgfvar.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw Zifa councillors will know their fate next month when the national association holds its first extraordinary general meeting. Nqobile Magwizi took over the reins at the national association on 25 January after almost 18 months of Zifa Normalisation Committee management. Zifa was run by a normalisation committee from 11 July 2023, following […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "RBZ waives licensing fees for bureaux de change in remote areas",
            "url": "https://www.chronicle.co.zw/rbz-waives-licensing-fees-for-bureaux-de-change-in-remote-areas/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nThe Reserve Bank of Zimbabwe (RBZ) has, with immediate effect, exempted licensing fees for the establishment of bureaux de change branches in remote and underserved communities, a move aimed at promoting financial inclusion.\n\nIn its latest Monetary Policy Statement, the central bank reaffirmed its commitment to expanding access to financial services, emphasising that financial inclusion promotes a strong and robust economy in which all individuals can participate in economic activities.\n\nThe Reserve Bank remains committed to fostering financial inclusion and allowing wider access to financial services, including ZiG, to remote and under-served communities, including designated growth points, said the RBZ.\n\nZimbabwe Gold\n\nThe central bank noted that financial inclusion and womens empowerment remain key priorities for the Government and its development partners, given their significant role in transforming livelihoods.\n\nTo build an inclusive financial system, the RBZ has been working closely with the Ministry of Womens Affairs, Community, Small and Medium Enterprises Development to ensure that marginalised groups have equitable access to financial services and opportunities for wealth creation.\n\nAs a member of the Alliance for Financial Inclusion (AFI) Gender Inclusive Finance Committee (GIFC), the RBZ has played a key role in shaping the newly launched Global Gender Inclusive Finance Policy.\n\nThe bank is actively implementing international best practices and recommendations to advance gender-inclusive finance in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/08/RBZ.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com The Reserve Bank of Zimbabwe (RBZ) has, with immediate effect, exempted licensing fees for the establishment of bureaux de change branches in remote and underserved communities, a move aimed at promoting financial inclusion. In its latest Monetary Policy Statement, the central bank reaffirmed its commitment to expanding access to financial services, […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "President fires Mashonaland East Minister Munzverengwi",
            "url": "https://www.chronicle.co.zw/president-fires-mashonaland-east-minister-munzverengwi/",
            "content": "Blessings Chidakwa, Harare Bureau\n\nPRESIDENT Mnangagwa has, with immediate effect, removed from office the Minister of State for Mashonaland East Provincial Affairs and Devolution, Cde Appolonia Munzverengwi.\n\nShe has since been replaced by Advocate Itayi Ndudzo, who is Hwedza North Constituency Member of Parliament.In separate statements last night, Chief Secretary to the President and Cabinet Dr Martin Rushwaya announced the firing of Cde Munzverengwi and the appointment of Adv Ndudzo to replace her.\n\nHis Excellency the President of the Republic of Zimbabwe, Cde Dr E D Mnangagwa has, in terms of Section 108 (1a) of the Constitution of Zimbabwe, removed Honourable Apollonia Munzverengwi from the Office of Minister of State for Provincial Affairs and Devolution, Mashonaland East Province with immediate effect, he said.\n\nIn another statement that followed, Dr Rushwaya announced that Senator Munzverengwi had been replaced by Advocate Ndudzo.\n\nHis Excellency the President of the Republic of Zimbabwe, Cde Dr E D Mnangagwa has, in terms of Section 104 Subsection (1) of the Constitution of Zimbabwe, appointed Honourable Itayi Ndudzo as Minister of State for Provincial Affairs and Devolution, Mashonaland East Province with immediate effect, said Dr Rushwaya.\n\nHis Excellency the President of the Republic of Zimbabwe, Cde Dr E D Mnangagwa\n\nSen Munzverengwi was initially appointed Provincial Minister in 2018 before being re-appointed after the 2023 harmonised elections.\n\nAdv Ndudzo was elected into the National Assembly in 2023.Those who know him have described him as an exceptional litigator who specialises in land law, corporate law, administrative law, immigration law, mining law, labour law and constitutional law. He has handled high-profile matters in the High Court and Supreme Court of Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/board-Mr-Itayi-Ndudzo.jpg",
            "description": "Blessings Chidakwa, Harare Bureau PRESIDENT Mnangagwa has, with immediate effect, removed from office the Minister of State for Mashonaland East Provincial Affairs and Devolution, Cde Appolonia Munzverengwi. She has since been replaced by Advocate Itayi Ndudzo, who is Hwedza North Constituency Member of Parliament. In separate statements last night, Chief Secretary to the President and […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "Man creates safe space for emotional healing",
            "url": "https://www.chronicle.co.zw/man-creates-safe-space-for-emotional-healing/",
            "content": "Flora Fadzai Sibanda,[emailprotected]\n\nGrowing up without his fathers presence, Mr Hlaisane Mjono wrestled with anger and frustration.As a child, he often threw tantrums, yearning for attention and answers that never came. The emotional scars ran deep, and societal expectations of masculinity forced him into silence for years.\n\nDetermined to break the cycle, Mr Mjono founded Project: Men, an initiative dedicated to providing a safe space for men to openly share their emotions and experiences. The platform supports men in becoming more emotionally connected, caring, and loving sons, uncles, fathers, and friends.\n\nWe focus on helping men become better versions of themselves by developing positive habits and improving their mental, physical, and emotional well-being. All my life, I struggled to cope with my fathers absence, said Mr Mjono.\n\nI remember asking myself, What was wrong with me? Why didnt my father want me? But I never got the answers.Mr Mjono realised he was not alone in this struggle. Many men, he observed, bottled up their pain, lacking the spaces to express their vulnerabilities.\n\nI remember telling a friend how much I wished my father had wanted me, he recounted. He simply responded, Hlai, my father left before I was born. Fathers leave. That moment struck me. It made me realise that so many men carry wounds they never speak about, said Mr Mjono.\n\nEmotional healing\n\nThis realisation led him to start Project: Men, a community where men come together, share their stories, and support one another.\n\nMany men and boys are deeply troubled, and it manifests in their behaviour, sometimes through anger, aggression, or even abuse towards their loved ones. Our initiative provides a space where men can say, I want to be better. I need help, said Mr Mjono.\n\nBeyond conversations on mental health, Project: Men is making tangible impacts. Through sponsorships from well-wishers, the initiative supports boys by paying school fees and ensuring they have access to education.\n\nFor now, we focus on men and boys because theyve often been neglected. Men face unique challenges, but societys expectations make it difficult for them to seek help, said Mr Mjono.\n\nHowever, we are not ignoring the girl child, as we run sanitary pad drives and sponsor a few rural girls. Still, our primary mission is to empower boys and men.\n\nOver the years, Project: Men has launched various programmes, including Beyond the Beard, which educates men on physical and mental health, suicide prevention, discipline, and family and relationship dynamics.\n\nI wish more mens groups could be started so that men can share their experiences without fear of being ridiculed or rejected. In five years, I hope to see major expansion, increased membership, and greater engagement in our activities and programmes, said Mr Mjono.By promoting open dialogue and emotional healing, Project: Men is redefining masculinity, one conversation at a time. @flora_sibanda\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-7-1.jpg",
            "description": "Flora Fadzai Sibanda, florafadzaisibz@gmail.com Growing up without his father’s presence, Mr Hlaisane Mjono wrestled with anger and frustration. As a child, he often threw tantrums, yearning for attention and answers that never came. The emotional scars ran deep, and societal expectations of masculinity forced him into silence for years. Determined to break the cycle, Mr […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        },
        {
            "title": "Schools chess begins",
            "url": "https://www.chronicle.co.zw/schools-chess-begins/",
            "content": "Brandon Moyo,[emailprotected]\n\nTHE Zimbabwe Chess Federation (ZCF) has described one of their flagship developmental events, the Crystal Candy National Schools tournament as a pathway to chess excellence in the country.\n\nThis years edition of the tournament is scheduled to run through February until mid-March with competition starting in districts across the country. It is organised by the ZCF Chess in Education Commission in partnership with Crystal Candy, the sponsor of the tournament.\n\nIt has been described as just not a competition but a journey that nurtures talent, promotes teamwork, and provides a platform for young chess enthusiasts to shine on national and international stages.\n\nThe introduction of the Crystal Candy National Schools Chess Tournament has been a significant milestone for chess development in Zimbabwe. This initiative has garnered international recognition, with FIDE (International Chess Federation) Chess in Education Chair Jerry Nash visiting Zimbabwe to launch the first edition of the Preparation of Teachers Course.\n\nBCA Chess tournaments\n\nThis course was a critical step in equipping educators with the skills to teach chess effectively, ensuring that the game becomes an integral part of the educational system. The visit by Jerry Nash underscored the global importance of chess in education and highlights Zimbabwes commitment to fostering a chess culture among its youth, said ZCF Communications and Public Relations director, Agab Dozva.\n\nThe Crystal Candy National Schools Chess Tournament is a team-based competition that begins at the grassroots level and culminates in a grand national finale. The tournament is designed to be inclusive, ensuring that schools from all corners of Zimbabwe have an opportunity to participate and showcase their skills.\n\nThe tournament kicks off at the cluster level, where schools within the same locality or educational district compete against one another. This stage is crucial as it brings together budding chess players, many of whom are participating in their first formal chess competition. The cluster level serves as a foundation, encouraging teamwork and introducing students to the thrill of competitive chess.\n\nWinning teams from the cluster level advance to the zonal competitions. Here, schools from different clusters within a zone battle it out for supremacy. The zonal stage raises the stakes, as only the best teams progress to the next level. It also provides an opportunity for players to test their skills against a wider pool of competitors.\n\nThe victorious teams from the zonal competitions move on to the district level.\n\nThis stage is more intense, with schools representing their districts and vying for a spot in the provincial finals. The district competitions are a melting pot of talent, where strategic brilliance and teamwork are put to the test.\n\nDistrict games will be held between 21 and 28 February 2025, with each district agreeing on a single day within this range that is ideal for their matches.\n\nThe provincial stage is where the competition reaches its peak. Winning teams from each district compete to be crowned provincial champions. proudly representing their provinces and aiming for a place in the national finals. national stage.\n\nThe National finals are the pinnacle of the Crystal Candy National Schools Chess Tournament. Here, the best teams from across Zimbabwe come together to compete for the ultimate prize. The national champions not only earn bragging rights but also secure the opportunity to represent Zimbabwe in international chess tournaments.\n\nThis stage is a celebration of talent, hard work, and the unifying power of chess. The finals will be held in Manicaland, with traveling days to and from scheduled for 14 and 17 March 2025, and playing days set for 15 and 16 March 2025.\n\nIn addition to the prestige and opportunities that come with winning the tournament, participants are also motivated by the Crystal Candy hampers. These hampers, filled with delicious treats, add a touch of sweetness to the competition and serve as a token of appreciation for the hard work and dedication of the young chess players.\n\nThe Zimbabwe Chess Federation has taken significant steps to spread the game across the country. By 31 December 2024, the ZCF had trained trainers and arbiters in 58 districts, with subsidies provided to reduce training costs. This initiative ensures that chess knowledge and expertise is accessible to all regions, fostering a nationwide chess culture. The goal is to make chess a part of every schools curriculum, integrating it into the educational system to maximize its benefits for students, said Dozva.\n\nRegistration for the tournament closes on Friday.\n\nThe Crystal Candy National Schools Chess Tournament is more than just a competition; it is a movement aimed at promoting chess in schools, fostering a love for the game, and unearthing the next generation of chess champions. By participating, schools not only give their students a chance to excel in chess but also contribute to the growth of the sport in Zimbabwe. The ultimate goal is to have chess played in every school across the country, making it an integral part of the educational system, Dozva added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/chess-board-630x380.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com THE Zimbabwe Chess Federation (ZCF) has described one of their flagship developmental events, the Crystal Candy National Schools tournament as a pathway to chess excellence in the country. This year’s edition of the tournament is scheduled to run through February until mid-March with competition starting in districts across the country. It is […]",
            "time": "08:39",
            "date": "12 Feb 2025"
        }
    ]
}