{
    "news": [
        {
            "title": "Universal access to education for all — President",
            "url": "https://www.chronicle.co.zw/universal-access-to-education-for-all-president/",
            "content": "Blessings Chidakwa in GOKWE\n\nGOVERNMENT is working tirelessly to ensure universal access to education for all children to prepare them for a brighter future so that they contribute meaningfully to national development, President Mnangagwa has said.\n\nSpeaking at the 45th Independence Childrens Party at Nyamuroro High School in Gokwe yesterday, President Mnangagwa said unity, innovation and hard work are key to securing a prosperous future for all Zimbabweans.\n\nHe urged the nation to continue to respect the heroes and heroines who made it possible for the children of Zimbabwe to have access to education, health care and opportunities.\n\nAs the nation commemorates Independence Day today, the President said Uhuru is a time to reflect on the countrys journey and citizens should come together to build a shared vision.\n\nHe said this years Independence Day celebrations theme, Zimbabwe at 45: Devolve and Develop Together Towards Vision 2030, must remind children that, as Government and elders, they want them to have equal development, opportunities, and access to Information Communication Technology whether they live in rural or urban areas.\n\nOur national Independence represents the struggles and sacrifices made by many young boys and girls of the past, who were just like you and fought for our freedom.\n\nIt is a time to reflect on our liberation history, to also celebrate the progress we have made as a nation, and to look ahead to a brighter future, he said.\n\nPresident Mnangagwa said learners should be able to relate to relevant education so that they can solve the challenges which communities face on a day-to-day basis.\n\nThe reviewed curriculum is also meant to address the needs of the 21st-century economy. This demands a robust education system that produces graduates with the right characteristics that enable them to be competitive in the global environment.\n\nIf you are educated, you should be able to produce services and goods, not just be fluent in the Queens language, he said.\n\nBuilding from the skills-oriented curriculum framework, my Government has put in place the required changes for our children to acquire scientific, innovative, vocational and technical skills that empower them to develop enterprises and contribute to the nations socio-economic transformation.\n\nPresident Mnangagwa said as the nation celebrates Independence Day, it was proud of the vast potential, talent and brilliance of the countrys children.\n\nOn its part, he said, Government is implementing programmes that focus on increasing youth participation in development and decision-making processes.\n\nThey (children) are torch-bearers of the dreams and aspirations for a better, modern and industrialised Zimbabwe. I assure you that the Second Republic will support the young people of our country by providing the necessary teaching and learning resources to promote both quality and inclusive education for a higher quality of life for all our people, President Mnangagwa said.\n\nMy Administration is prioritising an e-teaching and e-learning policy within our schools. To make sure that this runs smoothly, electricity, internet connectivity and related ICT equipment to schools including those in marginalised communities is being provided.\n\nThe President called upon the Ministries of Energy and Power Development, as well as Information Communication Technology, Postal and Courier Services, among other service providers, to speedily implement projects and programmes in schools.\n\nThis should see our schools, especially those in rural and resettlement areas, recording critical infrastructure improvements that enhance the learning experiences of pupils, he said.\n\nPresident Mnangagwa urged all citizens to continue working together to build a nation that is just, equitable and prosperous for children, where they grow up with hope, dignity, and pride.\n\nMy Government will continue to equip you, our children, to face your future with confidence, zeal and determination so that you lay a strong foundation to play your part in transforming the socio-economic development of our nation.\n\nIn all that we do, we must be guided by our philosophy: Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, he said.\n\nPresident Mnangagwa said the Government is also engaging various stakeholders to guarantee the provision of quality education that is affordable to all children, as well as the promotion of learning skills to make learners ready for the world of the future.\n\nThrough the Ministry of Primary and Secondary Education, we are progressing well to realise universal primary and secondary education, the promotion of foundational learning, and ensuring that all children of school-going age have the relevant skills and equipment to innovate for employment creation and entrepreneurship.\n\nUnder our education system, boys and girls are being given equal opportunities to achieve their full potential, he said.\n\nPresident Mnangagwa said the health and well-being of every citizen, including school-going children, is critical for unlocking the countrys economic potential.\n\nIt is our collective responsibility to address the plight of vulnerable and disadvantaged pupils in schools. No matter where they are, they too must be facilitated to enrol for their education and pursue fulfilling careers, he said.\n\nPresident Mnangagwa also took a swipe at the scourge of cyberbullying, and drug and substance abuse.\n\nLet us join hands to fight substance and drug abuse, a moral cancer affecting mostly young boys and girls. The peddling of drugs, as well as the abuse of social media platforms, should be rejected by our children and the youth throughout the country. Say NO to drugs and harmful substances. Say NO to cyberbullying, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/bnbnvgnngvbn.jpg",
            "description": "Blessings Chidakwa in GOKWE GOVERNMENT is working tirelessly to ensure universal access to education for all children to prepare them for a brighter future so that they contribute meaningfully to national development, President Mnangagwa has said.  Speaking at the 45th Independence Children’s Party at Nyamuroro High School in Gokwe yesterday, President Mnangagwa said unity, innovation […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "Easter joy, Independence pride as long weekend starts",
            "url": "https://www.chronicle.co.zw/easter-joy-independence-pride-as-long-weekend-starts/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nHoliday fever gripped Bulawayo yesterday as major bus termini and hitch-hiking spots teemed with excited travellers heading to different destinations, marking the rare overlap of Easter and Independence Day celebrations.\n\nFrom Old Renkini to Entumbane and Nkulumane bus ranks, the city was a hive of activity as travellers laden with luggage that included groceries, boarded buses, kombis and private cars on their way to reconnect with their loved ones mostly in rural areas while others were heading to different holiday destinations to enjoy the long holiday as families.\n\nFor the first time in years, Easter Friday and Independence Day, which falls on April 18, are being celebrated during the same long weekend, a convergence that has supercharged the usually busy Easter rush, transforming it into a dual celebration of spiritual reflection and national pride.\n\nIts a unique opportunity this year. Normally Id pick one holiday to go home but now I get to be with my family for both. It feels like a blessing, said Mrs Evelyne Sibanda, who was boarding a bus toGwelutshena in Nkayi with her three children.\n\nBeyond the joyful reunions, the long holiday is also proving to be a much-needed economic boost for informal traders, touts, and small business operators who rely heavily on holiday traffic.\n\nI make most of my money during holidays like this. Travellers stock up because they know things are more expensive in rural areas. Bread sells like gold, said Ms Anna Ngwenya, a vendor selling bread and other essentials at Old Renkini.\n\nFor Primrose Taurayi (22), who sells ice cream and airtime near the loading bays, business was brisk.\n\nKids always want a treat before the long bus ride. I sold 30 cups this morning alone, she said with a smile.\n\nEven pushcart operators are cashing in. A pushcart operator only identified as Mzex, who ferries goods for passengers between nearby suburbs and the bus rank, said hes doing as many as 15 trips a day.\n\nI charge US$1, no matter how heavy the load. Its good money over the holidays, he said.\n\nThe increase in travellers has pushed bus operators into overdrive. Some are dispatching several buses on popular routes such as Bulawayo-Gwanda and Bulawayo-Beitbridge.\n\nThis is the only time we run two or three trips a day and still fill up. We are barely coping with the demand for transport, said Luke Tshuma, a driver who was loading passengers heading to rural Gwanda.\n\nThe holiday rush wasnt just confined to the bus stations. Supermarkets and clothing stores across the city witnessed a flurry of last-minute shoppers.\n\nParents stocked up on food supplies, Easter treats, and Independence party essentials while children excitedly tugged along, pointing at colourful outfits and toys.\n\nNot everyone is leaving town, though. In Bulawayo, residents are gearing up for a number of events to mark the dual holidays. Foodies will flock to the Munch and Sip festival  a family-friendly celebration of local cuisine, music, and art.\n\nThose craving adrenaline will head to the ZKS Spinners Arena just past Emthunzini for an electrifying car-spinning showcase dubbed The Burnouts, marking Zimbabwes 45th birthday with tyre screeches and patriotic flair.\n\nZKS spinners\n\nFor the faithful, Easter remains a time of deep reflection. Churches across Bulawayo and beyond have lined up special services, revivals, and camp meetings.\n\nAs part of Easter festivities, the Christian Revival Centre (CRC) is celebrating the holiday with a special conference hosted by Apostle T and Prophetess Modern Kufakunesu.\n\nThe four-day event, which started on Wednesday and ends on Sunday, is a time of spiritual rejuvenation and celebration for CRC.\n\nThe United Congregational Church of Southern Africa (UCCSA), through its Zimbabwe Synod, has also lined up a series of spiritual and cultural observances.\n\nOur Easter preparation includes Lent fasting, Holy Week services, and commemorations on Palm Sunday, Maundy Thursday, Good Friday, and Easter Sunday, said the church leader, Reverend Sikhalo Cele.\n\nWe welcome all who will join us at various locations nationwide, including our Synod headquarters in Bulawayo.\n\nBishop Michael Dube of the Evangelical Lutheran Church in Zimbabwe (ELCZ) said Easter celebrations in the Western Diocese will take place across several suburbs in Bulawayo, including Njube, Mzilikazi, Tshabalala and Emganwini.\n\nFor the Apostolic Faith Church of Southern and Central Africa, this years Easter camp meeting will coincide with its 70th anniversary celebrations at its headquarters in Esiphezini, Umguza District.\n\nEaster is a time of reflection, prayer, and unity. Our preparations include revival services, fasting, and organising regional camp meetings, said Reverend Philisani Maphosa, pastor in charge of the Bulawayo branch.\n\nTo raise public awareness around safe driving and responsible road usage, the Traffic Safety Council of Zimbabwe (TSCZ) earlier in the week launched the National Easter and Independence Road Safety Education and Enforcement Campaign in Mashonaland Central Province.\n\nAs we approach the Easter and Independence holidays, we are also emphasising pedestrian safety, reinforcing the safe walking and safe road-crossing campaign under the theme Safety Starts with Me, said the TSCZ.\n\nThe National Blood Service Zimbabwe (NBSZ) has also urged members of the public to donate blood ahead of the long weekend, in order to boost blood stocks in case of road traffic accidents.\n\nThe Zimbabwe Republic Police has assured the nation that adequate arrangements have been made to ensure the safety and security of the public during the Easter and Independence holidays.\n\nIn a statement yesterday, Police Commissioner-General Stephen Mutamba urged the public to play its part during this period and to prioritise safety, especially motorists.\n\nAs the nation approaches the Easter and Independence holidays  a time of joy, reflection, and family gatherings  I urge everyone to prioritise safety and responsibility, he said.\n\nThe Zimbabwe Republic Police remains committed to ensuring a peaceful and secure environment for all. To achieve this, I call upon every citizen to play their part in upholding law and order.\n\nCommissioner-General Mutamba said adequate measures have been put in place to guarantee the safety and security of Independence Day commemorations across the country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cvvxzvcxzv.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw Holiday fever gripped Bulawayo yesterday as major bus termini and hitch-hiking spots teemed with excited travellers heading to different destinations, marking the rare overlap of Easter and Independence Day celebrations. From Old Renkini to Entumbane and Nkulumane bus ranks, the city was a hive of activity as travellers laden with luggage that included […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "Milton High’s rugby  revival starts at home",
            "url": "https://www.chronicle.co.zw/milton-highs-rugby-revival-starts-at-home/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nAFTER successfully hosting the third edition of the Milton Rugby Schools Festival at Hartsfield Rugby Grounds last week, Milton High School headmaster Similo Ncube has revealed that plans are underway to ensure next years edition takes place at the schools own grounds.\n\nSince its inception in 2023, all three editions of the annual schoolboy rugby festival have been staged at the citys ceremonial home of rugby. However, Ncube says the time has come for Milton to host the tournament in their own backyard.\n\nTo that end, rehabilitation work on the schools rugby fields has already begun, with a major breakthrough being the identification of a viable water source for a borehole.\n\nI believe very soon well have the game at our own ground. We have already broken through a borehole that has a lot of water. Water has been a stumbling block in the development of our grounds, said Ncube.\n\nWe believe that as soon as everything is set, we should be able to have our ground revamped and greened. That is our target for 2026  we want our ground to be as good as we want it to be. With water, we cant go wrong.\n\nNcube watched proudly as his school delivered spirited performances across the two days of action during the festival. The Elephants opened with a 22-12 win over Goromonzi High before clinching a hard-fought 13-11 victory against Allan Wilson in the headline match of the day.\n\nOnce a dominant force in Zimbabwean schoolboy rugby, the Elephants are starting to find their feet again and climb back up the ranks.\n\nTheir recent success sets the tone for their next challenge  the prestigious St Johns Mukuru Derby Day, set for April 28 to May 3  a test they now approach with sharpened confidence and a proud roar.\n\nMilton are also celebrating the selection of two of their players, Mayibongwe Ncube and Joseph Ndovorwi, into the Junior Sables squad for the Barths Trophy.\n\nThis years festival featured teams from Christian Brothers College (CBC), Plumtree, Entumbane, Sobukhazi, Petra, Northlea, Lord Brighton, Nkulumane, Gifford, Midlands Christian College, Montrose, Western Suburbs, St Bernards, St Columbas, Direct Contact, and Bulawayo Select. @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/The-Milton-High-School-Rugby-team.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub AFTER successfully hosting the third edition of the Milton Rugby Schools Festival at Hartsfield Rugby Grounds last week, Milton High School headmaster Similo Ncube has revealed that plans are underway to ensure next year’s edition takes place at the school’s own grounds. Since its inception in 2023, all three editions […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "Zim@45: Fireworks Mbeba blow hits Highlanders",
            "url": "https://www.chronicle.co.zw/zim45-fireworks-mbeba-blow-hits-highlanders/",
            "content": "Innocent Kurira, Zimpapers Sports Hub\n\nHIGHLANDERS and Chicken Inn are set to provide fireworks on the pitch in what promises to be an exciting Provincial Independence Cup final at White City Stadium this afternoon as Zimbabwe celebrates 45 years of Independence.\n\nBoth coaches, Kelvin Kaindu of Highlanders and Joey Antipas of Chicken Inn, have expressed their pride at being part of the nations celebrations, with both clubs aiming to leave their mark on the days festivities.\n\nWhile the match is an occasion to celebrate, it is also a vital opportunity for both teams to test their squads.Its an honour for a club like Highlanders to be part of the Independence celebrations, said Kaindu.\n\nIt makes it a bit difficult to prepare for two games as we have a league game on Monday, but we will regulate our players in terms of who played in the last match and who will feature tomorrow.\n\nBosso coach, Kelvin Kaindu\n\nDespite the tactical rotation, the intensity of this city derby is undeniable.Kaindu, who is no stranger to the fierce rivalry, predicted a thrilling encounter between the two teams. Playing Chicken Inn is never easy. Fans can expect an exciting game of football, said Kaindu.\n\nThe Bosso coach will have to make do without the injured Andrew Mbeba, who will miss both todays game and Mondays crucial league clash against Ngezi Platinum Stars.\n\nMbeba is set to see a specialist, and he will be out for a while. We also have a few players that picked up minor knocks but were hopeful they will be ready to go.\n\nFor Antipas, this derby offers a chance to give his fringe players some much-needed minutes. Its a good exercise for us.We need to give some of our players the opportunity to prove themselves. This is their chance to shine and show their worth.\n\nWe are looking forward to this match, said Antipas.Its a local derby, and I believe it will attract a lot of attention. Well be giving our other players a run as we continue to find our rhythm, added Antipas.\n\nThe match will serve as a fitting highlight of Zimbabwes Independence Day celebrations, though it is not the only major football event today.\n\nJoey Mafero Antipas\n\nThe national spotlight will also shine on Gokwe North, where Simba Bhora and FC Platinum will square off in the official Uhuru Cup match, marking a historic first for the Midlands Province.\n\nThis years theme, Zim@45: Devolve and Develop Together towards Vision 2030, reflects the Governments efforts to decentralise national events and bring major celebrations to the countrys various regions.\n\nMeanwhile, Gokwes Independence Day festivities included a womens football match between Herentals Queens and Black Rhinos Queens, underscoring the inclusivity of the days events.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-22.28.00-1.jpeg",
            "description": "Innocent Kurira, Zimpapers Sports Hub HIGHLANDERS and Chicken Inn are set to provide fireworks on the pitch in what promises to be an exciting Provincial Independence Cup final at White City Stadium this afternoon as Zimbabwe celebrates 45 years of Independence. Both coaches, Kelvin Kaindu of Highlanders and Joey Antipas of Chicken Inn, have expressed […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "Presidential Internet Scheme launched",
            "url": "https://www.chronicle.co.zw/presidential-internet-scheme-launched/",
            "content": "Farai Dauramanzi in NEMBUDZIYA, Gokwe\n\nPRESIDENT Mnangagwa yesterday launched the Presidential Internet Scheme during the Childrens Party at Nyamuroro High School in Nembudziya, Gokwe.\n\nThis is a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe.\n\nAs part of the programme, President Mnangagwa also handed over 2 000 Starlink gadgets to boost connectivity at schools, clinics and police camps in areas where there is no internet connectivity.\n\nThe Presidential Scheme is being administered by the Ministry of Information Communication Technology, Postal and Courier Services.\n\nSpeaking on the sidelines of the launch, ICT, Postal and Courier Services Minister Tatenda Mavetera said the programme is meant to ensure connectivity of all Government departments.\n\nThe Presidential Internet Scheme is meant to connect all Government departments and avail connectivity to all these places, she said.\n\nWe previously had programmes where we used fibre to connect various places across the country, but we realised that there was a need to adopt the various technologies that are coming up, especially the low earth orbit satellites, and see how best we can reach out, especially to under-served areas.\n\nMinister Mavetera added that the ministry conducted a broadband mapping exercise and realised a gap in some areas.\n\nSo this is the gap that we want to fill with the Presidential Internet Scheme that will see us connecting all marginalised areas using Low-Earth Orbit satellites and all fibre technology.\n\nWe are going to co-ordinate with all companies that are into low-earth orbit satellite and fibre technology, she said.\n\nThe Presidential Internet Scheme will connect schools, clinics and all courts, including traditional courts.\n\nDuring the Childrens Party proceedings, President Mnangagwa also launched the school business units at Nyamuroro High School and Nyamuroro Primary School.\n\nThe business units comprise a garden, fish ponds and solar-powered boreholes.\n\nThe units are part of village and school business units being established across the country under the ongoing Presidential Rural Development Programme, which seeks to radically improve rural livelihoods and transform rural communities into active economic participants.\n\nPresident Mnangagwa also led top Government officials and school children in planting 45 trees, a number that signifies the countrys years of self-rule.\n\nWhile delivering his welcome remarks at the Childrens Party, Primary and Secondary Education Minister Dr Torerayi Moyo said school children in the country are grateful to President Mnangagwa for the various initiatives his Government is implementing.\n\nThey are especially grateful for the increased investment in infrastructure development, the provision of basic education, the introduction of digital learning platforms in schools, and the prioritisation of learner welfare through school feeding programmes and subsidised examination fees, especially for those coming from indigent backgrounds.\n\nThey are thankful that all these initiatives have not only improved access to education but have also enhanced the learning environment, allowing every child, regardless of background or location, to dream bigger, learn better, and aspire to become productive citizens of a prosperous Zimbabwe, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/sxcdxszx.jpg",
            "description": "Farai Dauramanzi in NEMBUDZIYA, Gokwe PRESIDENT Mnangagwa yesterday launched the Presidential Internet Scheme during the Children’s Party at Nyamuroro High School in Nembudziya, Gokwe.  This is a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe. As part of the programme, President Mnangagwa also handed over 2 000 […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "Building the Zimbabwe we want begins with us",
            "url": "https://www.chronicle.co.zw/building-the-zimbabwe-we-want-begins-with-us/",
            "content": "Today all roads lead to Nembudziya, Gokwe North in the Midlands Province which is playing host to this years National Independence Day celebrations. The celebrations which are at Mutora Business Centre are being held under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030 which underscores the Second Republics commitment to inclusive national development and decentralisation of key State events.\n\nMore than 60 000 people from across the country are expected to throng Mutora Business Centre for the National Uhuru celebrations. The national celebrations are being held outside the capital, Harare for the fourth year running since Government adopted a system of rotating the hosting of the celebrations to ensure no one and no place is left behind.\n\nLast year the national celebrations were at Murambinda Business Centre, Buhera District in Manicaland Province. Gokwe North, like other districts that have played host to the National Celebrations, has benefited from a number of legacy projects implemented ahead of the celebrations which include construction of new hostels at Nyamuroro High School to accommodate 3 000 children that attended the Childrens Party yesterday, a modern football stadium at Mutora Business Centre where the main celebrations are being held, improved road network and boreholes among other infrastructure projects.\n\nIt is our hope that as citizens converge for the Uhuru celebrations today at the different venues across the country, they will take the opportunity to reflect on the countrys achievements since 1980 when the country was freed from the yoke of colonialism.\n\nCitizens that are not able to travel to Gokwe North for the main celebrations are expected to attend their respective district or provincial celebrations. The countrys gallant sons and daughters sacrificed their lives to liberate the country and they should be smiling in their graves after Government successfully implemented the land reform programme.\n\nMore than 300 000 families are now owners of land in areas that include what used to be a preserve of the white commercial farmers. Most Zimbabweans before independence were confined to barren land while white commercial farmers occupied prime farming areas in different parts of the country.\n\nThe skewed land ownership was one of the major grievances that drove Zimbabweans to take up arms to fight the settler regime. Government has since independence implemented a number of life-changing projects across the country which include construction of roads, bridges, dams, schools, clinics, drilled boreholes and also established a number of irrigation schemes to enhance food security.\n\nThe challenge this year is therefore is to sustain this development momentum and this calls for each and every citizen to put shoulder to the wheel. What is encouraging is that most of the development projects are being implemented by local companies, a confirmation that the country has the required skilled manpower.\n\nThe country is however, under siege from both internal and external detractors that are peddling falsehoods to destabilise the peace and tranquillity that citizens are enjoying.\n\nToday we should therefore come in our numbers at the different Uhuru celebrations venues to shame our detractors that want to divide us. It is only us who can build the Zimbabwe we all want and to achieve this we should have a shared vision as a people. Nyika Inovakwa Nevene Vayo/ Ilizwe Lakhiwa Ngabaninilo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ty-1.jpg",
            "description": "Today all roads lead to Nembudziya, Gokwe North in the Midlands Province which is playing host to this year’s National Independence Day celebrations. The celebrations which are at Mutora Business Centre are being held under the theme: “Zim@45: Devolve and Develop Together Towards Vision 2030” which underscores the Second Republic’s commitment to inclusive national development […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "PIB targets 20percent pork production increase",
            "url": "https://www.chronicle.co.zw/pib-targets-20percent-pork-production-increase/",
            "content": "Felistas Tavarera\n\nTHE Pig Industry Board (PIB) has unveiled plans to boost pork production by 20 percent from 18 700 tonnes in 2024 to 22 500 tonnes by the end of 2025, goaded by increasing market demand.\n\nPIB chief executive officer, Dr Sharai Ncube, revealed this recently during a tour of their operations to identify challenges and opportunities for growth.\n\nWe managed to produce 18 700 tonnes of pork last year, a slight drop from our target of 19 500 tonnes.By end of 2025 we have set a new target of 22 500 tonnes of pork through registered abattoirs and we are optimistic of achieving this due to favourable conditions and industry drive, she said.\n\nShe said the actual production figures for 2024 may be higher than recorded, as some farmers sell their pork outside registered abattoirs.\n\nDr Ncube underscored the importance of improving infrastructure to meet the increasing demand for breeding stock and enhance animal welfare too.\n\nThe board is actively exploring solutions to address feed shortages, which may compromise the sustainability of pig farming in the region.\n\nPig Industry Board\n\nSpeaking during the tour, Lands, Agriculture, Water, Fisheries and Rural Development Deputy Minister, Davis Marapira emphasised the need for modernisation of infrastructure to improve productivity and efficiency.\n\nFrom the visit of PIB structures, we feel that some rooms are excessively hot during day and similarly cold at night. We need rooms where there are good temperatures and a controlled heating system.\n\nAs a nation, we believe we can exceed our production goals, but we need to focus on revamping our infrastructure and addressing the challenges posed by feed unavailability.\n\nWith a capacity to slaughter 15 to 20 pigs per day, PIB must aim to increase efficiency and production rates, Dep Min Marapira urged.\n\nPIB must also aim for a target of servicing 60 female pigs monthly to ensure a steady supply of piglets, he encouraged.Dep Min Marapira said as the country sought to stabilise and grow its pig industry, stakeholders must collaborate and utilise available resources to maximise production and meet the rising demand for pork both locally and internationally. The Government is also determined to provide the right policies, he further observed.\n\nPIB needs irrigation and the available water source is 4,3 kilometres away, so we have to help them secure centre pivots in order that they at least can grow 100 hectares of feed for their stock. PIB also needs additional land to grow feed for their increased sows, he said.\n\nPIB offers research and training programmes to farmers aimed at improving their farming practices and provides high quality breeding material to help farmers improve their stock.\n\nIt also provides national quarantine services at no charge for those importing breeding materials. They produce pigs, which are sold to farmers for production purposes.\n\nZimbabwe has the Large White, Landrace and Duroc breeds and is of late importing new bloodlines from South Africa that can adapt to the feeding regime where every kilogramme of feed they consume will add value to their body weight.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/frgs.jpg",
            "description": "Felistas Tavarera THE Pig Industry Board (PIB) has unveiled plans to boost pork production by 20 percent from 18  700 tonnes in 2024 to 22 500 tonnes by the end of 2025, goaded by increasing market demand. PIB chief executive officer, Dr Sharai Ncube, revealed this recently during a tour of their operations to identify […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "Gokwe comes alive tonight for 45th Uhuru Musical Gala",
            "url": "https://www.chronicle.co.zw/gokwe-comes-alive-tonight-for-45th-uhuru-musical-gala/",
            "content": "Trust Khosa, Zimpapers Arts & Entertainment Hub\n\nITS all systems go for the 45th Uhuru Musical Gala, set to light up Nembudziya Government High School in Gokwe North tonight.\n\nRunning from 6pm to 6am, the event is themed Zim @ 45: Devolve and Develop Together Towards Vision 2030 and promises high-energy performances and a vibrant celebration of Zimbabwean music, culture, and unity. For those unable to attend in person, the gala will be streamed live via ZTNs Facebook page.\n\nThis musical spectacle features an impressive line-up of artistes, including Simon Mutambi, Admire Chief Hwenje Sibanda, Sulumani Chimbetu, Andy Muridzo, Clement Magwaza, Argatha Murudzwa, Iyasa, Shantel Sithole, Jah Signal, the Mbare Chimurenga Choir, DT Bio Mudimba, and Sandra Ndebele.\n\nClement Magwaza\n\nRepresenting the Midlands Province are local acts such as Peter Moyo, Takesure Chari, Devera Ngwena Jazz Band, Makanaka Masvisvi, Mafara Dube, Bhomba Chimurenga Choir, Band for ED, and Echoes of Mercy Choral.\n\nAdding a unique flair to this years gala, many of these artistes will be performing in Gokwe for the first time.For gospel star Argatha Murudzwa, the event marks her Gokwe debut.\n\nThis will be my first time in Gokwe, and Im both excited and a little nervous. My music is well-known there, but the people havent met the person behind the voice. Ill give it my all  its a national assignment, she said.Sandra Sandy Ndebele also expressed her excitement about returning to Gokwe after a decade.\n\nI last performed in Gokwe ten years ago. The excitement is real. Rural audiences rarely experience high-quality sound and lighting. I cant wait to celebrate Uhuru with them.\n\nAndy Muridzo\n\nCultural ambassadors Iyasa, known for their dynamic performances, are also geared up for the big night.We treat every performance as though its our first and last. Were ready to deliver a show to remember, said director Nkululeko Dube.Mzoe7, a regular at national events, shared his enthusiasm:\n\nIts an honour to be part of the celebrations. This will be my first live performance in Gokwe, and Im ready to give Zimbabwe a great show. Sungura stalwart Simon Mutambi said rural audiences are his strength.\n\nThese are my people. Ive toured many rural areas and the demand for sungura there is overwhelming. While others chase urban gigs, I thrive in rural spaces.\n\nThough he last visited Gokwe North over ten years ago, Mutambi is eager to finally perform for the local community.\n\nWeve performed all over Zimbabwe but struggled to reach Gokwe North  until now. We love what we do, and we give our best at every show.\n\nWith sungura fans in full force, performers like Mutambi, Magwaza, Ngwazi, Mudimba, and Peter Moyo are expected to deliver unforgettable sets.\n\nSandra Ndebele\n\nChief Hwenje  famous for hits like Mai Welly, Dhege, and Chigaba Chehuchi  returns to his home province, while the Mbare Chimurenga Choir promises a spirited dose of revolutionary cheer. Andy Muridzo and Sasha Amadhuve will cater to traditional music lovers with their mbira-infused sound, while Zimdancehall fans can look forward to Jah Signal, a familiar favourite on the Gokwe stage.\n\nSulumani Chimbetu, heir to the dendera music legacy of his father, the late Simon Chopper Chimbetu, is also expected to impress, as he continues to solidify his place among Zimbabwes musical greats.\n\nThe decentralisation of national celebrations under the Second Republic has brought joy and pride to entertainment-starved communities like Buhera, Bikita, Mt Darwin, and now Gokwe North. The gala is not just a musical showcase  its a powerful symbol of unity, resilience, and cultural identity.\n\nAs families gather, friendships are rekindled, and communities come together under the dazzling lights and pulsing rhythms, the 45th Uhuru Musical Gala is set to create lasting memories, a night of celebration, pride, and shared national spirit.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/07/Nkululeko-Dube-during-his-interview-in-Room-37-2-pic-cred-Temba-Chirwa.jpg",
            "description": "Trust Khosa, Zimpapers Arts & Entertainment Hub IT’S all systems go for the 45th Uhuru Musical Gala, set to light up Nembudziya Government High School in Gokwe North tonight. Running from 6pm to 6am, the event is themed “Zim @ 45: Devolve and Develop Together Towards Vision 2030” and promises high-energy performances and a vibrant […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "ZITF Tug of War draw held",
            "url": "https://www.chronicle.co.zw/zitf-tug-of-war-draw-held/",
            "content": "Innocent Kurira, Zimpapers Sports Hub\n\nTHE Ingwebu Breweries ZITF Tug of War draw was held yesterday, with 14 teams set to compete in the womens category and 19 in the mens category.\n\nIn the mens competition, Group A features Mutare Board and Paper Mills, Amidol, ZETDC Western B, Exide Batteries and UZ.\n\nGroup B includes Bulawayo Metro, Black Rhinos, Correctional Lions, CBZ and NRZ Bulawayo.\n\nGroup C is made up of ZETDC Western A, City of Kwekwe, Mimosa, City of Bulawayo, Transmission West.\n\nGroup D has Zesa Holdings, FBC, NRZ Gweru and Mutare City.\n\nIn the womens category, which comprises 14 teams, Group A includes Glow A, CBZ, ZETDC West and City of Kwekwe.\n\nGroup B features BCC, NRZ, Ingwebu Tow Team, and Zesa Holdings.\n\nGroup C consists of Glow B, Black Rhinos and Mimosa.\n\nGroup D includes Mutare City, Machingura and Correctional Services.\n\nThandolwenkosi Nkomo, the ZITF Marketing and Corporate Communications Manager, said they are proud to be involved.\n\nWe are grateful to Ingwebu for always making sure this event is a success.\n\nDumisani Moyo from Ingwebu said: It has always been our priority to be there when this event happens. As Ingwebu we are proud to be part of this annual event.Zimbabwe Tug of War (Zitowa) president Njabulo Khumalo thanked the sponsors for their continued support.\n\nIngwebu has been sponsoring this event for many years and we are grateful to our sponsors for their continued support and we are hopeful they continue with their support of the game, said Khumalo.\n\nThe championships begin at Gifford High School with knockout rounds, then move to the ZITF grounds on the final day of the trade expo.\n\nLast year, Mutare Board and Paper Mills were once again crowned mens champions while Glow Petroleum A claimed the womens title in.\n\nt was a hard-fought mens final that ended 2-1 in favour of the visitors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/Tug-of-war.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub THE Ingwebu Breweries ZITF Tug of War draw was held yesterday, with 14 teams set to compete in the women’s category and 19 in the men’s category. In the men’s competition, Group A features Mutare Board and Paper Mills, Amidol, ZETDC Western B, Exide Batteries and UZ. Group B includes […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        },
        {
            "title": "Footprints on the sands of time: Bayethe Midlands",
            "url": "https://www.chronicle.co.zw/footprints-on-the-sands-of-time-bayethe-midlands/",
            "content": "WHEN President Mnangagwa entered the Parliament of an independent Zimbabwe in 1980 representing the Midlands Province, he did so alongside the icons of Zimbabwes struggle for independence; Dr Joshua Mqabuko Nkomo and Cde Simon Vengai Muzenda who also represented the Midlands Province in Parliament.\n\nWithout doubt, the independence flame, the national flag and the national anthem will today bring to Gokwes Nembudziya footprints from the whole tapestry of the Zimbabwean story, the story of the pioneering generation of the armed struggle and the story of the cutting-edge generation of the struggle.\n\nIt is also the story of the warriors of King Lobengula, the story of the battle of Pupu and General Mtshana Khumalo, the story of Mbuya Nehanda and Sekuru Kaguvi.\n\nThe decision by President Mnangagwa to move the Independence Day National Celebrations from the capital and rotate them from one province to another in line with the spirit of leaving no one and no place behind saw Bulawayo Metropolitan Province being the first beneficiary, followed by Mashonaland Central, Manicaland, with this years celebrations hosted by Midlands.\n\nZimbabwe is arguably as strong or as weak as its provinces. In the spirit of devolution, provinces carry a considerable amount of responsibility towards national development which must start from their own door steps.\n\nTo borrow from the late former President of USA, John F Kennedy, every province is challenged to Ask not what Zimbabwe can do for it, but rather ask what it can do for Zimbabwe. Ask not what Zimbabwe can do for you, but rather ask what you can do for Zimbabwe. One swallow cannot make a summer, it is the 10 swallows that make the Zimbabwean summer.\n\nThe Independence Day whose national celebrations this year are hosted by the Midlands Province did not come on a silver platter but through sacrifice, blood and sweat through a bitter and painful armed liberation struggle. The decision to take up arms which saw volunteers being sent for military training abroad in the early 1960s saw President Mnangagwa being among the first generation of pioneer freedom fighters to go for military training in Egypt in early 1963 before going to China during the same year.\n\nAfter the dissolution of the Federation of Rhodesia and Nyasaland in 1963, Zambia and Malawi started moving towards independence but for Southern Rhodesia (Zimbabwe) the clock was moving backwards towards the Unilateral Declaration of Independence (UDI). The Zhii violent campaigns under the National Democratic Party (NDP) with General Chedu and General Hokoyo as leaders were overtaken by the more militant attacks on the white economic and political symbols of oppression with Zapu still using the NDP war cry Forward Ever, Backward Never while Zanu at its inaugural Gweru Congress of 1964 came up with its new war cry, None but Ourselves will Liberate Us.\n\nThis gave birth to the famous Crocodile Gang of which President Mnangagwa was a member. Without any weapon but armed with resourceful ingenuity acquired from military training in Egypt and China, President Mnangagwa befriended a Siziba, a young man who worked at a mine and knew about explosives and where to get them. Thus, having acquired the explosives, young Emmerson and his friend proceeded to plant the explosives on a goods train locomotive leading to an explosion a few seconds later damaging the engine, a blow to the Rhodesian economic infrastructure.\n\nThe Crocodile Gang had earlier ambushed and killed a white man in Manicaland. The two incidents led to a manhunt for members of the Crocodile Gang resulting in the capture of President Mnangagwa and other gang members. William Ndangana managed to evade arrest and escaped to Zambia while President Mnangagwa served a 10-year jail term with others being hanged.\n\nTwo months later in September 1964, six Zapu guerillas led by Moffat Hedebe attacked Zidube Ranch in Kezi next to the border with Botswana armed with Thompsom Submachine guns and Pepesh rifles. They had come all the way from Zambia with a mission targeting a white magistrate who was notorious for sending political activists to jail. On arrival in Bulawayo, the guerrillas were transported to Zidube Ranch by businessman Tafi Moyo, a relative of JZ Moyo. After the attack, three guerrillas were ordered to return to Zambia while commander Hadebe and the other two remained lying low in the countryside leading to their capture in a security scoop.\n\nWith Zambia moving towards independence at the end of 1964 and Southern Rhodesia moving in the opposite direction to UDI, the British government under Harold McMillan, famous for his winds of change speech, ironically gave the Salisbury Rhodesian government a UDI as an early Christmas present by transferring the Federal Royal Air Force from its Second World War air power as if to spite not only the Zambian blacks but also the Zimbabwean people too. Ghana opposed this move at the UN Security Council but Britain used its veto power to ensure that Rhodesia, not Zambia inherited the Federal Air Force.\n\nHowever, opposition to the UDI grew louder and stronger the following year of 1965 with Ghana under Kwame Nkrumah calling for the formation of a Pan-African force to stop Ian Smith from moving to UDI with even the opposition in the British Parliament calling the British government to send its AirForce to bomb Rhodesia in the event of a UDI, a rebellion against the British crown.\n\nHowever, with less than two weeks before Ian Smith declared a Unilateral Declaration of Independence, the new British Prime Minister Harold Wilson shocked the world by declaring that Britain would not intervene by force against Rhodesia in the event of a UDI.\n\nIf there are those who are thinking in terms of a thunderbolt hurtling from the sky and destroying their enemies, a thunderbolt in the shape of the RAF, let me say that that thunderbolt will not be coming, and to continue in this delusion wastes valuable time and misdirects valuable energies.\n\nIt was on 30 October 1965 in Salisbury and on 11 November 1965, that Ian Douglas Smith declared the UDI, ending with God save the Queen.\n\nTo Zapu and Zanu the red line had been crossed.\n\nMeanwhile, Josiah Magama Tongogara from Selukwe (Shurugwi) and fellow cadres were undergoing military training in China, while Rogers (Nikita) Mangena from Mazetese was in a group of 90 undergoing training in the art of modern warfare in Algeria. The following year in 1966, Zapu deployed about a section of armed guerillas including Cde Tshinga Dube who had trained in the Soviet Union in 1964 and Cde David Mongwa Moyo who had trained in North Korea for operations in Tsholotsho. Zanu deployed an almost similar number for operations in Mashonaland West. The Zanla group met the Rhodesian security forces in Chinhoyi resulting in the famous battle of Chinhoyi on 28 April 1966.\n\nIn August of 1967, a combined force of about 94 guerrillas from Zapu and the ANCs Umkhonto we Sizwe was deployed into Rhodesia for operations by James Chikerema and Oliver Tambo, with most of Umkhonto we Sizwe fighters enroute to South Africa. The field commander for the combined group named Luthuli Detachment in honour of Chief Albert Luthuli, the President of the ANC who had died on July 21, 1967, when the group was ready to cross the Zambezi River, was John Dube (Charles Sotsha Ngwenya) from Izimnyama in Plumtree who trained in 1965 in Algeria) deputised by Chirs Hani of Umkhonto we Sizwe, who trained in the Soviet Union. Zapus military wing, the Department of Special Affairs had its commander as Akim Matthew Ndlovu from Mberengwa in the Midlands Province who had trained in the Soviet Union like others such as Dumiso Dabengwa, Robson Manyika, Ambros Mutinhiri, Report Phelekezela Mphoko, Ethan Dube, Joseph\n\nNyandoro and Tshinga Dube. The ANCs Umkhonto we Sizwe was under the command of Joe Modise who had also received military training in the Soviet Union.\n\nThe group fought the Rhodesian forces who were later joined by the South African forces in Wankie at Inyantue, at Sinamathela, at Siwubu, at Mabhongane and Lupane.\n\nThe following year in 1968 on New Years Day, the second combined group of Zapu and ANC fighters entered Rhodesia through Mashonaland Central for operations with almost a similar mission as the Wankie group. This group had 120 fighters led by Moffat Hadebe who had escaped from Grey Street Prison in Bulawayo on New\n\nYears Day in 1965 after capture following the Zidube attack.l Full story on www.chronicle.co.zw.\n\nOn his return to Zambia, he had led a group of 20 to join the earlier group of 90 in Algeria. This group fought the Rhodesian forces for an extended period in Sipolilo, now Guruve.\n\nThe decade of the 1970s saw Josiah Magama Tongogara becoming the Zanu Chief of Defence and Zanla Commander while Alfred Nikita Mangena became the ZPRA commander until his tragic death on June 28, 1978 with Lookout Masuku the ZPRA commissar who had trained in the Soviet Union in 1964 taking over as the ZPRA commander, Sam Zwafa Moyo was in charge of ZPRA communication until his tragic death from the Rhodesian bombing of ZPRA Headquarters while Assaf Ndinda (Alexander Mutema) was the second Deputy Chief of Operations until his tragic death on 26 June in 1978. Saigon Ananias Gwenzi (General P.V Sibanda) was the ZPRA Chief of Reconnaissance while Abel Mazinyane was the Deputy Chief of Military Intelligence. Rodwell Nyika, late Brigadier General Collin Moyo commanded ZPRA at the battle of Kavalamanja in 1977 and stormed the Mana pools Rhodesian Army Garrison in 1978. He was ZPRA commander for the Northern Front. All the above have their roots in the Midlands Provinnce.\n\nJane Ndlovu also from the Midlands commanded the ZPRA Women Brigade until she was killed in the Rhodesian bombing of Mkushi Camp in 1978. Dr. Milton Chemhuru (alias Cde Mbeya) also from the Midlands was a medical officer and a fighter in the ZPRA ranks.\n\nBy taking the decision to rotate the National Independence Day Celebrations to all provinces, which had hither to been the preserve of Harare, the capital city, in the spirit of leaving no one and no place behind, President Mnangagwa is sending a clear message to the entire nation that one swallow doesnt make the Zimbabwean summer. The ball is now in every provinces court in the letter and spirit of the Governments devolution agenda to develop its provincial economy. Among many opportunities is the development of the liberation struggle tourism for both domestic and international tourism by putting up appropriate infrastructure to preserve those historical sites.\n\nPresident Mnangagwa has shown the way through the building of the Pupu War memorial in Matabeleland North Province to preserve and celebrate the battle of Pupu where on December 4, 1893, King Lobengulas warriors, including Hlupheko Mnangagwa, the Presidents grandfather, under the command of General Mtshana Khumalo (uNdindikuyasa) wiped out the entire Major Allan Wilsons force on the Northern bank of the Shangani River in Lupane.\n\nBayethe Midlands, Bayethe Nkabayezwe\n\n1. His Excellency, President ED Mnangagwa\n\n2. Ackim Matthew Ndlovu\n\n3. Josiah Magama Tongogara\n\n4. Rogers Alfred Nikita Mangena\n\n5. Sam Zwafa Moyo\n\n6. Henry Muchena\n\n7. Herbert Mahlaba\n\n8. General PV Sibanda (Gokwe)\n\n9. Lieutenant-General E Matatu\n\n10. Retired Chief Air Marshal Elson Moyo\n\n11. Lieutenant-General Sibusiso Busi Moyo\n\n12. Dr Chemhuru\n\n13. Brigadier-General Abel Mazinyane\n\n14. Colonel Eddie Sigoge\n\n15. Brigadier-General Collin Moyo\n\n16. Dr Chipo Mabuwa\n\n17. Chiratidzo Mabuwa\n\n18. Assaf Ndinda (Gokwe)\n\n19. Jane Ndlovu\n\n20. Capt Sithabile Sibanda\n\n21. Sobusa Gula Ndebele\n\n22. Johnston Ndebele\n\n23. Victor Mlambo\n\n24. Major-General Thomas Moyo\n\n25. Rugare Gumbo\n\n26. Webstar Gwauya\n\n27. Cletus Chigowe\n\n28. Obert Matshalaga\n\nLives of great men\n\nAll remind us we can\n\nMake our lives sublime\n\nAnd departing, leave behind us\n\nFootprints on the sands of time.\n\n(HW Longfellow  The Psalm of Life)\n\nl Ezekiel Hleza is an educationist and published author in Zimbabwes liberation literature.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/tt.jpg",
            "description": "WHEN President Mnangagwa entered the Parliament of an independent Zimbabwe in 1980 representing the Midlands Province, he did so alongside the icons of Zimbabwe’s struggle for independence; Dr Joshua Mqabuko Nkomo and Cde Simon Vengai Muzenda who also represented the Midlands Province in Parliament. Without doubt, the independence flame, the national flag and the national […]",
            "time": "06:09",
            "date": "18 Apr 2025"
        }
    ]
}