{
    "news": [
        {
            "title": "Safer roads for everyone… Tame traffic jungle, says President",
            "url": "https://www.chronicle.co.zw/safer-roads-for-everyone-tame-traffic-jungle-says-president/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nTHE Zimbabwe Republic Police (ZRP) must tame the traffic jungle on the countrys roads through the implementation of the electronic management system and curb the road carnage which has been on the rise over the years, President Mnangagwa has said.\n\nThe Head of State and Government said this yesterday while delivering a keynote address during a police recruit graduation ceremony held at Mkushi Academy.\n\nThe high rate of indiscipline on our roads, which has resulted in the loss of countless lives due to road carnage, is disturbing. More worrisome is the fact that a total of 4 069 people were killed in road traffic accidents in 2024 compared to 2 104 in 2023, reflecting an astonishing 93% increase.\n\nThe ZRP is challenged to tame the traffic jungle by speedily implementing the Electronic Traffic Management System.\n\nI call upon all Zimbabwean citizens to respect the countrys traffic laws and cooperate with law enforcement agencies, said President Mnangagwa.\n\nMost urban roads have seen the heavy presence of pirate vehicles, commonly known as mushikashika and have been a menace for their notoriety in flouting traffic laws, thereby contributing to road carnages.\n\nPresident Mnangagwa said the recent handover of 500 vehicles for police operations showed Government commitment to ensure that they fulfil their constitutional mandate.\n\nOn its part, Government is fully aware that adequate human capital and material resources are a prerequisite for the ZRP to fulfil their constitutional mandate. Mindful of this, my Administration will ensure that the Force is well equipped with tools of the trade, he said.\n\nThe President said the recent purchase and handover of 500 vehicles for police operations is a clear testimony of the Governments commitment.\n\nIt is my sincere hope that the vehicles distributed across the country have enhanced the operational capacity of the ZRP, he said.\n\nModern ICT hardware and software are now of critical importance to an effective Force, said President Mnangagwa.Therefore, Government is committed to prioritising the deployment of ICT-enabled systems to address challenges and opportunities presented by the ever-changing environment.\n\nThe various high-impact innovations that are being undertaken by the Zimbabwe Republic Police such as the Automated Fingerprint System will aid investigations and subsequent convictions of both first and repeat offenders.\n\nMore innovations of this type should be encouraged to enhance efficiency in the justice delivery system, he said.President Mnangagwa called for discipline among officers, saying it was a cog to a security organisation such as the ZRP, serving as a compass that guides sound actions.\n\nTo that end, he called upon them to shun corruption.As officers in the field, you will encounter all forms and types of temptations that will test your character, judgment, resolve and indeed your patriotism. Remain resolute and demonstrate high levels of integrity.\n\nShun corruption by whatever name. The image of the country and indeed of the Zimbabwe Republic Police rests upon your shoulders. Guard it jealously, said President Mnangagwa.\n\nHe bemoaned the prevalence of armed robbery cases and urged the ZRP to account for all those committing crime and implored communities to render assistance on crime prevention.\n\nTurning to the renaming of Mkushi Police Academy from Morris Depot in July 2023, President Mnangagwa said that was in line with the deliberate and critical step taken by his administration to memorialise and immortalise the bravery of both living and departed heroes and heroines who fought against colonialism.\n\nThe name Mkushi Police Academy particularly honours the contributions of our gallant daughters who perished in 1978 at the Zipra Mkushi Girls Camp in Zambia.\n\nIt is my hope that the graduating class and indeed the police service as a whole will continue to be inspired and emboldened by the same spirit of courage and selflessness that characterised that generation of the youth at the Mkushi Camp, he said.\n\nThe President challenged the police academy to entrench the values that sustained the countrys liberation struggle, which is an indelible character trait of the nation.\n\nThe many young men and women who pass through these gates are called upon to serve our motherland with honour, dignity and distinction. Patriotism and a deeply rooted sense of nationalism should be fully embraced by police officers, who remain custodians of the peace, security and stability of our country, he said.\n\nPresident Mnangagwa challenged the new Police Commissioner General, Stephen Mutamba to transform the Police Service so that it is best equipped to handle and manage the current security environment, dictated by the ongoing socio-economic developments of the country, and emerging new scenarios at regional and international levels.\n\nPolice recruits march during the ceremony yesterday\n\nHe said it was pleasing that the 907 recruits graduating were drawn from all the countrys ten provinces, in line with the Governments devolution and decentralisation programme.\n\nUnlike yesteryear where physical height and stamina were critical attributes for joining the Force, today policing is no longer a walk in the park. The challenges in this profession now require higher levels of knowledge and broader skills.\n\nHence, the importance of a deliberately designed training curricula that moulds competent and professional police officers. In this regard, it is commendable that the two-year Diploma programme undertaken by the graduating class incorporated an elaborate syllabi of contemporary policing courses, said President Mnangagwa.\n\nSome of the courses include Criminal Law (Codification and Reform Act Chapter 9:23), Police Duties and Investigation, Crime Investigations, Criminal Procedure and the Law of Evidence, Human Rights and Policing, Public Order Management, History of Policing and Civic Education, among others.\n\nPresident Mnangagwa said contemporary policing dictates that the police academies leverage on synergies with established academic and training institutions, such as universities, among other stakeholders.\n\nHe hailed the ZRPs continued contribution to regional and global peace through participation in United Nations Peacekeeping Missions saying it was on account of good standing as a professional Force that upholds best practices in policing.\n\nYesterdays event was characterised by various police displays that entertained guests who included parents, spouses and guardians of graduates\n\nThe event was attended by Vice President Kembo Mohadi, Cabinet Ministers, Heads of Government departments, agencies, service chiefs and captains of industry, among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/qf-680x380.jpg",
            "description": "Zvamaida Murwira, Harare Bureau THE Zimbabwe Republic Police (ZRP) must tame the traffic jungle on the country’s roads through the implementation of the electronic management system and curb the road carnage which has been on the rise over the years, President Mnangagwa has said. The Head of State and Government said this yesterday while delivering […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "Eight firms roped in for Old Gwanda Road job",
            "url": "https://www.chronicle.co.zw/eight-firms-roped-in-for-old-gwanda-road-job/",
            "content": "Nqobile Tshili,[emailprotected]\n\nZWANE Enterprise, the investor behind the upgrading of Old Gwanda Road, has roped in eight companies that will be involved in the construction of the 120KM stretch with President Mnangagwa expected to lead the projects groundbreaking ceremony in two weeks time.\n\nThe ambitious road construction project will cost about US$150 million including the road furniture while part of the funds will cater for the construction of new homesteads for affected families.\n\nA total of 42 homesteads will be moved while 24 graves will be relocated to pave the way for the road construction.The Ministry of Transport and Infrastructural Development last month signed a concession agreement with Zwane Enterprise, giving the investor greenlight to start the construction of the road.\n\nBefore moving in the yellow machinery on site, Zwane Enterprise, which won an unsolicited bid to rehabilitate the road, will today and tomorrow host a traditional ceremony and a church service within the roads route.\n\nVice-President Kembo Mohadi is expected to lead a traditional ceremony service in Dula, Umzingwane District today, as part of communitys beliefs before the major project is commenced.\n\nHe will lead the Christian service at Matopo Missions Brethren in Christ Church, tomorrow.Zwane Enterprise executive, Engineer Bekithemba Mbambo, told a press briefing that after the spiritual sessions, the next important item will be the groundbreaking ceremony.\n\nOn the 12th of March we are going to have the big one, the groundbreaking ceremony where the President is expected to grace us as the guest of honour, he said.We wish to start the road soon after ground breaking and we hope to finish most of it this year. We have been given 18 months\n\nwithin which to finish the road, said Eng Mbambo.However, the rainy season will also determine when we will start. There is no road work being done during the rainy season.\n\nIm sure all road construction in the country is on hold until after the end of the rainy season.Eng Mbambo said his company is taking a leaf from the Government, which contracted several companies in the construction of the Beitbridge-Harare-Chirundu Highway.\n\nHe said engaging multiple contractors will enable the company to complete the road within the shortest period with each contractor expected to do an average 20km.\n\nWe are finalising the contracts with the contractors. But at the moment it is almost cast in stone, which companies we will be working with. I can say on the main road we have seven companies, said Eng Mbambo.\n\nMost of the companies will be doing around 20KM, but there are two, which will have less. There is a stretch of 20km where there are two companies mainly because the baseline company can only do roadworks and cant do surfacing. So, because we wanted to work with that company, we had to work with another company to finish for them.\n\nHe said seven companies will work on the highway while another will rehabilitate feeder roads. Eng Mbambo assured the public that his company will produce a high-quality concrete asphalt road and contracted companies will only be paid after producing a project of satisfactory results.\n\nWe dont want to do a poor-quality road that will cost us a lot in maintenance. If we do a poor-quality road, it will hit us in our pockets. So, in terms of quality assurance there are several layers, said Eng Mbambo.The basic one is to make sure that we dont pay any contractor who has not done proper quality. We will be paying them in stages and if the stage is not up to quality, we will not pay them, said Eng Mbambo.\n\nHe said the company has also inserted a performance guarantee clause on the contract, which determines that contracted companies will be held accountable for the quality of the road they produce.\n\nOn top of that there will be an independent engineer who will be appointed by the ministry to ensure the quality is up to standard, said Eng Mambo. We are very sure that we will do a good quality road. Old Gwanda Road rehabilitation is a massive project, its the first of its kind in Zimbabwe where a private company is being awarded to upgrade from a dead road to highway and also manage for a 25-period depending on the payback period, he said.\n\nIn this project, we will be working hand in glove with the Ministry of Transport and Infrastructural Development, to make sure that we deliver a quality project and ensure that different stakeholders are happy.\n\nThe road construction is expected to trigger local economic development while unlocking the tourism potential for Matabeleland South.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/djsfhghdfsghd.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw ZWANE Enterprise, the investor behind the upgrading of Old Gwanda Road, has roped in eight companies that will be involved in the construction of the 120KM stretch with President Mnangagwa expected to lead the project’s groundbreaking ceremony in two weeks’ time. The ambitious road construction project will cost about US$150 million including […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "COMMENT: Farmers must unite, act swiftly to save maize crop",
            "url": "https://www.chronicle.co.zw/comment-farmers-must-unite-act-swiftly-to-save-maize-crop/",
            "content": "As we feared, armyworm infestations have been reported in at least 25 districts countrywide.The season has been remarkably wet since December and it is this remarkable wetness that got us musing, afraid too that the pest could hit once again.\n\nIndeed, it did.The pest, both the fall and African armyworm, has quite an appetite, especially for cereals. If uncontrolled early enough, it can eat up whole fields, leaving farmers angry, hungry and poorer.\n\nIt is because of its capacity to cause total damage and spread so instantly that it is a notifiable pest in the country.Districts that have been affected include Umguza, Uzumba-Maramba-Pfungwe, Murehwa, Mudzi, Goromonzi, Shamva, Chipinge, Mutasa, Mutare, Chimanimani, Buhera, Chiredzi, Zaka, Bikita, Gutu, Masvingo, Mwenezi, Hwange, Hurungwe, Mazowe, Mberengwa, Guruve, and Zvimba.\n\nIn Mberengwa, an estimated 307 hectares of cereal crops and over 2 400 hectares of grazing land had been affected by Wednesday, we reported yesterday.\n\nThis saddens us a lot because we are losing significant amounts of maize and other grains to this pest. This, as we noted earlier, has significant food security implications. There is a risk that some farmers might not harvest anything in a season that gave us so much rain.\n\nWe recognise the work that the Government is doing to educate farmers on the need to always scout for the pest. If they identify it, they are encouraged to report to authorities given the worms designation as a notifiable pest.In addition, the Government is assisting some growers by spraying pesticide to control it.\n\nThese are important interventions.However, to expect authorities to have enough resources to buy the pesticide, move it to the areas of distress and to then actually have the equipment to apply the pesticide timeously is to expect too much.\n\nThat puts the ball squarely in the farmers fields. It is their ultimate responsibility to, not only scan their fields for the pest but to also raise adequate resources to act against it so that they reap the huge harvest they deserve after the 2024 disaster.We urge our farmers to take it all in their own hands because at the end of the season, the loss is totally theirs if they do not do as we suggest.\n\nIn saying this, we clearly appreciate that some farmers are so poor that the seed maize they planted, now being devoured by the armyworm, was a donation. As such they do not have money to spend on pesticides. We regret that.\n\nBut we have been advised that there are a few, more accessible alternatives to over-the-counter pesticides that they can use to be able to fight off the worm. Applying a bit of soil or cold ash at the heart of the maize crop, the exact spot where the pesticide is sprayed into, can help.\n\nWe have not tested this ourselves, but trying them is more responsible than just waiting for crops to be eaten up.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/01/kmnvbjnbhn.jpg",
            "description": "As we feared, armyworm infestations have been reported in at least 25 districts countrywide. The season has been remarkably wet since December and it is this remarkable wetness that got us musing, afraid too that the pest could hit once again. Indeed, it did. The pest, both the fall and African armyworm, has quite an […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "Greece backs Zimbabwe UN Security Council bid",
            "url": "https://www.chronicle.co.zw/greece-backs-zimbabwe-un-security-council-bid/",
            "content": "Blessings Chidakwa, Harare Bureau\n\nGREECE has thrown its weight behind Zimbabwes bid for a non-permanent seat on the United Nations Security Council adding its voice to several nations supporting the country including Russia.\n\nThis was revealed yesterday when Hellenic Republic (Greece) Ambassador Ms Anna Farrou and Cubas Ms Susellys Perez Meza presented their letters of credence to President Mnangagwa at State House.The first to present was Ambassador designate for Greece Ms Farrou followed by Cubas Ms Meza.Speaking after presenting her credentials, Ms Farrou said she was committed to uplifting the already excellent relationship between Greece and Zimbabwe.\n\nAmbassador Farrou said apart from the bilateral co-operation that they discussed with President Mnangagwa, they also took the opportunity to thank him warmly, and Zimbabwe as well, and the political leadership, for supporting Greece in their election as a non-permanent member in the Security Council for the period of 2025-2026.\n\nI reiterated our commitment to support Zimbabwe in its effort to be elected to the Security Council, he said.I also commended the tireless efforts by His Excellency the President regarding securing peace and security in the region, also through his leadership in SADC, since Zimbabwe holds the chair, the annual chair of SADC.\n\nAmbassador Farrou also promised to work closely with Zimbabwe in the tourism, agricultural and education sectors in order to enhance and consolidate the really excellent relationship between the two nations.\n\nSo, there are many sectors where we could explore opportunities at political and economic level. One of my priorities will be the field of the sector of tourism. Greece, as you know, is a touristic country, she said.\n\nOur industry heavily relies on tourism. So, there is a lot of expertise there, and we are very, very happy to share it with our friends and partners. Just to show you an indication of what I mean about tourism in Greece, last year, 35 million people visited Greece.\n\nAmbassador Farrou added: 35 million is a lot of people, and Greece is a small, medium country, so you understand how important hospitality and tourism is for us and what kind of expertise my country has in this sector.\n\nThe Greece Ambassador to Zimbabwe said another area on which they will explore possibilities to enhance relations is agriculture. Ambassador Farrou said apart from that, they believe a lot in people-to-people contacts.\n\nSo, this is something which is also very high in my agenda, and this means that we will try to see how we can increase the number of scholarships that we provide to Zimbabwean students, she said.\n\nMs Meza said Zimbabwe and Cuba have very historical and strong ties.My task will be to strengthen them. We share a lot of values. We are very close. We also share some things, unfortunately, like the sanctions. We will fight, we will continue fighting against that, she said.\n\nWe think we can cooperate more with biotech and industry, also science and technologies, and also deepen the ties we already have in health and in education. We have to improve our economic relations at the same level as the political one.Cuba and Zimbabwe this year will celebrate 45 years since the establishment of diplomatic relations which are rock-solid.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/F42.jpg",
            "description": "Blessings Chidakwa, Harare Bureau GREECE has thrown its weight behind Zimbabwe’s bid for a non-permanent seat on the United Nations Security Council adding its voice to several nations supporting the country including Russia. This was revealed yesterday when Hellenic Republic (Greece) Ambassador Ms Anna Farrou and Cuba’s Ms Susellys Perez Meza presented their letters of […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "15 years jail for serial thief",
            "url": "https://www.chronicle.co.zw/15-years-jail-for-serial-thief/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 24-YEAR-OLD serial thief who stole property worth about US$100 000 over seven months, has been sentenced to 15 years in jail.\n\nLaga Dube of Upper Rangemore in Umguza District was convicted of 43 counts of theft by Western Commonage magistrate Mr Vakai Douglas Chikwekwe. Dube denied the charges but was found guilty after overwhelming evidence was presented in court.The goods were stolen between August 2023 and March last year.\n\nHowever, five years of Dubes sentence were suspended on condition of good behaviour, meaning he will serve an effective 10-year jail term.\n\nIn passing the sentence, Mr Chikwekwe said Dube deserved a lengthy custodial sentence, which serves as a stern warning to potential offenders.\n\nThe prosecutor, Mr Milton Moyo, said Dube systematically targeted vehicles across Bulawayo, using various break-in methods to steal valuables, including mobile phones, laptops, cash, and vehicle accessories such as wheels.The thefts involved breaking into 43 separate motor vehicles, from which Dube stole various items. He used different techniques, including smashing windows and picking locks, to gain access, said Mr Moyo.\n\nDubes crime spree began in August 2023, with the first recorded theft involving property worth US$420, of which US$400 was later recovered. Between the second and 30th counts, he stole goods valued at US$83 590, though less than half was recovered.\n\nThe remaining 13 thefts, recorded from count 31 to 43, contributed significantly to the total stolen amount.His crimes came to light in March 2024 when one of the victims reported a break-in, prompting investigations that eventually linked Dube to the series of thefts.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/08/jail...jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 24-YEAR-OLD serial thief who stole property worth about US$100 000 over seven months, has been sentenced to 15 years in jail. Laga Dube of Upper Rangemore in Umguza District was convicted of 43 counts of theft by Western Commonage magistrate Mr Vakai Douglas Chikwekwe. Dube denied the charges but was found […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "Bosso bullish on Bullion Deal",
            "url": "https://www.chronicle.co.zw/bosso-bullish-on-bullion-deal/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS are on track for a promising 2025 Premier Soccer League (PSL) season, with chairman Kenneth Mhlophe saying the clubs financial situation is improving thanks to a major sponsorship deal with Kings Bullion and the club is also in talks with principal sponsors Sakunda Holdings over a new deal.\n\nKings Bullion, a key partner, has entered into a renewable US$300000 sponsorship agreement with the Bulawayo giants.The sponsorship announced on Wednesday evening, is set to provide the much-needed financial stability as the team prepares for the upcoming season.\n\nThe club is also enjoying the sponsorship of BetterBrands, Nyaradzo, Sanctuary and Utande.\n\nMhlophe expressed his gratitude to sponsors, particularly Kings Bullion, for stepping in during this critical period.\n\nWe are really grateful to our new sponsors who have come in at a critical stage of our seasons preparations. The money they have poured into the club will be used towards the welfare of the first team while we continue to negotiate with our principal sponsors, Sakunda Holdings over a new deal, said Mhlophe.\n\nDespite the positive news on sponsorship, Highlanders players are still owed two months salaries.However, Mhlophe assured fans that the club is doing everything possible to resolve the situation.\n\nWe are grateful to Kings Bullion for coming on board and we are hopeful the sponsorship will go a long way in assisting the team during the course of the season. We are doing all in our power to ensure our players are paid all they are owed and are ready to deliver positive results. Despite the tough situation we find ourselves in, I am happy the players have shown commitment to work while we resolve the situation said Mhlophe.\n\nHighlanders are also actively working on securing sponsorship for their womens and junior teams.We are doing our best to ensure our junior teams and ladies teams also get sponsorship. We are running around so that by the time the games start, these teams also have their own sponsorship, said Mhlophe.\n\nHighlanders are set to kick off their 2025 PSL season with an away match against MWOS at Baobab Stadium on Sunday.MWOS purchased the ZPC Hwange franchise after an unsuccessful Northern Region championship campaign.\n\nThe newly promoted side has made significant strides in the transfer market, signing high-profile players such as former Dynamos goalkeeper Martin Mapisa, ex-CAPS United left-back Innocent Zambezi, and ex-Ngezi Platinum Stars striker Claude Pokello Mapoka, among others.\n\nHighlanders have bolstered their squad with the addition of 19-year-old winger Mafious Junior Chiweta from Ajax Hotspurs.Chiweta, a member of the Warriors Under-20 squad, impressed during the Afcon Qualifiers in South Africa last year. His move to Highlanders sees him re-unite with his former national teammates Prince Ndlovu and Mvelo Khoza who are already part of the Bosso set-up.\n\nChiwetas arrival strengthens Highlanders squad as they seek to replace key players such as Lynoth Chikuhwa, Peter Muduhwa, Marvelous Chigumira and Godfrey Makaruse, all who joined newly-promoted Scottland FC.\n\nThe club has also signed defender Marlvin Hativagoni on loan from Bulawayo Chiefs.Hativagoni turned out for Ngezi Platinum last year.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Kenneth-Mhlophe-1.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS are on track for a promising 2025 Premier Soccer League (PSL) season, with chairman Kenneth Mhlophe saying the club’s financial situation is improving thanks to a major sponsorship deal with King’s Bullion and the club is also in talks with principal sponsors Sakunda Holdings over a new deal. King’s Bullion, a […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "All systems go for Nama 23… organisers promise a night to remember",
            "url": "https://www.chronicle.co.zw/all-systems-go-for-nama-23-organisers-promise-a-night-to-remember/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nAFTER 22 years of celebrating artistic excellence, the National Arts Merit Awards (Nama) is set to embark on a new chapter in its illustrious history.\n\nFor the first time, the 23rd edition of the prestigious event will be held at the state-of-the-art Hippodrome in Harare, a venue that has become increasingly sought after. This change in scenery from the traditional 7 Arts Theatre is fitting as the National Arts Council of Zimbabwe (NACZ), which runs Nama, is under new management, bringing fresh energy and vision to the awards under its director Napoleon Napster Nyanhi.\n\nPoignantly, the 2024 ceremony taking place tomorrow, will also be a farewell for the organisers, Jacaranda Culture & Media Corporation who have worked tirelessly behind the scenes for the past five years to bring the awards to life.\n\nThe stage is now set for a night of glamour, nostalgia and artistic celebration.The nominees were unveiled last week, covering an array of artistic disciplines. With an impressive 2 371 entries submitted, this years competition showcases the rich talent Zimbabwe has.\n\nBulawayo made its mark on the Nama23 nominee list, with comedian Mbongeni Ignatius Ndlovu earning his first-ever nomination in the Outstanding Stand-Up Comedian category. He is joined by other notable nominees, including Madlela Skhobokhobo (comedian and musician), Sithandazile Dube (choreographer), John Mabuyane (theatre and performing arts), Future Dube (dancer and choreographer) and Elaine Ncube (theatre and performing arts).\n\nMusical giants such as Master H, Freeman, Winky D, Dorcas Moyo, Nisha Ts, Voltz JT, Mai Kilifodhi, and Saintfloew are also vying for top honours.\n\nIn line with the #Afrofuturism theme, Nama23 boasts an electrifying line-up of performers, including, Hwinza, Nisha Ts, Oriyano, Shashl, Atenda Chinx, Bagga, Sylent Nqo, Probeatz, Misheck Mahendere, Joyful Praise Choir, The Choice Childrens Choir and Denilson the Saxophonist. South African actress, Nombulelo Mhlongo, widely known for her role as Sne in television drama Durban Gen, is also set to attend the awards ceremony with more surprise acts lined up, adding to the excitement.Nama director Tinashe Kitchen assured fans that preparations are in the final stages.\n\nTicket sales are moving smoothly and were very excited for Nama23. Our artistes are ready to perform, and were looking forward to bringing the future of the arts into the present.\n\nAttendees can expect a spectacular show  a celebration of the future of Zimbabwean art. Nama is all about the artistes, and we look forward to celebrating them to the fullest on the night.\n\nMeanwhile, event organisers have announced a special partnership with the Moto Moto Festival in Cologne, Germany. As part of this collaboration. The winner of the Outstanding Breakthrough Artiste (Music) award will receive an all-expenses-paid trip to perform at the Moto Moto Festival in July.\n\nNominees in this category are Kutsamwa Kunelabour hit-maker Nisha Ts, Horror hit-maker Chillmaster and Young Gemini.Nama is excited to welcome this new partnership and looks forward to creating more opportunities for young artistes to showcase their talent at international platforms. The winner will be announced at the awards ceremony on Saturday, organisers said.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jihb.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com AFTER 22 years of celebrating artistic excellence, the National Arts Merit Awards (Nama) is set to embark on a new chapter in its illustrious history. For the first time, the 23rd edition of the prestigious event will be held at the state-of-the-art Hippodrome in Harare, a venue that has become increasingly sought […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "Minister sets up team to probe Gweru mismanagement",
            "url": "https://www.chronicle.co.zw/minister-sets-up-team-to-probe-gweru-mismanagement/",
            "content": "Patrick Chitumba,[emailprotected]\n\nLOCAL Government and Public Works Minister Daniel Garwe has appointed a team to probe allegations of abuse of office and mismanagement by Gweru City Council management and councillors.\n\nThe team will be led by Ms Khonzani Ncube, chief director in the Ministry of Local Government and Public Works, Mr Edward Njoma, deputy director in the ministry, Mr Kudakwashe Chakabva from the Local Authorities Board and Mr Batanayi Mamwa, from Financial Advisory Services.\n\nA letter from Minister Garwe and addressed to Ms Ncube read: In terms of Section 311 (1) of the Urban Councils Act (Chapter 29:15), I hereby appoint you as chairperson of an investigation team to look into allegations of mismanagement and abuse of office levelled against policymakers and management of Gweru City Council.\n\nMinister Garwe said the investigation team seeks to establish whether Gweru City Council implemented recommendations stated in the Ministry land audit of 2019. It will also probe the alleged use of estate funds in the purchase of vehicles for council officials last year.\n\nYou are also to establish the alleged conversion of the aerodrome land to personal use by His Worship, the Mayor Clr Martin Chivhoko and to verify conditions behind the Go Beer Breweries deal between council and its partners.Minister Garwe also tasked the team to look into any other issues related to service delivery.\n\nAccording to the letter, Ms Ncube is supposed to write a report on their findings and make recommendations to the minister within 10 days of the commencement of the investigation.\n\nYou are expected to complete the investigation within 10 days and produce a report to the Honourable Minister. Gweru City Council will bear the full costs of the inquiry, read the letter.\n\nThe investigation team is coming at a time when the council is owing December salaries and bonuses for lower grade workers.Gweru City Council is also accused of prioritising buying vehicles for senior management when it is failing to repair potholes and supplying water constantly to all parts of the city.\n\nThe employees have also been failing to access medical care since the local authority is allegedly failing to settle their medical aid portion to the service provider.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Cde-Daniel-Garwe-copy.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw LOCAL Government and Public Works Minister Daniel Garwe has appointed a team to probe allegations of abuse of office and mismanagement by Gweru City Council management and councillors. The team will be led by Ms Khonzani Ncube, chief director in the Ministry of Local Government and Public Works, Mr Edward Njoma, deputy […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "Zimbabwe’s monetary tight rope: Assessing the Governor’s policies amid fiscal ambitions",
            "url": "https://www.chronicle.co.zw/zimbabwes-monetary-tight-rope-assessing-the-governors-policies-amid-fiscal-ambitions/",
            "content": "Admire Dube,[emailprotected]\n\nThe Reserve Bank of Zimbabwe (RBZ) has been navigating a complex monetary landscape since the introduction of the Zimbabwe Gold (ZiG) in April 2024. While the central bank has made significant strides in stabilising prices and anchoring currency confidence, its approach raises critical questions about alignment with broader fiscal objectives.\n\nThe government, through the Ministry of Finance, Economic Development and Investment Promotion, has set an aggressive growth agenda centred on infrastructure development and internal construction. Yet, the RBZs tight monetary stance  characterised by high interest rates and stringent reserve requirements  appears at odds with these ambitions.Is this incongruity between fiscal and monetary policies sustainable, both short and long term? Or does it risk undermining the very transformation the current administration seeks?\n\nEconomic activity denominated in local currency declined slightly from 75 percent in April 2024 to 70 percent as of January 2025, despite initial optimism following the ZiG launch. This dip underscores lingering trust issues with the new currency, as it was with the old Zimbabwe dollar it replaced.\n\nMeanwhile, exporters United States dollar surrender levels rose modestly from 25 percent to 30 percent, reflecting incremental progress in the central banks forex retention from exporters, but still insufficient to meet industrial needs.\n\nTo enhance market efficiency, RBZ has removed pricing margins and caps for forex transactions. We anticipate they must have already put robust oversight mechanisms after this move to reigniting speculative behaviour  a concern given the parallel market premium, which widened temporarily before stabilising.\n\nOn the inflation front, the RBZ faced turbulence in late 2024 when month-on-month ZiG inflation surged due to heightened parallel market activities and other matters. To counteract this volatility, the Monetary Policy Committee (MPC) raised the policy rate to 35 percent, increased statutory reserve requirements to 30 percent, and introduced greater exchange rate flexibility under the willing-buyer-willing-seller system.\n\nThese include allowing greater exchange rate flexibility, standardising statutory reserve ratios for foreign currency deposits at 20 percent, and ensuring that up to 50 percent of liquidated export surrender forex receipts are channelled back into the interbank market to keep rates volatility in check.\n\nAdditionally, the RBZ has removed limits on foreign exchange trading volumes and increased the annual limit for prepaid international debit and credit cards to US$1 million, promoting ease of doing business while closely monitoring potential risks such as capital outflows or speculative behaviour.\n\nThese measures have notably stabilised both official and parallel exchange rates, albeit at a cost. A higher policy rate suppresses borrowing and investment, while elevated reserve ratios reduce banks ability to extend credit. For context, Botswana, to pick one example, maintains reserve ratios closer to eight percent. South Africa, another neighbouring country, keeps them around two percent  a stark contrast that highlights the trade-offs Zimbabwe is making for stability.\n\nThe RBZs success in building reserves cannot be overstated. Gold holdings rose significantly since April 2024 when the new currency was introduced. Backing for reserve money coverage are more than three times the money stock, with approximately US$540 million covering ZiG3,4 billion in circulation as of November 8, 2024. This coverage exceeds international norms, where reserve money is typically backed 1,5 to two times by foreign reserves.\n\nExcess coverage, though it must be understood, ties up resources that could otherwise fund productive sectors. Also, the removal of weekly forex trading limits and the increase in prepaid card thresholds will promote ease of doing business but equally expose the economy to potential capital outflows, if not closely monitored. These two are only but the beginning of seemingly tangent directions between the monetary and fiscal policy.\n\nFrom a theoretical perspective, the interplay between the two policies can be analysed using what we call the Phillips Curve, which, simply put, suggests a trade-off between inflation and unemployment. In Zimbabwes case, maintaining single-digit inflation has been pursued through tight monetary conditions, which, inadvertently, have constrained the economic dynamism.\n\nWith ZiG inflation projected to average below three percent month-on-month (MoM) in 2025, the MPCs efforts appear effective. On the inverse, this stability comes at the expense of liquidity, particularly in the banking sector, where deposit-to-loan ratios hover below 60 percent.\n\nBy comparison, Botswana boasts ratios closer to 75 percent, while South Africa is almost fully awash with funding for economic needs achieving nearly 90 percent of deposits being loaned out. Such disparities highlight how constrained monetary policy limits private sector participation in growth initiatives. Which, as we have seen in Zimbabwe, ultimately leads to the government intervening. In fact, the RBZ itself has had to come in with its own Targeted Finance Facility (TFF), which we will speak about later.\n\nConsidering the impact on infrastructure projects in the country as outlined in the 2025 National Budget announced on the November 28, 2024 by the Minister of Finance, Professor Mthuli Ncube, the appetite for internal liquidity is voracious.Construction, a key driver of GDP growth, requires substantial financing, often sourced externally but equally via domestic loans. Under current conditions, however, banks are reluctant to lend due to perceived risks, regulatory constraints, and outright stiflingly tight environment engendered by the Central Bank.\n\nApplying the Loanable Funds Theory, we see that reduced credit availability will certainly increase the cost of capital for construction firms. If banks cannot finance these projects adequately, the Government may need to step in, increasing public debt levels. Something we have seen numerous times.\n\nAccording to projections, gross fixed capital investment is expected to grow by only 4,6 percent in 2025, far below the 20 percent year-on-year (YoY) target set for certain sectors like education and health, as outlined in table six of the 2025 National Budget Statement.\n\nTo quantify the funding shortfall, let us examine the construction sectors financing needs. If construction accounts for 2,8 percent of GDP this year as it did last year, and the economy is to reach its target growth rate of six percent, the required financing amounts to roughly 0,294 percent of GDP. Given total banking sector deposits of ZiG89,07 billion, the implied funding gap for construction only already stands at ZiG,44 billion under current conditions.\n\nAnd heres the kicker. Construction in 2025 is envisaged at above three percent of GDP (not 2,8 percent), which means the funding gap for this sector alone could be around ZiG6 billion. This deficit could delay flagship projects like the Harare-Masvingo-Beitbridge Road and/or the Lake Gwayi-Tshangani, unless alternative funding sources materialise.Yet banks, in part because of the tightened monetary policy, are sitting on almost half all deposits instead of extending loans to a thirsty economy.\n\nMoreover, the reliance on Non-Negotiable Certificates of Deposit (NNCDs) to mop up excess liquidity further complicates matters. NNCD issuance dropped sharply to ZiG123 million in September 2024, signalling successful liquidity management, but this has also left little room for discretionary lending.\n\nUsing the Money Multiplier Formula, Zimbabwes multiplier sits at just 3,33 compared to typical multipliers of 8 to10 in stable economies. In this case we have used the multiplier formula to measure the extent to which an initial change in reserve money translates into a larger change in broad money supply; in Zimbabwes context, a multiplier of 3,33 indicates that every unit of reserve money supports 3,33 units of broad money, reflecting the tight liquidity conditions and constrained credit creation due to high reserve requirements.\n\nThus, we have a situation where the RBZ tightens liquidity, while the government targets expenditure led growth, for instance expanding infrastructure spending as it allocated ZiG58,6 billion toward projects ranging from roads to energy systems. This allocation in the 2025 national budget represents 21,2 percent of all internal expenditures planned for this year and 2,1 percent of the total budget, highlighting a significant focus from the fiscal side on internally funded infrastructure development.\n\nHow will these priorities be met when monetary policy actively discourages lending?Then, as for the TFF, introduced to channel funds to priority sectors and offer some relief, it is a tacit admission by our finance leaders that intervention is needed. That it is funded through banks statutory reserves opens a whole other slew of legal and technical questions which we may need to find separate time and space to do justice to it.\n\nSuffice to say for now that another layer of complexity arises from commodity price fluctuations on the global market. Despite robust global gold prices, exports of other minerals like platinum group metals (PGMs) and lithium remain subdued. Export receipts grew marginally by 0.8 percent YoY, driven primarily by gold (16,7 percent) and tobacco (17,1 percent), while a decline in PGMs (-8,3 percent) and diamonds (-20,3 percent) reflects their current depressed international demand. Any further drop in mineral prices would exacerbate the current account balance, worsening Zimbabwes trade deficit and putting pressure on macroeconomic stability.\n\nAccording to simulations we made, a small decrease in export prices could lead to disproportionate declines in earnings, eroding forex inflows and increasing inflationary pressures because of the high pass through rate for our currency exchanges in the country (that is the sensitivity of local prices to exchange rate changes).\n\nThe fiscal framework for 2025 underscores these tensions. Total expenditures are pegged at ZiG276,4 billion, including recurrent costs of ZiG235,8 billion and capital outlays of ZiG40,6 billion. Recurrent spending dominates, accounting for nearly 85,7 percent of total expenditures, largely driven by compensation for employees (55,2 percent) and operational expenses (15,5 percent).\n\nSimply put, for every dollar the country earns, more than 55 cents funds civil servants salary needs and above 15 cents are for recurring overhead, leaving under 30 cents only for development, savings, debt servicing, investments etc.While prudent, this allocation leaves limited fiscal space for transformative investments as you can see. Then add to that environment an RBZ insisting on keeping a cap on local funding and a treasury likely to miss targeted fiscal deficits below 1.5 percent of GDP, aligning expenditures strictly with available revenues.\n\nIn the absence of external fresh funds or a record high jump in exports, something internally will have to give. Either slowing of construction, local payments thereof, or liquidity increases leading to inflation rising again. Dicey conundrum our authorities have to solve.\n\nEfforts to diversify the economy into manufacturing and services also face hurdles. Manufacturing output is projected to grow by 3,1 percent in 2025, supported by agricultural recovery and improved power supply. Capacity utilisation, currently at 52,1 percent, is expected to recover to a commendable 55 percent, yet this improvement depends heavily on access to affordable credit.\n\nHigh interest rates and restricted liquidity hinder manufacturers ability to invest in modern equipment or scale operations. Similarly, tourism, projected to grow by 4,3 percent, relies on infrastructure upgrades and marketing campaigns funded partly through external assistance. Will tightened monetary conditions deter private sector involvement in complementary areas like hospitality and entertainment?\n\nZimbabwe must strike a delicate balance between controlling inflation and promoting credit flow. Could gradual adjustments to reserve ratios, perhaps lowering them to 25 percent, unlock much-needed liquidity without compromising stability?As of February 2025, Zimbabwes reserve ratio stands at 30 percent, and lowering it to 25 percent would release approximately ZiG17,8 billion (equivalent to US$694 million) in additional liquidity into the economy. What will be left is ensuring that liquidity is not channelled to the parallel market if released.\n\nThe growth of gold reserves to approximately 2,7 tonnes as at January 2025 from the 1,5 tonnes recorded in April 2024 when the ZiG currency was introduced reflects a significant build-up in holdings in under a year!\n\nBe that as it may, these measures are at odds with the governments growth-oriented fiscal agenda, particularly regarding infrastructure and industrialisation. As Zimbabwe looks ahead to National Development Strategy 2 and Vision 2030, policymakers must reconcile these divergent paths.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/08/RBZ.jpg",
            "description": "Admire Dube, admire.m.dube80@gmail.com The Reserve Bank of Zimbabwe (RBZ) has been navigating a complex monetary landscape since the introduction of the Zimbabwe Gold (ZiG) in April 2024. While the central bank has made significant strides in stabilising prices and anchoring currency confidence, its approach raises critical questions about alignment with broader fiscal objectives. The government, […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        },
        {
            "title": "Economists praise monetary policy as inflation drops to 0,3 percent",
            "url": "https://www.chronicle.co.zw/economists-praise-monetary-policy-as-inflation-drops-to-03-percent/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nECONOMISTS have commended the tight monetary policy stance for keeping inflationary pressures under check with the interventions yielding desired stability and price predictability.\n\nAccording to latest figures from the national statistics agency, ZimStat, the month-on-month inflation rate for February stands at 0,3 percent, shedding 11,3 percentage points from the January rate of 11,6 percent.\n\nThis means that prices as measured by the all items weighted consumer price index (CPI), increased by an average of 0,3 percent from January 2025 to February 2025.\n\nThe month-on-month inflation rate is given by the percentage change in the price index of the reference month compared with the index of the previous month.\n\nCommenting, economist Mr George Nhepera said the exchange rate has remained stable since October last year when the local currency was devalued by about 45 percent.\n\nThe 0,3 percent month-to-month inflation reported for February 2025 by ZimStat could be a good economic sign to the monetary authorities that their tight liquidity policies are beginning to bear fruit on the economy, said Mr Nhepera.This explains why the exchange rate has remained relatively stable over the past six months since its sudden devaluation in October last year by more than 45 percent.\n\nWe are a nation, which for a long time has been associated with high levels of inflation, affecting our business and individual confidence.\n\nTo now begin to report such low levels of inflation should indeed be commendable. This no doubt could begin to set our country on a good economic trajectory.\n\nThe Reserve Bank of Zimbabwe (RBZ) devalued the Zimbabwe Gold (ZWG) by 42,55 percent against the US dollar in October last year, following weeks of rising black-market rates and market pressure.\n\nPrior to the adjustment, the currency traded between ZWG13 and 14 per US dollar.The devaluation followed RBZs efforts to stabilise the currency. In September 2024, the central bank injected US$64 million into the interbank market in a bid to curb further depreciation.\n\nMeanwhile, ZimStat has said the food poverty line (FPL) for one person in February 2025 was ZWG 868,16.This means that the minimum needs basket cost that much per person in February 2025.\n\nThe food poverty line represents the amount of money that an individual requires to afford a daily minimum energy intake of 2 100 calories.\n\nThe total consumption poverty line (TCPL) for one person was ZWG1 263,86 in February 2025, said ZimStat.This means that an individual required that much to purchase both non-food and food items as of February 2025 in order not to be deemed poor. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/02/Reserve-Bank-of-Zimbabwe-RBZ.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com ECONOMISTS have commended the tight monetary policy stance for keeping inflationary pressures under check with the interventions yielding desired stability and price predictability. According to latest figures from the national statistics agency, ZimStat, the month-on-month inflation rate for February stands at 0,3 percent, shedding 11,3 percentage points from the January rate of […]",
            "time": "06:39",
            "date": "28 Feb 2025"
        }
    ]
}