{
    "news": [
        {
            "title": "Bab to host refresher course",
            "url": "https://www.chronicle.co.zw/bab-to-host-refresher-course/",
            "content": "Innocent Kurira[emailprotected]THE Bulawayo Athletics Board (Bab) will host a Coaches and Technical Officials refresher course on January 25 at White City Stadium.According to Bab chairperson Watson Madanyika, the one-day program aims to ensure coaches and officials are well-prepared for the upcoming season.The refresher course is crucial in equipping our coaches and technical officials with the latest knowledge and skills to excel in their roles, Madanyika said.The course fee is US $15 per participant, which includes lunch.National Athletics Association of Zimbabwe (Naaz) appointed lecturers will facilitate the programme.The refresher course is an opportunity for coaches and officials to upgrade their skills and knowledge, ensuring they are geared for a successful season.-@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/rhyky.jpg",
            "description": "Innocent Kurira innocent.kurira@chronicle.co.zw THE Bulawayo Athletics Board (Bab) will host a Coaches and Technical Officials refresher course on January 25 at White City Stadium. According to Bab chairperson Watson Madanyika, the one-day program aims to ensure coaches and officials are well-prepared for the upcoming season. “The refresher course is crucial in equipping our coaches and […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Women vendors urged to familiarise with legal frameworks",
            "url": "https://www.chronicle.co.zw/women-vendors-urged-to-familiarise-with-legal-frameworks/",
            "content": "Nokuthaba Brita Ncube[emailprotected]VENDORS have been encouraged to understand the legal frameworks governing their trade in Zimbabwe to better protect their rights and ensure compliance with local by-laws.Vendors play a critical role in urban economies worldwide, providing easy access to goods and services. For many women vendors, their businesses are the primary source of income for their households, enabling them to feed their families and pay school fees for their children.In a recent post on X (formerly Twitter), the Womens Academy for Leadership and Political Excellence (WALPE) highlighted the importance of legal awareness among women vendors.\n\nThe organisation said understanding relevant laws empowers vendors to advocate for improved market conditions and safeguards their livelihoods.Last month, WALPE conducted transformative feminist leadership training sessions for 150 women vendors in Hatcliffe, Mabvuku, and Epworth. The training focused on equipping women with knowledge, skills, and practices to enhance their leadership capabilities and economic activities.WALPE is dedicated to empowering women leaders through training and support for small income-generating projects. The academy also provides technical and practical training for women aspiring to run for public office, aiming to increase womens representation in politics and decision-making.Despite significant progress in promoting womens participation in politics, Zimbabwe still faces challenges in achieving gender parity. Women remain underrepresented at various levels of decision-making, particularly in ministerial and local government positions.WALPE noted that patriarchal societal stereotypes, systemic inequities, and male-dominated political parties continue to hinder womens political participation. However, the organization remains committed to addressing these barriers by equipping women with the tools they need to succeed.As Zimbabwe strives for greater gender equality, initiatives like WALPEs programmes play a vital role in empowering women to take on leadership roles and contribute to the nations socio-economic and political development.Ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/vendors.jpg",
            "description": "Nokuthaba Brita Ncube ncubenokuthababrita@gmail.com VENDORS have been encouraged to understand the legal frameworks governing their trade in Zimbabwe to better protect their rights and ensure compliance with local by-laws. Vendors play a critical role in urban economies worldwide, providing easy access to goods and services. For many women vendors, their businesses are the primary source […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Master Zhoe closes year with four singles",
            "url": "https://www.chronicle.co.zw/master-zhoe-closes-year-with-four-singles/",
            "content": "Mthabisi Tshuma[emailprotected]\n\nVersatile musician Master Zhoe has ended the year on a high note with the release of four singles, which are slowly gaining momentum in the mining town of Gwanda.\n\nThe projects are part of an album that he is set to drop sometime next year, where he plans to elevate his game with a string of international collaborations.\n\nIn the past year, Master Zhoe has been in the spotlight for collaborating with artists from various genres, including the South African legendary kwaito act Professor and revered Zimbabwean musician Nicholas Zacharia, also known as Madzibaba.\n\nMaster Zhoes latest tracks include Chimhandara, which was produced by multi-award-winning Oskid, Ndiye, and two songs, Lashonilanga and Sasha, both of which feature Just Percy.\n\nMaster Zhoe said the release of the tracks within a few days of each other was a way of ensuring his fans had something to dance to during this festive season.\n\nWe have many projects that we worked on this year, as we anticipated releasing an album. Due to some unforeseen circumstances, we couldnt, but we are preparing for next year. We thought it would be good to release these tracks for this year to keep our followers entertained.\n\nAll the tracks have dropped with visuals, and they have been warmly welcomed by people in clubs in Gwanda, Mopane, Ntepe, just to mention a few, said Master Zhoe.\n\n@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/1q2e4.jpg",
            "description": "Mthabisi Tshuma revmmthiretshuma@gmail.com Versatile musician Master Zhoe has ended the year on a high note with the release of four singles, which are slowly gaining momentum in the mining town of Gwanda. The projects are part of an album that he is set to drop sometime next year, where he plans to elevate his game […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Billiat joins Scottland",
            "url": "https://www.chronicle.co.zw/billiat-joins-scottland/",
            "content": "Innocent Kurira, Online ReporterKHAMA Billiat has officially joined Scottland FC from Yadah Stars.According to recent reports, Billiats contract with Yadah Stars ended on December 31.Prior to this, Billiat had a successful stint with Yadah Stars, finishing as the second runner-up on the Soccer Stars Calendar.Billiats popularity in South Africa remains strong, thanks to his impressive career with Chiefs, Mamelodi Sundowns, and Ajax Cape Town, where he scored a combined 97 goals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/w4fr.jpg",
            "description": "Innocent Kurira, Online Reporter KHAMA Billiat has officially joined Scottland FC from Yadah Stars. According to recent reports, Billiat’s contract with Yadah Stars ended on December 31. Prior to this, Billiat had a successful stint with Yadah Stars, finishing as the second runner-up on the Soccer Stars Calendar. Billiat’s popularity in South Africa remains strong, […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Crackdown on Illegal gaming activities in Beitbridge",
            "url": "https://www.chronicle.co.zw/crackdown-on-illegal-gaming-activities-in-beitbridge/",
            "content": "Thupeyo Muleya[emailprotected]AUTHORITIES in Beitbridge District have launched a crackdown on illegal gaming activities, targeting unlicensed gambling devices that have proliferated in the border town.\n\nThe operation, led by the Lotteries and Gaming Board with support from the police, aims to curb the growing concern over these activities, particularly their impact on children.The initiative follows complaints from residents of Beitbridge town about unlicensed gambling machines in high-density suburbs, which are reportedly attracting children under the age of 18.\n\nSecretary of the Lotteries and Gaming Board, Dr Misheck Chingozha, confirmed that the operation began on December 31 and will continue indefinitely.He said the campaign targets both rural and urban business centres where illegal gaming devices have been installed.We cannot fold our hands while people break the law willy-nilly, said Dr Chingozha.\n\nChief Superintendent Melusi Ncube, the police officer commanding Beitbridge District, said there is significant progress since the launch of the crackdown.So far, we have recovered 75 illegal gaming devices from Lutumba and Beitbridge urban areas. We are not relenting and wont condone excessive gambling activities that are harmful to society, especially children, he said.\n\nWe have arrested 16 offenders, who will be dealt with according to the laws of the land. Our team, along with enforcement officers from the Lotteries and Gaming Board, is firm on the ground and will continue until we restore sanity in our policing area.Chief Supt Ncube said the operation is expected to intensify in the coming weeks as authorities work to dismantle illegal gaming networks and protect vulnerable groups, particularly children, from the negative effects of gambling.\n\nResidents of Beitbridge have expressed frustration over the issue, describing it as a serious challenge for parents. In separate interviews, community members condemned individuals for exposing children to gambling at an early age, warning of the long-term social consequences.This is not just a matter of law enforcement; its about protecting our children and their future, said one concerned parent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tyj-1.jpg",
            "description": "Thupeyo Muleya thupeyo.muleya@zimpapers.co.zw AUTHORITIES in Beitbridge District have launched a crackdown on illegal gaming activities, targeting unlicensed gambling devices that have proliferated in the border town. The operation, led by the Lotteries and Gaming Board with support from the police, aims to curb the growing concern over these activities, particularly their impact on children. The […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Mr Bones claims victory over Insimbi Zezhwane in epic Song of the Year showdown",
            "url": "https://www.chronicle.co.zw/mr-bones-claims-victory-over-insimbi-zezhwane-in-epic-song-of-the-year-showdown/",
            "content": "Mkhululi Ncube,[emailprotected]\n\nMXOLISI Mr Bones Ndlovu narrowly defeated Insimbi Zezhwane in the battle for the Song of the Year in one of the most intense voting contests run by Rhumba News Zimbabwe.\n\nThe two bands went head-to-head in a nail-biting voting system, with Mr Bones, Insimbi Zezhwane, and their fans campaigning vigorously to secure the coveted title. The standout tracks were Mr Boness winning song Bangihlangabeze nge case (popularly known as Faka Two) and Insimbi Zezhwanes Ingqinamba, which finished in second place.\n\nMr Bones garnered 50,956 votes, while Insimbi Zezhwane received 50,255 votes when WhatsApp voting closed. Other bands in the top ten trailed significantly, confirming that these two groups are the most beloved in the rhumba arena.\n\nHowever, it is unfortunate for bands like Amathonga Amahle and Mlambos Express Band, who also had strong albums in 2024 but struggled due to having fewer fans to support them. The votes received by Mr Bones and Insimbi Zezhwane far outnumbered those received in voting conducted by local radio stations.\n\nOn local stations like Khulumani FM and Skies Metro FM, Insimbi Zezhwane dominated, taking first place, but the votes they received were minimal compared to the competition run by Rhumba News Zimbabwe. For example, Insimbi Zezhwane secured first place on Khulumani FM with just 1,800 votes.\n\nThe voting patterns sparked debate and even led to some negativity that should not be allowed to fester in the music scene. As the campaign heated up, it became a Tsholotsho versus Plumtree rivalry, reflecting the origins of the two bands.\n\nIt is also disheartening that some social media influencers contributed to this negative atmosphere to promote their favourites. While there is no harm in supporting local bands, true music fans must rise above geographical biases and maturely recognise a good song, even if it is not from their locally cherished band.\n\nThose in charge of such competitions should consider how to refine the voting process for Song of the Year awards to ensure that the most deserving winners are recognised.\n\nWith the voting concluded, it is clear that the rivalry reminiscent of the Macheso versus Tongai Moyo Sungura debate, or the Messi versus Ronaldo comparison in football, has now emerged in rhumba music. The leaders of the two bands, Mr Bones and Meluleki Brema Moyo, along with their management, must take the lead in calming tensions among their fans.\n\nThis rivalry can be beneficial for the growth of music, as both bands will strive to outdo each other in the studio, ultimately benefiting fans and the music scene. However, if left unchecked, such competitions may lead to negative consequences.\n\nPerhaps Mr Bones encapsulated this sentiment maturely in his Facebook post after being declared the winner: To my fellow musicians abafowethu, let us continue working together and put rhumba music on the world map. To Insimbi Zezhwane, the game was good, brothers; it means we just did not have the ground to play on to make people happy, he said.\n\n@themkhust\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fhbd.jpg",
            "description": "Mkhululi Ncube, themkhust@gmail.com MXOLISI “Mr Bones” Ndlovu narrowly defeated Insimbi Zezhwane in the battle for the Song of the Year in one of the most intense voting contests run by Rhumba News Zimbabwe. The two bands went head-to-head in a nail-biting voting system, with Mr Bones, Insimbi Zezhwane, and their fans campaigning vigorously to secure […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Two arrested in Bulawayo over New Year’s Eve and New Year’s Day stabbings",
            "url": "https://www.chronicle.co.zw/two-arrested-in-bulawayo-over-new-years-eve-and-new-years-day-stabbings/",
            "content": "Sikhumbuzo Moyo,[emailprotected]BULAWAYO police have arrested two suspects in connection with separate cases of attempted murder and murder that occurred on New Years Eve and New Years Day.Kwaziyena Moyo (27) was arrested on New Years Day after allegedly stabbing his drinking mate during a dispute on Tuesday.According to acting Bulawayo police spokesperson, Assistant Inspector Nomalanga Msebele, the victim, a 30-year-old man from Pumula South, was drinking beer at Moyos residence when a misunderstanding ensued.She said the complainant slapped the suspect twice in the face during the argument. In retaliation, the suspect produced an okapi knife and stabbed the complainant three times on the right side of the chest, causing serious injuries.The victim collapsed at the scene, and onlookers called an ambulance, which transported him to Mpilo Central Hospital, where he is currently admitted.A report was made to the police on January 1, 2024, around 12:30 PM, leading to the arrest of the suspect, said Asst Insp Msebele.In a separate incident on New Years Day, Thembelani Mlotshwa (29) of Old Pumula was arrested for fatally stabbing Khulekani Mjaho following a dispute over beer at Pumula Old Beer Garden.Asst Insp Msebele said the altercation began when the now-deceased struck Mlotshwa on the head with an empty beer bottle.She said in retaliation, the suspect withdrew a knife from his pocket and stabbed the now-deceased multiple times in the stomach, causing severe injuries, including protruding intestines.Police attended the scene, and the victim, who was unable to speak, was rushed to Mpilo Central Hospital. He succumbed to his injuries at around 11am. A post-mortem is pending.\n\nAssistant Inspector Msebele expressed concern over the rise in murder and attempted murder cases stemming from disputes during beer-drinking sessions.She urged members of the public to avoid engaging in arguments while under the influence of alcohol including carrying weapons to beer gardens.She also called on liquor outlet operators to enhance security measures and conduct thorough searches of patrons.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2012/06/jailed.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw BULAWAYO police have arrested two suspects in connection with separate cases of attempted murder and murder that occurred on New Year’s Eve and New Year’s Day. Kwaziyena Moyo (27) was arrested on New Year’s Day after allegedly stabbing his drinking mate during a dispute on Tuesday. According to acting Bulawayo police spokesperson, […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Woman arrested for killing husband following domestic feud",
            "url": "https://www.chronicle.co.zw/woman-arrested-for-killing-husband-following-domestic-feud/",
            "content": "Sikhumbuzo Moyo[emailprotected]A DOMESTIC dispute in Pumula Old suburb, Bulawayo, turned tragic after a woman allegedly struck her husband on the head with a stone, leading to his death three days later.Gugulethu Sibanda (33) was arrested by police for the murder of her husband, Master Khabo (46), following the altercation on December 29, 2024.Acting Bulawayo police spokesperson, Assistant Inspector Nomalanga Msebele, said the incident began when Khabo left home to buy cigarettes at the Pumula Old shopping area. Sibanda followed him and reportedly saw him talking to a female friend. This encounter sparked a heated argument between the couple.Amid the misunderstanding, the suspect struck the now-deceased once on the back of the head with a stone, causing a swollen injury.Khabo reported the assault to the police and was taken to Mpilo Hospital by ambulance, where he was treated and discharged the same day.However, his condition worsened over the following days.On 31 December 2024 at around 11 am, the investigating officer went to their place of residence to arrest the suspect and found Khabos condition had deteriorated significantly. He was barely able to speak, said Asst Insp Msebele.An ambulance was called, and Khabo was rushed back to Mpilo Central Hospital, where he was admitted to the Intensive Care Unit. Sadly, he passed away on January 1, 2025, at around 12.45pm.Asst Insp Msebele urged the public to resolve conflicts peacefully to prevent such tragedies.We appeal to members of the public to address their differences amicably to avoid unnecessary loss of life, she said.Asst Insp Msebele said police investigations into the matter are ongoing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw A DOMESTIC dispute in Pumula Old suburb, Bulawayo, turned tragic after a woman allegedly struck her husband on the head with a stone, leading to his death three days later. Gugulethu Sibanda (33) was arrested by police for the murder of her husband, Master Khabo (46), following the altercation on December 29, […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "Sai Mart Takes Over Choppies Zimbabwe Operations",
            "url": "https://www.chronicle.co.zw/sai-mart-takes-over-choppies-zimbabwe-operations/",
            "content": "Online Writer\n\nNANAVAC (PTY) LTD, trading as Choppies Zimbabwe, has officially announced the transfer of its operations to Sai Mart, effective 1 January.\n\nSai Mart, owned by Industry and Commerce Deputy Minister Raj Modi, has been operating six branches in Bulawayo and will now take over Choppies operations across the country.\n\nIn a statement, Choppies assured stakeholders that the transition would be seamless, with no job losses for employees.\n\nThis serves to notify you that the Choppies business in Zimbabwe has been sold to Sai Mart. Kindly note that business operations will continue as normal, without any disturbances, read the notice.\n\nThe company also confirmed that all local staff, including management and general employees, have been retained under Sai Mart.\n\nOn behalf of Choppies Management and the board of directors we would like to take this opportunity to thank all our valued customers and stakeholders for their support, reads the notice, the statement added.\n\nChoppies had announced its intention to exit the Zimbabwean market in November last year, citing a strategic decision to focus on sustainable growth and profitability across its regional operations.\n\nThe Botswana-based retail giant first entered the Zimbabwean market in 2013 by acquiring several Spar outlets. It expanded further in 2014 by establishing a distribution centre to enhance its supply chain.\n\nHowever, in recent years, Choppies faced mounting challenges in adapting to Zimbabwes evolving retail landscape. A significant shift in consumer behavior saw more shoppers migrating to the informal retail sector, resulting in a 30 percent decline in foot traffic at formal retail outlets.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/11/choppies-680x360.jpg",
            "description": "Online Writer NANAVAC (PTY) LTD, trading as Choppies Zimbabwe, has officially announced the transfer of its operations to Sai Mart, effective 1 January. Sai Mart, owned by Industry and Commerce Deputy Minister Raj Modi, has been operating six branches in Bulawayo and will now take over Choppies’ operations across the country. In a statement, Choppies […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        },
        {
            "title": "President leads Zimbabwe into New Year with a call to action",
            "url": "https://www.chronicle.co.zw/president-leads-zimbabwe-into-new-year-with-a-call-to-action/",
            "content": "Blessings Chidakwa, Harare Bureau\n\nALL Zimbabweans should focus their energy towards driving the national vision, goals and aspirations in the New Year that begins today, President Mnangagwa has said.\n\nThe President has always remained committed to creating an enabling environment for all hard-working Zimbabweans to continue excelling in their different fields.In his address at the National Thanksgiving and Dedication Service in Bulawayo on December 29, President Mnangagwa said every Zimbabwean should play a part in building the nation.\n\nIn the year ahead (this year), unflinching focus on our national vision, goals and aspirations, coupled with hard honest work; production and productivity; should see us live up to the instruction given to us in Genesis Chapter 1 verse 28, he said.\n\nIt is our responsibility and duty to be fruitful and to subdue the earth. We remain anchored on our national philosophy, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ Ilizwe, lakhiwa, libuswe likhulekelwe ngabanikazi balo.\n\nPresident Mnangagwa said through the theme of this years National Thanksgiving and Dedication Service, the Church in Zimbabwe is rallying the nation to progressive, Godly and Biblical patriotism.\n\nIndeed, the land, Zimbabwe, which the Lord has given us, is an exceedingly good land. We are thankful to the Almighty God.\n\nFurther, development initiatives and programmes for the upliftment and prosperity of our people, have become the solid foundation upon which we are building our country brick by brick and stone upon stone, he said.\n\nThe President said the people of Zimbabwe are their own liberators and using their indigenous resources, skills and talents, they will uplift the nation while others are welcome to assist them.\n\nIn the agriculture sector, as a Government and a people, we are not folding our arms and surrendering to the vagaries of climate change. Numerous dams are being built and boreholes sunk to mitigate the impact of climate change.\n\nIn relation to the current uneven rainfall patterns, Let us ask for rain from the Lord, for it is the Almighty God who makes storm clouds and gives showers of rain to everyone (Zachariah Chapter 10 verse 1), he said.\n\nPresident Mnangagwa said the nation also thanks the Almighty God for the rapid modernisation and expansion of the infrastructure and increased inflows of economic investments, diaspora remittances, which are having transformational impacts on economic growth.\n\nIn his address to the last Cabinet meeting of 2024, President Mnangagwa said Zimbabwe had achieved many milestones in various areas such as infrastructure development, stabilising the local currency and developing the mining, agricultural and manufacturing sectors.\n\nIt is expected that more achievements would be recorded this year as the country moves towards attaining Vision 2030 of an empowered upper middle income society.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/76u7i7i-680x380.jpg",
            "description": "Blessings Chidakwa, Harare Bureau ALL Zimbabweans should focus their energy towards driving the national vision, goals and aspirations in the New Year that begins today, President Mnangagwa has said. The President has always remained committed to creating an enabling environment for all hard-working Zimbabweans to continue excelling in their different fields. In his address at […]",
            "time": "18:30",
            "date": "02 Jan 2025"
        }
    ]
}