{
    "news": [
        {
            "title": "“Look for another venue for your show” – Bulawayo Shutdown told",
            "url": "https://www.chronicle.co.zw/look-for-another-venue-for-your-show-bulawayo-shutdown-told/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWE Cricket (ZC) have distanced themselves from the Bulawayo Shutdown musical show that is set to take place at Queens Sports Club on April 26, a venue that will be hosting four Test matches soon.\n\nZC said, as custodians of the venue, they have not sanctioned any concert at the venue.\n\nZC wishes to categorically state that it has not granted the organisers of the said event any consent to hold a concert at Queens Sports Club, venue of our upcoming Test series. Any claims suggesting otherwise are misleading and should be disregarded.\n\nAs the custodians of the venue, ZCs priority remains the game of cricket, and we will not permit the concert or any other non-cricketing event to take place at Queens Sports Club, read the statement.\n\nThe statement further read: ZC therefore strongly warns the show organisers to desist from misleading the public with false advertisements. Furthermore, ZC is taking legal action against those responsible for this misrepresentation.\n\nZimbabwe will host South Africa and New Zealand for two Tests.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Byoshutdown.jpg",
            "description": "Zimpapers Sports Hub ZIMBABWE Cricket (ZC) have distanced themselves from the Bulawayo Shutdown musical show that is set to take place at Queens Sports Club on April 26, a venue that will be hosting four Test matches soon. ZC said, as custodians of the venue, they have not sanctioned any concert at the venue. “ZC […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mzansi rallies around veteran actress Nandi Nyembe amid financial woes",
            "url": "https://www.chronicle.co.zw/mzansi-rallies-around-veteran-actress-nandi-nyembe-amid-financial-woes/",
            "content": "The South African entertainment industry has come together to support veteran actress Nandi Nyembe, who has fallen on hard times.\n\nThe 55-year-old actress, who is wheelchair-bound, recently opened up about her hardships in a heart-wrenching video shared by Masingita Masunga of the Above Normal Foundation.\n\nIn the video, Nandi revealed that despite her decades-long career, she has been facing significant financial difficulties, particularly after her son fell ill and she spent R88,000 on his medical treatment.\n\nFrom the money Ive worked for, my son got sick. I dont have money. How are you going to get a medical aid when you dont have money? I tried to get a company thats a bit cheaper. What are you going to pay it with every month?\n\nThe video sparked an outpouring of support from the public, celebrities and government officials.\n\nSport, arts and culture minister Gayton McKenzie promised money from his personal account in her support.\n\nI heard the bad news, things are not going well. Im in Cape Town. This is from me from my heart. This is not from the ministry. I will come see you in two weeks. I will send you something that will keep you until I see you. When I come I will fix everything else, he said.\n\nSource: TshisaLIVE\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/TshisaLIVE.jpg",
            "description": "The South African entertainment industry has come together to support veteran actress Nandi Nyembe, who has fallen on hard times. The 55-year-old actress, who is wheelchair-bound, recently opened up about her hardships in a heart-wrenching video shared by Masingita Masunga of the Above Normal Foundation. In the video, Nandi revealed that despite her decades-long career, […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "Watch: Late Insiza North Legislator Cde Farai Taruvinga remembered for transformative leadership",
            "url": "https://www.chronicle.co.zw/watch-late-insiza-north-legislator-cde-farai-taruvinga-remembered-for-transformative-leadership/",
            "content": "Nqobile Bhebhe,Zimpapers News Hub\n\nThe late ZANU PF Insiza North legislator, Cde Farai Fimbo Taruvinga, has been hailed as a hardworking and people-oriented leader who spearheaded life-changing developments in Matabeleland South.\n\nSpeaking to Zimpapers News Hub at a memorial service in Bulawayo on Thursday afternoon, Matabeleland South Provincial Political Commissar, Cde Washington Nkomo, expressed deep sorrow over the passing of Cde Taruvinga, stating that he will be greatly missed.\n\nCde Taruvinga passed away on Monday morning at his home in Bulawayo after a long battle with cancer. He was 53.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/The-late-Cde-Farai-“Fimbo”-Taruvinga.jpg",
            "description": "Nqobile Bhebhe,Zimpapers News Hub The late ZANU PF Insiza North legislator, Cde Farai “Fimbo” Taruvinga, has been hailed as a hardworking and people-oriented leader who spearheaded life-changing developments in Matabeleland South. Speaking to Zimpapers News Hub at a memorial service in Bulawayo on Thursday afternoon, Matabeleland South Provincial Political Commissar, Cde Washington Nkomo, expressed deep […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "Late ZANU PF Legislator Cde Farai Taruvinga honoured with luxury motorcade at Bulawayo memorial",
            "url": "https://www.chronicle.co.zw/late-zanu-pf-legislator-cde-farai-taruvinga-honoured-with-luxury-motorcade-at-bulawayo-memorial/",
            "content": "Nqobile Bhebhe, Senior Reporter\n\nTop of the range vehicles are parked at a Bulawayo funeral parlor this Thursday afternoon for the memorial service of the late ZANU PF Insiza North legislator, Cde Farai Fimbo Taruvinga.\n\nMost of the vehicles bore inscriptions reading RIP Boss Fimbo.\n\nCde Taruvinga passed away on Monday morning at his home in Bulawayo after a long battle with cancer.\n\nHe was 53.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-03-at-15.09.18-680x380.jpeg",
            "description": "Nqobile Bhebhe, Senior Reporter Top of the range vehicles are parked at a Bulawayo funeral parlor this Thursday afternoon for the memorial service of the late ZANU PF Insiza North legislator, Cde Farai “Fimbo” Taruvinga. Most of the vehicles bore inscriptions reading “RIP Boss Fimbo.” Cde Taruvinga passed away on Monday morning at his home […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "GMB announces approved 2025 summer producer prices, winter wheat planting incentive",
            "url": "https://www.chronicle.co.zw/gmb-announces-approved-2025-summer-producer-prices-winter-wheat-planting-incentive/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nThe Grain Marketing Board (GMB) has announced the approved 2025 summer producer prices and the winter wheat planting incentive for farmers.\n\nThe parastatal said it appreciates the role of farmers and all stakeholders in pursuit of agricultural transformation towards national food security and economic growth.\n\nGMB Chief Executive Officer Dr Edson Badarai on Thursday said GMB will primarily purchase produce from farmers financed under the Presidential Input Programme (PIP) and irrigation schemes.\n\nThe producer price for maize and traditional grains has been set at US$376.48 per metric tonne.\n\nSoya beans and sunflower are pegged at US$580 and US$668.98 per metric tonne, respectively.\n\nFor winter wheat, the planting incentive has been set at US$451.35 per metric tonne.\n\nThese prices are consistent with achieving both food security and macroeconomic stability, said Dr Badarai.\n\nGMB will primarily purchase produce from farmers financed under the Presidential Input Programme (PIP) and irrigation schemes.\n\nContractors are expected to buy back contracted produce at market prices. Furthermore, GMB, working with ZMX, shall provide commercial warehouse receipt services to all players.\n\nGMB appreciates the role of farmers and all stakeholders in pursuit of agricultural transformation towards national food security and economic growth.\n\nThe Government has earmarked 120 000 hectares of winter wheat this year, marking a historic milestone in the countrys crop production records, as it moves to boost food security and slash the imports bill.\n\nThis ambitious plan is expected to produce 600 000 tonnes of the cereal, well above last years output of 562 591 tonnes and surpassing the minimum national requirement of 360 000 tonnes needed for self-sufficiency.\n\nThe 2025 winter plan aims to consolidate the gains from the Governments 2024 Wheat-Based Food Security initiative.\n\nLast season 119 954ha of wheat were planted and yielded 562 591 tonnes while barley was on 6 697ha and produced 36 120 tonnes.\n\nPotatoes were on 8 657ha and produced 233 739 tonne.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/02/Dr-Edson-Badarai.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter The Grain Marketing Board (GMB) has announced the approved 2025 summer producer prices and the winter wheat planting incentive for farmers. The parastatal said it appreciates the role of farmers and all stakeholders in pursuit of agricultural transformation towards national food security and economic growth. GMB Chief Executive Officer Dr Edson […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "BMA streamlines operations to boost SA border efficiencies",
            "url": "https://www.chronicle.co.zw/bma-streamlines-operations-to-boost-sa-border-efficiencies/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe creation of Border Management Authority (BMA) has helped streamline operations and boost efficiencies at South Africas ports of entry (PoE) among them the busiest Beitbridge Border Post which links the neighbouring country with at least seven Sadc countries including Zimbabwe.\n\nThe Authority was established in 2020 (Act No2 of 2020) as a national public entity to create a single authority to effect border law enforcement with a single command and control.\n\nPrior to the latest development there were multiple Government agencies implementing various rules and regulations, reporting to different bosses which resulted in delays in the movement of cargo and travellers.\n\nHowever, the coming in of the BMA has helped address the previously trade and travel deficiencies at port like Beitbridge which handles around seven million travellers yearly and an excess of 1500 commercial trucks daily.\n\nBMA Commissioner and the Chief Executive Officer, Dr Michael Masiapato said in the implementation of about 20 pieces of legislation in the border environment, the Authority has to effectively interface with various government departments and entities.\n\nHe made the remarks in Pretoria during the Colloquium on Migration and Border Security on Tuesday.\n\nDr Masiapato said since its establishment in April 2023, the BMA made significant strides in strengthening border management systems.\n\nBesides the administrative successes relating to the establishment of the new organisation (staff integration, development of organisational policies, setting up governance structures), there are operational successes that are worth mentioning, he said.\n\nWe have been able to successfully run Easter 2023, Dec 23/Jan 24, Easter 2024, Dec 24/Jan 25) and now getting ready to run the 2025 Easter festive period in next few weeks)In addition we ably handled the movement of heads of States and government technocrats from all over the world & high number of Journalists for BRIC Summit in August 2023- and at the moment we are getting ready to run the G20 Summit in November 2025.\n\nDuring the period under review apprehended or arrested over 468 000 individuals who were attempting to enter the country illegally since 1st April 2023 (undocumented, undesirables, or inadmissible).\n\nWe also arrested 2 344 of wanted criminals (of this number 893 linked to other crimes and 1451 linked to the contraventions of immigration related laws).\n\nHe said they had confiscated a lot or prohibited cargo passing through its land, air and sea post and intercepted 332 stolen vehicles hijacked in South Africa while being transported to several countries through different border posts.\n\nDr Masiapato said the colloquium was convened to reflect on the BMAs works in its 24 months of existence (two years) with the intention to generate new proposals on how to improve and escalate our efforts in the mist of constrained fiscus and complicated geopolitical and regional dynamics.\n\nAt the same time, this colloquium, he said, was taking place in a year when South Africa will be hosting the G20 summit towards the end of this calendar year in November 2025.\n\nThis will be the first G20 summit held in the African continent and in South Africa in particular. There will be at the time a lot of travellers who will have to be processed through our ports of entry, he said.\n\nDiscussions on migration and border security that will unfold today will, without doubt, prepare us to deal with the influx of such a high volume of travellers. As we gather here today, we are reminded of the complexities and challenges of managing borders in the 21st century.\n\nThe world is becoming increasingly interconnected, and the movement of people, goods, and services across borders is on the rise. This presents both opportunities and challenges for the BMA and for our stakeholders.\n\nHe said the BMA primarily exists to secure South Africas borders and concurrently facilitate legitimate movement of people and goods in all ports of entry and border law enforcement areas.\n\nHe said he organisation was working in collaboration with Government departments including; Home Affairs, Agriculture, Forestry, Fisheries and the Environment, South African Police Service (SAPS), the South African National Defence Force (SANDF), and the South African Revenue Service (SARS).\n\nContrary to what some people consider to be the functions of the BMA, Dr Masiapato said their function is not just about stamping passports at the ports of entry, but they play a crucial role in facilitating the smooth movement of people, goods, and services across borders while ensuring the safety and security of the country.\n\nSome of the key functions include managing environmental, port health, agriculture, immigration and general border law enforcement related issues, he said.\n\nWe have also screened millions of travellers who destined for South Africa in the last 24 months for infectious and communicable diseases (those we picked up with diseases have been referred to medical facilities for further medical attention) and have also confiscated a lot of undesirable Agricultural products and got them destroyed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/bvncvndtybv.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The creation of Border Management Authority (BMA) has helped streamline operations and boost efficiencies at South Africa’s ports of entry (PoE) among them the busiest Beitbridge Border Post which links the neighbouring country with at least seven Sadc countries including Zimbabwe. The Authority was established in 2020 (Act No2 of 2020) […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "ZIFA challenges local designers to create new warriors kit and logo",
            "url": "https://www.chronicle.co.zw/zifa-challenges-local-designers-to-create-new-warriors-kit-and-logo/",
            "content": "Online Reporter\n\nZIFA has invited local designers to create the next Warriors kit and logo in a competition running for six weeks. The winner will receive US$3,000, see their design become the official ZIFA brand, and enjoy other prizes.\n\nZIFA president Nqobile Magwizi announced the initiative during a press conference in Harare on Thursday. The challenge, titled Warrior Pride Brand Design Battle, has a submission deadline of May 15.\n\nIn a social media post, ZIFA stated: We are looking for the boldest and most innovative brand designs for our national teams.\n\nThe winning designer will also receive an all-expenses-paid trip to watch the Warriors first match at AFCON 2026.\n\nCompetition Details\n\nEach submission must include:\n\n A brand name and logo/icon.\n\n A description of the designs inspiration.\n\n Application of the brand on merchandise, including the following kits:\n\n Home Kit: Primary colour  yellow.\n\n Away Kit: Primary colour  green.\n\n Alternative Kit:** Primary colour  white.\n\nNote: Designs must incorporate colours from the Zimbabwean flag.\n\n Digital designs only, submitted as high-resolution images (PDF format).\n\n Email entries to:[emailprotected]\n\n Creativity, adherence to guidelines, visual appeal, and incorporation of national symbols.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Warriors-challenge.jpg",
            "description": "Online Reporter  ZIFA has invited local designers to create the next Warriors kit and logo in a competition running for six weeks. The winner will receive US$3,000, see their design become the official ZIFA brand, and enjoy other prizes.   ZIFA president Nqobile Magwizi announced the initiative during a press conference in Harare on Thursday. The […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "Two Zimbabweans, One South Africa jailed for rhino poaching",
            "url": "https://www.chronicle.co.zw/two-zimbabwans-one-south-africa-jailed-for-rhino-poaching/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTwo Zimbabwean men and their South African associate have each been jailed five years after they were arrested while hunting for a rhino in Limpopo province.\n\nThe trio was busted by alert security officials who recovered a firearm, ammunition, and one knife in the Steilloop area in March last year.\n\nLimpopo police spokesperson said Lt Col Stephen Thakeng said Kholwani Mwembe (40), (Zimbabwean), Emmanuel Marombedze (36), (Zimbabwean) and Stephen Tshoeu (49), (South African), pleaded guilty in the Mahwelereng Regional Court to charges of conspiracy to commit rhino poaching, unlawful possession of a firearm, and unlawful possession of ammunition.\n\nThey were sentenced as follows ; Count 1: Conspiracy to commit a crime of rhino poaching : 5 years imprisonment or a fine of R5,000, Count 2: Possession of a firearm without a license : 4 years imprisonment or a fine of R4,000 and Count 3: Possession of ammunition without a permit : 2 years imprisonment or a fine of R2,000. The sentences will run concurrently with Count 1, said Lt Col Thakeng.\n\nHe said on March 22, 2024, at approximately 23:00, members of the Limpopo Provincial Stock Theft and Endangered Species Unit (STES), in collaboration with private security personnel and SANParks officials, conducted a Section 252A operation targeting suspected rhino poachers in the Steilloop area under the Gilead policing jurisdiction in the Waterberg District.\n\nDuring the operation, he said, a suspicious vehicle was identified and stopped.\n\nSubsequently, Mwembe, Marombedze and Tshoeu were arrested, leading to the recovery of one .308 caliber firearm, reported stolen in Alldays in May 2023, seven .308 rounds of ammunition, one knife and one silencer. A Honda Jazz, bearing Gauteng registration, was also confiscated.\n\nOn 3 February 2025, the three accusedKholwani Mwembe (40), a Zimbabwean national; Emmanuel Marombedze (36), a Zimbabwean national; and Stephen Tshoeu (49), a South African citizen, pleaded guilty in the Mahwelereng Regional Court to charges of conspiracy to commit rhino poaching, unlawful possession of a firearm, and unlawful possession of ammunition. They were convicted and sent to prison on March 31, said Lt Col Thakeng.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Rhino-680x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Two Zimbabwean men and their South African associate have each been jailed five years after they were arrested while hunting for a rhino in Limpopo province. The trio was busted by alert security officials who recovered a firearm, ammunition, and one knife in the Steilloop area in March last year. Limpopo […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "Gastronomy Tourism and Inclusivity key to economic development: Minister Rwodzi",
            "url": "https://www.chronicle.co.zw/gastronomy-tourism-and-inclusivity-key-to-economic-development-minister-rwodzi/",
            "content": "Sikhulekelani Moyo\n\nTHE Minister of Tourism and Hospitality, Barbara Rwodzi, has expressed her enthusiasm for the First Lady, Amai Dr Auxillia Mnangagwas contributions to Zimbabwes tourism sector.\n\nThe Minister was speaking at the Bulawayo 2025 Provincial cookout competition. The Cookout Competition is a key event in Zimbabwes culinary landscape, showcases traditional Zimbabwean cuisine, with participants vying for a position in the national finals, and is a concept introduced by First Lady Dr Auxillia Mnangagwa.\n\nMinister Rwodzi, Minister Jidith Ncube and other Government officials touring the tables at the Bulawayo 2025 Provincial Cookout competition\n\nMinister Rwodzi noted the First Ladys vision for promoting traditional cuisine, stating, If visitors come, we have to serve them our traditional cuisine.\n\nShe highlighted the importance of using local fruits and vegetables in food production, aligning with the First Ladys aim to showcase Zimbabwes rich culinary heritage.\n\nHighlighting the economic potential of gastronomy, Minister Rwodzi compared it to the US hair and nail industry, which generates approximately US$2 billion, much of which comes from African customers.\n\nContestants at the Bulawayo 2025 Provincial Cook Out Competition\n\nWe have to be confident in our food, our culture, and ourselves, she urged.\n\nThis year, the Ministry is also focusing on inclusivity by incorporating individuals with disabilities into its tourism initiatives.\n\nMinister Rwodzi emphasised that, under President Mnangagwas leadership, the government is committed to leaving no one behind, as illustrated by the devolution strategy launched in 2018.\n\nThe Minister discussed the long-term goals of the Cookout competition, which aims to enable everyone skilled in cooking to earn a living by 2030.\n\nWe want those living with disabilities to employ others and become company owners through this initiative, she affirmed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-03-at-11.58.10_06d963f3-680x380.jpg",
            "description": "Sikhulekelani Moyo THE Minister of Tourism and Hospitality, Barbara Rwodzi, has expressed her enthusiasm for the First Lady, Amai Dr Auxillia Mnangagwa’s contributions to Zimbabwe’s tourism sector. The Minister was speaking at the Bulawayo 2025 Provincial cookout competition. The Cookout Competition is a key event in Zimbabwe’s culinary landscape, showcases traditional Zimbabwean cuisine, with participants […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        },
        {
            "title": "Chief Mphini named in Bulilima land dispute saga",
            "url": "https://www.chronicle.co.zw/chief-mphini-named-in-bulilima-land-dispute-saga/",
            "content": "Sikhumbuzo Moyo\n\nVILLAGERS in Bulilima districts ward 21, Matabeleland South have accused Chief Mphini of illegally selling their grazing land to various individuals who have since started building houses and shops.\n\nIn a letter to the District Development Coordinator, Mr Onesimo Zvogara and copied to the Bulilima Rural District Council chairperson, Councillor Lands Ndebele, the villagers said the area has been their grazing land for the past 74 years.\n\nLast month, Mr Zvogara held a meeting with the villagers over the matter and it was agreed that the council will look into it as a matter of urgency.\n\nWe, the villagers of ward 21 would like to appreciate your response to our request to meet the above office on the volatile grazing land issue. The meeting really went on very well and exposed to all of us that Chief Mphini sold our grazing land we had jealously kept for more than 74 years. Now that it has been sold by an individual because of the love for money and personal gains, we are very angry and cross, reads the letter by villagers.\n\nThey said the matter must be pursued to their satisfaction and raised concern that officials seemed to be taking a lackadaisical approach while those allocated land were continuing with construction instead of being stopped.\n\nMr Ndebele promised to come back to us as soon as possible with the results or an outcome. It is now taking too long while the illegal settlers are still busy fast-tracking development, the delays in giving feedback is seen as an advantage given to them directly or indirectly. In this view we are requesting the promised feedback and a system that monitors that the illegal settlers stop building as was agreed on the above dated meeting, wrote the villagers.\n\nChief Mphini is on record denying that it was him who sold the land, claiming that it was the village heads.\n\nThis is an old story, something which was done by village heads. In any event, the area which people are complaining about was no longer used for pastures as the livestock are grazing at a nearby farm, Sibantubanye, said Chief Mphini.\n\nHe also claimed that Bulilima Rural District Council had targeted the same land for development as it was closer to their sub-office in the area.\n\nHowever, Bulilima RDC acting chief executive officer Mr Billiat Mlauzi, said the council is not involved in the allocation of land under dispute.\n\nAs council we are not involved, infact we are disappointed that the piece of land has been allocated to some villagers because it was part of our long-term plan as we expand but on this particular matter, we are no way near the allocation of the stands, said Mr Mlauzi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-10-at-10.43.18.jpeg",
            "description": "Sikhumbuzo Moyo VILLAGERS in Bulilima district’s ward 21, Matabeleland South have accused Chief Mphini of illegally selling their grazing land to various individuals who have since started building houses and shops. In a letter to the District Development Coordinator, Mr Onesimo Zvogara and copied to the Bulilima Rural District Council chairperson, Councillor Lands Ndebele, the […]",
            "time": "18:32",
            "date": "03 Apr 2025"
        }
    ]
}