{
    "news": [
        {
            "title": "President arrives for Youth indaba . . . to headline Inaugural Competitiveness Summit today",
            "url": "https://www.chronicle.co.zw/president-arrives-for-youth-indaba-to-headline-inaugural-competitiveness-summit-today/",
            "content": "Sikhumbuzo Moyo,[emailprotected]President Mnangagwa is set to arrive in Bulawayo this morning to begin a busy two-day schedule, culminating in the National Youth Day Commemorations at the Zimbabwe International Exhibition Centre (ZIEC) tomorrow.\n\nToday, President Mnangagwa will attend the inaugural National Competitiveness Commission (NCC) Competitiveness Summit that started yesterday and will deliver the keynote address.\n\nBefore this, the President is set to conduct a tour and commission the new Edgars Stores-owned Carousel Clothing Manufacturing Plant equipment before proceeding to the summit venue.\n\nTomorrow he will interact with thousands of youths from across the country in commemorations that will be held in halls three and four.\n\nThe Competitiveness Summit provides a high-level engagement between key economic stakeholders and President Mnangagwas presentation is set to set the tone for solution-based resolutions towards creating a fair level-playing field where business operations across sectors are integrated to drive mutual economic gains.\n\nThe platform facilitates a dynamic convergence of public and private sectors, development partners, academia, and other non-state actors to engage in dialogue and develop sustainable reforms and resolutions aimed at enhancing productivity and competitiveness, according to the NCC.\n\nSpeaking ahead of todays Summit official opening, Industry and Commerce Minister Nqobizitha Mangaliso Ndlovu said industry players must heed President Mnangagwas call to remove all trade barriers and instilling a sense of competitiveness in driving Zimbabwes economic growth. He hopes the Summit deliberations will contribute to strong, actionable outcomes that propel the economy forward.\n\nMinister Nqobizitha Mangaliso Ndlovu\n\nThe outcomes will assist in crafting sound policies to drive Zimbabwes growth. I look forward to robust discussions so that, as policymakers, we can emerge from this platform empowered and clear on what needs to be done, said Minister Ndlovu.\n\nThe President has given us instructions  we have no choice but to follow that.Minister of Women Affairs, Community, Small and Medium Enterprises Development, Monica Mutsvangwa, also underscored the need to address the cost of doing business saying the current rates are stifling growth in the sector.\n\nTomorrow, thousands of enthusiastic youths are set to descend on halls three and four for the Youth Day annual commemorations that will run under the theme: Empower Youth, Secure the Future.\n\nHall Three will specifically be for exhibitions where youths from various tertiary institutions will showcase their innovative brilliance while the main celebrations are slated for Hall Four.\n\nVarious tertiary institutions were busy setting up their stands yesterday. In Hall Four, technicians were working on the sound system to ensure when the day comes, everything runs smoothly without any hindrance.\n\nThe commemorations were initially set for Barbourfields Stadium but had to be moved to the ZIEC due to the unpredictable weather conditions, more so after the Meteorological Services Department (MSD) warned of heavy rains exceeding 70 millimetres within 24 hours between yesterday and today in the Matabeleland region and Midlands Province.\n\nHigher and Tertiary Education, Innovation, Science and Technology Development Permanent Secretary, Professor Fanuel Tagwira has said universities and colleges are now churning out graduates with knowledge and skills to compete in the 21st century.\n\nProf Fanuel Tagwira\n\nHe said through Heritage Education 5.0, universities and polytechnic colleges provide students with a solid foundation in their chosen field, equipping them with theoretical knowledge, practical skills, and an entrepreneurial mindset.\n\nThe introduction of innovation hubs at institutions of higher learning has been prioritised to promote critical thinking, analysis, and problem-solving, thereby helping youths and students develop essential life skills.\n\nMeanwhile, as the country prepares for the long weekend in celebration of National Youth Day, the Government has issued a stern warning to transport operators, associations, motorists, and the public regarding road traffic violations.\n\nIn a statement yesterday, the Minister of Transport and Infrastructural Development, Felix Mhona emphasised the importance of road safety, reminding all stakeholders that violations of traffic rules and regulations will not be tolerated.\n\nMr Felix Mhona\n\nHe said the ministry has pledged to take stringent action against those found disregarding the law, including suspending and cancelling licences for transport operators who violate terms, conditions, and road traffic laws.\n\nAs we approach this long weekends National Youth Day, I wish to remind and warn all transport operators, associations, motorists, and members of the public that the ministry will take stern measures provided by our laws against those who wantonly and blatantly violate road traffic rules and regulations, said Mhona.\n\nThe safety and security of all commuting public cannot be taken for granted. We will not hesitate to suspend and cancel licenses of operators who violate terms and conditions of such licences, traffic rules, and regulations.\n\nThe minister also called on all law enforcement agencies to be vigilant during the holiday period to ensure that road traffic laws are enforced and that the safety of all road users is upheld.\n\nWe urge all road traffic law enforcement agencies to be on high alert to enforce the road traffic laws and ensure the safety and security of all road users, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ERYRFGDFGLG.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw President Mnangagwa is set to arrive in Bulawayo this morning to begin a busy two-day schedule, culminating in the National Youth Day Commemorations at the Zimbabwe International Exhibition Centre (ZIEC) tomorrow. Today, President Mnangagwa will attend the inaugural National Competitiveness Commission (NCC) Competitiveness Summit that started yesterday and will deliver the keynote […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "President arrives for Youth indaba . . . warns against internet use to fan divisions",
            "url": "https://www.chronicle.co.zw/president-arrives-for-youth-indaba-warns-against-internet-use-to-fan-divisions/",
            "content": "Blessings Chidakwa, Harare BureauPresident Mnangagwa has announced the nationwide rollout of a Presidential Internet Scheme, emphasising the importance of leveraging new technologies to promote social cohesion, unity, peace, love, and harmony.\n\nThe Presidential Internet Scheme that will reach even the most marginalised areas will result in basic social services such as schools, clinics, community centres and farmers benefiting from a digital society leading to increased productivity.\n\nPresident Mnangagwa, however, took a swipe at rogue elements with a propensity of fuelling divisions in society through abusing the internet saying they will be punished.\n\nSpeaking at the launch of the Digitruck and Digital Skills Ambassador Programme at State House, President Mnangagwa said these are transformative initiatives designed to leap forward the nation into digital excellence and inclusivity where every community is empowered to thrive in the global digital economy.\n\nHe urged the nation to embrace the National Digital Ambassadors project and other related programmes which have the potential to unlock opportunities for inclusion, e-governance, education, entrepreneurship and broad-based empowerment.\n\nTo bolster this effort, the Presidential Internet Programme will be launched and deploy technology such as Low Earth Orbit (LEO) satellite services across marginalised communities.\n\nThe e-enabling infrastructure will complement existing services to bring high-speed internet closer to villages, schools, clinics, and community centres, while empowering farmers and entrepreneurs, among other users, he said.\n\nPresident Mnangagwa called on traditional leaders as custodians of the rich national heritage, to rally communities to leverage the National Digital Ambassadors Programme and Presidential Internet Scheme to safeguard, preserve and promote the countrys culture, values and norms.\n\nCommunities across the country are called upon to use ICTs and related applications responsibly.\n\nThese new technologies must help foster social cohesion, unity, peace, love, and harmony, ultimately leading to a productive as well as connected digital society, he said.\n\nThose with the tendency of fuelling divisions among communities will be punished. I am pleased that the National Digital Ambassadors Programme has received significant support from our partners at Huawei. The generous donation and handover of a state-of-the-art mobile vehicle, the Digi-Truck, is welcome and commendable.\n\nPresident Mnangagwa said the Digitruck will play a pivotal role in enabling citizens to be digitally literate and access online services.\n\nThe vehicle will traverse our provinces, delivering ICT training to the most remote areas. Going into the future, our goal to deploy adequate Digi-Trucks in all provinces must be realised.\n\nThis will see the transformation of our national highways and rural road networks into pathways of knowledge and ensure that geography and distance never limit opportunity, he said.\n\nWe expect this programme to help bridge the rural-urban digital divide, to propel the growth of the economy, prosperity and a brighter future for all.\n\nTurning to the young Digital Ambassadors President Mnangagwa urged them to be patriotic and focused drivers of transformation as well as sustainable socio-economic development of Zimbabwe.\n\nOne hundred digital ambassadors will be deployed in each province to deliver strategic and inclusive digital literacy training across the country, especially in marginalised communities.\n\nThese tech savvy ambassadors will serve as accelerators for the uptake of digital literacy, fostering innovation, and supporting local businesses, schools, and households in harnessing technology for development, he said.\n\nPresident Mnangagwa said the National Digital Ambassadors Programme is being launched a few days before the commemoration of the National Youth Day in Bulawayo.\n\nIt is a flagship initiative designed to equip our vibrant youth and the general community with cutting-edge ICT skills and tools. Under this programme, many of our young Zimbabweans will be trained as resident ICT experts within their communities.\n\nIn keeping with the Devolution Agenda, the National Digital Ambassadors Programme will help ensure that digital skills are devolved to every corner of Zimbabwe, leaving no one and no place behind, he said.\n\nPresident Mnangagwa said the need for e-services in Government Ministries, Departments and Agencies has now become an urgent necessity.\n\nMy Government has embarked on programmes and projects to promote the delivery of quality digital services, with noticeable progress in sectors such as justice, vital civil registration and immigration.\n\nWhile more efforts are being made, I challenge all our people to have the requisite digital skills to interface with the e-Government services at various levels, he said.\n\nPresident Mnangagwa said the countrys National Vision 2030 and National Development Strategy 1 documents embed digitalisation and Information Communication Technology as enabling tools for the promotion of digital economy, development and overall growth.\n\nHe said to guarantee that these goals are met, his administration made deliberate decisions to front load ICT, science and technology skills access spreading beyond institutions of higher learning starting at the pre and primary-school levels.\n\nEmbrace this and other opportunities being facilitated by my Administration to become masters of your destinies as architects and implementers of our national development programmes.\n\nTo all stakeholders across various sectors of the economy, let us remain united and resilient, innovate relentlessly while upholding our pledge to leave no one and no place behind, he said.\n\nThe President expressed gratitude for the excellent relations and partnerships existing with the\n\nPeoples Republic of China and the United Arab Emirates which have partnered with Zimbabwe on noble initiatives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/cvxvxc.jpg",
            "description": "Blessings Chidakwa, Harare Bureau President Mnangagwa has announced the nationwide rollout of a Presidential Internet Scheme, emphasising the importance of leveraging new technologies to promote social cohesion, unity, peace, love, and harmony. The Presidential Internet Scheme that will reach even the most marginalised areas will result in basic social services such as schools, clinics, community […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "COMMENT: Let’s mould our youths to drive Zimbabwe’s transformation",
            "url": "https://www.chronicle.co.zw/comment-lets-mould-our-youths-to-drive-zimbabwes-transformation/",
            "content": "Zimbabwes National Youth Day, celebrated annually on February 21st, serves as a platform to recognise the contributions of young people to national development. The 2024 celebrations, hosted in Bulawayo, hold particular significance as the city is known for its rich history, cultural heritage, and economic potential.\n\nBy selecting Bulawayo as the host, the Government underscores its commitment to decentralisation and inclusivity, ensuring that national events are not solely concentrated in the capital, Harare.\n\nVision 2030, Zimbabwes long-term development blueprint, aims to transform the country into an upper-middle-income economy. Achieving this ambitious goal requires active participation from the youth, who constitute a significant portion of the population.\n\nTheir involvement in sectors such as entrepreneurship, education, and governance is crucial for sustainable growth. The hosting of the National Youth Day commemorations in Bulawayo tomorrow will bring together thousands of young people at the venue where President Mnangagwa will lead proceedings, but millions more will follow remotely as youths seek an insight into the future.\n\nThe event is expected to spotlight key youth empowerment programmes and investments ushered in by the Second Republic as part of its inclusive development agenda and give hope to young people who are the future of the country.\n\nThis years event will be held at the Zimbabwe International Exhibition Centre (ZIEC) under the theme: Empower Youth, Secure the Future.\n\nAs we report elsewhere in this issue, the Ministry of Youth Empowerment, Development and Vocational Training is formulating strategies for youth empowerment across the country, which will feed into the second phase of the National Development Strategy (NDS2).\n\nOn Monday, the ministry rolled out youth consultative meetings to capture views on strategies to be implemented for enhanced youth transformation. The consultative process will run up to March 3 and is being held in partnership with the United Nations and Silveira House.\n\nThe strategy will be anchored on seven pillars  economic empowerment, technology and digital innovation, education and training, health and well-being, governance, climate change and gender equality.\n\nThis development comes as Cabinet, on Tuesday, approved the Memoranda of Understanding (MoU) between the Republic of Zimbabwe, the Republic of Rwanda and the Republic of South Africa on Co-operation in the Field of Youth Affairs.\n\nThe areas of co-operation include life skills training and capacity development; entrepreneurship development; agriculture, agro-processing, and manufacturing; market development; technology development and transfer; skills development and re-integration programmes for youths in conflict with the law; tourism business development; health promotion programmes; and transformation and empowerment programmes.\n\nSome of the objectives of the cooperation include raising the standard of living for youths and disadvantaged communities, which will reduce poverty and promote the facilitation of life skills training and capacity building for youths for sustainable nation-building.\n\nThe youth play a fundamental role in Zimbabwes Vision 2030, as they represent both the present and future of the nation. Their contributions in various sectors will determine the success of the countrys transition to an upper-middle-income economy.\n\nOne of the primary ways young people can contribute is through entrepreneurship and innovation. With the rise of digital technology and the global move towards a knowledge-based economy, Zimbabwes youth have the opportunity to create start-ups, tech solutions, and small businesses that drive economic growth. Government initiatives such as the Youth Empowerment Bank provide financial support, but young entrepreneurs must also take the initiative to develop innovative business models that create employment and generate wealth.\n\nEducation and skills development are also crucial in achieving Vision 2030. The youth must embrace technical and vocational training, STEM (Science, Technology, Engineering, and Mathematics) education, and practical skills that match the demands of the modern economy. Universities and training institutions should align their curricula with national development goals, ensuring that graduates are equipped to contribute effectively to the economy.\n\nBeyond education and business, young people must engage in civic leadership and governance. Vision 2030 requires transparent, accountable, and forward-thinking leadership, and this begins with youth participation in policymaking, community development, and advocacy. By taking an active role in governance, young people can push for policies that promote job creation, social welfare, and sustainable development.\n\nFinally, addressing social challenges such as unemployment, drug abuse, and rural-urban inequality is vital. Youth-led initiatives in community development, environmental conservation, and social entrepreneurship can help tackle these issues.\n\nIf Zimbabwes youth embrace responsibility and take proactive steps, they will become the driving force behind the countrys transformation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2015/12/Youths.jpg",
            "description": "Zimbabwe’s National Youth Day, celebrated annually on February 21st, serves as a platform to recognise the contributions of young people to national development. The 2024 celebrations, hosted in Bulawayo, hold particular significance as the city is known for its rich history, cultural heritage, and economic potential.  By selecting Bulawayo as the host, the Government underscores […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "Three juvenile girls nabbed in police raid on drug dens",
            "url": "https://www.chronicle.co.zw/three-juvenile-girls-nabbed-in-police-raid-on-drug-dens/",
            "content": "Raymond Jaravaza and Amos Mpofu, Chronicle WritersSEPARATE raids by crack teams from the police Criminal Investigations Department (CID) and Vehicle Theft Squad (VTS) conducted in Bulawayos western suburbs and the city centre have led to the arrest of several suspects, including minors involved in dangerous drugs and substances.\n\nAmong those arrested for taking illicit substances and smoking dagga were a 12-year-old girl doing Grade Seven at a local primary school, a 14-year-old boy who is in Form Two and an 18-year-old female in Form Three.\n\nThe first raid was conducted in Entumbane and Njube suburbs on Tuesday while more suspects were nabbed in the city centre yesterday.\n\nA huge haul of Broncleer cough syrup  an over-the-counter cough medicine that is abused by drug users  marijuana and crystal meth were seized in the two raids by police at several houses in the western areas and streets in the city centre.\n\nAmong the arrested individuals is a security guard employed by a local security company and an Entumbane resident whose house was used to host drug initiation parties for school children as young as 12 years old.\n\nThe raid was a culmination of information supplied to police by members of the community and police intelligence leading to the arrest of the suspects as authorities continue to fight against drug peddling and use in the city.\n\nYesterday, police paraded the suspects together with the drugs at the Bulawayo Central Police Station. Bulawayo provincial acting police spokesperson, Assistant Inspector Nomalanga Msebele, said one of the suspects intimidated residents in Entumbane by claiming that he was untouchable and police could not arrest him.\n\nOne suspect, Elliot Ndlovu, aged 24, was telling residents of Entumbane that police feared him and would not do anything to him as he was untouchable.\n\nZRP would like to put it on record that there is no one above the law, said Asst Insp Msebele.\n\nCID Bulawayo went on to conduct a raid in Entumbane and Njube suburbs and arrested six suspects after they were found in possession of drugs ranging from crystal meth and dagga.\n\nOthers were also arrested for using drugs and illegal substances such as Broncleer cough syrup.\n\nThe operation moved to the central business district (CBD) yesterday where more suspects were nabbed for dealing and using drugs.\n\nToday (yesterday) in the CBD in streets near Pick and Pay Hyper, police arrested several suspects for peddling drugs. We would like to thank the public for continuing to supply the police with information that may lead to the arrest of individuals who deal in drugs, said Asst Insp Msebele.\n\nShe hailed Entumbane and Njube residents for taking a stand against drugs in their suburbs by reporting the illegal activities to the police.\n\nThe residents of Entumbane and Njube are saying no to drugs in their areas. Drug dealers have a tendency of intimidating community members and telling residents that they are above the law and as police we want to assure the public that information supplied to us will be acted upon in confidence, said Ass Insp Msebele.\n\nShe expressed concern that most drug peddlers in the city were aged between 19 and 25 years.Among the arrested suspects are Ashley Richardson (22) from Njube, Thomas Phiri (19) from Entumbabne, as well as Ronald Ncube (24) from Emganwini suburb.\n\nNtuntuko Masuku (20) of Entumbane, Michael Ncube aged 34, whose address is unknown, were also nabbed.\n\nOne of the suspects arrested is 36-year-old Nikita Mhlanga who was arrested for hosting vuzu parties selling drugs to school children as young as 12 years.\n\nWhen detectives raided Mhlangas home in Entumbane suburb on Tuesday they found schoolchildren, school dropouts and adults engaging in the illegal activities.\n\nAnother school dropout aged 17 from Entumbane and a 17-year-old in Form Three were also nabbed. The juveniles were released into the custody of their parents or guardians.\n\nThe drug dealer is expected in court on Thursday.\n\nMeanwhile, last Friday police arrested four suspected drug dealers in Entumbane after a tip-off from members of the public.\n\nInsp Msebele confirmed the arrest of Aubrey Muchenje, Sylvester Moyo, Elton Ndlovu and Owen Muchenje for possession of dangerous drugs.\n\nOn 14 February four suspects were arrested for dealing in drugs and the circumstances are that police received a tip-off from concerned residents that the individuals were selling drugs, she said.\n\nSearches were conducted resulting in Elton Ndlovu being found in possession of 40 bottles of 100ml Broncleer cough syrup and 1 kilogramme of dagga.\n\nAubrey Muchenje was found with one sachet of crystal meth and sachets while Sylvester Moyo was in possession of sachets of crystal meth and dagga. Owen Muchenje was found with crystal meth, she said.\n\nThe suspects are expected to appear in court.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/zxcassca.jpg",
            "description": "Raymond Jaravaza and Amos Mpofu, Chronicle Writers SEPARATE raids by crack teams from the police Criminal Investigations Department (CID) and Vehicle Theft Squad (VTS) conducted in Bulawayo’s western suburbs and the city centre have led to the arrest of several suspects, including minors involved in dangerous drugs and substances. Among those arrested for taking illicit […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "Nakamba’s Luton Town faces dreaded chop",
            "url": "https://www.chronicle.co.zw/nakambas-luton-town-faces-dreaded-chop/",
            "content": "Zimpapers Sports HubWARRIORS captain Marvelous Nakambas Luton Town are in great danger of being relegated from the English Championship.\n\nThe Hatters, who parted ways with former manager Rob Edwards last month as a result of the struggles, have had a below par campaign in the English second tier division after getting relegated from the Premier League last year.\n\nBy yesterday, Luton were anchoring the log standings with a paltry 27 points from 32 matches, having won just seven of those.\n\nBefore their game against fellow strugglers Plymouth Argyle at Kenilworth Road yesterday night, Luton Town had lost 19 of the 32 league games they had played in the Championship this season.\n\nLuton are the only English side to have suffered three consecutive relegations in the 21st century.\n\nThe Hatters finished in 23rd place during the 2005/2006 season and were relegated from the Championship.\n\nThey finished last in League One and League Two in the next two seasons and were relegated into the non-league conference.\n\nThey suffered a 10-point deduction for entering administration and then started the season on minus 30 points.\n\nTheir fall from grace right now appears like a page borrowed from that nightmare.\n\nNakamba started in their latest loss at the hands of Sheffield United but was pulled out as the Hatters searched for a goal.\n\nThe defeat against Sheffield United meant the Hatters have now gone four games without finding the net at Kenilworth Road, following on from matches against Norwich City, Preston North End and Millwall.\n\nHaving not scored since the last-gasp winner against Derby County on December 20, then that itself is a new record, beating the three fixtures that Town have done 11 times previously in their history, the last of those coming in the 2015-16 campaign, where they actually managed it twice.\n\nHowever, based on minutes, Luton are still not yet at their worst sequence, as back in that League One season, they went 378 minutes without being able to celebrate a goal in front of their own fans.\n\nDanny Green scored in the 66th minute during the 4-3 loss to Northampton, followed by blanks against a Wycombe side containing Bloomfield, Cambridge United, in then manager Nathan Jones first game in charge and Notts County.\n\nIt finally ended when Alan Sheehan thundered home a superb volley against Yeovil Town, who had taken the lead through now Luton midfielder Liam Walsh.\n\nThat is 18 minutes more than the 360 accumulated by Town in their current dry patch, although it should never have reached this stage, Luton Town had some excellent opportunities to end their dire run against the Blades on Saturday, particularly through Adebayo.\n\nThe forward, who hasnt scored in his last 12 appearances, since the 2-1 win over Stoke on December 10, has now missed 25 big chances this term.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Marvelous-Nakamba.jpg",
            "description": "Zimpapers Sports Hub WARRIORS captain Marvelous Nakamba’s Luton Town are in great danger of being relegated from the English Championship. The Hatters, who parted ways with former manager Rob Edwards last month as a result of the struggles, have had a below par campaign in the English second tier division after getting relegated from the […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "Young creatives geared up for National Youth Day celebrations",
            "url": "https://www.chronicle.co.zw/young-creatives-geared-up-for-national-youth-day-celebrations/",
            "content": "Showbiz Reporters\n\nYouthful arts practitioners and artistes are excited and ready to participate in the National Youth Day commemorations, which are set to take place in Bulawayo at the Zimbabwe International Exhibition Centre (ZIEC) tomorrow.\n\nPresident Mnangagwa will lead the proceedings, which are expected to attract thousands of youths from all corners of the country. This years theme is Empower Youth, Secure the Future.\n\nNational Youth Day, commemorated annually on February 21, coincides with the birthday of former President Robert Mugabe, offering a platform for young people to interact with the president and showcase their talents.\n\nThe excitement is palpable in the city, as young people are hopeful that the celebrations will open doors to new opportunities.\n\nMzoe7\n\nMusician Mzoe7, who is scheduled to perform, expressed his enthusiasm, saying, Ill definitely be performing on the day to motivate other young people. As the youth of Zimbabwe, were the future, but we dont have to wait for it  we should prepare for it now, be heard and helped now, so that we can secure our tomorrow.\n\nMzoe7 also shared his anticipation for the addresses at the celebrations. Im looking forward to listening to the leaders from various spaces who will equip us with the necessary knowledge and skills. This day isnt just about celebrating  its about an empowered youth leaving with valuable takeaways.\n\nRising musician Macala also spoke on the importance of National Youth Day, highlighting its historical significance.\n\nNational Youth Day is very important to me, and I regard it as one of the most crucial holidays that every youth should celebrate. It commemorates the role of youth in the struggle for independence and promotes unity and solidarity among young Zimbabweans as the future of the nation.\n\nZanele Moyo, Miss Teen of the Universe Zimbabwe Bulawayo provincial director, shared how the day amplifies her voice as a youth leader.\n\nNational Youth Day is incredibly significant for me, both as a youth and as a pageant director. It inspires me to continue advocating for the empowerment and development of my fellow youths. It also motivates me to elevate the voices and concerns of young people, ensuring their needs and aspirations are prioritised in the national development agenda.\n\nTrevor Mawaka, director of the Bulawayo Childrens Choir, expressed how the day resonates deeply with their musical mission.\n\nMzoe7\n\nAs a music director for the Bulawayo Childrens Choir, National Youth Day holds great meaning for us. It celebrates the vibrant energy, creativity, and potential of our young people. Through music, weve witnessed the transformative power of the arts in shaping the minds and hearts of the youth.\n\nOn this National Youth Day, Im reminded of the responsibility we bear as mentors to nurture and empower our young people. We must continue to create platforms for them to express themselves, share their stories, and drive positive change.\n\nAs we commemorate this special day, Im filled with optimism for what lies ahead. Lets continue fostering a culture of creativity, inclusivity, and empowerment, ensuring our young people can thrive and reach their full potential, Mawaka said.\n\nBulawayo Province Boys Dzamdara chairman-elect, Pardon Khaya Elihle Khanye, expressed that National Youth Day is a day of great significance.\n\nThe National Youth Day is one of the most special days in the country, and for me, as the newly elected chairman of Boys Dzamudara Bulawayo Province, it holds deep meaning. I have great love and respect for the youth of Zimbabwe being celebrated on this day. It fosters love and unity among everyone and we aim to ensure a peaceful and productive Youth Day celebration, he said.\n\nA number of celebrations have been lined up across the city in commemoration of the day.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gfb.jpg",
            "description": "Showbiz Reporters Youthful arts practitioners and artistes are excited and ready to participate in the National Youth Day commemorations, which are set to take place in Bulawayo at the Zimbabwe International Exhibition Centre (ZIEC) tomorrow. President Mnangagwa will lead the proceedings, which are expected to attract thousands of youths from all corners of the country. […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "Smuggling blitz: Zimra closes Mutize Flea Market",
            "url": "https://www.chronicle.co.zw/smuggling-blitz-zimra-closes-mutize-flea-market/",
            "content": "Nokuthaba Ncube and Michelle Musandinyoze,Business Writers\n\nTHE Zimbabwe Revenue Authority (Zimra) has locked up the popular Mutize and Sons Flea Market in Bulawayo as part of a nationwide blitz targeting smuggled goods and counterfeit products.\n\nThe flea market houses dozens of traders and is one of the busiest in the city centre, offering both wholesale and individual purchases from across the city and beyond.\n\nThis comes as Zimra has intensified its crackdown across the country, targeting smuggling syndicates and tax evasion practices to boost Government revenue for national development.\n\nThe retail outlet adjacent to Mutize, among others in recent weeks, has also been closed under the same operation.\n\nIn separate interviews, affected traders who were milling outside the closed outlet said this was a huge blow to their livelihoods as they now have to wait for Zimra officials to resolve the issue.\n\nI dont know what to do; I will just wait for Zimra officials to see what they say next. I am hoping for an immediate resolution to this unexpected shutdown, said one trader, who declined to be named.\n\nOthers expressed concern about losing customers and struggling to provide for their families due to the uncertainty of when they would be able to resume business.\n\nTraders said they had been instructed to write down all the products they had in stock and would later have to produce receipts for everything.\n\nOne trader, Ms Sisele Mathonsi, said the closure of the flea market on Monday was a wake-up call for them as traders.\n\nWe will have to try and adapt to the regulatory environment and find ways to operate within the law, she said.\n\nIn an interview, Bulawayo Chamber of SMEs programmes co-ordinator, Mr Nketa Mangoye Dlamini, said the move was intended to ensure all traders were included in the tax system.\n\nThe closure of Mutize Flea Market is a result of Zimras efforts to ensure all traders are tax-compliant, track imported goods, and monitor local purchases that are done without proper records, he said.\n\nMr Dlamini, however, said there was a need for dialogue between traders and Zimra, suggesting that giving at least three months notice would be ideal.\n\nAccording to Mr Dlamini, 90 percent of traders are not necessarily businesspeople but are in business by default because they need to survive.\n\nTherefore, we must turn them into proper businesses by educating them and working with local authorities to ensure they become compliant instead of resorting to smuggling goods, he said.\n\nBulawayo Vendors and Traders Association (BVTA) executive director, Mr Michael Ndiweni, said the flea market had been closed as part of the ongoing operation taskforce checking the origin of goods sold at Mutize.\n\nHe noted that the closure imposed by Zimra meant that traders would not be able to conduct business until they complied with regulatory requirements, which would, in turn, affect their income.\n\nMy advice is that maybe the taskforce should work on modalities with various SMEs associations to find better ways of implementing the operation so that people understand exactly what is going on, said Mr Ndiweni.\n\nI think the taskforce must engage associations or market owners and work out a mechanism that balances enforcement with protecting the livelihoods of those who are desperate, enabling them to earn a living while ensuring they comply with the law.\n\nBy working with MSMEs groups, Mr Ndiweni said they had tried to engage the authorities to be more lenient and allow people to come forward with declaration documents to clear their goods.\n\nWe are trying to be proactive, educating people on this operation and on how they can comply with the laws on bringing goods into the country. We are urging them to be cautious and to reduce reliance on runners, as they are often responsible for bringing goods through undesignated ports, he said.\n\nAs part of an intermediate long-term solution, Mr Ndiweni said they were launching initiatives to support some traders in producing locally made garments to reduce import dependency.\n\nWe have a project that we are currently running to support them with sewing machines, encouraging them to start producing garments locally. This will help them survive beyond relying on importing goods and facing challenges when bringing them into the country, he said.\n\nThe Government is intensifying efforts to combat the illegal movement of goods across borders, a critical component of a broader strategy to stabilise the economy and promote lawful trade practices.\n\nThe Ministry of Industry and Commerce is leading the operation, working with Zimra, the police, the Reserve Bank of Zimbabwe, and the Consumer Protection Commission.\n\nExperts say smuggled goods significantly harm the local manufacturing sector, employment, and public health, while also eroding revenue needed for national development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gdf.jpg",
            "description": "Nokuthaba Ncube and Michelle Musandinyoze, Business Writers  THE Zimbabwe Revenue Authority (Zimra) has locked up the popular Mutize and Sons Flea Market in Bulawayo as part of a nationwide blitz targeting smuggled goods and counterfeit products. The flea market houses dozens of traders and is one of the busiest in the city centre, offering both wholesale […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "Simba sign Manondo",
            "url": "https://www.chronicle.co.zw/simba-sign-manondo/",
            "content": "Fungai Muderere,[emailprotected]CASTLE Lager Premier Soccer League defending champions have permanently acquired the services of seasoned striker William Manondo from Caps United days before their Castle Challenge Cup match against Dynamos at Rufaro Stadium on Saturday.\n\nThe predatory player became one of the many signings by Simba Bhora ahead of the start of the 2025 season.\n\nBefore they engaged in their pre-season training in neighbouring South Africa, Simba Bhora had already snapped several stars that include Tonderai Mateyaunga, Carlos Mavhurume, Kelvin Gwao, Liberty Chakaroma, Trevor Mavhunga, Donald Mudadi and Never Tigere.\n\nTo the esteemed director, loyal fans and the entire Caps United FC Family, as I bid farewell to this incredible institution, Im filled with immense gratitude and joy. Caps United has been my home, my sanctuary and my catalyst for growth. To the fans, your love and support have been the wind beneath my wings.\n\nYour energy, enthusiasm and kindness have made every match a memorable experience. I extend my deepest appreciation to our club president Farai Jere and head coach Lloyd Chitembwe for believing in me and granting me the opportunity to spread my wings elsewhere. Your blessings mean the world to me. Thank you CAPS United Family, wrote Manondo on his Facebook wall.Simba Bhora head coach Joel Luphahla says his team will adopt a cautious approach when they face Dynamos in the Castle Challenge Cup final.\n\nThe match will serve as the season opener for the 2025 campaign.\n\nLuphahla recently took over the reins at the defending champions from Tonderai Ndiraya who is now with equally free-spending Scottland FC.\n\nSimba Bhora have lost several key players who were instrumental in their maiden championship title.\n\nAmong those who have departed are reigning Soccer Star of the Year Walter Musona and Soccer Star of the Year finalist Tymon Machope.\n\nThe Shamva-based side also saw midfielder Tichaona Chipunza and attacking midfielder Mtokhozisi Msebe pack their bags.\n\nTheir game against DeMbare is set to kick off at 2.30pm.\n\nMeanwhile, Simba Bhora are proving to be a sponsorship magnet in the Premiership after sealing yet another deal worth US$500 000 for the upcoming season from Surge Energy Drink.\n\nThe one-year marriage, which will see Simba Bhora carrying their new sponsors logo on the front of their shirts, would be stretched beyond the 2025 term if the partners see it fit to do so.\n\nSurge Energy Drink are coming in as a direct replacement of the Shamva clubs main sponsors for the 2024 season, Pacific Storm, who have now stepped aside.\n\nClub president Simba Ndoro said the new deal will help complement the sponsors who are already on board and will boost the team in their quest to defend the league title.\n\nThe financial injection will also go a long way in cushioning the Luphahla-coached team when they plunge into the Caf Champions League.\n\nI am very happy to see Surge Energy Drink coming on board to sponsor Simba Bhora. I am very humbled by this gesture and I am sure it will help us as a team in a long way. Look, we are an ambitious team fighting for the right to be counted. We have won the league and it needs to be defended. We failed to win the Chibuku Super Cup and we need to try and win it. We will be fighting to make an impact in Africa when we represent the country in the Caf Champions League, said Ndoro.\n\nLuphahla has hailed his ensemble for their flexibility and positivity ahead of their first game on Saturday.\n\nThis is a new team altogether, we have been working on a number of combinations and I am happy with the way these boys have gelled. I am particularly happy that we dont have individual stars here, said Luphahla. @Fungai Muderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/zcass.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw CASTLE Lager Premier Soccer League defending champions have permanently acquired the services of seasoned striker William Manondo from Caps United days before their Castle Challenge Cup match against Dynamos at Rufaro Stadium on Saturday. The predatory player became one of the many signings by Simba Bhora ahead of the start of the […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "Bulawayo Children’s Choir collaborates with music stars",
            "url": "https://www.chronicle.co.zw/bulawayo-childrens-choir-collaborates-with-music-stars/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nThe Bulawayo Childrens Choir, formed last year, is preparing to release its latest single, Igama Lakho (Its All in the Name), a soul-stirring track that explores the profound significance of names and identity.\n\nThis song promises to uplift and inspire, showcasing the choirs remarkable talent and creativity.\n\nIgama Lakho features an impressive line-up of local artistes, including Mzoe7, Thaluso the Poet, Butholezwe Ntini, Thandy Dhlana, and Novuyo Seagirl. Each artiste brings a unique style, creating a masterful blend of sounds that enriches the track.\n\nThandy Dhlana opens the song with her soulful, jazzy voice, setting an emotive tone. Following her, Mzoe7 adds his emphatic yet straightforward flair. Novuyo Seagirl captivates listeners with her classical, soulful vocals, while Butholezwe Ntini injects energy with his bouncy, kwaito-inspired delivery. The song culminates with Thaluso the Poets signature style, adding a dramatic finish.\n\nNovuyo Seagirl\n\nThe Bulawayo Childrens Choir enhances the overall sound with its lush, harmonious backing vocals, providing depth and richness to this unforgettable listening experience.\n\nThe combination of these diverse styles is sure to resonate with audiences of all ages.\n\nTrevor Mawaka, the creative director of the Bulawayo Childrens Choir, expressed his enthusiasm for the upcoming release:\n\nWere thrilled to present Igama Lakho, a song that celebrates the importance of names and identity. This track is a testament to the incredible talent and creativity of our young choir members and our featured artistes. We believe that music has the power to inspire and uplift, and we hope that Igama Lakho will do just that.\n\nThe Bulawayo Childrens Choir, comprising talented vocalists from Petra High School, Dominican Convent Primary School, Charleston Trust Primary School, and Hillside Primary School, has already made waves with its debut single, Banolila, released last year, and its heartfelt tribute, Bulawayo  The Place We Call Home.\n\nMawaka said the choir, which aims to nurture childrens artistic skills while steering them away from delinquent behaviours and youth vices, is not solely focused on vocal excellence. Instead, it serves as a vehicle for change, advocating for diverse social causes.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hgfn.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com The Bulawayo Children’s Choir, formed last year, is preparing to release its latest single, Igama Lakho (It’s All in the Name), a soul-stirring track that explores the profound significance of names and identity. This song promises to uplift and inspire, showcasing the choir’s remarkable talent and creativity. Igama Lakho features an impressive line-up […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        },
        {
            "title": "Youth lessons from the liberation struggle on Zimbabwe National Youth Day",
            "url": "https://www.chronicle.co.zw/youth-lessons-from-the-liberation-struggle-on-zimbabwe-national-youth-day/",
            "content": "Kennedy Mandaza,[emailprotected]\n\nAS Zimbabwe celebrates National Youth Day tomorrow in Bulawayo, it presents an important opportunity for young people to reflect on the enduring legacy of the countrys liberation struggle and the invaluable lessons youth can learn from the freedom fighters who paved the way for the nations independence.\n\nThe day, which traces its roots back to the 21st February Movement, which coincided with former president Cde Robert Mugabes birthday, serves as a reminder of the values of sacrifice, unity, and resilience that shaped the nation. The youth today can draw significant lessons from the struggle for independence, which are crucial as they take an active role in shaping Zimbabwes socio-economic future, particularly in alignment with Vision 2030.\n\nVision 2030, which aims to transform Zimbabwe into an upper-middle-income economy, hinges on harnessing the potential of its young population. With more than 60 percent of the population under the age of 25, the role of the youth is pivotal in realising this goal. However, to move forward, it is crucial that young people draw inspiration from the courage, resilience, and unwavering commitment exhibited by the liberation heroes.\n\nThe youths who participated in the liberation struggle were driven by an unwavering desire for freedom and justice. They demonstrated an unparalleled deep sense of patriotism, and willingness to sacrifice for the greater good. Their commitment to a cause larger than themselves and a better future, despite immense hardships, demonstrates the importance of selflessness and perseverance in overcoming adversity.\n\nThese qualities are just as essential in todays Zimbabwe, where the youth must channel their energy into addressing the economic and social challenges that the country faces. Todays youths are destroying their lives by indulging in drugs, alcohol and promiscuity. Instead, they can learn from the struggles heroes; the power of vision, an ability to look beyond the present hardships and work towards long-term solutions that benefit the entire nation.\n\nFrantz Fanon, the renowned post-colonial thinker, offers valuable insights into the role of the youth in post-independence societies. Fanon argues that the youth should not only be agents of change during the liberation struggle but must also assume responsibility in the construction of the post-colonial state. According to Fanon, the youths role does not end with the attainment of independence; rather, it extends into the continuous shaping of the nations social and economic fabric. This requires a deep sense of engagement with the nations development goals and an active pursuit of social justice, education, and economic progress.\n\nHonest, hard work and entrepreneurship should preoccupy the youths to complete the construction of the post-colonial state. They should shun corruption, being exploited by people in power for selfish ends, and all other ills that are antithesis to development.\n\nFrantz Fanon\n\nThe struggle for liberation was also a testament to unity. The youth of the liberation war came from diverse backgrounds, and regions, yet they stood united against a common enemy. This collective spirit is essential for todays youth, who must set aside divisions based on political, tribal, or regional differences and focus on shared goals. Vision 2030 cannot be achieved if the youth are fragmented; instead, they must work together, collaborating across various sectors to contribute to national development.\n\nMoreover, the liberation struggle taught the importance of resilience in the face of adversity. The challenges facing Zimbabwe today  ranging from unemployment to economic instability  are formidable, but they are not insurmountable. Todays youth must not be cry-babies in the face of these challenges. The youth of the liberation struggle demonstrated that perseverance and innovation are key to overcoming obstacles. By embodying these qualities, todays young people can help build a stronger, more prosperous nation.\n\nThe liberation movement instilled a sense of empowerment. Young freedom fighters recognised that they had the power to change the course of history. In the same vein, todays youth must recognise their role in shaping the future. The opportunities in agriculture, mining, technology, education, and entrepreneurship are boundless, and it is up to the youth to seize them with both hands. Zimbabwes future depends on a generation that believes in its potential and works relentlessly to unlock it.\n\nNational Youth Day is more than just a celebration of youth  it is a time to reflect on the lessons that can be drawn from the countrys history. The heroes of the liberation struggle teach us the importance of sacrifice, vision, and resilience, qualities that are just as important today as they were during the struggle for independence. As Zimbabwe pursues Vision 2030, the youth have a central role in shaping the nations future. By drawing inspiration from the liberation struggle and embracing their responsibilities as agents of change, the youth can contribute meaningfully to Zimbabwes socio-economic development, ensuring a brighter, more prosperous future for all.\n\nIn the words of one of the founding fathers of Zimbabwe, the late Cde Mugabe, The youths of Zimbabwe must embrace the responsibility of building their nation, for they are the future. The success of the struggle was not just for the present generation, but for the generations to come. It is your duty to take up the mantle and shape the destiny of Zimbabwe.\n\nIt is through the lessons of the past that Zimbabwes youth can truly realise their potential and shape the nations future.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/sxsq.jpg",
            "description": "Kennedy Mandaza, kennedy@mapesafoundation.org AS Zimbabwe celebrates National Youth Day tomorrow in Bulawayo, it presents an important opportunity for young people to reflect on the enduring legacy of the country’s liberation struggle and the invaluable lessons youth can learn from the freedom fighters who paved the way for the nation’s independence. The day, which traces its roots […]",
            "time": "06:09",
            "date": "20 Feb 2025"
        }
    ]
}