{
    "news": [
        {
            "title": "Royal Rumble at Roadblock: Cops beat up ZACC officials in mad scramble over ‘evidence’",
            "url": "https://www.chronicle.co.zw/royal-rumble-at-roadblock-cops-beat-up-zacc-officials-in-mad-scramble-over-evidence/",
            "content": "Raymond[emailprotected]\n\nTWO police officers stationed at Sakubva Police Station in Mutare have been arrested for allegedly assaulting officers from the Zimbabwe Anti-Corruption Commission (ZACC).\n\nSergeant Mduduzi Makina (39) and Constable Elliot Gava (42) allegedly obstructed justice by manhandling and injuring ZACC investigators who had arrested a police officer on allegations of bribery.\n\nCircumstances are that on 11 December, a ZACC team was investigating reports of bribery at a roadblock near Mutare Teachers College.\n\nDuring the operation, ZACC investigators seized the roadblock declaration book as evidence.\n\nIt is alleged that Sgt. Makina and Const. Gava manhandled ZACC officers and seized back the roadblock declaration book.\n\nThe two cops will appear at Mutare Magistrate Court on Tuesday (today).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/08/zrp.jpg",
            "description": "Raymond Jaravaza-raymondjaravaza@gmail.com TWO police officers stationed at Sakubva Police Station in Mutare have been arrested for allegedly assaulting officers from the Zimbabwe Anti-Corruption Commission (ZACC). Sergeant Mduduzi Makina (39) and Constable Elliot Gava (42) allegedly obstructed justice by manhandling and injuring ZACC investigators who had arrested a police officer on allegations of bribery. Circumstances are […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "WATCH: ‘ZPCS key to national security’",
            "url": "https://www.chronicle.co.zw/zpcs-key-to-national-security/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa urged the Zimbabwe Prisons and Correctional Service (ZPCS) to adopt and implement technology to improve their operations.\n\nHe said this during a passout parade of 1 620 recruits at the ZPCS Ntabazinduna Training School yesterday. The President said as critical components of the national security sector and development agenda, ZPCS must embrace digital technology to foster modernisation, industrialisation, and efficient service delivery to promote sustainable economic growth.\n\nPresident Mnangagwa reaffirmed the Governments dedication to supporting ZPCS in fulfilling its constitutional duty to rehabilitate inmates.\n\nThe appropriate use of technology in the correctional domain can significantly enhance security efficiency, management and rehabilitation efforts. In this regard, as correctional officers, there is a need to adopt new technologies and the smart prison concept in the discharge of your duties said President Mnangagwa.\n\nHe said modern data analysis techniques should be deployed in assessing the behaviours of inmates and risk levels.\n\nThese and other innovations should inform the design of robust intervention strategies that are tailored to individual needs and current trends. However, it is crucial to implement these technologies ethically so that they effectively contribute to the overall goals of rehabilitation and public safety, he said.\n\nThe Government is establishing a community information centre at the ZPCS Ntabazinduna Training School, which upon completion will be accessible to the local community.\n\nPresident Mnangagwa said the centre is also part of efforts to accelerate digital transformation for economic growth and innovation in line with the philosophy of leaving no one and no place behind.\n\nThe President commended the training school for its ongoing efforts to support Government programmes promoting economic empowerment, particularly through projects that enhance productivity and production.\n\nHe also acknowledged the schools commendable promotion of innovation and entrepreneurship, which reduces reliance on fiscal support.\n\nTo this end, ZPCS has adopted a commercial business model to increase revenue and achieve self-sufficiency in line with the National Development Strategy 1 (NDS1).\n\nThis approach aligns with the organisations smart prison concept, which recognises its business-oriented and correctional focus.\n\nZPCS has already begun implementing income-generating projects in correctional and rehabilitation facilities across the country. A key project is the Anju Prison Farm in Matabeleland North, designed to empower inmates with life skills.\n\nThe farm is one of 23 ZPCS farms producing food for inmates in various prisons nationwide. Its surplus produce is sold to generate income that supports day-to-day prison operations.\n\nAs ZPCS, you are part of the security services and a vital cog in the national development agenda. You must, therefore, be on high alert and acquit yourselves well in executing your constitutional mandate, said President Mnangagwa.\n\nLet us all live up to the national development philosophy of Nyika inovakwa, inotongwa, igonamatirwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/pza-680x380.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa urged the Zimbabwe Prisons and Correctional Service (ZPCS) to adopt and implement technology to improve their operations. He said this during a passout parade of 1 620 recruits at the ZPCS Ntabazinduna Training School yesterday. The President said as critical components of the national security sector and development agenda, ZPCS […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "President urges graduates to uphold integrity",
            "url": "https://www.chronicle.co.zw/president-urges-graduates-to-uphold-integrity/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa yesterday implored newly graduated officers from the Zimbabwe Prisons and Correctional Service (ZPCS) to uphold constitutionalism, professionalism, and discipline in their service to the nation.\n\nHe underlined the importance of avoiding any misconduct that could damage the reputation of the ZPCS, Government, or country.\n\nThe President delivered this message during a passout parade at ZPCS Ntabazinduna Training School in Umguza District, Matabeleland North, for 1 620 recruits.\n\nPresident Mnangagwa acknowledged the growing problem of drug and substance abuse, particularly among the youth, which has had a detrimental impact on the security sector.\n\nHe stressed the necessity of taking decisive action to combat this issue, as the country strives towards becoming an upper-middle-income economy by 2030.\n\nTo the graduands, I emphasise that being a member of the security services requires unwavering loyalty, discipline, and a strong commitment to serving the nation. I further, urge you to work wholeheartedly and diligently, while upholding constitutionalism and professionalism. Your integrity must remain untarnished by selfish interests, he said.\n\nPresident Mnangagwa said drugs and substance abuse threaten national security in various ways and hinder economic development, adding that anyone caught engaging in such unethical behaviour will face the full wrath of the law.\n\nAny form of indiscipline that could taint the reputation of the Service, Government and nation at large will not be tolerated, he said.\n\nAs new ambassadors of the ZPCS, I challenge you to adhere to high ethical standards and uprightness in your duties.The President commended the ZPCS for its proactive measures in combating drug abuse, including awareness campaigns involving officers, inmates, and communities.\n\nI call upon recruits to reject such illicit activities and take bold steps towards building a brighter Zimbabwe, he said.\n\nIn June, President Mnangagwa launched the Zimbabwe Multi-Sectoral Drug and Substance Abuse Plan (2024-2030), a comprehensive strategy to tackle the issue.\n\nThe plan includes seven pillars, focusing on supply and demand reduction, harm reduction, treatment and rehabilitation, psychosocial support, and community reintegration.\n\nThe graduating cohort included 1 107 males and 512 females from courses 154 and 155. Among them were recruits from the San community in Tsholotsho District, marking continued progress in integrating marginalised groups into national security services.\n\nThis follows the historic graduation of 20 San youths in June 2022, the first from their community to join the ZPCS. Before the Second Republics interventions, the San people faced significant challenges, including failure to access identity documents, limited access to education and exclusion from formal employment opportunities.\n\nPresident Mnangagwa urged the graduates to remain committed to lifelong learning and adapt to evolving trends in correctional management.\n\nTo the graduands, as you step into the service of our great motherland, Zimbabwe, carry with you the lessons and memories from your training. Do not just dream of the future, but become the architects of the future you want, he said.\n\nApproach your work with the courage and optimism to make a positive impact wherever you will be deployed. Remember, learning is a lifelong journey and your thirst for knowledge must never stop. Stay abreast of evolving trends in correctional management and continually sharpen your knowledge and skills.\n\nYesterdays pass-out parade was attended by several senior Government officials, service chiefs and relatives of the graduates.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ZPCS-passout112.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa yesterday implored newly graduated officers from the Zimbabwe Prisons and Correctional Service (ZPCS) to uphold constitutionalism, professionalism, and discipline in their service to the nation. He underlined the importance of avoiding any misconduct that could damage the reputation of the ZPCS, Government, or country. The President delivered this message during […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Government cracks down on smugglers",
            "url": "https://www.chronicle.co.zw/government-cracks-down-on-smugglers/",
            "content": "Peter Matika and Sikhululekile Moyo, Chronicle Writers\n\nTHE Government has rolled out a nationwide operation to clamp down on smuggling through cross-border buses, and businesses illegally trading in contraband, to protect local industries and consumer welfare.\n\nThe operation, which began last week, is targeting entertainment spots and liquor vendors who sell illicit liquor and engage in unethical business practices, with the impounding of vehicles and confiscation of goods, including foodstuffs and alcohol, already underway.\n\nIn Bulawayo, inspections were intensified, resulting in temporary closures of some businesses. The Ministry of Industry and Commerce is leading the multi-agency operation, with the Zimbabwe Revenue Authority (Zimra), the police, the Reserve Bank of Zimbabwe (RBZ) and the Consumer Protection Commission collaborating to eradicate rampant smuggling.\n\nBy undermining local industries, disrupting value chains and posing health and safety risks, officials say smuggling must be stopped.\n\nCompliance is essential, with all goods declared at entry ports, as Zimra has reinforced in a statement.\n\nFailure to declare goods can lead to significant legal and financial consequences, read the statement.\n\nAccording to the statement, travellers may be required to present proof of their customs declaration at roadblocks conducted by authorities, which is part of a post-clearance audit process designed to ensure adherence to customs regulations.\n\nZimra said penalties for non-declaration can include fines, seizure of goods and in serious cases, imprisonment.Speaking during discussions on the 2025 National Budget, Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, underlined the gravity of the issue.\n\nHe said non-declaration of goods constitutes a criminal offence in Zimbabwe, encompassing items purchased abroad, personal belongings, and goods intended for commercial purposes.\n\nThis national programme is targeting businesses engaging in practices such as using parallel market exchange rates and selling counterfeit, underweight, or unlabelled goods, Prof Ncube stated.\n\nHe said smuggling considerably hampers local production initiatives, disrupts value chains and creates an uneven playing field between locally produced and smuggled foreign products, ultimately undermining Government revenue collection mechanisms.\n\nProf Ncube said smuggling poses a substantial threat to public health and safety, particularly concerning food items, medicines and alcohol that bypass necessary health and safety controls.\n\nHe said as part of the crackdown, 24-hour roadblocks will be mounted along major highways leading into major cities, with multi-agency teams inspecting vehicles suspected of transporting smuggled goods.\n\nImpromptu inspections will also be carried out at retail outlets across the nation, requiring shop owners to provide documentation proving the legality of their stock, said Prof Ncube.\n\nHe said the operation would be intensified during the festive season when there is an increase in Zimbabweans returning home for Christmas from the diaspora, potentially increasing the volume of smuggled goods into the country.\n\nGovernments comprehensive approach aims to address the pervasive business malpractices that negatively impact consumer welfare and the overall economic landscape, said Prof Ncube.\n\nHe urged compliance from business operators and travellers, saying adherence to customs regulations is critical for the health of the economy and the protection of consumers.\n\nConfederation of Zimbabwe Retailers (CZR) president, Dr Denford Mutashu, commended the operation, describing it as a necessary measure to protect consumers and local businesses.\n\nWe are working with security services to make sure that sanity prevails. These smuggled goods are harmful to consumer health, he said.\n\nAs an association, we warn businesses that smuggling is an offence, they have to abide by the law. Any businesses found on the wrong side of the law must face the consequences.\n\nDr Mutashu said smuggled goods such as electronics, detergents and foodstuff, among others, are negatively affecting the local industries.\n\nI must warn businesses that this operation is ongoing and it is not going to end anytime. This operation has managed to reach the whole country and we are happy with the progress so far, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Proffessor-Mthuli-Ncube.jpg",
            "description": "Peter Matika and Sikhululekile Moyo, Chronicle Writers THE Government has rolled out a nationwide operation to clamp down on smuggling through cross-border buses, and businesses illegally trading in contraband, to protect local industries and consumer welfare. The operation, which began last week, is targeting entertainment spots and liquor vendors who sell illicit liquor and engage […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "COMMENT: Let’s protect ourselves and our loved ones against impending Cyclone Chido",
            "url": "https://www.chronicle.co.zw/comment-lets-protect-ourselves-and-our-loved-ones-against-impending-cyclone-chido/",
            "content": "WITH Cyclone Chido bearing down on Zimbabwe, it is important that people take necessary measures to protect themselves and their loved ones.\n\nCyclones and other natural disasters can cause severe damage and loss of life, even in countries with advanced infrastructure, therefore, we need to prepare ourselves effectively for its impact, expected on Thursday.\n\nFirst of all, it is crucial that you keep yourself updated with the latest weather warnings from the Meteorological Services Department. This will enable you to be aware of the severity of Cyclone Chido and take the necessary precautions.\n\nCyclone Chido made landfall in the Mozambican Channel on Sunday after its devastation in Madagascar, Comoros and Malawi.\n\nAlthough it is expected to have weakened when it gets to Zimbabwe, we urge people to take precautions. Pedestrians should avoid any non-essential outdoor activities during the cyclone. They should stay safe and not venture out into the storm, even if it appears calm. Flying debris and sudden gusts of winds are major hazards in a cyclone, which may cause severe injury or even death.\n\nLikewise, motorists should be cautious while driving on the roads during the storm. The best course of action would be to stay off the roads entirely unless it is an emergency. However, if you have to drive, minimise your speed as the roads will be wet and slippery and visibility will be limited. Additionally, you should keep a safe distance from other vehicles and avoid low-lying areas and flooded roads. Avoid parking under trees as they could fall on your vehicle after being uprooted by strong winds.\n\nIt is also important to have adequate food and water supplies and store them in a safe place before the cyclone lands. Planning for emergency supplies in advance will help you avoid panic buying during the storm.\n\nIf you are caught out in the open during the cyclone, you should immediately seek shelter in a safe place. The best thing is to stay indoors until the weather dissipates.\n\nIt is vital to take necessary precautions before, during and after the cyclone. We urge all citizens to take all the necessary safety measures to protect themselves and their loved ones. By keeping yourselves informed, having adequate stocks of emergency supplies on hand, and taking precautionary measures, you can reduce the damage and loss that Cyclone Chido may cause.\n\nWorking together as a community, we can weather any storm that comes our way.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/RGTRR.jpg",
            "description": "WITH Cyclone Chido bearing down on Zimbabwe, it is important that people take necessary measures to protect themselves and their loved ones. Cyclones and other natural disasters can cause severe damage and loss of life, even in countries with advanced infrastructure, therefore, we need to prepare ourselves effectively for its impact, expected on Thursday. First […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Danny Phiri quashes retirement rumours",
            "url": "https://www.chronicle.co.zw/danny-phiri-quashes-retirement-rumours/",
            "content": "Innocent Kurira,[emailprotected]\n\nDANNY Deco Phiri, the 35-year-old Chicken Inn midfield enforcer, has dismissed speculation about his retirement, stating that he is still available to play for another season.\n\nPhiri, who has had a great career with Chicken Inn and Golden Arrows in South Africa, revealed that he is not yet ready to hang up his boots.\n\nI am still around to play. Its not true that I have hung my boots yet. If there is anything, I will surely let you know, but for now, I am still looking forward to delivering on the field of play, Phiri said.\n\nPhiri, who was a key player for Chicken Inn when they won the Castle Lager Premier Soccer League title in 2015, added that he is eager to continue playing and contributing to his teams success.\n\nI am not ready to retire yet. I still have a lot to offer, and I am excited about the prospect of playing another season. I will continue to work hard and give my best, and I am confident that I can still make a meaningful contribution to my team, Phiri said.\n\nPhiris decision to continue playing is a boost for Chicken Inn, who are reportedly grooming him for a coaching role.\n\nSources close to the club indicate that Phiri is being lined up to take over as a coach at the club, following in the footsteps of Guide Goddard and Ben Nyahunzvi, who have both made the transition from playing to coaching at the club.\n\nPhiris career has been marked by numerous highlights, including his stint with Golden Arrows in South Africa, where he played alongside fellow Zimbabweans Kudakwashe Mahachi, Devine Lunga and Knox Mutizwa.\n\nHe has also represented Zimbabwe in both the Chan and Afcon competitions.\n\nPhiri, under coach Joey Antipas, won the Castle Lager Premier Soccer League with Chicken Inn in 2015, the year he was crowned Soccer Star of the Year.Deco began his career in the topflight league with the now-defunct Railstars before signing up for Bantu Rovers, where he played in 2009 and 2010 before crossing the floor to Chicken Inn in 2011.\n\nHe played and captained Chicken Inn up to 2015 and attracted the interest of South African side, Golden Arrows in 2016, but his career there was affected by injuries until he was offloaded in 2021.\n\nHe played for Bulawayo Chiefs in the 2023 season before re-joining the Gamecocks at the start of this season. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghbggf.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw DANNY “Deco” Phiri, the 35-year-old Chicken Inn midfield enforcer, has dismissed speculation about his retirement, stating that he is still available to play for another season. Phiri, who has had a great career with Chicken Inn and Golden Arrows in South Africa, revealed that he is not yet ready to hang up […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Iron and steel industry revival to drive economic growth",
            "url": "https://www.chronicle.co.zw/iron-and-steel-industry-revival-to-drive-economic-growth/",
            "content": "Patrick Chitumba,[emailprotected]\n\nThe revival of the countrys iron and steel industry will drive economic growth, create jobs and enhance regional competitiveness, Industry and Commerce Minister, Nqobizitha Ndlovu, has said.\n\nThe industrys resurgence is crucial for transforming the country into a middle-income economy by 2030. The Government has launched initiatives to promote high-growth sectors, import substitution and local production.\n\nAddressing a gathering of industry leaders and policymakers attending an Iron and Steel Indaba in Kwekwe on Thursday last week, Minister Ndlovu said the iron and steel industrys resurgence holds significant promise for the nations future prosperity.\n\nThe Indaba was held under the theme, Leveraging the resurgence of Zimbabwes Iron and Steel Industry.\n\nThe resurgence of our iron and steel industry is not merely a possibility but an urgent necessity for economic growth, job creation and enhancing our competitiveness as a regional manufacturing hub.\n\nMinister Nqobizitha Mangaliso Ndlovu\n\nThis Indaba is coming at a time when we just recently launched our Zimbabwe Industrial Reconstruction and Growth Plan (2024-2025), in November 2024 in Mutare, following Cabinets approval. Through this plan, which was developed following a wide stakeholder consultative process, we will ensure that implementation is an indispensable virtue, he said.\n\nMinister Ndlovu said the plans key focus is on promoting high-growth sectors with great potential for promoting import substitution and reducing the perennial trade deficit, of which the iron and steel value chain is among them.\n\nHe said the iron and steel sector is the third highest import bill for Zimbabwe after oils and fuel and motor vehicles.\n\nUtilisation of iron and steel products is, of course, a demonstration of a growing economy. However, we need to use the right approach as we grow and thats localising production as much as possible, said Minister Ndlovu.\n\nThe Minister said the gathering sought to identify the synergies that can be created between Dinson Iron and Steel Company, Ziscosteel, Steelmakers and all players in the industry.\n\nThe gathering seeks to consult on the critical elements to be included in the principles of the new Iron and Steel Act, which principles we will be bringing to Cabinet in the New Year\n\nIdentify low-hanging fruits, policy support areas and opportunities for new investments and develop a comprehensive strategic roadmap for the revival of the iron and steel industry, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/FGTR.jpg",
            "description": "Patrick Chitumba, Patrick.chitumba@chronicle.co.zw The revival of the country’s iron and steel industry will drive economic growth, create jobs and enhance regional competitiveness, Industry and Commerce Minister, Nqobizitha Ndlovu, has said. The industry’s resurgence is crucial for transforming the country into a middle-income economy by 2030. The Government has launched initiatives to promote high-growth sectors, import […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Chris Brown delivers historic performances",
            "url": "https://www.chronicle.co.zw/chris-brown-delivers-historic-performances/",
            "content": "IN a weekend that will go down in South African music history, internationally acclaimed musician Chris Brown dazzled fans with two sold-out performances at the FNB Stadium in Nasrec.\n\nHis concerts on Saturday and Sunday marked a monumental occasion in his illustrious career that began in 2002, thrilling thousands in attendance and providing a resonance that many will remember for years to come.\n\nBrown unleashed a torrent of his hit songs, captivating the audience with chart-toppers like Residuals, Angel Numbers, With You, No Air, Sensational and many more. These performances were not merely concerts; they were a celebration of his musical journey, encapsulating the talent and charisma that have defined his career for over two decades.\n\nThe response from fans and prominent figures alike has been nothing short of stellar. Renowned South African rapper, Cassper Nyovest, shared his admiration on social media, stating, I dont remember the last time there was such a hype of an artiste or a concert in South Africa for a long time. Chris Brown is a star and the catalogue is just second to none. So inspiring to see what hard work and perseverance can build. Wow wow wow!!! Amazing.\n\nChris Brown\n\nOn Saturday, more than 90 000 fans showed up to help Brown make history and when he finally spoke to the audience after singing his heart out, the singer made sure to tell fans how special the night was for him. Ive been waiting my whole life for this kind of moment, he said before performing a firm favourite, Forever.\n\nThe singer expressed his gratitude to the audience for making his dream come true and said he has been longing to touch down in SA again since his last visit.I just want to say from the bottom of my heart, I love you guys so much. This night means a lot to me. I aint been out here in a long time. Ive been rocking for two and a half hours and yall just let me rock. I appreciate that, he said before the audience started chanting, Breezy! on Saturday.\n\nDespite the controversies that have followed Brown throughout his career and in the lead-up to the Breezy in South Africa Concert, the fans who disregarded his controversial past to honour the invitation to watch him perform got their moneys worth.\n\nThe multi-talented musician, who has one of the most impressive music catalogues, held nothing back when he planned his set for one of Africas largest stadiums. Having been dubbed the Michael Jackson of his generation and GOAT (Greatest Of All Time) by his fans, Brown proved why the phrases are not in vain.Both Brown and his 18 dancers brought nothing but their A-game to every performance. Tyler Terry, one of Browns dancers who is also a firm favourite with his fans, stood out, dressed in Lakers gear with Kobe Bryants iconic number 24.\n\nThe hitmaker performed everything from early classics like Yo (Excuse Me Miss) and Run It! to his latest chart-toppers such as Residuals, Sensational and Angel Numbers/Ten Toes.\n\nHis set, which lasted over two hours, gave fans everything and more with excellent production, which included flying above the crowd when he sang Wall To Wall and being lifted out of the stage Julius Malema EFF rally style.\n\nCrowds at Chris Browns Johannesburg concert\n\nThe man also gave energetic dance breaks, giving his fans some of the iconic choreography they have seen in his music videos. There were also several shirtless moments for the ladies who fuelled him with loud, squeaky screams as he performed his sexy songs like Strip and Take You Down.\n\nBrown also changed his outfit multiple times, much to his fans delight. The performer also made sure some lucky fans had keepsakes as he threw a jacket, a hat and a shirt into the crowd, sparking major envy from those fans who had no chance to catch the items.\n\nAs people left the stadium, in their thousands, there was an unspoken consensus that Brown was intentional when tailoring South Africas very own Super Bowl experience.\n\nThere was no sense of feeling short-changed by Breezy from the crowd, who witnessed Browns commitment to keeping up with SA through how he incorporated some of the popular local sounds into his set.\n\nHis tour deejay, DJ Fresh, kept the audiences energy up during breaks by playing South African classics like Brenda Fassies Weekend Special, Riky Ricks Boss Zonke and Mgarimbes Sister Bethina when he wasnt playing some of Browns songs that didnt make the cut for the night. IOL/News24\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/lll.jpg",
            "description": "IN a weekend that will go down in South African music history, internationally acclaimed musician Chris Brown dazzled fans with two sold-out performances at the FNB Stadium in Nasrec. His concerts on Saturday and Sunday marked a monumental occasion in his illustrious career that began in 2002, thrilling thousands in attendance and providing a resonance […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Widow donates 27 food hampers to fellow widows",
            "url": "https://www.chronicle.co.zw/widow-donates-27-food-hampers-to-fellow-widows/",
            "content": "Ashley Phiri, ashleyphiri66@gmail\n\nTHE Bulawayo Widows Association yesterday received support from a retired nurse, Mrs Contilda Dube, who distributed food hampers to 27 widows from Makokoba suburb.\n\nThe charitable act was Mrs Dubes way of expressing gratitude to the association for its unwavering support during her emotional distress after losing her husband 10 years ago.\n\nMrs Dube, who spent 25 years working in the United Kingdom, has become a beacon of hope for fellow widows in the community since joining the association in 2014.\n\nI am so happy to have been part of this family for the past 10 years. I first got to know these women when my husband passed away, and I didnt know where to start, she said.\n\nI didnt even know the processes one has to go through, like tombstone unveiling and these women came through for me. They have been family ever since.\n\nBeyond providing food assistance, Mrs Dube has spearheaded income-generating projects for the widows, including buying and reselling kapenta fish, which has considerably improved their livelihoods. However, she acknowledged the need for more support to sustain the initiatives.\n\nI am no longer earning the income I used to, so support from others will be crucial moving forward. I used to afford to do a lot for these women, but now, Im unable to provide the same level of support. We invite anyone willing to partner with us to join hands, she said.\n\nYesterdays donation included mealie-meal, sugar, cooking oil, bread and cabbage, aimed at ensuring the widows and their families enjoy the festive season.\n\nBulawayo Widows Association spokesperson, Mrs Maina Bhebhe, expressed gratitude to Mrs Dube for her unwavering support.\n\nShe has not only helped us with food but also guided us in starting income-generating projects. As an association, we are grateful for the friendship we share with her, said Mrs Bhebhe.\n\nEven when she was still in the UK, we knew we could count on her. May the Lord continue to bless her and her family.\n\nMrs Bhebhe said Mrs Dubes kindness is a reflection of a sense of belonging and commitment to serving mankind. The widows had initially planned a year-end dinner but opted for food hampers to ensure their grandchildren could also benefit.\n\nThe gathering was filled with laughter, shared memories and camaraderie over drinks and scones, underlining the strong bonds within the group.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Donation-to-Widows-at-the-Bulawayo-Methodist-Church-3.jpg",
            "description": "Ashley Phiri, ashleyphiri66@gmail THE Bulawayo Widows Association yesterday received support from a retired nurse, Mrs Contilda Dube, who distributed food hampers to 27 widows from Makokoba suburb. The charitable act was Mrs Dube’s way of expressing gratitude to the association for its unwavering support during her emotional distress after losing her husband 10 years ago. […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        },
        {
            "title": "Carling Black Label DJ Clash finale on this weekend",
            "url": "https://www.chronicle.co.zw/carling-black-label-dj-clash-finale-on-this-weekend/",
            "content": "Showbiz Reporter\n\nAFTER an extensive search across eight regions and reviewing over 350 mixtapes, the moment to crown the ultimate Carling Black Label Champion DJ is nearly here.\n\nTwenty-five finalists will converge in Harare for the national finals, set to take place on Friday at the Hippodrome in Braeside.\n\nThe DJs will compete for the prestigious title of national Carling Black Label Champion DJ at the Carling Black Label DJ Clash, along with a share of the valuable prize pool totalling over US$15 000.\n\nThe first-place winner will receive US$3 000, a controller, an Apple MacBook, a Studio Monitor and a Cordless Mic, while the second-place winner will walk away with US$2 000, a Studio Monitor and a Cordless Mic.\n\nThe reigning champion, DJ Irvene X, will defend his title against this years finalists.\n\nThe competition aims to uplift and showcase the talents of DJs nationwide, offering them a platform to further their musical careers and build brighter futures.Delta Beverages, the event organisers, confirmed in a statement that this years clash will feature guest artistes from the Zimdancehall and hip-hop genres, including SaintFloew, Voltz, ChillSpot (represented by Levels)and Mushroom Media (represented by DJ Tamuka).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfgfg-2.jpg",
            "description": "Showbiz Reporter AFTER an extensive search across eight regions and reviewing over 350 mixtapes, the moment to crown the ultimate Carling Black Label Champion DJ is nearly here. Twenty-five finalists will converge in Harare for the national finals, set to take place on Friday at the Hippodrome in Braeside. The DJs will compete for the […]",
            "time": "09:46",
            "date": "17 Dec 2024"
        }
    ]
}