{
    "news": [
        {
            "title": "Zim captain on Test glory hunt",
            "url": "https://www.chronicle.co.zw/zim-captain-on-test-glory-hunt/",
            "content": "Brandon Moyo,[emailprotected]ZIMBABWE are hopeful of a change of fortunes when they face Ireland in a one-off Test match at Queens Sports Club today.Chevrons captain Craig Ervine yesterday said they have hopes of having picked up some lessons from their series against Afghanistan last month.The visitors beat Zimbabwe 1-0 in a two-match Test series at Queens Sports Club last month.They return to the same venue as they seek to register their first ever Test match win against Ireland. The two sides have only played red-ball cricket against each other once with Ireland emerging victorious last year.For Ervine, the wicket prepared for this match is different to the one used against Afghanistan but believes that discipline will be key with the ball and with the bat, they need to work hard and try to convert the 50s to centuries.For us as a batting unit its about working hard to get yourself in and once you do get in, you need to go really big and make sure that counts. In Test cricket, 50s and 60s dont necessarily put you in good positions but like Afghanistan, getting 172s, 230 odd, those are the scores that really put you in good positions, said Ervine.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/xc.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com ZIMBABWE are hopeful of a change of fortunes when they face Ireland in a one-off Test match at Queens Sports Club today. Chevrons captain Craig Ervine yesterday said they have hopes of having picked up some lessons from their series against Afghanistan last month. The visitors beat Zimbabwe 1-0 in a two-match […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "13 injured in an accident, driver and conductor on the run",
            "url": "https://www.chronicle.co.zw/13-injured-in-an-accident-driver-and-conductor-on-the-run/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\n13 PASSENGERS were injured in a bus accident which occurred at the 26 kilometre peg along Kadoma-Sanyati Road.\n\nA Nehoreka bus with 51 passengers on Board overturned and landed on its left side\n\nIn a statement on X, Police said the bus driver and the conductor fled from the scene. The injured victims were admitted at Kadoma General Hospital.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-58.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com 13 PASSENGERS  were injured in a bus accident which occurred at the 26 kilometre peg along Kadoma-Sanyati Road. A Nehoreka bus with 51 passengers on Board overturned and landed on its left side In a statement on X, Police said the bus driver and the conductor fled from the scene. The injured […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "President Mnangagwa calls for unity, accountability and grassroots development in push towards Vision 2030",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-calls-for-unity-accountability-and-grassroots-development-in-push-towards-vision-2030/",
            "content": "Online Reporter\n\nPRESIDENT Mnangagwa has issued a rallying call for unity, accountability, and accelerated grassroots development as Zimbabwe marches towards its Vision 2030 goal of becoming a prosperous upper-middle-income economy.\n\nSpeaking at a high-level meeting with Provincial Ministers and government officials at State House in Harare, the President emphasised the critical role of the Devolution and Decentralisation Policy in driving equitable development and improving the quality of life for all citizens.\n\nThe main focus remains centred at the grassroots level. This meeting gives us the opportunity to take stock of the progress made under the Devolution and Decentralisation Policy, which is a critical cog of the 2nd Republic, said President Mnangagwa.\n\nMASHONALAND WESTHon. Marian Chombo Minister of State for Provincial Affairs and Devolution\n\nHe highlighted the commendable strides made in upgrading livelihoods but stressed the need for increased momentum in achieving national goals.\n\nThe President warned against complacency, stating: Dragging of feet and fancy seating are not acceptable dispositions under my watch. Increased momentum towards achieving our goals requires leaders who are dedicated. Decide to be counted as those carrying these traits.\n\nPresident Mnangagwa underscored the importance of unity and a people-centred approach, urging leaders to remain grounded in their responsibilities.Let us never forget where we come from. Always have a heart for the people. The policy of Devolution and Decentralisation is a beacon for national unity and equitable development, he said.\n\nBULAWAYO METROPOLITANHon. Judith Ncube Minister of State for Provincial Affairs and Devolution\n\nThe President directed Provincial Ministers to align their administrations with the national vision, ensuring that communities remain vibrant and hopeful.\n\nYou must fully play your part in advancing the industrialisation of our communities. Lead from the front in championing people-driven development programs, leaving no one behind, he said.\n\nThe President also emphasised the need for a positive work ethic and timely reporting.\n\nPositive work ethics must be sustained as we march towards Vision 2030. You must submit comprehensive and timely reports, both ad hoc and routine. Non-attendance to Cabinet Committee meetings is unacceptable, he said.\n\nMATABELELAND NORTHHon. Richard Moyo Minister of State for Provincial Affairs and Devolution.\n\nPresident Mnangagwa called for greater focus on implementing the National Development Strategy 2 (NDS2), particularly in building modern, sustainable economies at the subnational level.\n\nOur country is endowed with God-given natural resources. Through you, our communities must remain good custodians of these resources. Shun machinations that seek to reverse the 2nd Republics achievements, he said.\n\nHe urged Ministers to collaborate with traditional leaders and party structures in implementing government development programs, reiterating the mantra, Nyika inovakwa nevene vayo (A nation is built by its own people).\n\nMIDLANDSHon. Owen Ncube Minister of State for Provincial Affairs and Devolution\n\nPresident Mnangagwa called for unity of purpose and dedication.\n\nI urge Ministers to remain duty-bound and committed to our national interest and development aspirations. Unity of purpose and dedication in the implementation of government programs must be a key priority area. Preach unity and peace in your provinces, he said.\n\nPresident Mnangagwa urged Provincial Ministers to champion economic development programs and ensure that no community is left behind in the journey towards Vision 2030.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-05-at-11.56.49-2-680x380.jpeg",
            "description": "Online Reporter  PRESIDENT Mnangagwa has issued a rallying call for unity, accountability, and accelerated grassroots development as Zimbabwe marches towards its Vision 2030 goal of becoming a prosperous upper-middle-income economy. Speaking at a high-level meeting with Provincial Ministers and government officials at State House in Harare, the President emphasised the critical role of the Devolution […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "BCC Reduces Shop Licence Fees, Sports and Social Clubs Rates by 30 Percent",
            "url": "https://www.chronicle.co.zw/bcc-reduces-shop-licence-fees-sports-and-social-clubs-rates-by-30-percent/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHE Bulawayo City Council (BCC) has reduced business shop licence fees and sports and social clubs rates by 30 percent, while all other charges outlined in the initial 2025 budget remain unchanged.\n\nAccording to minutes from a special council meeting held last week, finance director Mr Tennyson Mpunzi reported that shop licensing tariffs were last gazetted under Statutory Instrument 7 of 2020, dated 17 January 2020, based on the 2019 budget.\n\nHowever, the 2019 tariffs were gazetted a year later, by which time they had already been overtaken by changes in economic conditions.\n\nMr Mpunzi said when tariffs were indexed to the US dollar in May 2022, the gazetted 2020 tariff for the smallest shop was equivalent to US$1.09.\n\nAn administration fee introduced in October 2021 increased the total fee for the lowest shop licence to US$238.11. He noted that at the time of preparing and approving the budget, the 2019 tariffs were in US dollars, as the multi-currency system was still in operation.\n\nFollowing an outcry over the level of tariffs charged from July 2022, it was proposed that the current USD tariffs be reviewed downwards, using the gazetted 2019 tariffs (USD) as the baseline. An increase of 51 percent on the 2019 tariffs (i.e., on the US$110.76) was expected to cover the increases in the cost of providing the service since 2019 to date. This would reduce the lowest shop licence fee by 30 percent, from US$238.11 to US$167.01, said Mr Mpunzi.\n\nHe added that the council had also considered residents concerns over the proposed cemetery and community facility fees for 2025.\n\nThe 2025 proposed budget reverted its proposed tariffs for cemetery and community facility fees to the gazetted tariffs, thereby lowering the cost of burial.\n\nIt was recommended that (i) business licence fees for 2025 be reduced by 30 percent, (ii) sports and social clubs property rates be reduced by 30 percent, while the rest of the proposed tariffs and charges for 2025 remain unchanged as proposed in the 2025 budget, said Mr Mpunzi.\n\nBulawayos initially proposed 2025 budget was declared null and void following the intervention of the Chief Secretary in the Office of the President and Cabinet, Dr Martin Rushwaya.\n\nHe instructed the Permanent Secretary in the Ministry of Local Government and Public Works, Dr John Basera, not to approve the budget until all objections raised by stakeholders, particularly the business community, were addressed.\n\nA special budget committee was subsequently established to revise the 2025 city budget, and it is yet to present the final document.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-1-copy-177.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Bulawayo City Council (BCC) has reduced business shop licence fees and sports and social clubs’ rates by 30 percent, while all other charges outlined in the initial 2025 budget remain unchanged. According to minutes from a special council meeting held last week, finance director Mr Tennyson Mpunzi reported that shop licensing […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "WATCH: Harare’s Mayor’s “house” turns out to be vehicle auction site",
            "url": "https://www.chronicle.co.zw/harares-mayors-house-turns-out-to-be-vehicle-auction-site/",
            "content": "Herald Correspondent\n\nDrama has unfolded in Greendale, Harare, as the Justice Maphios Cheda-led Commission of Inquiry into Harares affairs temporarily adjourned Mayor Jacob Mafumes testimony to conduct an onsite inspection at a property he had claimed to be his house.\n\nThe Commission, findings revealed that the property, located on Coronation Road at number 1110 in Greendale, is not a residential area as claimed, but a vehicle auction site.\n\nWhen Mayor Mafume attempted to explain the discrepancy, Judge Cheda instructed him to provide his explanation at a later time.\n\nThe Commission insisted on an inspection in loco after discovering that Mayor Mafume had lied under oath.\n\nMayor Mafume claimed it was a mistake, saying his house was just two blocks away from the initial address.\n\nHowever, the Commission refused to accept this and proceeded with the inspection. Meanwhile, the convoy, comprising journalists and the entire Commission bench, is now heading back to the Disaster Management Centre, where the public hearings are being conducted.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Screenshot-72-680x380.png",
            "description": "Herald Correspondent Drama has unfolded in Greendale, Harare, as the Justice Maphios Cheda-led Commission of Inquiry into Harare’s affairs temporarily adjourned Mayor Jacob Mafume’s testimony to conduct an onsite inspection at a property he had claimed to be his house. The Commission, findings revealed that the property, located on Coronation Road at number 1110 in […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "“President Mnangagwa is the only one who was elected by the whole Nation” – Vice President Chiwenga",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-is-the-only-one-who-was-elected-by-the-whole-nation-vice-president-chiwenga/",
            "content": "Online Reporter\n\nVICE President General (Rtd) Dr Constantino Chiwenga has reaffirmed that President Mnangagwa holds a unique position in Zimbabwes governance, being the only elected official in the country chosen by the entire electorate as a collective constituency.\n\nSpeaking while introducing President Mnangagwa during the Ministers of State and Provincial Affairs interaction with the head of state, Vice President Chiwenga emphasised the significance of the Presidents mandate, highlighting his national responsibility and leadership role as the sole representative elected by the whole nation.\n\nBe reminded that, the President is the only one who was elected by the whole Nation as a constituency. In other words, he is the only person in the country elected by the entire country as a constituency, said Vice President Chiwenga.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/VP-Chiwenga.jpg",
            "description": "Online Reporter VICE President General (Rtd) Dr Constantino Chiwenga has reaffirmed that President Mnangagwa holds a unique position in Zimbabwe’s governance, being the only elected official in the country chosen by the entire electorate as a collective constituency. Speaking while introducing President Mnangagwa during the Ministers of State and Provincial Affairs interaction with the head […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "President Mnangagwa to hold key meeting with Ministers of State for Provincial Affairs and Devolution",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-to-hold-key-meeting-with-ministers-of-state-for-provincial-affairs-and-devolution/",
            "content": "Online Reporter\n\nPresident Mnangagwa will today interface with Ministers of State for Provincial Affairs and Devolution at State House in Harare.\n\nThe Ministers of State and their Permanent Secretaries have gathered at State House for the interaction with the President.\n\nBULAWAYO METROPOLITAN Hon. Judith Ncube Minister of State for Provincial Affairs and Devolution\n\nMr Paul Nyoni Bulawayo Permanent Secretary\n\nMIDLANDSHon. Owen Ncube Minister of State for Provincial Affairs and Devolution\n\nMATABELELAND NORTHHon. Richard Moyo Minister of State for Provincial Affairs and Devolution.\n\nMASHONALAND CENTRALHon. Christopher Magomo Minister of State for Provincial Affairs and Devolution\n\nMANICALANDHon. Misheck Mugadza Minister of State for Provincial Affairs and Devolution\n\nMASHONALAND EASTHon. Apollonia Munzverengwi, Minister of State for Provincial Affairs and Devolution\n\nMASHONALAND WESTHon. Marian Chombo Minister of State for Provincial Affairs and Devolution\n\nMASVINGOHon. Ezra Chadzamira Minister of State for Provincial Affairs and Devolution\n\nMATABELELAND SOUTHHon. Evelyn Ndlovu Minister of State for Provincial Affairs and Devolution\n\nHARARE METROPOLITANHon. Charles Z. Tawengwa Minister of State for Provincial Affairs and Devolution.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/GjAugt7WcAAw7zZ-1-680x380.jpg",
            "description": "Online Reporter President Mnangagwa will today interface with Ministers of State for Provincial Affairs and Devolution at State House in Harare. The Ministers of State and their Permanent Secretaries have gathered at State House for the interaction with the President.                               […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "Binga man rapes 13-year-old “girlfriend”",
            "url": "https://www.chronicle.co.zw/binga-man-rapes-13-year-old-girlfriend/",
            "content": "Caroline Mutsawu in Hwange\n\nA 24-YEAR-OLD man from Binga appeared in court for allegedly raping his 13-year-old girlfriend.\n\nShepherd Mudimba, of Gwatagwata Village, appeared before the Hwange regional magistrate, Mr Lungile Ncube facing a rape charge and he was remanded in custody to 20 February for trial.\n\nProsecuting, Mrs Charline Gorerino told the court that sometime last year in February, the accused was allegedly involved in a romantic relationship with the minor.\n\nThe court heard that on 14 January this year, Mudimba and the complainant started cohabiting as husband and wife.\n\nMudimba stayed with the juvenile for four days until the complainants father discovered that his daughter had gone missing.\n\nThe court heard that during his stay with the complainant, Mudimba allegedly raped the girl.\n\nThe matter came to light when the complainants father discovered that his daughter was not home. He later got information that his daughter was at Mudimbas place and sent his neighbour to go and fetch the victim. A report was made to the police leading to Mudimbas arrest.\n\nThe complainant was medically examined, and doctors compiled a medical report and will be produced in court as evidence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Caroline Mutsawu in Hwange A 24-YEAR-OLD man from Binga appeared in court for allegedly raping his 13-year-old “girlfriend.” Shepherd Mudimba, of Gwatagwata Village, appeared before the Hwange regional magistrate, Mr Lungile Ncube facing a rape charge and he was remanded in custody to 20 February for trial. Prosecuting, Mrs Charline Gorerino told the court that […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "Zimbabwe referees set for high-profile engagements",
            "url": "https://www.chronicle.co.zw/zimbabwe-referees-set-for-high-profile-engagements/",
            "content": "Innocent Kurira,[emailprotected]\n\nTHE Zimbabwe Football Association (Zifa) has announced a series of significant assignments for Zimbabwean referees throughout the month of February.\n\nThese engagements demonstrate the growing recognition of Zimbabwes match officials on the international stage.\n\nThe month kicks off with an important Zifa Panel Referees Course, scheduled to take place from February 13-16 in Harare.\n\nThis course aims to enhance the knowledge, skills, and performance of Zimbabwean match officials, ensuring they are well-prepared to meet the demands of top-level football.\n\nIn line with Zifas commitment to the development of refereeing talent, the country will also be represented at prestigious global events.\n\nOwen Manenda, one of Zimbabwes top referees, will be attending the New Fifa Panel Referees Course in Egypt from February 23-27.\n\nThis offers a valuable opportunity for Manenda to refine his expertise alongside the best in the world, contributing to Zimbabwes continued presence on the global football stage.\n\nOn the continental level, several Zimbabwean referees will be officiating in key fixtures during the Africa Womens Cup of Nations (WAFCON) qualifiers. Faith Mloyi has been appointed as the Match Commissioner for the match between Tanzania and Equatorial Guinea on February 20, while Sabelo Maphosa will serve as the Referees Assessor for the fixture between Burundi and Burkina Faso on February 21. Stella Ruvinga, another seasoned official, has been assigned the role of Match Commissioner for the Uganda vs. Ethiopia encounter on the same day.\n\nFurther strengthening Zimbabwes representation in Africa, Dominica Melusi and Thanks Nyahuye will be officiating in the WAFCON qualifiers on February 26. Their involvement in these high-profile matches underscores the growing recognition of Zimbabwean referees across the continent.\n\nJoshua Tigere, ZIFAs Referees Manager, praised the tireless efforts of the countrys match officials. These appointments highlight the strength and integrity of Zimbabwean refereeing. Our officials are continuously being entrusted with key assignments across Africa, and we are confident that they will continue to represent the nation with distinction, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/rfgdfd.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw THE Zimbabwe Football Association (Zifa) has announced a series of significant assignments for Zimbabwean referees throughout the month of February. These engagements demonstrate the growing recognition of Zimbabwe’s match officials on the international stage. The month kicks off with an important Zifa Panel Referees Course, scheduled to take place from February 13-16 […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        },
        {
            "title": "Zimra upgrades PAYE Management System",
            "url": "https://www.chronicle.co.zw/zimra-upgrades-paye-management-system/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe Zimbabwe Revenue Authority (Zimra) on Monday launched the new Employee Management Module, which falls under its Tax and Revenue Management System (TaRMS) platform.\n\nThe new system will come into effect with the January 2025 PAYE Return. This new module aims to streamline the registration of employees and the declaration of their earnings, making the tax process more efficient for employers.\n\nZimra Domestic Taxes Commissioner, Mr Misheck Govha, said the Employee Management Module provides a platform for entities to register their employees and declare their earnings, allowing for automatic tax computation by the system.\n\nHe said each registered employee will be allocated a Tax Identification Number (TIN), and those who are already registered will retain their existing TINs.\n\nThe new Employee Management Module will include several features, with the most notable being Comprehensive Employee Registration, Flexible Registration Options, Additional Tax Credits, and Auto-filling of PAYE and AIDS Levy, said Mr Govha.\n\nUnder the Employee Management Module, employers will be able to auto-fill PAYE and AIDS Levy. After generating earnings for all employees, the PAYE and AIDS Levy will automatically populate on the PAYE return within the Tax Returns Management module.\n\nAdditionally, employers can choose to register employees individually or utilise the Employee Upload Function to register multiple employees at once.\n\nHe said in order to fully benefit from the systems comprehensive employee registration, employers must declare essential information when registering employees. This, he added, includes marital status, blindness, physical disabilities (for both employees and their children), and the date of birth.\n\nMr Govha said this data will enable the system to automatically grant applicable tax credits.\n\nZimra encourages all taxpayers and employers to familiarise themselves with the new Employee Management Module to ensure compliance and a smooth transition, he said.\n\nThe new module also provides for Additional Tax Credits, under which employers will also have the opportunity to declare other tax credits, such as Medical Aid Contributions and Medical Expenses Credits, during the earnings declaration process.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gfffgfv.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The Zimbabwe Revenue Authority (Zimra) on Monday launched the new Employee Management Module, which falls under its Tax and Revenue Management System (TaRMS) platform. The new system will come into effect with the January 2025 PAYE Return. This new module aims to streamline the registration of employees and the declaration of […]",
            "time": "20:25",
            "date": "05 Feb 2025"
        }
    ]
}