{
    "news": [
        {
            "title": "BCC on high alert after toddler swept by floods",
            "url": "https://www.chronicle.co.zw/bcc-on-high-alert-after-toddler-swept-by-floods/",
            "content": "Sikhumbuzo Moyo and Raymond Jaravaza, Chronicle Writers\n\nHEAVY rains pounding various parts of the country have prompted the Bulawayo Fire Brigade to deploy emergency teams in several suburbs where streams and rivers pose significant risks to schoolchildren and residents.\n\nThe city has received substantial rainfall over the past few days, overwhelming emergency services as distress calls flood in from residents stranded by rising water levels in rivers and streams.\n\nOn Tuesday, flash floods in the citys western suburbs claimed the life of a three-year-old boy, Sibusiso Methembe Moyo, who was swept away near a storm drain.\n\nThe toddler was in the company of his older brother when the tragedy occurred. His body was discovered yesterday along the banks of a small stream.\n\nUncontrolled dumping of waste and streambank cultivation have been identified as major contributors to the flooding that hit parts of the citys western suburbs following torrential rains lasting over eight hours. Bulawayos chief fire officer, Mr Mhlangano Moyo, said the Fire Brigade had been inundated with calls from concerned residents, particularly those worried about schoolchildren at risk of drowning in flooded waterways. In response, emergency teams were deployed to key flood-prone areas.\n\nThe city recorded significant rainfall on Tuesday, and we made a proactive decision to deploy teams to problematic streams and rivers that have, in the past, claimed lives when flooded, he said.\n\npedestrians and a motorists cross the flooded Phekiwe stream in Nkulumane suburb yesterday\n\nMr Moyo said one such team was stationed in Pumula South, in the Makoni area, where a stream separates a school from nearby homes. Many schoolchildren are forced to cross the stream daily, exposing them to danger when water levels rise.\n\nA Chronicle news crew yesterday observed schoolchildren crossing a low-lying bridge along a stream in Pumula South. In one instance, an older boy carried a younger schoolmate on his back while rainwater surged around them.\n\nResidents underestimate that stream but it is dangerous when flooded and the Fire Brigade is appealing to parents and guardians to pick up their children from school during the rainy season, said Mr Moyo.\n\nAnother team was deployed at a low-lying bridge along Phekiwe River on Tuesday afternoon after heavy downpours left the area submerged. Many primary schoolchildren from Rangemore suburb cross this bridge daily to attend school in nearby Nkulumane.\n\nPhekiwe River divides parts of Nkulumane 12 and Upper Rangemore.\\It is one of the most flood-prone areas where we deployed emergency personnel. Our firefighters assisted schoolchildren in crossing safely after heavy rains pounded the area, said Mr Moyo.\n\nHe advised residents to seek shelter at designated safe points, including Nkulumane 12 Clinic, Mgombane Primary School, Nkulumane Police Station, and Mandwandwe High School, whenever the Phekiwe River Bridge is flooded.Its important for the Fire Brigade to stay pro-active and deploy teams to problematic streams and rivers which pose a risk to residents, especially school kids, said Mr Moyo.\n\nThe Meteorological Services Department (MSD) said it recorded 54,5 millimetres of rain at its Luveve station, 30mm at Joshua Mqabuko Nkomo International Airport and 28 millimetres at Khumalo and Suburbs stations.Elsewhere, Maholi in Masvingo Province recorded the highest rainfall at 80mm, followed by Zvishavane (64mm) and Wedza in Mashonaland East (63mm). Plumtree and Matopo recorded 39mm and 37mm, respectively.\n\nMr Moyo expressed concern over littering and poor waste management, which exacerbate flooding.The city council has consistently cleared storm drains and maintained a regular refuse collection programme. However, some residents continue to dump waste illegally, which clogs drainage systems and worsens flooding, he said.\n\nThe rains were incessant for the better part of the day on Tuesday and the amount was certainly not the same throughout the city as some areas received less while others like the western areas had higher amounts.In Entumbane, some residents faced home flooding, worsened by their refusal to open weeping holes in perimeter walls, in defiance of council by-laws.\n\nThe storm drains are functional, but the sheer volume of rainwater overwhelmed them. In the tragic case of the drowned child, the waters force swept him through a storm drain opening towards a larger stream, said Mr Moyo.\n\nIn Matabeleland North and South provinces, no rain-induced damage to property or loss of life has been reported since the resumption of heavy rains over the weekend. However, the Civil Protection Unit (CPU) remains on high alert.Acting Director for Local Government in Matabeleland North, Mr Tapiwa Zivoivoi, confirmed that as of yesterday, no distress calls had been received from District Development Coordinators (DDCs) across the provinces seven districts.\n\nSince the rains resumed on Sunday, I have yet to get any distress reports from our DDCs throughout the seven districts in the province. However, all our disaster teams from district levels are on high alert, he said.\n\nMatabeleland North has historically suffered severe flooding, particularly in Tsholotsho District. Notable flood events occurred in 1978, 2001, 2013, and 2017, leading to mass evacuations and resettlements at Sipepa Rural Health Centre and Tshino area.Similarly, the acting Director for Local Government in Matabeleland South, Mr Zacharia Jusa, confirmed that no reports of infrastructure damage or casualties had been received since the rains began.\n\nAs of now, we have no recorded cases of damage or loss of life. However, we are continuously monitoring the situation and updating our records, he said.\n\nFlash floods are caused by a combination of factors, including heavy rainfall, saturated soil, and impermeable surfaces. Specific contributors include heavy rainfall which can overwhelm the grounds absorption capacity, causing rapid runoff, and saturated soil and when soil is already soaked, additional rainwater flows over the surface, leading to floods.\n\nDue to urbanisation, paved surfaces and buildings reduce water absorption, increasing runoff while in terms of topography, steep slopes and low-lying areas are more prone to flash flooding.\n\nDam or levee failures, which is the sudden release of large water volumes from breached dams can trigger flash floods. Burn Scars which are areas recently affected by wildfires absorb less water, increasing flood risks.Meanwhile, Sibusiso Methembe Moyos family is appealing for assistance from well-wishers to raise money towards the boys funeral costs.\n\nWe would appreciate any form of assistance from food for the mourners and funds to bury my nephew. My sister is struggling financially and cannot afford to give her son a decent burial, said Ms Sibangani Sibanda, the deceaseds auntMourners are gathered at house number 70206 New Lobengula. The family can be reach on 0775172440 or 0773327976.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-10-1.jpg",
            "description": "Sikhumbuzo Moyo and Raymond Jaravaza, Chronicle Writers HEAVY rains pounding various parts of the country have prompted the Bulawayo Fire Brigade to deploy emergency teams in several suburbs where streams and rivers pose significant risks to schoolchildren and residents. The city has received substantial rainfall over the past few days, overwhelming emergency services as distress […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zimbabwe urged to diversify energy sources to address power deficit",
            "url": "https://www.chronicle.co.zw/zimbabwe-urged-to-diversify-energy-sources-to-address-power-deficit/",
            "content": "Nqobile Tshili,[emailprotected]\n\nZIMBABWE must diversify its energy sources to address the countrys persistent power deficit, as the nation continues to bear the consequences of relying heavily on hydro-power.\n\nExperts say an energy mix incorporating solar, hydro, thermal, wind, and other sources would reduce dependence on any single power generation method and enhance energy security.\n\nThe country has suffered significant energy losses due to climate-related challenges, with Kariba Power Station alone losing over 800 megawatts (MW) in the past year.\n\nThis shortfall has intensified load shedding, affecting households and industries alike. The country primarily relies on thermal and hydro-power stations for electricity generation, but recent investments by Independent Power Producers (IPPs) and private sector organisations in renewable energy offer a glimmer of hope for the future.\n\nThe Parliamentary Portfolio Committee on Energy and Power Development recently conducted an inquiry into the state of the countrys electricity supply.\n\nZETDC\n\nPresenting the committees findings before the National Assembly on Tuesday, Mangwe Constituency legislator Mr Vincent Sihlabo highlighted the urgent need for energy diversification.\n\nHe said the power deficit poses a serious threat to the countrys economic growth and energy mix could be a solution to Zimbabwes electricity challenges.\n\nThe escalating impacts of climate change underscore the urgent need for substantial investments in infrastructure and renewable energy sources. Fortunately, Zimbabwe is endowed with abundant renewable resources, including solar and hydro-power which offer a promising path towards addressing the countrys energy supply challenges, said Mr Sihlabo.\n\nBy harnessing these resources, Zimbabwe can enhance its energy security, reduce reliance on fossil fuels and stimulate economic development.\n\nMr Sihlabo said the Zimbabwe Electricity Supply Authority (Zesa) told the committee that Zimbabwe is still facing serious power outages as most of the countrys power stations are not producing to full capacity.\n\nThe committee noted that the major challenge is that all power plants are not producing their optimum capacity. In addition, Zimbabwe Power Company pointed out that Kariba South Power Station is producing 250MW only, Hwange power station is producing 750MW and IPPs are adding 69MW, making a total of 1 079MW which cannot sustain the whole nation yet the nations demand is from 1 500MW to 2 350MW, he said.\n\nMr Sihlabo said the committee noted that the country needs to come up with long-term strategies to boost power generation.He said the committee was informed that aging of infrastructure, vandalism of power infrastructure, high costs of servicing loans, and skills flight were some of the challenges that the country is facing.\n\nAccording to Zesa Holdings, they have a huge loan burden in renovating some of the units, Kariba South Power Station which amounts to US$350 million. Zesa created a huge debt burden on the utility, including foreign currency commitments for loan repayments and spare parts purchases.\n\nManagement added that repayments need to be done in foreign currency and they have resorted to exporting power to generate foreign currency, he said.\n\nMr Sihlalo said Zesa management added that there is a shortage of skilled personnel in the electricity sector resulting in a lack of technical expertise and they cited that over the last two years, they have struggled to retain critical skills for the efficient running of the electricity generation plants.\n\nHydro Power Station\n\nMr Sihlabo said the committee observed that the country is heavily dependent on Kariba Power Station, which has proved to be unsustainable.\n\nHe said the committee recommends that the country invest in an energy mix to effectively address power shortages.The Ministry of Energy and Power Development should diversify the energy mix to mitigate the impact of water constraints on hydroelectric power and enhance overall system reliability by 31 December 2026, said Mr Sihlalo.\n\nHe said there should be a strategic balance between base-load power sources such as thermal and nuclear and renewable energy like solar, wind, and geothermal.\n\nMr Sihlabo said the Ministry of Energy and Power Development should invest in renewable energy projects to complement private sector efforts and address the funding constraints observed by year-end.\n\nHe said the committee also recommends that the Treasury should timely disburse funds to service loans for power projects to ease Zimbabwes history of debt servicing challenges to improve the countrys creditworthiness and facilitate access to affordable energy financing.\n\nThe committee also recommends that the Ministry of Energy and Power Development implement stringent contract management protocols.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Hwange-power-Station-Unit-7-and-8.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw ZIMBABWE must diversify its energy sources to address the country’s persistent power deficit, as the nation continues to bear the consequences of relying heavily on hydro-power. Experts say an energy mix incorporating solar, hydro, thermal, wind, and other sources would reduce dependence on any single power generation method and enhance energy security. […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "COMMENT: Robust public- private partneships can improve our roads",
            "url": "https://www.chronicle.co.zw/comment-robust-public-private-partneships-can-improve-our-roads/",
            "content": "BULAWAYO City Council needs $700 million to rehabilitate its road network, estimated to be 2 000km long.Just to maintain it, the city needs at least $15m yearly.\n\nThese are really large sums of money which the city, and the Government, are struggling to raise. As a result, local roads, like others in other urban and rural councils across the country, are in a very poor state.\n\nSome parts of the central business district have become no-go areas especially the northern zone after Fifth Avenue. Fort, Lobengula and Basch streets to the west are barely trafficable too. Roads linking the city centre and basically all suburbs are a nightmare, just driven on because motorists have no choice. The situation is worse in smaller roads running through suburbs.\n\nThat is why 70 percent of Bulawayos roads were long declared to have outlived their ideal lifespan and need a total overhaul.We reported yesterday that the Zimbabwe National Road Administration (Zinara) has set aside ZWG62 million for road rehabilitation in the city. That is about $2,3 million versus the $15 million needed for road maintenance yearly and $700 million for road rehabilitation citywide.\n\nZimbabwe National Road Administration (Zinara)\n\nThe difference between the work that must be done and the means available is immense. However, we acknowledge that that is the reality. Without support from global funders such as the World Bank as a result of Western sanctions on our country, resources have, over the past 25 years, trailed demand.\n\nCouncil, as we reported yesterday, will use the latest allocation to rehabilitate a section of Wellington Road, Murchison Road, Luveve 5 Roads, Fort Street between 1st Avenue and 6th Avenue, Maduma Drive, Luveve Road, Chinamano Street, and Caxton to Wingrove road.\n\nThe Ministry of Transport and Infrastructure Developments Department of Roads will rehabilitate a section of Matopos Road from 23rd Avenue to the city centre, Khami Road, Lobengula Street to Mpopoma Avenue, Steel Works Road from Lobengula Street to Nketa Drive, Fairbridge Way from Philips Drive to Cecil Road, and Lobengula Street from 1st Avenue to 6th Avenue.We urge judicious resource utilisation so that the modest sum allocated effectively does the work that it must do.\n\nWe were happy to report that three local companies  Davis Granite, Neddicky Industries and Asphalt Products  have offered to adopt the intersection of Khami Road and Nketa Drive. They plan to rehabilitate the intersection and install traffic signs.This is a plausible move by the three companies. It will be a good idea if they expand their role across the city. There are other construction firms and we implore them to get involved as well.\n\nGreater public-private partnerships can contribute to a better road network in the city, with Zinara anchoring the drive.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/Zinara.jpg",
            "description": "BULAWAYO City Council needs $700 million to rehabilitate its road network, estimated to be 2 000km long. Just to maintain it, the city needs at least $15m yearly. These are really large sums of money which the city, and the Government, are struggling to raise. As a result, local roads, like others in other urban […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Kingston calling: Master H gears up for international stardom",
            "url": "https://www.chronicle.co.zw/kingston-calling-master-h-gears-up-for-international-stardom/",
            "content": "Trust Khosa, Harare Bureau\n\nZimdancehall sensation Master H is making waves in the music industry after releasing a teaser for his upcoming video featuring Jamaican reggae legend Capleton.\n\nFresh off a successful 2024, the hardworking chanter is showing no signs of slowing down, with fans and industry players hailing his meteoric rise.\n\nMaster H who is in Kingston, Jamaica, is working on a new project with Capleton. While he has yet to reveal the title of the single, he has assured fans via social media that something special is on the way.\n\nBorn Hillary Marufu, the Chitungwiza-based artiste has been sharing photos with top Jamaican musicians since arriving in the Caribbean last week for a series of shows and networking engagements. He has been immersing himself in reggae culture, attending high-profile events, including the belated 80th birthday celebrations of Bob Marley, held at the Bob Marley Museum in Kingston.\n\nMaster H\n\nOne of his viral photos features him alongside legendary dub poet Mutabaruka, a moment he described as a dream come true.Alongside Mutabaruka at the 80th earthstrong celebration at the Bob Marley Museum in Kingston, Jamaica, he posted.Another notable encounter was with Luciano, a celebrated reggae artiste with strong ties to Zimbabwe, having performed in the country twice.\n\nSharing his experience, Master H acknowledged the wealth of knowledge he is gaining from the genres pioneers.What an amazing experience at Original Dancehall Thursdays learning from the best, he wrote on February 7, while attending a dancehall event.\n\nMaster H on set with Capleton\n\nHowever, it was Master Hs post with Capleton that sent social media into a frenzy. Fans erupted with excitement, eager to see what the collaboration will bring. A teaser video featuring the duo has been trending online, further fuelling anticipation for the project.\n\nMaster Hs Jamaican experience is undoubtedly a major step forward for Zimdancehall. His collaboration with Capleton has set him apart, as very few local artistes have secured features with international stars of this calibre. While reggae and dancehall icons are known for their humility, they dont collaborate with just anyone  hard work, consistency, and talent are key.\n\nVisiting the birthplace of reggae and dancehall allows him to learn directly from the genres pioneers, a move that will certainly refine his artistry. With his name now circulating in Caribbean music circles, this Capleton collaboration might just be the launchpad Master H needs to conquer global dancehall.\n\nMaster Hs success is no fluke. Last year, he graced top events, including Chibuku Road to Fame, Castle Tankard, and Doek & Slay, proving his growing influence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-17.jpg",
            "description": "Trust Khosa, Harare Bureau Zimdancehall sensation Master H is making waves in the music industry after releasing a teaser for his upcoming video featuring Jamaican reggae legend Capleton. Fresh off a successful 2024, the hardworking chanter is showing no signs of slowing down, with fans and industry players hailing his meteoric rise. Master H who […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "President vows to support local businesses, promote economic growth",
            "url": "https://www.chronicle.co.zw/president-vows-to-support-local-businesses-promote-economic-growth/",
            "content": "Farirai Machivenyika and Wallace Ruzvidzo, Herald Reporters\n\nAll Ministries should ensure that business does not suffer from prohibitive regulations as well as punitive administrative licences and fees, President Mnangagwa has said.\n\nIn his address at the First Meeting of the 2025 Cabinet Year on Tuesday, the President said instead of being restrictive, fees, licences, permits and regulations should promote economic development.\n\nTo enhance the overall performance of our economy, the Ease of Doing Business Agenda continues to be an important aspect of our programming.\n\nIn that regard, concerted efforts must be made to revisit all the areas that hinder the start or growth of all investments, whether local or foreign.\n\nI commend the entrepreneurial spirit among our people. By nature, Zimbabweans are hardworking, he said.Towards that end, Parliaments Portfolio Committee on Industry and Commerce yesterday convened to discuss the challenges faced by manufacturers and retailers in the formal sectors.\n\nConfederation of Zimbabwe Industries (CZI) chief economist Dr Cornelius Dube, said there is need for legislation requiring Government ministries, departments and agencies to procure a specific percentage of their goods and services from local suppliers to boost the economy.\n\nGovernment should come up with legislation or a statutory instrument that compels it to buy a prescribed threshold for its goods and services from local suppliers, he said.\n\nMr Denford Mutashu\n\nDr Dube argued that this measure would enhance competitiveness and boost demand for local products.Confederation of Zimbabwe Retailers (CZR) president Mr Denford Mutashu highlighted the unfair competition posed by informal traders.\n\nThere are a lot of regulations and cost centres that we are facing as formal traders that those in the informal sectors are not paying.\n\nThis makes our prices uncompetitive.The closure of formal businesses could negatively impact other sectors, such as banking and finance, due to a decline in deposits, he said.\n\nIn her presentation, Ms Rosemary Mpofu-Chikarakara chief executive officer of the Consumer Council of Zimbabwe (CCZ) stressed the importance of addressing exchange rate discrepancies, foreign exchange shortages, and market distortions that encourage arbitrage.The CCZ also wants smuggling stopped.Issues of porous border posts also need to be seriously dealt with and punitive (and) deterrent measures such as jail terms need to be introduced in order to curb these challenges.\n\nGovernment and the affected businesses can partner and aggressively invest and deploy advanced monitoring technologies, including drones, CCTV, and automated scanning systems, at all major border posts.\n\nAll imported products should abide by the rules, with no exemptions of who is importing. As long as there are other importers who are exempted from paying duty, loopholes will always be created and these products will then find their way both in the formal and informal market, creating an unfair playing field with the businesses that pay duties, the CCZ said.Portfolio Committee chairperson Cde Clemence Chiduwa acknowledged the concerns raised at the meeting.\n\nWe have taken note of the presentations and we will compile a report that we will table in the House for debate, he said.The Committee aims to find viable solutions to support the local industry and create a fair competitive environment.\n\nThe Government and the Reserve Bank have taken taken steps to formalise the informal sector as part of broader measures outlined in the 2025 Monetary Policy Statement announced last Thursday, aimed at enhancing Government tax revenues and stabilising the economy.\n\nA week earlier, Finance, Economic Development and Investment Promotion Professor Mthuli Ncube announced measures to rein the burgeoning informal sector that was threatening the survival of formal businesses.\n\nThe RBZ Monetary Policy emphasises the need for both the informal and formal sectors to align, creating a more cohesive economic environment.\n\nRBZ Governor Dr John Mushayavanhu is advocating for the integration of informal businesses into a system that includes dual currencies, bank accounts, and electronic payments, which is essential for achieving the Governments economic goals.Under the new regulations, items on a list of commonly smuggled goods will be presumed smuggled unless merchants can provide valid customs clearance.\n\nThis initiative places pressure on businesses to ensure compliance and legitimacy in their operations.Government will implement a presumptive retail-level VAT that manufacturers must collect when selling to small or informal businesses lacking tax clearance certificates.\n\nThis measure restricts wholesalers from engaging with unlicensed entities, further pushing informal businesses towards formalisation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-10-at-12.10.54-680x380.jpeg",
            "description": "Farirai Machivenyika and Wallace Ruzvidzo, Herald Reporters All Ministries should ensure that business does not suffer from prohibitive regulations as well as punitive administrative licences and fees, President Mnangagwa has said. In his address at the First Meeting of the 2025 Cabinet Year on Tuesday, the President said instead of being restrictive, fees, licences, permits […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Bosso boss breaks silence on ex-coach’s debt… ‘Sponsors promised to clear Brito debt’",
            "url": "https://www.chronicle.co.zw/bosso-boss-breaks-silence-on-ex-coachs-debt-sponsors-promised-to-clear-brito-debt/",
            "content": "Lovemore Dube,[emailprotected]\n\nHIGHLANDERS chairman Kenneth Mhlophe has said the club did not feature in its financials at the annual general meeting on January 26, the Baltemar Brito debt as there was a promise from the sponsors that it would be cleared before the meeting.\n\nThe popular Zimbabwe club had been given up to January 25 to have paid in full what it owed to former coaches or risk a ban on transfers.\n\nHighlanders were bailed out by Wicknell Chivhayo who has since paid the money and Fifa are expected to lift the transfer freeze.\n\nWhat angered members and sympathisers was that following the departure of Marvelous Chigumira, Godfrey Makaruse, Peter Muduhwa and Lynoth Chikuhwa to Scottland and some juniors, Highlanders would have struggled without the addition of new blood.\n\nLynoth Chikuhwa\n\nZimbabweans, especially Highlanders followers, were stunned when The Sunday Mail and Sunday News broke a story that the team had earned itself a Fifa transfer ban.\n\nThis was after the club had failed to clear the US$27 000 debt it owed to the former coach engaged in 2022, in circumstances that planted ill feelings within the Bosso power corridors. He was employed at a salary of US$10 000 and dismally failed to deliver, despite even US$1 000 winning bonus per match.\n\nUnder his care, Highlanders scored the least number of goals in over 30 years when the club top scorer ended the season with three and the club 24.\n\nBrito was owed US$14 778 with his assistant cum interpreter Antonio Joao Torres US$11 788 in allowances. In an interview yesterday, Mhlophe said the club had left the issue to the sponsors.\n\nWe engaged our sponsors over the issue. Going into the annual general meeting week, all appeared in place that the debt would have been paid and we counted on their usual support, said Mhlophe.\n\nSakunda and BetterBrands have been assisting Highlanders and have largely been the main reason why, despite not being a going concern, the club is still on its feet.\n\nHowever, without the two, Bosso would be reeling in even worse debts.When asked about the future of the club following the embarrassing incident in which it was eventually bailed out by millionaire Chivayo, who sprang to the rescue of the club on Sunday after our sister papers story, Mhlophe disclosed that Sakunda had committed to sponsoring the club.\n\nBetterBrands, he said, had reduced their involvement with Bosso to about US$300 000 to cater for first team bonuses.Last year they sponsored even junior teams, the Royals and development coaches.\n\nWe are happy as a club that Sakunda and BetterBrands have promised to stay on board with us. This is sweet news, BetterBrands are ploughing US$300 000 into the first team, said Mhlophe.\n\nSakunda Holdings\n\nAsked on why Highlanders were suffering financially despite having a gold mine in the mineral-rich Inyathi region, Mhlophe said when he took over from Johnfat Sibanda last year, there had been no movement in the venture he had started working on in his previous term as chairman.\n\nThere was no action at all on the mining venture. Things were still where I had left and we then began to chase paperwork. Right as we speak now, the papers have been lodged with the Ministry of Mines, once they respond we will be fine. To be honest, the mining venture is capital intensive requiring a lot of specialised machinery, financial outlay and expertise. Going forward, the club is seized with looking for investors, said Mhlophe.\n\nMhlophe said Highlanders is a football club with a dream and looked forward to working with partners on the mine project.Our dream is to be self-sufficient and the mine is one of the projects that could raise money for us. With the paperwork at Ministry of Mines, as soon as we get it, we will look for partners. We have no capital to start the project hence we will partner, and they will pay us an agreed percentage while we concentrate on football, which is what we are about, said Mhlophe.\n\nHe assured members that they will be reasonable in their share of the proceeds.The club has previously sought to have a 50-50 split without investing in the equipment and expertise in mining.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Kenneth-Mhlophe.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw HIGHLANDERS chairman Kenneth Mhlophe has said the club did not feature in its financials at the annual general meeting on January 26, the Baltemar Brito debt as there was a promise from the sponsors that it would be cleared before the meeting. The popular Zimbabwe club had been given up to January […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Bulawayo vendors protest as council moves to clear 5th Avenue marketplace",
            "url": "https://www.chronicle.co.zw/bulawayo-vendors-protest-as-council-moves-to-clear-5th-avenue-marketplace/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nBULAWAYO City Councils (BCC) decision to remove vendors from 5th Avenue and relocate them to Bhaktas Taxi Rank along Lobengula Street has sparked outrage among the traders, who argue that the new site is not a prime business location.\n\nFor years, the 5th Avenue Vegetable Market stretching from Joshua Mqabuko Nkomo Street to Robert Mugabe Way has been the citys hub for fresh produce.\n\nHowever, it has also been a point of contention, with municipal police frequently clashing with traders over illegal operations.According to the latest council report, councillors have resolved to disband the market and relocate all vendors operating there.The local authority cited operational risks as the primary reason for shutting down the trading site.\n\nDespite previous engagements with the Bulawayo Micro, Small, and Medium Enterprises (MSMEs) Working Group, which proposed alternative solutions, BCC has decided to proceed with the relocation. Consequently, no licence renewals will be issued for traders at 5th Avenue this year.\n\nIn interviews yesterday, vendors fear the move will cripple their businesses and disrupt their livelihoods.I have been selling here for the past 30 years. This business supports my family and I pay rent, school fees, and buy food with the money I earn. Now they want to take that away from us, said Ms Sithokozile Ncube.She also criticised the proposed site, arguing that it lacks the necessary foot traffic to sustain their businesses.\n\nAnother trader, Mr Thabani Ndlovu, echoed her concerns.We heard they want to allocate us to bays at Bhaktas, but who will buy our goods there? Very few people pass through that area, which means our sales will drop significantly.\n\nHe suggested that if the city council insists on relocating them, they should also accommodate wholesalers of fresh produce at the new site for convenience.\n\nBCC, in partnership with the Bulawayo Vendors and Traders Association (BVTA), Dan Church Aid, and UNDP Zimbabwe, has constructed a new market in Nkulumane to accommodate some vendors. However, traders insist that the location is unsuitable for business.\n\nChairperson of the National Small to Medium Enterprises (SMEs) Advisory Council under the Ministry of Women Affairs, Community, Small and Medium Enterprises, Mr Dumisani Ncube expressed strong opposition to the move.I disagree with this decision. It is ill-informed and will create more problems than it solves. We cannot allow a few people to make decisions that negatively affect about 4 000 vendors. I have already scheduled a meeting with the mayor next week to discuss the way forward, involving key stakeholders, including the Minister of State, he said.\n\n5th Avenue Vegetable Market\n\nOver time, 5th Avenue has evolved into an informal market where vendors sell not only fresh produce but also cooked food, groceries, second-hand clothes, and even goods from car boots.\n\nHowever, concerns have been raised about poor hygiene and the sale of illegal substances such as alcohol and marijuana.BCC has reaffirmed its stance, stating that the relocation process will proceed as planned. The council announced that traders who were licensed for 2024 will be given priority in securing spaces at the Bhaktas site, which will accommodate vendors selling fruits, vegetables, and clothing.\n\nA statement from BCC read: Subsequent allocations will be given to 5th Avenue traders who renewed their licenses before the Covid-19 pandemic in 2020. If spaces remain available, we will consider accommodating other former 5th Avenue traders, regardless of their license renewal status.\n\nThe council said its committed to prioritising the rapid development of safe workspaces at the Bhaktas site.The new site would strive to achieve an equitable balance among the diverse needs of MSMEs, encompassing clothing, fruits, vegetables, and various other goods, council said.\n\nThe council said it is committed to developing safe and sustainable workspaces at the Bhaktas site. However, as of 2024, no traders had occupied the new location, despite some having made advance payments.@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-16.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com BULAWAYO City Council’s (BCC) decision to remove vendors from 5th Avenue and relocate them to Bhakta’s Taxi Rank along Lobengula Street has sparked outrage among the traders, who argue that the new site is not a prime business location. For years, the 5th Avenue Vegetable Market stretching from Joshua Mqabuko Nkomo Street […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Hwange local authorities grapple with land shortage",
            "url": "https://www.chronicle.co.zw/hwange-local-authorities-grapple-with-land-shortage/",
            "content": "Leonorah Ncube in Victoria Falls\n\nTHE three local authorities in Hwange District, Matabeleland North Province are facing a critical shortage of land, which is hindering their ability to expand and implement much-needed housing projects.\n\nThis issue was raised during an interactive meeting with the Minister of Local Government and Public Works, Daniel Garwe, where councillors and management from Hwange Local Board (HLB), Hwange Rural District Council and Victoria Falls City Council outlined key challenges affecting their operations.\n\nDuring the meeting, the local authorities expressed concern over the lack of available land for housing projects, which has intensified demand for residential stands.\n\nVictoria Falls City finance director, Mr Neville Ndlovu, said the city is struggling to address its growing housing backlog due to land constraints.\n\nWhen we availed 502 residential stands, there was a significant outcry because demand far exceeds supply. We have reached our limit and are appealing for government assistance so that we can address this issue and bring peace to our community, he said.\n\nHwange Local Board (HLB) and Zimbabwe National Water Authority (Zinwa)\n\nCouncillors from Hwange RDC and HLB echoed similar sentiments, saying there is an urgent need for land expansion.HLB Councillor Peterson Ncube called for the Governments intervention to allocate more land to the local board, particularly given that a significant portion of the remaining land is mountainous and unsuitable for development.\n\nWe urgently request an expansion into Hwange RDC because over 30 percent of the available land is not developable. We need more land to accommodate our growing population and infrastructure needs, said Clr Ncube.Beyond land shortages, the local authorities cited high operational costs, fluctuating exchange rates, and persistent cash flow challenges as major hurdles.\n\nService providers, particularly fuel suppliers, reportedly demand payment in foreign currency, further straining the councils financial resources.\n\nIn cases where suppliers accept the local currency, inflated exchange rates create additional financial burdens.Moreover, delays and inadequate disbursement of Devolution Funds are hampering service delivery. Victoria Falls City Council representatives noted that late disbursements make it difficult for local authorities to execute planned projects efficiently.\n\nLow revenue collection from residents also compounds the financial strain.HLB town engineer Ndabezinhle Thwala revealed that the local authority is struggling to settle debts, exacerbated by Zesas recent installation of a prepaid meter at the councils sewer plant without prior notice.\n\nWe are working to revive our solar plant because we are failing to pay electricity bills.The main sewer treatment plant requires about US$500 million for resuscitation, he said.Minister Garwe acknowledged the land shortage issue but cautioned that not all requests could be met due to limited availability.\n\nWe will allocate land, but not as much as you are requesting because there simply isnt enough. Instead, lets focus on building vertically to maximise space. Victoria Falls City, we have received reports that you have been prioritising people from Harare and Bulawayo over locals, he said.\n\nThe minister said a certain quota must be reserved for local residents. Minister Garwe also assured councillors that the Government is working on improving their welfare, following President Mnangagwas approval of a review of their conditions of service, which is expected to be implemented soon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-30-2.jpg",
            "description": "Leonorah Ncube in Victoria Falls THE three local authorities in Hwange District, Matabeleland North Province are facing a critical shortage of land, which is hindering their ability to expand and implement much-needed housing projects. This issue was raised during an interactive meeting with the Minister of Local Government and Public Works, Daniel Garwe, where councillors […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zimbabwe to correct wrong narrative in Geneva",
            "url": "https://www.chronicle.co.zw/zimbabwe-to-correct-wrong-narrative-in-geneva/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nZIMBABWE Ambassador-designate to the United Nations Office in Geneva Ever Mlilo has pledged to further the countrys interests as well as correct the negative narrative pushed by the countrys erstwhile detractors during her tenure in Switzerland.\n\nThe newly-appointed Permanent Representative to the UN Office in Geneva yesterday paid a courtesy call on President Mnangagwa, where she was briefed on her tasks.\n\nIn an interview after her meeting with the President, Ambassador Mlilo said in addition to pursuing the countrys economic development interests, she would use every means to correct the countrys narrative on the global stage.\n\nPresident Mnangagwa\n\nI will be advancing the cause of Zimbabwe, the interests of Zimbabwe, increasing the visibility of Zimbabwe in the international forum.\n\nI will also be pursuing economic development as it is guided by our mantra, Zimbabwe is Open for Business, we are open to business, and also to correct the wrong narrative that is out there about Zimbabwe.\n\nWe need to tell them who we are and what we stand for, and we are going to use every means to correct the narrative, especially at the United Nations Human Rights Council, and the International Labour Organisation, she said.\n\nAmbassador Mlilos mission to Geneva is her first diplomatic posting.It is a moment of tremendous privilege.. . It is an honour that has been bestowed on me by His Excellency the President to represent him in this capacity and the great nation of Zimbabwe.\n\nI am grateful and I am forever indebted to him, she said.Mrs Mlilo said she was confident that her expansive career in the Zimbabwe Republic Police and as a legal officer prior to her diplomatic posting, would help her in the discharge of duties.\n\nI am a legal officer by profession and I have served in the police force for 20 years. I think that is requisite experience that will see me execute the duties as they have been instructed by His Excellency, she said.Ambassador Mlilo also had some words of encouragement for the girl child.\n\nIt takes hard work to leave a mark, where you have been given an opportunity to execute a duty, do it to the best of your ability... have a good leader, our President will always recognise where good work is, she said.Mrs Mlilo then narrated her career from her early school days, up until she was called from retirement by President Mnangagwa for the diplomatic mission.\n\nI went to school in Bulawayo, then finished at Queen Elizabeth (in Harare), joined the police force at a very young age, trained as a lawyer and I was already serving in the police force, rose through the ranks in the police force until I was a Commissioner and Director of Legal Services, then I retired to do lecturing and farming. And I was recalled by His Excellency to serve the country, said the mother of two.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-34.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau   ZIMBABWE Ambassador-designate to the United Nations Office in Geneva Ever Mlilo has pledged to further the country’s interests as well as correct the negative narrative pushed by the country’s erstwhile detractors during her tenure in Switzerland. The newly-appointed Permanent Representative to the UN Office in Geneva yesterday paid a courtesy […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Chimbetu-inspired Dendera musician vows to keep genre alive",
            "url": "https://www.chronicle.co.zw/chimbetu-inspired-dendera-musician-vows-to-keep-genre-alive/",
            "content": "Amos Mpofu,[emailprotected]\n\nRising Bulawayo-based Dendera musician Evidence Basa has vowed to preserve and elevate the Dendera music genre alongside the Chimbetu family.\n\nBasa is determined to carve his own path in the music industry and take the sound of Dendera to new heights.Born in 1995 in Masvingo, Basas musical journey began during his school years at Zvinavashe Primary School and Firomumwe Secondary School in Gutu, where his passion for music flourished.\n\nI started my journey in music in Form 2. I was known as the best student in music, which was an extracurricular activity at school.\n\nInspired by Sulumani Chimbetu, Basa formed a dance group, Dendera Boys, which performed Chimbetus songs at events. After finishing school, he had the opportunity to attend Sulumanis shows and learn from the Dendera music master.\n\nSulumani inspired me to venture into music after school, Basa said.His career began to take shape when he joined Kombo Super Sounds in Bulawayo as a backing vocalist from 2014 to 2015.\n\nSulumani Chimbetu\n\nHe later worked with the Zimbabwe Prisons and Correctional Services (ZPCS) band in Ntabazinduna, where he further honed his Dendera skills. He left the band in 2017 after finding a job in Bulawayo but returned to music in 2022, recording his debut single, Varangana, at Afro Record, D T Bio Mudimbas studio. The song became a hit, gaining significant airtime on ZBCtv.In 2023, Basa released Vana Vangu, further establishing his presence in the Dendera scene.\n\nPeople really love the song, especially when I perform it live, he said.Continuing to expand his music portfolio, Basa released Mufaro Wangu in 2024, for which he is working on a music video, and dropped his fourth single, Mutupo Wangu, last week, believing it will play a key role in elevating his career this year.Basa is also eager to collaborate with Sulumani Chimbetu, his biggest inspiration.\n\nIm a musician who loves working with others. Im working with a group called Hosso King Boys, and were preparing to release a song and video together. My ultimate goal, however, is to collaborate with Sulumani in live performances and studio recordings to push the Dendera genre forward.\n\nHe also praised the late Simon Chopper Chimbetu, whose contributions laid the foundation for the genre.Im loyal to the words of Simon Chimbetu that Dendera is not just for the Chimbetu family, but a genre anyone can join, he said.\n\nBasa highlighted that while Dendera is often associated with the Chimbetu family, it is a genre with a rich history, boasting over 30 talented musicians, including Charles Pintec, Brian Warambwa, and Paddington Kamusaka.\n\nThe musician is grateful for the opportunities he has had, including performing at a Zanu PF-organised anti-sanctions gala in Esigodini last October.\n\nI was the first to perform at the gala, and it was an incredible experience to perform for such a large audience. It was a chance to showcase my abilities and connect with people passionate about Dendera music, he said.Describing himself as a talented dancer and creative artiste, Basa is confident that, with the support of his fans and the industry, he will reach new heights.\n\nI am ready to take Dendera music to the next level, and with my supporters by my side, I know I can make it happen, he concluded.For Basa, the future is bright, and he is determined to ensure that the Dendera genre remains alive and thriving for years to\n\ncome.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-18.jpg",
            "description": "Amos Mpofu, mpofuamos41@gmail.com Rising Bulawayo-based Dendera musician Evidence Basa has vowed to preserve and elevate the Dendera music genre alongside the Chimbetu family. Basa is determined to carve his own path in the music industry and take the sound of Dendera to new heights. Born in 1995 in Masvingo, Basa’s musical journey began during his […]",
            "time": "09:46",
            "date": "13 Feb 2025"
        }
    ]
}