{
    "news": [
        {
            "title": "ZITF 2025  shatters  records . . . Exhibition space runs out",
            "url": "https://www.chronicle.co.zw/zitf-2025-shatters-records-exhibition-space-runs-out/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nTHE Zimbabwe International Trade Fair (ZITF) has exceeded its exhibition space capacity ahead of this years edition, following a record-breaking surge in interest from both new and returning exhibitors, local and international alike, thereby solidifying Zimbabwes status as a leading trade and investment destination.\n\nBy Wednesday, an impressive 596 exhibitors had confirmed their participation, just shy of the 600 mark, with 112 of these being first-time participants. The figures reflect renewed confidence in the ZITF brand and optimism about Zimbabwes trade prospects. With traditional exhibition space now fully subscribed, organisers have moved to create additional space to meet the overwhelming demand.\n\nZITF Company board chairperson, Mr Busisa Moyo, announced the milestone during a media briefing yesterday, describing the 2025 edition as one of the most promising in the events 65-year history.\n\nTraditional exhibition space is 100 percent full, and the ZITF Company has prepared extra space to accommodate the high volume of exhibitors, standing at 596. Direct exhibitors have now taken up 51 204, 62 square metres of exhibition space, he said.\n\nThis years trade fair, set to run from 21 to 26 April at the Zimbabwe International Exhibition Centre, will be held under the theme Industrialisation: Crafting an Integrated Economic Landscape. It aims to bring together a dynamic mix of policymakers, industry leaders, investors, innovators, and small to medium enterprises under one roof.\n\nMr Moyo noted that the 2025 edition has seen unprecedented international interest, with 28 countries confirmed to participate  an increase from last years 27. A total of 45 direct international exhibitors are expected. Confirmed countries include Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the EU Delegation, Egypt, Ethiopia, France, Germany, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the United Kingdom, the United States, the United Arab Emirates and Zambia.\n\nMr Moyo said ZITFs international appeal continues to grow, with more countries and global firms identifying Zimbabwe as a gateway to new markets and regional partnerships.\n\nWe can confirm the participation of 45 direct international exhibitors, with 28 countries represented in the show  an encouraging rise from last years 27, he said.\n\nAdding prestige to the event, the President of Mozambique, His Excellency Daniel Chapo, is set to officially open the trade fair next Friday, an occasion expected to further deepen economic ties between Zimbabwe and its regional neighbours.\n\nZITFs exponential growth is also a significant win for Bulawayo, the countrys second-largest city, which once again takes centre stage as a hub for regional commerce and industrial dialogue.\n\nThe Minister of State for Bulawayo Provincial Affairs and Devolution, Judith Ncube, expressed satisfaction with the preparations and noted that interest remains high, with bookings still trickling in.\n\nAs host city, Bulawayo is ready to welcome this years edition of ZITF. What excites me most is the high number of foreign countries that have come on board. The ZITF chief executive officer, Dr Nicholas Ndebele, briefed me on this development, she said.\n\nMr Moyo also emphasised that ZITFs success hinges on an ecosystem approach, involving collaboration with key local stakeholders, from the hospitality sector and security services to emergency response teams, all of whom have confirmed their readiness.\n\nWe have already received assurance from stakeholders in the hospitality industry, emergency services and security services, among others that they are fully prepared for the show, he said.\n\nMore than just an annual fixture, ZITF is increasingly viewed as a strategic platform that supports Government efforts to attract foreign direct investment and accelerate the countrys industrialisation drive.\n\nThe fair offers a rare convergence of multi-sectoral representation, enabling stakeholders from manufacturing, ICT, mining, agriculture and services to connect, collaborate and compete on both regional and global stages.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gesfrs.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter THE Zimbabwe International Trade Fair (ZITF) has exceeded its exhibition space capacity ahead of this year’s edition, following a record-breaking surge in interest from both new and returning exhibitors, local and international alike, thereby solidifying Zimbabwe’s status as a leading trade and investment destination. By Wednesday, an impressive 596 exhibitors had […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Zim, Belarus to boost bilateral relations",
            "url": "https://www.chronicle.co.zw/zim-belarus-to-boost-bilateral-relations/",
            "content": "Wallace Ruzvidzo\n\nZIMBABWE and Belarus are exploring various avenues to accelerate bilateral relations across all sectors for the mutual benefit of both nations, Belarusian Deputy Prime Minister Viktor Karankevich has said.\n\nDeputy PM Karankevich yesterday paid a courtesy call on President Mnangagwa at State House in Harare following his arrival in the country on a working visit aimed at strengthening bilateral relations and broadening economic and technical co-operation earlier this week. Zimbabwe and Belarus traditionally enjoy excellent relations that have seen the exchange of high-level visits, increased political and economic co-operation, and deepened collaborative efforts between the two countries at multilateral fora.\n\nIn an interview after a closed-door meeting with President Mnangagwa, Deputy PM Karankevich said Belarus was proud to be in various partnerships with Zimbabwe.\n\nWith the distinguished President of Zimbabwe, His Excellency President Mnangagwa, we have sincerely discussed all the possibilities for further fast-tracking bilateral relations in every particular sphere in order to make sure we increase the benefits to the population of the two countries, he said.\n\nPresident Mnangagwa\n\nHarare and Minsk have ongoing co-operation frameworks in agriculture, industrial production, education, energy, transport, and facilitation of investment.\n\nBelarus is very proud to be part of strategically important joint ventures for the benefit of the two peoples of the countries . . . and from our side, we are ready to reconfirm readiness to implement all the projects of interest to the Zimbabwean side, as well as implement the new ones that would be upcoming, he said.\n\nDeputy PM Karankevich said the two countries are presently actioning agreements entered into by Presidents Mnangagwa and Aleksandr Lukashenko of Belarus.\n\nYesterday (Tuesday), we were planning meetings on the level of the heads of the ministers. Today (yesterday) we are planning the Joint Commission meeting session, headed by the Ministers of Foreign Affairs, where we are going to consider all the agreements agreed and implemented by the Heads of the State, where it is necessary to fast-track the implementation of bilateral relations, as well as determine the new directions of bilateral development co-operation in the future for the benefit of the populations of Zimbabwe and Belarus, he said.\n\nDeputy PM Karankevich said the increased co-operation between Zimbabwe and Belarus continues to bear fruit and the results speak for themselves.\n\nWe already note that we have the positive experience of implementing the earlier agreed agreements between the Heads of State of Zimbabwe and Belarus in the past. I am talking about the implementation of the joint programme of agricultural system modernisation of Zimbabwe. The beginning of this programme started in 2020 ushered by the two Presidents; the results speak for themselves.\n\nIt is a pleasure to mention that currently we are implementing the third phase of the current programme, within the framework of which we are planning to supply to Zimbabwe agricultural machinery, he said. The two countries this week convened a Mid-Term Review of their Joint Permanent Commission on Co-operation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hdff.jpg",
            "description": "Wallace Ruzvidzo  ZIMBABWE and Belarus are exploring various avenues to accelerate bilateral relations across all sectors for the mutual benefit of both nations, Belarusian Deputy Prime Minister Viktor Karankevich has said. Deputy PM Karankevich yesterday paid a courtesy call on President Mnangagwa at State House in Harare following his arrival in the country on a […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Gokwe takes centre stage as Zim turns 45",
            "url": "https://www.chronicle.co.zw/gokwe-takes-centre-stage-as-zim-turns-45/",
            "content": "Chronicle Writers\n\nTHE stage is set for Zimbabwes 45th Independence Day commemorations, as all systems are ready for the main events taking place at Mutora Business Centre in Nembudziya, Gokwe North District, Midlands Province.\n\nAt the main venue, organisers were yesterday putting final touches in place ahead of todays Childrens Party and tomorrows official Independence Day proceedings. The Childrens Party will be hosted by President Mnangagwa at Nyamuroro High School, also located in Mutora.\n\nThis years celebrations are running under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030, which underscores the Second Republics dedication to inclusive national development and the decentralisation of key State events.\n\nYesterday, contractors were busy adding final touches to infrastructure ahead of the milestone event. A major highlight of todays programme is the lighting of the Independence Flame at Sikombela Detention Centre  a revered historical site now being developed into a national monument. Vice President Kembo Mohadi is expected to officiate at the flame-lighting ceremony before the symbolic fire is transferred to Mutora for the main event.\n\nPermanent Secretary for Midlands Provincial Affairs and Devolution, Dr Edgars Seenza, said all is set for the commemorations.\n\nAs far as the level of preparedness is concerned, over 3 000 children set to attend the Childrens Party have arrived. The event will be held at Nyamuroro High School, where two new hostels for boys and girls have been constructed. So, I can safely say that we are ready to host the Independence Day celebrations, as all proposed infrastructure developments have been completed. Staff are now simply sprucing up the venue.\n\nDr Seenza further noted that all developments at Nyamuroro High School, including a new School Business Unit, are complete. At the open space designated for the main event, changing rooms and ablution facilities have been established.\n\nThe main venue, which is a football pitch, was completed on time. The lawn is lush and green, and the newly constructed terraces are filled with people enjoying the rehearsals, said Dr Seenza.\n\nDirector for the southern region at National Museums and Monuments, Mr Lovemore Mandima, said all was in place for the lighting of the Independence Flame at Sikombela.\n\nThe flame will be lit by Vice President Kembo Mohadi. This is symbolic of love, bravery, kindness and, most importantly, unity, virtues displayed by the gallant sons and daughters of Zimbabwe during the liberation struggle. The flame reminds us to keep the light of freedom burning. From Sikombela, it will be transported to Mutora for the national commemorations, he said.\n\nThe celebrations have sparked a wave of excitement among Gokwe residents, who praised the developmental impact the event has brought to their community. Gokwe-Nembudziya legislator Cde Flora Buka said the community was elated to host the national event.\n\nWe are very happy as a community to host these national celebrations. Theyve ushered in significant changes  our schools now boast impressive features, she said.\n\nChief Chireya echoed the sentiment: This is a proud moment for us. The President has brought development right to our doorstep, and local businesses are thriving. We are grateful.\n\nAcross the country, preparations for decentralised celebrations are also well underway. In Bulawayo, White City Stadium will host the provincial Independence Day festivities. Provincial Affairs and Devolution Permanent Secretary Mr Paul Nyoni said logistical arrangements were nearly complete.\n\nWere 99 percent ready. 20 buses have been secured to ferry people to the stadium, and the military is finalising parade drills. The day will conclude with a cultural showcase and a football match between Highlanders and Chicken Inn, he said.\n\nSeven buses will also transport Bulawayo representatives to the main celebrations in Gokwe, including pupils from various schools.\n\nThis is a day of national pride. Citizens should take part and listen to the Presidents message as we mark 45 years of independence and self-determination, said Mr Nyoni.\n\nIn Matabeleland South, Plumtree is preparing to host its first-ever provincial Independence celebrations at the Plumtree School Pavilion Grounds, where over 5 000 attendees are expected. Acting Mangwe DCC chairperson, Mrs Ruth Saurava, said all final arrangements were being made, with budgets and allocations already approved. Minister of State for Provincial Affairs and Devolution, Cde Albert Nguluvhe, is expected to officiate the provincial commemorations, which honour Zimbabwes liberation journey and developmental milestones.\n\nMeanwhile, in Matabeleland North Province, Tsholotsho is ready to host provincial celebrations at the Tsholotsho Business Centre. Ten buses have been organised to ferry people from all seven districts of the province. Matabeleland North Provincial Affairs and Devolution Minister, Richard Moyo, confirmed that preparations are complete, with key service providers stepping in to ensure the event runs smoothly.\n\nZETDC has pledged uninterrupted electricity supply, while Zinwa is handling water logistics.\n\nLarge corporates such as Hwange Colliery Company have come on board to provide mobile toilets, tents and chairs for this momentous occasion, as the nation celebrates 45 years of self-rule after a protracted liberation struggle, said Minister Moyo.\n\nFestivities in the province begin today with a Childrens Party at Tsholotsho High School, where Minister Moyo will interact with young people from across the province.\n\nThe people of Matabeleland North are thrilled. Our defence forces have been rehearsing at the main venue and the atmosphere is electric, he said.\n\nMinister Moyo applauded the Second Republics rotational hosting policy, saying it has brought real benefits to communities that were previously overlooked in major national affairs.\n\nWhen the Second Republic came in, it introduced the policy of rotating both provincial and national events. Its a hallmark of President Mnangagwas vision  to ensure no one and no place is left behind while unlocking developmental and economic opportunities for host districts, said Minister Moyo.\n\nAs part of preparations, Tsholotsho Rural District Council, with support from other local authorities like Umguza and Nkayi, has rehabilitated the TshefunyeTsholotsho Business Centre Road, which had become impassable due to recent rains.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/sfgdg.jpg",
            "description": "Chronicle Writers THE stage is set for Zimbabwe’s 45th Independence Day commemorations, as all systems are ready for the main events taking place at Mutora Business Centre in Nembudziya, Gokwe North District, Midlands Province. At the main venue, organisers were yesterday putting final touches in place ahead of today’s Children’s Party and tomorrow’s official Independence […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "‘He left, but his spirit stayed’…Tshabangu on life-altering  connection with Majaivana",
            "url": "https://www.chronicle.co.zw/he-left-but-his-spirit-stayed-tshabangu-on-life-altering-connection-with-majaivana/",
            "content": "Trust Khosa,Zimpapers Arts and Entertainment Hub\n\nSOME encounters change a life forever, moments so profound they leave an indelible mark on ones soul. For veteran Mbaqanga and Afro-jazz artiste Lwazi Tshabangu, that life-altering moment came when he crossed paths with the legend, Lovemore Majaivana Tshuma.\n\nNow 54, Tshabangu still speaks with a hushed reverence as he recalls those few precious months working with the elusive, US-based icon  a man who once stirred the hearts of Zimbabweans with his rich voice and timeless storytelling.\n\nGrowing up in Bulawayo, Majaivana was a beacon, a giant we all looked up to. He was our idol. Every child, every aspiring musician, revered him. To eventually share a stage with him was nothing short of divine, Tshabangu said.\n\nThe seasoned crooner, dancer, and pianist met Majaivana at a crucial juncture, not just in the legends career, but in his own formative years as an artiste. That moment, he insists, was not by chance, but by Gods favour and grace.\n\nI met him through Albert Nyathi, who connected me when Majaivana was looking for a backing vocalist. We worked together for several months, and it was during that period that I truly understood music, not just how to play it, but how to live it. He never carried the weight of his legendary status. He always made us feel at home, and in doing so, he earned our respect.\n\nYet, like many beautiful things, their time together was fleeting. Tshabangu recalled, with a heavy heart, how things took an unexpected turn. Shortly after Majaivana left for the United States, the music, once vibrant and full of promise, fell silent. He found himself stepping away from the very path he had only just begun to walk.\n\nWhen he left Zimbabwe for the US, it felt like a chapter closed too soon. We never got the chance to record a song together. Its a regret I carry to this day. To me, it was like losing a big brother. I had no choice but to move on and forge my own path, but he is the one who truly ordained me.\n\nAlthough decades have passed and silence has grown between them, Tshabangu says Majaivanas spirit never left him.\n\nLovemore Majaivana\n\nI havent heard from him since the day he left  more than two decades ago. Our last conversation still echoes in my mind like a song that never quite ended. Each time I perform his songs; Isono Sami, Umoya, Angila Mali, Emagumeni, I feel his presence. Its not imitation; its communion. Through the music, I still speak to him.\n\nFans, too, feel that lingering connection. At every show, the requests flood in for Majaivana, for the old songs, for memories.\n\nIt means something, doesnt it? That after all these years, the people still remember. They still want to feel what he made them feel.\n\nTshabangu has walked his own path since then, curating musical shows in the early 2000s, performing across Zimbabwe, and growing a loyal following. His two albums, Kumnyama (2001) and Ithuba Lami (2005), have carried his voice to appreciative ears, and new recordings are in the works.\n\nI may not have many albums, but my music is honest. It tells my story, and those who listen understand it. Im working on a few new recordings, and deep down, I believe they will resonate with many hearts out there, he said.\n\nFor nearly two decades, Tshabangu has performed at hotel venues and private events, particularly at Cresta Jameson in Harare, which he hopes to make his permanent base. His band, comprised of long-time collaborators Thomas Chibwe on lead guitar, Evans Fifteen on bass, Carlton on keyboards, and Tapiwa Chisvo on drums, feels more like family than crew.\n\nI met Thomas in 2005, Evans in 2006, and Tapiwa was a session musician when we first worked together. Now, were a team. Weve seen it all, he reflected.\n\nOff stage, he is a father of two, a mentor to young musicians, and a vessel of a generations memories.\n\nI owe a lot to Majaivana. He didnt just work with me, he ordained me. Thats what it felt like. He gave me a blessing I didnt even realise I needed at the time.\n\nTshabangus story is not just about music, it is about torch-bearing, about carrying forward a light kindled by a legend. And though Majaivana may be thousands of miles away, his spirit lives on in the chords, the lyrics, and in the hearts of those, like Tshabangu, who still believe in the magic of music that tells our stories.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/jfjtfbd.jpg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub SOME encounters change a life forever, moments so profound they leave an indelible mark on one’s soul. For veteran Mbaqanga and Afro-jazz artiste Lwazi Tshabangu, that life-altering moment came when he crossed paths with the legend, Lovemore “Majaivana” Tshuma. Now 54, Tshabangu still speaks with a hushed reverence as […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "ZSE presses ahead  with plans to self-list",
            "url": "https://www.chronicle.co.zw/zse-presses-ahead-with-plans-to-self-list/",
            "content": "Business Reporter\n\nTHE Zimbabwe Stock Exchange (ZSE) has announced progressive discussions with relevant regulatory authorities regarding its scheme of reconstruction, which will, among other things, culminate in its self-listing on the ZSE main board.\n\nAt an extraordinary general meeting held on 9 October 2024, shareholders unanimously agreed to the transaction in which Zimbabwe Stock Exchange Holdings Limited (ZSE Holdings), a newly incorporated entity, will make a buy-out offer to the shareholders of the ZSE. They will be settled pari passu at an exchange ratio of one ZSE Limited Ordinary share for one ZSE Holdings Ordinary share.\n\nAccording to the ZSE, the reconstruction will significantly alter the corporate structure and governance of both entities.\n\nIn a statement to shareholders, the ZSE said that since positive outcomes from these discussions are anticipated, the company is already in the process of compiling a pre-listing statement.\n\nShareholders are advised that there have been progressive discussions between the company and the relevant regulatory authorities regarding obtaining regulatory approvals. These are from the Zimbabwe Revenue Authority (Zimra) in respect of the Scheme of Reconstruction and the Securities and Exchange Commission of Zimbabwe (SecZim) in terms of amendments to the Self-Listing Rules (Statutory Instrument 147 of 2024), for which positive outcomes are expected in the near future, the ZSE said.\n\nThe company added that it is already in the process of compiling a pre-listing statement in respect of its proposed listing, the publication of which will be triggered by the aforementioned regulatory approvals.\n\nShareholders will therefore be provided with regular updates on progress as regards the fulfilment of any conditions precedent, prior to the release of thePre-Listing Statement, the ZSE said.\n\nAccording to the ZSE, the primary goal of the scheme of reconstruction is to streamline operations, improve liquidity, and unlock shareholder value through the creation of a more robust corporate entity. Following the transaction, the shareholders of ZSE Limited will receive the entire issued ordinary shares of ZSE Holdings.\n\nThe purpose of incorporating ZSE Holdings Limited was to create a listable holding company that would control a collapsed existing structure of ZSE Limited, the ZSE said in an earlier circular, adding that this reorganisation will enable a smooth transfer of shareholding from ZSE Limited and VFEX to ZSE Holdings.\n\nThe operations of both the ZSE and VFEX will remain independent due to separate securities exchange licences.\n\nThe two entities will operate under ZSE Holdings, facilitating the introduction of new products and services while maintaining regulatory compliance.\n\nThe ZSE is also urging its shareholders to submit their share certificates for the dematerialisation process, which is part of preparations for the listing of ZSE Limited on the stock exchange.\n\nDematerialisation is the process of converting physical securities into electronic or digital form, and the ZSE Depository has been actively promoting the switch from physical certificates to electronic holdings.\n\nThe ZSE is also working on a number of initiatives that include reducing the settlement cycle to T+2.\n\nIn its recent newsletter for the first quarter of 2025, the ZSE said that as of 31 March 2025, market tests for the T+2 settlement cycle had been completed and approval had been granted by SecZim to proceed with the implementation. T+2 is expected to go live in April 2025.\n\nA reduced settlement cycle will result in a reduction in the number of days between trade execution and settlement, which will reduce counter-party, market, operational, and credit risk across the settlement ecosystem, especially during periods of market volatility.\n\nInvestors will also benefit from earlier receipt of their funds, thus reducing the risk of loss of value due to adverse macroeconomic movements, and faster settlements will enhance investor confidence in the market.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/02/ZSE.jpg",
            "description": "Business Reporter THE Zimbabwe Stock Exchange (ZSE) has announced progressive discussions with relevant regulatory authorities regarding its scheme of reconstruction, which will, among other things, culminate in its self-listing on the ZSE main board. At an extraordinary general meeting held on 9 October 2024, shareholders unanimously agreed to the transaction in which Zimbabwe Stock Exchange […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Zimbabwe U21 hockey teams eye World Cup slots in Namibia",
            "url": "https://www.chronicle.co.zw/zimbabwe-u21-hockey-teams-eye-world-cup-slots-in-namibia/",
            "content": "Brandon Moyo,Zimpapers Sports Hub\n\nZimbabwes Under-21 hockey teams are brimming with belief ahead of the 2025 Junior Africa Cup, which runs from tomorrow to April 25 in Windhoek, Namibia.\n\nCaptains of both the mens and womens teams have expressed confidence in their squads readiness to perform and represent the nation with pride at the continental tournament. The mens side will be led by Mutsawashe Kanyangarara, while Tinodiwanashe Elijah will skipper the womens team.\n\nKanyangarara said morale is high in camp, and the players are eager to take to the turf after weeks of intense training.\n\nThe energy levels are high. In Egypt it was a tough one, but theres a lot we learned. We have a few players who were at the previous tournament. We are grateful, we are happy and we are ready to go. Coach Prince (Mwale) has really been good. Weve put in a lot of practice. The gents have been pulling up to training, and everyone has been committed. Even the guys whove been out of the country  we stayed in touch, kept our camp going, kept everyone going and motivated, said Kanyangarara.\n\nElijah echoed the optimism, noting that experience gained from previous appearances will be invaluable this time around.\n\nHaving played the Africa Cup three times, we are excited. We have good experience under our belt and we are ready for the competition. Thank you for the support. I hope we make you proud and we will do our best, she said.\n\nZimbabwe Under-21 mens hockey team\n\nAt stake are the final three mens and womens spots for the upcoming FIH Junior Hockey World Cups 2025, to be held in India (mens) and Chile (womens). The global tournament will, for the first time, feature an expanded format with 24 teams in each competition.\n\nIn the mens division, Africas challenge will come from Egypt, Kenya, Namibia, Nigeria, South Africa, Zambia and Zimbabwe  all vying for three coveted World Cup berths.\n\nThe teams are split into two pools. Pool A features Kenya, Namibia, Nigeria and South Africa. Zimbabwe are in Pool B alongside Egypt and Zambia. Each team will face the others in their pool once, with the top two sides progressing to the semi-finals.\n\nSemi-final winners will not only reach the final but also automatically qualify for the FIH Hockey Mens Junior World Cup India 2025. The losing semi-finalists will battle it out in the bronze medal match, with the winner claiming the final African ticket to the global stage.\n\nOn the womens side, Kenya, Namibia, South Africa, Uganda, Zambia and Zimbabwe will compete for three World Cup spots.\n\nThe six teams are also split into two pools. Pool A includes Namibia, South Africa and Uganda, while Pool B features Kenya, Zambia and Zimbabwe. As with the mens tournament, the top two teams from each group will proceed to the semi-finals.\n\nThe two semi-final winners will qualify for both the final and the FIH Hockey Womens Junior World Cup Chile 2025, while the bronze medal winner will claim the last World Cup berth.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fgdfxfsz.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub Zimbabwe’s Under-21 hockey teams are brimming with belief ahead of the 2025 Junior Africa Cup, which runs from tomorrow to April 25 in Windhoek, Namibia. Captains of both the men’s and women’s teams have expressed confidence in their squads’ readiness to perform and represent the nation with pride at the continental […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "COMMENT: Police must stop Nust panners now",
            "url": "https://www.chronicle.co.zw/comment-police-must-stop-nust-panners-now/",
            "content": "THE news coming from the National University of Science and Technology (Nust) is deeply troubling. The brazen invasion of the campus by illegal gold panners represents not only a flagrant disregard for property rights but also a direct assault on an institution of higher learning and the vital work it undertakes.\n\nIt is an encroachment that cannot be tolerated and demands a robust and unwavering response from the authorities.\n\nThe reports of land degradation and clashes with university security paint a grim picture of the disruption these illegal activities are causing.\n\nA university campus, a sanctuary for academic pursuit and intellectual growth, is being transformed into a battleground, its precious land scarred by the indiscriminate digging of those seeking illicit gain.\n\nThis not only undermines the aesthetic integrity of the institution but also poses a tangible threat to the safety and security of students, faculty and staff.\n\nWhile the universitys recourse to the police is a welcome step, the continued presence of these panners suggests that current measures are insufficient.\n\nThe cycle of arrests followed by further incursions is a clear indication that a more forceful and sustained approach is urgently required.\n\nThe police must not only conduct regular raids but also implement strategies to deter these illegal activities at their root.\n\nThis necessitates a commitment to thorough investigations, leading to the prosecution of those involved, and the imposition of penalties that serve as a genuine disincentive.\n\nThe environmental damage being inflicted upon the Nust campus is also a matter of grave concern. Indiscriminate panning can lead to soil erosion, water pollution, and the destruction of natural habitats.\n\nThis short-sighted pursuit of personal profit comes at a significant cost to the long-term health of the land and the broader environment.\n\nWe therefore urge the police to come down hard on these illegal panners.\n\nThis is not merely a matter of protecting university property; it is about upholding the rule of law, safeguarding our educational institutions,and preserving the environment for future generations.\n\nA strong and decisive response will send a clear message that such blatant disregard for the law will not be tolerated.\n\nThe future of Nust, and indeed the integrity of our societal structures, depends on it.\n\nIt is time for firm action to reclaim the campus and ensure that it remains a place of learning and progress, free from the destructive influence of illegal activities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-40-1.jpg",
            "description": "THE news coming from the National University of Science and Technology (Nust) is deeply troubling. The brazen invasion of the campus by illegal gold panners represents not only a flagrant disregard for property rights but also a direct assault on an institution of higher learning and the vital work it undertakes.  It is an encroachment […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Uhuru derby fireworks for Bulawayo",
            "url": "https://www.chronicle.co.zw/uhuru-derby-fireworks-for-bulawayo/",
            "content": "Fungai Muderere,Zimpapers Sports Hub\n\nTWO of the City of Kings and Queens football powerhouses, Highlanders and Chicken Inn, are set to light up White City Stadium tomorrow in a fiery local derby that will headline Bulawayos Independence Day celebrations.\n\nWith the country marking 45 years of self-rule, football once again takes centre stage as a unifying force  and nothing spells local pride better than a Bosso-Gamecocks clash.\n\nWe are greatly looking forward to the match. Its a local derby which I think will attract a lot of people, said Chicken Inn head coach Joey Antipas. Were going to give our other players a run as we seek to continue finding our rhythm.\n\nThis years showdown replaces last years fixture where Antipas charges faced off against then-topflight side Bulawayo Chiefs, who emerged victorious in a lively Independence tie at the same venue.\n\nThe White City Stadium match is part of a broader tapestry of football and national pride playing out across Zimbabwe as part of the 2024 Independence Day commemorations. While the traditional Uhuru Cup match wont feature giants Dynamos or Highlanders this year, the spotlight shifts to the Midlands Province  specifically Gokwe North  where the official Uhuru Cup will unfold for the first time at Nembudziya Growth Point Open Ground.\n\nThere, 2023 league champions Simba Bhora will battle two-time Uhuru Cup winners FC Platinum in a historic fixture that underscores the governments ongoing drive to decentralise major national events.\n\nThe Independence Cup has long been a stage for footballs rich political and social symbolism. This year, the occasion is themed Zim@45: Devolve and Develop Together towards Vision 2030, reflecting the Second Republics push for unity, inclusion, and equitable national development.\n\nGokwes hosting of the main event is expected to draw around 60 000 people, a landmark moment for a district that has never before welcomed topflight football to its doorstep.\n\nAdding to the celebratory atmosphere, the Childrens Party in Gokwe today will feature a womens football match between Herentals Queens and Black Rhinos Queens, two of the countrys top Womens Premier Soccer League sides  reinforcing the broader inclusivity of the Uhuru festivities.\n\nThis marks the third consecutive year the Uhuru commemorations are being staged outside Harare or Bulawayo. Last years main celebration in Murambinda saw Dynamos and Highlanders rekindle their storied rivalry in front of thousands in Buhera  a significant symbolic gesture in the ongoing rotation of national events across all ten provinces.\n\nAs football brings joy, unity, and local bragging rights to Bulawayo and Gokwe alike, fans across the nation will have plenty to cheer about during this landmark celebration of independence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/erfrrf.jpg",
            "description": "Fungai Muderere, Zimpapers Sports Hub TWO of the City of Kings and Queens’ football powerhouses, Highlanders and Chicken Inn, are set to light up White City Stadium tomorrow in a fiery local derby that will headline Bulawayo’s Independence Day celebrations. With the country marking 45 years of self-rule, football once again takes centre stage as a […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Vibrant entertainment program  promises unforgettable ZITF experience",
            "url": "https://www.chronicle.co.zw/vibrant-entertainment-program-promises-unforgettable-zitf-experience/",
            "content": "Sipepisiwe Moyo,Zimpapers Arts & Entertainment Hub\n\nAS preparations for the annual Zimbabwe International Trade Fair (ZITF) reach their peak, organisers have lined up a vibrant entertainment programme to keep the host city, Bulawayo, buzzing throughout the exhibition period.\n\nSpeaking at a press conference on Wednesday, ZITF chairman Busisa Moyo announced that this years edition will feature an enhanced cultural and entertainment experience, responding to previous calls for more engaging activities alongside the business showcases.\n\nWeve convened an entertainment committee to plan and deliver an exciting programme throughout the show. In the past, people felt short-changed when it came to entertainment, so this year, weve created a cultural and social calendar that will run alongside the main business and economic programme, said Moyo.\n\nZee Nxumalo\n\nAs part of the new direction, ZITF has collaborated with Harris Entertainment, organisers of the popular Bulawayo Shutdown gig, which will be hosted at the ZITF main arena on 26 April.\n\nThe Bulawayo Shutdown, long considered the unofficial after-party of ZITF week, has evolved into a must-attend event. This years edition will feature a powerhouse line-up, including South African stars Uncle Waffles, Emtee, Zee Nxumalo, Eemoh, DJ Tira, and Nasty C. Representing Zimbabwe will be Enzo Ishall, DJ Tamuka, Oriyano, Bazooker, Killer T, Mzoe7, and a host of top DJs.\n\nAs highlighted earlier, we aim to enrich the cultural, social, and musical aspects of ZITF. While its not a formal partnership, were collaborating with Harris Entertainment to ensure visitors are thoroughly entertained. The Bulawayo Shutdown will serve as the grand finale of this years fair, said Moyo.\n\nThe 2025 edition of the Zimbabwe International Trade Fair will run from 21 to 26 April.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/Untitled-4-2.jpg",
            "description": "Sipepisiwe Moyo, Zimpapers Arts & Entertainment Hub AS preparations for the annual Zimbabwe International Trade Fair (ZITF) reach their peak, organisers have lined up a vibrant entertainment programme to keep the host city, Bulawayo, buzzing throughout the exhibition period. Speaking at a press conference on Wednesday, ZITF chairman Busisa Moyo announced that this year’s edition will […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        },
        {
            "title": "Zimbabwe’s mineral sales volume up, value down amid PGM dip",
            "url": "https://www.chronicle.co.zw/zimbabwes-mineral-sales-volume-up-value-down-amid-pgm-dip/",
            "content": "Tapiwanashe Mangwiro\n\nZIMBABWES mining sector experienced a mixed performance in the first quarter of 2025, with mineral sales increasing in volume but declining in value, according to the latest report from the Minerals Marketing Corporation of Zimbabwe (MMCZ).\n\nThe MMCZ reported that a total of 1 021 296 tonnes of minerals were sold in the first quarter of 2025, generating US$555,2 million in revenue. This represents a 16 percent increase in volume compared to the same period in 2024, but a 27 percent decrease in value.\n\nThe rise in volume was attributed to increased exports of coal, which was up 63 percent year on year; coke, which gained 58 percent; chrome ore (lumpy), which was up 53 percent; copper concentrates, which shot up 117 percent; high carbon ferrochrome exports, which grew 25 percent; and scrap, which was up 37 percent.\n\nAdditionally, the introduction of steel exports contributed to the volume growth. However, the decline in value was primarily due to a decrease in sales of the platinum group metals (PGMs) cluster.\n\nThe MMCZ noted that: The significant contraction in both volume and value for PGM concentrate sales can be attributed to the delayed implementation of the Mimosa-Zimplats toll processing arrangement.\n\nFurthermore, a production shortfall at Unki Mine, resulting from electricity supply challenges in the third quarter of 2024, contributed to the decline in matte exports.\n\nDespite the challenges, PGMs matte remained the top revenue contributor, with 4 762 ounces sold for US$208,4 million.\n\nThis was followed by spodumene, which saw its 244 414 tonnes bring in US$83,5 million; high carbon ferrochrome exported was 98 129 tonnes valued at US$73, 4 million.\n\nCoke exports were 264 331 tonnes to the tune of US$51,8 million, while PGMs concentrates sold were 15 250,8 tonnes for a value of US$48,7 million.\n\nDr Cephas Jumburu, a mineral economist at the University of Zimbabwe, commented on the performance.\n\nThe increase in export volumes is encouraging, but the decline in revenue highlights the vulnerability of our mineral sector to global price fluctuations. Diversification and value addition are essential to mitigate these risks.\n\nEconomist Tinevimbo Shava noted: The delayed implementation of the Mimosa-Zimplats toll processing arrangement has had a significant impact on PGM revenues. Resolving such operational bottlenecks is crucial for the sectors performance.\n\nLooking ahead, Zimbabwes platinum output is forecast to remain steady in 2025, with production expected to increase marginally to 512 000 ounces from 514 000 ounces in 2024.\n\nThis stability is notable given the global platinum markets projected deficit, driven by weakening recycling volumes and constrained mine production, particularly in South Africa.\n\nThe World Platinum Investment Council (WPIC) reports that the global platinum market will experience its third consecutive year of supply shortfalls, with the 2025 deficit estimated at 848 000 ounces. This is largely due to robust investment demand, despite economic uncertainties.\n\nAnother economist, Sarah Chikore, emphasised the importance of infrastructure.\n\nEnergy supply challenges, like those experienced at Unki Mine, not only affect production but also investor confidence. Addressing these issues is vital for sustainable growth.\n\nWhile the local mining sector has shown resilience in increasing export volumes, the decline in revenue underscores the need for strategic interventions.\n\nAddressing operational challenges, enhancing infrastructure, and pursuing value addition will be critical in maximising the sectors contribution to the national economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dgsfrs.jpg",
            "description": "Tapiwanashe Mangwiro ZIMBABWE’S mining sector experienced a mixed performance in the first quarter of 2025, with mineral sales increasing in volume but declining in value, according to the latest report from the Minerals Marketing Corporation of Zimbabwe (MMCZ). The MMCZ reported that a total of 1 021 296 tonnes of minerals were sold in the […]",
            "time": "06:31",
            "date": "17 Apr 2025"
        }
    ]
}