{
    "news": [
        {
            "url": "https://www.chronicle.co.zw/whatsapp-instagram-facebook-down-users-worldwide-report-disruptions-in-sending-messages-viewing-content/",
            "title": "Original Title",
            "description": "Original Description",
            "content": "The outage is impacting both personal and business accounts, preventing users from sending messages or connecting through WhatsApp Web or using and logging in to the Instagram app\n\nWhatsApp, Instagram and Facebook users globally are experiencing significant disruptions today, with many reporting difficulties accessing the platforms web version. The outage is impacting both personal and business accounts, preventing users from sending messages or connecting through WhatsApp Web.\n\nMeanwhile, on Instagram, users have reported similar disruptions in the sending and receiving of messages.\n\nThis has led to widespread frustration and a surge of complaints across various social media platforms.\n\nMeta, the parent company of WhatsApp, has issued an official statement on X regarding the disruptions. The post read, Were aware that a technical issue is impacting some users ability to access our apps. Were working to get things back to normal as quickly as possible and apologize for any inconvenience.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/whatsapp.jpg"
        },
        {
            "url": "https://www.chronicle.co.zw/police-seek-missing-njube-man/",
            "title": "Original Title",
            "description": "Original Description",
            "content": "Sinokubonga Nkala[emailprotected]A 43-YEAR-OLD man from Njube, Bulawayo has been missing for nearly two weeks.The police have appealed for information that may assist in the location of Rodney Tadyanemhandu.\n\nHe went missing on 29 November 2024, after leaving home in Bulawayo to travel to Dete, where he intended to purchase coal for resale, using cross-border trucks for transportation.The missing person is approximately 1.50m height, slim build, black hair and dark in complexion. Anyone with information that may assist in the location of the missing person can contact his relatives on these numbers 0027730483611 or 0027846461771 or any nearest police station, said the police in a statement.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jyn5rjn.jpg"
        },
        {
            "url": "https://www.chronicle.co.zw/philanthropic-siblings-donate-r20k-for-marula-soccer-tourney/",
            "title": "Original Title",
            "description": "Original Description",
            "content": "Ronald Mpofu [emailprotected]\n\nTWO brothers from Marula in Mangwe District, have embarked on a community development initiative, constructing two public toilets, refurbishing two soccer pitches and donating R20 000 towards a local soccer tournament.\n\nThe two-day tournament is scheduled for 27-28 December.Urgent and Zibonele Moyo demonstrated their commitment to empowering the community of Marula in Matabeleland South through the gestures.\n\nRecognizing the abundance of talented youth in the area, who are hindered by a lack of resources, the brothers have joined forces to provide vital support and nurture local talent.\n\nPublic toilets built at Marula football pitch\n\nMy ultimate dream is to see the young talents from our community represent our nation in football. To make this a reality, weve launched an initiative that aims to keep them engaged and focused, thereby reducing the temptation of drugs and substance abuse. With schools on break, we want to ensure these youngsters stay active and motivated until classes resume. Theyre currently hard at work, training for the upcoming tournament, scheduled to take place on December 27-28, 2024, said Urgent.\n\nThe tournament has engaged six teams from the surrounding villages namely; Manda FC, Mangwe FC, Mara FC, Highgrange FC, Zarebha FC and Marula FC the hosting team. Up to four teams will win prizes with the champions taking home an impressive package consisting a prestigious trophy, a full soccer kit, two soccer balls, and a cash prize of R6 500.\n\nReason Sibanda: Marula FC Senior coach\n\nRonald Gidiza Sibanda, a Zimbabwean football legend, will be our guest of honour at the tournament. Our coaching team, comprising myself, John Nkomo, and Kwanele Khumalo, has been working tirelessly to ensure our team is well-prepared. Weve been training daily to fine-tune our skills, and were confident that well be ready to do our best when the tournament kicks off. Said Reason Sibanda, Marula FC Senior Coach.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Urgent-and-Zibonele-Moyo.jpg"
        }
    ]
}