{
    "news": [
        {
            "title": "Rains: Bulawayo left to count  the cost",
            "url": "https://www.chronicle.co.zw/rains-bulawayo-left-to-count-the-cost/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTORRENTIAL rains accompanied by strong winds wreaked havoc in several suburbs of Bulawayo, leaving scores of families homeless after their roofs were blown off.\n\nThe unexpected storm, which struck late Tuesday afternoon, caused widespread damage, flooding homes and uprooting trees.\n\nThe violent winds that swept through the city tore off roofs in Sizinda, Richmond, Harrisvale, and Entumbane suburbs, damaged property, and left families exposed to the elements. A church and a school had their roofs blown off.\n\nIn Sizinda suburb, 20 families at Sizinda Flats and two in Richmond and Harrisvale suburbs, are now grappling with the aftermath of the ferocious storm. Ntabeni Primary School in Entumbane had two of its classroom blocks roofs ripped off by strong winds including the New Apostolic Church in Sizinda whose entire roof was completely blown off. The heavy downpour lasted for about three hours, inundating streets and overwhelming the citys drainage systems.\n\nThe Bulawayo Fire Brigade swiftly attended the scenes, working through the better part of the night and until yesterday as they provided temporary coverage to the roofs using salvaged sheets.\n\nLocal Government director for Bulawayo, Mrs Tswagai Fikile Marovatsanga, who also heads the provincial Civil Protection Unit, said the Bulawayo Fire Brigade managed to live up to expectations and saved the day when they attended to all the affected homes including the school.\n\nThe New Apostolic Church roof damaged by heavy winds on Tuesday in Sizinda suburb in Bulawayo\n\nThe council fire brigade attended to the scenes and managed to provide overhead coverage to the affected areas. We are, however, facing a reality of dwindling resources and should we have a similar situation, we fear that we will face a big challenge in terms of rendering assistance, she said.\n\nMrs Marovatsanga said they are seized with harnessing more resources.\n\nChief fire officer for Bulawayo, Mr Mhlangano Moyo said the Sizinda families are in urgent need of food, clothes, and blankets as most of their belongings including food were soaked in water.\n\nHe said the cost of the damages is estimated to be around ZWG200 000.\n\nOne of the victims in Sizinda where residents woke up to scenes of devastation, Gogo Eresia Machokovhingo, recounted the terrifying moments when her roof was blown off.\n\nIt happened so quickly. One moment we were having supper, and the next, the wind was howling, and our roof was gone. Rain poured into the house, soaking everything and we lost all our foodstuff and also slept without blankets, she said.\n\nWe didnt know what our fate would be going forward as you can see that the rains are still with us, we are however, grateful to the Fire Brigade for the temporary shelter.\n\nAnother affected tenant at Sizinda Flats, Mr Trust Zabi said he had already used his resources to repair the roof of his flat.\n\nWhen a Chronicle news crew arrived, builders were busy replacing the roof.\n\nReplacing the roofing sheets including labour will cost me around US$250. I decided to use my means rather than waiting for the council to assist. I dont know when these rains will stop, said Mr Zabi.\n\nHe said he was yet to quantify the damage to some of his household property especially electrical gadgets such as the television set, radio, and stove that were exposed to rain when the roof was blown off.\n\nResidents repair one of Sizinda flats roofs, which was blown away by strong winds\n\nThe SADC Humanitarian and Emergency Operations Centre (Shoc) on December 31 issued a heavy rainfall advisory for the SADC region. Based on the advisory issued, a tropical storm, which is 3000km away from Zimbabwe was expected to bring heavy rainfall with some thunderstorms from the period of January 10 to 15.\n\nThe Bulawayo CPU committee is still faced with the dilemma of relocating Cowdray Park residents whose homes are still drenched in water since last week.\n\nThe committee had identified Cowdray Park Secondary and Tategulu Primary Schools as possible relocation sites but the challenge now is that schools have opened for the first term.\n\nMeanwhile, in its situation report on rainfall-induced and drowning incidents across the country, the CPU national directorate has reported that two middle-aged men are marooned along the Runde River, near Citrus Plantation, Section 10, in Chiredzi Masvingo province with growing fears for their safety as the rivers water flow is rapidly increasing in intensity.\n\nThe District Civil Protection committee is swiftly assembling a rescue team to respond to this emergency and ensure the safe evacuation of the stranded individuals, reads the report.\n\nIt also reported that on January 11, Muponjane Primary School in Zvishavane, Midlands province was hit by a devastating storm that caused significant destruction to infrastructure. The disaster resulted in four classrooms losing their roofs entirely with the estimated costs of repairs being US$8 120 and the disaster has exacerbated the existing classroom shortages at the school.\n\nAccording to CPU, 15 people have lost their lives since the start of the 2024/25 rainfall season\n\nOf these deaths, three are in Masvingo, Mashonaland East and Mashonaland West provinces, two in Manicaland and Matabeleland North provinces respectively while Midlands and Matabeleland South recorded one each.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Pupils-walk-past-a-tree-that-was-uprooted-by-heavy-winds-on-Tuesday-at-Ntabeni-primary-school-in-Entumbane.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw TORRENTIAL rains accompanied by strong winds wreaked havoc in several suburbs of Bulawayo, leaving scores of families homeless after their roofs were blown off.  The unexpected storm, which struck late Tuesday afternoon, caused widespread damage, flooding homes and uprooting trees.  The violent winds that swept through the city tore off roofs in Sizinda, […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "‘Engaging ruling party is not selling out’",
            "url": "https://www.chronicle.co.zw/engaging-ruling-party-is-not-selling-out/",
            "content": "Nqobile Tshili,[emailprotected]\n\nCITIZEN Coalition for Change (CCC) interim secretary-general, Senator Sengezo Tshabangu, has defended the oppositions engagement with the ruling Zanu-PF, saying such interactions foster a healthy democracy and promote national development.\n\nSen Tshabangu, who is also the leader of the opposition in Parliament, faced criticism from opposition activists for participating in a visit to President Mnangagwas Pricabe Farm in Kwekwe over the weekend as part of parliamentary business.\n\nDuring the visit, President Mnangagwa encouraged the opposition to adopt a more vibrant approach to governance, asserting that a robust opposition helps keep the ruling party accountable.\n\nIn an interview yesterday, Sen Tshabangu dismissed claims that engaging with the ruling party amounted to betrayal.\n\nIt is certainly strange reasoning to suggest that an opposition which engages with the ruling party is selling out.\n\nHow else should state affairs be conducted? Democracies across the world have healthy interactions between the ruling party and the opposition, he said.\n\nThe real issue is whether or not the opposition remains true to the independent political demands of its constituency.\n\nSen Tshabangu added that the oppositions engagements with Zanu-PF reflect a commitment to advancing national interests while maintaining its independence.\n\nWe have maintained that the status quo is inconsistent with the objectives of the struggle for national liberation.\n\nOur engagements with the ruling party have asserted this contention, he said.\n\nSen Tshabangu called for a shift in opposition politics, urging maturity and a focus on home-grown solutions.\n\nThe tragedy is to assume that opposition should oppose for the sake of it. It is not enough to oppose. In fact, it is not the task of the opposition. The task is to offer alternative, objectively sound and home-grown solutions made by Zimbabweans, for Zimbabweans,and about Zimbabweans, he said.\n\nTurning to Zanu-PFs resolution to defer the 2028 elections to extend President Mnangagwas term until 2030, Sen Tshabangu said the CCC had not yet deliberated on the matter.\n\nThat issue has not been considered by the party. At present, it is a matter internal to Zanu-PF. Zanu-PF has neither approached us on the issue nor presented it in the appropriate legislative body for deliberations, he said.\n\nSen Tshabangu said the issue of the deferring of elections has not arisen in any of their party meetings, stressing the importance of understanding and debating the reasons behind any proposal to defer elections.\n\nIt will be important to understand and debate the reasons for the argument of the deferring of elections and how that benefits us as a people and country. Deferring elections cannot be an end in itself, he said.\n\nOn the question of CCCs internal structures, Sen Tshabangu acknowledged the need for a congress to elect substantive leaders.\n\nCongress is an absolute necessity. We are in the process of strengthening the party to prepare and have a congress. It will happen as soon as the conditions permit, he said.\n\nSince its establishment, CCC has operated without substantive structures, with internal confusion and divisions often dominating its ranks.\n\n@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-2Senator-Sengezo-Tshabangu.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  CITIZEN Coalition for Change (CCC) interim secretary-general, Senator Sengezo Tshabangu, has defended the opposition’s engagement with the ruling Zanu-PF, saying such interactions foster a healthy democracy and promote national development.  Sen Tshabangu, who is also the leader of the opposition in Parliament, faced criticism from opposition activists for participating in a visit to […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Football issues should be resolved in sports corridors",
            "url": "https://www.chronicle.co.zw/football-issues-should-be-resolved-in-sports-corridors/",
            "content": "Lovemore Dube,[emailprotected]\n\nFORMER Zifa president Vincent Pamire has called on football matters to be resolved within sports corridors.Pamire said genuine football people have no business taking matters to the courts.\n\nPamire made this call after Walter Magaya and another aspiring presidential candidate Themba Mliswa turned to the courts following their disqualification from taking part in the Zifa elections.\n\nMagayas case was heard in Harare and deferred to tomorrow while Mliswas which was before Justice Nduna at the Bulawayo High Court on Tuesday failed to take off as Zifa lawyers were at the Harare court.\n\nWhile Magaya and Mliswa opted for the High Court, Gift Banda who aspires to be the next Zifa vice-president and presidential candidate Benjani Mwaruwari took their case up with the Court of Arbitration in Sport in Switzerland.\n\nBanda and Mwaruwaris move was right as per the electoral code whose Article 85.9 dictates that all disputes must be resolved by CAS.\n\nFootball matters must not be taken to the courts. Soccer has its own grievance pathways that have to be explored. We should never resort to the courts when it is clear which way to go towards conflict resolution in football, said Pamire.Pamire said those with guts to take matters to court are not football family members.\n\nMany of those who take matters to court do not care about football, they do it because if they are sacked or banned, they wont lose anything. Football has its ways and those have to be respected, said Pamire.\n\nHe emphasised that Fifa statutes should always be followed.Pamire conceded that football laws at times are in variance with national judicial features but at the end of the day soccer must stay sport.\n\nMeanwhile aspiring Zifa board member, Alois Bunjira, has urged councillors to elect candidates they think are the best for Zimbabwean football.\n\nThe CAPS United legend and sees the upcoming elections as a perfect opportunity for the country to start afresh.Zimbabwean football has been under a Fifa appointed Normalisation Committee since July 2023, when the world governing body lifted a 17-month ban on Zifa, that was caused by a cocktail of factors including Government interference.\n\nThe Normalisation Committee, which is headed by former Dynamos chairman Lincoln Mutasa, steps down after the January 25 election.\n\nZifa Normalisation Committee chairman Lincoln Mutasa (left) and committee member Rosemary Mugadza\n\nBunjira, is one of the over 30 candidates vying for the six board member positions.A former Mamelodi Sundowns and Zimbabwe national team player, Bunjira says he is not getting into the race because he is a former star footballer, but because of what he believes he can bring into football.\n\nThe 49-year-old rose through the ranks as a footballer and founded an academy called Albun when he retired.He grew up in Zengeza, Chitungwiza, where he played junior football before he joined Wieslaw Grabowskis Darry T.Bunjira also played for the now defunct Blackpool before he joined Harare giants CAPS United.\n\nAfter winning the Premier Soccer League championship with Makepekepe in 1996, the year he also won the Golden Boot, Bunjira crossed the Limpopo River into South Africa where he turned out for several clubs.\n\nIn South Africa he played for Bidvest Wits, Mamelodi Sundowns and Jomo Cosmos.Bunjira was also part of the Warriors squad at their maiden African Cup of Nations finals in 2004.\n\nIt has been a while since we last saw former footballers trying to get into Zifa leadership positions.Being a former footballer is an advantage, it has given me a lot of knowledge, a lot of experience.\n\nIve lived it, Ive played football from a very young age and I know the process.Ive gone through a lot of different administrations in different countries in Zimbabwe, South Africa, America and Europe, said Bunjira.\n\nAlois Bunjira\n\nThe former Sundowns star wants to turn back the hands of time, if elected into office.He wants to reintroduce a sound junior football development structure.\n\nThe number one problem we have in Zimbabwean football at the moment is the lack of a proper structure.We have dismantled the whole football and that needs to be restored.\n\nBunjira actually thinks commercialisation of Zifa should be done after restoration of proper structures.Ive heard people talking about commercialisation and everything. Yes. Indeed, football needs to be commercialised, but not before we restructure and put the structures back in place.\n\nWe need to see kids playing football again. We need to see primary schools playing football again.We need to see juniors playing from area zones, districts and provinces.\n\nWe need to have a proper tertiary football league. You know what, we have a lot of academics who are good at football. We have lost so much talent through education.\n\nOur culture is that we focus too much on school at the expense of sport, said Bunjira.He added: In that vein, it is prudent for all Premier Soccer League and Division One teams to have junior teams.\n\nI played junior football for an Area Zone team called Hotspurs in Chitungwiza.The likes of Lloyd Mutasa and Ralph Kawondera won national junior tournaments with Division Four teams like Kunaka Trading Stores (KTS) in Chitungwiza.\n\nBunjira squares up against some big names in football administration including Sweeney Mushonga, Gilbert Saika, Davison Muchena, Andrew Tapela and Modern Ngwenya.\n\nSimba Bhora director Brighton Ushendibaba, long-time womens football benefactor Lewis Muzhara and Dutch Academy director Kudzai Kadzombe are also contesting for the board member positions.Ex-footballers Walter Musanhu, Harlington Shereni and Terrence Malunga are also in the race.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Vincent-Pamire.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw FORMER Zifa president Vincent Pamire has called on football matters to be resolved within sports corridors. Pamire said genuine football people have no business taking matters to the courts. Pamire made this call after Walter Magaya and another aspiring presidential candidate Themba Mliswa turned to the courts following their disqualification from taking […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Movie lovers grieve closure of Bulawayo’s last cinema",
            "url": "https://www.chronicle.co.zw/movie-lovers-grieve-closure-of-bulawayos-last-cinema/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE closure of the Ster Kinekor branch at Bulawayo Centre has left movie enthusiasts feeling the sting of loss, not just for the cinema itself, but for the community and jobs it supported.\n\nAs the last remaining major cinema in the city, its closure has sparked conversations about the evolving landscape of entertainment, particularly the impact of online streaming services.\n\nNomagugu Ndlovu, a local movie lover, emphasised the human cost of the closure.More than anything, I feel more for the individuals who actually lost their jobs due to the closure of the cinema. I think for us people, yes its sad, but nowadays people can find or source alternatives to have access to and keep up with their favourite movies. For example, Netflix and Showmax. Of course, it cannot be compared to the cinema, as you still miss that different scenery you get from the cinema compared to small screens like laptops and cellphones.\n\nCinema goers at a premire hosted by Ster Kinekor Bulawayo in this file photo\n\nThe advent of streaming platforms has undeniably changed how audiences consume films. With the convenience of watching movies from the comfort of their homes, attendance at cinemas has seen a significant decline.\n\nGrace Mguni, another patron, noted the operational challenges that led to Ster Kinekors closure.For Ster Kinekor, it made business sense to shut down. As much as movie lovers will miss the place, it cant be ignored that the cinema was gradually beginning to deteriorate.\n\nNotably, the once ever-so-clean toilets were beginning to lose their reputation due to them renting out to the church people, and snack prices were unreasonably high in efforts for the cinema to cover costs of operation. Basically, they reached a point where even patrons like myself knew something had to give.\n\nThe closure has also sparked nostalgia among moviegoers who cherish the unique experience that cinemas offer.A local film enthusiast, who preferred to be called MaKhumalo, said the closure of the cinema is a minus for movie lovers.\n\nIt leaves us bereft of teenage debts, the sound of the PA system bellowing throughout the arena, as well as the switching off of lights and the whole ambience with friends and family. Watching a movie is more than just seeing it; its about the shared experience, the laughter and the excitement of being in a packed theatre.\n\nAs Bulawayo adjusts to this new reality without its beloved Ster Kinekor, the conversation continues around the future of cinemas in a world increasingly dominated by streaming services.\n\nWhile the allure of home viewing is undeniable, the community spirit and collective experience of watching a film in a theatre remain irreplaceable for many. @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-11-1.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE closure of the Ster Kinekor branch at Bulawayo Centre has left movie enthusiasts feeling the sting of loss, not just for the cinema itself, but for the community and jobs it supported. As the last remaining major cinema in the city, its closure has sparked conversations about the evolving landscape of […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Gukurahundi public hearings set for Q1",
            "url": "https://www.chronicle.co.zw/gukurahundi-public-hearings-set-for-q1/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE long-awaited Gukurahundi public hearings are expected to commence in the first quarter of this year, with a designated Command Centre in Bulawayo being renovated to securely store witnesses testimonies and other sensitive information.\n\nThis initiative underscores the Governments commitment to addressing the countrys past and fostering national healing.\n\nPresident Mnangagwa launched the Gukurahundi public hearings in July last year, marking a historic step towards resolving issues stemming from the post-independence conflict. The hearings are part of the Second Republics broader efforts to address grievances, particularly in Matabeleland and parts of the Midlands, where communities have linked underdevelopment to the effects of Gukurahundi.\n\nWhile the 1987 Unity Accord united liberation movements Zanu-PF and PF-Zapu, bringing peace to the nation, lingering social issues remain. The public hearings are expected to provide a platform for communities to chart a path forward in addressing these matters.\n\nTraditional leaders, mandated by President Mnangagwa to spearhead the hearings, have received training alongside their rapporteurs. Essential equipment, including recorders and laptops, has been procured to facilitate the process.\n\nThe countrys Constitution and customary law empower chiefs to resolve conflicts among people in accordance with traditions and customs. Speaking on the progress, Attorney-General Mrs Virginia Mabiza, who serves as the national coordinator of the programme, said preparations are on track.\n\nShe said the hearings steering committee on Gukurahundi met last weekend to discuss the modalities of implementing the programme.\n\nThe purpose of the meeting was to plan for the upcoming hearings. It is the hope that during the first quarter, the hearings are going to commence. These are public hearings and the media to a certain extent is going to be allowed as regulated by the sector, said Mrs Mabhiza.\n\nThat is the progress that we have recorded so far. Resources will never be adequate, but Im happy to announce that the Office of the President and Cabinet has availed some resources to take us somewhere and we are optimistic that the hearings will begin in the first quarter.\n\nNational Council of Chiefs president, Chief Mtshane Khumalo, expressed optimism about starting the hearings in February.\n\nI had a meeting with the Attorney-General (Mrs Mabhiza) on Monday where we discussed the matter. We aim to commence the hearings in February if everything goes according to plan, he said.\n\nThis will be a busy period for us. Although we intended to begin shortly after the President launched the programme, resource constraints delayed progress. However, we are now ready to move forward.\n\nChief Mtshane highlighted the importance of the Command Centre, which will serve as a secure repository for testimonies. Located at the corner of Joshua Mqabuko Nkomo Street and 9th Avenue in Bulawayo, the facility is undergoing renovations by the Department of Public Works to meet programme requirements.\n\nWe now have the Command Centre, which will be used for the storage of our data. We are going to be using the offices that previously housed the National Peace and Reconciliation Commission (NPRC). We have been assured that offices will be secure, we have been promised security 24/7, he said.\n\nTraditional leaders will conduct hearings in villages, but testimonies will be stored at the Command Centre for security reasons.\n\nTo ensure smooth operations, the Government is hiring staff for the Command Centre and plans to provide vehicles for the 72 to 73 chiefs involved in the hearings.\n\nCars will be hired for all the 72 to 73 chiefs to improve their mobility. The Office of the President and Cabinet will hire vehicles to enhance the mobility of chiefs and their teams during the hearings, Chief Mtshane said.\n\nAdditionally, a refresher training session for traditional leaders, including newly appointed chiefs, is planned, subject to funding availability.\n\nThe Gukurahundi public hearings are expected to play a crucial role in promoting healing and reconciliation while addressing unresolved issues from the past.\n\nSpeaking during the launch of the Gukurahundi manual to guide the holding of victim-friendly public hearings at the State House in Bulawayo in October 2022, President Mnangagwa emphasised the importance of unity. He noted that detractors have attempted to sow divisions, but the Government remains resolute in its commitment to fostering national cohesion.\n\nThe manual, developed through inclusive engagements between chiefs and various stakeholders, is a culmination of traditional leaders meetings with President Mnangagwa, which began in March 2019.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/10/cuuuuu.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  THE long-awaited Gukurahundi public hearings are expected to commence in the first quarter of this year, with a designated Command Centre in Bulawayo being renovated to securely store witnesses’ testimonies and other sensitive information.  This initiative underscores the Government’s commitment to addressing the country’s past and fostering national healing. President Mnangagwa launched the […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "COMMENT: Mozambicans deserve lasting peace",
            "url": "https://www.chronicle.co.zw/comment-mozambicans-deserve-lasting-peace/",
            "content": "CDE Daniel Chapo was yesterday inaugurated as Mozambiques fifth president since the country attained independence from Portugal in 1975.\n\nSpeaking after his investiture in Maputo, the capital, the 47-year-old promised to fight corruption, nepotism and poverty. Watched by an audience of about 2 500 including Heads of State and Government and their representatives, top officials and his supporters, he pledged to rationalise the civil service and reset government priorities. Achieving social and political stability in the country, he added, will be the priority of priorities.\n\nWe are delighted that President Chapo has taken over, extending the rule of the revolutionary party, Frelimo, by another five years. This came after an intense, violent campaign by the local opposition and their funders to disrupt the transition.\n\nIndeed, the plot by White interests, fronted by local opposition parties, to use the ballot and street violence to frustrate or unseat revolutionary parties has been clear in southern Africa in recent elections  South Africa, Botswana and Namibia. The campaign has succeeded in some cases but failed in others notably in Namibia and Mozambique.\n\nCde Daniel Chapo\n\nAs a matter of fact, however, the Western scheming started way back in 2000, with our country being the target. Illegal sanctions, the Movement for Democratic Change and a parade of civic bodies were unleashed against Zanu-PF. All that failed.\n\nIn Mozambique, we saw Mr Venancio Mondlane, who contested in the October 9 poll as an independent to emerge with 25 percent of the vote, inciting nationwide demonstrations. He left the country for some time, and returned ahead of President Chapos inauguration. Landing at an airport in Maputo, he performed a well-worn opposition antic, particularly in our country, when he comically took an oath of office.\n\nWe expect the chaos he has caused to die down soon, not just because of the robust response to it by law enforcement, but also because President Chapo is now in office.\n\nAn Islamist insurgency has been active in northern Cabo Delgado Province since 2017. It has resulted in deaths of almost 5000, displaced thousands and disrupted business.\n\nPresident Chapo has to find a way to end this carnage.Our brothers and sisters in Mozambique do not deserve all this having fought a protracted, bitter armed struggle for decades and fought Renamo bandits over the first 16 years of independence. They deserve lasting peace.\n\nThe president must also intensify the Frelimo effort to defeat poverty and promote greater economic development. The countrys vast natural gas resources, minerals and so on must be judiciously exploited in a manner that ensures more durable national development.\n\nAmid climate change, Mozambique has suffered the worst in the region as a result of floods, droughts and cyclones. We expect his government to build national resilience against these devastating phenomena.The order, like President Chapo himself, is very tall indeed but we trust Frelimo will deliver for its people.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Daniel-Chapo.jpg",
            "description": "CDE Daniel Chapo was yesterday inaugurated as Mozambique’s fifth president since the country attained independence from Portugal in 1975. Speaking after his investiture in Maputo, the capital, the 47-year-old promised to fight corruption, nepotism and poverty. Watched by an audience of about 2 500 including Heads of State and Government and their representatives, top officials […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Econet reports strong growth in mobile money",
            "url": "https://www.chronicle.co.zw/econet-reports-strong-growth-in-mobile-money/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nECONET Wireless Zimbabwe, the countrys leading mobile network operator, reported steady growth in its mobile money business for the third quarter ending November 30, fuelled by a 55 percent rise in active subscribers and a 79 percent increase in wallet funding.\n\nThe firm believes there are significant growth opportunities in digital payments, driven by the increasing adoption of mobile wallets.\n\nIn its latest trading update, Econet attributed the growth in mobile money volumes and transactions to ongoing improvements in financial inclusion.\n\nThis business continues to actively onboard more payment partners in alignment with the strategy to establish a universal payment platform that prioritises convenience and value for customer, said Econet Wireless Zimbabwe group company secretary Tatenda Ngowe.\n\nThe growth in mobile money volumes and transactions reflects gains we continue to make towards improved financial inclusion. In the period under review, the group successfully completed upgrading the core network which marks a pivotal milestone of the digital service provider (DSP) journey.\n\nIt notes that the critical enhancement and modernisation effort has significantly improved the central part of the network, integrating systems such as charging, billing, and application servers in addition to enabling advanced digital and AI features.\n\nThe modernised network enables advanced digital use cases such as high-quality voice calls over 4G/LTE network (VoLTE). Smart4Home, our new fixed wireless product is being targeted at high-volume data users in response to evolving and growing data use needs, said Econet.\n\nUnder the base station modernisation, 16 new sites and the upgrading of 33 radio access sites and 270 microwave access links were done. This has resulted in improved quality of service and speed.\n\nAn additional 20, 5G sites were commissioned nationwide, demonstrating our commitment to providing a network of international quality.\n\nTurning to the life insurance business, EcoSure, recorded a 51 percent growth in transaction volumes compared to the same period last year as it continues to offer digital bundled products for a wider customer reach.\n\nMoovah, the short-term insurance business continued to grow its portfolio driven largely by new business acquisitions and endorsements which translated to a 25 percent increase in motor and non-motor insurance customers.\n\nThe group recorded a 69 percent local currency growth in revenue relative to the comparative period largely anchored by a 42 percent increase in revenue for the mobile network operations and the acquisition of the financial technology (FinTech) businesses.\n\nVoice and data usage increased by 20 percent and 36 percent respectively with demand for data forecast to remain firm and on an upward trajectory.\n\nEconet said the envisaged growth in mobile broadband and digital services requires the business to continue modernising the network infrastructure to remain agile in its service offering and deliver the expected quality of service.\n\nCapital expenditure on a year-to-date basis closed the quarter at 18 percent of revenue and was largely incurred on modernising the network to support the growth in usage and improve service quality.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/02/mobile-money.jpeg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw ECONET Wireless Zimbabwe, the country’s leading mobile network operator, reported steady growth in its mobile money business for the third quarter ending November 30, fuelled by a 55 percent rise in active subscribers and a 79 percent increase in wallet funding. The firm believes there are significant growth opportunities in digital payments, […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Mpilo Hospital’s first-ever emergency nursing diploma: A key step towards enhancing Zimbabwe’s disaster response",
            "url": "https://www.chronicle.co.zw/mpilo-hospitals-first-ever-emergency-nursing-diploma-a-key-step-towards-enhancing-zimbabwes-disaster-response/",
            "content": "Gibson Mhaka,Zimpapers Politics Hub\n\nROAD traffic and work-related accidents are among the most significant disasters and emergencies that disproportionately affect the lives and health of children, youth, and individuals of working age.\n\nStudies have shown that road traffic accidents, for example, could become the seventh leading cause of death globally by 2030 if appropriate actions are not taken.\n\nThis growing problem suggests a potential increase in health problems, mortality, and medical issues resulting from road traffic accidents and work-related accidents in the coming years.\n\nPeople in need of trauma care after a road crash or work-related accident are most likely to survive if they receive definitive care within the Golden Hour  the first hour after the accident.\n\nMpilo hospital introduces trauma course\n\nThe risk of death or severe injury is believed to significantly increase after this critical period.Given the significant impact of these disasters and emergencies on public health, essential pre-hospital care and effective hospital preparedness play a pivotal role in managing and mitigating associated health and life-threatening issues.\n\nEssential pre-hospital care includes prompt communication, treatment, and transport of injured people to formal healthcare facilities.\n\nAccording to research, a major contributing factor to these tragic outcomes is often the delay in critical medical care.When accident victims reach the hospital, they frequently encounter delays in treatment due to a lack of adequate training among hospital staff in handling emergency situations.\n\nThis delay can be fatal, as timely medical intervention is crucial in minimising the impact of severe injuries and maximising the chances of survival.\n\nHospitals play a vital role in providing medical care and first aid facilities during disasters and emergencies.Since these disasters and emergencies, such as road traffic and work-related accidents, can lead to the death or injury of one or more individuals, hospitals and healthcare centres are often the first point of contact for injury victims.\n\nIn other words, hospitals provide ambulances and trained healthcare personnel to transport and transfer injured individuals.In addition to providing emergency care to injury victims at the time of the accident, the healthcare system also provides rehabilitation services for these victims.\n\nThe increase in the burden of hospital patients and the need for timely and effective provision of medical services by hospitals highlight the importance of hospital preparedness during disasters and emergencies, especially those resulting in mass casualty incidents.\n\nTo improve preparedness for emergencies and in line with international commitments to improve the countrys healthcare systems and strengthen national capacity for emergency health management, crisis response, and flexibility in healthcare systems, Mpilo Central Hospital in Bulawayo has made history by launching Zimbabwes inaugural post-basic nursing diploma in accident and emergency management.\n\nThis ground-breaking initiative is designed to elevate the countrys emergency care to international standards.In an interview, Mpilo Central Hospitals chief medical officer, Dr Narcisius Dzvanga, revealed that the programme is being conducted in partnership with South Africas Wits University, which provides mentorship and support.\n\nDr Narcisius Dzvanga\n\nWe have introduced a post-basic nursing diploma in accident and emergency management. Its the first of its kind in the country, with mentorship and support from Wits University in South Africa, in addition to our local mentors, said Dr Dzvanga.\n\nThis two-year programme is not only designed to improve emergency patient care at Mpilo Central Hospital but also across the country. We have recruited staff from all corners of Zimbabwe, and as the number of trained professionals grows, we are confident more lives will be saved, he added.\n\nDr Dzvanga said the hospital seeks to tap into the skills from mentorship from the Wits University which is expected to provide material and human capital training.\n\nThe diploma curriculum includes training in patient management during air transport, aligning with the Governments Air Ambulance initiative launched last year.\n\nDr Dzvanga noted that the programme is critical for equipping medical professionals with advanced skills to handle various types of accidents.\n\nWhile all doctors and nurses have basic training in accident and emergency care, this programme takes it a step further, aligning with international best practices. It prepares our staff to handle any accident, whether its a fall, car crash, or domestic assault, he explained.\n\nThis initiative by Mpilo Central Hospital in partnership with Wits University highlights several key aspects of Zimbabwes efforts to improve its healthcare service delivery in addressing disasters and emergencies.\n\nThe establishment of this post-basic nursing diploma also signifies a significant step forward in improving Zimbabwes healthcare service delivery in addressing disasters and emergencies. By prioritising specialised training, collaborating with international partners, and focusing on building national capacity, the country can enhance its ability to save lives and mitigate the impact of these events.\n\nHeliDrive Zimbabwe air Ambulance technicians airlift a patient to Parirenyatwa Hospital in Harare from United Bulawayo Hospitals recentlympilo\n\nRecognising their critical role in ensuring service continuity and effective healthcare delivery during disasters and emergencies, the World Health Organisation emphasises the importance of robust hospital preparedness and response capacity.\n\nIt is important to note that the effective implementation of hospital preparedness plans and crisis management strategies is paramount.\n\nBy introducing this inaugural post-basic nursing diploma in accident and emergency management, Mpilo Central Hospital is taking a proactive step towards significantly reducing mortality rates.\n\nThis specialised diploma will equip nurses with the advanced knowledge and skills necessary to effectively respond to a wide range of emergencies, from trauma and natural disasters to infectious disease outbreaks.Graduates of this programme will be invaluable assets in strengthening the hospitals capacity to handle critical situations, ensuring timely and efficient patient care during emergencies.\n\nFurthermore, this initiative aligns with the national goal of enhancing healthcare systems and strengthening emergency response capabilities.\n\nBy cultivating a cadre of highly skilled emergency nurses, Mpilo Central Hospital is not only improving its own capacity but also contributing to the overall enhancement of Zimbabwes healthcare systems resilience in the face of unforeseen challenges.This investment in specialised training will undoubtedly yield significant dividends in terms of improved patient outcomes and a more robust healthcare system for the nation.\n\nAccording to the Hospital Safety Index (HSI) defined by the World Health Organisation (WHO), the most crucial factor in hospital performance is having preparedness plans to deal with emergency conditions and unexpected events.\n\nIn this regard, evaluating hospital preparedness can identify critical gaps in readiness during emergencies and assess the current level of preparedness.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Mpilo-hospital-introduces-trauma-course-6-Jan-4.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub ROAD traffic and work-related accidents are among the most significant disasters and emergencies that disproportionately affect the lives and health of children, youth, and individuals of working age. Studies have shown that road traffic accidents, for example, could become the seventh leading cause of death globally by 2030 if appropriate actions […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Title deeds: Banks can’t  seize farmers’ land",
            "url": "https://www.chronicle.co.zw/title-deeds-banks-cant-seize-farmers-land/",
            "content": "Fungi Kwaramba,Harare Bureau\n\nBANKABLE title deeds for State-owned land will not result in financial institutions seizing control of large tracts of land, or lead to the reversal ofthe Land Reform Programme,Chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has said.\n\nSpeaking on ZBC TVs Face the Nation programme last night, Mr Tagwirei allayed fears that financial institutions would wrest land from beneficiaries of agrarian reforms who would have failed to service loans extended under the scheme.\n\nThe businessman also laughed off speculation that he was personally going to grab land from indigent or defaulting farmers, adding that the issuance of title deeds would indirectly address aspects of multiple farm ownership, as is stipulated in the countrys Constitution.\n\nOutlining the processes and mandate of the Land Tenure Committee, Mr Tagwirei said it was impossible for banks to take ownership of what is essentially State land.\n\nThe land belongs to the Government, it does not belong to the bank. If you look at the total value of this land that we are talking about, the actual value is around US$20 billion. There is no bank that can give a mortgage for that land.\n\nSo what the banks are merely doing is administering the mortgage that this farmer is going to get (through Government) on that piece of land. The ultimate owner of this land still remains Government, its not the bank that owns it.\n\nWhen the bank is repossessing this land for whatever reason, maybe the farmer has failed to pay, remember that the owner is still the Governmentok? They (banks) will have to consult Government, obviously, when they are doing that process.\n\nHe added: One of the things that you must understand is that these farmers are supposed to be commercial farmers, not subsistence farmers. When you were applying to get that piece of land, you were saying I want to be a commercial farmer.\n\nAnd the risks that are associated with being a commercial farmer are that you must make sure that you work the land so that you are able to pay back.\n\nMr Tagwirei said because title deeds were allocated on the basis of an individuals unique national identification number, this could help address public concerns about multiple farm ownership.\n\nHe emphasised, though, that this was not the committees core concern or its mandate.\n\nSection 289 of the Constitution says that any citizen of this country is allowed to have access to land. A citizen is a person. Its not an institution. Its a person. A person is identified by an ID number. The ID number represents a person. You cannot have multiple ID numbers\n\nWhen an ID is given to an individual, to a citizen of this country, the ID is a unique identifier to an individual. When we are issuing title to a farmer, the main focus point is the ID number; we will issue it on the basis of that ID number.\n\nWhen the bank repossesses this land,  because a bank cannot take land  on behalf of Government, the bank cannot then own the land because they have no ID number.\n\nOn claims that he would use his financial muscle to gain control of land, Mr Tagwirei said at an average valuation of US$2,000 per hectare of arable land, it was ridiculous to think he could purchase it because he did not have that kind of money.\n\nSome people have even said Kudakwashe Tagwirei wants to take all this land for himself because he can buy it, which I cant because I dont have US$20 billion to buy this land.\n\nMr Tagwirei explained that banks would only administer a fund that would, among other things, provide affordable financing to farmers.\n\nPresident Mnangagwa launched the bankable deeds late last year as part of measures to unlock the value of Zimbabwes agricultural land and to grow the economy in line with national development targets.\n\nThe deeds are structured as per recommendations of the Land Tenure Implementation Committee, which brings together 14 experts from a variety of fields.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Chairperson-of-the-Land-Tenure-Implementation-Committee-Mr-Kudakwashe-Tagwirei.jpg",
            "description": "Fungi Kwaramba, Harare Bureau BANKABLE title deeds for State-owned land will not result in financial institutions seizing control of large tracts of land, or lead to the reversal of  the Land Reform Programme,  Chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has said. Speaking on ZBC TV’s “Face the Nation” programme last night, Mr […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Caledonia allocates US$41,8m for capital expenditure… Blanket Mine surpasses 2024 production targets",
            "url": "https://www.chronicle.co.zw/caledonia-allocates-us418m-for-capital-expenditure-blanket-mine-surpasses-2024-production-targets/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nLISTED gold mining entity, Caledonia Mining Corporation Plc has earmarked US$41,8 million for its 2025 capital expenditure (capex) programme, with US$34,9 million designated for the Blanket Mine and US$5,8 million for the Bilboes and Motapa projects.\n\nThis follows the companys production of 76 656 ounces in 2024, surpassing its guidance of 74 000 to 78 000 ounces and slightly exceeding the 2023 production of 75 416 ounces.\n\nThe mining house has it on record that it is eyeing consolidating its strategy of becoming a multi-asset gold producer by acquiring several lucrative mining assets.\n\nFourth quarter production at Blanket Mine stood at 19 841oz, a strong mining activity resulting in a record 797 000 tonnes milled for the year, with 89 727 tonnes hoisted in December, exceeding milling capacity.\n\nMiners underground at Blanket Mine\n\nThe firm said the Blanket production for 2024 excludes an estimated 700 oz of unrecovered gold contained in an 8 400-tonne stockpile, which provides a strong start for 2025.\n\nIn its 2024 fourth quarter update, Caledonia said the investments are geared at modernising operations and improving mining efficiency at Blanket.\n\nIt notes that while there will be short-term cost pressures, the long-term goal is to reduce costs, improve profitability, and ensure the continued success of the mine.\n\nAll expenditures will be funded from cash generation and cash reserves with no anticipated impact on the dividend.According to the firm, key projects include Blanket development, with US$ 6,6 million allocated to carry out planned development of 4 663 m including an additional 590 meters to improve flexibility, access higher grade areas and efficiency improvements of US$3,4 million for energy-saving initiatives at the mine.\n\nAdditionally, US$5,8 million has been set aside for exploration and project development at Motapa, building on promising 2024 results and to complete the feasibility study at Bilboes.\n\nBlanket Mine\n\nChief executive officer Mr Mark Learmonth expressed enthusiasm about the achievement.I am pleased to report that we achieved our production guidance for the year, producing 76 656 ounces of gold. In 2024, we achieved a new record for tonnes milled of 797 000 tonnes, and in December we also set a record for hoisting 89 727 tonnes of ore, exceeding our milling capacity, he said.\n\nAs a result of the strong mine production, we closed the year with a stockpile of 8 400 tonnes which puts us in a good position to start 2025, he added.\n\nMr Learmonth said over the past seven years, investing in Blanket has nearly doubled production and has substantially increased the resource base following which Blankets Mine life now extends to 2034 based on reserves.\n\nHe also pointed out that the firm continues to progress with the revised feasibility study for the Bilboes sulphide project, which is scheduled to be completed later in the first quarter of this year.\n\nAt Bilboes, we continue to progress the revised feasibility study for the Bilboes sulphide project, which is scheduled to complete later in the first quarter of this year.\n\nFollowing the publication, in November 2024, of encouraging exploration results at Motapa, the 2025 capital budget includes provision for further exploration on targeted sites with the most geological potential and the opportunity for early synergies with the Bilboes project, said Mr Learmonth.\n\nWe are systematically building a mid-tier Zimbabwe focussed gold producer with multi-asset profitable production, while doing so with a focus on capital allocation and building per share value.\n\nBilboes Gold is a gold mining entity that owns three major gold mines in Matabeleland North and was once ranked among the countrys 10 biggest gold producers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-12-1.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com LISTED gold mining entity, Caledonia Mining Corporation Plc has earmarked US$41,8 million for its 2025 capital expenditure (capex) programme, with US$34,9 million designated for the Blanket Mine and US$5,8 million for the Bilboes and Motapa projects. This follows the company’s production of 76 656 ounces in 2024, surpassing its guidance of […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        }
    ]
}