{
    "news": [
        {
            "title": "OFFICER DOWN! Female detective slain in line of duty tragedy",
            "url": "https://www.chronicle.co.zw/officer-down-female-detective-slain-in-line-of-duty-tragedy/",
            "content": "Nqobile Tshili,[emailprotected]BULAWAYOS Pumula suburb became a scene of a heart-breaking tragedy on Thursday night when a female detective from the Criminal Investigations Departments crack Homicide Unit was shot dead in the line of duty. Her life, dedicated to protecting the city, was extinguished as she and her colleagues pursued suspected armed robbers.\n\nDetective Constable Cassandra Hove (37), a dedicated officer who had committed her life to protecting citizens from criminals, was killed in the line of duty in Pumula South, Habek area, after sustaining gunshot wounds to her upper limbs. She was part of a team of detectives engaged in a raid against armed robbers suspected of targeting service stations throughout the city.\n\nThe late Detective Constable Cassandra Hove\n\nThe incident occurred at approximately 8:40PM, with her team rushing her to a nearby private clinic where she was pronounced dead on arrival.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed that investigations into Detective Constable Hoves death are ongoing.\n\nThe Zimbabwe Republic Police confirms that investigations are being conducted in connection with the tragic and unfortunate death of Detective Constable Cassandra Hove of CID Homicide Bulawayo on March 6, 2025 while pursuing armed robbery suspects. The shooting incident occurred at Habek area, Pumula South, Bulawayo, said Commissioner Nyathi.\n\nDetective Constable Hove with fellow members of the all-female CID Homicide unit, Team Lozikheyi\n\nHe said that Commissioner-General of Police Stephen Mutamba is mourning Detective Constable Hove, while assuring that a comprehensive investigation is underway to establish the precise circumstances of the incident. He stressed that law enforcement is declaring war against violent crimes, while appealing to members of the public to come forward with information that could lead to the arrest of the suspects.\n\nThe ZRP reiterates that there is no going back in the fight against armed robberies and other violent crimes in the country. The public should feel free to give information on criminal movements on Complaints Desk number 0242703631 or WhatsApp number 0712800197, he said.\n\nThe late Detective Constable Cassandra Hove\n\nJust hours before her death, Detective Constable Hove had posted a seemingly cryptic message on her Facebook page, Usandipusha, ndofamba ndega . . . Ndini zvangu ndichiudza ngirozi musi we judgement day, translating to do not push me, I can walk on my own, that will be me saying that to an angel on judgement day. This led to an outpouring of grief, with many mourning her death while others suggested her message could be interpreted as a premonition of her demise. A source close to the investigation revealed that her death occurred during a pursuit of suspects wanted for armed robberies targeting fuel stations.\n\nThe late Detective Constable Cassandra Hove\n\nShe was shot and sustained a wound on her breast during an exchange of fire with armed robbers.\n\nRecently, the city recorded a series of armed robberies at fuel service stations. In one of the nights, five fuel stations were raided. So, CID detectives were following up on a tip-off, but unfortunately the armed robbers shot and subsequently killed the cop, said a source.\n\nThe shooting is said to have happened so quickly that residents in the area were left shocked.\n\nThe late Detective Constable Cassandra Hove\n\nAlthough we heard gunshots, we couldnt tell what really transpired. I heard three gunshots. I was scared to go out and check what was happening, but some few residents went to the scene but didnt stay long. It is only today that we learnt that a cop had been shot and killed. Our neighbourhoods are becoming unsafe. We hope the police will soon get to the bottom of the matter, said a Pumula South resident who preferred not to be named.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dscxzczxc.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw BULAWAYO’S Pumula suburb became a scene of a heart-breaking tragedy on Thursday night when a female detective from the Criminal Investigations Department’s crack Homicide Unit was shot dead in the line of duty. Her life, dedicated to protecting the city, was extinguished as she and her colleagues pursued suspected armed robbers. Detective […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "Zanele Khumalo to serve as regent for young Chief Mabhikwa",
            "url": "https://www.chronicle.co.zw/zanele-khumalo-to-serve-as-regent-for-young-chief-mabhikwa/",
            "content": "NQOBILE TSHILI,[emailprotected]A moving tradition unfolded as the Mabhikwa family, still grieving the loss of Chief Mabhikwa (Vusumuzi Khumalo), named his nine-year-old son as his rightful heir. Until the young Wayne Makhosemvelo Khumalo comes of age to fully assume his duties, his aunt, Zanele Khumalo, will serve as regent, ensuring continuity and guidance.\n\nThe tragic passing of Chief Mabhikwa in May 2022, at just 28, following a road accident, left a void in the community. Initially, John Khumalo stepped in as acting Chief, a temporary measure while the family considered the future.\n\nEarlier this year, the familys choice of Chief Mabhikwas eldest son was put forward to the Matabeleland North Provincial Council of Chiefs, a significant step in the formal process. This nomination then progressed to the National Council of Chiefs, culminating in President Mnangagwas official endorsement.\n\nAlongside the young heir, Zanele (35) was entrusted with the role of regent. Her appointment, effective mid-January, marks a crucial period of stewardship, as she prepares the young chief for his future responsibilities. Saturday Chronicle spoke with her, capturing the moment as she embraced this significant undertaking.\n\nLate Chief Mabhikwa (Nicholas Khumalo) father to the late Late Chief Mabhikwa (Vusumuzi Khumalo)\n\nIm the eldest child of the late Chief Mabhikwa (Nicholas Khumalo), and the late Chief (Vusumuzi) was my younger brother. I have been appointed regent chief to stand in for Vusumuzis son, who has been appointed Chief Mabhikwa. Vusumuzi had three children, and his eldest, who is nearly nine, has been chosen as the chief. As the new chiefs aunt, the family deemed it appropriate to select me as regent chief, said the regent chief.\n\nHer appointment necessitated her leaving her employment in South Africa to serve in this traditional role.\n\nRegent Chief Mabhikwa acknowledged that her appointment is not without its challenges and has generated mixed reactions within the community.\n\nThis is not going to be easy. I will be working with a diverse group, unlike before when I was focused solely on my own affairs. I will do my best, but I am aware of the challenges. Most community members are happy about my appointment, although some remain sceptical. This is the first time in our clans history that a female chief or regent chief has been appointed.\n\nI understand that some people may doubt a womans leadership, as they are accustomed to male leaders. However, I am confident that I will fulfil my role effectively. I am very pleased that we already have female chiefs in the country. This will be helpful as I perform my duties in a male-dominated sector. The presence of female chiefs proves that we are capable of leading.\n\nShe stressed that while she will lead the entire community, womens issues are particularly close to her heart. Regent Chief Mabhikwa stated that most women require support through empowerment projects, as they are the backbone of many families.\n\nI want to address unemployment and contribute to our communitys development. We will soon be conducting Gukurahundi hearings, which is a sensitive topic, and we hope the hearings will not lead to divisions. We still have few female traditional leaders in lower structures, such as village heads, and we hope to increase their numbers, said Regent Chief Mabhikwa.\n\nShe revealed that while her younger brothers tenure was brief, he laid a developmental foundation for the area, and she intends to continue on the same path.\n\nRegent Chief Mabhikwa also highlighted the communitys water challenges and pledged to use her position to lobby for the provision of this essential resource.\n\nMatabeleland North Provincial Council of Chiefs chairperson, Chief Siansali, confirmed that\n\nKhumalos appointment aligns with established practices.\n\nThis is not a new practice in our institution. We have had a regent for Chief Dakamela, who was also an aunt. So, this is within the bounds of established practice, said Chief Siansali.\n\nHe clarified that the traditional leadership institution was simply adhering to the familys wishes.\n\nIndeed, the family nominates the successor to the Chief Mabhikwa throne. The necessary paperwork has been processed through the Provincial Assembly of Chiefs and subsequently to the National Council of Chiefs. The President has appointed the next Chief Mabhikwa, who is the son of the late Chief Mabhikwa (Vusumuzi Khumalo), he said.\n\nThe nine-year-old son is the appointed successor Chief Mabhikwa. Unfortunately, due to his age, he cannot assume office until he is 18 years or older.Chief Siansali confirmed that Khumalo will serve as regent for the coming years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/DSAFXCVXZVC.jpg",
            "description": "NQOBILE TSHILI, nqobile.tshili@chronicle.co.zw A moving tradition unfolded as the Mabhikwa family, still grieving the loss of Chief Mabhikwa (Vusumuzi Khumalo), named his nine-year-old son as his rightful heir. Until the young Wayne Makhosemvelo Khumalo comes of age to fully assume his duties, his aunt, Zanele Khumalo, will serve as regent, ensuring continuity and guidance. The […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "Oxford Brookes University graduate, real estate mogul: Samantha Banda’s IWD story of success| My journey",
            "url": "https://www.chronicle.co.zw/oxford-graduate-real-estate-mogul-samantha-bandas-iwd-story-of-success-my-journey/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTODAY, the world marks International Womens Day, honouring the social, economic, cultural, and political triumphs of women. As Womens History Month progresses, the demand for swift equality grows louder.\n\nIn this spirit, we spotlight Samantha Banda, a Bulawayo native, whose transformative experience at the Forbes Woman Africa Leading Women Summit in Pretoria, she describes as profoundly eye-opening.\n\nAttending the Forbes Woman Leading Summit has been an eye-opener for me, and one of the key takeaways and inspirations has been seeing the boldness that most of the women exude. Its not about changing the world, but rather bringing that feminine touch and literally shaking whatever industry they are in.\n\nThis annual summit welcomes African and international visionaries from business, technology, government, arts, entertainment, sports, and civil society to address some of the biggest opportunities and challenges facing female leadership today.\n\nHearing life-changing stories from different walks of life has been an inspiration to me because at this summit, we have women from the African continent as a whole, and Ive been fortunate enough to be a part of the few women who attend these kinds of meetings. Its an honour to be one of the women in this charge towards womens emancipation, she said.\n\nThis years edition showcased the best of their award-winning editorial content, attracting top-tier, A-list speakers  from global billionaires to Hollywood celebrities, Olympian sports stars, corporate titans, and Grammy-winning artistes  featuring curated conversations and content that touched on the engaging topics and trends of the day and beyond.\n\nThese esteemed individuals included Tiwa Savage, Zozibini Tunzi, Tems Temilade Openiyi, Gyakie Jackline Acheampong, Greg Solomon, and Fifi Peters.\n\nSamantha Banda attending a Forbes Leading Women Summit\n\nIts a common childhood experience to be asked, What do you aspire to be in life after school? For Banda, who envisioned herself as a lawyer and a businesswoman, she brought that dream to life, even though she hasnt actively practiced law, something she refers to as a prestigious degree.\n\nEvents management taught me how to run a business, but my passion drove me into property development and real estate management. I think I have been subconsciously in the property development space for a long time without knowing it.\n\nSo, transitioning from events management to property development hasnt been that hard because the principles applied to both are the same, she said.\n\nAs a multi-faceted woman armed with a law degree from Oxford University in the UK, and currently pursuing a Property Development Post-Graduate degree with the National University of Science and Technology (Nust), Banda is not resting on her laurels, seeking opportunities to expand her portfolio.\n\nBorn and raised in Njube, Banda, an Air BnB host, real estate manager, property developer, and event planner, is a true shape-shifter, constantly adapting to disrupt.\n\nGrowing up in the townships and being able to appreciate both worlds, as I have learnt in Insukamini all the way up to Malaysia and Oxford University in the UK, has made me appreciate life more and take nothing for granted, as I have lived in both extremes, she said.\n\nSince 2022, she has seen her real estate portfolio grow from hosting two BnBs to now hosting five.Despite her busy schedule, Banda finds time to play golf, read, and travel in solitude. These activities help her recharge. To her, they are therapeutic.\n\nThis years Womens History Month theme, Moving Forward Together! Women Educating and Inspiring Generations, resonates deeply with Banda, who is not content with simply being a reference point, but is leading the charge towards helping the next generation of entrepreneurs through mentorship.\n\nIts not enough to just be the woman with knowledge and skills without sharing them. So, I have made it a point to mentor and coach other women on what my career in business has taught me. I have tapped into a new space of teaching people the importance of having vision boards and how they can significantly change their lives. So, this years theme is a call to skills and knowledge exchange, she said.\n\nVision or dream boards are visual representations of ones goals, often comprising a collage of images and affirmations representing ones dreams and desires.\n\nSamantha Banda\n\nBanda has faced the age-old challenge of having to work twice as hard to prove herself as a woman for recognition compared to her male counterparts.\n\nConstantly having to prove yourself worthy of recognition, especially in a male-dominated space, has been a challenge because you have to work twice as hard for that, she said.\n\nBoasting a plethora of accolades and recognition, including a Customer Focus Award of the Year 2022 at the Megafest Business Awards for her work with Crown Events, the Female Founders Initiative Middle East and Africa 50 under 50 award at the Sheeo Leadership Bootcamp in Qatar last year, and a Ministry of Women Affairs, Community, Small and Medium\n\nEnterprises Development affiliation graduation from micro to being a small enterprise certificate in 2023, Banda has positioned herself for entrepreneurial elevation.\n\nShe has been a speaker at various high-level business conferences, including the Money Soiree and the Agenda Women Summit, inspiring other women to take up spaces in their respective industries.\n\nBandas mission is to reach global business icon status, something shes ready to dedicate her blood, sweat, and tears towards.Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/rgea.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com TODAY, the world marks International Women’s Day, honouring the social, economic, cultural, and political triumphs of women. As Women’s History Month progresses, the demand for swift equality grows louder. In this spirit, we spotlight Samantha Banda, a Bulawayo native, whose transformative experience at the Forbes Woman Africa Leading Women Summit in Pretoria, […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "SADC leaders to meet  again over DRC crisis",
            "url": "https://www.chronicle.co.zw/sadc-leaders-to-meet-again-over-drc-crisis/",
            "content": "Rumbidzayi Zinyuke, Harare BureauSADC Chairman, President Mnangagwa, is set to convene an Extraordinary Summit of Heads of State and Government to address the escalating security crisis in the eastern Democratic Republic of Congo (DRC) and deliberate on recommendations from the virtual Extraordinary Organ Troika Summit held on Thursday.\n\nSADC Chairman, President Mnangagwa\n\nIn a communiqu, the SADC Secretariat announced that the date of the summit, likely to be held in Harare, will be revealed soon.\n\nThe outcomes and recommendations from the Extraordinary Organ Troika Summit will be presented to the Extraordinary Summit of SADC Heads of State and Government, to be convened soon on a date to be confirmed.\n\nThe virtual Troika Summit, chaired by Tanzanian President Dr Samia Suluhu Hassan in her capacity as Chairperson of the SADC Organ on Politics, Defence, and Security Co-operation, focused on strategies to restore peace in the DRC. It also reviewed the report of the defence sub-committee on the mandate of the SADC Mission in the DRC (SAMIDRC).\n\nThe meeting was attended by the incoming Chairperson of the SADC Organ on Politics, Defence, and Security Co-operation, Malawian President Lazarus Chakwera, along with Zambian President Hakainde Hichilema, South African President Cyril Ramaphosa, and DRC President Flix Tshisekedi.\n\nPresident Felix Tshisekedi\n\nIn her opening remarks, Dr Suluhu Hassan reiterated SADCs unwavering commitment to supporting the DRC in its pursuit of peace. She emphasised the importance of regional solidarity in addressing the ongoing conflict.\n\nThe summit expressed its deepest condolences to the Democratic Republic of Congo, the Republics of South Africa and Malawi, and the United Republic of Tanzania for the deceased soldiers who lost their lives during the recent attacks in the eastern DRC while serving under the SAMIDRC, and wished those injured a speedy recovery, the SADC Secretariat said in a statement.\n\nThe SAMIDRC force, deployed in December 2023 to stabilise the conflict-ridden region, has faced growing challenges, including mounting pressure from the M23 rebel advance and increasing troop casualties.\n\nThe summit reaffirmed SADCs commitment to supporting interventions aimed at achieving lasting peace and security in the eastern DRC, in line with the SADC Mutual Defence Pact of 2003, which governs regional security operations.\n\nDespite efforts by SADC and the East African Community (EAC), fighting between Congolese security forces and M23-led rebel groups has intensified in recent weeks. The rebels, who had previously entrenched themselves in Goma in North Kivu, have now expanded their presence to South Kivus capital, Bukavu, establishing new administrative structures in the city.\n\nThe conflict has fuelled one of the worlds most severe humanitarian crises, with over one million Congolese seeking refuge beyond the countrys borders and about 21 million people within the country in urgent need of medical aid, food, and other essential supplies.\n\nSince the start of last year, nearly 358 000 people have been displaced, with 80 percent of this displacement linked to armed conflict. New UN-verified data also reveals a 30 percent rise in grave violations against children in eastern DRC compared to 2023.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/DSCECSD.jpg",
            "description": "Rumbidzayi Zinyuke, Harare Bureau SADC Chairman, President Mnangagwa, is set to convene an Extraordinary Summit of Heads of State and Government to address the escalating security crisis in the eastern Democratic Republic of Congo (DRC) and deliberate on recommendations from the virtual Extraordinary Organ Troika Summit held on Thursday. In a communiqué, the SADC Secretariat […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "Cultural organisation re-greens Khami Monument",
            "url": "https://www.chronicle.co.zw/cultural-organisation-re-greens-khami-monument/",
            "content": "Chronicle WriterA local cultural organisation, Manyanga Eva Rozvi/Lozwi Cultural and Community Group, recently planted 70 indigenous fruit trees at the Khami Ruins National Monument (Khami), 22 km west of Bulawayo.\n\nMr Emmanual Kanjoma, a spokesperson for the group said they, on Saturday, planted umnyi (munyii in Shona), umkhiwa (muwonde), umvebe (mumvee), umkhomo (muuyu), and uxakuxaku (mutohwe) among others.\n\nThey planted them along the road from the entrance to the reception office, around the interpretive area as well as along the path to the passage platform and around the monolith platform.\n\nWe chose Khami for obvious reasons, said Mr Kanjoma, a descendent of Mambo Tohwechipi, the last known King of the Rozvi State.\n\nThe Rozvi have a direct association with Khami through Torwa. The Rozvi are the successors of the Torwa Empire. Around Khami there are few indigenous fruit trees mainly due deforestation. People are cutting trees for firewood.\n\nMrs Chrysostoma Kanjoma, plants a tree at Khami Ruins National Monument\n\nCovering about 108 hectares, Khami was the capital of the Torwa/Togwa dynasty which rose after the fall of the Great Zimbabwe Kingdom and governed much of present-day Zimbabwe between 1450 and 1650. The Rozvi State succeeded the Torwa and abandoned Khami in the late 1830s.\n\nWe want to restore the forest around Khami Monument to its original state, where the inhabitants would gather fruits from the forest around their habitat for consumption. Indigenous fruits also have medicinal value.\n\nKhami is also close to town thus locals can go and learn about indigenous fruits and their health benefits, he added.\n\nManyanga Eva Rozvi/Lozwi Cultural and Community Group has about 120 members, among them historians and archaeologists based locally, in the UK and Botswana where some descendants of the former empire are resident.\n\nA group of children from Green Gables High School, which is located near Khami, attended the tree planting event and recited poems on biodiversity.\n\nThey were later taken on an educational tour of the monument. Zimbabwe Welcome Association, a team of volunteers based in Harare, was present as well.\n\nLooking ahead, Mr Kanjoma said the organisation is preparing to host an event on Africa Day in May.\n\nWe want to be seen through the work that we do, especially at shrines which are associated with the Rozvi State such as Khami, Dlodlo (now known as Dananombe Monument), he said.\n\nIn the long run, we want to have a chance to tell our own history, not that written by whites. We want to have a place at Khami or Dlodlo where we will put up a display depicting some elements of the Rozvi State. We want to restore that civilisation  the quarrying, iron smelting, structural engineering and so on that were done there in the olden days.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sdcwecsd.jpg",
            "description": "Chronicle Writer A local cultural organisation, Manyanga Eva Rozvi/Lozwi Cultural and Community Group, recently planted 70 indigenous fruit trees at the Khami Ruins National Monument (Khami), 22 km west of Bulawayo. Mr Emmanual Kanjoma, a spokesperson for the group said they, on Saturday, planted umnyi (munyii in Shona), umkhiwa (muwonde), umvebe (mumvee), umkhomo (muuyu), and […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "UNDER PRESSURE . . . Highlanders, Dynamos, CAPS aim to bounce back after Week 1 setbacks",
            "url": "https://www.chronicle.co.zw/under-pressure-highlanders-dynamos-caps-aim-to-bounce-back-after-week-1-setbacks/",
            "content": "Innocent Kurira,[emailprotected]\n\nTHE 2025 Castle Lager Premier Soccer League resumes this weekend, with all eyes fixed on how the traditional powerhouses  Highlanders, Dynamos, and CAPS United  will respond after their lacklustre season openers.\n\nIn Week One, the big three all faltered, failing to secure a single victory. Highlanders suffered a 1-0 defeat to newcomers MWOS, CAPS United were held to a 1-1 draw by GreenFuel, and Dynamos played out a goalless stalemate against ZPC Kariba.\n\nWhile its far too early to draw definitive conclusions about the season, these teams urgently need to find their rhythm. The second round of league action provides their starting point.\n\nSaturday Chronicle previews the weekends action.\n\nHighlanders vs Kwekwe United\n\nHighlanders will be determined to avoid a second consecutive defeat in their opening two matches, particularly against newly promoted teams. Following a humbling 1-0 loss to league debutants MWOS last week, Highlanders will be eager to make amends in their first home fixture of the season.\n\nBarbourfields Stadium is expected to be packed with loyal supporters as coach Kelvin Kaindu seeks a crucial win against Kwekwe United tomorrow. The club remains hopeful that their FIFA transfer ban will soon be lifted, allowing them to bolster their squad. Kwekwe United, buoyed by a solid 1-1 draw in their top-flight debut against Ngezi Platinum Stars, will be keen to carry that momentum into this clash.\n\nKwekwe United boasts a seasoned coach in Saul Chaminuka, who has a blend of youth and experience in his squad. Experienced players include Dennis Dauda, Timothy January, Masimba Mambare, Allan Gahadzikwa, and Hilary Bakacheza.\n\nDynamos vs Herentals\n\nDynamos will be desperate to secure their first win of the season when they face Herentals at Rufaro Stadium this afternoon. The Harare giants were held to a goalless draw by ZPC Kariba in their opener, and coach Lloyd Chigowe will be hoping for a more clinical performance from his team. Dynamos collected four points from Herentals last season. The first meeting between the two teams ended in a one-all draw, with Dynamos winning the return leg 2-1.\n\nCAPS United vs Scottland\n\nCAPS United will aim to upset the seasons title favourites, Scottland, at Rufaro Stadium tomorrow. Despite being forced to come from behind in their season opener, Lloyd Chitembwes side has shown promise, especially with new signings like Kundai Benyu and Tanaka Shandirwa. Their task will be challenging, as Scottland has invested heavily in their squad, acquiring stars such as Walter Musona and Khama Billiat. This matchup promises to be a highlight of Week Two, with both teams eager to make an early statement. Scottland won their opening game 1-0 against Triangle, though the victory was far from convincing.\n\nRufaro stadium\n\nFC Platinum vs Manica Diamonds\n\nFormer champions, FC Platinum, will face a tough test against Manica Diamonds at Mandava Stadium today. The platinum miners were held to a goalless draw by Simba Bhora in their opener, while Manica Diamonds began their season with a 1-0 victory over Yadah Stars. Last season, Manica Diamonds proved to be a difficult opponent for FC Platinum, defeating them in both fixtures. This match promises to be a high-intensity affair, with both teams looking to gain an advantage early in the title race.\n\nFixtures\n\nToday:\n\nHerentals v Dynamos (Rufaro), ZPC Kariba v Simba Bhora (Nyamhunga), TelOne v Triangle (Ascot Stadium), Ngezi Platinum v Greenfuel (Baobab), FC Platinum v Manica Diamonds (Mandava), Bikita Minerals v MWOS (Sakubva).\n\nTomorrow\n\nCAPS United v Scottland (Rufaro), Highlanders v Kwekwe United (Barbourfields)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-1-copy-3.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw  THE 2025 Castle Lager Premier Soccer League resumes this weekend, with all eyes fixed on how the traditional powerhouses — Highlanders, Dynamos, and CAPS United — will respond after their lacklustre season openers. In Week One, the “big three” all faltered, failing to secure a single victory. Highlanders suffered a 1-0 defeat to […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "Nigerian delicacies delight Bulawayo diners",
            "url": "https://www.chronicle.co.zw/nigerian-delicacies-delight-bulawayo-diners/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nHave you ever imagined indulging in a sumptuous meal featuring rice served with beef trotters, cow innards, beef, chicken, and a rich tomato stew, all harmoniously cooked together in one pot? Or perhaps, envision stepping into a restaurant and being served isitshwala alongside an okra stew brimming with beef or fish, again, all cooked in a single pot?\n\nWhile this might seem an unusual menu for many Zimbabweans, particularly Bulawayo residents, its a cherished delicacy in Nigeria. This is precisely what Sibonginkosi Msimanga, known affectionately as Cindy, a Lupane-born lady who spent over five years in Nigeria through marriage, has brought to Bulawayo.\n\nEgusi soup\n\nMsimanga told the Saturday Chronicle that her dishes are steadily gaining popularity, now catering to at least 30 clients daily, both locals and Nigerians.\n\nIve always enjoyed cooking, but I noticed a gap in the market for Nigerian food here in Zimbabwe. My familiarity with Nigerian cuisine stems from my marriage and the five-plus years I lived there, she explained during an interview, while preparing an Okra and Egusi stew for a client.\n\nMsimanga recounted that after launching her Nigerian cuisine business, she briefly travelled to Nigeria to visit her children. During her absence, others attempted to capitalise on her concept, distributing flyers advertising their own Nigerian menus.\n\nI dont believe they managed to penetrate the market as effectively, although some are still operating, she said.\n\nCindy Msimanga preparing jollof rice for her clients\n\nHowever, her introduction ofNigerian cuisine wasnt without its challenges.\n\nA friend encouraged me to prepare dishes for the Zimbabwe International Trade Fair (ZITF). To be honest, it was almost a disaster. Im grateful I recovered my start-up capital, but I didnt make any profit, she said.\n\nUndeterred by this initial setback, Msimanga remained determined to pursue her dream, knowing that perseverance pays off.\n\nThrough my Nigerian contacts, I began taking orders and delivering to clients. Excellent service naturally attracts people, and gradually, the numbers grew. Now, on a good day, I can receive up to 30 orders, Msimanga said.\n\nJollof rice\n\nShe offers a variety of dishes, tailored to client preferences,including rice. They have rice, similar to ours, but its white rice served with a stew, which in South Africa is sometimes called kwasakwasa and red stew. This stew includes amangqina, the insides, beef, chicken, tomatoes, all cooked together without any broth, Msimanga said.She also said that dehaired cow skin is a delicacy for some of her clients.\n\nMsimanga detailed that the ingredients are cooked separately, as they have different cooking times, and then combined in one pot for further steaming before serving. She noted that the preparation of Nigerian stew follows a similar process, with variations in the final additions.\n\nOkra soup\n\nMy menu includes Egusi stew, made from ground dry melon seeds used as a thickener. I also offer Okra stew, mixed with either beef or fish, prepared using palm oil, which is organic and extracted from palm fruit, Msimanga said.\n\nHer menu also features two types of cooked rice: Jollof and fried rice. Jollof rice is traditionally made with long-grain rice, tomatoes, chillies, onions, spices, and occasionally other vegetables and/or meat, all cooked in a single pot.\n\nThe tomato mixture is cooked twice: first to soften the raw vegetables, and then again with seasoning to develop the flavourful stew base.\n\nFried rice is a dish made with meats, mixed vegetables like carrots, peas, sweet corn, and green beans.\n\nYoucan also add spices, Msimanga said.\n\nMsimangas long-term aspiration is to establish a fully-fledged restaurant specialising exclusively in Nigerian cuisine.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/FDASASDFF.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw  Have you ever imagined indulging in a sumptuous meal featuring rice served with beef trotters, cow innards, beef, chicken, and a rich tomato stew, all harmoniously cooked together in one pot? Or perhaps, envision stepping into a restaurant and being served isitshwala alongside an okra stew brimming with beef or fish, again, all […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "COMMENT: Zimbabwe is a key player in global lithium industry",
            "url": "https://www.chronicle.co.zw/comment-zimbabwe-is-a-key-player-in-global-lithium-industry/",
            "content": "VARDHAAN Lithiums entry into Zimbabwes mining sector marks a turning point in the countrys efforts to harness its vast mineral wealth for economic growth.\n\nWith plans to establish Indias first lithium refinery and battery manufacturing unit, the company is set to bring beneficiation and value addition to Zimbabwes lithium industry.\n\nDuring a high-level engagement at State House in Harare, Vardhaan Lithiums Chairman, Mr Sunil Joshi, and Managing Director, Mr Vedansh Joshi, expressed their commitment to investing in Zimbabwes mining sector to President Mnangagwa.\n\nThis reflects Zimbabwes growing importance in the global lithium supply chain, driven by the rising demand for electric vehicles (EVs) and renewable energy storage.\n\nA Special Purpose Vehicle (SPV) named Avani Microlight, a joint venture between Vardhaan Lithium and Zimbabwes Microlight Mineral Resources, will explore and extract lithium in Bikita, Masvingo province.\n\nMore than just extraction, the project aims to establish a lithium battery assembly plant and an EV manufacturing facility, ensuring Zimbabwe moves beyond raw material exports.\n\nAccording to Mr Martin Matoi, vice chairman and director for corporate affairs at Microlight Mineral Resources, operations will soon commence in a secured site in Bikita.\n\nThe project aligns with Zimbabwes industrialisation agenda, ensuring maximum benefits from its resources.\n\nBeyond economic gains, this investment presents a crucial opportunity for skills and technology transfer.\n\nZimbabwean youths and professionals will undergo training in India, equipping them with expertise to support the local industry.\n\nThis initiative will create jobs and enhance Zimbabwes competitiveness in the global lithium market.\n\nIndian investments in Zimbabwe have surged to US$600 million, providing direct employment to 5 000 Zimbabweans and benefiting 10 000 more indirectly.\n\nThe growing Indian presence in Zimbabwe reflects deepening bilateral relations, and Vardhaan Lithiums investment further strengthens this partnership.\n\nAs Zimbabwe strives to attain upper-middle-income status by 2030, strategic investments like this are vital.\n\nBy leveraging technical expertise and financial resources, this venture positions Zimbabwe as a key player in the global lithium industry, unlocking industrial growth, technological advancement, and economic prosperity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/vczxvczxcv.jpg",
            "description": "VARDHAAN Lithium’s entry into Zimbabwe’s mining sector marks a turning point in the country’s efforts to harness its vast mineral wealth for economic growth. With plans to establish India’s first lithium refinery and battery manufacturing unit, the company is set to bring beneficiation and value addition to Zimbabwe’s lithium industry. During a high-level engagement at […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "Hairdressing dynasty: How one woman is taking family trade to new heights",
            "url": "https://www.chronicle.co.zw/hairdressing-dynasty-how-one-woman-is-taking-family-trade-to-new-heights/",
            "content": "Trish Mukwazo,[emailprotected]\n\nHAIRDRESSING isnt just a profession for Elizabeth Chiwoko; its a family legacy passed down through generations. However, Elizabeth has taken this gift to new heights, establishing a salon that offers a wide range of hair products and cutting-edge hairstyles.\n\nThirty-year-old Elizabeth Chiwoko, or Lizzy as shes known, is the founder and CEO of a thriving hair salon in the centre of Bulawayo. Her business has become a go-to destination for all hair needs, offering an extensive range of products and the latest styles.\n\nLizzy is not only a hairdresser and stylist but also manufactures and sells her own hair products.Born and raised in Bulawayo, the City of Kings, Lizzy resides in the Sizinda suburb. She attended Intunta Primary School and Ihlathi High School before graduating with a degree in Human Resources Management.\n\nShe was inspired by her mother, who worked tirelessly to provide for the family after their fathers passing.\n\nOur father passed away when I was very young  I was just six. I used to see her doing very hard jobs. She didnt care who offered the work; all she wanted was to earn money to feed us and send us to school. So I told myself, I want to be my own boss one day and be a successful businesswoman.\n\nA true innovator, Lizzy constantly introduces new products and services to her business. She has collaborated with reputable organisations like Plan International and Pusheka Girl, participating in projects aimed at empowering girls. These projects, funded by Finance, Economic Development, and Investment Promotion Minister Professor Mthuli Ncube, have taken place in Tshabalala and Cowdray Park suburbs.\n\nMinister Professor Mthuli Ncube\n\nLizzy credits her supportive family for providing the initial funding to establish her business. She sources her hair products from various African countries, ensuring her clients receive only the best. While her business provides a good income, Lizzy emphasises the importance of discipline in maintaining a successful entrepreneurial journey.\n\nComing from a family of hairdressers, Lizzy explains that her full-time focus sets her apart.Were a family of hairstylists, but we also have our own degrees alongside our hairdressing skills, she said.To further develop her skills and knowledge, Lizzy attended wig-making and business masterclasses at Shara Hair Beauty\n\nAcademy in South Africa and Nigeria. She is currently studying cosmetology at Bulawayo Polytechnic.Despite facing challenges such as difficult clients and slow periods, Lizzy remains committed to her vision, attributing her success to her ability to work under pressure.\n\nElizabeth Chiwoko\n\nYou know clients  some are rude, some are always complaining, and you know the client is always right. You need to smile and be understanding.\n\nRegarding work-life balance, Lizzy explains that she divides her day into three parts: self-care, business (money and power), and family time.\n\nIts the only way to bring balance from the outset and avoid regrets, she believes.Lizzys dream is to open a beauty therapy academy and a company to manufacture her own hairpieces and products.\n\nThe industry can sometimes be competitive and discouraging. I find it really important to cheer each other on in our successes and have open communication.\n\nFaith without works is dead, Lizzy concludes. God is good all the time. Always put God first, and your vision will be successful. Jeremiah 29:11.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/egrwa.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com HAIRDRESSING isn’t just a profession for Elizabeth Chiwoko; it’s a family legacy passed down through generations. However, Elizabeth has taken this gift to new heights, establishing a salon that offers a wide range of hair products and cutting-edge hairstyles. Thirty-year-old Elizabeth Chiwoko, or Lizzy as she’s known, is the founder and CEO […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        },
        {
            "title": "WATCH: Uncharted waters…The case for Coventry as IOC president",
            "url": "https://www.chronicle.co.zw/watch-uncharted-waters-the-case-for-coventry-as-ioc-president/",
            "content": "Stanford Chiwanga,[emailprotected]\n\nFEW athletes have navigated the uncharted and stormy waters of their careers with as much grace and determination as Kirsty Coventry. A symbol of patriotism, Coventry has not only brought glory to Zimbabwe through her extraordinary achievements in swimming but has also demonstrated exceptional leadership in various capacities. As she now seeks to become the next president of the International Olympic Committee (IOC), her extensive experience and unwavering commitment to gender equality make her the ideal person for the post.\n\nCoventrys journey to becoming one of the most decorated Olympians in history began in Harare. Her talent in swimming was evident from a young age, and she quickly rose through the ranks to represent Zimbabwe on the global stage. Coventrys breakthrough came at the 2004 Athens Olympics, where she won three medal  a gold in the 200-metre backstroke, a silver in the 100-metre backstroke, and a bronze in the 200-metre individual medley. This made her a national hero and earned her the title of Golden Girl.\n\nCoventrys success continued at the 2008 Beijing Olympics, where she further cemented her legacy by winning four medal  a gold in the 200-metre backstroke and three silvers in the 100-metre backstroke, 200-metre individual medley, and 400-metre individual medley. Her performance in Beijing was particularly notable as she set a world record in the 200-metre backstroke, showcasing her dominance in the sport. Over her illustrious career, Coventry amassed a total of seven Olympic medals, making her the most decorated African Olympian of all time.\n\nhttps://youtu.be/k52RYU34fqU\n\nBeyond her achievements in the pool, Coventry has made significant contributions to Zimbabwean sports and the global sporting community. In 2018, she was appointed as the Minister of Youth, Sport, Arts and Recreation in Zimbabwe, a role in which she has worked tirelessly to promote sports development and youth empowerment. Under her leadership, the ministry has implemented various initiatives to improve sports infrastructure, support athletes, and encourage participation in sports at all levels. Coventrys efforts have not only elevated the status of sports in Zimbabwe but have also inspired a new generation of athletes to pursue their dreams.\n\nCoventrys leadership extends beyond her ministerial role. She has been an active member of the IOC since 2013 and was elected as the Chairperson of the IOC Athletes Commission in 2018. In this capacity, she has been a vocal advocate for athletes rights and has played a crucial role in shaping policies that prioritise athlete welfare. Her experience as an athlete has given her a unique perspective on the challenges faced by sportspeople, and she has used this insight to drive positive change within the IOC.\n\nOne of Coventrys most significant contributions to the IOC has been her commitment to gender equality. She has been a staunch advocate for increasing female representation in sports and leadership positions within the IOC. Under her guidance, the IOC has made strides towards achieving gender parity, with women now making up 42 percent of its membership. Coventry has also championed initiatives to support female athletes and ensure that they have equal opportunities to succeed. Her efforts have been instrumental in breaking down barriers and creating a more inclusive sporting environment.\n\nCoventrys dedication to gender equality is not limited to her work with the IOC. She has also been a vocal supporter of womens rights in Zimbabwe and has launched several initiatives to empower women and girls through sports. Her non-profit organisation, the Kirsty Coventry Academy, provides coaching and swimming lessons to young people, with a particular focus on those from low-income and underserved communities. Through this initiative, Coventry has helped countless young girls gain confidence, develop their skills, and pursue their passion for sports.\n\nAs Coventry now seeks to become the first female president of the IOC, her extensive experience and proven track record make her an ideal candidate for the role. Her leadership has been characterised by a commitment to excellence, inclusivity, and athlete welfare, values that are essential for the future of the Olympic movement. Coventrys vision for the IOC is one of progress and innovation, where the organisation continues to evolve to meet the needs of athletes and the global sporting community.\n\nCoventrys candidacy for the IOC presidency comes at a crucial time for the organisation. The IOC faces numerous challenges, including the need to adapt to the changing landscape of sports, address issues of corruption and doping, and ensure the sustainability of the Olympic Games. Coventrys experience as an athlete, minister, and IOC member uniquely positions her to tackle these challenges head-on. Her deep understanding of the sports world, combined with her strategic vision and leadership skills, make her the right person to lead the IOC into the future.\n\nIn addition to her professional achievements, Coventrys personal qualities also make her a standout candidate. She is known for her integrity, resilience, and unwavering dedication to her work. Her ability to connect with people from diverse backgrounds and her genuine passion for sports have earned her the respect and admiration of her peers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/FDGFFSDA.jpg",
            "description": "Stanford Chiwanga, stanford.chiwanga@chronicle.co.zw  FEW athletes have navigated the uncharted and stormy waters of their careers with as much grace and determination as Kirsty Coventry. A symbol of patriotism, Coventry has not only brought glory to Zimbabwe through her extraordinary achievements in swimming but has also demonstrated exceptional leadership in various capacities. As she now seeks to […]",
            "time": "06:23",
            "date": "08 Mar 2025"
        }
    ]
}