{
    "news": [
        {
            "title": "BREAKING: Highlanders Suspends CEO",
            "url": "https://www.chronicle.co.zw/breaking-highlanders-suspends-ceo/",
            "content": "Online ReporterHighlanders Football Club has reportedly suspended its chief executive officer, Brian Moyo pending further investigations.\n\nAccording to impeccable sources, a joint meeting of the clubs board and executive committee that took place at the club offices on Thursday evening, resolved to suspend Moyo on allegations concerning the transfer fees of two players acquired from Bulawayo Chiefs.\n\nMoyo is alleged to have improperly handled a financial transaction of which Bulawayo Chiefs were prejudiced of US$5 000.\n\nThis relates to US$23 000 which was due to Chiefs but they received US$18 000 with two invoices drawn.\n\nBosso had the higher figure requisition while Chiefs received US$18 000.\n\nMore details to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/y7uyu7i.jpg",
            "description": "Online Reporter Highlanders Football Club has reportedly suspended its chief executive officer, Brian Moyo pending further investigations. According to impeccable sources, a joint meeting of the club’s board and executive committee that took place at the club offices on Thursday evening, resolved to suspend Moyo on allegations concerning the transfer fees of two players acquired […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "“This is where I truly belong’ – actor Crispen Nyathi on returning to Zimbabwe after 11 years",
            "url": "https://www.chronicle.co.zw/this-is-where-i-truly-belong-actor-crispen-nyathi-on-returning-to-zimbabwe-after-11-years/",
            "content": "Blessed Moyo, Zimpapers Arts & Entertainment Hub\n\nAward-winning actor Crispen Nyathi, best known for his role as Pastor Charleston in the Mzansi Magic drama DiepCity, is set to be honoured by Chief Dakamela at the Imiklomelo kaDakamela Awards this weekend. The event, taking place in Nkayi from Friday to Saturday, will recognise individuals from various fields for their contributions to the community.\n\nSpeaking ahead of the event, Nyathi, who is based in South Africa, expressed his excitement about returning home after 11 years. Growing up in the streets of Emganwini and Sizinda in Bulawayo, Nyathi later relocated to rural Bulilima, koMasendu, before eventually moving to the neighbouring country.Im excited to come back home and step on the soil that gave birth to me. This is an opportunity for me to stand barefoot on the land of my ancestors. Nothing is more important to me right now; the fact that I am home means everything.\n\nAs he prepares to step onto home soil once again, Nyathi is overwhelmed with gratitude, cherishing the moment as a profound homecoming.\n\nBeing at my birthplace, at home, is priceless. This is the one place where, even without a passport, I dont have to prove who I am. Here, I am free and truly accepted, he said.\n\nNyathi revealed that the personal invitation from Chief Dakamela was deeply meaningful to him, especially as he had struggled with imposter syndrome and confidence issues earlier in his career.For a long time, I felt like I wasnt acknowledged enough in Zimbabwe  I felt unseen. This invitation reassures me that my people have always had my back. Many have told me they thought I was unreachable, so this event is very important to me, he said.\n\nThe actor sees the occasion as an opportunity to connect with fellow creatives and industry professionals, which could lead to new collaborations.This event provides a chance to interact and network with people from different backgrounds. You never know what opportunities may come from this, he added.\n\nFor Nyathi, the recognition from Chief Dakamela holds special significance.If the head of a household acknowledges you, it means the entire community also sees you. That is a great honour, he said.\n\nWith the Imiklomelo kaDakamela Awards set to bring together influential figures from across various sectors, Nyathis presence at the event is a powerful reminder of the importance of home, heritage, and recognition.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/grgrgrgrgrsdfdfs.jpg",
            "description": "Blessed Moyo, Zimpapers Arts & Entertainment Hub Award-winning actor Crispen Nyathi, best known for his role as Pastor Charleston in the Mzansi Magic drama DiepCity, is set to be honoured by Chief Dakamela at the Imiklomelo kaDakamela Awards this weekend. The event, taking place in Nkayi from Friday to Saturday, will recognise individuals from various […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Art and Ecology Laboratory of Ideas exhibition set for the gallery",
            "url": "https://www.chronicle.co.zw/art-and-ecology-laboratory-of-ideas-exhibition-set-for-the-gallery/",
            "content": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub\n\nIN a timely response to the pressing environmental issues facing our planet, the National Gallery of Zimbabwe (NGZ) in Bulawayo will host the Art and Ecology Laboratory of Ideas exhibition tonight. Curated by Laura Fungai Ganda and supported by the Embassy of Switzerland, this innovative event aims to use art as a powerful vehicle for fostering behavioural change in response to global warming and climate change.\n\nThe exhibition, part of the Creative Lounge Trust initiative, showcases a unique blend of artistic expression and ecological awareness. It is a carry-over of the one done in Harare recently and aims to emphasise the critical importance of sustainability within the realm of creativity, highlighting how art can transform waste into beauty and addressing the urgent challenge of garbage management in urban areas.\n\nRichard Nyamanhindi, Head of Communications at the Embassy of Switzerland in Zimbabwe, shared insights on the significance of the exhibition.\n\nThe exhibition highlights the power of creativity to reimagine waste, sparking conversations on sustainability and urban resilience. The innovative artworks not only celebrate environmental consciousness but also explored how public art can become a vibrant part of civic life, fostering engagement and inspiring change.\n\nThe project aims to collaborate with City Councils and Ministry of Local Government to bring these artworks to public spaces across Zimbabwe, turning them into symbols of sustainability and community pride, he said.\n\nArtists featured in the exhibition include Victor Nyakauru, Clive Mukucha, Shalom Kufakwatenzi, Tinotenda Chivhinge, Nothando Chiwanga, and Damien Grant. Together, their works will showcase diverse approaches to environmental themes, encouraging visitors to rethink waste and its potential.\n\nThe opening ceremony will be graced by Swiss Ambassador Stphane Rey and Bulawayo Mayor\n\nMr David Coltart\n\n, among other dignitaries. The exhibition marks the beginning of a transformative journey where art plays a pivotal role in encouraging environmental awareness and action.\n\nWith a vision to collaborate with City Councils and the Ministry of Local Government, the project aims to bring these artworks into public spaces across Zimbabwe, turning them into symbols of sustainability and community pride.\n\nAs the Art and Ecology Laboratory of Ideas exhibition opens its doors, it serves as a clarion call for communities to engage with the issues of waste management and environmental sustainability.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vbxchg.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub IN a timely response to the pressing environmental issues facing our planet, the National Gallery of Zimbabwe (NGZ) in Bulawayo will host the “Art and Ecology Laboratory of Ideas” exhibition tonight. Curated by Laura Fungai Ganda and supported by the Embassy of Switzerland, this innovative event aims to […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "BREAKING – President Mnangagwa removes Environment Minister Nyoni with immediate effect",
            "url": "https://www.chronicle.co.zw/breaking-president-mnangagwa-removes-environment-minister-nyoni-with-immediate-effect/",
            "content": "Online Reporter\n\nPRESIDENT Mnangagwa has dismissed Sithembiso Gile Gladys Nyoni from her position as Minister of Environment, Climate and Wildlife with immediate effect.\n\nThe termination was announced on Thursday night by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, who cited constitutional provisions as the legal basis for the decision.\n\nHis Excellency the President of the Republic of Zimbabwe, Cde Dr. E.D. Mnangagwa, has in terms of Section 340, subsection (1), paragraph (f), as read with Section 108, subsection (1), paragraph (a) of the Constitution of Zimbabwe, removed Sithembiso Gile Gladys Nyoni from the position of Minister of Environment, Climate and Wildlife with immediate effect, Dr. Rushwaya stated.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/zdas.jpg",
            "description": "Online Reporter PRESIDENT Mnangagwa has dismissed Sithembiso Gile Gladys Nyoni from her position as Minister of Environment, Climate and Wildlife with immediate effect. The termination was announced on Thursday night by the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, who cited constitutional provisions as the legal basis for the decision. “His Excellency […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "“Look for another venue for your show” – Bulawayo Shutdown told",
            "url": "https://www.chronicle.co.zw/look-for-another-venue-for-your-show-bulawayo-shutdown-told/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWE Cricket (ZC) have distanced themselves from the Bulawayo Shutdown musical show that is set to take place at Queens Sports Club on April 26, a venue that will be hosting four Test matches soon.\n\nZC said, as custodians of the venue, they have not sanctioned any concert at the venue.\n\nZC wishes to categorically state that it has not granted the organisers of the said event any consent to hold a concert at Queens Sports Club, venue of our upcoming Test series. Any claims suggesting otherwise are misleading and should be disregarded.\n\nAs the custodians of the venue, ZCs priority remains the game of cricket, and we will not permit the concert or any other non-cricketing event to take place at Queens Sports Club, read the statement.\n\nThe statement further read: ZC therefore strongly warns the show organisers to desist from misleading the public with false advertisements. Furthermore, ZC is taking legal action against those responsible for this misrepresentation.\n\nZimbabwe will host South Africa and New Zealand for two Tests.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Byoshutdown.jpg",
            "description": "Zimpapers Sports Hub ZIMBABWE Cricket (ZC) have distanced themselves from the Bulawayo Shutdown musical show that is set to take place at Queens Sports Club on April 26, a venue that will be hosting four Test matches soon. ZC said, as custodians of the venue, they have not sanctioned any concert at the venue. “ZC […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mzansi rallies around veteran actress Nandi Nyembe amid financial woes",
            "url": "https://www.chronicle.co.zw/mzansi-rallies-around-veteran-actress-nandi-nyembe-amid-financial-woes/",
            "content": "The South African entertainment industry has come together to support veteran actress Nandi Nyembe, who has fallen on hard times.\n\nThe 55-year-old actress, who is wheelchair-bound, recently opened up about her hardships in a heart-wrenching video shared by Masingita Masunga of the Above Normal Foundation.\n\nIn the video, Nandi revealed that despite her decades-long career, she has been facing significant financial difficulties, particularly after her son fell ill and she spent R88,000 on his medical treatment.\n\nFrom the money Ive worked for, my son got sick. I dont have money. How are you going to get a medical aid when you dont have money? I tried to get a company thats a bit cheaper. What are you going to pay it with every month?\n\nThe video sparked an outpouring of support from the public, celebrities and government officials.\n\nSport, arts and culture minister Gayton McKenzie promised money from his personal account in her support.\n\nI heard the bad news, things are not going well. Im in Cape Town. This is from me from my heart. This is not from the ministry. I will come see you in two weeks. I will send you something that will keep you until I see you. When I come I will fix everything else, he said.\n\nSource: TshisaLIVE\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/TshisaLIVE.jpg",
            "description": "The South African entertainment industry has come together to support veteran actress Nandi Nyembe, who has fallen on hard times. The 55-year-old actress, who is wheelchair-bound, recently opened up about her hardships in a heart-wrenching video shared by Masingita Masunga of the Above Normal Foundation. In the video, Nandi revealed that despite her decades-long career, […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Watch: Late Insiza North Legislator Cde Farai Taruvinga remembered for transformative leadership",
            "url": "https://www.chronicle.co.zw/watch-late-insiza-north-legislator-cde-farai-taruvinga-remembered-for-transformative-leadership/",
            "content": "Nqobile Bhebhe,Zimpapers News Hub\n\nThe late ZANU PF Insiza North legislator, Cde Farai Fimbo Taruvinga, has been hailed as a hardworking and people-oriented leader who spearheaded life-changing developments in Matabeleland South.\n\nSpeaking to Zimpapers News Hub at a memorial service in Bulawayo on Thursday afternoon, Matabeleland South Provincial Political Commissar, Cde Washington Nkomo, expressed deep sorrow over the passing of Cde Taruvinga, stating that he will be greatly missed.\n\nCde Taruvinga passed away on Monday morning at his home in Bulawayo after a long battle with cancer. He was 53.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/The-late-Cde-Farai-“Fimbo”-Taruvinga.jpg",
            "description": "Nqobile Bhebhe,Zimpapers News Hub The late ZANU PF Insiza North legislator, Cde Farai “Fimbo” Taruvinga, has been hailed as a hardworking and people-oriented leader who spearheaded life-changing developments in Matabeleland South. Speaking to Zimpapers News Hub at a memorial service in Bulawayo on Thursday afternoon, Matabeleland South Provincial Political Commissar, Cde Washington Nkomo, expressed deep […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "Late ZANU PF Legislator Cde Farai Taruvinga honoured with luxury motorcade at Bulawayo memorial",
            "url": "https://www.chronicle.co.zw/late-zanu-pf-legislator-cde-farai-taruvinga-honoured-with-luxury-motorcade-at-bulawayo-memorial/",
            "content": "Nqobile Bhebhe, Senior Reporter\n\nTop of the range vehicles are parked at a Bulawayo funeral parlor this Thursday afternoon for the memorial service of the late ZANU PF Insiza North legislator, Cde Farai Fimbo Taruvinga.\n\nMost of the vehicles bore inscriptions reading RIP Boss Fimbo.\n\nCde Taruvinga passed away on Monday morning at his home in Bulawayo after a long battle with cancer.\n\nHe was 53.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-03-at-15.09.18-680x380.jpeg",
            "description": "Nqobile Bhebhe, Senior Reporter Top of the range vehicles are parked at a Bulawayo funeral parlor this Thursday afternoon for the memorial service of the late ZANU PF Insiza North legislator, Cde Farai “Fimbo” Taruvinga. Most of the vehicles bore inscriptions reading “RIP Boss Fimbo.” Cde Taruvinga passed away on Monday morning at his home […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "GMB announces approved 2025 summer producer prices, winter wheat planting incentive",
            "url": "https://www.chronicle.co.zw/gmb-announces-approved-2025-summer-producer-prices-winter-wheat-planting-incentive/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nThe Grain Marketing Board (GMB) has announced the approved 2025 summer producer prices and the winter wheat planting incentive for farmers.\n\nThe parastatal said it appreciates the role of farmers and all stakeholders in pursuit of agricultural transformation towards national food security and economic growth.\n\nGMB Chief Executive Officer Dr Edson Badarai on Thursday said GMB will primarily purchase produce from farmers financed under the Presidential Input Programme (PIP) and irrigation schemes.\n\nThe producer price for maize and traditional grains has been set at US$376.48 per metric tonne.\n\nSoya beans and sunflower are pegged at US$580 and US$668.98 per metric tonne, respectively.\n\nFor winter wheat, the planting incentive has been set at US$451.35 per metric tonne.\n\nThese prices are consistent with achieving both food security and macroeconomic stability, said Dr Badarai.\n\nGMB will primarily purchase produce from farmers financed under the Presidential Input Programme (PIP) and irrigation schemes.\n\nContractors are expected to buy back contracted produce at market prices. Furthermore, GMB, working with ZMX, shall provide commercial warehouse receipt services to all players.\n\nGMB appreciates the role of farmers and all stakeholders in pursuit of agricultural transformation towards national food security and economic growth.\n\nThe Government has earmarked 120 000 hectares of winter wheat this year, marking a historic milestone in the countrys crop production records, as it moves to boost food security and slash the imports bill.\n\nThis ambitious plan is expected to produce 600 000 tonnes of the cereal, well above last years output of 562 591 tonnes and surpassing the minimum national requirement of 360 000 tonnes needed for self-sufficiency.\n\nThe 2025 winter plan aims to consolidate the gains from the Governments 2024 Wheat-Based Food Security initiative.\n\nLast season 119 954ha of wheat were planted and yielded 562 591 tonnes while barley was on 6 697ha and produced 36 120 tonnes.\n\nPotatoes were on 8 657ha and produced 233 739 tonne.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/02/Dr-Edson-Badarai.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter The Grain Marketing Board (GMB) has announced the approved 2025 summer producer prices and the winter wheat planting incentive for farmers. The parastatal said it appreciates the role of farmers and all stakeholders in pursuit of agricultural transformation towards national food security and economic growth. GMB Chief Executive Officer Dr Edson […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        },
        {
            "title": "BMA streamlines operations to boost SA border efficiencies",
            "url": "https://www.chronicle.co.zw/bma-streamlines-operations-to-boost-sa-border-efficiencies/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe creation of Border Management Authority (BMA) has helped streamline operations and boost efficiencies at South Africas ports of entry (PoE) among them the busiest Beitbridge Border Post which links the neighbouring country with at least seven Sadc countries including Zimbabwe.\n\nThe Authority was established in 2020 (Act No2 of 2020) as a national public entity to create a single authority to effect border law enforcement with a single command and control.\n\nPrior to the latest development there were multiple Government agencies implementing various rules and regulations, reporting to different bosses which resulted in delays in the movement of cargo and travellers.\n\nHowever, the coming in of the BMA has helped address the previously trade and travel deficiencies at port like Beitbridge which handles around seven million travellers yearly and an excess of 1500 commercial trucks daily.\n\nBMA Commissioner and the Chief Executive Officer, Dr Michael Masiapato said in the implementation of about 20 pieces of legislation in the border environment, the Authority has to effectively interface with various government departments and entities.\n\nHe made the remarks in Pretoria during the Colloquium on Migration and Border Security on Tuesday.\n\nDr Masiapato said since its establishment in April 2023, the BMA made significant strides in strengthening border management systems.\n\nBesides the administrative successes relating to the establishment of the new organisation (staff integration, development of organisational policies, setting up governance structures), there are operational successes that are worth mentioning, he said.\n\nWe have been able to successfully run Easter 2023, Dec 23/Jan 24, Easter 2024, Dec 24/Jan 25) and now getting ready to run the 2025 Easter festive period in next few weeks)In addition we ably handled the movement of heads of States and government technocrats from all over the world & high number of Journalists for BRIC Summit in August 2023- and at the moment we are getting ready to run the G20 Summit in November 2025.\n\nDuring the period under review apprehended or arrested over 468 000 individuals who were attempting to enter the country illegally since 1st April 2023 (undocumented, undesirables, or inadmissible).\n\nWe also arrested 2 344 of wanted criminals (of this number 893 linked to other crimes and 1451 linked to the contraventions of immigration related laws).\n\nHe said they had confiscated a lot or prohibited cargo passing through its land, air and sea post and intercepted 332 stolen vehicles hijacked in South Africa while being transported to several countries through different border posts.\n\nDr Masiapato said the colloquium was convened to reflect on the BMAs works in its 24 months of existence (two years) with the intention to generate new proposals on how to improve and escalate our efforts in the mist of constrained fiscus and complicated geopolitical and regional dynamics.\n\nAt the same time, this colloquium, he said, was taking place in a year when South Africa will be hosting the G20 summit towards the end of this calendar year in November 2025.\n\nThis will be the first G20 summit held in the African continent and in South Africa in particular. There will be at the time a lot of travellers who will have to be processed through our ports of entry, he said.\n\nDiscussions on migration and border security that will unfold today will, without doubt, prepare us to deal with the influx of such a high volume of travellers. As we gather here today, we are reminded of the complexities and challenges of managing borders in the 21st century.\n\nThe world is becoming increasingly interconnected, and the movement of people, goods, and services across borders is on the rise. This presents both opportunities and challenges for the BMA and for our stakeholders.\n\nHe said the BMA primarily exists to secure South Africas borders and concurrently facilitate legitimate movement of people and goods in all ports of entry and border law enforcement areas.\n\nHe said he organisation was working in collaboration with Government departments including; Home Affairs, Agriculture, Forestry, Fisheries and the Environment, South African Police Service (SAPS), the South African National Defence Force (SANDF), and the South African Revenue Service (SARS).\n\nContrary to what some people consider to be the functions of the BMA, Dr Masiapato said their function is not just about stamping passports at the ports of entry, but they play a crucial role in facilitating the smooth movement of people, goods, and services across borders while ensuring the safety and security of the country.\n\nSome of the key functions include managing environmental, port health, agriculture, immigration and general border law enforcement related issues, he said.\n\nWe have also screened millions of travellers who destined for South Africa in the last 24 months for infectious and communicable diseases (those we picked up with diseases have been referred to medical facilities for further medical attention) and have also confiscated a lot of undesirable Agricultural products and got them destroyed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/bvncvndtybv.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The creation of Border Management Authority (BMA) has helped streamline operations and boost efficiencies at South Africa’s ports of entry (PoE) among them the busiest Beitbridge Border Post which links the neighbouring country with at least seven Sadc countries including Zimbabwe. The Authority was established in 2020 (Act No2 of 2020) […]",
            "time": "21:46",
            "date": "03 Apr 2025"
        }
    ]
}