{
    "news": [
        {
            "title": "Abandoned pit claims lives of two children left home alone",
            "url": "https://www.chronicle.co.zw/abandoned-pit-claims-lives-of-two-children-left-home-alone/",
            "content": "Online ReporterTwo children, aged 5 and 6, drowned in an abandoned pit while swimming with others after being left at home by their grandmother, who was attending a funeral.In a post on X, the police stated that the incident occurred in Muradzikwa Village, Chipinge.The ZRP confirms a tragic incident in which two boys, aged 5 and 6, drowned in an abandoned pit filled with rainwater while swimming in Muradzikwa Village, Chipinge, on 24/02/25. The victims, along with their 7-year-old sister, had been left at home while their grandmother attended a funeral in the neighbourhood. The three children went to the nearby pit to swim, resulting in the tragic drowning of the two victims, the police posted.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/12/drowning_647_091816122313-647x363-680x380.jpeg",
            "description": "Online Reporter Two children, aged 5 and 6, drowned in an abandoned pit while swimming with others after being left at home by their grandmother, who was attending a funeral. In a post on X, the police stated that the incident occurred in Muradzikwa Village, Chipinge. “The ZRP confirms a tragic incident in which two […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Bulawayo hosts Sports Economy Indaba to drive investment and development",
            "url": "https://www.chronicle.co.zw/bulawayo-hosts-sports-economy-indaba-to-drive-investment-and-development/",
            "content": "Online writerBULAWAYO has taken a major step towards transforming its sports sector into a key economic driver with the launch of the Sports Economy Indaba, held today at the Large City Hall.The high-profile event, attended by key government officials, business leaders, and sporting representatives, aims to position Bulawayo as a hub for sports investment, infrastructure development, and economic growth.Bulawayo Mayor Councillor David Coltart, highlighted the citys rich sporting history and its potential to become a centre for sports tourism and business.This Indaba is more than a celebration of sportit is a strategic initiative to unlock the immense economic potential that sports hold for our city and our nation, he said.The event has drawn participation from national sporting associations, sponsors, clubs, and policymakers to discuss opportunities in sports infrastructure, tourism, and youth empowerment. Panel discussions will explore strategies for leveraging sports as a driver for economic activity, including media, retail, and technology investments.The mayor stressed the need for collaboration between the private sector, government, and the community to create an environment where sports can thrive. Imagine the possibilitiesnew sports facilities, international tournaments, and a thriving ecosystem of sports-related enterprises, he added.With the city already known for producing top athletes across various disciplines, the Indaba seeks to harness this legacy and create sustainable economic opportunities through sport. The event marks a call to action for all stakeholders to work together in positioning Bulawayo as a leading sports and investment destination.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Untitled-68-2.jpg",
            "description": "Online writer BULAWAYO has taken a major step towards transforming its sports sector into a key economic driver with the launch of the Sports Economy Indaba, held today at the Large City Hall. The high-profile event, attended by key government officials, business leaders, and sporting representatives, aims to position Bulawayo as a hub for sports […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Councillor pledges to lead by example after women’s empowerment academy",
            "url": "https://www.chronicle.co.zw/councillor-pledges-to-lead-by-example-after-womens-empowerment-academy/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nMANGWE Rural District Council proportional representation womens empowerment has vowed to be an exemplary leader as she carries out her duties.\n\nHer commitment follows her participation in the Southern Africa Young Womens Empowerment Academy, recently held in Lilongwe, Malawi.\n\nThe academy was organised by the International Institute for Democracy and Electoral Assistance (International IDEA) in collaboration with UN Women, under the framework of the European Union (EU)-funded Women and Youth Democratic Engagement (WYDE) Womens Leadership Initiative. This initiative is implemented in partnership with UN Women, the Inter-Parliamentary Union (IPU), and United Cities and Local Governments (UCLG) under the overall coordination of UN Women.\n\nThe programme brought together 30 participants from Malawi, Tanzania, Namibia, Mozambique, South Africa, Botswana, Eswatini, Zambia, Lesotho, and Zimbabwe, including prominent young leaders.\n\nNotable attendees included Zambias youngest Member of Parliament, Hon. Jean Ngandwe Chisenga, former South West Africa Peoples Organisation (SWAPO) Central Committee Member and National Youth Council of Namibia Board Member Ndahafa Hapulile, South African National Youth Council shortlisted nominee Thembisile Mahuwa, and Zimbabwes Citizens against Economic Sanctions National Secretary for Information and Publicity, Clr Simphiwe Vuyelwa Mguni.\n\nParticipants engaged in training modules covering gender social norms in political leadership, digital technologies and intersectionality, media engagement for womens empowerment, and principles of inclusive democracy. They received certificates after presenting their personal development plans.\n\nClr Mguni expressed gratitude for the opportunity, saying the experience had deepened her understanding of effective leadership as a young woman in politics.\n\nI am extremely grateful for the opportunity to learn and develop myself, my brand, and my vision through such an important platform. I now have a deeper understanding of how to conduct myself as a public servant and be as effective as possible as a young woman in politics.\n\nTo the sponsors, I am grateful. To the facilitators and organisers, I appreciate the hard work you put into the academy. To my fellow participants, I hope this is only the beginning of a journey we will walk together as young women in leadership. May we continue to share ideas, tackle challenges, and be a source of strength for one another, she said.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hjulgu.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com MANGWE Rural District Council proportional representation women’s empowerment has vowed to be an exemplary leader as she carries out her duties. Her commitment follows her participation in the Southern Africa Young Women’s Empowerment Academy, recently held in Lilongwe, Malawi. The academy was organised by the International Institute for Democracy and Electoral Assistance […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Smuggled and substandard goods destroyed in crackdown on illegal trade",
            "url": "https://www.chronicle.co.zw/smuggled-and-substandard-goods-destroyed-in-crackdown-on-illegal-trade/",
            "content": "Herald Correspondent\n\nHuge quantities of counterfeit, substandard and underweight products were destroyed at the Geo Pomona Waste Management site in Harare as part of an ongoing crackdown by the Anti-Smuggling Taskforce.\n\nThe destruction of the goods was aimed at protecting consumers from potentially harmful products.\n\nSpeaking during the event, Consumer Protection Commission (CPC) director Mr Kudakwashe Mudereri said they were concerned about the influx of illegal and counterfeit goods on the informal market.\n\nWe have seen a sudden proliferation of counterfeit and substandard products, expired goods, and underweight products flooding the market, Mr Mudereri said.\n\nThis operation was conducted to safeguard our consumers. Many of these products pose serious health risks.\n\nWe have partnered with Geo Pomona to ensure that all products that do not meet required standards are destroyed so they do not pose a danger to consumers, he said.\n\nHarare Metropolitan Provinces Anti-Smuggling Taskforce coordinator, Mr Tawedzera Muwani assured the public that confiscated goods will not be sold or used.\n\nThis is just the beginning, Mr Muwani said. Smuggled and illegal goods, including those that are substandard, will be destroyed. We do not take them home, and we do not allow them to re-enter the market.\n\nHe acknowledged the collaborative effort among various Government entities in combating smuggling and counterfeit trade.\n\nWe extend our gratitude to all the Government entities we have worked with, including the City of Harare, the Ministry of Industry and Commerce, CPC and ZRP, he said.\n\nBy destroying these goods, we are showing our commitment to eradicating illegal and substandard products from the market.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tgf3w4.jpg",
            "description": "Herald Correspondent Huge quantities of counterfeit, substandard and underweight products were destroyed at the Geo Pomona Waste Management site in Harare as part of an ongoing crackdown by the Anti-Smuggling Taskforce. The destruction of the goods was aimed at protecting consumers from potentially harmful products. Speaking during the event, Consumer Protection Commission (CPC) director Mr […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Dr Nujoma stood firm with Zim during land reform: Prof Murwira",
            "url": "https://www.chronicle.co.zw/dr-nujoma-stood-firm-with-zim-during-land-reform-prof-murwira/",
            "content": "Online ReporterThe late Namibian founding president, Dr Sam Nujoma, strongly supported Zimbabwe during its land reform programme, standing firm against neo-colonial influences and international pressure to isolate the country, a Cabinet Minister has said.In a speech read on his behalf during a memorial service held in honour of Dr Nujoma in Harare on Wednesday, Foreign Affairs and International Trade Minister, Professor Amon Murwira, highlighted Dr Nujomas unwavering solidarity during Zimbabwes period of isolation.Deputy Foreign Affairs Minister Sheillah Chikomo delivered the speech.Minister Murwira said Dr Nujoma defended Zimbabwes right to reclaim land and pushed back against external efforts to derail the programme.Zimbabwe, was always close to his heart, understandably given our shared historical experiences and, in particular, our common struggles, said Prof Murwira.At the height of Zimbabwes isolation following the countrys successful Land Reform Programme, our Father, Dr Nujoma, boldly stood out in support of our programme, with much ideological clarity.While we had achieved our goal of independence, he remained alive to neo-colonial influences and aggression which stood in the way for Africas redemption from servitude.Beyond his vocal support, Prof Murwira said, Dr Nujoma used his diplomatic influence to rally backing for Zimbabwe across SADC, the African Union (AU) and the Non-Aligned Movement (NAM).He said his leadership played a crucial role in shaping the global stance on land redistribution and economic empowerment in post-colonial Africa.Although having left active politics in 2005, he remained an advisor to all of us, he added.On November 24, 2017, the late Dr Nujoma, along with Zambias late founding father, Keneth Kaunda led the cast of former Heads of State and other dignitaries who attended His Excellency President Mnangagwas historic inauguration ceremony.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/08/President-Nujoma.jpg",
            "description": "Online Reporter The late Namibian founding president, Dr Sam Nujoma, strongly supported Zimbabwe during its land reform programme, standing firm against neo-colonial influences and international pressure to isolate the country, a Cabinet Minister has said. In a speech read on his behalf during a memorial service held in honour of Dr Nujoma in Harare on […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Bulawayo serial thief jailed for 15 years after stealing goods worth $1 Million in 7 months",
            "url": "https://www.chronicle.co.zw/bulawayo-serial-thief-jailed-for-15-years-after-stealing-goods-worth-1-million-in-7-months/",
            "content": "By Lesley Chikudo,[emailprotected]\n\nA 24-year-old Bulawayo man, Laga Dube, has been sentenced to 15 years in prison after being convicted of 43 counts of theft, committed between August 2023 and March 2024, involving property worth approximately US$1 million.Dube, of Upper Rangemore, pleaded not guilty, but Western Commonage magistrate Mr Vakai Douglas Chikwekwe found him guilty based on overwhelming evidence.However, Dube will serve only 10 years, as five years of his sentence were suspended on the condition of good behaviour.According to State prosecutor Mr Milton Moyo, Dube targeted 43 vehicles across Bulawayo, using various methods to break in.The thefts involved breaking into 43 separate motor vehicles, where Dube stole mobile phones, laptops, cash, wheels, and other valuables, said Mr Moyo.Dube reportedly used different techniques, including smashing windows and picking locks, to gain access to the vehicles.In the first count, which occurred in August 2023, he stole property worth US$420, with US$400 later recovered.From count two to count 30, the total stolen property value was US$83 590, with less than half recovered.Between count 31 and 43, Dube stole valuables from 13 motor vehicles, with the total value of stolen goods being substantial.The crime spree came to light in March 2024, when one of the victims reported the theft. Further investigations linked Dube to the series of break-ins, leading to his arrest and conviction.With his criminal record spanning 43 cases, Dubes 10-year prison term serves as a warning to would-be offenders.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fxcfx.jpg",
            "description": "By Lesley Chikudo, chikudolesley@gmail.com A 24-year-old Bulawayo man, Laga Dube, has been sentenced to 15 years in prison after being convicted of 43 counts of theft, committed between August 2023 and March 2024, involving property worth approximately US$1 million. Dube, of Upper Rangemore, pleaded not guilty, but Western Commonage magistrate Mr Vakai Douglas Chikwekwe found […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Maser Group CEO Prateek Suri expands luxury portfolio with yacht funding approval of $200 Million",
            "url": "https://www.chronicle.co.zw/maser-group-ceo-prateek-suri-expands-luxury-portfolio-with-yacht-funding-approval-of-200-million/",
            "content": "Guess What MDR board has given approval for?\n\nIn a dazzling display of wealth and ambition, richest Indian in Africa Prateek Suri has announced a groundbreaking investment in luxury yachts, setting a new benchmark in opulence on the high seas. With a vision to redefine maritime luxury, the billionaire is commissioning a fleet of ultra-modern, custom-built superyachts featuring cutting-edge technology, lavish interiors, and world-class amenities. From floating helipads and infinity pools to private submarines and underwater lounges, these yachts promise to be the ultimate status symbols, catering to the global elite. As the billionaire unveils this bold move, the world watches in awe, witnessing yet another chapter in the rise of Africas luxury empire.\n\nWith a flair for the extravagant, the billionaires latest indulgence is a fleet of opulent yachts investments, each more lavish.\n\nLagos-Nigeria MDR Investments, a venture capital firm founded by Prateek Suri, has announced its expansion into the luxury yacht market with the approval of funding for large acquisitions after Mr. Iloh, Mr. Chigozie approved the investment Decision in board meeting.\n\nSuri, also the founder of Maser Group, has made his fortune in the consumer electronics and tech space, with a valuation exceeding $5 billion after being acquired by SCG Asia in 2024. This significant acquisition catapulted Suri to the top of Africas rich list, with a net worth of $1.4 billion.\n\nMDR Investments is targeting large-scale projects in sectors like mining, infrastructure, shipping, and artificial intelligence (AI). The firms focus on frontier technologies has enabled it to secure strategic partnerships and investments that further bolster its influence across Africa and beyond.\n\nSuri, known as the Technology Tiger of Africa, has risen to become the richest Indian person in Africa. His journey from a modest upbringing in Delhi to becoming a billionaire is a testament to his entrepreneurial spirit and strategic vision.\n\nBorn into a middle-class Indian family, Suri had always dreamed big. From an early age, he exhibited an uncanny ability to spot opportunities where others saw obstacles. Armed with determination and an entrepreneurial spirit, he set foot in Africa with little more than a vision and an unbreakable will.\n\nThis exposure not only inspired him but also laid the groundwork for his future ventures in Africa. In 2012, Suri founded Maser Group, focusing on affordable consumer electronics tailored for the African market. His flagship product, a smart television, quickly gained popularity, selling over 800,000 units across the continent.\n\nOver the years, he achieved a benchmark to sell the highest number of gadgets in Africa. The companys success can be attributed to Suris keen understanding of local consumer needs and his ability to navigate complex global supply chains.\n\nUnder his leadership, Maser Group achieved a valuation exceeding $5 billion, positioning itself as a leader in Africas tech landscape. Suris innovative approach has not gone unnoticed; he was recently awarded Investment Leader of the Year at the Gulf Business Awards 2024, recognising his contributions to Africas economic landscape.\n\nMDR Investments foray into the luxury yacht market is part of its broader strategy to invest in high-growth sectors. The firms approval for funding large acquisitions is expected to further expand its portfolio and solidify its position as a major player in the regions investment landscape.\n\nAs he continues to expand Maser Groups footprint and invest in transformative projects across various sectors, Suri is poised to become a pivotal figure in shaping Africas future. His story is not just one of personal success but also reflects a broader narrative of Indian entrepreneurs making significant contributions to Africas growth.\n\nThe continent is witnessing an era marked by innovation, resilience, and economic transformation. As Suri navigates the complexities of global business while remaining rooted in African development, he not only inspires aspiring entrepreneurs but also reinforces the potential for wealth creation through innovation on this vibrant continent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Prateek-Suri-680x380.jpg",
            "description": "Guess What MDR board has given approval for? In a dazzling display of wealth and ambition, richest Indian in Africa Prateek Suri has announced a groundbreaking investment in luxury yachts, setting a new benchmark in opulence on the high seas. With a vision to redefine maritime luxury, the billionaire is commissioning a fleet of ultra-modern, […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Africa’s Billionaires 2025",
            "url": "https://www.chronicle.co.zw/africas-billionaires-2025/",
            "content": "20 Richest people in Africa in 2025\n\nAfricas leading billionaires have built their fortunes through groundbreaking innovation, strategic vision, and unwavering resilience. Spanning industries such as manufacturing, mining, telecommunications, and consumer goods, these trailblazers are reshaping Africas economy while making a global mark.\n\nDiscover the sectors they command, the lifestyles they embody, and the inspiring journeys behind their success.\n\nBeyond their immense wealth, these visionaries are catalysts for transformative change, driving progress and leaving an indelible impact across the continent and beyond.\n\nAliko Dangote\n\nNet Worth: $15.6 billion\n\nSector: Manufacturing (Cement, Sugar, Flour)\n\nAliko Dangote, the richest man in Africa for over a decade, built his wealth through Dangote Group, a conglomerate that dominates the African market in cement, sugar, and flour production. Despite his immense wealth, Dangote maintains a relatively low-profile lifestyle. His journey began with trading commodities, and today, he is spearheading projects like the Dangote Refinery, which will significantly impact Nigerias oil industry\n\nNet Worth: $10.7 billion\n\nSector: Luxury Goods\n\nJohann Rupert, a South African billionaire, heads Compagnie Financire Richemont, known for luxury brands like Cartier and Montblanc. His understated yet luxurious lifestyle reflects his companys high-end clientele. Ruperts journey was rooted in his fathers tobacco business, which he diversified into the global luxury goods empire it is today.\n\nNet Worth: $8.4 billion\n\nSector: Mining (Diamonds)\n\nNicky Oppenheimer, a diamond magnate, made his fortune through the Oppenheimer familys 40% stake in De Beers, the worlds largest diamond producer. His family sold its stake in 2012 for $5.1 billion. Though private, Oppenheimer enjoys philanthropy, particularly in environmental conservation. His journey started in the diamond mines, and he eventually steered De Beers to global prominence.\n\nNet Worth: $8.1 billion\n\nSector: Manufacturing (Cement, Sugar, Real Estate)\n\nAbdulsamad Rabiu is another Nigerian industrialist who made his wealth through BUA Group, a conglomerate in cement, sugar, and real estate. Known for his quiet and modest lifestyle, Rabiu expanded his family business into one of Nigerias largest manufacturing companies. His journey highlights his ability to navigate Nigerias complex business environment.\n\nNet Worth: $7.2 billion\n\nSector: Construction, Chemicals\n\nEgypts Nassef Sawiris, part of the wealthiest family in Egypt, runs Orascom Construction and is heavily invested in global giants like Adidas. His journey in construction has made him one of the worlds most influential investors. Despite his vast fortune, Sawiris prefers to keep a low profile.\n\nNet Worth: $6.1 billion\n\nSector: Telecommunications, Oil\n\nMike Adenuga, Nigerias second-richest man, made his fortune in telecommunications and oil, founding Globacom, Nigerias second-largest telecom company. He also owns Conoil, a major oil exploration firm. Known for his opulent lifestyle, Adenugas journey is marked by his relentless ambition, starting with small ventures and growing into a telecom and oil powerhouse.\n\nNet Worth: $5.1 billion\n\nSector: Food and Beverage\n\nAlgerias Issad Rebrab made his fortune through Cevital, the countrys largest privately-held conglomerate. Cevital operates one of the worlds largest sugar refineries. Known for his down-to-earth lifestyle, Rebrabs journey began in humble beginnings before establishing a food empire that spans across continents.\n\nNet Worth: $3.3 billion\n\nSector: Telecom, Media\n\nNaguib Sawiris, Nassefs brother, has a stronghold in the telecom industry with Orascom Telecom, which was sold to Russias VimpelCom in 2011. A lover of luxury, Naguib is known for his flamboyant lifestyle and sharp business acumen. He now focuses on media and political ventures in Egypt.\n\nNet Worth: $2.9 billion\n\nSector: Mining\n\nSouth Africas Patrice Motsepe, the first Black African billionaire, founded African Rainbow Minerals, which mines gold, platinum, and other precious metals. Known for his philanthropy, Motsepe has pledged half of his wealth to charity. His journey started in the law, before transitioning to mining, where he saw massive success.\n\nNet Worth: $2.5 billion\n\nSector: Media, Technology\n\nKoos Bekker transformed Naspers from a South African newspaper publisher into a global e-commerce and media giant, investing in platforms like Tencent. Bekkers modest lifestyle contrasts with the digital empire hes built. His journey underscores visionary leadership, taking calculated risks in emerging markets.\n\nNet Worth: $2.5 billion\n\nSector: Diversified (Automotive, Retail)\n\nMohamed Mansour oversees the Mansour Group, a family-owned conglomerate with interests in automotive and retail sectors, including the distribution of General Motors vehicles. Mansour is known for his reserved yet philanthropic lifestyle, with investments spanning Africa, Europe, and beyond.\n\nNet Worth: $1.9 billion\n\nSector: Telecommunications\n\nStrive Masiyiwa, a Zimbabwean billionaire, founded Econet, one of the largest telecom companies in Africa. Masiyiwa is a prominent philanthropist and advocate for African entrepreneurship. His journey is marked by resilience, overcoming regulatory challenges in Zimbabwe to create a telecom giant that serves millions across the continent.\n\nNet Worth: $1.5 billion\n\nSector: Manufacturing\n\nTanzanias Mohammed Dewji, CEO of MeTL Group, transformed a small trading business into a $1.5 billion conglomerate. Dewji, Africas youngest billionaire, is known for his active lifestyle and philanthropy. His journey reflects the power of family legacy and strategic investment in manufacturing.\n\nNet Worth: $1.4 billion\n\nSector: Consumer Electronics, Investment, Manufacturing\n\nPrateek Suri, founder of Maser Group and MDR Investments popularly known as technology tiger of Africa, made his fortune in the consumer electronics and tech space after valuation crossing $5bn after acquired by SCG, focusing on frontier technologies and large-cap ventures in Africa mining and infrastructure, shipping and AI and the GCC region. Known for his high-energy lifestyle, Suris journey highlights innovation in manufacturing and technology, with an eye on transforming Africas tech landscape. Suri is Africas youngest billionaire with networth$1.4bn\n\nNet Worth: $1.1 billion\n\nSector: Retail, Consumer Goods\n\nYoussef Mansour, part of Egypts wealthy Mansour family, has built his wealth through Metro, Egypts largest supermarket chain, and other consumer goods ventures. He lives a low-profile lifestyle, focusing on expanding his familys retail empire across Africa and the Middle East.\n\nNet Worth: $1.1 billion\n\nSector: Banking, Insurance\n\nOthman Benjelloun, a Moroccan banking magnate, founded BMCE Bank, one of Africas leading financial institutions. Benjelloun is known for his classic and traditional lifestyle. His journey through finance has positioned him as one of the most influential bankers in North Africa.\n\nNet Worth: $1 billion\n\nSector: Banking\n\nMichiel Le Roux founded Capitec Bank, one of South Africas most successful retail banks, revolutionizing affordable banking for the masses. Le Roux enjoys a relatively simple lifestyle, focusing on the banking sector and making banking accessible for all. His journey reflects his focus on innovation in financial inclusion.\n\nNet Worth: $1 billion\n\nSector: Retail\n\nChristoffel Wiese, South Africas retail giant, made his fortune through Shoprite, the continents largest retailer. Known for his lavish lifestyle, Wieses journey has seen both remarkable successes and setbacks, but his influence on African retail remains unmatched.\n\nNet Worth: $900 million\n\nSector: Manufacturing, Real Estate\n\nYoussef Dewji, part of the influential Dewji family in Tanzania, has seen tremendous success in the manufacturing and real estate sectors, expanding his familys business legacy. His modest lifestyle belies his impressive business acumen.\n\nNet Worth: $900 million\n\nSector: Oil and Gas\n\nAziz Akhannouch, Moroccos oil and gas magnate, is also a politician, serving as the countrys Prime Minister. His family owns Akwa Group, a conglomerate focused on petroleum products. Akhannouch maintains a relatively low public profile, balancing his political and business commitments.\n\nConclusion\n\nAfricas top billionaires are catalysts for economic transformation, steering investments into pivotal sectors and redefining industries that shape the continents future. Their remarkable journeys reflect resilience, innovation, and a unified commitment to building a more prosperous and vibrant Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/featured-1.jpg",
            "description": "20 Richest people in Africa in 2025 Africa’s leading billionaires have built their fortunes through groundbreaking innovation, strategic vision, and unwavering resilience. Spanning industries such as manufacturing, mining, telecommunications, and consumer goods, these trailblazers are reshaping Africa’s economy while making a global mark. Discover the sectors they command, the lifestyles they embody, and the inspiring […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "AXE RAMPAGE! Zimbabwean man kills wife and neighbours, stabs himself in attempt to end his life",
            "url": "https://www.chronicle.co.zw/axe-rampage-zimbabwean-man-kills-wife-and-neighbours-stabs-himself-in-attempt-to-end-his-life/",
            "content": "By Sinokubonga Nkala,[emailprotected]\n\nTHE community of Hurungwe, Mashonaland West, has been left reeling after a 37-year-old man allegedly went on a brutal killing spree, killing his wife, the village head, and a neighbour with an axe and knife.\n\nTrymore Tore, of Mubairacheni Village, Chief Chundu, is accused of killing three people between 15 and 17 February 2025 in a gruesome crime that has shocked the nation.\n\nAccording to reports, Tore first attacked his wife, Moline Chibayanzara, hacking her to death with an axe following a heated domestic dispute. He then dumped her body in a pit latrine in a bid to conceal the crime.\n\nWhen the village head, Kuwesi Masau, attempted to get to the bottom of the matter, Tore allegedly turned on him, killing him with the same weapon before burying his body in a shallow grave (40cm deep).\n\nThe third victim, Anety Nabwalo, was stabbed with a kitchen knife. Her body was later found 60 metres from Tores homestead, hidden under tree branches.\n\nA blood-stained axe and knife, believed to be the murder weapons, were later recovered from the scene.\n\nBefore his arrest, Tore attempted to take his own life, stabbing himself six times, but he survived and was taken into police custody.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) confirmed the incident in a statement on X, saying: he is hospitalised under police guard and has been remanded to 10 March 2025.\n\nAuthorities have also revealed that Tore, who has no family ties in the area, had been threatening villagers before the attack. Now, following his alleged crimes, his own life is at risk due to public outrage.\n\nThe case continues to send shockwaves through the community as residents demand justice for the victims.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/11/axes.jpg",
            "description": "By Sinokubonga Nkala, sinokubongapnkala@gmail.com THE community of Hurungwe, Mashonaland West, has been left reeling after a 37-year-old man allegedly went on a brutal killing spree, killing his wife, the village head, and a neighbour with an axe and knife. Trymore Tore, of Mubairacheni Village, Chief Chundu, is accused of killing three people between 15 and […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        },
        {
            "title": "Zimbabwe engages South African automotive giants for local industry boost",
            "url": "https://www.chronicle.co.zw/zimbabwe-engages-south-african-automotive-giants-for-local-industry-boost/",
            "content": "By Sikhulekelani Moyo,[emailprotected]\n\nTHE Ministry of Industry and Commerce today welcomed a high-profile South African delegation representing the African Association of Automotive Manufacturers (AAAM) and the Motor Industry Association of Zimbabwe (MIAZ) to assess industry needs and explore potential investments in Zimbabwes automotive sector.In a statement on X, the ministry described the visit as a strategic opportunity for Zimbabwes local industry to establish partnerships with Original Equipment Manufacturers (OEMs), who are members of the AAAM.Today, Industry and Commerce Minister Nqobizitha Mangaliso Ndhlovu received a South African delegation representing the AAAM and MIAZ, read the post.As part of the discussions, the parties addressed the need to conduct a needs assessment and explore investment opportunities within the local automotive industry.The visit aligns with the Governments broader vision to promote local production, enhance industrialisation, and drive economic growth.With the local automotive industry seeking expansion and development, partnerships with key international players could pave the way for increased production, job creation, and a stronger manufacturing base in Zimbabwe.More updates to follow.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/juh.jpg",
            "description": "By Sikhulekelani Moyo, mskhulekelani16@gmail.com THE Ministry of Industry and Commerce today welcomed a high-profile South African delegation representing the African Association of Automotive Manufacturers (AAAM) and the Motor Industry Association of Zimbabwe (MIAZ) to assess industry needs and explore potential investments in Zimbabwe’s automotive sector. In a statement on X, the ministry described the visit […]",
            "time": "20:40",
            "date": "26 Feb 2025"
        }
    ]
}