{
    "news": [
        {
            "title": "Zimsec in registration mop-up exercise",
            "url": "https://www.chronicle.co.zw/zimsec-in-registration-mop-up-exercise/",
            "content": "Online Reporter\n\nTHE Zimbabwe Schools Examination Council (Zimsec) has embarked on a registration mop-up exercise for the November Ordinary and Advanced Level 2025 Examinations to cater to candidates who failed to register by the initial deadline.\n\nInitially, the deadline had been set for Friday, but following requests from parliamentarians, Government agreed to grant an extension after consulting key stakeholders.\n\nIn a circular, the examination body revealed that the exercise will run from 31 March to 16 May.\n\nThis circular serves to advise all Heads of examination centres, candidates, parents and stakeholders that the Council has provided a registration mop-up and consolidation facility for the November Ordinary and Advanced Level 2025 Examinations to accommodate candidates who failed to register during the registration period.\n\nThe registration mop-up window will accommodate, inter alia, candidates who failed to meet the deadline for registration for the November 2025 Examinations, candidates who wish to amend their initial registration and candidates who would like to update their Continuous Assessment (CA) declaration details, reads part of the circular.\n\nThe exercise is also catering for centres that erroneously registered private candidates as Formal candidates and would like to regularise their registration and top up examination fees in line with Government policy on eligibility for Examination fees subsidy.\n\nThis facility does not apply to June and Grade Seven 2025 registration. Candidates who missed registration for the June Examinations may register for the November Examinations during this period. Please note that this facility will not be extended beyond the stipulated deadline, reads the circular.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/04/ZIMSEC.jpg",
            "description": "Online Reporter THE Zimbabwe Schools Examination Council (Zimsec) has embarked on a registration mop-up exercise for the November Ordinary and Advanced Level 2025 Examinations to cater to candidates who failed to register by the initial deadline. Initially, the deadline had been set for Friday, but following requests from parliamentarians, Government agreed to grant an extension […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Legislators tour cities and towns on sports mission",
            "url": "https://www.chronicle.co.zw/legislators-tour-cities-and-towns-on-sports-mission/",
            "content": "Zimpapers Sports Hub\n\nTHE Parliamentary Portfolio Committee on Sport has been on a tour of the country meeting stakeholders and getting an appreciation of the situation on the ground.\n\nMember of Parliament for Binga South, Chineka Muchimba said the tour had seen them travel around a number of towns and cities.\n\nWe have been on tour looking at facilities for sports like soccer, netball, cricket, boxing and other disciplines around the country, said Muchimba in Tonga.\n\nHe says his hopes are that Binga can have good facilities and see growth in sport which has the potential to grow tourism and improve his constituencys GDP.\n\nThe legislators on Wednesday toured Khumalo Hockey Stadium and Queens Sports Club, two of Bulawayos standout facilities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/20250326_120520-680x380.jpg",
            "description": "Zimpapers Sports Hub THE Parliamentary Portfolio Committee on Sport has been on a tour of the country meeting stakeholders and getting an appreciation of the situation on the ground. Member of Parliament for Binga South, Chineka Muchimba said the tour had seen them travel around a number of towns and cities. “We have been on […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "VP Chiwenga to headline indaba on research and development",
            "url": "https://www.chronicle.co.zw/vp-chiwenga-to-headline-indaba-on-research-and-development/",
            "content": "Faith Ndlovu\n\nVICE President Chiwenga is expected to headline the inaugural research for sustainable industrialisation and economic development indaba hosted by the Research Council of Zimbabwe.\n\nThe indaba is scheduled to take place during the Zimbabwe International Trade Fair in Bulawayo.\n\nRunning under the theme, Research for Sustainable Industrialisation and Economic Development, the Indaba will unpack the role of research and development in addressing challenges faced by industry in economic development.\n\nParticipants will be drawn from inter alia, diplomats, academic, industry, research institutes, research councils, and civic society.\n\nThe Research Council of Zimbabwe is proud to host the Inaugural Research for Sustainable Industrialisation and Economic Development Indaba during the 65th Zimbabwe International Trade Fair.\n\nThe objective of the Indaba is to promote the utilisation of the research results in informing sustainable industrialisation and economic development in the country.\n\n This event will bring together industry leaders diplomats, policymakers, and innovators to share insights, foster collaboration, and explore strategies for driving sustainable growth. Experience engaging presentations, valuable networking opportunities, and interactive sessions designed to empower participants and inspire transformative change, the Research Council of Zimbabwe said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/VP-Chiwenga.jpg",
            "description": "Faith Ndlovu VICE President Chiwenga is expected to headline the inaugural research for sustainable industrialisation and economic development indaba hosted by the Research Council of Zimbabwe. The indaba is scheduled to take place during the Zimbabwe International Trade Fair in Bulawayo. Running under the theme, “Research for Sustainable Industrialisation and Economic Development”, the Indaba will […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Rapist dad jailed 18 years for violating daughter (14)",
            "url": "https://www.chronicle.co.zw/rapist-dad-jailed-18-years-for-violating-daughter-14/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA 46-year-old man who raped his biological daughter aged 14 years was on Wednesday jailed for an effective 18 years by the Beitbridge Regional Magistrate Court.\n\nThe accused from Toporo area in Beitbridge West cannot be named for fear of exposing the complainant.\n\nHe is accused of having taken advantage of his wifes absence to violate his biological daughter while the mother was attending a local cattle sales auction on March 6 this year.\n\nAlthough he denied the charges of rape, Beitbridge regional magistrate Ms Charity Maphosa convicted him on the strenght of the States evidence in court.\n\nAppearing for the State, Miss Tsitsi Mtukwa said on March 6 at around 1pm the man and his daughter were the only two people around the homestead when the mother went to a local cattle sales auction.\n\nDuring that time, the accused called the complainant to his bedroom and he closed the door as soon as she entered.\n\nThe man then raped his daughter once and afterwhich he ordered her to leave the room.\n\nOn the same day , the complainant alerted her elder sister about the incident who then informed their mother.\n\nThe matter was reported at Shashe police station on the following day who swiftly arrested the accused person.\n\nRecently a prominent cross-border transporter based in Beitbridge was sent to prison for 36 years by the same court for raping and impregnating his biological daughter.\n\nHe also induced abortion after discovering the pregnancy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/gavel-rape.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A 46-year-old man who raped his biological daughter aged 14 years was on Wednesday jailed for an effective 18 years by the Beitbridge Regional Magistrate Court. The accused from Toporo area in Beitbridge West cannot be named for fear of exposing the complainant. He is accused of having taken advantage of […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Mukuruva joins new top club in US",
            "url": "https://www.chronicle.co.zw/mukuruva-joins-new-top-club-in-us/",
            "content": "Online Reporter\n\nFORMER Warriors goalkeeper Tatenda Mkuruva has joined a new club in the US after leaving third-tier club Michigan Stars.\n\nMkuruva has now joined Detroit City, which plays in the US Championship just below the American Major League Soccer.\n\nThe Zimbabwean goalkeeper has signed a two-year contract at his new home.\n\nA statement by City confirmed the transfer, saying: Detroit City Football Club announced the signing of Zimbabwean goalkeeper Tatenda Mkuruva to a two-year deal with 2025 guaranteed and an option in place for the 2026 season. Mkuruva will wear #16 for Le Rouge this season and has been training with the squad since pre-season.\n\nMkuruva has been local to the metro-Detroit area since signing with the Michigan Stars in September 2019 before the inaugural NPSL Members Cup campaign, where he would appear twice against Detroit City FC in his first season with the Stars. From there, Mkuruva became a mainstay at the Michigan Stars, earning and keeping the #1 goalkeeper spot from 2019 to 2024, eventually becoming the club captain.\n\nBefore moving to the US, Mkuruva played for Castle Lager Premiership giants Dynamos, South African top-flight side Cape Town City and Buildcon in Zambia.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-26-at-14.45.34_ea3c2580-680x380.jpg",
            "description": "Online Reporter FORMER Warriors goalkeeper Tatenda Mkuruva has joined a new club in the US after leaving third-tier club Michigan Stars. Mkuruva has now joined Detroit City, which plays in the US Championship just below the American Major League Soccer. The Zimbabwean goalkeeper has signed a two-year contract at his new home. A statement by […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Bulawayo’s CBD suffers 40 percent vacancy rate as businesses flee to suburbs",
            "url": "https://www.chronicle.co.zw/bulawayos-cbd-suffers-40-percent-vacancy-rate-as-businesses-flee-to-suburbs/",
            "content": "Nqobile Bhebhe,Senior Business Writer\n\nREAL estate consultants Knight Frank Zimbabwe says aging and poorly maintained infrastructure has driven vacancy rates in Bulawayo to 40 percent.\n\nThe firm reported that 30 percent of businesses previously located in Bulawayos CBD have relocated to suburban areas such as Suburbs and Khumalo between H2 2020 and H2 2024.\n\nA similar trend has been observed in Harare, where all major banks have either relocated, are planning to move, or are in the process of constructing head offices in northern suburbs such as Highlands, Newlands and Borrowdale.Many tenants are leaving the CBD due to traffic congestion and high rental rates.\n\nIn its latest report, Knight Frank noted that Harares vacancy rate has reached 60 percent.\n\nIt further observed that the quality of tenants occupying the CBD of most urban areas worsened in the period under review due to the informalisation of the market.\n\nThis decline has impacted rental prices across the country, with only a few prime locations and high-quality assets maintaining premium rental values.\n\nVacancy rates in Harare and Bulawayos CBDs have reached 60 percent and 40 percent, respectively. This significant level of vacancy can be attributed to several factors, including aging and poorly maintained infrastructure, a reported 13 percent increase in crime within the CBDs between H2 2023 and H2 2024, and limited and expensive parking options, with average casual parking costs in the CBD reaching US$1.00 per hour compared to free parking in most suburban locations.\n\nThe report also notes that passive voids , vacant spaces with little prospect of being filled are increasingly common in the industrial and office sectors, becoming a structural issue.\n\nAs a result, investors are incurring significant losses due to fixed operating costs, including deferred maintenance, municipal rates and taxes, insurance and security.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/08/Ah.jpg",
            "description": "Nqobile Bhebhe, Senior Business Writer REAL estate consultants Knight Frank Zimbabwe says aging and poorly maintained infrastructure has driven vacancy rates in Bulawayo to 40 percent. The firm reported that 30 percent of businesses previously located in Bulawayo’s CBD have relocated to suburban areas such as Suburbs and Khumalo between H2 2020 and H2 2024. A […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Gwanda prison inmates acquire farming skills to sustain livelihoods",
            "url": "https://www.chronicle.co.zw/gwanda-prison-inmates-acquire-farming-skills-to-sustain-livelihoods/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nGWANDA Prison inmates have been equipped with soil and water conservation farming techniques, which will be essential for their livelihoods after release.\n\nWorking in partnership with the Department of Agricultural Engineering, Mechanisation and Soil Conservation, the prison began implementing soil conservation methods last October, leading to the planting of two hectares of maize.\n\nConservation methods that were implemented include dead-level contours, infiltration pits, tied ridges, mulching, rip lines and live mulch.\n\nAn inmate, Previous Ndlovu said the knowledge that he has acquired will help him to sustain his family\n\nWhen I came here I had basic knowledge on farming but now I have better and improved knowledge. I now know about smart agriculture and soil and conservation techniques. Once I have been released I will utilise the knowledge that I have acquired to start my own farming venture and sustain my family, he said.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-26-at-14.45.27_a4025488-677x380.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw GWANDA Prison inmates have been equipped with soil and water conservation farming techniques, which will be essential for their livelihoods after release. Working in partnership with the Department of Agricultural Engineering, Mechanisation and Soil Conservation, the prison began implementing soil conservation methods last October, leading to the planting of two hectares of maize. […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "PhosAgro showcases Agri-Education & Africa projects to Equatorial Guinea envoy in Moscow",
            "url": "https://www.chronicle.co.zw/phosagro-showcases-agri-education-africa-projects-to-equatorial-guinea-envoy-in-moscow/",
            "content": "Moscow  Luciano Nkogo Ndong Ayekaba, Ambassador Extraordinary and Plenipotentiary of the Republic of Equatorial Guinea, visited the PhosAgro educational centre at the K. I. Skryabin Moscow State Academy of Veterinary Medicine and Biotechnology, where he learned about the Companys projects for training agricultural workers.\n\nPhosAgros specialized educational centre, which opened at Skryabin Academy in 2023, is a complex of multifunctional classrooms equipped with state-of-the-art computers and multimedia tools, educational materials, visual aids, samples of fertilizers and feed additives for livestock, lounges and a library. The centre also houses a phytolaboratory where students can conduct meaningful educational experiments and engage in scientific research. To date, 21 of these centres have been opened at Russian universities as part of a programme to develop agricultural education.\n\nSkryabin Academys Rector, Sergey Pozyabin, gave Ambassador Ndong Ayekaba a tour of an exhibition dedicated to the Academys scientific achievements. In addition, he shared details about how young veterinarians and biotechnologists are being trained to develop animal feed for the livestock industry, a programme that students take part in at the PhosAgro educational centre.\n\nToday, Russian education in general, and especially at the Moscow State Academy of Veterinary Medicine and Biotechnology, is advanced and dynamic, said Rector Pozyabin. We place special emphasis on providing high-quality training for foreign students. The high level of teaching, supportive atmosphere and advanced infrastructure at the Academy attract young people from all over the world. I would like to express my gratitude to our key industrial partner, PhosAgro, which plays an active role in training highly qualified specialists for the agricultural sector. We are grateful to the fertilizer industrys standard bearer for its foresight: by establishing advanced educational centres, they are providing students with the latest knowledge and skills. This is a substantial investment in building strategic human resources capacity for the agricultural sector and, in fact, in the future of our country.\n\nSiroj Loikov, First Deputy CEO of PhosAgro, spoke about the Companys activities in Africa as well as international humanitarian projects that the Company is implementing together with the United Nations Food and Agriculture Organization (FAO), UNESCO and IUPAC to support farmers and young scientists from African countries: PhosAgro is the largest Russian supplier of fertilizers to African countries, accounting for 40% of total exports. In 2024, we increased our shipments of mineral fertilizers to Africa by a third. Our total fertilizer exports to Africa in 2024 exceeded 730 thousand tonnes, a 33% increase from 2023 (548 thousand tonnes). At the same time, it is impossible to create a sustainable economy in Africa without local personnel. Only they can drive the transition to a sustainable development model, and our humanitarian mission is aimed at supporting them.\n\nOne of the Companys key humanitarian projects is Green Chemistry for Life, a joint programme in partnership with UNESCO and IUPAC that awards grant each year to young scientists for research in the fields of sustainable agriculture and environmental protection. Over the programmes eight rounds, 55 researchers from all over the world have received support. More than a quarter of the grants awarded over the years by the programmes international jury have gone to applicants from Egypt, Kenya, Nigeria, South Africa, Sudan, Tunisia and Zimbabwe. Furthermore, over 200 young African scientists have taken part in the PhosAgroIUPAC Summer Schools on Green Chemistry.\n\nIn partnership with the FAO, PhosAgro is training African farmers to use their land more effectively and to protect their soils against degradation.\n\nThrough the Soil Doctors programme, farmers from 20 African countries have received more than 11,000 soil kits: diagnostic toolkits that enable farmers to independently assess the condition of their fields and determine the nutrients that are needed to maximise crop yields.\n\nPhosAgro was also an official partner for the launch of the AFRILAB regional network of soil laboratories. The network currently includes 220 laboratories, across 54 countries, that assess the quality and safety of fertilizersand monitor soil conditions. The Company is also working hard to ensure that farmers have access to information on sustainable farming practices.\n\nA key digital educational project in this area is PhosAgros Pro Agro Lectorium platform. Nearly 60 leading academics and practitioners from around the world, including 9 speakers from African countries, have recorded more than 420 lectures on agricultural science and agrochemistry, crop and livestock farming, innovation and digitalization in agriculture, economics and responsible agriculture.\n\nOver the past year, it has become a true international educational hub for advanced agricultural technologies. Pro Agro Lectorium has been recognized as the official educational platform of the Agribusiness Working Group of the BRICS Business Council and won a BRICS Solutions Award.\n\nAmbassador Ndong Ayekaba thanked the management of PhosAgro and the Skryabin Academy for the opportunity to learn about the latest advancements in the field of veterinary medicine and biotechnology:\n\nIn Equatorial Guinea today, a great deal of attention is being paid to food production, and PhosAgros environmentally friendly mineral fertilizers could become one of the key components of this process. It should be noted that modern agriculture is becoming increasingly high-tech, and the effective use of fertilizers is impossible without the appropriate knowledge. In this context, PhosAgros educational projects at specialized universities, including the Pro Agro Lectorium digital educational programme, are of particular interest. I am convinced that the promotion of knowledge and technologies developed by PhosAgro in the field of advanced agriculture, as well as the implementation of educational programmes for farmers, students and university professors in my country, will help improve agricultural efficiency.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/PhosAgro-.jpg",
            "description": "Moscow – Luciano Nkogo Ndong Ayekaba, Ambassador Extraordinary and Plenipotentiary of the Republic of Equatorial Guinea, visited the PhosAgro educational centre at the K. I. Skryabin Moscow State Academy of Veterinary Medicine and Biotechnology, where he learned about the Company’s projects for training agricultural workers. PhosAgro’s specialized educational centre, which opened at Skryabin Academy in […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "ZRU enlists former skipper Denford Mutamangira",
            "url": "https://www.chronicle.co.zw/zru-enlists-former-skipper-denford-mutamangira/",
            "content": "Brandon Moyo\n\nZIMBABWE Rugby Union (ZRU) has announced that they have bolstered the Sables technical team by enlisting the services of former captain and prop, Denford Mutangamira.\n\nMutangamira is set to bring his scrum expertise to enhance the Sables forward pack and will be working alongside forwards and scrum coach Joel Carew and his assistant, Kevin Nqindi.\n\nThis is all in an effort to create a formidable Sables squad ahead of the 2025 Rugby Africa Cup scheduled for Uganda in July. The tournament serves as the direct qualifier to the 2027 Rugby World Cup in Australia.\n\nThe coaching staff is focused on building cohesion and physicality. With recent successes behind them, the Sables are determined to make a strong impact in the upcoming tournament, read a statement from ZRU.\n\nOther members of the Sables technical team include head coach Pieter Benade, assistant coach Ricky Chirengende, consultant Gert Smal, defense coach Senna Esterhuizen and lineout coach Fortune Chipendu.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-26-at-14.09.09_c5da025e-680x380.jpg",
            "description": "Brandon Moyo ZIMBABWE Rugby Union (ZRU) has announced that they have bolstered the Sables’ technical team by enlisting the services of former captain and prop, Denford Mutangamira. Mutangamira is set to bring his scrum expertise to enhance the Sables’ forward pack and will be working alongside forwards and scrum coach Joel Carew and his assistant, […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        },
        {
            "title": "Matabeleland South students to compete at Creative Arts Championship",
            "url": "https://www.chronicle.co.zw/matabeleland-south-students-to-compete-at-creative-arts-championship/",
            "content": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub\n\nTomorrow, Gwanda town is set to come alive as it hosts the Schools Creative Arts Drive (Scad) High Schools Championship.\n\nStudents will compete in poetry and theatre categories, celebrating World Poetry and Theatre Day. The event will take place at the Gwanda/Tshitaudze Constituency Centre (Hall) and will feature participants from Bulilima, Mangwe, Matobo, Umzingwane, Insiza, Beitbridge, and Gwanda districts in Matabeleland South.\n\nUnder the theme Amplifying Young Peoples Voices Through Creative Arts, the championship provides a platform for young people to showcase their talents and express their views on various social issues.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kk.jpg",
            "description": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub Tomorrow, Gwanda town is set to come alive as it hosts the Schools Creative Arts Drive (Scad) High Schools Championship. Students will compete in poetry and theatre categories, celebrating World Poetry and Theatre Day. The event will take place at the Gwanda/Tshitaudze Constituency Centre (Hall) and will feature […]",
            "time": "21:46",
            "date": "26 Mar 2025"
        }
    ]
}