{
    "news": [
        {
            "title": "Africa must feed, clothe, manufacture itself: President",
            "url": "https://www.chronicle.co.zw/africa-must-feed-clothe-manufacture-itself-president/",
            "content": "Wallace Ruzvidzo in KAMPALA, Uganda\n\nAFRICA must cultivate its own food, produce its own clothing and manufacture its own essential goods, capitalising on its plentiful natural resources and rich heritage, SADC Chairman, President Mnangagwa has said.\n\nThe President made these observations yesterday during a Presidential Dialogue at the 11th Africa Regional Forum on Sustainable Development.\n\nTowards achieving sustainable development, President Mnangagwa asserted that the African continent must take ownership of its development and future, stating that Africas transformation will not occur by chance.\n\nLet us, remain steadfast in advancing the implementation of both the 2030 Sustainable Development Agenda and Agenda 2063. That responsibility lies with us, the leaders and people of this great Continent.As Africa, we must take charge of our development and our destiny. Let us, therefore, re-commit ourselves to the guiding objectives of inclusive development, strengthening human capacities and eradicating poverty, in all its forms. These must remain at the centre of our shared aspirations for a prosperous and peaceful Africa, he said.\n\nPresident Mnangagwa in Uganda\n\nGoing forward, President Mnangagwa said Africa must jointly explore emerging technologies, as the continent stood a better chance of sustained development by maintaining a united front rather than as individuals.\n\nThese should include harnessing Artificial Intelligence and the Internet of Things to drive productivity, build globally competitive economies, and to boost intra-Africa Trade, said the President.\n\nOn its part, he said, SADC remained committed to the attainment of regional, continental and global goals.\n\nIn the context of the implementation of the 2030 Agenda for Sustainable Development and Agenda 2063: The Africa We Want, the collective experiences of our countries are invaluable in nurturing evidence-based leadership, as we reflect, learn and co-create solutions towards a better tomorrow. In Southern Africa, our resolve in this regard, is firmly grounded in the SADC Treaty.\n\nPrimarily our objective is to promote sustainable and equitable socio-economic development as well as the eradication of poverty through regional integration. The SADC Vision 2050 places inclusive development at the heart of the regions long-term aspirations.\n\nWe, thus, continue to strengthen institutions, broaden partnerships and entrench governance models that are responsive to current challenges and emerging opportunities, said the SADC Chair.\n\nThe regions abundant natural resources, he added, offered a unique comparative advantage that must be fully leveraged to create decent jobs, sustainable enterprises and economic development through sustainable value chains, especially in commodity sectors.\n\nIn this regard, through the SADC Industrialisation Strategy and Roadmap, the region has identified priority value chains in agriculture and mining. Focus is on scaling up industrialisation, diversifying industrial sectors, infrastructure development, tourism, and ICTs among others, to ultimately stimulate intra-regional trade, said President Mnangagwa.\n\nPresident Mnangagwa\n\nHe said youth employability and skills development remained top regional priorities.\n\nRiding on the demographic dividend, SADC Member States are undertaking various education sector reforms to make education institutions, Centres of Excellence for innovation, entrepreneurship and skills. The goal is to ensure that our young people are equipped with the appropriate knowledge and skills for jobs of the future.\n\nAdditionally, we are scaling up investments in Technical, Vocational Education and Training, with a renewed emphasis on practical and digital skills to help young people and women to benefit from the ongoing technological and green transitions.\n\nSolutions and new products related to agri-tech, fin-tech, digital health and climate technologies, among others, have the potential to propel modernisation and industrialisation of the continent, he said.\n\nIn the case of Zimbabwe, President Mnangagwa said the Second Republic was leveraging on the energy, creativity and innovativeness of the youth and has thus, established Innovation Hubs which are helping to spur inclusive development.\n\nIn 2024, my Government passed the Science Technology and Innovation Start-Up Bill creating a legal framework for tax incentives, infrastructure access and public procurement reforms that favour youth led enterprises, he said.\n\nThe President said key to Zimbabwes development success milestones towards the realisation of SDGs and Agenda 2063, was Governments adoption of the Whole-of-Government Monitoring and Evaluation System.\n\nThis allows the real-time tracking and performance of national programmes across sectors, enabling data- driven and people-centred governance, improved transparency, accountability and more agile institutional responses.\n\nPresident Mnangagwa in Uganda\n\nAt regional level, efforts by SADC Member States are also reinforced by the regions commitment to peace, security and good governance. We recognise that political stability, the rule of law and peace, within our borders, regionally and globally, are foundational to inclusive development and job creation, he said.\n\nSADC is implementing adaptation and mitigation strategies, which include climate-smart agriculture, practices and the promotion of traditional crops. To accomplish this, the SADC Chair said the establishment of irrigation infrastructure was being scaled up.\n\nIn the case of Zimbabwe, the provision of inputs to small holder farmers that are specific to the respective climatic regions, along with the drilling of boreholes and establishment of nutritional gardens are having positive impacts in incomes as well as food and nutrition security, at the household level.\n\nThis transformational model is in-turn accelerating rural industrialisation, as well as the adoption of relevant technologies which are backed by our strong traditional knowledge systems, all resulting in job creation at the community level, leaving no one and no place behind, said President Mnangagwa.\n\nHe said the SADC Regional Indicative Strategic Development Plan 2020-2030 and the SADC Industrialisation Strategy and Roadmap 2015-2063 were the main frameworks adopted to actualise Agenda 2063 and will go a long way in achieving SDGs.\n\nThis includes, in particular, Goal Number 8, on decent work and economic growth.Employment creation and empowerment have been deemed central objectives in national development plans while the mainstreaming of these key cogs, across macroeconomic and sectoral policies, is also a priority.\n\nIn other words, we are of the view that our fiscal and monetary policies should simultaneously promote economic stability and job creation, said the President.\n\nAs climate change remains one of the greatest threats to developmental aspirations, President Mnangagwa said addressing its risks requires global solidarity, synergy, partnerships and investments.Calls for increased climate financing and technology transfer to Africa and the global south towards strengthening resilience and adaptation should remain pronounced. In our pursuit of inclusive growth, renewable energy has emerged as a vital enabler.\n\nThrough the adoption of an energy mix that best suits our realities, our Continent must see more of our communities, particularly those in rural areas, having increased access to affordable and clean energy, said the President.\n\nEnergy transition therefore, presented immense possibilities for green jobs for Africas youth and women, he said.\n\nThe need for infrastructure financing, while being cautious of the risk of debt burden requires us to embrace innovative financing models to leapfrog sustainable development and economic growth.\n\nRegional collaboration in financing large-scale infrastructure projects is essential to drive connectivity and economic integration for shared modernisation, industrialisation and prosperity, he said.Speaking to journalists upon arrival at the Robert Mugabe International Airport yesterday President Mnangagwa said SADC and the East Africa Community (EAC) came together in Uganda to map a way forward towards sustainable development.\n\nSo, in the meeting we held with the President of Uganda, we were able to discuss all these issues. Yes, other heads of state were represented by their foreign ministers, but we were happy that it was a robust debate. And we were happy that both SADC and the East Africa Community were all represented in terms of respective countries from those two regions.\n\nPresident Mnangagwa in Uganda\n\nAnd we resolved to pursue our goals as the two regions. Fortunately, from SADC, the chairman, and from the eastern region, the chairman was there. So, the two chairpersons were present. President Museveni is our elder, so whenever we meet him we pay attention and learn from him. We were able to discuss issues facing our two regions. We are happy of the cooperation that is exiting between the two countries, said the President.\n\nDuring deliberations in Uganda, President Yoweri Museveni said Africa had the solutions to ensure sustained development.\n\nDeputy Secretary-General of the United Nations, Ms Amina Mohammed, said Africa must confront the hard truths and ensure bold solutions are cultivated for the continents continued development.The Forum brought together Heads of State, former Presidents, Prime Ministers and Ministers, among other delegates.\n\nPresident Mnangagwa, who returned home yesterday, was accompanied by Foreign Affairs and International Trade Minister Professor Amon Murwira, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube and Presidential Spokesperson Mr George Charamba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-22.50.42-680x380.jpeg",
            "description": "Wallace Ruzvidzo in KAMPALA, Uganda AFRICA must cultivate its own food, produce its own clothing and manufacture its own essential goods, capitalising on its plentiful natural resources and rich heritage, SADC Chairman, President Mnangagwa has said. The President made these observations yesterday during a Presidential Dialogue at the 11th Africa Regional Forum on Sustainable Development. […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "Ekusileni, Nust enter research pact. . .‘Late Father Zimbabwe’s dream comes true’",
            "url": "https://www.chronicle.co.zw/ekusileni-nust-enter-research-pact-late-father-zimbabwes-dream-comes-true/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nA specialist maternity and paediatric unit will be established at Ekusileni Hospital here in Bulawayo under a transformative partnership with the National University of Science and Technology (NUST), a move anticipated to bridge the gap in terms of access to quality healthcare.\n\nThe 200-bed facility will no longer remain idle, as the first consignment of specialised equipment is expected in the country within the next two months, paving the way for its full-time operationalisation before the years end.\n\nThe newly established maternity facility will offer specialist services in gynaecology, neonatology, and paediatrics, among others. It will also be developed into a quinary hospital for the purpose of teaching medical students and conducting research.\n\nEkusileni Hospital\n\nQuinary hospitals, as envisioned within the framework of Education 5.0, are designed to foster innovation and create a modern environment conducive to clinical research.\n\nThis development should assist Zimbabwe in reducing its reliance on outbound health services, which currently limits accessibility for many patients in need of improved health outcomes. A brainchild of the late nationalist and Father Zimbabwe, Joshua Nkomo, Ekusileni was constructed in 2001 before it was briefly operational for seven months in 2004.\n\nYesterday, the Minister of Higher and Tertiary Education, Innovation, Science and Technology Development, Ambassador Frederick Shava, toured Ekusileni Hospital accompanied by the NUST Vice Chancellor Professor Mqhele Dlodlo, university management, and lecturers, and affirmed the Governments commitment to the establishment of a specialist facility at the hospital within the shortest possible time.\n\nMINISTER F SHAVA TOUR\n\nThe bold decision to establish a quinary hospital here at Ekusileni Hospital is an extremely important initiative, he said. The structure that houses Ekusileni Hospital is a magnificent and beautiful structure that has not been utilised for years as a result of various issues along the way since it was constructed.\n\nBut now that NUST has requested to use it as a teaching hospital the Government appreciates that and fully supports the initiative.\n\nThe establishment of a quinary hospital at Ekusileni Hospital will give an opportunity for NUST to do post-doctorate training and Government is happy that the university wants to specialise in areas of the health sector that are lacking in the country, said Dr Shava.\n\nHe said the move also presents a perfect opportunity for the country to venture into medical tourism and generate much needed foreign currency.\n\nWe want the facility to be fully operational by the end of the year and the Vice Chancellor (Professor Dlodlo) was telling me earlier that some of the equipment will be delivered very soon.The arrival of the technical equipment from China will signal the beginning of good things at NUST, said Dr Shava.\n\nIn his remarks, Prof Dlodlo said the university was excited about the grand opening of the hospital this year.\n\nTurning Ekusileni Hospital into a fully-fledged quinary hospital is a major boost to the NUST medical school and we look forward to the grand opening of the facility at the end of this year. The hospital will start operational in 2026 and the fact that people are seeing a lot of activity of movement of stuff in and out of Ekusileni is proof that we are moving in the right direction and its a sign of the excitement of good things to come.\n\nMINISTER F SHAVA TOUR\n\nWe thank the Government and our own ministry for making it possible for NUST to acquire the first phase of the equipment that will be used at the hospital. The equipment will be acquired in batches until all the 200 beds are ready to be used. The supplier has promised to deliver the first batch of equipment in two months. The equipment is for obstetrics, gynaecology, pre and post-natal paediatrics, said Prof Dlodlo.\n\nNUST Dean of Faculty of Medicine, Professor Elopy Sibanda, said the establishment of a maternal health facility at Ekusileni Hospital will bridge the gap of a shortage of such facilities in Bulawayo and Matabeleland region.\n\nWe expect this to address the burdens within the community, where many patients are forced to deliver in floor beds due to inadequate capacity. Our equipment is expected to arrive soon and we aim to commence operations by June.\n\nOne of the significant services we plan to introduce is open-heart surgery, primarily for children, a procedure that is not available in the country. This is crucial for underprivileged children who struggle to access such services. We hope to launch this service by September of this year, said Prof Sibanda.\n\nEkusileni in its current state houses essential components including a pharmacy, administration offices, a boardroom, a kitchen, a physiotherapy unit, a pathology laboratory and a paediatrics department.In total, the hospital comprises four wards, two intensive care units (ICUs) with eight beds combined, a laundry room, six operating theatres and an X-ray laboratory  all designed to enhance patient care and support medical excellence.\n\nThe initiative to establish a quinary hospital will involve transforming the facility into a state-of-the-art specialist teaching and research hospital, thereby revolutionising the countrys healthcare system.The hospital was renovated to handle Covid-19 critical patients a few years ago and Government was already planning beyond the pandemic due to shortcomings in the countrys health sector, characterised by lack of specialists doctors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-23.02.27.jpeg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw A specialist maternity and paediatric unit will be established at Ekusileni Hospital here in Bulawayo under a transformative partnership with the National University of Science and Technology (NUST), a move anticipated to bridge the gap in terms of access to quality healthcare. The 200-bed facility will no longer remain idle, as the […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "SMEs urged to register intellectual property rights",
            "url": "https://www.chronicle.co.zw/smes-urged-to-register-intellectual-property-rights/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nEXPERTS have called upon small and medium enterprises (SMEs), who are increasingly demonstrating innovation that drives economic growth, to register their intellectual property rights (IPR) to safeguard their designs and trademarks. This crucial step will prevent the loss of their creations to other individuals or companies.\n\nThe importance of IPR registration was highlighted at the Confederation of Zimbabwe Industries (CZI) intellectual property rights (IPR) for manufacturing entrepreneurs and SMEs launch, held in Bulawayo on Tuesday.\n\nThe event was facilitated by Intellectual Property Lawyer Mrs Brenda Matanga, who explained the significance of having registered IPR and guided SMEs on the registration process.\n\nMrs Matanga noted that small businesses have often overlooked IPR, mistakenly believing it is relevant only to large corporations.\n\nThere is a perception among small businesses that intellectual property is not important and not relevant to their operations. However, todays attendees have gained the understanding that intellectual property rights are crucial for business competitiveness, Mrs Matanga stated.\n\nIf small businesses aspire to scale up and gain market credibility, they must ensure their IPR are protected, encompassing trademarks, patents, industrial designs, and copyrights.\n\nMrs Matanga emphasised that SMEs are showcasing innovations that should not be underestimated.During her presentation, Mrs Matanga offered practical advice to SMEs, urging them to refrain from exhibiting their innovations without prior IPR protection.\n\nShe pointed out that some large exhibition events attract individuals specifically seeking to pilfer ideas from others.\n\nFurthermore, she advised SMEs to avoid divulging excessive information, such as critical recipes, which could be exploited by others to produce similar products, potentially driving the original creators out of business.\n\nSMEs often possess innovative ideas but lack sufficient funding, making them vulnerable to larger companies that can adopt, refine, and dominate their small market share, she said.\n\nTherefore, it is imperative for SMEs to protect their IPR, ensuring that any unauthorised replication will necessitate compensation.\n\nSMEs have become vital contributors to numerous economies, generating innovative solutions that address local challenges. The sector also makes substantial contributions to the economy through job creation and the provision of diverse goods and services.\n\nBulawayo Chamber of SMEs chairperson Mr Coustin Ngwenya commended CZI for organising the event, recognising it as an eye-opener for SMEs. He estimated that nearly 90 percent of SMEs lack registered IPR for their products.\n\nThis workshop has broadened our understanding. SMEs often find themselves at a disadvantage in this area, with larger institutions tending to benefit, he said.\n\nMr Ngwenya cited an example of an SME in Victoria Falls involved in sculpture production, whose unique designs were registered under the IPR of a UK-based client. Consequently, the client ceased direct purchases from the SME, and the SME struggled to find alternative markets due to the IPR ownership issue.\n\nBulawayo Leather Cluster chairperson Mr Fungai Zvinondiramba highlighted that SMEs often lack the financial resources to commercialise their ideas, inadvertently benefiting others. He stressed that registering their intellectual property would enable them to benefit financially if others utilise their innovations.\n\nIPR is often perceived as the most expensive aspect of business. You encounter SMEs claiming to be broke, yet they possess unregistered IPR that lacks valuation, while others can readily recognise its potential, Mr Zvinondiramba said.\n\nBulawayo Leather Cluster chairperson Mr Fungai Zvinondiramba\n\nUnderstanding IPR can significantly mitigate the risk of financial distress for SMEs, as they recognise the inherent financial value of their generated ideas.\n\nThe lack of intellectual property rights protection has exposed businesses in the SADC region and the African continent to various challenges, including the appropriation of product ownership by manufacturers from other nations.\n\nConsequently, the region has experienced a loss of competitive advantage, jobs, revenue, brand damage, disincentives for innovation, reduced research and development, and stifled creativity.\n\nProtecting IPR is particularly crucial as the continent implements the African Continental Free Trade Area (AfCFTA) agreement, which aims to eliminate tariffs on 90 percent of goods traded between member states over a 10-year period.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-21.03.53-8.jpeg",
            "description": "Sikhulekelani Moyo, sikhu.moyo@chronicle.co.zw EXPERTS have called upon small and medium enterprises (SMEs), who are increasingly demonstrating innovation that drives economic growth, to register their intellectual property rights (IPR) to safeguard their designs and trademarks. This crucial step will prevent the loss of their creations to other individuals or companies. The importance of IPR registration was […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "Boost for Matabeleland as investor courts Vice President Mohadi",
            "url": "https://www.chronicle.co.zw/boost-for-matabeleland-as-investor-courts-vice-president-mohadi/",
            "content": "Robin Muchetu\n\nVICE President Kembo Mohadi yesterday met with a delegation of investors in Bulawayo to discuss potential investment opportunities within the Matabeleland region.\n\nDuring their discussions, he affirmed the Governments commitment to improving the ease of doing business and assured them that he would consider the proposals put forward, which are projected to bring significant development to the area.\n\nThe investor delegation from MAEC 87 International is eager to unlock further opportunities through a loan and a grant, which will see the three provinces of Matabeleland  Bulawayo, Matabeleland North, and Matabeleland South  directly benefiting, with the rest of the country also reaping the spin-offs from the venture once it receives approval. Emerging from the closed-door meeting with the investors, VP Mohadi, whilst not going into extensive detail, provided a brief overview of their private discussions.We had an engagement with investors that are actually interested in funding the development corridor, the Trans Limpopo Corridor from Beitbridge up to Victoria Falls hence we had the three Ministers of State for Matabeleland South, Bulawayo Metropolitan and Matabeleland North.\n\nWe deliberated on that. They (investors) have a fund that they think they can advance to us. But there are certain technicalities that we have discovered of how we would have wanted it done, said VP Mohadi.\n\nVICE President Kembo Mohadi\n\nAs the Second Republic focuses on transforming the economy towards Vision 2030, the Trans-Limpopo Spatial Development Corridor, a development initiative aimed at unlocking economic potential between Zimbabwe and South Africa, is a key area of interest. It also seeks to ensure that the two countries engage in discussions and collaborate to improve peoples livelihoods in a positive manner. VP Mohadi highlighted that the investment opportunities will further be analysed before a decision to bring them on board is made. So, we have adjourned and we have said to the Reserve Bank Governor and the funders themselves, the people advancing the loan, go and sit down and come and give us a position tomorrow (today) as to which is the legal or the right way to do this, he said.\n\nThe investors pitched their proposals including funding modalities before the Vice President, Ministers of State for the three provinces where development will take place, the Reserve Bank of Zimbabwe representative and other key representatives to this initiative.\n\nThe investment is set to see the provinces tapping into various developmental projects available that suit their areas. There are job creation opportunities that will be unveiled once investment outcomes are made public, which feeds directly into ensuring no one and no place is left behind. The proposed investor is not new to development initiatives in the country as the Government approved a US$110 million Public Private Partnership investment with them for the construction and upgrading of the 120-kilometre Old Gwanda Road.\n\nThey highlighted in an earlier interview that there are vast investment opportunities within the corridor including, agriculture, industries, mining, tourism and many more.\n\nThe project was initially estimated to cost US$110 million, but it was recently revealed that the figure may be closer to US$150 million, with US$40 million assigned to enhance the roads elements and cultural storytelling.\n\nSome architectural designs, which show how the Old Gwanda Road have been availed, aim at promoting the diverse tourism offerings of Matabeleland South, with prominent tourism facilities and cultural sites integrated into the design.  @NyembeziMu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Vice-President-Kembo-Mohadi.jpg",
            "description": "Robin Muchetu VICE President Kembo Mohadi yesterday met with a delegation of investors in Bulawayo to discuss potential investment opportunities within the Matabeleland region. During their discussions, he affirmed the Government’s commitment to improving the ease of doing business and assured them that he would consider the proposals put forward, which are projected to bring […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "Raj Modi rescues Sizinda with 22 000 litres of water",
            "url": "https://www.chronicle.co.zw/raj-modi-rescues-sizinda-with-22-000-litres-of-water/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nBULAWAYO South Member of Parliament and Minister of Industry and Commerce, Raj Modi, yesterday delivered a much-needed water supply of 22 000 litres to the residents of Sizinda suburb, bringing considerable relief to those who had endured three weeks without any water.\n\nThe water was distributed at three designated points throughout the suburb. Despite the brief interruption of rain showers, residents gathered with their containers to collect the precious supply, expressing profound gratitude to the MP for his timely and crucial intervention.\n\nMrs Egness Sibindi, a local resident, recounted the considerable hardships the community had faced over the preceding three weeks, highlighting the particular difficulties experienced by elderly residents and families with young children.\n\nWe only have one borehole here, and its always overcrowded, with people jostling for water. Its particularly difficult for the elderly. We are grateful to Honourable Modi for his kindness, she said.Another resident, Mrs Sifiso Mwale, said the delivery came at an ideal time, especially with schools closing.\n\nChildren will be home more often now, which means more water will be needed. This bowser came at the right moment. Were so thankful to Honourable Modi, who continues to support uswhether its election season or not, she said.\n\nSizinda residents fetch water from a bowser provided by legislator Raj Modi yesterday\n\nMrs Mthokozisi Tshabalala also expressed her gratitude, describing the past three weeks without water as terrible.\n\nFor 11-year-old Nicky Mhlophe, who cares for her sick grandmother, the water delivery was a huge relief.I usually fetch water from Oceans Factory, carrying a 20-litre bucket every day. Its tough because my grandmother is unwell and cant make the trip. Now, I can rest a bit and spend time with my friends. I heard the water came from Honourable Modi, our MP, said Nicky, a Grade Four pupil.\n\nBulawayo has been struggling with water shortages since last year, caused by low dam levels and outdated pumping equipment. The city is reportedly losing nearly 50% of its water supply due to non-revenue water (NRW)water that is pumped but lost through leaks, theft, or unbilled consumption.\n\nAt the inaugural Bulawayo Economic Development Conference held at a local hotel yesterday, Bulawayo mayor Councillor David Coltart expressed concern about the citys inability to provide water to both residents and industries, despite recent improvements in dam levels.\n\nHe stressed the need for reform in the management of the citys water systems.\n\nWe cannot continue with outdated practices from 30 to 40 years ago. We commend the Government for approving the construction of Glassblock Dam, said Cllr Coltart.\n\nMeanwhile, public consultations held in six city wards on the proposal for a standalone water utility company saw mixed reactions. Four wards16, 17, 19, and 24rejected the proposal, while Wards 25 and 26 supported it.\n\nBCC spokesperson Ms Bongiwe Ndlovu stated that the consultation process was ongoing, and the final outcomes would be shared once completed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-13.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw BULAWAYO South Member of Parliament and Minister of Industry and Commerce, Raj Modi, yesterday delivered a much-needed water supply of 22 000 litres to the residents of Sizinda suburb, bringing considerable relief to those who had endured three weeks without any water. The water was distributed at three designated points throughout the […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "Fenny Dembo on life without her father . . .‘His music has been my comfort’",
            "url": "https://www.chronicle.co.zw/fenny-dembo-on-life-without-her-father-his-music-has-been-my-comfort/",
            "content": "Trust Khosa, Zimpapers Arts and Entertainment Hub\n\nThe death of Leonard Dembo, the iconic figure whose soulful melodies captivated the hearts of millions, left an irreplaceable void in the Zimbabwean music 29 years ago.\n\nApril 9 marks not only the day he tragically passed away in 1996, but also a time of reflection for his family and the legions of fans who continue to honour his legacy.\n\nThis year is especially poignant, as Dembo would have turned 65. Fenistia Fenny Dembo, his daughter and family spokesperson, expressed the bittersweet emotions tied to the anniversary. Having lost her father at the tender age of five, Fenny carries on his musical legacy through heartfelt renditions of his hit songs.\n\nIt hasnt been easy. Losing a parent, especially one as beloved and influential as my father, leaves a deep gap, Fenny shared.\n\nFenny Dembo at her fathers graveside\n\nBut over the years, his music has been a source of comfort and strength to me. Through his music, he has remained a constant presence in my life, even though hes no longer here with us physically.Though the memories of her father have blurred with time, Fenny cherishes the lessons passed down through the stories of her mother and family.\n\nThrough my mother, I learnt that my father always wanted us to stay united, humble and to work hard in whatever path we chose, she recalled, adding that her father was a man of integrity and passion.Thats why, after every achievement, I make it a point to visit his gravesite in Chirumhanzu and tell him all about it.\n\nThe past 29 years have created a fog of distant memories for Fenny, but through old family videos and photos, the warmth of her fathers laughter and the soothing sound of his music fill the void.\n\nHe had such a calm, grounded way of looking at life, and spending time with him, even in quiet moments, brought a joy thats hard to put into words, she said, reminiscing on the time Dembo spent singing around the house, his music always flowing, even in the simplest of moments.\n\nAs an artiste in her own right, Fenny reassured fans that her fathers legacy is in safe hands.\n\nWeve worked to protect his music catalogue and ensure its available to future generations. My brothers and I have continued in his footsteps, supporting tributes, performances and documentaries in his honour. His legacy lives on, not just through his music, but through the values he instilled in us.\n\nFennys heartfelt thanks were extended to the fans who have remained loyal to her fathers music over the years.\n\nThe late Leonard Dembo\n\nTendai Dembo, Leonards son and leader of Barura Express, shared the familys plans.\n\nWere going to do something as a family, but not a big event. We dont want to spoil his name, Tendai said, sharing their desire to keep the memory of his father pure and untarnished.\n\nFor Tendai, whose catalogue includes iconic albums like Kukura Kwedu, Nhamo Moto, and Ruva Rashe, the focus remains on honouring Leonards values and music.\n\nThe Dembo family, however, still faces struggles beyond the stage. Eunice Dembo, Leonards widow, is among the widows of departed musicians, who have not been receiving royalties from recording companies or collecting boards.\n\nWhile Dembos physical presence may no longer be with us, his memory remains firmly entrenched in Zimbabwes music history. With each year, his influence grows stronger as his songs continue to be sung, loved and passed down to future generations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-22.17.08-680x380.jpeg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub The death of Leonard Dembo, the iconic figure whose soulful melodies captivated the hearts of millions, left an irreplaceable void in the Zimbabwean music 29 years ago. April 9 marks not only the day he tragically passed away in 1996, but also a time of reflection for his […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "COMMENT: Zimbabwe agriculture needs forward thinking",
            "url": "https://www.chronicle.co.zw/comment-zimbabwe-agriculture-needs-forward-thinking/",
            "content": "ZIMBABWES agrarian sector has long faced many challenges that include drought and illegal sanctions. But some areas, such as the tobacco farms in Marula, Mangwe District show great success. Their good harvests strongly suggest that new ideas and methods can really change farming for the better in the country.\n\nFor years, the narrative surrounding Zimbabwean agriculture has been dominated by discussions of fluctuating commodity prices, and the ever-present threat of unpredictable weather patterns. While these factors undeniably play a significant role, the achievements witnessed in Marula suggest that a crucial element has often been understated: the necessity and impact of innovative farming practices.\n\nThe success of these tobacco farmers is not simply down to luck or favourable conditions alone. It is a result of embracing new techniques, adopting modern technologies, and a willingness to move beyond traditional methods.\n\nWhether its through the implementation of efficient irrigation systems, the strategic use of fertilisers and pest control, or the adoption of advanced curing processes, these farmers have demonstrated that a forward-thinking approach can unlock significant productivity gains.\n\nTheir prosperity serves as a stark contrast to areas where reliance on outdated methods persists, often leading to lower yields and greater vulnerability to environmental stresses.\n\nThe green fields of Marula speak volumes about the dividends that innovation can yield.\n\nThis success story should not be viewed in isolation. It offers a blueprint for the broader agricultural sector in Zimbabwe.\n\nThe Government, alongside agricultural support organisations, must actively promote and facilitate the adoption of innovative practices across the country. This includes investing in research and development, providing access to training and resources and fostering an environment that encourages experimentation and the sharing of best practices.\n\nFurthermore, the resilience demonstrated by the Marula farmers underscores the importance of adaptability. Innovation is not a static concept; it requires a continuous willingness to learn, adapt and embrace new solutions as challenges arise.The golden leaf harvested in Marula is a sign of what can be achieved when ingenuity takes root.Their success is a reminder that while the challenges facing farming in the country are real, they are not insurmountable. By embracing innovation, by fostering a culture of continuous improvement and by learning from the example of communities like Marula, Zimbabwe can cultivate a more prosperous and sustainable future for its farming sector.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-16.jpg",
            "description": "ZIMBABWE’S agrarian sector has long faced many challenges that include drought and illegal sanctions. But some areas, such as the tobacco farms in Marula, Mangwe District show great success. Their good harvests strongly suggest that new ideas and methods can really change farming for the better in the country. For years, the narrative surrounding Zimbabwean […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "Struggling Kaindu returns to Barbourfields Stadium",
            "url": "https://www.chronicle.co.zw/struggling-kaindu-returns-to-barbourfields-stadium/",
            "content": "Mugove Chigada, Zimpapers Sports Hub\n\nONCE, he stood undefeated in 23 matches. Now, Kelvin Kaindu returns to Barbourfields Stadium here in Bulawayo searching for a spark  and perhaps, a shot at redemption.\n\nFive games into his second spell at Highlanders, the statistics paint a sobering picture: just one victory, six points, five goals conceded. Its a far cry from 2012 and 2024, when his Bosso side roared to 11 points and 13 points in the first five games.\n\nOn Sunday, against old adversaries CAPS United, Kaindu isnt merely chasing a win  hes chasing the echoes of his own legacy. On one hand, his record in his first five games back in charge of Bosso has been tarnished and he seeks to recover lost ground.\n\nOn the other, Kaindu is also acutely aware that there are certain standards expected in the Highlanders-CAPS United classic encounters that must be maintained.\n\nKelvin Kaindu\n\nThe game between the two teams has always been great and sometimes full of drama. Both teams may not have started well, but players always rise to the occasion. Its a match to look forward to, said CAPS United great, David Maketo.\n\nThe six points collected by Highlanders in the first five games have not been good enough for Bosso. For the record, Highlanders are five points poorer than they were in Kaindus first season in charge and four points behind their tally at this stage in 2013.\n\nKaindu had set the bar high. In 2012, his charges had scored a massive 12 goals in five games  an average of 2,4 goals per match. They dismissed Blue Rangers 40, beat FC Platinum 31, floored Hardbody 53, and drew 11 with Dynamos and Buffaloes.\n\nTo his credit, Kaindus Highlanders this season have been slightly better defensively than his debut five games in 2012, having conceded five goals compared to six back then. In that debut year, Bosso went on a 23-match unbeaten run and only lost the title to Dynamos on goal difference.\n\nBut as Kaindu tries to recover from a poor start, hell be aware that his current record of six points from five games puts him far off his own benchmark  even if 11 points would have only earned him second place this season behind log leaders Ngezi Platinum on 13.\n\nThats how tough the competition has become.\n\nWith eight goals in five matches, Highlanders have shown attacking promise, but they may need to learn to hold on to their leads.\n\nMaketo says the 2002 match that Highlanders won 1 0 at Barbourfields is a typical example of how Bosso used to overcome the drama surrounding this fixture and still emerge victorious.\n\nBoth Maketo and the late Adam Ndlovu were sent off on that day  May 19, match day 10.\n\nI remember the throw-in was taken, directed at Adam, I then had my leg between his legs. He turned and retaliated. We were both given red cards. Back then I felt the referee was unfair on me, but now I think he did well to control the game. This fixture has always been that big. Adam had already scored the goal, and I think CAPS suffered more because the team had lost a defender early, said Maketo.\n\nLloyd Chitembwe\n\nThis week, CAPS United president Farai Jere, challenged his charges to raise their game after their own poor start to the season. Title-winning , Lloyd Chitembwe, has taken full responsibility and will be seeking to change the script.\n\nCan Kaindu recover lost ground  or make it worse?P W D L F A PTS2012 HIGHLANDERS 5 3 2 0 12 6 112013 HIGHLANDERS 5 3 1 1 7 3 102025 HIGHLANDERS 5 1 3 1 8 5 6\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-22.28.00-1.jpeg",
            "description": "Mugove Chigada, Zimpapers Sports Hub ONCE, he stood undefeated in 23 matches. Now, Kelvin Kaindu returns to Barbourfields Stadium here in Bulawayo searching for a spark — and perhaps, a shot at redemption. Five games into his second spell at Highlanders, the statistics paint a sobering picture: just one victory, six points, five goals conceded. […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "Moyo gets shot at redemption",
            "url": "https://www.chronicle.co.zw/moyo-gets-shot-at-redemption/",
            "content": "Innocent Kurira, Zimpapers Sports Hub\n\nAFTER seven years out of the cage, Zimbabwean MMA fighter Elvis Moyo finally gets his shot at redemption  and the title  tonight at EFC 122 in South Africa, where he faces Antony Morel in a long-awaited return to the Extreme Fighting Championship stage.\n\nBoth fighters successfully weighed in yesterday, with Moyo tipping the scales at 118kg compared to Morels 115kg.\n\nTonights clash follows the disappointment of Moyos bare-knuckle bout against Matunga Djikisa being cancelled last October. Now, with months of frustration behind him, Moyo is eager to let his fists do the talking.\n\nI have had a long break from the cage, and this opportunity to fight for the title means everything to me. Theres been a lot of talk, but its time for action. I have put in the work, and my mind is in the right place. Im focused on one thing  to win this fight and take home the EFC title. I know I have the support of my fans back home in Zimbabwe, and I am doing this for them as well.\n\nFighting someone like Antony Morel is a challenge, but its the kind of challenge I thrive on. I know Ive got the skills, the strength, and the endurance to come out on top. I have been in tough battles before and I have always come out stronger. This fight is no different. I am ready for whatever he brings to the table.\n\nIm grateful for the chance to return to the EFC cage after such a long time away. This fight is a big step in my career, and I dont take it lightly. Ive trained hard, Im mentally prepared and Im ready to give it everything Ive got, Moyo said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-21.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub AFTER seven years out of the cage, Zimbabwean MMA fighter Elvis Moyo finally gets his shot at redemption — and the title — tonight at EFC 122 in South Africa, where he faces Antony Morel in a long-awaited return to the Extreme Fighting Championship stage. Both fighters successfully weighed in […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        },
        {
            "title": "Empower Bank granted Prescribed Asset status to boost youth loans",
            "url": "https://www.chronicle.co.zw/empower-bank-granted-prescribed-asset-status-to-boost-youth-loans/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nFINANCE, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has announced the granting of Prescribed Asset status to Empower Bank, a move designed to mobilise resources and facilitate loan disbursements to young entrepreneurs.\n\nPrescribed assets are a percentage of pension fund assets (and potentially those of other institutional investors) that are legally mandated to be allocated to specific Government-approved instruments.President Mnangagwa launched the Youth Empower Bank as part of the Governments initiative to empower young people through a financial institution tailored to their unique needs.\n\nPresident Mnangagwa\n\nSpeaking in parliament recently, Professor Ncube stated that this development will play a crucial role in expanding the resources available to Empower Bank, which are also accessible to other investors. He further noted that the Ministry of Youth Empowerment, Development and Vocational Training was allocated ZWG1 billion for 2025, with ZWG200 million specifically designated for vocational training operations.\n\nThis allocation also aims to facilitate the processing of loans through Empower Bank.\n\nRegarding Empower Bank, I can confirm that yesterday I granted them prescribed asset status. This means that going forward, they should find it easier to partner with other investors, pension funds, and others who will receive benefits under the prescribed assets provisions by collaborating with Empower Bank, he explained.\n\nHe said that this status will enable Empower Bank to access more resources, which will be shared with other investors, and potentially contribute to its recapitalisation.\n\nEmpower Bank provides loans for youth-led business and agricultural projects, asset finance, guarantees, and savings accounts, serving urban, peri-urban, and rural areas across Zimbabwe. It also aims to empower marginalised communities and support the growth of small businesses to create employment opportunities.\n\nAdditionally, Professor Ncube announced that the Zimbabwe Womens Microfinance Bank has also been granted Prescribed Asset status. This decision stems from the recognition that women constitute 52 percent of the population and are known to contribute significantly to the economy, despite earning only 10 percent of the countrys income.\n\nIn 2023, Government-funded programmes disbursed nearly US$187 million and ZWG8,5 billion during the first half of the year. Legally, pension funds and insurance firms are required to allocate at least 20 percent of their investment portfolio to prescribed assets.\n\nThe Insurance and Pensions Commission (IPEC), the regulatory body, has previously granted prescribed asset status to companies such as African Century (US$15 million for onward lending), Pure Oil (US$5 million for soya bean and crude oil imports), and Centra West (US$42, 5 million for power generation).Furthermore, the Zimbabwe Electricity Industry Pension Fund received prescribed asset status worth US$6,5 million for the construction of the Marondera Shopping Mall, and Datvest received US$7,5 million for residential stand development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/mthuli.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com FINANCE, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has announced the granting of Prescribed Asset status to Empower Bank, a move designed to mobilise resources and facilitate loan disbursements to young entrepreneurs. Prescribed assets are a percentage of pension fund assets (and potentially those of other institutional investors) that […]",
            "time": "06:42",
            "date": "10 Apr 2025"
        }
    ]
}