{
    "news": [
        {
            "title": "CCA president commends public and urges churches to champion peace after failed protests",
            "url": "https://www.chronicle.co.zw/cca-president-commends-public-and-urges-churches-to-champion-peace-after-failed-protests/",
            "content": "Gibson Mhaka,Zimpapers Politics Hub\n\nPresident of the Council of Churches in Africa (CCA), Archbishop Professor Rocky Moyo has called for peace and urged church leaders across denominations to preach a message of peace that underscores the importance of dialogue and patience in addressing national concerns.\n\nHis remarks came in the wake of the failed protest of March 31 called by expelled Zanu-PF Central Committee member, Blessed Geza.Archbishop Moyo also commended the general public for heeding President Mnangagwas calls to disregard the planned protests emphasising that as churches, they do not condone protests, which often result in the unfortunate loss of life and destruction of property.\n\nThe demonstration called for by the former Zanu PF Central Committee member, was a monumental flop, as Zimbabweans chose to uphold the prevailing peace and tranquility in the country.\n\nOn that day, peace prevailed nationwide, with no significant demonstrations recorded and business proceeding as usual.\n\nSpeaking on the side-lines of the ordination of pastors and bishops at Upper Room Shekinah Ministries International in Bulawayo on Saturday,\n\nArchbishop Moyo stated that churches must not support the mass protests planned against the Government.\n\nHe added that those agitating for the removal of a constitutionally elected Government should know that they are wasting their time, as leaders are appointed by God.\n\nProtests are an act of desperation. They are not a solution to problems, rather, they can tragically lead to the loss of property and, more importantly, lives. As the Council of Churches in Africa, we earnestly call upon all churches to actively promote peace by consistently ignoring calls for disruptive protests.\n\nOur steadfast commitment to peaceful engagement as churches will serve as a powerful and unifying example for all our communities. We strongly encourage all Zimbabweans to unite, setting aside division, for the collective benefit and progress of our beloved country.\n\nWe also commend the general public for their wisdom and discernment in disregarding the recent calls for protests. Their mature decision to prioritise peace, stability, and constructive dialogue is deeply appreciated and reflects a profound commitment to the enduring well-being and prosperity of our entire nation, said Archbishop Moyo.\n\nHe stated that instead of calling for protests, there should be a need for dialogue, as dialogue can help resolve issues peacefully.\n\nInstead of resorting to protests, I firmly believe there should be a prioritisation of dialogue. Engaging in meaningful and constructive discussions offers a pathway to resolve issues peacefully, fostering understanding and building lasting solutions for the betterment of our society, he said.\n\nHe emphasised that it is the responsibility of Zimbabweans to develop their own nation and support the current Government.\n\nIt is evident that the organisers of these protests do not genuinely have the well-being of the people at heart.Their agenda appears to be to incite citizens into acts of violence and public disorder, fully knowing that this would inevitably trigger a standard and necessary response from security agencies tasked with protecting law-abiding citizens and safeguarding property.Such actions demonstrate a reckless disregard for the safety and security of our communities.\n\nTurning to the ordaining of bishops, Archbishop Moyo stated that this was a commendable move, particularly given the numerous church splits they had seen in past years, often caused by the contentious issue of leadership succession after the founders death.\n\nThis is a commendable move, especially considering that in past years, weve witnessed numerous splits within churches. A significant cause of these divisions is often the succession of leadership following the death of the founder.\n\nThe transition period can become contentious, with potential successors resorting to legal battles for positions, falsely claiming divine guidance through the Holy Spirit, or even misinterpreting the Bible to undermine the rightful successor.\n\nTherefore, we are particularly pleased that those ordained have been clearly designated to take over, a proactive measure that significantly mitigates the potential for future succession disputes and ensures a more stable and unified leadership within the ministry, said Archbishop Moyo.\n\nMeanwhile, President Mnangagwa has also repeatedly acknowledged the church as a key component of nation-building, calling on the people to value the word of God in fostering unity for economic development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Bishop-Rocky-Moyo.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub President of the Council of Churches in Africa (CCA), Archbishop Professor Rocky Moyo has called for peace and urged church leaders across denominations to preach a message of peace that underscores the importance of dialogue and patience in addressing national concerns. His remarks came in the wake of the failed protest […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "Official lighting of Independence torch this Thursday",
            "url": "https://www.chronicle.co.zw/official-lighting-of-independence-torch-this-thursday/",
            "content": "Richard Muponde,Zimpapers Politics Hub\n\nTHE official lighting of the Independence Torch will take place at the Museum of Human Sciences in Harare this Wednesday, the Ministry of Home Affairs and Cultural Heritage has announced.\n\nThe torch will be taken for a stopover ceremony in Kwekwe where it will officially be presented to Midlands Provincial Leadership at Mutapa Hall on Thursday.\n\nVice President Gen (Rtd) Dr Constantino Chiwenga will preside over event.\n\nOn April 17, the official lighting of the torch will take place at Sikombela Detention Camp before being relayed back to Mutora in Nembudziya by torch bearers to the main venue led by the Ministry of Sports, Arts and Culture.\n\nVice President Col (Rtd) Kembo Mohadi will lead the proceedings\n\nThe Zimbabwe Independence Flame is an enduring symbol of the countrys struggle for freedom and its commitment to building a better future for all its citizens. As the flame continues to burn brightly, it serves as a reminder of the sacrifices by those who fought for our Independence and as a beacon of hope for generations to come.\n\n-@nuponderichard\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ind-logo.jpg",
            "description": "Richard Muponde, Zimpapers Politics Hub THE official lighting of the Independence Torch will take place at the Museum of Human Sciences in Harare this Wednesday, the Ministry of Home Affairs and Cultural Heritage has announced. The torch will be taken for a stopover ceremony in Kwekwe where it will officially be presented to Midlands Provincial Leadership […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "Emerging stars join Holy Ten for “Zvaiwana Nwarati” album launch",
            "url": "https://www.chronicle.co.zw/emerging-stars-join-holy-ten-for-zvaiwana-nwarati-album-launch/",
            "content": "Trust Khosa, Zimpapers Arts and Entertainment Hub\n\nHoly Tens album launch, scheduled for Independence Day at the 7 Arts Theatre in Avondale, Harare, is set to feature a star-studded lineup of emerging artistes who are taking the local music scene by storm.\n\nBling4\n\nTitled Zvaiwana Ngwarati, the event promises to highlight the vibrant talent of the Young Turks in a collaboration between Samanyanga Records and Dee Nosh Harare.\n\nFeli Nandi\n\nThe impressive line-up includes Feli Nandi, Bling 4, Bagga, Kae Chaps, Terry Afrika, Runna Rulez, Scrip Mulla, Probeats, and Kayflow.\n\nKae Chaps\n\nA representative from Samanyanga Records confirmed that the launch is expected to draw large crowds. The launch will proceed as planned, and its the perfect way to celebrate our Independence Day.\n\nWe are thrilled that preparations are well underway and encourage fans to come in large numbers for this double celebration  honoring both the Independence Day holiday and Holy Tens milestone.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Holy-Ten.jpg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub Holy Ten’s album launch, scheduled for Independence Day at the 7 Arts Theatre in Avondale, Harare, is set to feature a star-studded lineup of emerging artistes who are taking the local music scene by storm.   Titled “Zvaiwana Ngwarati”, the event promises to highlight the vibrant talent of […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "Zimbabwe’s Christine Ngoshi gears up for Miss Elite Global pageant in India",
            "url": "https://www.chronicle.co.zw/zimbabwes-christine-ngoshi-gears-up-for-miss-elite-global-pageant-in-india/",
            "content": "Trust Khosa, Zimpapers Arts and Entertainment Hub\n\nChristine Ngoshi, the reigning Miss Elite Global Zimbabwe, is preparing to travel to India next month where she will compete at the Miss Elite Global pageant.\n\nThe 22-year-old beauty queen will compete against other representatives from around the world at the event, scheduled to take place from May 4 to 12 in Goa City.\n\nIn a recent interview with Zimpapers Arts and Entertainment Hub, Ngoshi shared her excitement and confidence about the upcoming competition.\n\nIm currently busy with rehearsals in preparation for Miss Elite Global 2025 in India. With the support of my manager, Simbarashe Gwavava, Im confident about making a lasting impression, she said.\n\nNgoshi expressed gratitude for her dedicated team, adding, We are working together, and Im determined to make Zimbabwe proud on this international stage.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/1vf.jpg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub Christine Ngoshi, the reigning Miss Elite Global Zimbabwe, is preparing to travel to India next month where she will compete at the Miss Elite Global pageant. The 22-year-old beauty queen will compete against other representatives from around the world at the event, scheduled to take place from May […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "ICT Ministry SOE’s sign performance contacts",
            "url": "https://www.chronicle.co.zw/ict-ministry-soes-sign-performance-contacts/",
            "content": "Mthabisi Tshuma, Online Reporter\n\nSTATE owned enterprises (SOEs) under the Ministry of Information Technology Communication, Postal and Courier Services have signed performance contracts.\n\nThe move is to reiterate Governments commitment to efficiency, accountability and transparency, which is necessary to attain Vision 2030.\n\nThe SOEs are Potraz, Zimpost and Zarnet. The companies were represented by their board chairpersons and senior executives.\n\nRecently, Ministers signed their performance contracts and for the first time, deputy ministers, commissioners and deputy chief secretaries also signed performance contracts, thereby expanding the accountability framework introduced in 2021.\n\nFollow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/kollo.jpg",
            "description": "Mthabisi Tshuma, Online Reporter STATE owned enterprises (SOE’s) under the Ministry of Information Technology Communication, Postal and Courier Services have signed performance contracts. The move is to reiterate Government’s commitment to efficiency, accountability and transparency, which is necessary to attain Vision 2030. The SOE’s are Potraz, Zimpost and Zarnet. The companies were represented by their […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "Sacked clubs appeal",
            "url": "https://www.chronicle.co.zw/sacked-clubs-appeal/",
            "content": "Lovemore Dube\n\nGOLDEN Lions and Zimbabwe Saints who were fired from the Zifa Southern Region League at the organisations annual general meeting on Saturday have appealed against the decision to exclude them from this years championship.\n\nThe two clubs were yet to pay their annual registration and affiliation fees amounting to US$2 500.Saints who are now under Tawanda Ruzive who replaced Lloyd Munhanga who is also the Zifa Southern Region chairman, owed US$500 from previous seasons.\n\nWe will plead our case with Zifa (national executive) to allow us to play again. We have just come in and we were putting things in place to ensure we are of sound footing financially, said Ruzive.\n\nHe said they had since sent their appeal to Zifa in Harare.Khima Sibanda, the youthful director of Victoria Falls based Golden Lions, said it was sad that they were expelled from the league before they had been admitted at the annual general meeting which was held at Blue Hills on Saturday.\n\nWe had the money with us at the meeting. They decided to expel us because we had not yet paid their fees. You are admitted first to the league and then you pay requisite dues, said Sibanda.\n\nHe said they have since appealed against the decision to bar them from playing in the Zifa Southern Region.On Saturday, league spokesperson Blessing Mbwanda confirmed that clubs had resolved that Saints and Golden Lions be excluded on the strength of failing to pay fees and that their players had not been registered with Zifa through FifaConnect an online register.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-14.39.26.jpeg",
            "description": "Lovemore Dube GOLDEN Lions and Zimbabwe Saints who were fired from the Zifa Southern Region League at the organisation’s annual general meeting on Saturday have appealed against the decision to exclude them from this year’s championship. The two clubs were yet to pay their annual registration and affiliation fees amounting to US$2 500. Saints who […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "Kindman Ndlovu appointed interim Bosso CEO",
            "url": "https://www.chronicle.co.zw/kindman-ndlovu-appointed-interim-bosso-ceo/",
            "content": "Fungai Muderere, Zimpapers Sports Hub\n\nBULAWAYO football giants, Highlanders, have appointed Kindman Ndlovu as their interim chief executive officer.\n\nThe clubs former chief executive officer Brian Moyo resigned from his position amid allegations of fraud and corruption related to a player transfer deal.\n\nMoyo was reportedly in the eye of a storm at the Bulawayo giants after revelations he fraudulently made US$5,000 from the purchase of two players.\n\nMore to Follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Kindman-Ndlovu.jpg",
            "description": "Fungai Muderere, Zimpapers Sports Hub BULAWAYO football giants, Highlanders, have appointed Kindman Ndlovu as their interim chief executive officer. The club’s former chief executive officer Brian Moyo resigned from his position amid allegations of fraud and corruption related to a player transfer deal. Moyo was reportedly in the eye of a storm at the Bulawayo […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "“Ranganai henyu, asi zvichakona”. . . Dorcas Moyo receives new car, $20 000 from Chivayo after being bullied",
            "url": "https://www.chronicle.co.zw/ranganai-henyu-asi-zvichakona-dorcas-moyo-receives-new-car-20-000-from-chivayo-after-being-bullied/",
            "content": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub\n\nMutare-based gospel artiste Dorcas Moyo has expressed both shock and immense happiness after being presented with a new car and a generous monetary donation of US$20 000 from businessman and socialite Wicknell Chivayo.\n\nChivayo, who has been on a mission of supporting hardworking artistes over the years, announced on April 7, 2025, that he would be gifting Moyo a 2025 Toyota Fortuner and US$20 000, which she is set to collect on April 9.\n\nChivayo said this gesture was meant to help heal Moyos soul after she faced intense bullying on social media on March 31 for posting a line Ranganai henyu asi zvichakona (loosely translated to say what you want, but things will work out in the end) from her song she released some years ago.\n\nThis was misinterpreted by some, who politicized the statement, resulting in insults being hurled at the artiste.\n\nOn his social media platforms, on April 7, Chivayo expressed his dismay over the treatment Moyo received.He wrote: Ranganai Henyu, Asi Zvichakona.\n\nWhat was supposed to be a very beautiful song, boldening our faith in God and affirming that whatever the devil plots will not succeed, was unnecessarily turned political.\n\nIt spiralled into hateful speech and cyberbullying at an unprecedented magnitude against an innocent, award-winning gospel singer and God-fearing woman.\n\nThe lack of political tolerance among Zimbabweans is alarming. We must firstly be politically mature to accept that Zanu PF is and will always be the ruling party, adored by many because of its pro-democracy, pro-people, and development-oriented agenda.\n\nChivayo continued stressing that the online attacks on Moyo were unjust.I was deeply hurt by the online insults against Dorcas Moyo for simply posting her chart-topping gospel song, released more than five Years ago!\n\nThe good thing about God is that in the face of humiliation and public persecution, he shows that he is God and will raise you from the ashes of ridicule to the tables of royalty!\n\nIn recognition of your exceptional talent and contributions in the gospel music industry, I want to say a big congratulations to Dorcas Moyo. Please go and see Victor on Wednesday, your brand new 2025 Toyota Fortuner 2.4 GD6 will be ready for collection and fully paid for at Exquisite Car Dealership.\n\n . . . he will also give you a small 20 thousand dollars in cash for petrol and to spoil yourself at the salon, my dear sister. You deserve it after all this stress and hate speech.\n\nI also want to thank those who persecuted and ridiculed you, as their hate has made you great.Reacting to the generous donation, Moyo told Zimpapers Arts and Entertainment Hub that, I am speechless.\n\nFollow on X  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Dorcas-Moyo.jpg",
            "description": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub Mutare-based gospel artiste Dorcas Moyo has expressed both shock and immense happiness after being presented with a new car and a generous monetary donation of US$20 000 from businessman and socialite Wicknell Chivayo. Chivayo, who has been on a mission of supporting hardworking artistes over the years, announced […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "WATCH: “Imiklomela kaDakamela key in fostering unity” – Albert Nyathi",
            "url": "https://www.chronicle.co.zw/watch-imiklomela-kadakamela-key-in-fostering-unity-albert-nyathi/",
            "content": "Langalakhe Mabena recently in Nkayi, Zimpapers Arts and Entertainment Hub\n\nRenowned traditionalist and praise poet Albert Nyathi has described the Imiklomela kaDakamela Awards as a vital platform for promoting unity among Zimbabweans and others from across the region who share historical and cultural ties with the Ndebele people.\n\nThe cultural gathering, held on 4 and 5 April at koDakamela Hall in Nkayi, Matabeleland North, brought together thousands of people in celebration of heritage, tradition, and community leadership.\n\nNyathi called for replicating such events across the country, stressing their importance in preserving Zimbabwes rich cultural legacy and passing it on to future generations.\n\nThese awards are a powerful initiative as they unite people from all walks of life, a clear sign that we are one. I saw Amatshitshi (virgins) and young boys being taught how to carry themselves with pride and dignity. They are the future of the nation, said Nyathi.\n\nGuests came from as far as Zambia, representing Paramount Chief Mpezeni, as well as from Tanzania, and South Africas KwaZulu-Natal and Mpumalanga provinces. They joined us in celebrating and preserving our culture.\n\nI strongly encourage more of these gatherings, not only here at koDakamela, but across Zimbabwe. Such events are essential for nurturing and sustaining our heritage.\n\nAmong the individuals and organisations honoured for their outstanding contributions were Professor Solwayo Ngwenya, Queen Sowa, Virgie Ncube (Virgie Foundation), Madlela Sikhobokhobo, Mngane Ncube (Hawk Flight), Zenzo Nyathi, Mzoe 7, and Nkululeko Innocent Dube, director of Iyasa and Khulumani FM.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/A-Nyathi.jpg",
            "description": "Langalakhe Mabena recently in Nkayi, Zimpapers Arts and Entertainment Hub Renowned traditionalist and praise poet Albert Nyathi has described the Imiklomela kaDakamela Awards as a vital platform for promoting unity among Zimbabweans and others from across the region who share historical and cultural ties with the Ndebele people.   The cultural gathering, held on 4 […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        },
        {
            "title": "Imiklomela kaDakamela recognises Mzoe 7’s impact on youth and arts",
            "url": "https://www.chronicle.co.zw/imiklomela-kadakamela-recognises-mzoe-7s-impact-on-youth-and-arts/",
            "content": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub\n\nAmapiano sensation Mzoe 7 has added another milestone to his illustrious career by becoming the first Yanos star to receive an award at the Imiklomela kaDakamela.\n\nAt the cultural extravaganza, held on Friday and Saturday at koDakamela Hall in the heart of Nkayi, Mzoe 7 received a certificate. He was honored for being a highly regarded stage performer and artiste in recognition of his exceptional talent and contribution to the arts, inspiring many through his music and stage presence.\n\nSpeaking after receiving the award, Mzoe 7 expressed deep gratitude and said the recognition has further fueled his passion to uplift young people across the country.I feel truly honored to be recognised at awards of this magnitude, alongside other great individuals from all walks of life, he said.\n\nIve never performed at koDakamela before, so this means a lot to me. Being the first Amapiano artiste to receive this award is humbling. I believe that with my talent and commitment to social responsibility, I can continue to inspire others to reach even greater heights.His recognition has been widely celebrated by fellow creatives, who view his success as a win for the broader arts industry and a sign of growing appreciation for contemporary genres like Amapiano.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/za.jpg",
            "description": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub Amapiano sensation Mzoe 7 has added another milestone to his illustrious career by becoming the first Yanos star to receive an award at the Imiklomela kaDakamela. At the cultural extravaganza, held on Friday and Saturday at koDakamela Hall in the heart of Nkayi, Mzoe 7 received a certificate. […]",
            "time": "18:43",
            "date": "07 Apr 2025"
        }
    ]
}