{
    "news": [
        {
            "title": "Scotland FC Bulawayo supporters chapter gives back to community",
            "url": "https://www.chronicle.co.zw/scotland-fc-bulawayo-supporters-chapter-gives-back-to-community/",
            "content": "Innocent[emailprotected]\n\nTHE Scottland FC Bulawayo Supporters Chapter has made a kind-hearted donation of foodstuffs to Emthunzi WeLanga Childrens Home.Additionally, the chapter has provided sanitary wear to young girls in Mizilikazi, which was sourced by national supporters chapter chairperson Edith Majama and handed over at the suburbs Youth Center.Thabani Mthizozo Gumbo, Chairman of the Bulawayo Scotland Chapter, highlighted the importance of giving back to the community. As Scotland FC supporters, we believe that charitable donations are a vital part of our social corporate responsibility. We take pride in making a positive impact on the lives of those around us. Our goal is not only to support our team but also to uplift our community.Gumbo encouraged other clubs to follow their lead, promoting unity and kindness through similar charitable activities.Takudzwa Murebwa, Organising Secretary of the Bulawayo Chapter, expressed optimism about the teams prospects for the upcoming year.2025 is shaping up to be an incredible year for Scotland FC. Were hopeful that our team will excel on the pitch, and were committed to supporting them every step of the way. With unity and determination, were confident that we can achieve great things together. We would like to pay gratitude to our club president Scott Sakupwanya, said Muremba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/t6hy6u6.jpg",
            "description": "Innocent Kurira-innocent.kurira@chronicle.co.zw THE Scottland FC Bulawayo Supporters Chapter has made a kind-hearted donation of foodstuffs to Emthunzi WeLanga Children’s Home. Additionally, the chapter has provided sanitary wear to young girls in Mizilikazi, which was sourced by national supporters chapter chairperson Edith Majama and handed over at the suburb’s Youth Center. Thabani “Mthizozo” Gumbo, Chairman of […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Day 3 Test: Afghanistan dominates Zimbabwe",
            "url": "https://www.chronicle.co.zw/day-3-test-afghanistan-dominates-zimbabwe/",
            "content": "Stumps on day three at Queens Sports ClubAfghanistan 425/2 (125 overs)Trail by 161 runsRahmat Shah 231 (416)Hashmatullah Shahidi 141 (276)\n\nAfghanistans total at stumps is now their second-highest in Test cricket. The highest is 545/4 (declared) which was against Zimbabwe in 2021.The 361-run partnership between Rahmat Shah and the captain, Hashmatullah Shahidi is now the highest for Afghanistan for any wicket.Shah now holds the record for the highest individual score for Afghanistan in Tests, surpassing Shahidis 200 not out which he made against Zimbabwe in 2021.They are the only to batters to have scored a double century for Afghanistan in red-ball cricket.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghfghg.jpg",
            "description": "Stumps on day three at Queens Sports Club Afghanistan 425/2 (125 overs) Trail by 161 runs Rahmat Shah 231 (416) Hashmatullah Shahidi 141 (276) Afghanistan’s total at stumps is now their second-highest in Test cricket. The highest is 545/4 (declared) which was against Zimbabwe in 2021. The 361-run partnership between Rahmat Shah and the captain, […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Maqhawe Masuku’s Mhla Zinhlanu kuLwezi: A Novel Igniting the Fight Against Drug Abuse",
            "url": "https://www.chronicle.co.zw/maqhawe-masukus-mhla-zinhlanu-kulwezi-a-novel-igniting-the-fight-against-drug-abuse/",
            "content": "Blessing Karubwa -Showbiz Reporter\n\nIn a dazzling display of culture, Maqhawe Masuku from Sibantubanye village has unveiled his powerful new novel, Mhla Zinhlanu kuLwezi, tackling the urgent crisis of drug abuse. This electrifying launch promises to captivate hearts and minds!\n\nThe launch event, held in August at the Filabusi Centre District Hall, drew a substantial crowd, marking a significant step in the fight against the rampant drug crisis in Zimbabwe.\n\nSpeaking exclusively to Chronicle Showbiz, Masuku expressed his elation over the successful turnout, stating, It was heartwarming to see so many people come together under the theme Kasiphumeni kuzidakamizwaLets desist from drugs and substance abuse. This shows that our community is ready to engage in this crucial conversation.\n\nThe 202-page novel not only aligns with the governments zero-tolerance approach to drug abuse but also aims to resonate with readers on a personal level.\n\nMasuku, who serves as a Poultry and Piggery Supervisor at Gwanda State University, has ambitious plans to translate the novel into other languages, including Venda, Nambya, and Shona.\n\nThese languages are predominantly spoken in the border towns where drug abuse is most prevalent. I believe that translating this work will help reach a wider audience and make a more significant impact, he explained.\n\nHe, however, stated that his vision does not stop at the written word, adding that he is already in talks to adapt Mhla Zinhlanu kuLwezi into a thrilling movie.\n\nWhile there are no auditions yet for the film crew, Masuku is optimistic about starting the filming process early next year, pending the completion of translation discussions.\n\nI want to partner with donors to bring this story to the big screen. The idea is still on paper for now, as we are working on securing finances for the project.The film will be released in episodes, allowing us to engage viewers in a unique way. As soon as an episode is completed, well release it based on industry advice and audience feedback, he added with enthusiasm.\n\nAs the conversation around drug awareness continues to grow, Masukus novel and upcoming film promise to be powerful tools in the fight against substance abuse. Were not just telling a story; were igniting a movement, he concluded, embodying the spirit of change that is so desperately needed in todays society.\n\nStay tuned for more updates on Mhla Zinhlanu kuLwezi as it makes its way from page to screen, inspiring hope and resilience in the face of adversity. @TeamKarubwa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsfdsfds.jpg",
            "description": "Blessing Karubwa -Showbiz Reporter In a dazzling display of culture, Maqhawe Masuku from Sibantubanye village has unveiled his powerful new novel, Mhla Zinhlanu kuLwezi, tackling the urgent crisis of drug abuse. This electrifying launch promises to captivate hearts and minds! The launch event, held in August at the Filabusi Centre District Hall, drew a substantial […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Bulawayo Children’s Choir debuts with visuals for “Banolila”",
            "url": "https://www.chronicle.co.zw/bulawayo-childrens-choir-debuts-with-visuals-for-banolila/",
            "content": "Mbulelo[emailprotected]\n\nIN a world where art often serves as a catalyst for change, the Bulawayo Childrens Choir, under the visionary direction of Trevor Mawaka, has taken a bold step forward.\n\nEarlier this week, the choir released the visuals for their debut song, Banolila (Mother Earth is Crying), a heartfelt plea for environmental conservation.\n\nDrawing inspiration from iconic tracks like UB40s The Earth Dies Screaming and Michael Jacksons Earth Song, Banolila resonates deeply in the context of todays urgent climate crisis.\n\nThe song serves as a poignant SOS, urging listeners and viewers to recognise the pressing need for environmental stewardship amidst the ongoing global warming challenges.\n\nThe choir, composed of young talent from various institutionsincluding Dominican Convent Primary School, Charleston Trust Primary School, Petra High School, and Hillside Primary Schoolembarks on a mission to advocate for the Earth.\n\nTheir collective voice not only showcases vocal excellence but also embodies a powerful message of change.\n\nIn an exclusive interview, Mawaka shared his vision for the choir.\n\nOur Choir is not only concerned with vocal excellence but rather, being a vehicle for change, advocating for diverse causes. Our ballad is a cry for help, asking the masses to save our environment to combat climate change, he stated passionately.\n\nThe production of Banolila was handled with care; recorded, mixed, and mastered at PlayOn Studios, the visuals were expertly captured by filmmaker Corey.\n\nThe resulting video poignantly illustrates the choir members actively engaging in environmental cleanup, picking up litter and disposing of it responsiblyan inspiring image of youth taking action.\n\nDespite the choirs noble intentions and the quality of their work, the video has faced a disappointing reception, garnering less than 300 views on YouTube at the time of writing.\n\nThis lack of visibility raises concerns about how effectively the choirs message is reaching the community.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fdffhfh.jpg",
            "description": "Mbulelo Mpofu-mbulelo.smpofu@gmail.com IN a world where art often serves as a catalyst for change, the Bulawayo Children’s Choir, under the visionary direction of Trevor Mawaka, has taken a bold step forward. Earlier this week, the choir released the visuals for their debut song, “Banolila (Mother Earth is Crying),” a heartfelt plea for environmental conservation. Drawing […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "President Mnangagwa honours Mbare Chimurenga Choir",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-honours-mbare-chimurenga-choir/",
            "content": "Mukudzei Chingwere,Harare Bureau\n\nPRESIDENT Mnangagwa said high-density suburbs like Mbare, Highfields, Makokoba, Mpopoma, Mtapa and Sakubva played a pivotal role in the liberation struggle.\n\nHe said these neighbourhoods were the breeding grounds for resistance and the spirit of freedom that ultimately led to Zimbabwes independence. The President expressed these sentiments during a festive Boxing Day gathering where he honoured the Mbare Chimurenga Choir for its invaluable contributions to Zimbabwes rich tapestry of culture and national identity.\n\nThe President also underscored the significance of the cultural creative industries, highlighting their role as engines of economic growth and innovation. He emphasised that these sectors not only foster artistic expression but also promote social cohesion and preserve Zimbabwes unique identity.\n\nAs you are aware, the cultural creative industries play a vital role in society by fostering economic growth through creative outputs such as music, art, design, fashion, and film, among others. They also contribute significantly to social cohesion, cultural identity, innovation, and individual well-being by nurturing creativity, expression, and engagement within communities.\n\nHonouring the Mbare Chimurenga Choir is appreciation, through them, of the many musicians and artistes who continue to use their artistic talents to defend the gains of our Independence and advance our national development identity, image, and culture.\n\nIt was in residential areas such as Mbare, Highfields, Makokoba, Mpopoma, Mtapa, and Sakubva, among others, where the flames for Independence were kept ablaze before and during our protracted war of liberation, said President Mnangagwa.\n\nHe said through song and dance, young people were mobilised to go for military training and subsequently to fight for the freedom of the country.\n\nIn the post-Independence era, said President Mnangagwa, it is groups and musicians such as the Mbare Chimurenga Choir who used their exceptional talent to promote cultural diversity and rally younger generations around the various national development periods.\n\nHe congratulated the Mbare Chimurenga Choir for the consistency with which it has utilised its musical talent for the good of the country and the ruling Zanu-PF party.\n\nYour music with its educating lyrics is a symbol of the hope and resilience that inspires countless individuals to remain patriotic and safeguard our beloved nation. The performance you have delivered over the years inculcates the values of unity, resilience, and love. Your revolutionary spirit is a beacon of light and hope.\n\nIt is also a reminder of our collective history, our shared struggles, as well as a celebration of our resilience and determination to build a better Zimbabwe. I applaud you for your current efforts and music compilations which highlight our ongoing national development agenda, vision, policies, and programmes. Through your efforts along with others in the creative cultural industries, the nation must remain galvanised towards the attainment of our vision of a prosperous and empowered upper-middle-income economy, said President Mnangagwa.\n\nHe also handed over gifts to the choir and encouraged them to carry the message of love, unity, and the need to accelerate development in the country, continuing to uplift one another and embrace the values being nurtured by the Second Republic.\n\nGoing forward, I urge you to continue infusing the new crop of musicians, particularly the youth, into your groups. It is equally important that you broaden the reach of your music, riding on the diversity of ICT platforms.\n\nAs I hand over these gifts, we acknowledge the tireless efforts of each and every one of you. Your dedication to Zanu-PF programmes is commendable and your performances have been a source of joy and entertainment for many, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-14-1.jpg",
            "description": "Mukudzei Chingwere, Harare Bureau  PRESIDENT Mnangagwa said high-density suburbs like Mbare, Highfields, Makokoba, Mpopoma, Mtapa and Sakubva played a pivotal role in the liberation struggle.  He said these neighbourhoods were the breeding grounds for resistance and the spirit of freedom that ultimately led to Zimbabwe’s independence. The President expressed these sentiments during a festive Boxing Day […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Bulawayo healthcare gets airborne: Help from above as air ambulances arrive",
            "url": "https://www.chronicle.co.zw/bulawayo-healthcare-gets-airborne-help-from-above-as-air-ambulances-arrive/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nHELIDRIVE Zimbabwe unveiled the first of its two air ambulances for Bulawayo yesterday, delivering a significant boost to emergency medical services in the Matabeleland region.\n\nThe helicopter, bound for the United Bulawayo Hospitals (UBH), landed at Joshua Mqabuko Nkomo International Airport at 11am, accompanied by a skilled crew of four, including pilots Aleksander Rusanov and Denis Salikhov. The second helicopter is anticipated to arrive in Bulawayo shortly.\n\nTogether, the two air medical rescue service helicopters will provide rapid medical assistance for serious incidents such as road traffic accidents throughout the Matabeleland region.\n\nThese helicopters are part of a larger fleet of six that will be dispatched across four stations, including Harare, Manicaland, Victoria Falls, and Bulawayo.\n\nThe helicopter will be based here in Bulawayo. This is a Presidential project and we are working on his instructions, said Rusanov.\n\nPresident Mnangagwa and the Government have embarked on a mission to modernise Zimbabwes healthcare systemto achieve the goal of becoming a modern, prosperous, and industrialised country by 2030.\n\nTo this end, the President visited Russia in June to seek investors to establish an air ambulance service.\n\nRussian HeliDrive Air Ambulance Medical Services promptly collaborated with Zimbabwe to establish an efficient air ambulance service equipped with highly skilled medical doctors, nurses, engineers, dispatchers, and pilots.\n\nThe Russian Air Ambulance Service has been in operation for nine years and has a fleet of over 100 medical helicopters, dedicated to saving lives throughout Russia.\n\nThe company has recruited and trained local personnel, including 40 pilots, 50 doctors, 100 nurses, 100 dispatchers, and 10 engineers, to handle the air medical services.\n\nAir ambulances are typically reserved for transporting patients from inadequate levels of care to higher levels of care or for patients who are unable to use commercial flights due to their medical condition.\n\nThese specialised aircraft are designed to overcome geographical barriers and provide the same level of medical care available in an intensive care unit.\n\nThe air ambulance service was launched in Zimbabwe in August in conjunction with the 44th SADC summit.\n\nThe helicopters are equipped with advanced medical facilities and staffed by trained medical personnel. One of the first successful missions was the transportation of a cardiac arrest patient from Chegutu to Harare in 20 minutes, which is significantly faster than the two-hour road journey.\n\nAlthough Winos Dube, chairperson of the Bulawayo Residents Association (Bura), recognised the significance of the arrival of the air ambulance, he emphasised the importance of providing equitable access to critical services.\n\nWe applaud the Government on this. We, however, hope that every person who needs emergency medical attention will access this. It must not be based on ones position in society but generally, we are excited as its presence will indeed save lives, said Dube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-5-1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw  HELIDRIVE Zimbabwe unveiled the first of its two air ambulances for Bulawayo yesterday, delivering a significant boost to emergency medical services in the Matabeleland region.  The helicopter, bound for the United Bulawayo Hospitals (UBH), landed at Joshua Mqabuko Nkomo International Airport at 11am, accompanied by a skilled crew of four, including pilots Aleksander […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": ". . . Craig Ervine ends four-year drought with century in historic Boxing Day Test",
            "url": "https://www.chronicle.co.zw/craig-ervine-ends-four-year-drought-with-century-in-historic-boxing-day-test/",
            "content": "Brandon Moyo,[emailprotected]\n\nCRAIG Ervine, Zimbabwes red-ball captain, ended his four-year wait for a Test century on day two of the Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo.\n\nErvine had gone seven innings without a century but kept his composure to score his fourth Test ton. His last century came in Mirpur against Bangladesh, where he made 107 runs. After the Mirpur century, Ervines scores were not very impressive, with only one half-century. However, he put an end to the dry spell, bringing up a brilliant century in a Boxing Day Test  his first in Zimbabwe.\n\nErvine made a patient 104 runs from 176 balls, including 10 boundaries, mostly consisting of singles as he kept the scoreboard ticking and rotated the strike with his partners, Sean Williams and Brian Bennett.\n\nErvine had emphasised before the series that playing at the familiar Queens Sports Club would work in Zimbabwes favour, and his innings proved him right.\n\nQueens Sports Club\n\nHe came to the crease with Zimbabwe in a strong position on 220/4, following the fall of Dion Myers. He then formed a 163-run partnership with Williams for the fifth wicket, before adding 82 runs for the sixth wicket with Bennett.\n\nErvines century was even more memorable as it came alongside Williamss career-best 154 runs, making it the first time in 10 years that Zimbabwe had two centurions in an innings.\n\nThe last time this happened was in 2014 against Bangladesh in Khulna, where Hamilton Masakadza and Regis Chakabva made 158 and 101 runs respectively.\n\nErvine now shares the joint seventh-most Test centuries for Zimbabwe, alongside Dave Houghton, after playing in 21 Test matches. Ervines other centuries in Test cricket came against Sri Lanka in 2017 (160 runs), New Zealand in 2016 (140 runs), and Bangladesh (107 runs) in 2020.\n\nOverall he has 1 344 runs under his belt at an average of 33.60, including five half-centuries.\n\n@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dghh.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com  CRAIG Ervine, Zimbabwe’s red-ball captain, ended his four-year wait for a Test century on day two of the Boxing Day Test against Afghanistan at Queens Sports Club in Bulawayo. Ervine had gone seven innings without a century but kept his composure to score his fourth Test ton. His last century came in Mirpur […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "WATCH: SADC delegates to grace Zim National thanksgiving service",
            "url": "https://www.chronicle.co.zw/watch-sadc-delegates-to-grace-zim-national-thanksgiving-service/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHIS years National Thanksgiving and Dedication Service, now in its eighth year, will take on a regional dimension with the attendance of representatives from all SADC member states.\n\nPresident Mnangagwa, the current SADC Chairperson, is set to preside over this significant event, which will be held tomorrow at the Zimbabwe International Trade Fair (ZITF) arena in Bulawayo.\n\nCongregants follow proceedings during a Family of God (FOG) church service at ZITF yesterday\n\nThe annual National Thanksgiving and Dedication Service, a cornerstone event since 2017, underscores Zimbabwes profound appreciation for divine guidance in its journey of progress and development.\n\nThis year, the service is anticipated to draw a diverse congregation from various denominations, united in gratitude for the peace, prosperity, and advancements that have graced the nation.\n\nInitiated by President Mnangagwa following the establishment of the Second Republic, the service has become an annual tradition, fostering a powerful platform for spiritual communion between the nations leadership and its people.\n\nThe event, a collaborative effort between the Faith for the Nation Campaign and the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), provides a crucial space for believers to intercede for continued blessings and prosperity of Zimbabwe, recognising the vital role of faith in national advancement.\n\nSpeaking to Saturday Chronicle yesterday, Shuvai Wutawunashe, a prominent gospel musician and member of the Faith for Nation campaign committee, said that the occasion serves as a time to express heartfelt gratitude to God for the numerous milestones achieved throughout the past year.\n\nSunday, December 29 is a big day for the nation as we come together for the 8th edition of the National Dedication Service. It happens annually and the nation looks forward to the event. The nation will come together with one voice, one heart, one mind to give thanks to God for all the milestones, achievements, and successes that have taken place in the past year, she said.\n\nThis years theme is Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nWutawunashe underscored the unique significance of this years event, highlighting that it coincides with President Mnangagwas tenure as the Chairperson of SADC.\n\nPresident Mnangagwa assumed this esteemed position in August.\n\nThis years edition has an advantage in that our President, the chairman of SADC, will have many people from almost every SADC country. Its a wonderful opportunity for President Mnangagwa to make statements and share hopes for SADC, where he will lead us and many SADC members will be in attendance.\n\nWe will be having key musicians from SADC to celebrate the day and its not just for Zimbabwe, we have faith for Zimbabwe but also we have faith for the nations of SADC. Its a day for SADC as well.\n\nWutawunashe said that President Mnangagwa will lead the nation in prayer, offering thanksgiving for the blessings bestowed upon hardworking Zimbabwean families.\n\nThis occasion also presents a unique opportunity for the President to dedicate national projects and personal endeavours to the Almighty.\n\nWutawunashe further underscored the profound significance of this interaction, underlining the importance of fostering a strong relationship between national leaders and the Church. She believes that dedicating oneself to God is essential for the spiritual and moral well-being of any nation.\n\nThis is an event that brings our national leaders, community leaders, from business and every sector of the nation including traditional leaders will be well represented. Every last Sunday of the year, Zimbabwe gives thanks for everything God has given us. We say Ebenezer.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-12-1.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  THIS year’s National Thanksgiving and Dedication Service, now in its eighth year, will take on a regional dimension with the attendance of representatives from all SADC member states.  President Mnangagwa, the current SADC Chairperson, is set to preside over this significant event, which will be held tomorrow at the Zimbabwe International Trade Fair […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": ". . . Brian Bennett silences critics with historic ton",
            "url": "https://www.chronicle.co.zw/brian-bennett-silences-critics-with-historic-ton/",
            "content": "Brandon Moyo,[emailprotected]\n\nAT just 21 years old, Brian Bennett has cemented his status as a rising star in Zimbabwean cricket.\n\nHis phenomenal performance in the first innings of the historic Boxing Day Test match against Afghanistan at Queens Sports Club has left fans and critics alike in awe.\n\nBennetts batting masterclass on day two of the match saw him score a brilliant 110 runs not out off just 124 balls, etching his name into the annals of Zimbabwean cricket history.\n\nThis achievement makes him the second-youngest player to score a century for Zimbabwe, behind only Hamilton Masakadza, who achieved the feat at just 17 years old.\n\nBennetts impressive innings included five fours and four sixes, along with 39 singles and 11 twos. His century was brought up in style, with a six in the 135th over while batting with Trevor Gwandu.\n\nThe shot almost resulted in his dismissal, but the fielder stepped on the boundary rope while holding onto the ball.\n\nThis historic feat is not only a testament to Bennetts individual talent but also a milestone for the Zimbabwean team. Alongside captain Craig Ervine and Sean Williams, Bennett is part of a team that has made history by posting their highest-ever Test score, with three centurions in an innings for the first time.\n\nBennetts rise to prominence has been swift. He made his First-Class debut for Mega Market Mountaineers in 2022, scoring 28 runs in his first match. To date, he has played 12 First-Class matches, accumulating 725 runs, including two centuries and four half-centuries. His best score in four-day cricket is 264 not out, and he boasts an impressive average of 40.21.\n\nBennett made his Test debut against Ireland in Belfast in July and has been widely touted as Zimbabwes next big thing across all three formats. He is already a mainstay of Zimbabwes white-ball squads.\n\nThe Chevrons were eventually bowled out for 586 runs in 135.2 overs, surpassing their previous best of 563/9 (declared) against the West Indies in Harare in 2001.\n\nAs Bennett continues to make waves in the cricket world, fans cant help but wonder what the future holds for this talented young batsman.\n\n@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-24.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com  AT just 21 years old, Brian Bennett has cemented his status as a rising star in Zimbabwean cricket.  His phenomenal performance in the first innings of the historic Boxing Day Test match against Afghanistan at Queens Sports Club has left fans and critics alike in awe. Bennett’s batting masterclass on day two of […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Victoria Falls still thundering: Tourists flock despite misleading reports",
            "url": "https://www.chronicle.co.zw/victoria-falls-still-thundering-tourists-flock-despite-misleading-reports/",
            "content": "Leonard Ncube,[emailprotected]\n\nVICTORIA Falls, the thunderous heart of Zimbabwe, pulsated with life as the festive season unfolded.\n\nDespite persistent rumours of the majestic waterfalls drying up, tourists from across the globe and a wave of returning locals, flocked to witness its awe-inspiring beauty.\n\nThe Ministry of Tourism and Hospitality Industry anticipated a record-breaking year, with visitors expected to surge close to 3 million, fuelled largely by the homecoming of Zimbabweans from the diaspora.\n\nFrom adrenaline-pumping adventures like bungee jumping, gorge swings, and the Flight of Angels, to serene game drives, wildlife interactions, tours of the Falls, and tranquil moments surrounded by breath-taking beauty  these have been the experiences of tourists this festive season. Tourists enjoyed an array of experiences, from bungee jumping and gorge swings to the thrilling Flight of Angels helicopter ride. Others took in game drives, interacted with wildlife, or simply marvelled at the magnificent waterfall. Victoria Falls delivered something for everyone  whether it was adrenaline or relaxation.\n\nVictoria Falls proved once more why it remains a top destination for holidaymakers seeking both relaxation and adventure. The resort city welcomed a mix of visitors including groups, families, schools, and individuals. Home to one of the Seven Natural Wonders of the World, known locally as Mosi-oa-Tunya (The Smoke That Thunders), Victoria Falls boasts unparalleled natural beauty, wildlife, and adventure opportunities.\n\nIn recent months, misleading reports have circulated, claiming the waterfall is drying up. However, these claims dont reflect the true picture. The Zambezi River, which feeds the Victoria Falls, experiences seasonal fluctuations and while water levels are lower between October and January, this is completely natural. According to the Zambezi River Authority, water levels are expected to rise again in February, bringing Victoria Falls back to its thunderous grandeur just in time for the rainy season.\n\nThough water levels were lower this season due to the effects of climate change and El Nio, Victoria Falls remained a vibrant, thriving destination. Despite recent negative publicity suggesting that the Falls are dry, these claims are misleading, considering the Zambezi Rivers seasonal flow patterns and the influx of tourists.\n\nVisitors were undeterred by the reduced flow, continuing to flock to the area to enjoy the lush landscapes, abundant wildlife, and thrilling experiences. Victoria Falls continues to draw visitors year-round, offering unforgettable experiences that highlight its enduring magnificence.\n\nAccording to the Zambezi River Authority, the amount of water in the Falls is low between October and January as part of its natural cycle.\n\nThe Zambezi River, Africas fourth-longest, flows through Zambia, Angola, Namibia, Botswana, Zimbabwe, and Mozambique.\n\nVictoria Falls, the worlds largest curtain of falling water, sees its flow down the waterfall dip below 1 000 cubic metres per second during the dry season extending between October and January, with levels expected to rise again by late February.\n\nThe worst seasons were 2016-2017 and 2023-2024 as a result of the devastating climate change and El Nio-induced drought, with this years levels in the same range. The 2008-2009 season had the highest low levels compared to other years during the period October to January. Water levels are expected to pick up next month and reach a peak at the end of February when the river will be full until May when it will start falling again. The long-term mean was highest in the 1961-1962 rainy season when water flowing down the waterfall between March and May reached a peak of more than 8 000 cubic metres per second. Every year there is less than 1 000 cubic metres per second of water falling down the waterfall between October and December.\n\nCurrent water levels on the Zambezi River are 475,83 metres compared to 477,16 metres last year during the same period, according to the Zambezi River Authority.\n\nThe dry season, which occurs annually, is a natural part of the Victoria Falls seasonal cycle which tourists flock to witness while enjoying the lush green landscapes and abundant wildlife within the Victoria Falls National Park. During the rainy season, the waterfall returns to its thundering grandeur, with its mist visible from miles away  an experience that continues to leave visitors in awe. Despite these natural fluctuations and the misleading reports, Victoria Falls remains a bustling hub of activity. Visitors have not been deterred as hotels and lodges on either side of the river reported steady bookings, and tour operators were busier than ever, showing that the destination offers much more than just its water levels.\n\nEphias Mambume, president of the Employers Association for the Tourism and Safari Operators, highlighted the surge in local and regional tourists during the festive season.\n\nWe have experienced a healthy percentage around 80 to 90 percent occupancy, he said, noting significant bookings in AirBnBs and a bustling Rainforest area with regional visitors. Popular activities included sunset cruises and tours of the Victoria Falls, with operators fully booked, said Mr Mambume. He implored the Government to urgently rehabilitate the Bulawayo-Victoria Falls highway for seamless travel.\n\nElephant and Cheetah Experience marketing manager Janice Ncube noted that the majority of clients this season were locals eager to interact and walk with cheetahs and elephants.\n\nThe local market has been awesome. If it wasnt for the local market, December would be a low season for us, she said.\n\nTourism and Hospitality Industry Minister Barbara Rwodzi, who spent nearly a week in Victoria Falls until Christmas Eve, affirmed that the influx of visitors was a result of vigorous marketing and President Mnangagwas policy of engagement and re-engagement.\n\nMinister Barbara Rwodzi\n\nIt shows that people love Zimbabwe and they have been waiting to hear whats good about Zimbabwe. The foreign policy that President Mnangagwa has been running with for the past seven years, Zimbabwe is Open to Business is paying dividends, she said.\n\nThe festive seasons vibrancy in Victoria Falls demonstrated the destinations resilience and enduring appeal, ensuring it remains a top choice for holidaymakers from around the globe. @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-41.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw  VICTORIA Falls, the thunderous heart of Zimbabwe, pulsated with life as the festive season unfolded.  Despite persistent rumours of the majestic waterfalls drying up, tourists from across the globe and a wave of returning locals, flocked to witness its awe-inspiring beauty.  The Ministry of Tourism and Hospitality Industry anticipated a record-breaking year, with […]",
            "time": "18:27",
            "date": "28 Dec 2024"
        }
    ]
}