{
    "news": [
        {
            "title": "Donald Trump sworn in as US president for second time, telling Americans: ‘The golden age begins right now’",
            "url": "https://www.chronicle.co.zw/donald-trump-sworn-in-as-us-president-for-second-time-telling-americans-the-golden-age-begins-right-now/",
            "content": "Donald Trump has been sworn in as 47th President of the United States, completing perhaps the most remarkable political comeback in American history.\n\nThe Republican, the first convicted felon ever to become commander-in-chief, is now giving his inaugural address.\n\nIm going to put America first The scales of justice will be rebalance, he added.\n\nHis wife Melania stood beside him as he gave the oath of office for the second time in his life.\n\nMr Trumpis expected to issue a flurry of executive orders on day one of his second administration, including declaring a national emergency at the border with Mexico and ending birthright citizenship.\n\nA host of former presidents and foreign politicians were in the room to watch the transfer of power  as well as a number of tech titans and billionaires who have sought to curry favour with Mr Trump.\n\nBut the ceremony was not without an awkward moment, with Mr Trump going to kiss his wife but missing her face as he went to take his seat in the Capitol Rotunda.\n\nEarlier, Mr Trump and his wife Melania joined Joe Biden and his wife Jill for the tea, which is traditionally held on inauguration day to welcome the new president. Afterwards, they all travelled in the same car in a motorcade to the Capitol.\n\nKing Charles was among those wishing the new president well, sending a personal message to Mr Trump congratulating him and reflecting on the enduring special relationship between the UK and US.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/2025-01-20t170506z-653893305-rc2sdcamzd2k-rtrmadp-3-usa-trump-inauguration-680x380.jpg",
            "description": "Donald Trump has been sworn in as 47th President of the United States, completing perhaps the most remarkable political comeback in American history. The Republican, the first convicted felon ever to become commander-in-chief, is now giving his inaugural address. “The golden age begins right now,” he said. “I’m going to put America first… The scales […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "R14 Million worth of Zimbabwe cigarettes intercepted at South African border",
            "url": "https://www.chronicle.co.zw/r14-million-worth-of-zimbabwe-cigarettes-intercepted-at-south-african-border/",
            "content": "Thupeyo Muleya,Beitbridge Bureau\n\nSouth African security authorities have arrested a 44-year-old migrant at the Beitbridge border post with a consignment of Remington Gold cigarettes worth an estimated R14 million, which are believed to have been smuggled from Zimbabwe.\n\nThe smuggling of cigarettes has become a persistent issue for authorities in both countries, who are often collaborating to reduce the illegal trade.\n\nIt is understood that South African customs laws are restrictive for Zimbabwean exporters, making it difficult to legally transport the cigarettes from Zimbabwe to South Africa, which has led to a rise in smuggling activities involving various brands.\n\nIn many instances, cigarettes are smuggled through the Limpopo River, while others attempt to cross the border illegally. It is estimated that at least one-third of the cigarette brands on the South African market are smuggled from Zimbabwe, including Pacific, Remington Gold, Mega, Dullahs, Branson, and Servilles.\n\nA box of cigarettes is typically bought for around US$120 from local producers and sold for between US$250 and US$300 to syndicates, who then smuggle them into South Africa, where they are sold for upwards of R15,000. Those involved in the illegal transportation of the cigarettes are paid between R100 and R300 per box, with much of the smuggling taking place under the cover of darkness.\n\nIn a statement on Monday, Limpopo police spokesperson Brigadier Hlulani Mashaba confirmed that the contraband was intercepted on Saturday. The nationality of the migrant will be revealed following his initial court appearance at Musina Magistrates Court on charges of smuggling.\n\nThe Provincial Commissioner of police in Limpopo, Lieutenant General Thembi Hadebe, has applauded the police for their vigilance and alertness, which led to the arrest of a 44-year-old foreign national for smuggling illicit cigarettes worth more than fourteen million rands at Beitbridge Port of Entry on Saturday, he said.\n\nIt is reported that the suspect was driving a white truck with a tanker trailer when he was stopped by the police at the port of entry. The driver claimed the vehicle was empty, but the police suspected it might be loaded. The truck was then taken to the ramp zone at the commercial side for further inspection.\n\nDuring the search, police discovered that the vehicle was fully loaded with illicit cigarettes of the Remington Gold brand. The suspect failed to provide a satisfactory explanation regarding the origin of the cigarettes and was immediately placed under arrest on the spot, added Brigadier Mashaba.\n\nPolice have since confiscated 710 boxes of Remington Gold illicit cigarettes, with an estimated street value of R14,449,363.00, as well as the truck tanker, which is valued at R2,500,000.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/beit.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau South African security authorities have arrested a 44-year-old migrant at the Beitbridge border post with a consignment of Remington Gold cigarettes worth an estimated R14 million, which are believed to have been smuggled from Zimbabwe. The smuggling of cigarettes has become a persistent issue for authorities in both countries, who are often […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "SA mine disaster: Illegal mining kingpin rescued; escapes custody",
            "url": "https://www.chronicle.co.zw/sa-mine-disaster-il1legal-mining-kingpin-rescued-escapes-custody/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nSOUTH African police are on the hunt for Lesotho national James Neo Tshoaeli, also known as Tiger, who escaped from custody after being rescued from a Stilfontein mine in North West, where 87 people of various nationalities died.\n\nTshoaeli, who is alleged to be the kingpin of illegal mining operations in the area, is accused of denying food to other miners underground, leading to their deaths from starvation.\n\nHundreds of individuals, including suspected Zimbabweans, have been rescued from the mine.\n\nThe Zimbabwean Embassy in South Africa is on the ground to verify the number of nationals who were rescued and those who may have died, with the aim of offering consular services.\n\nZimbabwes Ambassador to Pretoria, Mr David Hamadziripi, said in a statement last week that DNA testing may be required to identify some of the deceased through their relatives.\n\nIn a statement, South Africas national police spokesperson, Brigadier Athlenda Mathe, said the Acting Provincial Commander, Commissioner of North West, Major General Patrick Asaneng, has ordered maximum resources to be mobilised in the search for Tshoaeli, who resurfaced from shaft 11 in Stilfontein last week.\n\nMajor General Asaneng has also warned that heads will roll once those officials who aided the kingpins escape from police custody are found, she said.\n\nExtensive investigations and tracing operations are underway to find those officials who facilitated his escape between shaft 11 and the Stilfontein police holding cells.\n\nAccording to records, Tshoaeli was never booked into various other stations where some illegal miners are being held. He is also not admitted to a local hospital for further medical care. The alleged kingpin and ringleader, a Lesotho national, is known by the name James Neo Tshoaeli, but is commonly referred to as Tiger.\n\nBrigadier Mathe added that Tshoaeli has been implicated in several statements as one of the leaders controlling underground operations. He is also accused by some of the miners who resurfaced from underground of being responsible for deaths, assaults, and torture, based on videos in police possession.\n\nTshoaeli is also alleged to have hoarded food and kept it away from other illegal miners.\n\nMajor General Asaneng has expressed disappointment over what he described as an embarrassment to the Vala Umgodi operation, which has been running since December 2023. He has vowed to ensure that those responsible for this escape from custody are brought to justice and that Tshoaeli is found. Tiger is now a fugitive of justice, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/hjue5t.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau SOUTH African police are on the hunt for Lesotho national James Neo Tshoaeli, also known as Tiger, who escaped from custody after being rescued from a Stilfontein mine in North West, where 87 people of various nationalities died. Tshoaeli, who is alleged to be the kingpin of illegal mining operations in […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Repentance Revival Movement to host prophetic outreach in Bulawayo and Harare",
            "url": "https://www.chronicle.co.zw/repentance-revival-movement-to-host-prophetic-outreach-in-bulawayo-and-harare/",
            "content": "Trish Mukwazo[emailprotected]THE Repentance Revival Movement is set to host a three-day outreach programme dubbed Heavenly Factor Prophetic Transition in Bulawayo and Harare from Friday to Sunday.In Bulawayo, the services will be held at the Small City Hall, while in Harare, they will take place at Grace Methodist Church International, located at 15 Borgward Road, Msasa. The services are scheduled to start at 4pm each day.The programme will feature Bishop Robert Clancy, an internationally renowned preacher, delivering the main message, while Apostle Anele Bongani Ndebele will lead intercessory prayers. The message for the event is inspired by Matthew 24:14: And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come.Bishop Clancy, an Australian minister, has a global ministry that spans Asia, Africa, India, Brazil, Mexico, the Caribbean, and the USA. His mission is centred on spreading the Gospel, calling individuals and the church to genuine repentance, and fostering spiritual renewal.He is a passionate advocate for prevailing prayer, spiritual warfare, and deliverance, emphasisng their role in breaking strongholds and achieving true freedom in Christ. Bishop Clancys teachings focus on spiritual gifts, fasting, and building a strong relationship with Jesus Christ.Bishop Clancys powerful testimony recounts his transformation from a life of crime and gang activity in 1997 to a radical salvation experience that led him to full-time ministry. His first missionary trip was to East Timor in 1999, where he later married Pastor Aida Clancy.In 2011, Bishop Clancy left his career and sold his home to dedicate himself fully to ministry, relocating with his family to Africa. He established a mission before returning to Australia, continuing his work to spread the message of the cross.In his early ministry, Bishop Clancy received a vision of Africa experiencing a spiritual revival, beginning in the East and spreading across the continent. This revival, he believes, will ignite a global spiritual awakening, heralding the return of Christ for His church.Despite pandemic travel restrictions, Bishop Clancy maintained an active online presence, reaching over 10 000 daily viewers through social media platforms. Since 2022, he has spent six months ministering across Africa and Asia, with plans for further missions in 2024, including a visit to the USA during the election season.The Heavenly Factor Prophetic Transition outreach is expected to draw participants seeking spiritual renewal, deliverance, and empowerment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tvf.jpg",
            "description": "Trish Mukwazo Trishmukwazo515@gmail.com THE Repentance Revival Movement is set to host a three-day outreach programme dubbed “Heavenly Factor Prophetic Transition” in Bulawayo and Harare from Friday to Sunday. In Bulawayo, the services will be held at the Small City Hall, while in Harare, they will take place at Grace Methodist Church International, located at 15 […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "#VoicesFrom_: A new concert series to amplify Zimbabwe’s hidden musical gems",
            "url": "https://www.chronicle.co.zw/voicesfrom_-a-new-concert-series-to-amplify-zimbabwes-hidden-musical-gems/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nIn an exciting initiative set to change the landscape of Zimbabwes music scene, earGROUND Media is launching a ground-breaking series of monthly concerts in Harare starting in March 2025.\n\nDubbed #VoicesFrom_, the initiative is dedicated to spotlighting artistes from regions outside of Harare, aiming to provide a platform for talented individuals who have often been overlooked. Each month, the concert series will showcase artistes from a different Zimbabwean province, with the performances held at the iconic Theatre in the Park.\n\nSpeaking to Chronicle Showbiz Online, earGROUND Media founder Plot Mhako expressed his excitement about the project, noting that while Zimbabwe has an abundance of talent across its provinces, the spotlight has largely focused on Harare-based artistes.#VoicesFrom_ is our effort to shift the narrative by celebrating exceptional artistes from regions that are often marginalised, including rural communities, Mhako said.\n\nThe series builds on earGROUND Medias work with the Kombi Station, a mobile media platform launched in 2022 that documents and gives visibility to artists in remote areas.\n\nMhako explained that while Kombi Station has been successful in uncovering hidden talent, #VoicesFrom_ takes it further by connecting these artistes with larger audiences, media visibility, and new opportunities.We realised there was a need to create a stage where these artistes could be seen by a broader audience, where they could secure bookings, collaborations, and industry recognition, he added.\n\nThe initiative includes partnerships with Theatre in the Park to organise travel, accommodation, rehearsals, venue bookings, and publicity for the artistes. In return, the artistes will benefit from a revenue-sharing arrangement.\n\nThe initiative also aims to connect these performers with radio and TV stations, newspapers, studios, and potential promoters, maximising their exposure while in Harare.\n\nearGROUND Media has a proven track record of championing emerging talent. In 2022, they co-hosted the AMPLIFAYA Festival, where artistes from nine provinces showcased their work to great acclaim. #VoicesFrom_ takes this success to the next level by ensuring that talent from outside Harare gets the recognition it deserves.Imagine a #VoicesFrom_Bulawayo edition featuring top artistes like MJ Sings, Vuyo Brown, Hwabaraty, Thandy Dhlana, Aku Khanya, and MsizKay, Mhako said.\n\nThese artistes, who have international-calibre talent, rarely get the platform they deserve. With #VoicesFrom_, were changing that by fostering collaboration and amplifying their reach to audiences and industry stakeholders.\n\nThe first installment of #VoicesFrom_ will kick off this March at Theatre in the Park. Stay tuned for more updates as earGROUND Media prepares to unveil the full line-up of talented artistes ready to take Harare by storm.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jbh-j.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com In an exciting initiative set to change the landscape of Zimbabwe’s music scene, earGROUND Media is launching a ground-breaking series of monthly concerts in Harare starting in March 2025. Dubbed #VoicesFrom_, the initiative is dedicated to spotlighting artistes from regions outside of Harare, aiming to provide a platform for talented individuals who […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Nama opens nominations for People’s Choice Award",
            "url": "https://www.chronicle.co.zw/nama-opens-nominations-for-peoples-choice-award/",
            "content": "Mthabisi Tshuma[emailprotected]\n\nThe National Arts Merit Awards (Nama), one of Zimbabwes premier arts events, has officially opened nominations for the coveted NAMA23 Peoples Choice Award.\n\nThe National Arts Council of Zimbabwe (NACZ) previously announced updates to the Nama for its 23rd edition, aimed at improving the efficiency, transparency, and fairness of the awards.\n\nNama director Tinashe Kitchen encouraged the public to participate in the nomination process to ensure their favourite artists make it to the Top 5.This serves to notify members of the press, the general public, and relevant stakeholders that nominations for the 23rd edition of the National Arts Merit Awards are officially open for the NAMA23 Peoples Choice Award, said Kitchen.\n\nHe added, The Peoples Choice Award is one of Namas most special accolades as it allows the people of Zimbabwe to choose the artiste they believe deserves the recognition. Zimbabwean artistes from all genres, including song, dance, theatre, literature, spoken word, comedy, visual arts, television, and radio, are eligible for nomination.Nominations close on February 5, with the Top 5 nominees to be announced thereafter. To vote, the public is encouraged to visit: https://gatewaystream.com/nama or any of Namas social media platforms (@namaszim) for further details.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jihb.jpg",
            "description": "Mthabisi Tshuma revmmthiretshuma@gmail.com The National Arts Merit Awards (Nama), one of Zimbabwe’s premier arts events, has officially opened nominations for the coveted NAMA23 People’s Choice Award. The National Arts Council of Zimbabwe (NACZ) previously announced updates to the Nama for its 23rd edition, aimed at improving the efficiency, transparency, and fairness of the awards. Nama […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "ICT Ministry, Potraz donates over 400 computers to 39 rural district councils",
            "url": "https://www.chronicle.co.zw/ict-ministry-potraz-donates-over-400-computers-to-39-rural-district-councils/",
            "content": "Mthabisi Tshuma in Harare\n\nTHE Ministry of Information Communication Technology, Postal and Courier Services in conjunction with telecommunications regulator Potraz, have donated over 400 computers to 39 Rural District Councils (RDCs) countrywide.\n\nThe handover ceremony was held at Potraz headquarters in Harare on Monday where ICT Minister Dr Tatenda Mavetera accompanied by ICT Deputy Minister Dingumuzi Phuti and ICT permanent secretary Dr Beulah Chirume handed 415 computers to Local Government and Public Works Deputy Minister Benjamin Kabikira which will be shared equally among 39 RDCs.\n\nThe country has 60 RDCs and the 21 remaining RDCs are set to benefit in the next batch.\n\nAlso present at the event was ZILGA president Dr Aaron Shamhu, Potraz director general Dr Gift Machengete, Potraz deputy director general Mr Alfred Marisa, Potraz senior management, ICT Ministry senior management, Local Government Ministry senior management among other senior Government officials.\n\nMore details to follow\n\n-@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/llk.jpg",
            "description": "  Mthabisi Tshuma in Harare THE Ministry of Information Communication Technology, Postal and Courier Services in conjunction with telecommunications regulator Potraz, have donated over 400 computers to 39 Rural District Council’s (RDC’s) countrywide. The handover ceremony was held at Potraz headquarters in Harare on Monday where ICT Minister Dr Tatenda Mavetera accompanied by ICT Deputy […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Thief caught red-handed trying to steal funeral parlour’s ambulance",
            "url": "https://www.chronicle.co.zw/thief-caught-red-handed-trying-to-steal-funeral-parlours-ambulance/",
            "content": "Online Reporter\n\nA man was caught attempting to steal a funeral parlours ambulance as he was about to drive away with it from the parking lot just outside the company premises in Bulawayo.\n\nIn a statement, Bulawayo Police acting spokesperson Assistant Inspector Nomalanga Msebele confirmed the arrest of Sean Ndlovu (26), from Esikhoveni village, Mawabeni, Esigodini, in Matabeleland South province. Ndlovu was apprehended on Saturday while attempting to steal the ambulance from Doves Funeral Services in Bulawayo.\n\nOn the 18th of January 2025, at around 21:50 hours, the company driver, who was driving out of the gate of Doves Funeral Services premises, noticed that the company ambulance, a white Toyota Hiace, which had been parked at the centre parking along J Tongogara Street, was being reversed into a side parking area along the same road, and its lights were on, said Assistant Inspector Msebele.\n\nShe explained that the driver became suspicious as all the other Doves drivers had gone to a funeral, and the keys for the vehicle were missing.\n\nHe approached the motor vehicle and noticed that there was an unknown driver inside, who stopped the vehicle, switched off the lights, and locked himself inside. The driver called on the suspect to open the doors, and he complied. The driver then found the accused with a car key that did not belong to Doves. A police report was made, which led to the suspects arrest, said Assistant Inspector Msebele.\n\nShe further stated that the alertness of the Doves driver led to the recovery of the vehicle before it was driven away and also contributed to the arrest of the accused.\n\nAssistant Inspector Msebele urged members of the public to always remain vigilant and take care of their property.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/08/theft-1.jpg",
            "description": "Online Reporter A man was caught attempting to steal a funeral parlour’s ambulance as he was about to drive away with it from the parking lot just outside the company premises in Bulawayo. In a statement, Bulawayo Police acting spokesperson Assistant Inspector Nomalanga Msebele confirmed the arrest of Sean Ndlovu (26), from Esikhoveni village, Mawabeni, […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Man found dead, stabbed in Cowdray Park bush",
            "url": "https://www.chronicle.co.zw/man-found-dead-stabbed-in-cowdray-park-bush/",
            "content": "Online Reporter\n\nA mans body was found in a pool of blood in a bush area in Cowdray Park, Bulawayo, on Sunday morning, with police stating that they are treating the case as a murder.\n\nIn a statement, Acting Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele said they were investigating a murder case where Qinisela Nyathi (46), from Cowdray Park, was found with cuts on his throat by a neighbour.\n\nOn the 19th of January 2025, at around 0700 hours, a 42-year-old woman was called by neighbours to identify the body of her brother, which was lying lifeless in a pool of blood in a bushy area.\n\nA police report was then made, and the accused person was not located. Observations revealed that the body was lying on its right side, with a deep cut noted on the throat and on the left arm, said Assistant Inspector Msebele.\n\nShe added that Nyathis body was searched, and nothing was found in his pockets, while the suspected murder weapon was found near the body.\n\nThe body was conveyed to United Bulawayo Hospitals for a post-mortem. We urge members of the public to desist from violent conduct, as this leads to unnecessary loss of lives. We also appeal to members of the public with information that may lead to the arrest of the accused to visit the nearest police station, said Assistant Inspector Msebele.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Online Reporter A man’s body was found in a pool of blood in a bush area in Cowdray Park, Bulawayo, on Sunday morning, with police stating that they are treating the case as a murder. In a statement, Acting Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele said they were investigating a murder case where Qinisela […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Jongwe lands at Chiefs",
            "url": "https://www.chronicle.co.zw/jongwe-lands-at-chiefs/",
            "content": "Online Reporter\n\nFORMER Premier Soccer League side Bulawayo Chiefs have appointed a new coach Maxwell Takaendesa Jongwe ahead of their return to the Division One League\n\nChiefs parted ways with their coach Thulani Sibanda at the end of December following their relegation from the Castle Lager Premier Soccer League.\n\nLast season, the well-travelled Jongwe was with Chegutu Pirates.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/sdgt.jpg",
            "description": "Online Reporter FORMER Premier Soccer League side Bulawayo Chiefs have appointed a new coach Maxwell Takaendesa Jongwe ahead of their return to the Division One League   Chiefs parted ways with their coach Thulani Sibanda at the end of December following their relegation from the Castle Lager Premier Soccer League.   Last season, the well-travelled […]",
            "time": "21:26",
            "date": "20 Jan 2025"
        }
    ]
}