{
    "news": [
        {
            "title": "Dialogue will end DRC conflict: President",
            "url": "https://www.chronicle.co.zw/dialogue-will-end-drc-conflict-president/",
            "content": "Wallace Ruzvidzo and Gari Fadzi, Harare Bureau\n\nAfrican leaders have agreed that dialogue is the best way forward to the security crisis in the eastern Democratic Republic of Congo, hence efforts will be made to persuade both parties to come to the table and cease the hostilities, President Mnangagwa has said.\n\nSpeaking to journalists upon his arrival from Addis Ababa, Ethiopia yesterday, where he attended the 38th Ordinary Session of the African Union Assembly of Heads of State and Government, the President, who is also the SADC Chairperson, said the DRCs security situation had been extensively discussed at the well attended summit.\n\nPresident Mnangagwa was welcomed at Robert Gabriel Mugabe International Airport State Pavillion by Vice-Presidents Constantino Chiwenga and Kembo Mohadi, Chief Secretary to the President and Cabinet Dr Martin Rushwaya, Cabinet Ministers, Service Chiefs, Permanent Secretaries and other senior Government officials.\n\nVP Chiwenga\n\nWell, I can say it was well attended by all the regions of Africa. And, of course, the main issue which we discussed, which I think was more critical, was the DRC.\n\nThe eastern DRC issue took centre stage and all Heads of State discussed about the promotion of dialogue in that area and that both sides should be persuaded to come to the table and cease the hostilities and the dislocation of communities, especially in the eastern DRC.\n\nI can say those are the major highlights, but the rest of Africa is okay, he said.\n\nPrior to the AU Ordinary Session, SADC and the East African Community (EAC) recently convened a joint summit in Dar es Salaam, Tanzania, which President Mnangagwa said was testament to the two regional blocs commitment to the values of the AU.\n\nOn reparations for historical injustices suffered by Africans at the hands of imperial powers, the President said African leaders had agreed to join forces and form a platform, although the modalities would be region specific.\n\nYes, we discussed about that one, but it is a long, long, long journey. We agreed that we should form a platform where Africa must seek reparations from imperial powers, but that is a long journey.\n\nThat may be championed by the regions . . . region by region, and then we coordinate because the impact of imperialism was different in different parts of the continent, he said.\n\nThe AU summit was held under the theme Justice for Africans and People of African Descent through Reparations and the theme dovetails with the AUs efforts to institutionalise reparatory justice and racial healing.\n\nIt paves the way for the development of a common African position on reparations and establishment of an African Reparatory Programme of Action, as well as strengthen collaboration with the Caribbean Community (CARICOM) and the global African diaspora through a joint mechanism on reparations.\n\nZimbabwe has already taken steps towards demanding reparations from Britain.\n\nIn 2024, President Mnangagwa launched an academic study into the impact of colonialism onZimbabwe.\n\nThe study, led by Dr Felix Mukonowengwe of the Zimbabwe National Elders Forum, will serve as thebasis for a formal reparation claim.\n\nZimbabwe was a British colony from 1890 to 1980 and authorities argue that colonial rule left lasting socio-economic scars that require redress.\n\nMeanwhile, in a speech read on his behalf by Foreign Affairs and International Trade Minister Professor Amon Murwira, at the AU Peace and Security Council Session yesterday, President Mnangagwa called for African solutions to challenges facing the continent. Prof Murwira delivered the speech after the President had left for Harare.\n\nZimbabwe reiterates that the principle of African solutions to African problems should continue to serve as the beacon for conflict resolution and peace-building mechanisms on our continent.\n\nWe must redouble our efforts for a secure and prosperous Africa, he said.\n\nThe President reaffirmed an immediate end to hostilities in South Sudan and DRC.We therefore echo calls for the urgent cessation of hostilities and unhindered access of the affected population to humanitarian assistance in the eastern DRC and an end to the protracted conflict in Sudan.\n\nWe emphasise the need to achieve an enduring and mutually acceptable political solution in Western Sahara.\n\nThe South Sudan situation remains one of Africas most significant refugee crises, with 2,3 million refugees and asylum-seekers in neighbouring countries and a further 2 million South Sudanese internally displaced.\n\nBefore the President left Ethiopia, he met his Mozambican counterpart President Daniel Chapo.\n\nEmerging from the closed door meeting, President Chapo called for increased economic co-operation between Zimbabwe and Mozambique.\n\nOur two countries are facing economic challenges which l believe we need to fight side by side. Even in our fight for political freedom, Zimbabwe and Mozambique were together.\n\nNow it is very important to talk about our economic freedom. Our political, diplomatic and economic relations are equally important, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/abcsxsd.jpg",
            "description": "Wallace Ruzvidzo and Gari Fadzi, Harare Bureau African leaders have agreed that dialogue is the best way forward to the security crisis in the eastern Democratic Republic of Congo, hence efforts will be made to persuade both parties to “come to the table and cease the hostilities,” President Mnangagwa has said. Speaking to journalists upon […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "Contractors descend on Gokwe’s Nembudziya for Independence preparations",
            "url": "https://www.chronicle.co.zw/contractors-descend-on-gokwes-nembudziya-for-independence-preparations/",
            "content": "Patrick Chitumba,[emailprotected]\n\nCONTRACTORS have moved on site to start major roads rehabilitation among other key infrastructure development projects in Nembudziya, Gokwe North District as the Midlands province fine-tunes preparations for the hosting of Zimbabwes 45th Independence Day celebrations on April 18.\n\nPresident Mnangagwa will lead the national celebrations expected to attract more than 100 000 people.\n\nThis is a departure from the past when Harare used to host all the national events. The Second Republic embraced devolution and directed that national events such as independence celebrations be rotated across provinces as part of the administrations vision of leaving no one and no place behind.\n\nThe independence celebrations usually provide a platform for the countrys leadership and the masses to reflect on the countrys achievements and challenges since independence in 1980.\n\nRotating the independence celebrations ensures that all provinces enjoy legacy projects that come with hosting the main celebrations.\n\nThe Minister of State for Midlands Provincial Affairs and Devolution, Cde Owen Ncube on Saturday, visited Nembudziya to assess progress in the preparations to host the national event.\n\nWork on the main site has started and it was a hive of activity as tipper trucks, compactors, and other heavy machinery moved back and forth.\n\nRoads leading to Nembudziya from Kadoma as well as from Gokwe Town are also being rehabilitated to ensure smooth flow of traffic.\n\nIn an interview in Nembudziya, Minister Ncube said preparations for the big event were progressing well.\n\nWe are here in Nembudziya area in Gokwe North to see progress being made at the main site and we have mobilised tipper trucks and other earth moving equipment to make sure that we are ready to host over 100 000 people. We are happy to welcome President Mnangagwa who will grace the event, he said.\n\nPresident Mnangagwa\n\nMinister Ncube highlighted the districts potential benefits from playing host to the national celebration which include rehabilitations of roads among others. He said the host district is already enjoying benefits of Governments infrastructure development which include building of schools, clinics, solar-powered boreholes, rural electrification and road construction.\n\nThe hosting of the national celebrations in Nembudziya is a testament to the Governments commitment to leaving no one and no place behind, said Ncube.\n\nMeanwhile, the Zanu PF Midlands Provincial leadership is taking a bold step to connect with the grassroots by embarking on a massive outreach programme that will see them cover an impressive 600 districts across the province this month.\n\nThe outreach started in Gokwe North District where the leadership this weekend addressed 90 districts.\n\nThis outreach programme is not just about spreading the partys message of unity, development and progress but is also about reporting back on key resolutions made by the party at the National Peoples Conference in Bulawayo last year.\n\nMidlands provincial party chairperson Cde Edson Chiherenge said the leadership has been put in groups, which will be going to every ward to meet with the grassroots.\n\nAdditionally, the teams will be discussing preparations for the upcoming National Independence Day commemorations and sharing insights on effective social media use, he said.\n\nCde Chiherenge said the provincial leadership is committed to engaging with the party members and every citizen in driving socio-economic development in the province.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/abcsxc.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw CONTRACTORS have moved on site to start major roads rehabilitation among other key infrastructure development projects in Nembudziya, Gokwe North District as the Midlands province fine-tunes preparations for the hosting of Zimbabwe’s 45th Independence Day celebrations on April 18. President Mnangagwa will lead the national celebrations expected to attract more than 100 […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "Dodgy schools sprout: Government reviews licensing standards",
            "url": "https://www.chronicle.co.zw/dodgy-schools-sprout-government-reviews-licensing-standards/",
            "content": "Nqobile Tshili,[emailprotected]\n\nGOVERNMENT is seized with reviewing minimum standards for licensing of schools as part of measures to address the sprouting of illegal learning institutions attributed to the shortage of schools.\n\nThe Ministry of Primary and Secondary Education views partnerships with the private sector as critical in addressing educational infrastructure.\n\nThe country has a shortage of approximately 3 000 schools with highly populated suburbs such as Cowdray Park in Bulawayo, Stoneridge and Caledonia in Harare being the haven for illegal schools.\n\nConcerns have been raised over the quality of education produced in shacks masquerading as education facilities.\n\nHowever, Government also recognises that some of the illegal schools have requisite infrastructure that can be upgraded, thereby enabling those institutions to be registered.\n\nIn an interview, Primary and Secondary Education Permanent Secretary Mr Moses Mhike said the ministry will be visiting some of the schools to try and understand why the learning institutions were not registered.\n\nAs a ministry we are going through a process, we have got what we call minimum functionality standards. For any school to be registered it has to meet certain requirements and among the requirements that we are going to be reviewing is the land size, he said.\n\nI believe this is one of the major issues why the majority of these schools are not registered because they dont have the minimum required pieces of land, said Mhike.\n\nHe said since independence the Government was only licensing schools that have spacious land, a situation that needs to be reviewed.\n\nIt was normal to say for one to have a boarding school, they must have 26 to 30 hectares of land. But where are they going to be getting such land nowadays?\n\nThis means as a ministry we need to revise our minimum standards. That is what we are going to be reviewing. If you are on a two to three-hectare piece of land, we can allow you to have a school but cap you on the enrolment to probably between 300 and 400 learners, said Mr Mhike.\n\nHe said Government is relaxing the regulations as it views private sector players as key investors in the delivery of education.\n\nMr Mhike however, said the ministry will shut down illegal schools that have no infrastructure and cannot comply with the minimum education standards.\n\nThere are certain schools that do not have the required infrastructure and these should be closed, he said.\n\nMr Mhike said Government and local authorities have not been building many schools for the past five or so years hence the shortage being witnessed.\n\nWe now have a backlog hence we are seeing the sprouting of these illegal schools especially in new settlements such as Cowdray Park in Bulawayo, Stoneridge and Caledonia in Harare, he said.\n\nResponding to questions during the National Assemblys question and answer session last Wednesday, Primary and Secondary Education Minister Torerai Moyo said the Government was prioritising public-private partnerships in addressing the acute shortage of schools.\n\nMinister of Primary and Secondary Education Hon Torerai Moyo addressing the crowd at COSSASA games at White City stadium, Bulawayo.\n\nThe ministry acknowledges the urgency of addressing classroom shortages exacerbated by high pupils enrolment and we remain steadfast in our commitment to equitable, sustainable solutions, he said.Minister Moyo said his Ministry was prioritising infrastructural development through partnerships to accelerate the construction of classrooms, laboratories and administration blocks.\n\nHe said schools facing acute shortages are being prioritised for listing under PPPs interventions.\n\nHowever, fiscal constraints necessitate a phased strategic approach to ensure resources are located where they are most critically needed, said Minister Moyo.@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/1aqsx.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw GOVERNMENT is seized with reviewing minimum standards for licensing of schools as part of measures to address the sprouting of illegal learning institutions attributed to the shortage of schools. The Ministry of Primary and Secondary Education views partnerships with the private sector as critical in addressing educational infrastructure. The country has a […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "Merit Awards for Matabeleland South’s top eight schools",
            "url": "https://www.chronicle.co.zw/merit-awards-for-matabeleland-souths-top-eight-schools/",
            "content": "Nqobile Tshili,[emailprotected]\n\nEIGHT leading primary and secondary schools in Matabeleland South have received the Ministry of Primary and Secondary Educations Secretary Merit Awards for championing inclusive education with the Government commending them for equipping pupils with life skills.\n\nDingumuzi Primary School, Filabusi Government Primary School, Colleen Bawn Primary, Oakleigh House Trust School won the award for junior schools while Minda High School, Tongwe Government High School, Mzingwane High School and Thekwane High School won under the secondary schools category.\n\nThe Secretarys Merit Award is one of the ministrys key supervision tools intended to enhance quality education.\n\nIt is awarded to an excelling primary and secondary school per province annually.\n\nHowever, the Ministry of Primary and Secondary Education has not held the merit awards since 2021.\n\nThis is the first time that the ministry has held a blended awards ceremony which was hosted by Minda High School and the permanent secretary Mr Moses Mhike presided over the event.\n\nMr Mhike said the eight schools which won the Secretarys Merit Award have set a benchmark in the province through their outstanding performance, aligning with national priorities in education.\n\nEach year, the award is presented to 10 primary schools and 10 secondary schools that demonstrate excellence in academics, viable commercial units, culture and sports, alongside other essential tenets of a child-friendly school, he said.\n\nThese institutions demonstrated exceptional commitment and excellence in various domains, including commercial units, foundational learning, technical vocational education and academic results.\n\nMr Mhike said in 2021, the Secretarys Merit Award was won by schools that responded to Governments call to establish commercial units to enhance food security and generate income with Dingumuzi Primary School and Minda High emerging as winners in the province.\n\nHe said in 2022, the ministry targeted primary schools that strengthened foundational learning, created safe and supportive environments, implemented the home-grown feeding programme and promoted strong parental involvement.\n\nSecondary schools were expected to focus on promoting technical and vocational education while offering HEXCO courses.\n\nFilabusi Government Primary School and Tongwe Government High School excelled in this category.\n\nTongwe Government High School successfully introduced HEXCO courses in garment construction, bakery and computer operations thereby equipping pupils with practical skills for future employment and entrepreneurship, said Mr Mhike.\n\nHe said the schools commercial cattle and piggery projects have expanded significantly, generating income for infrastructural development.\n\nMr Mhike said in 2023, the ministry shifted focus to schools that had embraced science, technology, engineering, arts, mathematics (STEAM) oriented education in line with the countrys modernisation and industrialisation agenda at the primary and secondary level.\n\nHe said Colleen Bawn Primary and Mzingwane High Schools won in the category.\n\nIn 2024, the selection focused on academic performance through good pass rates, infrastructural development and the uptake of non-formal education, embracing the home grown school feeding programme, STEAM education and commercial ventures, said Mr Mhike.\n\nSchools that excelled in these areas were Oakleigh House Trust School and Thekwane High School.\n\nMr Mhike said Thekwane High School has maintained an O-level pass rate above 90 percent and an A-level pass rate consistently above 96 percent, demonstrating its commitment to educational excellence.\n\nMajor infrastructural developments include the construction of modern A-Level hostels, a state-of-the-art science block and the installation of interactive boards and Starlink-powered WiFi.\n\nMr Mhike said the schools efforts have significantly contributed to the development and transformation of the countrys education sector which is in sync with the Heritage-based curriculum which seeks to produce a rounded learner who can tackle 21st century challenges.\n\nOur ultimate goal is to produce knowledgeable, creative, innovative and resilient graduates that can become job creators and contribute to achieving Vision 2030 which is the hallmark for an upper middle-income economy, he said.\n\nMr Mhike said the income-generating projects undertaken by the winning schools align with the Governments call for schools to modernise and commercialise as articulated in the National Development Strategy (NDS1).\n\nBy engaging pupils in these projects, we are fostering financial literacy, entrepreneurship and a sense of responsibility, empowering them to manage and sustain these entities effectively, said Mr Mhike.\n\nHe said the adoption of the school-based projects promotes hands-on learning and encourages creativity and problem-solving skills.-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/sdasdasd.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw EIGHT leading primary and secondary schools in Matabeleland South have received the Ministry of Primary and Secondary Education’s Secretary Merit Awards for championing inclusive education with the Government commending them for equipping pupils with life skills. Dingumuzi Primary School, Filabusi Government Primary School, Colleen Bawn Primary, Oakleigh House Trust School won the […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "Modernisation focus. . .Plant upgrades revamp Bulawayo companies",
            "url": "https://www.chronicle.co.zw/modernisation-focus-plant-upgrades-revamp-bulawayo-companies/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nRETOOLING remains a critical factor in driving industrial growth and local companies are striving to procure new equipment and machinery despite the prevailing financial challenges affecting both industry and the broader economy.\n\nMany companies in Bulawayo continue to rely on outdated, manually operated machines, which limit production capacity, compromise quality and increase the cost of production. This, in turn, reduces their competitiveness in both local and regional markets.\n\nHowever, some leading Bulawayo industries are making concerted efforts to retool and modernise their operations.\n\nDuring a recent tour of Bulawayos industrial sector by the Zanu-PF Economic Development and Empowerment Cluster, companies highlighted their ongoing retooling and refurbishment efforts, although access to funding remains a major challenge.\n\nThe delegation visited key industries, including the National Railways of Zimbabwe (NRZ), General Beltings Holdings, and Ref Air where they were briefed on various challenges affecting the sector. These include an influx of cheap imports, foreign currency shortages for raw materials and machinery procurement and skilled labour shortages due to brain drain.\n\nNRZ\n\nRef Air general manager Ms Karen Mirtle highlighted the companys phased approach to retooling, noting that significant progress had been made in upgrading manufacturing processes.\n\nWe are awaiting the arrival of a press for the final phase of our manufacturing line. Over the past four years, we have invested in new equipment, upgrading and mechanising our decoiling, bending and splitting processes.\n\nThis has increased our production capacity significantly as we can now process materials 20 times faster than before, she said.\n\nMs Mirtle, however, pointed out a major bottleneck in the final phase of production.\n\nThis old press is still manually operated using pulleys, making it slow and inefficient. The coming new press is numerically controlled, with a two-in, two-out system. We have already paid 80 percent of the R2 million cost, she said.\n\nMs Mirtle said the remaining 20 percent was applied for through the auction system at the end of 2023, and the company was allocated the funds.\n\nHowever, due to changes in the monetary policy, the funds were placed into Non-Negotiable Certificates of Deposits (NNCDs), leaving us in a difficult position, she said.\n\nLeading the delegation, Zanu-PF national secretary for business development Cde Elifas Mashaba acknowledged the challenges faced by industries and stressed the need for stronger political commitment to support industrial growth.\n\nThere is great potential for these companies to be revitalised. We are looking at engaging relevant ministries to explore ways to assist. While we are not here to allocate budgets ourselves, we believe our engagement will make a positive impact. So far, we are pleased with the progress, he said.\n\nDuring the tour, companies reported operating at between 40 and 60 percent capacity utilisation, a figure Cde Mashaba said could be improved with adequate support.\n\nGeneral Beltings Holdings Group managing director Mr Joseph Gunda stressed the role of Government policy in facilitating industrial growth. He revealed that his company had successfully refurbished its boiler and press as part of efforts to enhance efficiency and support the broader industry.\n\nThe Zimbabwean conveyor belt market demands about 60000 meters annually. With our refurbished plant, we now have the capacity to produce about 90000 meters, including surplus for export, he said.\n\nMr Gunda noted that these improvements had enhanced product quality, improved customer satisfaction, and significantly reduced production costs, making the company more competitive against international suppliers, including those from South Africa.\n\nOur company can meet all domestic conveyor belt needs. However, there is a need for deliberate policy measures to protect local industries from cheap imports, he added.\n\nGovernment and business community share a strong commitment to restoring Bulawayos status as Zimbabwes industrial hub. Decades of de-industrialisation, primarily attributed to illegal sanctions, led to massive job losses and rising unemployment.\n\nIn response, the Second Republic is prioritising industrialisation and re-industrialisation as part of its broader vision to create employment and transform the country into an upper-middle-income society by 2030.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/asazsx.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com RETOOLING remains a critical factor in driving industrial growth and local companies are striving to procure new equipment and machinery despite the prevailing financial challenges affecting both industry and the broader economy. Many companies in Bulawayo continue to rely on outdated, manually operated machines, which limit production capacity, compromise quality and increase […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "Not retiring yet: Deco ‘My legs can still carry me’",
            "url": "https://www.chronicle.co.zw/not-retiring-yet-deco-my-legs-can-still-carry-me/",
            "content": "Fungai Muderere,[emailprotected]\n\nFOLLOWING his release by Chicken Inn ahead of the start of the 2025, the clubs former captain Danny Deco Phiri believes his legs can still carry him.\n\nPhiri (35), a veteran of many football battles, retraced his steps to Gamecocks last year after one season at Bulawayo Chiefs.\n\nHe joined Amakhosi Amahle after he had parted ways with South Africas Golden Arrows, a club he joined after he was exported by Gamecocks in 2016 and he amassed 97 games for Abafana Besthende across all competitions in his defensive midfield role.\n\nIts true that I am no longer with Chicken Inn and in that regard Im in the process of hunting for a club.\n\nI believe my legs can still carry me. The feeling is that I was supposed to retire but I think I can still play for two more seasons and call it a day. I believe I did not manage myself last season, said ex-Warriors gritty midfielder.\n\nGamecocks gaffer Joey Antipas who has been a great admirer of their championship winning skipper for a long time said: He (Phiri) has had a distinguished career, he played his part in our team. He is a fine player, I think injuries affected him one way or the other.\n\nAt Golden Arrows, Phiri was one of four Zimbabwean players together with Kudakwashe Mahachi, Devine Lunga and Knox Mutizwa.\n\nThe quartet played regularly and prior to his move to Arrows, Phiri was one of the few locally based players to command a regular place in the Warriors Africa Cup of Nations squads. He was a stand-out player for Gamecocks as they marched to their maiden Castle Lager Championship under the guidance of Antipas and Prince Matore.\n\nThe midfielder was subsequently voted Castle Lager Soccer Star of the Year in 2015 after he produced stellar performances alongside Tafadzwa Kutinyu, Clemence Matawu, Lawrence Mhlanga, Thomas Chimenya, Guide Goddard, George Majika, Passmore Bernard and Thabani Goredema among other talented players.\n\nDeco was released by Gamecocks alongside goalkeeper Pride Zendera whose destination for now is not known. The Tshabalala-bred Zendera has been in the clubs goalkeeping department for a long time where he has been deputising Warriors goalkeeper Donovan Bernard.\n\nThere could be a fierce battle for the Chicken Inn number one jersey with the club believed to have already signed former Arenel goalminder Aaron Ngwenya while Prosper Matutu formerly with Highlanders and Bulawayo Chiefs is being assessed.  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/abcde.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw FOLLOWING his release by Chicken Inn ahead of the start of the 2025, the club’s former captain Danny “Deco” Phiri believes his legs can still carry him. Phiri (35), a veteran of many football battles, retraced his steps to Gamecocks last year after one season at Bulawayo Chiefs. He joined Amakhosi Amahle […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "World Bank implores Zimbabwe to maintain tight money supply",
            "url": "https://www.chronicle.co.zw/world-bank-implores-zimbabwe-to-maintain-tight-money-supply/",
            "content": "Michael Tome, Harare Bureau\n\nTHE World Bank says Zimbabwe should maintain its tight monetary policy stance and resist spending pressures to keep the lid on inflation and ensure durable exchange rate stability.\n\nInflation in Zimbabwe tracks the movement in the exchange rate, meaning stability in the domestic currency, which is influenced by the level of money supply in the economy, is one of the most critical factors to maintaining stability.\n\nAccording to the World Bank, there was a significant surge in money supply at the beginning of 2024 but the introduction of ZiG in April last year successfully restored price stability.\n\nThe southern African country, however, faces difficult choices in restraining expenditure given the huge competing interests amid limited financial resources, as the economy recovers from years of battering from Western sanctions, which also closed all access to concessional funding.\n\nZimbabwe Gold\n\nZimbabwe battled bouts of high inflation in the first quarter of 2024, amid significant expenditure on key infrastructure, rekindling fears the country would plunge into hyperinflation similar to what happened in 2008, which wiped out peoples hard-earned savings and pensions.\n\nThe International Monetary Fund (IMF) estimated that inflation reached 500 billion percent during the hyper-inflationary era.\n\nThe country is charting a completely new course, with low inflation and a stable exchange rate, which businesses say if sustained, could support long-term growth and allow greater predictability in the economy.\n\nAccording to economists, quasi-fiscal operations and spending beyond the budget were the major sources of instability that drove prices and exchange rate volatility in the past.\n\nBoth Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube and Reserve Bank of Zimbabwe Governor Dr John Mushayavanhu, have committed to tight fiscal and monetary policies to engender durable stability.\n\nReserve Bank of Zimbabwe Governor John Mushayavanhu\n\nSeveral measures have been instituted to support the fiscal and monetary policy positions, including demanding the payment of certain taxes and import duties in the local currency to create demand.\n\nMaintain RBZs tight monetary policy stance and resist renewed (fiscal) pressures to ensure low inflation and exchange rate stability, said the World Bank in an update on Zimbabwes economy last week.\n\nThe Bretton Woods institutions call comes after another influential multilateral lender, the IMF, said last week that Zimbabwes economy was recovering from the impact of the El Nino-induced drought, which weighed on growth in 2024.\n\nZimbabwes economy, due to the impact of drought, grew by 2 percent last year but is projected to expand by 6 percent this year following favourable rains received across the country.\n\nAgriculture is one of Zimbabwes key sectors, along with mining, tourism and manufacturing.\n\nThe RBZ has committed to sticking to policies that promote price, currency and exchange rate stability by maintaining a tight monetary policy stance with the overarching objective to foster central bank policy consistency and credibility.\n\nThe new RBZ establishment is focusing on maintaining stability, so forget random printing of money; it is now a thing of the past. In this regard we will prudently calibrate the liquidity conditions in the market to curb speculative activities, said RBZ Deputy Governor Dr Innocent Matshe during a panel discussion at a breakfast meeting arranged by the CEO Roundtable on Thursday last week.\n\nHe said the RBZ will continue to carefully navigate the dual objectives of reducing inflation and supporting robust economic growth, acknowledging the inherent trade-off between these two goals.\n\nReserve Bank of Zimbabwe\n\nDr Matshe said to achieve this balance, the central bank will judiciously manage market liquidity to prevent speculative activities and ensure a stable economic environment.\n\nIn September 2024, the Reserve Bank reinforced its tight monetary policy stance by increasing the bank policy rate and statutory reserves to mitigate inflation and exchange rate risks. The central bank policyrate is the rate that is used by the RBZ to implement or signal its monetary policy stance.\n\nThis move successfully alleviated inflationary pressures from October 2024 onwards and as a result, Zimbabwes monthly inflation rate plummeted from 37,2 percent in October 2024 to 3,7 percent in December 2024.\n\nThe decline was primarily driven by exchange rate stability, marked by a significant reduction in parallel market premiums.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Professor-Mthuli-Ncube.jpg",
            "description": "Michael Tome, Harare Bureau THE World Bank says Zimbabwe should maintain its tight monetary policy stance and resist spending pressures to keep the lid on inflation and ensure durable exchange rate stability. Inflation in Zimbabwe tracks the movement in the exchange rate, meaning stability in the domestic currency, which is influenced by the level of […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "South Africa follows Zimbabwe’s path on land expropriation",
            "url": "https://www.chronicle.co.zw/south-africa-follows-zimbabwes-path-on-land-expropriation/",
            "content": "Marshall Ndlela,[emailprotected]\n\nIN a significant turn of events, South Africa has begun to echo the actions of its northern neighbour, Zimbabwe, regarding land expropriation. This decision stems from a long history of colonisation that has shaped the socio-political landscapes of both nations as well as Africa at large.\n\nThe tale of colonisation is steeped in tragedy, beginning in the late 19th century with European powers engaged in what was known as the Scramble for Africa. The British, Germans, Portuguese and Dutch fought for dominance, invading and colonising regions that would become Namibia, Botswana, Angola, Mozambique, South Africa, Malawi and Zimbabwe. Colonisers dispossessed Africans of their land, relegating them to arid, mountainous terrain unsuitable for agriculture while Caucasian settlers flourished on the rich, fertile lands.\n\nThe exploitation did not stop at agricultural displacement. The African continent became a treasure chest for European nations, as heavy exploration led to the mass extraction of gold, diamonds, platinum, oil, and nickel, all exported to Europe and the USA. This extraction often came at a high cost to localpopulations and wildlife, with reckless poaching rampant, causing severe depletion of biodiversity.\n\nThe once-lush landscapes were left in ruins, and livestock populations dwindled as colonial powers prioritised resource extraction over sustainability.\n\nCentral to this history was Cecil John Rhodes and his dream of a railway from Cape to Cairo, which symbolised not only ambition but also the aggressive colonisation that characterised the time.\n\nUnfortunately, this dream paved the way for further exploitation and oppression of the African people, igniting a long fight for freedom, independence, and the repossession of land that was stolen.\n\nThe legacy of colonisation continues to haunt South Africa, particularly through its Dutch-descended population, known as Afrikaners or Boers. Despite being foreigners in African lands, this group has persistently claimed a unique identity, claiming to be true Africans.\n\nThis self-identification has fuelled ongoing tensions and conflicts, particularly against the revolutionary parties that arose in response to apartheid policies.\n\nThe apartheid governments reaction to neighbouring countries supporting anti-apartheid movements was one of violent aggression. South Africa bombed Angola, Zimbabwe, Zambia, Mozambique and Swaziland in attempts to undermine their support for the African National Congress (ANC). It is this very hostility that makes the land expropriation debates so poignant.\n\nZimbabwes bold move to allow land repossession by Black Zimbabweans, which began in the early 2000s, triggered international outrage and an onslaught of sanctions from the West, citing human rights violations. The countrys image and integrity suffered, with globalists perpetuating the narrative that the land reform was chaotic and destructive, despite the rightful aspirations of its citizens.\n\nFast forward to today, South Africa finds itself at a similar crossroads. The masses increasingly demand land retribution, evident in the growing factions within the ANC advocating for land expropriation, as well as the rise of progressive parties like the Economic Freedom Fighters (EFF) and the African Transformation Movement (ATM). In response, the ANC has signed a Land Expropriation Act, following Zimbabwes lead  an action that required nearly 30 years of deliberation.\n\nThe echoes of Zimbabwes land stance have not gone unnoticed. The same white minority farmers fleeing Zimbabwe are now engaging with political influencers like to seek sanctions against South Africa, mirroring the actions of the Movement for Democratic Change (MDC) in Zimbabwe. In South Africa, organisations such as AfriForum, the Democratic Alliance (DA), and other right-leaning groups have rallied to request sanctions, claiming that land reforms threaten their livelihood and rights.\n\nIn a predicted response, the Trump administration issued soft sanctions cutting aid to South Africa, affecting vulnerable populations, particularly those living with HIV/Aids and members of the LGBTQ+ community who depended on USAid support. The irony is palpable: what is happening in South Africa is merely a fraction of the calamity that engulfed Zimbabwe during its land expropriation.\n\nAs history tends to repeat itself, Trump is now offering a refugee plan to white Afrikaners under the pretence of protecting them from what he deems an oppressive environment. This echoes the earlier approaches taken by Britain and Australia, which provided direct citizenship pathways rather than refugee statuses to fleeing Rhodesian farmers.\n\nPresident Donald Trump\n\nIn the grand tapestry of Africas struggle for justice and restitution, South Africas move towards land expropriation marks a pivotal moment that could reshape the continents future. However, as history has taught us, this journey will undoubtedly face its challenges, particularly from those still entrenched in colonial legacies and power dynamics that resist true change.\n\nAs the world watches, one critical question looms: will South Africa learn from Zimbabwes tumultuous journey? Only time will tell. But for now, the quest for rightful land ownership continues unabated.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/zxadsdsds.jpg",
            "description": "Marshall Ndlela, marsh@marshfin.com IN a significant turn of events, South Africa has begun to echo the actions of its northern neighbour, Zimbabwe, regarding land expropriation. This decision stems from a long history of colonisation that has shaped the socio-political landscapes of both nations as well as Africa at large. The tale of colonisation is steeped […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "Ireland level series",
            "url": "https://www.chronicle.co.zw/ireland-level-series/",
            "content": "Brandon Moyo,[emailprotected]\n\nA CAPTAINS knock from Paul Stirling helped Ireland level the three-match One Day International (ODI) series against Zimbabwe following their six wickets win in the second match played at Harare Sports Club yesterday.\n\nThe 34-year-old Ireland skipper played a brilliant fighting innings, scoring 89 runs, setting up his team for victory. It was his 31st half-century in the longer version.\n\nStirling was also part of a record breaking 144-runs second wicket partnership with Curtis Campher.\n\nTheir brilliant partnership is now Irelands highest second wicket stand against Zimbabwe in ODIs.\n\nJust like in the series opener on Friday, Zimbabwe were asked to bat first and were bowled out for 245 runs in 49 overs with Wessly Madhevere and Sikandar Raza scoring half-centuries.\n\nIreland responded well with the bat, chasing down the target in 48.4 overs, finishing on 249/4.\n\nZimbabwe made one change to the team that played in the series opener last Friday. Trevor Gwandu came in for Newman Nyamhuri.\n\nThe Chevrons opening partnership of Brian Bennett  who scored a scintillating ton on Friday  Ben Curran was broken in the seventh over with Mark Adair getting the former caught for 30 runs off 34 balls. At that time, Zimbabwe were on 38/1.\n\nThe second wicket quickly fell as the skipper, Craig Ervine was bowled by Josh Little for four runs off 10 balls. Curran was the third victim, falling for 18 runs after facing 36 balls.\n\nWith Zimbabwe now on 77/3 after the loss of Curran, it was Madhevere and Raza who tried to rebuild the innings with a 74-run partnership for the fourth wicket.\n\nMadhevere was then trapped in front for 61 runs off 70 balls by Campher, bringing in Johnathan Campbell into the middle. It was the 24-year-old Madheveres sixth ODI half-century.\n\nHowever, the new man  Campbell didnt stay long as he was caught behind for just two runs.\n\nTadiwanashe Marumani didnt trouble the Irish batters, falling for a two-ball duck.\n\nRaza, in his 150th ODI for the Chevrons scored 58 runs after facing 75 balls. Wellington Masakadza chipped in with a handy 35 runs off as many deliveries, his new highest score in the longer format.\n\nRichard Ngarava finished unbeaten on 17 runs from 18 balls.\n\nAdair was the pick of the Ireland bowlers, finishing with figures of 4/54 in his 10 overs while Campher picked up three for 13 in five overs. Graham Hume, Little, and Andy McBrine picked up one wicket apiece.\n\nThe Chevrons had a good start with the ball as Blessing Muzarabani struck in the sixth over, getting Andy Balbirnie caught behind for 11 runs off 20 balls.\n\nGwandu would go on to give Zimbabwe the much needed breakthrough later on as he trapped Campher in front for 63 runs off 94 balls. He struck again in his next over, getting Harry Tector caught behind for seven runs off 10 balls.\n\nStirling was caught by Madhevere off a Ngarava delivery after facing 102 balls for his 89 runs. Lorcan Tucker (36) and George Dockrell (20) would go on to see Ireland through with a 49-run fifth wicket partnership.\n\nGwandu finished with figures of 2/50 in nine overs while Muzarabani and Ngarava picked up one scalp apiece for the hosts.\n\nFor his all round performance, Campher was named player of the match.\n\nThe series decider is scheduled for tomorrow at the same venue. The match is set to start at 9.30am.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-31-2.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com A CAPTAIN’S knock from Paul Stirling helped Ireland level the three-match One Day International (ODI) series against Zimbabwe following their six wickets win in the second match played at Harare Sports Club yesterday. The 34-year-old Ireland skipper played a brilliant fighting innings, scoring 89 runs, setting up his team for victory. It […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        },
        {
            "title": "AFC, China bank sign funding deal",
            "url": "https://www.chronicle.co.zw/afc-china-bank-sign-funding-deal/",
            "content": "Business Writer\n\nAFRICA Finance Corporation (AFC), the continents leading infrastructure solutions provider, has signed a memorandum of understanding (MoU) with the Export-Import Bank of China (CEXIM) to deepen collaboration in financing strategic infrastructure and trade projects across Africa.\n\nAFC was established in 2007 as the catalyst for pragmatic infrastructure and industrial investments across Africa.\n\nIts approach combines specialist industry expertise with a focus on financial and technical advisory, project structuring, project development and risk capital to address Africas infrastructure development needs and drive sustainable economic growth.\n\nIn a latest press release, AFC said the latest MoU builds upon an existing relationship between the two institutions, dating back to 2018, and reinforces a shared commitment to accelerating economic development through sustainable investments.\n\nTo date, AFC has secured a total of US$700 million in financing from CEXIM, including a US$300 million facility in 2018 and another US$400 million loan in 2023, it said.\n\nThe renewed partnership will focus on financing trade and investment projects in key sectors such as clean energy, transportation, telecommunications and climate change mitigation, while also facilitating knowledge exchange and collaboration on best practices in project structuring and risk management.\n\nOur partnership with CEXIM strengthens Africas trade and investment ties with China, creating new pathways for infrastructure development and industrial growth, said Samaila Zubairu, president and chief executive officer of AFC.\n\nStrategic collaborations like this are key to accelerating Africas industrialisation and with CEXIMs support, we are unlocking opportunities to build more resilient economies, mobilise capital at scale, and drive long-term prosperity across the continent.\n\nAFC has been steadily expanding its presence in the Chinese financial markets recently securing an AAA domestic credit rating from China Chengxin International Credit Rating Co. Ltd (CCXI) and an AAAspc issuer credit rating from S&P Ratings (China) Co., Ltd.\n\nThese ratings demonstrate AFCs exceptional financial strength, disciplined capital management, and expanding access to diversified funding. AFC also finalised a US$1,16 billion syndicated loan last year, co-led by the Bank of China and the Industrial and Commercial Bank of China (ICBC) London Branch.The collaboration underscores AFC and CEXIMs mutual goal of fostering economic integration and sustainable development across Africa, said the organisation.\n\nThrough this partnership, the two institutions are expected to work together to mobilise funding for high-impact projects, enhance trade finance solutions, and support private sector growth across the continent.\n\nIn the last 17 years, AFC has developed a track record as the partner of choice in Africa for investing and delivering on instrumental, high-quality infrastructure assets that provide essential services in the core infrastructure sectors of power, natural resources, heavy industry, transport, and telecommunications.\n\nAFC has 45 member countries and has invested over US$15 billion in 36 African countries since its inception.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/asdsdxz.jpg",
            "description": "Business Writer AFRICA Finance Corporation (AFC), the continent’s leading infrastructure solutions provider, has signed a memorandum of understanding (MoU) with the Export-Import Bank of China (CEXIM) to deepen collaboration in financing strategic infrastructure and trade projects across Africa. AFC was established in 2007 as the catalyst for pragmatic infrastructure and industrial investments across Africa. Its […]",
            "time": "06:29",
            "date": "17 Feb 2025"
        }
    ]
}