{
    "news": [
        {
            "title": "‘Nothing will derail national development’",
            "url": "https://www.chronicle.co.zw/nothing-will-derail-national-development/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nNo amount of economic chicanery, mudslinging and discord should be allowed to derail the countrys irreversible course to modernisation industrialisation and development, President Mnangagwa has said.In his address at the interment of National Hero Cde Tinaye Chigudu at the National Heroes Acre yesterday, the President said Zimbabwe was marching forward.\n\nThus, the President added, the countrys interests must remain the general citizenrys core focus.In every sector, province by province, let us remain focused, disciplined and work harder towards the attainment of Vision 2030.\n\nNo amount of economic chicanery, mudslinging and discord should be allowed or entertained to derail our irreversible course to modernise, industrialise and develop our country. We are marching forward ever, backwards never.\n\nThe long-enduring spirit of national pride and collective loyalty to the nation remains our cardinal beacon.As citizens of this country, wherever we are and whatever socio-economic activities we may be undertaking, the interests of Zimbabwe must remain at the core of our focus as we build our country brick by brick, stone upon stone. Zimbabwe inyika yechipikirwa, he said.\n\nAs such, President Mnangagwa rallied all Zimbabweans both within the country and those in the diaspora to pull in the same direction as one people, for the achievement of national aspirations.\n\nPresident Mnangagwa\n\nZimbabwe envisages to attain upper-middle-income economic status by 2030.We have this duty, not only for the present generations but the future as well. Together, under our watch, in Government, the private sector and the communities as a whole, moving forward hand in hand; in peace and unity; with one common objective, Zimbabwe shall be a beacon of prosperity which shines brighter and brighter.\n\nTogether, emboldened by our collective unity of purpose, let us modernise, industrialise and develop the Zimbabwe that we are proud of and for the benefit of future generations, he said.\n\nTo this end, the President urged the general citizenry to remain focused as the country marches towards Vision 2030.Much more work is still before us. We cannot tire or lose heart. Let us maintain our focus and discipline to build the Zimbabwe we all want.\n\nNone but ourselves have this weighty obligation. We must, therefore, remain bold and confident in our abilities as a proud, truly independent African people with our national character embedded in a rich liberation heritage.Our sacred national flag is a constant reminder of what we are as a people and our national anthem is our daily prayer to Almighty God as a petition on behalf of our beloved motherland, Zimbabwe, said President Mnangagwa.\n\nAs Zimbabwe continues to progress, the President said it was imperative that Zimbabweans keep on embracing unity, peace, love and tolerance, for those with divergent views.\n\nFor these are the defining features of our countrys national virtues. The late National Hero, Cde Chigudu, demonstrated unquestionable patriotism, loyalty, consistency and persistence.These must always be guiding principles for every Zimbabwean as we undertake our different national responsibilities, he said.\n\nNational Heroes Acre\n\nIn respect of the national hero, President Mnangagwa said Cde Chigudus death had dealt a major blow to the country as he had contributed invaluably before and after the countrys independence. On behalf of the Government, our revolutionary mass Party, Zanu-PF, our Nation, my family and indeed on my own behalf, I wish to once again express my deepest heartfelt condolences to the Chigudu family at the sorrowful loss of their loved one and our dedicated patriot.\n\nOur late National Hero, Cde Chigudu, was among many brave, selfless sons and daughters of the soil who took a stand and fought for our Independence.\n\nHe is honoured as one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZIPRA), the military wing of the Zimbabwe African Peoples Union (Zapu).\n\nHe was deployed as an intelligence operative in the then Salisbury.The President narrated how Cde Chigudu undertook risky and critical mission tasks during the liberation struggle, responsibilities which helped to gather information regarding the modus operandi of the racist Rhodesian forces.This was instrumental in assisting the guerrilla war command element in the planning and execution of special military operations.\n\nAs he continued to pursue his important mission, the late National Hero, Cde Chigudu, was unfortunately captured, detained and imprisoned for 12 years by the Rhodesian settler regime.This could never deter or hamper his bravery and revolutionary spirit, including the desire to see a free and independent Zimbabwe.\n\nUpon his release from prison, he crossed into Zambia, re-united with comrades and resumed his duties as we waged the protracted armed war of liberation, he said.\n\nPresident Mnangagwa then outlined the late national heros contributions post-independence.After the attainment of independence in 1980, the late National Hero, Cde Chigudu, joined the Government as an Assistant Secretary in the Ministry of Transport.\n\nDue to his hard work ethic and dedication to national service, he was promoted to Deputy Secretary in the Ministry of Home Affairs before his elevation to the position of Permanent Secretary in the same Ministry. Cde Chigudu also served as Permanent Secretary in the Ministry of Mines, thereafter as Governor for Manicaland Province.\n\nHe also served as Zanu-PF Chairman for the same Province, always accepting deployment with humility and without a sense of entitlement, he said.\n\nThe President described Cde Chigudu as an unwavering patriot, whose legacy of service must be emulated by current and future generations.\n\nOur departed National Hero, Cde Chigudu was a principled and ideologically rooted cadre who actively participated within the ruling Zanu-PF Party and Government, with unflinching allegiance, loyalty and commitment.\n\nHe was a fountain of wisdom who offered sound counsel and advice in conducting both Party and Government business, drawing from his vast experience and institutional memory.\n\nHe always exuded the virtues of straight-forwardness and frankness in every aspect of life. His integrity, sense of excellence, adherence to truth and honesty left an indelible mark on our body politic, he said.Contributions by such dedicated cadres, he said, should never be forgotten.\n\nLet us never forget that it is through the selfless sacrifices and dedication to duty demonstrated by the late National Hero, Cde Chigudu, and many other departed and living cadres that Zimbabwe continues to enjoy peace, stability, unity and development as an independent, sovereign and democratic state.\n\nI, therefore, call upon all Zimbabweans to remain vigilant as we protect, preserve and consolidate the achievements realised in our beloved motherland, Zimbabwe, said President Mnangagwa.\n\nThe burial was attended by Ministers, Deputy Ministers, Permanent Secretaries, Zanu-PF Politburo and Central Committee members and other senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-42-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau No amount of economic chicanery, mudslinging and discord should be allowed to derail the country’s irreversible course to modernisation industrialisation and development, President Mnangagwa has said. In his address at the interment of National Hero Cde Tinaye Chigudu at the National Heroes’ Acre yesterday, the President said Zimbabwe was marching forward. […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Wetland project transforms villagers’ lives",
            "url": "https://www.chronicle.co.zw/wetland-project-transforms-villagers-lives/",
            "content": "Mashudu Netsianda,[emailprotected]\n\nFOR years, the community of Kasibo in Ward 9 of Hwange District, Matabeleland North Province, struggled to sustain livelihoods due to erratic rainfall and dwindling agricultural productivity worsened by the El-Nino-induced drought.\n\nHowever, the recent adoption of a wetland conservation project has transformed lives, enabling villagers to thrive through horticulture, orchard farming, and beekeeping.\n\nSituated about 30km from Hwange Town near the Deka River, Kasibos 2-hectare wetland had long been underutilised. However, through a community-driven initiative supported by the Government through the Environmental Management Agency (EMA), the Agricultural and Rural Development Advisory Services (Ardas), Hwange Rural District Council, and development partners such as World Food Programme (WFP) and World Vision, the wetland has become a direct source of sustenance and income for 40 households in Ward 9.\n\nThe project has led to the establishment of two weirs, which are critical during drought season. A 2-hectare garden has been created, significantly improving the livelihoods of the local community.\n\nEl-Nino drought\n\nMs Juliet Nyoni, chairperson of the Kasibo Garden, recalled how villagers mobilised to save the wetland from destruction and sought assistance from EMA and its partners.\n\nWith the intervention of EMA, World Vision, and the World Food Programme, the wetland was fenced off, and it slowly started regenerating. The weir then filled with water during the rainy season, and from there, we started farming, she said.Ms Senzeni Ngwenya, a beneficiary, expressed joy at how the project has changed her familys fortunes.\n\nWe used to struggle to put food on the table because our traditional farming methods were failing due to climate change. But now, I grow vegetables year-round and even supply some to local markets and schools. This project has given us financial independence, she said.\n\nThe horticulture project includes growing cabbages, butternuts, sugar beans, tomatoes, onions, and leafy greens. It has provided food security and economic empowerment, particularly for women and youths in the village. The project also features an orchard with citrus fruits, various indigenous fruit trees, mangoes, and guavas.\n\nMs Ngwenya noted that despite the El Nino-induced drought during the 2023-24 farming season, they still managed to produce crops.\n\nMiss Sandra Tshuma, a youth involved in horticulture farming, said the project has not only provided employment but has also equipped them with valuable agricultural skills.\n\nWe never thought we could make a living out of wetlands, but after receiving training on wetland conservation and sustainable farming, we are now making money from selling our produce. This wetland has given us hope for the future, he said.Right now, we have just harvested butternuts, which we are already taking to the market. We are now able to pay school fees and buy food and clothes through this project, and we are grateful to the Government and all its partners.Ms Clara Sigauda (64), a widow, said the wetland project has transformed her life since it was launched a few years ago.\n\nI am one of the founding members of this wetland project, which we started in 2017 through the assistance of the Government and its partners. We are a group of 40 farmers, comprising 31 women and nine men, she said.\n\nMs Sithabile Ncube, a mother of four, said: This project has helped me raise money to pay school fees. Two of my children are in secondary school and because of this project, I no longer struggle to raise their fees.\n\nMs Teckar Nzombe said the proceeds from the gardening projects help her foot her medical bills and transport to hospital.Another major component of the project is beekeeping, which has become a lucrative venture for many villagers. The community produces honey that is sold locally.\n\nMr Bernard Ndlovu, one of the bee-keepers, said the project has changed his life.We used to rely on unpredictable rains, but now I earn a stable income from selling honey. This has helped me pay school fees for my children and take care of other household needs, he said.\n\nChief Whange said the wetland project is not only an economic lifeline but also a conservation effort.We have been taught the importance of protecting wetlands. Unlike before when people would degrade the area through unsustainable practices, we now understand that wetlands play a critical role in water conservation and biodiversity, he said.\n\nWith more households joining, the community is well on its way to becoming a hub of sustainable agriculture and conservation. What was once an overlooked wetland has now become the backbone of Kasibos self-reliance.Chief Whange said the wetland was discovered by locals in 1965.\n\nEnvironmental Management Agency (EMA)\n\nEnvironmental Management Agency (EMA)s environmental management services director, Mr Steady Kangata said such initiatives align with national food security goals and the United Nations (UN) Sustainable Development Goals.This is a model project that other communities should emulate. It not only empowers villagers economically but also contributes to the preservation of wetlands, which are important because of the ecological goods and services that the soil provides, he said.\n\nIn the event of climatic shock or drought, wetlands help in water provision. Due to their spongy-like characteristics, wetlands help control floods, and they are a good source of food in terms of floral and faunal species.Mr Katanga commended the community for taking an active role in sustainable development\n\nAs EMA, we collaborated with other stakeholders and the local community to protect the Kasibo integrated wetland project, which is now benefiting local communities. It is of immense environmental value encompassing a wide variety of habitats that support a diverse flora and fauna, he said.\n\nIn addition to the environmental strategies, the community has drawn indigenous knowledge systems to protect and sustain the wetland.\n\nThe wetland is playing a vital role in addressing some of the SDGs which include zero hunger, accessibility to clean water, and rural development.The Kasibo integrated wetland project is part of the African Green Stimulus Programme (AGSP), an innovative Africa Union-\n\nled initiative to support the continents longer-term sustainable development objectives.The AGSP was adopted by African Environment Ministers at the 8th Special Session of the African Ministerial Conference on the Environment (AMCEN) in December 2020 and by African Heads of State at the 35th Ordinary Session of the Assembly of the African Union in February 2022.\n\nZimbabwe has been making strides in wetland preservation through legislative frameworks such as the Environmental Management Act, which protects wetlands from degradation. Various measures that the Government has implemented to enhance wetland conservation include increasing the area under sustainable wetland management in alignment with the National Development Strategy 1 (NDS1), the Wetland Rehabilitation Rolling Plan (2021-2025), and the National Biodiversity Strategy and Action Plan (NBSAP),\n\nThe National Wetlands Policy and the Environmental Management Act (Chapter 20:27) serve as key legal frameworks guiding wetland protection efforts. @mashnets\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-40.jpg",
            "description": "Mashudu Netsianda, mashudu.netsianda@chronicle.co.zw FOR years, the community of Kasibo in Ward 9 of Hwange District, Matabeleland North Province, struggled to sustain livelihoods due to erratic rainfall and dwindling agricultural productivity worsened by the El-Nino-induced drought. However, the recent adoption of a wetland conservation project has transformed lives, enabling villagers to thrive through horticulture, orchard farming, […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "After 59 years, man gets identity documents",
            "url": "https://www.chronicle.co.zw/after-59-years-man-gets-identity-documents/",
            "content": "Ashley Phiri,[emailprotected]\n\nFOR the first time in almost six decades, Mr Innocent Nyoni of Robert Sinyoka Village on the outskirts of Bulawayo can proudly call himself a citizen in every sense of the word.\n\nThe 59-year-old man, who spent his entire life without identity documents, was finally issued a birth certificate and national identity card, an emotional moment that brought him to tears.\n\nBorn in Plumtree in 1965, Mr Nyoni had spent his life as a man without an official identity. Without documentation, he was unable to access essential services such as formal education, employment, banking, and healthcare. For decades, he felt like a ghost in his own country.\n\nHis troubles began at birth when his parents, who were not legally married, failed to register his birth. When his father passed away while he was still young, his chances of acquiring documentation diminished further.He spent his early years doing menial jobs in Plumtree before later moving to Bulawayo in search of opportunities. But without an identity card, life in the city was an uphill struggle.\n\nI watched my peers go to school while I stayed at home. I couldnt even write properly, let alone my own name. As I grew older, I couldnt find formal work. Employers would turn me away, asking for an ID I never had, Mr Nyoni recalled.\n\nEven if I secured the menial jobs, my employers would exploit me. I worked for 15 years as a gardener for a family in Burnside, and sometimes I would go for months without being paid.\n\nFor years, he relied on menial jobs, working as a gardener and performing odd tasks to survive. The humiliation of being treated as a foreigner in his own country weighed heavily on him. He could not open a bank account, or travel freely.\n\nHope finally came through last Tuesday when among a group of undocumented people who benefited from the ongoing mobile registration blitz. The Civil Registry Department is running a mobile registration exercise to assist those without documents, mostly targeting vulnerable children and child-headed families in St Peters, Robert Sinyoka, and Methodist Village in Ward 17, on the outskirts of Bulawayo.\n\nThe 10-day exercise, which ends tomorrow, is in response to appeals made by residents during last years hearings conducted by the Parliamentary Portfolio Committee on Defence, Home Affairs, Security Services and War Veterans Affairs. The hearings revealed that many residents in peri-urban areas lacked essential documentation, which hindered their access to education, healthcare and other social services.\n\nMany people, especially in rural areas, still struggle with documentation issues due to various circumstances, including lack of birth records and complex bureaucratic processes.\n\nMpilo Central Hospital\n\nWorking closely with the Pumula legislator, Ms Sichelesile Mahlangu, Mr Nyoni was assisted in tracking down his mothers records at Mpilo Central Hospital to verify his citizenship. After months of waiting, he was finally handed his birth certificate and national identity card.\n\nThe moment he received his ID card was overwhelming. Tears welled up in his eyes as he clutched the small plastic card, proof that he finally existed in the eyes of the state.\n\nThis is the happiest day of my life. I never thought I would live to see this day. Now, I can be someone. I can vote, I can travel, and most importantly, I can live without fear, he said.\n\nFor years, Mr Nyoni attempted to obtain his ID and birth certificate, only to be met with obstacles at every turn, even becoming a victim of scammers posing as registry officials.\n\nMy parents were not educated and they did not see the importance of getting me a birth certificate until the untimely death of my father. I had been going to the registry office for years, submitting fingerprints but my efforts were not yielding any fruits, he said.\n\nI remember at one time, I was scammed by people pretending to be from the civil registry department and I lost R 600 because I was very desperate to be documented.\n\nMr Nyoni, a father of five, said his woes cascaded to his children until he was forced to use his wifes documents to acquire documents for them\n\nI have five children, two from a previous marriage and three from my current one. All my children bear the surnames of their mothers because they needed birth certificates to be able to go to school, he said.\n\nCulturally it is not right for them to use their mothers surnames and it is something that has been bothering me for a long time. The children have also been bothering me to right this wrong because they believe it was giving them bad luck.Mr Nyoni is now eager to start a new chapter in his life. He hopes to apply for formal employment and even open a bank account, things that were previously impossible for him.\n\nI am 59, but I feel like I have just been born today. Now I can also sign up for various programmes that Government and non-governmental organisations roll out to assist people in our area, he said with a smile.Human rights lawyer Mr Nqobani Sithole emphasised the importance of streamlining the registration process to prevent cases like Mr Nyonis.\n\nIt is a fundamental human right to have identity documents. The state has an obligation to ensure that every citizen, regardless of their background, can access these essential records without facing unnecessary obstacles, he said.\n\nWe need policies that make it easier for people to obtain documents rather than living in statelessness for decades. Section 35 (3) states that every citizen has a right to have birth certificates and other identity documents issued by the State.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-14.jpg",
            "description": "Ashley Phiri, ashleyphiri66@gmail.com FOR the first time in almost six decades, Mr Innocent Nyoni of Robert Sinyoka Village on the outskirts of Bulawayo can proudly call himself a citizen in every sense of the word. The 59-year-old man, who spent his entire life without identity documents, was finally issued a birth certificate and national identity […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zimbabwe fail to capitalise on strong position",
            "url": "https://www.chronicle.co.zw/zimbabwe-fail-to-capitalise-on-strong-position/",
            "content": "Brandon Moyo,[emailprotected]\n\nZIMBABWES poor run in international cricket continued as they suffered a humbling 63-run loss at the hands of Ireland in a one-off Test match at Queens Sports Club yesterday.\n\nThere is no justification for the defeat, as the Chevrons lost to an Ireland team that hadnt played competitive cricket for four months and were in their off-season.\n\nZimbabwe put in a dismal show, particularly with the bat. After Ireland won the toss and elected to bat first, they were bowled out for 260 in 56.4 overs, courtesy of a stunning seven-wicket haul from Blessing Muzarabani. The Chevrons managed to take a slender seven-run lead in response, crumbling to 267 all out. Nick Welch stood out with the bat for Zimbabwe, scoring 90 runs on debut, while Muzarabani chipped in with a valuable 47.\n\nIn their second innings, Ireland responded with 298 all out, setting Zimbabwe a target of 292 runs to win. The Chevrons, however, faltered once again, being bowled out for 228 runs despite a gallant effort from Wessly Madhevere.\n\nSpeaking after the conclusion of the match, Zimbabwe head coach Justin Sammons expressed his frustration at his teams inability to capitalise on strong positions.\n\nIts a bit of a trend at the moment. We find ourselves in strong positions, but when we are on top, we are not being ruthless enough. We seem to fight when the chips are against us, but we let games slip away when we should be taking control. Its a combination of the mental side of things, technique, and execution of key skills in crucial moments, said Sammons.\n\nReflecting on Zimbabwes performance, Sammons acknowledged the teams lack of discipline in key moments.\n\nHaving them six down for 80 on day one, we knew we had to be ruthless, but we let them off the hook with poor, ill-disciplined bowling from the back-up seamers. That allowed them to get away from us.\n\nWe could have restricted them to a lower score with better discipline. And in our first innings, we needed to put up a big total given the conditions. The conditions were good for batting, and essentially, thats where we dropped the ball. We should have had at least a 100-run lead going into day three.\n\nThe Chevrons entered the final day yesterday with three wickets in hand, needing 109 runs to win.\n\nMadhevere was the only recognised batter remaining in the middle, making victory a tall order.\n\nHistorically, only one Test team had ever successfully chased over 100 runs with just three wickets in hand on the final dayPakistan against Australia in Karachi in 1994, where they won by one wicket.\n\nIf youre seven down going into day five needing over 100, its always going to be a challenge. Things need to go right. Kudos to Wessly for staying in, but if Newman had put in 30 with him, and then Richard came in with another 30, suddenly were closer to the target.\n\nBut we were essentially asking the tail to do what the top order should have done. Its not the tails responsibilityits the top orders job to get the majority of the runs, Sammons added.\n\nZimbabwe began day five on 183/7 with Madhevere batting alongside Nyamhuri, who survived a run-out scare in the first over of the day. However, Nyamhuri didnt last long, falling for eight runs to Matthew Humphreys.\n\nThe match was all but sealed when Humphreys bowled Madhevere for a valiant 84 off 195 deliveries.\n\nAndy McBrine then wrapped up the game for Ireland, dismissing Richard Ngarava for 14 runs.\n\nMadheveres 84 now stands as the highest score by a Zimbabwean batting at number six in a Test chase, surpassing the previous record of 53 set by Craig Ervine against Afghanistan in January.\n\nCraig Ervine\n\nBrian Bennett fell five runs short of a half-century, scoring 45 off 72 balls, while skipper Johnathan Campbell managed 33 off 62 deliveries.\n\nHumphreys finished with remarkable figures of 6/57 in 28 overshis best in Test cricket and the best by an Irish bowler in the format. Barry McCarthy claimed two wickets, while Mark Adair and McBrine took one apiece.\n\nMcBrine was named Player of the Match for his all-round contributions with both bat and ball.\n\nThis victory marked Irelands third consecutive Test win, making them only the second team in history to achieve that feat, after South Africa.\n\nZimbabwe will have little time to recover, as they return to action on Friday for the first One Day International (ODI) against Ireland at Harare Sports Club.  @brandon_malvin.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vsfdvbsgfb.jpg",
            "description": "Brandon Moyo, brandonmalvin@gmail.com ZIMBABWE’S poor run in international cricket continued as they suffered a humbling 63-run loss at the hands of Ireland in a one-off Test match at Queens Sports Club yesterday. There is no justification for the defeat, as the Chevrons lost to an Ireland team that hadn’t played competitive cricket for four months […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "RBZ commends banking sector’s progress in sustainable finance",
            "url": "https://www.chronicle.co.zw/rbz-commends-banking-sectors-progress-in-sustainable-finance/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nThe Reserve Bank of Zimbabwe (RBZ) has lauded the financial sector for making significant strides in adopting sustainable banking practices amid increasing climate-related risks such as droughts, floods, wildfires, and heatwaves.\n\nWith the growing urgency to mitigate climate change, the central bank stressed the need for financial institutions to effectively manage financial risks while actively promoting sustainability.\n\nIn its latest 2025 Monetary Policy Statement, the RBZ highlighted that a survey conducted in December 2024 assessed how banks are integrating sustainability into their business strategies, governance frameworks, and internal control systems.\n\nThe survey revealed that 56 per cent of banking institutions have successfully incorporated sustainability into their business models, with board members possessing relevant expertise in sustainability, climate risk, or Environmental, Social, and Governance (ESG) issues.\n\nReserve Bank of Zimbabwe (RBZ)\n\nFurthermore, 32 per cent of banking institutions reported having board-approved sustainable finance policies or frameworks, while others have incorporated sustainability matters into their existing policies.\n\nAs of 31 December 2024, 15 out of 19 banking institutions, along with two development finance institutions and one deposit-taking microfinance institution, were undergoing the Sustainability Standards Certification Initiative (SSCI) programme. The initiative, spearheaded by the European Organisation for Sustainable Development (EOSD), aims to align banking operations with international sustainability benchmarks.\n\nAs at 31 December 2024, 15 out of 19 banking institutions, two development finance institutions and one deposit-taking microfinance institution were undergoing the Sustainability Standards Certification Initiative (SSCI) programme being spearheaded by the European Organisation for Sustainable Development (EOSD), said the RBZ.\n\nThe central bank reaffirmed its commitment to working closely with financial institutions to establish a robust, resilient, and inclusive financial system that significantly contributes to sustainable economic development.\n\nThe RBZ also mandated all banking institutions to nominate suitably qualified or experienced Board Sustainability Champions and report their selections to the RBZ by 31 March, as part of efforts to enhance governance effectiveness in sustainability.\n\nIn line with the Climate Risk Management Guideline 01-2023/BSD, banking institutions are required to submit their institutional climate risk profiles for 31 December 2024 by 31 March 2025. These reports must clearly outline sectoral and portfolio exposures to climate risks, said the RBZ.\n\nThe move to integrate sustainability in the financial sector aligns with the United Nations Sustainable Development Goals (SDGs) and supports Zimbabwes commitments under the Paris Agreement on climate change, signed in 2016.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/asxdgf.jpg",
            "description": "Nokuthaba Brita Ncube, mncubenokuthababrita@gmail.com The Reserve Bank of Zimbabwe (RBZ) has lauded the financial sector for making significant strides in adopting sustainable banking practices amid increasing climate-related risks such as droughts, floods, wildfires, and heatwaves. With the growing urgency to mitigate climate change, the central bank stressed the need for financial institutions to effectively manage […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "School feeding scheme boosts attendance and nutrition urban, rural areas",
            "url": "https://www.chronicle.co.zw/school-feeding-scheme-boosts-attendance-and-nutrition-urban-rural-areas/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nGOVERNMENTS school feeding programme, now extended to both primary and secondary learners in rural and urban areas, has considerably boosted school attendance while improving nutrition among pupils.\n\nThis initiative aligns with the Governments larger efforts to strengthen the education sector and address food insecurity.One of the schools that has experienced a notable increase in attendance is Ntalale Secondary School in Gwanda District, Matabeleland South.\n\nPreviously, the schools attendance had dropped to below 70 percent, with many learners struggling to walk long distances, some as far as 17km on empty stomachs. Since the introduction of the feeding programme last year, attendance has risen to over 90 percent, reflecting the programmes impact.\n\nThe school feeding programme has been a crucial intervention, particularly for learners affected by the El Nino-induced drought. The Zimbabwe Livelihoods Assessment Committee (ZimLAC) 2024 report highlighted an urgent need for food aid and nutrition support, reinforcing the necessity of this initiative. By providing at least one hot meal daily, the programme has alleviated hunger and enhanced educational outcomes.\n\nSchool feeding programme\n\nUnder the programme, Government supplies grain, while parents mobilise funds to purchase relish. This collaborative approach has ensured that children receive nutritious meals, which in turn has led to improved concentration, academic performance, and overall well-being.\n\nNtalale Secondary School Development Committee chairperson, Ms Agnes Mathe, commended the programme, noting that both attendance and student morale have greatly improved.\n\nWe have seen a tremendous difference since the introduction of the school feeding programme. Learners are now attending school more regularly, and their nutritional status has improved. Before the programme, attendance had dropped below 70 percent, but now it exceeds 90 percent, she said.\n\nMs Mathe said many students had lost interest in attending school due to hunger, especially those who had to walk long distances. With food now available at school, learners are more motivated, and teachers anticipate better academic results this year.\n\nA parent, Ms Vanessa Moyo, echoed similar sentiments, saying the programme has come at a crucial time when families are still grappling with the effects of the drought.\n\nIt was difficult to send children to school when they had nothing to eat, especially considering the long distances they had to walk. The feeding programme has brought much-needed relief, not just to the learners but also to us as parents, she said.We are fully supportive of the initiative and contribute R50 each term to buy relish.\n\nMinistry of Primary and Secondary Education spokesperson, Mr Taungana Ndoro, acknowledged the programmes positive impact. He said Government is committed to sustaining and expanding it.\n\nThe Ministry has conducted assessments to evaluate the impact of the school feeding programme. The results have been encouraging, showing a direct correlation between meal provision and improved school attendance, particularly in rural areas.Learners who receive regular meals are more focused, engaged, and perform better academically, he said.\n\nCurrently, the programme is being implemented in all P3/S3 and P2 schools nationwide, targeting primary and secondary schools, especially in rural areas where food insecurity is prevalent. Some urban schools have also adopted the initiative, ensuring that children from disadvantaged backgrounds benefit.\n\nMr Ndoro noted that schools participating in the programme have recorded increased attendance rates, as students prioritise attending school to receive meals.\n\nHe said the initiative has fostered stronger community involvement, with parents playing an active role in their childrens nutrition and education.\n\nThe Ministry remains committed to expanding this initiative to ensure that no child goes hungry while pursuing their education. We are continuously monitoring and evaluating the programme to make necessary adjustments and enhance its effectiveness, said Mr Ndoro.  DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Mr-Taungana-Ndoro.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw GOVERNMENT’S school feeding programme, now extended to both primary and secondary learners in rural and urban areas, has considerably boosted school attendance while improving nutrition among pupils. This initiative aligns with the Government’s larger efforts to strengthen the education sector and address food insecurity. One of the schools that has experienced a […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Economist calls for  local currency demand boost",
            "url": "https://www.chronicle.co.zw/economist-calls-for-local-currency-demand-boost/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nAn economist has called on the Government to implement additional measures to drive the demand for Zimbabwe Gold (ZWG), saying that this will reinforce the prevailing economic stability.\n\nThis follows a series of bold policy measures announced by Reserve Bank of Zimbabwe (RBZ) Governor Dr John Mushayavanhu in the 2025 Monetary Policy Statement, aimed at maintaining economic stability.\n\nIn his article titled A Look into 2025 Monetary Measures, Mr Persistence Gwanyanya underscored the need to strengthen ZWGs convertibility and store-of-value attributes to sustain stability.\n\nMr Persistence Gwanyanya\n\nHe said the structured nature of the local currency, fully backed by foreign reserves in the form of foreign currency and precious minerals, enhances its credibility and convertibility.\n\nAt ZWG14,3 billion (US$550 million), foreign reserves provide more than three times the cover for the ZWG reserve money of ZWG3.5 billion as of 31 January 2025.\n\nMr Gwanyanya noted that foreign reserves have surpassed the total ZWG money supply in the economy, which provides added confidence in ZWG convertibility.\n\nAs ZWG delivers on convertibility for foreign payments, market confidence will further boost its appropriateness for value preservation.\n\nHowever, in the absence of robust demand for ZWG, this alone is not enough to usher in permanent stability, which is key to restoring ZWGs store-of-value function, said Mr Gwanyanya.\n\nTo address this, he commended the Government for taking steps to drive ZWG demand, citing the introduction of income tax (QPDs) payments in a 50:50 ZWG/US dollar proportion in the last quarter of 2024 as a key policy shift.\n\nWe expect the implementation of more measures to drive ZWG demand as the year progresses, he said.\n\nZimbabwe Gold\n\nWhile the demand for ZWG is important, Mr Gwanyanya said the supply of foreign exchange is equally vital for sustained stability.\n\nHe pointed out that Zimbabwes economy is structurally imbalanced, with foreign exchange holdings concentrated among a few large corporates and individuals. In this context, the recent reduction of foreign currency retention from exports  from 75 per cent to 70 percent  is in line with the countrys de-dollarisation roadmap.\n\nReflecting the need to cushion exporters from possible exchange rate depreciation, the RBZ has provided an option for this constituency to invest the increased portion of five per cent in the USD-denominated deposit facility (USDDDF), which will be reassessed as needed and at the prevailing exchange rate, said Mr Gwanyanya.\n\nHe said this is an improvement from investing the same in Treasury Bills (TBs), which expose exporters to exchange rate risk.\n\nWhile foreign exchange inflows have been increasing since 2019, with healthy balance of payments (BOP) positions recorded over the period, the trade deficit has remained significantly high, which could also explain the motivation to reduce the export retention ratio, said Mr Gwanyanya.\n\nLast week, the RBZ directed banks to increase interest rates on savings and time deposits while scrapping all charges for transactions valued at US$5 and below (or the ZWG equivalent).\n\nMr Gwanyanya believes these measures will encourage the wider use of the local currency and enhance confidence in the financial system.\n\nHe said the upward revision of deposit rates for both ZiG and US dollar savings and time deposits, along with the removal of transaction charges for small payments, is expected to improve public confidence in the banking sector and the ZWG.  @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/fghfty.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com An economist has called on the Government to implement additional measures to drive the demand for Zimbabwe Gold (ZWG), saying that this will reinforce the prevailing economic stability. This follows a series of bold policy measures announced by Reserve Bank of Zimbabwe (RBZ) Governor Dr John Mushayavanhu in the 2025 Monetary Policy […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Matopo university to enrol first students in August",
            "url": "https://www.chronicle.co.zw/matopo-university-to-enrol-first-students-in-august/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE University of Matopo is set to enrol its first cohort of students in August, operating from three campuses located at Brethren in Christ Church (BICC)-run boarding school premises in Matabeleland South.\n\nThe university will specialise in dryland studies, addressing climate change and ecological challenges affecting the region, while also offering mining-related studies due to its strategic location in the gold-rich Insiza District.The institutions three campuses will be situated in Matopo (Matobo District), Mtshabezi (Gwanda District), and Wanezi (Insiza District) Missions.\n\nThese sites, which already host boarding schools run by BICC, will be repurposed to accommodate university students.The Zimbabwe Council of Higher Education (ZIMCHE) provisionally approved the establishment of the University of Matopo last month, granting it 12 months to meet licensing requirements before being awarded a full operational licence.\n\nThe university project was conceptualised in 2000 but faced financial hurdles that delayed its launch for 24 years. However, its board is now confident that the prevailing economic environment is conducive to its successful roll-out.University of Matopo Trust chairman, Professor Henry Sibanda, said despite the 12-month provisional period, the institution is determined to commence operations in August. The university will prioritise the development of teaching and learning infrastructure.\n\nThey have given us permission to commence operations while we continue to develop our physical infrastructure. We will start with the facilities we already have, including our Bible Institute at Mtshabezi Mission, which we are renovating, said Prof Sibanda.\n\nWe are going to have three campuses located in Matabeleland South, one in Matopo, another in Mtshabezi and the third one will be in Wanezi.\n\nMtshabezi Mission Bible College administration block which will serve as the Matopo University admin block\n\nProf Sibanda said Mtshabezi will house the Faculty of Education, while Matopo will be the centre for the Faculty of Science, Faculty of Commerce, Faculty of Law and graduate studies.Wanezi campus will house the Faculty of Agriculture and Faculty of Mining.\n\nProf Sibanda emphasised that although the university will have niche areas of study, its qualifications will meet national higher education standards.\n\nZIMCHE has developed a minimum body of knowledge to ensure uniformity across institutions. This means a degree in computer science from the University of Matopo will be equivalent to one from the University of Zimbabwe or Midlands State University, he explained.\n\nZIMCHE regulates 80 percent of all degree programmes across the country to maintain standardised academic excellence, ensuring graduates are competitive in the job market.\n\nBICC has played a pivotal role in establishing the university, with church members actively contributing funds for its development. An endowment fund has been set up to finance the universitys expansion while leveraging commercial ventures based on existing resources.\n\nProf Sibanda said they have submitted a strategic financial plan to ZIMCHE, outlining both short-term and long-term sustainability strategies. He said their long-term approach involves endowments, with any extra funds generated being reinvested into the endowment fund.\n\nIn addition to agro-based activities at Matopo and Mtshabezi, the university has applied for a mining claim in Insiza District to capitalise on the regions mineral wealth.\n\nThere is already mining happening on our land, and we realised that instead of others benefiting, we should also secure claims for the university. We have officially paid for one mining claim, and while we educate, we will also mine. This presents an opportunity to generate revenue and support the universitys financial needs, said Prof Sibanda.\n\nHe further highlighted the significance of the ongoing development of Old Gwanda Road, which passes through the universitys Matopo and Mtshabezi campuses, saying it will be a major boost for the university.\n\nWe will benefit from the construction of the Old Gwanda Road. It will improve connectivity between the campuses and attract more traffic to the area, benefiting both students and staff, said Prof Sibanda. He said the university will be modelled around Chinhoyi State University.\n\nThe University of Matopos launch marks a significant milestone in expanding higher education opportunities in Matabeleland South, particularly in specialised fields aligned with the regions economic and environmental challenges. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-6.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE University of Matopo is set to enrol its first cohort of students in August, operating from three campuses located at Brethren in Christ Church (BICC)-run boarding school premises in Matabeleland South. The university will specialise in dryland studies, addressing climate change and ecological challenges affecting the region, while also offering mining-related […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Kirsty Coventry wants transgender athletes banned",
            "url": "https://www.chronicle.co.zw/kirsty-coventry-wants-transgender-athletes-banned/",
            "content": "ONE of the candidates to lead the International Olympic Committee Kirsty Coventry has backed a blanket prohibition for so-called transgender athletes participating in events against members of the opposite sex, which is brutal news for any of them seeking to follow such a course in their quest to clinch the gold.\n\nCoventry, Zimbabwes decorated former Olympian and a member of the IOC executive board since 2018, is currently running to be the next president of the entity. She favours a blanket ban on transgenderism at the Olympics, according to a report from UKs The Telegraph.\n\nProtecting the female category and female sports is paramount  its a priority that we collectively come together, Coventry said.\n\nThere is more and more scientific research. We are not having a conversation about how it is detrimental to mens sport. That, in itself, says we need to protect womens sport, she continued.\n\nCoventry, who has won seven Olympic medals in swimming, including two gold medals, also claimed, It is very clear that transgender women are more able in the female category and can take away opportunities that should be equal for women. Coventry has witnessed first-hand the disaster that can emerge from allowing men to compete against women, particularly in sports with more physical contact.\n\nShe helped to preside over the Paris Olympics, where boxing athletes Lin Yuting and Imane Khelif won gold, even though they had previously been deemed ineligible for boxing against women by the International Boxing Association. Coventry said that lessons are always going to be learnt  Paris is definitely one of those times.\n\nMinister of Sport, Kirsty Coventry\n\nI dont believe that this is something in hindsight that we could have predicted because these boxers had bouts against each other, and there hadnt been previous issues, she said.\n\nWhen you have such a sensitive issue being put on the global stage you have to make sure that the athletes are being protected  that their rights are being heard  and that they are being protected on both sides, Coventry added. Though she may not be a conservative stalwart on this issue, at least she is willing to have a ban. And the next location of the summer Olympics may not hurt her chances.\n\nLos Angeles will welcome athletes for the summer games in 2028, and President Donald Trump, who broadly opposes men in womens sports, will still be the commander-in-chief.\n\nWhether or not the Olympics decides to go the way of common sense and basic biology, there is clearly some movement toward rationality on these matters here in the United States.\n\nHopefully the Olympics comes to its senses, as well.  westernjournal.com/Sports Reporter.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vgfvbsadgb.jpg",
            "description": "ONE of the candidates to lead the International Olympic Committee Kirsty Coventry has backed a blanket prohibition for so-called transgender athletes participating in events against members of the opposite sex, which is brutal news for any of them seeking to follow such a course in their quest to clinch the gold. Coventry, Zimbabwe’s decorated former […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zvishavane Town Council improves its water supply",
            "url": "https://www.chronicle.co.zw/zvishavane-town-council-improves-its-water-supply/",
            "content": "Patrick Chitumba,[emailprotected]\n\nZVISHAVANE Town Council has made great strides in improving the towns water supply, utilising over US$800 000 in devolution funds to upgrade the Ngezi Water Treatment Plant.\n\nThe upgrade has expanded the plants capacity, ensuring residents have access to clean and safe drinking water.The devolution and decentralisation agenda is a key pillar of the National Development Strategy 1 (NDS1), aimed at promoting economic growth and development through a community-based and people-centered approach.\n\nThis initiative aligns with the national vision of achieving an empowered and prosperous upper-middle-income society by 2030, by supporting high-impact community development project.\n\nSpeaking during a Midlands Provincial media tour, Zvishavane town engineer Munyaradzi Mageja said the council has been utilising devolution funds since 2019. Initial efforts focused on rehabilitating filters at the water treatment plant and acquiring essential equipment.\n\nWe are in the second cycle of filter rehabilitation to maintain water quality and increase raw water uptake. However, raw water turbidity remains high, reaching around 500 units due to rainfall and activities by artisanal miners in our weir, he said.Despite these challenges, Eng Mageja said the council has considerably improved water quality, with no major setbacks since 2019. Last year, the local authority installed a new pump, increasing the towns pumping capacity from an average of 16 megalitres per day to approximately 23-24 megalitres.\n\nOur next phase is expansion, starting with increasing raw water intake, followed by improvements in sedimentation and filtration, he said.\n\nNational Development Strategy 1 (NDS1)\n\nEng Mageja said there is the need to enhance high-lift pumping capacity to the ground reservoir and improve the pipeline delivering water to the town.\n\nWe are implementing this in phases. The first step, increasing raw water intake, has been completed. The next stage is expanding treatment capacity, followed by improving the delivery system to town, he explained.On the issue of power supply, Eng Mageja mentioned that the treatment plant benefits from a stable power line that is rarely affected by load shedding.\n\nHowever, the council is exploring alternative energy sources and is in discussions with a Chinese company constructing a solar farm in the area to power the plant using solar energy. A previous plan to secure a dedicated power line from Mimosa Mine was abandoned due to high costs, with consultants estimating the project at US$500 000.\n\nAt the moment, the treatment plant operates with four high-lift and five low-lift pumps. However, about 19 percent of treated water is lost before reaching residents due to vandalism along the 18-kilometre pipeline supplying the town.Zvishavane acting town secretary, Mr Max Mugandani, cited illegal activities by artisanal miners as a major challenge, as they use water from sources that feed into the river, negatively affecting water quality.\n\nVandalism is also a major concern, with people tampering with valves along the pipeline to divert water for personal use, particularly for their cattle, he said.\n\nMr Mugandani also revealed that the council spends heavily on water treatment, using seven tonnes of aluminum sulphate per week, a costly necessity to maintain water quality. Due to pumping deficits, the council operates daily to meet residents water demands.\n\nLocal residents have welcomed the improvements, with Mr Themba Banda from Council Park suburb commending the local authority for its consistent water supply.These upgrades have made a real difference. We now have a more reliable water supply, which is essential for our daily lives, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Water-treatment-plant.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw ZVISHAVANE Town Council has made great strides in improving the town’s water supply, utilising over US$800 000 in devolution funds to upgrade the Ngezi Water Treatment Plant. The upgrade has expanded the plant’s capacity, ensuring residents have access to clean and safe drinking water. The devolution and decentralisation agenda is a key […]",
            "time": "08:34",
            "date": "11 Feb 2025"
        }
    ]
}