{
    "news": [
        {
            "title": "UPDATE: Newly elected Zifa president Nqobile Magwizi’s plan to honour football legends",
            "url": "https://www.chronicle.co.zw/update-newly-elected-zifa-president-nqobile-magwizis-plan-to-honour-football-legends/",
            "content": "Innocent Kurira,[emailprotected]\n\nNQOBILE Magwizi, who was elected as the Zimbabwe Football Associations (Zifa) president has a vision to honour the countrys football legends.\n\nMagwizi won the Zifa president election by a landslide posting 61 votes, while his nearest\n\nPhilemon Machana (6), Twine Phiri (4), Marshall Gore (1), Makwinji Soma Phiri (0) and there were 5 spoilt ballots.\n\nMagwizi suggests creating a Hall of Fame section in stadia where seats would be branded with the names of iconic players like Peter Ndlovu, Moses Chunga and Benjani Mwaruwari.\n\nA portion of the revenue generated from the sale of these seats will then support the families of the celebrated players.\n\nThis initiative aims to celebrate Zimbabwes football heritage, inspire young players and unite fans. Magwizi also emphasized the importance of recognising off-field heroes such as commentators and scouts. His proposal released on his social media handles is part of his campaign for the ZIFA presidency. The elections are on this coming Saturday.\n\nAs an aspiring ZIFA president, I believe its time to reimagine how we honour our football legends. Imagine a Hall of Fame section of the stadium with seats branded in the names of icons like Peter Ndlovu, Moses Chungaand many more. A legacy immortalised for future generations as we honor the greats who made Zimbabwean football unforgettable.\n\nFans could buy tickets for these legend seats at a small extra fee, with a portion supporting the families of the players, said Magwizi.\n\nPicture this: fans seated in the Peter Ndlovu 12 or Moses Chunga 7 seats, taking selfies and sharing memories of these legends on social media. Wed create an atmosphere of pride, excitement, and connection in our stadiums, one seat at a time.\n\nThis initiative will not just honour history but inspire the future. Young players will dream of seeing their name on a seat one day. Every match day will become a celebration of our heritage and a reminder of whats possible in Zimbabwean football, said Magwizi.\n\nHe called for the uplifting of football legends.\n\nLets celebrate our heroes, uplift their families and unite fans under a common cause. As Zifa president, this will be one of the many steps Ill take to restore pride and passion to our football. Together, we can make this dream a reality.\n\nWould you join me in sitting on a seat dedicated to a legend? How many selfies would you take in a Benjani Mwaruwari seat? Lets honor the past and ignite the future of Zimbabwean footballtogether, said Magwizi.\n\nLets not forget our off-field heroes too. Imagine a seat dedicated to Charles CNN Mabika our iconic voice of football! His expert analysis, radio and TV commentary have shaped how we experience the beautiful game.They are many more like him even scouts and football executives, he said.\n\nMagwizi, former Premier Soccer League boss Twine Phiri, Northern Region Soccer League chairperson Martin Kweza, former Zifa board member Philemon Machana, football advocate Marshall Gore and former Highlanders and Dynamos striker Makwinji Soma Phiri will battle it out for the presidency.\n\n @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ty5rytr.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw NQOBILE Magwizi, who was elected as the Zimbabwe Football Association’s (Zifa) president has a vision to honour the country’s football legends. Magwizi won the Zifa president election by a landslide posting 61 votes, while his nearest Philemon Machana (6), Twine Phiri (4), Marshall Gore (1), Makwinji Soma Phiri (0) and there were […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "Victoria Falls named among 31 world wetland cities",
            "url": "https://www.chronicle.co.zw/victoria-falls-named-among-31-world-wetland-cities/",
            "content": "Leonard Ncube[emailprotected]\n\nVICTORIA Falls, home to one of the Seven Natural Wonders of the World, has been named among 31 world wetland cities, cementing the heritage city as a conservation and tourism destination of choice.\n\nAccording to the Ramsar, wetlands, called masensa/masawu in Tonga or amaxhaphozi in IsiNdebele, include lakes, rivers and underground aquifers, as well as areas of swamps and marshes, wet grasslands, fen, oases, estuaries, deltas and tidal flats, mangroves and other coastal areas, coral reefs, peatland or water, whether natural or artificial, permanent or temporary, with water that is static or flowing, fresh, brackish or salt, including areas of marine water.\n\nThe Ramsar Convention on wetlands is the only International Treaty focused on the sustainable management of wetlands and it provides a platform to 172 Contracting Parties working together for wetlands conservation and wise use.\n\nZimbabwe ratified the Ramsar convention on wetlands on 11 February 2012 and has since designated seven wetlands as wetlands of international importance (Ramsar sites).\n\nThese are the Victoria Falls, Driefontein Grasslands, Middle Zambezi/Mana Pools, Lake Chivero, Monavale Vlei, Chinhoyi Caves and Cleveland Dam.\n\nA statement released from the ongoing Ramsar SC64 meeting in Gland in Switzerland showed that Victoria Falls has been accredited as a wetland city.\n\nAccreditation of Victoria Falls as the wetland city has just been confirmed among other 31 cities at the Ramsar SC64 meeting which is underway in Gland in Switzerland, read the brief statement accompanied by a short video.\n\nSome of the cities are Wenzou and Yueyang (China), Abbevile, Arles and Hampigny (France), Indore and Udaipur (India), Babor, Bandar Kiashar, Gandoma (Iran), Nagoya City of Japan, Mehdya of Morocco, Balanga City in Philippines, Poznan in Poland, Gimhae and Mungyeong in Korea, Novi Sad in Serbia, Geneva in Switzerland and Victoria Falls.\n\nMorocco and Zimbabwe are the only African countries whose cities have been accredited.\n\nVictoria Falls was added to the list of Unesco World Heritage Sites in 1989 due to its remarkable natural beauty and cultural significance.\n\nThe latest development is a perfect reason for Zimbabwe to join the rest of the world in celebrating the World Wetlands Day 2025 on 2 February under the theme: Protecting Wetlands For Our Common Future.\n\nThe country will also host the 15th Conference of the Contracting Parties (Cop15) to the Ramsar Convention on wetlands in Victoria Falls from 23-31 July.\n\nZimbabwe made the bid at the end of CoP 14 to the Ramsar Convention on Wetlands held in Geneva in December 2022 and based on the tremendous work the country has done on wetlands conservation.\n\nZimbabwean wetlands make up 136 595.8km2 of areal cover excluding dams and lakes and Matabeleland North contributes 39 400.80km2.\n\nOf the total wetlands in the country, 61 percent are moderately degraded and 18 percent severely degraded.\n\nThe world has lost 85 percent of its wetlands that are disappearing three times faster than forests.\n\nOver the last few years Zimbabwe has demonstrated its commitment to the importance of protecting and sustainable utilization of wetlands by putting in place robust strategies as included in the National Development Strategy 1 (NDS1) to halt and reverse wetland loss and restore ecosystem goods and services.\n\nhe Government has mapped all wetlands in the country and now has the National Wetlands Policy and the attendant Wetlands Management Guidelines.\n\nWetlands serve as natural sponges, absorbing excess water during floods and releasing it slowly during dry periods thereby helping mitigate the impacts of climate change-induced disasters.\n\nThey are vital for human survival as they also act as carbon sinks, sequestrating/absorbing carbon dioxide from the atmosphere and helping to mitigate global warming.\n\nLitterbugs have also violated the wetland, which is littered with plastic bags, bottles and other debris.\n\nThe effects of climate change have not spared the wetland as rising temperatures and erratic weather patterns have altered the hydrological regime of the wetland, posing significant challenges to its ecological integrity.\n\nWetlands are indispensable for the countless benefits or ecosystem services that they provide humanity, ranging from freshwater supply, food and building materials, and biodiversity, to flood control, groundwater recharge, and climate change mitigation.\n\n-@ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Victoria-falls.jpg",
            "description": "Leonard Ncube leonard.ncube@chronicle.co.zw VICTORIA Falls, home to one of the Seven Natural Wonders of the World, has been named among 31 world wetland cities, cementing the heritage city as a conservation and tourism destination of choice. According to the Ramsar, wetlands, called masensa/masawu in Tonga or amaxhaphozi in IsiNdebele, include lakes, rivers and underground aquifers, […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "UPDATE: Newly elected ZIFA vice president Kennedy Ndebele’s vision: ‘Let’s get rid of football mess’",
            "url": "https://www.chronicle.co.zw/update-newly-elected-zifa-vice-president-kennedy-ndebeles-vision-lets-get-rid-of-football-mess/",
            "content": "Fungai Muderere-Zimpapers Sports Hub\n\nNEWLY elected Zimbabwe Football Association (Zifa) vice president Kennedy Ndebele said once elected into office, he will seek to get rid of the mess that has punctuated the game for the last 15 years.\n\nNdebele was voted into office on Saturday in Harare during the Zifa elections, where he garnered 46 votes, followed by Omega Sibanda (12), Peter Dube (4), Francis Zimunya (3), James Takavada (2) and Makwinji (0).\n\nNdebele, an outgoing Premier Soccer League (PSL) chief executive officer, said he understands that the role of the vice president is critical in the organisations policy formulation, strategic planning process, implementation, and image presentation\n\nThe vice president must be knowledgeable about the operations of the FAs various action centres yet be mature enough to guide and allow developments to implement programmes. The vice president must act in accord with the ultimate FA president, who is the arrowhead of the organisation for progress and success to be achieved by the entire leadership team. Zimbabwean football has, in the past 15 years, faced a myriad of challenges.\n\nThe Covid-19 pandemic and subsequent suspension from FIFA membership exacerbated the situation, leaving the game in dire need of reform on all fronts. We need to sort out that mess. And it is important to realise the need and commit to a paradigm shift in the entire football organisations governance and operational approaches, said Ndebele.\n\nHis campaign hinges on 11 pillars that speak to re-organisation, governance, capacity development, club licencing, decentralisation, grassroots and youth football, womens football development, collective responsibility, communication, marketing, and ideal competition participation.\n\nNdebele, who is on record citing governance challenges at the countrys football mother-body, will face competition from ex-Zifa vice president Omega Sibanda, former PSL and Highlanders chairman and now Bosso board member Peter Dube, James Takavada, and Francis Nyamutsamba.\n\nNdebele stressed the importance of working collaboratively with the Zifa president and other stakeholders to implement effective programmes and reforms.\n\nMy key commitments will be to work closely with the president, offering support. Be available at all times to take the role assigned by the president and stand in for him. I will also keep abreast of the organisations activities, including those of subcommittees, and be supportive in providing guidance for strict strategic planning and implementation of policies and plans. I will be committed to unwavering, principle-focused leadership at all times and ensure a culture of prompt decision-making, communication, and enforcement, said Ndebele.\n\nHe boasts of a career spanning several leadership roles in football, including serving as Highlanders secretary and chairman as well as coordinating the 2009 Cosafa tournament. He was also the marketing director for the African Union Sports Council Region 5 Games that were hosted by Zimbabwe a few years ago.\n\nNdebeles academic credentials include a Science Politics and Administration (Hons) Degree from the University of Zimbabwe (UZ), a Diploma in Management of Olympic Sport Organisations from the IOC, and a FIFA Futuro III Regional Instructor Administration and Management Certificate.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ghnmhnjr.jpg",
            "description": "Fungai Muderere-Zimpapers Sports Hub NEWLY elected Zimbabwe Football Association (Zifa) vice president Kennedy Ndebele said once elected into office, he will seek to get rid of the mess that has punctuated the game for the last 15 years. Ndebele was voted into office on Saturday in Harare during the Zifa elections, where he garnered 46 […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "Victoria Falls City to meet Mkhosana residents over sewer connection plans",
            "url": "https://www.chronicle.co.zw/victoria-falls-city-to-meet-mkhosana-residents-over-sewer-connection-plans/",
            "content": "Leonorah Ncube in Victoria Falls\n\nTHE City of Victoria Falls will this Monday meet residents of Mkhosana suburbs BD46 section as the local authority plans to connect the sewer system in the area.\n\nBD46 has been without a proper sewer system since its inception about two decades ago, and residents have been using septic tanks and honey suckers.\n\nResidents have raised concerns about their situation over the years, especially during budget consultation meetings.\n\nIn a statement, Victoria Falls City Town Clerk Mr Ronnie Dube said the agenda would focus on sanitation issues, particularly sewer connections.\n\nThe City of Victoria Falls would like to invite all BD46 residents to a meeting to discuss sewer connections, he said.\n\nSince the inception of the suburb, residents have relied on septic tanks, while others use the nearby bush despite the presence of wildlife, contributing to high open defecation rates in the city. Sometimes, septic tanks overflow during the rainy season, posing a health hazard for residents.\n\nThe meeting has been welcomed by residents as a major step toward addressing these challenges. Mr Khumbulani Mpofu, one of the residents, said there is hope for proper water, sanitation, and hygiene.\n\nPeople paid for servicing and were disappointed that nothing has happened, considering the time we have stayed in BD46 without sewerage and with parts of the road unserviced. However, we are excited and joyful that something is finally coming up, Mr Mpofu said.\n\nAnother resident, Ms Simangaliso Tshuma, said the meeting shows the local authoritys regard for residents.\n\nThis is an opportunity for us to air our views and concerns. We dont feel comfortable without a sewer system in the area. We are hoping this meeting will finally bring about a solution for BD46, she said.\n\nA church leader who preferred to remain anonymous narrated how their church had struggled with a shortage of water since the year 2000.\n\nThe church was established in 2000, and we relied on temporary Blair toilets until 2005. Since then, we have been using a septic tank system. You can imagine the challenges this has posed for people, as it is hazardous for a church not to have a proper sewer system. We really look forward to the meeting called by the council, and we hope that its not just a meeting but one that will quickly address the challenge, he said.\n\nThe local authority is implementing a US$4 million WASH project, where it is constructing overhead and underground water reservoirs in Mkhosana to address the entire WASH programme.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tgrg.jpg",
            "description": "Leonorah Ncube in Victoria Falls THE City of Victoria Falls will this Monday meet residents of Mkhosana suburb’s BD46 section as the local authority plans to connect the sewer system in the area. BD46 has been without a proper sewer system since its inception about two decades ago, and residents have been using septic tanks […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "Live Coverage: ZIFA elections",
            "url": "https://www.chronicle.co.zw/live-coverage-zifa-elections/",
            "content": "CLICK HERE to follow the live blog!https://www.herald.co.zw/live-coverage-zifa-elections/\n\nIts a different day in the countrys football landscape.\n\nThe 271 days of FIFA administration is coming to an end with the ushering in of a new ZIFA board to be elected in Harare today.\n\nIt will be the first such executive since the dissolution of the Felton Kamambo led one on November 16, 2021.\n\nSince that day, the country has gone for 671 days without, first on auto-pilot, then under FIFA ban and then under the wings of the ZIFA Normalization Committee.\n\nThe latter will be dissolved just before the plebiscite upon which it will assume the role of the electoral committee to oversee the elections.\n\nThe 78 voters will choose the association president, his two deputies, one of which should be a woman and six executive ordinary members.\n\nMartin Kweza, Phillemon Machana, Nqobile Magwizi, Makwinji Soma-Phiri, Marshal Gore and Twine Phiri are vying for the biggest chair while 10 candidates are eyeing the vice-presidents post with a strong field of 39 hopefuls looking to clip six of the available ordinary members slots.\n\nThe elections will be preceded by the ZIFA AGM which is about to start at the same venue where members of the media will not have access to.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ZIFA.jpg",
            "description": "CLICK HERE to follow the live blog! https://www.herald.co.zw/live-coverage-zifa-elections/   It’s a different day in the country’s football landscape. The 271 days of FIFA administration is coming to an end with the ushering in of a new ZIFA board to be elected in Harare today. It will be the first such executive since the dissolution of […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "It’s confirmed, Kweza chickens out",
            "url": "https://www.chronicle.co.zw/its-confirmed-kweza-chickens-out/",
            "content": "Online writer\n\nMartin Kweza has now officially thrown his withdrawal to leave only five candidates to run for the ZIFA top post.Voting was supposed to start over 30mins ago, but there have been delays and councillors have been asked to wait outside as FIFA agents fix some equipment in the voting hall.The atmosphere is pulpable and expectant.There are stories of worry and anxiety written in the faces of candidates who continue to interact with the voters and the media, possibly canvassing with the former, for one last moment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Zifa-680x380.png",
            "description": "Online writer Martin Kweza has now officially thrown his withdrawal to leave only five candidates to run for the ZIFA top post. Voting was supposed to start over 30mins ago, but there have been delays and councillors have been asked to wait outside as FIFA agents “fix” some equipment in the voting hall. The atmosphere […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "Kweza withdraws from ZIFA race",
            "url": "https://www.chronicle.co.zw/kweza-withdraws-from-zifa-race/",
            "content": "Online writer\n\nTwists and turns were always going to characterize this watershed ZIFA election with one of the man touted as a strong contender for the presidency Martin Kweza withdrawing from the race.\n\nHe is expected to make it official in the coming moments.\n\nShocked?\n\nI was even more shocked when an anonymous caller told me.\n\nI have just called Kweza and he confirmed the development, at least over the phone.\n\nIt remains to be seen if he does so on the ground.\n\nElections are about plots and sub-plots.\n\nBut why would he want to deceive us today when he was one of the most visible figures during the campaign period that ended at 11:59pm last night?\n\nIf he really withdraws, the scales will tilt a bit but it will still be a three-horse race with Twine Phiri the dark horse in a contest which either Machana or Magwizi can claim.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/zifa-cc.jpg",
            "description": "Online writer Twists and turns were always going to characterize this watershed ZIFA election with one of the man touted as a strong contender for the presidency Martin Kweza withdrawing from the race. He is expected to make it official in the coming moments. Shocked? I was even more shocked when an anonymous caller told […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "Big day for Zim football",
            "url": "https://www.chronicle.co.zw/big-day-for-zim-football/",
            "content": "Tadious Manyepo\n\nIts a different day in the countrys football landscape.\n\nThe 271 days of FIFA administration is coming to an end with the ushering in of a new ZIFA board to be elected in Harare today.\n\nIt will be the first such executive since the dissolution of the Felton Kamambo led one on November 16, 2021.\n\nSince that day, the country has gone for 671 days without, first on auto-pilot, then under FIFA ban and then under the wings of the ZIFA Normalization Committee.\n\nThe latter will be dissolved just before the plebiscite upon which it will assume the role of the electoral committee to oversee the elections.\n\nThe 78 voters will choose the association president, his two deputies, one of which should be a woman and six executive ordinary members.\n\nMartin Kweza, Phillemon Machana, Nqobile Magwizi, Makwinji Soma-Phiri, Marshal Gore and Twine Phiri are vying for the biggest chair while 10 candidates are eyeing the vice-presidents post with a strong field of 39 hopefuls looking to clip six of the available ordinary members slots.\n\nThe elections will be preceded by the ZIFA AGM which is about to start at the same venue where members of the media will not have access to.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Zifa-680x380.png",
            "description": "Tadious Manyepo It’s a different day in the country’s football landscape. The 271 days of FIFA administration is coming to an end with the ushering in of a new ZIFA board to be elected in Harare today. It will be the first such executive since the dissolution of the Felton Kamambo led one on November […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "WATCH: From border flanks to Zimra warehouses, Seized smuggled goods fill Condep to rafters",
            "url": "https://www.chronicle.co.zw/from-border-flanks-to-zimra-warehouses-seized-smuggled-goods-fill-condep-to-rafters/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE Container Depot (CONDEP) in Bulawayo loudly attests to the Governments unwavering resolve to combat illicit tarade.\n\nWarehouses in the city are brimming with a staggering array of confiscated items such as vehicles, stoves, refrigerators, alcohol, diapers, and many more goods all seized during a relentless crackdown on smuggling during the festive season.\n\nThe persistent multi-agency task forcecrackdown led by the Ministry of Industry and Commerce endeavours to stem the flow of illegal imports that threaten local industries and undermine the national economy.\n\nThe taskforce also comprises the Zimbabwe Republic Police, Reserve Bank of Zimbabwe, Zimbabwe Revenue Authority (Zimra), and Consumer Protection Commission.\n\nPermanent Secretary for Presidential Affairs and Devolution Eng Tafadzwa Muguti (third from left) and other stakeholders inside the Zimra Container Depot (CONDEP) full of confiscated goods in Bulawayo on Thursday\n\nThe Government has announced that the anti-smuggling campaign is now standard procedure, directing implementing agencies to execute it assertively and impartially to stop the influx of illicit goods and protect local industries.\n\nThe taskforce is tactically intercepting smuggled goods at various entry points. Notably, intercity buses carrying suspected contraband have been detained in some of the latest operations.\n\nEngineer Tafadzwa Muguti, the Permanent Secretary forPresidential Affairs and Devolution, witnessed the sheer scale of the problem first-hand when he toured the CONDEP on Thursday.\n\nThe warehouses were teeming with diverse items from household appliances like stoves and refrigerators to everyday necessities like diapers, alcohol, and tinned foods.\n\nMuguti reinforced that no one is above the law in the fight against illicit trade, emphasising that the crackdown would not tolerate any exceptions.\n\nThe anti-smuggling campaign is now a lifestyle. We are simply saying zero tolerance to smuggling. We are aware that we have porous borders as a country. We are aware that some villages along the borders are now leasing out storage space to smugglers and we will deal with them decisively, said Muguti.\n\nWe are aware that we also have political elements who tried to politicise His Excellencys vision of rebuilding the economy by stopping smuggling. We can confirm that this has nothing to do with politics.\n\nHe said going forward, all confiscated goods would be forfeited to the State.\n\nAs you can see behind me, we have hundreds of thousands worth of alcohol in this warehouse, which was confiscated, and as you saw outside, we have many vehicles, which were also impounded for smuggling. What we are simply saying, according to the Customs and Excise Act, is that anyone who tries to import, export, introduce, or anyhow put something onto the Zimbabwean economy or market without following the relevant customs and excise laws, the law says they are stealing from the State.\n\nSo, we are done with the days when we confiscate things and ask you for a nice, friendly fine in return.\n\nFrom now going forward, you smuggle something into the country, we catch you, you forfeit it to the State, and that becomes a State asset. Essentially, when people are smuggling, its a criminal enterprise, Muguti said.\n\nHe questioned the logic of smuggling electric stoves which are readily available in the country.\n\nWhy should we have refrigeration being smuggled into the country when weve got companies in Bulawayo and Harare, which are now manufacturing these appliances?\n\nWe are not saying we do not want imports. You can import,but we want a fair playing ground. Pay your dues and pay your taxes.\n\nAccording to security officials, smugglers are avoiding the border and using the border flanks.\n\nThey then load the goods into intercity buses or cargo trucks in Beitbridge before transporting them to various destinations in Zimbabwe. To enhance surveillance, authorities are deploying high-tech security systems, including drone surveillance.\n\nGoods can be held for 60 to 90 days under the Customs and Excise Act. Various disposal methods, including rummage sales and destruction, are also used to clear warehouses.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/FDGFG.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  THE Container Depot (CONDEP) in Bulawayo loudly attests to the Government’s unwavering resolve to combat illicit tarade.  Warehouses in the city are brimming with a staggering array of confiscated items such as vehicles, stoves, refrigerators, alcohol, diapers, and many more goods all seized during a relentless crackdown on smuggling during the festive season. […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        },
        {
            "title": "WATCH: ‘It was traumatic but a blessing’, Luthuli Dlamini opens up",
            "url": "https://www.chronicle.co.zw/watch-it-was-traumatic-but-a-blessing-luthuli-dlamini-opens-up/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nLUTHULI Dlamini, known for his prolific online presence, presented a persona of a man who could talk for hours.\n\nHowever, as he sat down for an interview with the Saturday Chronicle at Banff Lodge in Bulawayos Hillside suburb, he quickly established some ground rules.\n\nPersonal life? Off-limits! Family matters? Strictly private! And rumours circulating about his financial status? Absolutely not for discussion!\n\nBorn 59 years ago at Mpilo Central Hospitalin Bulawayo, Dlaminis life took an early turn when he emigrated to the United Kingdom at the tender age of one. Returning to Zimbabwe in 1974, he spent his formative years shuttling between Mhlahlandlela and his rural roots in Emanxeleni, Ntabazinduna.\n\nDlaminis journey then led him to South Africa, where he quickly rose to prominence through his captivating performances in various television productions.\n\nWhile his portrayal of Stan Nyathi in the popular eTV soapie, Scandal, undoubtedly garnered him widespread recognition, it might surprise many to learn that this isnt necessarily his most cherished role.\n\nNo, it would be the role of Christopher in astage play I did at the LibertyTheatre on Mandela Square in Sandton. This is because the play was based on an award-winning book in London that I had never read before.\n\nWhen I was offered the role, I was drawn to it because it was challenging and complex, it was a lovely piece for all of us. I understand why he won the award because it was a lovely piece, he said.\n\nAsked to encourage the new generation of thespians, Dlamini said: Continue to love what you do, and continue being passionate about chasing new ideas, and education. Be passionate about innovation, ingenuity, (and) invention in your craft. Be knowledgeable about your craft. Love your craft so much so that you wake up in the morning and Google more about your craft.\n\nLearn more and have the attitude that youll never stop learning. Things are developing so fast in the world today so you have to keep up.\n\nThe seasoned actor expressed his optimism about the potential of Zimbabwes film industry. After spending years abroad, Dlamini is eager to reconnect with the creative scene in his home country.\n\nEver since Ive been here, Ive seen a lot of potential within the film sector and other facets of art. As I was watching a play at the Bulawayo Theatre, I could see how invested these young ones are. Theres so much more we could do to help them, said Dlamini.\n\nQuizzed on whether he will feature in a soapie soon, Dlamini cheekily said: Yes, no, definitely, well . . . look, I dont know. The space Im currently in and have always been in is that I will work until the day I die, doing what I love doing.\n\nDlamini is a spiritual, scientific, and astronomic man.\n\nIsintu is a religion that existed before all other religions and it worked. Those values of humanity, empathy, I feel like we are losing and that they arent emphasised enough in other secular religions. Isintu sethu is as old as the stars and was developed because it worked for its society, that is, abantu.\n\nDlamini, who spent over two decades in the UK specialising in dramatics and theatre before moving to South Africa, reflected on his roots with pride.\n\nFrom a young age, it has all been theatre, stage work. Acting was what everyone else was doing. I tried football, but it didnt work out. I was always acting, he reminisced.\n\nHis first acting gig was at the Bulawayo Theatre in the 1970s, where he played two roles in the play The Baobab Tree, being a wise owl and the monkey.\n\nWith an impressive career that includes memorable roles in popular television series such as Scandal, Jacobs Cross, and Generations, Dlamini has become a well-respected figure in the South African entertainment industry. Though he doesnt know much about the current crop of actors now, Dlamini vehemently remembers the Harare International Festival of the Arts (Hifa).\n\nHis parents, grounded in culture, nurtured Dlamini on the education ethos where Dlamini and his siblings were taught to value their culture and education. He is not just an actor; he is also an engineer, scientist, and a devoted fan of Highlanders.\n\nDlamini revealed that he is set to participate in this years Imiklomelo kaDakamela, hosted by Chief Mbusi Bekithemba Dakamela of Nkayi on April 4-5.\n\nIm even embarrassed that its been this long since I was away. I need to come back and reacquaint myself with the scene. Theres a lot I have to learn and see, he said.\n\nDespite refusing to comment about rumours that he is homeless, Dlamini previously addressed the claims on Instagram.\n\nIm fine, I promise Im not homeless. Be sure of your sources of information. Dont compromise your integrity for 15 cheap minutes of fame.\n\nRecently, Dlamini assumed a new role as an independent film producer, an endeavour which saw him release The Cold Father, a move he described as traumatic.\n\nIt was traumatic in the sense that Ive never wanted to be behind the camera. I left paperwork in business when I left the corporate world and decided to be an actor. It was traumatic in the sense that it was also by force but a blessing in disguise because Ive learnt so much about my industry, he said.\n\nWith the nicely-trimmed lawn serving as a backdrop to our conversation, Dlamini alluded to such a place as a perfect specimen to his ideal resting spot after a long day at work.\n\nI relax in a garden, a pretty garden like this. With friends, family, I love my grandchildren, just the serenity of a beautiful environment. I look for this kind of serenity, he said.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gghddghghgh.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com  LUTHULI Dlamini, known for his prolific online presence, presented a persona of a man who could talk for hours.  However, as he sat down for an interview with the Saturday Chronicle at Banff Lodge in Bulawayo’s Hillside suburb, he quickly established some ground rules.  Personal life? Off-limits! Family matters? Strictly private! And rumours […]",
            "time": "20:30",
            "date": "25 Jan 2025"
        }
    ]
}