{
    "news": [
        {
            "title": "President unveils US$3,6billion project",
            "url": "https://www.chronicle.co.zw/president-unveils-us36billion-project/",
            "content": "Nqobile Bhebhe in Beitbridge\n\nPRESIDENT Mnangagwa yesterday led the ground-breaking ceremony for the massive US$3,6 billion Palm River Energy Metallurgical Special Economic Zone project in Beitbridge District, Matabeleland South, in another bold milestone towards transforming Zimbabwes economy into an upper middle-income status by 2030.\n\nThe mega-investment by Chinese investors is a multi-faceted project encompassing mining, power generation, coke production, and steel manufacturing.\n\nOnce fully operational, it will produce stainless steel in phases and is expected to create over 2 000 jobs, significantly addressing employment challenges in the country.\n\nCurrently, over 300 Chinese and 800 Zimbabwean workers  totalling over 1 000 personnel  are already engaged in project implementation, which is at an advanced stage.\n\nUS$3,6 billion Palm River Energy Metallurgical Special Economic Zone project in Beitbridge District\n\nCovering 5 163 hectares, the project will be constructed in five phases over 12 years.The first phase, with a construction period of two years, involves a US$237 million investment and will focus on producing 200 000 tons of ferrochrome annually while supporting coal mining, coking, infrastructure development, and other related projects.\n\nPlans are also underway for the construction of a 1 200MW green power and integrated power generation plant by Zimbabwe Xintai Resources (Pvt) Ltd.\n\nThe new industrial park is expected to contribute more to the provinces economy, Matabeleland region and the country at large through expansion and unlocking of new opportunities for employment, technological advancement, and social development.\n\nIn his keynote address, President Mnangagwa said the investment breakthrough was a direct result of the Second Republics engagement and re-engagement policy, which continues to position Zimbabwe as a favourable investment destination through the normalisation of relations with the global community.\n\nThe thermal power station that is under construction at the Palm River Energy Metallurgical Industrial Industrial Park in Beitbridge\n\nHe commended Zimbabwe Xintai Resources (Pvt) Ltd, under the investment entity Xinganglian (Shanxi) Holding Group Co. Ltd, for its bold decision to invest US$3,6 billion into this metallurgical and energy hub.\n\nIn this regard, it is my expectation that the Palm River Energy Metallurgical Special Economic Zone project will play its part as a critical block for our nations industrialisation and modernisation, said President Mnangagwa.\n\nWe look forward to this project helping to drive our national economy forward and unlocking unprecedented opportunities for employment, technological progress, and social development as we march towards the attainment of Vision 2030.\n\nHe described the initiative as a model of excellence, a beacon of innovation, and a driver of prosperity for future generations.The President reaffirmed his Governments commitment to fostering a conducive environment for investors and emphasised the projects role in the countrys industrialisation and modernisation agenda.\n\nThis ceremony follows hard on the heels of other projects, which are at various stages of implementation since the advent of the Second Republic, said President Mnangagwa.\n\nThe progress we are seeing here is also a positive result of my Governments engagement and re-engagement policy that has led to growing confidence in Zimbabwe as a favorable investment destination.\n\nAs Zimbabwe marches towards 2030, the President invited more companies to grab opportunities offered by Zimbabwe, particularly those from strategic allies such as China and beyond.\n\nHe highlighted the countrys commitment to achieving its ambitious targets by 2030 through increased foreign direct investment as a testimony that indeed, Zimbabwe is Open for Business.\n\nAt the heart of this Special Economic Zone is the integration of energy and metallurgy, two sectors that could redefine Zimbabwes industrial landscape.\n\nThe project prioritises sustainable mining practices, including low greenhouse gas emissions, waste reduction, and energy self-sufficiency through waste recycling.\n\nI applaud the fact that the project targets the production of two million tons of chromium-based materials and one million tons of coke per year, said President Mnangagwa.\n\nAmid the rising demand for minerals and the economic opportunities they represent, he cautioned against potential challenges if the transition to clean energy is not managed responsibly.\n\nThe President noted that the first phase of the project has already made significant progress, with a 100MW thermal power generation plant currently being commissioned.\n\nOf this, 50 MW is expected to be operational by the end of March. Additionally, the coal wash plant, with a 160 000-ton annual capacity, and the chrome smelting plant have been completed.\n\nThe thermal power station that is under construction at the Palm River Energy Metallurgical Industrial Industrial Park in Beitbridge\n\nHe highlighted the importance of technological advancements in mining, urging collaboration between the mining sector, academic institutions, and the Government to support and sustain mining education.\n\nThe partnership between Shanxi Engineering Vocational College and Harare Polytechnic to carry out the College-Enterprise project will go a long way towards upskilling our young people in this sector, said President Mnangagwa.\n\nThe project will provide scholarships for students to study in China in the fields of metallurgy, mechanical engineering and electrical engineering.\n\nUnder the programme, there is scope for the establishment of a Metallurgical Centre of Excellence, with a focus on value addition and beneficiation.\n\nPresident Mnangagwa further encouraged institutions such as the Zimbabwe School of Mines to establish similar partnerships to advance the industry.\n\nTurning to mineral beneficiation, he said Zimbabwe was prioritising investments in exploration and value addition to maximise economic benefits.\n\nIn line with the Africa Mining Vision, mineral value addition ensures that our great motherland, Zimbabwe, derives maximum benefits from our abundant natural resource endowments, said the President.He called on all stakeholders to cooperate to ensure the projects success, urging engineers and workers to recognise their role in shaping Zimbabwes industrial future.\n\nLet us work hand in hand to ensure that the Palm River Energy Metallurgical Special Economic Zone not only succeeds but exceeds expectations. To the engineers and all who will work on this project to bring it to life, know that what you are building is a legacy, said President Mnangagwa.\n\nMy Government is fully in support of this initiative and will move with you for shared success. Let it be a model of excellence, a beacon of innovation, and a driver of prosperity for generations to come.\n\nGovernment declared Beitbridge a Special Economic Zone in 2018 as part of broader strategies to attract more investment to the economy. The SEZ model is designed to boost foreign direct investment, enhance local business competitiveness, and drive economic growth.\n\nVice Presidents Dr Constantino Chiwenga and Kembo Mohadi, Minister of State for Matabeleland South Provincial Affairs and Devolution Dr Evelyn Ndlovu, Finance Minister Professor Mthuli Ncube, Mines Minister Winston Chitando, Chinese embassy officials, mining sector players, and Beitbridge community leaders also attended the event.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-18-3-680x380.jpg",
            "description": "Nqobile Bhebhe in Beitbridge PRESIDENT Mnangagwa yesterday led the ground-breaking ceremony for the massive US$3,6 billion Palm River Energy Metallurgical Special Economic Zone project in Beitbridge District, Matabeleland South, in another bold milestone towards transforming Zimbabwe’s economy into an upper middle-income status by 2030. The mega-investment by Chinese investors is a multi-faceted project encompassing mining, […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "President unveils US$3,6billion project… huge spin-offs for locals, college scholarships",
            "url": "https://www.chronicle.co.zw/president-unveils-us36billion-project-huge-spin-offs-for-locals-college-scholarships/",
            "content": "Nqobile Bhebhe in Beitbridge\n\nCommunities in Beitbridge District are poised to reap significant benefits from the US$3,6 billion Palm River Energy Metallurgical Industrial Park, which has already created numerous business and employment opportunities for locals.\n\nLocated 20km west of Beitbridge, the energy industrial park has since absorbed scores of previously unemployed locals with more jobs expected as the project expands in phases.\n\nWith close to 1 000 workers on site, mainly locals, the multi-sectorial Special Economic Zone is a game-changer for the district and the entire Matabeleland South Province.\n\nTogether with the greater wildlife and tourism economy as well as citrus production, the new investment will further enhance Beitbridges role as a key economic hub in Zimbabwe, along the Zimbabwe-South Africa border.\n\nPresident Mnangagwa visited the investment site yesterday where infrastructure improvements such as better roads and utilities will be built to enhance trade and economic collaboration between Zimbabwe and neighbouring countries.\n\nBeyond industrial development, the project is making an immediate impact on local communities through the development of social amenities such as drilling of boreholes to provide clean water.\n\nPlans are also underway to establish a clinic and a recreational park, further improving social infrastructure in the district with more support systems for the education sector.\n\nThis is a clear demonstration of the Governments commitment to ensuring no place is left behind. Employment chances have been enhanced for the community, especially the youth, Mr Samuel Tlou, a local community representative said.We urge the Government and private sector to set up technical colleges to train the youth in mining activities.\n\nAdditionally, the project is set to offer technical training to Zimbabwean workers mostly drawn from the province equipping them with industry-relevant skills through hands-on experience and technology transfer.\n\nMatabeleland South Provincial Affairs and Devolution Minister, Dr Evelyn Ndlovu, highlighted the transformative potential of the mega project, and emphasised its expected contribution to the national economy.\n\nDr Evelyn Ndlovu\n\nThrough such projects, she said the province will not be left behind in Zimbabwes development agenda.She said the initiative is also set to impact positively on the education sector, which is expected to benefit from the US$500000 scholarship fund that will sponsor Zimbabwean youth to study in China.\n\nAdditionally, plans are in place to establish a Metallurgical Centre of Excellence, focusing on value addition and beneficiation.We firmly believe that a strong youth leads to a strong nation. To support this vision, the Palm River Special Economic Zone has committed US$500 000 to establish the Palm River Education Fund.\n\nOver the next 10 years, we will annually select five to 10 outstanding students from the Beitbridge region to receive scholarships, said Xinganglian Metallurgy Company chairman, Mr Zhou Xudong.With its vast scope, the Palm River Energy Metallurgical Special Economic Zone is poised to redefine Beitbridges economic landscape, unlocking opportunities for employment, infrastructure development, and skills enhancement across the province.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ccccccccccccccccccc.jpg",
            "description": "Nqobile Bhebhe in Beitbridge Communities in Beitbridge District are poised to reap significant benefits from the US$3,6 billion Palm River Energy Metallurgical Industrial Park, which has already created numerous business and employment opportunities for locals. Located 20km west of Beitbridge, the energy industrial park has since absorbed scores of previously unemployed locals with more jobs […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "Season kicks off… Scottland, Triangle set for thrilling showdown",
            "url": "https://www.chronicle.co.zw/season-kicks-off-scottland-triangle-set-for-thrilling-showdown/",
            "content": "Lovemore Dube,[emailprotected]\n\nTHE Castle Lager Premier Soccer League programme could not have gotten a better start than having Scottland and Triangle kick off the 2025 season with a clash at Rufaro Stadium on Friday.\n\nIt will be the first match of this years campaign as the Premier Soccer League released a mouth-watering weekend fixture yesterday.\n\nScottland have been loud in their off-season ahead of their maiden league appearance after winning the hotly contested Northern Region championship last year.\n\nThey have been on a massive recruitment that saw them bring on board championship-winning coach Tonderai Ndiraya and top players Khama Billiat, Tymon Machope, Lynoth Chikuhwa, Peter Muduhwa, Godfrey Makaruse and Soccer Star of the Year Walter Musona.\n\nWalter Musona\n\nTheir opponents Triangle are expected to thrive on the element of surprise having seemingly not been very active and loud in their off-season dealings.\n\nBulawayo giants, Highlanders, will start with an away trip to Baobab Stadium on Sunday to face MWOS who grabbed the ZPC Hwange franchise leaving the Southern Region with just two teams in the Premiership.\n\nThis follows the relegation of Arenel, Bulawayo Chiefs and Hwange last season.The thermal power generators from Hwange, won the Zifa Southern Region championship and the ticket to play in the Premiership.\n\nThey ran into complications when Zifa abruptly decided to impose a club licence rule that does not permit teams from the same organisation to play in the same league. In the past two Army and Correctional Services sides have played in the Zimbabwe Premiership.\n\nMWOS who hail from Norton will be home-away and this could affect their hopes of maximum points.They however a packed Phelandaba Stadium at the weekend when they played Gwanda Pirates.\n\nMWOS should expect a vociferous Bosso crowd eager to see their new look side following the departure of several key players.Dynamos who won the Castle Challenge Cup beating league champions Simba Bhora on Sunday, return to their favourite hunting ground Rufaro Stadium to face ZPC Kariba.\n\nDembare are favourites to open their 2025 account with a home win.Simba Bhora will play host to FC Platinum in the weekends plug fixture and a lot of fireworks are expected.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Walter-Musona-Lynoth-Chikuhwa-and-Khama-Billiat.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw THE Castle Lager Premier Soccer League programme could not have gotten a better start than having Scottland and Triangle kick off the 2025 season with a clash at Rufaro Stadium on Friday. It will be the first match of this year’s campaign as the Premier Soccer League released a mouth-watering weekend fixture […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "Industrialists lobby for lower production costs",
            "url": "https://www.chronicle.co.zw/industrialists-lobby-for-lower-production-costs/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nAs Zimbabwe seeks to capitalise on trade opportunities under the African Continental Free Trade Area (AfCFTA), industrialists are advocating the reduction of production costs to enhance the competitiveness of domestic products.President Mnangagwa has expressed his Governments readiness to address private sector concerns and is actively working on initiatives to promote low-cost production.\n\nThis call comes at a time when the Government is refining its monetary policy to increase the use of the local currency, a key factor in boosting competitiveness.\n\nThe issue of easing the cost burden on businesses was a major topic of discussion last week during the National Competitiveness Commission (NCC) inaugural Competitiveness Summit, which was officially opened by President Mnangagwa.\n\nMr Busisa Moyo\n\nReflecting on the matter, prominent industrialist and CEO of United Refineries Limited Group, Mr Busisa Moyo, emphasised the importance of creating a low-cost environment and highlighted the need to embrace the local ZWG currency to reduce the foreign currency-based cost of doing business.\n\nA low-cost environment that prioritises the ease of doing business is critical for the growth of a manufacturing sector to avoid offshoring of production to cheaper jurisdictions, Mr Moyo posted on his X-handle.\n\nThis is one of the reasons why a local currency is important. The USD destroyed all competitiveness in the last two and half decades and thats why we constantly need tariffs, permits, and other non-tariff barriers (NTBs).According to Mr Moyo, the use of strong currencies, as is the case in Zimbabwe where the United States dollar is dominant, encourages imports, and discourages exports by nature, thereby, engendering a high-cost environment.\n\nEconomist, Mr George Nhepera, concurred saying promoting low-cost production is one of the best strategies to improve competitiveness and economic growth in a global economy.\n\nThis is the strategy currently being followed by China, Japan, and South Korea leading to rapid industrialisation, increased exports, and a high standard of living for its citizens, he said.\n\nWhile it is critical to achieving low-cost production using our currency, which is relatively weaker compared to other international currencies, it should be noted that the best route should be promoting a low-cost production environment through embracing cutting-edge technology in our production and manufacturing systems, said Mr Nhepera.This is the model currently being pursued by the majority of European nations including our neighbors such as South Africa and Botswana.\n\nIts noble to reduce costs through technology rather than through payment of lower wages and salaries using a weaker currency. It affects the morale and dignity of our workforce.Bulawayo businessman, Mr Morris Mpala, said the need for low-cost production holds the key to the future of effective competitiveness of local industries.\n\nHe said the cost of production in Zimbabwe has to be interrogated and solutions proffered to create an enabling environment for such.\n\nOne critical factor is the local currency use, which should be encouraged but should be encouraged when all fundamentals are right for its sole use, said Mr Mpala.\n\nIf we are still in the multi-currency era, we need to let the currency float freely to represent a fair value and thats a start.Some of the issues that affect competitiveness as mentioned by industrialists include the high cost of power, local authority rates, and high cost of compliance, amongst other things.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-13-2.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com As Zimbabwe seeks to capitalise on trade opportunities under the African Continental Free Trade Area (AfCFTA), industrialists are advocating the reduction of production costs to enhance the competitiveness of domestic products. President Mnangagwa has expressed his Government’s readiness to address private sector concerns and is actively working on initiatives to promote low-cost […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "Bulawayo artistes shine at Youth Day celebrations",
            "url": "https://www.chronicle.co.zw/bulawayo-artistes-shine-at-youth-day-celebrations/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nThe National Youth Day celebrations held at the Zimbabwe International Exhibition Centre in Bulawayo on Friday showcased the immense talent of Bulawayo artistes, who formed the majority of the events line-up. Their performances captivated the diverse audience, proving their ability to entertain large crowds.\n\nThe event featured stellar performances from Insimbi ZeZhwane, Godolude, Ma9nine, Noluntu J, No Name Dance Crew, and Mzoe7. Each act contributed to making the celebrations unforgettable with a variety of musical genres that resonated with the audience.\n\nExcitement was high among the youth, who not only enjoyed the days activities but also appreciated being recognised as the future of the nation.\n\nIn a show-stopping performance, Noluntu J left the crowd breathless. The young singer took to the stage with confidence and charisma, delivering a set that left everyone on their feet. Her performance was a masterclass in energy and enthusiasm. She performed her hit songs Ispoko and Moko, which had the crowd singing along and dancing to the infectious beats. Her outfit, a stunning denim jumpsuit paired with flying hair, added to her overall stage presence, making her a joy to watch.\n\nGovernment officials present at the event were equally impressed, rising to their feet to give Noluntu J a standing ovation after her performance.\n\nI was overwhelmed by the response, Noluntu J said in an interview after the show.It was my first time performing before such a huge crowd, and I didnt know what to expect.Despite admitting to initial stage fright, Noluntu J credited the other artistes who performed before her for helping to calm her nerves and warm up the crowd.\n\nThe other artistes really helped me to relax and get into the zone. By the time I got on stage, I felt like I was ready to take on the world. I defeated my stage fright and gave it my all.\n\nInsimbi ZeZhwane on stage file picture\n\nAs soon as Mzoe7 stepped onto the stage, he commanded attention, demonstrating his widespread popularity among young people nationwide. His surprise performance followed an outstanding act by Ma9nine, further igniting the crowds energy.Dressed in his signature trendy attire, Mzoe7 was joined on stage by the No Name Dance Crew, whose eye-catching outfits creatively fused workwear with contemporary fashion. Their dynamic performance left the audience in awe, particularly students who were thrilled to witness Mzoe7 live.\n\nAlice Mukombe, a student from Bindura University, expressed her excitement, saying, I always watched Mzoe7s music videos on Channel O, and I never imagined I would see him perform live. He is truly talented  one might even mistake him for a South African artiste. Hes the best I have seen in his genre. Melusi Hlabangana, a student from St Columbus in Bulawayo, described the event as his best Youth Day celebration yet.\n\nI enjoyed all the performances. As someone passionate about music, this event really showed me that theres a future in the arts. This was the best Youth Day ever, he said.\n\nAfter his set, Mzoe7 spoke on the importance of supporting the arts, highlighting how many individuals have found purpose and livelihood within the industry. He also stressed that artistes serve as cultural and tourism ambassadors, sharing Zimbabwes heritage, fashion, landscapes, and stories with the world through various artistic expressions such as music, visual arts, poetry, and dance.\n\nNo Name Dance Crew\n\nOther notable performances came from Rhumba artistes Godolude and Insimbi ZeZhwane. Godolude and his team delivered an engaging performance, captivating the audience with their impressive dance moves.\n\nHowever, Insimbi ZeZhwanes performance, which followed shortly after, faced challenges. A noticeable drop in sound quality affected their set, although the technical issues seemed isolated as other acts performed without difficulties. The audience only fully re-engaged when the group performed Child Abuse, popularly known as Jeremiah.\n\nOverall, the National Youth Day celebrations were a resounding success, with Bulawayo artistes proving once again that they have what it takes to shine on major platforms.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-9-6.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com The National Youth Day celebrations held at the Zimbabwe International Exhibition Centre in Bulawayo on Friday showcased the immense talent of Bulawayo artistes, who formed the majority of the event’s line-up. Their performances captivated the diverse audience, proving their ability to entertain large crowds. The event featured stellar performances from Insimbi ZeZhwane, […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "President to attend Dr Nujoma’s funeral",
            "url": "https://www.chronicle.co.zw/president-to-attend-dr-nujomas-funeral/",
            "content": "Nduduzo Tshuma in Windhoek, Namibia\n\nPRESIDENT Mnangagwa, who is also SADC chairperson, is set to arrive here on Friday for the burial of Namibias founding father and liberation struggle icon, Dr Sam Nujoma, who died early this month.\n\nThe revered revolutionary icon died at 95 in a Windhoek hospital on 8 February 2024 and has been hailed for his rich legacy at home and across the region.\n\nA memorial service for the late Dr Nujoma will be held at the Independence Stadium on Friday, where President Mnangagwa, will be among the key speakers, before burial the next day at Namibias National Heroes Acre in the capital.Speaking to journalists yesterday, Zimbabwean Ambassador to Namibia, Melody Chaurura, said the Presidents visit highlights the strong bilateral ties between the two countries, dating back to liberation struggle times.\n\nThe Presidents visit speaks to the deep relationship that exists between the two countries, a relationship rooted in the struggle for freedom that delivered the free and independent Namibia we have today, as well as the free and independent Zimbabwe we have today, she said.\n\nIt reflects the depth of our cooperation, which extends beyond politics to Government-level collaboration. It is, therefore, significant that the President is coming to join the Namibian nation at the memorial service on 28 February, which will be followed by the burial on 1 March.\n\nAmb Chaurura said Dr Nujomas death was a heavy blow to the Namibian people, coming just a year after the death of the countrys third President, Hage Geingob.\n\nYou can feel it, you could tell from the way the news was received that it was profound, especially considering that President Nujoma was not only a former President but the founding father of Namibia.\n\nIt is no wonder he has also been declared the father of the Namibian nation, said Amb Chaurura.It has been a very difficult time for the people of Namibia, but the prevailing sentiment is that of continuing the struggle started by the late founding father. The people are determined not to betray the spirit of liberation ignited during the fight for independence.\n\nAmb Chaurura said Zimbabwe looked forward to deepening bilateral ties with Namibia, building on the solid foundation laid by their forebears and advancing beyond political freedom towards economic emancipation.\n\nOur cooperation with Namibia is strong, but we are working hard to ensure that we fully leverage our solid bilateral relations to enhance business and trade cooperation, she said.\n\nWe still have much work to do to achieve that goal, and we are grateful that Namibia has provided Zimbabwe with a Dry Port. This will help us realise our vision for regional integration, boosting trade and economic relations between the two countries and across the SADC region.\n\nPresident Mnangagwa\n\nReacting to the late Dr Nujomas death, President Mnangagwa described the veteran nationalist, who led Namibia from 1990 to 2005, as the last in an iconic generation of leaders of our liberation movements and nations of our Southern Africa region.\n\nHe also hailed the liberation icons unwavering dedication to the liberation of Namibia and his commitment to the unity of the Southern African Development Community (SADC).\n\nWe hurt and grieve deeply at the passing on of this gallant freedom fighter and visionary icon who led and delivered independence and nationhood to the Namibian people, said President Mnangagwa.\n\nHe acknowledged Dr Nujomas steadfast support for Zimbabwe, particularly during the Land Reform Programme, when he stood by Harare despite international pressure.\n\nZimbabwe will always remember and cherish Dr Nujomas principled and unconditional support as our nation faced concerted onslaught by vindictive countries of the West, said the President.\n\nHe said Dr Nujomas legacy was that of a true Pan-Africanist, who championed the independence and sovereignty of African nations and that Africa must remain vigilant against new challenges of resource-induced encroachments.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-20-5.jpg",
            "description": "Nduduzo Tshuma in Windhoek, Namibia PRESIDENT Mnangagwa, who is also SADC chairperson, is set to arrive here on Friday for the burial of Namibia’s founding father and liberation struggle icon, Dr Sam Nujoma, who died early this month. The revered revolutionary icon died at 95 in a Windhoek hospital on 8 February 2024 and has […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "COMMENT: Swiftly provide closure to the UBH baby-swapping families",
            "url": "https://www.chronicle.co.zw/comment-swiftly-provide-closure-to-the-ubh-baby-swapping-families/",
            "content": "THE baby-swapping incident at United Bulawayo Hospitals (UBH) has understandably caused significant distress and concern among the affected families and the broader community. The families involved are experiencing immense emotional turmoil, hence swift resolution is essential to provide closure and begin the healing process for these families.\n\nAs we reported yesterday, the incident, which caused considerable upset and concern, prompted the Ministry of Health and Child Care to thoroughly review procedures at the hospital, and the public awaits the outcome of the investigation with keen interest.\n\nDeputy Minister of Health and Child Care, Sleiman Kwidini, speaking after a tour of UBH last Thursday, said the ministry is still dealing with the matter and will leave no stone unturned. He acknowledged that while the families involved have been reunited, the incident is unacceptable and must never happen again.\n\nThat matter is still under investigation, but I can assure the nation that the findings will be made public. If charges are to be brought against anyone found guilty, they will be. And if it is proven that it was simply a mistake without ill intent, the public will also be informed. It must be clear that this matter will not be swept under the carpet, Deputy Minister Kwidini said.\n\nIncidents like these can severely undermine public trust in healthcare institutions. Expediting the investigation and transparently sharing the findings will help restore confidence in the hospitals ability to provide safe and reliable care. It demonstrates accountability and a commitment to preventing future occurrences.\n\nDetermining the root cause of the baby swap is necessary to hold any responsible parties accountable. Whether it was due to negligence, procedural lapses, or other factors, identifying and addressing these issues is crucial to ensuring justice for the affected families and upholding ethical standards in healthcare.\n\nA thorough and prompt investigation will help identify gaps in the hospitals procedures and protocols. This information is vital for implementing corrective measures to prevent similar incidents in the future. Ensuring that staff are adequately trained and that robust checks are in place can significantly reduce the risk of such errors.\n\nThe broader community needs reassurance that their healthcare system is reliable and that such incidents are taken seriously. Expediting the investigation and communicating the steps being taken to address the issue can help alleviate public anxiety and reinforce the hospitals commitment to patient safety.\n\nAs we have argued before, expediting the investigation into the baby-swapping incident at UBH is essential for the emotional well-being of the affected families, restoring public trust, ensuring legal and ethical accountability, implementing preventive measures, and reassuring the community. The Government and hospital authorities must prioritise this investigation to address the immediate concerns and prevent future occurrences.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-7-copy-1.jpg",
            "description": "THE baby-swapping incident at United Bulawayo Hospitals (UBH) has understandably caused significant distress and concern among the affected families and the broader community. The families involved are experiencing immense emotional turmoil, hence swift resolution is essential to provide closure and begin the healing process for these families. As we reported yesterday, the incident, which caused […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "Farmers call for easy access to markets",
            "url": "https://www.chronicle.co.zw/farmers-call-for-easy-access-to-markets/",
            "content": "Michelle Musandinyoze,[emailprotected]\n\nFARMERS have implored the Government to scale up rural infrastructure development, especially rehabilitation of roads, to improve their access to markets in order to boost agriculture productivity and rural livelihoods.In an interview, Zimbabwe Farmers Union (ZFU) operations director, Dr Prince Kuipa, said there is dire need to upgrade major roads linking farmers to key markets.\n\nHe said the poor state of roads negatively affects transportation of produce, which limits their potential to contribute positively to the agricultural sector and the economy as a whole.\n\nThe Harare to Chinhoyi, Bulawayo to Victoria Falls and Karoi roads, amongst others, are the main roads that have been making it difficult for farmers to transport their produce to markets, he said.\n\nDr Kuipa further highlighted that commercial farmers are lacking financial resources as banks which are supposed to give them loans are insisting on collateral security.\n\nApart from bad roads, farmers have been encountering hardships in raising financial resources which is a limiting factor in terms of improving crop quality and competitiveness on the markets, he said.Dr Kuipa said ZFU has been lobbying the Government to give new farmers tittle deeds which they could use as security when applying for loans.\n\nWe appreciate that Government has responded positively to our calls to empower new farmers and has started giving farmers title deeds which some farmers are already using as security to obtain loans, he saidDr Kuipa said the ZFU on its part is assisting by training farmers so that they have the knowledge and skills required to adapt to the ever-evolving farming environment.\n\nMeanwhile, the Governments Rural Development 8,0 rural development initiative, which will focus on value addition and beneficiation of agriculture produce is expected to set the stage for the transformation of Zimbabwes rural economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/r4w3.jpg",
            "description": "Michelle Musandinyoze, mickyafrica271@gmail.com FARMERS have implored the Government to scale up rural infrastructure development, especially rehabilitation of roads, to improve their access to markets in order to boost agriculture productivity and rural livelihoods. In an interview, Zimbabwe Farmers Union (ZFU) operations director, Dr Prince Kuipa, said there is dire need to upgrade major roads linking […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "All Female Artistes Awards Zimbabwe calls for support",
            "url": "https://www.chronicle.co.zw/all-female-artistes-awards-zimbabwe-calls-for-support/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nThe second edition of the All Female Artistes Awards Zimbabwe (AFAAZ) has expanded significantly and will be held over five days, from March 24 to March 28, culminating in the awards ceremony at the Marina Casino in Harare.Held during Womens Month, the event aims to promote, appreciate, and honour women in the arts sector by showcasing their talent and supporting their work.\n\nThe theme for this years AFAAZ awards is Lets Do It, highlighting action, collaboration, and resilience.AFAAZ is an initiative of Sarah Dee Creations Africa and Divas in Action Zimbabwe/Africa.\n\nAFAAZ founder Sarah Dhliwayo, an artiste known as Sarah Dee, who is passionate about empowering women in the arts, expressed excitement about hosting the event and urged individuals and the corporate world to support female creatives.\n\nThis is our second edition, and we hope to reach and empower women in the arts across all 10 provinces of Zimbabwe. For the industry to grow, we need to create a supportive and user-friendly environment. Women make up the majority of the population, and by empowering them, we are building the foundation for the entire nation.\n\nWere thus calling on individuals and corporate sponsors to join us in celebrating and uplifting women in the arts, said Sarah Dee.\n\nShe said this year, the event will kick off with Black Friday, followed by four days of open markets and live performances.This will provide artistes with a platform to network and voice their concerns to the right authorities before we honour the best in the industry, she said.\n\nThe second edition will feature multiple sub-events, highlighting female artistes creativity throughout the week. Starting on March 24, the week-long exhibition named Thuthuka Expo Open Market will run daily from 9am to 7pm.\n\nOn the first day, there will be the official launch of the Thuthuka Expo (Harare chapter) where there will be performances by poets, street theatre groups, and gospel artistes. On March 25, Afro-pop and Afro-fusion artistes will entertain guests. On March 26, Jazz, Chimurenga, and Chakanyuka genres will take centre stage.\n\nOn March 27, Rhumba and other genres will be showcased, concluding the sub-events. The day will also feature a sponsors cocktail party, where nominees will be awarded certificates, Sarah Dee said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vhv.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com The second edition of the All Female Artistes Awards Zimbabwe (AFAAZ) has expanded significantly and will be held over five days, from March 24 to March 28, culminating in the awards ceremony at the Marina Casino in Harare. Held during Women’s Month, the event aims to promote, appreciate, and honour women in […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        },
        {
            "title": "Talen Vision shift base",
            "url": "https://www.chronicle.co.zw/talen-vision-shift-base/",
            "content": "Fungai Muderere,[emailprotected]\n\nAMBITIOUS Zifa Southern Region Division One side Talen Vision will temporarily shift base from Filabusi to Bulawayo as they await the readiness of their home ground at the newly established Talen Vision International School.\n\nIn the past seasons, the Akululula Madoda Boys, have played their games at Filabusi Government Primary School.We will temporarily shift base to Bulawayo for our next home games. Out of mutual consent, we will no longer be playing our home games at Filabusi Government Primary School. We are in the process of preparing our new home at Talen Vision International School, said Talen Vision chairman Elton Sinyosi.\n\nThe club has briefly established camp in the City of Kings and Queens where they have been having their workouts.On Wednesday, Talen Vision are set to take on fellow Southern Region Division One side Zimbabwe Saints in a friendly match that will be played at a venue yet to be announced.\n\nFC Talen Vision will compete for the regions top honours against strongly assembled Bulawayo Chiefs, Zimbabwe Saints, Adachi, Nkayi United and Plumtree based Mainline among other clubs.\n\nBulawayo Chiefs, who were relegated last year, have been busy in the transfer market, bringing back some of their top players from previous seasons.\n\nLeading the charge are the trio of Kelvin Madzongwe, Malvin Mkolo and Arthur Musiyiwa.Madzongwe joins Chiefs from Zifa Southern Region Division One side Zebra Revolution while Mkolo and Musiyiwa arrive from Simba Bhora and Dynamos, respectively, where they both struggled for regular game time.\n\nAlso returning to Chiefs is goalkeeper Matripples Muleya, who is coming from TelOne.The duo of defender Polite Mwenda and Gabriel Dlodlo have joined the club from Arenel.Veteran gaffer Maxwell Takaendesa Jongwe was a few weeks ago appointed head coach at Chiefs and he has Bekithemba Super Ndlovu as his assistant.\n\nFormer Castle Lager Premier Soccer League (PSL) side Zimbabwe Saints roped in experienced Philani Beefy Ncube as their new gaffer.\n\nLast season, the outspoken Ncube was with Arenel Movers who were eventually relegated from the countrys elite football league.  @FungaiMuderere.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/03/Talen-Vision-vs-Jordan-Sinnoth-Health-awareness-campaignmb-1.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw AMBITIOUS Zifa Southern Region Division One side Talen Vision will temporarily shift base from Filabusi to Bulawayo as they await the readiness of their home ground at the newly established Talen Vision International School. In the past seasons, the Akululula Madoda Boys, have played their games at Filabusi Government Primary School. “We […]",
            "time": "06:33",
            "date": "25 Feb 2025"
        }
    ]
}