{
    "news": [
        {
            "title": "Scottland salvage a point from Bosso",
            "url": "https://www.chronicle.co.zw/scottland-salvage-a-point-from-bosso/",
            "content": "Brandon Moyo at Barbourfields Stadium\n\nA LAST minute header from Mthokozisi Msebe helped Scottland salvage a point from Highlanders as the two sides played to a one-all draw on Sunday afternoon.\n\nMsebe headed home at the death to silence the Bosso faithful who thought they had collected maximum points.\n\nBosso broke the deadlock with nine minutes left on the clock through a stunning Andrew Mbeba free kick from the right wing.\n\nFor the second consecutive game, Bosso have given away a lead while Scottland managed to bounce back from a defeat against Ngezi Platinum Stars in their previous game.\n\nWith goals coming in late, the game was, however, a lukewarm affair.\n\nHighlanders had a better start to the match but nothing came out of their domination.\n\nBosso tried to get in front as early as the second minute but Reason Sibandas effort from outside the box went over the bar, in what would be the order of the first stanza as both sides attempts were going above.\n\nIn the sixth minute, Mason Mushore sent in a brilliant cross from the left flank but Ronald Pfumbizai was well positioned to head away for a corner kick. Nothing came out of the set-piece.\n\nFive minutes later, Michael Tapera dribbled past the Bosso defense but his goal attempt went over the bar.\n\nIn the 20th minute, former Highlanders striker, now plying his trade for Scottland, Lynoth Chikuhwa found himself unmarked in the box but headed his effort wide off goal.\n\nAfter a tight contest, the first booking of the match was received by Tichaona Chipunza who has given a yellow card for pulling down Bosso striker, Brighton Ncube at the half hour mark.\n\nWith two minutes remaining before the break, Bosso got another chance but McKinnon Mushores long range shot went over the bar.\n\nIn the 46th minute, soon after the start of the second half, Rauzhi, after recovering a brilliant pass from Melikhaya Ncube managed to beat his marker outside the box but sent his effort over the bar.\n\nPeter Muduhwa captained Scottland in place of Walter Musona who started from the bench.\n\nTeams:\n\nHighlanders:\n\nRaphael Pitisi (gk), Talent Dube (Archford Faira, 78mins), Arthur Ndlovu, Brian Mlotshwa, McKinnon Mushore (Nqobile Ndlovu, 66mins), Melikhaya Ncube, Reason Sibanda, Brighton Ncube (Tendai Muvuti, 78mins),Andrew Mbeba, Mason Mushore, Never Rauzhi.Scottland:Nelson Chadya (gk), Tichaona Chipunza, Michael Tapera, Peter Muduhwa, Gareth Madhake, Kevin Moyo, Ronald Pfumbidzai (Kudzai Jason, 86mins),Panashe Mutimbanyoka (Walter Musona, 66mins), Lynoth Chikuhwa (Khama Billiat, 66mins), Vassili Kawe, (Nathan Mutasa, 86mins), Fredrick Botchway (Mthokozisi Msebe, 54 mins)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jdnhbjsd.jpg",
            "description": "Brandon Moyo at Barbourfields Stadium   A LAST minute header from Mthokozisi Msebe helped Scottland salvage a point from Highlanders as the two sides played to a one-all draw on Sunday afternoon. Msebe headed home at the death to silence the Bosso faithful who thought they had collected maximum points. Bosso broke the deadlock with […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Bosso, Scottland serve up a treat in Bulawayo’s football fiesta",
            "url": "https://www.chronicle.co.zw/bosso-scottland-serve-up-a-treat-in-bulawayos-football-fiesta/",
            "content": "Online Reporter\n\nA lively fast half has lived up to the excitement generated by what was billed as an electrifying encounter between Highlanders and Scottland at Barbourfields Stadium in Bulawayo on Sunday afternoon, with fans of the beautiful game turning out in their numbers for what already feels like one of the most significant fixtures on the football calendar.\n\nIn a football mad town, Scottlands first encounter in the City of Kings has been highly anticipated, with bars, pubs and braai spots witnessing brisk business as hundreds started building up to the match at their leisure centres of choice.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jdnhbjsd.jpg",
            "description": "Online Reporter A lively fast half has lived up to the excitement generated by what was billed as an electrifying encounter between Highlanders and Scottland at Barbourfields Stadium in Bulawayo on Sunday afternoon, with fans of the beautiful game turning out in their numbers for what already feels like one of the most significant fixtures […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Zimbabwean, Linda Mudzenda wows British crowd at BGT",
            "url": "https://www.chronicle.co.zw/zimbabwean-linda-mudzenda-wows-british-crowd-at-bgt/",
            "content": "Mbulelo Mpofu,Zimpapers Arts and Entertainment Hub\n\nSaturday, March 29, 2025, will forever be etched in the memory of UK-based Zimbabwean support worker-turned-singer Linda Mudzenda, who sang her heart out and earned a Golden Buzzer from Alesha Dixon on Britains Got Talent (BGT).\n\nThe singer captivated judges Amanda Holden, Simon Cowell, Bruno Tonioli, and Alesha Dixon with an emotional rendition of You Say by Lauren Daigle.\n\nZimbabweans are making it a habit to shine on global talent platforms, with comedian Learnmore Jonasi also securing a Golden Buzzer at Americas Got Talent earlier this year.\n\nMudzendas Golden Buzzer moment means she advances straight to the shows live semi-finals.\n\nThe 21-year-old, who now resides in Bedford, UK, appeared nervous as she stepped onto the stage. Judge Amanda Holden reassured her, saying, Take your time, take a breath. When she finished her performance, Holden described it as extraordinary, while fellow judge KSI admitted it made him emotional, adding: It was so touching, man  just seeing how beautifully you sang.\n\nDixon expressed her admiration, saying: I think its the first time today that Ive sat through an audition and my heart was racing out of my chest.\n\nMoments later, the former Mis-Teeq star pressed the Golden Buzzer, bringing Mudzenda to tears.It was so beautiful, so emotional. I dont know what youve been through in life, but something is pouring out of your soul, and I loved it. I cant wait to see you in the live show, Dixon said.\n\nOverwhelmed with emotion, Mudzenda called it a dream come true.\n\nMudzenda, who works with children with learning disabilities, now joins a growing list of Zimbabweans making waves on international stages. Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jkjkhjjm.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub Saturday, March 29, 2025, will forever be etched in the memory of UK-based Zimbabwean support worker-turned-singer Linda Mudzenda, who sang her heart out and earned a Golden Buzzer from Alesha Dixon on Britain’s Got Talent (BGT). The singer captivated judges Amanda Holden, Simon Cowell, Bruno Tonioli, and Alesha Dixon […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Neighbourhood watch committee member dodges a bullet",
            "url": "https://www.chronicle.co.zw/neighbourhood-watch-committee-member-dodges-a-bullet/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nA NKETA suburb neighbourhood watch committee member is lucky to be alive after a unknown man, one of three suspected armed robbers, fired a shot at him during a patrol in the area last Friday night.\n\nMr Yeki Ncube was on night patrol with two other neighbourhood watch committee members when the incident took place.\n\nThe team was on patrol in Nketa 8 suburb when they encountered three men carrying bags in the middle of the night.\n\nThe neighbourhood watch members asked to search the bags and out of the blue one of the three unknown individuals pulled out a gun and fired a single shot, aimed at Mr Ncube.\n\nI still cant believe how the bullet missed hitting me. The guy just pulled out a gun and fired a single shot. They ran away into the darkness after that, Mr Ncube told Chronicle on Sunday afternoon.\n\nThe team made a police report after the incident.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hjuyfhjyngft.jpg",
            "description": "  Raymond Jaravaza, ray.jaravaza@chronicle.co.zw A NKETA suburb neighbourhood watch committee member is lucky to be alive after a unknown man, one of three suspected armed robbers, fired a shot at him during a patrol in the area last Friday night. Mr Yeki Ncube was on night patrol with two other neighbourhood watch committee members when the […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Mthulisi Maphosa gets first coaching job",
            "url": "https://www.chronicle.co.zw/mthulisi-maphosa-gets-first-coaching-job/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nFORMER Zimbabwe International midfield maestro Mthulisi Maphosa has secured his first coaching job with Hwange based Zifa Southern Region Division One side Blackrocks FC.\n\nA Caf C coaching certificate holder, Maphosa has the responsibility of ushering the Division One debutants to their maiden Premier Soccer League participation.\n\nBlackrocks chairperson, Shingirai Munotengwa confirmed.\n\nYes, we have initiated the process. If everything goes according to plan, we hope to be with him, he said.\n\nHe said while the bigger objective was to attain qualification to the PSL, they remained realistic too that they first have to avoid relegation in their maiden season.\n\nWe have to avoid relegation at all cost. This is our first year so as long as we are going to learn, we dont want to be relegated in our first season. But some big teams will be surprised, said Munotengwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/222.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw FORMER Zimbabwe International midfield maestro Mthulisi Maphosa has secured his first coaching job with Hwange based Zifa Southern Region Division One side Blackrocks FC. A Caf C coaching certificate holder, Maphosa has the responsibility of ushering the Division One debutants to their maiden Premier Soccer League participation. Blackrocks chairperson, Shingirai Munotengwa confirmed. “Yes, […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Hip-Hop nostalgia: Young Target’s new EP revives voices of GTI, Guluva 7",
            "url": "https://www.chronicle.co.zw/hip-hop-nostalgia-young-targets-new-ep-revives-voices-of-gti-guluva-7/",
            "content": "Mbulelo Mpofu,Zimpapers Arts and Entertainment Hub\n\nSouth Africa-based Zimbabwean rapper Young Target (born Nigel Mhlanga) is set to launch his EP, Heaven Reeds, on April 12 at Coconut Lifestyle in Maboneng, Johannesburg.\n\nThe launch event will feature a line-up of over 30 artistes, including Izzy Breezy, Mlue Jay, Tuff Guy, and Nick Swagg. The EP is also set to evoke nostalgia for Zimbabwean hip-hop lovers, as it features the voices of GTi and Guluva 7, who have been relatively low-profile in recent years.\n\nThe EP is inspired by the birth of the rappers daughter.Im extremely excited about the EP launch, as it will be a great time for artistes to network and connect with each other, Young Target said.\n\nYoung Target teamed up with a diverse group of talented artistes, including South African Zunglish rapper PA Fakaloice and Zimbabwean rappers GTi and Guluva 7.Working with these unique and versatile artistes was a marvellous journey filled with powerful music sessions, taking African hip-hop to another level, he noted.\n\nThe EP offers a mix of styles, from Chelete, a new-age kwaito collaboration featuring Guluva 7, Tuff Guy, and Nick Swagg, to Benz, a trap-infused track featuring PA Fakaloice.\n\nPA Fakaloice, known for his time at Ambitiouz Entertainment and Rocka Empire, brings his signature style to the project.\n\nExplaining the EPs title, Young Target shared: The Heaven Reeds EP was named after my firstborn daughter, Heaven. Reeds is just my surname in English  Mhlanga (in Nguni dialect).\n\nAs an artiste who started his career in Zimbabwe before moving to South Africa, Young Target has experienced the contrasting dynamics of both music industries.In South Africa, Ive learnt a lot in terms of production, creativity, and flow delivery. The industry here has inspired me greatly and had a significant impact on my career.\n\nWith the launch of Heaven Reeds just around the corner, fans can look forward to a visual experience, as Young Target has promised to release music videos for the entire EP, produced by his film crew, Graphic Gang.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jjjjjgtfc.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub South Africa-based Zimbabwean rapper Young Target (born Nigel Mhlanga) is set to launch his EP, Heaven Reeds, on April 12 at Coconut Lifestyle in Maboneng, Johannesburg. The launch event will feature a line-up of over 30 artistes, including Izzy Breezy, Mlue Jay, Tuff Guy, and Nick Swagg. The EP […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Experience on Bosso’s side",
            "url": "https://www.chronicle.co.zw/experience-on-bossos-side/",
            "content": "Zimpapers sports hub\n\nPRECIOUS Mudimba says experience will count to Highlanders favour when they face Scottland in a league match at Barnourfields Stadium this afternoon.\n\nHe acknowledges that they have brought a lot of excitement into the mix.\n\nHighlanders are 99 years old yet Scottland were formed last year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-30-at-11.57.52-680x380.jpeg",
            "description": "Zimpapers sports hub PRECIOUS Mudimba says experience will count to Highlanders’ favour when they face Scottland in a league match at Barnourfields Stadium this afternoon. He acknowledges that they have brought a lot of excitement into the mix. Highlanders are 99 years old yet Scottland were formed last year.    ",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Exciting match predicted",
            "url": "https://www.chronicle.co.zw/exciting-match-predicted/",
            "content": "Zimpapers Sports HubA Member of Parliament Jabulani Hadebe has predicted an exciting match between Highlanders and Scottland at Barbourfields Stadium on Sunday afternoon.\n\nHe said: Scottland are well resourced and have bought good players.\n\nKhama Billiat, Walter Musona, Tyrone Machope and Peter Muduhwa are some of the big names bought by Scottland.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kjkjkjl-2.jpg",
            "description": "Zimpapers Sports Hub A Member of Parliament Jabulani Hadebe has predicted an exciting match between Highlanders and Scottland at Barbourfields Stadium on Sunday afternoon. He said: “Scottland are well resourced and have bought good players.” Khama Billiat, Walter Musona, Tyrone Machope and Peter Muduhwa are some of the big names bought by Scottland.     […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "Let the better team win, no to violence",
            "url": "https://www.chronicle.co.zw/let-the-better-team-win-no-to-violence/",
            "content": "Zimpapers Sports HubPOPULAR soccer fan and once a fervent Caps United fan Chemhofela has called on fans to accept the result and promote a positive vibe at Barbourfields Stadium on Sunday afternoon.Chemhofela is now with Scottland the new boys in the Premiership.\n\nScotland fans have invaded Bulawayo for the clash.\n\nTawanda Mudzengi, another new arrival at Scottland as a fan, having ditched Dynamos, has predicted an outright win for his new team.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-30-at-11.17.00-768x432-680x380.jpeg",
            "description": "Zimpapers Sports Hub POPULAR soccer fan and once a fervent Caps United fan Chemhofela has called on fans to accept the result and promote a positive vibe at Barbourfields Stadium on Sunday afternoon. Chemhofela is now with Scottland the new boys in the Premiership. Scotland fans have invaded Bulawayo for the clash. Tawanda Mudzengi, another […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        },
        {
            "title": "The Big Day Cometh",
            "url": "https://www.chronicle.co.zw/the-big-day-cometh/",
            "content": "Zimpapers Sports HubTHE much-anticipated matchday for probably the biggest match in the Castle Lager Premiership for Bulawayo in the first third has come, with the citys usually bustling streets still sleepy ahead of big matches.Six hours before the match, the hype is yet to pick up.\n\nHighlanders take on Scottland in a winners take all clash at Barbourfields Stadium on Sunday afternoon.\n\nIt could now turn to be the biggest clash in the land with both teams having drawn very good crowds in their opening three matches.\n\nWhoever wins the clash will have defended his city, grabbed bragging rights and the priceless three points.\n\nEven at their worst, Highlanders have often stood up to defend their pride against big teams.\n\nScottland, with barely a year in football, has raised a lot of eyebrows with the manner in which it has gone about its business on the transfer market and has had some commercial partners come on board.\n\nCan all the vibe around them pass the vociferous Barbourfields pro-Highlanders fanfare? Great players before have alluded to the difficulty at facing the fans and a determined Bosso at Emagumeni.\n\nIt will be a battle of wits between Kelvin Kaindu the Highlanders gaffer and league championship-winning Tonderai Ndiraya who won the title last year before joining the Northern Region champions Scottland.On paper the die looks cast Scottlands way given the resources and incentives at their disposal and what they grabbed on the transfer market, landing the signatures of some of the best players on the local scene, Talbert Shumba, Tymon Machope, Peter Muduhwa, last years top goalscorers, Zimbabwe Footballer of the Year Walter Musona and talisman Khama Billiat.\n\nWhile teaming with so much talent, Highlanders have a bunch of players who could take Sundays afternoon match to shake off the nearly-man tag.\n\nFor long they played under the shadows of the departed quartet of Marvellous Chigumira, Godfrey Makaruse, Muduhwa and Chikukwa, could this be the day they take their place under the sun before an appreciative Barbourfields and Zimbabwe audience.Arthur Ndlovu, Marlvin Hativagone, Andrew Mbeba, Melikhaya Ncube and Mason Mushore will be the players expected to rise to the occasion.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/1-3.jpg",
            "description": "Zimpapers Sports Hub THE much-anticipated matchday for probably the biggest match in the Castle Lager Premiership for Bulawayo in the first third has come, with the city’s usually bustling streets still sleepy ahead of big matches. Six hours before the match, the hype is yet to pick up. Highlanders take on Scottland in a winners’ […]",
            "time": "20:25",
            "date": "30 Mar 2025"
        }
    ]
}