{
    "news": [
        {
            "title": "Food security top priority — President",
            "url": "https://www.chronicle.co.zw/food-security-top-priority-president/",
            "content": "Blessings Chidakwa, Harare Bureau\n\nTHE countrys food security will always be guaranteed starting at household level with the Government committed to supporting farmers through initiatives such as Pfumvudza/Intwasa, President Mnangagwa has said.\n\nFile photo: Inputs for the Intwasa/Pfumvudza Programme ready for distribution in Matobo District in Matabeleland South Province\n\nDespite the dry spell, which was experienced recently, the Government has been rolling out Pfumvudza/Intwasa, a climate-proof agricultural practice that empowers farmers, maximises agricultural potential and enhances productivity.\n\nIn a recent interview with ZBC Television at State House in Harare, President Mnangagwa urged the nation to take issues of food security seriously, starting at household level.\n\nWhen we speak about food security at household level, we are talking about our own families countrywide taking responsibility to achieve food security at the household level.\n\nOnce that is achieved, then the country is food secure because primarily it is important that each household secures its own household needs, but our people are generally hard-working families, he said.\n\nPresident Mnangagwa said the only constraint is when the country lacks enough rain.\n\nOnce you have rain, you are sure that as a Government you can look at other aspects of feeding our people, not the countryside, he said.\n\nLeading from the front, President Mnangagwa, who is a farmer of repute himself, said he was working tirelessly to improve productivity at his Pricabe Farm in Kwekwe, taking a leaf from others.\n\nFile photo: President Mnangagwa, flanked by Agriculture Minister Dr Anxious Masuka (second from left), ZCC leader Bishop Nehemiah Mutendi (third from left), Defence Minister Oppah Muchinguri-Kashiri (second from right), Land Tenure Committee Chair Mr Kuda Tagwirei (right) listen while Mr Patrick Mnangagwa (left) speaks during a tour of Pricabe Farm ahead of the launch of the Land Tenure Implementation Programme in Kwekwe.\n\nI have my young brother, Patrick, who is running the farm. I always tell him if you see someone outside the country who is producing better, you (Patrick) must go and find out how they are doing it.\n\nYou must compare yourself with the best in the country and the region. Sometimes I send him to South Africa. In whatever you do, you must match yourself with the best in your field, he said.\n\nThis year, at least six million plots have been prepared under the Pfumvudza/Intwasa Presidential Agriculture Climate Proofing Input Support Scheme, with over 40 000 tonnes of basal fertiliser distributed as the Government cushions farmers from acquiring inputs.\n\nInstallation of Presidential boreholes and setting up of school and village business units countrywide has been a communal path breaker, saving lives while improving livelihoods.\n\nThe initiative has brought relief, clean and potable water to the doorsteps of communities that were previously forced to venture into crocodile-infested rivers and dams hunting for water.\n\nIn the face of climate change and the El Nino-induced drought, villagers now have access to potable water within their vicinity and village business units assisting in guaranteeing food security.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Mnangagwa-1-680x380.jpg",
            "description": "Blessings Chidakwa, Harare Bureau THE country’s food security will always be guaranteed starting at household level with the Government committed to supporting farmers through initiatives such as Pfumvudza/Intwasa, President Mnangagwa has said. Despite the dry spell, which was experienced recently, the Government has been rolling out Pfumvudza/Intwasa, a climate-proof agricultural practice that empowers farmers, maximises […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Government set to recruit 8 000 teachers",
            "url": "https://www.chronicle.co.zw/government-set-to-recruit-8-000-teachers/",
            "content": "Sikhumbuzo Moyo and Blessings Chidakwa, Chronicle Writers\n\nGOVERNMENT is set to recruit 8 000 more teachers next year to improve the teacher-student ratio as part of a raft of measures aimed at improving pass rates in under-performing schools countrywide while teachers in remote areas are set to receive hardship allowances.\n\nThe Ministry of Primary and Secondary Education is implementing a cocktail of measures to bridge the gap between their urban counterparts. As the Second Republic continues to bridge the urban-rural divide education gap, 150 rural schools have been solarised with more earmarked for the coming year.\n\nGovernment is also in the process of building 2 800 schools to further reduce the distance learners walk to school. In an interview, Primary and Secondary Education Minister, Torerayi Moyo, said despite not having received the nod from the treasury, his ministry remains committed to undertaking the recruitment process as it wants a better education system in the country.\n\nThe Ministry of Finance has not provided us with treasury concurrence to recruit new teachers in 2025. However, as a Ministry of Primary and Secondary Education, we lobbied for the recruitment of 8 000 new teachers, he said.\n\nMinister Moyo said the recruitment is expected to progressively reduce the teacher-pupil ratio and improve the quality of education in Zimbabwe.\n\nIn 2024, we recruited more than 5 000 teachers. That has tremendously reduced the high teacher-pupil ratio. With the support even in 2025, we expect to recruit more than 8 000 so that we can reduce the teacher-pupil ratio to around 1 to 30 or 35, he said.\n\nMinister Moyo, said plans are afoot to provide teachers from remote areas with hardship allowances.\n\nThere is some kind of a hardship allowance because we know some of the schools are located quite a distance from the house. Where teachers might be walking a kilometre or more, we tend to provide a hardship allowance, he said.\n\nAs per standing Government policy, teachers that will be deployed in rural schools are mandated to sign a contract to serve a period of four years before seeking a transfer and in terms of Section 7 (1) of Statutory Instrument 1 of 2000 as amended, members will serve a probationary period of not less than one year, and thereafter become confirmed in their new posts at the end of the probationary period, subject to satisfactory performance.\n\nThe appointments shall be subject to passing security vetting and satisfactory medical examinations. Minister Moyo said the Government is also upgrading rural schools to improve the quality of education.\n\nWe used to have quite a number of disparities in terms of access to education, opportunities to access digital tools and some schools did not even have electricity but the Government has solarised some of the schools supported by Unicef he said.\n\nWe receive support from the fiscus, national budget where we are allocated funds towards teaching-learning materials. About 150 schools were solarised this year.\n\nMinister Moyo said they have also decentralised the recruitment of teachers. Zimbabwe is ahead of its African peers in the provision of quality education with the Government committing a huge chunk of its budget towards the sector and building new schools to ensure basic education accessibility.\n\nSpeaking in Parliament recently, Minister Moyo said the recommended teacher-pupil ratio at the infant level is 1:20, at junior level from Grade Three to Grade Seven is 1:30, at Form One to Form Four it is 1:30, Form Five and Six, 1:20.\n\nThis year, a total of 10 506 teachers were employed, which aligns with President Mnangagwas employment drive initiative.\n\nIn the past few years, under the Second Republic, the Government has made great strides in improving education outcomes in the country, vowing to accelerate the momentum to ensure that all schools excel while eliminating zero pass rates by 2030.\n\nTo achieve this ambitious target, the Government plans to allocate more resources to schools, including textbooks, teaching materials and state-of-the-art technology, as well as building science laboratories.\n\nThe Grade Seven results for this year saw a 49,01 percent pass rate, significantly up from 45,57 percent last year. The Zimbabwe School Examinations Council (Zimsec) attributed the increased pass rate to better teaching following interventions by the Ministry of Primary and Secondary Education in advancing and upgrading the teaching and learning process, ensuring more pupils received better teaching.\n\nAll subjects saw pass rates above 50 percent with two, Shona and Physical Education and Arts, going above 80 percent.One new optional subject offered was Xhosa, an indigenous language, which had a pass rate of 72,41 percent, although few students took this subject.\n\nThe number of candidates rose from 327 599 in 2020 to 387 429 this year, while the pass rate improved from 37,11 percent in 2020 to 49,01 percent this year.\n\nHowever, concern has been raised over centres that recorded zero pass rates including schools in the Matabeleland region.Three schools in Gwanda District, Matabeleland South-Zindele, Koodooval and Driehoek, recorded zero pass rates. In Insiza District, Mbembesi, Zhampale, Tshunkunyane and Gwatemba had zero pass rates.\n\nIn Bulilima District, schools such as Ndutshwa, Phumuza and Riverblock also scored zero passes. The same applies to Matabeleland North schools such as Somakantana, Hompane and Makhasane, among others in Lupane, Hwange, Bubi, Tsholotsho, Binga and Umguza Districts.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Minister-Torerayi-Moyo.jpg",
            "description": "Sikhumbuzo Moyo and Blessings Chidakwa, Chronicle Writers GOVERNMENT is set to recruit 8 000 more teachers next year to improve the teacher-student ratio as part of a raft of measures aimed at improving pass rates in under-performing schools countrywide while teachers in remote areas are set to receive hardship allowances. The Ministry of Primary and […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "President deeply rooted in biblical scripture",
            "url": "https://www.chronicle.co.zw/president-deeply-rooted-in-biblical-scripture/",
            "content": "Bongani Ndlovu,[emailprotected]\n\nPRESIDENT Mnangagwas address on Sunday at the annual National Thanksgiving and Dedication Service at the Zimbabwe International Exhibition Centre in Bulawayo, revealed a leader deeply rooted in biblical scripture, intertwining his faith with his vision for the countrys development.\n\nHis speech, delivered with the confidence of a seasoned preacher, was a reflective demonstration of his understanding of the Bible and its relevance to modern governance.\n\nThroughout his address, the President cited multiple biblical verses, weaving them seamlessly into his message of unity, patriotism, and resilience. From Jeremiah 3:15 to Deuteronomy 28:1-6, his use of scripture underlined his commitment to leading the country with divine guidance.\n\nQuoting Jeremiah 3:15, I will give you shepherds according to my heart, who will feed you with knowledge and understanding, the President likened the role of leaders, including himself, to that of spiritual shepherds. He commended the Church for its steadfast commitment to spreading the uncorrupted word of God, describing it as a beacon of hope and wisdom for the nation.\n\nThe Church in Zimbabwe is rallying us all to progressive, Godly, and Biblical patriotism, he said, stressing the importance of aligning national goals with divine principles.\n\nThe Presidents speech was steeped in the biblical call for love and unity. Referencing John 15:12-13, he reminded congregants of Jesus commandment to love one another, saying love should remain ingrained within the Church and the nation.\n\nAs the Church in Zimbabwe, let us remain inspired by the wise counsel of the Lord Jesus Christ in John Chapter 15 verses 12 and 13 which says, My command is this: Love each other as I have loved you. Greater love has no one than this: to lay down ones life for ones friends, he said.\n\nPresident Mnangagwas exhortation to the youth was equally grounded in scripture. Urging them to embrace their heritage and resist external detractors, he invoked Psalm 137:5-6.\n\nBorrowing from the exhortations in Psalm Chapter 137 verses 5 and 6. I also urge us, individually and collectively to patriotically proclaim that, If I forget Zimbabwe, let my right hand forget her skill. If I do not remember nor prefer Zimbabwe above my own joy, let my tongue cling to the roof of my mouth, said President Mnangagwa.\n\nThe youth of our country are particularly challenged to resist the machinations by detractors to have them hate or look down upon their own motherland, Zimbabwe. Never be blind to the vast potential of our land.\n\nOpen your eyes and hearts to truly love and be committed to the land of your birth. You, the youth, are the future of this great country.\n\nPresident Mnangagwas Vision 2030, which aims to transform Zimbabwe into an upper-middle-income economy, is firmly anchored in biblical teachings. He cited Genesis 1:28, which calls for humanity to be fruitful and subdue the earth, as a guiding principle for the nations focus on production and productivity.\n\nThe President also invoked Deuteronomy 28:1-6, assuring citizens that obedience to Gods commandments would bring blessings to the nations cities, countryside, children, and economy.\n\nIndividually and collectively, we must hold firm each others hands, as we develop our country. Deuteronomy Chapter 28 verses 1 to 6 assures us of the abundant blessings that come about as a result of obedience and walking in the fear of the Lord.\n\nIf Zimbabwe fully obeys the Lord our God; and carefully follows His commands that He has given us, the Lord our God will set us far above other nations, he declared.\n\nThe Presidents inspirational speech highlighted tangible actions aligned with biblical values, including efforts to mitigate climate change through dam construction and borehole drilling, and the rapid modernisation of infrastructure. President Mnangagwa credited these achievements to divine blessings, urging citizens to raise their arms in thanksgiving.\n\nWe will be blessed in our cities and blessed in the countryside. Our children will be blessed; and the crops of our land; and our livestock; our herds and our flocks will also be blessed. Zimbabwe will be blessed when we go in, and blessed when we go out, he said, concluding with a prayerful commitment to unity and dedicating the nation to God.\n\nIf we obey the word of the Lord, Almighty God will grant that the enemies who rise up against us, will be defeated before us. They will come to us in one direction, and flee from us in several, and the Lord will send a blessing on everything our nation sets out to do, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/He-thanks-giving.jpg",
            "description": "Bongani Ndlovu, bongani.ndlovu@chronicle.co.zw PRESIDENT Mnangagwa’s address on Sunday at the annual National Thanksgiving and Dedication Service at the Zimbabwe International Exhibition Centre in Bulawayo, revealed a leader deeply rooted in biblical scripture, intertwining his faith with his vision for the country’s development. His speech, delivered with the confidence of a seasoned preacher, was a reflective […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "COMMENT: The Church must be commended for its role in driving national development",
            "url": "https://www.chronicle.co.zw/the-church-must-be-commended-for-its-role-in-driving-national-development/",
            "content": "PRESIDENT Mnangagwas recent address at the annual National Thanksgiving and Dedication Service in Bulawayo highlights several key themes central to Zimbabwes development strategy.\n\nThe President commended the Church for its patriotic efforts and its significant role in driving national development. This recognition underscores the importance of religious institutions in fostering a sense of community and national pride, which can be pivotal in uniting citizens toward common goals.\n\nPresident Mnangagwa attributed Zimbabwes progress to divine guidance and the hard work of its citizens. This dual acknowledgment serves to inspire continued dedication and resilience among the populace, reinforcing the idea that both spiritual and human efforts are crucial for national advancement.\n\nEmphasising Zimbabwes leadership in development rooted in indigenous heritage, the President urged citizens to embrace initiatives that promote modernisation and industrialisation. This approach aligns with broader goals of sustainable development, leveraging local knowledge and resources to drive economic growth.\n\nThe call for Zimbabweans to support one another highlights the importance of social cohesion in achieving developmental objectives. By fostering a culture of mutual aid and collective effort, the nation can better navigate challenges and capitalise on opportunities.\n\nThe Presidents reference to progressive, Godly and biblical patriotism suggests a vision of national pride that is both forward-looking and rooted in moral and ethical values. This framework can help guide the nations development in a way that is inclusive and principled.\n\nBy expressing support for religious gatherings that unite people in gratitude, the President is promoting social harmony and collective reflection on the nations achievements. Such events can strengthen community bonds and provide a platform for shared aspirations.\n\nOverall, President Mnangagwas address reflects a holistic approach to development, integrating spiritual, cultural, and socio-economic dimensions. This multifaceted strategy aims to harness the full potential of Zimbabwes human and natural resources, fostering a resilient and prosperous nation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Mnangagwa-at-ZPCS.jpg",
            "description": "PRESIDENT Mnangagwa’s recent address at the annual National Thanksgiving and Dedication Service in Bulawayo highlights several key themes central to Zimbabwe’s development strategy. The President commended the Church for its patriotic efforts and its significant role in driving national development. This recognition underscores the importance of religious institutions in fostering a sense of community and […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "WATCH: Chevrons, Afghanistan draw… Bennett scores century, takes five-wicket haul",
            "url": "https://www.chronicle.co.zw/watch-chevrons-afghanistan-draw-bennett-scores-century-takes-five-wicket-haul/",
            "content": "Brandon Moyo,[emailprotected]\n\nBRIAN Bennetts debut Test match on home soil proved to be a memorable one as he delivered an all-round performance in a drawn Boxing Day Test between Zimbabwe and Afghanistan at Queens Sports Club.\n\nBennett  who made his Test debut against Ireland in July  produced a stellar performance with both bat and ball in a match where records tumbled.\n\nThe 21-year-old sensation scored a brilliant maiden century in Zimbabwes first innings before completing the match with a five-wicket haul. He finished the first innings on an unbeaten 110 runs and later claimed figures of 5/95 from his 28-over spell.\n\nIn doing so, Bennett became only the second Zimbabwean cricketer to score a century and take a five-wicket haul in the same Test innings. The last to achieve this feat was Paul Strang against Pakistan in 1996, when he made 106 not out and took 5/212 with the ball.\n\nThe fifth and final day of the historic Boxing Day Test resumed with Afghanistan batting on 515/3, with captain Hashmatullah Shahidi at the crease alongside Afsar Zazai. Shahidi resumed on 179 runs off 367 deliveries, while Zazai was on 46 runs.\n\nShahidi would go on to complete his second Test double century, off 414 balls, before Zazai brought up his maiden Test hundred off 152 balls. Sean Williams was the first to strike for Zimbabwe, getting Zazai caught by Johnathan Campbell (sub) for 113 runs off 169 balls.\n\nBrian Bennett celebrates a wicket with Johnathan Campbell\n\nIn the 193rd over, Bennett claimed two wickets in two balls. He first trapped Shahidi in front for a career-best 246 runs before taking a catch and bowl off Azmatullah Omarzai for a golden duck.\n\nHis double strike left Afghanistan on 679/6, and Williams took his second wicket three overs later. Sub fielder Tadiwanashe Marumani produced a stunning catch to dismiss Zia-ur-Rehman off a Williams delivery for five runs. With Afghanistan now on 688/7 in 195.4 overs, Bennett rounded off his efforts with three wickets in the following over.\n\nOnce again, the talented Bennett struck twice in two balls. In the third delivery of his over, he had AM Ghazanfar caught at long-on for six runs before bowling out Naveed Zadran for a golden duck.\n\nThe next ball was a dot, and in the final delivery of the over, he trapped Zahir Khan for a two-ball duck, bringing an end to Afghanistans marathon innings.The visitors now enjoyed a lead of 113 runs going into Zimbabwes second innings.\n\nJoylord Gumbie and Ben Curran opened the batting for Zimbabwe in the second session of the day. Gumbie played a more conservative innings before he was dismissed soon after tea.\n\nHe was caught for 24 runs off 58 deliveries and following his wicket, there was an hour rain delay. When play resumed, Curran was run out attempting a quick single and his wicket brought Sean Williams to the middle where he joined Takudzwanashe Kaitano.\n\nKaitano was the next to fall, trapped in front for five runs off six balls. The new man in, Dion Myers also did not stay long in the middle, as he was bowled by a AM Ghazanfar beauty for four runs. At the time, Zimbabwe were now trailing by 25 runs. With Afghanistan starting to sniff something, it was the experienced duo of Craig Ervine and Williams that managed to see off the game.\n\nErvine and Shahidi decided to shake hands to call the game off. Zimbabwe were on 142/4 when play was called off. They had scored 586 in the first innings before Afghanistan responded with 699.\n\nSpeaking after the game, Ervine said gave credit to his batters but believes that if they had taken their chances on the field, they could have had the chance of winning the Test match.\n\nWith the first innings, the guys batted exceptionally well to set up the game but unfortunately the one area where we will probably look back and think the outcome would have been different if we had taken our chances in the field.\n\nA lot of credit is also going to go to Rahmat Shah and Hashmatullah. The way they batter was exceptional, patient and determined. The application that they showed for a long period was good. We knew that it was always going to come down to the fifth day, down to maybe, the last two sessions.\n\nIn Test cricket you can lose a game in a session, you cant win a game in a session. So, the chat we had this morning was to make sure that we stay focused because we werent too sure when they were going to declare, said Ervine.\n\nHe added: We had to make sure we dont give them a platform of picking up 10 wickets in a session and a half. A lot of credit to the guys, they stayed focused and a lot of credit to the bowlers for the way they went about their business throughout the Test match.\n\nWith the Boxing Day Test match having ended as a draw, the series decider will be yet another historic encounter, the New Years Day Test match scheduled to get underway on Thursday. This will be Zimbabwes first ever New Years Day Test, home or abroad.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/sdfsdf.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com BRIAN Bennett’s debut Test match on home soil proved to be a memorable one as he delivered an all-round performance in a drawn Boxing Day Test between Zimbabwe and Afghanistan at Queens Sports Club. Bennett – who made his Test debut against Ireland in July – produced a stellar performance with both […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Reminiscing about yester-year Christmas Day celebrations",
            "url": "https://www.chronicle.co.zw/reminiscing-about-yester-year-christmas-day-celebrations/",
            "content": "Mzana Mthimkhulu\n\nI DONT know about other Old Timers, but I vividly recall the clothes I wore on Christmas Day, 1964.\n\nHow can I forget that short-sleeved cream shirt with bright images of aeroplanes, bombs and parachutes? Then there was that pair of shiny brown shorts I had never seen anyone in our township wearing. Finally, I got a pair of black, running shoes that climbed up to cover the ankles. We called the shoes amatenderfoot. Whenever we drove past that factory in Gwelo (Bata shoe factory in Gweru), my father used to proudly point out: That is where all our footwear comes from.\n\nFrom head to toe, my attire was brand new. I had hardly slept a wink the previous night. My entire body craved for the touch of the new clothes and footwear. Except for school uniforms, being caressed by new clothes was a luxury I indulged in only once a year.\n\nTrue, the shirt and shorts were oversize. But my visionary mother reassured me, uzakhula lazo (youll grow into them). There was no danger of the large shorts falling down. The magnetic buckle of my new blue, red and green belt firmly held the shorts on my waist. Have I mentioned that the shorts were ahead of their time? Instead of buttons, they had a zipper.\n\nAt sunrise, my brother and I strolled out of our house. Two years younger than me, my brothers clothes would have fit me like a glove. Not to worry, Mother reasoned. Give it two years, the clothes would fit the owner.\n\nAs was the fashion then, I neatly folded a newspaper page and stuck it in my back pocket. There was a lilt in my step as we approached my friends house. His mother, an ever-smiling chubby lady welcomed us. Just look how smart you are! She exclaimed, standing beside the Welcome Dover stove at the kitchens corner.\n\nI shrugged. We try Mother, we try.\n\nThose days, the word smart had nothing to do with intelligence. It only referred to being neat, clean and well- dressed.Not bad, Themba remarked, as he came out of the childrens bedroom. He was impressive in his new navy shorts and blue shirt.\n\nAnd what is this? Mother asked, touching part of my shirt.\n\nA parachute, I replied with the confidence of someone who had known this all his life. Father had told me the previous day.\n\nIt is to help you land safely after you jump out of an aeroplane.What if you land on a lions head? she asked.\n\nMy heart suddenly started beating faster and I stepped back as if I had spotted a snake. Themba came to my rescue. He will be like Samson the Lion Heart. He will talk the language of the lion and it will walk away.\n\nJust what I was about to say, I said. Laughter filled the kitchen.\n\nThat year, the Block elders had arranged for Christmas to be celebrated in age groups. The four to 10 age group celebrated at Thembas house.\n\nBy 8am all my age group members had arrived. Three goats had been bought for the Block. One was tethered at Thembas house. Thembas father taught the boys how to slaughter and skin a goat. The man enjoyed showing off his skills and knowledge.\n\nUsing his Okapi knife, he demonstrated how to skin a goat without leaving an ounce of the precious meat on the skin. For every part of the carcass, he had a name for it.\n\nCall each part by the right name, he told us, youll never go wrong in life. Now, we come to the part of handing over our haul for cooking. Never surrender everything to the kitchen people. Keep something to reward yourselves for a job well done. For a man, roasted meat is tastier than the cooked one. So, keep a bit as an appetiser to the main meal.\n\nTell your father, the Dark City Sisters sang from the gramophone, Happy Christmas. And your mother, Happy New Year.The gramophone was there to rest our throats. Most of the time, we entertained ourselves by singing and playing various games.\n\nSuper PRO\n\nThat evening, a fierce debate raged at home. Each age group was convinced it had the best Christmas ever.The cherry on the Christmas cake was when we threw our tired bodies to bed. For once, Mother agreed there was no need to wash our feet. Amatenderfoot had ensured that no dust soiled our feet.\n\nSadly, amatenderfoot went out of fashion in the coming years. Two decades later, they bounced back in a different form. Certain changes gave them a new life. First, they no longer were manufactured by a local company. They were flown in from abroad. Secondly, they no longer covered the ankles.\n\nTo save material, the manufacturers sliced out the top sides of the sportswear. Thirdly, they no longer came in one colour but in all seven. Fourthly, they were endorsed by popular world athletes and had fancy brand names.\n\nI admit, there was a time when the promotion got to me and I tried them. Except for the high price, the new wonder footwear was not different from the tried and tested Bata Brand.\n\nOh, one more update. Decades later, I often wake up at night shivering. What would I do if I landed on a lions head?\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Tenderfoot.jpg",
            "description": "Mzana Mthimkhulu I DON’T know about other Old Timers, but I vividly recall the clothes I wore on Christmas Day, 1964. How can I forget that short-sleeved cream shirt with bright images of aeroplanes, bombs and parachutes? Then there was that pair of shiny brown shorts I had never seen anyone in our township wearing. […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Economists advocate for policies that boost local production",
            "url": "https://www.chronicle.co.zw/economists-advocate-for-policies-that-boost-local-production/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nAS Zimbabwe continues to record a decline in inflation, economists have called on the Government to implement robust policies that promote massive production of local goods and services to sustain the positive trend and prevent a resurgence in 2025.\n\nAccording to the Zimbabwe National Statistics Agency (ZimStat), the weighted month-on-month inflation rate for December 2024 was 1,1 percent, down from 2,2 percent in November 2024, marking a decrease of 1,1 percentage points.\n\nMeanwhile, the US dollar month-on-month inflation rate rose slightly to 0,6 percent in December, up from 0,1 percent in November. The Zimbabwe Gold (ZWG) month-on-month inflation rate saw a significant drop, falling to 3,7 percent in December from 11,7 percent in November, an eight percentage-point decline.\n\nEconomists have largely attributed the reduction in inflation to the Reserve Bank of Zimbabwes (RBZ) tight and conservative liquidity policies\n\nResponding to questions from Business Chronicle, economist Mr George Nhepera, emphasised the importance of aligning monetary and fiscal policies to maintain exchange rate and price stability, which he described as essential for economic growth and building business confidence. To contain inflation and prevent its resurgence in 2025, the Government must focus on policies that promote massive production of goods and services across all sectors, he said.\n\nMr Nhepera commended the central bank for its success in managing inflation through a stringent liquidity policy and said this approach be maintained.\n\nThe central bank appears to be winning the fight against inflation and this tight liquidity policy should remain a priority going forward. This is quite commendable and should remain a policy of choice going into the future.\n\nMr Nhepera also advocated for deregulation in industries to enhance business confidence and economic activity. From an economic standpoint, reducing excessive Government regulations can boost business confidence, increase economic activities and enable the Government to collect more taxes to fund its programmes, he said.\n\nZimStat also released data on the food poverty line (FPL) and total consumption poverty line (TCPL) for December 2024.\n\nThe FPL for one person was pegged at ZWG805,95, representing the minimum amount required to afford daily energy needs of 2 100 calories.The TCPL, which includes both food and non-food items, stood at ZWG1 156,67 per person. These figures underline the ongoing economic challenges faced by many Zimbabweans.\n\nThe introduction of Zimbabwe Gold (ZWG) in April 2024 has played a significant role in stabilising prices for goods and services. As part of measures to address exchange rate volatility and curtail inflation, the RBZ unveiled ZWG as a medium of exchange to restore macro-economic stability.  @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/05/rbzz.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com AS Zimbabwe continues to record a decline in inflation, economists have called on the Government to implement robust policies that promote massive production of local goods and services to sustain the positive trend and prevent a resurgence in 2025. According to the Zimbabwe National Statistics Agency (ZimStat), the weighted month-on-month inflation rate […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Elephant and cheetah experience: exploring Zimbabwe’s conservation legacy",
            "url": "https://www.chronicle.co.zw/elephant-and-cheetah-experience-exploring-zimbabwes-conservation-legacy/",
            "content": "Leonard Ncube,[emailprotected]\n\nFOR over 25 years, the Elephant and Cheetah Experience in Victoria Falls has been a hub of conservation, tourism and adventure.\n\nThis unique facility offers visitors the chance to interact with some of Africas most iconic wildlife, blending education with unforgettable experiences.\n\nLocated near the Zambezi National Park gate, the facility is home to domesticated lions, cheetahs and elephants, making it a near-complete showcase of the Big Five, missing only buffalo and rhino.\n\nFounded by wildlife expert and director Mr Basil Steyn, the Elephant and Cheetah Experience began as a sanctuary for orphaned and drought-stricken elephants.\n\nOver the years, it has expanded to include cheetahs and lions, transforming into a must-visit destination for both local and international tourists.\n\nThe facility now boasts a herd of eight elephants comprising three bulls and five females, two cheetahs and three lions, many of which were rescued and rehabilitated.\n\nGuided by a mission of conservation and ethical animal interactions, visitors can walk with elephants, interact with cheetahs and lions and learn about the challenges facing these majestic animals.\n\nMr Steyn, one of Zimbabwes pioneers in elephant training, has built a dedicated conservation-oriented team. The facility employs over 50 people, 85 percent of whom are male due to the physically demanding and potentially dangerous nature of the work.\n\nElephant and Cheetah Experience marketing manager, Ms Janice Ncube, who has been with the organisation since 2011, said the facility is committed to conservation and adherence to Zimbabwean laws.\n\nThe whole idea is conservation alongside leisure and tourism. While some critics argue that walking with lions or riding elephants is controversial, we operate under strict guidelines set by the Zimbabwe Tourism Authority (ZTA) and Zimbabwe Parks and Wildlife Management Authority (Zimparks). We believe in what we do and are regularly inspected to ensure ethical and sustainable practices, she said.\n\nDuring a recent visit by a Chronicle news crew, Ms Ncube explained the diverse preferences of international tourists.\n\nAmericans love riding elephants, while Indian and Chinese clients enjoy interacting with the cats. Locals are all-rounders, she said.\n\nVice President Dr Constantino Chiwengas wife, Colonel Miniyothabo Chiwenga in August visited the facility with the 2023 Miss Universe World Sheynnis Palacios and interacted with the animals.\n\nThe elephants, cheetahs and lions each have unique names and stories. For example, Boniface, the oldest elephant at 44 years, was rescued as an orphaned calf. Sondelani, named after a farm in West Nicholson, was born there. Zuva and Nicky, the cheetahs, are ambassadors for conservation efforts aimed at addressing declining populations.\n\nThe three lions  Gundu, Rita, and Thuli  also play vital roles in the facilitys conservation narrative. For just US$120, international tourists can enjoy close encounters with these animals, including feeding and walking with elephants. The facility also offers discounted rates for locals to encourage domestic tourism.\n\nBeyond tourism, the Elephant and Cheetah Experience is deeply involved in community outreach. The facility provides free educational trips for schools and has adopted Chimbombo Primary School as part of its corporate social responsibility.\n\nThe animals, particularly cheetahs, are integral to the conservation efforts and educational activities aimed at teaching guests about the delicate balance of wildlife ecosystems and the importance of protecting these majestic animals, said Ms Ncube.\n\nTheir presence helps raise awareness of the declining populations of such species and the importance of protecting their habitats. We aim to foster a culture where animals are seen as more than just potential dangers.\n\nMs Ncube said by showcasing their beauty and importance, they hope to convert future poachers into conservationists. Despite its successes, the facility faces challenges, including misconceptions about ethical wildlife interactions and bureaucratic hurdles.\n\nElephant and Cheetah Experience started as Elephant Experience and has been running for over 25 years. We introduced the cheetah and lions three years ago hence the name changed. Its a pity, some people dont understand us on the conservation side because they think what we do is controversial, said Ms Ncube.\n\nMs Ncube also expressed concerns about travel agents inflating package prices, making the destination seem expensive.However, the local market has been a lifeline.\n\nIf it wasnt for locals, December would be a low season for us. We do have internationals but the local market boosts us. They not only visit but also promote us online, giving us invaluable exposure, she said.\n\nWe are trying to inculcate a culture of not seeing every animal as a potential danger. Clients get to walk with the elephants in the bush for 30 minutes and after that, they feed them because we use the reward system.\n\nMs Ncube noted that locals often visit during public holidays, while international tourists come during the tourism peak season.\n\nThere are special packages and discounted rates for locals to encourage domestic tourism and allow Zimbabweans to enjoy these unique experiences at half the international price, she said.\n\nWhile the animals are domesticated, elephants feed freely in the bush and are penned at night. Cheetahs and lions only come out when there are clients.\n\nMs Ncube said the Elephant and Cheetah Experience is more than just a tourist attraction, but a conservation hub, working tirelessly to protect Zimbabwes wildlife heritage.  @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Elephant-and-Cheetah-Experience-Marketing-Manager-Ms-Janice-Ncube.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw FOR over 25 years, the Elephant and Cheetah Experience in Victoria Falls has been a hub of conservation, tourism and adventure. This unique facility offers visitors the chance to interact with some of Africa’s most iconic wildlife, blending education with unforgettable experiences. Located near the Zambezi National Park gate, the facility is […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Performers who rocked Bulawayo’s entertainment scene in 2024",
            "url": "https://www.chronicle.co.zw/performers-who-rocked-bulawayos-entertainment-scene-in-2024/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nTHE entertainment scene has been quite active in 2024, with various shows around the city keeping Bulawayo alive. Behind all the music therapy is the artiste who ensures they deliver the best for their fans.\n\nThe talented team that rocked Bulawayo this year includes the following:\n\nMzoe7  Musician and MC\n\nKnown to many as Zimbabwes Maradona, Mzoe7 always brings energy and a lively mood to every event once he is on stage. He gives his all as a performer, accompanied by his dance crew, delivering well-choreographed moves.\n\nMzoe7\n\nMzoe7 always appears dressed to kill, no matter the season. His good fashion taste reflects celebrity vibes. As a musician, he has been performing on the same stage as legends and musicians from across borders. The atmosphere he creates on stage leaves the audience in awe, wondering where Mzoe7 gets all his energy from.\n\nAs an MC, he interacts well with the audience and easily adapts to unexpected situations, technical issues, or the audiences reactions. His expertise on stage, and the ability to multi-task as both a musician and an MC, allowed him to hold the fort at the biggest events, emceeing the Bulawayo Shutdown shows during the April and December editions, where he changed outfits seven times.\n\nInsimbi zeZhwane\n\nThe Rhumba group has been the most sought-after in all forms of gatherings, both within Zimbabwe and beyond. Their level of performance continues to elevate despite the loss of a crucial member who was also the founder of the group.\n\nInsimbi ZeZhwane\n\nInsimbi ZeZhwane has also maintained a unique regalia, setting them apart from others in the genre. The group launched their album Imbobo Zamajuba in October, following a successful debut event held in South Africa.\n\nClement Magwaza\n\nThe Rhumba/Tshibilika giant and his band have showcased a high level of maturity on stage, having rocked the music scene for two decades. Gracing various events in and out of Zimbabwe, he has been a busy man, having launched shows for his latest album Isiphala Sengqondo in Zimbabwe, South Africa and Botswana.All his performances are high-energy, accompanied by remarkable stage presence.\n\nClement Magwaza\n\nSnowy\n\nStanding out among other musicians in his genre is gospel singer Snowy, who has proven that talent knows no genre.\n\nGospel musician Snowy\n\nThis year, Snowy delivered electrifying performances and also shared the stage with legends such as South African gospel musician Benjamin Dube. His powerful dance moves also left South African gospel musicians eager to collaborate with him.\n\nJeys Marabini\n\nAppearing on stage with his usual straw hat, which has become his trademark, Jeys Marabini also celebrated 34 years in the music scene.\n\nFull of energy, Jeys and his team showcase well-choreographed and energetic traditional dances. He engages his audience, making them sing along with him. On stage, he always appears wearing traditional attire.\n\nJeys Marabini\n\nJeyss stage performances reflect his passion, creativity and dedication to the arts. This year, he toured and held successful shows in various cities around Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/vbvbvbv.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com THE entertainment scene has been quite active in 2024, with various shows around the city keeping Bulawayo alive. Behind all the music therapy is the artiste who ensures they deliver the best for their fans. The talented team that rocked Bulawayo this year includes the following: Mzoe7 — Musician and MC Known […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        },
        {
            "title": "Cross lauds Zimbabwe’s revenue collection system",
            "url": "https://www.chronicle.co.zw/cross-lauds-zimbabwes-revenue-collection-system/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nPROMINENT economist and former Reserve Bank of Zimbabwe (RBZ) Monetary Policy Committee member, Mr Eddie Cross, has praised Zimbabwes revenue collection system, saying it is contributing about 20 percent to the gross domestic product (GDP).\n\nSpeaking during a recent post-budget breakfast meeting in Bulawayo, Mr Cross described the tax initiatives as fair and not overly burdensome to the private sector.The revenue collection system of Zimbabwe, at about 20 percent of GDP, is fairly average for Africa. Many African states collect significantly less than that, he said.\n\nAfricas average is about 16 percent, so our tax authority is doing well in collecting taxes from the population. At 20 percent, its not an excessive burden on the private sector. While we might feel heavily taxed, I believe the overall tax burden is reasonable.\n\nHowever, Mr Cross raised concerns about the taxation of employees, noting that the pay-as-you-earn (Paye) system starts at incomes as low as US$100 per month. He urged the Ministry of Finance, Economic Development, and Investment Promotion to revise the Paye threshold upwards. He said increasing the Paye tax ceiling significantly would inject additional spending power into the economy, benefitting the broader market.\n\nMr Cross said the multiplier effect of this increased expenditure would lead to substantial improvements in the general economy. He also commented on the challenges faced by the 2025 National Budget, describing it as a tough call due to high demands on the Treasury. He pointed out that 55 percent of the budget is allocated to salaries, benefits and pensions  a figure much higher than the targeted 35 percent.\n\nSpending 35 percent of the national budget on salaries and wages is already above what many developing countries allocate to their civil service. At 55 percent, we face a significant burden in this area, he said.\n\nDespite these challenges, Mr Cross commended the 2025 National Budget for meeting critical benchmarks, including allocating 15 percent of the budget to health, as stipulated by the Abuja Declaration and 20 percent to education, in line with the Dakar Declaration of 2000.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghjmyjkhukjkj.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com PROMINENT economist and former Reserve Bank of Zimbabwe (RBZ) Monetary Policy Committee member, Mr Eddie Cross, has praised Zimbabwe’s revenue collection system, saying it is contributing about 20 percent to the gross domestic product (GDP). Speaking during a recent post-budget breakfast meeting in Bulawayo, Mr Cross described the tax initiatives as fair […]",
            "time": "06:38",
            "date": "31 Dec 2024"
        }
    ]
}