{
    "news": [
        {
            "title": "Kavango Resources secures US$5 Million funding from Zimbabwean Pension Funds",
            "url": "https://www.chronicle.co.zw/kavango-resources-secures-us5-million-funding-from-zimbabwean-pension-funds/",
            "content": "Vusumuzi Dube,Deputy Radar Editor\n\nMINE development and metals exploration company, Kavango Resources on Tuesday announced that it has issued a US$5 million convertible loan note facility to a consortium of Zimbabwe-registered pension funds- the Comarton Managed Pension Funds Investments Consortium.\n\nIn a statement, the company revealed that the facility is interest free and can be drawn down in three tranches by Kavango and is convertible into new ordinary shares in Kavango at a conversion price of the USD equivalent of 1p per share.\n\nThe company intends that the Conversion Shares issued under the facility will be issued to the US Dollar-based stock exchange, the Victoria Falls Stock Exchange (VFEX), as part of their planned referral listing.\n\nKavango Resources chief executive officer, Mr Ben Turney said the facility will help bolster their strategy in Zimbabwe which borders around the promotion of local shareholder ownership.\n\nThe countrys goldfields are incredibly rich, and it is important that citizens are offered the opportunity to participate in their future success through long-term equity investment. Todays (Tuesday) announcement sends a strong message that Zimbabwe is open for business.\n\nWe look forward to this investment acting as a cornerstone for our introduction to the Victoria Falls Stock Exchange, a little later this summer, said Mr Turney.\n\nThe Consortium is an influential group of individual pension funds in Zimbabwe that collaborates on investments.\n\nMr Turney revealed that 28 consortium members have the mandate to invest in equities and have indicated their intention to participate in the Kavango investment facility.\n\nAs part of a rigorous due diligence, several consortium members and members of the investment committee conducted site visits to review the Kavangos gold projects. It reflects the strong progress our team has made, in less than two years of operations in Zimbabwe, that we successfully passed this process.\n\nWe now intend to use the Comarton funds for mine development and construction of our first gold processing plant. Kavango currently aims to bring Prospects 1, 3 and 4 at the Hillside Project into production over the next 12 months, using modern mechanised mining, he said.\n\nThe CEO revealed that the Consortiums backing of Kavango is a powerful endorsement of the Companys business model and they look forward to building on this relationship in the coming years.\n\nGroup Managing Director of Comarton Consultants, Mr Richard Muirimi, said they were especially excited that they have secured a partner to walk with in their fourth investment quadrant- the mining sector- having already successfully executed on the targeted Property sector, Tourism and Agriculture sectors.\n\nThis partnership with Kavango answers to the key Consortium investment focus of bedding the actual asset in hard currency, benefiting from potential capital growth, generation of long term hard currency free cash flows and contributing to the development of sustainable businesses that create employment and other benefits for Zimbabwean citizens.\n\nWith a firm focus on ensuring all the four quadrants generate hard currency cash flows, this partnership will contribute to the enhancement of the payment of hard currency quarterly USD pensions on the Comarton portfolio being implemented from 1 January 2025, said Mr Muirimi.\n\nHe noted that with Kavango they had found a professional entity, accommodative to the local realities, adaptive and sensitive to local traditions/practices as to set a firm foundation for collaborative partnership for the benefit of members of their pension funds, shareholders and Zimbabwe at large.\n\nAccording to the facilitys Loan Note Structure, the Consortiums agent and administrator is Comarton Consultants (Private) Limited, which has signing authority on behalf of the Consortium.\n\nThe Convertible can be drawn down by the company over a twelve-month period in three tranches, with the first tranche being at least US$500,000, paid in US Dollars and to be drawn down immediately for mine development in Zimbabwe.\n\nTranche two will be US$1,5 million, equivalent paid through conversion of Zimbabwe Gold, the official currency of Zimbabwe, into US Dollars at the Bank of Englands exchange rate via the Reserve Bank of Zimbabwe to be drawn down over the next 12 months for the import of mining equipment for Kavango into Zimbabwe.\n\nTranche 3 will be of US$3 million, paid in US Dollars and to be drawn down over the next 12 months for mine development in Zimbabwe. All funds raised through the Convertible will be used for mine development in Zimbabwe and for the import of mining equipment into Zimbabwe, reads the statement.\n\nConversion Shares will be issued directly to participating Consortium members on a pro-rata basis and admitted to trading on the VFEX, once Kavango has secured its referral listing.\n\nKavango is exploring for gold deposits in Zimbabwe that have the potential to be brought into production by the Company quickly through modern mechanised mining. The Company is targeting both open-pit and underground opportunities.\n\nCurrently, Kavango has two projects on the same greenstone belt, Hillside and Nara.\n\nKavango exercised its option to acquire Hillside in April 2024. At Hillside, the Company has two high-priority targets that it hopes to bring into production over the next 18 months; Prospect 3 and Prospect 4. At Prospect 3 Kavango is investigating the potential for a selective open-pit mining operation and higher-grade mechanised underground mine. Meanwhile, at Prospect 4 Kavango is pursuing a high-grade mechanised underground mining option.\n\nIn parallel to this, Kavango has an option to acquire the Nara Project that currently runs until the end of June 2025. The Company is exploring for; large-scale, high-grade mechanised underground mining opportunities at Nara. The primary target zone is around the historic N1 mine, where the Company is assessing the potential to expand artisanal workings at depth and along strike.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/06/Untitled-1-29.jpg",
            "description": "Vusumuzi Dube, Deputy Radar Editor MINE development and metals exploration company, Kavango Resources on Tuesday announced that it has issued a US$5 million convertible loan note facility to a consortium of Zimbabwe-registered pension funds- the Comarton Managed Pension Funds Investments Consortium. In a statement, the company revealed that the facility is interest free and can be […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Bulawayo to hold memorial service for the late Pope Francis",
            "url": "https://www.chronicle.co.zw/bulawayo-to-hold-memorial-service-for-the-late-pope-francis/",
            "content": "Sikhumbuzo Moyo\n\nBULAWAYO Archbishop Alex Thomas will not attend the late Pope Francis burial on Saturday, however, the Church will hold a memorial service at St Marys Cathedral in the City on Friday.\n\nThe Roman Catholic leader died on Good Friday at the age of 88, and the Vatican has since revealed that the cause of his death was a stroke that put him into a coma and led to heart failure.\n\nI will not be going (to the funeral). We will have a service here at St. Marys on Friday at 5.30pm, said Archbishop Thomas.\n\nThe Vatican also said the pope had decreed that he will be buried in St. Mary Major Basilica in a simple underground tomb.\n\nThe late pontiffs body was brought to St. Peters Basilica on Wednesday to lie in state until burial on Saturday, with hordes of world political and religious leaders as well as ordinary Catholics expected to be in attendance.\n\nIn his condolence message on Tuesday, President Mnangagwa said Pope Francis death is a global blow as his voice transcended the boundaries of the Vatican to touch hearts and minds across the world.\n\nIn a condolence message, addressed to the acting Head of the Vatican, His Holiness Cardinal Kevin Farrell, the President said the pontiff had greatly impacted global spirituality and moral leadership. He described him as a dedicated servant of the Apostolic See.\n\nWhich world leaders have confirmed attendance at Saturdays funeral? (as reported by Aljazeera)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-24-at-07.58.37_3c1ea7fc-680x380.jpg",
            "description": "Sikhumbuzo Moyo BULAWAYO Archbishop Alex Thomas will not attend the late Pope Francis’ burial on Saturday, however, the Church will hold a memorial service at St Mary’s Cathedral in the City on Friday. The Roman Catholic leader died on Good Friday at the age of 88, and the Vatican has since revealed that the cause […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Top diamond producer increases investment. . .Alrosa ramps up Zimbabwe stake",
            "url": "https://www.chronicle.co.zw/top-diamond-producer-increases-investment-alrosa-ramps-up-zimbabwe-stake/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nALROSA, the worlds largest diamond producer by volume, will be doubling its initial investment in its joint venture with the Zimbabwe Consolidated Diamond Company (ZCDC), Alrosa Joint Stock Company chief executive officer, Mr Pavel Marynichev, has announced.\n\nA delegation from the Russia-based company paid a courtesy call on President Mnangagwa at State House in Harare yesterday. In an interview after their closed-door meeting, Mr Marynichev revealed Alrosas plans to double their initial investment, spurred by the investor-friendly policies introduced by the Second Republic.\n\nWe are ready to work in the Republic of Zimbabwe and we are ready to move forward. Yes, and having said that, we have to admit that the planned investments between our companies were doubled. And so by the end of 2025, the total investments will be doubled compared to the previous agreements, he said.\n\nAlrosa began conducting geological exploration in Zimbabwe in 2013 but relinquished the licences it held in 2016.\n\nThe company returned under the Second Republic in 2019, thanks to President Mnangagwas political and economic reforms. Mr Marynichev stated that they were conducting exploration operations under Special Grants and Exclusive Prospecting Orders.\n\nHistorically, we have got 40 Special Grants and Exclusive Prospective Orders since the establishment of our company, and we are conducting our exploration activities within these licences, trying to find economically viable deposits of diamonds and other minerals. As you might know, we established the joint venture between Alrosa and the State entity Zimbabwe Consolidated Diamond Company (ZCDC).\n\nSo, we established the joint venture in 2019 . . . two state companies, Alrosa Public Joint Stock Company and Zimbabwe Consolidated Diamond Company, they work together through this joint venture in the Republic of Zimbabwe, he said.\n\nMr Marynichev expressed great satisfaction with the operating environment in Zimbabwe.\n\nAlrosa Joint Stock Company\n\nAnd weve already thanked His Excellency (President Mnangagwa) for the brilliant investment climate here. We are very glad to stay in the Republic of Zimbabwe and, of course, today we have met with His Excellency the President and we reported about the results made by our company, our joint venture company during these years, he said.\n\nAccording to the company, Alrosa has nearly 70 years of history and, as the world leader in diamond mining and explored reserves, it is the only company globally that covers every aspect of diamond production from geological exploration to the creation of polished diamonds and jewellery.\n\nThe Alrosa Group employs 35 000 professionals, responsible for 30 percent of global and about 90 percent of Russian diamond production.\n\nZimbabwe has, in recent years, made significant strides in the mining sector, ramping up production from a base of US$2,7 billion in 2017 to over US$12 billion currently, due to favourable investment regulations and an array of much-sought-after minerals including gold, platinum, diamonds, and lithium, among others. Mining sector revenues are expected to play a critical role towards the countrys attainment of upper-middle-class economic status by 2030.\n\nZimbabwe has over 60 recorded minerals, but only 10 are being actively exploited as the rest require exploration and resource definition.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gdfgd-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau ALROSA, the world’s largest diamond producer by volume, will be doubling its initial investment in its joint venture with the Zimbabwe Consolidated Diamond Company (ZCDC), Alrosa Joint Stock Company chief executive officer, Mr Pavel Marynichev, has announced. A delegation from the Russia-based company paid a courtesy call on President Mnangagwa at […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Industrialisation key to economic transformation – VP Chiwenga",
            "url": "https://www.chronicle.co.zw/industrialisation-key-to-economic-transformation-vp-chiwenga/",
            "content": "Nqobile Bhebhe, Zimpapers Business Hub\n\nZIMBABWES push for economic transformation is firmly rooted in the establishment of a robust industrial base, one that fosters sustainable and inclusive growth, Vice-President Constantino Chiwenga said yesterday.\n\nAddressing delegates at the Zimbabwe International Trade Fair (ZITF) 2025 International Business Conference (IBC), held under the theme Revitalising Industrialisation for Zimbabwes Economic Resurgence, VP Chiwenga underscored the central role of industrialisation in achieving the countrys vision of becoming an upper-middle-income economy by 2030.\n\nOur collective ambition to transform the economy hinges on building a resilient and diversified industrial base. History has shown that no nation has achieved high-income status without first establishing a strong, competitive manufacturing sector, he said.\n\nThe Vice-President said the Second Republic had made notable progress in promoting industrialisation through the National Development Strategy 1 (NDS1), which has significantly contributed to economic recovery and macroeconomic stability.\n\nZimbabwe International Trade Fair (ZITF)\n\nAs we now transition into the implementation of National Development Strategy 2 (NDS2), our focus must decisively shift from low-value, low-technology manufacturing to high-value, technology-intensive, and knowledge-driven production systems, he said.\n\nThis strategic shift is being guided by key policy documents, including the Zimbabwe National Industrial Development Policy (ZNIDP) 2024-2030 and the Zimbabwe Industrialisation and Resilience Growth Plan (ZIRGP).\n\nThe ZIRGP (2024-2025) acts as a transitional framework aligning industrial policy with NDS2 (2026-2030), following the conclusion of the National Industrial Development Policy (2019-2023) in December last year.\n\nDesigned to address the immediate challenges facing the manufacturing and commercial sectors, the plan lays the groundwork for accelerated industrial growth in line with Zimbabwes Vision 2030 goals. These frameworks provide a clear roadmap for enhancing value addition, increasing industrial output, and strengthening cross-sectoral linkages, said VP Chiwenga.\n\nThe IBC provides a platform for Government leaders, policymakers, and industry experts to engage in high-level dialogue on economic priorities, with a strong focus on industrialisation as a driver of growth and competitiveness.\n\nPresident Mnangagwa\n\nVP Chiwenga highlighted President Mnangagwas call for a whole-of-government and multi-sectoral approach, urging collaboration across government departments, industry, and academia.\n\nThis integrated approach is essential for overcoming current economic challenges and fostering sustainable industrial growth, he noted.\n\nHe also stressed the importance of innovation and called on the private sector to deepen partnerships with academic and research institutions to commercialise science-based solutions.\n\nZimbabwe must learn from economies that have advanced through robust partnerships between universities and industry. In todays fast-evolving global landscape, the demand for home-grown solutions has never been more urgent, he said.\n\nTo this end, the Government has prioritised re-industrialisation by strengthening key value chains in manufacturing, mining, agriculture, and infrastructure.\n\nAfrican Continental Free Trade Area\n\nIn the manufacturing sector, average capacity utilisation has increased to 50 percent, up from 36 percent in 2019.\n\nWhile this is a significant improvement, Government remains committed to advancing policies that support import substitution, research and development, commercialisation of research outputs, local content development, and the suppression of counterfeit goods.\n\nThese policies aim to deepen value chain integration and enhance industrial output. Furthermore, the establishment of a revolving industrial development fund will provide essential support to distressed companies. This initiative is expected to catalyse investment in sectors such as agro-processing, steel manufacturing, and pharmaceuticals, said VP Chiwenga.\n\nInfrastructure, especially energy, remains a cornerstone of Zimbabwes industrial strategy, he said. The Government is actively diversifying the national energy mix by integrating solar, wind, gas, nuclear, and waste-to-energy solutions alongside hydro and thermal sources. VP Chiwenga said Independent Power Producers (IPPs), including captive power projects by mining firms, would play a pivotal role in improving energy security, with several projects expected to come online in the second quarter of the year.\n\nHe cited major developments such as the 20MW water heat recovery cogeneration power plant by Dinson Iron and Steel in Manhize, and a 240MW thermal power project powered by coke oven gas by Hwange Zhong Zhing Heli.\n\nWe also commend the recently commissioned Palm River Metallurgy Company in Beitbridge, which stands as a model of sustainable mining practices, low greenhouse gas emissions, minimal waste production, and energy self-sufficiency through recycling, he said.\n\nVP Chiwenga encouraged other energy sector stakeholders to adopt similar technologies to strengthen energy security and support economic growth.\n\nHe also commended the efforts of industrial players and highlighted the importance of aligning Zimbabwes industrialisation ambitions with the African Continental Free Trade Area (AfCFTA).\n\nBy scaling up industrial capacity, Zimbabwe can position itself as a key player in the continental value chain, enhance global competitiveness, and drive inclusive economic growth, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-11.56.39_5968a28b-680x380.jpg",
            "description": "Nqobile Bhebhe, Zimpapers Business Hub ZIMBABWE’S push for economic transformation is firmly rooted in the establishment of a robust industrial base, one that fosters sustainable and inclusive growth, Vice-President Constantino Chiwenga said yesterday. Addressing delegates at the Zimbabwe International Trade Fair (ZITF) 2025 International Business Conference (IBC), held under the theme “Revitalising Industrialisation for Zimbabwe’s […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "ZITF secures US$12million infrastructure funding",
            "url": "https://www.chronicle.co.zw/zitf-secures-us12million-infrastructure-funding/",
            "content": "Nqobile Bhebhe, Zimpapers Business Hub\n\nTHE Zimbabwe International Trade Fair (ZITF) Company has secured a partner who has agreed to provide US$12 million for the construction of a modern shopping centre at the companys exhibition site.\n\nThe ZITF Company plays a strategic role in Zimbabwe, organising and hosting the countrys premier annual trade exhibition, ZITF, which is a critical platform for investment promotion, business linkages, and policy dialogue. The exhibition provides an ideal platform for potential investors to engage with Zimbabwean businesses and Government officials, showcasing various opportunities across the countrys key sectors. The ZITF Companys mandate aligns with the national goals of re-industrialisation, economic diversification, and competitiveness.\n\nThe coming on board of the funding partner marks a major milestone in the transformation of the ZITF Companys real estate within the exhibition grounds in Bulawayo into a modern trade and exhibition hub.\n\nThis planned emporium is part of a broader redevelopment initiative that includes the construction of a 5 000-seater international convention centre and two hotels: a five-star boutique hotel and a four-star facility.\n\nOnce completed, the improved premises will be rebranded to Zimbabwe International Conference and Exhibition Smart City (ZICES), in line with the national vision to promote technological advancement and environmentally sustainable infrastructure.\n\nThe transformation is embodied in the ZITF Companys Visionary Masterplan, launched in 2023, which outlines the strategic framework to position Bulawayo as Zimbabwes premier destination for world-class exhibitions and conferencing.\n\nZITF Company chairman Mr Busisa Moyo gave an update of this development at the ongoing International Business Conference (IBC) in Bulawayo yesterday.\n\nI am pleased to announce just very briefly, that last year we unveiled our ambitious plan to upgrade ZITF grounds into a smart exhibition city. And we have made a lot of progress and found a partner to develop a modern shopping centre near the arena area.\n\nThey have committed to invest US$12 million into the development of this retail shopping centre.Mr Moyo further revealed that expressions of interest have been invited for the development of the proposed convention centre and hotel precinct.\n\nWe have opened up to expressions of interest to develop the convention centre, the four- and five-star hotel precinct also on ZITF grounds, in line with NDS1 (National Development Strategy 1) and the follow-up in NDS2 to upgrade exhibition facilities and the MICE industry, so that we continue to attract high-calibre exhibitions and exhibitors.\n\nAccording to the ZITF Company, the envisioned ZICES precinct will include a 5 000-capacity international convention centre, a 500-room hotel directly linked to the centre, and a five-star boutique hotel designed to accommodate visiting heads of state and VIPs. In addition to these anchor developments, over 25 existing structures of historical significance will be preserved and modernised to align with the new architectural vision.\n\nReflecting on the ZITF Companys 65th anniversary, Mr Moyo said the milestone celebrates national resilience, economic progress, and a steadfast commitment to industrial advancement.\n\nMore than just a celebration, this Blue Sapphire edition signals our continuous push towards fostering economic transformation, attracting investment and cementing Zimbabwes standing in local, regional, and global markets. As an institution dedicated to advancing trade and industrialisation, it is a truly ground-breaking occasion, he said.\n\nMr Moyo also highlighted the organisations pivotal role in national development.\n\nThe ZITF Companys role is multifaceted, with a focus on showcasing Zimbabwes economic and industrial potential. We project what is happening in Zimbabwe to the world, connect local businesses with global partners, and promote trade and investment opportunities.\n\nSpeaking to an audience that included Vice President Constantino Chiwenga, Mr Moyo reaffirmed the importance of industrialisation in Zimbabwes development agenda.\n\nIt is important to note that industrialisation is the bedrock of sustainable economic growth, and for Zimbabwe to be globally competitive, he said.\n\nHeld under the theme Revitalising Industrialisation for Zimbabwes Economic Resurgence, the IBC remains Zimbabwes premier platform for strategic dialogue, convening policymakers, Government officials, and industry leaders to chart the way forward for sustainable, inclusive growth and enhanced global competitiveness.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fds.jpg",
            "description": "Nqobile Bhebhe, Zimpapers Business Hub THE Zimbabwe International Trade Fair (ZITF) Company has secured a partner who has agreed to provide US$12 million for the construction of a modern shopping centre at the company’s exhibition site. The ZITF Company plays a strategic role in Zimbabwe, organising and hosting the country’s premier annual trade exhibition, ZITF, […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Creative economy in focus as ZITF Media Indaba returns to Bulawayo",
            "url": "https://www.chronicle.co.zw/creative-economy-in-focus-as-zitf-media-indaba-returns-to-bulawayo/",
            "content": "Bruce Ndlovu\n\nMEDIA professionals, academics and policymakers are set to converge at the National Gallery of Zimbabwe in Bulawayo today, for the third edition of the Zimbabwe International Trade Fair (ZITF) Media Indaba, hosted by the Ministry of Information, Publicity and Broadcasting Services.\n\nRunning under the theme: Celebrating the Creative Economy for Industrial Growth, this years Indaba aims to bring together players from Bulawayos vibrant creative sector with a wide range of media stakeholders, including journalists, academics and government officials.\n\nThe 2025 Indaba will feature speakers such as United Nations Resident and Humanitarian Co-ordinator Edward Kallon, musician Sandra Ndebele, Lupane State University lecturer Sanelisiwe Sibanda, veteran playwright Thabani Moyo and Zimpapers Institute Acting Principal, Limukani Ncube.\n\nSandra Ndebele\n\nSpeaking to the media at the ongoing ZITF on Wednesday, the Permanent Secretary in the Ministry of Information, Publicity and Broadcasting Services, Nick Mangwana, said the Indaba is designed to unify stakeholders under one roof to foster collaboration and drive a shared vision.\n\nWell be engaging on all matters concerning the media and developments within the sector, including the industrial challenges we face.\n\nIts an enlightening platform  not only is it a space for open discussion, where media practitioners can express themselves as key players, but it also offers a rare opportunity to speak directly to policymakers about issues that are often difficult to raise elsewhere, said Mangwana.\n\nMr Edward Kallon\n\nNcube noted that the timing of the Indaba could not be more appropriate, offering a critical opportunity for media and creative industry stakeholders to chart a collective path forward in an ever-evolving landscape.\n\nIts a timely and welcome engagement, perfectly aligned with the spirit of the ZITF and fittingly hosted in Bulawayothe cultural and artistic heartbeat of Zimbabwe. This discussion will underscore the transformative power of creativity and innovation as key drivers of sustainable industrial development.\n\nAs Zimbabwe continues to navigate the global economic landscape, the creative economy, spanning the arts, media, design, cultural heritage, and digital innovation, is proving to be a crucial engine for inclusive growth and economic resilience.\n\nOur goal is to bridge the gap between creativity and commerce, celebrating home-grown talent while envisioning a diversified, thriving economy built on ingenuity and cultural depth, said Ncube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cghf.jpg",
            "description": "Bruce Ndlovu MEDIA professionals, academics and policymakers are set to converge at the National Gallery of Zimbabwe in Bulawayo today, for the third edition of the Zimbabwe International Trade Fair (ZITF) Media Indaba, hosted by the Ministry of Information, Publicity and Broadcasting Services. Running under the theme: “Celebrating the Creative Economy for Industrial Growth”, this […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Government unveils fund to support value chains",
            "url": "https://www.chronicle.co.zw/government-unveils-fund-to-support-value-chains/",
            "content": "Judith Phiri, Zimpapers Business Hub\n\nTHE Government has launched the Industrial Development Fund (IDF) to support the strengthening of domestic value chains and promote industrial growth. The financing facility will also anchor import substitution measures and increase the export of value-added goods.\n\nIn a virtual presentation at the Zimbabwe International Trade Fair (ZITF) International Business Conference held during the ongoing 65th edition of ZITF in Bulawayo yesterday, Finance, Economic Development, and Investment Promotion Minister Professor Mthuli Ncube said resources had been set aside for the IDF.\n\nIn the 2025 Budget Fiscal, the Government set aside resources to capitalise the new Industrial Development Fund (IDF). As much as ZWG100 million was provided for in the fiscal budget. The IDF, which is officially launched, will support value chains in pharmaceuticals, agro-processing, cotton and leather among others, he said.\n\nFINANCE, Economic Development and Investment Promotion Minister Professor Mthuli Ncube\n\nMinister Ncube said the Government was also recapitalising the National Venture Capital Company of Zimbabwe, which was established to support start-ups and micro, small, and medium enterprises (MSMEs). The minister said the NVCCZ was providing equity finance and innovative financing solutions, tailored support for start-ups, early-stage, and growing businesses, as well as empowering the generality of Zimbabwean entrepreneurs. He said the NVCCZ was also fostering a dynamic and resilient business ecosystem and driving sustainable economic growth.\n\nZWG108 million was set aside through the 2025 National Budget for the NVCCZ to support upcoming start-ups and MSMEs. The Government policy is focused on sustaining industrialisation and broad-based transformation, as part of the National Development Strategy (NDS1), while supporting productive value chains was a major focus of NDS1, Minister Ncube said.\n\nHe noted that key interventions in the 2025 Budget Statement sought to consolidate gains achieved thus far, particularly in manufacturing, agro-processing and mining sectors. The aim, the Treasury chief said, was to increase domestic value addition and beneficiation to anchor economic transformation.\n\nAfrican Development Bank\n\nIndustrialisation and value chains are central to national economic development and transformation. The importance of value chains in the economy includes driving industrialisation and economic growth, boosting export earnings and reducing the import bill, encouraging innovation and skills development, as well as promoting regional and global competitiveness.\n\nMinister Ncube said the manufacturing sector was also benefiting from support from the African Development Bank (AfDB), which had several targeted projects in 2025. The minister said international partnerships were also crucial for unlocking industrialisation.\n\nGovernments engagement and re-engagement efforts aim to foster these relationships, attract foreign investment and facilitate technology transfer for a modern, competitive industrialised economy.\n\nCommenting on the new IDF, Minister of Industry and Commerce Nqobizitha Mangaliso Ndlovu said affordable financing to support industry was critical.\n\nMinister Nqobizitha Mangaliso Ndlovu\n\nWe acknowledge that the current lending rates in our financial systems are way too high to support the productive sector. I am grateful to President Mnangagwa through the Ministry of Finance, Economic Development, and Investment Promotion, for launching the new IDF today (Wednesday).\n\nThis is a step in the right direction, and through the NVCCZ, details will be made available on how to access the funding. This fund shall revolve, and l am happy that the Treasury has committed to replenishing this fund on an annual basis, which will see the fund grow), he said.\n\nHe expressed hope that the fund will also help to attract private sector funding, guided by the good performance of the fund.\n\nThe conference was organised by the ZITF Company, in conjunction with the National Economic Consultative Forum (NECF) and Confederation of Zimbabwe Industries (CZI). Vice-President Constantino Chiwenga presided over the flagship event and officially opened the Indaba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gfhfr.jpg",
            "description": "Judith Phiri, Zimpapers Business Hub THE Government has launched the Industrial Development Fund (IDF) to support the strengthening of domestic value chains and promote industrial growth. The financing facility will also anchor import substitution measures and increase the export of value-added goods. In a virtual presentation at the Zimbabwe International Trade Fair (ZITF) International Business […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Test of Nerves. . .Chevrons survive collapse scare to register a famous win",
            "url": "https://www.chronicle.co.zw/test-of-nerves-chevrons-survive-collapse-scare-to-register-a-famous-win/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nSEVEN long years. Four winless Tests. A Blessing Muzarabani at his very best. A record chase achieved. A historic ground witnessed it. And at last, Zimbabwes Chevrons have roared back into the Test match winners enclosure, a victory that tasted of both redemption and resurrection.\n\nOn a humid Wednesday afternoon at the Sylhet International Cricket Stadium, Zimbabwe defied the odds, the pressure, and the ghosts of near-misses to seal a famous three-wicket win over Bangladesh on day four of the first Test match. It was their first overseas Test win since 2018, also in Sylhet, and their highest successful fourth innings chase in the history of the format.\n\nSet 174 for victory, a total they had never managed before in a Test run chase, the Chevrons began with flair, stumbled midway, and finally crossed the finish line with steel nerves and raw determination. They finished on 174/7 in 50.1 overs, taking a 1-0 lead in the two-match series.\n\nAction from the first Test match between Bangladesh and Zimbabwe at Sylhet International Cricket Stadium\n\nThe change room is going to be nervous. We are not familiar being in these sort of positions, chasing in the fourth innings. It was more nerves of wanting to get over the line, wanting the win more than anything else, admitted Captain Craig Ervine after the match.\n\nThat emotional frankness mirrored what fans and players alike had experienced  a roller-coaster of momentum and mental resilience.\n\nBlessing Muzarabani as player of the match\n\nZimbabwes response with the bat began like a dream. Openers Brian Bennett and Ben Curran blunted the new ball with poise and counter-punched with confidence. Their 95-run opening stand came in just 21 overs  the kind of fearless cricket Zimbabwe has long yearned for in red-ball internationals.\n\nBennett, who top-scored with a fluent 54, posted back-to-back fifties after his first-innings 57, cementing his place as the teams emerging star. Curran chipped in with 44, but once he departed, the wheels wobbled.\n\nFrom 95 without loss, Zimbabwe slumped to 145/6, with Mehidy Hasan Miraz ripping through the middle order to complete a five-wicket haul and reach 200 Test scalps.\n\nThe hosts sensed a collapse; their fielders sparked to life. But the Chevrons refused to let history repeat itself.With nerves fraying, Wellington Masakadza added a crucial 12 runs before falling with just 13 runs still required.\n\nThen, it was up to Wessly Madhevere and Richard Ngarava, calm under fire, to navigate the final stretch.Madhevere, cool as ever, stroked the winning boundary to finish unbeaten on 19 off 55 balls. Ngarava stood tall at the other end on 4 not out, and Zimbabwe erupted in joy. Seven years of away-Test frustration, gone in a flash of brilliance.\n\nIf Zimbabwes batters built the house, it was Blessing Muzarabani who laid the foundation. The tall quick was unplayable at times, finishing with career-best match figures of 9 for 122  the most by a Zimbabwean bowler in Bangladesh. His 6/72 in the second innings shattered Bangladeshs middle order and dragged Zimbabwe into a winnable position.\n\nIn the process, Muzarabani also became the joint-fastest Zimbabwean to 50 Test wickets, matching the legendary Heath Streak by achieving the milestone in just 11 matches.\n\nIts always about doing the job for the team. The numbers are nice, but winning  thats what matters, said Muzarabani after being named Player of the Match.\n\nFor Ervine, Muzarabanis efforts were the heartbeat of Zimbabwes resurgence.Blessing was our strike bowler in this Test match. I was giving him short bursts. I thought Richie and Vicky had important roles holding the attack. Welly and Wessly bowled well too. In between those spells, it was important not to leak too many runs. When Blessing came back and bowled in the majority of his spells, he caused a lot of problems, he said.\n\nBangladesh began day four on 194/4, leading by 112. But the Chevrons came out hunting. In just 5.3 overs of the morning session, they picked up three wickets, rattling the hosts and shifting momentum. From 194/4 to 255 all out, it was a collapse Bangladesh could not recover from  six wickets for 62 runs.Ervine praised the early breakthroughs.\n\nWe wanted to get early wickets. Getting Shanto out as early as that in the first over, was great for us. I thought the way Bless started was outstanding. He gave us the opportunity to put the squeeze on.\n\nThis wasnt just a win  it was a statement. The Chevrons last away Test victory came in Sylhet in 2018, and in a twist of poetic symmetry, the same venue bore witness to their rebirth in 2025. It also marked Zimbabwes first Test win since 2021, and only their fourth ever overseas win in the longest format.\n\nConditions at Sylhet had been a mystery at the start of the match.We expected there to be a little bit of grass. We saw that in the game against Sri Lanka. Looking at the history in Sylhet, there is a possibility of preparing turning wickets. We werent too sure how it was going to play. We felt that seamers would play a big role in it, said Ervine.And play a role they did.\n\nWith one game to go in the series, the Chevrons have already written a new chapter in their red-ball journey  one filled with promise, belief, and the kind of grit that wins matches on foreign soil.\n\nI think the more Tests you can win, you will be on the radar. As tough as Tests are, it is what every player wants to play and get better at. It really does test you over four or five days. The smaller teams want to play good hard Test cricket against tough opposition. Thats the only way you will improve as a team, Ervine said.\n\nZimbabwe now heads to Chattogram for the second and final Test starting April 28. A draw would secure a famous series win on foreign soil  something last achieved in Bangladesh in 2001.\n\nWe are really confident after winning a Test match. You know that you can get over the line. We have to reassess in Chittagong. Our mindset is going to be extremely crucial, especially after winning in Sylhet, said Ervine.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gfdgh.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub SEVEN long years. Four winless Tests. A Blessing Muzarabani at his very best. A record chase achieved. A historic ground witnessed it. And at last, Zimbabwe’s Chevrons have roared back into the Test match winners’ enclosure, a victory that tasted of both redemption and resurrection. On a humid Wednesday afternoon […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Navaya ready for Bosso showdown",
            "url": "https://www.chronicle.co.zw/navaya-ready-for-bosso-showdown/",
            "content": "Innocent Kurira, Zimpapers Sports Hub\n\nTHE stage is set for one of the most emotionally charged fixtures of the Castle Lager Premier Soccer League season so far, as red-hot striker Washington Navaya gears up to lead TelOne against his former employers, Highlanders, in a blockbuster encounter this Saturday at Ascot Stadium in Gweru.\n\nWith seven goals in seven matches, Navaya is the leagues most lethal marksman at the moment and the man who has powered TelOne into fifth place on the log standings. Just one point separates them from Highlanders, who are seventh, adding extra spice to an already mouth-watering contest.\n\nBut for Navaya, this isnt just another game. Its personal.The 1.81m striker, who once called Highlanders home, has undergone a footballing rebirth since rejoining TelOne at the start of this season. His efforts were recently rewarded with the PSL Player of the Month award for March, a fitting nod to a player now operating at the peak of his powers.\n\nCastle Lager Premier Soccer League\n\nTelOne coach, Herbert Jompano Maruwa, however, is preaching calm amid the emotional whirlwind.He is doing well. He must not put himself under pressure, said Maruwa. He must not let the fact that he is playing his former side get to him. He must just focus on his game and what he can deliver for the team.\n\nMaruwa knows whats at stake. A victory over Highlanders would not only send a statement to the rest of the league, but would also reinforce TelOnes transformation under his stewardship. A team that flirted with relegation last season is now chasing a top-eight finish and possibly more.\n\nIts a massive game. Highlanders are a big team. But we also have a good team. Weve had a decent start, and I can say so far, so good, Maruwa said. They have huge support and Im sure our boys will be able to manage the pressure.\n\nIndeed, the Wi-Fi Boys have been a team reborn in 2024. Key to their revival has been smart recruitment, with Frank Makarati, the former Dynamos captain, anchoring the defence, while Bruno Mtigo from Ngezi Platinum Stars and Gerald Bero add bite in midfield. Up front, Tawanda Macheke has partnered Navaya to form a dynamic duo that has terrified defences.\n\nBut it is Navaya, who remains the story.His journey has come full circle. He first turned out for TelOne during their maiden top-flight campaign in 2019.\n\nWhen the club was relegated, he joined Highlanders in search of bigger challenges. Now, back at the very club that gave him his PSL breakthrough, Navaya is thriving and plotting to silence the team he once played for.\n\nWhile Saturdays showdown is undoubtedly the headline act, the PSL weekend is stacked with compelling fixtures across the country.\n\nWeekend FixturesFriday:Herentals vs GreenFuel (Rufaro Stadium)\n\nSaturday:TelOne vs Highlanders (Ascot Stadium), Bikita Minerals vs Ngezi Platinum Stars (Gibbo Stadium), Yadah vs CAPS United (Rufaro Stadium), FC Platinum vs Triangle (Mandava Stadium), ZPC Kariba vs Scottland (Nyamhunga Stadium), Simba Bhora vs MWOS (Wadzanayi Stadium), Manica Diamonds vs Chicken Inn (Sakubva Stadium)\n\nSunday:Dynamos vs Kwekwe United (Rufaro Stadium)With so many storylines to follow, from Navayas personal mission to the log leaders duel in Shamva, this weekend is poised to reshape the early-season narrative of Zimbabwes top-flight league.But make no mistake all eyes will be on Ascot Stadium, where Washington Navaya faces his past in a bid to shape TelOnes future.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/uil.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub THE stage is set for one of the most emotionally charged fixtures of the Castle Lager Premier Soccer League season so far, as red-hot striker Washington Navaya gears up to lead TelOne against his former employers, Highlanders, in a blockbuster encounter this Saturday at Ascot Stadium in Gweru. With seven […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        },
        {
            "title": "Zimnat Microfinance pioneers invoice discounting for SMEs",
            "url": "https://www.chronicle.co.zw/zimnat-microfinance-pioneers-invoice-discounting-for-smes/",
            "content": "Tapiwanashe Mangwiro\n\nZIMNAT Microfinance has pioneered a new financial product, the Invoice Discounting Facility, designed to ease cash flow constraints for small and medium-sized enterprises (SMEs).\n\nThe announcement was made during the ongoing 56th edition of the Zimbabwe International Trade Fair (ZITF), being held under the theme Industrialisation: Crafting an Integrated Economic Landscape.\n\nThe facility allows SMEs to access up to 80 percent of the value of approved unpaid invoices in advance, effectively providing short-term working capital. This is particularly critical for businesses that experience delays between delivering goods or services and receiving payments.\n\nInvoice discounting is a financing method where businesses use outstanding invoices as collateral to receive immediate cash from a lender. The lender advances a percentage of the invoice value and recovers the funds once the customer settles the invoice.\n\nThis arrangement helps businesses maintain liquidity without waiting out long payment cycles.Lloyd Borerwe, managing director of Zimnat Microfinance, said the facility was developed in response to long-standing complaints from SMEs about delayed payments.\n\nSlow invoice settlements have restricted growth in many sectors. This facility is meant to free up capital quickly so businesses can meet day-to-day operational demands or take on new contracts, Mr Borerwe said.\n\nThe facility is open to SMEs across various sectors, including contractors, agro-dealers, service providers, and informal traders. It is designed to be accessible with minimal collateral requirements.\n\nTatenda Marongwe, Zimnat group marketing executive, noted that the initiative emerged from direct feedback.\n\nOur clients consistently pointed to payment delays as a major operational bottleneck. This product addresses that issue head-on.\n\nEconomist Dr Tinashe Moyo said the introduction of invoice discounting could support economic stability.SMEs are vital to employment and local supply chains. Improving their access to liquidity helps ensure continuity in business operations, particularly for those handling large or seasonal contracts.\n\nMs Chihota, who operates in the catering sector, said, There are periods when we are waiting for payments from big clients while needing to prepare for upcoming events. This facility will definitely fill that financial gap.\n\nThe product is being rolled out nationwide, with SMEs encouraged to take the opportunity to keep their businesses oiled and also give them the opportunity to offer longer credit terms.\n\nZimnat Microfinance is part of Masawara Holdings and is affiliated with the Sanlam Group, one of the continents leading financial services firms. The new facility is part of Zimnats broader strategy to expand access to finance for under-served business segments in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fgbr.jpg",
            "description": "Tapiwanashe Mangwiro ZIMNAT Microfinance has pioneered a new financial product, the Invoice Discounting Facility, designed to ease cash flow constraints for small and medium-sized enterprises (SMEs). The announcement was made during the ongoing 56th edition of the Zimbabwe International Trade Fair (ZITF), being held under the theme “Industrialisation: Crafting an Integrated Economic Landscape.” The facility […]",
            "time": "09:10",
            "date": "24 Apr 2025"
        }
    ]
}