{
    "news": [
        {
            "title": "President delivers ICT tools to Junior Parliamentarians",
            "url": "https://www.chronicle.co.zw/president-delivers-ict-tools-to-junior-parliamentarians/",
            "content": "Lovemore Kadzura, Mutare Bureau\n\nPRESIDENT Mnangagwa has availed tablets and other information communication technology tools to all members of the Junior Parliament of Zimbabwe across the country as per his promise last year, and this will assist in improving digital literacy, among the youths.\n\nLast weekend, Junior Parliamentarians from Manicaland Province received their gadgets at a function officiated by the Minister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza, who said President Mnangagwa was fulfilling a promise he made to the young leaders during the 32nd Junior Parliament Session.\n\nAdv Mugadza said Government seeks to equip 1,5 million youths with digital skills by 2030, and youths must use the acquired skills to participate in national economic programmes for the development of the country.\n\nThe donation is in response to a plea made by Junior parliamentarians to President Mnangagwa during the official opening of the 32nd Session of the Junior Parliament of Zimbabwe on July 3, 2024. Our President is a listening leader with a clear vision.\n\nManicaland Provincial Affairs Minister, Advocate Misheck Mugadza\n\nHe listens to peoples concerns and addresses them promptly, he said.Adv Mugadza said the donation resonates well with the Presidents National Digital Ambassador Programme that seeks to empower 1,5 million young Zimbabweans with digital skills by 2030.\n\nThis initiative will go a long way in enhancing digital literacy and skills among Zimbabwean citizens, and empowering a new generation of professionals who can contribute to technological innovation. This digital skills programme is tailor-made to cover the digital divide as youths from remote areas have access to technology, he said.\n\nThrough the programme, Adv Mugadza said, Junior MPs will acquire skills in digital literacy, online safety and effective communication.\n\nYou will have access to a range of digital tools and resources to support your academic and professional pursuits. I would like to applaud the Ministry of Youth, Empowerment, Development and Vocational Training for the Junior Parliament concept as this gives young leaders a chance to become active participants in the developmental process of our country, he said.\n\nThis is in the spirit of leaving no one and no place behind as espoused by President Mnangagwa. As we navigate through the digital age, it is evident that digital literacy is crucial for the empowerment of young people to access education, employment and economic opportunities. This means we will continue to prioritise digital skills development and ensure that young people are adequately equipped to thrive in an increasingly inter-connected world.Adv Mugadza said Manicaland Province has immense potential for growth and enterprise development, and to fully capitalise on this, youths must be equipped with the relevant skills.He said Government is spearheading the transformation of vocational training centres and aligning them with global trends, where modern practical skills that empower youths for both personal and national development are offered.\n\nJunior Parliament Second vice president, Luke Mavada, applauded Government for availing the tablets to young people, saying they will help make learning much easier.\n\nThe Government has done a very noble thing to give gadgets to members of the Junior Parliament and Cabinet. These tools will help us in our studies. They will help us in conducting research and for communication purposes.\n\nThese gadgets will help in our education. We are the generation of new technological advancement, and these tools will help us a lot, said Mavada.\n\nCurren Masakura, the Junior Minister of Information, Publicity and Broadcasting Services, said the tablets will enhance their adaptation to the Heritage-Based Curriculum being implemented in schools.\n\nI would like to extend my deepest gratitude to President Mnangagwa for availing these essential gadgets for us.This is empowerment of youths who constitute the majority of the population. This will improve our digital literacy, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/qf-680x380.jpg",
            "description": "Lovemore Kadzura, Mutare Bureau PRESIDENT Mnangagwa has availed tablets and other information communication technology tools to all members of the Junior Parliament of Zimbabwe across the country as per his promise last year, and this will assist in improving digital literacy, among the youths. Last weekend, Junior Parliamentarians from Manicaland Province received their gadgets at […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Major overhaul for Cross Dete-Binga road",
            "url": "https://www.chronicle.co.zw/major-overhaul-for-cross-dete-binga-road/",
            "content": "Raymond Jaravaza recently in Binga\n\nCROSS Dete-Binga Road is set for major rehabilitation starting this month after two mining companies in Matabeleland North province have committed to partnering the Government to accelerate road works on critical areas.\n\nThe route is a key link between Binga and the rest of the country and is strategic for tourism business as well as commercial supplies.\n\nHowever, due to incessant rains, the road has deteriorated as it is now filled with potholes, with some sections heavily damaged making it very difficult for traffic to negotiate.\n\nLithium investor, Kamativi Mining Company (KMC) which started operations from the old tin mine last year has already rehabilitated a 20km stretch of the road.\n\nMuchesu Coal Mine, owned by a British investor  Contango Holdings, a strategic coal asset in Southern Africa with over 2,6 billion tonnes of coking and thermal coal, has also been roped in to assist in the rehabilitation of the road.\n\nMatabeleland North Minister of State for Provincial Affairs and Devolution, Richard Moyo, on Friday met representatives of KMC and Muchesu Coal Mine together with Binga Rural District Council chief executive officer Mr Joshua Muzamba and provincial road engineers to workout how the road rehabilitation project could be expedited.\n\nA damaged section of Cross Dete-Binga road. The road is set to undergo rehabilitation\n\nMinister Moyo told Chronicle that the partnership between Government and mining companies was critical in rehabilitating the potholed road to ensure smooth flow of traffic.\n\nA resolution was made at the meeting with officials from Muchesu Coal Mine and Kamativi Mining Company, road engineers and the Binga RDC CEO that rehabilitating the Cross Dete-Binga Road is a priority project that should start as soon as possible, said Minister Moyo.\n\nHe said the road engineers were tasked to find out the materials needed for pothole patching from Cross Dete to Binga and that information is supposed to be available in the next few days.\n\nIn the past, Binga had no investors to talk about but all that has changed because of the leadership of President Mnangagwa which has brought in big mining companies to operate in Matabeleland North Province, said Minister Moyo.\n\nHe said what is encouraging is that the mining companies understand how important it is to partner Government in implementing key projects such as rehabilitation of roads which they also use.\n\nMinister Moyo said the pothole patching project will cover the whole of Cross Dete-Binga Road as the area received a lot of rains this year, which unfortunately caused significant damage to the road.\n\nKamativi Mining Company has in the past rehabilitated a section of the road, which is still in a good state and we want to make sure that we rehabilitate the whole road up to Binga, said Minister Moyo.\n\nKMC has resurfaced a stretch from the Mines main gate to the Cross Dete-Binga road up to the roundabout.The road that connects from the roundabout to the business centre has also been tarred, including the one that passes through the police station to Transmedia transmitters.\n\nAnother tarred section of the road leading to the community hall has been named after Chief Nekatambe as it falls under his jurisdiction.\n\nMr Albert Savanhu, a truck driver said the bad state of the road has made driving to Binga a nightmare.Unfortunately there is no other route that we can use from Hwange to Binga except the Cross Dete-Binga Road but driving on that road is now a nightmare, he said.\n\nSome of the potholes are so big that even haulage trucks are forced off the tarred road onto the dusty side roads, said Mr Savanhu.\n\nChronicle observed that the incessant rains received across the country, including Binga, have damaged roads and bridges making if difficult to reach places such as Tinde in Binga.\n\nA small bridge which is about five kilometers from Tinde High School, was extensively damaged following heavy rains and motorists have to exercise extreme caution when navigating their way.\n\nLocal business owner Mr Patrick Chisulu said if some of the small bridges are not attended to, the area will be cut off from the rest of Binga.\n\nWe now rely on two commuter omnibuses that travel to Cross Dete every day to buy stock for our shops. While we are happy that Binga received good rains this year, we are at the risk of being cut off from the rest of Binga if some of the bridges are not fixed, Mr Chisilu.\n\nCross Dete-Binga Road is one of the major highways, which Government has identified as a critical road in need of urgent attention.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/7656i.jpg",
            "description": "Raymond Jaravaza recently in Binga CROSS Dete-Binga Road is set for major rehabilitation starting this month after two mining companies in Matabeleland North province have committed to partnering the Government to accelerate road works on critical areas. The route is a key link between Binga and the rest of the country and is strategic for […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "15 goals in Week Two… Bosso, TelOne highest scorers",
            "url": "https://www.chronicle.co.zw/15-goals-in-week-two-bosso-telone-highest-scorers/",
            "content": "Fungai Muderere,[emailprotected]\n\nTHE Castle Lager Premier Soccer League (PSL) Week Two fixtures produced a total of 15 goals to take the seasons tally to 25.The seasons opening weekend saw 10 goals being scored.\n\nThe Week Two local football menu saw Highlanders striker Brighton MaNinja Ncube, scoring the first hattrick of the season.In the past campaign, two hattricks, 20 braces and 10 own goals were scored all year.\n\nTwo of Ncubes goals came from the penalty spot in a season that has seen a red card being shown to Kwekwe United goalkeeper Elton Nechirwe and another one being shown to Anotidaishe Gwatidzo of Yadah.\n\nNechirwe was sent off for handling the ball outside the penalty area to deny Highlanders Reason Sibanda a clear goal-scoring opportunity.\n\nGwatidzo, was sent for an early shower last weekend when Yadah played against Chicken Inn at the Heart Stadium.In Week Two action, three of the 15 goals came from the spot with Bossos Ncube netting two and one from Billy Veremus when he equalised for MWOS when they drew one all with Bikita Minerals.\n\nWhile Highlanders and TelOne were the biggest scorers of the weekend, moneybags Scottland FC are the only team that is yet to drop points.\n\nThey have a 100 percent record that has seen them account for Triangle United (1-0) and CAPS United (2-0).Home wins were posted by Highlanders, TelOne, FC Platinum and Ngezi Platinum Stars when they beat Kwekwe United, Triangle, Manica Diamonds and Greenfuel respectively.\n\nThere was one away triumph (CAPS United 0 Scottland 2).Ten teams, Kwekwe United, Makepekepe, Yadah, Chicken Inn, Herentals, Dynamos, Manica Diamonds, Greenfuel, ZPC Kariba and Simba Bhora failed to find the back of the net.\n\nThree games ended in goalless draws and these are: (Yadah 0 Chicken Inn 0, Herentals 0 Dynamos 0, ZPC Kariba 0 Simba Bhora0).\n\nOne match (Bikita Minerals 1 MWOS 1) was a goal scoring stalemate.\n\nPSL Scorers3 Brighton Ncube (Highlanders)\n\n2 Washington Navaya (TelOne)\n\n1 Tinashe Ruzive (Bikita Minerals), Jayden Bakare (CAPS United), Vincent Nyangulu (FC Platinum), Perfect Chikwende (Greenfuel), Prince Chama, Kundai Sangare (Herentals), Melikhaya Ncube (Highlanders), Masimba Mambare (Kwekwe United), Fortune Binzi (Manica Diamonds), Salif Cheya (Mwos), Billy Veremu (MWOS), Ashwan Karengesha, Malvin Gaki (Ngezi Platinum), Tymon Machope (Scottland), Sydney Urikhobo (Scottland), Tawanda Macheke , Bruno Mtigo Blessing Sahondo (TelOne)Menford Mudzimu (Triangle) Own goal Blessing Chiota (Triangle) vs Scottland Week One  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/QSAQ.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw THE Castle Lager Premier Soccer League (PSL) Week Two fixtures produced a total of 15 goals to take the season’s tally to 25. The season’s opening weekend saw 10 goals being scored. The Week Two local football menu saw Highlanders striker Brighton “MaNinja” Ncube, scoring the first hattrick of the season. In […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Traders unveil innovative solutions to transform cross-border commerce",
            "url": "https://www.chronicle.co.zw/traders-unveil-innovative-solutions-to-transform-cross-border-commerce/",
            "content": "Trish Mukwazo,[emailprotected]\n\nTHE Zimbabwe Cross-Border Traders Association (ZCBTA) has unveiled a series of initiatives aimed at formalising and securing cross-border trade while curbing smuggling and corruption.\n\nThe new measures will not only streamline customs processes but also provide financial and security benefits to traders.Speaking during a meeting with ZCBTA members on Sunday, the organisations president, Mr Killer Zivhu, outlined a plan to differentiate traders from ordinary travellers to ensure a more efficient border clearance process.\n\nUnder the new system, traders goods will be transported exclusively by registered cross-border transport operators, commonly known as omalayitsha, while travellers will be encouraged to use their own buses.\n\nMr Zivhu said this strategy will significantly reduce delays at roadblocks, as traders will no longer have to endure long clearance processes.\n\nHe said goods would be officially declared at the border, with members receiving declaration documents to present in their shops and flea markets to promote accountability and legal trade.\n\nFollowing rising cases of robberies targeting Zimbabwean traders in neighbouring countries such as South Africa, ZCBTA has partnered with banks to introduce a Rand Visa Card, which will allow members to make secure transactions without carrying large sums of cash.\n\nPeople will be using this visa card when they travel outside the country. It has a lot of benefits that will be explained during the official launch in Bulawayo, said Mr Zivhu.\n\nHe said they are rolling out a funeral insurance scheme and a banking initiative tailored for cross-border traders.To further facilitate trade, ZCBTA is in talks with financial institutions to assist in transporting goods from key trading hubs such as South Africa, Tanzania and Botswana. This move aims to reduce logistical challenges and ensure that traders can access goods at competitive prices.\n\nBeyond logistics and financial security, ZCBTA is spearheading efforts to secure dedicated trading spaces for its members. Mr Zivhu revealed that an agreement has been reached with a bank to finance the purchase of land for the construction of a formal marketplace. The project will be self-sustaining, with the bank recovering its investment through rentals from traders. With a membership of over 350 000 traders in Bulawayo alone, ZCBTA is positioning itself as a key player in the countrys economic growth.\n\nMr Zivhu said the association is aligning its initiatives with the countrys Vision 2030 development agenda by promoting formalised trade, financial inclusion and digital commerce.\n\nMost of our traders are leveraging social media platforms such as Facebook to sell their products. The majority of these goods are imported, making structured cross-border trade a crucial component of the national economy, he said\n\nAs cross-border traders, we want to participate and be part and parcel of the Vision 2030.Mr Zivhu said they have also proposed a housing development initiative for their members, many of whom do not own homes.We also told the bank that most people dont own houses, and they also agreed in principle that they can develop if we get land\n\nso that traders can build their own homes and pay the bank, he said.Cross-border traders welcomed the initiatives, with Ms Netsai Madzivire highlighting the potential benefits of improved trade logistics. This will help us travel to more destinations like Dubai and source products more efficiently, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yrjtj.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com THE Zimbabwe Cross-Border Traders Association (ZCBTA) has unveiled a series of initiatives aimed at formalising and securing cross-border trade while curbing smuggling and corruption. The new measures will not only streamline customs processes but also provide financial and security benefits to traders. Speaking during a meeting with ZCBTA members on Sunday, the […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Small grains champion awarded for climate smart farming",
            "url": "https://www.chronicle.co.zw/small-grains-champion-awarded-for-climate-smart-farming/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nWHEN the skies opened up in Content 1 Village, Ward 9 in Umguza District in January this year, local farmer Ms Agnes Moyo took a leap of faith by allocating more land for traditional grains compared to maize.\n\nWhile maize, a staple crop that she has been growing consistently for over two decades is common, allocating more land for small grains like sorghum and millet, has proved to be a very good decision.\n\nMs Moyo does not regret this bold step as she is poised for a bumper harvest from the one-and-a-half hectares of land that she planted small grains.\n\nBy applying skills she learnt from farmer-field capacity building programmes that she and fellow villagers from Content 1 Village in Umguza District attended and were under the mentorship of their local Agricultural and Rural Development Advisory Services (ARDAS) officer, Ms Moyo meticulously checked on the state of her small grains and applied chemicals when she detected pests in the fields.\n\nYesterday, the communal farmer was awarded for her hard work, resilience and strong will for championing the planting of small grains as a response to climate change challenges that require farmers to shift to drought resistant crops during a field day held at her homestead.\n\nOfficials from ARDAS, Zimbabwe Farmers Union (ZFU), Agricultural Marketing Authority (AMA), Grain Marketing Board (GMB) and representatives of businesses that sell seeds and agro-chemicals, villagers as well as communal farmers from Ward 9 in Umguza District, attended the field day.\n\nThe event showcased a positive story about the resilience and success of planting small grains and that these are not only critical for household food security but are beneficial to health and are climate-smart.\n\nI have been planting maize for many years but the yields kept reducing hence I decided to take a risk and reserve a bigger portion of my land for small grains this year, said Ms Moyo.\n\nThe land where I planted small grains is slightly over one-and-a-half hectares, which is a lot considering that I am a communal farmer and I dont own huge tracts of land.\n\nOwing to rains that came a bit late this season, Ms Moyo said she was encouraged to grow small grains because of their ability to survive harsh and hot conditions in the event of a drought.\n\nThe first heavy rains came in early January, and I knew that I had to settle for short-seasoned small-grain crops, given that we only had two-and-a-half months to expect rains. Over the years, I have realised that growing maize has been risky because when we receive little rain, the entire crop is wiped out, said Ms. Moyo.\n\nShe said she will deliver the bulk of her small grains to the GMB and only keep what is required for family consumption and stockfeed for her chickens. I need money for my childrens school fees and other necessities so I will sell the bulk of the harvest to GMB. Looking back, I do not regret the decision to reserve more land for small grains. The maize crop is also doing well after the good rains so Im happy, she said.\n\nMatabeleland North Ardas provincial agronomist Mrs Zenzele Ndlovu, called for the resuscitation of farmer field schools, which she described as vital for practical lessons.\n\nCommunal farmer Miss Agnes Moyo (right) receives farming inputs from Ardas provincial agronomist Mrs Zenzele Ndlovu at Content 1 village in Ward 9, Umguza District yesterday\n\nA farmer field school is a group-based learning process where farmers carry out experimental learning activities that help them understand the ecology of their farming practices.\n\nThese activities involve simple experiments, regular field observations and group analysis. Knowledge gained from these activities enables participants to make the right farming decisions.\n\nIts important to work hand in hand with local Ardas officers as they are able to tell farmers how much rain is expected each season and that information helps farmers to make decisions on which crops to grow, she said.\n\nThis season farmers were informed that normal to above normal rainfall was expected and those who worked closely with our officers used that information to make informed decisions, said Mrs Ndlovu.\n\nShe said in the past farmers used to shun growing traditional crops such as sorghum, millet and rapoko but these small grains are now popular because people are now aware of their high nutritional value.\n\nGovernment, through the Ministry of Agriculture, Lands, Water, Fisheries and Rural Development, has been urging farmers in dry areas to grow traditional grains and those who took heed of this advice are expecting bumper harvest this cropping season Small grain crops are drought-tolerant and suitable for semi-arid areas such as the Matabeleland region and Masvingo provinces. In the past the value attached to small grains had been so low that some were viewing the crops as varieties for the vulnerable communities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-2qtg.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com WHEN the skies opened up in Content 1 Village, Ward 9 in Umguza District in January this year, local farmer Ms Agnes Moyo took a leap of faith by allocating more land for traditional grains compared to maize. While maize, a staple crop that she has been growing consistently for over two […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Dancing their way to the top… Hwange’s Pezhuba Pachena steals the show at Chivayo’s lobola celebration",
            "url": "https://www.chronicle.co.zw/dancing-their-way-to-the-top-hwanges-pezhuba-pachena-steals-the-show-at-chivayos-lobola-celebration/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nIn a whirlwind of orange and blue colours at the most talked-about lobola ceremony in Marondera this past weekend, Hwange-based Pezhuba Pachena traditional dance group stole the limelight with their captivating performances.\n\nThe outfit, a four-time Chibuku Neshamwari Matabeleland North provincial winner, was undeniably a highlight at socialite Wicknell Chivayos traditional wedding to Lucy Muteke. The event, which was executed with sheer opulence, has become the talk of the town, as Chivayo reportedly paid a staggering US$300 000 as bride price.\n\nFrom videos circulating online, Chivayo went all out for the celebration where a marquee was erected, topping it off with an extravagant after-party featuring star-studded appearances from Jah Prayzah, Killer T, Enzo Ishall and Travellers Band.Pezhuba Pachena delivered a mesmerising performance as the couple made their grand entrance into the marquee after the formalities had concluded.\n\nWicknell Chivayo\n\nTheir dynamic display of marimba, vocals, ngoma and hosho infused the event with a distinctly African essence. Chivayo himself was seen thoroughly enjoying their act, even joining in the dance.\n\nWith elegance, energy and passion, Pezhuba Pachena reaffirmed that talent knows no borders. Their remarkable showcase proved that even in grand and unexpected settings, traditional performers can shine brightly.\n\nThe groups information manager, Bertha Phiri, shared how they secured the prestigious gig.We performed for the couple twice while they were at Matetsi River Lodge in December 2024. We are truly humbled and honoured to have been part of such a significant event. As a group from Hwange, Matabeleland North province, we take pride in showcasing our culture and traditions during what has been dubbed Zimbabwes most iconic Roora day of the century.\n\nIt was a momentous occasion for us, and were grateful for the opportunity to share our heritage with the billionaires family. Being on stage felt surreal. We couldnt believe it was happening, especially during their grand entrance, said Phiri.As four-time winners of the Chibuku Neshamwari competition, Pezhuba Pachenas presence at the high-profile event was well earned.\n\nThe groups members include Abigirl Tshabalala, Bertha Phiri, Londokuhle Tshuma, Ordain Mwembe, Tracy Tembo, Tanyala Lupahla, Russell Shoko, Matengu Mutabani, Kenrick Chitonje, Dennis Mwale, Isaac Zulu and Munzabwa.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/wergg-1.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com In a whirlwind of orange and blue colours at the most talked-about lobola ceremony in Marondera this past weekend, Hwange-based Pezhuba Pachena traditional dance group stole the limelight with their captivating performances. The outfit, a four-time Chibuku Neshamwari Matabeleland North provincial winner, was undeniably a highlight at socialite Wicknell Chivayo’s traditional wedding […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "COMMENT: Cde Modi’s move shows his confidence in Zimbabwe’s economy",
            "url": "https://www.chronicle.co.zw/comment-cde-modis-move-shows-his-confidence-in-zimbabwes-economy/",
            "content": "Retail giant, Sai Mart, owned by Bulawayo businessman and legislator Cde Raj Modi, has taken over all former Choppies Zimbabwe outlets across the country. The retail chain, which is now undertaking a re-branding exercise, has retained all the Choppies Zimbabwe employees, which are estimated to be about 1 100.\n\nThe Botswana-headquartered Choppies retail chain recently exited Zimbabwe saying it wants to focus on sustainable growth and profitability across its regional operations.\n\nThe retail chain, which used to operate 30 grocery stores across the country, entered the Zimbabwean market in 2013 when it acquired several Spar shops and expanded its footprint in 2014 when it opened its distribution centre in Zimbabwe.\n\nThe move by Cde Modi to takeover former Choppies and retain all the workers is very commendable. Fear gripped the workers when Choppies announced that it was exiting Zimbabwe and the decision by Cde Modi to retain all the workers has therefore given them a new lease of life. Instead of just mourning about businesses closing down, we want people like Cde Modi who takeover such businesses because they have confidence in their countrys economy.\n\nWe have said it before that Zimbabweans should take the lead in investing in their country and investment by foreigners should just be a bonus.\n\nCde Modi who is also Deputy Minister of Industry and Commerce said all the former Choppies outlets across the country have been restocked.\n\nWe acquired all the Choppies outlets nationwide and retained all the workers, said Deputy Minister Modi who is leading from the front.\n\nThe countrys detractors were celebrating the closure of retail outlets such as Choppies and citizens like Cde Modi are now shaming them. Zimbabwe last year recorded many positives as far as development is concerned. Instead of building on this success, this year started badly with a number of retail outlets threatening to close due to stiff competition from the informal sector.\n\nWhat is, however, encouraging is that the situation seems to have stabilised. The formal and informal sectors should co-exist as has been the case over the years.\n\nGovernment should be commended for stepping up its fight against smuggling of goods into the country, which were finding their way to the informal sector where they were being sold for ridiculously low prices. This has been giving the informal sector unfair advantage hence it was threatening formal businesses.\n\nZimbabwe has been witnessing the establishment of new companies across the country and many other such projects that have transformed the livelihoods of citizens but the threat by big retail operators to close branches was now sending a wrong message to potential investors.\n\nThe swift Government intervention has stabilised the situation as fewer goods are now being smuggled into the country. Zimbabwe should remain an investment destination of choice in the region and beyond as it remains Open for Business for both its citizens and foreigners.\n\nLet every citizen put shoulder to the wheel as we build the Zimbabwe we all want. Ilizwe lakhiwa ngabaninilo (Nyika inovakwa nevene vayo).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/ssd.jpg",
            "description": "Retail giant, Sai Mart, owned by Bulawayo businessman and legislator Cde Raj Modi, has taken over all former Choppies Zimbabwe outlets across the country. The retail chain, which is now undertaking a re-branding exercise, has retained all the Choppies Zimbabwe employees, which are estimated to be about 1  100. The Botswana-headquartered Choppies retail chain recently […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Mapitsi dreams big",
            "url": "https://www.chronicle.co.zw/mapitsi-dreams-big/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nBOLAMBA Culture Birds female dancer Sinobuhle Dube, popularly known as Mapitsi, is a determined young artiste with a vision of taking African dances to international festivals.\n\nThe talented dancer is gifted in a variety of traditional African dances, including Setapa, Tsutsube, Jerusalema Mbende, Isitshikitsha, Mbakumba, Muchongoyo and Mhande.\n\nAs a member of a group that takes pride in showcasing African cultural heritage through dance, Mapitsi dreams of one day, performing on global stages. She believes this will help preserve and celebrate African traditions worldwide.\n\nI started dancing in 2014. As a child, I admired dancers I watched at shows and as I grew older, I found peace and fulfillment on stage. Dancing allows me to captivate audiences and bring them joy. My ultimate wish is to showcase my talent on international platforms, especially after having performed in South Africa, she said.\n\nLike many artistes in developing countries, Mapitsis journey has not been without challenges.Being an artiste is never easy; it requires passion, resilience and love for the craft to keep going strong. There are tough times when I find myself without work, but I never give up.\n\nThere are also rewarding moments, such as meeting new people and travelling. Above all, this journey has been the most exciting part of my life.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-26y-1.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com BOLAMBA Culture Birds female dancer Sinobuhle Dube, popularly known as “Mapitsi,” is a determined young artiste with a vision of taking African dances to international festivals. The talented dancer is gifted in a variety of traditional African dances, including Setapa, Tsutsube, Jerusalema Mbende, Isitshikitsha, Mbakumba, Muchongoyo and Mhande. As a member of […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Warriors aim to revive World Cup hopes",
            "url": "https://www.chronicle.co.zw/warriors-aim-to-revive-world-cup-hopes/",
            "content": "Tadious Manyepo, Zimpapers Sports Hub\n\nWARRIORS coach Michael Nees, expects his players to perform and recommend themselves for the Africa Cup of Nations when they engage in the upcoming 2026 Fifa World Cup qualifiers to be played throughout this year.\n\nZimbabwe sealed their Nations Cup place last year but the finals, scheduled for Morocco, will only be staged in December, overlapping into January next year.\n\nFor now, all the Warriors focus will be on mending a World Cup campaign that got off to a horrible start with Nees now set to be the third coach set to take charge of the Group qualifiers.\n\nThe German coach will tomorrow name his squad for fixtures against Benin in South Africa and Nigeria in Uyo.Nees took over a Warriors side, sitting at the foot of the six-team Group C with only two points secured by Brazilian coach Baltemar Brito, with draws against Rwanda and Nigeria.\n\nThe Warriors were left searching for their first win of the qualifiers after Jairos Tapera presided over defeats to Lesotho and South Africa in South Africa, effectively falling five points behind surprise leaders, Rwanda.\n\nNow, Zimbabwe need to turn things around when they host Benin at Moses Mabhida in Durban on March 20 before travelling to Nigeria where they will play the Super Eagles in Uyo five days later.\n\nWhile they will try to pick up key points and force their way back into the qualification bid, which Nees says is key, the 57-year-old gaffer wants the players to also use the platform to prove they can fit into the Nations Cup matrix.\n\nThe Afcon is only nine months away and the preparation basically starts immediately.Every game counts for the players. The World Cup qualification will be a hybrid project where we are chasing qualification as well as preparing for the Afcon finals, Nees said.\n\nPlayers can recommend themselves for the Afcon. The competition is open, so they want to be there.And so, on one hand, its a preparation for the Afcon finals while on the other hand, its the qualification for the World Cup as well.\n\nNees also underscored the importance of both the World Cup qualifiers and the Afcon, where there is no room for trying to nurture talent.\n\nIts not a development thing, we have to perform.The German said Zimbabwe are not far off the pace and can as well find their way to the top if they perform well in the remaining qualifiers.\n\nIts a very tight group, there are still six games to go and 18 points to play for. The group is not decided yet for any team, thats it, the team in first place can easily go down.\n\nWe have got to rise up. The group is not decided yet and thats for sure. And even if the group was decided, every team has the responsibility to compete until the final game with the best and maximum effort, because you need to ensure fair competition.\n\nAnd now, is the main project, the World Cup qualification, but the second project is like preparation already, for the Afcon.We have to re-start that World Cup qualification positively. We want to do that, to get the positive mood going, and to do everything in our power to turn the table a little bit around, turn the page and to move up.\n\nAnd thats our approach and now we have to look at what is the next task at hand.Meanwhile, the new Zifa executive led by Nqobile Magwizi is hardly two months in office, but they have already made significant strides in striking partnership deals with different corporates.Just last week, the association inked two agreements for digital enhancement of their operations and technical development.\n\nAnd yesterday, the motherbody unveiled yet another deal, which will see the Warriors getting formal wear from 4May International, for every assignment in the next three years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ASDFFFFQWEF.jpg",
            "description": "Tadious Manyepo, Zimpapers Sports Hub WARRIORS coach Michael Nees, expects his players to perform and recommend themselves for the Africa Cup of Nations when they engage in the upcoming 2026 Fifa World Cup qualifiers to be played throughout this year. Zimbabwe sealed their Nations Cup place last year but the finals, scheduled for Morocco, will […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "4 dead, 3 missing as dam bursts",
            "url": "https://www.chronicle.co.zw/4-dead-3-missing-as-dam-bursts/",
            "content": "Ray Bande and Luthando Mapepa,Harare Bureau\n\nA DAM breach at Bandama Farm (formerly Canterbury Farm) in Chipinge has resulted in the release of large quantities of water downstream, killing four people including a four-year-old girl.\n\nThree people are also missing following the incident, which occurred on Sunday at the property owned by the late national hero and former Commander of 3 Infantry Brigade in Mutare, Brigadier General Eliah Bandama.\n\nLivestock has also been killed while irrigation facilities have been destroyed.A dam breach is the collapse or movement of part of a dam or its foundation such that the dam cannot retain water and in general, the breach results in a release of large quantities of water, posing a risk to people or property downstream.\n\nSpeaking from the site of the incident, Minister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza, who visited the area yesterday to assess the damage and console bereaved families, said search teams are on the ground looking for the missing persons.\n\nI am on the ground and I can confirm that four people have died. Three are still missing. The search continues and we hope that we will be able to find the missing persons soon, said Adv Mugadza.Civil Protection Unit chairman for Manicaland province, Mr John Misi, said among the deceased is a minor who was in the company of her mother who was doing laundry downstream and a man who was fishing.\n\nMinister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza\n\nHe said the other two people were swept away by raging waters downstream.The dam breach occurred at Bandama Farm, formerly known as Canterbury Farm. Although we are waiting for finer details, we are told that there was a female adult who was washing clothes downstream in the company of her two children and one of them  four years old  was swept away and the body was later retrieved.\n\nThe other child who was with her mother, a 15-year-old, was swept away and was left marooned on a piece of land. The teen was later rescued.\n\nThe other person who died was a 30-year-old man who was on a fishing expedition. It happened at a farm that is owned by the late national hero Brigadier Bandamas family. The other two deceased were swept downstream, said Mr Misi.\n\nIn a separate interview, Chipinge District Development Co-ordinator Mr William Mashava said a search is underway for the bodies of missing people, adding that some macadamia farmers were left counting losses after their pump houses, which were close to the river in Ward 7 and 10 of the district, were swept away.\n\nSeveral pumps houses in Ward 7 and 10, which were installed close to the river, were destroyed due to flooding, said Mr Mashava.\n\nWard 10 Councillor Piason Sithole, said the community, together with various stakeholders is on the ground assisting in the search for the missing persons.He added that some villagers also lost their livestock.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WRDEF.jpg",
            "description": "Ray Bande and Luthando Mapepa, Harare Bureau A DAM breach at Bandama Farm (formerly Canterbury Farm) in Chipinge has resulted in the release of large quantities of water downstream, killing four people including a four-year-old girl. Three people are also missing following the incident, which occurred on Sunday at the property owned by the late national […]",
            "time": "06:09",
            "date": "11 Mar 2025"
        }
    ]
}