{
    "news": [
        {
            "title": "‘Proud of you’ . . . President tells Kirsty Coventry",
            "url": "https://www.chronicle.co.zw/proud-of-you-president-tells-kirsty-coventry/",
            "content": "Ivan Zhakata, Harare Bureau\n\nPRESIDENT Mnangagwa has extended heartfelt congratulations to the Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, following her historic election as president of the International Olympic Committee (IOC).\n\nIn a statement yesterday, President Mnangagwa said Minister Coventry has made Africa proud by becoming the first African to hold the position in the 131-year history of the IOC.\n\nThursday 20th March, 2025, will remain etched in the annals of history, both in Zimbabwe and across the entire world, as one of our own, Minister of Sport, Arts and Recreation, Honourable Kirsty Coventry, was elected the International Olympic Committee (IOC) President, garnering 49 votes out of a possible 97, he said.\n\nThis incredible win comes iced with the shattering of three records, all broken at the same time. Kirsty Coventry made Africa proud by becoming the first African person to hold the position in the 131-year history of the sports body.\n\nKirsty Conventry\n\nIn addition, she becomes the first woman and the youngest person to achieve this feat! For Zimbabwe, this achievement, huge and historic as it is, comes as no surprise.\n\nPresident Mnangagwa said the country has witnessed Minister Coventrys meteoric rise in the world of sport from being a multiple Olympic champion to a leader.\n\nYour approach to sport has always been marked by intense passion, focus and fierce determination, singling you out as a go-getter who accepts no defeat, he said.\n\nToday, with the flag of Zimbabwe flying high up, I am proud to give you well-deserved congratulations. You have lifted your country high. In centuries to come, whenever the history of the IOC is spoken about or written down, Zimbabwe will be mentioned as having produced the first woman president; the first African president and the youngest president.\n\nEven as you tackle the huge challenges that lie ahead in the new job, I am very confident that you will, undoubtedly, hold your own. You will be no push over and you will do justice to the task that awaits.\n\nI wish you all the best, and success in your tenure as the International Olympic Committee president. Nhasi ndezveduwo! Zimbabwe is proud of you. Well done Kirsty Coventry!.\n\nMinister Coventry, a seven-time Olympic swimming medalist and former world record-holder, has been a key figure in Zimbabwes sports administration.\n\nHer new role as IOC president is expected to bring fresh perspectives and stronger African representation in global sports governance.\n\nThe news of Minister Coventrys election has been met with celebrations across Zimbabwe, with athletes, officials and citizens applauding her for breaking barriers on the international stage. Many view her presidency as a milestone in promoting inclusivity, athlete welfare and increased opportunities for African nations within the Olympic movement.\n\nPresident Mnangagwa\n\nMeanwhile, President Mnangagwa attended the inauguration of Namibian President Netumbo Nandi-Ndaitwah in Windhoek yesterday, marking a historic moment for the Southern African country.\n\nShe becomes Namibias first female Head of State.The event, which coincided with celebrations to mark Namibias 35th independence celebrations, was attended by President Mnangagwa, who is also the SADC Chairperson, and several Heads of State including Tanzanian President Samia Suluhu Hassan who was the guest of honour.\n\nOther leaders who attended are President Cyril Ramaphosa of South Africa, Flix Tshisekedi of the Democratic Republic of Congo and Hakainde Hichilema of Zambia.\n\nThe inauguration ceremony began with the arrival of President Nandi-Ndaitwah at State House, where she was greeted by outgoing President Nangolo Mbumba. President Nandi-Ndaitwah (72), who won last Novembers general election with 58 percent of the vote, was then sworn in followed by speeches from various dignitaries including President Hassan.\n\nPresident Mnangagwa congratulates Namibian President Netumbo Nandi-Ndaitwah after her inauguration while retired Lt General First Gentleman Epaphras Denga Ndaitwah looks on in Namibia yesterday. Picture  Presidential Photographer Joseph Nyadzayo\n\nIn an interview after the inauguration ceremony, President Mnangagwa underscored the importance of support and unity in the region.\n\nWe need to continue supporting each other as the region; this is what it ought to be. It is the only way our region will grow if we share our perspectives as respective countries and move forward.\n\nUnity is key among our members.As the SADC chairperson, President Mnangagwas attendance highlighted the significance of this historic moment for Namibia and the region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/CVXGEXVCXCVX56565565565656565656.jpg",
            "description": "Ivan Zhakata, Harare Bureau PRESIDENT Mnangagwa has extended heartfelt congratulations to the Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, following her historic election as president of the International Olympic Committee (IOC). In a statement yesterday, President Mnangagwa said Minister Coventry has made Africa proud by becoming the first African to hold the position […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Prophet charged with attempted murder after shooting son",
            "url": "https://www.chronicle.co.zw/prophet-charged-with-attempted-murder-after-shooting-son/",
            "content": "Peter Matika,[emailprotected]\n\nTHE esteemed founder and leader of River of Life International Church, Prophet Bothwell Phiri, 57, is facing attempted murder charges following a harrowing incident at his Kumalo suburb residence in Bulawayo.\n\nIn the early hours of Monday, he allegedly shot his son, Jordan, having mistaken him for an intruder.\n\nThe distressing event unfolded as Jordan attempted to gain entry to the locked house through a window, reportedly after a late return from their plot in Esigodini.\n\nStartled by the noise, Prophet Phiri, armed with his legally registered firearm, proceeded to investigate, leading to the unfortunate confrontation.\n\nProphet Bothwell Phiri\n\nBulawayo province acting police spokesperson Nomalanga Msebele confirmed the incident, stating that it occurred at approximately 1:20 am.\n\nMsebele said that Phiris son, Jordan, 29, arrived home from their plot in Esigodini and found the door locked hence he tried to gain entry through a window.\n\nProphet Bothwell Phiri and his son Jordan\n\nHe opened a window and as he attempted to gain entry, he was shot in the groin by the accused person. When the accused realised it was his son, he rushed him to UBH for treatment, she said.\n\nMsebele said Phiri told police that he shot his son, believing him to be an intruder. She however said the son was in a stable condition.\n\nThis was an unfortunate incident. The accused person was interviewed and told police he mistakenly shot his son as he thought he was an intruder. The firearm was checked and police confirmed that he is a licensed holder of the firearm, said Msebele.\n\nShe said that investigations are ongoing and the matter will be heard in court.Efforts to obtain a comment from Phiri were unsuccessful as he was reportedly in an extended meeting.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/R86.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw THE esteemed founder and leader of River of Life International Church, Prophet Bothwell Phiri, 57, is facing attempted murder charges following a harrowing incident at his Kumalo suburb residence in Bulawayo. In the early hours of Monday, he allegedly shot his son, Jordan, having mistaken him for an intruder. The distressing event […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Legislators push for tech-savvy curriculum",
            "url": "https://www.chronicle.co.zw/legislators-push-for-tech-savvy-curriculum/",
            "content": "Nqobile Tshili,[emailprotected]\n\nLEGISLATORS have urged the Government to accelerate digital inclusion and Artificial Intelligence (AI) integration in the education system, arguing that access to technological devices is no longer a luxury but a fundamental right for social justice and economic empowerment.\n\nAmid the global surge in new technology adoption aligned with the fourth industrial revolution, Zimbabwes Members of Parliament have expressed concern over the widening urban-rural digital divide. To bridge this gap, MPs on Thursday proposed a motion to urge Government to implement a comprehensive national digital education access programme for schools as rural pupils are being left behind.\n\nChenjerai Kangausaru, Zanu-PFs Hurungwe East National Assembly member, who moved the motion, argued that in an era where digital transformation drives economic progress, Zimbabwe cannot afford to exclude any child from acquiring digital skills.\n\nThe digital divide is no longer merely a technological issue. It is a matter of social justice, economic empowerment and the realisation of the constitutional mandate to provide quality education for all. Zimbabwe, like many developing nations, faces a growing digital divide between regions.\n\nThe Minister of Higher and Tertiary Education,Science,Innovation and Technology Development Ambassador Fredrick Shava\n\nUrban centres enjoy better access to reliable internet, digital devices and technological infrastructure while rural communities, particularly those in remote areas, encounter significant connectivity barriers, limiting their participation in the digital economy and access to essential services, Kangausaru said.\n\nHe highlighted the gendered nature of the digital divide, with women and girls facing exacerbated challenges.Women and girls in rural areas face unique obstacles in accessing digital technologies, including the internet, mobile phones, and computers. This exclusion has far-reaching consequences, limiting their access to education, healthcare, economic opportunities, and social services. In todays rapidly evolving digital age, technology access is no longer a luxury, but a necessity. However, for many girls in Zimbabwe, this access remains unattainable due to economic challenges, infrastructure limitations, or cultural barriers, Kangausaru said.\n\nHe said that addressing digital exclusion requires an inclusive effort that benefits every Zimbabwean child, regardless of gender.\n\nKangausaru stressed the heightened importance of digital technologies, particularly with the rise of AI.\n\nThe emergence of AI is revolutionising economies, reshaping industries and redefining how we work and learn. If Zimbabwe is to remain competitive in the digital economy, we must introduce AI literacy at an early stage. AI is no longer a futuristic concept; it is here, and our children must be prepared to harness its potential.\n\nDeveloped nations are investing heavily in AI education, training their youth in coding, robotics, and machine learning. We must follow suit by incorporating AI literacy into our national curriculum, ensuring that Zimbabwean students are equipped with the critical thinking, problem-solving, and technological skills necessary for the digital future, Kangausaru said.\n\nHe recommended that the Ministry of Finance, Economic Development and Investment Promotion prioritise funding initiatives that bridge the digital divide by expanding internet connectivity and access to digital tools in rural areas, with a specific focus on empowering girls.\n\nFinance, Economic Development and Investment Minister Mthuli Ncube\n\nKangausaru also called on the Parliamentary Portfolio Committee on Information Communication Technologies to recommend the establishment of more digital hubs or community centres in rural areas, equipped with computers, internet access, and educational resources, to provide ICT training, online learning platforms, and mentorship opportunities.\n\nThe ICT Committee must further propose the introduction of subsidised data plans for community internet access programmes, making digital tools and resources more affordable for rural communities, with a particular emphasis on affordability for girls and their families.\n\nThe Ministry of Information, Communication Technology, Postal and Courier Services must encourage public-private partnerships to provide scholarships and funding for rural residents to access digital education, online courses, and technology-related skills development programmes, enhancing their employability and entrepreneurial potential, he said.Discent Bajila, Emakhandeni-Luveve National Assembly member, noted that while the Government has established community information centres, many lack electricity.\n\nMr Descent Bajila\n\nNo matter how many computers MPs or ministers donate, people will not benefit without electricity. Firstly, we must address the electricity issue and also address the issue of salaries for ICT professionals. This ICT knowledge is precious, and people will leave the country without power access, Bajila said.\n\nNomathemba Ndlovu, Matabeleland South Proportional Representation MP, highlighted that beyond ICT education, some Matabeleland communities are disadvantaged by a shortage of science teachers.\n\nIn our remote areas, network and electricity access is limited. They are not learning much. We request intervention, especially the installation of solar systems to provide electricity in schools. There are teachers who teach computers, but they only know phones. There are no computers or electricity. We request the Government to employ qualified professionals in rural areas, Ndlovu said. @nqotshili.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/64.jpg",
            "description": "Nqobile Tshili,nqobile.tshili@chronicle.co.zw LEGISLATORS have urged the Government to accelerate digital inclusion and Artificial Intelligence (AI) integration in the education system, arguing that access to technological devices is no longer a luxury but a fundamental right for social justice and economic empowerment. Amid the global surge in new technology adoption aligned with the fourth industrial revolution, […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "OVER TO YOU Kirsty Coventry walking among IOC greats",
            "url": "https://www.chronicle.co.zw/over-to-you-kirsty-coventry-walking-among-ioc-greats/",
            "content": "Stanford Chiwanga,[emailprotected]\n\nKIRSTY Coventrys ascension to the presidency of the International Olympic Committee (IOC) represents a landmark achievement, a source of immense pride not only for Zimbabwean sport, but also for the entire global Olympic community.\n\nAs the first woman and the first African to hold this prestigious office, she inherits a legacy forged by individuals who have fundamentally redefined the landscape of modern athletics.\n\nSaturday Chronicle looks at the formidable challenges and weighty expectations that now rest upon her shoulders.Coventrys ascension positions her amongst an elite cohort, a succession of figures who have fundamentally altered the landscape of international sport. To grasp the enormity of her undertaking, a detailed examination of the legacies of her predecessors is indispensable.\n\nThe IOCs history is punctuated by figures who have left enduring imprints. From its visionary founder, Baron Pierre de Coubertin, who resurrected the ancient Olympic Games, to more recent incumbents, each has confronted unique trials and opportunities.\n\nThe IOC has seen nine presidents since its inception in 1894. The first president, Demetrius Vikelas, served from 1894 to 1896 and was instrumental in the revival of the modern Olympic Games. His successor, Pierre de Coubertin, held the position for nearly three decades and is often credited with establishing the Olympic Games as a global event. Henri de Baillet-Latour navigated the IOC through the Great Depression and early World War II, while J Sigfrid Edstrm played a crucial role in the post-war revival of the Olympics.\n\nKirsty Coventry reacts alongside Outgoing IOC President, Thomas Bach, as she prepares to deliver a speech after being elected as the new IOC President at the 144th International Olympic Committee (IOC) Session on Thursday in Costa Navarino, Greece.\n\nAvery Brundage, a figure of both influence and controversy, presided over the Games during the tumultuous Cold War era, navigating political boycotts and the growing commercialisation of sport. His two-decade tenure was characterised by a staunch defence of amateurism, a principle that ultimately proved unsustainable in the face of evolving sporting realities.\n\nJuan Antonio Samaranch, arguably the most transformative president since Coubertin, modernised the IOC, securing its financial bedrock through lucrative television contracts and sponsorship agreements. He also oversaw the dismantling of the amateur ideal, ushering in the era of professional athletes within the Olympic framework. His extended tenure wrought profound changes, both advantageous and disadvantageous, that continue to resonate within the Olympic movement. His successor, Jacques Rogge, continued to modernise the Games, focusing on youth and sustainability.\n\nJuan Antonio Samaranch\n\nMore recently, Thomas Bach led the IOC through a period of profound transformation, grappling with the proliferation of social media, the complexities of anti-doping initiatives, and the unprecedented challenges posed by the COVID-19 pandemic. His Olympic Agenda 2020 sought to address the escalating concerns surrounding the cost and sustainability of hosting the Games, and address issues such as doping and corruption.\n\nJacques Rogge\n\nCoventrys election heralds a new era for the IOC. As the first woman and the first African to occupy this esteemed position, she shoulders the weight of historical precedent. She must not only emulate the strengths of her predecessors but also forge her own path within an ever-evolving sporting milieu.\n\nCoventrys impressive sporting pedigree as a seven-time Olympic medallist, and her experience as a member of the IOC and Sports Minister provide a robust foundation. However, her true mettle will be tested by her ability to foster unity among diverse stakeholders, forge consensus, and guide the Olympic movement with unwavering vision and integrity.\n\nThomas Bach\n\nHer election is seen as a victory for diversity and inclusion. Coventrys immediate tasks will include continuing the reforms initiated by her predecessor, including strengthening the fight against doping and corruption, ensuring financial sustainability, and promoting gender equality and youth engagement.\n\nShe undoubtedly walks among giants, and the task before her is immense. Her ability to meet these challenges will be scrutinised by sporting enthusiasts worldwide. She has big shoes to fill, to match the success of the previous IOC presidents that have shaped the games to what they are today. Her success will depend on her ability to steer through the complex landscape of international sports, build on the achievements of those who came before her, and lead the Olympic movement into a new age of inclusivity and integrity.\n\nKey challenges confronting Kirsty Coventry include:Sustaining Olympic relevance: In an era of diverse entertainment options, the IOC must ensure the Games remain compelling and engaging for younger demographics.\n\nAddressing ethical imperatives: Issues such as doping, corruption, and human rights violations continue to pose persistent challenges to the integrity of the games.\n\nEnsuring financial viability: The escalating costs associated with hosting the Games and the need to balance commercial imperatives with the Olympic spirit present significant financial obstacles.\n\nNavigating geopolitical complexities: The Olympics have consistently served as a stage for global politics, and Coventry must possess the acumen to navigate these intricate relationships, including political complexities surrounding games such as the 2028 summer games.\n\nEmbracing digital innovation: The IOC must adapt to the digital age, leveraging technology to enhance the fan experience and promote the core values of the Olympic movement.@plainstan\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/y5.jpg",
            "description": "Stanford Chiwanga, Stanford.chiwanga@chronicle.co.zw KIRSTY Coventry’s ascension to the presidency of the International Olympic Committee (IOC) represents a landmark achievement, a source of immense pride not only for Zimbabwean sport, but also for the entire global Olympic community. As the first woman and the first African to hold this prestigious office, she inherits a legacy forged […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "America has Ye, we have Holy Ten",
            "url": "https://www.chronicle.co.zw/america-has-ye-we-have-holy-ten/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nHAS the Zimbabwean hip-hop scene birthed its own Ye? It seems every nation cultivates such a figure, a provocateur who both captivates and confounds. South Africa has Nota Baloyi, and now, Zimbabwe has unearthed its own Kanye West-esque rapper, known to his fans as Holy Ten. These individuals, defined by their unpredictable, often controversial, behaviour, carve out a unique and undeniably prominent space in the cultural landscape.\n\nHoly Ten, much like his American counterpart, has recently courted controversy. From publicly criticising his wife, Kimberly Richard, to escalating his verbal sparring beyond fellow artistes, like former hip-hop luminary Mudiwa Hood, the MaChills hitmaker demonstrates a penchant for unfiltered expression. His recent, and particularly striking target was religious leader Uebert Angel, whom he engaged with during a candid podcast interview with DJ Ollah 7.\n\nHis recent outbursts echo the erratic behaviour and verbal diarrhoea of American rapper Kanye Ye West.\n\nKanye Ye West\n\nFrom confessing he married Kimberly Richards to spite Voltz JT, to insinuating she might be hindering his progress, Holy Tens behaviour suggests a descent into chaos.\n\nAs if airing his marital woes in public wasnt enough, Mujaya, as Holy Ten is affectionately known, launched an attack on Spirit Embassy overseer, Angel, branding him as anything but angelic, and alleging Ayindikumbira mababy (he used to ask for girlfriends from me). He further accused Angel of infidelity.\n\nThis week, Saturday Leisure will draw comparisons between these two outspoken figures, highlighting how they have reshaped the musical landscape. Below are some of the shared characteristics that define these rappers.\n\nLegal entanglements\n\nKanye Wests penchant for controversy is well-documented, frequently landing him in legal disputes. For instance, his former assistant, Lauren Pisciotta, accused him of drugging and raping her at a Diddy party. According to an 88-page lawsuit filed on October 11th last year, the influencer made further disturbing allegations implicating the controversial rapper in a sex crime.\n\nThis is merely one instance among many, as Ye has consistently courted controversy and faced legal repercussions.\n\nNow, Holy Ten has joined this turbulent journey, with his pronouncements reportedly prompting lawsuits from comedian Mama V, former rapper and author Mudiwa Hood, and religious leader Angel. In the defamation and damages claim circulated on social media, Mudiwa and Angel reportedly demanded compensatory damages amounting to one and a half million United States dollars, although Mudiwa has vehemently denied initiating any such legal action.\n\nLets be clear: the rap game is built on bravado, and verbal sparring sessions are commonplace, a practice both rappers have engaged in throughout their careers. In Zimbabwe, Holy Ten has exchanged diss tracks with his on-again, off-again friend Voltz JT, with the pair reconciling multiple times.\n\nIn America, Kanye West is renowned as a highly divisive artistic figure, known for a multitude of contentious actions and statements. His inflammatory rhetoric has embroiled him in feuds with Drake, Kid Cudi, Nas, and Cardi B.\n\nEducational background\n\nIts rumoured that Holy Ten is a school dropout, a trait he shares with Ye. If true, this might shed light on some of the life choices these rappers make.\n\nBlaming alcohol\n\nAlcoholic beverages, often referred to as wise waters, can sometimes lead to decidedly unwise behaviour. This appears to be the case with both Holy Ten and Kanye West.\n\nIn 2022, Ye found himself in hot water (as is his wont), locked out of Twitter and Instagram for posting anti-Semitic remarks. In one tweet, Ye stated he would soon go death con 3 on JEWISH PEOPLE, referencing the United States defence-readiness condition scale known as DEFCON.\n\nIn his defence during a Candace Owens podcast episode, Ye claimed, I was drinking when I put up the DEFCON tweet. You wanna know what alcohol I had inside me? Hennessy. It turns us grey. The demons come out.\n\nIn an Instagram message, Mudiwa Hood, who has been targeted by Holy Ten, shared an apology from Mujaya, attributing his actions to alcohol and malevolent spirits. The message read, Im sorry about the stuff I posted. I genuinely believe I was possessed that weekend. Thats the same weekend I almost divorced my wife and amongst things. Im really sorry but I have an actual alcohol problem. . .\n\nAwards controversies\n\nIn 2009, as Taylor Swift accepted her first MTV Video Music Awards gong for Best Female Video for You belong with me, Ye famously stormed the stage during her speech, proclaiming, Yo, Taylor, Im really happy for you, Ima let you finish, but Beyonc had one of the best videos of all time!\n\nAmerica has Ye, we have Holy Ten\n\nHoly Ten has also been vocal about awards. In addition to missing out on this years National Arts Merit Awards (NAMA), he expressed displeasure at comedian Mama Vs win, claiming the cross-dressing performer was a negative influence on children.\n\nControlling relationships\n\nBoth Ye and Mujaya exhibit controlling tendencies in their relationships. Yes and partner Bianca Censoris recent provocative outfit at the Grammys sparked widespread debate, reinforcing claims made by his ex-girlfriend Julia Fox about his control over her wardrobe. Holy Ten appears to want to mould Kim into his ideal partner, accusing her of holding him back, a hallmark of controlling behaviour.\n\nMusical impact\n\nWhen Holy Ten emerged onto the Zimbabwean music scene, Zimdancehall dominated. His hits, such as MaChills and Sahwira, introduced a new hip-hop sound, sparking a wave of collaborations.\n\nSimilarly, Kanye West has been a major force in American rap, nurturing young artists through his G.O.O.D. Music label, which includes John Legend, Travis Scott, Tyga, Big Sean, and DBanj. His own hits, such as N*ggas in Paris, Run this town, and Heartless, have solidified his status as a leading American rapper.\n\nInfidelity\n\nYe and Holy Ten both appear to struggle with monogamy. In Mujayas own words, he admitted to having extramarital affairs during an interview with Olla 7. After his divorce from Kim Kardashian, Ye began dating Julia Fox, who claimed she was used as a pawn in his relationship narrative, suggesting he was unfaithful.\n\nReligious persona\n\nMujaya, born Mukudzei Chitsama, adopted the stage name Holy Ten, despite his actions often contradicting this moniker. Yes Yeezus album explored religious themes, with the title itself referencing both black identity and divinity. The song I am a god sets a tone of self-proclaimed deity.\n\nUltimately, both figures embody the archetypal rapper lifestyle, forging their own paths and challenging societal norms.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dfgdfg.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com  HAS the Zimbabwean hip-hop scene birthed its own Ye? It seems every nation cultivates such a figure, a provocateur who both captivates and confounds. South Africa has Nota Baloyi, and now, Zimbabwe has unearthed its own Kanye West-esque rapper, known to his fans as Holy Ten. These individuals, defined by their unpredictable, often […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "It’s now up to the youth to rise up and get empowered",
            "url": "https://www.chronicle.co.zw/its-now-up-to-the-youth-to-rise-up-and-get-empowered/",
            "content": "Government has availed US$17 million to jump-start youths projects as it moves to empower the youths who are the countrys future leaders.\n\nLaunching the Presidential Youth Empowerment Scheme in Harare which was attended by thousands of youths from across the country on Thursday, President Mnangagwa said youths in agriculture, mining and those involved in other income-generating projects will benefit from the funding meant to boost their operations.\n\nHe said US$10 million will be availed for youths in agriculture, US$5 million will fund the youths mining equipment and a US$2 million revolving fund will provide loans to youths involved in income-generating projects.\n\nAt the launch President Mnangagwa handed over 72 tractors, 10 combine harvesters, 10 vehicles and 10 borehole drilling rigs to be shared by youths from the countrys 10 provinces. President Mnangagwa said Government is working on more similar initiatives meant to empower the youths who should take a leading role in building the Zimbabwe we all want.\n\nThe Youth Empowerment Bank will administer the availed Youth Fund. President Mnangagwa urged those responsible for distributing the availed resources to exercise high levels of morality and ethical consideration.\n\nHe said the schemes must identify deserving and capable youths. No to favouritism and corruption. I want this to be an enduring and sustainable fund which benefits the majority of our countrys youths, said President Mnangagwa.\n\nHe said those that benefit from the revolving fund should pay back the loans so that others also benefit.President Mnangagwa said the Second Republic has appointed many young people into strategic areas of governance and decision-making as it continues to explore avenues to deliberately empower the youths who are the countrys future leaders. He said Government has over the years implemented tangible youth empowerment projects such as piggery, heifer and poultry schemes among others.\n\nPresident Mnangagwa, Vice-President Chiwenga and wife Colonel Miniyothabo, Minister of Defence Oppah Muchinguri-Kashiri and Minister of Youth Empowerment, Development and Vocational Training Tino Machakaire watch children demonstrate their taekwondo skills during the National Youth Day celebration at the Zimbabwe International Exhibition Centre in Bulawayo. Picture  BELIEVE NYAKUDYARA\n\nWe want at this juncture to implore Government to put in place mechanisms to guard against the abuse of the Youth Empowerment Fund by unscrupulous individuals as has happened in the past.\n\nThere is a need to ensure that those that access the funding are deserving youths that have the capacity to put the availed resources to good use. The administrators of the fund who are found wanting should be punished severely to send a strong message that Government does not tolerate incompetence when it comes to handling public funds.\n\nMany unscrupulous individuals have in the past taken advantage of incompetent or corrupt fund administrators to abuse such funding to benefit themselves at the expense of deserving beneficiaries.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xcdfsxczxcz.jpg",
            "description": "Government has availed US$17 million to jump-start youths projects as it moves to empower the youths who are the country’s future leaders. Launching the Presidential Youth Empowerment Scheme in Harare which was attended by thousands of youths from across the country on Thursday, President Mnangagwa said youths in agriculture, mining and those involved in other […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "VP Chiwenga extends heartfelt birthday wishes to First Lady",
            "url": "https://www.chronicle.co.zw/vp-chiwenga-extends-heartfelt-birthday-wishes-to-first-lady/",
            "content": "Peter Matika,[emailprotected]\n\nVICE President, Dr Constantino Chiwenga extended heartfelt birthday wishes to First Lady Dr Amai Auxillia Mnangagwa as she celebrated her 62nd birthday yesterday. He paused to acknowledge her profound contributions to enhancing the lives of ordinary Zimbabweans, a mission she has embraced with unwavering dedication through her work with the Angel of Hope Foundation.\n\nDr Chiwenga lauded the First Lady for her steadfast commitment to uplifting the underprivileged, emphasising that her diverse, life-transforming initiatives have positively impacted countless individuals.\n\nOver the years, her philanthropic work remains inspirational, significantly contributing to the growth of various sectors of the economy, he said.\n\nThe First Lady of Zimbabwe, Her Excellency, Dr Auxilia Mnangagwa\n\nHe noted that under her leadership as the Ambassador for Health and Child Care and Patron of Environment and Tourism, Zimbabwe has achieved remarkable progress.\n\nThe country has witnessed unprecedented milestones in the provision of quality health care, sustainable environmental conservation, and the promotion of the tourism sector, he stated.\n\nDr Chiwenga expressed his pride in the legacy of compassion, generosity, and the spirit of giving that the First Lady has instilled in the nation.\n\nOn behalf of the great nation of Zimbabwe, my family, and indeed, myself, I wish you, Your Excellency the First Lady, a happy birthday. We pray that the Lord continues to bless you and the First Family, Dr Chiwenga said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/mmmmf.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw VICE President, Dr Constantino Chiwenga extended heartfelt birthday wishes to First Lady Dr Amai Auxillia Mnangagwa as she celebrated her 62nd birthday yesterday. He paused to acknowledge her profound contributions to enhancing the lives of ordinary Zimbabweans, a mission she has embraced with unwavering dedication through her work with the Angel of […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Dusty deals: Dark side of Zimbabwe’s transport corridor",
            "url": "https://www.chronicle.co.zw/dusty-deals-dark-side-of-zimbabwes-transport-corridor/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE chill of the pre-dawn air did little to deter the two young women. Their outfits, tight and revealing, offered scant protection against the cold as they were designed to catch the eye as opposed to ward off the weather elements.\n\nOne after the other, they rapped on the drivers side of a haulage truck parked at Gwayi Shopping Centre, a roadside stop on the Bulawayo-Victoria Falls highway.\n\nThe clock edged towards the small hours of Friday morning and Gwayis nightclubs pulsed with life, music and laughter echoing, while outside, the parked trucks awaited the dawns reluctant arrival.\n\nA cluster of women drifted among the parked trucks, the makeshift truck stop, a temporary haven for a dozen or more haulage vehicles, both local and foreign.\n\nAfter persistent knocks on four different trucks, a woman finally found her mark; a driver relented and she slipped inside. Her companion, undeterred, continued her search, scanning the line of vehicles, hoping for another open door.\n\nA number of truck stops have sprung up along the Bulawayo-Victoria Falls route and these include one at Amakhosi Service Station in Bulawayo, Bernice Business Centre, Insuza Shopping Centre and Kenmur Business Centre in St Lukes. The next truck stops are at Lupane Business Centre, Jotsholo Business Centre and Gwayi Shopping Centre.\n\nThe Saturday Chronicles investigation into prostitution rings involving truck drivers took the news crew to Cross Dete Business Centre where there is another truck stop. The women have taken soliciting clients to a new level, an employee at a nightclub at Gwayi Shopping Centre told the Saturday Chronicle.\n\nThey knock on doors of trucks and openly tell the drivers they are sex workers. For them, its all about business and how much they can earn each night, said the female employee.\n\nNorman Ngulube, a barman, said that some of the sex workers rent back rooms from homeowners in a suburb just behind the truck stop.\n\nProstitution has become a way of life here at Gwayi Shopping Centre. Whats worrying is that even young girls have joined the trade, selling their bodies to truck drivers who always have cash and spend freely, Ngulube said.\n\nAs another truck pulled into a dusty and muddy track that has been turned into a temporary rest area, a teenage girl emerged from the shadows and began walking slowly between the parked trucks. Her attempt to attract a client also fails, and she abandons the mission, deciding to go into a nightclub to try her luck.\n\nMore and more trucks arrive, and soon the small, dusty parking bay is congested.On a busy night over 30 trucks stop here overnight, and they usually start leaving as early as 4am. The sex workers sleep during the day and only work after dark, said Ngulube.\n\nJotsholo Business Centre is next to the Bulawayo-Victoria Falls Highway and during the day, is usually quiet and passive but sharply transforms into a notorious hub for prostitution as dusk approaches. The news crew observed girls, some as young as 15, roaming the business centre at night.\n\nThe place has virtually been turned into a red-light district. In fact, the area has become a paedophiles paradise, where older men, especially truck drivers, prey on vulnerable teenage girls.\n\nAt Cross Dete Business Centre, one of the several truck stops visited by the Saturday Chronicle at night, a woman we will call Mary (for the purposes of this article) said her charges vary depending on whether the client wants to take a drive with her or if their business is concluded in the truck.\n\nWhen we do our business in the truck, we call it a short time. When the driver asks me to join him on a trip to Hwange and back, that is a full night. A short time is US$5, and a full night is US$30, said Mary.She said she rents a house at Cross Dete Business Centre but entertains the truck drivers in their vehicles.\n\nI dont want to expose my two young children to the type of business I do for a living. My younger sister knows what I do and takes care of the children in my absence but I dont want her near where the trucks park.Mary said she doesnt want her younger sister to be enticed by the money that truck drivers flash around to lure young girls into sleeping with them. She pointed at a young girl who she said joined the commercial sex trade earlier this year.\n\nParked trucks at Amakhosi Service Station in Bulawayo\n\nThat girl stopped going to school and joined her older sister in January.A study conducted by the Zimbabwe National Council for the Welfare of Children between 2015 and 2016, revealed that truck drivers plying major routes such as the Bulawayo-Victoria Falls and the Beitbridge-Chirundu highway are fuelling child prostitution by targeting school children and teenage sex workers.\n\nThe International Labour Organisation in 2010 launched a project on Economic Empowerment and HIV Vulnerability Reduction along Transport Corridors in Southern Africa in a bid to tackle HIV/Aids through empowering sex workers so that they start self-income generating projects. The project seeks to respond to the HIV/Aids pandemic through economic empowerment in the transport sector through a strategic approach of mobilising co-operatives and community-based organisations.\n\nThe ILO says the major thrust of the programme is to mobilise the tripartite constituents and other strategic partners to contribute to the reduction of HIV infections and mitigation of the impact of Aids through sustainable prevention, improved livelihood strategies, access to care and support structures, and initiatives involving affected grassroots communities and transport sector workers and their families.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yr.jpg",
            "description": "Raymond Jaravaza, raymond.jaravaza@chronicle.co.zw THE chill of the pre-dawn air did little to deter the two young women. Their outfits, tight and revealing, offered scant protection against the cold as they were designed to catch the eye as opposed to ward off the weather elements. One after the other, they rapped on the driver’s side of […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Crossing cultures: Capturing stories…Jessica J Rowlands, a voice for Zimbabwe",
            "url": "https://www.chronicle.co.zw/crossing-cultures-capturing-stories-jessica-j-rowlands-a-voice-for-zimbabwe/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nJESSICA J Rowlands, a rising figure in cinema, embodies a fascinating cultural fusion. Born in the UK to parents who moved to Hwange, Zimbabwe, in 1984, her life is a blend of two worlds. Her fathers work at the local power station and her mothers teaching, coupled with her mothers enduring ties to Zimbabwe  eventually becoming a citizen and settling in Victoria Falls  have deeply enriched her storytelling, making her a powerful voice in contemporary film.\n\nJessica, an award-winning screenwriter and director, is the creative force behind Rise, a film that propelled 10-year-old Sikhanyiso Skha Ngwenya into the history books. Skha became arguably the youngest National Arts Merit Awards (Nama) winner in the Outstanding Actor category for his portrayal of Rise, the films protagonist. Such was Jessicas impact that she coached Skha, a novice actor, to a podium finish at the recent Namas, surpassing seasoned performers John Mabuyane and Tapiwa Mavindidze.\n\nThe film also features the esteemed Tongayi Chirisa.\n\nJessie (left) and Tongayi Chirisa (with dreadlocks) and Sikhanyiso Ngwenya (centre) at a scene in the film, Rise\n\nBefore venturing into filmmaking, Jessica excelled academically. She graduated at the top of her class with a Law degree and pursued further studies in International Human Rights Law at the prestigious University of Chicago Law School. This rigorous training equipped her with critical thinking skills and instilled a discipline she attributes to her success in filmmaking.\n\nMy background is in Law. I hold two law degrees, from both the UK and the US, which seems worlds apart from filmmaking. But I believe that training provided me with two crucial tools: critical thinking and disciplined hard work, Jessica said to Saturday Leisure.\n\nThroughout her life, Jessica has divided her time between London and Victoria Falls. Now, relocating to Los Angeles to pursue her ambitions, her dedication is yielding significant results. In 2019, she won the UCLA Screenwriting Competition, and in June 2020, she made history as the programmes only two-time award winner in the UCLA Writing for Television Competition.\n\nHer accolades continue to mount, with recognition from esteemed film festivals and competitions, including the Austin Film Festival and the Academy Nicholl Fellowship. Most recently, Jessica secured the Best Original Screenplay award at the London Independent Film Awards and the Gold Prize at the Page International Screenwriting Awards, solidifying her exceptional talent and distinctive storytelling.\n\nJessica acknowledged that her connection to Zimbabwe profoundly influences her narratives. Her works explore themes of identity, belonging, and resilience, often rooted in her experiences in Zimbabwe and the UK.\n\nI have always wanted to tell stories because I believe storytelling is the most powerful means of human connection. My connection to Zimbabwe has deeply impacted my worldview and the stories I want to tell. Im drawn to narratives that explore identity, belonging, and resilience, stories rooted in specific places and experiences, yet speaking to universal human truths, she said.\n\nBeyond writing, Jessica is passionate about directing her own stories. She studied Film Directing at Sundance under the acclaimed director Claudia Weill and at the UKs National Film and Television School (NFTS) under Scottish director Ian Knox. This dedication to her craft is evident in her production company, Pluvio Pictures, which aims to produce high-quality films showcasing unique stories and perspectives.\n\nI want to create space for work that is raw, emotionally complex, and grounded in the specificity of human experience. Im particularly interested in films that blur the line between realism and style, where the form reflects the characters inner lives.\n\nAs a successful filmmaker, Jessica is keen to empower fellow creatives, especially those from Zimbabwe. She also emphasises the importance of building a supportive community among peers.\n\nMake art. Make plenty of it. Dont wait for permission. The difference between artistes and aspiring artists is action. Network horizontally, not vertically: find like-minded creatives on a similar level and rise together. Your peers, those in the creative trenches, are far more valuable than knowing a few senior, experienced individuals, she said.\n\nJessica J Rowlands, a voice for Zim\n\nJessica also stressed the significance of persistence.\n\nMost successful people in this industry are simply those who didnt give up. Keep going.\n\nMarch is Womens History Month, a time to celebrate womens contributions across various fields, including film, andJessica believes womens perspectives are essential in storytelling. She acknowledged the challenges women face in a male-dominated industry.\n\nStorytelling is about sharing the human experience, so its crucial we hear stories from the full spectrum of humanity. For a long time, it didnt feel like a space I could occupy, but Ive learned theres more than one way to lead, and leadership doesnt have to conform to traditional models.\n\nJessicas collaborative spirit shines through her work on Rise, where she assembled an all-African cast and crew. Premiering last year in Victoria Falls and Harare, Rise tells the story of a charismatic young boy living on a rubbish dump in Zimbabwe, who must convince a reclusive boxing coach to teach him to fight for safety and strength.\n\nIt was a privilege to collaborate with so many talented Zimbabwean artists, she said.\n\nHer team included local talents such as Eddie Sandifolo, Nakai Matema, Farai Chimombe, Mmeli Mabhikwa, Kuda Sombi, Gregory Shambare, Taurai Kawara, Kelli Barker, and many others, showcasing the vibrant film industry in Zimbabwe. The film also features music from Mokoomba, Jah Signal, Nutty O, Leo Magozz, David HD Hondoyedzomba, Hope Masike, and Flying BantusTawanda Maoneni.\n\nShe also highlighted the importance of international collaboration, working with renowned professionals like Paul Watts, whose editing expertise was invaluable.\n\nAll in all, Rise was a testament to the extraordinary talent in Zimbabwe and beyond.\n\nDespite her success, Jessica is acutely aware of the challenges facing Zimbabwean filmmakers, particularly women.\n\nThe lack of resources, funding, and mentorship are the primary hurdles, she noted.\n\nShe stressed the need for improved infrastructure and access to high-quality mentorship to help young creatives reach their potential. Jessica called for a concerted effort to build a sustainable film industry in Zimbabwe, one that produces quality work and showcases it globally.\n\nWe need to make Zimbabwe an attractive destination for both local and foreign investment, she said.  @MbuleloMpofu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dfsf.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com JESSICA J Rowlands, a rising figure in cinema, embodies a fascinating cultural fusion. Born in the UK to parents who moved to Hwange, Zimbabwe, in 1984, her life is a blend of two worlds. Her father’s work at the local power station and her mother’s teaching, coupled with her mother’s enduring ties to […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        },
        {
            "title": "Musona proves his worth on Warriors return",
            "url": "https://www.chronicle.co.zw/musona-proves-his-worth-on-warriors-return/",
            "content": "Innocent Kurira,[emailprotected]\n\nKNOWLEDGE Musonas return to international duty silenced his critics with a stellar performance, scoring a crucial equaliser as Zimbabwe fought back to secure a 2-2 draw against Benin in a 2026 World Cup Qualifier on Thursday.\n\nLingering doubts had surrounded Musonas decision to come out of retirement, particularly given his time away from the national team and the mounting pressure on both the player and Zimbabwe coach Michael Nees to justify the move.\n\nNees had been instrumental in Musonas return, having persuaded him last week. Critics had argued that Musonas recall was a mistake, citing his age as a significant concern. At 35, they believed Musona was past his prime and no longer suited to the rigours of international football.\n\nSome felt it was time for younger players to take the reins, emphasising the need to develop fresh talent for the future. The call for a new generation of Warriors was growing louder, with many questioning why a player who had been away from the national team for several years should be given another chance, especially when there were promising young forwards in the squad eager to prove themselves.\n\nKnowledge Musona is congratulated by Khama Billiat (centre) and teammates after scoring the equaliser for the Warriors in Thursday 2-2 draw against Benin\n\nHowever, Musonas stunning return has proven his critics wrong. His performance not only silenced doubters but also highlighted his invaluable experience and poise in high-pressure moments. While some still argue that the focus should be on nurturing younger players, others believe that Musonas presence in the squad is vital. His goal on return demonstrated that, despite his age, he still possesses the quality to make a difference and can offer the Warriors a much-needed edge upfront.\n\nMusona, however, responded in style, demonstrating that age and time have not dulled his sharp instincts in front of goal.In the 60th minute, Musona, ever the poacher, latched onto Jordan Zemuras inch-perfect and well-calculated free-kick, shooting on goal with a hard and low effort past the Benin goalkeeper to restore parity for Zimbabwe, marking his 25th goal in national colours.\n\nCoach Michael Nees was quick to praise his star forward, noting that Musonas performance had proven his faith in him was well-placed.\n\nHe did well. When he eventually got subbed off, he indicated fatigue, and we thought, really, lets introduce fresh legs, quick legs that can make the difference. Musona and Khama Billiat are no longer 25, we cannot ignore that. This was a very fast game and, in my opinion, it was an Afcon-level match. When you need fresh legs, its so simple. You look at Prince Dube; he is a good player but he just didnt get into the game, and we thought we could bring in a player like Tawanda Chirewa who will get into the box, said Nees.\n\nThe match, played at Moses Mabhida Stadium in Durban, saw Zimbabwe fall behind early, with Benin taking a 2-0 lead within the first 35 minutes. A calamitous error from Zimbabwe goalkeeper Washington Arubi allowed Steve Mounie to score the opener in the 12th minute. Despite dominating possession, the Warriors failed to capitalise on their early dominance. Benin doubled their lead just before half-time, with Doku Dodo finding the back of the net in the 35th minute.\n\nThe Warriors, however, would not lie down. Stand-in captain Marshall Munetsi pulled one back just before the break, giving Zimbabwe hope as they entered the second-half with renewed vigour. With a tactical substitution from Nees, Zimbabwe grew stronger. The introduction of Chirewa and a clever free-kick from Zemura laid the groundwork for Musonas return to the spotlight.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/5ht.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw KNOWLEDGE Musona’s return to international duty silenced his critics with a stellar performance, scoring a crucial equaliser as Zimbabwe fought back to secure a 2-2 draw against Benin in a 2026 World Cup Qualifier on Thursday. Lingering doubts had surrounded Musona’s decision to come out of retirement, particularly given his time away […]",
            "time": "08:39",
            "date": "22 Mar 2025"
        }
    ]
}