{
    "news": [
        {
            "title": "‘Emulate peace legacy of VP John Nkomo’",
            "url": "https://www.chronicle.co.zw/emulate-peace-legacy-of-vp-john-nkomo/",
            "content": "Wallace Ruzvidzo,Harare Bureau\n\nZIMBABWEANS should at all times shun divisive tendencies to safeguard the countrys stable, unitary democracy that was painstakingly crafted by the likes of former Vice-President John Landa Nkomo, President Mnangagwa has said.\n\nIn a statement to mark the anniversary of the death of the late former Vice-President, who passed away 12 years ago on January 17, 2013, the President described Cde Nkomoas a diligent nation-builder and dedicated champion of peace.\n\nAs such, President Mnangagwa said it was imperative that the general citizenry cherishes the peace and tranquillity that has become the cornerstone of the countrys current developmental trajectory.\n\nOn this day, 17th January, 2025, the Second Republic joins the Nkomo Family in commemorating the 12th Anniversary of the passing on of the former Vice-President of the Republic of Zimbabwe, Dr John Landa Nkomo.\n\nAn ardent revolutionary, diligent nation-builder and a dedicated champion of peace, Dr John Landa Nkomos footprints traversed the nascent trade union and nationalist landscape from 1958 to Independence and the immediate post-Inclusive Government era, he said.\n\nPresident Mnangagwa said in carrying on with Cde Nkomos legacy of pioneering lasting projects, the Second Republic was walking its talk by leaving no one and no place behind in delivering on national policies, programmes and projects.\n\nCde John Landa Nkomo was a passionate educator, an eloquent and forthright politician who pioneered lasting developmental projects in his rural Tsholotsho District and beyond.\n\nOn its part, the Second Republic is walking the talk by leaving no one and no place behind in delivering on national policies, programmes, and projects, he said.\n\nPresident Mnangagwa said the former Vice President discharged his duties diligently and honourably.\n\nCde Nkomo served in several portfolios  as Deputy Minister of Industry and Energy (1981); Minister of State in the Prime Ministers Office (1982-84); Minister of Labour, ManpowerPlanning and Social Welfare; Minister of Local Government and National Housing (1997); Minister of Home Affairs (2000); Minister of State in the Presidents Office responsible for Special Affairs (2002); and Speaker of Parliament (2005-2008).\n\nHe served as Minister of State in the Presidents Office responsible for NationalHealing, Reconciliation and Integration.\n\nIn 2009, he was appointed National Chairman of the ruling Zanu-PF Party, the same year that he became the Vice-President of Zimbabwe, a position he held until the time of his death in2013.\n\nOn the international scene, Dr Nkomo was elected to the Presidency ofthe International Labour Conference in 1993, and chaired the Governing Body of the International Labour Organisation in 1994 . . . positions in which he discharged his roles honourably, said President Mnangagwa.\n\nCde Nkomo, said the President, was a distinguished patriot whose dedication to unity and peace was unquestionable.\n\nThe late former Vice-President exudedunparalleled patriotism and dedication to the values of unity and peace as expressed in his popular mantra Peace begins with me. Peace begins with you. Peace begins with all of us.\n\nAs we remember Cde John Landa Nkomo, we should forever cherish the peace and tranquillity that has become the cornerstone of our developmental trajectory.\n\nI therefore beseech my fellow citizens and indeed future generations to always shun divisive tendencies in order to safeguard our stable unitary democracy that was painstakingly crafted by the likes of the dear departed Dr John Landa Nkomo, and his revolutionary peers, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/President-Mnangagwa-1-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau ZIMBABWEANS should at all times shun divisive tendencies to safeguard the country’s stable, unitary democracy that was painstakingly crafted by the likes of former Vice-President John Landa Nkomo, President Mnangagwa has said. In a statement to mark the anniversary of the death of the late former Vice-President, who passed away 12 years […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "A-Level results spark debate on subject load: Is more truly better?",
            "url": "https://www.chronicle.co.zw/a-level-results-spark-debate-on-subject-load-is-more-truly-better/",
            "content": "Nqobile Tshili/Raymond Jaravaza,Chronicle Writers\n\nIMPROVED access to online resources has seen an increase in A-Level students acing end of year examinations, with the Zimbabwe School Examinations Council (Zimsec) maintainingthat standards remain high.\n\nThe growing number of students sitting for more than three subjects has sparked social media debate on whether A-Level is now easier.\n\nIn recently released results,Mpopoma High School in Bulawayo produced an impressive 62 students who scored 15 points or more, demonstrating a substantial improvement from past years.\n\nSimilarly, Matobo High School had some students scoring 20 points after taking more than three subjects.\n\nZimsecs spokesperson, Ms Nicky Dlamini, cited better access to online resources as one factor contributing to improved performance, adding that the 94,58 percent pass rate is consistent with the previous years results.\n\nOur assessment standards have not been lowered.\n\nSome candidates are more resourced now, with access to online materials and other resources that were not available in the past, she said.\n\nAs Zimsec, we might not have answers to explain why some of the candidates are writing more subjects. That question can be answeredby the Ministry of Primary and Secondary Education which is responsible for the teaching of the candidates.\n\nMs Dlamini noted that the 2024 A-Levelpass rate of 94,58 percent was consistent with the 2023 pass rate, demonstrating stability in the system.\n\nZimsec board chair, Professor Paul Mapfumo, who is also the University of Zimbabwe Vice Chancellor, said it is beyond Zimsec to analyse the performance of each school.\n\nZimsec is an examination body and it is not our mandate to explain why pupils from one particular school do well compared to another school, whether from the same area or another location, do not perform well, he said.\n\nThose with the responsibility to explain such discrepancies would need to understand the backgrounds of the concerned schools to come up with definitive explanations why there are inconsistencies in pass rates among a particular group of schools.\n\nThe Ministry of Primary and Secondary Education has reiterated its recommendation for students to focus on three subjects, with four as the maximum.\n\nThe ministrys communications and advocacy director, Mr Taungana Ndoro, said writing more subjects does not necessarily benefit students.\n\nIn our opinion as the Ministry of Primary and Secondary Education, its not necessary for candidates to sit for more than three subjects. In case they have added another subject the maximum should be four, he said.\n\nMr Ndoro said in most cases, universities only consider the best three passes for enrolment, adding that writing additional subjects is unnecessary and may distract learners from achieving excellence in their core subjects.\n\nHe added that while a small percentage of students  about 0,001 percent  opt to write more than four subjects, the ministry does not currently see the need for a policy to limit the number of subjects a student can sit for.\n\nWe will continue to engage stakeholders encouraging them to educate the candidates to just stick to the recommended subjects, said Mr Ndoro.\n\nHe explained that some students take on extra subjects to break records or increase their chances of securing scholarships abroad.\n\nHe, however, cautioned that scholarships are not guaranteed by high points totals.\n\nYou will discover that a student with three A grades may have a better chance of securing a scholarship than one with multiple subjects and 35 to 40 points, said Mr Ndoro.\n\nEducationist and Zimbabwe Teachers Association (Zimta) chief executive officer, Dr Sifiso Ndlovu, argued that writing multiple subjects does not equate to better quality education.\n\nHe said many students take advantage of overlapping content in subjects like mathematics and pure mathematics or chemistry and combined science.\n\nHe, however, said this does not necessarily improve the quality of education.\n\nIn our analysis, we have not found that increasing the number has to do with improved quality of education. You will discover that schools want to revert to having children only taking three to four subjects, he said.\n\nDr Ndlovu highlighted that in the 1970s and 1980s, only two subjects were required for university enrolment, and the current trend of taking multiple subjects may not add value to the education system.\n\nMpopoma High School head, Mrs Sihle Sibanda, attributed her schools impressive results to the dedication of teachers and the students hard work.\n\nThese results are a testament to the commitment and expertise of our teaching staff, as well as the supportive school community we have built, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/zimsec-630x380.jpg",
            "description": "Nqobile Tshili/Raymond Jaravaza, Chronicle Writers  IMPROVED access to online resources has seen an increase in A-Level students acing end of year examinations, with the Zimbabwe School Examinations Council (Zimsec) maintaining  that standards remain high.  The growing number of students sitting for more than three subjects has sparked social media debate on whether A-Level is now easier. […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "BCC intensifies crackdown on contaminated food sales",
            "url": "https://www.chronicle.co.zw/bcc-intensifies-crackdown-on-contaminated-food-sales/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE Bulawayo City Council (BCC) has intensified its operation against formal and informal businesses selling contaminated food in a bid to safeguard public health.\n\nSince December, the local authority has seized 49 types of foodstuffs, including meat products such as sausages, beef, chicken, and polony, dairy and sweets, fresh produce, and prepared foods like boiled eggs, potato salad, and rice.\n\nThese confiscated items were destroyed in line with BCCs food inspection guidelines.\n\nDr Edwin Mzingwane, BCC director of health services, emphasised that the citys health inspectorate is conducting regular inspections to ensure businesses comply with public health by-laws.\n\nThis crackdown aims to protect residents from the risks associated with consuming contaminated food.\n\nOur health inspectors follow daily, weekly, and monthly schedules when executing their duties, and all inspections are documented.\n\nThe frequency of inspections depends on the type of business, he said.\n\nFor example, butcheries are inspected more regularly because meat is a high-risk product that comes in and out frequently. Any foodstuffs deemed unfit for human consumption, particularly meat, are destroyed as they may carry diseases harmful to residents.\n\nWard 1 Councillor, Josiah Mutangi, revealed that his office received over 20 complaints last year from residents who suffered diarrhoeal and skin diseases after consuming street food, particularly meat and fish.\n\nDespite BCCs efforts to flush out contaminated food, vendors continue to flood the streets of Bulawayo, selling anything from beef and fish to chicken feet and fresh produce, he said.\n\nClr Mutangi said affordability drives many residents to buy from street vendors, as prices are significantly lower than in supermarkets.\n\nWhere a packet of chicken costs US$2 in supermarkets, it is sold for US$1 in the streets. However, this comes with risks, as weve seen cases of illnesses linked to contaminated food, he said.\n\nClr Mutangi also claimed that some established retailers are colluding with street vendors to offload expired or near-expired foodstuffs, which are then sold at reduced prices.\n\nThe retailer gets rid of foodstuffs such as fresh milk, margarine or ice cream that has either expired or are about to expire, which is why those products are much cheaper in the streets compared to prices in supermarkets, he said\n\nA Bulawayo medical practitioner, Dr Nonhlanhla Ndiweni, said food contamination is caused by factors such as poor handling, environmental contamination, and cross-contamination.\n\nFood can become contaminated if it is not cooked to the appropriate temperature or handled with clean utensils.\n\nCross-contamination, such as bacteria from raw meat coming into contact with other foods, is a common issue, she explained.\n\nDr Ndiweni warned that the consequences of consuming contaminated food range from mild symptoms like nausea and diarrhoea to severe conditions such as kidney failure or even death. Children, the elderly, and people with weakened immune systems are particularly vulnerable.\n\nChicken feet vendor, Mrs Buhle Ngozo, who operates at the Sixth Avenue informal commuter omnibus rank, said load shedding is affecting her business.\n\nTo keep the chicken feet fresh, I must store them in a refrigerator. However, long hours of load shedding make this difficult, so Ive reduced the quantities I buy from chicken farmers in Umguza, she said.\n\nMrs Ngozo sells a packet of chicken feet for US$1 and noted that many residents prefer street vendors due to affordability.\n\nI sell a packet of chicken feet for US$1, but I have scaled down on the number of packets I buy from chicken farmers around Umguza because of load shedding. I cant risk buying the chicken feet in large quantities and they all rot because of lack of electricity, she said.\n\nBCC is also on high alert following reports of food poisoning in South Africa, where children died after consuming expired food sold at tuck shops.\n\nGiven that many food products sold in Bulawayo are imported from South Africa, we are closely monitoring the situation to prevent similar incidents here, the council noted in its latest minutes.\n\nA resident from Iminyela suburb, identified only as Mike, said street vendors remain a popular option for many due to the flexibility in negotiating prices.\n\nTimes are hard, and residents have no choice but to buy beef, chicken, and fish sold in the streets. You can negotiate prices with vendors, unlike in shops, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/The-collage-shows-vendors-selling-meat-on-the-roadside-in-Bulawayo-recently-680x380.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  THE Bulawayo City Council (BCC) has intensified its operation against formal and informal businesses selling contaminated food in a bid to safeguard public health.  Since December, the local authority has seized 49 types of foodstuffs, including meat products such as sausages, beef, chicken, and polony, dairy and sweets, fresh produce, and prepared foods […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "WATCH: Mliswa-Zifa case transferred to Harare",
            "url": "https://www.chronicle.co.zw/watch-mliswa-zifa-case-transferred-to-harare/",
            "content": "Lovemore Dube\n\nTHE case in which Temba Mliswa is questioning his disqualification from the Zifa elections, where he was seeking to run for president, has been transferred to Harare by Justice Nduna of the Bulawayo High Court.\n\nJustice Nduna moved the case to Harare and transferred all relevant files so it can be heard jointly with that of Walter Magaya, as the two cases are similar. Magaya was also disqualified from contesting the January 25 elections and has approached the courts to reinstate him as a candidate.\n\nMliswas lawyer, Musindo Hungwe of MD Hungwe Attorneys, informed Zimpapers Sports Hub after a brief sitting in Bulawayo yesterday that Justice Nduna had made the transfer. Justice Chitapi is now expected to hear both cases. Magayas case, originally scheduled for last Tuesday, was deferred to today.\n\nMliswa is challenging the legality of the entire election process, arguing that the Assemblys tenure ended in 2022, meaning it has no legal standing to approve a new constitution or to nominate and vote for new board members.\n\nThe High Court judge, on considering the matter  which is similar in substance and seeks a stay or moratoriumwas of the view that both cases should be handled by the same judge.\n\nHe has transferred the matter to Harare to be heard by Justice Chitapi. We hope for a resolution in the shortest possible time, said Hungwe.\n\nHungwe noted that Justice Nduna wanted to avoid a scenario where conflicting judgments could arise from separate hearings on essentially the same issue.\n\nMeanwhile, Zifa presidential hopeful, Magaya, is contesting the requirement for an O-Level certificate for the presidential and vice-presidential posts. He has also lodged an appeal with the Court of Arbitration for Sport (CAS).\n\nMagaya stated that he did not submit an O-Level certificate but instead provided higher qualifications. He was disqualified for failing to submit proof of an O-Level certificate for the January 25 board elections, as stipulated by the Zifa Electoral College and the Zifa constitution. Magaya is calling for the postponement of the elections.\n\nThemba Mliswa at Byo High Court\n\nBoth cases are urgent applications. In his appeal to CAS, Magaya is seeking to have the disqualification decision overturned and a tribunal appointed to consider his case.\n\nIn the present appeal, the appellant is requesting the Court of Arbitration for Sport to appoint a tribunal to determine an appeal against the decision of the Zimbabwe Football Association, represented by the first respondent (Lincoln Mutasa), to disqualify the appellant from the ongoing elections for the Zifa presidency.\n\nIt was concluded that the appellant did not meet the necessary criteria to proceed as a candidate, specifically due to the non-submission of his Ordinary Level certificates.\n\nWhile it is admitted that the appellant did not submit proof of the minimum five O-Level passes, the appellant contends that the interpretation requiring a candidate to produce an O-Level certificate, even when they hold superior qualifications, is flawed, unduly restrictive and grossly illogical.\n\nNo decision-maker, properly applying their mind, would come to such a conclusion. Alternatively, the appellant argues that the provision is discriminatory and deliberately designed to exclude administrators and former players from participating in the governance of the sport, reads his appeal.\n\nMagaya claims that his marketing certificate, marketing diploma and theology diploma are superior to the minimum requirement of an O-Level certificate.\n\nMagaya, Mliswa, Farai Jere and Benjani Mwaruwari were all barred from contesting by the electoral committee. Mwaruwari has also taken his case to CAS.\n\nTwine Phiri, Martin Kweza, Marshall Gore, Philemon Machana, Nqobile Magwizi and Makwinji Soma-Phiri have been cleared to contest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jhmkhjykhu.jpg",
            "description": "Lovemore Dube THE case in which Temba Mliswa is questioning his disqualification from the Zifa elections, where he was seeking to run for president, has been transferred to Harare by Justice Nduna of the Bulawayo High Court. Justice Nduna moved the case to Harare and transferred all relevant files so it can be heard jointly […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "From Zambezi Magic to her own film company: Ntombikamama Moyo’s next step",
            "url": "https://www.chronicle.co.zw/from-zambezi-magic-to-her-own-film-company-ntombikamama-moyos-next-step/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nBulawayo-based filmmaker and author Ntombikamama Moyo says she is ready to take the next big step in her creative career as she is set to launch her film company this year.\n\nThe Bulawayo-born Ntombi as Moyo is known, has had her work on films such as Gold Diggers and $400 (nominated at the 2020 National Art Merit Awards), which premired on the Zambezi Magic channel.\n\nNtombis launch of her film company was aimed at helping bring even more of her compelling stories to life.As she continued to build on her past successes, she also looked to collaborate with other local production houses, aiming to push the boundaries of Zimbabwean storytelling and film.\n\nFilm maker Ntombikamama Moyo\n\nDespite her accomplishments, Ntombi said she had faced several hurdles, particularly in the area of funding, but her passion and vision for the future kept her moving forward.\n\nI wanted to create a company that produced the kind of work that would not only resonate with Zimbabwean audiences but would also have international appeal, Ntombi said.\n\nI believed that collaborating with other local production houses would help bring these stories to the screen in a way that resonated deeply with viewers.\n\nNtombi said her experience on Zambezi Magic had been a major turning point in her career. Having her work featured on the channel had given Ntombi a significant boost, connecting her with other filmmakers and opening doors for more creative opportunities.\n\nZambezi Magic was instrumental in my career. Its where my productions got their premieres, and the exposure was incredibly rewarding. Through the channel, I connected with other filmmakers, like Ras from Keaitse Films and Calvin Madula, who became important collaborators in my journey, she said.\n\nHer ambition to launch her own film company was just one part of her broader vision to push Zimbabwean film and literature into new realms.\n\nFilm maker Ntombikamama Moyo\n\nHowever, like many creatives, she faced the challenge of securing adequate funding for her projects. This obstacle was something she worked tirelessly to overcome.\n\nThe biggest challenge I faced was securing funding for my ideas. As much as I loved writing and filmmaking, creating high-quality work required a significant budget, and that was something I didnt always have access to, she said.\n\nBut I was determined to find ways to make it work. Every challenge was an opportunity for growth, and I looked forward to seeing where my stories would go.\n\nNtombi said she was also passionate about ensuring that her stories reflected the complexities of human emotions and relationships, which is why her work often centred around themes of love, family, and friendship, with positive endings.\n\nI believed in telling stories that warmed the hearts of my audience. Life was tough enough as it was, so I wanted my work to provide an escape, to bring hope and positivity, she said. The writers and filmmakers I looked up to, like Chimamanda and Shonda Rhimes, showed me the power of storytelling. Their work inspired me to continue growing as a creative.Ntombi was also vocal about the need for collaboration within the local film and literature industries.\n\nI saw first-hand how collaboration could elevate our work, she explained. With Gold Diggers, I teamed up with Creative Pot Africa and M-Net, and we brought something special to life. Collaboration, funding, and a love for what we did were key to advancing our industry. Everything I did was a learning experience, she said. I was still growing, still figuring out my path, but I was excited for what was to come. I believed in the power of collaboration, and I was confident that together, we could make Zimbabwean film and literature something the world would take notice of.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gbnfghj.jpg",
            "description": "Sipepisiwe Moyo,moyosipepisiwe@gmail.com Bulawayo-based filmmaker and author Ntombikamama Moyo says she is ready to take the next big step in her creative career as she is set to launch her film company this year. The Bulawayo-born Ntombi as Moyo is known, has had her work on films such as Gold Diggers and $400 (nominated at the […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "COMMENT: Zifa must  prioritise reform over  personal gain",
            "url": "https://www.chronicle.co.zw/comment-zifa-must-prioritise-reform-over-personal-gain/",
            "content": "ZIMBABWEAN football has been bedevilled by problems for decades. The recent disqualification of four candidates, Temba Mliswa, Walter Magaya, Benjani Mwaruwari and Gift Banda from contesting in the upcoming Zifa elections is a manifestation of these problems.\n\nMliswa and Magaya have taken their cases to the High Court, while Banda and Mwaruwari have taken up their disqualification with the Court of Arbitration for Sport (CAS), highlighting the deep-seated divisions that continue to plague Zimbabwean football.\n\nThe root of the problem is the lack of proper leadership at Zifa. Over the years, there have been numerous cases of financial mismanagement, corruption, and general incompetence.\n\nThis has led to a decline in the quality of football in the country, and a lack of investment in infrastructure, coaching, and player development. The current situation at Zifa is a reflection of this.\n\nHowever, the fact that the four went to court and CAS to contest their disqualification highlights the desperation for change and the need for proper leadership at Zifa.\n\nThe question is, what really is at Zifa that these individuals are so hell-bent on contesting or wanting to lead? The answer is simple  power and influence. The presidency of Zifa comes with significant power and influence, which can be used for personal gain. However, this must not be the main focus for those seeking to lead Zifa.\n\nWalte Magaya\n\nThe main focus should be on the development of football in Zimbabwe, particularly at the grassroots level. This will require investment in infrastructure and facilities, coaching and player development, and the establishment of a proper governance framework that will ensure transparency and accountability.\n\nThe disqualification of the four candidates highlights the need for proper governance within Zimbabwean football. While the disqualifications were based on technicalities, the fact that these individuals were willing to go to court to contest them highlights a lack of trust in the governance structures of Zifa. This is a worrying situation that needs to be addressed urgently.\n\nTemba Mliswa\n\nIt is time for change at Zifa. The leadership of the association should be focused on the development of football in Zimbabwe, and not on personal gain. This will require significant investment and a clear vision for the future of football in the country.\n\nThe Government should also take a more active role in the development of football in Zimbabwe. This includes the establishment of a proper governance framework that will ensure transparency and accountability, as well as the provision of funding for infrastructure and facilities, coaching and player development, and other key initiatives.\n\nThe future of Zimbabwean football depends on the willingness of all involved to adopt good governance practices. This requires a commitment to transparency, accountability, and the interests of the game. Only then can Zimbabwean football break free from its cycle of controversy and dispute.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/ZIFA-2.jpg",
            "description": "ZIMBABWEAN football has been bedevilled by problems for decades. The recent disqualification of four candidates, Temba Mliswa, Walter Magaya, Benjani Mwaruwari and Gift Banda from contesting in the upcoming Zifa elections is a manifestation of these problems. Mliswa and Magaya have taken their cases to the High Court, while Banda and Mwaruwari have taken up […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "Illegal imports crackdown to benefit formal sector",
            "url": "https://www.chronicle.co.zw/illegal-imports-crackdown-to-benefit-formal-sector/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nGOVERNMENT crackdown on illegal imports that have flooded the informal sector could benefit formal businesses such as OK Zimbabwe, which face excessive competition, securities firm, Morgan & Co has noted.\n\nMajor retail outlets, clothing entities, hardware shops and other formal enterprises face stiff competition from informal traders who import goods without adhering to local tax and duty regulations.\n\nStakeholders have urged the Government to take decisive action to address the informalisation of the economy, warning that the continued growth of the informal sector risks destabilising the countrys formal retail and manufacturing industries.\n\nLast year, a research paper indicated that the informalisation of the economy cost Zimbabwe at least US$1,15 billion in potential fiscal revenue between 2020 and 2023.\n\nThe findings came at a time when industry experts bemoaned the widening levels of informality across business sectors, which is threatening to choke the manufacturing industry.\n\nLast week, leading retailer, OK Zimbabwe, reassured stakeholders of its continued viability as a business despite experiencing intermittent product supply challenges during the festive season.\n\nAcknowledging facing intermittent product supply challenges during the festive period, OK Zimbabwe said it will continue to serve its customers and contribute to the countrys economic growth and development.\n\nIt pledged to restore normal supply levels while working to stabilise the trading environment in collaboration with key partners.\n\nIn its recent analysis of OK Zimbabwes financial results for the half-year that ended September 30, 2024, Morgan & Co said tight monetary policies, constrained disposable incomes, taxes and suppliers growing preference for the near-cash informal market continue to add pressure to OK Zimbabwes bottom line in the absence of exchange gains.\n\nHowever, policy shifts and a crackdown on illegal imports could drive sales back to the formal sector, albeit marginally.We also note the organic growth as a way of maintaining sales volumes in the second half.\n\nOK Zimbabwe reported a growth in total revenue anchored on a 28 percent increase in sales volumes.Promotional activity, particularly the OK Grand Challenge Promotion, was the key driver behind sales volume growth, which included the groups OK Mart stores.\n\nResultantly, the gross margin improved by 2,81 basis points to 19,64 percent.The challenges faced by OK Zimbabwe highlight broader difficulties within the formal retail sector, which continues to grapple with competition from the growing informal economy.\n\nCalls for the formalisation of businesses have intensified as the informal sector increasingly undermines the viability of established retailers.\n\nMajor players across various sectors, including food, clothing, textiles and footwear, have reported declining performance due to the influx of non-duty-paying imports and counterfeit goods.\n\nLast year, Truworths, a prominent player in the textile industry, revealed that its business was struggling to compete with cheap imports priced below local manufacturing costs.\n\nThe trend is not unique to Zimbabwe as it cuts across Africa and beyond, and in the process erodes the revenue base for governments as most informal economy players are not tax compliant.\n\nThe high level of informalisation has resulted in the size of Zimbabwes economy being understated while making it difficult to account for the activities of all economic agents for tax purposes.\n\nMost captains of industry and commerce are of the view that the rise of the informal sector while creating opportunity for ordinary people, is a threat to the established productive sector players and the growth of the countrys economy at large.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-12-2.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw GOVERNMENT crackdown on illegal imports that have flooded the informal sector could benefit formal businesses such as OK Zimbabwe, which face excessive competition, securities firm, Morgan & Co has noted. Major retail outlets, clothing entities, hardware shops and other formal enterprises face stiff competition from informal traders who import goods without adhering […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "Kay Kid uMfanomsotho starts the year with Amawala",
            "url": "https://www.chronicle.co.zw/kay-kid-umfanomsotho-starts-the-year-with-amawala/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nGwanda-based musician Kay_Kid UMfanomsotho is not letting his guard down, as he is eager to keep his fans engaged with the release of Amawala today.\n\nBecoming his first musical project to be released in 2025, Amawala was written by Fly and produced by Weird National Audioholics.\n\nKay_Kid Umfanomsotho\n\nThe video, directed by Motion Culture, was shot in Gwanda by Promethius.The song is now available on platforms including Spotify, Apple Music, and the YouTube page Kay_Kid UMfanomsotho.\n\nListening to the teaser of the track, one is reminded of a lost lover, as the young artist sings the lyrics:Besengfungile mamaUkuth ngyowacitsha AmawalaNgoba imihlola ethwele ingozi ngayibonaNgayibona Ntombie emdalaNgayibona bangtshaya umoya wasucula uhayi khonaKant ngilamanga sengibone u Kedibone.\n\nKay_Kid UMfanomsotho said his fans and followers should brace themselves for more works this year.The song is all about a boy who once fell in love, though things didnt go well. Hence, the boy ended up swearing that he wouldnt return to a love relationship because they had shown him flames. But, unfortunately, during that period, he saw Kedibone and unexpectedly fell back in love.\n\nThis year, were working, no playing around. Another song with a video will be dropping after Amawala, and this one is called Nhliziyo, featuring Khwezi. More updates will be coming soon, said Kay_Kid UMfanomsotho.Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yjutyjutyjuyu.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Gwanda-based musician Kay_Kid UMfanomsotho is not letting his guard down, as he is eager to keep his fans engaged with the release of Amawala today. Becoming his first musical project to be released in 2025, Amawala was written by Fly and produced by Weird National Audioholics. The video, directed by Motion Culture, […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "Women’s financial inclusion key to economic growth",
            "url": "https://www.chronicle.co.zw/womens-financial-inclusion-key-to-economic-growth/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nMICRO-FINANCER Inclusive Financial Services (Private) Limited (IFS) founder and chief executive, Dr Gerald Zhou, has stressed the importance of prioritising womens financial inclusion, saying empowering them translates to empowering the economy.\n\nDr Zhou noted that women face more significant challenges in accessing funding compared to men, which limits their potential and hinders their contribution to economic growth.\n\nOnly 25 percent of financial institutions portfolios are loans advanced to women, and 75 percent of these financed women are in urban areas. Of the 75 percent, only 15 percent have access to financial services, he said.Dr Zhou said there is a need for financial institutions to tailor products that meet the unique needs of women, particularly those in rural areas.\n\nThese include educational, healthcare and funeral financing.He also suggested easing collateral requirements to enhance accessibility.We can conduct awareness campaigns in places where women frequently gather, such as baby clinics, market stalls, or irrigation schemes, he said.\n\nDr Zhou recommended introducing group lending models and digital financial products to bridge the gap.Dr Zhou identified key impediments to womens access to finance, particularly in rural areas, which include lack of collateral as many women in rural areas do not possess title deeds, limiting their ability to secure loans.\n\nRural women often have to travel long distances to access financial institutions. Womens busy schedules, managing families and other responsibilities, restrict their ability to visit financial institutions, and they are often perceived as risk-averse by financial institutions, he said.\n\nDr Zhou said women are the backbone of their families and communities hence financing them uplifts entire families and creates a ripple effect in the economy.\n\nWomen prefer working in groups, which increases word-of-mouth referrals for financial institutions. Women also constitute 52 percent of Zimbabwes population, ensuring a stable market share, he said.\n\nIFS, established in 2012 with its head office in Bulawayo, operates under the supervision of the Reserve Bank of Zimbabwe (RBZ). It has grown to become one of the countrys leading financial institutions, with branches nationwide.\n\nThe firm specialises in funding small and medium enterprises (SMEs), smallholder farmers, micro-enterprises, youth and general consumption needs. It also offers leasing finance and advisory services.\n\nIFS has been recognised for its efforts, winning awards from the Zimbabwe National Chamber of Commerce, the Zimbabwe National Chamber of SMEs and the Zimbabwe Institute of Management since 2013 for its support of SMEs and excellence in customer service.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/nmkiu.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com MICRO-FINANCER Inclusive Financial Services (Private) Limited (IFS) founder and chief executive, Dr Gerald Zhou, has stressed the importance of prioritising women’s financial inclusion, saying empowering them translates to empowering the economy. Dr Zhou noted that women face more significant challenges in accessing funding compared to men, which limits their potential and […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        },
        {
            "title": "Agricultural wealth re-imagined: President Mnangagwa’s vision",
            "url": "https://www.chronicle.co.zw/agricultural-wealth-re-imagined-president-mnangagwas-vision/",
            "content": "Dereck Goto\n\nProminent businessman and Chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has described Zimbabwes recent introduction of bankable title deeds for state-owned land as a landmark initiative with the potential to transform the countrys economic landscape.\n\nSpeaking during a televised interview on ZBC TVs Face the Nation on January 15, Mr Tagwirei applauded President Mnangagwas leadership, calling the move a stroke of genius that addresses both national solvency and the empowerment of farmers.\n\nThe programme, launched in December 2024, aims to provide beneficiaries of the Land Reform Programme with secure, bankable title deeds, replacing offer letters and 99-year leases.\n\nThese deeds allow farmers to access affordable financing, thereby fostering commercial agriculture.Mr Tagwirei urged farmers to embrace the opportunity, using the analogy of buffaloes that face storms directly to highlight the importance of resilience and determination.\n\nWe must not fear what God and the President have given us. This land is the key to creating wealth, he said.Addressing misconceptions and building confidence\n\nMr Tagwirei dispelled fears that the bankable deeds could result in banks seizing land from farmers unable to repay loans. He clarified that the Government retains ownership of the land, with banks merely administering the financing.In cases of repossession, banks must consult the Government, ensuring that land remains under state control.\n\nHe further dismissed allegations that the programme could reverse the Land Reform Programme or that he himself would exploit it to acquire vast tracts of land, stating, I do not have $20 billion to buy all this land.\n\nThe programme also addresses public concerns about multiple farm ownership. By linking deeds to individual national identification numbers, the system ensures that land distribution remains fair and transparent.\n\nMr Tagwirei emphasised that the programme adheres to constitutional provisions guaranteeing access to land for all citizens.Inclusive and transparent implementation\n\nThe Land Tenure Implementation Committee, established in 2024, comprises 14 members from diverse professional backgrounds, including constitutional lawyers, bankers, war veterans, youth representatives, and senior government officials.\n\nFour permanent secretaries  representing Justice, Local Government, Agriculture, and Finance  serve as ex-officio members, alongside the Chairperson of the Land Commission.\n\nSubcommittees focusing on legal frameworks, finance, survey and planning, and stakeholder relations have been formed to ensure seamless implementation.\n\nFarmers seeking deeds must apply through the Ministry of Lands, after which evaluators determine land value.Deed fees, paid to the Consolidated Revenue Fund, facilitate the issuance of titles through the Deeds Office upon recommendation by the Land Tenure Implementation Committee.\n\nChairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei\n\nOver the next 18 months, the committee plans to issue 24 000 deeds for A1 and A2 farmers while reviewing the system to maximise efficiency and benefits.\n\nEconomic potential and national developmentThe introduction of bankable deeds, alongside the establishment of the Mutapa Investment Fund, has significantly bolstered Zimbabwes economic prospects.\n\nMr Tagwirei noted that the programme has created a $13 billion asset base, complementing the $16 billion valuation of the Mutapa Investment Fund.\n\nHe projected that Zimbabwes GDP could rise from $47 billion to over $65 billion, driven by enhanced agricultural productivity and infrastructure development funded through deed fees.\n\nThe programmes design ensures that the Government benefits directly. Fees collected will be channelled into a central fund managed by banks, which will support agricultural financing, infrastructure projects, and the repayment of Government obligations.\n\nThis, Mr Tagwirei explained, is how the initiative will catalyse sustained economic growth.A vision rooted in liberation ideals\n\nMr Tagwirei highlighted the historical significance of the programme, describing it as a fulfilment of the liberation struggles objectives.By granting secure ownership of land to beneficiaries, the initiative restores dignity and empowers citizens to contribute meaningfully to national development.\n\nThe liberation objective was to take back the land for the people. This programme ensures that beneficiaries have the security needed to invest and grow, he stated.\n\nIn its initial phase, the programme will issue 2 000 deeds within three months, expanding to 24 000 over 18 months.Mr Tagwirei expressed optimism that the programme would unlock immense economic opportunities, benefiting not just farmers but the entire nation.\n\nThis is one of the best land tenure systems the world has ever seen, and I am proud to be part of it, he concluded. This ambitious initiative underscores Zimbabwes commitment to leveraging its agricultural potential as a cornerstone of economic transformation and regional leadership.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-11-2.jpg",
            "description": "Dereck Goto Prominent businessman and Chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has described Zimbabwe’s recent introduction of bankable title deeds for state-owned land as a landmark initiative with the potential to transform the country’s economic landscape. Speaking during a televised interview on ZBC TV’s Face the Nation on January 15, Mr […]",
            "time": "06:29",
            "date": "17 Jan 2025"
        }
    ]
}