{
    "news": [
        {
            "title": "Chivayo rescues Bosso",
            "url": "https://www.chronicle.co.zw/chivayo-rescues-bosso/",
            "content": "Welldone Ndlovu, Online Reporter\n\nPOPULAR businessman Wicknell Chivayo, a renowned businessman and philanthropist, has ridden to the rescue of Highlanders Football Club, offering to settle the debt that led to the clubs ban from FIFA.\n\nThe ban came as a result of unpaid funds owed to former coaches Baltemar Brito and Antonio Torres.\n\nBrito is owed US$14,778, with the debt accruing an additional US$237.71 in interest as of October 17, 2024, while Torres is owed US$11,788 plus interest of $193.74 as of the same date.\n\nThese owed funds according to the chairman were accumulated from winning bonuses which are paid directly by the club while the salaries are paid by sponsors Sakunda Holdings.\n\nChivayo made the announcement on his X page, formerly Twitter, stating his intention to pay off the outstanding debt owed to former coach Baltemar Brito and his assistant coach Antonio Joao Torres. His message read: Bosso ngenkani! iTeam yezwe lonke. Babethi ayibulawe, ayisoze ibulawe sikhona. I will gladly pay this outstanding debt directly to the former coach tomorrow without fail. Someone please inbox and share the banking details with exact amount due asap.\n\nChivayos generosity and philanthropic efforts are well-documented, with a history of giving back to the community. His timely intervention has saved Highlanders from FIFAs ban, which had prohibited the club from signing new players locally and internationally.\n\nThe news has sent shockwaves of excitement throughout the football community, with fans and supporters expressing their heartfelt gratitude and admiration for Chivayos kindness and generosity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/Wicknell.jpg",
            "description": "Welldone Ndlovu, Online Reporter POPULAR businessman Wicknell Chivayo, a renowned businessman and philanthropist, has ridden to the rescue of Highlanders Football Club, offering to settle the debt that led to the club’s ban from FIFA. The ban came as a result of unpaid funds owed to former coaches Baltemar Brito and Antonio Torres. Brito is […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Munetsi makes Wolves bench",
            "url": "https://www.chronicle.co.zw/munetsi-makes-wolves-bench/",
            "content": "Online Reporter\n\nWARRIORS vice-captain, Marshall Munetsi, has been named on the bench for Wolverhampton Wanderers (Wolves) as they prepare to take on Blackburn Rovers in an FA Cup match this afternoon.The 27-year-old midfielders inclusion in the matchday squad comes just days after making the high-profile move from French Ligue 1 side Stade de Reims to the Premier League club.Munetsis swift transition from France to England marks a significant step in his career\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/njju.jpg",
            "description": "Online Reporter WARRIORS vice-captain, Marshall Munetsi, has been named on the bench for Wolverhampton Wanderers (Wolves) as they prepare to take on Blackburn Rovers in an FA Cup match this afternoon. The 27-year-old midfielder’s inclusion in the matchday squad comes just days after making the high-profile move from French Ligue 1 side Stade de Reims […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Watch: Musician Gemma Griffiths launches podcast ‘Hello, Hi… With Gemma’ to celebrate African creatives",
            "url": "https://www.chronicle.co.zw/watch-musician-gemma-griffiths-launches-podcast-hello-hi-with-gemma-to-celebrate-african-creatives/",
            "content": "Showbiz Reporter\n\nWith the rise of podcasts covering a range of topics, talented musician Gemma Griffiths is stepping into the space with her own unique show titled Hello, Hi With Gemma.\n\nThe podcast aims to highlight the incredible creatives shaping Zimbabwe and Africa.From music to art, culture to big ideas, were diving deep into the stories that inspire, challenge, and connect us, Gemma shared about the show.\n\nThe first episode features the legendary Zimbabwean musician Jah Prayzah, set to be released tomorrow. Early teasers show a relaxed conversation between the two, showcasing Gemmas infectious personality and insightful questions.\n\nA massive shout out to the amazing team who worked extremely hard to make this possible, thank you, Gemma wrote on her Facebook page.\n\nFuture episodes will feature Gemmas bestie, musician Nutty O, and many other exciting guests. Fans are already buzzing with anticipation, and many believe the podcast will gain popularity not just in Zimbabwe, but internationally.\n\nGemma, a multi-award-winning artist, is known for her hits Maita Basa Baba, Titungamirei, and One Call Away, and is sure to bring the same level of creativity and authenticity to her new venture.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ioji9.jpg",
            "description": "Showbiz Reporter With the rise of podcasts covering a range of topics, talented musician Gemma Griffiths is stepping into the space with her own unique show titled ‘Hello, Hi… With Gemma’.   The podcast aims to highlight the incredible creatives shaping Zimbabwe and Africa. “From music to art, culture to big ideas, we’re diving deep […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Mbumba hails Nujoma as a gallant son of the land",
            "url": "https://www.chronicle.co.zw/mbumba-hails-nujoma-as-a-gallant-son-of-the-land/",
            "content": "Namibias President Nangolo Mbumba has described former statesman, Dr. Sam Nujoma, as a gallant son of the land.\n\nNujoma died at a hospital in Windhoek yesterday,at the age of 95.\n\nMbumba says Nujoma heroically marshalled the Namibian people during the darkest hours of the liberation struggle until the attainment of freedom and independence on March 21, 1990.\n\nHe says, During this period of national mourning, we should be comforted by the unmatched leadership and extraordinary contributions of President Nujoma to the liberation struggle, the development and unity of the Namibian people. I would like to thank the medical staff who cared diligently for our treasured leader. Also, I would like to thank Namibians and friends of Namibia who extended messages and prayers of recovery.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/j7kofyg7u.jpg",
            "description": "Namibia’s President Nangolo Mbumba has described former statesman, Dr. Sam Nujoma, as a gallant son of the land. Nujoma died at a hospital in Windhoek yesterday, at the age of 95. Mbumba says Nujoma heroically marshalled the Namibian people during the darkest hours of the liberation struggle until the attainment of freedom and independence on […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Teen arrested for bar break-in",
            "url": "https://www.chronicle.co.zw/teen-arrested-for-bar-break-in/",
            "content": "Sidumisile Mabena,[emailprotected]An 18-YEAR-OLD man has been arrested for allegedly breaking into a sports bar in Pumula East and stealing cash and beer.Perfect Ncube, made off with beer, US$50 and ZAR1 490 cash after he unlawfully gained entry into the bar.The suspect allegedly gained entry into the bar through an unlocked door before stealing beer, US$50 and ZAR1 490 cash, said the police in a statement on X.Ncube was identified through CCTV footage.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com An 18-YEAR-OLD man has been arrested for allegedly breaking into a sports bar in Pumula East and stealing cash and beer. Perfect Ncube, made off with beer, US$50 and ZAR1 490 cash after he unlawfully gained entry into the bar. “The suspect allegedly gained entry into the bar through an unlocked door […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Plane crashes into bus on busy street",
            "url": "https://www.chronicle.co.zw/plane-crashes-into-bus-on-busy-street/",
            "content": "Two people were killed and two more injured when a small plane crashed in So Paulo, emergency services have confirmed.\n\nThe aircraft came down on the busy Marques de Sao Vicente Avenue, colliding with a bus on the ground.\n\nA passenger on the bus and a motorcyclist hit by debris were taken to hospital, while those who died were aboard the plane, fire department spokesperson Captain Maycon Cristo said.\n\nSmoke could be seen rising over Brazils largest city in the aftermath of the incident.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hgyuh.jpg",
            "description": "Two people were killed and two more injured when a small plane crashed in São Paulo, emergency services have confirmed. The aircraft came down on the busy Marques de Sao Vicente Avenue, colliding with a bus on the ground. A passenger on the bus and a motorcyclist hit by debris were taken to hospital, while […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Sony’s PlayStation Network reports major global outage",
            "url": "https://www.chronicle.co.zw/sonys-playstation-network-reports-major-global-outage/",
            "content": "Sonys PlayStation Network (PSN), which connects gamers online on its systems, experienced a massive outage that lasted about 24 hours.\n\nPlayStation Support postedan updateon X that users should be able to access online features without any problems now, following reports of outages on Friday.\n\nThe service issues began on Friday at 7 p.m. ET, according to PlayStationsstatus website. The outage had made it difficult for many users to access account management, gaming, video, the PlayStation Store and Direct services on the internet and their console devices, like the PlayStation 5.\n\nThe outage was among the longest the platform has experienced.\n\nIn April 2011, almost all of PlayStation Networks subscriberslost accessto its services for nearly a month following a data breach.\n\nSony and PlayStation did not respond to CNNs requests for comment. PlayStation has not stated what caused the outage.\n\nSome users had posted to TikTok andXthat they were regaining access on Saturday afternoon, though some claimed the functioning service was only temporary. PSN has an estimated 116 million monthly users, according toSony Interactive Entertainment estimatesfrom September 30.\n\nOn Friday night, the services team for Marvel Rivals  a game released in December on platforms including PlayStation  posted toXthat users might have difficulty launching games, apps, or network features.\n\nThe post also said that they were actively communicating with the PlayStation team.\n\nWere seeing players able to log-in and play again on PlayStation platforms, but not all game services may be back online, Fortnites services teampostedto X on Saturday afternoon.\n\nSource: CNN\n\nSource: CNN\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/5T6.jpg",
            "description": "Sony’s PlayStation Network (PSN), which connects gamers online on its systems, experienced a massive outage that lasted about 24 hours. PlayStation Support posted an update on X that users “should be able to access online features without any problems now,” following reports of outages on Friday. The service issues began on Friday at 7 p.m. […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Woman pours boiling cooking oil on husband’s face for cheating",
            "url": "https://www.chronicle.co.zw/woman-pours-boiling-cooking-oil-on-husbands-face-for-cheating/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nA 40-YEAR-OLD woman from Mhondoro, Mashonaland West Province, has been arrested for pouring boiling cooking oil all over her husband in a fit of rage sparked by accusations of infidelity.\n\nOn 27 January 2025, Melody Tambudzai boiled cooking oil and poured it on her husbands face while he was sleeping.\n\nIn a statement on X, the police said, The victim sustained facial burns and is currently hospitalised in Norton.\n\nInvestigations revealed that the couple had a history of marital problems stemming from accusations of infidelity\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/05/boiling-oil.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A 40-YEAR-OLD woman from Mhondoro, Mashonaland West Province, has been arrested for pouring boiling cooking oil all over her husband in a fit of rage sparked by accusations of infidelity. On 27 January 2025, Melody Tambudzai boiled cooking oil and poured it on her husband’s face while he was sleeping. In a […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "Namibia’s ‘founding father’ Sam Nujoma dies aged 95",
            "url": "https://www.chronicle.co.zw/namibias-founding-father-sam-nujoma-dies-aged-95/",
            "content": "WINDHOEK, Feb 9 (Reuters)  Sam Nujoma, the activist and guerrilla leader who became Namibias first democratically elected president after it won its independence from apartheid South Africa, died aged 95 on Saturday, the Namibian Presidency said on Sunday.\n\nNujoma rose to head the thinly populated southern African country on March 21, 1990 and was formally recognised as Founding Father of the Namibian Nation through a 2005 act of parliament.\n\nThe acclaim was balanced out by domestic and international criticism over his intolerance of critical media coverage, his railing against homosexuality and over the 1998 constitutional amendment that let him run for a third term.\n\nHe was a longtime ally of Zimbabwean President Robert Mugabe, backing Mugabes land seizures from white farmers, though at home Nujoma stuck to a willing buyer, willing seller policy.\n\nThe foundations of the Republic of Namibia have been shaken, the presidency posted on X.\n\nOur venerable leader, Dr. Nujoma did not only blaze the trail to freedom  but he also inspired us to rise to our feet and to become masters of this vast land of our ancestors.\n\nThe presidency said Nujoma had been hospitalised for medical treatment over the past three weeks, adding: Unfortunately, this time, the most gallant son of our land could not recover from his illness.\n\nCOMPLEX LEGACY\n\nNujoma served his three terms as president from 1990 to 2005 and sought to project himself as a unifying leader bridging political divides.\n\nIn a country scarred by the legacy of apartheid and German colonial rule, Nujomas SWAPO party oversaw a national reconciliation programme under the motto One Namibia, One Nation.\n\nIn his speeches, Nujoma made a point of repeating the phrase: A united people, striving to achieve a common good for all members of the society, will always emerge victorious.\n\nAdvertisement  Scroll to continue\n\nHis achievements included establishing democratic institutions and prioritising reconciliation, said Ndumba Kamwanyah, a lecturer at the University of Namibia and a political analyst.\n\nBut his autocratic tendencies, on display in his treatment of the media and brutal suppression of the 1999 Caprivi rebellion, cast a shadow over his legacy, Kamwanyah added.\n\nWhile Nujomas presidency was foundational in establishing Namibias independence and governance, it was not without flaws, Kamwanyah said.\n\nCAMPAIGNER AND GUERRILLA\n\nNujoma was born in a village in northwestern Namibia in 1929, when his country was under South African administration. South Africa had controlled Namibia since World War One after a brutal few decades of German colonial rule remembered for the genocide of the Herero and Nama people.\n\nAs a boy he looked after his familys cattle and attended a Finnish mission school, before moving to the coastal town of Walvis Bay and then the capital Windhoek, where he worked for South African Railways, according to a biography posted on the website of Nujomas charitable foundation.\n\nNujoma left his job on the railways to focus his energies on bringing down the apartheid system.\n\nIn the late 1950s he became leader of the Owambo Peoples Organisation, a precursor to liberation movement SWAPO, organising resistance to the forced relocation of Black people in Windhoek that culminated in the police killing 12 unarmed people and wounding dozens more.\n\nNujoma was charged with organising the resistance and arrested.\n\nIn 1960, he went into exile. He travelled across Africa before reaching the United States, where he petitioned the United Nations for Namibias independence.\n\nMade SWAPO leader in absentia, Nujoma established its armed wing and in 1966 launched a guerrilla war against the apartheid government.\n\nIt took more than a decade of pressure from Nujoma and others before a U.N. Security Council resolution in 1978 proposed a ceasefire and elections, and another decade for the ceasefire deal to be signed and elections held in late 1989.\n\nSWAPO won a majority in those elections, and Nujoma took office in March the following year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Z6QCHG47FBNELJG4WLJP2N3QUA-680x380.jpg",
            "description": "WINDHOEK, Feb 9 (Reuters) – Sam Nujoma, the activist and guerrilla leader who became Namibia’s first democratically elected president after it won its independence from apartheid South Africa, died aged 95 on Saturday, the Namibian Presidency said on Sunday.   Nujoma rose to head the thinly populated southern African country on March 21, 1990 and […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        },
        {
            "title": "President Ruto calls for unified action to resolve DRC conflict",
            "url": "https://www.chronicle.co.zw/president-ruto-calls-for-unified-action-to-resolve-drc-conflict/",
            "content": "Online Reporter\n\nKenyan President William Ruto has called for urgent, collective, and sustained action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), emphasising the need for diplomatic solutions over military intervention.\n\nSpeaking at the historic joint summit of the East African Community (EAC) and Southern African Development Community (SADC) in Dar es Salaam, President Ruto expressed deep concern over the prolonged conflict, which has devastated the DRC for over two decades.\n\nHe commended Tanzanian President Samia Suluhu Hassan for hosting the summit, underscoring the importance of regional collaboration in resolving the crisis.\n\nWe find ourselves standing face to face with a grave security, diplomatic, and humanitarian crisis in the DRC, a situation that demands our immediate, collective, and sustained attention, he said.\n\nHe highlighted the immense toll the conflict has taken on the DRC, including mass displacement, loss of life, and economic setbacks.\n\nThe recent escalation of violence in Goma and surrounding areas, he warned, serves as a stark reminder of the urgent need for action.\n\nPresident Ruto called on all parties involved in the conflict to immediately cease hostilities, emphasising that military action alone will not bring a lasting solution.\n\nHe specifically urged the M23 rebel group to halt further advancements and called on the armed forces of the DRC to refrain from retaliatory measures.\n\nAn immediate ceasefire is the only way by which we can create necessary conditions for constructive dialogue and implementation of a comprehensive peace agreement, said President Ruto.\n\nHe reaffirmed the commitment of EAC and SADC to the principles of territorial integrity, national sovereignty, and peaceful coexistence. Additionally, he condemned attacks on diplomatic missions, civilians, and peacekeepers, calling such acts a violation of international law.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tr5g4.jpg",
            "description": "Online Reporter Kenyan President William Ruto has called for urgent, collective, and sustained action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), emphasising the need for diplomatic solutions over military intervention. Speaking at the historic joint summit of the East African Community (EAC) and Southern African Development Community (SADC) […]",
            "time": "18:36",
            "date": "09 Feb 2025"
        }
    ]
}