{
    "news": [
        {
            "title": "WATCH: Boys Dzamdara Bulawayo province chapter launched",
            "url": "https://www.chronicle.co.zw/watch-boys-dzamdara-bulawayo-province-chapter-launched/",
            "content": "Online Reporter\n\nEMPOWERMENT youth lobby group Boys Dzamdara, a Zanu PF affiliate, has launched the Bulawayo Metropolitan Province chapter at a local hotel on Friday night.\n\nBoys Dzamdara Bulawayo chapter chairman Cde Khayelihle Khanye\n\nBoys Dzamdara is an empowerment youth lobby group whose objectives among others is to carry out a number of activities across the country to promote youth participation in the national economy in line with Vision 2030.\n\nMinister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube (right) and Zanu-PF Bulawayo province secretary for Administration Cde Raymond Mutomba.\n\nThe lobby group is targeting youths ranging from 15 to 35 years to ensure that they are well versed with Government policies.\n\nBulawayo chapter chairman Cde Khayelihle Pardon Khanye said the organisation will work hard to source funds for local youths to embark on income generating projects.\n\nMinister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube was the guest of honour.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/IMG-20250321-WA0083-680x380.jpg",
            "description": "Online Reporter EMPOWERMENT youth lobby group Boys Dzamdara, a Zanu PF affiliate, has launched the Bulawayo Metropolitan Province chapter at a local hotel on Friday night. Boys Dzamdara is an empowerment youth lobby group whose objectives among others is to carry out a number of activities across the country to promote youth participation in the […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Bulawayo to fix Lobengula Street potholes in 30-week project",
            "url": "https://www.chronicle.co.zw/bulawayo-to-fix-lobengula-street-potholes-in-30-week-project/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nThe City of Bulawayo has advised the public that Lobengula Street improvement works will commence on the 24th of March, with the local authority set to complete the works in 30 weeks. This comes following the development of a huge pothole at the corner of Lobengula Street and Third Avenue, a very busy intersection, which is now a nightmare for motorists navigating their way in and out of the Bulawayo city centre.\n\nThe busy intersection is mostly used by commuter omnibus operators who use Luveve Road to link several suburbs such as Emakhandeni, Cowdray Park, Entumbane, Njube, and Nguboyenja, among others, to the city centre. The intersection is littered with potholes, and social media users have now named this large one the King Pothole.\n\nIn a statement, the City of Bulawayo said the works will comprise pothole patching, localised pavement reconstruction, overlays, stormwater drainage improvement works, reinstating of carriageway markings, and other cyclical maintenance works.\n\nThe City of Bulawayo would like to advise members of the motoring public of the proposed Lobengula Street Improvement Works, between 3rd Avenue and 6th Avenue, approximately 800 metres, reads the statement.\n\nThe works will commence on Monday, 24 March 2025, for approximately 30 weeks. Once completed, these works will prolong the life of the carriageway and improve road safety and ride quality.\n\nTo ensure the safety of both the motoring public and workforce whilst carrying out the works, the local authority said a traffic management system will be in place, which includes full carriageway closure of Lobengula Street between 3rd and 6th Avenue and lane closures where necessary.\n\nEvery effort has been made to ensure disruption to traffic, businesses, and residents is kept to a minimum. However, the road closure will inevitably cause some disruption, and for this, the City of Bulawayo wishes to apologise in advance, said the City of Bulawayo.\n\nThe motoring and the general public are advised to exercise extreme caution when entering and leaving the works locations, observe all warning signs, and follow the diversion route signs.\n\n@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jgyuyu.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  The City of Bulawayo has advised the public that Lobengula Street improvement works will commence on the 24th of March, with the local authority set to complete the works in 30 weeks. This comes following the development of a huge pothole at the corner of Lobengula Street and Third Avenue, a very […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Big field for Matabeleland Amateur",
            "url": "https://www.chronicle.co.zw/big-field-for-matabeleland-amateur/",
            "content": "Brandon Moyo\n\nTHE 2025 Matabeleland Amateur which is set to tee off at Bulawayo Country Club tomorrow will be the biggest and most talented field thus far with a full complement of Zimbabwe national teams taking part.\n\nThe juniors set to represent the country in Tunisia for the All Africa Juniors as well as the national teams going to Botswana for Region Five games will take to the greens at Bulawayo Country Club. The tournament will take place on Saturday and Sunday.\n\nTop players like Tanaka Chatora, Keegan Shutt, Kelvin Muchenje, Michael Wallace, Tracy Humbira, and Batsirai Tilowakuti among others will battle it out. However, the defending champion Vincent Chidambazina will not make it as he is preparing for his A Level examinations.\n\nThere are 39 entries for the championship division (54 holes) and 36 players for the nett division. Of the 39 entries in the championship division where a winner will emerge, nine are women.\n\nPreparations started way back with Bulawayo Country Club management preparing the course immaculately well after the heavy rains in the past. The course is ready and it should encourage players to shoot under-par. From the admin side, everything has gone well and we are ready for the event.\n\nThe massive field is what we want to have every time as it calls for us golf administrators to up our game. It excites us, we aim for nothing other than a successful event, said Matabeleland Golf Association president, Vincent Makamure.\n\nThe first tee for round one is at 06.30am off the first tee.\n\n @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/iyukiyuikui.jpg",
            "description": "Brandon Moyo THE 2025 Matabeleland Amateur which is set to tee off at Bulawayo Country Club tomorrow will be the biggest and most talented field thus far with a full complement of Zimbabwe national teams taking part. The juniors set to represent the country in Tunisia for the All Africa Juniors as well as the […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Agriculture Deputy Minister Marapira urges livestock sector to scale up production, boost national GDP",
            "url": "https://www.chronicle.co.zw/agriculture-deputy-minister-marapira-urges-livestock-sector-to-scale-up-production-boost-national-gdp/",
            "content": "Nqobile Bhebhe,Senior Business Writer\n\nDeputy Minister of Lands, Agriculture, Fisheries and Rural DevelopmentDeputy Minister Davis Marapira has urged the livestock sector to scale up production and make a meaningful contribution to the national gross domestic product (GDP).\n\nSpeaking at the inaugural ZITF Livestock Conference in Bulawayo on Friday, Dep Min Marapira stressed the need to boost the national herd, which currently stands at 5.7 million.\n\nHe noted the sectors crucial role in sustaining rural livelihoods but stressed the need for significant growth.\n\nCurrent figures are not contributing to the economy. There is no growth in the livestock sector, he said.\n\nHe urged farmers to drive expansion and improve productivity.\n\nWe need farmers to bring growth so there is a contribution to the GDP. We have about 5.7 million cattle while Tanzania has around 32 million and Kenya over 25 million. Yet, we are still talking about 5.7 million. There is no growth.\n\nLooking ahead, he called for solutions to the sectors challenges.\n\nAs we look to the future, we must confront challenges affecting the growth of the sector, he added.\n\nThe Governments plan to grow the countrys national herd to 11 million cattle by 2030 is progressing well with various programmes in place to ensure that the country meets national beef demand.\n\nTo grow the national herd, the Government is spearheading an artificial insemination programme to farmers in rural areas, the process involves cross breeding with semen from selected quality bulls.\n\nGovernment is expecting the livestock industry to grow to US$3,4 billion by 2025 after the sector makes positive strides in improving productivity and combating cattle mortality following the outbreak of tick borne diseases which ravaged almost half a million of cattle since 2016.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Untitled-7-copy-5.jpg",
            "description": "Nqobile Bhebhe,Senior Business Writer Deputy Minister of Lands, Agriculture, Fisheries and Rural Development Deputy Minister Davis Marapira has urged the livestock sector to scale up production and make a meaningful contribution to the national gross domestic product (GDP). Speaking at the inaugural ZITF Livestock Conference in Bulawayo on Friday, Dep Min Marapira stressed the need to […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "BREAKING: Pastor Bothwell Phiri shoots son, charged with attempted murder",
            "url": "https://www.chronicle.co.zw/breaking-pastor-bothwell-phiri-shoots-son-charged-with-attempted-murder/",
            "content": "Peter Matika,[emailprotected]\n\nRIVER of Life senior pastor Bothwell Phiri, 57, who shot his son at their place of residence in Kumalo suburb, Bulawayo has been charged with attempted murder in a case of mistaken identity.\n\nBulawayo province acting police spokesperson Assistant Inspector Nomalanga Msebele confirmed the incident.\n\nShe said the incident occurred on March 17 at around 1:20 AM.\n\nAssistant Inspector Msebele said Phiris son Jordan, 29, arrived home from a plot in Esigodini and failed to gain entry into the house through the door as it was locked.\n\nHe then proceeded to open a window trying to gain entry and was shot in the groin by the accused person. When he realised it was his son he rushed him to UBH where he is receiving treatment and is in a stable condition, she said.\n\nAssistant Inspector Msebele said Phiri told police he shot his son, as he thought he was an intruder.\n\nThis was an unfortunate incident. The accused person was interviewed and told police he mistakenly shot his son as he thought he was an intruder. The firearm was checked and it was proven that he is a licensed holder of the firearm, said Assistant Inspector Msebele.\n\nMore to follow . . .\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Pastor-Bothwell-Phiri-and-his-son-Jordan-left.-Pastor-Bothwell-Phiri.-picture-credit-Bothwell-Phiri-Facebook-page.-680x380.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw RIVER of Life senior pastor Bothwell Phiri, 57, who shot his son at their place of residence in Kumalo suburb, Bulawayo has been charged with attempted murder in a case of mistaken identity. Bulawayo province acting police spokesperson Assistant Inspector Nomalanga Msebele confirmed the incident. She said the incident occurred on March 17 […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Bulawayo’s livestock sector sustains 30,000 households",
            "url": "https://www.chronicle.co.zw/bulawayos-livestock-sector-sustains-30000-households/",
            "content": "Nqobile Bhebhe, Senior Business Writer\n\nTHE livestock sector value chain in Bulawayo supports close to 30 000 households through providing employment and industry suppliers.\n\nSpeaking at the inaugural ZITF Livestock Conference in Bulawayo, Acting Permanent Secretary for Bulawayo Metropolitan Province Mr Morres Cholasa Mbewe said the livestock sector creates a ripple effect throughout the local economy benefiting the suppliers and various related industries.\n\nThe livestock sector is vital to Zimbabwes economy, supporting 70 percent of rural households and playing a crucial role in food security and employment.\n\nThe city of Bulawayo is a crucial hub of livestock framework and processes.\n\nThe livestock sector in Bulawayo supports over 30 000 households providing employment and income for many in our community.\n\nThis not only enhances the livelihoods of those who live on farming but also creates a ripple effect throughout the local economy benefiting the suppliers and various related industries.\n\nThe government has set a target of growing the sector to a value of US$3.4 billion by this year. The industrys ongoing efforts to bolster productivity and reduce livestock mortalities are crucial in driving this ambitious growth.\n\nAs the sector continues to advance, expectations are high for its significant contribution to the national economy in the coming years\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Cattle-grazing.jpg",
            "description": "Nqobile Bhebhe, Senior Business Writer THE livestock sector value chain in Bulawayo supports close to 30 000 households through providing employment and industry suppliers. Speaking at the inaugural ZITF Livestock Conference in Bulawayo, Acting Permanent Secretary for Bulawayo Metropolitan Province Mr Morres Cholasa Mbewe said the livestock sector creates a ripple effect throughout the local […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Timely Government and Farmer Interventions Save 2.7 Million Cattle from El Niño-Induced Drought",
            "url": "https://www.chronicle.co.zw/timely-government-and-farmer-interventions-save-2-7-million-cattle-from-el-nino-induced-drought/",
            "content": "Nqobile Bhebhe, Senior Business Writer\n\nTimely interventions by the government and farmers saved nearly 2.7 million cattle from dying due to the El Nio-induced drought, Permanent Secretary of Lands, Agriculture, Fisheries, Water, and Rural Development, Professor Obert Jiri.\n\nSpeaking at the inaugural ZITF Livestock Conference in Bulawayo on Friday, Professor Jiri emphasised the need for Matabeleland South, Matabeleland North, and Masvingo to implement more effective strategies to minimize cattle losses in the region.\n\nSo whatever we did in this past season saved 2.7 million cattle from death. Of course, we lost some cattle, but not close to two million, he said.\n\nHe further elaborated, When we put everything from January 2024 to December, we lost almost 50,000 cattle. So if you took the 50,000 over 2.7 million, you will find that the government interventions and the farmer interventions really saved the day.\n\nIn response to the El Nio-induced drought, Professor Jiri outlined several key government initiatives aimed at mitigating its impact on livestock.\n\nHe told delegates that establishing of 1,620 Drought Mitigation Ward Centres (DMWC) to support farmers, constructing water troughs for 10,000 VBUs to ensure livestock access to water, and launching a blitz-borehole drilling program to provide water for both humans and livestock nationwide saved livestock deaths.\n\nHe added that mplementing mass vaccination and deworming campaigns to improve livestock survival rates was another measure used.\n\nIn collaboration with development partners, we have implemented these feed intervention strategies, providing vital support such as hay, silage, and beef survival meal for livestock sustenance, he said.\n\nThe targeted feed supplementation program prioritises vulnerable districts, particularly within Matabeleland.\n\nSo far, 9,665MT out of 15,000MT of maize silage and 280MT out of 600MT of wheat silage have been distributed to distressed wards.\n\nProfessor Jiri noted the significance of hosting the inaugural Livestock Conference in Matabeleland, describing the region as the heart of livestock production in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ndbdbgufufuf.jpg",
            "description": "Nqobile Bhebhe, Senior Business Writer Timely interventions by the government and farmers saved nearly 2.7 million cattle from dying due to the El Niño-induced drought,  Permanent Secretary of Lands, Agriculture, Fisheries, Water, and Rural Development, Professor Obert Jiri. Speaking at the inaugural ZITF Livestock Conference in Bulawayo on Friday, Professor Jiri emphasised the need for […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Acting President Chiwenga hails Kirsty Coventry’s IOC presidency as a new era for global sports",
            "url": "https://www.chronicle.co.zw/acting-president-chiwenga-hails-kirsty-coventrys-ioc-presidency-as-a-new-era-for-global-sports/",
            "content": "Online Reporter\n\nACTING President General (Retired) Constantino Chiwenga has extended heartfelt congratulations to Zimbabwes newly elected President of the International Olympic Committee (IOC), Sports Minister Kirsty Coventry saying the achievement as a testament to Zimbabwes spirit of determination and excellence.\n\nThe newly elected IOC President, whose journey from a celebrated Olympian to a global sports leader has inspired millions, has become the first woman and first African to hold the prestigious position.\n\nActing President Chiwenga, in a statement released today, described the achievement as a testament to Zimbabwes spirit of determination and excellence.\n\nThis is not just a personal triumph; it is also a moment of immense pride for our country, Acting President Chiwenga said.\n\nYour journey from a talented swimmer to becoming the first woman and first African to be elected President of the International Olympic Committee exemplifies the values we hold dear as a nation.\n\nThe Acting President highlighted the newly elected IOC Presidents illustrious career, which includes groundbreaking achievements as an Olympian and transformative contributions as Zimbabwes Minister of Sports, Recreation, Arts, and Culture.\n\nActing President Chiwenga credited President Emmerson Mnangagwas foresight in appointing the now-IOC President to the ministerial role, citing their profound impact on Zimbabwes national sports agenda.\n\nYour extensive experience and profound knowledge of the sporting world have already left an indelible mark on our nation, Acting President Chiwenga said.\n\nYour new role at the International Olympic Committee is a testament to your capabilities and vision, and we are confident you will continue to shine on the global stage.\n\nActing President Chiwenga urged the newly elected leader to remain steadfast in representing Zimbabwean values and aspirations while steering the IOC toward a more equitable and dynamic future.\n\nThe role of International Olympic Committee President carries immense responsibilities, and I have every confidence that you will advocate for the growth and development of sports worldwide, Chiwenga said. Your leadership comes at a pivotal time, and we are excited to see the positive changes you will bring to the global sports community.\n\nThe Acting President reaffirmed the Zimbabwean Governments unwavering support for the IOC Presidents new role, emphasizing the nations commitment to fostering international collaboration in sports.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-22-at-16.51.56-680x380.jpeg",
            "description": "Online Reporter  ACTING President General (Retired) Constantino Chiwenga has extended heartfelt congratulations to Zimbabwe’s newly elected President of the International Olympic Committee (IOC), Sports Minister Kirsty Coventry saying the achievement as a testament to Zimbabwe’s spirit of determination and excellence.   The newly elected IOC President, whose journey from a celebrated Olympian to a global sports […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Senator Chief Nyangazonke calls for collective action to end teenage pregnancies and child marriages",
            "url": "https://www.chronicle.co.zw/senator-chief-nyangazonke-calls-for-collective-action-to-end-teenage-pregnancies-and-child-marriages/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nSENATOR CHIEF Nyangazonke from Matobo District has said the fight against teenage pregnancies and child marriages can only be successful through self introspection and behavior change.\n\nSpeaking during a Not in my Village campaign Matabeleland South provincial inception meeting Chief Nyangazonke said each member of the community has to assume a role of protecting youngsters instead of harming them.\n\nHe said there is a need for traditional leaders to be actively involved in such programmes from the onset.\n\nThis initiative should start with each individual. We are all parents, uncles, aunties, grandparents and guardians. Why dont we start by saying not in my home. We have teenage girls within our families and communities who are pregnant and we should ask ourselves what we have done to protect these children.\n\nAs a community we have to realise that each child should be protected by the whole community. Our culture and tradition shouldnt be overridden by the western culture. We shouldnt even be calling this ill child marriages because a child shouldnt even be in a marriage, he said.\n\nChief Nyangazonke said fighting these ills also requires collective effort in putting youngsters in line. He said some youngsters were engaged in drug and substance abuse and sexual activities thereby destroying their future.\n\nStakeholders from Matabeleland South Province have intensified efforts to fight teenage pregnancies and child marriages under the Not in My Village campaign which puts chiefs in the lead in fight against these ills which has been identified as a major cause of a high HIV prevalence rate.\n\nThe community-based campaign aims to raise awareness and mobilise action by engaging the traditional leaders to end child marriages. The campaign seeks to increase knowledge and awareness among traditional leaders and the general public about child marriage, causes and consequences.\n\nIt also seeks to change the attitudes and behaviours of the community gatekeepers and the general public towards child marriage and to promote the rights and well-being of girls.\n\nThe programme will also empower the community gatekeepers and the general public to take action to prevent and respond to child marriage in their villages and to support the implementation and enforcement of the laws and policies that protect girls from child marriage.\n\nChild marriages in Zimbabwe are influenced by several factors such as poverty, gender norms, cultural and religious beliefs, lack of access to education and comprehensive health services.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/chief.jpg",
            "description": "  Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw SENATOR CHIEF Nyangazonke from Matobo District has said the fight against teenage pregnancies and child marriages can only be successful through self introspection and behavior change. Speaking during a “Not in my Village” campaign Matabeleland South provincial inception meeting Chief Nyangazonke said each member of the community has to assume a […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        },
        {
            "title": "Russian President Vladimir Putin congratulates Kirsty Coventry on IOC election",
            "url": "https://www.chronicle.co.zw/russian-president-vladimir-putin-c2ongratulates-kirsty-coventry-on-ioc-election/",
            "content": "Russian President Vladimir Putin congratulated Zimbabwes Kirsty Coventry on her election as International Olympic Committee president on Thursday, saying her unique experience will ensure the movements advancement.\n\nPutin, in a message posted on the Kremlin website, said the outcome of the election clearly testifies to your great authority in the sporting world.\n\nI am certain that your unique experience and interest in the real advancement of the noble Olympic ideals will ensure your success in such a responsible position, he wrote.\n\nPutin was the first world leader to call Coventrys predecessor Thomas Bach when he was elected in 2013.\n\nMoscow wants to have its athletes fully reinstated in the forthcoming Olympic Games following a ban imposed on Russia.\n\nA small number of athletes from Russia and Belarus were permitted to compete in the 2024 Paris Games as neutrals.\n\nPutins sports minister, Mikhail Degtyarev, made it plain that Moscow will press for reinstatement.\n\nWe are waiting, in this era of a new leader, for the Olympic movement to become stronger, more independent and more prosperous and that Russia will return to the Olympic podium, he wrote on the Telegram messaging app.\n\nBelarusian President Alexander Lukashenko said he hoped Coventry will contribute to strengthening mutual understanding between nations and peoples and making sport accessible to all.\n\nThe head of Ukraines National Olympic Committee, Vadym Guttsait, who lobbied hard to keep Russian athletes out of Olympic competition, said he hoped that under Coventrys leadership, the IOC will continue the fight for peace, equality and inclusivity. Reuters\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/05/President-Vladimir-Putin.jpg",
            "description": "  Russian President Vladimir Putin congratulated Zimbabwe’s Kirsty Coventry on her election as International Olympic Committee president on Thursday, saying her “unique experience” will ensure the movement’s advancement. Putin, in a message posted on the Kremlin website, said the outcome of the election “clearly testifies to your great authority in the sporting world”. “I am […]",
            "time": "21:46",
            "date": "21 Mar 2025"
        }
    ]
}