{
    "news": [
        {
            "title": "Unregistered kombis will not be allowed to operate – Police",
            "url": "https://www.chronicle.co.zw/unregistered-kombis-will-not-be-allowed-to-operate-police/",
            "content": "Harare Bureau\n\nTHE Zimbabwe Republic Police has called on all commuter omnibus operators to register their vehicles with the relevant authorities, reiterating that unregistered kombis will not be allowed to operate on the countrys roads.\n\nIn a statement, police spokesperson Commissioner Paul Nyathi said: The Zimbabwe Republic Police expresses appreciation to the public for the support and cooperation given towards the ongoing operation, No to mushika-shika and lawlessness on the roads.\n\nThe police reiterate that only duly registered kombis with all the relevant and verifiable documents will be allowed to carry passengers from one point to another.\n\nIn this regard, no unregistered or unlicensed kombi or pirate taxi will be allowed to conduct business as a public service vehicle.\n\nThe police urges all kombi owners to lead by example and ensure that anyone intending to operate a public service vehicle duly complies with the countrys road rules and regulations.\n\nCommissioner Nyathi implored the public to use designated places to board kombis.\n\nHe said they will take decisive action against police officers that are involved in corrupt activities on the roads.\n\nThe Zimbabwe Republic Police Command is taking decisive action on corrupt elements within the rank and file of the police, he said.\n\nThis includes some unregistered kombi operators who are now working in cahoots with unruly elements to perpetuate corrupt activities on the roads.\n\nThe Zimbabwe Republic Police is taking decisive action on unregistered kombis that are picking up passengers on the Chitungwiza-Harare Central Business District route and dropping them off before the Seke Bridge.\n\nThe Commissioner-General of Police, Stephen Mutamba, has directed police commanders to ensure that duly registered and compliant kombis are allowed passage at police checkpoints without being inconvenienced, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Paul-Nyathi-.jpg",
            "description": "Harare Bureau THE Zimbabwe Republic Police has called on all commuter omnibus operators to register their vehicles with the relevant authorities, reiterating that unregistered kombis will not be allowed to operate on the country’s roads. In a statement, police spokesperson Commissioner Paul Nyathi said: “The Zimbabwe Republic Police expresses appreciation to the public for the […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Meet rising voice in spoken word, Bradley Nsukuzokuduma Moyo",
            "url": "https://www.chronicle.co.zw/meet-rising-voice-in-spoken-word-bradley-nsukuzokuduma-moyo/",
            "content": "Lubelihle Mathe,[emailprotected]\n\nIn the world of spoken word, a new voice is making waves  meet Bradley Nsukuzokuduma Moyo. At just 21 years old, this talented and creative poet is leaving audiences captivated with his compelling verses and profound storytelling.\n\nBorn in September 2003 at Alexandra Clinic in South Africa, Moyo, the eldest of three siblings, relocated to Zimbabwe, where he was raised by his grandparents in Sizinda suburb in Bulawayo.\n\nHis creativity was nurtured early by his grandfather, a railway worker who introduced him to painting. Tragically, his grandfather passed away when he was still young. Reflecting on his childhood, Moyo shared, I grew up in Sizinda under the care of my grandparents, and my grandfather, a cultured man, taught me painting. His passing was a huge loss.\n\nBradley attended Intunta Primary School in Sizinda, where he was part of the school choir and discovered his love for music. He later moved to Ihlathi High School, where he joined the debate club and continued singing tenor whenever there were opportunities to form a choir. Raised in a Christian home, he actively participated in the Scripture Union Club and eventually became its president. Additionally, he captained the first aid team while excelling academically.\n\nGrowing up, I transitioned from being a naughty kid to a reserved and outspoken one, he said.\n\nThis newfound confidence allowed him to participate in workshops like those hosted by the Higher Life Foundation. These experiences broadened his perspective on the arts, especially as he struggled with science subjects like Chemistry and Physics.\n\nI used to love Biology, but numbers were not my strength, so I shifted to Arts, he explained.\n\nMoyo sought to explore other creative outlets beyond music, experimenting with unique art forms such as writing extracts, short stories, and poetry.\n\nMusic has always been a part of me, but because it was what everyone was doing, I wanted something different, he said.\n\nAfter completing his O-levels, Moyo pursued A-levels at Milton High School, where he discovered a passion for literature, particularly poetry. A turning point in his life came when he lost his best friend, a tragedy that inspired him to channel his grief into poetry. This led to the creation of his first book, Thalitha Koumi: The Prayers We Never Say.\n\nSince then, Moyo has remained steadfast in his poetry journey, achieving numerous milestones in 2024. He was nominated twice in the Third Edition of the Poetry Red Carpet Awards for Best Page Poet and Best Promising Poet. Additionally, he secured second runner-up in the Dreams Discovery Publishers Awards under the Best English Poetry category. These accolades motivated him to publish Thalitha Koumi, which is now available on the market.\n\nThe artist envisions a future where his work amplifies the voices of Africans, particularly the black majority, Ndebele people, and youth.\n\nI address a lot of issues. What I can say is I am a conscious writer passionate about telling the stories of Africans, blacks, Ndebele people, and young people, he explained.\n\nHe is now focused on creating more poetry and short stories that highlight these narratives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/hjbjnbjnjnj.jpg",
            "description": "Lubelihle Mathe, Lubelihlel79@gmail.com In the world of spoken word, a new voice is making waves – meet Bradley Nsukuzokuduma Moyo. At just 21 years old, this talented and creative poet is leaving audiences captivated with his compelling verses and profound storytelling. Born in September 2003 at Alexandra Clinic in South Africa, Moyo, the eldest of […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Eveline High School named Ciena Solutions Challenge Model School",
            "url": "https://www.chronicle.co.zw/eveline-high-school-named-ciena-solutions-challenge-model-school/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE Ministry of Primary and Secondary Education has announced that Eveline High School has been selected as a Ciena Solutions Challenge Model School, a recognition that comes with access to cutting-edge technology and professional development support from Ciena and Digital Promise.\n\nThe Ciena Solutions Challenge is a global initiative by Digital Promise and Ciena (NYSE: CIEN) that invites middle and high school students to design solutions addressing Sustainable Development Goals (SDGs) in their communities.\n\nAs a Model School, Eveline High will benefit from professional development, mentoring, and tools for digital fabrication, coding, robotics, and media production to foster creativity, innovation, and invention among students.\n\nEveline High Schools selection is a testimony to its commitment to student-centred learning. The all-female institution previously received the Ciena Solutions Challenge Sustainability Award in 2022 and 2023.\n\nAs part of the 2024-2026 cohort, Eveline High will join Mnarani Public Secondary School in Mwanza, Tanzania, and E.E. Dr Secundino Dominguez Filho in So Paulo, Brazil. These schools will collaborate with existing cohorts in Ottawa, Canada, and Atlanta, United States.\n\nExpressing excitement about the recognition, Eveline High School headmistress Mrs Sihle Ncube said, We are honoured and excited to be part of the Ciena Solutions Challenge Model School cohort. This opportunity will empower our students with cutting-edge tools and skills, enabling them to become creative problem-solvers and innovators.\n\nAt Eveline High School, we are committed to nurturing leaders who can address global challenges through local solutions, and this collaboration with Ciena and Digital Promise aligns perfectly with our vision for excellence and sustainability.\n\nThe director of ESG Communications and Social Impact at Ciena, Ms Elizabeth Hunter praised the enthusiasm shown by students and educators.\n\nWe are inspired by the unwavering enthusiasm students and educators have shown in making the Ciena Solutions Challenge part of their learning journey. Expanding our Model School program to include these three new schools will serve as a catalyst, fuelling the imagination of future innovators and empowering them to make a meaningful difference in their communities, she said.\n\nPresident and chief executive officer of Digital Promise, Jean-Claude Brizard, highlighted the significance of the initiative.\n\nAs a global organisation, we are thrilled to deepen our collaboration with the new cohort of model schools in Brazil, Tanzania, and Zimbabwe.\n\nThe educators at each of these schools have consistently demonstrated their commitment to cultivating student agency, creativity, and innovation. We are excited that the additional investment of technology and professional learning will further enable them to continue facilitating powerful learning experiences with students, said Brizard.\n\n@MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ghbhjbhb.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE Ministry of Primary and Secondary Education has announced that Eveline High School has been selected as a Ciena Solutions Challenge Model School, a recognition that comes with access to cutting-edge technology and professional development support from Ciena and Digital Promise. The Ciena Solutions Challenge is a global initiative by Digital Promise […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Four arrested, four still at large in Bulawayo armed robbery case",
            "url": "https://www.chronicle.co.zw/four-arrested-four-still-at-large-in-bulawayo-armed-robbery-case/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nPOLICE in Bulawayo have arrested four suspects in connection with the armed robbery of a betting house employee who lost about R160 000 and US$9 000.\n\nFour other suspects are still at large.\n\nThe arrested suspects are Nomzamo Nkiwane (42) and Alfred Taurai (43) of Nkulumane 5, Kelvin Tshuma (40) of Emganwini, and Vusumuzi Ndlovu (49) of Sibambene Village, Sezhube.\n\nOn January 14, an unnamed betting house employee was transporting cash from Bulawayo to Harare in a Honda Fit. The employee had collected R158 160 and US$9 339 from the betting house. While parked on Robert Mugabe Way in Parkview to package the money, a dark grey Mazda Axela with Botswana number plates blocked his exit.\n\nOne of the suspects, armed with a pistol and a brick, smashed the drivers door and demanded the cash. The robbers seized the satchel containing the money and fled in their Mazda Axela. A police report was filed shortly after.\n\nOn January 20, police received a tip-off linking Nomzamo Nkiwane to the robbery. Acting on the information, they arrested her in Nkulumane 5 suburb.\n\nDuring interrogation, Nomzamo revealed that her neighbour, Alfred Taurai, had informed her about the complainants routine cash collection from the betting house. Alfred, who previously worked as a security guard at the betting house, provided details about the complainants vehicle and schedule.\n\nNomzamo then shared the information with her cousin, Kelvin Tshuma, who, along with Vusumuzi Ndlovu, executed the robbery. Searches at the suspects residences led to the recovery of R2 000 in R200 notes from Nomzamos home.\n\nShe admitted to receiving R10 000 as her share, part of which she sent to South Africa, R1 600 in R200 notes and US$40 from Alfred Taurai, who also received R10 000, R200 and US$50 from Kelvin Tshuma, who led police to Esigodini, where Vusumuzi Ndlovu was arrested.\n\nAt Vusumuzis residence, police recovered R19 120, US$68, and a silver-grey Toyota Aqua used in the robbery. Vusumuzi admitted to receiving R20 000 as his share.\n\nBulawayo provincial police spokesperson Inspector Nomalanga Msebele confirmed that the total stolen amounted to R158 160 and US$9 339, while the recovered amounts are R22 920 and US$50.\n\nWe are appealing for information leading to the arrest of the remaining suspects who include Bekithemba Mthimkhulu of Lobengula West, Robert Moyo, also known as Fana, of Old Luveve, Delvin White, also known as Bhoza, of Selbourne Park and Mdlalosi whose full name is unknown\n\nAnyone with information is urged to contact Bulawayo CID Homicide at (02922) 77523 or 71568, or report to any police station, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/tsjkd.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com POLICE in Bulawayo have arrested four suspects in connection with the armed robbery of a betting house employee who lost about R160 000 and US$9 000. Four other suspects are still at large. The arrested suspects are Nomzamo Nkiwane (42) and Alfred Taurai (43) of Nkulumane 5, Kelvin Tshuma (40) of Emganwini, […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Mwaruwari challenges Warriors",
            "url": "https://www.chronicle.co.zw/mwaruwari-challenges-warriors/",
            "content": "Online Reporter\n\nFORMER Zimbabwe International, Benjamin Mwaruwari has challenged the Warriors to come of age and qualify for the knockout stage of the Afcon finals.\n\nMorocco will play host the event which will gather the top 24 countries in Africa.\n\nThe Warriors qualified for this Decembers finals after finishing second to Cameroon in Group J.\n\nIn an interview last night, Mwaruwari said the Warriors have to rise to it and beat Egypt, who are former champions.\n\nThe Warriors were drawn alongside Angola, Egypt and South Africa.\n\nIf we are to be counted among the best in Africa, we must fight to get to the later stages of such competitions.\n\nI challenge the boys to beat Egypt, who are the favourites. Once we beat them a draw and even outright wins, will see us through to the next round, then we would have arrived on to the big stage. Thereafter it becomes anybodys game, said the former Warriors skipper.\n\nMwaruwari was part of the Warriors team coached by Charles Mhlauri which was knocked out in the first round in Egypt in 2006.\n\nHe said there is 11 months to the finals, which is good time to prepare.\n\nWe have up to a year to prepare, the coaches can cast their netwide, see team involved in friendlies and other tournaments, then whittle down selection to good probables for Morocco, said Mwaruwari.\n\nThere is the Cosafa Cup and World Cup qualifiers for Warriors to gel in before Morocco in December.\n\nRecently elected Zifa president Nqobile Magwizi attended the draw.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/06/Untitled-50-9.jpg",
            "description": "Online Reporter FORMER Zimbabwe International, Benjamin Mwaruwari has challenged the Warriors to come of age and qualify for the knockout stage of the Afcon finals. Morocco will play host the event which will gather the top 24 countries in Africa. The Warriors qualified for this December’s finals after finishing second to Cameroon in Group J. […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Afdis optimistic as crackdown on smuggling intensifies",
            "url": "https://www.chronicle.co.zw/afdis-optimistic-as-crackdown-on-smuggling-intensifies/",
            "content": "Harare Bureau\n\nLISTED wine and spirits manufacturer, African Distillers Limited (Afdis), is optimistic that the ongoing crackdown on illicit and smuggled alcohol will curb unfair competition from the informal market.\n\nAfdis, a unit of Delta Corporation, has previously acknowledged the significant impact of illicit products, often non-compliant with regulations, and the rise of irregular imports from neighbouring countries on its sales volumes and overall operations.\n\nThe Government has intensified the crackdown on smuggled goods to enhance the competitiveness of local industries.\n\nBorder control agencies have been instructed to implement stricter measures to address the issue.\n\nThe Zimbabwe Revenue Authority (ZIMRA) has urged travellers and cross-border traders to strictly adhere to customs regulations to avoid facing penalties from law enforcement agencies.\n\nZIMRA emphasised that travellers must present valid proof of their customs declarations at designated roadblocks.\n\nFailure to declare goods, whether intentional or unintentional, can result in severe consequences, including substantial fines and the confiscation of goods.\n\nIt is hoped that the current blitz against illicit and smuggled alcohol will curtail unfair competition, said Delta Corporation company secretary Ms Faith Musinga in the third quarter trading update to December 2024.\n\nThe rapid escalation of illicit practices has inflicted considerable harm on legitimate businesses, leading to job losses and diminished tax revenues.\n\nZIMRA commissioner of customs and excise, Mr Batsirai Chadzingwa, emphasised the critical need to curb smuggling to foster a viable economy.\n\nIf you examine the clothing and shoe industries, youll observe their decline due to the rampant influx of smuggled goods. This issue demands immediate attention across all sectors, he said.\n\nAfdis indicated its commitment to implementing measures to defend its market share, enhance sales volumes, and sustain profitable growth.\n\nIn terms of performance during the reviewed period, Afdis achieved a 14 percent volume growth compared to the previous year for the quarter and a 12 percent growth year-to-date.\n\nThe Ready-to-Drink (RTD) and Wine segments, which recorded 12 percent and 47 percent growth respectively, benefited from improved product supply and a decline in informal imports.\n\nZimbabwe shares borders with several countries, including South Africa and Mozambique. Some of these borders are porous, making it easier for goods to be smuggled into the country.\n\nLast week, Finance, Economic Development and Investment Promotion Minister Pro Mthuli Ncube acknowledged the difficulties and said the ongoing crackdown on smuggling was partly aimed at addressing the challenges.\n\nHe said as part of efforts to bolster the viability of the formal retail sector, the Government had initiated a door-to-door crackdown to confiscate contraband goods entering the country and being sold within the informal retail industry.\n\nThe issue of retailers who are struggling . . . thats the reason why we have launched the blitz on smuggling  one of the things the retailers have told us about is that smuggling is hurting their businesses, said Minister Ncube.\n\nManufacturers are also feeling that this is hurting their businesses. So, we have had this blitz on smuggling to make sure that we slow down this illicit behaviour.\n\nWe are very happy to look into key areas or issues that are impacting the sector negatively and I will engage them to make sure we can unlock those challenges.\n\nThe operation is also targeting wholesalers, supermarkets and tech shops, with smuggled goods including a variety of food stuffs, clothing, drugs, beverages, fertilisers, cement,\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/Counterfeit-Alcohol-spirits-sold-on-the-streets-off-beat-Copy-2-Copy-680x380.jpg",
            "description": "Harare Bureau  LISTED wine and spirits manufacturer, African Distillers Limited (Afdis), is optimistic that the ongoing crackdown on illicit and smuggled alcohol will curb unfair competition from the informal market. Afdis, a unit of Delta Corporation, has previously acknowledged the significant impact of illicit products, often non-compliant with regulations, and the rise of irregular imports […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Gweru family loses valuables and car in armed robbery",
            "url": "https://www.chronicle.co.zw/gweru-family-loses-valuables-and-car-in-armed-robbery/",
            "content": "Patrick Chitumba,[emailprotected]\n\nA GWERU family in Harben Park suburb suffered a traumatic ordeal on Sunday when a gang of six armed men invaded their home, robbing them of valuables and a vehicle worth about US$12 000.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the robbery and said investigations are underway.\n\nThe incident occurred in the early hours of Sunday at around midnight. Mary Chakamanga (60) and her 24-year-old son were asleep in separate bedrooms when the gang attempted to break through the door but failed.\n\nThe suspects then broke a windowpane and demanded cash. Ms Chakamanga handed over US$500 and called for help, said Insp Mahoko.\n\nAfter managing to gain entry, the gang ransacked the house, taking US$200 from Ms Chakamangas handbag, four cell phones, an iPad, a Huawei tablet, an HP laptop, and groceries.\n\nThe suspects reportedly assaulted Ms Chakamanga with an iron rod, demanding more money. They then demanded the keys to a silver Toyota Rav 4, registration number ADG 9795, which was parked outside.\n\nThe gang loaded the stolen items into the vehicle and drove away. The vehicle was later discovered abandoned along a dust road near Go Beer farm in Northlea, Gweru. However, the cars battery was missing.\n\nTotal value of the stolen items is US$11 980. We are appealing to anyone with information that can assist in the investigation to visit any police station, said Insp Mahoko.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/armed-robbers-used-gun-robbery-600nw-1495712093-600x380.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw A GWERU family in Harben Park suburb suffered a traumatic ordeal on Sunday when a gang of six armed men invaded their home, robbing them of valuables and a vehicle worth about US$12 000. Midlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the robbery and said investigations are underway. The incident occurred […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "India-Zimbabwe relations strengthen with focus on economic, technological growth",
            "url": "https://www.chronicle.co.zw/india-zimbabwe-relations-strengthen-with-focus-on-economic-technological-growth/",
            "content": "Harare Bureau\n\nINDIA and Zimbabwe on Monday celebrated 45 years of diplomatic relations, marking a period of growing cooperation, especially in trade, investment, and technology.\n\nThe partnership, which dates back to the era of the Munhumutapa Kingdom, is now thriving in the modern era with both nations focused on mutual economic development.\n\nSpeaking at the India National Day celebration in Harare, Indian Ambassador to Zimbabwe, Mr Bramha Kumar said the bilateral ties between the two countries are strong.\n\nIndias connection with Zimbabwe dates back to the 17th Century when Indian merchants traded with the Munhumutapa Empire. Today, we continue to build on this rich history as we work towards a prosperous future.\n\nHe also said India played a role in Zimbabwes liberation struggle.\n\nIndia was proud to support Zimbabwes journey to independence, and our relationship has only grown stronger since then.\n\nThe relationship is now firmly rooted in economic collaboration, with Indian investments in Zimbabwe reaching US$600 million.\n\nThese investments are creating thousands of jobs and contributing significantly to Zimbabwes economy. We are confident that Indian businesses will continue to play a vital role in restructuring Zimbabwes economy, Ambassador Kumar said.\n\nForeign Affairs and International Trade Deputy Minister Sheilla Chikomo praised the ties between the two countries.\n\nOur bilateral relations are stronger than ever, with India being a key partner in our development. The Indo-Zim Technological Centres are crucial in helping Zimbabwe build a knowledge-based economy, she said.\n\nDeputy Minister Chikomo also said educational exchange programmes played a key role in strengthening the relations between Zimbabwe and India.\n\nThe Indian Technical and Economic Cooperation (ITEC) programme is helping us equip our people with the skills needed to thrive in a globalised world.\n\nAs both nations strengthen their ties, the future of India-Zimbabwe relations look promising.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/GiYV0dUWsAA3jQD-680x380.jpg",
            "description": "Harare Bureau INDIA and Zimbabwe on Monday celebrated 45 years of diplomatic relations, marking a period of growing cooperation, especially in trade, investment, and technology. The partnership, which dates back to the era of the Munhumutapa Kingdom, is now thriving in the modern era with both nations focused on mutual economic development. Speaking at the […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Bodies on streets, hospitals struggle, battles intensify in DR Congo’s Goma",
            "url": "https://www.chronicle.co.zw/bodies-on-streets-hospitals-struggle-battles-intensify-in-dr-congos-goma/",
            "content": "The M23 rebel group has declared the key city of Goma under its control, signalling a big blow to the Congolese army.\n\nM23 rebels claim seizing key DR Congo city of Goma\n\nHeavy battlesbetween M23 fighters and Congolese government forces in the eastern Democratic Republic of the Congo (DRC) city of Goma have left many bodies on the streets, with hospitals struggling to deal with the growing number of casualties.\n\nOn Monday, the rebels, which the United Nations says are backed by Rwanda, marched into Goma and declared the key city under their control, signalling a big blow to the Congolese army and a serious escalation in the years-long conflict that has killed hundreds and displaced millions in the region.\n\nDRCs Rural Development Minister Muhindo Nzangi said the Congolese army controlled 80 percent of Goma, with Rwandan troops either on the citys outskirts or back across the border.\n\nAt a news briefing on Tuesday, the UN and other aid agencies warned that hospitals are overwhelmed in Goma, treating hundreds of patients with gunshot, mortar and shrapnel wounds while many bodies lie in the streets.\n\nThere are currently hundreds of people in hospital, most admitted with gunshot wounds, said Adelheid Marschang, WHOs emergency response coordinator for the DRC.\n\nAt least 17 people were killed in Goma on Monday, and the AFP news agency reported quoting hospital sources that doctors in the city were treating 367 people wounded in the clashes. Civil society members and NGOs working in Goma put the death toll at 25, with 375 people wounded.\n\nGreg Ramm, country director for Save the Children in DRC, said on Tuesday that while we have reports that neighbourhoods are calm, a few minutes later, we hear reports of new shelling.\n\nHeavy small arms fire and mortar fire continued in the streets, where many dead bodies could be seen, Jens Laerke, spokesperson for the UN humanitarian office, also said at a press briefing, citing reports from UN staff in the city.\n\nMeanwhile, the World Food Programme said food assistance activities in and around Goma have been temporarily paused and expressed concern over food shortages.\n\nAlso on Tuesday, South Africa confirmed three of its soldiers haddiedin the fighting on Monday after getting caught in the crossfire. It added that another soldier killed in the recent fighting had also died on Monday, bringing the number of deaths in the past week to 13.\n\nThe fighting has sent thousands of people streaming out of Goma, which has been a key regional hub for humanitarian aid for displaced people. Hundreds of thousands have fled fighting since the start of the year on top of three million displaced in the eastern DRC last year.\n\nThe city is in real difficulty and if it hasnt fallen overnight, it will in the coming days, French Foreign Minister Jean-Noel Barrot told Sud Radio. Rwanda must put down its weapons, calm must return and dialogue needs to restart.\n\nOne Goma resident told the Reuters news agency that he had seen men in Rwandan army uniforms on Monday.\n\nIn the evening, I went out to see what the situation was. I saw soldiers dressed in brand new Rwandan uniforms, the resident of central Goma said.\n\nFire exchanges also took place between Congolese and Rwandan troops on either side of a border crossing near Goma. Five civilians were killed and 25 seriously wounded on the outskirts of Rwandan border town Gisenyi, Rwandas military told AFP on Monday.\n\nM23, or the March 23 Movement, is one of hundreds of armed groups operating in the eastern DRC and seeking to control critical mineral mines.\n\nThe group iscomposedof Tutsi fightersand claims it is fighting for the rights of the DRCs minority Tutsi population. It emerged in 2012 after a group from the armed forces of the DRC (FARDC) broke away, complaining of ill-treatment.\n\nIn 2012, M23 first seized Goma, but the Congolese army, supported by the UN forces, pushed the rebels back into the eastern hills on the border with Rwanda in 2013.\n\nThe DRC government and the UN accuse Rwanda, under President Paul Kagame, of supporting M23 with soldiers and weapons in a bid to control the mineral-rich eastern DRC.\n\nTheres no question that there are Rwandan troops in Goma supporting the M23, UN peacekeeping forces chief Jean-Pierre Lacroix told reporters at a livestreamed event. Its difficult to tell exactly what the numbers are.\n\nRwanda has denied the charge and accused the DRC of harbouring members of the Democratic Forces for the Liberation of Rwanda, an anti-Kagame rebel group that was involved in the 1994 Rwandan genocide.\n\nAs the fighting escalates, the African Unions Peace and Security Council will hold a meeting later on Tuesday to discuss the crisis.\n\nThe UN Security Council will also meet on Tuesday to discuss the crisis.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/AP25028326680925-1738062134-1-680x380.png",
            "description": "The M23 rebel group has declared the key city of Goma under its control, signalling a big blow to the Congolese army. M23 rebels claim seizing key DR Congo city of Goma Heavy battles between M23 fighters and Congolese government forces in the eastern Democratic Republic of the Congo (DRC) city of Goma have left many […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        },
        {
            "title": "Nees reacts to Afcon draw",
            "url": "https://www.chronicle.co.zw/nees-reacts-to-afcon-draw/",
            "content": "Innocent Kurira,[emailprotected]\n\nWARRIORS coach Michael Nees has described Zimbabwes group for the 2025 Africa Cup of Nations (AFCON) as balanced and competitive.\n\nIn a draw conducted in Rabat in the host country, Morocco on Monday, the Warriors were thrust into a group that has South Africa, Angola and Egypt.\n\nWere in a group with three teams from COSAFA. Theres no secret here these teams know each other very well. Were facing a derby against our rivals, Bafana Bafana, and a match against a skillful Angola side with a different playing style. Then theres Egypt, the record AFCON champions and one of the tournament favourites, who will surely bring their best team to Morocco, said Nees.\n\nThe tournament will take place in Morocco from December 21, 2025, to January 18, 2026.\n\n-@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Warriors-head-coach-Michael-Nees.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw WARRIORS coach Michael Nees has described Zimbabwe’s group for the 2025 Africa Cup of Nations (AFCON) as balanced and competitive. In a draw conducted in Rabat in the host country, Morocco on Monday, the Warriors were thrust into a group that has South Africa, Angola and Egypt. “We’re in a group with […]",
            "time": "18:08",
            "date": "28 Jan 2025"
        }
    ]
}