{
    "news": [
        {
            "title": "Man assaults wife, smashes TV with brick in television-channel change war",
            "url": "https://www.chronicle.co.zw/man-assaults-wife-smashes-tv-with-brick-in-television-channel-change-war/",
            "content": "Diana Moyo [emailprotected]\n\nA 34-YEAR-OLD man from Gweru beat up his 35-year-old wife and damaged a television set and a DSTV decoder after an argument over the changing of television channels.The man, who was not named, stood before the Gweru Magistrates Court facing charges of malicious damage to property and physical abuse.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ), on X, said: On the 11th of December 2024, the offender, assaulted his wife (35) following an argument over the changing of television channels The man became violent, damaging a 43 inch Samsung television with a brick and smashing a DSTV decoder against the wall. He also physically assaulted his wife, slapping her on the face several times, hitting her on the upper body with fists, and kicking her with booted feet all over the body.The woman reported the incident to the police leading to his arrest.\n\nThe value damaged is US$295 and nothing was recovered.He was sentenced to 10mon10 monthsail and had three months suspended for five years and, an additional two months were suspended on condition that he replace the property he damaged.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/assault-680x365.jpg",
            "description": "Diana Moyo – moyodiana@gmail.com A 34-YEAR-OLD man from Gweru beat up his 35-year-old wife and damaged a television set and a DSTV decoder after an argument over the changing of television channels. The man, who was not named, stood before the Gweru Magistrates’ Court facing charges of malicious damage to property and physical abuse. The […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Rapist caught pants down with used condom on",
            "url": "https://www.chronicle.co.zw/rapist-caught-pants-down-with-used-condom-on/",
            "content": "Diana Baloyi Moyo [emailprotected]\n\nDRAMA unfolded in Chipinge at Dambamuromo Village when a drunk 27-year-old man raped a 46-year-old mentally challenged woman and fell asleep next to her with a used condom on.The accused broke into the home of the victim and raped her first without protection and later on, used a condom.According to the National Prosecuting Authority of Zimbabwe NPAZ) on X, the incident occurred on 26 October 2024, at around 9pm, in Dambamuromo Village, Chipinge.The complainant had retired to bed in her home.The offender, who was intoxicated, entered the complainants unlocked bedroom and approached the complainant who was asleep and forcibly undressed her before proceeding to rape her without protection. Subsequently, he wore a condom and continued to rape her. He then fell asleep after the act, The complainant alerted her nephew, who informed another family member.At around 1:20 am, they apprehended the offender, who was still asleep in the complainants bedroom and wearing a used condom.The offender was then taken to Z.R.P Chibuwe post along with the complainant. said the NPAZ.He was sentenced to 16 years in jail.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/05/gavel-rape-640x380.jpg",
            "description": "Diana Baloyi Moyo – moyodiana@gmail.com DRAMA unfolded in Chipinge at Dambamuromo Village when a drunk 27-year-old man raped a 46-year-old mentally challenged woman and fell asleep next to her with a used condom on. The accused broke into the home of the victim and raped her first without protection and later on, used a condom. […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Historic milestone for Land Reform: Beneficiaries get title deeds",
            "url": "https://www.chronicle.co.zw/historic-milestone-for-land-reform-beneficiaries-get-title-deeds/",
            "content": "Zvamaida Murwira in KWEKWE\n\nPRESIDENT Mnangagwa yesterday delivered the historic first batch of title deeds to beneficiaries under the Land Tenure Implementation Programme as the Second Republic bolsters land ownership that will put an end to the issue of tenure and security.\n\nPresident Mnangagwa\n\nThe tenure system will revolutionalise the Land Reform Programme embarked upon by the Government from the year 2000, and ensure bankability and transferability of title.\n\nPresident Mnangagwa launched the Land Tenure Implementation programme at Pricabe Farm in Kwekwe, a property owned by the First Family.\n\nIt was a colourful ceremony attended by Cabinet Ministers, Permanent Secretaries, service chiefs, traditional leaders, farmers and captains of industry, among others.\n\nIn his keynote address, President Mnangagwa described the event as a significant milestone in the countrys ongoing journey towards the attainment of Vision 2030.\n\nIt is with a great sense of pride and joy that we gather here on this historic day to highlight another accomplishment of the Second Republic, he said.\n\nI welcome you all to Pricabe Farm. My Government is charting a new transformative and inclusive development agenda encapsulated in our National Development Strategy 1 (NDS1).\n\nThis is consistent with the collective aspirations and determination of the people of our great nation to become an empowered and prosperous upper middle-income society by 2030.\n\nPresident Mnangagwa said it is through such relentless pursuits that Government is determined to deliver broad-based transformation, wealth creation and provision of economic opportunities for all Zimbabweans, leaving no one and no place behind.\n\nThe land in our great motherland is an indispensable economic enabler to the attainment of our vision, more so that agriculture is at the epicentre of our national transformative agenda, he said.\n\nPresident Mnangagwa said the land holds deep historical significance as its ownership can be traced back to the First Chimurenga, adding that the countrys forebears fought tirelessly for the right to keep the land.\n\nThe Second Chimurenga reclaimed this land in 1980 when we won our Independence. The Land Reform Programme, undertaken in 2000, remains a cornerstone of our national identity and an essential pillar for our economic independence.\n\nWe fought the liberation war to get back our land, ivhu rave nevene varo, vene vevhu vave nevhu ravo.\n\nThe land is irreversibly with its people, and the people irreversibly with their land. The Land Reform Programme is, therefore, irreversible, he said. President Mnangagwa added that the national Constitution recognises the importance of land in agricultural productivity.\n\nOur Constitution binds us to strengthen the Land Tenure System of 99-year Leases and A1/A2 permits. The Constitution, in sections 289, 293 and 295, gives rights to every Zimbabwean citizen to acquire, hold, occupy, use, transfer or dispose of agricultural land.\n\nLand tenure security is critically important to Zimbabwes economic growth and development.\n\nIt encourages investment, improves agricultural production and productivity, and lifts many out of poverty into prosperity, he said.\n\nWith secure land tenure, the President said, farmers can access credit facilities, buy inputs and hire labour, ultimately increasing their yields and incomes.\n\nAs such, the importance of more secure, bankable and transferable land tenure cannot be overstated. Such a tenure document is the ultimate empowerment tool for our farmers, especially war veterans and their children.\n\nThe title deed, which my Government has developed for issuance to farmers, will preserve security and spur investment for accelerated livelihoods upliftment and economic development, said President Mnangagwa.\n\nMy administration has, therefore, made a bold decision to empower the beneficiaries of the Land Reform Programme by giving them tenure that will unlock the value of our land, allowing it to be used as collateral.\n\nWar veterans, whose sacrifices won the countrys independence and the land, must not be left behind, added the President. Youths, women and people with disabilities should also be considered for the title deeds.\n\nPresident Mnangagwa said the need to safeguard the land and preserve the liberation struggle gains is paramount. In this regard, land transfers shall be among qualifying Zimbabweans, he said.\n\nThe President implored financial institutions to embrace the title deeds in order to improve farmers access to finance and capital, which is critical for production.Let me reiterate my Governments commitment to ensuring that land distribution is fair, transparent, and beneficial to all Zimbabweans.\n\nThe handover of these title deeds is a testament to our commitment to empower Zimbabweans  the estimated 23 500 A2 farmers and estimated 360 000 A1 farmers, he said.\n\nFarmers were reminded that the land must be used judiciously and responsibly.\n\nAs you are aware, the land vests in the President on behalf of the State. The State is, therefore, transferring the land to each holder of a valid land tenure document.This new tenure system will be the ultimate anchor of our Land Reform Programme. To the recipients of this new tenure document, I challenge you to use this to defend the revolution, unlock investment and increase production, productivity, profitability, viability, and sustainability to accelerate agricultural transformation.\n\nThe President commended the Land Tenure Technical Committee chaired by businessman, Mr Kudakwashe Tagwirei, for its excellent and meticulous contribution to the success of the initiative.\n\nYour dedication is deeply appreciated. Your selfless contribution is a true testimony to the mantra, Nyika inovakwa, inotongwa, inonamatigwa, nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe, ngabaninilo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/GFBHGGH-680x380.jpg",
            "description": "Zvamaida Murwira in KWEKWE PRESIDENT Mnangagwa yesterday delivered the historic first batch of title deeds to beneficiaries under the Land Tenure Implementation Programme as the Second Republic bolsters land ownership that will put an end to the issue of tenure and security. The tenure system will revolutionalise the Land Reform Programme embarked upon by the […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Buried alive: Harrowing tales from Umzingwane Mine collapse survivors",
            "url": "https://www.chronicle.co.zw/buried-alive-harrowing-tales-from-umzingwane-mine-collapse-survivors/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nDEEP in a slumber, Previous Tshuma was jolted awake by the ominous sound of rushing water. Trapped in an eight-metre-deep pit along the Lunga River in Crocodile Valley village, Umzingwane District, he realised the dire situation.\n\nThe floodwaters were rising rapidly, threatening to swallow him. With no possessions to salvage, he focused on the urgent task of escaping the deadly trap. Tshuma is an illegal gold miner who specialises in riverbed mining.\n\nThe nature of his job means that he and his fellow miners must dig deep pits along Lunga River in search of gold.\n\nThe collapsed river bank that buried the miners\n\nIts not unusual for the group of miners to sleep in the pits, especially in soaring summer temperatures, as they prefer dozing in the belly of the earth where its cooler. Sleeping in the pits is also a way of securing ones investment, as the riverbed gold mining game dictates that each man must jealously guard his investment  the pit.\n\nOn that fateful night last Sunday, a freak of nature would alter the lives of the illegal gold miners forever. It had not rained in this area although there were signs that rainfall could be expected anytime, and almost all of us were sleeping in our pits.\n\nAround 1am, I was woken up by the sound of flowing water and suddenly my pit was half full. I had to climb out as fast as I could and run to safety, he told Saturday Chronicle.\n\nIn the pitch-black darkness, he saw light from a torch and heard screams coming from the next pit. It hit him that his two friends who were sleeping there were in trouble.\n\nOne of them, Mthandazo, who was waving a torch while trying to swim out of the pit, managed to get out, but at that moment I didnt realise that Shelton (Ndlovu) had not made it to safety.\n\nIt turns out Shelton, a 20-year-old illegal miner, had been buried alive in the same pit that was supposed to be his source of livelihood.\n\nHis body is still buried in the pit. To make matters worse, the ground around the pit collapsed due to the recent rains that followed days later, further burying the body under wet rubble.\n\nWhere did the water that filled the pits suddenly come from? According to the illegal gold miners, numbering about eight, who are still hopeful that their late comrades body will be retrieved for burial in Mberengwa, flash floods hit the area upstream from where they were sleeping, resulting in Lunga River bursting its banks downstream in the dead of night.\n\nLungu river where the illegal miners were working\n\nIts been five days since Shelton was buried alive, and his mother and grandmother, together with other amakorokoza, have been camped at the site of the horror accident, waiting for the arrival of heavy equipment to try and retrieve the body from the muddy rubble.\n\nHe was only 20 years old and was the family breadwinner since he left school in Form Three to start digging for gold. My husband passed away more than 10 years ago, and my son had been trying to support me and his younger siblings, said his mother, Silibaziso Ndlovu.\n\nShe said she used to take the work that her son was involved in for granted until the day she came face to face with the conditions that illegal gold miners live in to get the precious metal.\n\nSometimes we take for granted the things that our children go through just to make sure we have food and soap to wash our clothes. The possibility of her sons body being permanently buried along Lunga River is something that she does not want to entertain.\n\nI want to take my son home for burial in Mberengwa, she said in between sobs.\n\nUmzingwane District Development Coordinator (DDC), Peter Mahlathini, said they have engaged the services of established miners to pull together resources and try and retrieve the body from its temporary grave.\n\nWe have secured the services of an excavator and a low-bed truck to carry it here, but we have a challenge with roads that are inaccessible. The 260 litres of diesel that is needed for the truck and excavator has been sourced, and we hope to start efforts to retrieve the body as soon as possible, said Mahlathini.\n\nOther well-wishers have chipped in with food for the family and other miners as they wait for the body to be retrieved. The ground is still wet because of the torrential rains that pounded Umzingwane District, a situation that might make the rescue efforts more difficult.\n\nMatabeleland South Provincial Affairs and Devolution Minister, Dr Evelyne Ndlovu, expressed concern at the level of destruction and loss of life due to riverbed mining; a practice that was outlawed by the Government some years ago. She was part of a team that travelled to the site of the freak accident which claimed the life of the young miner.\n\nIn August, the Government renewed its ban on alluvial and riverbed mining to curb environmental degradation. The Government first announced the ban in 2020, but the practice has continued unabated over the years as large-scale and mechanical alluvial mining or riverbed mining has resulted in water pollution, siltation, degradation of river channels, and disruption of riverine ecosystems.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/HJTYUJTYUY7.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com DEEP in a slumber, Previous Tshuma was jolted awake by the ominous sound of rushing water. Trapped in an eight-metre-deep pit along the Lunga River in Crocodile Valley village, Umzingwane District, he realised the dire situation. The floodwaters were rising rapidly, threatening to swallow him. With no possessions to salvage, he focused […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Pub Choir calls it a year with final show at ZITF",
            "url": "https://www.chronicle.co.zw/pub-choir-calls-it-a-year-with-final-show-at-zitf/",
            "content": "Saturday Leisure Writer\n\nAFTER the smashing success of the Old School theme earlier this year in Bulawayo, Pub Choir ZW is set to end 2024 with a bang. Today, theyre taking us back in time once more with another vintage extravaganza.\n\nThe biggest surprise theyre hoping for is to see all their Bulawayo fans decked out in their best vintage outfits. So, dust off those retro threads and get ready to impress!\n\nZITF Hall 2 has become our home and so we will be having the show there once again. We expect to see everyone in vintage attire. Bulawayo loves to dress up, and with everyone eager to flaunt their Old School outfits, its bound to be a night to remember.\n\nThis years grand finale is aptly named The Final Jam. Its the perfect way to wrap up an incredible series of Pub Choir shows for 2024. Its going to be an epic night. Doors will open at 6 PM.\n\nThe show starts at 7 PM and ends at 11 PM. Club Harmonix, The Pub Choir after party begins at 11pm and ends at midnight, said Simbai Zey Nicholas, one of the directors of Pub Choir ZW.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/1-3.jpg",
            "description": "Saturday Leisure Writer AFTER the smashing success of the Old School theme earlier this year in Bulawayo, Pub Choir ZW is set to end 2024 with a bang. Today, they’re taking us back in time once more with another vintage extravaganza. The biggest surprise they’re hoping for is to see all their Bulawayo fans decked […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "COMMENT: Let’s ensure road safety during festive season",
            "url": "https://www.chronicle.co.zw/comment-lets-ensure-road-safety-during-festive-season/",
            "content": "Many companies closed for Christmas and New Year holidays yesterday and as such many people are this weekend travelling to different destinations to enjoy the festivities with their families.\n\nZimbabwe is celebrating Unity Day tomorrow and as such Monday is a public holiday. We want to take this opportunity to urge bus drivers and other motorists to exercise extreme caution on our roads to avoid accidents.\n\nThe country has over the years recorded increased road traffic accidents during such public holidays caused mainly by recklessness bus drivers.\n\nDuring such public holidays, we have witnessed real bus racing on the highways as bus drivers try to outdo each other thereby putting the lives of passengers and other road users at risk. There is therefore an urgent need to tame this traffic jungle which is to blame for the carnage on our roads.\n\nThis total disregard for the safety of the travelling public must be stopped forthwith.\n\nGovernment has in the past threatened to withdraw operating licences of buses found flouting traffic rules and regulations but it seems the threat has not been deterrent enough hence the racing continues.\n\nThere is therefore a need for the police to rigorously enforce traffic rules and regulations starting today in order to reduce accidents. Public transport operators should also contribute to taming this traffic jungle by ensuring reckless drivers are disciplined.\n\nIt is now very easy to monitor how drivers conduct themselves on the road because of technology. The passengers on their part must assist the police by reporting reckless drivers at the next roadblock or police station.\n\nOn Wednesday Government and other stakeholders launched the 2024 festive season road safety awareness campaign whose theme is Normal speed meets every need.\n\nThe theme emphasises the importance of adhering to safe driving speeds.\n\nSpeaking at the launch, Transport and Infrastructural Development Minister, Felix Mhona, urged bus drivers and other motorists to observe traffic rules and regulations in order to avoid accidents.\n\nIt has been established that more than 80 percent of road traffic accidents are as a result of human error which means they can be avoided.\n\nThere is therefore, a need to weed out reckless bus drivers that have turned our roads into motor racing tracks.\n\nGovernment has said it is now mandatory for operators of public service vehicles to install speed limiting and monitoring devices but it seems most buses do not have these devices hence this recklessness and speeding.\n\nThere might be a need to strictly enforce the issue of bus timetables as was the case in the past so that buses do not race for passengers. Bus drivers should respect the fact that they are entrusted with the safety of not only their passengers but other road users as well.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/GFVDDFD.jpg",
            "description": "Many companies closed for Christmas and New Year holidays yesterday and as such many people are this weekend travelling to different destinations to enjoy the festivities with their families. Zimbabwe is celebrating Unity Day tomorrow and as such Monday is a public holiday. We want to take this opportunity to urge bus drivers and other […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Stakeholders hail title deeds as game-changer",
            "url": "https://www.chronicle.co.zw/stakeholders-hail-title-deeds-as-game-changer/",
            "content": "Zvamaida Murwira in KWEKWE\n\nBENEFICIARIES, businessmen and other stakeholders have hailed the issuance of title deeds on farms under the Land Tenure Implementation Programme launched by President Mnangagwa yesterday, saying it is the panacea to unlocking value, profitability and ultimately productivity on properties under the land redistribution programme.\n\nTen beneficiaries were handed the title deeds in a historic development that will subsequently see thousands of other farmers getting the security of tenure in the next few months.\n\nThe development is expected to bolster viability and predictability of the Government-initiated Land Reform Programme. Different people who spoke at the event said security of tenure was a panacea to agricultural productivity.\n\nDefence Minister Oppah Muchinguri-Kashiri, who is also the Cabinet Oversight Committee chairperson of the programme, said the tenure system was an indication of President Mnangagwas astute leadership.\n\nThe transfer of these deeds illustrates your unwavering commitment to empower communities and ensure that Zimbabweans have access to land, which is a vital resource to prosperity.\n\nWe thank you for your vision of restoring our dignity 44 years after our independence, said Minister Muchinguri-Kashiri.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, said the landmark development will be felt not only in Zimbabwe but also in the region.\n\nToday is a great day not only for Zimbabwe but for Sadc. It marks a landmark development to unlock value to the Land Reform Programme, said Dr Masuka.Land Tenure Implementation Committee chairperson and businessman, Mr Kuda Tagwirei, said the land tenure system unveiled by the Government is unique.\n\nYour Excellency, I am a businessman. From history and my study, I have never seen a better empowering programme like this in the whole world, said Mr Tagwirei.\n\nHe said his committee will facilitate the issuance of 2 000 title deeds in the next three months and more than 24 000 title deeds for both A1 and A2 in the next 18 months.\n\nWe believe that all these farmers will be able to access loans from banks, said Mr Tagwirei.\n\nThose who got the title deeds yesterday include President Mnangagwa, who was awarded for leading the agricultural revolution by example at Pricabe Farm.\n\nOthers are Mr Lester Chizunza from Manicaland province, Public Service Commission chairperson, Dr Vincent Hungwe, former Cabinet Minister Dr Herbert Murerwa, Chief Vengai Rushwaya from Gutu in Masvingo province, Deputy Speaker of the National Assembly, Cde Tsitsi Gezi from Mashonaland Central province and Mr Egypt and Miriam Kakono from Mazowe district in Mashonaland Central province.\n\nOthers include Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira, Mrs Mangamela Sibanda from Matabeleland North province and Ntambeleni Ndou from Beitbridge district in Matabeleland South Province.\n\nIn an interview, Mr Chizunza described the issuance of title deeds as crucial to his farming operations.\n\nI want to thank President Mnangagwa for taking a bold decision because the issue of transferability and bankability has been a huge impediment.\n\nThose who lent money never looked at the productivity of a farmer but at security; they were worried about what would become of their money should one be removed from the property, said Mr Chizunza.\n\nDr Murerwa said the issuance of title deeds is a huge step in the right direction.\n\nWhen you have title you are able to invest knowing fully well that you have security of tenure and you also have access to capital.\n\nThis will unlock a lot of poductivity on the farms, said Dr Murerwa.\n\nYesterdays event was attended by Cabinet Ministers, Permanent Secretaries, Service Chiefs, traditional leaders, captains of industry and farmers among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/HE-on-land-tenure-11.jpg",
            "description": "Zvamaida Murwira in KWEKWE BENEFICIARIES, businessmen and other stakeholders have hailed the issuance of title deeds on farms under the Land Tenure Implementation Programme launched by President Mnangagwa yesterday, saying it is the panacea to unlocking value, profitability and ultimately productivity on properties under the land redistribution programme. Ten beneficiaries were handed the title deeds […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Bulawayo to host historic Boxing Day and New Year’s Tests",
            "url": "https://www.chronicle.co.zw/bulawayo-to-host-historic-boxing-day-and-new-years-tests/",
            "content": "Brandon Moyo,[emailprotected]\n\nA moment of pride awaits Bulawayo as Queens Sports Club prepares to host a historic two-match Test series between Zimbabwe and Afghanistan, starting on Boxing Day, Thursday.\n\nThe two Tests are part of a full tour of Zimbabwe by Afghanistan, with their white-ball matches concluding today with the third and final One Day International (ODI) at Harare Sports Club.\n\nThe visitors lead the three-match ODI series 1-0 after the first game was abandoned due to persistent rain. They then went on to register their biggest win in the format (in terms of runs), securing a massive 232-run victory in the second encounter on Thursday.\n\nExcitement has already begun to build among the Bulawayo cricket faithful ahead of the historic Boxing Day and New Years Day Tests.\n\nWhat makes these two games special is that they will mark Zimbabwes first Boxing Day Test at home in 28 years and the countrys first-ever New Years Test, all hosted at the City of Kings and Queens ceremonial home of cricket.\n\nThe Boxing Day Test will run from 26 to 30 December, while the New Years Test is scheduled for 2 to 7 January. To date, the country has hosted only one Boxing Day Test, when Zimbabwe faced England in 1996 in a drawn match severely affected by rain at Harare Sports Club.\n\nSince then, Zimbabwes only other Boxing Day Tests have been played away from home  against New Zealand in Wellington in 2000 and against South Africa in the inaugural pink-ball, day-night, four-day Test in Port Elizabeth in 2017.\n\nZimbabwe also played Sri Lanka in a Test that started on December 27, 2001 in Colombo. Zimbabwe has never played a New Years Test, either at home or abroad.\n\nGiven the significance of these events, Victor Mhlanga, the Tuskers general manager, said it is all systems go at Queens Sports Club as they prepare to make history. Mhlanga expressed his gratitude to Zimbabwe Cricket (ZC) for granting them the opportunity to be part of this historic series.\n\nQueens Sports Club\n\nThese are important fixtures. Anywhere in the world, Boxing Day and New Years Tests are iconic, and we are looking forward to hosting them here in Bulawayo at Queens Sports Club. Everything is in place, all is going well, and the ground staff have been working hard to ensure the pitch is in pristine condition. We are proud to have been given this opportunity to host these games. It feels good to be hosting something as significant as this. We thank Zimbabwe Cricket for the opportunity, said Mhlanga.\n\nHe also urged all cricket fans in and around Bulawayo to attend the match in large numbers.\n\nWith that, we call on everyone in Bulawayo to come in their numbers, support the national team, and cherish the moment, he said.\n\nThe Boxing Day match will be free of charge to all spectators, so the call is for all cricket and sport-loving people to make their way to Queens Sports Club. Earlier, ZC chairperson Tavengwa Mukuhlani expressed that it is a proud moment for Zimbabwe to be hosting the two iconic Tests.\n\nBoxing Day and New Years Test matches are iconic fixtures that we are delighted to add to our calendar this festive season. We are looking forward to celebrating in style one of the finest traditions in the sports long history, said Mukuhlani.\n\nIn the spirit of giving and spreading festive joy, a call has been made for fans to bring unused toys and clothes to donate to underprivileged children.\n\nBoth ZC and the Afghanistan Cricket Board (ACB) have named their squads for the historic series. ZC announced their squad on Thursday, which includes seven uncapped players, including Ben Curran.\n\nApart from Curran, the other uncapped players selected for the series are batter Johnathan Campbell, wicketkeeper-batters Tadiwanashe Marumani and Nyasha Mayavo, as well as pace bowlers Trevor Gwandu, Takudzwa Chataira, and Newman Nyamhuri.\n\nCraig Ervine will captain the Zimbabwe side, with the experienced Sean Williams, Sikandar Raza, Blessing Muzarabani, and Richard Ngarava providing a strong core to the squad. Meanwhile, Afghanistan welcomes the return of Rashid Khan to red-ball cricket.\n\nThe 26-year-old Khan last played Test cricket in 2021 against Zimbabwe in Abu Dhabi in a series that ended 11. He missed his teams recent Tests on medical advice to recover from a back injury, for which he underwent surgery earlier this year.\n\nZimbabwe test squad:Craig Ervine (captain), Ben Curran, Brian Bennett, Johnathan Campbell, Takudzwa Chataira, Joylord Gumbie, Trevor Gwandu, Takudzwanashe Kaitano, Tadiwanashe Marumani, Brandon Mavuta, Nyasha Mayavo, Blessing Muzarabani, Dion Myers, Richard Ngarava, Newman Nyamhuri, Sikandar Raza, Sean Williams.Afghanistan Test Squad:Hashmatullah Shahidi (captain), Rahmat Shah (vice-captain), Ikram Alikhail (wicketkeeper), Afsar Zazai (wicketkeeper), Riaz Hassan, Sediqullah Atal, Abdul Malik, Baheer Shah Mahboob, Ismat Alam, Azmatullah Omarzai, Zahir Khan, Zia Ur Rehman Akbar, Zahir Shehzad, Rashid Khan, Yamin Ahmadzai, Bashir Ahmad Afghan, Naveed Zadran, Fareed Ahmad.@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Queens-Sports-Club-1.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com A moment of pride awaits Bulawayo as Queens Sports Club prepares to host a historic two-match Test series between Zimbabwe and Afghanistan, starting on Boxing Day, Thursday. The two Tests are part of a full tour of Zimbabwe by Afghanistan, with their white-ball matches concluding today with the third and final One […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Young entrepreneurs at work: Mayor lights up Christmas tree made from 1 600 recycled bottles",
            "url": "https://www.chronicle.co.zw/young-entrepreneurs-at-work-mayor-lights-up-christmas-tree-made-from-1-600-recycled-bottles/",
            "content": "Patrick Chitumba,[emailprotected]\n\nGWERUS streets are sparkling brighter this year, thanks to a ground-breaking initiative by young entrepreneurs. Theyve transformed mountains of discarded plastic bottles into dazzling Christmas trees, a project thats not only brightening the holiday season but also brightening the future of the environment.\n\nThe innovative approach not only reduces plastic waste piling up in landfills but also showcases the incredible potential of upcycled art. By transforming trash into treasured decorations, these young innovators are raising awareness about environmental sustainability and inspiring their community to embrace responsible waste management practices.\n\nThe young entrepreneurs at Mckingtorch Zimbabwe created a unique plastic bottle tree for the Gweru Mayors Christmas lighting party. The initiative aims to reduce plastic waste pollution and promote sustainable shopping practices. The organisation has also partnered with local communities, schools, and organisations to create public space installations from waste.\n\nCharlene Harutizwi with the lit-up Christmas tree\n\nMade from over 1 600 used plastic containers, the Mayors Christmas tree was a highlight during the lighting of the Mayors Christmas lights at the town house last week. Co-founder and chief executive officer Charlene Harutizwi said that at Mckingtorch Zimbabwe, they are always exploring innovative ways to address the plastic waste crisis.\n\nThe idea of creating a plastic bottle tree came from our vision to use waste materials creatively while raising awareness about environmental sustainability. Inspired by the original Plastic Waste Bottles Christmas Tree by Mckingtorch Africa, we saw it as an opportunity to engage communities, showcase the potential of upcycled art, and spark conversations around waste management, she said.\n\nHarutizwi said plans to create many plastic Christmas trees to sell to the public.\n\nFor now, we have created one tree for the Mayors Christmas lighting party as a pilot project. Based on community feedback and interest, we plan to scale this initiative by creating more trees for events, public spaces, and awareness campaigns in Zimbabwe, she said.\n\nHarutizwi explained that the cost depends on the size, design, and materials required for the tree.\n\nOn average, creating one tree ranges between $30 and $500, factoring in collection, cleaning, and assembly of the plastic bottles, as well as labour and logistics. However, we aim to make these projects cost-effective and impactful for our clients and the community, she said.\n\nBesides being a viable project, Harutizwi said it addresses issues related to waste management and keeping the environment clean.\n\nYes, it is. Beyond being a creative project, the plastic bottle tree initiative addresses critical environmental challenges, such as plastic waste pollution, while promoting art and sustainability.\n\nIts a unique model that combines environmental advocacy with economic opportunities. By collaborating with local governments, organisations, and communities, it is a scalable and impactful business that also creates green jobs and raises awareness, she said.\n\nHarutizwi let slip that it is always satisfying to turn trash into treasure.\n\nThere are about 1 622 bottles on this Christmas tree for the mayor. Nine people, including seven volunteers, worked on this, she said. Harutizwi noted that they make recycled products including footwear, bags, belts, jewellery, plastic bottle bins, hats, mats, and receptacles.\n\nGweru Mayor Councillor Martin Chivhoko commended Mckingtorch for embarking on waste management programmes for the benefit of the community.\n\nThis is a welcome programme that benefits the community. It creates employment while keeping the environment clean, and therefore, the young brains behind this need to be commended, he said.\n\nCouncillor Chivhoko encouraged residents to have at least two litter bins  one for recyclable plastic and the other for other waste  to improve waste management at home.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/recycled-xmas-tree.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw GWERU’S streets are sparkling brighter this year, thanks to a ground-breaking initiative by young entrepreneurs. They’ve transformed mountains of discarded plastic bottles into dazzling Christmas trees, a project that’s not only brightening the holiday season but also brightening the future of the environment. The innovative approach not only reduces plastic waste piling […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        },
        {
            "title": "Bulawayo business community demands budget transparency from city council",
            "url": "https://www.chronicle.co.zw/bulawayo-business-community-demands-budget-transparency-from-city-council/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nDUE to mounting concerns about soaring costs, the Bulawayo business community is urging the City Council to be transparent about the salaries and perks of its nine directors, including the town clerk.\n\nThis request for disclosure coincides with the City Councils scrutiny over its adherence to the Governments 30/70 salary-to-service delivery budget ratio.\n\nThe call for transparency was made during a Ministry of Local Government and Public Works meeting attended by various city stakeholders and the Bulawayo City Council (BCC).\n\nThe meeting addressed a long-standing dispute over the local authoritys astronomical and unjustifiable tariff increases, especially in the more stable US dollar.Tariff adjustments for 2022 and 2023 were miscalculated, resulting in exorbitant charges that forced businesses to scale down or relocate.\n\nThe stakeholders present included representatives from the Confederation of Zimbabwe Industries (CZI) Matabeleland Chapter, Zimbabwe National Chamber of Commerce (ZNCC), the three residents associations, and tourism players.\n\nCZI Matabeleland Chapter led the call for disclosure, a position unanimously supported by all attendees at the council chambers.\n\nIn response, the Ministry of Local Government and Public Works director of local authorities inspectorate, Priscillar Mudzinge, who was chairing the meeting, agreed there was nothing untoward about the request for transparency.\n\nThose figures will have to be known; there is nothing secret about them, especially when even the Presidents salary package is public knowledge. However, the figures will come out at the appropriate time when the proposed budget has been revised as agreed here, said Mudzinge.\n\nThe meeting resolved to revise the 2025 budget and rebase the revised one to the 2017 budget.\n\nBCC presented a US$309 million budget for 2025 in September, aimed at enhancing service delivery, focusing on gender-specific projects, and revitalising the citys recreational facilities.\n\nHowever, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, directed the Ministry of Local Government and Public Works last month not to approve the budget until the local authority addresses concerns raised by the business community regarding the 2024 budget.\n\nCZI Matabeleland Chamber accused BCC of using an incorrect formula to index tariffs for 2022 and 2023 in US dollars, resulting in exorbitant charges.\n\nDespite a series of meetings between CZI representatives, BCC officials, and Bulawayo Provincial Affairs and Devolution Minister, Judith Ncube, there was no resolution, resulting in an impasse.\n\nIn his letter to the Ministry of Local Government and Public Works permanent secretary, Dr John Basera, Dr Rushwaya said he found issues raised by CZI to be invaluable and deserving of engagement by the local authority.\n\nThe proposed budget is now null and void following last weeks resolution, which also set up a committee representing industry leaders, residents groups, tourism players, and academic institutions with the task of crafting the revised budget and presenting it to the ministry by January 7 next year.\n\nThe committee, chaired by Residents Chapter chairperson Thamsanqa Ndlovu, has already hit the ground running and on Thursday met with officials from the local authority as it pushes to meet the January 7 deadline.\n\nThe committee will endeavour to meet the January 7, 2025, deadline. This may, however, be affected by how quickly Council management is able to provide the information required to the full team complement of stakeholders, said Ndlovu.\n\nThe council was asked to present to the committee audited accounts from 2017 to now, and that information will be analysed by the committee to ascertain cost drivers.\n\nAsked what the committees position was regarding bills that ratepayers have been paying since 2017 based on wrong calculations by the council, Ndlovu was non-committal but said the billing public will be advised in due course on the way forward.\n\nThe committee is looking at various options and a recommendation will be made to the council, said Ndlovu.\n\nHowever, Saturday Chronicle understands that the committee has already resolved that ratepayers ought to resort to the 2017 tariffs until the revised budget is approved by the Ministry of Local Government and Public Works.\n\nThe council may find itself in a catch-22 situation, especially if the committee proves beyond doubt that its tariffs were hugely inflated.\n\nA landlord who runs a shopping complex in the city recently revealed that their monthly bill in 2017 was US$1 600, but they are now paying US$19 000, a 1 150 percent increase in seven years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Director-of-local-authorities’-inspectorate-in-the-Ministry-of-Local-Government-and-Public-Works-Priscillar-Mudzinge-with-mic.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw DUE to mounting concerns about soaring costs, the Bulawayo business community is urging the City Council to be transparent about the salaries and perks of its nine directors, including the town clerk. This request for disclosure coincides with the City Council’s scrutiny over its adherence to the Government’s 30/70 salary-to-service delivery budget […]",
            "time": "08:38",
            "date": "22 Dec 2024"
        }
    ]
}