{
    "news": [
        {
            "title": "Teachers embrace school-based projects",
            "url": "https://www.chronicle.co.zw/teachers-embrace-school-based-projects/",
            "content": "Thokozile Mbedzi\n\nTHE Centre for Talent Development (C.T.D) invited teachers to a two-day School-Based Project workshop at Evelyn High School, aimed at equipping Ndebele teachers with a deeper understanding of the Heritage-Based Curriculum and the effective implementation of School-Based Continuous Learning. The workshop concluded on Friday.\n\nMR Thabani Moyo, the Director for Talent Development, emphasised the importance of teachers understanding the requirements of the new curriculum. He said, When the curriculum changes, teachers must understand the requirements of the programme. Now, we have Heritage-Based Projects, and as teachers, we come together to understand the materials provided. This was done to equip teachers so they can provide proper guidance to learners, as the projects are learner-centred.\n\nOne of the attending teachers, Ms Busi Ncube, shared her experience, saying, As teachers, we have gained knowledge which we did not have before. This will help us guide our learners when we return to our respective schools. Teachers are now equipped with the best content, which will enable us to make informed decisions for our learners. Since the project is learner-centred, our role is to guide them effectively.\n\nFacilitator Mr Chelesani Sibanda highlighted the importance of teachers thoroughly understanding the curriculum documents. As teachers, we needed to understand the documents very well. We must be equipped with the rich knowledge provided in the books, which are written in English. This required us to collaborate, translate (ukuhumutshela), and agree on the content to establish proper guidelines. This way, we can return to our schools and guide our learners, as they are the ones who write the projects, said Mr Sibanda.\n\nThe main facilitator, Mr Alexius Mangoro, explained the purpose of the workshop, saying, As teachers, we all wanted to gain a better understanding, which is why we came together. We collaborated to develop a way forward on how to guide our learners. Our goal was to equip ourselves and then provide proper guidance to our learners based on the agreed guidelines. We focused on understanding the Heritage Curriculum, the implementation of School-Based Continuous Learning, the characteristics of School-Based Projects, and the types of projects learners can undertake.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/gtggujkufjkhjk.jpg",
            "description": "Thokozile Mbedzi THE Centre for Talent Development (C.T.D) invited teachers to a two-day School-Based Project workshop at Evelyn High School, aimed at equipping Ndebele teachers with a deeper understanding of the Heritage-Based Curriculum and the effective implementation of School-Based Continuous Learning. The workshop concluded on Friday. MR Thabani Moyo, the Director for Talent Development, emphasised […]",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "New rule to combat time-wasting: Goalkeepers face eight-second limit",
            "url": "https://www.chronicle.co.zw/new-rule-to-combat-time-wasting-goalkeepers-face-eight-second-limit/",
            "content": "Online Writer\n\nIN a significant move to curb time-wasting in football, the International Football Association Board (IFAB) has officially approved a new rule set to take effect next season. Under the new regulation, goalkeepers who hold the ball for more than eight seconds will concede a corner kick to the opposing team.\n\nThis decision comes as part of ongoing efforts to improve the flow of the game and reduce unnecessary delays, which have long been a source of frustration for players, fans, and officials alike. Historically, goalkeepers have been known to hold onto the ball for extended periods, particularly when their team is leading, to run down the clock and disrupt the rhythm of the opposition.\n\nThe current laws of the game already stipulate that goalkeepers must release the ball within six seconds of gaining control. However, this rule has rarely been enforced strictly, leading to widespread inconsistency and frequent time-wasting tactics. The new eight-second rule aims to address this issue by introducing a clearer and more enforceable time limit, with a direct consequenceawarding a corner kickfor non-compliance.\n\nThe decision has sparked mixed reactions across the football community. While many have welcomed the change as a step towards fairer and more entertaining matches, others have expressed concerns about its potential impact on goalkeepers and the dynamics of the game. Some critics argue that the rule could place additional pressure on goalkeepers, particularly in high-stakes situations, while others question whether it will be consistently applied by referees.\n\nIFABs announcement follows a series of recent changes aimed at modernising the sport, including the introduction of VAR (Video Assistant Referee) technology and adjustments to substitution rules during the COVID-19 pandemic. The board has emphasised that the new eight-second rule is part of a broader strategy to enhance the quality and integrity of football.\n\nAs teams and players prepare for the upcoming season, the rule change is expected to prompt adjustments in training and tactics, particularly for goalkeepers, who will need to adapt their decision-making under pressure. Fans, meanwhile, will be watching closely to see how the new regulation influences the pace and fairness of matches.\n\nWith the clock now ticking louder than ever, the message from IFAB is clear: no more time-wasting.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/06/Untitled-1-copy-251.jpg",
            "description": "Online Writer IN a significant move to curb time-wasting in football, the International Football Association Board (IFAB) has officially approved a new rule set to take effect next season. Under the new regulation, goalkeepers who hold the ball for more than eight seconds will concede a corner kick to the opposing team. This decision comes […]",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "House under siege: Family loses cash, vehicle, and phones",
            "url": "https://www.chronicle.co.zw/house-under-siege-family-loses-cash-vehicle-and-phones/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nPOLICE in Harare have launched an investigation into a robbery that occurred at a house in Phase 9, Eastview, Harare, on 26 February 2025.\n\nIn a statement on X (formerly Twitter), the police confirmed that the complainant, a 45-year-old woman, and her 24-year-old son were attacked by four unknown suspects. The assailants stole two mobile phones, a silver Nissan Note vehicle with registration number AGG 8647, and US$ 13 000.\n\nAuthorities are investigating the case and have urged anyone with information to report it to the nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/robbery-680x340.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com POLICE in Harare have launched an investigation into a robbery that occurred at a house in Phase 9, Eastview, Harare, on 26 February 2025. In a statement on X (formerly Twitter), the police confirmed that the complainant, a 45-year-old woman, and her 24-year-old son were attacked by four unknown suspects. The assailants […]",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "MWOS announce their captains ahead of Bosso clash",
            "url": "https://www.chronicle.co.zw/mwos-announce-their-captains-ahead-of-bosso-clash/",
            "content": "Online ReporterMWOS have announced their captains ahead of their first season in the Castle Lager Premier Soccer League (PSL).The club is set to take on Bulawayo football giants Highlanders at Mhondoros Baobab Stadium this afternoon.Their three skippers are Tafadzwa Nyabunze, Martin Mapisa and Innocent Zambezi.In another PSL fixture scheduled for this afternoon, Dynamos will take on ZPC Kariba at Rufaro Stadium.Yesterdays ResultsGreen Fuel 1-1 Caps United, Simba Bhora 0-0 FC Platinum, Herentals College 2-1 TelOne FC, Manica Diamonds 0-0 Yadah FC, Chicken Inn 0-0 Bikita Minerals, Kwekwe United 1-1 Ngezi Platinum.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ikfgjdjjkds.jpg",
            "description": "Online Reporter MWOS have announced their captains ahead of their first season in the Castle Lager Premier Soccer League (PSL). The club is set to take on Bulawayo football giants Highlanders at Mhondoro’s Baobab Stadium this afternoon. Their three skippers are Tafadzwa Nyabunze, Martin Mapisa and Innocent Zambezi. In another PSL fixture scheduled for this […]",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "Man jailed 4 years for sex with minor",
            "url": "https://www.chronicle.co.zw/man-jailed-4-years-for-sex-with-minor/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA 36-YEAR-OLD man has been sentenced to four years in prison by the Mutare Magistrates Court for having sex with a 15-year-old girl on multiple occasions.\n\nThe National Prosecuting Authority said on X that the offender, who was in a so-called romantic relationship with the minor, committed the offences at various locations, including a forest near Mutare Prison Farm and his residence.\n\nThe abuse came to light after the minors mother received a tip-off from the community and confronted her daughter, who then disclosed the ordeal. The police were notified, leading to the mans arrest and conviction.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hjhurdj.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A 36-YEAR-OLD man has been sentenced to four years in prison by the Mutare Magistrate’s Court for having sex with a 15-year-old girl on multiple occasions. The National Prosecuting Authority said on X that the offender, who was in a so-called “romantic relationship” with the minor, committed the offences at various locations, […]",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "Western Rangers shout out for sponsorship",
            "url": "https://www.chronicle.co.zw/western-rangers-shout-out-for-sponsorship/",
            "content": "Online ReporterPUMULA South-based womens football side, Western Rangers, is in a desperate appeal for sponsorship.Coach and director Godwin Moyo says he is feeling the heat as the sole sponsor.His club finished fifth last season, and he believes 2025 could be better for them.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kkdshj.jpg",
            "description": "Online Reporter PUMULA South-based women’s football side, Western Rangers, is in a desperate appeal for sponsorship. Coach and director Godwin Moyo says he is feeling the heat as the sole sponsor. His club finished fifth last season, and he believes 2025 could be better for them.",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "Former Young Warriors stars at Etihad Stadium",
            "url": "https://www.chronicle.co.zw/former-young-warriors-stars-at-etihad-stadium/",
            "content": "Online Reporter\n\nBENJANI Mwaruwari a hit at Manchester City as a player, remembered for a hattrick against Manchester United is watching his former side against his employers Plymouth Argyle in an FA Cup fifth round tie at Etihad Stadium.\n\nMlungisi Ndebele\n\nAccompanying him is childhood friend Mlungisi Ndebele, with whom he played junior football in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ww.jpg",
            "description": "Online Reporter BENJANI Mwaruwari a hit at Manchester City as a player, remembered for a hattrick against Manchester United is watching his former side against his employers Plymouth Argyle in an FA Cup fifth round tie at Etihad Stadium. Accompanying him is childhood friend Mlungisi Ndebele, with whom he played junior football in Zimbabwe.",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "“And the Winner is”… NAMA Awards Tonight",
            "url": "https://www.chronicle.co.zw/and-the-winner-is-nama-awards-tonight/",
            "content": "The stage is set for the 23rd edition of the National Arts Merit Awards, taking place tonight in Harare.\n\nWith an exciting lineup of artistes, the event promises an unforgettable evening of entertainment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-6-Recovered-Recovered.jpg",
            "description": "The stage is set for the 23rd edition of the National Arts Merit Awards, taking place tonight in Harare. With an exciting lineup of artistes, the event promises an unforgettable evening of entertainment.",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "Action is underway at Luveve Stadium, where hosts Chicken Inn are facing off against Bikita Minerals in their opening match of the Castle Lager Premier Soccer League.",
            "url": "https://www.chronicle.co.zw/action-is-underway-at-luveve-stadium-where-hosts-chicken-inn-are-facing-off-against-bikita-minerals-in-their-opening-match-of-the-castle-lager-premier-soccer-league/",
            "content": "The lineups for both teams are as follows:\n\nChicken Inn:\n\nDonovan Bernard, Kudzaishe Dzingwe, Mpumelelo Bhebhe, Joseph Thulani, Xolani Ndlovu, Lincoln Mangaira, Miguel Feldman, Tinashe Mushaireni, Genius Mutungamiri, Brian Muza, Godfrey Mucheje\n\nBikita Minerals:\n\nTawanda Dendera, Tanaka Makwarimba, Pascal Shumba, Carlton Munzamba, Tinashe Ruzive, Felix Moyo, Chelsea Makope, Innocent Masiwa, Benedict Bera, Takunda Manyuchi, Tadiwanashe Musarurwa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/football-580x380.jpg",
            "description": "The lineups for both teams are as follows: Chicken Inn: Donovan Bernard, Kudzaishe Dzingwe, Mpumelelo Bhebhe, Joseph Thulani, Xolani Ndlovu, Lincoln Mangaira, Miguel Feldman, Tinashe Mushaireni, Genius Mutungamiri, Brian Muza, Godfrey Mucheje Bikita Minerals: Tawanda Dendera, Tanaka Makwarimba, Pascal Shumba, Carlton Munzamba, Tinashe Ruzive, Felix Moyo, Chelsea Makope, Innocent Masiwa, Benedict Bera, Takunda Manyuchi, Tadiwanashe […]",
            "time": "18:38",
            "date": "02 Mar 2025"
        },
        {
            "title": "President Mnangagwa departs Namibia after honouring Liberation Icon Dr Sam Nujoma",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-departs-namibia-after-honouring-liberation-icon-dr-sam-nujoma/",
            "content": "Nduduzo Tshuma in Windhoek, Namibia\n\nPRESIDENT Mnangagwa has left the Namibian National Heroes Acre for the Hosea Kutako International Airport from where he will fly back home in Harare.\n\nThe Sadc chairperson earlier in the day joined fellow Heads of State at Namibias National shrine to bid farewell to the countrys founding father and liberation icon Dr Sam Nujoma who died on February 8 last month.\n\nAlso at the burial was AU chairperson and Angolan leader President Lorenco, South African President Cyril Ramaphosa, among other dignitaries from the African continent and beyond.\n\nThousands of Namibians also turned out at the National shrine for the burial of their liberator. Namibian President and chief mourner Dr Nangolo Mbumba said Dr Nujoma completed his life mission with distinction, leaving the country with the gift of independence and freedom.\n\nThe previous day at a memorial service for Dr Nujoma, President Mnangagwa said the Namibian founding father will be remembered for his fierce fight for justice and equality not only for Namibia but Africa and beyond.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-01-at-11.30.47_e83bbb9d-680x380.jpg",
            "description": "Nduduzo Tshuma in Windhoek, Namibia PRESIDENT Mnangagwa has left the Namibian National Heroes Acre for the Hosea Kutako International Airport from where he will fly back home in Harare. The Sadc chairperson earlier in the day joined fellow Heads of State at Namibia’s National shrine to bid farewell to the country’s founding father and liberation […]",
            "time": "18:38",
            "date": "02 Mar 2025"
        }
    ]
}