{
    "news": [
        {
            "title": "Government honours top performers across ministries and public entities",
            "url": "https://www.chronicle.co.zw/government-honours-top-performers-across-ministries-and-public-entities/",
            "content": "President Emmerson Mnangagwa this morning awarded Government officials from various sectors for their exceptional performance that is contributing to the development of the nation.\n\nTransport and Infrastructural Development Minister Felix Mhona was recognised as the best-performing minister, while Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka is the first runner-up.\n\nFormer Public Service, Labour and Social Welfare Minister July Moyo, who is now the Minister of Energy and Power Development, is the second runner-up.\n\nThe Permanent Secretary in the Ministry of Transport and Infrastructural Development, Engineer Joy Makumbe, was recognised as the best performer.\n\nPermanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development came second, while at third place was Dr Mavis Sibanda, Permanent Secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises.\n\nAt provincial level, Permanent Secretary for Masvingo Provincial Affairs and Devolution Dr Addmore Pazvakavambwa emerged as the best performer while Permanent Secretary for Midlands Provincial Affairs and Devolution, Dr Edgar Seenza, claimed second place.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/GmzQ6Kwa8AAI-hV-680x380.jpg",
            "description": "Harare Bureau  President Emmerson Mnangagwa this morning awarded Government officials from various sectors for their exceptional performance that is contributing to the development of the nation. Transport and Infrastructural Development Minister Felix Mhona was recognised as the best-performing minister, while Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka is the first runner-up. […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "SADC Ministers of Employment and Labour Meeting Commences in Victoria Falls",
            "url": "https://www.chronicle.co.zw/sadc-ministers-of-employment-and-labour-meeting-commences-in-victoria-falls/",
            "content": "Online ReporterTHE meeting of SADC Ministers of Employment and Labour and Social Partners has commenced in Victoria Falls, with calls for the region to develop policies that formalise the informal sector to achieve sustainable development.The week-long meeting opened this morning with the Senior Officials Meeting of SADC, officiated by the Permanent Secretary for Public Service, Labour and Social Welfare, Mr Simon Masanga, who is the Chair of the SADC Employment and Labour Sector Senior Officials.Officiating at the meeting, Mr Masanga said that the region faces numerous challenges, including high levels of informal employment, limited access to decent work, and a skills gap that hinders productivity. He emphasised that employment remains at the core of sustainable development and industrialisation in the region.\n\nAs we meet under the theme of the 44th SADC Summit: Promoting Innovation to Unlock Opportunities for Sustained Economic Growth and Development towards an Industrialised SADC, it is important that we reflect on how employment and labour can contribute to this vision. Informal employment, which accounts for a significant share of economic activity in many SADC member states, presents both opportunities and challenges.On the one hand, it provides livelihoods for millions, and on the other, it often lacks social protection, fair wages, and adequate working conditions. It is imperative that we work towards the formalisation of the informal economy, which, according to the International Labour Organisation, is around 58.8 percent in Africa.\n\nAddressing informality through appropriate policies and strategies is essential for promoting decent work, reducing poverty, and achieving sustainable development. In addition, the integration of small to medium enterprises into the formal economy is particularly important, given their role as engines of job creation and innovation in our region, said Mr Masanga.He highlighted that, in light of these challenges, the meeting is not merely a formality but a critical platform to collectively strategise and find solutions.Mr Masanga stressed the need to create an environment that fosters innovation, entrepreneurship, and sustainable job creation.The meeting continues with closed-door discussions, culminating in the Ministerial session on Thursday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yuy.jpg",
            "description": "Online Reporter THE meeting of SADC Ministers of Employment and Labour and Social Partners has commenced in Victoria Falls, with calls for the region to develop policies that formalise the informal sector to achieve sustainable development. The week-long meeting opened this morning with the Senior Officials Meeting of SADC, officiated by the Permanent Secretary for […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "WATCH :Second big snake in Bulawayo city centre in two weeks spooks residents",
            "url": "https://www.chronicle.co.zw/second-big-snake-in-bulawayo-city-centre-in-two-weeks-spooks-residents22/",
            "content": "Diana Baloyi MoyoA BIG snake appeared at the corner of 9th Avenue and Joshua Mqabuko Nkomo Street at the premises of a health services provider Nkomo in Bulawayo today and has hidden in an outside booth.\n\nBooth where the snake is hidding\n\nA large crowd has gathered and onlookers are awaiting the arrival of officials from the Zimbabwe Parks and Wildlife Management Authority (ZimParks).\n\nThe snake is the second to cause a stir in the city centre as another one appeared near a food outlet, a few streets away from todays, along Leopold Takawira avenue and Jason Moyo Street.A snake catcher was called and he retrieved the reptile from a parked car where it had hidden.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xfr.jpg",
            "description": "Diana Baloyi Moyo A BIG snake appeared at the corner of 9th Avenue and Joshua Mqabuko Nkomo Street at the premises of a health services provider Nkomo in Bulawayo today and has hidden in an outside booth.     A large crowd has gathered and onlookers are awaiting the arrival of officials from the Zimbabwe […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Cassava to upgrade its data centres with NVIDIA supercomputers to drive Africa’s Artificial Intelligence (AI) future",
            "url": "https://www.chronicle.co.zw/cassava-to-upgrade-its-data-centres-with-nvidia-supercomputers-to-drive-africas-artificial-intelligence-ai-future/",
            "content": "Cassava Technologies announced today that it plans to build Africas first AI factory  a powerful and super-secure data centre facility powered with NVIDIA AI computing technology. This will give African businesses, governments and researchers access to cutting-edge AI computing capacity  helping them develop smarter AI products, streamline operations and stay competitive in a fast-changing world. It provides the supercomputers and software needed to train AI while keeping data within Africas borders.\n\nCassava plans to deploy NVIDIA accelerated computing and AI software using NVIDIA Cloud Partner (NCP) reference architectures, at its data centres in South Africa by June 2025, with expansion planned at its other data centre facilities in Egypt, Kenya, Morocco and Nigeria. Cassavas AI Factory will leverage the companys pan-African high-speed, ultra-low-latency, fibre-optic network with sustainable data centres to deliver AI as a Service (AIaaS). Cassavas world-class data centres are designed to be energy efficient, using less electricity to power AI computing workloads.\n\nNVIDIA GPU-based supercomputers will power the AI factory, enabling faster AI model training, fine-tuning and advanced inference capabilities. Cassava aims to be the first to introduce these accelerated computing platforms to Africa as an NCP, playing a crucial role in the continents AI ecosystem.\n\nThe Cassava AI Factory will ensure businesses and researchers have access to the AI computing power required to scale, boost productivity and power innovation. By using this secure, high-performance AI Factory, African businesses and governments can develop local solutions to local challenges, enabling Africans to build, train, scale and deploy AI in a secure environment compliant with global and local regulations.\n\nBuilding digital infrastructure for the AI economy is a priority if Africa is to take full advantage of the fourth industrial revolution. Our AI Factory provides the infrastructure for this innovation to scale, empowering African businesses, startups and researchers with access to cutting-edge AI infrastructure to turn their bold ideas into real-world breakthroughs  and now, they dont have to look beyond Africa to get it, said Strive Masiyiwa, Founder & Chairman of Cassava. Collaborating with NVIDIA gives us the advanced computing capabilities needed to drive Africas AI innovation while strengthening the continents digital independence.\n\nAI is helping innovators solve our greatest challenges in agriculture, healthcare, energy, financial services and many other industries creating opportunity in Africa, said Jaap Zuiderveld, VP EMEA at NVIDIA. As an NVIDIA Cloud Partner, Cassava is providing essential infrastructure and software to help pioneering companies and organizations accelerate AI development to foster innovation across the continent.\n\nCassavas AI Factory marks the next step in the groups long-standing leadership in providing world class digital solutions, reinforcing its broader commitment to responsible AI adoption, innovation and productivity growth in Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/06/Cassava-Smartech-Zimbabwe.jpg",
            "description": "Cassava Technologies announced today that it plans to build Africa’s first AI factory — a powerful and super-secure data centre facility powered with NVIDIA AI computing technology. This will give African businesses, governments and researchers access to cutting-edge AI computing capacity — helping them develop smarter AI products, streamline operations and stay competitive in a […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Dispute over Mabhikwa chieftainship: Khumalo family members say there is no place for a female chief",
            "url": "https://www.chronicle.co.zw/dispute-over-mabhikwa-chieftainship-khumalo-family-members-say-there-is-no-place-for-a-female-chief/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nA SECTION of the Khumalo family has insisted that there is no place for a female chief to take over the Mabhikwa chieftainship following the death of Chief Mabhikwa in a car crash over two years ago.\n\nChief Mabhikwa, born Vusumuzi Khumalo, died on 22 May 2022 at St Lukes Hospital after being involved in a head collision with a haulage truck along Bulawayo/Victoria Falls Highway.\n\nHis uncle, Mr John Khumalo was then appointed acting chief until the Government this year appointed Zanele Khumalo as the Regent Chief and is expected to serve in the position for nine years until Makhosemvelo Khumalo, the son of Vusumuzi who is currently a minor, comes of age and takes over as substantive chief.\n\nA section of the Khumalo family however disputed this appointment and have since lodged a High Court application seeking to stop the appointment.\n\nAddressing members of the media on Monday morning, Mr Donald Khumalo the Mabhikwa family spokesperson said there is no place for a female chief in their area.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/09/Untitled-38-2.jpg",
            "description": "Raymond Jaravaza,raymond.jaravaza@chronicle.co.zw A SECTION of the Khumalo family has insisted that there is no place for a female chief to take over the Mabhikwa chieftainship following the death of Chief Mabhikwa in a car crash over two years ago. Chief Mabhikwa, born Vusumuzi Khumalo, died on 22 May 2022 at St Luke’s Hospital after being […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zanu PF student body wins at Bulawayo-based institutions",
            "url": "https://www.chronicle.co.zw/zanu-pf-student-body-wins-at-bulawayo-based-institutions/",
            "content": "Peter Matika,[emailprotected]\n\nThe Zanu PF student body has successfully won the Zimbabwe Congress of Students Union (ZICOSU) and the Student Representative Council (SRC) elections across all higher and tertiary institutions in Bulawayo.\n\nZanu PF Secretary for Education in Bulawayo, Cde Godknows Mdhari, expressed the partys satisfaction with the election results, stating that the elections were conducted freely and fairly.\n\nWUA Tamia\n\nAs the Zanu PF Department of Education, we are delighted with the outcome of the recently held SRC elections, in which our affiliates performed remarkably well. This demonstrates that the student community is pleased with the initiatives being implemented by the government under the leadership of our President, Emmerson Mnangagwa, he said.\n\nArshford Poly\n\nHe encouraged tertiary students to actively participate in contributing to the countrys economic development.\n\nZamani HTC\n\nWe understand that students are aware of the economic progress and advancements happening under President Mnangagwas Vision 2030, which aims to boost the economy, said Cde Mdhari.\n\nNust Stacy\n\nBelow is the list of newly elected SRC presidents and their respective institutions:\n\n Stacy Majuru  National University of Science and Technology (NUST)\n\n Tamia Govere  Womens University of Africa\n\n Zamani Sibanda  Hillside Teachers College\n\n Ashford Muhwandagore  Bulawayo Polytechnic College\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Sec-for-Education-Cde-Mdhari.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw The Zanu PF student body has successfully won the Zimbabwe Congress of Students Union (ZICOSU) and the Student Representative Council (SRC) elections across all higher and tertiary institutions in Bulawayo. Zanu PF Secretary for Education in Bulawayo, Cde Godknows Mdhari, expressed the party’s satisfaction with the election results, stating that the elections were […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Ex Bosso security Bhibhiza laid to rest",
            "url": "https://www.chronicle.co.zw/ex-bosso-security-bhibhiza-laid-to-rest/",
            "content": "Online ReporterEX Highlanders security aid Mkhulunyelwa Ndlovu better known to Bosso followers was laid to rest on Wednesday at Luveve Cemetery.Bhibhiza passed on at his Luveve home last week Thursday.He had been unwell for some time.Scores of people from all walks of life came to bid farewell to a true Bosso lover.Its great loss, he was very passionate about the club. He loved Bosso with his whole heart may his family be comforted Sehambile umdala weBosso, said ex Bosso coach Mandla Lulu Mpofu.Former Highlanders striker Graham Ncube said: He was a great skhwamula that we started to know about when were very young. He undoubtedly had a big love for Bosso ithimu yezwe lonke.The late Ndlovu started following Highlanders in the early 1970s and rose to being one of the clubs security aides, putting his life on many instances when there were pre-match tussles at the gates or tunnel.He worked with several generations of players and executives.Upon retiring from his job at a Lobengula Street shop, Bhibhiza got a job at Highlanders, given to him solely in recognition of his great service to the club as a security aide.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Mkhulunyelwa-Bhibhiza-Ndlovu.jpg",
            "description": "Online Reporter EX Highlanders security aid Mkhulunyelwa Ndlovu better known to Bosso followers was laid to rest on Wednesday at Luveve Cemetery. Bhibhiza passed on at his Luveve home last week Thursday. He had been unwell for some time. Scores of people from all walks of life came to bid farewell to a true Bosso […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Bulawayo fuel service stations under siege: Armed robbers strike again",
            "url": "https://www.chronicle.co.zw/bulawayo-fuel-service-stations-under-siege-armed-robbers-strike-again/",
            "content": "Peter Matika\n\n[emailprotected]\n\nANOTHER fuel service station has been robbed in Bulawayo, following a disturbing trend where armed robbers are increasingly targeting these facilities.\n\nAccording to police, the robbers got away with US$1 000 and ZAR 7 000 after raiding Blaze Petroleum, situated along Siyephambili Drive in Kelvin West.\n\nActing Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele the incident occurred on March 23 at around 8 PM.\n\nShe said three unidentified suspects, clad in face masks and armed with two unidentified rifles and a pistol emerged from a nearby maize field near the service station.\n\nOne of the suspects fired one shot into the air. The fuel attendants tried to run away but were all apprehended. They were force marched to the cash office where the suspects demanded money. The fuel attendants surrendered all the money in their possession and the suspects also took some money which was in an unlocked metal box, said Asst Insp Msebele.\n\nShe said the robbers ordered the fuel attendants to lie down before fleeing from the scene of the crime.\n\nWe have witnessed the upsurge of armed robberies at fuel service stations around the city . We urge petrol attendants not to keep large sums of money on themselves or on their premises but to deposit their monies in the safes under lock and key and day sales to be banked, said Asst Insp Msebele.\n\nThe worrying surge in armed robberies targeting Bulawayos fuel service stations has also forced the businesses to drastically alter their operations, with some now closing their doors at night.\n\nThis drastic measure comes in response to a persistent wave of robberies, a trend that began last year, where criminals have repeatedly targeted these establishments, making off with substantial sums of foreign currency.\n\nThe escalating threat has left fuel station owners and staff increasingly vulnerable, impacting both their livelihoods and the vital service they provide to the community.\n\nIn some of the incidents, a gang made off with a total of US$2 374 and ZAR115 235 after raiding a service station located in the Kelvin industrial area last month.\n\nHe said that the robbers forced the employees to lie on the ground before stealing the cash.\n\nIn a separate incident, Commissioner Nyathi reported that the same suspected group targeted a service station in Tshabalala, where they stole US$440 and a Toyota Altezza valued at US$3 200, which they later abandoned in the Pumula suburb.\n\nHe appealed to the public for information that could lead to the apprehension of the suspects, who were wearing balaclavas.\n\nHe urged business owners to strengthen their security measures by installing CCTV systems and other electronic security devices, such as trip alarms.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsfmkbvhxhivhbvfhbvhiobvbvujo.jpg",
            "description": "Peter Matika peter.matika@chronicle.co.zw ANOTHER fuel service station has been robbed in Bulawayo, following a disturbing trend where armed robbers are increasingly targeting these facilities. According to police, the robbers got away with US$1 000 and ZAR 7 000 after raiding Blaze Petroleum, situated along Siyephambili Drive in Kelvin West. Acting Bulawayo police spokesperson Assistant Inspector […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "Makomo Resources exits corporate rescue, regains financial stability",
            "url": "https://www.chronicle.co.zw/makomo-resources-exits-corporate-rescue-regains-financial-stability/",
            "content": "Nqobile Bhebhe,Senior Business Writer\n\nMAKOMO RESOURCES, a coal mining firm in Matabeleland North has successfully exited corporate rescue processes after settling its obligations to creditors noting that it has regained financial stability.\n\nThe corporate rescue processes were completed on 27 February.\n\nCorporate rescue, also known as business rescue or restructuring, is a legal framework designed to assist financially distressed companies in Zimbabwe to restore solvency and continue operations.\n\nThe process aims to balance the interests of creditors, shareholders, employees, and other stakeholders while preserving the economic value of the company.\n\nAt one point Makomo Resources was one of the leading companies contracted by ZPC to supply Unit 7 and 8 with coal for production of electricity in the country.\n\nIt also had plans to build a 600-megawatt power station in Hwange.\n\nOperating south-east of Hwange town, Makomo was established more than a decade ago and immediately grew to be a leading producer of coal alongside Hwange Colliery Company.\n\nHowever, a few years ago it went under corporate rescue after running into financial and operational challenges.\n\nIn a notice, Mr Bulisa Mbano, the Lead Corporate Rescue Practitioner said the mining firm is now out of the woods.\n\nHe said the restructuring and reorganisation of Makomo Resources is complete.\n\nNotice is hereby given to the pre-Corporate Rescue creditors and members of Makomo Resources (Private) Limited that the Companys restructuring and reorganisation has been successfully completed. Through this process, Makomo Resources settled its obligations to creditors and restructured its financial position, ensuring that it is no longer in financial distress, he said.\n\nMr Mbano said with the transition, the board and management will fully regain control of the companys operations upon the completion of the ongoing handover process.\n\nWe extend our sincere gratitude to the board, management, staff, creditors, the Ministry of Mines and Mining Development, Zimbabwe Power Company, Zimbabwe Electricity Transmission and Distribution Company, and all other stakeholders for their unwavering support throughout the Corporate Rescue process.\n\nUnder our guidance, the company has regained financial stability, and we are confident that Makomo Resources is now well-positioned for future success. We wish the board and management continued growth and prosperity as they create value for stakeholders and contribute to the nations economy.\n\nMakomo Resources is a coal mining company in the Bulawayo Mining District of Zimbabwe, with its mineral resource at Entuba Colliery, which is situated approximately 17 kilometres from the Hwange, Matabeleland North province of the country.\n\nIts concession covers 7 000 hectares, which enables the mining concern to carry out open cast mining for the next 30 years at one million tonnes per annum plus another 100 years of underground mining.\n\nThe mining sector is a key player in the countrys economy, contributing more than 60 percent of Zimbabwes export receipts and attracting more than 50 percent of foreign direct investment (FDI).\n\nThe sector also contributes about 13 percent to the Gross Domestic Product, as well as generating significant downstream business and revenue injection to the fiscus through taxes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/Makomo-Resources.jpg",
            "description": "Nqobile Bhebhe, Senior Business Writer MAKOMO RESOURCES, a coal mining firm in Matabeleland North has successfully exited corporate rescue processes after settling its obligations to creditors noting that it has regained financial stability. The corporate rescue processes were completed on 27 February. Corporate rescue, also known as business rescue or restructuring, is a legal framework designed […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        },
        {
            "title": "KwaNtuthu Comedy Festival seeks performers",
            "url": "https://www.chronicle.co.zw/kwantuthu-comedy-festival-seeks-performers/",
            "content": "Langalakhe Mabena,[emailprotected]\n\nThe KwaNtuthu Comedy Festival is inviting stand-up comedians to apply for a chance to perform at this years edition, which is set to take place in Bulawayo in October.\n\nApplications are open to both locally based and international comedians who can travel to Bulawayo for the festival.\n\nKwaNtuthu Comedy Festival seeks performers\n\nThe deadline for applications is April 30. On submitting their materials, applicants should include the links to artworks, social media handles, and a quote of their performance fee with duration of performance to[emailprotected].\n\nSuccessful applicants will be notified from June 1.\n\nSince its inception in 2021, the KwaNtuthu Comedy Festival has been an annual four-day event held in October. The comedy night is a festival highlight, alongside other evenings dedicated to theatre and film, where schoolchildren showcase their creative works.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/3gt45.jpg",
            "description": "Langalakhe Mabena, langamabena@gmail.com The KwaNtuthu Comedy Festival is inviting stand-up comedians to apply for a chance to perform at this year’s edition, which is set to take place in Bulawayo in October. Applications are open to both locally based and international comedians who can travel to Bulawayo for the festival.   The deadline for applications […]",
            "time": "18:44",
            "date": "24 Mar 2025"
        }
    ]
}