{
    "news": [
        {
            "title": "Bulawayo City Council consults public on GlassBlock Bopoma Dam",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-consults-public-on-glassblock-bopom1a-dam/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nBULAWAYO City Council is embarking on public consultation meetings on the proposed short to medium-term water project  GlassBlock Bopoma Dam in Insiza District, Matabeleland South.\n\nThe consultations start on Saturday (tomorrow).\n\nThe local authority has already issued out a schedule of meetings in all the wards.\n\nPosting on his X account, city mayor, councillor David Coltart said There are very exciting developments concerning Glassblock Bopoma dam and all @CityofBulawayo Councillors will be conducting consultations with residents over the next few days.\n\nDo try to attend so that you can hear about the developments and give your own input.\n\nLate last year, Cllr Coltart led a delegation of council officials to Rabat, Morocco for the Africa Investment Forum (AIF).\n\nThe delegation sought to mobilise resources for Water and Sanitation short, medium and long term projects.\n\nAfter the summit, Cllr Coltart told the Chronicle that there was tremendous interest for the project, attracting continental interest, generating US$90 million in expressions of interest.\n\nPledges are not made at such a meeting but there are simple expressions of interest. Of the US$99 million that we are seeking, we had expressions of interest of just over US$90 million which was an outstanding response.\n\nBut it can not be described as a pledge because there is considerable work that needs to be done to convert that interest into actual monetary commitments, said Cllr Coltart then.\n\nThe dam which has a two-year construction timeline and an estimated cost US$100 million has a projected holding capacity of 130 million cubic metres.\n\nIt is being constructed through a public-private partnership (PPP).\n\nThe dam is strategically located at the intersection of Gwanda, Umzingwane and Filabusi districts and is expected to boost bulk water supplies for local communities.\n\nPlans to construct the dam were mooted in 1988 but implementation of the project was stalled due to funding and other logistical challenges.\n\nA 32km pipeline will link the dam to the Ncema Dam pump station so that Bulawayo can access water from the dam.\n\nBulawayo residents continue to endure prolonged water cuts, sometimes more than a week in some suburbs at a time when some parts of the country are experiencing an outbreak of cholera and diarrhoea.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/BCC-LOGO.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw BULAWAYO City Council is embarking on public consultation meetings on the proposed short to medium-term water project – GlassBlock Bopoma Dam in Insiza District, Matabeleland South. The consultations start on Saturday (tomorrow). The local authority has already issued out a schedule of meetings in all the wards. Posting on his X account, […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Trump orders release of thousands of classified files on JFK assassination",
            "url": "https://www.chronicle.co.zw/trump-orders-release-of-thousands-of-classified-files-on-jfk-assassination/",
            "content": "Donald Trumphas ordered the release of thousands of classified governmental documents about the 1963 assassination ofJohn F Kennedy, which has fueled conspiracy theories for decades.\n\nThe executive order the president signed on Thursday also aims to declassify the remaining federal records relating to the assassinations of Robert F Kennedy and the RevMartin Luther King Jr. The order is among a flurry of executive actions Trump has quickly taken the first week of his second term.\n\nMore than 50 years after the assassinations of President John F Kennedy, Senator Robert F Kennedy, and the Rev Dr Martin Luther King, Jr, the federal government has not released to the public all of its records related to those events, the executive orderstated.\n\nTheir families and the American people deserve transparency and truth. It is in the national interest to finally release all records related to these assassinations without delay, it added.\n\nSpeaking to reporters, Trump said: Everything will be revealed.\n\nThats a big one, headdedas he signed the order.\n\nTrump had promised during his re-election campaign to make public the last batches of still classified documents surrounding Kennedys assassination in Dallas, which has transfixed people for decades. He made a similar pledge during his first term, but ultimately heeded appeals from theCIAandFBIto withhold some documents.Trump has nominated Kennedys nephew,Robert F Kennedy Jr, to be the health secretary in his new administration. Kennedy, whose father, Robert F Kennedy, was assassinated in Los Angeles in 1968 while running for president, has said he is not convinced that a lone gunman was solely responsible for the assassination of his uncle, John F Kennedy, in 1963.\n\nThe order directs the director of national intelligence and the attorney general to develop a plan within 15 days to declassify the remainingJohn F Kennedyrecords, and within 45 days for the other two cases. It was not clear when the records would actually be released.\n\nTrump handed the pen used to sign the order to an aide and directed it to be given toRobert F Kennedy Jr.\n\nSpeaking toNBC News, Kennedy Jr said that he was grateful to President Trump, adding: I think its a great move, because they need to have more transparency in our government, and hes keeping his promise to have the government tell the truth to the American people about everything.\n\nMeanwhile, Jack Schlossberg, the grandson of Kennedy, condemned Trumps latest executive order as a political prop.\n\nThe truth is a lot sadder than the myth  a tragedy that didnt need to happen. Not part of an inevitable grand scheme. Declassification is using JFK as a political prop, when hes not here to punch back. Theres nothing heroic about it, Schlossbergsaid on X.\n\nOnly a few thousand of the millions of governmental records related to the assassination of John F Kennedy have yet to be fully declassified. And while many who have studied what has been released so far say the public should not anticipate any earth-shattering revelations, there is still an intense interest in details related to the assassination and the events surrounding it.\n\nTheres always the possibility that something would slip through that would be the tiny tip of a much larger iceberg that would be revealing, said Larry Sabato, director of the University of Virginia Center for Politics and author of The Kennedy Half-Century. Thats what researchers look for. Now, odds are you wont find that but it is possible that its there.\n\nKennedy was shot dead in downtown Dallas on 22 November 1963 as his motorcade passed in front of the Texas School Book Depository building, where the 24-year-old assassin Lee Harvey Oswald had positioned himself in a snipers perch on the sixth floor. Two days after Kennedy was killed, the nightclub owner Jack Ruby shot and killed Oswald during a jail transfer.\n\nIn the early 1990s, the federal government mandated that all assassination-related documents be housed in a single collection in the National Archives and Records Administration. The collection of more than 5m records was required to be opened by 2017, barring any exemptions designated by the president.\n\nDuring his first term, Trump boasted that he would allow the release of all of the remaining records on the presidents assassination but ended up holding some back because of what he called the potential harm to national security. And while files have continued to be released under Joe Biden, some still remain unseen.\n\nSabato, who trains student researchers to comb through the documents, said most researchers agree that roughly 3,000 records have not yet been released, either in whole or in part, and many of those originated with the CIA.\n\nThe documents released over the last several years offer details on the way intelligence services operated at the time, and include CIA cables and memos discussing visits by Oswald to the Soviet and Cuban embassies during a trip to Mexico City just weeks before the assassination. The former marine had previously defected to the Soviet Union before returning home to Texas.\n\nThere are still some documents in the collection, though, that researchers do not believe the president would be able to release. About 500 documents, including tax returns, were not subject to the 2017 disclosure requirement. And, researchers note, documents have also been destroyed over the decades.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/01/Donald-Trump-ir.jpg",
            "description": "Donald Trump has ordered the release of thousands of classified governmental documents about the 1963 assassination of John F Kennedy, which has fueled conspiracy theories for decades. The executive order the president signed on Thursday also aims to declassify the remaining federal records relating to the assassinations of Robert F Kennedy and the Rev Martin Luther King Jr. […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Woman arrested for snooping on husband’s whatsapp",
            "url": "https://www.chronicle.co.zw/woman-arrested-for-snooping-on-husbands-whatsapp/",
            "content": "MBABANE  In a case thats sure to set a legal precedent, a woman faces up to three years in prison for the digital crime of WhatsApp snooping.Dumsile Dludlu has been arrested for allegedly viewing her husbands WhatsApp without his consent.She now stands accused of contravening the Computer Crime and Cybercrime Act of 2022, which criminalises such acts.The Act, which has generated significant discussion since its enactment, criminalises accessing any part of a computer system without justification.\n\nIncreased\n\nPenalties are further increased for those who breach security measures to obtain data, with fines reaching E500 000 and potential imprisonment for up to five years.According to court documents, Dludlu not only accessed her husband, Samukeliso Matses WhatsApp account, but also allegedly insulted him based on the information she found therein.During her court appearance, Dludlu pleaded not guilty to the unauthorised access charge, although she admitted to insulting her husband. She claimed the insults were different from those recorded in the police statement.\n\nPrincipal Magistrate Fikile Nhlabatsi remanded Dludlu out of custody until March 10 for trial.This case has raised concerns about privacy and the evolving legal landscape in the digital age. It serves as a stark reminder of the potential consequences of unauthorised access to electronic devices and the importance of respecting digital boundaries.Section 3 of the Act provides that, a person who intentionally and without lawful excuse or justification or in excess of a lawful excuse or justification: Communicates, discloses or transmits any computer data, programme, access code or command to any person not authorised to access the computer data, programme, code or command; accesses or destroys any computer data, for purposes of concealing information necessary for an investigation into the commission or otherwise of an offence commits an offence and is liable, on conviction, to a fine not exceeding E5 000 or to imprisonment for a period not exceeding three years or both.\n\nRecently, another woman was arrested and charged under this Act for allegedly intimidating, insulting, harassing and further causing emotional distress to another she suspected to be in love with her husband.Nontsikelelo Lebohang Gina of Mbikwakhe allegedly posted Sonto, whom she suspected to be in a love relationship with her husband, on a Facebook page titled Eswatini Ladies House, wherein she allegedly insulted, intimidated, harassed and further caused her emotional distress.It is alleged that Gina accused Sonto of causing her bad luck through the use of muti she called sicitfo and imbume.Sicitfo is muti that is used to separate a couple while imbune is used to harm mens manhood.\n\nForcefully\n\nIn an almost similar incident, an aggrieved baby mama was arrested after she purportedly forcefully undressed a woman and later proceeded to record a video which she later shared with several people on WhatsApp.The survivor, *Nosipho, was reportedly subjected to the horrific treatment by Hlengiwe Mathunjwa of Masekweni in the Manzini Region on July 25, supposedly as an act of revenge for Nosiphos alleged relationship with the father of Mathunjwas child. The terrified Nosipho was allegedly threatened with a sharp object and coerced into removing her clothes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "MBABANE – In a case that’s sure to set a legal precedent, a woman faces up to three years in prison for the digital crime of WhatsApp snooping. Dumsile Dludlu has been arrested for allegedly viewing her husband’s WhatsApp without his consent. She now stands accused of contravening the Computer Crime and Cybercrime Act of 2022, which […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Treger Group of Companies leads Bulawayo’s manufacturing revival",
            "url": "https://www.chronicle.co.zw/treger-group-of-companies-leads-bulawayos-manufacturing-revival/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nBulawayos Treger Group of Companies is leading efforts to restore the citys manufacturing dominance through expansion projects and diversification aimed at meeting market demands and increasing exports.\n\nDespite facing recent operational challenges, the company has shown resilience and determination through consistent growth in production, capacity utilisation, employment, product diversity, and export market reach.\n\nOn Thursday, Presidential and Devolution Permanent Secretary Engineer Tafadzwa Muguti, along with senior government officials and staff, toured the diversified Monarch Steel factory on Khami Road, engaging with workers, shareholders, and executives during the visit.\n\nThe Treger Group has weathered significant macroeconomic challenges over the years, including the peak of hyperinflation in 2008. Founded in 1911 by the Treger family, the privately-owned company is now the largest manufacturer of household cookware and appliances in Africa.\n\nManaging Director Mr Fritzpatrick Mawovera stated that in the past four years, the firm has invested close to US$4.5 million in the latest technology.\n\nHe mentioned that they aim to be a leading manufacturer in the region.In Zimbabwe, Treger Group ranks among the largest producers of window and door frames, wheelbarrows, geysers, kitchen furniture, and both painted and galvanized hardware for the building and allied industries, all conforming to SAZ standards.\n\nThe company also exports to several countries within the SADC region and beyond.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/uiy7i76.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw Bulawayo’s Treger Group of Companies is leading efforts to restore the city’s manufacturing dominance through expansion projects and diversification aimed at meeting market demands and increasing exports. Despite facing recent operational challenges, the company has shown resilience and determination through consistent growth in production, capacity utilisation, employment, product diversity, and export market […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Johanne Masowe the 5th hold nationwide prayers",
            "url": "https://www.chronicle.co.zw/johanne-masowe-the-5th-hold-nationwide-prayers/",
            "content": "Leonard Ncube[emailprotected]\n\nThe Johanne the 5th of Africa International Church is conducting nationwide prayer sessions to intercede for the country especially for President Mnangagwa to continue being guided by God.\n\nToday is the second day of the\n\nProvincial Prayer for Matabeleland North being held in Victoria Falls at Chinotimba Community Hall.\n\nThe indigenous church leadership led by Bishop Dr Andby Makururu is going around the country with specific prayer points including praying for President Mnangagwa and the First Family, Zanu-PF party, peace in the Sadc region, eradication of drug and substance abuse, black empowerment and empowerment of indigenous churches.\n\nIt is being held under the theme 2025: The Year of Progress and Development.\n\nDr Makururu implored Zimbabweans to be proud of their President and heritage, as well as return to their cultural values.\n\nHundreds of people from Victoria Falls and surrounding areas are attending the two-day prayer session.\n\nThey are also joined by Vendors4ED and some Zanu-PF party members from Bulawayo Province, particularly City Centre District.\n\nThe mission also involves empowering citizens with projects as the nation drives towards Vision 2030.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-24-at-2.26.44-PM-680x380.jpeg",
            "description": "Leonard Ncube leonard.ncube@chronicle.co.zw The Johanne the 5th of Africa International Church is conducting nationwide prayer sessions to intercede for the country especially for President Mnangagwa to continue being guided by God. Today is the second day of the Provincial Prayer for Matabeleland North being held in Victoria Falls at Chinotimba Community Hall. The indigenous church […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Potraz to host 2nd edition of Data Privacy Week Symposium",
            "url": "https://www.chronicle.co.zw/potraz-to-host-2nd-edition-of-data-privacy-week-symposium/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nZIMBABWES telecommunications regulator, Postal Telecommunications Regulatory Authority of Zimbabwe (Potraz) is set to host the second edition of its Data Privacy Week Symposium in the resort city of Victoria Falls starting on Tuesday.\n\nThis years event is being held under the theme, Bridging technology, policy, law and practice: Towards strengthening data protection in Zimbabwe.\n\nMinister of Information Communication Technology, Postal and Courier Services Dr Tatenda Mavetera is expected to officially open the event on Wednesday. Expected to attend is Matabeleland North Provincial Minister of State for Provincial Affairs and Devolution RIchard Moyo, ICT Deputy Minister Dingumuzi Phuti, ICT permanent secretary Dr Beulah Chirume, Potraz director general Dr Gift Machengete and various players in the ICT sector.\n\nFollow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fgfhgfg.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com ZIMBABWE’S telecommunications regulator, Postal Telecommunications Regulatory Authority of Zimbabwe (Potraz) is set to host the second edition of its Data Privacy Week Symposium in the resort city of Victoria Falls starting on Tuesday. This year’s event is being held under the theme, “Bridging technology, policy, law and practice: Towards strengthening data protection […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Gwanda set to host inaugural KCD Mohadi Soccer and Netball Tournament",
            "url": "https://www.chronicle.co.zw/gwanda-set-to-host-inaugural-kcd-mohadi-soccer-and-netball-tournament/",
            "content": "Sukukwenkosi Dube-Matutu,[emailprotected]\n\nAll is set for the first edition of the KCD Mohadi soccer and netball tournament, which begins on Saturday at Pelandaba Stadium in Gwanda.\n\nA brainchild of the Zanu PF Matabeleland South Provincial Youth League, the tournament celebrates the revolutionary who has dedicated his life to the defence of his countrys sovereignty.\n\nOver 7,000 youths from across the province are expected to attend. Twelve soccer teams and twelve netball teams will converge at Pelandaba Stadium in Gwanda, representing 12 constituencies, to take part in the two-day event set for Saturday and Sunday. Knockout stages and third-place play-offs will be played on Saturday, while the final matches will take place on Sunday, with Vice President Kembo Mohadi in attendance.\n\nSpeaking during a press conference, the Minister of State for Matabeleland South Provincial Affairs and Devolution, Dr Evelyn Ndlovu, called on residents from the province to turn out in numbers and support the programme.\n\nShe said the tournament, which will become an annual event, will play a crucial role in fighting the drug and substance abuse scourge.\n\nWe came up with a plan to honour our Vice President, Cde KCD Mohadi, who hails from Matabeleland South, through this tournament. We honour his early childhood participation in the liberation struggle, where he lost part of his youth life incarcerated for taking a stand against the colonial regime. We also honour him for his participation post-independence, where he held various influential positions, up until he became Vice President of the country.\n\nWe decided to honour him through this soccer and netball tournament for youths. We expect teams to arrive in Gwanda today. Accommodation has been arranged for the participants, as well as other necessary arrangements to ensure that these children are taken care of. This event, which will now become an annual event, will help us fight the scourge of drug and substance abuse, she said.\n\nDr Ndlovu said the tournament will mark the start of sporting activities that the youths will engage in throughout the year in preparation for the next tournament. She said legislators in the province will be expected to organise inter-district competitions to ensure the sustainability of the tournament. Dr Ndlovu also mentioned that such sporting events can help identify skills in youths and groom them. She said sport is a reliable career path that youngsters can pursue if well supported.\n\nI would like to urge the people of Matabeleland South, especially those around Gwanda, to take part in this event. We have to come together if we want to develop our communities and nation. This tournament will have far-reaching effects and can significantly contribute to developing our province, she said.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/sdefede.jpg",
            "description": "Sukukwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw All is set for the first edition of the KCD Mohadi soccer and netball tournament, which begins on Saturday at Pelandaba Stadium in Gwanda. A brainchild of the Zanu PF Matabeleland South Provincial Youth League, the tournament celebrates the revolutionary who has dedicated his life to the defence of his country’s sovereignty. […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Matabeleland South launches 136 devolution projects",
            "url": "https://www.chronicle.co.zw/matabeleland-south-launches-136-devolution-projects/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nMatabeleland South Province has initiated 136 projects under the devolution programme, with some already having been commissioned.\n\nSpeaking recently during a visit by the Permanent Secretary for Presidential Affairs and Devolution, Engineer Tafadzwa Muguti, Matabeleland Souths Acting Director of Local Government, Mr Zachariah Jusah, appealed for the timeous release of funds to enable local authorities to complete the projects.\n\nThe province has been allocated ZWG 507 million as part of this years devolution fund.\n\nWe wish that your office could push our allocation a bit higher and ensure funds are released on time, as we are behind on some projects. Some projects have been running for a year or a year and a half without any activity. We hope to commission several projects this year, hence the need to complete them. As a province, we have about 136 projects, and about 20 percent have been completed, he said.\n\nWith social amenities and infrastructure development being major pillars of the National Development Strategy (NDS1), local authorities have used devolution funds to complement efforts by communities and other stakeholders to ensure that projects are completed on time.\n\nDevolution funds are assisting local authorities in fulfilling their obligations across the country through the development of key infrastructure such as clinics, classroom blocks, roads, bridges, and other facilities. Devolution funds have transformed several districts in the Matabeleland region, as the Second Republic steps up the inclusive developmental philosophy of leaving no one and no place behind. The devolution programme is one of the key pillars of the NDS1. The overarching goal of the NDS1 is to ensure high, accelerated, inclusive, and sustainable economic growth, as well as socio-economic transformation and development, as the country moves towards an upper middle-income society by 2030.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/pl.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw Matabeleland South Province has initiated 136 projects under the devolution programme, with some already having been commissioned. Speaking recently during a visit by the Permanent Secretary for Presidential Affairs and Devolution, Engineer Tafadzwa Muguti, Matabeleland South’s Acting Director of Local Government, Mr Zachariah Jusah, appealed for the timeous release of funds to […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Premier African Minerals secures £540 k raise for Zulu Lithium Project operations",
            "url": "https://www.chronicle.co.zw/premier-african-minerals-secures-540-k-raise-for-zulu-lithium-project-operations/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPremier African Minerals Limited on Friday announced a 540,000 raise via a 2.7 billion new ordinary share subscription to provide working capital to support essential operational requirements.\n\nThe firm states it is fundamentally important for it to continue supporting all essential operational requirements at both Premier and the Zulu Lithium and Tantalum Project.\n\nAt present, the entity is actively engaged with its prepayment and offtake partner, whose reaffirmation of its intentions in relation to Zulu was announced on 20 January 2025.\n\nAdditionally, Premier is looking to address, in consultation with its prepayment and offtake partner, any factors that might still cause uncertainty.\n\nIn an update, Chief Executive Officer Mr George Roach said, This subscription will provide working capital to support essential operational requirements at Zulu and also allow an initial start to the infrastructure and other associated requirements for the installation of the additional float cells, assisting in plant readiness for the limited test run that has been planned.\n\nLast week, the firm received a major confidence boost as its principal shareholder, Canmax Technologies, reaffirmed its commitment to completing the commissioning and optimisation of both the primary and secondary flotation plants, rather than pursuing ownership or management of Zulu.\n\nThe UK-based mining and exploration entity has faced challenges with the commissioning of the lithium flotation circuit at its Zulu plant in Insiza District, Matabeleland South, which has been inactive since July 2024.\n\nIt has missed several delivery deadlines and, at one point, issued a force majeure notice to Chinas Canmax Technologies, citing unforeseen operational hurdles encountered at the lithium plant in Fort Rixon.\n\nForce majeure, a French term, is a common clause in contracts that essentially frees both parties from liability or obligation when an extraordinary event or circumstance beyond the control of the parties occurs.\n\nThe plant was reported to be unable to produce sufficient spodumene to meet the quantities required by the off-take agreement with Canmax.\n\nCanmax wanted to terminate the agreement, a development that could have negatively affected the Zulu Lithium project.\n\nAfter extensive talks, both firms mended relations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/pm.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw Premier African Minerals Limited on Friday announced a £540,000 raise via a 2.7 billion new ordinary share subscription to provide working capital to support essential operational requirements. The firm states it is fundamentally important for it to continue supporting all essential operational requirements at both Premier and the Zulu Lithium and Tantalum […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        },
        {
            "title": "Government commends Bulawayo for leading the anti-smuggling campaign",
            "url": "https://www.chronicle.co.zw/government-commends-bulawayo-for-leading-the-anti-smuggling-campaign/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENTIAL Affairs and Devolution Permanent Secretary, Engineer Tafadzwa Muguti, has commended Bulawayo Metropolitan Province for effectively leading the anti-smuggling campaign.\n\nHe was speaking in the city on Thursday where met various stakeholders and conducted a tour of some manufacturing companies.\n\nI am happy that the anti-smuggling campaign in Bulawayo was the most successful in the country. It did way better than the capital itself. And we are seeing that more of the formal businesses are getting the right support from government, said Eng Muguti.\n\nVarious top of the range vehicles and an assortment of smuggled goods are impounded at the Container Depot Bulawayo (CONDEP) in Bulawayo.\n\nThe vast warehouse is packed with an assortment of goods ranging from stoves, refrigerators, diapers, alcoholic beverages, tinned foods and other goods.\n\nGoods can be held for 60 to 90 days under the Customs and Excise Act. Various disposal methods, including rummage sales and destruction, are used to clear warehouses.\n\nEng Muguti was in the Matabeleland region touring high impact projects that include Portland Cement (PPC) at Cement side in Bulawayo, Carousel Manufacturing, Treger Products and Blanket Mine in Gwanda.\n\nProvincial Affairs and Devolution departments are now expected to grow their provincial gross domestic product, which in turn will feed into the national budget.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/nnj.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENTIAL Affairs and Devolution Permanent Secretary, Engineer Tafadzwa Muguti, has commended Bulawayo Metropolitan Province for effectively leading the anti-smuggling campaign. He was speaking in the city on Thursday where met various stakeholders and conducted a tour of some manufacturing companies. “I am happy that the anti-smuggling campaign in Bulawayo was the most […]",
            "time": "18:08",
            "date": "24 Jan 2025"
        }
    ]
}