{
    "news": [
        {
            "title": "Silent supporters: How men are driving the Doek & Slay movement",
            "url": "https://www.chronicle.co.zw/silent-supporters-how-men-are-driving-the-doek-slay-movement/",
            "content": "Showbiz Reporter\n\nOrganisers of the popular Doek & Slay networking event for women have expressed gratitude to men, who have emerged as the biggest supporters by buying the majority of the events tickets.\n\nIn a Facebook post, the organisers encouraged attendees to appreciate those making the event possible for them.Its amazing to see that 80% of our Doek & Slay lifestyle ticket purchases so far are made by men who are thoughtfully buying tickets for their queens and sisters.We appreciate your role in helping these gentlemen understand the importance of this safe space for women.\n\nMore men have been supporting the movement, with male artistes like Jah Prayzah, Freeman, ExQ, and Enzo Ishall delivering electrifying performances and thrilling the ladies at Doek & Slay events held across the country.\n\nDoek & Slay is a vibrant community where women come together to connect, share good vibes, and uplift each other, with a strong focus on self-care, empowerment, and mutual support.\n\nFor a long time, women across Zimbabwe have yearned for such a space where they can unwind in a secure and inclusive environment, even bringing along young children when babysitters are unavailable.\n\nBeyond relaxation, the event has proven to be a powerful networking platform, helping women establish connections that positively impact their businesses and personal growth.\n\nThe first edition of Doek & Slay in 2024 will take place in Kadoma on March 30, followed by Mutare on April 6, Harare on April 13, and Gweru on April 27.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/9u8t6jjtgfifu.jpg",
            "description": "Showbiz Reporter Organisers of the popular Doek & Slay networking event for women have expressed gratitude to men, who have emerged as the biggest supporters by buying the majority of the event’s tickets. In a Facebook post, the organisers encouraged attendees to appreciate those making the event possible for them. “It’s amazing to see that […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "ZITF Company rolls out regional roadshows ahead of April trade expo",
            "url": "https://www.chronicle.co.zw/zitf-company-rolls-out-regional-roadshows-ahead-of-april-trade-expo/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nTHE Zimbabwe International Trade Fair (ZITF) Company will launch a series of regional roadshows starting Friday to mark the official countdown to the 65th edition of its annual exhibition in Bulawayo.This years annual edition will run from 21-26 April 2025 at the Zimbabwe International Exhibition Centre (ZIEC) in Bulawayo under the theme: Industrialisation: Crafting an Integrated Economic Landscape.\n\nThe 2025 event also celebrates ZITFs Blue Sapphire anniversary, marking a legacy of excellence in showcasing innovation and fostering business growth.\n\nThe ZITF roadshows will be held in three regional cities starting in Johannesburg, South Africa tomorrow (Friday), shift to Lusaka in Zambia on 5 March and wound up in Gaborone, Botswana on 14 March.ZITF Company board chairman, Mr Busisa Moyo, said the roadshows aim to raise awareness about the exhibition and other ZITF-hosted events.\n\nMr Busisa Moyo\n\nZimbabwe International Trade Fair Company (ZITF) is elated to announce the commencement of its ZITF 2025 Regional Engagement Meetings (regional roadshows), starting in Johannesburg, South Africa, on 28 February 2025, in conjunction with the Embassy of the Republic of Zimbabwe (Pretoria), he said.The roadshows mark the official countdown to the 65th edition of the Zimbabwe International Trade Fair (ZITF), which will take place from 21-26 April 2025 at the Zimbabwe International Exhibition Centre (ZIEC) in Bulawayo, Zimbabwe.\n\nMr Moyo further said the regional campaign will serve as a platform to connect businesses, industry leaders, and trade stakeholders across the region.These roadshows will connect organised business, industry original equipment manufacturers, suppliers of industrial equipment, professionals, buyers, distributors, and other regional business stakeholders, including the Zim-SA Business Chamber, South African Iron and Steel Institute, Nordic-South African Business Association, Randburg Chamber of Commerce and Industry, Southern African  German Chamber of Commerce and Industry NPC, and the broader African diaspora business community, he said.Through tailored presentations and interactive networking sessions, the roadshows will highlight the benefits of participating in ZITF events and explore regional collaboration opportunities.ZITF 2025 has already secured 371 exhibitors covering 44,502 square metres of exhibition space. So far, 13 countries have confirmed participation, including CanadaChina, European Union, Egypt, Japan, Malawi, Mozambique, Pakistan, South Africa, Tanzania, Turkey, United Kingdom and United States.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/111111111111.jpg",
            "description": "Nqobile Bhebhe nqobile.bhebhe@chronicle.co.zw THE Zimbabwe International Trade Fair (ZITF) Company will launch a series of regional roadshows starting Friday to mark the official countdown to the 65th edition of its annual exhibition in Bulawayo. This year’s annual edition will run from 21-26 April 2025 at the Zimbabwe International Exhibition Centre (ZIEC) in Bulawayo under the […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "Bulawayo to host Magitare Confluence as part of Creative Economy Week",
            "url": "https://www.chronicle.co.zw/bulawayo-to-host-magitare-confluence-as-part-of-creative-economy-week/",
            "content": "Mbulelo Mpofu[emailprotected]\n\nTHE British Councils regional arts director for Sub-Saharan Africa, Farai Ncube Tarwireyi has expressed her excitement for the upcoming Magitare Confluence, which will take place in Bulawayo on March 5 at the Oasis Creators Hub as part of the British Councils Creative Economy Week.I am indeed very excited about the upcoming Magitare Confluence in Bulawayo. This event represents a significant opportunity for creatives in the region to showcase their talents and engage with one another, fostering collaboration and innovation, Tarwireyi shared.\n\nThe British Council is the United Kingdoms international organisation for cultural relations and educational opportunities and the Magitare Confluence is designed to be a vibrant hub for dialogue and collaboration.\n\nTarwireyi believes that by providing a platform for creatives to connect and exchange ideas, the event will help navigate these turbulent times. We believe that by providing a platform for dialogue and creativity, we can help inspire a brighter future for the creative economy in Sub-Saharan Africa, she added.\n\nThe upcoming event is not just about showcasing talent; its also about sparking conversations that can lead to innovative solutions and partnerships.\n\nTarwireyi looks forward to the vibrant discussions and connections that will emerge from the Confluence.I look forward to the vibrant discussions and connections that will emerge from this event, she noted.\n\nThe Magitare Confluence is expected to attract a diverse group of participants, including artists, entrepreneurs, and thought leaders from various creative sectors.\n\nAs the creative industry continues to evolve, Tarwireyi and the British Council are dedicated to ensuring that artists have the resources and support they need to succeed.We aim to create sustainable pathways for creatives, ensuring that they can not only showcase their work but also build meaningful connections that lead to future opportunities, she explained.\n\nThe Magitare Confluence, as part of the British Councils Creative Economy Week, is a critical step in this direction. By empowering artistes and fostering collaboration, the initiative stands as a testament to the resilience of the creative sector in Sub-Saharan Africa.\n\n Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/52222222222.jpg",
            "description": "Mbulelo Mpofu mbulelo.smpofu@gmail.com THE British Council’s regional arts director for Sub-Saharan Africa, Farai Ncube Tarwireyi has expressed her excitement for the upcoming Magitare Confluence, which will take place in Bulawayo on March 5 at the Oasis Creators Hub as part of the British Council’s Creative Economy Week. “I am indeed very excited about the upcoming […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "Gene Hackman dead at 95: Iconic actor and wife Betsy Arakawa, 64, are found dead with their dog at…",
            "url": "https://www.chronicle.co.zw/gene-hackman-dead-at-95-iconic-actor-and-wife-betsy-arakawa-64-are-found-dead-with-their-dog-at/",
            "content": "Legendary Hollywood starGene Hackmanand his wife Betsy Arakawa have been found dead in their Santa Fe home.\n\nThe couple, who had been married since 1991, and their dog were found dead at 1.45pm Wednesday afternoon when police were dispatched to the home. No foul play is suspected but an exact cause of death is not yet determined, police said.\n\nIt is still unclear if authorities were conducting a welfare check or responding to a report of the deaths.\n\nSanta Fe sheriff Adan Mendoza added that officials are in the middle of a preliminary death investigation which is active and ongoing. Thetragic fate of their dog could be keyin the mystery surrounding their deaths and help detectives piece together the couples final moments.\n\nHackman, a two-timeOscarwinner with an estimated net worth of $80million, just turned 95 in late January.He became arecluse in the last 20 years of hislife, after retiring from acting in 2004. He packed up his things, leftLos Angelesfor a quiet life inNew Mexico and he never looked back.\n\nHackman shared three children with hisfirst wife Faye Maltese. He and Arakawa, a64-year-old classical pianist, had been married for the last three decades.\n\nSome initially thought that his shock decision to retire had to do with his marriage, but Hackman actually quit acting because of the severe stress he was under  which became too much to handle after he started to have issues with his heart.\n\nThe straw that broke the camels back was actually a stress test that I took in New York, he said in 2009, five years after his retirement. The doctor advised me that my heart wasnt in the kind of shape that I should be putting it under any stress.\n\nHackman underwent angioplasty, a procedure to widen narrowed or blocked arteries, due to congestive heart failure in 1990. He has alsobattling severe angina, a condition in which one has chest pain caused by reduced blood flow to the heart.\n\nThe former Marine appeared in more than 80 films, as well as on television and the stage during his lengthy career that started in the early 1960s.\n\nTributes have started pouring in for theHollywood legend with Star Trek starGeorge Takei hailing him asone of the true giants of the screenandfilmmaker Frances Ford Coppola added that he was great actor, inspiring and magnificent in his work and complexity. Hackmans fans added that they are devastated thatone of the all time great actors has sadly left the stage.\n\nLegendary Hollywood star Gene Hackman, pictured in the 1971 film The French Connection, and his wife Betsy Arakawa have been found dead in their Santa Fe home\n\nHackman is seen with his wife Betsy Arakawa (pictured, right) in March 2024. It was the first time in two decades that the couple, had been married since 1991, were seenout and about\n\nThe couple were found alongside their dog in their Santa Fe home (pictured) on Wednesday morning. No foul play is suspected\n\nA naturally private man, Hackman was labelled a recluse as he remained out of the public eye for years on end.\n\nFriends occasionally shared glimpses of his post-acting life, including social media shots of fishing expeditions  while paying tribute to his silver screen triumphs.He would also occasionally be spotted pedaling around Santa Fe on a bicycle.\n\nLast year, Hackman and Arakawa were seen out and about for the first time in two decades.\n\nThe actor was spotted holding onto his wifes arm for balance as the pair grabbed a bite at Pappadeauxs Seafood Kitchen in Santa Fe, New Mexico.\n\nBefore the dinner date, Hackman enjoyed a cup of coffee and some apple pie from a local Speedway store.\n\nThe couples outing marked the first time they were seen together in public for 21 years, with the last time being at the 2003 Golden Globe Awards, where he won the Cecil B. deMille award.\n\nIn an interview with Empire in 2020, the retired actor revealed he enjoyed watching DVDs that Arakawa rented. He said: We like simple stories that some of the little low-budget films manage to produce.\n\nFriday night is set aside for a Comedy Channel marathon, with particular attention paid to Eddie Izzard. The speed of thought is amazing.\n\nIve never got tired of work Gene Hackman on his love for acting.\n\nHackman met Arakawa, a classically trained pianist who grew up in Hawaii, when she was working part-time at a California gym in the mid-1980s. They soon moved in together, and by the end of the decade had bought their home in Santa Fe. The couple are pictured together at the Golden Globe Awards in 2003\n\nGene Hackman had three children with his first wife Faye Maltese. He and Maltese are pictured together in the 1980s\n\nGene Hackman and his three children son Christopher Allen and daughters Leslie Anne and Elizabeth Jean  at Sun Valley in1974.Whilst the two-time Oscar winner mostly tried to keep his family life private throughout his impressive career, he did often confess just how tough his offsprings lives were after he missed out on their earlier years due to work\n\nGene Hackman, is pictured with his wife Betsy, and daughters Leslie and Elizabeth at the 1996 premiere of his movie The Chamber\n\nHackman was among the finest actors of his generation, appearing as villains, heroes and antiheroes in dozens of dramas, comedies and action films from the 1960s until his retirement in the early 2000s.\n\nHe was a five-time Oscar nominee who won for The French Connection in 1972 and Unforgiven two decades later.\n\nHackman met Arakawa, a classically trained pianist who grew up in Hawaii, when she was working part-time at a California gym in the mid-1980s. They soon moved in together, and by the end of the decade had bought their home in Santa Fe.\n\nThe actor had three children from a previous marriage to FayeMaltese, whom he was married to from 1956 to 1986. Although he andArakawa did not share children together, the couple did adopt multiple dogs.\n\nThe actor was known to be fond of dogs, andrescued two stray German Shepherdsthat wandered into a stadium in Baltimore where they were filming scenes for The Replacements in 1999.\n\nHackman named one of the dogs Gene and the other Keanu, after his co-star Keanu Reeves. He later visited the animals in a shelter and adopted Gene after flying his own German Shepherds from New Mexico to see if they would get along.\n\nHackman, who had a few TV and theatre roles before breaking through with his performance in 1967s Bonnie And Clyde, was an early retiree, quitting acting in 2004.\n\nHe told Reuters in 2008: I havent held a press conference to announce retirement, but yes, Im not going to act any longer.\n\nIve been told not to say that over the last few years, in case some real wonderful part comes up, but I really dont want to do it any longer.\n\nHe also explained his passion for writing novels, saying I like the loneliness of it, actually. Its similar in some ways to acting, but its more private and I feel like I have more control over what Im trying to say and do.\n\nTheres always a compromise in acting and in film, you work with so many people and everyone has an opinion.  I dont know that I like it better than acting, its just different. I find it relaxing and comforting.\n\nLocals in Santa Fe have shared photos of Gene Hackman who moved there in the 1980s. Hackman is pictured in January 2018 after purchasing an e-bicycle from a shop in his local community. Despite his reclusive lifestyle, Hackman was occasionally spotted cycling around the Santa Fe area\n\nHackman (center) is pictured attending a local comedy show in 2022.The gig was also attended by former Saturday Night Live star Ana Gasteyer (right) and Sirius XM Radio host Seth Rudetsk (left)\n\nHackman was known to have adopted at least three German Shepherds. He is pictured with a dog he adopted in 1999\n\nCelebrities includingGeorge Takei, comedian Dara OBriain and Francis Ford Coppola were amongthe famous names leading the heartfelt tributesfor the star and his partner.\n\nTaking to X on Thursday morning,George, known for his role as Hikaru Sulu, helmsman of the USS Enterprise in Star Trek, posted a touching tribute to the late actor.\n\nHe shared: We have lost one of the true giants of the screen. Gene Hackman could play anyone, and you could feel a whole life behind it.He could be everyone and no one, a towering presence or an everyday Joe. Thats how powerful an actor he was. He will be missed, but his work will live on forever.\n\nFilmmaker Frances Ford Coppola, who worked with Gene in the 1974 film The Conversation, wrote on Threads: The loss of a great artist, always cause for both mourning and celebration: Gene Hackman a great actor, inspiring and magnificent in his work and complexity. I mourn his loss, and celebrate his existence and contribution.\n\nWhile Irish funnyman Dara penned: Ah, Gene Hackman. The finest screen actor ever, I think. Not a single duff performance, in a long, long career. And the best delivery ever of a single word: when he says Cigars! In Young Frankenstein.\n\nFilmmaker Frances Ford Coppola, who worked with Gene in the 1974 film The Conversation, wrote on Threads: The loss of a great artist, always cause for both mourning and celebration\n\nTaking to X on Thursday morning, Star Trek actor George Takei posted a touching tribute to the late actor\n\nStudioCanal UKs Instagram page shared images of Gene in their releases The Conversation and Narrow Margin as they paid tribute\n\nIrish funnyman Dara penned: Ah, Gene Hackman. The finest screen actor ever, I think. Not a single duff performance, in a long, long career\n\nHackmans heartbroken fans also shared a plethora of emotional tributes to the star on Thursday following the news of his Arakawas deaths.\n\nMovie fanswere quick to share their devastation at the loss of the film icon, taking to X to share their thoughts.\n\nThey penned: I loved Gene Hackman. He dressed up every movie he was in, and retired from acting only to become a fiction writer. What a life!\n\nSad news to see that legendary actor Gene Hackman has died gone but not forgotten.\n\nThe rasp, the twinkle, the charm, the cheek, the explosive menace, the vaulting pitch, the intelligence, the heartbreaking tenderness and vulnerability, the commanding presence, on and on, Gene Hackman was easily my favorite actor. RIP. Miss Teschmacher!\n\nHackman and Arakawas deaths remain under investigation, police have said.\n\nOn February 26 2025 at approximately 1.45pm, Santa Fe County Sheriffs deputies were dispatched to an address on Old Sunset Trail in Hyde Park where Gene Hackman, 95, and his wife Betsy Arakawa, 64, and a dog were found deceased, a statement said.\n\nFoul play is not suspected as a factor in those deaths at this time  however, exact cause of death has not been determined.\n\nThis is an active and ongoing investigation by the Santa Fe County Sheriffs Office.\n\nGene Hackman, seen here withEstelle Parsons in the 1967 film Bonnie and Clyde, was a two-time Oscar winner and had just turned 95 in late January\n\nHe played an astronaut in the 1969 film Marooned\n\nHackman also played Detective Jimmy Popeye Doyle in The French Connection in 1971\n\nHackman playedKibby Womack in 1975s Lucky Lady\n\nHe garnered praised for his role in Wes Andersons 2001 film The Royal Tenebaums\n\nBorn inCaliforniaon January 30, 1930, the actorleft school after a row with his baseball coach and, lying about his age, joined the US Marines aged 16 looking for adventure.\n\nFor the next four years, he served in post-war China and Japan as a field radio operator. Hisweakness for brawling got him into troubleto the extent that, after being promoted to corporal, he almost immediately lost his stripes.\n\nHe was discharged in 1952 after he was injured in a road accident.\n\nAfter moving back to California following his military service, he decided to pursue acting after briefly living in New York.\n\nAs a child, Hackman particularly enjoyed his trips to the cinema with his mother. After one of them, she told him shed love to see his face one day up on the big screen  tragically, she never did although their visits instilled in him a passion to act.\n\nHe and his father used to spend their Saturdays together until his father chose a Saturday to walk out on the family.The 13-year-old had had no idea it was coming.\n\nThat day, he drove by and waved at me and I knew from that wave that he wasnt coming back, said Hackman.That wave, it was like he was saying, OK, its all yours. Youre on your own, kiddo.\n\nHackman, who said he frequently exploited the early pain in his life in his acting, once wryly observed that dysfunctional families have sired a number of pretty good actors.\n\nHackman left school after a row with his baseball coach and, lying about his age, joined the US Marines aged 16 looking for adventure. Above: Hackman in the US Marine Corps (left); right as a schoolboy\n\nGene Hackman and his daughter Elizabeth Hackman are spotted at Rodeo Drive in Beverly Hills, California on March 24, 1979\n\nGene Hackman (right) and his son Christopher Allen Hackman attend the Fourth Annual Clint Eastwood Celebrity Tennis Tournament at the Beach and Tennis Club in Pebble Beach, California, on July 7, 1973\n\nGene Hackman (right) attends a screening of Class Action at the Plitt Theater, Century City, California, March 13, 1991 with his daughter Leslie Hackman (left)\n\nHackman began his acting career nearly 70 years ago, joining the Pasadena Playhouse in 1956, where he befriended fellow aspiring actor Dustin Hoffman.\n\nHe eventually moved to New York in 1963 and began performing in several Off-Broadway plays and smaller TV roles.\n\nThe thespian truly made his name in the 1970s, when he was nominated for an Oscar in the Best Supporting Actor category for the 1970 flick, I Never Sang For My Father.\n\nThe following year he officially became a leading man, winning the Academy Award for Best Actor for his performance as New York City Detective Jimmy Popeye Doyle in The French Connection.\n\nHe went on to have consistent work, including in disaster film The Poseidon Adventure (1972) and Francis Ford Coppolas The Conversation (1974) before landing the role of supervillain Lex Luthor in 1978s Superman: The Movie.\n\nIn the 1980s he starred in several films including Reds (1981), Under Fire (1983), Hoosiers (1986), No Way Out (1987) and Mississippi Burning (1988).\n\nThe 1990s brought him his second Oscar as he earned the Best Supporting Actor gong for his work as sadistic sheriff Little Bill Daggett alongside Clint Eastwood in 1992s Unforgiven.\n\nHe rounded out that decade by also starring in Narrow Margin (1990), Geronimo: An American Legend (1993), The Firm (1993), The Chamber (1996), Wyatt Earp (1994), The Quick And The Dead (1995), Crimson Tide (1995), Get Shorty (1995,) Absolute Power (1997), The Birdcage (1996) and Enemy Of The State (1998).\n\nHackman continued to be active in the early 2000s with roles in Behind Enemy Lines (2001), Heist (2001), Runaway Jury (2003), and even earned the Golden Globe for Best Actor  Musical or Comedy for 2001s The Royal Tenenbaums.\n\nHackman has not starred in a movie since 2004, when he played Monroe Eagle Cole in the political satire Welcome to Mooseport.\n\nGene Hackman and Betsy Arakawa married in 1991 after moving to their New Mexico home together in 1990. The pair are pictured together atthe Mission Hills Celebrity Sports Invitational, Rancho Mirage, California, November 29, 1991\n\nThe couple had a love for German Shepherds, at one point owning three after adopting one in 1999\n\nThere are several properties on the couples sprawling woodland compoundin Santa Fe, New Mexico. Property records indicate that oneis owned by Betsy Arkawa and the otheris owned by a family trust for Hackmans agent\n\nA deeply complicated man, Hackman was strangely squeamish about on-screen violence but loved a real-life scrap, according to Hoffman.\n\nHoffman recalled his friend once announcing I gotta go and disappearing off to a bar because he had to get in a fight.\n\nHe was still getting into fights in his seventies. In 2001, a 71-year-old Hackman started a fist fight with two men over a minor traffic accident in West Hollywood.\n\nHe brushed against me and I popped him, he recalled. Then the other guy jumped on me. We had this ugly wrestling match on the ground.\n\nThe police came  I got a couple of good shots in. The guy had me around the neck. Thats the ugly part. When youre down on the ground and youre nearly 72 years old.\n\nEven so, Hackman was hardly one to believe that placid, well-adjusted people necessarily made great actors.\n\nHis instinctive rebelliousness, he claimed in a rare 1994 interview, was seeded in a traumatic and unhappy childhood in which his violently disciplinarian father abandoned the family when he was 13 and his alcoholic mother eventually died in a house fire in 1962, reportedly passing out while holding a lit cigarette.\n\nHackman played Buck Barrow in Bonnie and Clyde\n\nPhilip DAntoni (left) and Gene Hackman, producer and star, respectively, of The French Connection, hold Oscars they won at the 44th movie Academy Awards\n\nHackman admitted that like so many successful actors always away filming he had seriously neglected his family.\n\nYou become very selfish as an actor. You spend so many years wanting desperately to be recognized as having the talent and then when youre starting to be offered these parts, its very tough to turn anything down, he said.Even though I had a family, I took jobs that would separate us for three or four months at a time.\n\nHackman met his first wife, Faye Maltese, in 1955  when Hackman was only 25 and nowhere near success. As reported by theNew York Times Magazinein 1989, he and the pretty and dark-haired secretary atRockefeller Center initially crossed paths at aY.M.C.A. dance in the Big Apple.\n\nTheir first few years as a young family were marked by struggle  the couple lived in a cold water walk up  meaning there is no hot water supply available,in the city.\n\nHisromance with his first partner Maltese, a bank clerk, was understood to be troubled due to his determined, but overwhelming, rise to fame.\n\nThe pair divorcedin 1986 after spending 30 years together and raising three children son Christopher Allen and daughters Leslie Anne and Elizabeth Jean.\n\nHe andArakawa, who was 32 years her husbands junior,reportedly began dating in the mid-1980s after meeting at a gym inCalifornia.\n\nArakawa, who is believed to have been born inHawaii, waspursuing a career in classical music at the time while working shifts in the gym.\n\nFive years later, he walked down the aisle with Arakawa.The pairsettled down in a two-bedroom house in Santa Fe.\n\nHackman later insisted that their relationship began after his divorce from Maltese, who he was married to from 1956 to 1986.\n\nDiscussing what he had in common with his character Harry Mackenzie, who leaves his wife for a barmaid in the 1985 film Twice in a Lifetime, he told the SouthFloridaSun-Sentinel: By the way, I did not leave my real-life wife for a younger woman.\n\nWe just drifted apart.We lost sight of each other. When you work in this business, marriage takes a great deal of work and love.\n\nGene Hackman in 1992 film Unforgiven, where he playedbrutal sheriff Little Bill Daggett\n\nGene Hackman acted alongside Dustin Hoffman in 2003 film Runaway Jury\n\nDustin Hoffman and Gene Hackman at the 1968 Academy Awards, where Hoffman was nominated for Best Actor in The Graduate and Hackman was nominated for Best Supporting Actor in Bonnie and Clyde\n\nHackman announced his retirement from acting in 2004, leaving Los Angeles for a quieter life in New Mexico  and resisting any overtures to return in front of the camera.\n\nHe told of how his decision was influenced by the strain he suffered when acting, as well as health issues concerning his heart. He told of receiving a health warning from a doctor, while saying in a statement at the time: The business for me is very stressful.\n\nHe revealed, during a CNN interview that year, that he was afraid of dying. Hackman said: I dont have a lot of fears, I have the normal fear of passing away.\n\nHackman had previouslyundergone surgery after facing problemswith his heart  having been rushed to the hospital with chest pain and needing to have a balloon catheter inserted to help open an artery that had dangerously narrowed.\n\nIn 2009 he opened up more, telling an interviewer that his doctor advised me that my heart wasnt in the kind of shape that I should be putting it under any stress.\n\nHe said: When Im actually on the set or on a stage, actually doing the work, I loved that process and I loved the creative process of trying to bring a character to life.\n\nAnd then, when youre actually shooting or performing, there is a kind of a feeling that comes over you, a confidence and kind of a wonderful, washed-over feeling of wellbeing, if you will, when its going well.\n\nWhereas, the business part of show business is kinda wicked. You jump from trying to be a sponge, if you will  in terms of input from other actors and the director and everything thats surrounding you.\n\nThe Oscar-award winning actor, pictured at the Academy Awards in 1993, actually quit acting because of the severe stress he was under, which became too much to handle after he started to have issues with his heart\n\nRaquel Welch, Gene Hackman and Cloris Leachman (holding her Best Supporting Actress Oscar) at the 44th Academy Awards in Hollywood April 17 1972\n\nGene Hackmans heartbroken fans shared a plethora of emotional tributes to the star on Thursday following the news of his and wife Betsy Arakawas deaths [pictured in 1983]\n\nIn 2011, he was asked by GQ if he would ever come out of retirement to do one more film, to which Hackman responded: If I could do it in my own house, maybe, without them disturbing anything and just one or two people.\n\nHis old friend Robert Duvall described him as a tormented guy, always into his own space, his own thing.\n\nHackman did not stay completely away from the industry, however, as he narrated two Marine Corps documentaries: The Unknown Flag Raiser of Iwo Jima (2016) and We, The Marines (2017).\n\nHe did, however, insist that he never thought of himself as a star  that was Warren Beatty, Robert Redford and Brad Pitt, he said.\n\nThe actor believed that celebrity was ruinous, observing: If you look at yourself as a star youve already lost something in the portrayal of any human beingYou need to remember youre not a movie star and that you shouldnt be too happy.\n\nVesuvius said hed rather just be remembered as a decent actor.\n\nSOURCE: daily mail\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/kllluitg.jpg",
            "description": "Legendary Hollywood star Gene Hackman and his wife Betsy Arakawa have been found dead in their Santa Fe home. The couple, who had been married since 1991, and their dog were found dead at 1.45pm Wednesday afternoon when police were dispatched to the home. No foul play is suspected but an exact cause of death […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "ZimParks yet to locate leopard spreading panic at St Peters Village: It could have been a Jackal- official says",
            "url": "https://www.chronicle.co.zw/zimparks-yet-to-locate-leopard-spreading-panic-at-st-peters-village-it-could-have-been-a-jackal-official-says/",
            "content": "Flora Fadzai Sibanda[emailprotected]ZIMPARKS spokesperson Mr Tinashe Farawo has said rangers are yet to finda leopard that was allegedly spotted at Peters Village, a peri-urban area located just beyond Old Pumula suburb in Bulawayo, spreading panic in the area.\n\nWe got the distress call in Bulawayo a few days back. Our reaction team managed to do an investigation and l can confirm that we have not seen any leopard traces. The only thing that the rangers have found are traces of a jackal, we think that is what everyone is talking about, he said.\n\nHe said the team is still on the ground doing further assessments.Villagers had earlier told the Chronicle that they were living in fear after sightings of a leopard and two cubs were reported on Monday morning.Messages urging vigilance have been circulating on social media, with a voice note alerting villagers to stay safe and avoid bushy areas.A Chronicle news crew visited the area and spoke to several villagers living near Robert Sinyoka Primary School, close to the bush where the leopard was reportedly sighted.Villagers said they suspect the leopard could have originated from a nearby bush inhabited by animals like jackals and baboons.ZimParks has warned villagers to remain vigilant and protect their livestock, as two families have already reported losses.St Peters is a peri-urban area with extensive grazing lands and forests that stretch for kilometres into the Nyamandlovu area.\n\nMore to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/08/Mr-Tinashe-Farawo.jpg",
            "description": "Flora Fadzai Sibanda florafadzaisibz@gmail.com ZIMPARKS spokesperson Mr Tinashe Farawo has said rangers are yet to find a leopard that was allegedly spotted at Peters Village, a peri-urban area located just beyond Old Pumula suburb in Bulawayo, spreading panic in the area. “We got the distress call in Bulawayo a few days back. Our reaction team […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "World Bank lauds Zim fiscal reforms, urges further policy strengthening",
            "url": "https://www.chronicle.co.zw/world-bank-lauds-zim-fiscal-reforms-urges-further-policy-strengthening/",
            "content": "Prosper Ndlovu[emailprotected]\n\nTHE World Bank has commended the Zimbabwean government for rolling out of key policy reforms aimed at restoring macro-economic stability and urged the Treasury to identify ways to strengthen this to move Zimbabwe towards a sustainable medium-term fiscal pathway.The suggestions are informed by the new Public Finance Review (PFR) paper titled: Anchoring Macroeconomic Stability through Fiscal Policy released by the World Bank this week, which considered the performance of Zimbabwes public finances between 2019 and 2023.It supports the Government of Zimbabwe in its fiscal consolidation efforts by identifying policy options to improve expenditure and revenue mobilization to create fiscal space, improve efficiency, and strengthen equity considerations.This is expected to help move Zimbabwe towards a more sustainable medium-term fiscal pathway, stabilize the macro-economic environment, and support sustainable economic growth and job creation.The PFR emphasizes the World Banks commitment to providing timely and responsive support to the Government of Zimbabwe and is a testament to our strong and ongoing partnership, World Bank country manager, Eneida Fernandes, said.This comprehensive analysis of public finance will guide our efforts to assist the Government in improving domestic revenue mobilization, enhancing efficiency, and ensuring pro-poor outcomes.The PFR recommends several measures to create fiscal space and return Zimbabwes fiscal accounts to a prudent trajectory.The report further highlights that stabilizing prices and eliminating exchange rate distortions can significantly and swiftly boost Government revenue. Enhancing price stability could help recover inflation-related tax losses promptly. Potential reforms to increase tax revenue efficiently and equitably include streamlining corporate tax incentives, strengthening mining, property and wealth taxation, aligning health excise taxes in line with international standards, and improving tax administration using digital technologies, said the bank.It also called for improvement in the efficiency of public spending ass essential for supporting fiscal consolidation and achieving long-term sustainable and inclusive growth.There is potential to improve the Governments allocative efficiency to improve value-for-money in areas such as health care and capital investments.Improvements in procurement systems, including the use of e-procurement, also present significant opportunities for efficiency savings, said the World Bank.Efficiency in public services administration is also key, as the Government of Zimbabwes jobs evaluation report suggests there are opportunities to streamline the civil service.The progressivity of expenditure policy can also be improved through more and better targeted spending on social protection. The operationalization of a national social registry could help improve targeting of Zimbabwes current social protection systems and help improve climate resilience.The PFR shows that fiscal policy can be a critical anchor for macro-economic stability that can ensure a credible and efficient national budget and assist a stable and competitive currency.Jointly, this would lead to higher growth, major poverty reduction, and a major step toward achieving Zimbabwes development objectives, said the Bank.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ghgggg.jpg",
            "description": "Prosper Ndlovu prosper.ndlovu@chronicle.co.zw THE World Bank has commended the Zimbabwean government for rolling out of key policy reforms aimed at restoring macro-economic stability and urged the Treasury to identify ways to strengthen this to move Zimbabwe towards a sustainable medium-term fiscal pathway. The suggestions are informed by the new Public Finance Review (PFR) paper titled: […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "Villagers in St Peters Village live in fear after leopard sighting",
            "url": "https://www.chronicle.co.zw/villagers-in-st-peters-village-live-in-fear-after-leopard-sighting/",
            "content": "Flora Fadzai Sibanda[emailprotected]VILLAGERS in St Peters Village, a peri-urban area located just beyond Old Pumula suburb in Bulawayo, are living in fear after sightings of a leopard and two cubs were reported on Monday morning.Messages urging vigilance have been circulating on social media, with a voice note alerting villagers to stay safe and avoid bushy areas.\n\nThe Zimbabwe Parks and Wildlife Management Authority (Zimparks) has since deployed a team of rangers to track down the big cat.A Chronicle news crew visited the area and spoke to several villagers living near Robert Sinyoka Primary School, close to the bush where the leopard was reportedly sighted.Villagers said they suspect the leopard could have originated from a nearby bush inhabited by animals like jackals and baboons.\n\nZimParks has warned villagers to remain vigilant and protect their livestock, as two families have already reported losses.St Peters is a peri-urban area with extensive grazing lands and forests that stretch for kilometres into the Nyamandlovu area.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/3333.jpg",
            "description": "Flora Fadzai Sibanda florafadzaisibz@gmail.com VILLAGERS in St Peters Village, a peri-urban area located just beyond Old Pumula suburb in Bulawayo, are living in fear after sightings of a leopard and two cubs were reported on Monday morning. Messages urging vigilance have been circulating on social media, with a voice note alerting villagers to stay safe […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "Watch: Black Diva strikes gold with Majaivana-inspired “Thilo Lilo” song",
            "url": "https://www.chronicle.co.zw/watch-black-diva-strikes-gold-with-majaivana-inspired-thilo-lilo-song/",
            "content": "Showbiz Reporter\n\nSouth Africa-based, Insiza-born versatile artist Leslie Black Diva Muleya has hit the right note with her latest track Thilo Lilo, inspired by the legendary Lovemore Majaivanas iconic song Uzakufa Kubi.\n\nhttps://youtube.com/shorts/Gd8PRukL1l4\n\nAccompanied by a high-quality music video now available on YouTube, the catchy song has been making waves since its release earlier this week. It has already surpassed 10 000 views, with fans praising both the production and Black Divas electrifying performance.The quality in this video is mad business! Diva, you carried yourself so well. We want this video to go viral, and MTV Base and Channel O should approve of it, one excited fan commented on YouTube.\n\nAnother added, On repeat since 25 February, and Im proud of it!\n\nA teaser of the track went viral recently on social media platforms and South Africa-based DJ Mapressa, a content creator, stumbled upon the video and was blown away by the talent. He shared it with his followers, requesting they search for the musician. After a few days, Black Diva was found.With her electrifying dance moves and captivating stage presence, Black Diva is proving to be an artiste to watch.\n\nHer passion for music began early, with her standing out as a leader in school choirs during both primary and high school. However, her journey wasnt without challenges.I always loved music, but I struggled with low self-esteem and feared rejection, she shared.My music journey truly began in 2022 when a friend encouraged me to pursue my talent. I started writing and recording songs, though my first track, Ama2000, was low-budget and low-quality, so I never released it.\n\nHer breakthrough came with Why, a Dancehall track sung in Shona to appeal to a broader audience. Since then, she has built a diverse catalog spanning Afro, Hip-Hop, Dancehall, and Amapiano. Her notable releases include Why, Badgyal, Ngilombuzo (2023), Kamuendero Kawakazoita, Ndozvandinomudira, Moses, and the hit Mntanami (2024).\n\nNow, with Thilo Lilo, she continues to solidify her place in the music industry. The video, released on Sunday, is already a fan favourite, with many hoping it will be featured on international music channels.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/aaaa-1.jpg",
            "description": "Showbiz Reporter South Africa-based, Insiza-born versatile artist Leslie “Black Diva” Muleya has hit the right note with her latest track Thilo Lilo, inspired by the legendary Lovemore Majaivana’s iconic song Uzakufa Kubi.   https://youtube.com/shorts/Gd8PRukL1l4 Accompanied by a high-quality music video now available on YouTube, the catchy song has been making waves since its release earlier […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "Beauty with purpose: Miss Universe Zimbabwe to launch charity foundation, fashion label",
            "url": "https://www.chronicle.co.zw/beauty-with-purpose-miss-universe-zimbabwe-to-launch-charity-foundation-fashion-label2/",
            "content": "Melissa Mpofu[emailprotected]\n\nReigning Miss Universe Zimbabwe, Sakhile Dube, is set to launch her charity foundation, The Zibusiso Foundation, and fashion brand, Zie The Label, in Harare today.\n\nSpeaking during an interview on ZTNs Morning Rush breakfast show, Dube, who made the top 30 at the Miss Universe competition in Mexico last year, shared that her reign has been dedicated to making a difference.\n\nDube revealed that her foundation aims to empower underpriviledged children in Zimbabwe through educational opportunities and vocational skills training.My focus has been on The Zibusiso Foundation, which Im officially launching today. The foundation is dedicated to empowering vulnerable children by providing access to education and vocational skills development, she said.\n\nOne of her key initiatives is a beadwork project in Mbare, Harare, which she hopes to expand.I believe every child deserves the right to education, and this project is one of the ways Im working towards that, she added.\n\nAlongside her foundation, Dube is also launching Zie The Label, a fashion clothing and styling brand.This is a dream come true for me. Ive always been passionate about fashion, and bringing this brand to life is incredibly exciting, she said.\n\nLooking back on her time as Miss Universe Zimbabwe, Dube described it as a life-changing experience.Ive met amazing people, had incredible experiences, and this journey has shaped me in so many ways. Im truly grateful for this opportunity.\n\nShe also reflected on her time at the Miss Universe competition in Mexico, where she received overwhelming support from Zimbabweans.Going to Miss Universe, I wasnt just representing myself  I was representing Zimbabwe. Seeing our country recognised on such a global stage made me incredibly proud. I believe my participation paved the way for the next queen to build on our progress, she said.\n\nDube stressed the importance of giving back and using ones platform for good.Ive learnt that theres power in giving. Helping others not only changes their lives but also nourishes your own spirit. Being a role model has taught me so much about myself and how to live with others, she said.\n\nTo young women pursuing their dreams, she had this to say:Your background doesnt define your potential. What matters is what you do to achieve your goals. Keep pushing forward and surround yourself with positive people who inspire you.\n\nWith her foundation and fashion brand set to launch, Sakhile Dubes legacy is only just beginning.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/eeeee.jpg",
            "description": "Melissa Mpofu mellisa.mpofu@chronicle.co.zw Reigning Miss Universe Zimbabwe, Sakhile Dube, is set to launch her charity foundation, The Zibusiso Foundation, and fashion brand, Zie The Label, in Harare today. Speaking during an interview on ZTN’s Morning Rush breakfast show, Dube, who made the top 30 at the Miss Universe competition in Mexico last year, shared that […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        },
        {
            "title": "Zimbabwe Online Agricultural College Rebrands to Zimbabwe Agricultural College (ZIACO)",
            "url": "https://www.chronicle.co.zw/zimbabwe-online-agricultural-college-rebrands-to-zimbabwe-agricultural-college-ziaco/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nTHE Zimbabwe Online Agricultural College (ZOAC) has rebranded to Zimbabwe Agricultural College (ZIACO) to better address gaps in agricultural production and management within farming communities.\n\nZIACO is committed to delivering high-quality agricultural education through online platforms.\n\nThe Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development is pleased to inform members of the public that Zimbabwe Online Agricultural College (ZOAC) has officially rebranded to Zimbabwe Agricultural College (ZIACO). This change reflects our commitment to expanding and enhancing our educational services to better serve the agricultural community in Zimbabwe, said the ministry.\n\nThe ministry further outlined the institutions mission:\n\nOur mission has always been to empower farmers, agricultural entrepreneurs, and farm personnel with the essential skills and knowledge needed to enhance productivity, profitability, and national food security.\n\nModules covered under the Executive Certificate in Agricultural Business Management include Communication and ICT Applications, Farm Production Potential, Strategic Farm Planning and Decision-Making, Strategic Agricultural Marketing, Labour Productivity, and Farm Performance Monitoring and Evaluation.\n\nUnder the General Certificate in Agricultural Business Management, students undergo training in Farm Power, Farm Planning and Management, Farm Mechanisation and Structures, Agricultural Marketing, Irrigation Management, Animal Production, Beef Cattle and Dairy Production, Apiculture and Aquaculture, Poultry Production, and Small Stock Production.\n\nAt present, the country has eight agricultural training institutions: Esigodini Agricultural College (Matabeleland South), Chibero and Gwebi Agricultural Colleges (Mashonaland West), Mlezu and Rio Tinto Agricultural Colleges (Midlands), Mazowe Veterinary College (Mashonaland Central), Shamva Agricultural College, and Kushinga-Phikelela (Mashonaland East).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Untitled-11-1.jpg",
            "description": "Nqobile Bhebhe nqobile.bhebhe@chronicle.co.zw THE Zimbabwe Online Agricultural College (ZOAC) has rebranded to Zimbabwe Agricultural College (ZIACO) to better address gaps in agricultural production and management within farming communities. ZIACO is committed to delivering high-quality agricultural education through online platforms. “The Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development is pleased to inform members of […]",
            "time": "21:07",
            "date": "27 Feb 2025"
        }
    ]
}