{
    "news": [
        {
            "title": "President condemns M23 rebels attack in DRC",
            "url": "https://www.chronicle.co.zw/president-condemns-m23-rebels-attack-in-drc/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa, who is also chairman of the Southern African Development Community (SADC), has strongly condemned the cowardly attacks on United Nations and SADC peacekeepers by M23 armed rebels in the Democratic Republic of Congo.\n\nRecent hostilities in the region have killed thousands, with millions fleeing their homes.In a statement yesterday, President Mnangagwa said the regional bloc will assume its full responsibility and take action to address the deteriorating security and humanitarian situation in Eastern DRC.\n\nDemocratic Republic of Congo flag\n\nThose responsible for the situation should be held accountable, he said.The Chairman of SADC, His Excellency President Emmerson Dambudzo Mnangagwa expresses grave concern on the deteriorating security and humanitarian situation in the Eastern DRC occasioned by the offensive operations of the M23 rebels.\n\nThe Chairman condemns, unreservedly, the cowardly attacks on the UN and SADC peacekeepers that have resulted in some of them paying the ultimate sacrifice for the cause of peace in the Eastern DRC, reads part of the statement.President Mnangagwa has also conveyed his condolences to the victims.\n\nThe Chairman of SADC presents his condolences to the families of the deceased peace keepers and wishes those injured, a quick recovery, reads the statement.\n\nPresident Mnangagwa\n\nBoth SADC and the African Union have issued statements denouncing the aggression by the rebel group.In a statement at the weekend, the SADC Secretariat expressed concern at the recent attack on the SADC Force, the SAMIDRC, by the M23 armed group.\n\nSADC unequivocally condemns this act of aggression by the M23 operating in the Eastern DRC, such actions undermine the sovereignty, territorial integrity and peace and security of the DRC and the SADC region, reads the statement.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ERYRFGDFGLG.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa, who is also chairman of the Southern African Development Community (SADC), has strongly condemned the cowardly attacks on United Nations and SADC peacekeepers by M23 armed rebels in the Democratic Republic of Congo. Recent hostilities in the region have killed thousands, with millions fleeing their homes. In a statement yesterday, […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "WATCH: Zimbabwe’s bold curriculum makeover… Vocational training, arts added to A-level subjects",
            "url": "https://www.chronicle.co.zw/watch-zimbabwes-bold-curriculum-makeover-vocational-training-arts-added-to-a-level-subjects/",
            "content": "Nqobile Tshili,[emailprotected]\n\nZIMBABWE is charting new frontiers in its skills development drive through incorporating vocational training and creative art disciplines at high school level to equip learners with hands-on experience and practical skills essential for todays job market.\n\nThe broadening of the curriculum is a departure from the previously academic biased, positioning learners for global competencies and entrepreneurial self-sustenance through various trades and professions.\n\nThe combination of academic subjects with vocational and artistic disciplines promotes a well-rounded education, buttressing the ideals of the new Heritate-Based Curriculum.\n\nPraticalized Heritage based education-St Columbus High School\n\nThrough massive empowerment of learners at a tender age, Zimbabwe will be able to develop a broad range of skills for the modern economy, while harnessing technical abilities essential for personal growth and global development contribution.\n\nThe model creates favourable ground for enhanced partnerships with local industries, and arts organisations to further enhance impact with multiple economic benefits.\n\nAs Lower Six classes resumed across the country yesterday, schools have begun pioneering the new disciplines that include wood or metal technology (previously known as woodwork or metalwork), to be examined at Advanced Level for the first time. Advanced Level now has five segments  sciences, humanities, commercials, visual and performing arts and technical and vocational education and training.\n\nSciences combination covers Mathematics, Pure Mathematics, Additional Mathematics, Statistics, Physics, Chemistry, Biology, Software Engineering, Computer Science, Agriculture, Geography, Agriculture Engineering, Crop Science, Animal Science, Horticulture and Sports Science. From these, learners are recommended to take three.\n\nSt Columbas Lower Sixth pupil Sandie Madzinga attempts a car engine maintenance challenge on her first day at the school yesterday (Picture by Nkosizile Ndlovu)\n\nVisual and performing arts include Film, Theatre Arts, Art, Sport Management, Musical Arts, Physical Education and Mass Displays, as well as Dance while humanities will include Heritage Studies, Family and Religious Studies, Indigenous Languages, Foreign Languages, Literature in English, History, Sociology, Economic History, Guidance and Counselling, Life Skills Education and Communication Skills.\n\nThe department of economics will teach Economics, Accounting, Business Enterprise Skills and Business Studies while the Technical and Vocational Education and Training department will cover Wood Technology and Design, Metal Technology and Design, Food Technology and Design, Building Technology and Design, Technical Graphics and Design, Textile Technology and Design, Home Management and Design and Design and Technology.\n\nMr Taungana Ndoro\n\nDirector for communications and advocacy in the Ministry of Primary and Secondary Education, Mr Taungana Ndoro, said the expansion of learning areas at secondary schools will yield positive impact for the country.\n\nThe introduction of vocational technologies and performing arts at the advanced level within the Heritage-Based Curriculum is a significant development for several reasons, he said.\n\nBy incorporating vocational training, learners gain hands-on experience and practical skills that are essential in todays job market. This prepares them not just academically but also equips them with the competencies needed for various trades and professions, said Mr Ndoro.\n\nThe inclusion of visual and performing arts fosters creativity, critical thinking and self-expression, which are vital in numerous fields, including arts, media and design.\n\nAt a time when the formal job market is constrained, hopes are high that the new model ensure that graduates are not only employable but can create their own employment.\n\nWith vocational training, learners are not only prepared for employment but also empowered to start their own businesses, fostering entrepreneurship and innovation, said Mr Ndoro.\n\nThe Heritage-Based Curriculum emphasises local culture and traditions, ensuring that students appreciate and understand their identity. This connection to heritage can enhance pride in ones culture and encourage learners to contribute positively to their communities.\n\nThe combination of academic subjects with vocational and artistic disciplines promotes a well-rounded education. Students develop a broad range of skills, from technical abilities to creative talents, which is essential for personal growth and societal contribution.\n\nIn this journey, Government expects to partner with local players to ensure successful implementation.Continued partnerships with local industries and arts organisations will further enhance these programmes, ensuring they remain relevant and impactful.\n\nOngoing training for educators in these new areas will also be essential for successful implementation, said Mr Ndoro.St Columbas High School in Bulawayo has already hit the ground running with its strong practical subjects programmes at Ordinary Level.\n\nThe school head, Reverend Canon Albert Ncube, said the new curriculum was crucial as it prepares learners for post school life.At St Columbas we are already riding on the vocational education with a viable technical department, which is now escalated to A-level, he said.\n\nWe are now combining vocational education with our Advanced Level. We are now offering the technical subjects at A-level, which were traditionally taught at O-level, said Rev Ncube.\n\nThis means we can now channel out learners with advanced skills to participate in the industry. We have wood technology and design, metal technology and design, food technology and design and other vocational training courses, which were done under Higher Education Examination Council, which include machine technology engineering. We also have computer technology at that level and all these courses are blending well.\n\nHe said in terms of visual and performing arts, the school has engaged the ministry to provide teachers for those subjects. Government has already hinted on plans to employ about 8 000 teachers countrywide.Rev Ncube said a whole of a society approach is needed for the heritage based curriculum to be effective.\n\nThe new curriculum is a continuation of the hands -on education system. Our children are becoming more relevant, it is no longer about academic prowess but productivity, it is about engaging with the industrial world, he said.\n\nNow they are more relevant. Heritage-based curriculum taps on their own heritage and belonging, they belong to this country and this community and are now information, which is available within their vicinity to develop their career pathways, said Rev Ncube.\n\nChildren these days need more support from parents more than what is happening in schools. Parents need to embrace the new curriculum, as a society and a nation we need these changes. This curriculum links well with Education 5.0, it is more on production and delivering.\n\nLabour expert,Mr Davis Ndumiso Sibanda said the reviewed curriculum was a step in the right direction as employers have moved from seeking for qualifications but skills.\n\nIt was long overdue to have a skill based curriculum. If you look at countries such as India and China, they have approached education from a skills-based education approach, he said.\n\nChildren in those countries are learning skills from a junior school. Employers worldwide are no longer looking for qualifications but what skills individuals possess for one to be considered for employment, said Mr Sibanda.\n\nThe new thrust is expected to organise the arts sector, which at the moment is unstructured and needs formalisation, Mr Baya added. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Praticalized-Heritage-based-education-St-Columbus-High-School-5.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw ZIMBABWE is charting new frontiers in its skills development drive through incorporating vocational training and creative art disciplines at high school level to equip learners with hands-on experience and practical skills essential for today’s job market. The broadening of the curriculum is a departure from the previously academic biased, positioning learners for […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "Revolutionising finance platform: Zimbabwe turns page in financial inclusion, empowering the unbanked and underbanked through mobile money",
            "url": "https://www.chronicle.co.zw/revolutionising-finance-platform-zimbabwe-turns-page-in-financial-inclusion-empowering-the-unbanked-and-underbanked-through-mobile-money/",
            "content": "Prosper Ndlovu\n\nTHE profound influence of the digital financial services revolution is increasingly sweeping across Africas economic landscape, thanks to the growing digital investments and adoption of technology, which brings on board millions of people who now rely on mobile money accounts to conduct different transactions.\n\n1Money transfer Agent\n\nFinancial economists, with research backing, concur that globally, policy makers and business enterprises are increasingly embracing financial inclusion strategies to foster inclusive economic growth and social development.\n\nLocally, the Reserve Bank of Zimbabwe (RBZ), as the custodian of the National Financial Inclusion Strategy (NFIS), has prioritised digital transformation as a critical pillar in the countrys economic transformation agenda.\n\nThe strategy provides a beacon of hope for achieving universal financial inclusion where innovative technological solutions and strategic partnerships play a key role in breaking down historic barriers that used to exclude the majority from the formal financial system.\n\nRiding on expanded Internet connectivity and mobile phone subscription, Zimbabwe has recently recorded a jump in mobile money products as different players seek a share of the previously untapped business opportunity.\n\nThe mobile money drive involves key players such as EcoCash, One Money, InnBucks, Old Mutuals Omari, MyCash, TeleCash, GetCash, PayServe, ZimSwitch, Zipit, local banking institutions, as well as international payment players such as Visa and MasterCard.\n\nThrough online money platforms, ordinary people, including those in remote rural areas with no physical bank presence, are now able to send and receive money, pay bills and access other financial services with just a few clicks on their mobile devices.\n\nFinancial Inclusion, according to RBZ, is a key enabler to achieving Sustainable Development Goals (SDGs), which are a universal call to action to end poverty, protect the planet and ensure that all people enjoy peace and prosperity by 2030.\n\nDoug Tait-Knight\n\nTo reflect more on these breakthroughs,Chroniclenews editor, Prosper Ndlovu, (PN) conducted an in-depth interview with Mr Doug Tait-Knight, (DTK), chief executive officer for Mukuru Zimbabwe Financial Services who unpacked his organisations transformative journey and how it has embraced technology to enhance financial inclusion in Zimbabwe and across Africa. Below is the conversation.\n\nPN: We note the recent bold steps being taken by Mukuru, previously known for its remittance services only but has now launched a mobile money wallet shortly after getting the Deposit Taking-Micro-Finance Licence. What is driving Mukuru to break this new ground?\n\nDTK:This is a very exciting time for us, we have been awarded deposit taking institution finance licence. Its not a small thing for us and we take this very seriously. As you mentioned, we come from a remittance background, and we have connected recipients for 20 years now. We have built up a lot of customer base and earned trust by delivering efficient services.\n\nWith that, we have a logical next step to invest further in this opportunity and deliver other services that can solve problems, add value, increase efficiency for customers across Zimbabwe and across our networks.\n\nWe already have wallet services outside of Zimbabwe. So, we are not new to the game but it is very new and exciting for us to be in Zimbabwe. We want to have 24/7 availability and assurance for our customers. Rather than spending money going to a booth, you can easily receive your money into your wallet and you can transact, buy airtime, buy electricity, or pay for DSTV, send to someone locally, or send internationally at reasonable rates.\n\nPN: This is really exciting because in the past, people would look to get cash and queue for hours. Would they get the same going forward?\n\nDTK:Yes, if you want it, cash will always be available. Sign up is very easy to do, thats a five minute process and you just need your identity card. If you are receiving funds internationally, you can withdraw those funds at your convenience for no additional cost. Rather than queuing and getting all of your remittance and holding cash, which carries risk with it. Instead, you can withdraw what you need, save the rest or transact. I think that the offering is a lot more convenient than just the one option.\n\nPN: Looking at this blended business model you have adopted, how do you see these interventions impacting on your local and regional financial footprint in the long run?\n\nDTK:I think that our unique position is that we have a very broad customer base and we have worked extremely hard over the years to win and keep their trust. So, this is not going to change, we always want to be able to deliver products that are on demand.\n\nI think that another big differentiator is that we have invested heavily in our network and presence, especially in rural settings. So, we want to be able to provide convenient service in any urban or rural setting and I think there is a larger opportunity where the rural areas might be more cash based. We want to further invest in our existing networks and get out there on this financial inclusion promise.\n\nOur current network is about 60 percent urban, 40 percent rural and we want to increase that so that we can cater to as much the market as we can. Obviously, we compete with the informal sector locally and globally, and we have to provide a service that is cost effective and as trustworthy and secure as it might be, and I think we have done a good job in convincing people of our value proposition and we are going to continue to do that.\n\nPN: Given the broader client base, how does your business model segment cater for different customer needs including the informal sector, which is dominated by mainly ordinary people, while catering for big entities at the same time?\n\nDTK:Im glad you brought that up. We understand very well how to provide services at an individual level and over the years, we have been building out additional products and our deposit taking micro-finance-licence will enable us to increase that product offering. We presently have an enterprise product and we have agricultural institutions, we provide services to United Nations institutions and international NGOs sector to manage cash distribution and stipends.\n\nWe want to amplify that offering by providing solutions in remote areas for the farming context and payroll if necessary. So, I think thats a very exciting area we have been working on for a couple of years and this really enables us to amplify that.\n\nPN: With many players in the mobile money arena now, what is your comment on the competition factor, as well as the job impact of your business model or opportunities for ordinary people?\n\nDTK:I think this is not going to be a winner takes it allscenario. There are reports of various industries that are developing their areas of economy, we have got pretty robust main contributors to GDP. We can see that Harare is busy, the situation 10 years ago was not the same as today and there are engines that are driving this and I think we under-estimate the effort exertedto manage these logistics but we can simplify that I do not think this is a zero-some game but we are going to add value without negatively impacting anyone. Im hopeful this transition has a positive impact in terms of lifting this cash management out of the informal sector.\n\nPN: What would you consider as risk factors in this line of business, as well as opportunities? Are there any specific issues that maybe you think need to be fine-tuned that are a threat or risk to the business?\n\nDTK:Thats a difficult question, particularly in the local context. It is quite hard to claim on crystal wall into the future. But obviously, we have to manage risk when it comes to dealing with cash as all businesses do. So, we work with various partners, and the banking sector and we are hoping to form partnerships and we will be the ones mitigating the risk. I think that the more we are trusted, the more the people will adopt a digital offering, which very much reduces risk. We have seen the risk profile in the country change over the last five years and so, with additional growth also comes additional risks. But I think those risks are better managed in a digital world rather than in a cash scenario.\n\nPN: Southern Africa and African leaders are passionate about the issue of regional integration. What role does Mukuru and other financial services business play towards realising this regional integrated economy goal?\n\nDTK:We have spoken quite a lot I think in the past about bridging borders and something interesting that we need to start talking more about is our offering to send from Zimbabwe and that offering is competitive. From that point, I will say we are connecting the dots from our own operated networks in South Africa, Lesotho, Eswatini, Mozambique, Zambia, Botswana and Malawi.\n\nYou can see the picture that I am building as we go through the stepping stones going north and that synergy of different networks and the ability to provide service across these areas is going to be very important for us. So, we are very excited about the network effects of our platform being leveraged over different territories.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Money-transfer-Agent.jpg",
            "description": "Prosper Ndlovu  THE profound influence of the digital financial services revolution is increasingly sweeping across Africa’s economic landscape, thanks to the growing digital investments and adoption of technology, which brings on board millions of people who now rely on mobile money accounts to conduct different transactions. Financial economists, with research backing, concur that globally, policy […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "Vuyo Brown kicks off  2025 with uplifting single",
            "url": "https://www.chronicle.co.zw/vuyo-brown-kicks-off-2025-with-uplifting-single/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nAward-winning Zimbabwean singer and songwriter, Vuyo Brown, is on a mission, setting 2025 as the year to release more projects in an effort to stay connected with her growing fan base.\n\nLast Friday, she kicked off the year with the release of a heartfelt and uplifting single titled Yehlisa. Produced by Stones Moyo Beats, Yehlisa seamlessly blends Vuyo Browns signature soulful melodies with profound messaging, resulting in a timeless track poised to resonate with listeners both in Zimbabwe and beyond.\n\nSpeaking about the song, Vuyo Brown said it celebrates the joy of being in Gods presence.\n\nVuyo Brown\n\nThe song highlights the happiness, incomparable love and life that come from dwelling in Gods presence. Gods love and being in His presence just make me happy. Its a love like no other. Yehlisa is a capture of that beautiful moment, she said.\n\nShe added: The song showcases my growth as a multi-genre artiste, blending contemporary sounds with an authentic African essence. This release marks the beginning of an exciting year for me as I continue to cement my place as one of Zimbabwes beacons of hope and encouragement in music.\n\nYehlisa follows her 2024 EP, Piece, which featured tracks such as Iza and Ndikuxolele. The latter has been well-received regionally, earning praise for its relatable lyrics and emotive delivery.\n\nBorn in Bulawayo, Vuyo Brown is celebrated as one of Zimbabwes leading Contemporary Christian artistes.\n\nKnown for her powerful voice, meaningful lyrics and ability to craft music that uplifts and inspires, she has built an impressive discography since her debut in 2016.\n\nTracks like Thule Wazi, Imvana and Vuyani have cemented her reputation as a dynamic and boundary-pushing multi-genre artiste.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/swdeqwe.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Award-winning Zimbabwean singer and songwriter, Vuyo Brown, is on a mission, setting 2025 as the year to release more projects in an effort to stay connected with her growing fan base. Last Friday, she kicked off the year with the release of a heartfelt and uplifting single titled Yehlisa. Produced by Stones Moyo […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "Premiership  fixtures out . . . await Zifa confirmation on Southern Region slot",
            "url": "https://www.chronicle.co.zw/premiership-fixtures-out-await-zifa-confirmation-on-southern-region-slot/",
            "content": "Innocent Kurira,[emailprotected]\n\nTHE Premier Soccer League (PSL) is still awaiting confirmation from Zifa on which team will fill the Southern Region slot in the top-flight league following the strategic partnership between ZPC Hwange, which won the regions ticket, and MWOS, who will now take over the slot.\n\nHighlanders who kick off their campaign with the mystery team will be relieved to know soon who their opponents are going to be.\n\nPSL communications, Kudzai Bare, spoke to Zimpapers Sports Hub after the release of the 2025 fixture and said they expect the confirmation soon.\n\nWe are still waiting for confirmation from Zifa on the team that will fill that slot, which is why, on the fixtures, you will realise that we just went for Southern Region. We expect to get the confirmation from Zifa soon, said Bare.\n\nPSL released the fixtures for the 2025 season, though the commencement dates are yet to be announced.\n\nThe Castle Challenge Cup between 2024 league champions Simba Bhora and Chibuku Super Cup winners Dynamos will be played at Rufaro Stadium on February 22, leading up to the start of the championship.\n\nThe biggest match on the local football calendar, between giants Highlanders and Dynamos, is set for Week 14 in Harare, with the return leg scheduled for week 31.\n\nThe first Battle of the Cities between Highlanders and CAPS United will take place early, on Week Six, while the Harare Derby between Dynamos and CAPS United will follow on Week 12.\n\nHighlanders will begin their season away to newly promoted MWOS, who acquired ZPC Hwanges PSL status.\n\nDynamos will host ZPC Kariba, while defending champions Simba Bhora face a tricky opener at home to FC Platinum.\n\nNewly promoted Scottland will host Triangle United, while Chicken Inn will entertain Bikita Minerals. Prince Matores Kwekwe United side will face Ngezi Platinum Stars at home, and the opening week will conclude with Herentals hosting TelOne. CAPS United will begin their campaign away to Greenfuel, while Manica Diamonds will play host to Yadah.\n\nIn the final week, the headline fixture will be a Bulawayo derby between Highlanders and Chicken Inn, while Dynamos will face FC Platinum in the capital.\n\nTelOne will play host to Scottland, and Greenfuel will play Triangle United. Kwekwe United will conclude the season at home to CAPS United, while Ngezi Platinum will visit MWOS.\n\nManica Diamonds will be home to Bikita Minerals, and Simba Bhora will face Yadah at home.\n\nHerentals will entertain ZPC Kariba.\n\nCastle Lager Premier Soccer League Match Day One fixtures\n\nSimba Bhora v FC Platinum, Dynamos v ZPC Kariba, Manica Diamonds v Yadah, Southern Region v Highlanders, Chicken Inn v Bikita Minerals, Kwekwe United v Ngezi Platinum, Greenfuel v Caps United, Scottland v Triangle, Herentals College v TelOne.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fdvgdef.jpg",
            "description": "Innocent Kurira,  innocent.kurira@chronicle.co.zw THE Premier Soccer League (PSL) is still awaiting confirmation from Zifa on which team will fill the Southern Region slot in the top-flight league following the strategic partnership between ZPC Hwange, which won the region’s ticket, and MWOS, who will now take over the slot. Highlanders who kick off their campaign with […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "COMMENT: Government committed to reviving Bulawayo’s industrial sector",
            "url": "https://www.chronicle.co.zw/comment-government-committed-to-reviving-bulawayos-industrial-sector/",
            "content": "THE retooling drive by companies in Bulawayo is a commendable initiative that aligns well with Zimbabwes Vision 2030, which aims to transform the country into an upper-middle-income economy. This retooling effort is particularly significant for Bulawayo, historically known as Zimbabwes industrial hub, which faced severe de-industrialisation over the past decades.\n\nBulawayos manufacturing sector is witnessing a remarkable revival, fuelled by significant capital investments from prominent companies like Treger Group, Edgars Stores Carousel Manufacturing, Arenel, Datlabs and Innscor Africa Limited.\n\nWhile the Ministry of Industry and Commerces allocation of ZWG509 million for implementation of the Zimbabwe Industrial Reconstruction and Growth Plan (2024-2025) will further enhance re-industrialisation programmes, the Confederation of Zimbabwe Industries (CZI) has proposed a US$69,5 million retooling loan for 17 manufacturing firms in the Matabeleland region. This funding is aimed at mechanising and expanding businesses with bankable brownfield projects, which are crucial for reviving the industrial sector.\n\nThe Second Republic under President Mnangagwa has implemented several ease-of-doing-business policies to attract investment and support industrial growth. The Government has also facilitated financing windows and policy support to help Bulawayo regain its status as an industrial hub.\n\nAs we reported yesterday, Treger Group has invested US$4,5 million in modernising its production plants. Through its various divisions, Treger Group has become the largest manufacturer of household, industrial and hardware appliances in Africa. The group is a leading producer of window frames, door frames, wheelbarrows, geysers, kitchen furniture, and painted and galvanised hardware in the building and allied industries.\n\nCarousel Manufacturing, another significant player, has increased its production units to 2500 daily, up from less than 200 units a few years ago, following a US$1 million capital investment. Upgrading the laundry machine with an estimated cost of US$260000, and the cutting room solution at US$250000 are some of the projects the company is working on.\n\nPresident Mnangagwas commissioning of the new Bakers Inn factory in the Belmont industrial area last year, where Innscor Group invested nearly US$30 million, also underscores the Governments commitment to reviving Bulawayos industrial sector.\n\nThe retooling initiative has already shown positive results, with several companies increasing production and creating employment opportunities. This resurgence is a critical step towards building a robust domestic industrial base.\n\nBy revitalising the manufacturing sector, the retooling drive contributes to economic growth and diversification. A strong industrial base is essential for achieving the economic targets set out in Vision 2030.\n\nThe retooling of industries leads to job creation, which is vital for improving the livelihoods of Zimbabweans. Employment opportunities in the manufacturing sector can reduce poverty and enhance the standard of living.\n\nMechanisation and modernisation of industries bring technological advancements, which can increase productivity and efficiency. This technological progress is crucial for competing in the global market and achieving sustainable development.\n\nA thriving industrial sector can attract foreign investment, further boosting economic growth. Investors are more likely to invest in a stable and growing industrial environment, which can lead to more significant economic benefits.\n\nWe are excited by the retooling drive by Bulawayo companies as it is a strategic initiative that supports Zimbabwes Vision 2030. By focusing on industrial revival, job creation, technological advancement, and attracting foreign investment, this initiative lays a strong foundation for achieving an upper-middle-income economy. Continued support from the Government and stakeholders will be essential to sustain this momentum and realise the vision for a prosperous Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/nhfyj.jpg",
            "description": "THE retooling drive by companies in Bulawayo is a commendable initiative that aligns well with Zimbabwe’s Vision 2030, which aims to transform the country into an upper-middle-income economy. This retooling effort is particularly significant for Bulawayo, historically known as Zimbabwe’s industrial hub, which faced severe de-industrialisation over the past decades. Bulawayo’s manufacturing sector is witnessing […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "Motorists demand urgent action as potholes crisis deepens",
            "url": "https://www.chronicle.co.zw/motorists-demand-urgent-action-as-potholes-crisis-deepens/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nNAVIGATING Bulawayos major roads has become a daily nightmare for motorists, as they contend with an increasing number of potholes that have made many streets nearly impassable.\n\nThe recent rains, while a relief to residents and farmers, have exacerbated the problem, leaving drivers to carefully plan their routes to avoid the worst-hit areas.\n\nKey roads, especially in the industrial area where major companies like Ingwebu Breweries and National Foods are located, have become no-go zones. These roads, once bustling with activity, are now riddled with potholes, making them nearly impossible to drive on.\n\nBad road along Old Khami road\n\nAs the city grapples with the growing pothole crisis, residents and motorists alike are calling for immediate and long-term solutions to restore Bulawayos road network to a safe and passable condition.\n\nCommuter omnibus driver Mr Mxolisi Mpofu, who operates the Emakhandeni  City Centre route, highlighted the severity of the issue, particularly along 3rd Avenue and Lobengula Street, where some of the largest potholes have formed. A section of his usual route through 3rd Avenue and Herbert Chitepo Street is closed for maintenance, forcing him and other drivers to take the detour via Lobengula Street, which is equally treacherous.\n\nEvery kombi that uses Luveve Road into the city centre must turn into 3rd Avenue and Lobengula Street. We have no choice but to drive through huge potholes that are now in the middle of the road. I would expect such potholes in the western suburbs, not in the city centre, said Mr Mpofu.\n\nThe road has become a thorn in the flesh for motorists as it is no longer trafficable. (Picture by Nkosizile Ndlovu)\n\nThe problem has worsened as the rains have deepened and widened the potholes, turning them into dangerous traps for unsuspecting drivers.\n\nMr Mpofu described the temporary solutions, such as dumping sand into the potholes, as ineffective.When it rains, the whole place becomes muddy and an eyesore, he said.Bulawayo United Passengers Transport Association chairman, Mr Morgan Msipa, expressed frustration over the growing number of potholes, particularly along busy roads connecting the city centre to the eastern and western suburbs.\n\nThe road has become a thorn in the flesh for motorists as it is no longer trafficable. (Picture by Nkosizile Ndlovu)\n\nHe called on the City Fathers to take urgent action before the situation worsens.We appreciate the work that the mayor, Councillor David Coltart, and his team have been doing to address the problem of bad roads, but we are now facing another challenge with potholes, especially on busy roads, said Mr Msipa.\n\nHe pointed to sections of Khami Road, which have seen several accidents due to potholes, as areas that needs immediate attention.\n\nLast Friday, a Chronicle news crew observed Bulawayo City Council (BCC) workers patching part of Khami Road near a bridge after the industrial areas. However, these efforts have proven temporary, as the rains quickly wash away the gravel patches, leaving the roads in even worse condition.\n\nBCC communications officer, Ms Bongiwe Ngwenya acknowledged the citys deteriorating road network, attributing much of the damage to the heavy rains.\n\nShe explained that about 75 percent of the citys roads have exceeded their economic lifespan, making repairs challenging.While gravel patching has been used as a stopgap measure, it is not a permanent solution. The shortage of road repair materials, especially asphalt concrete, has further hindered progress.\n\nIf it rains, potholes re-emerge. By patching roads that have outlived their lifespan, we are only treating the symptoms, not the root cause. Gravel patching is a temporary measure to keep the roads trafficable, said Ms Ngwenya.\n\nBad road along Old Khami road\n\nShe added that the heavy rains and a lack of road repair materials, particularly asphalt, have further delayed major roadworks.In 2021, Government declared the countrys roads a state of disaster due to significant damage caused by rains, leading to the launch of the Emergency Road Rehabilitation Programme 2 (ERRP2). While the programme was initially set to end in 2023, it has been extended to 2026 due to funding constraints and competing national priorities, such as dealing with the Covid-19 pandemic and the El Nino-induced drought.\n\nA member of the Parliamentary Portfolio Committee on Transport, Knowledge Kaitano, stressed the need for timely maintenance and the revival of defunct Road Maintenance Units to ensure efficient roadworks across the country.\n\nThe people of Zimbabwe have seen the improvements on some of the countrys roads, and they want that process to be accelerated across all roads. They want more funding to be allocated for road maintenance, he said.\n\nWhen the rains occur, roads get damaged, but what the people want is for the roads to be maintained on time.The pothole problem is not confined to the city centre. The eastern and western suburbs are also plagued by large, hazardous potholes, making driving a challenge for residents across the city.\n\nSocial media user Ms Anele Nxumalo, expressed frustration on Facebook, accusing BCC of neglecting a large pothole in Hillside suburb despite multiple requests for repairs since November.\n\nDriving in Bulawayo now requires one to know exactly where to find the countless potholes on our roads. Last week, my cousins car was badly damaged when she drove into a huge pothole filled with water. I have called BCC multiple times, but it seems they dont care, she posted.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Bad-road.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com NAVIGATING Bulawayo’s major roads has become a daily nightmare for motorists, as they contend with an increasing number of potholes that have made many streets nearly impassable. The recent rains, while a relief to residents and farmers, have exacerbated the problem, leaving drivers to carefully plan their routes to avoid the worst-hit […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "DJ Tira promotes  emerging local talent",
            "url": "https://www.chronicle.co.zw/dj-tira-promotes-emerging-local-talent/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nSouth African award-winning record producer and DJ, Tira, has encouraged established artistes to embrace opportunities for collaboration and support emerging talents.\n\nDJ Tiras remarks came this past weekend following a memorable performance in Bulawayo at musician Sandra Ndebeles belated birthday party, held at the Zimbabwe International Exhibition Centre. The event, which also featured Afro-pop sensations, the Qwabe Twins, provided a platform for DJ Tira to express his desire for mutual collaborations.\n\nI believe we (artistes) should give each other a chance and collaborate. We need to support one another. Lets create opportunities for emerging artistes to grow and become the next DJ Tira or Jah. Im all about positive vibes, and Im here for it, said DJ Tira on the sidelines of the event.\n\nShowcasing his dedication to promoting local talent, DJ Tira, who has previously collaborated with local musicians Nox and Valee Music, invited the local No Name Dance Crew from Bulawayo to join him on stage. The trio, renowned for their energetic performances and unique style, aced the set.\n\nDJ Tira and the No Name Dance Crew doing the hush pose that the crew has been known for on Saturday\n\nOne of the No Name Dance Crew members, Prince Chibansha, expressed his surprise at DJ Tiras kindness.\n\nWe were surprised by his generosity and eagerness to perform part of his set with us, especially considering it was impromptu. It feels great to be appreciated and trusted after all the hard work weve been putting in, Chibansha said.\n\nChibansha said this performance has motivated them to keep pushing with the aim of gaining international recognition.\n\nWe look forward to collaborating more with both local and international artistes in a dance capacity so that more attention can be given to dancers, which is one of our main objectives, said Chibansha, the 2020 Roil Bulawayo Arts Awards Outstanding Male Dancer.\n\nReflecting on Sandys event, DJ Tira expressed his admiration for her, describing her as one of Zimbabwes most prominent artistes, destined for greatness.\n\nThe No Name Dance Crew with Sandra Ndebele\n\nSandra is definitely onto something. She knew exactly what she was doing. Shout out to her for organising such a beautiful event with the Denim and Pearls theme. I had a great time interacting with people, taking pictures and dancing. It was nice and relaxed, and Ill definitely be back soon.\n\nHe added that, as one of the big artistes from Zimbabwe, he had been admiring Sandy from a distance.\n\nAs one of the big artistes from Zimbabwe, Id been watching her and little did I know that one day, shed invite me to perform at her event in Zimbabwe, he reflected.\n\nOn the possibility of a collaboration with Sandy, DJ Tira said, We actually talked about that and how we need to do a studio session together to see what we can come up with. So well see how it goes.\n\nDJ Tira, who has become a regular in the country, has earned an invitation to return to the city for the Bulawayo Shutdown gig, scheduled for April.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/hrt.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com South African award-winning record producer and DJ, Tira, has encouraged established artistes to embrace opportunities for collaboration and support emerging talents. DJ Tira’s remarks came this past weekend following a memorable performance in Bulawayo at musician Sandra Ndebele’s belated birthday party, held at the Zimbabwe International Exhibition Centre. The event, which also featured […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "Tuskers move up to third after Eagles victory",
            "url": "https://www.chronicle.co.zw/tuskers-move-to-third-place/",
            "content": "Brandon Moyo,[emailprotected]\n\nTUSKERS nail-biting one-wicket victory over Eagles at Takashinga Cricket Club in Harare on Sunday has propelled them into the top three of the 2024/25 Pro50 Championship season standings.\n\nHeading into the clash against the capital-based Eagles, Tuskers were rooted at the bottom of the standings with four points from five matches. The Bulawayo side had managed just one win, while losing twice, with two games yielding no result.\n\nEagles, on the other hand, were leading the standings with six points, having won three and lost twice in their opening five matches.\n\nThey are now tied with Tuskers on six points apiece, separated by net run rate, while Rhinos  following their one-wicket win (D/L Method) over Mega Market Mountaineers  have climbed to the top of the standings with seven points, one ahead of both Tuskers and Eagles.\n\nWith Rhinos leading the pack on seven points, Eagles and Tuskers sit second and third respectively, tied on six points and separated by net run rate. Southern Rocks are fourth with five points, while Mega Market Mountaineers anchor the standings with four points.\n\nThe Tuskers lower order held firm to secure a hard-fought victory. After winning the toss, Tuskers opted to field first and bowled out Eagles for 193 runs in 43.1 overs. They chased down the target in 48 overs, finishing on 194/9.\n\nThe Eagles innings was marked by inconsistency, featuring three partnerships of 40 or more, but minimal contributions from the rest. Following Tadiwanashe Marumanis dismissal for 11, Tinashe Kamunhukamwe (26 off 19 balls) and Rodney Mupfudza (14) put on a 40-run stand for the second wicket. However, both were dismissed with the score at 54, alongside Dion Myers.\n\nCraig Ervine and Wessly Madhevere then added a cautious 46-run stand for the fourth wicket. After Madheveres departure for 21, Tony Munyonga (31) joined Ervine in the largest partnership of the innings, adding 56 for the sixth wicket.\n\nErvine anchored the innings with a composed 54 off 94 balls, but with limited support from the lower order, Eagles fell short of the 200-mark.\n\nErnest Masuku was the standout bowler for Tuskers, taking 4/33. Luke Jongwe (2/41) and Brandon James (2/27) provided solid support, while Nkosana Mpofu and Ainsley Ndlovu chipped in with one wicket each.\n\nTuskers chase was far from straightforward, as they lost three wickets for 41 runs, with Tanunurwa Makoni contributing 21. Brian Chari and Will Fraine steadied the innings with a 66-run partnership before Fraine fell for 37 at 115/4. Jongwes 32 off 42 balls brought Tuskers to 177/8, leaving James (11 not out) to guide the tail in pursuit of the remaining runs.\n\nNdlovu managed just one before being dismissed, but Masuku held his nerve alongside James as they scrambled the final four runs to clinch a thrilling victory for Tuskers. Tapiwa Mufudza was Eagles standout bowler, claiming 3/29 in his 10 overs.\n\nTuskers will have a bye in the next round of Pro50 Championship matches, scheduled for February 7. Rhinos will host Eagles at Kwekwe Sports Club, while Mega Market Mountaineers and Southern Rocks will face off in the capital. Tuskers will return to action on February 19, hosting Mega Market Mountaineers in Bulawayo.  @brandon_malvin.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/sdw-1.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com TUSKERS’ nail-biting one-wicket victory over Eagles at Takashinga Cricket Club in Harare on Sunday has propelled them into the top three of the 2024/25 Pro50 Championship season standings. Heading into the clash against the capital-based Eagles, Tuskers were rooted at the bottom of the standings with four points from five matches. The Bulawayo […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        },
        {
            "title": "Nation called to remain united",
            "url": "https://www.chronicle.co.zw/nation-called-to-remain-united/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nGOVERNMENT is aware of challenges faced by citizens such as unreliable public transport, an unregulated informal market, health and infrastructure problems and is currently addressing these issues, Acting President Constantino Chiwenga has said.\n\nAddressing mourners during the burial of National Hero and career civil servant, Cde Justin Mupamhanga, also known as Cde Top Ten, at the National Heroes Acre in Harare yesterday, Acting President Chiwenga said there was need to remain united and focused.\n\nHe also slammed corrupt tendencies in society, saying national resources ought to be shared equally and not for them to be a preserve of a few individuals.\n\nThe late Cde Justin Mupamhanga\n\nThe Acting President stressed that fair distribution of the nations wealth was consistent with the ethos and spirit of the liberation struggle that saw men and women waging a protracted fight against settler regime that resulted in the countrys independence.\n\nThe Government is fully aware of the issues that are affecting the citizenry such as unreliable public transport, unregulated informal market, health and infrastructure challenges, which are already being addressed. Irrespective of all these, we must remain united and focused. Let us remain vigilant and ready to defend our country, its resources and ideals, including its values and sum-culture. We must not be a generation, which betrays or fails our revolution and its ideals purchased through such painful sacrifice, he said.\n\nActing President Chiwenga said to realise an upper middle-income economy as envisaged by President Mnangagwa, there was need to marshal collective energy towards one goal.\n\nWe must produce more, we must beneficiate all our resources, we must industrialise our economy towards value addition and beneficiation. Above all, we must turn our rural areas into centres of industrial activity, based on each communitys resource endowment. Rural industrialisation is one key lesson we learn from successful countries and growing economies. We must lift our people out of degrading and dehumanising poverty, indeed change the trajectory of flow of goods and services back to the countryside where we all began, he said.\n\nActing President Chiwenga called upon Zimbabweans to uphold the tenets of the liberation struggle that entailed utilisation of available resources for the greater and common good for everyone.\n\nDuring the liberation struggle, he said, everyone remained focused, echoing the wartime mantra that called for unity and a collective vision for the nations future.\n\nIn mind comes the song, tose tichanoguta kumusha muZimbabwe yakasununguka. It was a call, which helped us endure hardships, indeed, which gave us a glimpse of a brave new world,we were all carving through shared sacrifices. We fought for a total Zimbabwe, fought for all its wealth: the minerals, the flora, the fauna, its cultures, its heritage, its identities, its beliefs!\n\nIndeed, we fought for its rise as a soaring great nation. The wartime call urged us not to be greedy and selfish, not to be corrupt and egocentric or to be narrow-minded and tribalist. We all swore to a shared future in which everyone had a place on the table, a place in the sun for a culture of equal opportunity where every Zimbabwean served in equal measure. Zvehubvanzu-bvanzu kudya kwemhumhi takazviramba, Acting President Chiwenga said.\n\nWhen our President says leaving no one and no place behind, he is reminding us of this wartime covenant, a covenant we must all live by, across generations starting and including our very own. Zimbabwe belongs to all of us. We must share its God-given bounty, share its bounty equally, so no one, not even the weak, the widowed or the orphaned, are displaced or elbowed out by the strong in a mad rat-race to grab unmerited privileges. Corruption has to end.\n\nVice-President Chiwenga\n\nHe said there was need to share resources equitably and work towards the development of the country as was envisaged by Cde Mupamhanga.\n\nI am highlighting all these so that you understand, Dear Fellow Zimbabweans, that the mantras by which this nation is governed, come from very far; they define us as a people. They capture our deeply-held values, our morals, our aspirations and burdens we carry forward bestowed on us by our fallen heroes. Inhaka yemusiyidzanwa, a timeless heritage, which each generation must safeguard jealously, and bequeath to the next one coming after it, said Acting President Chiwenga.\n\nOur Vision 2030 is for all of us, kwete dzamunoti mbinga! Kuhondo taidziti zvigananda: those who grow big tummies through ill-gotten wealth and questionable morals! A nation is as developed as its weakest man and woman; indeed, as its remotest part.\n\nHe said the Mupamhanga family should find solace in knowing that the entire nation stands with them.The Acting President said it was sad that the burial of Cde Mupamhanga comes barely after the nation mourned three national heroes at the national shrine.\n\nThe three are Cdes Chenhamo Chen Chakezha Chimutengwende, Major-General (Retired) Solomon Siziba and Ambassador John Shumba Mvundura.\n\nBorn in Goneso Village, under Chief Ruzane in the Hwedza District of Mashonaland East Province on March 1, 1953, Cde Mupamhangas father, Patson Mupamhanga, later migrated to Mt Darwin area in search of good farming land, which he secured in the so-called African Purchase Area of Chesa.\n\nHe was a renowned farmer, which is what earned him that piece of land in another district of the then Rhodesia.He went to Nyakasikana Primary School and later to St Augustines Anglican Secondary School in Manicaland, where he excelled academically.\n\nDriven by the injustices of the colonial regime, he joined a wave of determined youth who protested against oppression, leading to his ultimate expulsion from school and relocation to Harare, where he completed his education.\n\nMotivated by a profound sense of national duty, Cde Mupamhanga abandoned his studies at the University of Rhodesia in 1975 to join the liberation struggle, becoming part of The 8, a group of educated and courageous individuals who sacrificed their futures for the countrys independence.\n\nThese included Cde Chris Mutsvangwa, Justice George Mutandwa Chiweshe, the late Ambassador John Mayowe, the late Cde Willard Duri, Dr Masimba Mwazha, lawyer Cde Sobuza Gula Ndebele and the late Cde Neville Dembetembe who fell in battle during the Struggle.\n\nCde Mupamhangas extraordinary talents made him part of the training Team at the Wampua Political College at Chimoio Camp.\n\nHis mastery in Portuguese language often saw him serving as a translator for pivotal meetings involving the late President Cde Robert Gabriel Mugabe and Mozambiques late President Cde Samora Moises Machel.\n\nPost-Independence in 1980, the ruling party authorised him to remain in Mozambique to complete his degree in Economics at Eduardo Mondlane University and returned in 1983 to serve in various strategic roles, significantly shaping the countrys economic landscape.\n\nOn his return, Cde Mupamhanga joined the Presidents Department under the Economics Division. He was then posted to the United Kingdom Mission from 1994 as a Minister Counsellor.\n\nHe took advantage of the posting and enrolled for a Masters in Business Administration at Middlesex University. His dissertation looked at strategies to improve Foreign Direct Investment to Zimbabwe. Later, he was recalled to Head Office where he was tasked to transform the Economics Division into a full-fledged Branch.\n\nThe late former President Mugabe would later appoint Cde Mupamhanga to the sensitive post of Secretary for Energy and Power Development in December 2002 and tasked to address critical challenges like the then prevailing fuel shortages and restructure vital energy and power institutions such as the Zimbabwe Electricity Supply Authority (Zesa) and the introduction of the Zimbabwe Energy Regulatory Authority (Zera).\n\nIn times of the El Nino-induced droughts that have from time to time devastated the Southern African Region, Cde Mupamhanga was part of a Taskforce that included the late Minister of Agriculture as then Airforce Commander, Air Chief Marshall Perrance Shiri, late Lieutenant General Amoth Chinombe, then Chief of Staff in the Defence Forces and Ngonidzashe Masoka, the then Secretary for Agriculture.\n\nThe Taskforce was charged with the responsibility of importing grain to avert hunger in the country. Acting President Chiwenga said the taskforces comprised hard-headed trouble-shooters.\n\nIn 2012, Cde Mupamhanga was appointed Deputy Chief Secretary Responsible for Monitoring and Evaluation in the Office of the President and Cabinet.\n\nUpon his retirement around 2019, he took up influential roles in Kuvimba Mining House and was also adviser to the late Minister of Agriculture (Air Chief Marshal (Ret) Shiri.\n\nActing President Chiwenga was accompanied by wife, Colonel Miniyothabo Baloyi-Chiwenga.Other dignitaries that attended the event include Vice-President Kembo Mohadi, Defence Minister, Oppah Muchinguri-Kashiri, Deputy Chief Justice Elizabeth Gwaunza, Cabinet Ministers, Zanu-PF Politburo members, Service Chiefs, diplomats accredited to Zimbabwe and senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-3-4.jpg",
            "description": "Zvamaida Murwira, Harare Bureau GOVERNMENT is aware of challenges faced by citizens such as unreliable public transport, an unregulated informal market, health and infrastructure problems and is currently addressing these issues, Acting President Constantino Chiwenga has said. Addressing mourners during the burial of National Hero and career civil servant, Cde Justin Mupamhanga, also known as […]",
            "time": "08:25",
            "date": "28 Jan 2025"
        }
    ]
}