{
    "news": [
        {
            "title": "Temba Mliswa ZIFA case not urgent: High Court",
            "url": "https://www.chronicle.co.zw/temba-mliswa-zifa-case-not-urgent-high-court/",
            "content": "Zimpapers Sports Hub\n\nTHE High Court of Zimbabwe has dismissed the urgent chamber application made by aspiring ZIFA presidential candidate Temba Mliswa to seek the postponement of the ZIFA elections.\n\nMliswa and his legal team appeared before Justice Tawanda Chitapi in Harare, and after a three-hour marathon, it was proven that the matter was not urgent since it was filed out of time.\n\nThe former Warriors fitness trainer and his legal counsel had no choice but to withdraw the case. Justice Chitapi said Mliswa could still pursue the case but as a normal application.\n\nThis application is withdrawn by consent and the applicant will pay the costs of the hearing, said Justice Chitapi.\n\nMliswa is among the five candidates that were disqualified by the ZIFA Electoral Committee after falling short of the associations eligibility criteria.\n\nThe ZIFA elections have been penciled in for this Saturday.\n\nHowever, Mliswa was challenging the election process as well as the validity and legitimacy of the new ZIFA statutes adopted by Congress last October that are being used to conduct the ballot.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/mliswa.jpg",
            "description": "Zimpapers Sports Hub THE High Court of Zimbabwe has dismissed the urgent chamber application made by aspiring ZIFA presidential candidate Temba Mliswa to seek the postponement of the ZIFA elections. Mliswa and his legal team appeared before Justice Tawanda Chitapi in Harare, and after a three-hour marathon, it was proven that the matter was not […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Ruben Amorim destroys TV during furious dressing room blast at Man Utd flops",
            "url": "https://www.chronicle.co.zw/ruben-amorim-destroys-tv-during-furious-dressing-room-blast-at-man-utd-flops/",
            "content": "Ruben Amorim lost his temper with Manchester Uniteds players moments after their 3-1 defeat to Brighton on Sunday, the sixth time theyve lost a home game in the Premier League this season\n\nA furiousRuben Amorimcaused damage to a big screen television in Manchester Uniteds dressing room followingtheir abysmal 3-1 defeatbyBrightonlast weekend.\n\nUnited fell to their sixth defeat in 12Premier Leaguehome games at Old Trafford on Sunday, marking the seventh overall loss of Amorims so far underwhelming reign. Thats despite the himonly taking charge in November.\n\nAmorim, 39, reportedly lost his temper during a critique of his players dire performance, later labelling themmaybe the worst team in Uniteds historyduring his post-match press conference. Theex-Sporting Lisbonboss, as first reported byThe Athletic, vented his anger towards his players, in a marked change from his usual approach of staying silent until the next day.\n\nIts been claimed by the publication that the TV, which used for tactics before kick-off and at half-time, will need to be fixed  and quickly. Its understood, however, that the repairs will be completed in time for the Red DevilsEuropa Leagueclash withRangersat Old Trafford on Thursday.\n\nAmorims fury was particularly striking to those inside the dressing room because the Portuguese coach usually doesnt say a word immediately after matches. Uniteds players have experienced angry managers before but the 39-year-olds reaction to the loss stood out.\n\nIn [the past] 10 games in Premier League, we won two, Amorim told reporters following his alleged rant. Imagine what this is for a fan ofManchester United. Imagine what this is for me. We are getting a new coach who is losing more than the last coach. I have full knowledge of that.\n\nWe are the worst team maybe in the history of Manchester United. I know you [the media] want headlines but I am saying that because we have to acknowledge that and to change that. Here you go: your headlines.\n\nFormerLiverpooldefenderJamie Carragherwas stunned by Amorims comments, describing them as bizarre and ridiculous. It was one of the most bizarre and ridiculous things Ive ever heard a manager say, Carragher said onMonday Night Football. Why you would make a comment like that?\n\nRuben Amorim damaged a big screen TV( Image:Ash Donelon/Manchester United via Getty Images)\n\nThats the type of comment a pundit would make, someone in my position, and youd have to defend that. I dont know what he gains from that, what the benefit is. We all know its a poor Man United team. Theyd lost another game at home to Brighton, theyd done that in the last couple of years anyway.\n\nWe know its a tough season, we know its a poor team. He has just loosened it up. That will be a quote that follows him for the rest of the season. He said to the journalists there, Ill give you your headline. Why you would like to do that as a manager, Ill never know.\n\nUniteds players are still struggling to get to grips with Amorims 3-4-2-1 formation, a system which hes married to after successfully using it with former clubsBragaand Lisbon. Their two best performances came earlier this month, drawing with both Liverpool andArsenal the latter of whom they beat on penalties  away from home when they notably surrendered possession.\n\nI knew it was going to be hard to put in a completely new idea in the moment, Amorim explained. But when you lose games, you dont have that luck to win three games in a row, its becoming really hard. Thats why Im telling [you] we are going to suffer because Im going to continue to do the same.\n\nManchester United were beaten 3-1 by Brighton last weekend(Image: AP)\n\nTo help my players is to give them the tools to play this way, but, without training, it is really hard. Then, without training and losing games. You could feel it in the end of the game, everybody was changing position, and that is something I will not see again. We can lose, but we will not change position.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Amorim.jpg",
            "description": "Ruben Amorim lost his temper with Manchester United’s players moments after their 3-1 defeat to Brighton on Sunday, the sixth time they’ve lost a home game in the Premier League this season A furious Ruben Amorim caused damage to a big screen television in Manchester United’s dressing room following their abysmal 3-1 defeat by Brighton last weekend. United fell to their […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Armed robbers raid Shurugwi home, steal US$3 000",
            "url": "https://www.chronicle.co.zw/armed-robbers-raid-shurugwi-home-steal-us3-000/",
            "content": "Online Writer\n\nPOLICE have launched a manhunt for a six-man gang that invaded a home in Shurugwi, Midlands Province and stole over US$3 000.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the robbery, which occurred early Monday morning in Impali suburb.\n\nAt around 6 am on January 20, Sandra Zhou (30) of Impali suburb took her children to school, leaving her home, said Insp Mahoko.\n\nBefore Zhous maid, Vimbai Mwenya (20), could close the gate, six unknown men emerged from a nearby bush and entered the yard.\n\nThe suspects were all dressed in black trousers, black T-shirts, and black safety shoes, with their faces covered using black potato sacks, he said.\n\nTwo of the robbers were armed, one with a suspected pistol and the other with a machete.\n\nThe gang forced the maid into the house and ordered her to lie down. One of the robbers took a mattock from the yard and used it to break open the bedroom door. They also vandalised the CCTV monitor and cables to conceal their identities.\n\nTwo of the robbers ransacked the bedroom, stealing US$3 384 in cash and an Itel cellphone before fleeing the scene.\n\nInspector Mahoko urged members of the public with any information that could lead to the arrest of the suspects to come forward.\n\nThe police are working tirelessly to bring these perpetrators to justice, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/armed-robbers-used-gun-robbery-600nw-1495712093-600x380.jpg",
            "description": "Online Writer POLICE have launched a manhunt for a six-man gang that invaded a home in Shurugwi, Midlands Province and stole over US$3 000. Midlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the robbery, which occurred early Monday morning in Impali suburb. “At around 6 am on January 20, Sandra Zhou (30) of Impali suburb […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Zim, SA security agents intensify crackdown on smugglers",
            "url": "https://www.chronicle.co.zw/zim-sa-security-agents-intensify-crackdown-on-smugglers/",
            "content": "Thupeyo Muleya,[emailprotected]\n\nTHE countrys security authorities in collaboration with their South African counterparts have intensified a crackdown on cigarette smuggling along the Limpopo River, intercepting three consignments of contrabands in about a week.\n\nThe first consignment worth R730 000 was intercepted last week in Musina following a high-speed chase between the police and the suspect.\n\nOn Saturday the security team also intercepted a truckload of Remington gold cigarettes worth R14 million at Beitbridge Border Post.\n\nZimbabwean security officials are also carrying out an intensive crackdown on smuggling activities through a multi-agency joint task force led by the Ministry of Industry and Commerce.\n\nLimpopo police spokesperson, Colonel Malasela Ledwaba said on Monday they also busted another smuggler in Musina who was carrying cigarettes worth R450 000.\n\nA multi-disciplinary operation consisting of the South African Police Service (Saps) Operation Vala Umgodi Mission Area Joint Operation Centre (MAJOC), Roving Team, and National Counterfeit Unit, resulted in a significant bust on Monday, he said.\n\nCol Ledwaba said the operation led to the arrest of a 30-year-old Zimbabwean who was found in possession of smuggled cigarettes valued at over R450 000.\n\nCol Ledwaba said at around 4 am during routine patrols along the N1 Highway in Musina, police officers identified a suspicious Mercedes Benz with Gauteng registration plates.\n\nWhen the team tried to intercept the vehicle, the driver attempted to evade arrest by fleeing at high speed and driving recklessly. We pursued and cornered the driver and he stopped the car and escaped on foot, but was later arrested, he said.\n\nCol Ledwaba said upon searching the vehicle, officers found numerous cartoons of Remington Gold and Royal Express illicit cigarettes, with an estimated street value of R452 872. The vehicle was also seized.\n\nThe suspect was also charged with violating the Immigration Act, reckless and negligent driving and malicious damage to state property.\n\nThe suspect is set to appear in Musina Magistrates Court soon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/HYJUTYHJ.jpg",
            "description": "Thupeyo Muleya, thupeyo.muleya@zimpapers.co.zw THE country’s security authorities in collaboration with their South African counterparts have intensified a crackdown on cigarette smuggling along the Limpopo River, intercepting three consignments of contrabands in about a week. The first consignment worth R730 000 was intercepted last week in Musina following a high-speed chase between the police and the […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Pardoned Jan. 6 attackers to go free on Trump’s first full day in office",
            "url": "https://www.chronicle.co.zw/pardoned-jan-6-attackers-to-go-free-on-trumps-first-full-day-in-office/",
            "content": "Get weekly news and analysis on U.S. politics and how it matters to the world with the Reuters Politics U.S. newsletter.Sign uphere.\n\nReporting by Joseph Ax and Nandita Bose in Washington; Additional reporting by Bo Erickson, Steve Holland, Jeff Mason, Nandita Bose, Doina Chiacu, Stephanie Kelly, Rami Ayyub and Gram Slattery, Writing by Joseph Ax, Andy Sullivan and Frances Kerry; Editing by Ross Colvin, Howard Goller, Raju Gopalakrishnan, Alex Richardson and Timothy Heritage\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Donald-Trump.jpg",
            "description": "WASHINGTON, Jan 21 (Reuters) – Supporters of Donald Trump who attacked the U.S. Capitol four years ago will start leaving prison on Tuesday, pardoned by the new president in a flurry of Inauguration Day executive orders showing intent to stamp radical change on the country. Trump was expected to sign more executive orders on Tuesday, after measures issued on Monday that […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Gidiza, Mark Mathe land roles at DeMbare",
            "url": "https://www.chronicle.co.zw/gidiza-mark-mathe-land-roles-at-dembare/",
            "content": "Fungai Muderere,[emailprotected]\n\nFORMER Warriors midfield genius Ronald Gidiza Sibanda has joined Dynamos as the clubs team manager to replace Harry Lusengo.\n\nLusengo is son of DeMbare board chairman Bernard Marriot Lusengo.\n\nGidiza is not new to the Glamour Boys family, a team he once played for between 1998 and 1999.\n\nHe makes the great trek to the capital alongside ex Highlanders and Harare City coach Mark Mathe who will be the first assistant coach to Lloyd MaBlanyo Chigowe.\n\nMore Details to Follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/YUOGYI.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw FORMER Warriors midfield genius Ronald “Gidiza” Sibanda has joined Dynamos as the club’s team manager to replace Harry Lusengo. Lusengo is son of DeMbare board chairman Bernard Marriot Lusengo. Gidiza is not new to the Glamour Boys family, a team he once played for between 1998 and 1999. He makes the great […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "All set for KCD Mohadi soccer and netball tournament finals",
            "url": "https://www.chronicle.co.zw/all-set-for-kcd-mohadi-soccer-and-netball-tournament-finals/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nPELANDABA Stadium in Gwanda, Matabeleland South will this weekend play host to the KCD Mohadi soccer and netball tournament finals.\n\nTwelve soccer teams and netball teams will converge at the Rainbow Provinces premier venue representing 12 constituencies to take part in the two-day event set for Saturday and Sunday.\n\nKnockout stages, third place play-offs will be played on Saturday while the final matches will be on Sunday with Vice President Mohadi in attendance.\n\nA brainchild of the Zanu PF Matabeleland South Provincial Youth League, the tournament celebrates the revolutionary Vice President Kembo Mohadi who has dedicated his life to the sovereignty of his country. The Matabeleland South Youth League chairperson Moses Langa said preparations are going accordingly with teams from outside Gwanda set to arrive on Friday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/RT4ET4.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com PELANDABA Stadium in Gwanda, Matabeleland South will this weekend play host to the KCD Mohadi soccer and netball tournament finals. Twelve soccer teams and netball teams will converge at the Rainbow Province’s premier venue representing 12 constituencies to take part in the two-day event set for Saturday and Sunday. Knockout stages, third […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Byo Afro-House producer Dr Breezy expands horizons with American collaboration",
            "url": "https://www.chronicle.co.zw/byo-afro-house-producer-dr-breezy-expands-horizons-with-american-collaboration/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nBulawayo-based Afro-house producer Dr Breezy (born Brandon Nduna) is spreading his wings even further as he has collaborated with American artistes for his upcoming single, One More Time.\n\nThe track, which is set for release on February 21, marks an exciting international collaboration between Dr Breezy, DJ and producer Yaw Appiah, and vocalist Biishop. The single will be available on several digital platforms.\n\nYaw Appiah\n\nDr Breezy has been gaining traction in the region, especially after his EP, Uhambo: The Journey, received rave reviews. One standout track, Ngyakthanda, a collaboration with DJ Genaro SA and featuring vocals by S.A.N.E, has been a hit, amassing over 18 000 streams on Spotify. The song was released under Xpressed Records, a South African Afro-house label, and was repeatedly played by South African music icon DJ Shimza on the radio.\n\nDr Breezy revealed that the collaboration with the American artistes came about through social media.\n\nI connected with Yaw Appiah on Instagram after he began following my work. We then collaborated with Biishop, who wrote the song and delivered incredible vocals, said Dr Breezy.\n\nThis will be my first release of the year, and it will drop under Alema Music Group, an Afro-house label based in the United States. Ive got other exciting projects in the pipeline too, including collaborations with DJ Yugoe, Just Drey, DJ Kimza (SA), Valento Dust (SA), Josh Major, and many more, he added.\n\n Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/RGERE.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Bulawayo-based Afro-house producer Dr Breezy (born Brandon Nduna) is spreading his wings even further as he has collaborated with American artistes for his upcoming single, “One More Time”. The track, which is set for release on February 21, marks an exciting international collaboration between Dr Breezy, DJ and producer Yaw Appiah, and […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Donald Trump’s second inauguration",
            "url": "https://www.chronicle.co.zw/donald-trumps-second-inauguration/",
            "content": "Donald Trump is to be sworn-in as USpresident on Monday, ushering in another turbulent four-year term.\n\nTrumpsinauguration completes atriumphantcomebackfor a political disruptor who survived two impeachment trials, a felony conviction, two assassination attempts and an indictment for attempting to overturn his 2020 election loss.\n\nThe ceremony is taking place inside the Rotunda of the USCapitol, four years after a mob ofTrumpsupporters breached the symbol of American democracy in an unsuccessful effort to forestall the RepublicanTrumps 2020 defeat to Democrat Joe Biden.\n\nThe swearing-in was moved indoors for the first time in 40 years due to the extreme cold.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/01/Donald-Trump-ir.jpg",
            "description": "Donald Trump is to be sworn-in as US president on Monday, ushering in another turbulent four-year term. Trump’s inauguration completes a triumphant comeback for a political disruptor who survived two impeachment trials, a felony conviction, two assassination attempts and an indictment for attempting to overturn his 2020 election loss. The ceremony is taking place inside the Rotunda of the US Capitol, […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        },
        {
            "title": "Bulawayo Arts Awards set for August 8",
            "url": "https://www.chronicle.co.zw/bulawayo-arts-awards-set-for-august-8/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE Bulawayo Arts Awards (BAAs) have officially announced that the 8th edition of the annual award ceremony will take place on August 8.\n\nThis much-anticipated event promises to be a celebration of creativity and talent in Bulawayo, coinciding with the Heroes Holiday.\n\nThe announcement follows last years decision to postpone the awards, allowing the organising committee to ensure a broader selection process.\n\nThe BAAs will carry the sub-theme Celebrating Our Heroes, reflecting the importance of honouring local artistes and their contributions to the cultural landscape.\n\nIn a press statement, the Roil Bulawayo Arts Awards Trust expressed their commitment to rebranding and enhancing the awards experience.This additional time will allow us to introduce new faces, incorporate fresh ideas, and work toward delivering an exciting and dynamic awards ceremony, the statement read.\n\nNkululeko Nkala, one of the organisers, spoke to Chronicle Showbiz about the preparations for the upcoming event.When personnel changes are ready, we will announce them in due course. Most of the processes are already in motion, he indicated, hinting at some exciting developments on the horizon.\n\nSince their inception in 2017, the BAAs have played a vital role in celebrating the creative spirit of Bulawayo.\n\nThe decision to postpone the awards was met with mixed feelings from the community; while some expressed disappointment, others recognised the necessity of taking the time to ensure a more memorable and impactful event.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/IOPOP.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE Bulawayo Arts Awards (BAAs) have officially announced that the 8th edition of the annual award ceremony will take place on August 8. This much-anticipated event promises to be a celebration of creativity and talent in Bulawayo, coinciding with the Heroes Holiday. The announcement follows last year’s decision to postpone the awards, […]",
            "time": "18:41",
            "date": "21 Jan 2025"
        }
    ]
}