{
    "news": [
        {
            "title": "BREAKING: Winnie Khumalo dies!",
            "url": "https://www.chronicle.co.zw/breaking-winnie-khumalo-dies/",
            "content": "VETERAN singer and dancer Winnie Khumalo has passed away at the age of 51.\n\nHer death was confirmed by her family.\n\nWinnie was always open about her health struggles.\n\nDaily Sun spoke to her son, Thando Khumalo, who confirmed the heartbreaking news of his mums death.\n\nHe said that the family was working on releasing an official statement.\n\nThe cause of death hasnt been revealed yet.\n\nIn 2024, it was revealed that Winnies son, Thando (33), is among the kids of the late boxing champion, Dingaan Thobela.\n\nBorn in Mofolo North, Soweto, Winnie began her music career at age 15, releasing albums such as Hey Laitie and Tshina Tshina, both produced by Sello Chicco Twala.\n\nIn the 1990s, she expanded into gospel with Izono Zami, produced by Pastor Langa Dube.\n\nThroughout her career, Winnie collaborated with prominent South African artists, including the late Brenda Fassie, Pure Magic, Bongo Maffin, and DJ Cleo.\n\nBeyond music, Winnie appeared in several TV series, including Muvhango and Mponeng, and even featured in Chiccos film Madluphuthu.\n\nWinnie KhumaloLegendary singer Winnie Khumalo has died at the age of 51.After taking a break from the industry to focus on her family, Winnie made a successful comeback in 2007 with the album I Just Wanna Live My Life, produced under Kalawa Jazmee Records.\n\nThe album became a massive hit, selling more than 25 000 copies and earning a gold record.\n\nIts hit single, I Just Wanna Live My Life, topped the charts and received multiple nominations, including at the Channel O Music Awards.\n\nWinnie was also nominated for Record of the Year at the South African Music Awards (Samas).\n\nHer career continued to flourish, with notable performances, including a tribute to Brenda Fassie at the Channel O Music Awards and a performance of the hit Mina Ngiyohlala Nginje with former president Jacob Zuma during the 2009 ANC election campaigns.\n\nLegendary kwaito musician Arthur Mafokate told Daily Sun that Winnie had supported him even before he could make it in the industry and continued to do so even after he became successful.\n\nShe has been an inspiration to most of us, and I commend her for raising talented children. May her soul rest in peace, and may her family and all those like me who were supporting her be comforted during these trying times, he said.\n\nWinnies most recent album, Woman, reflects her personal experiences, addressing themes of betrayal, family, and lifes challenges.\n\nThe albums title track, Woman, explores the pain of a broken friendship while Impilo delves into the struggles of life.\n\nThe track Ngihamba Naba Hambayo explores family dynamics, while Izifo serves as a reminder to prioritise ones health and is dedicated to those who have passed away.\n\nWith this album, Winnie continued to make waves in the Mzansi music scene, solidifying her place as a prominent figure in the industry. Daily Sun\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fghdt.jpg",
            "description": "VETERAN singer and dancer Winnie Khumalo has passed away at the age of 51. Her death was confirmed by her family. Winnie was always open about her health struggles. Daily Sun spoke to her son, Thando Khumalo, who confirmed the heartbreaking news of his mum’s death. He said that the family was working on releasing […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Beitbridge Municipality closes Dulivhadzimu Stadium for renovations",
            "url": "https://www.chronicle.co.zw/beitbridge-municipality-closes-dulivhadzimu-stadium-for-renovations/",
            "content": "Thupeyo Muleya-Beitbridge Bureau\n\nTHE Beitbridge Municipality has closed Dulivhadzimu Stadium for renovations.The stadium serves as the venue for many of the towns major community activities, including the annual Beitbridge Expo, and is the home ground for Division One teams Dulivhadzimu FC and Beitbridge FC.\n\nIn addition to its ageing infrastructure, the stadium, situated in a low-lying area, is frequently affected by flash floods.In a public notice issued on Tuesday, the local authority announced that the stadium would be closed from 6 January 2025 until further notice.\n\nThe closure leaves the community reliant on Ronnies Sports Arena, located approximately 7km north of the border town along the Beitbridge-Masvingo Road.\n\nWe hereby notify the community of the temporary closure of Dulivhadzimu Stadium as of 6 January 2025 for an off-season annual shutdown to allow for rehabilitation works, said the Municipality.During this period, the stadium will not be available for any sporting activities or events until further notice.The municipality is therefore requesting the Beitbridge community to bear with us as works commence to make the facility ready for use before the 2025 Division One soccer season kicks off.\n\nPlans are also underway for the local authority to construct a modern stadium on higher ground to accommodate the towns rapidly growing population and infrastructure development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/vjvjjkg.jpg",
            "description": "Thupeyo Muleya-Beitbridge Bureau THE Beitbridge Municipality has closed Dulivhadzimu Stadium for renovations. The stadium serves as the venue for many of the town’s major community activities, including the annual Beitbridge Expo, and is the home ground for Division One teams Dulivhadzimu FC and Beitbridge FC. In addition to its ageing infrastructure, the stadium, situated in […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Luphahla joins Simba Bhora",
            "url": "https://www.chronicle.co.zw/luphahla-joins-simba-bhora-2/",
            "content": "Innocent[emailprotected]\n\nJOEL Luphahla has been appointed as the head coach of Simba Bhora replacing Tonderayi Ndiraya who left to join Scottland.Luphahla, who recently won the Chibuku Super Cup trophy with Dynamos has a huge task of taking part in the CAF Champions League and also trying to defend the league title with he Shamva based side that announced they had lost over 10 players\n\nApart from Ndiraya, Simba Bhora also bade farewell to 13 first-team players, including Soccer Star of the Year Walter Musona, goalkeeper Talbert Shumba, Tichaona Chipunza and Vassili Kawe, who have since joined Scottland.Other players, who have left Simba Bhora, include Partson Jaure, Mthokozisi Msebe, Tymon Mvula, Perfect Chikwende, Valentine Musarurwa,\n\nAlbert Manenji, Simbarashe Maramwidze, Onifade Obubaka and Talent Chawapiwa.-@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/rgtrgt.jpg",
            "description": "Innocent Kurira-innocent.kurira@chronicle.co.zw JOEL Luphahla has been appointed as the head coach of Simba Bhora replacing Tonderayi Ndiraya who left to join Scottland. Luphahla, who recently won the Chibuku Super Cup trophy with Dynamos has a huge task of taking part in the CAF Champions League and also trying to defend the league title with he […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Luphahla joins Simba Bhora",
            "url": "https://www.chronicle.co.zw/luphahla-joins-simba-bhora/",
            "content": "Innocent Kurira,[emailprotected]\n\nJOEL Luphahla has been appointed as the head coach of Simba Bhora replacing Tonderayi Ndiraya who left to join Scottland.\n\nLuphahla, who recently won the Chibuku Super Cup trophy with Dynamos has a huge task of taking part in the CAF Champions League and also trying to defend the league title with he Shamva based side that announced they had lost over 10 players\n\nApart from Ndiraya, Simba Bhora also bade farewell to 13 first-team players, including Soccer Star of the Year Walter Musona, goalkeeper Talbert Shumba, Tichaona Chipunza and Vassili Kawe, who have since joined Scottland.\n\nOther players, who have left Simba Bhora, include Partson Jaure, Mthokozisi Msebe, Tymon Mvula, Perfect Chikwende, Valentine Musarurwa, Albert Manenji, Simbarashe Maramwidze, Onifade Obubaka and Talent Chawapiwa.\n\n-@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/rgtrgt.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw JOEL Luphahla has been appointed as the head coach of Simba Bhora replacing Tonderayi Ndiraya who left to join Scottland. Luphahla, who recently won the Chibuku Super Cup trophy with Dynamos has a huge task of taking part in the CAF Champions League and also trying to defend the league title with […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "iPhone 16 AI Feature Misfires Leads to Apple Update After BBC Complaint",
            "url": "https://www.chronicle.co.zw/iphone-16-ai-feature-misfires-leads-to-apple-update-after-bbc-complaint/",
            "content": "Apples artificial intelligence (AI) toolshave come under scrutiny after the BBC raised concerns about inaccurate headline summaries pushed to users of its latest iPhones.\n\nThecontroversyhighlights ongoing challenges with generative AI technology, which major tech companies have rapidly adopted.\n\nApple has announced plansto refine its AI tools following complaints from the BBC about inaccurate headline summaries delivered to users of its latest iPhones.\n\nTheBBC raised concernslast month after Apples AI-powered system misrepresented a news alert about Luigi Mangione, accused of murdering UnitedHealthcare CEO Brian Thompson, inaccurately stating that Mangione had shot himself.\n\nMore issues arose last week when the tool, known as Apple Intelligence,incorrectly summarized BBC Sport headline notifications.\n\nIt falsely claimed that Luke Littler had won the World Darts Championship Final hours before the match began and erroneously stated that Spanish tennis star Rafael Nadal had come out as gay.\n\nApple Intelligence is designed to generate brief overviews of missed notifications by summarizing multiple alerts from individual apps. The company has acknowledged the errors and is working to improve the accuracy of these AI-driven summaries.\n\nOn Monday, theBBC issued a statementexpressing concerns about Apples AI-generated summaries.\n\nThese AI summaries from Apple not only fail to reflect our original content but, in some cases, directly contradict it. Ensuring the accuracy of our news is vital to maintaining trust, and we urge Apple to address these issues urgently, the television company said.\n\nIn response, Apple confirmed that an update to itsApple Intelligencefeature would be rolled out in the coming weeks.\n\nThe company also emphasized that the summarization feature is optional.\n\nApple Intelligence features are currently in beta, and we are continuously refining them based on user feedback, Apple stated.\n\nAn upcoming software update will make it clearer when a displayed text is a summary generated byApple Intelligence. We also encourage users to report any unexpected notification summaries they encounter.\n\nOver the past year, numerous major smartphone manufacturers and tech companies have introduced generative AI tools.\n\nHowever, Apple is not the only firm facing challenges with content generation technology.\n\nGoogle, for example, has encountered criticism for its AI tools, including instances of erratic or inaccurate responses.\n\nIssues have been reportedwith its search engines AI Overviews feature, as well as inaccuracies in historical depictions created by its AI-powered image generation tool.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/iphone.jpg",
            "description": "Apple’s artificial intelligence (AI) tools have come under scrutiny after the BBC raised concerns about inaccurate headline summaries pushed to users of its latest iPhones. The controversy highlights ongoing challenges with generative AI technology, which major tech companies have rapidly adopted. Apple to Update AI Tools Apple has announced plans to refine its AI tools following complaints from the […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Man arrested after collecting illegal cough syrups from cross-border bus",
            "url": "https://www.chronicle.co.zw/man-arrested-after-collecting-illegal-cough-syrups-from-cross-border-bus/",
            "content": "Diana Baloyi Moyo,[emailprotected]\n\nA 40-YEAR-OLD man was arrested in Harare for possessing Broncleer Cough Syrup.\n\nBronCleer and Adco-Salterpyn Syrup are opioid-containing cough syrups which are not registered in Zimbabwe.\n\nOpioids are considered Dangerous Drugs and these cough syrups are being abused by opioid drug addicts.\n\nIn a statement on X, police said: Peter Zambara aged 40 years was arrested for possessing 300 by 100 millilitres of Broncleer Cough Syrup, just after he collected the contraband from Crestlink Motors a cross boarder bus.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/09/arrested23-.jpg",
            "description": "Diana Baloyi Moyo,moyodiana@gmail.com A 40-YEAR-OLD man was arrested in Harare for possessing Broncleer Cough Syrup. BronCleer and Adco-Salterpyn Syrup are opioid-containing cough syrups which are not registered in Zimbabwe. Opioids are considered Dangerous Drugs and these cough syrups are being abused by opioid drug addicts. In a statement on X, police said: “Peter Zambara aged […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Ganja planters arrested",
            "url": "https://www.chronicle.co.zw/ganja-planters-arrested/",
            "content": "Diana Baloyi Moyo,[emailprotected]\n\nA TRIO was arrested for the unlawful cultivation of 7 dagga plants in Mashonaland East Province.\n\nLearnmore Nyagumbo (33), Makuwerere James Nyagumbo (31) and Courage Chenzara (20) were arrested following a tipoff that was acted on by the Chivhu CID detectives.\n\nIn a statement on X, police said the trio was arrested at plot 24 Vergnoek Farm, Featherstone Chivhu on 3 January 2024.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Diana Baloyi Moyo,moyodiana@gmail.com A TRIO was arrested for the unlawful cultivation of 7 dagga plants in Mashonaland East Province. Learnmore Nyagumbo (33), Makuwerere James Nyagumbo (31) and Courage Chenzara (20) were arrested following a tipoff that was acted on by the Chivhu CID detectives. In a statement on X, police said the trio was arrested […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Former senior Zimbabwe Government official survives vicious attack from pet Boerboel: I fought the dog calling upon God to save me…",
            "url": "https://www.chronicle.co.zw/former-senior-zimbabwe-government-official-survives-vicious-attack-from-pet-boerboel-i-fought-the-dog-calling-upon-god-to-save-me/",
            "content": "Sikhumbuzo[emailprotected]\n\nFORMER director in the Office of the Deputy Prime Minister during the Government of National Unity, Ms Addelis Sibutha is lucky to be alive after she survived a vicious attack by her Boerboel dog in November last year.\n\nThe attack saw her spending 29 days at Mater Dei Hospital where she underwent four operations within 20 days as medical personnel at the health institution battled to save her life.\n\nThe procedures were successful as she walked out of the hospital in time to celebrate Christmas Day with her family.\n\nMs Sibutha, a former director at the National Gallery of Zimbabwe in Bulawayo, took to Facebook to share her miraculous survival story, which she said was all about God.\n\nOn 23 November 2024, I was viciously attacked by our own Boer bulldog. I fought the dog calling upon God to save me. I suffered deep and severe lacerations and cuts on both arms, right leg, neck, ear and head. I went to the theatre for surgery four times in 20 days. I cannot thank God enough for sending His holy angels to be with me throughout this period, said Ms Sibutha.\n\nShe is still recovering from the wounds and grafting surgery and continues to visit the doctor once a week.\n\nI am truly grateful to God, our Greatest physician, healer and restorer for saving and healing me. I have seen the Hand of God at work in my life. Will praise the Lord for the rest of my life, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/rtefr.jpg",
            "description": "Sikhumbuzo Moyosmoyo@chronicle.co.zw FORMER director in the Office of the Deputy Prime Minister during the Government of National Unity, Ms Addelis Sibutha is lucky to be alive after she survived a vicious attack by her Boerboel dog in November last year. The attack saw her spending 29 days at Mater Dei Hospital where she underwent four […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Court of Arbitration for Sport confirms receipt of Mwaruwari, Banda joint appeal",
            "url": "https://www.chronicle.co.zw/court-of-arbitration-for-sport-confirms-receipt-of-mwaruwari-banda-joint-appeal/",
            "content": "By Sikhumbuzo Moyo,[emailprotected]\n\nTHE upcoming ZIFA elections, scheduled for 25 January, have been thrown into uncertainty following an appeal lodged with the Court of Arbitration for Sport (CAS) by aspiring presidential and vice-presidential candidates, Benjani Mwaruwari and Gift Banda.\n\nThe duos appeal has been registered under CAS 2024/A/11104.\n\nThank you for your enquiry.\n\nOn 31 December 2024, the Court of Arbitration for Sport (CAS) registered the following appeal arbitration procedure: CAS 2024/A/11104 Benjani Mwaruwari & Gift Banda v. ZIFA Normalisation Committee. The arbitration is at an early stage, and no further information is available at this time, said CAS in an emailed response to an enquiry by the Zimpapers Sports Hub.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jfhjfhjsh.jpg",
            "description": "By Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE upcoming ZIFA elections, scheduled for 25 January, have been thrown into uncertainty following an appeal lodged with the Court of Arbitration for Sport (CAS) by aspiring presidential and vice-presidential candidates, Benjani Mwaruwari and Gift Banda. The duo’s appeal has been registered under CAS 2024/A/11104. “Thank you for your enquiry. “On […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        },
        {
            "title": "Man kills lover’s ex in a fit of jealous rage, connives with girlfriend to dump body",
            "url": "https://www.chronicle.co.zw/man-kills-lovers-ex-in-a-fit-of-jealous-rage-connives-with-girlfriend-to-dump-body/",
            "content": "Diana Baloyi Moyo\n\nTHE police have confirmed the arrest of two lovers who allegedly connived to kill a man in a complex love triangle in Nyathi District, Matabeleland North.\n\nThe incident occurred at a house in Badala Village 3 on 2 January.\n\nFanuel Moyo (26) went to visit his ex-girlfriend Kudzai Taendesa Chitima and upon arrival, he found her in the company of her new boyfriend Admire Dhlangamandla.\n\nA misunderstanding broke out between the rivals, and Moyo struck Dhlangamandla with a stone on the head and subsequently punched him.\n\nDhlangamandla died on the spot, and the two lovers carried the body and dumped it in a bushy area near the village.\n\nIn a statement on X, police said the suspects are in custody assisting with investigations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/2303-1-1-MURDER-CHARGE-680x380.jpg",
            "description": "Diana Baloyi Moyo THE police have confirmed the arrest of two lovers who allegedly connived to kill a man in a complex love triangle in Nyathi District, Matabeleland North. The incident occurred at a house in Badala Village 3 on 2 January. Fanuel Moyo (26) went to visit his ex-girlfriend Kudzai Taendesa Chitima and upon […]",
            "time": "20:26",
            "date": "07 Jan 2025"
        }
    ]
}