{
    "news": [
        {
            "title": "Crossborders for ED drills borehole, donates solar-powered system and water tank to Beitbridge Hospital",
            "url": "https://www.chronicle.co.zw/crossborders-for-ed-drills-borehole-donates-solar-powered-system-and-water-tank-to-beitbridge-hospital/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA GROUP of cross-border transporters, operating under the banner Crossborders for Economic Development (Crossborders for ED), on Monday, donated a solar-powered borehole to augment water supplies at the 140-bed Beitbridge District Hospital.\n\nThe group also committed to providing a water tank and offering additional support to the health institution, which has faced intermittent water supply challenges, adversely affecting the quality of care provided to patients.\n\nCrossborders for ED chairperson (Beitbridge), Mr Blessing Mureyani, said the group mobilised resources through its members to help restore and enhance health services at the hospital.\n\nThe Government has already undertaken to upgrade the health institution into a major referral centre due to its geographical location at SADCs busiest inland port and the African Unions North-South Corridor.\n\nThis is just the beginning. We are also looking at other areas to support our community to access quality services at this hospital. For a start, we have drilled a borehole that will be powered by solar energy, and we are going to provide an additional water tank. We believe that this initiative will, in the long run, complement what our Government is already doing to upgrade this health facility, said Mr Mureyani.\n\nHe said the association was deeply concerned about some operational challenges at the Beitbridge District Hospital, which serves not only Beitbridge but also a significant number of travellers, including cross-border transporters and visitors from various SADC countries.\n\nMr Mureyani emphasised the importance of other community members joining in to support the hospital to ensure the continuity of quality health services.\n\nThe 140-bed hospital serves a local population of 250 000, alongside approximately 13 000 people transiting through the town daily, as well as patients from neighbouring districts such as Gwanda, Mberengwa, and Mwenezi.\n\nIn addition, the hospital handles an average of 350 baby deliveries per month, including caesarean sections, which require consistent and adequate water supplies.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-17-at-17.27.57.jpeg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A GROUP of cross-border transporters, operating under the banner Crossborders for Economic Development (Crossborders for ED), on Monday, donated a solar-powered borehole to augment water supplies at the 140-bed Beitbridge District Hospital. The group also committed to providing a water tank and offering additional support to the health institution, which has […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Christian Brothers College wins 2025 Bulawayo Public Speaking Competition",
            "url": "https://www.chronicle.co.zw/christian-brothers-college-wins-2025-bulawayo-public-speaking-competition/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nCHRISTIAN Brothers College (CBC) has won the Bulawayo 2025 public speaking competition.The event, hosted last Friday at the Bulawayo Theatre by the Rotary Club of Bulawayo South, featured 12 schools and was held under the theme, Grooming Learners to be Community Champions in Service above self-using the Education 5.0 Approach.\n\nA total of 44 high schools registered for the competition, with two preliminary heats held on 14 and 28 February, respectively. Only 12 schools advanced to the finals.Jedidaya Kuuya from CBC claimed the top spot with his speech titled My Last Dream, beating Rejoice Mazivanhanga from Herentals College Silundika and Lwandise Tshuma from Montrose High School, who came in second and third place, respectively.\n\nKuuya walked away with the winners shield and a US$150 cash prize. The schools that participated in the finals included Petra College Senior, Christian Brothers College, Denmark Training Services, Bulawayo Adventist High, Herentals College Silundika, Townsend High, Montrose High, Mtshabezi High, David Livingstone, Riverdale Academy, Premier, and John Tallach.\n\nBusisiwe Ncube, Immediate Past President (IPP) of the Rotary Club of Bulawayo South, highlighted that 11 of the 12 finalists were female, with only one male participant. Jacob Nyathi, the clubs director of youth services, described the 2025 annual high school public speaking competition as a resounding success.\n\nAs we celebrate the achievements of our student speakers, let us also acknowledge the power of public speaking to inspire, educate, and bring about positive change, said Nyathi. He expressed optimism about the lasting impact of the competition, noting that the skills and confidence gained by the students would empower them to make meaningful contributions to their communities and beyond.\n\nNyathi also revealed that the Rotary Club of Bulawayo South is already looking forward to hosting another successful competition in 2026.\n\nAll participants received consolation prizes, including a pair of school shoes courtesy of the Zimbabwe Leather Development Council in association with the Bulawayo Leather Cluster. The 12 finalists also received hampers containing a six-pack of soft drinks and a 12-pack of water. Additionally, all 44 participants and their patrons were awarded certificates of participation.\n\nIn 2023, Mzilikazi High School won the competition, while Petra High School claimed the title last year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-17-at-17.22.59.jpeg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com CHRISTIAN Brothers College (CBC) has won the Bulawayo 2025 public speaking competition. The event, hosted last Friday at the Bulawayo Theatre by the Rotary Club of Bulawayo South, featured 12 schools and was held under the theme, “Grooming Learners to be Community Champions in Service above self-using the Education 5.0 Approach.” A […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Bulawayo vendors continue business as usual amid Council relocation plans",
            "url": "https://www.chronicle.co.zw/bulawayo-vendors-continue-business-as-usual-amid-council-relocation-plans/",
            "content": "Online ReporterIts business as usual on Monday in Bulawayos city centre as vendors go about their business while the council is adapting to prioritise the relocation of vendors first before implementing enforcement measures.\n\nLast week, the Government, through the Minister of Local Government and Public Works, Daniel Garwe, issued a 48-hour ultimatum to address the growing incidence of night vending. The argument has been that the surge in unregulated informal trading in the CBD has resulted in increased pedestrian traffic, widespread littering, and disturbances to established businesses within the CBD, making the cities unattractive to investors.\n\nHowever, the Bulawayo City Council (BCC) has decided to take a less aggressive approach to the vending saga, allowing the 48-hour Government ultimatum to lapse incident-free. Deputy Mayor Edwin Ndlovu said on Saturday that they were in the final stages of relocating vendors from 5th Avenue and other areas in town to designated alternative spaces.\n\nThis process will ensure a smoother transition to compliant trading practices. We had already set in motion the process of relocating vendors to designated areas such as Baktas and Egodini when the Government issued the ultimatum. All registered vendors will be moved to the council-constructed available bays, and this relocation process is nearing completion, said Councillor Ndlovu.\n\nRegarding enforcement, he noted that the council was going to collaborate with the Zimbabwe Republic Police to ensure measures were effectively put into place once the relocation had been finalised.\n\nOur enforcement efforts will be around the clock, but we will rely on the police since our municipal officers lack the authority to make arrests, he said.\n\nAccording to statistics, the BCC has a total of 3,416 vending bays in the Central Business District, of which 3,279 are occupied, and only 244 of those have the necessary licences to operate legally. The highest concentration of unlicensed vendors can be found at various sites throughout the city, with significant discrepancies in site allocations and licences.\n\nThe figures provided by the local authority indicate that the city has 16 vending sites in the CBD. The site between Lobengula Street and Herbert Chitepo and 6th Avenue up to 8th Avenue has the highest number of bays (814) that are occupied, where just 12 are licensed. The Highlanders site has 749 bays, with 720 having been allocated and 184 bays being licensed.\n\nAt Baktas (2nd Avenue and Lobengula Street), all 175 bays, despite being allocated, are unlicensed by the local authority. The same applies to the site located at the corner of 6th Avenue and Lobengula Street, where out of the 337 bays available and allocated, none of them are legally licensed to operate by the local authority.\n\nAt Hyper, all the 30 vendors allocated are also not legally licensed to operate. At 6th Avenue Extension, only three vendors out of the 118 that were allocated are licensed to operate at the site, while at the site along Lobengula Street between 5th and 6th Avenue, only three out of the 121 allocated bays are licensed to operate.\n\nThe Flower Trading Site, which is located adjacent to the Large City Hall, has 37 allocated bays, of which just eight are licensed to operate. Meanwhile, the Fruits and Vegetables site, located at the corner of Robert Mugabe Way and 8th Avenue, has 96 bays available, with 52 having been allocated, and of those, just one bay is licensed to operate.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-17-at-15.45.41-1.jpeg",
            "description": "Online Reporter It’s business as usual on Monday in Bulawayo’s city centre as vendors go about their business while the council is adapting to prioritise the relocation of vendors first before implementing enforcement measures. Last week, the Government, through the Minister of Local Government and Public Works, Daniel Garwe, issued a 48-hour ultimatum to address […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Promoting greater regional trade is crucial to attaining food security in Africa – ECA",
            "url": "https://www.chronicle.co.zw/promoting-greater-regional-trade-is-crucial-to-attaining-food-security-in-africa-eca/",
            "content": "Chronicle Writer\n\nTHE United Nations Economic Commission for Africa (ECA) has stressed the urgent need for a more coordinated regional strategy to achieve food security in Eastern Africa while tackling the enduring challenges of trade barriers.This emerged on the sidelines of the ongoing 57th session of the ECAs Conference of African Ministers of Finance, Planning, and Economic Development where Professor Mthuli Ncube is attending as outgoing chairperson.The event, entitled Food Security and Cross-Border Trade: Navigating Challenges and Opportunities Amid the Implementation of the Agreement Establishing the African Continental Free Trade Area (AfCFTA), was organized by the ECAs Subregional Office for Eastern Africa and Eastern Africa Trade Information and Negotiations Institute (SEATINI) on Sunday.It brought together senior officials and experts to discuss the dynamics of food security and cross-border trade within the context of the AfCFTA.Speakers at the event highlighted that while the Eastern Africa region has recently experienced a growing food trade deficit, it is not that large, representing just 0.3 percent of regional Gross Domestic Product and, with the right policies, achieving collective food security is an attainable goal.Acting Director of ECA in Eastern Africa, Mr Andrew Mold, said in the early 2000s, the region transitioned from being a net food exporter to becoming a net importer, with substantial disparities across countries and commodities.A number of countries in our region now sustain large food trade deficits. However, the region is also home to several countries, which are net food exporters. Tanzania and Uganda, in particular, have emerged as leading food exporters, with notable surpluses in key commodities such as maize, he said.Experts at the meeting stressed that the AfCFTA could provide a rapid pathway to achieving greater regional food security. The AfCFTA is an important mechanism to boost intra-regional food trade, particularly in processed agri-food products.Simulations undertaken by ECA suggest that intra-continental food trade could increase by more than 60 percent by 2045 if the AfCFTA is fully implemented. Greater regional cooperation in removing the remaining barriers to intra-African trade offers a path to supply chain resilience in the sector, and ultimately better food security, he said.FAO Subregional Coordinator for Eastern Africa, Farayi Zimudzi, highlighted the pressing issue of low agricultural productivity amidst rapid population growth in Africa.It is imperative that our agricultural production systems keep pace with population growth, she stressed.Increasing investment in research and development, particularly in high-yield crop varieties and improved livestock, must be prioritized.Channing Arndt, a Research Professor and Director of the Center for Global Trade Analysis, said that the persistent issue of high tariffs and non-tariff barriers (NTBs) continues to impede the free movement of agricultural products in Africa.The session was moderated by Jane Nalunga, Director of SEATINI-Uganda who reiterated the importance of leveraging digital solutions and sustainable agricultural practices for Africas food security.She called on researchers to explore how technological advancements and green innovations can transform food systems and build resilience.The event also advocated for the implementation of the Comprehensive Africa Agriculture Development Programme (CAADP) to address productivity challenges and enhance agricultural investment across the continent. CAADP is aimed at increasing food security and nutrition, reducing rural poverty, creating employment, and contributing to economic development while safeguarding the environment.Moreover, CAADP aims for a six per cent annual growth rate in the agricultural sector, with African Union member states allocating at least 10 per cent of their budgets to agriculture.The side event concluded with a resounding call for strengthened regional cooperation to implement the AfCFTA, through the elimination of trade barriers to food stuffs, while increasing investment in agricultural development to ensure a food-secure future for Eastern Africa and the Continent as a whole.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/q.jpg",
            "description": "Chronicle Writer THE United Nations Economic Commission for Africa (ECA) has stressed the urgent need for a more coordinated regional strategy to achieve food security in Eastern Africa while tackling the enduring challenges of trade barriers. This emerged on the sidelines of the ongoing 57th session of the ECA’s Conference of African Ministers of Finance, […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Podium athletes only for national finals, vows Nash Matabeleland North",
            "url": "https://www.chronicle.co.zw/podium-athletes-only-for-national-finals-vows-nash-matabeleland-north/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nMATABELELAND North will henceforth only take podium athletes to represent the province in national track and field athletics competitions, provincial National Association of Secondary School Heads (Nash), head in charge of athletics Abraham Netha has said.\n\nNetha said this ahead of the provinces inter-district track and field athletics competitions that will see seven districts converging at Manjolo High School from tomorrow until Friday where they will then select their provincial squad to meet other provinces at the national finals at Chipadze High School in Bindura, Mashonaland Central province next month.\n\nThe only way we can do well as a province is for us to consider quality over quantity. As we head for our provincials at Manjolo High School, our position is that we want to take podium athletes only. It doesnt matter whether one gets gold, as long as we feel the standard will be below what is expected at national level, we will not take that athlete to Bindura, said Netha.\n\nIn terms of preparations for the provincial meet, the George Silundika High School headmaster said it was all systems go, with districts expected to start arriving in Binga from tomorrow ahead of vetting on Tuesday.\n\nNetha said vetting of athletes will be conducted by district Heads in Charge of athletics to ensure a smooth flow of competitions with no cheating.\n\nBubi district are the defending champions after amassing 24 gold, 21 silver and 14 bronze medals and were followed by Lupane who managed 22 gold, 19 silver and bronze medals respectively.\n\nHwange was third with 17 gold and silver medals as well as 18 bronze respectively.\n\nUmguza had the same number of gold medals, but came short on silver after getting 15 while managing nine bronze medals.\n\nNkayi and Tsholotsho came fifth and sixth respectively, while hosting district this year, Binga was last.\n\nMeanwhile, host province Mashonaland Central Province is leaving no stone unturned as they prepare to welcome nine provinces for the national finals from April 1-4.\n\nSpeaking to New Ziana, Mashonaland Central schools, sports inspector, Tinashe Mushore said preparations are 90 percent complete.\n\nThe ablution block is almost finished with only roofing and piping left to be done. A 500-capacity terrace has been built with final compaction work completed. The terrace will be reserved for guests, while others will be accommodated in tents.\n\nThe host schools will occupy the open spaces. To address water supply concerns, solarisation has been implemented to power boreholes, ensuring a 24-hour supply. A network of water pipes is currently being installed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/falls-8.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw MATABELELAND North will henceforth only take podium athletes to represent the province in national track and field athletics competitions, provincial National Association of Secondary School Heads (Nash), head in charge of athletics Abraham Netha has said. Netha said this ahead of the province’s inter-district track and field athletics competitions that will see seven […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Magwizi pushes for new stadium, head office … Harare avails sports club, land to Zifa … Rufaro, Gwanzura to be refurbished",
            "url": "https://www.chronicle.co.zw/magwizi-pushes-for-new-stadium-head-office-harare-avails-sports-club-land-to-zifa-rufaro-gwanzura-to-be-refurbished/",
            "content": "Sports Reporter\n\nHarare City Council is set to give the Zimbabwe Football Association (Zifa) 40 hectares and a sports club for the construction of a stadium and headquarters.\n\nMayor Jacob Mafume confirmed the developments after meeting Zifa president Nqobile Magwizi in Harare today.\n\nApart from the HighGlen land deal, the city says it will also partner with the association to ensure that Rufaro and Gwanzura are renovated, among other agreements.\n\nWe will avail one of our sports clubs for the building of the Zifa headquarters. It will go through the committees tomorrow.\n\nWe are also keen to avail one of our sports grounds to Zifa. We want to develop it, the 40-hectare HighGlen Stadium, said Mafume.\n\nThe HighGlen land is designated for the construction of a stadium, according to the citys master plan.\n\nWe are willing to avail that land to Zifa for assistance. We would not want them to give us money, but we would want them to assist us in developing Rufaro and Gwanzura Stadia.\n\nWe will also avail another sports club for the Mighty Warriors and develop that facility. We will also name that facility in due course, said Mafume.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-17-at-14.56.34.jpeg",
            "description": "Sports Reporter Harare City Council is set to give the Zimbabwe Football Association (Zifa) 40 hectares and a sports club for the construction of a stadium and headquarters. Mayor Jacob Mafume confirmed the developments after meeting Zifa president Nqobile Magwizi in Harare today. Apart from the HighGlen land deal, the city says it will also […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Minister Shava officially opens WFP-NUST Symposium focused on building resilient communities",
            "url": "https://www.chronicle.co.zw/minister-shava-officially-opens-wfp-nust-symposium-focused-on-building-resilient-communities/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE Minister of Higher and Tertiary Education, Science, Innovation, and Technology Development, Ambassador Frederick Shava, officially opened the World Food Programme (WFP)-National University of Science and Technology (NUST) Research Symposium at the NUST campus on Monday morning.\n\nThe symposium, running under the theme Building Resilient Communities for Sustainable Futures, is aligned with Zimbabwes National Development Strategy 1 (NDS1) and Vision 2030, which aims to transform the nation into a prosperous, upper-middle-income society.\n\nAmbassador Shava commended WFP for its global efforts, highlighting its work in 80 countries, where it provides assistance to over 80 million people. We recognise WFPs work in providing emergency food assistance to affected populations, particularly during natural disasters or conflicts. WFP also supports vulnerable communities in rebuilding their lives and livelihoods after disasters such as floods, said Amb Shava.\n\nHe emphasised the importance of the partnership between NUST and WFP in addressing the root causes of hunger and malnutrition. This collaboration is key to national development, as it brings together government, partners, and local communities to tackle these critical challenges, he added.\n\nThe three-day symposium brings together researchers and academics to explore lasting solutions for building resilient communities and ensuring sustainable futures. The event concludes on Wednesday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/aaaa.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com THE Minister of Higher and Tertiary Education, Science, Innovation, and Technology Development, Ambassador Frederick Shava, officially opened the World Food Programme (WFP)-National University of Science and Technology (NUST) Research Symposium at the NUST campus on Monday morning. The symposium, running under the theme “Building Resilient Communities for Sustainable Futures,” is aligned with Zimbabwe’s […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Experts call for inclusive growth and decent work under AfCFTA",
            "url": "https://www.chronicle.co.zw/experts-call-for-inclusive-growth-and-decent-work-under-afcfta/",
            "content": "Chronicle Writer\n\nON the margins of the 57th Session of the Economic Commission for Africa (ECA) in Addis Ababa, Ethiopia, policymakers, business leaders, and development partners have discussed how African businesses can successfully trade under the African Continental Free Trade Area (AfCFTA) while fostering inclusive growth and decent work.\n\nProf Mthuli Ncube delivered opening remarks at the conference, in Addis Ababa\n\nOrganized by the United Nations Economic Commission for Africa (ECA Subregional office for Southern Africa, the Africa Trade Policy Center and the Subregional office for northern Africa) and the International Labour Organization (ILO), the event underscored both the transformative potential of AfCFTA and the pressing need for action to ensure businesses, particularly micro, small and medium enterprises (MSMEs), can reap its benefits.Opening the session, Eunice G. Kamwendo, Director of ECAs Subregional Office for Southern Africa, emphasized that the AfCFTA is not just about transactions but about people.She stressed that MSMEs, which account for 90 percent of businesses and 80 percent of employment, must have the tools to succeed, as they are key drivers of economic transformation in Africa.On his part, Melaku Desta, Coordinator of ATPC at ECA, introduced the Step-by-Step Guide for Trade in Goods under AfCFTA, a practical tool to help businesses navigate trade procedures and access market opportunities. He emphasized that while National AfCFTA Implementation Strategies have been developed, they remain largely public-sector focused, leaving MSMEs with limited direct support.Teddy Soobramanien, CEO of the COMESA Business Council, emphasized the urgency of moving beyond policy discussions, urging the private sector to turn AfCFTA from paper into action.He called on businesses to actively leverage the agreement for regional trade expansion, ensuring that AfCFTAs potential is fully realized.Addressing the issue of labour rights, Hod Anyigba, Executive Director of the Africa Labour Research and Education Institute (ALREI) and Chief Economist at the International Trade Union Confederation (ITUC)-Africa, stressed that trade must serve people, not just profits.He called for stronger labour protections, corporate accountability, and due diligence in AfCFTA implementation, warning that without these safeguards, trade liberalization could lead to informal employment and deteriorating working conditions.Marva Corley-Coulibaly, Chief of Globalization, Competitiveness and Labour Standards at the ILO, emphasized that good jobs do not happen automatically.Just as we meticulously plan trade, industrial, and investment policies, we must also plan for decent work, not as an afterthought, she stated.While AfCFTA includes some labour provisions, she pointed out that critical gaps remain, particularly in addressing issues like modern slavery, human trafficking, and workplace safety.She proposed the introduction of a Trade and Sustainable Development Protocol to ensure that trade translates into decent work and economic justice.Bringing the discussion to the role of women and youth entrepreneurs, Cynthia E. Gnassingbe, Senior Advisor to the AfCFTA Secretariat, underscored the importance of expanded market access, reduced trade barriers, and institutional support. She highlighted that the Women and Youth in Trade Protocol and the Digital Trade Protocol offer a framework for inclusive participation but need stronger financing mechanisms to ensure MSMEs can access affordable capital. She also called for capacity-building programs that provide business training, mentorship, and networking opportunities to empower entrepreneurs.Experts highlighted key actions to maximize AfCFTAs impact. These include promoting fair trade and decent work by strengthening labour protections, ensuring enforcement, and advancing social inclusion and aligning national policies for full AfCFTA implementation.Support for MSMEs, women, and youth with financing and training as well as improving trade facilitation with clear regulations and tools is also under focus with the private sector urged to turn policies into action.The ILOs Decent Work Toolkit, which facilitates the examination of labour provisions in trade agreements and the impact of trade policy on labour markets, along with ECAs Step-by-Step Guide for Trade in Goods under AfCFTA, serve as valuable tools to support private sector trade while promoting decent work. The session underscored the need for collaboration to ensure AfCFTA drives economic transformation for businesses and workers across Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/544345.jpg",
            "description": "Chronicle Writer ON the margins of the 57th Session of the Economic Commission for Africa (ECA) in Addis Ababa, Ethiopia, policymakers, business leaders, and development partners have discussed how African businesses can successfully trade under the African Continental Free Trade Area (AfCFTA) while fostering inclusive growth and decent work. Organized by the United Nations Economic […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Chiefs and stakeholders unite in Bulawayo for “Not in My Village” Campaign to combat HIV/AIDS and child marriages",
            "url": "https://www.chronicle.co.zw/chiefs-and-stakeholders-unite-in-bulawayo-for-not-in-my-village-campaign-to-combat-hiv-aids-and-child-marriages/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nCHIEFS from Matabeleland South and other stakeholders have gathered in Bulawayo for the Not in My Village Campaign, an initiative aimed at enhancing the involvement of traditional leaders in the fight against HIV/AIDS and child marriages.\n\nThe programme inception meeting, organised by the National AIDS Council (NAC), provides a platform for chiefs and stakeholders to discuss strategies for combating HIV/AIDS and addressing social challenges contributing to the spread of the disease in their communities.\n\nLaunched last year as a pilot programme in Mashonaland Central, Not in My Village is now being rolled out to other provinces, including Matabeleland South. The campaign seeks to promote inclusivity and community-driven solutions in the fight against HIV/AIDS while addressing issues such as teenage pregnancies and child marriages, which deprive children of their childhood, education, health, and future opportunities.\n\nChild marriages in the province are driven by interrelated factors such as poverty, gender norms, cultural and religious beliefs, and lack of access to services and information. The campaign aims to raise awareness and mobilise action by engaging traditional leaders to end child marriages.\n\nKey objectives of the campaign include: Increasing knowledge and awareness among traditional leaders and the public about the causes and consequences of child marriage, changing attitudes and behaviours of community gatekeepers and the general public towards child marriage, promoting the rights and well-being of girls, empowering communities to take action to prevent and respond to child marriage and supporting the implementation and enforcement of laws and policies protecting girls from child marriage.\n\nThe Not in My Village Campaign is part of NACs broader strategy to ensure no one and no place is left behind in the efforts to eradicate HIV/AIDS and related social challenges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/lllllooooooo.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw CHIEFS from Matabeleland South and other stakeholders have gathered in Bulawayo for the “Not in My Village” Campaign, an initiative aimed at enhancing the involvement of traditional leaders in the fight against HIV/AIDS and child marriages. The programme inception meeting, organised by the National AIDS Council (NAC), provides a platform for chiefs and […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        },
        {
            "title": "Woman (39) teams up with Juveniles aged 16 in US$25k robbery, buy Honda Fit and iPhones with loot",
            "url": "https://www.chronicle.co.zw/woman-39-teams-up-with-juveniles-aged-16-in-us25k-robbery-buy-honda-fit-and-iphones-with-loot/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nPOLICE have confirmed the arrest of three suspects, including two juveniles, in connection with a theft case in Chikanga, Mutare, where a significant amount of cash was stolen.\n\nMunyararadzi Madzure (39) and two 16-year-old juveniles were taken into custody by the police. The trio allegedly stole US$25 000 from the complainant. Instead of lying low, the suspects used the stolen money to purchase a Honda Fit vehicle and three iPhones.\n\nThanks to swift police action, the suspects were tracked down, and the stolen goods, including the motor vehicle and mobile phones, were recovered. The ZRPs prompt and effective response has brought the perpetrators to justice.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/robbery-680x340.jpg",
            "description": "  Sidumisile Mabena, sidumisile77mabena@gmail.com POLICE have confirmed the arrest of three suspects, including two juveniles, in connection with a theft case in Chikanga, Mutare, where a significant amount of cash was stolen. Munyararadzi Madzure (39) and two 16-year-old juveniles were taken into custody by the police. The trio allegedly stole US$25 000 from the complainant. Instead […]",
            "time": "20:26",
            "date": "17 Mar 2025"
        }
    ]
}