{
    "news": [
        {
            "title": "Scottland FC visits Zimbabwe Embassy in Zambia.",
            "url": "https://www.chronicle.co.zw/scottland-fc-visits-zimbabwe-embassy-in-zambia/",
            "content": "Welldone Ndlovu, Online Reporter\n\nScotland FC, owned by Zimbabwean businessman and politician Scott Sakupwanya, recently paid a visit to the Zimbabwean Embassy in Zambia.\n\nDuring the visit, the team engaged in a meet-and-greet session with embassy officials and also showcased their new jersey designs, proudly presenting their team brand.\n\nThe Mabvuku based side are in Zambia for a three weeks pre- season as they are gearing up for their maiden season in the Castle Lager Premiership after winning the Northern Division One league.\n\nYesterday, Scotland FC took on Zambias National Division One side, River Plate, in a friendly doubleheader at the Reiz Arena, Woodlands Stadium.\n\nThe first match ended in a 1-1 draw, with Kudzai Steven Jason scoring for Scotland FC, while Musonda equalized for River Plate from the penalty spot.\n\nIn the second match, Scotland FC secured a hard-fought 1-0 victory over River Plate, courtesy of a goal from Tymon Machope.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fgdg.jpg",
            "description": "Welldone Ndlovu, Online Reporter Scotland FC, owned by Zimbabwean businessman and politician Scott Sakupwanya, recently paid a visit to the Zimbabwean Embassy in Zambia. During the visit, the team engaged in a meet-and-greet session with embassy officials and also showcased their new jersey designs, proudly presenting their team brand. The Mabvuku based side are in […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "President Mnangagwa appoints Deputy Ministers for Mines and Local Government",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-appoints-deputy-ministers-for-mines-and-local-government/",
            "content": "Online Reporter\n\nPRESIDENT Mnangagwa has appointed two Deputy Ministers, one for the Ministry of Mines and Mining Development and the other for the Ministry of Local Government and Public Works.\n\nIn a statement released on Thursday evening, the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, announced that Honourable Albert Mavhunga and Honourable Caleb Makwiranzou have been appointed with immediate effect.\n\nHonourable Mavhunga will serve as the Deputy Minister of Local Government and Public Works, responsible for Local Authorities and Traditional Leadership. Honourable Makwiranzou has been appointed as the Deputy Minister of Mines and Mining Development, overseeing Oil and Gas Research, as well as Strategic Minerals and Exploration.\n\nDr Rushwaya stated that the appointments are made in terms of Section 104, Subsection 2 of the Constitution of Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/GFFFBBBBBB.jpg",
            "description": "Online Reporter PRESIDENT Mnangagwa has appointed two Deputy Ministers, one for the Ministry of Mines and Mining Development and the other for the Ministry of Local Government and Public Works. In a statement released on Thursday evening, the Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, announced that Honourable Albert Mavhunga and Honourable […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Beitbridge-Masvingo fatal accident: EMA to deploy team to scene",
            "url": "https://www.chronicle.co.zw/beitbridge-masvingo-fatal-accident-ema-to-deploy-team-to-scene/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nThe Environmental Management Authority (EMA) is expected to send a team to assess the accident scene where 24 people lost their lives on the Masvingo-Beitbridge Highway on Thursday morning, following concerns over the potential presence of magnesium at the site.\n\nZimbabwe awoketo the tragic news of a head-on collision between an Urban Connect bus and an Auro Transport haulage truck at the Lutumba Tollgate, approximately 25 kilometres from Beitbridge Town.\n\nThe horrific accident occurred at around 7:00 AM along the Beitbridge-Masvingo Highway.Seventeen peopledied on the spot, while seven others succumbed to their injuries upon admission to Beitbridge District Hospital.\n\nIt is believed that the haulage truck involved in the collision was carrying magnesium, a mineral that could pose environmental and health risks if spilled.\n\nOur team will have to go on the ground for a status report to ascertain if the truck was really carrying magnesium because, at this moment, it is still speculation that a mineral could have been spilled at the crash site, said Ms Amkela Sidange, EMAs Environmental Education and Publicity Manager.\n\nEMA is responsible for cleaning up and treating sites where chemicals or minerals are spilled after accidents to safeguard the environment, livestock, wildlife, and humans.\n\nIn response to the tragedy,President Mnangagwahas declared the Beitbridge accident, which claimed 24 lives on Thursday morning, a National Disaster. The President also extended his condolences to the families of the deceased.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Ms-Amkela-Sidange-EMA’s-Environmental-Education-and-Publicity-Manager.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  The Environmental Management Authority (EMA) is expected to send a team to assess the accident scene where 24 people lost their lives on the Masvingo-Beitbridge Highway on Thursday morning, following concerns over the potential presence of magnesium at the site. Zimbabwe awoke to the tragic news of a head-on collision between an Urban […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "“I’m horrified and heartbroken” – President Mnangagwa as he declares Beitbridge accident a National Disaster",
            "url": "https://www.chronicle.co.zw/im-horrified-and-heartbroken-president-mnangagwa-as-he-declares-beitbridge-accident-a-national-disaster/",
            "content": "Bongani Ndlovu, Online Reporter\n\nPRESIDENT Mnangagwa has declared the Beitbridge accident, which claimed 24 lives on Thursday morning, a National Disaster, as he paid his condolences to the families of the deceased.\n\nZimbabwe awoke to the tragic news that 24 people had died following a head-on collision between an Urban Connect bus and an Auro Transport haulage truck at Lutumba tollgate, about 25 km out of Beitbridge Town.\n\nThe horrific accident occurred at around 7am along the Beitbridge- Masvingo highway. Seventeen people died on the spot, while seven others died upon admission to the Beitbridge District Hospital.\n\nIn a statement on Thursday evening, President Mnangagwa, expressed his deepest and heartfelt condolences, saying Government would assist the victims with a state-assisted burial.\n\nGovernment has therefore declared this incident a National Disaster and will accord the victims of this horrendous crash a State-assisted burial. As I express my deepest, heartfelt condolences to the families and relatives who have lost their loved ones in this horrific crash, I also prayerfully reach out to all those injured and hospitalised, wishing them a speedy recovery, said President Mnangagwa.\n\nHe added that Zimbabwe does not deserve this at all, let alone experiencing such a bloody incident at the beginning of the year.\n\nThe death of 24 Zimbabweans in a head-on collision between an Urban Connect bus and a commercial haulage truck, along the Beitbridge-Masvingo Highway this morning, left me horrified and heartbroken.\n\nFellow Zimbabweans, our nation does not deserve this at all, let alone experiencing such a bloody incident at the beginning of the year. We must do all that is possible to curb this unjustified loss of life, said the President.\n\nHe appealed to all motorists to exercise extreme caution on the road, for the sake of both fellow road users and themselves.\n\nAll arms of the Government that are responsible for ensuring safety on our roads are thus constantly reminded to work around the clock and employ all legal means and powers available to them to reduce and ultimately put an end to such carnage, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/LIVE-TEMPLATE-copy-680x380.jpg",
            "description": "Bongani Ndlovu, Online Reporter PRESIDENT Mnangagwa has declared the Beitbridge accident, which claimed 24 lives on Thursday morning, a National Disaster, as he paid his condolences to the families of the deceased. Zimbabwe awoke to the tragic news that 24 people had died following a head-on collision between an Urban Connect bus and an Auro […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Jeys Marabini promises unforgettable night of jazz at Valentine’s show",
            "url": "https://www.chronicle.co.zw/jeys-marabini-promises-unforgettable-night-of-jazz-at-valentines-show/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nMusician Jeys Marabini will stage his first show of the year on Valentines Day tomorrow at Zarah Lounge, where he will share the stage with Prosper Tshuma and the Smart Birds Band.\n\nDubbed the Golden XCape, the Golden Pilsener-sponsored event promises to give jazz lovers a memorable night celebrating love and unions.\n\nJeys Marabini expressed his excitement for the gig, which marks the launch of his 2025 roadmap, set to bring significant growth to his brand.Im excited about this show as it marks our first for the year. Weve been working hard behind the scenes. This year, our fans should expect new music, great shows, and unforgettable nights.As its a day to celebrate love, I urge people to come prepared to enjoy. They must not forget their dancing shoes, as Ill be playing all their favourite songs. Also, Prosper is a fantastic musician, so its going to be a great night to remember. Im looking forward to sharing the stage with him, said Jeys Marabini.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/3wwwwwwwwwwey.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Musician Jeys Marabini will stage his first show of the year on Valentine’s Day tomorrow at Zarah Lounge, where he will share the stage with Prosper Tshuma and the Smart Birds Band. Dubbed the Golden XCape, the Golden Pilsener-sponsored event promises to give jazz lovers a memorable night celebrating love and unions. […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Beitbridge accident: Bus tried to overtake killing 24 – Police",
            "url": "https://www.chronicle.co.zw/beitbridge-accident-bus-tried-to-overtake-killing-24-police/",
            "content": "Sidumisile Mabena,[emailprotected]POLICE have said 24 people died in a tragic accident on the Masvingo-Beitbridge highway on Thursday at around 8AM.In a statement, National Police spokesperson Commissioner Paul Nyathi said an Urban Connect bus carrying 65 passengers had a head on collision with an Auro Transport haulage truck with four occupants resulted in the deaths of 24 people.The bus was travelling from Harare to Beitbridge while the truck was travelling in the opposite direction, said Commissioner Nyathi.He said preliminary investigations suggest that the accident occurred as the bus attempted to overtake another vehicle.The number of injured people is still being determined. The bodies of the victims have been taken to Beitbridge District Hospital mortuary for post-mortem, while the injured are receiving treatment at the same hospital, said Commissioner Nyathi.He said police are investigating the scene and more details will be released as they become available.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/thyedth.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com POLICE have said 24 people died in a tragic accident on the Masvingo-Beitbridge highway on Thursday at around 8AM. In a statement, National Police spokesperson Commissioner Paul Nyathi said an Urban Connect bus carrying 65 passengers had a head on collision with an Auro Transport haulage truck with four occupants resulted in […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "President Mnangagwa leaves for AU Summit",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-leaves-for-au-summit-2/",
            "content": "Harare Bureau\n\nPresident Mnangagwa, who is also the SADC chairperson, has left the country for Addis Ababa, Ethiopia where he will join other African leaders for the 38th Ordinary Session of the African Union summit which will tackle political, economic and social issues affecting the continent.\n\nThe President was seen off at Robert Gabriel Mugabe International Airport by Vice Presidents Constantino Chiwenga and Kembo Mohadi,Government Ministers, Service Chiefs and senior Government officials.\n\nAt the sidelines of the summit, President Mnangagwa is also expected to hold bilateral meetings with other leaders aimed at deepening cooperation.\n\nThe summit is running under the Theme, Justice for Africans and People of African Descent Through Reparations.\n\nThis theme was decided on by the Heads of State and Government at the 37th Ordinary Session of the Assembly of the Union held in February 2023 in Addis Ababa, Ethiopia.\n\nAhead of the main weekend summit, the leaders will hold an emergency session on Friday to discuss the violence in DRC, where the M23 armed group has seized parts of the mineral-rich east part of the country.\n\nThis follows a joint summit of eastern and southern African blocs last week which called for a ceasefire.\n\nAngolan President Joao Lourenco, will take over the rotating presidency of the AU at the weekend while a new chairman will be chosen by vote.\n\nIncumbent Moussa Faki Mahamat of Chad, has reached the two-term limit and the trio of Djiboutis Foreign Minister Mahmoud Ali Youssouf, Kenyan Raila Odinga and Madagascars ex-foreign minister Richard Randriamandrato is vying to replace him.\n\nThis time, the position is reserved for an East African.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-13-at-14.38.32-1-680x380.jpeg",
            "description": "Harare Bureau President Mnangagwa, who is also the SADC chairperson, has left the country for Addis Ababa, Ethiopia where he will join other African leaders for the 38th Ordinary Session of the African Union summit which will tackle political, economic and social issues affecting the continent. The President was seen off at Robert Gabriel Mugabe […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "ZANU PF Economic Development Cluster tours Bulawayo industries to assess performance",
            "url": "https://www.chronicle.co.zw/zanu-pf-economic-development-cluster-tours-bulawayo-industries-to-assess-performance/",
            "content": "Sikhulekelani Moyo, Online reporter\n\nThe ZANU PF Economic Development and Empowerment Cluster has embarked on a tour of Bulawayo industries to assess the prevailing conditions and performance of key sectors.\n\nThe delegation, led by ZANU PF Secretary for Business Development, Cde Elifasi Mashaba, aims to gain an objective view of the challenges and opportunities within the citys industrial landscape.\n\nThe tour began with a brief meeting where the Permanent Secretary outlined the itinerary, which includes visits to Ref Air, the National Railways of Zimbabwe (NRZ), the Leather Cluster, United Bulawayo Hospitals (UBH) for a solar project inspection, and the Mahatshula Housing Project to evaluate the effects of public-private partnerships (PPPs).\n\nIn his remarks, Cde Mashaba emphasised the importance of the tour, stating,\n\nThe ruling party has deemed it necessary to embark on this crucial tour to assess the prevailing conditions of the industries. This tour will provide us with an objective view of the performance of industries here in Bulawayo.\n\nAt General Beltings Holdings (GBH), General Manager Mr Joseph Gunda highlighted the companys need for US 20 million to acquire machinery for producing steelcoded belts.He revealed that in 2023, Zimbabwe imported US 18 million worth of steel-coded belts, significantly increasing the nations import bill.\n\nOur market share is between 25 to 30 percent, said Mr Gunda.The Government has supported us by restricting the importation of conveyor belts and some local companies have also backed us. However, most of our raw materials are imported from South Africa and China.\n\nMr Gunda also noted that GBH recently acquired a 3D mixer to increase production capacity, improve product quality, and enhance competitiveness. Despite these efforts, the company faces challenges, including the influx of cheap imports disguised as steel-coded belts, which undermines local production.\n\nCde Mashaba expressed concern over the challenges faced by GBH, particularly the issue of imported goods masquerading as steel-coded belts.\n\nIm very much touched by your presentation. There are a lot of interventions the party and the Government are doing. Im touched by these belts that come in as steel-coded belts, so we need to ensure that anything coming in with coded belts is investigated further, he said.\n\nHe added that the party is working closely with border authorities to address these issues and will share insights from the tour to strengthen local industry protection. Each country should protect its own industry by banning anything that is not manufactured here, said Cde Mashaba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/DQW.jpg",
            "description": "Sikhulekelani Moyo, Online reporter The ZANU PF Economic Development and Empowerment Cluster has embarked on a tour of Bulawayo industries to assess the prevailing conditions and performance of key sectors. The delegation, led by ZANU PF Secretary for Business Development, Cde Elifasi Mashaba, aims to gain an objective view of the challenges and opportunities within […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Phiri, Machana throw in the towel",
            "url": "https://www.chronicle.co.zw/phiri-machana-throw-in-the-towel/",
            "content": "Zimpapers Spots Hub\n\nTWINE Phiri and Philemon Machana have withdrawn their Zifa elections appeal at the Court of Arbitration of Sport in SwitzerlandThe two had been challenging Nqobile Magwizis election citing influences of third parties and wanted a re-run of the elections and Magwizi disqualified.We therefore announce as we hereby do, that we are withdrawing the CAS appeal. Likewise we urge all stakeholders to accept and appreciate our decision and in equal measure, to rally behind and support the new executive committee, read at statement from Phiri and Machana.The duo had previously cited that the elections were not free and fair due to third-party influence from businessman Wicknell Chivayo and should be declared null and void.Hours before the polls, Chivayo promised Zifa councillors new cars and a US$10 million donation to the football body if they voted for Magwizi.Magwizi later won the election.Magwizi recorded the highest victory in a Zifa presidential election.None of the other contesting presidential candidates managed a double figure in their defeat, Machana managed six votes while Phiri had four.Marshall Gore another losing candidate managed only one vote while former football player Makwinji Soma-Phiri had zero.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/QSAX.jpg",
            "description": "Zimpapers Spots Hub TWINE Phiri and Philemon Machana have withdrawn their Zifa elections appeal at the Court of Arbitration of Sport in Switzerland The two had been challenging Nqobile Magwizi’s election citing influences of third parties and wanted a re-run of the elections and Magwizi disqualified. “We therefore announce as we hereby do, that we […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        },
        {
            "title": "Matabeleland South schools honoured at joint Secretary Merit Awards ceremony",
            "url": "https://www.chronicle.co.zw/matabeleland-south-schools-honoured-at-joint-secretary-merit-awards-ceremony/",
            "content": "Online ReporterTHE Ministry of Primary and Secondary Education is today holding a Joint Secretary Merit Awards ceremony for Matabeleland South Province, where eight schools will be honoured.The ceremony is being held at Minda High School in Matobo District.Schools receiving the Secretarys Bell are Minda, Tongwe, Mzingwane, and Thekwane High Schools, while Dingumuzi, Filabusi, Collenbawn, and Oakleigh will receive awards for excelling as primary schools.The merit awards cover the period from 2021 to 2024.The awards are running under the theme: Blended Secretary Merit Awards: Implementing the Heritage-Based Curriculum Towards Achieving Vision 2030.The programme began with the Permanent Secretary for Primary and Secondary Education, Mr Mike Mhike, touring projects implemented by pupils at Minda High School.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/kojd.jpg",
            "description": "Online Reporter THE Ministry of Primary and Secondary Education is today holding a Joint Secretary Merit Awards ceremony for Matabeleland South Province, where eight schools will be honoured. The ceremony is being held at Minda High School in Matobo District. Schools receiving the Secretary’s Bell are Minda, Tongwe, Mzingwane, and Thekwane High Schools, while Dingumuzi, […]",
            "time": "21:46",
            "date": "13 Feb 2025"
        }
    ]
}