{
    "news": [
        {
            "title": "Plumtree Town Council terminates service contract for Gwakuba Heights residential stands",
            "url": "https://www.chronicle.co.zw/plumtree-town-council-terminates-service-contract-for-gwakuba-heights-residential-stands/",
            "content": "Ronald MpofuPlumtree Town Council yesterday announced the termination of its contract with Gasavu Contractors, the company awarded the service contract for Gwakuba Heights residential stands in 2016.Residents of Gwakuba Heights have been officially informed that Gasavu Contractors contract was terminated effective 31 December 2024, due to the contractors failure to meet the agreed terms for servicing the area.Property owners/clients who have any claims (Gasavu lease agreements, stand purchase forms/receipts) in the Gwakuba Heights area are advised to lodge the same in writing with the Council Housing & Community Services Department, read the councils statement.The council added that it is currently verifying stand ownership and assessing outstanding works for water, sewer, and road infrastructure. This process aims to determine the capital investment required to fully service the area.Gwakuba Heights is a mixed-density residential area with stand sizes ranging from 200 to 800 square metres.The main objectives of Gasavu Contractors for the Gwakuba Heights residential area were to provide water and sewer reticulation as well as road infrastructure. However, during their tenure, the development they delivered to Plumtree Town Council and residents was minimal, leading to the contract termination, said Mr Thembalami Nyoni, the Town Secretary.The council has assured residents that it remains committed to ensuring the completion of outstanding works and will take necessary steps to fulfil its obligations in developing Gwakuba Heights.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dgtre.jpg",
            "description": "Ronald Mpofu Plumtree Town Council yesterday announced the termination of its contract with Gasavu Contractors, the company awarded the service contract for Gwakuba Heights residential stands in 2016. Residents of Gwakuba Heights have been officially informed that Gasavu Contractors’ contract was terminated effective 31 December 2024, due to the contractor’s failure to meet the agreed […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "National Hero Status for MAJOR General (Retired) Solomon Siziba",
            "url": "https://www.chronicle.co.zw/national-hero-status-for-major-general-retired-solomon-siziba/",
            "content": "Nqobile[emailprotected]\n\nMAJOR General (Retired) Solomon Siziba who died on Wednesday has been declared a national hero.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube delivered the Presidential condolence message in Bulawayo today where she also revealed that he has been declared a national hero.\n\nHe will be buried at the National Heroes Acre at a date to be announced.Matabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu is also part of the mourners.The funeral is being held at Maj Gen (Rtd) Sizibas house in Killarney, Bulawayo.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fgjfgj.jpg",
            "description": "Nqobile Tshili-nqobile.tshili@chronicle.co.zw MAJOR General (Retired) Solomon Siziba who died on Wednesday has been declared a national hero. Bulawayo Provincial Affairs and Devolution Minister Judith Ncube delivered the Presidential condolence message in Bulawayo today where she also revealed that he has been declared a national hero. He will be buried at the National Heroes Acre at […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Ministry of Lands equips field officers with 6 000 tablets to boost agricultural productivity",
            "url": "https://www.chronicle.co.zw/ministry-of-lands-equips-field-officers-with-6-000-tablets-to-boost-agricultural-productivity/",
            "content": "Online writer\n\nSANYATI  Mashonaland West- THE Ministry of Lands, Agriculture, Fisheries, Water and Rural Development has today handed over 6 000 tablets to field officers, a move aimed at enhancing their capacity to serve farmers more effectively.The tablets, donated by President Emmerson Mnangagwa, are expected to significantly improve data access, analysis, and service delivery within the agricultural sector.By equipping field officers with advanced technology, the ministry aims to ensure timely and accurate information is relayed to farmers, facilitating better decision-making and resource management.This initiative comes at a crucial time as the government seeks to modernise agriculture and increase productivity in line with the national Vision 2030 strategy.Distribution of the tablets underscores the Governments commitment to empowering agricultural workers and improving the livelihoods of farmers across the country.With enhanced access to data, field officers will be better positioned to respond to the needs of farmers, ultimately contributing to improved agricultural outcomes and food security.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jyukiyuiu-680x380.jpg",
            "description": "Online writer SANYATI – Mashonaland West- THE Ministry of Lands, Agriculture, Fisheries, Water and Rural Development has today handed over 6 000 tablets to field officers, a move aimed at enhancing their capacity to serve farmers more effectively. The tablets, donated by President Emmerson Mnangagwa, are expected to significantly improve data access, analysis, and service […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "New Magistrate Court opens in Shamva, enhancing access to justice",
            "url": "https://www.chronicle.co.zw/new-magistrate-court-opens-in-shamva-enhancing-access-to-justice/",
            "content": "Online WriterTHE Judicial Service Commission (JSC) has officially inaugurated a fully-fledged magistrate court in Shamva, a significant development aimed at improving access to justice in the region.Ms Ruramai Chitumbura has been appointed as the resident magistrate, bringing her expertise to the newly established court.Previously, residents of Shamva had to travel to Bindura or Mt Darwin for court proceedings, a situation that often posed challenges for many, particularly those from remote areas. The courts opening aligns with the Governments devolution agenda, which seeks to decentralise services and promote local governance, ensuring that justice is more accessible to all citizens.This initiative not only reflects the JSCs commitment to enhancing the judicial system but also supports the broader Vision 2030 strategy, which aims to create a prosperous and equitable society through improved public services.With the establishment of the Shamva Magistrate Court, residents can now expect more efficient and timely legal proceedings, fostering a sense of justice and community trust in the legal system.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/v-sgd.jpg",
            "description": "Online Writer THE Judicial Service Commission (JSC) has officially inaugurated a fully-fledged magistrate court in Shamva, a significant development aimed at improving access to justice in the region. Ms Ruramai Chitumbura has been appointed as the resident magistrate, bringing her expertise to the newly established court. Previously, residents of Shamva had to travel to Bindura […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Bulawayo mourns two former Councillors in separate burial ceremonies",
            "url": "https://www.chronicle.co.zw/bulawayo-mourns-two-former-councillors-in-separate-burial-ceremonies/",
            "content": "Online writer\n\nThe City of Bulawayo will hold two separate funeral services on Saturday, 18 January 2025, to honour the late Councillor Daisy Mpofu and former Councillor Joyce Ndlovu.\n\nBoth will be laid to rest at Lady Stanley Cemetery, a final resting place for notable figures in the city.The funeral service for Cllr Mpofu will commence at 8am at No. 8 Howes Avenue, Waterford. This will be followed by a church service at the New Apostolic Church in Northend at 10am. Cllr Mpofu will then be interred at Lady Stanley Cemetery.The funeral service for former Councillor Joyce Ndlovu will take place at MacDonald Hall in Mzilikazi, beginning at 8am. Following the service, she will also be laid to rest at Lady Stanley Cemetery.\n\nThe City of Bulawayo has called on residents to join in commemorating the lives and service of the two distinguished leaders who contributed to the development of the city.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jhdjkf.jpg",
            "description": "Online writer The City of Bulawayo will hold two separate funeral services on Saturday, 18 January 2025, to honour the late Councillor Daisy Mpofu and former Councillor Joyce Ndlovu. Both will be laid to rest at Lady Stanley Cemetery, a final resting place for notable figures in the city. The funeral service for Cllr Mpofu […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Tsholotsho woman caged 4-years for theft",
            "url": "https://www.chronicle.co.zw/tsholotsho-woman-caged-4-years-for-theft/",
            "content": "Sinokubonga Nkala[emailprotected]A 33-YEAR-OLD woman from Mapane Line, Tsholotsho has been slapped with a four-year prison sentence after stealing money from her relative.In October 2024, Kitumetsi Moyo travelled to South Africa, leaving behind a locked trunk containing US$8 000.Natasha Ngwenya, a family member took advantage of the situation and stole the money.In an official statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, The accused was convicted and sentenced to 4 years Imprisonment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A 33-YEAR-OLD woman from Mapane Line, Tsholotsho has been slapped with a four-year prison sentence after stealing money from her relative. In October 2024, Kitumetsi Moyo travelled to South Africa, leaving behind a locked trunk containing US$8 000. Natasha Ngwenya, a family member took advantage of the situation and stole the money. […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Top-Performing Bulawayo City Council Schools and learners honoured at Annual Merit Awards",
            "url": "https://www.chronicle.co.zw/top-performing-bulawayo-city-council-schools-and-learners-honoured-at-annual-merit-awards/",
            "content": "Online writer\n\nTHE City of Bulawayo recently held the 2023 Schools Merit Awards ceremony to celebrate outstanding academic and sporting achievements across the local authoritys schools, with the theme: Empowered Minds, Drug-Free Lives.\n\nA total of 57 learners who achieved 6 units each in the 2023 Grade 7 public examinations were awarded certificates and presents for their stellar performance. Among the top-performing schools were:\n\nEach of these schools contributed USD$100 towards the event, with the funds used to honour the learners and support the overall ceremony.\n\nCertificates and presents were also awarded to schools excelling in various sporting disciplines:\n\nIndividual awards were given to 18 learners for excellence in athletics, while 50 learners in ball games also received prizes. Seven learners represented Zimbabwe at the COSSASA games, including Praise Neshiri from Malindela Primary, who was recognised for her participation in the Confederation of African Football (CAF) games. Praise was further rewarded with a school trunk by Rauch Manufacturing, a key sponsor of the event.\n\nIn a move promoting inclusivity, 20 special needs learners from nine schools with specialised units were honoured with certificates and presents. A teacher from Manondwane Primary School provided sign language interpretation for hearing-impaired learners, reflecting the citys commitment to equitable education.\n\nWhile the event celebrated top achievers, concerns were raised about poor performance among some council schools, particularly in peri-urban areas. The Chamber Secretary identified socio-economic challenges as the main drivers of these results.\n\nCouncillors urged council schools to strive for better outcomes, emphasising the need for stronger partnerships to address these issues. The city is already engaging partners to support vulnerable learners with school fees, uniforms, and books.\n\nThe event was made possible by the contributions of 21 stakeholders who donated various items to supplement prizes for learners. The Provincial Education Director, represented by Deputy Provincial Education Director (SECNF) Mr Thabani Sibanda, delivered the keynote address and commended the organisers for a well-executed event.\n\nThe Schools Merit Awards highlighted both the triumphs and challenges faced by Bulawayos education sector, with a strong call for collaborative efforts to enhance performance across all council schools.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/BCC-LOGO.jpg",
            "description": "Online writer THE City of Bulawayo recently held the 2023 Schools Merit Awards ceremony to celebrate outstanding academic and sporting achievements across the local authority’s schools, with the theme: “Empowered Minds, Drug-Free Lives.” A total of 57 learners who achieved 6 units each in the 2023 Grade 7 public examinations were awarded certificates and presents […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Eagles shoot to the top of Pro50 Championship standings",
            "url": "https://www.chronicle.co.zw/eagles-shoot-to-the-top-of-pro50-championship-standings-2/",
            "content": "Brandon Moyo[emailprotected]FOLLOWING their win over Southern Rocks in a nail-biting match at Harare Sports Club on Tuesday, Eagles have shot to the top of the Pro50 Championship standings, leapfrogging their opponents.\n\nTuesdays closely fought nine-run win over Rocks took the Harare based side to six points, one ahead of second placed Rhinos and third placed Southern Rocks. The two teams chasing Eagles are only separated by net run rate.\n\nIn fourth place there is Mega Market Mountaineers while Tuskers anchor the standings. Both teams are on four points, also separated by net-run rate.The table toppers, Eagles, batting first against Southern Rocks were bowled out for 262 runs in 49.4 overs with Tinashe Kamunhukamwe top scoring with a half century. Eagles went on to secure the win as they bowled out their opponents for 253 runs in 48.3 overs.\n\nThe home side enjoyed a fine start, as their opening pair of Tinashe Kamunhukamwe and Tadiwanashe Marumani scored freely and put up 71 for the first wicket in less than 10 overs.It was a superb spell of bowling by William Mashinge that changed the aspect of the game, as he first dismissed Marumani and Emmanuel Bawa in the same over, and followed this up with the wickets of Dion Myers for nine and Craig Ervine for one.\n\nWhen Dylan Hondo bowled out Kamunhukamwe for 61 runs off 63 balls, Eagles were in some trouble at 114/5 in the 24th over.Wessly Madhevere (28) and Tony Munyonga (42) brought about an improvement with a partnership of 60 in nine overs, but then with more wickets falling the eighth wicket went down at 205.\n\nAgain, another partnership came to the rescue, this time with Faraz Akram (49) and Alex Falao (16) taking on the bowling to add 57 in 11 overs.Both fell to successive deliveries in the final over from debutant Shelton Mazvitorera.Mashinge was the pick of the Southern Rocks bowlers, finishing with figures of 4/37 in his 10-over spell while Roy Kaia took 3/57.\n\nIn their chase, Rocks made a rather poor start, losing three wickets for 44 runs, but Innocent Kaia played well and at last found a worthy partner in Ryan Higgins.Higgins hit hard and well, and they put on 83 for the fourth wicket before Kaia was caught for 51, scored off 84 balls.The eighth wicket fell at 207 and this match seemed lost, but Mashinge was still going well, and Hondo gave him such help from number 10 that they took the score to 251 in the 48th over, giving Eagles much concern in a tight finish.At this point Akram struck again, trapping Mashinge in front for 34 and, with Hondo out in the next over, Rocks fell just short of their target, all out for 253 with nine balls in hand.\n\nAkram was the outstanding bowler with three vital wickets for 53 in nine overs.However, the overall honours belonged to Madhevere, who delivered a standout all-round performance to earn the player of the match award, scoring a vital 28 runs, taking two wickets for 44 runs in his 10 overs and securing two catches in the field.In the other Pro50 Championship match, rain once again proved spoilsport for Tuskers as their game against Rhinos at Bulawayo Athletic Club (BAC) was called off due to persistent rain.\n\nThe game started two hour later than scheduled due to a wet outfield and was reduced to 41 overs. Tuskers, who won the toss and elected to field first restricted Rhinos to 287/7. The match was abandoned with the hosts on 13/1, having lost the wicket of Nkosana Mpofu.This was now the second consecutive time that a Tuskers match yielded no result. Their match against Southern Rocks last week was called off without a ball being bowled at Takashinga Cricket Club.Following the completion of the Pro50 matches, next up is the Logan Cup. Eagles face Southern Rocks at Harare Sports Club while Tuskers host Rhinos at BAC.All matches are free of charge to all spectators.\n\n@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Cricket.jpg",
            "description": "Brandon Moyo Brandonmalvin9@gmail.com FOLLOWING their win over Southern Rocks in a nail-biting match at Harare Sports Club on Tuesday, Eagles have shot to the top of the Pro50 Championship standings, leapfrogging their opponents. Tuesday’s closely fought nine-run win over Rocks took the Harare based side to six points, one ahead of second placed Rhinos and […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Gwanda South legislator Dr Marupi gives 4 tonnes of rice to schools",
            "url": "https://www.chronicle.co.zw/gwanda-south-legislator-dr-marupi-gives-4-tonnes-of-rice-to-schools/",
            "content": "Sukulwenkosi[emailprotected]\n\nGWANDA South legislator and Deputy Minister of Information Publicity and Broadcasting Services, Dr Omphile Marupi has handed over four tonnes of rice to schools in his constituency which were donated by President Emmerson Mnangagwa.\n\nPresident Mnangagwa allocated four tonnes of rice to all legislators in the country which are going to be distributed to communities.\n\nSpeaking on Thursday during a community meeting in Ntephe area, Dr Marupi said all schools in the 11 wards under his constituency will receive an allocation.\n\nOur President His Excellency Dr Emmerson Mnangagwa is a people centered leader who seeks to cater for peoples needs. We know that we have an ongoing food relief programme and other interventions being spearheaded by Government. In a recent development President Mnangagwa handed over four tonnes of rice to every MP.\n\nI have decided that the allocation for this constituency will go towards schools to assist in feeding learners. These bags of rice have been delivered to a school in each ward and then they will be further shared among all the schools in each ward, he said.\n\nDr Marupi said this intervention will help to complement the school feeding6h programme.\n\nNtephe village head, Mr Leonard Moyo expressed his gratitude to President Mnangagwa for catering for the needs of community members. He also thanked Dr Marupi for considering learners.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dr-ompile.jpg",
            "description": "Sukulwenkosi Matutu-sukulwenkosi.dube@chronicle.co.zw GWANDA South legislator and Deputy Minister of Information Publicity and Broadcasting Services, Dr Omphile Marupi has handed over four tonnes of rice to schools in his constituency which were donated by President Emmerson Mnangagwa. President Mnangagwa allocated four tonnes of rice to all legislators in the country which are going to be distributed […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Zanu PF Bulilima MP Cde Phuti mourns liberation heroine Cde Bule",
            "url": "https://www.chronicle.co.zw/zanu-pf-bulilima-mp-cde-phuti-mourns-liberation-heroine-cde-bule/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nZANU PF Bulilima Constituency MP Cde Dingumuzi Phuti has mourned the passing of the ruling partys stalwart Cde Agnes Bule, who died last week.\n\nThe partys President and First Secretary, Cde Emmerson Mnangagwa, conferred liberation heroine status upon Cde Bule, who will be laid to rest tomorrow at her rural homestead in Butshe village, Bulilima district, Matabeleland South province. She was 76.\n\nBule is the mother of Ndolwane Super Sounds co-founder Charles Ndebele, a Zimbabwean musical maestro who inherited his talent from his mother, who was also a musician at heart, being one of the founders of the pre-independence music outfit Zimbabwe All-Stars.\n\nCde Phuti stated that the liberation heroine has left a significant void in the ruling party and the Makhulela community at large.\n\nThe loss of heroine Cde Bule is a shattering blow to us. It came at a time when such resilient people were needed the most. She was incredibly upright and very patriotic. She had a blend of political culture that she developed over many years in Harare, ZAPU in the 70s, and later Zanu PF, where she could merge it with the prevailing political climate at Makhulela party district, Bulilima Constituency, and Matabeleland South province. She fitted in exceptionally well.\n\nShe was an excellent mobiliser, never hesitating to approach anyone; she was a master of door-to-door campaigns. She loved the truth and was not a backstabber. She was straightforward and steadfast, said Cde Phuti.\n\nHe remarked that Marujata, as she was affectionately known, was a responsible character who wanted things to be done properly and culturally, in a manner that would leave everyone satisfied.\n\nMarujata was just colourful. Her departure is a sad loss to the party and the Makhulela community in general, as she was a culturally gifted individual, and music mourns her loss because her history is remarkable.\n\nShe was a revolutionary singer, and we are told that they would meet with the late Dr Joshua Nkomo, whereby when he went abroad for negotiations in Geneva and Malta, they would greet him with songs. They produced various albums over the years, led by Owen Ndlovu, and later I produced an album for them in 2005, which did very well, with Marujata as the lead singer. She will be missed for many reasons, said Cde Phuti.\n\n-@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/rgw4.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com ZANU PF Bulilima Constituency MP Cde Dingumuzi Phuti has mourned the passing of the ruling party’s stalwart Cde Agnes Bule, who died last week. The party’s President and First Secretary, Cde Emmerson Mnangagwa, conferred liberation heroine status upon Cde Bule, who will be laid to rest tomorrow at her rural homestead in […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        }
    ]
}