{
    "news": [
        {
            "title": "South Africa’s Hawks Investigate AfriForum Over Alleged High Treason Linked to Washington Talks",
            "url": "https://www.chronicle.co.zw/south-africas-hawks-investigate-afriforum-over-alleged-high-treason-linked-to-washington-talks/",
            "content": "Jerry Chifamba\n\nHawks Investigate High Treason Cases Linked to AfriForums US Lobbying EffortsThe Hawks are investigating four high treason dockets allegedly involving AfriForum and Solidarity, following high-level meetings in Washington between AfriForum and US President Donald Trumps administration.\n\nThese discussions aimed to lobby the US for intervention against the African National Congress (ANC), which AfriForum claims threatens Afrikaans culture. AfriForum is seeking international support to address what it describes as cultural and political injustices, raising tensions both domestically and internationally.\n\nThis investigation highlights the significant implications of AfriForums actions on South African politics.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/images.png",
            "description": "Jerry Chifamba Hawks Investigate High Treason Cases Linked to AfriForum’s US Lobbying Efforts The Hawks are investigating four high treason dockets allegedly involving AfriForum and Solidarity, following high-level meetings in Washington between AfriForum and US President Donald Trump’s administration. These discussions aimed to lobby the US for intervention against the African National Congress (ANC), which […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Pycroft named referee for Australia/India Champions Trophy semi-final",
            "url": "https://www.chronicle.co.zw/pycroft-named-referee-for-australia-india-champions-trophy-semi-final/",
            "content": "Zimpapers Sports Hub\n\nFORMER Zimbabwe cricketer, and esteemed International Cricket Council (ICC) official, Andy Pycroft has been named as the match referee for the eagerly anticipated Champions Trophy clash between two of the tournament favourites India and Australia in Dubai on Tuesday.\n\nPycroft will work alongside New Zealander Chris Gaffaney and Englands Richard Illingworth who have been named as the onfield umpires and Michael Gough who will serve as third umpire.\n\nIllingworth continues in Dubai having overseen Indias Group A clash with New Zealand, while Gaffaney had been due to umpire Australias meeting with South Africa in Group B before the weather intervened.\n\nThen in the second semi-final in Lahore, Pakistan, Sri Lankas Kumar Dharmasena will work alongside Australias Paul Reiffel as the on-field umpires for the clash between South Africa and New Zealand.\n\nJoel Wilson will be the third umpire, while Ranjan Madugalle is the match referee for this encounter.\n\nDharmasena took charge of New Zealands win over Bangladesh in Group A, while Reiffel was in the middle when India beat Pakistan.\n\nICC Champions Trophy semi-finals match officials:\n\nSemi-Final One: Dubai, India v Australia On-field Umpires: Chris Gaffaney & Richard Illingworth Third Umpire: Michael Gough Fourth Umpire: Adrian Holdstock Match Referee: Andy Pycroft\n\nSemi-Final Two: Lahore, South Africa v New Zealand On-field Umpires: Kumar Dharmasena & Paul Reiffel Third Umpire: Joel Wilson Fourth Umpire: Ahsan Raza Match Referee: Ranjan Madugalle\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-46-10.jpg",
            "description": "Zimpapers Sports Hub FORMER Zimbabwe cricketer, and esteemed International Cricket Council (ICC) official, Andy Pycroft has been named as the match referee for the eagerly anticipated Champions Trophy clash between two of the tournament favourites India and Australia in Dubai on Tuesday. Pycroft will work alongside New Zealander Chris Gaffaney and England’s Richard Illingworth who […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Watch: Ex Bosso coach Brito thanks Sir Wicknell Chivayo",
            "url": "https://www.chronicle.co.zw/watch-ex-bosso-coach-brito-thanks-sir-wicknell-chivayo/",
            "content": "Online Writer\n\nFORMER Highlanders assistant coach Antonio Torres confirms that he and former coach Brito have received payment of their dues by businessman Wicknell Chivayo.\n\nhttps://www.facebook.com/share/r/18QLi1droZ/\n\nBosso owed the two over US$27 000 and this led to a FIFA ban on transfers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Baltemar-Brito.jpg",
            "description": "Online Writer FORMER Highlanders assistant coach Antonio Torres confirms that he and former coach Brito have received payment of their dues by businessman Wicknell Chivayo. https://www.facebook.com/share/r/18QLi1droZ/ Bosso owed the two over US$27 000 and this led to a FIFA ban on transfers.",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Magistrate disgusted as woman exposes daughter (12) to sexual acts",
            "url": "https://www.chronicle.co.zw/magistrate-disgusted-as-woman-exposes-daughter-12-to-sexual-acts/",
            "content": "Online Writer\n\nA 32-YEAR-OLD woman who repeatedly had sex with multiple men in her home while her 12-year-old daughter watched has been fined US$300 and ordered to perform 210 hours of community service.\n\nThe accused woman of Shangani Mine in Fort Rixon was convicted on her own guilty plea to charges of public indecency by Bulawayo magistrate Mr Maxwell Ncube.\n\nShe was fined US$300 (or the ZIG equivalent) to the clerk of courts, failing which she will serve five months in prison. The accused was also directed to perform community service at Shangani Police Station.\n\nIn passing sentence, Mr Ncube noted that her conduct was deplorable, as she engaged in sexual acts in the presence of a minor, an experience that is deeply traumatic for a child of her age.\n\nIn her victim impact statement, the 12-year-old victim expressed how her mothers actions had profoundly disturbed her. She said the events continue to haunt her.\n\nMay the court consider that my mother is the one who pays my school fees. She should have an opportunity to work, the statement read.\n\nThe victim further revealed that she wished to be placed in the custody of her grandmother. She also recounted how her mother would shout obscenities at her and physically abuse her with a sjambok whenever she failed to complete her chores. The child is staying with her maternal grandmother in Matobo.\n\nIn mitigation, the accused said she is a mother of three and the sole breadwinner for her family, surviving on menial part-time jobs.\n\nThe prosecutor, Ms Mufaro Ndirayire, told the court that last year, she had invited several men to her home at Shangani Mine.\n\nThe accused invited multiple male partners and engaged in sexual intercourse with them in full view of the complainant, said Ms Ndirayire.\n\nIn aggravation, Ms Ndirayire emphasised the seriousness of the offence, saying, The perpetrator was in a position of trust as the victims mother. She exposed acts of indecency to a minor who is only 12 years old.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Online Writer A 32-YEAR-OLD woman who repeatedly had sex with multiple men in her home while her 12-year-old daughter watched has been fined US$300 and ordered to perform 210 hours of community service. The accused woman of Shangani Mine in Fort Rixon was convicted on her own guilty plea to charges of public indecency by […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Sir Alex Ferguson mobbed by fans during Victoria Falls visit",
            "url": "https://www.chronicle.co.zw/sir-alex-ferguson-mobbed-by-fans-during-victoria-falls-visit/",
            "content": "Leonard Ncube,[emailprotected]\n\nLEGENDARY former Manchester United manager Sir Alex Ferguson was mobbed by excited fans in Victoria Falls as he toured the rainforest this morning.The iconic Scotsman, who led Manchester United to an era of unprecedented dominance IN THE English Premier League, arrived in Victoria Falls on Sunday aboard the Rovos Luxury tourism train.Ferguson, who managed the Red Devils from 1986 to 2013, secured 13 English Premier League titles, five FA Cups, and two UEFA Champions League trophies, cementing his place as one of the greatest football managers of all time. His tenure saw United become a global powerhouse, producing legendary players such as Ryan Giggs, Paul Scholes, and David Beckham.\n\nHe has a cult following among United fans around the world.During his visit, Sir Alex was booked at the Victoria Falls Safari Lodge before exploring the majestic Victoria Falls, one of the Seven Natural Wonders of the World. Fans eagerly gathered around him at his lodgings and in the rainforest, seizing the opportunity to take pictures with the football icon.However, he was travelling with a delegation that restricted media access, stating that Sir Alex was on a private holiday and would not be giving any interviews.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/alex.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw  LEGENDARY former Manchester United manager Sir Alex Ferguson was mobbed by excited fans in Victoria Falls as he toured the rainforest this morning. The iconic Scotsman, who led Manchester United to an era of unprecedented dominance IN THE English Premier League, arrived in Victoria Falls on Sunday aboard the Rovos Luxury tourism […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Meikles Limited Reports Strong Financial Performance and Growth",
            "url": "https://www.chronicle.co.zw/meikles-limited-reports-strong-financial-performance-and-growth/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nMEIKLES Limited has assured shareholders of its strong financial position, affirming that planned capital expenditures for the year are being executed as scheduled.\n\nIn a trading update for the third quarter that ended 30 November 2024, the group reported a 54 percent surge in revenue for the quarter, driven by favourable exchange rate movements and sales volume growth across all segments.\n\nGroup revenue for the nine months increased by seven percent, marking a recovery from the 20 percent decline recorded for the six months ended 31 August 2024. The group achieved a profit after tax of ZWG 73,4 million for the quarter, a significant turnaround from the ZWG 4.5 million loss reported in the same period last year.\n\nFor the nine months, profit after tax grew by 87 percent to ZWG 67.9 million, rebounding from ZWG 5.6 million in the preceding six months that ended 31 August 2024.\n\nAll operating subsidiaries generated positive cash flows during the period under review, with the group highlighting its robust financial stability, underpinned by a strong US dollar cash balance in its offshore subsidiary.\n\nWith its solid financial footing, the group expressed confidence in its ability to adapt to the evolving operating environment.\n\nDespite the challenges of the evolving operating environment, the Group is optimistic about its prospects. We are confident in the Groups ability to adapt. The capital expenditure plans for the year continue to be implemented, as the Group has adequate financial resources, the company said.\n\nThe supermarket segment recorded an eight percent increase in sales volume for the quarter and a two percent rise for the nine months. Management maintained consistent stock availability across all stores despite the challenging trading environment.\n\nRevenue collected in US dollars during the quarter remained stable at 19 percent, consistent with the previous year. For the nine months, the percentage of USD revenue increased to 21 percent, up from 17 percent in the prior year.\n\nIn the hospitality segment, room occupancy improved to 44 percent for the quarter, up from 42 percent the previous year. Occupancy for the nine months also stood at 44 percent, compared to 41 percent last year. The average room rate and revenue per available room for the nine months rose by two percent and nine percent, respectively.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/01/MEIKLES-Limited-680x369.png",
            "description": "Nqobile Bhebhe, Nqobile.bhebhe@chronicle.co.zw MEIKLES Limited has assured shareholders of its strong financial position, affirming that planned capital expenditures for the year are being executed as scheduled. In a trading update for the third quarter that ended 30 November 2024, the group reported a 54 percent surge in revenue for the quarter, driven by favourable exchange […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Ganja truck: Zimra and border agencies intercept 163kg of smuggled marijuana at Beitbridge border",
            "url": "https://www.chronicle.co.zw/ganja-truck-zimra-and-border-agencies-intercept-163kg-of-smuggled-marijuana-at-beitbridge-border/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHE Zimbabwe Revenue Authority (Zimra) on Sunday intercepted a South African truck driver at the Beitbridge Border Post attempting to smuggle 163 kilogrammes of marijuana (mbanje), valued at US$32 600, into the country.\n\nIn a statement, Zimras Commissioner General, Ms Regina Chinamasa, said the hallucinogenic drugs were discovered during a routine inspection at 4am.\n\nThe contraband had been concealed within a South African-registered Hino Horse truck transporting vehicles in transit through Zimbabwe to the Democratic Republic of Congo (DRC).\n\nShe said customs officials, utilising K9 units, located the drugs hidden under blankets and plastic wrapping.\n\nThe truck, driven by an unnamed South African, had entered from South Africa and was transiting through Zimbabwe and Zambia en route to the Democratic Republic of Congo (DRC). The matter is currently under investigation by law enforcement agencies, said the Commissioner General.\n\nMs Chinamasa condemned the smuggling operation, emphasising that Zimra remains committed to enhancing border security.\n\nThe trafficking of illegal drugs poses a significant threat to our society. Zimra will continue to diligently safeguard our borders against drugs and illicit substances, she added.\n\nShe also commended the vigilance of the customs officials and other border agencies involved in the case. We encourage the public to report any suspected smuggling or drug trafficking activities, she said.\n\nRecently, there has been an upsurge in cases where drug peddlers are smuggling mbanje (skunk) from South Africa in large quantities via the Limpopo River or through the border using light cross-border transporters known as Omalaitsha.\n\nIt is understood that most of the drugs are destined for high-density suburbs in Bulawayo and Harare.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ll.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE Zimbabwe Revenue Authority (Zimra) on Sunday intercepted a South African truck driver at the Beitbridge Border Post attempting to smuggle 163 kilogrammes of marijuana (mbanje), valued at US$32 600, into the country.   In a statement, Zimra’s Commissioner General, Ms Regina Chinamasa, said the hallucinogenic drugs were discovered during a […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "KD the Event Planner to launch annual business convention",
            "url": "https://www.chronicle.co.zw/kd-the-event-planner-to-launch-annual-business-convention/",
            "content": "Peter Matika,[emailprotected]\n\nAWARD-winning event planner Kudakwashe Moyo, largely known as KD the Event Planner, is set to launch a ground-breaking business convention aimed at boosting Bulawayos GDP.\n\nThe event, which is slated for March 14 and dubbed The Business Maneuver, is set to revolutionize how local businesses collaborate and elevate their industries while giving back to the community.\n\nMoyo said the convention seeks to gather entrepreneurs, organizations and innovators from all walks of life to share insights, tackle challenges and spark new ideas.\n\nThis is more than just a convention; its a movement. We want to create a platform where business people can engage in meaningful discussions about the topics that truly matter to our industries, said Moyo.\n\nHe said the convention will feature a lineup of esteemed panellistssuccessful figures who have made their mark in the Bulawayo business landscape.\n\nMoyo said their experiences and insights will provide invaluable guidance, ensuring that attendees leave inspired and equipped with practical strategies to implement in their own ventures.\n\nLets face it, running a business can be tough, but when we come together, we can learn from each other and grow as a community, he said.\n\nThe Business Maneuver isnt just about networking; its about fostering a culture of support and collaboration among entrepreneurs.\n\nLast year, Moyo held a similar business seminar titled the Business Manoeuvre.\n\nI want the youth to introduce themselves as new players in the field. They must showcase the capabilities and achievements in implementing the policies centered on reviving our countrys economy, said Moyo.\n\nHe said the seminar, which will be held at a local hotel, seeks to provide a platform for players in various sectors to meet and create networks beneficial for the development of the nation through its policies.\n\nI am for the belief that the Second Republic has indoctrinated a culture of hard work and productivity. This seminar seeks to promote innovation that will contribute meaningfully to the development of our country through policies that will see us creating a Middle-income economy by 2030, Moyo added.\n\nHe said that as a youth, he believes that Vision 2030 is a powerful force of socio-economic change for the country and, therefore, such initiatives should be adopted in promoting youth empowerment.\n\nHe said the concept is to harness and nurture new markets to ultimately boost the countrys GDP.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/nmj.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw AWARD-winning event planner Kudakwashe Moyo, largely known as KD the Event Planner, is set to launch a ground-breaking business convention aimed at boosting Bulawayo’s GDP. The event, which is slated for March 14 and dubbed The Business Maneuver, is set to revolutionize how local businesses collaborate and elevate their industries while giving […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Body of eight-year-old boy who drowned in Gwanda River recovered",
            "url": "https://www.chronicle.co.zw/body-of-eight-year-old-boy-who-drowned-in-gwanda-river-recovered/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTHE body of an eight-year-old boy from the Bengo area in Gwanda District, who drowned while attempting to cross a flooded river, has been recovered approximately two weeks after the incident.\n\nDecent Dube, a Grade Three pupil at Ntepe Primary School, drowned while on his way home from the shops with his peer. He will be buried tomorrow.\n\nMatabeleland South acting provincial police spokesperson, Assistant Inspector Stanford Mguni, confirmed the development. He said the body was retrieved through a coordinated effort by the police, the drown the community, and other stakeholders.\n\nI can confirm that the body of an eight-year-old boy who drowned in a river has been retrieved. The police, in collaboration with the community, the Civil Protection Unit, community leaders, and other stakeholders, worked together to recover the body. The body has been taken to Bulawayo for a post-mortem.\n\nAs police, we continue to urge people to refrain from crossing flooded rivers. Parents and guardians should also emphasise this to their children and ensure they accompany them to school if they have to cross rivers. Motorists are also urged to avoid crossing flooded rivers. We have had several cases where vehicles were swept away, and unfortunately, some of these incidents have been fatal, he said.\n\nThe community has created a WhatsApp group to mobilise funds to assist the bereaved family.Gwanda South legislator and Deputy Minister of Information, Publicity and Broadcasting Services, Dr Omphile Marupi, applauded the community, local leadership, and various arms of government for working together to ensure the body was found. He commended the community for demonstrating unity and commitment.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/drown-680x354-680x354.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw THE body of an eight-year-old boy from the Bengo area in Gwanda District, who drowned while attempting to cross a flooded river, has been recovered approximately two weeks after the incident. Decent Dube, a Grade Three pupil at Ntepe Primary School, drowned while on his way home from the shops with his […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        },
        {
            "title": "Bhila prepares to release soulful single ‘Wamuhle’",
            "url": "https://www.chronicle.co.zw/bhila-prepares-to-release-soulful-single-wamuhle/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nFast-rising musician Bhila is set to release his first project of the year, a soulful single titled Wamuhle, on March 11. The track features Amaculo Enjabulo and celebrates the beauty of a woman.\n\nA 2023 Bulawayo Arts Awards (BAA) nominee for Outstanding Newcomer of the Year, Bhila is a singer and songwriter known for delivering heartfelt music. His latest offering is a melodic and appreciative piece.Even amidst the pain of a love paradise lost, love remains the key to healing and awakening a broken heart. Love is beautiful, which is why Im kicking off my musical calendar with a song that celebrates it, said Bhila.\n\nHe expressed gratitude for collaborating with Amaculo Enjabulo, a choir that has been instrumental in his musical journey.Working with Amaculo Enjabulo is always special because we are one big family, he added.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ikbghjy.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Fast-rising musician Bhila is set to release his first project of the year, a soulful single titled Wamuhle, on March 11. The track features Amaculo Enjabulo and celebrates the beauty of a woman. A 2023 Bulawayo Arts Awards (BAA) nominee for Outstanding Newcomer of the Year, Bhila is a singer and songwriter […]",
            "time": "20:26",
            "date": "03 Mar 2025"
        }
    ]
}