{
    "news": [
        {
            "title": "A century of resilience: Ex-freedom fighter to celebrate 100th birthday",
            "url": "https://www.chronicle.co.zw/a-century-of-resilience-ex-freedom-fighter-to-celebrate-100th-birthday/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nFORMER freedom fighter, Mr Elias Njani Moyo, who was imprisoned by the Rhodesian regime in 1976, is set to celebrate his 100th birthday on January 15.\n\nAs the then Zapu branch treasurer, Mr Moyo, who was 50, was accused of aiding terrorists after a white storekeeper, Leonard Ashly, was allegedly shot in Mbalabala on July 7, 1976.\n\nThe Rhodesian media reported that Mr Moyo had provided food and shelter to three freedom fighters for four nights, and on the fourth day, the fighters allegedly murdered Ashly near Moyos village.\n\nThe media portrayed Moyo as a man who had lost everything by helping the freedom fighters.\n\nThe story titled This man lost all  through helping the terrorists, painted him as a betrayer who had risked his familys well-being, lost his $50-a-week job, and sold cattle to pay $700 legal fees.\n\nThe storys first line read: Elias Njani Moyo, who is 50 years old, has recently lost everything he has striven for in life because he gave help to some terrorists.\n\nSuch stories were meant to deter the black majority from helping or supporting freedom fighters.\n\nDespite harsh propaganda in the Rhodesian media portraying Mr Moyo as a betrayer, he remained resilient.\n\nHowever, Moyos life was upended when he was falsely accused of the murder and was arrested.\n\nHe escaped the death penalty and was sentenced to life imprisonment.\n\nMr Moyo spent four years at Khami Maximum Prison under inhumane conditions, including being stripped naked in cold weather and confined to a cell for 23 hours a day.\n\nDespite the harsh conditions, Mr Moyos spirit remained unbroken.\n\nHe was released after independence in 1980 and faced the challenge of rebuilding his life, which he did through determination and hard work.\n\nMr Moyo, now residing in Esigodini, Matabeleland South, shared his life story with the Chronicle ahead of his centenary celebrations.\n\nFor an elderly man who is eight days away from turning 100 years old, Mr Moyo is a picture of good health and is still of sound body and mind.\n\nHe reflected on his early years, starting his education at Mawabeni Primary School at the age of 13 and later working menial jobs while attending night school in Bulawayo.\n\nAfter his early experiences in carpentry and building, he worked as an assistant to a builder and eventually became a general manager at Wilfred Mart, a furniture shop employing 200 workers.\n\nMr Moyos hard work and dedication earned him the respect of his employers and colleagues, and he was earning a significant wage by the late 1960s.\n\nHe now owns multiple buildings and shops at Mawabeni Shopping Centre.\n\nBorn on January 15, 1925, in Sibaba Village in Esigodini, Mr Moyo is the last born in his family, and all his older siblings are deceased.\n\nMr Elias Njani Moyo and his wife getting married in 1958\n\nHis father, Mr Njani Sphokotsha Nkolokazime had four wives, and his mother is Ms Malimbitha Sibanda. His parents passed away when he was still a teenager, and that shaped his spirit of resilience to work hard and turn his life around from a young age.\n\nI started school at Mawabeni Primary School at 13 years old. At that time the school system had Sub A, Sub B then Standard One. I later went to Mzinyathini but had no one to help me with tuition so I left for Bulawayo where I did menial jobs and enrolled at a night school around 1941, he said.\n\nThe advantage at that time was that there were plenty of jobs, but I always wanted to be either a carpenter or a builder. I met an old man named Mr Gasela, who was a builder and he employed me as his assistant mixing mortar and he built several houses and thats when I learnt plastering work and a bit of thatching.\n\nIt was by chance that he met a white man who hired him briefly to offload wood into his shop and thats when his love for carpentry was re-ignited.\n\nAround 1944, while still working for that white man, another white man who owned Wilfred Mart was impressed by my work ethic and hired me at his shop where second-hand furniture was refurbished and sold.\n\nAs an orphan, I worked very hard and thats what impressed the white man who owned Wilfred Mart, said Mr Moyo.\n\nWhile at Wilfred Mart, he met a Malawian named Fraction, who advised him to enrol for a carpentry course to improve his skills. He described how while working for Wilfred Mart, he would look at furniture designs from other shops and replicate those designs at his place of employment thereby pushing sales through the roof, something that impressed his boss.\n\nAt that time, he was earning about 50 a week, a huge amount of money then. The least-paid worker at Wilfred Mart earned around 12.\n\nI was boss to the late Vice-President Simon Muzenda when I was the general manager at Wilfred Mart. He was a carpenter and lived in Mzilikazi, said Mr Moyo.\n\nAt the peak of his career, the black general manager lived in Barbourfields and later moved to Mzilikazi in the early 1970s before his life was turned upside down after allegations that he was involved in the killing of the white storekeeper.\n\nA white man who was a storekeeper a couple of kilometres from here was shot dead and I was accused of killing him and arrested. As the Zapu branch treasurer, I was accused of the crime for two reasons. The first was that as the treasurer I supplied the guerrillas with food, second was that I commanded them to kill the white man.\n\nI was sentenced to life in prison. In fact, I escaped the death sentence so I did my time at Khami Maximum Prison, he said.\n\nMr Moyo narrated the inhumane conditions that black prisoners were subjected to such as being stripped naked in chilly weather conditions and made to sit in the open area of the prison.\n\nI was one of the oldest prisoners at Khami Prison and you can imagine the humiliation of being made to strip naked in front of younger inmates. Early in the mornings we would be made to take out urine otherwise we were locked up in our cells for 23 hours a day, said Mr Moyo.\n\nI was released from prison in June 1980 and was taken to an assembly point where we stayed for three months. We would wake up at 4am and start toyi-toying and despite my age, I would go toe to toe with younger men.\n\nMr Moyo, who remarried after the death of his second wife, Ms Mary Ngwenya in 1988, now lives with his wife, Ms Constance Nkala, and has five surviving children, 12 grandchildren, and two great-grandchildren.\n\nThe centenary celebrations will take place at his homestead in April, where family members will gather to celebrate the remarkable life of a man who has lived through the trials of colonial rule and the challenges of independent Zimbabwe.\n\nMr Moyos advice for longevity includes abstaining from smoking and drinking alcohol and embracing prayerful life.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/xzc.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  FORMER freedom fighter, Mr Elias Njani Moyo, who was imprisoned by the Rhodesian regime in 1976, is set to celebrate his 100th birthday on January 15.  As the then Zapu branch treasurer, Mr Moyo, who was 50, was accused of aiding “terrorists” after a white storekeeper, Leonard Ashly, was allegedly shot in Mbalabala […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "Mpilo, UBH  hospitals go solar",
            "url": "https://www.chronicle.co.zw/mpilo-ubh-hospitals-go-solar/",
            "content": "Nqobile Tshili,[emailprotected]\n\nBULAWAYOS key public healthcare facilities, United Bulawayo Hospitals (UBH) and Mpilo Central Hospital, are making progress toward energy self-sufficiency with the installation of solar power systems.\n\nThese hospitals are participants in the Ministry of Health and Child Cares Solar for Health initiative, which was developed in collaboration with the United Nations Development Programme (UNDP).\n\nThe goal of this initiative is to provide reliable renewable energy to healthcare facilities, minimising dependence on the national grid while alleviating the effects of frequent power disruptions.\n\nUBH has installed a 350-kilowatt solar power plant that currently supplies energy to the majority of the hospitals operations, including its wards, main building, and institutional residences, however, the kitchen and laundry rooms are yet to be connected to the system.\n\nUBHs operations executive, Mrs Mary Duvura, stated that the solar solution has significantly contributed to the hospitals reduced reliance on Zesa.\n\nWe have solarised the whole hospital. As we speak, some connections have been made and this includes the main hospital, the wards, and the institutional residence. We can safely say for now, the solarisation is done for the hospital, said MsDuvura.\n\nWe are only left with the kitchen and the laundry which are yet to be connected to the solar grid. We have relied on Zesa but the new solar system will have a positive impact as there will be a reduction in the payment of Zesa utility bills.\n\nMs Duvura said funds previously allocated for electricity bills will now be redirected towards improving clinical services, including patient provisions like drugs and food.\n\nUBHs acting clinical director, Dr Trust Mushawarima, stressed the importance of a reliable power source for critical hospital functions such as the theatre, intensive care unit, and ventilators.\n\nWhile the system is still undergoing monitoring, it has proved to be sufficient to meet the hospitals power needs, providing continuous power during load shedding.\n\nWe received this gesture from the Government and its partners UNDP. It is still under the monitoring phase, but since its connection, we have had a continuous supply of power. As a hospital, it is essential for us to have a reliable power source, as certain departments, such as the theatre and intensive care unit, require power for operations, especially for patients on ventilation, said Dr Mushawarima.\n\nHe said the hospital used to depend on backup generators in case of load shedding, which only powered essential sections but is now guaranteed uninterrupted power supply.\n\nMpilo Central Hospital has also benefited from a 350-kilowatt solar system, which initially powered its laboratories. However, the plant generates more power than expected, allowing for excess electricity to be fed into the hospitals grid, eliminating power outages.\n\nMpilo Central Hospitals chief medical officer, Dr Narcisius Dzvanga, expressed hope that the hospitals grid would soon be fully integrated with the solar system, making it completely independent of the national grid.\n\nIt was put up through the UNDP and Im reliably informed that it can generate up to 350kw and theintention initially was to power the laboratories. It generates so much power that excess can be fed into the hospital grid and that would be the end of our power outages in the hospital, he said.\n\nIm informed that it can generate enough power to feed into the hospital grid, the laboratory and even into the national grid. Thats how big the solar plant is, and the initial mission has been completed. Dr Dzvanga said the next phase is to connect to the hospital grid, which will result in Mpilo Central Hospital no longer relying on power from the national grid.\n\nHe said the solarisation of hospitals is part of a broader effort to ensure that all healthcare institutions in the country, including rural and district health centres, are powered by solar energy.This initiative, he said, aims to prevent power shortages from jeopardising patient care, particularly during surgeries and critical treatments.\n\nWe are proud to have this kind of plant at Mpilo Central Hospital. I just hope that the Public Works Department can quickly connect it to the hospital grid and then we are good as far as power is concerned, said Dr Dzvanga.  @nqotshili.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fbfggfbgfgb.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  BULAWAYO’S key public healthcare facilities, United Bulawayo Hospitals (UBH) and Mpilo Central Hospital, are making progress toward energy self-sufficiency with the installation of solar power systems.  “These hospitals are participants in the Ministry of Health and Child Care’s Solar for Health initiative, which was developed in collaboration with the United Nations Development Programme […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "WHAT’S YOUR MOVE ARIEL?l Hesitant to hang up boots for coaching role?l Highlanders force him to surrender car",
            "url": "https://www.chronicle.co.zw/whats-your-move-ariell-hesitant-to-hang-up-boots-for-coaching-rolel-highlanders-force-him-to-surrender-car/",
            "content": "Innocent Kurira,[emailprotected]\n\nARIEL Sibanda, the long-serving goalkeeper and captain at Highlanders, seems reluctant to accept a coaching position offered by the club following the expiration of his contract on December 31, 2024.\n\nThe development has sparked speculation about the 34-year-olds future, with several teams reportedly interested in acquiring his services.\n\nRumours about Sibandas departure were further fuelled by reports that he was forced to return the car he drives, which is a privilege reserved for the team captain.\n\nHowever, Highlanders chief executive officer, Brian Moyo, dismissed the claims, stating that Sibandas contract had simply expired and that he had returned the car as a matter of procedure.\n\nMoyo confirmed that the club is still in talks with Sibanda over a potential contract extension.\n\nBrian Moyo (Photo credit @GregoryNomore\n\nWe are still negotiating with Ariel, and we hope to reach a mutually beneficial agreement. What the captain has done is just due diligence and there is nothing amiss with returning the car to the office at the moment, said Moyo.\n\nSibanda, who has spent 15 years with Highlanders, hinted earlier this year that he may be considering retirement.\n\nHowever, his experience and expertise make him a valuable asset to the team, and Bosso is reluctant to let him go.\n\nSources close to the club suggest that Sibanda has been offered a coaching role with the junior teams, a move that would allow him to transition into a new phase of his career while still contributing to the clubs development.\n\nSibanda appears not keen to venture into coaching yet, especially with a number of clubs said to be interested in his services.\n\nThroughout his career, Sibanda has been an integral part of the Highlanders team, winning numerous trophies, including the 2019 Chibuku Super Cup and the 2013 Mbada Diamonds Cup. He has also earned individual accolades, including four Goalkeeper of the Year awards.\n\nDespite his impressive achievements, the Castle Lager Premier Soccer League championship has eluded Sibanda during his time at Highlanders. Nevertheless, his dedication and commitment to the club have earned him a revered status among fans and teammates alike.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Ariel-Sibanda.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw ARIEL Sibanda, the long-serving goalkeeper and captain at Highlanders, seems reluctant to accept a coaching position offered by the club following the expiration of his contract on December 31, 2024. The development has sparked speculation about the 34-year-old’s future, with several teams reportedly interested in acquiring his services. Rumours about Sibanda’s departure […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "Human Metapneumovirus: Zimbabwe on high alert",
            "url": "https://www.chronicle.co.zw/human-metapneumovirus-zimbabwe-on-high-alert/",
            "content": "Lesley Chikudo,[emailprotected]\n\nTHE Government has taken swift action to increase public health surveillance in light of the recent outbreak of Human Metapneumovirus (HMPV) in China.\n\nIn a collaborative effort with key stakeholders, the Ministry of Health and Child Care convened a high-level meeting in Harare to discuss preparation and response measures.\n\nHealth and Child Care Deputy Minister, Sleiman Timios Kwidini, said they are implementing intensified monitoring across all points of entry, including airports and borders, to swiftly detect and manage any potential cases.\n\nDep Min Sleiman Timios Kwidini\n\nHMPV is a respiratory virus that is similar to Influenza and can particularly affect children, the elderly and those with compromised immune systems. Symptoms of the virus include fever, cough, nasal congestion and difficulty breathing.\n\nWe are keeping a close eye on the situation and have already implemented enhanced monitoring measures at all ports of entry. With the Chinese New Year approaching at the end of this month, we anticipate increased travel, including Zimbabweans and Chinese returning from China hence we are taking precautions to mitigate any risks, said Deputy Minister Kwidini.\n\nAt this stage, we do not have comprehensive information on how the virus spreads. Once we receive guidance from the World Health Organisation (WHO) regarding preventive measures and other critical details, we will promptly inform the public.\n\nDeputy Minister Kwidini also stressed the need for vigilance during the ongoing rainy season, which has heightened the risk of other diseases such as cholera, malaria and typhoid.\n\nWe recently reviewed our preparedness for diseases typically prevalent in January. As Government, we are implementing health precautionary measures and urge citizens to maintain good hygiene practices to prevent the spread of these illnesses, he said.\n\nHMPV, first identified in 2001, is a single-stranded RNA virus transmitted through respiratory droplets or contact with contaminated surfaces.\n\nWhile cases have been reported in several countries, including the United Kingdom, there is currently no vaccine or specific antiviral treatment for HMPV. Treatment focuses on symptom management, with an incubation period of three to six days.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/vcvcxzcvx-.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com  THE Government has taken swift action to increase public health surveillance in light of the recent outbreak of Human Metapneumovirus (HMPV) in China.  In a collaborative effort with key stakeholders, the Ministry of Health and Child Care convened a high-level meeting in Harare to discuss preparation and response measures.  Health and Child Care […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "Zimbabwe cricket needs to identify the root cause of its poor performances",
            "url": "https://www.chronicle.co.zw/zimbabwe-cricket-needs-to-identify-the-root-cause-of-its-poor-performances/",
            "content": "IT is disheartening to note that the Zimbabwe cricket team seems comfortable in defeat. The Chevrons lost the second Test match against Afghanistan at Queens Sports Club by 73 runs on Day five yesterday, and offered little resistance in the second innings. This is not a new phenomenon as they have been losing matches without much of a fight for some time now.\n\nWhat is even more disturbing is the fact that the Chevrons seem to have accepted their situation and have become comfortable with losing. This was evident from the lack of urgency in the teams approach to the game. They displayed no fighting spirit and virtually surrendered the match to the Afghans. This should not be acceptable in professional sports, where the spirit of competition and the will to win should always be present.\n\nThe Chevrons also lost to Pakistan before the Afghanistan series, with the team offering little opposition and just crumbling. This trend of lacklustre performances by the team is becoming all too familiar. Zimbabwe is a country with a proud cricketing history, with players such as the late Heath Streak, Andy Flower, Grant Flower, Henry Olonga and Mpumelelo Mbangwa being part of the team that once made Zimbabwe one of the strongest cricketing nations in the world. However, today, the team is a shadow of its former self and there seems to be no indication of improvement in the near future.\n\nWhat is even more concerning is that our cricket seems to be in a downward spiral. The Chevrons have not been performing well in recent times, and as a result, elite countries are unwilling to play against them. This is further exacerbating the situation as the lack of international fixtures means that the team is not improving and is constantly falling behind.\n\nZimbabwe cricket needs to take a long hard look at itself and identify the root cause of its poor performances. The problem could be a lack of investment in the sport, inadequate coaching systems, or a dearth of talented players. Whatever the issue, steps must be taken to address it.\n\nThe Zimbabwe Cricket Board must also take responsibility for the teams poor performances. The board needs to invest in the sport, improve the quality of coaching and identify and develop talented young players. The board must also work to ensure that the team is adequately prepared for international fixtures and that the players are motivated to win.\n\nThe Chevrons need to show more resilience and fighting spirit on the field. The team must recognise that it is a professional outfit and must play with a sense of pride and determination. Losing is never easy, but accepting defeat without a fight is unacceptable.\n\nIf these issues are not addressed, our cricket will continue to be in a downward spiral, and fans will continue to be disappointed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ghfrhgfh.jpg",
            "description": "IT is disheartening to note that the Zimbabwe cricket team seems comfortable in defeat. The Chevrons lost the second Test match against Afghanistan at Queens Sports Club by 73 runs on Day five yesterday, and offered little resistance in the second innings. This is not a new phenomenon as they have been losing matches without […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "Merchandise exports surge",
            "url": "https://www.chronicle.co.zw/merchandise-exports-surge/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWEs merchandise exports grew by 3,3 percent to reach US$5,4 billion during the first nine months of 2024, up from US$5,2 billion recorded during the same period in 2023.\n\nThis was revealed by Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, in his 2025 National Budget presentation.\n\nThe growth was primarily attributed to increases in gold and tobacco exports, with minerals continuing to dominate the countrys export portfolio. However, economic experts have called for enhanced domestic value addition and diversification to reduce reliance on primary commodities.\n\nMineral exports, which account for the largest share of merchandise exports, grew by 0,8 percent, rising from US$4,1 billion in the first nine months of 2023 to US$4,2 billion in 2024. The subdued growth was largely due to depressed prices for platinum group metals (PGMs) and lithium.\n\nGold exports, however, experienced a significant increase of 16,7 percent to US$1,5 billion. This growth was driven by higher production levels and sustained global gold prices, which benefited from safe-haven demand amidst global economic uncertainties.\n\nProf Ncube projected that by the end of 2024, merchandise exports would grow by 2,8 percent, from US$7,2 billion in 2023 to US$7,4 billion, bolstered by surging gold and tobacco exports.\n\nLooking ahead, exports are expected to increase by 6,3 percent in 2025 to US$7,9 billion, supported by growth in PGMs, lithium and agricultural exports, despite the challenges posed by depressed mineral prices.\n\nAccording to Zimstat, the country recorded a 21,4 percent export increase to US$698,1 million in November 2024 from the October 2024 value of US$575,0 million.\n\nZimbabwes external sector has demonstrated resilience, with foreign currency receipts rising by 17,9 percent to US$10 billion in the first nine months of 2024, compared to US$8,5 billion during the same period in 2023. Export receipts and diaspora remittances accounted for 59 percent and 25 percent of the total receipts respectively.\n\nProf Ncube noted that this improvement positively impacted the countrys balance of payments. Preliminary estimates indicate a current account surplus of US$227 million in the first nine months of 2024, up from US$59,4 million recorded during the same period in 2023.\n\nThe current account was projected to close 2024 with a surplus of US$150,5 million, improving further to US$277,4 million in 2025, supported by resilient remittance inflows and a narrower trade deficit.\n\nZimbabwes trade deficit narrowed significantly to US$137,7 million in October 2024, a 34,3 percent decrease from US$209,5 million in September of the same year.\n\nGrowing exports and reducing the trade deficit are vital for transforming the countrys economy. These developments not only help retain jobs but also ensure a steady supply of goods and services to the local market.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/mthuli.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com ZIMBABWE’s merchandise exports grew by 3,3 percent to reach US$5,4 billion during the first nine months of 2024, up from US$5,2 billion recorded during the same period in 2023. This was revealed by Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, in his 2025 National Budget presentation. The growth was […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "Farmers ramp up battle against January disease",
            "url": "https://www.chronicle.co.zw/farmers-ramp-up-battle-against-january-disease/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE annual outbreak of Theileriosis, commonly known as January disease, poses a significant threat to Zimbabwes cattle industry.\n\nIf not managed properly, it can lead to a significant loss of herds. The disease stems from a parasite transmitted by the brown ear tick, causing cattle to experience fever, anaemia, and death.\n\nTypically, the disease spreads during the wet season, between December and March, with the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development estimating that over 500 000 cattle have died from the disease since 2016.\n\nFarmers in the Matabeleland region, particularly in areas such as Esigodini in Matabeleland South, have started taking proactive steps to protect their herds.\n\nAside from regularly dipping cattle in acaricide to kill ticks, some farmers have additionally begun applying tick grease to provide an extra layer of protection. This has become an essential preventative measure in the run-up to the disease season.\n\nOne such farmer is Mr Vusumuzi Mhlanga, from Tyrelene village in Mawabeni.\n\nWhile he has not lost any cattle to the disease so far, hes taking no chances. He and his team apply tick grease to all their cattle while adhering to a strict dipping schedule. During the peak of the disease season, they increase the frequency of dips to once a week, ensuring that their cattle remain healthy and disease-free.\n\nSo far, I havent lost any cattle to January Disease, but that does not mean that I will take chances. As you can see Im applying tick grease on all the cattle to kill any ticks that they might pick up in the grazing lands, he said.\n\nWe dip the cattle once every two weeks but now that its the time of the year when January Disease usually strikes, we will now dip the animals every week.\n\nDespite his efforts, Mr Mhlanga expressed frustration with other farmers who do not follow similar protocols, which he believes contributes to the spread of the disease.\n\nIf only all farmers can do what we are doing here today then we would not have to worry about the spread of the disease. It becomes pointless when some farmers dont do the right thing because the ticks will continue to infect all the other animals, he said.\n\nThe Department of Veterinary Services has long advised farmers to stick to a strict tick-grease application and regular dipping schedules.\n\nHowever, many farmers have struggled to maintain these practices due to challenges such as acaricide shortages, water scarcity and economic constraints. This has led to substantial losses in cattle numbers and revenue for the country.\n\nTo address this, the Government has announced plans to enforce the Cattle Cleansing Regulations Act of 1993 more aggressively.\n\nThis law mandates the dipping of cattle and includes penalties for farmers who fail to comply. Theileriosis, along with other tick-borne diseases like Anaplasmosis, Babesiosis, and heart water, are a major contributor to cattle deaths in the country, with more than 65 percent of cattle fatalities linked to these diseases.\n\nFarmers like Mr Meluleki Nkomo from Umguza District in Matabeleland North are also intensifying their efforts to combat the disease.\n\nIn his area, cattle are dipped weekly, and local leadership enforces penalties for non-compliance. Despite the challenges, Mr Nkomo is hopeful that a strict dipping regime will reduce the number of cattle lost to the disease this year.\n\nEvery year, we complain of huge losses that we suffer due to January Disease, but as farmers, we keep failing to do the right things, which are dipping and tick grease application. In our area, we now dip our cattle once every week and there is a suggestion to dip the animals twice a week, he said.\n\nThe Government is working to revive and strengthen the livestock sector, which plays a vital role in the countrys economy, providing livelihoods for many Zimbabweans and contributing to food and nutrition security.\n\nThe ongoing efforts to control tick-borne diseases like Theileriosis are seen as essential to the growth and sustainability of the sector.\n\nSigns of an animal affected by January Disease include swelling of the lymph nodes under the ears and on the shoulder, cloudiness of the eyes, difficulty in breathing with froth coming from the nose and mouth and collapse and death within a few days.\n\nJanuary Disease is a notifiable disease in Zimbabwe and farmers are compelled by the law to report to the Division of Veterinary Services.\n\nThe livestock sector contributes significantly to the inclusive growth and development of the national economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/cxzcxz.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  THE annual outbreak of Theileriosis, commonly known as January disease, poses a significant threat to Zimbabwe’s cattle industry.  If not managed properly, it can lead to a significant loss of herds. The disease stems from a parasite transmitted by the brown ear tick, causing cattle to experience fever, anaemia, and death.  Typically, the […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "EU commends Zimbabwe for death penalty abolition",
            "url": "https://www.chronicle.co.zw/eu-commends-zimbabwe-for-death-penalty-abolition/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE European Union (EU) has commended Zimbabwe for abolishing the death penalty, describing the move as a historic milestone in the protection of human rights, saying there is no compelling evidence to suggest that capital punishment acts as a deterrent to crime.\n\nPresident Mnangagwa last week signed the Death Penalty Abolition Bill into law, officially ending the practice of capital punishment in Zimbabwe.\n\nThis decision places the country among a growing number of nations worldwide that have chosen to eliminate the capital punishment.\n\nIn a statement, the EU hailed the development as a significant step forward.\n\nThe European Union welcomes the abolition of the death penalty in Zimbabwe. With this historic step, Zimbabwe joins the majority of countries in the world having eliminated capital punishment. Zimbabwe had maintained a moratorium on the death penalty since the last execution in 2005, read part of the statement.\n\nThe EU said the death penalty is incompatible with the fundamental right to life, describing it as a cruel punishment that denies human dignity.\n\nThe death penalty is incompatible with the inalienable right to life and a cruel and inhuman punishment, representing an unacceptable denial of human dignity and integrity. No compelling evidence exists to show that it serves as a deterrent to crime, while any miscarriages of justice are irreversible, the statement added\n\nThe EU reaffirmed its staunch opposition to the death penalty in all circumstances and pledged to continue advocating for its abolition in countries where it remains in force.\n\nIn 2013, President Mnangagwa, who was the Justice Minister, publicly expressed his opposition to the death penalty, saying that he was against the execution of prisoners.\n\nPresident Mnangagwa\n\nAmnesty International Zimbabwe executive director, Ms Lucia Masuka, said by abolishing the death penalty, Zimbabwe had sent a clear message about the fundamental importance of protecting the right to life and human dignity.\n\nThis is not just great progress for Zimbabwe, it is also a beacon of hope for the abolitionist movement in the region and a major milestone in the global collective pursuit for an end to this ultimate cruel, inhuman and degrading punishment.\n\nBy enacting the Death Penalty Abolition Bill, Zimbabwe has taken a major step towards aligning its laws with international human rights standards. Its actions also send a clear message about the fundamental importance of protecting the right to life and human dignity.\n\nZimbabwes decision to abolish the death penalty is widely regarded as a progressive move that aligns the country with global human rights standards. It underscores a commitment to upholding the sanctity of life and fostering a justice system rooted in rehabilitation rather than retribution.\n\nThe Death Penalty Abolition Act, as published in the latest Government Gazette, amends several key pieces of legislation, including the Criminal Procedure and Evidence Act (Chapter 9:07), the Genocide Act (Chapter 9:20), the Criminal Law (Codification and Reform) Act (Chapter 9:23) and the Geneva Conventions Act (Chapter 11:06).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/European-Union.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  THE European Union (EU) has commended Zimbabwe for abolishing the death penalty, describing the move as a historic milestone in the protection of human rights, saying there is no compelling evidence to suggest that capital punishment acts as a deterrent to crime. President Mnangagwa last week signed the Death Penalty Abolition Bill into […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "Major overhaul for Simba Bhora…Ndiraya, 13 players dump PSL champions",
            "url": "https://www.chronicle.co.zw/major-overhaul-for-simba-bhorandiraya-13-players-dump-psl-champions/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nPREMIER Soccer League champions, Simba Bhora, are undergoing a major overhaul following the departure of title-winning coach and 13 players.\n\nTonderai Ndiraya is now the new head coach at newcomers Scottland FC.\n\nSimba Bhora have since unveiled former Dynamos assistant coach, Joel Luphahla, as Ndirayas successor.\n\nApart from Ndiraya, Simba Bhora also bade farewell to 13 first-team players, including Soccer Star of the Year Walter Musona, goalkeeper Talbert Shumba, Tichaona Chipunza and Vassili Kawe, who have since joined Scottland.\n\nWalter Musona previously won the Soccer Star of the Year award in 2022\n\nOther players, who have left Simba Bhora, include Partson Jaure, Mthokozisi Msebe, Tymon Mvula, Perfect Chikwende, Valentine Musarurwa, Albert Manenji, Simbarashe Maramwidze, Onifade Obubaka and Talent Chawapiwa.\n\nScottland have been the busiest of the 18 Premiership clubs during the festive period and are expected to make more announcements in the build-up to the new season.\n\nThe Mabvuku side, which has also been shaping its administrative structures after announcing sponsorship deals as well as the recruitment of new chief executive officer, Ronald Moyo recently, proclaimed Ndirayas arrival on its social media platforms yesterday in a major step that could signal its intent in the 2025 season.\n\nNdiraya won the Castle Lager Premiership with Simba Bhora in only their second season last year.\n\nScottland made their move on the coach and then sponsored a three-week trip to Turkey as part of an exchange programme with Kocaelispor, a First Division club in the Turkish Football Federation second tier.\n\nThe former Dynamos coach returned from the Eastern European country at the weekend, ahead of his unveiling.\n\nNdiraya has long been linked with the move to the new boys but recently, the rumour mill had been spreading word that legendary Callisto Pasuwa had come into the mix after ending his successful stint with Malawian giants, Nyasa Big Bullets.\n\nCallisto Pasuwa\n\nBut the Mabvuku side put to rest that speculation by announcing that Ndiraya will take over from Genesis Mangombe, who helped the team secure promotion by winning the Zifa Northern Region Division One League, last season.\n\nNdiraya comes under the weight of expectations after leading Simba Bhora to their maiden title in only their second season in the Premiership last year.\n\nSimba Bhora confirmed Ndirayas departure.\n\nSimba Bhora FC and head coach Tonderai Ndiraya, have mutually agreed to part ways. The club expresses gratitude to Ndiraya for the last two seasons where he presided over 12th and first-position finishes. We wish Stanza the very best for the future.\n\nMeanwhile, Joel Luphahla is set to take over from Ndiraya as head coach. Luphahla brings a wealth of local football experience to the club, having most recently served as the Dynamos assistant coach, said Simba Bhora.\n\nOn the departing stars, Simba Bhora said: We appreciate your dedication to the growth of the Simba Bhora brand and will always value your contribution to our success in the 2024 season. Simba Bhora wishes you continued success in your future endeavours.\n\nStriker Tymon Machope, who has been linked with a move to Scottland, was among the players that reported for pre-season yesterday along with Tinashe Balakasi, Billy Veremu, Isheanesu Mauchi and goalkeeper, Simba Chinani.\n\nSimba Bhora will fight on two fronts this year as they are also set to represent the nation in the Caf Champions League.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/01/Tonderai-Ndiraya.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub PREMIER Soccer League champions, Simba Bhora, are undergoing a major overhaul following the departure of title-winning coach and 13 players. Tonderai Ndiraya is now the new head coach at newcomers Scottland FC. Simba Bhora have since unveiled former Dynamos assistant coach, Joel Luphahla, as Ndiraya’s successor. Apart from Ndiraya, Simba […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        },
        {
            "title": "Electric vehicles, solar can help reduce Zimbabwe’s negative trade balance",
            "url": "https://www.chronicle.co.zw/electric-vehicles-solar-can-help-reduce-zimbabwes-negative-trade-balance/",
            "content": "Remeredzai Joseph Kuhudzai\n\nACCORDING to Zimbabwes Ministry of Finance and the national statistics agency ZimStat, in 2024, Zimbabwes merchandise imports were projected to reach $9,08 billion. On the other hand, exports were projected to be close to $7,4 billion. This means the trade deficit was estimated to be close to $1,7 billion. This is a lot of money for a small economy that has perennial foreign currency shortages. Trade deficits of this kind have been quite frequent over the years and Zimbabwe really needs to start making plans to move to a more sustainable trade environment, ideally with a growing surplus.\n\nLet us take a look at some of the major contributors to this import bill and see where import substitution initiatives can be pursued to cut the deficit. In 2023, the total fuel import bill was $1,58 billion ($951 million on diesel and $449 million on petrol, the rest on other fuels). That amounts to 18 percent of the total $8,66 billion import bill in 2023. In 2023, according to the Central Vehicle Registry, 91712 motor vehicles were registered in that year, and the import bill for motor vehicles in 2023 was $664 million. That is about eight percent of the 2023 import bill. The full figures for vehicle imports for 2024 are not yet available. However, official figures show that $514 million had already been spent on vehicle imports from January to September, with full year imports projected to hit $527 million.\n\nAbout 95 percent of vehicles registered in Zimbabwe each year are used vehicles from Japan, the United Kingdom and others. Looking at the numbers, it means that Zimbabwe spends over 25 percent of its import bill importing cars and fuelling them. In 2024, Zimbabwes fuel import bill was projected to hit $1,62 billion.\n\nFor a country that imports all of its petrol and diesel, accelerating the adoption of electric vehicles (EVs) can help reduce this import bill overall. Even if the country just starts by importing more electric vehicles, it means that instead of importing the vehicles and then also importing the fuel, you can offset some fuel imports through utilising locally generated electricity. As demand grows for electric vehicles, local assembly of these EVs could then be explored, creating further opportunities to use local components and cutting down on that large import bill.\n\nLet us look at the light vehicle section (cars and small pickups). An average of 66788 cars are imported and registered each year. Most of these are eight-year- old cars from Japan such as the Honda Fit, Honda Vezel, Toyota Aqua, Probox, Wish, Mazda 6, CX-5 and similar vehicles. Zimbabwe reduced the import duty on electric vehicles from 40 percent to 25 percent starting from January 1 of this year. Hopefully, we will start to see more electric vehicles coming to Zimbabwe via the established source markets and channels. Most people in Zimbabwe cannot afford to buy a brand new vehicle due to several factors such as lower incomes than their peers in South Africa as well as the absence of affordable long-term vehicle financing services. Therefore, eight-year-old cars from Japan are the go-to options, as these cars will now be at a price point most can afford to pay for in outright cash terms or via a short-term loan from their local bank in Zimbabwe.\n\nThe good news is that there is now a decent fleet of second generation Nissan Leafs (40 kWh and 62 kWh) in Japan that can be bought in Japan for just over $11000 (the 40 kWh version from 2017). After shipping and factoring in the new 25 percent import duty and 15 percent VAT, these cars can now be relatively accessible for consumers that would normally go for a petrol-powered eight-year-old Mazda or Toyota. There is also a decent pool of used Teslas in Japan now for those consumers who would normally buy an eight-year-old petrol powered BMW 3/5 Series or an eight-year-old petrol-powered Mercedes C/E Class. All of this shows that two of the biggest barriers have now been lowered  that is, affordability of EVs as well as availability of EVs from the traditional source markets. The good thing is there will not be any need to reinvent the wheel in terms of the supply chain. The same guys who source and ship eight-year-old internal combustion engine (ICE) cars from Japan can now just add more electric options to the mix using the existing channels. Therefore, the customer experience from the buyers perspective remains the same. They just use the same popular websites and same payment options to which they are accustomed.\n\nOn the countrys electricity import bill, Zimbabwe also spent $180 million on electricity imports in 2023. Electricity imports were projected to increase to $220 million in 2024. The $200 million spent annually on electricity imports from neighbouring countries in southern Africa is due to the large electricity generation shortfall in Zimbabwe. Zimbabwe has an installed electricity generation capacity of close to 3000 MW, but there is a huge problem. The Zimbabwe Power Companys (ZPC) main thermal plants are incredibly old and keep breaking down. There were also three small coal power plants in Harare, Munyati and Bulawayo that have installed capacities of at least 80 MW, but these were recently decommissioned, as it was no longer feasible to operate them. Then there are 920 MW of old coal-powered units 1 to 6 at Hwange where breakdowns are a major issue.\n\nZimbabwe-Power-Company\n\nUnfortunately, over the past six years or so, lower than usual rainfall has resulted in the water levels at Kariba Dam falling, to record low levels. This has forced the ZPC to curtail electricity generation capacity at the countrys largest hydropower plant from 1050 MW to about 125 MW. Encouraging the growth of small utility-scale solar plants as well as rooftop solar in the commercial and industrial sector (C and I), coupled with battery storage, can help Zimbabwe plug some of these generation gaps and ultimately reduce and in the medium term eliminate the electricity import bill. As the Government and partners are also working on some new larger centralised plants for the long term, these private solar plants can help to bridge the gap until these new larger plants come online.\n\nLet us zone in on the $200 million used on electricity imports each year and combine it with an example of a locally funded model for new distributed generation. A new 25 MWp solar PV plant has just been built just outside Harare and is now feeding into the grid. Centragrid, an independent power producer licensed to own, finance, construct and operate a 25 MW solar power plant and its associated transmission facilities in Nyabira, Zimbabwe, has recently completed the 25 MWp plant. The power plant is located at the 35km mark along the Harare-Chirundu highway, and it is now feeding into the grid. Local pension funds such as Nssa, as well as investment arms of Old Mutual, helped make this project a reality. It is now the second largest utility-scale plant in Zimbabwe. A 25 MWp solar PV plant can now probably be constructed for about $20 million in this part of the world at current prices. This cost includes all the development, permitting and construction costs up to the commercial operation date (COD). $20 million? That means for the $200 million used on electricity imports each year, we can get 10 of these 25 MWp solar PV plants completed in less than a year. That means we can add 250 MWp of solar PV to Zimbabwes energy mix in a noticeably brief time.\n\nThis is a good example of how local resources can be harnessed to facilitate the development of more sustainable electricity generation. These plants can help offset imports of electricity and coupled with distributed plants plus battery storage in the C and I, also help reduce the diesel import bill. The majority of factories and businesses use large backup diesel generators to ensure business continuity in an environment with frequent electricity rationing. As the prices of solar panels and batteries are now lower than ever, these will be useful in the quest to reduce operational expense for business and offer a much better value proposition than buying and servicing diesel generators and then continuously buying diesel to fuel them.\n\nIm sure some people will be curious after reading this article. Electricity shortages and electric cars? How is that going to work in Zimbabwe? Not to worry, we have several testimonies from EV owners in Zimbabwe. That is also one of the reasons I have been pushing for increased adoption of distributed renewables to plug the generation gap, as it is now quite easy to couple solar and EV charging, even for fleets with several vehicles. There are also more people in the region who are starting to add solar at their homes and businesses specifically for EV charging.\n\nSolar panels and batteries keep getting cheaper and cheaper. The fleet of new and used EVs in major source markets is growing every day. EVs now have lower import duties than ICE vehicle in Zimbabwe. There has never been a better time for Zimbabweans to go solar and go electric!\n\nRemeredzai Joseph Kuhudzai has been fascinated with batteries since he was in primary school. As part of his High School Physics class, he had to choose an elective course. He picked the renewable energy course and he has been hooked ever since.He works for CleanTechnica, which covers the global renewable energies sector.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Unytydffgtitled-1-copy.jpg",
            "description": "Remeredzai Joseph Kuhudzai ACCORDING to Zimbabwe’s Ministry of Finance and the national statistics agency ZimStat, in 2024, Zimbabwe’s merchandise imports were projected to reach $9,08 billion. On the other hand, exports were projected to be close to $7,4 billion. This means the trade deficit was estimated to be close to $1,7 billion. This is a […]",
            "time": "08:35",
            "date": "07 Jan 2025"
        }
    ]
}