{
    "news": [
        {
            "title": "Airforce of Zimbabwe training aircraft crashes near Gweru, young trainee pilot dies",
            "url": "https://www.chronicle.co.zw/airforce-of-zimbabwe-training-aircraft-crashes-near-gweru-young-trainee-pilot-dies/",
            "content": "Patrick Chitumba,[emailprotected]\n\nA TRAINING aircraft, Karakorum-8 (K-8), belonging to the Air Force of Zimbabwe, crashed in the Guinea Fowl area near Gweru, resulting in the fatal death of the young trainee pilot on board.\n\nIn a statement on Thursday, Zimbabwe Defence Forces Commander, General Philip Valerio Sibanda, expressed his grief over the death of Air Lieutenant Nesbert Tambudza.\n\nThe Zimbabwe Defence Forces (ZDF) is saddened to announce the death of a young pilot, Air Lieutenant Nesbert Tambudza, who died after the (K-8) jet trainer aircraft that he was flying crashed in the Guinea Fowl area in Gweru, he said.\n\nGen Sibanda said the unfortunate accident happened when the pilot was on a solo consolidation general handling navigation training.\n\nHe said the news of the death of Air Lieutenant Tambudza had been received with heavy hearts and that all officers and members were in mourning over the sad loss of a talented pilot.\n\nOn behalf of officers, men and women of the ZDF, the Commander Zimbabwe Defence Forces wishes to express his heartfelt condolences to the family, relatives, friends and colleagues of our departed officer, Air Lieutenant Tambudza, he said.\n\nGen Sibanda said Air Lieutenant Tambudza was a young pilot who had demonstrated immense potential and was therefore selected to undergo a jet flying conversion training course at Number 2 Squadron, Josiah Tungamirai Air Force Base in Gweru.\n\nHe said at the time of his death, he was in the final phases of training on the K-8 jet.\n\nThe accident occurred about 5km East of Guinea Fowl and on impact with the ground the aircraft was extensively damaged.\n\nThere were no civilian casualties and damage to property on the ground, he said.\n\nGen Sibanda said in the meantime, the Air Force of Zimbabwe has constituted a Board of Inquiry to investigate the cause of the accident.\n\nHe said arrangements for the funeral parade and burial for Air Lieutenant Tambudza will be announced in due course.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Airfoce.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw A TRAINING aircraft, Karakorum-8 (K-8), belonging to the Air Force of Zimbabwe, crashed in the Guinea Fowl area near Gweru, resulting in the fatal death of the young trainee pilot on board. In a statement on Thursday, Zimbabwe Defence Forces Commander, General Philip Valerio Sibanda, expressed his grief over the death of Air […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Government set to license more community radio stations Information Perm Sec Mr Nick Mangwana Supports Avuxeni FM",
            "url": "https://www.chronicle.co.zw/government-set-to-license-more-community-radio-stations-information-perm-sec-mr-nick-mangwana-supports-avuxeni-fm/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nInformation, Publicity, and Broadcasting Services Permanent Secretary Mr Nick Mangwana today paid a visit to Avuxeni FM, a community radio station based in Chiredzi.\n\nThe station, which broadcasts primarily in Xitsonga, is celebrating its third year of operation, providing local news and entertainment to the community.\n\nMr Mangwanas visit highlighted the governments continued commitment to expanding access to information across Zimbabwe, particularly in underserved areas.\n\nSpeaking during the visit, Mr Mangwana emphasized Governments plans to license more community radios this year, reinforcing the importance of media diversity and ensuring that all Zimbabweans, regardless of language or location, have access to reliable information.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/rt-1.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com Information, Publicity, and Broadcasting Services Permanent Secretary Mr Nick Mangwana today paid a visit to Avuxeni FM, a community radio station based in Chiredzi. The station, which broadcasts primarily in Xitsonga, is celebrating its third year of operation, providing local news and entertainment to the community. Mr Mangwana’s visit highlighted the government’s […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Immigration Introduces E-Gates at Beitbridge Border Post",
            "url": "https://www.chronicle.co.zw/immigration-introduces-e-gates-at-beitbridge-border-post/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHE Department of Immigration has introduced the use of automated gate systems, commonly referred to as eGates, to allow travelers with new biometric passports to enter or depart Zimbabwe with minimal human interaction, enhancing both convenience and security.\n\nThis latest move is part of the Governments drive to modernize service delivery in line with the upgraded Beitbridge Border Post.\n\nUnder the new setup, the eGates enable travelers to scan their biometric passports and undergo automated identity verification, replacing the need for manual passport checks by border officials. This system is expected to significantly reduce waiting times and improve the efficiency of border control procedures.\n\nThe Regional Immigration Officer in charge of the Southern Region (Beitbridge, Masvingo, Sango, and Chiredzi), Mr. Joshua Chibundu, said the move was part of Zimbabwes broader efforts to modernize its ports of entry. It also aligns with global trends toward more streamlined and secure border management through the use of advanced technologies.\n\nWe have started with a test run effective 14 January and we are impressed so far with the effectiveness of these eGates, said Mr. Chibundu. Basically, we are embracing the ease of doing business and as such we have completed setting up the eGates and we expect them to be commissioned soon. In addition to the eGates, we have also upgraded the Online Border Management System (OBMS).\n\nHe said the new immigration system is complementary to the current automation system at the border where most services are now being digitized. The OBMS is able to capture travelers bio-data, picking flagged travelers, auto-generating days for visitorsfor example, allocating 30 days for those visiting on holidays, seven days for business travel, and three days for those transiting through the country.\n\nMr. Chibundu said the new electronic system eliminates a lot of bottlenecks that come with the use of manual systems at the port of entry.\n\nThe government, in a 17-and-a-half-year partnership with the Zimborders Consortium, upgraded the Beitbridge border post under a public-private partnership, where Zimborders is managing and maintaining the facility pending the handover to the government at the end of the concession.\n\nUnder the current setup, border authorities are now able to clear 60 percent of commercial cargo arriving at Beitbridge in under three hours.\n\nIn addition, authorities are also looking at adopting some of the AI technologies.\n\nAn estimated seven million travelers use the border annually, while nearly 1,200 commercial trucks, 200 buses, and 2,100 light vehicles pass through the same port on a daily basis, and the number is expected to increase fivefold with new efficiency systems kicking in.\n\nThe port of entrys transformation came with the automation of services and the separation of traffic into commercial, buses, light vehicles, and pedestrian traffic.\n\nAs the nexus of regional and international trade, the port of entry can now absorb increased traffic volumes with commercial cargo taking less than three hours and ordinary travelers spending less than 30 minutes to pass through the facility, provided they have all the necessary immigration and customs documents.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dgfw.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE Department of Immigration has introduced the use of automated gate systems, commonly referred to as eGates, to allow travelers with new biometric passports to enter or depart Zimbabwe with minimal human interaction, enhancing both convenience and security. This latest move is part of the Government’s drive to modernize service delivery […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Abandoned new-born found in Karoi",
            "url": "https://www.chronicle.co.zw/abandoned-new-born-found-in-karoi/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nPOLICE are investigating a baby dumping case which occurred in Karoi\n\nThe baby girl was found abandoned in a bush opposite Mutero Lodge in Flamboyant Park.\n\nIn a statement on X, police said the incident occurred on 5 February, the infant has since been admitted to Karoi District Hospital.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/Police-investigation3-680x380-4.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com POLICE are investigating a baby dumping case which occurred in Karoi The baby girl was found abandoned in a bush opposite Mutero Lodge in Flamboyant Park. In a statement on X, police said the incident occurred on 5 February, the infant has since been admitted to Karoi District Hospital.",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zimbabwe steps up wetland protection efforts, says President Mnangagwa",
            "url": "https://www.chronicle.co.zw/zimbabwe-steps-up-wetland-protection-efforts-says-president-mnangagwa/",
            "content": "Mashudu Netsianda,[emailprotected]\n\nPRESIDENT Mnangagwa has reaffirmed Zimbabwes commitment to wetland conservation and sustainable management with Government having crafted various key legal frameworks guiding wetland protection efforts.\n\nIn a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri on Thursday during the belated 2025 World Wetlands Day at Kasibo area in Hwange District, Matabeleland North, the President Mnangagwa said his administration has put in place a raft of measures and an ambitious plan towards wetland management through increasing wetland area under sustainable management.\n\nThe annual event is observed every February 2 in recognition of the importance of wetlands and their role in environmental sustainability and economic resilience.\n\nThe day marks the date of the adoption of the Convention on Wetlands on 2 February 1971, in the Iranian city of Ramsar on the shores of the Caspian Sea. This years commemorations were held under the theme Protecting Wetlands for our Common Future.\n\nZimbabwe is one of the 173 contracting parties to the Convention on Wetlands having ratified it in 2014.\n\nPresident Mnangagwa said the various measures that the Government has implemented to enhance wetland conservation include increasing the area under sustainable wetland management in alignment with the National Development Strategy 1 (NDS1), the Wetland Rehabilitation Rolling Plan (2021-2025) and the National Biodiversity Strategy and Action Plan (NBSAP),\n\nThe National Wetlands Policy and the Environmental Management Act (Chapter 20:27) serve as key legal frameworks guiding wetland protection efforts.\n\nPresident Mnangagwa said wetlands play a critical role in securing water sources and sustaining livelihoods.\n\nIn as much as there is a lot of work to be done to reverse the legacy implication of past actions which were detrimental to the integrity of our wetlands, our commitment for a transformative and progressive sustainable wetland management is evident in the policy and administrative direction were are taking.\n\nThe National Wetlands Policy outlines our aspirations to sustainably manage these vital resources and the Environmental Management Act (Chapter 20:27) remains our principal guiding legal instrument on wetland management in the country, he said\n\nZimbabwe is one of the 173 contracting parties to the Convention on Wetlands, having ratified it in 2014. This demonstrates our full commitment to ensuring that our wetlands remain pristine and capable of regenerating naturally.\n\nPresident Mnangagwa warned that wetlands globally face unprecedented threats due to rapid urbanisation, agricultural expansion, pollution, deforestation, and climate change. He stressed that these factors jeopardise the environmental services provided by wetlands, posing a risk to communities reliant on them.\n\nThe protection of wetlands for posterity remains unquestionable. No single individual, organisation, or government can tackle this challenge alone. It requires collective efforts from all sectors of society, including the public and private sectors, local communities, and international partners, he said\n\nThe President called for increased environmental education, particularly among young people, to cultivate a new generation committed to preserving these vital ecosystems.\n\nA major highlight of the event was President Mnangagwas official launch of the countdown to the 15th Meeting of the Conference of the Parties to the Convention on Wetlands (COP15), which Zimbabwe will host in Victoria Falls from July 23 to 31, 2025. He expressed gratitude to the Ramsar Secretariat, particularly its Secretary General, Dr Musonda Mumba, for supporting Zimbabwes successful bid to host the prestigious conference.\n\nI want to promise you and the whole world that Zimbabwe will do its best to ensure that COP15 is successful, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/8d8d8d78d.jpg",
            "description": "Mashudu Netsianda, mashudu.netsianda@chronicle.co.zw PRESIDENT Mnangagwa has reaffirmed Zimbabwe’s commitment to wetland conservation and sustainable management with Government having crafted various key legal frameworks guiding wetland protection efforts. In a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri on Thursday during the belated 2025 World Wetlands Day at Kasibo area in Hwange District, Matabeleland […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Scottland FC’s training allowances show commitment to players",
            "url": "https://www.chronicle.co.zw/scottland-fcs-training-allowances-show-commitment-to-players/",
            "content": "Chronicle Online\n\nSCOTTLAND FC is demonstrating a serious commitment to player development by providing generous training allowances during pre-season.\n\nThroughout January, the Premier Soccer League newcomers players received a US$100 cash allowance after each training session  a significant investment designed to motivate the squad.\n\nThis exceeds what other clubs have traditionally paid as winning*bonuses in the Premier League.\n\nThe Tonderai Ndiraya-coached side has been training six days a week, with each player earning a total of US$1 700 in training allowances between 12 and 31 January.\n\nThis is in addition to their monthly salaries, highlighting the clubs dedication to supporting its players financially.\n\nThe allowances started on 12 January and ran until 31 January. Each player received a total of US1, 700. This is on top of their monthly salaries, a source confirmed.\n\nScottland FC president Pedzai Scott Sakupwanya initiated the incentive programme, recognising the importance of pre-season preparation.\n\nHis pledge to reward players, even those who may not ultimately make the final squad, underscores the clubs focus on fostering a positive and competitive environment.\n\nScottland FC has made headlines with its ambitious recruitment strategy, securing some of the nations top talent.\n\nAmong their high-profile signings are last years Soccer Star of the Year, Walter Musona, along with first and second runners-up Lynoth Chikuhwa and former Kaizer Chiefs star Khama Billiat.\n\nThese acquisitions signal the clubs intent to compete at the highest level and challenge for major honours.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-06-at-15.31.27-680x380.jpeg",
            "description": "Chronicle Online SCOTTLAND FC is demonstrating a serious commitment to player development by providing generous training allowances during pre-season. Throughout January, the Premier Soccer League newcomers’ players received a US$100 cash allowance after each training session – a significant investment designed to motivate the squad. This exceeds what other clubs have traditionally paid as winning*bonuses […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "28 year old Bulawayo man goes missing: last seen leaving work",
            "url": "https://www.chronicle.co.zw/28-year-old-bulawayo-man-goes-missing-last-seen-leaving-work/",
            "content": "Amos Mpofu ,[emailprotected]\n\nA 28-year-old man from Matopos Road in Bulawayo is missing, sparking concern among his family and the local community.\n\nBekhithemba Jele, an employee of Bakers Inn, was last seen on 2 February 2025, leaving his workplace around 2:20 PM. He is described as physically and mentally healthy and was last seen wearing a black tracksuit and white takkies.\n\nIn a statement, the acting police spokesperson for Bulawayo Metropolitan Province, Assistant Inspector Nomalanga Msebele, confirmed the disappearance and appealed to the public for any information that might assist in locating him.\n\nWe are appealing for information that may assist in locating the missing person, Bekhithemba Jele, a 28-year-old male from Matopo Road, Bulawayo, she said.\n\nHe was last seen on 2 February 2025, leaving his workplace at approximately 2:20 PM and has not returned since. He was wearing a black tracksuit and white tennis shoes.\n\nThe police are urging anyone with information to contact ZRP Hillside Police Station on (0292) 2242426 or any nearby police station.\n\nMr Nkosikhona Mlilo, a church member who attends the same church as Jele, is leading the search for the missing man. He expressed the deep concern of Jeles family, particularly his mother, who is extremely worried about his whereabouts.\n\nWe attend the same church, and his mother is a dedicated member of our congregation. I am leading the search for Bekhithemba and kindly ask the public to assist in locating him. His family, especially his mother, is deeply distressed, and finding him would mean the world to all of us, Mr Mlilo said.\n\nAnyone with relevant information about Jeles whereabouts is urged to contact Mr Mlilo directly on 0783 780 265 or 0777 954 691.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/esdsxs.jpg",
            "description": "Amos Mpofu , mpofuamos41@gmail.com  A 28-year-old man from Matopos Road in Bulawayo is missing, sparking concern among his family and the local community. Bekhithemba Jele, an employee of Bakers Inn, was last seen on 2 February 2025, leaving his workplace around 2:20 PM. He is described as physically and mentally healthy and was last seen […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Nama nominees to be unveiled next week",
            "url": "https://www.chronicle.co.zw/nama-nominees-to-be-unveiled-next-week/",
            "content": "Showbiz Reporter\n\nThe nominees for this years National Arts Merit Awards (Namas) are set to be announced next Wednesday at 10am via the Nama Facebook and YouTube pages, with excitement reaching a fever pitch.\n\nThe awards ceremony is scheduled for March 1, celebrating excellence in the Zimbabwean arts industry.\n\nThis years theme, Afrofuturism envisions the future of the local arts sector over the next century, highlighting innovation, creativity, and cultural evolution.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hujkjoio.jpg",
            "description": "Showbiz Reporter The nominees for this year’s National Arts Merit Awards (Namas) are set to be announced next Wednesday at 10am via the Nama Facebook and YouTube pages, with excitement reaching a fever pitch. The awards ceremony is scheduled for March 1, celebrating excellence in the Zimbabwean arts industry. This year’s theme, “Afrofuturism” envisions the […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zimbabwe dominate first session at Queens Sports Clubs",
            "url": "https://www.chronicle.co.zw/zimbabwe-dominate-first-session-at-queens-sports-clubs/",
            "content": "Brandon Moyo, Sports Writer\n\nZimbabwes fast bowlers, led by Blessing Muzarabani put the Chevrons in the front seat on the first session of day one of their one-off Test match against Ireland at Queens Sports Club.Muzarabani picked up four wickets in just seven overs in the morning session with Ireland going to the lunch break on 111/6. Richard Ngarava and Trevor Gwandu picked up the other two scalps.Ireland won the toss and elected to bat first.Playing on a wicket with some grass cover, Zimbabwes seamers made full use of the conditions in the morning with Muzarabani striking as early the first over, getting PJ Moor caught for four runs.In the fourth over, Ngarava bowled Curtis Campher with a plumb delivery, leaving the visitors on 17/2.Muzarabani would get his second in the fifth over, getting the Irish skipper Andy Balbirnie caught for nine runs off 10 deliveries.Harry Tector was the next to fall, caught on the slips by Takudzwanashe Kaitano off a Muzarabani delivery for a nine-ball duck.Muzarabanis fourth wicket was Paul Stirling, who he also had caught for 10 runs.In the 16th over, a 51-run sixth wicket partnership between Lorcan Tucker and Andy McBrine was broken by Gwandu.Tucker was bowled for 33 runs off 28 balls.Going into the break, Andy McBrine (25 runs off 41 balls) and Mark Adair (14 runs off as many deliveries were in the middle).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/uihu.jpg",
            "description": "Brandon Moyo, Sports Writer Zimbabwe’s fast bowlers, led by Blessing Muzarabani put the Chevrons in the front seat on the first session of day one of their one-off Test match against Ireland at Queens Sports Club. Muzarabani picked up four wickets in just seven overs in the morning session with Ireland going to the lunch […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        },
        {
            "title": "Bulawayo dumps colonial mayor’s gown",
            "url": "https://www.chronicle.co.zw/bulawayo-dumps-colonial-mayors-gown/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nBULAWAYO councilors have resolved to dump the colonial mayoral gown and replace it with a new one that resonates and resembles the citys rich cultural heritage.\n\nInternationally acclaimed youthful fashion designer and founder of Ganu Designs has already been identified to spearhead the creation of the new gown.\n\nFor years, the citys mayoral regalia has consisted of a red robe trimmed with black velvet and a mock sable fur worn with lace frill, a hat and gold chains.\n\nThe ceremonial insignia has been worn since at least the 14th century, whether under the hot October sun or the freezing winter cold.\n\nIt is an English tradition dating back to the reign of Edward Ill when livery companies, which were heads of civic districts, assumed a distinctive uniform type of dress.\n\nAccording to research, livery companies and in turn the municipal corporation, arose out of the merchant and craft industries of the towns, as these possessed both wealth and property and had the organisational and administrative ability and potential\n\nIt is this connection and the dominance of livery members in local affairs and administration that the familiar robes owe their origin.\n\nIn 1960, the two outfits for the Bulawayo mayor and town clerk arrived from England, costing 240,19 (about $482) and were expected to last at least 50 years.\n\nBut following the countrys independence and the ushering in of Bulawayos first black mayor, Naison Ndlovu, the mayoral regalia stuck on.\n\nIt has never changed since and many find it as some form of colonial hangover.\n\nAccording to the latest council meeting, the citys town clerk Mr Christopher Dube told council that the City of Bulawayo had over the years been getting repeated calls from the members of the public to change its mayoral gown so that it resonated and resembled the Citys local culture.\n\nIt was noted that in order to do so, there would be a need to engage designers who could work with the municipality to design the new mayoral gown.\n\nIt was noted that the mayoral gown was of heavy material and tended to be very hot in the summer or hot seasons. A Summer mayoral gown would ensure comfort during the Citys civic functions held in hot months while a winter mayoral gown would also ensure warmth and comfort during the winter months, said Mr Dube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/kjlk.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw BULAWAYO councilors have resolved to dump the colonial mayoral gown and replace it with a new one that resonates and resembles the city’s rich cultural heritage. Internationally acclaimed youthful fashion designer and founder of Ganu Designs has already been identified to spearhead the creation of the new gown. For years, the city’s […]",
            "time": "20:39",
            "date": "06 Feb 2025"
        }
    ]
}