{
    "news": [
        {
            "title": "DRC crisis: President leads peace efforts",
            "url": "https://www.chronicle.co.zw/drc-crisis-president-leads-peace-efforts/",
            "content": "Fungi Kwaramba,Harare Bureau\n\nPRESIDENT Mnangagwa will lead a delegation of the Southern African Development Community to Tanzania later this week for an Extraordinary joint meeting with the East African Community (EAC) bloc in an effort to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) conflict.\n\nThis follows a decision made by the Extraordinary SADC Summit that was held in Harare last week for a joint summit with the EAC, which is currently chaired by Kenyan President, William Ruto.\n\nDRC, a member of both SADC and the EAC, accuses Rwanda, which is a member of the latter grouping, of backing the M23 and other rebel groups that have left death and destruction in eastern DRC.\n\nThe Extraordinary joint summit has been spawned by growing hostilities in eastern DRC that have killed thousands, with millions fleeing their homes.\n\nDeputy Chief Secretary in the Office of the President and Cabinet (Presidential Communications), Mr George Charamba, who is also the Presidential Spokesperson, said the President will lead a doubleTroika, plus theTroops Contributing countries to the joint Summit that he will co-chair with President Ruto.\n\nThe President has a very important foreign affairs fixture in the form of the situation in DRC.\n\nThere is a joint Summit of SADC and the East African Community that will be held in Tanzania later this week, which has taken an extraordinary decision to invite all parties in the DRC conflict to a meeting.\n\nThe President is an important interlocutor in the crisis, considering that he has built a strong relationship with both the DRC President Felix Tshisekedi and PresidentPaul Kagame, said Mr Charamba.\n\nPresident Flix Tshisekedi\n\nThe SADC Double Troika comprises the SADC chairman, outgoing chairman and incoming and the Chairperson of the Organ on Politics, Defence and Security Co-operation.\n\nTanzanian President Samia Suluhu Hassan, is the current chairperson of the SADC Organ on Politics, Defence and Security Co-operation.\n\nThe SADC Mission in the DRC (SAMIDRC), which was deployed on December 15, 2023 to support the Government of the DRC in restoring peace and security in eastern DRC,comprises forces from the Republics of Malawi, South Africa and the United Republic of Tanzania.\n\nIn the aftermath of summits that were held separately by SADC and the EAC, the United Nations Security Councils strident criticism of the rebel groups in eastern DRC and their sponsoring countries, a wide conflagration in the Greater Lakes region has seemingly been averted after the M23 and other rebel groups declared a ceasefire, ostensibly on humanitarian grounds.\n\nThe coalition of rebels, which recently intensified clashes in eastern Congo, claimed control over Goma, the capital of North Kivu province.\n\nClashes between government forces and rebel groups have left an estimated 900 civilians dead, displacing tens of thousands more.\n\nThe recent fighting in eastern DRC, which has been dogged by conflict for more than 30 years since the 1994 Rwandan genocide, has also claimed 16 soldiers from the South African National Defence Force (SANDF) and Malawi, who form part of the SADC Mission in the DRC (SAMIDRC).\n\nAs rebel forces gained the upper hand on the battlefield, capturing much of Goma, the largest city in eastern Congo, South Africa responded with a stern diplomatic warning. The South African government stated that any further attacks on its troops would be regarded as a declaration of war.\n\nIn a swift rebuttal, Rwandas President Kagame accused South Africa of acting as part of a belligerent force.\n\nHe claimed that South African troops were engaged in offensive combat operations to support the Congolese government in its fight against its own citizens.\n\nResultantly, tensions were high before last weeks SADC Summit in Harare, which mandated its Organ Troika on Politics, Defence and Security Co-operation to engage all state and non-state parties to the conflict on a ceasefire process to protect lives and facilitate a smooth flow of humanitarian support to people and communities affected by the armed conflict.\n\nThe Summit also urged Political and Diplomatic leaders who are parties to the conflict to engage in a co-ordinated effort of dialogue, including supporting the Luanda Process, Monusco and others, to restore peace and security in eastern DRC.\n\nSADC leaders also reaffirmed their commitment to the DRCs sovereignty, territorial integrity and long-term stability, pledging ongoing support for its development and security.\n\nLast week, the African Unions Peace and Security Council (PSC) at its 1256th Emergency Ministerial meeting on the Recent Developments in the Eastern Democratic Republic of Congo (DRC), condemned the DRC conflict and called for adherence to the Luanda Process.\n\nUnder the Luanda Process, Angolan President Joo Manuel Gonalves Loureno has tried to broker peace between DRC President Tshisekedi and his Rwandan counterpart, Kagame.\n\nSuch talks have, however, remained elusive, amid escalatory rhetoric and trading of accusations between the two leaders.\n\nThus, the summit, which will be held in Tanzania, offers a platform for both President Tshisekedi and President Kagame to meet directly with mediation from SADC and the EAC.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/SADC3.jpg",
            "description": "Fungi Kwaramba, Harare Bureau PRESIDENT Mnangagwa will lead a delegation of the Southern African Development Community to Tanzania later this week for an Extraordinary joint meeting with the East African Community (EAC) bloc in an effort to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) conflict. This follows a decision made by […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Registration blitz for vulnerable children: 10-day exercise targets child-headed families",
            "url": "https://www.chronicle.co.zw/registration-blitz-for-vulnerable-children-10-day-exercise-targets-child-headed-families/",
            "content": "Ashley Phiri,[emailprotected]\n\nTHE Civil Registry Department has launched a mobile registration exercise targeting vulnerable children and child-headed families in St Peters, Robert Sinyoka, and Methodist Village in Ward 17, on the outskirts of Bulawayo.\n\nThe 10-day exercise, which commenced yesterday and will run until February 13, is in response to appeals made by residents during last years hearings conducted by the Parliamentary Portfolio Committee on Defence, Home Affairs, Security Services and War Veterans Affairs. The hearings revealed that many residents in peri-urban areas lacked essential documentation, which hindered their access to education, healthcare and other social services.\n\nFor many undocumented children, the issue is generational, as their parents and grandparents also lack birth certificates and identity cards. Several families in these areas relocated from the Killarney squatter camp, where their documents were lost or destroyed.\n\nOn the first day of the exercise, teams from the Civil Registry Department set up at St Peters Primary School, where they identified 86 learners without birth certificates. These children are now being assisted in securing proper documentation, a move expected to empower them and their families by granting them access to their legal rights.\n\nPumula legislator, Ms Sichelesile Mahlangu, expressed gratitude to the Civil Registry Department and the Government for facilitating this critical initiative.\n\nThis registration drive is a direct response to the concerns raised by residents during public hearings last year. The people spoke, we listened, and we engaged the relevant authorities. We are grateful to the Civil Registry Department for responding to the call and coming to assist these communities, she said.\n\nMs Mahlangu noted that many of the affected children are orphans living with their grandparents or are part of child-headed households.\n\nThe response has been overwhelming, especially from child-headed families who often struggle with administrative hurdles. Many of these minors take on adult responsibilities at a young age and face challenges in providing for their siblings without proper identification documents, she said.\n\nMs Mahlangu said she is optimistic that at the end of the registration blitz, hundreds of children and families would have received critical identification documents, enabling them to access essential services and opportunities.\n\nSt Peters Village chairperson, Mr Reginald Mkhosana, welcomed the initiative, saying the documentation crisis has long plagued their community.\n\nIn our area, the lack of documentation is a major issue, particularly for child-headed families whose parents did not have documents themselves. We are grateful that the Government has not forgotten us and has taken steps to address this problem, he said.\n\nBeyond providing documentation, the mobile registration drive underscores the importance of inclusive governance and community support. Over the next several days, Civil Registry officials will be stationed at various locations to facilitate the registration process.\n\nThe teams will be at St Peters Primary School until Friday before moving to Robert Sinyoka Primary School on Saturday until next Monday.\n\nThey will then wrap up the exercise at Hyde Park Primary School from Tuesday to Thursday next week.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hgkfjk.m.jpg",
            "description": "Ashley Phiri, ashleyphiri66@gmail.com  THE Civil Registry Department has launched a mobile registration exercise targeting vulnerable children and child-headed families in St Peter’s, Robert Sinyoka, and Methodist Village in Ward 17, on the outskirts of Bulawayo. The 10-day exercise, which commenced yesterday and will run until February 13, is in response to appeals made by residents during […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Man gets 15 years for assaulting minor",
            "url": "https://www.chronicle.co.zw/man-gets-15-years-for-assaulting-minor/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA BULAWAYO man was yesterday sentenced to 15 years in jail for indecently assaulting his co-tenants 11-year-old daughter on several occasions.\n\nHenry Nherera (47) of Emthunzini suburb pleaded not guilty but was convicted of indecent assault by Western Commonage regional magistrate, Mrs Sibongile Marondedze.\n\nIn passing the sentence, the magistrate noted that the victim was emotionally disturbed.\n\nShe said due to his predatory behaviour, Nherera is a danger to the community hence the need for a deterrent sentence.\n\nTo avoid future offenders of the same crime, there is a need to protect the girl child as such, the offender is sentenced to an effective 15 years, ruled Mrs Marondedze.\n\nThe prosecutor, Ms Melisa Dube, said the offence was committed between August 2022 and October 2024.\n\nSometime in 2022 on a date that the complainant cannot remember, during the day, she went to the accuseds house intending to use his cellphone to communicate with her mother who stays outside the town, she said.\n\nThe court heard that Nherera fondled the girls private parts and told her not to tell anyone, claiming she was his girlfriend.\n\nOn the second occasion sometime in October last year, the complaint went to Nhereras house to assist the accused persons daughter with some school homework and found the accused person seated in the house together with his daughter.\n\nThe complainant assisted the accuseds daughter with her homework while the accused was seated in the house. After finishing the homework, his daughter took a blanket and slept leaving the complainant seated, said the prosecutor.\n\nNherera thrust his fingers into the juveniles privates. The matter came to light when the complainant went to school and reported it to her teacher, who in turn informed the complainants brother, leading to Nhereras arrest.\n\nIn his defence, Nherera denied the charge.\n\nOn the day in question, the complainant came to his house to assist my daughter with her homework and the two left home after doing their homework. I am shocked that she claims I indecently assaulted her, he argued.\n\nNherera claimed the complainant was influenced by someone to fabricate the charges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/08/court-gavel-2-680x380.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A BULAWAYO man was yesterday sentenced to 15 years in jail for indecently assaulting his co-tenant’s 11-year-old daughter on several occasions. Henry Nherera (47) of Emthunzini suburb pleaded not guilty but was convicted of indecent assault by Western Commonage regional magistrate, Mrs Sibongile Marondedze. In passing the sentence, the magistrate noted that the […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "RBZ widens crackdown on shops",
            "url": "https://www.chronicle.co.zw/rbz-widens-crackdown-on-shops/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nRESERVE Bank of Zimbabwe (RBZ) has announced that it will widen its ongoing blitz on businesses across the country, defying the Government directive to accept the use of multicurrency, which also includes embracing the local currency, the ZiG, as a legal tender at the official rate when pricing products.\n\nThe operation, which was hitherto confined to Harare and its environs, will be extended to other provinces during the first quarter of the year as part of enforcing financial laws.\n\nThis comes at a time when some businesses in Bulawayo among other cities and towns, continue to defy Government directives to accept ZiG as the legal tender, with the informal sector, continuing to give flimsy excuses, among them network hurdles on their point-of-sale (POS) machines, forcing consumers to use foreign currency.\n\nZimbabwe Gold\n\nThe Statutory Instrument (SI) 81A of 2024, promulgated by the Government after the successful launch of the structured currency in April last year, compels businesses to use the official exchange rate when pricing products.\n\nAlso, in 2022, the Government gazetted SI 218 of 2023, which effectively extends the use of the multiple currency system to December 2030.\n\nHowever, regardless of all these statutory instruments, some businesses continue to frustrate consumers as they refuse to accept the local currency, with some businesses opting to accept it using the black-market rate, which erodes consumers purchasing power.\n\nIn an interview, RBZ Governor Dr John Mushayavanhu said when the Government enacts policies, it expects businesses and the general public to comply with the regulations.\n\nOn the financial side, these policies are enforced by the Financial Intelligence Unit (FIU) and other Government units that have instruments to deal with such malpractices.\n\nIt should be noted that FIU monitoring and compliance operations have hitherto been concentrated in Harare and its environs, but beginning the first quarter of 2025, the FIU is expanding its enforcement operations into Bulawayo and other provincial capital cities, said Dr Mushayavanhu.\n\nSome of the measures include heavy penalties for organisations that violate the exchange control regulations, and this will greatly improve compliance across the board. The FIU continues to urge the public to report issues of non-compliance, and they will swiftly respond as necessary.\n\nDr Mushayavanhu said in promoting compliance, efforts by the FIU are beginning to bear fruit as some areas witness increasing levels of compliance in the smaller shops that are now accepting the local currency.\n\nCompliance is a confidence issue, and the RBZ continues to refine its monetary policy to achieve and maintain price and exchange rate stability, and confidence will be restored in the transacting public, he said.\n\nRBZ\n\nDr Mushayavanhu noted that while the informal sector compliance levels are still far below the formal sector, it is encouraging to note that the trend is improving.\n\nThe Government is working towards increasing usage of local currency in all parts of the country including for settlement of taxes, purchase and sale of goods and services in local currency.\n\nIt is, however, important to take cognisance of the increased reliance on digital or electronic payment methods over cash, which has, to an extent, seen a reduction in the demand for cash and resultantly lower the proportion of cash in circulation to broad money, he said.\n\nDr Mushayavanhu said the foreign exchange market has been liberalised to reflect free market forces, adding that there should be no incentive for trading on the parallel market.\n\nIt has been noted that cases of exchange control-related violations have significantly declined over the last quarter of 2024, aligning with the exchange rate stability that has been obtained, he said.\n\nRBZ will continue to implement measures to augment the current stability and will remain mindful of balancing currency and price stability with economic growth.\n\nConsumer Council of Zimbabwe (CCZ) director, Mrs Rose Mpofu, said the refusal by some shops to accept ZWG as legal tender is an offence as it violates consumers right to choose currencies to use.\n\nConsumer Council of Zimbabwe\n\nConsumers that are formally employed, especially those in the public sector, earning a portion of their incomes in the local currency are disadvantaged. It creates a huge demand and appetite for foreign currency thus pushing the alternative market rate high, and creating a lucrative market for the US dollar in the informal sector, she said.\n\nMrs Mpofu said the Government should build market confidence in ZiG acceptance by businesses, urging consumers to report any business unethical tendencies.\n\nIn a snap survey yesterday, the Chronicle news crew observed that some businesses in Bulawayo were refusing to accept the ZiG.\n\nWe are not accepting ZiG because our suppliers are refusing transactions in local currency, which makes it difficult for us to trade in ZiG, said an informal trader operating at the market\n\nSome selected foreign-owned shops and informal shops visited by the news crew in the city centre had displayed an exchange rate of US$1:28 ZWG, purportedly indicating that they accepted ZiG transactions.\n\nHowever, they had no POS machines preferring cash.\n\nConfederation of Zimbabwe Industries President Mr Denford Mutashu said it is illegal for retailers not to comply with exchange regulations.\n\nHowever, while most major retrial outlets are complying by accepting the ZiG, unfortunately, some have found the going tougher due to unfair competition from the informal shops, said Mr Mutashu.\n\n@SikhulekelaniM\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fjnjnbnbnbjn.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  RESERVE Bank of Zimbabwe (RBZ) has announced that it will widen its ongoing blitz on businesses across the country, defying the Government directive to accept the use of multicurrency, which also includes embracing the local currency, the ZiG, as a legal tender at the official rate when pricing products. The operation, which was […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Young tennis star eyes breakthrough",
            "url": "https://www.chronicle.co.zw/young-tennis-star-eyes-breakthrough/",
            "content": "Don Makanyanga, Zimpapers Sports Hub\n\nAFTER making his debut appearance for Zimbabwe at an international tournament last week, 17-year old rising tennis star is looking forward to more caps.\n\nThe Mutare- based tennis star, Ronan Tashinga Mtisi, played his first international match for Zimbabwe last week when the country hosted Morocco in a Davis Cup Group 2 World Cup play-off.\n\nIt was not to be the best of debuts for the tennis star as Zimbabwe succumbed to a four- nil defeat.Despite the defeat for Zimbabwes development representative Mtisi, the Davis Cup marked the beginning of his international journey.\n\nMtisi featured in the doubles with Courtney Lock before playing a singles match, which he put up a brave fight to lose 4-6, 3-6.\n\nRepresenting Zimbabwe was a dream come true for the Mutare based player.Playing in the Davis Cup was quite an opportunity for me, said Mtisi.\n\nHe said he was nervous to play at a big stage though he had his nerves calmed by the experience of seasoned tennis player, Courtney.\n\nI think for the first games I was a bit nervous.I played doubles with Courtney, he is a great player, great doubles player. He was telling me what to do.\n\nI think we played well but then the guys were too good and as for the singles, I started off a bit slow. I went 5-2 down, then I tried to come back, he said.\n\nI was feeling more comfortable; I was under pressure; I think I played well for the first time. There was a big crowd, I was feeling nervous but I managed to play my best tennis today.\n\nIt didnt go my way, but Im proud of myself, said Mtisi.Growing up representing his country was a far-fetched dream as he never envisioned that one day he would represent the country.\n\nGrowing up, I didnt really think I would make it this far, playing in the Davis Cup for my country.Tennis was just a sport. I started it at school, when I was in Grade Four, thats when I started playing tennis.\n\nAt least I know that I was keeping something that could take me this far. I really feel proud of myself that I managed to represent my country, said an elated Mtisi\n\nHe said he is now ready for the challenge that lies ahead.Im looking forward to representing Zimbabwe at some level, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fgmbvmv.jpg",
            "description": "Don Makanyanga, Zimpapers Sports Hub AFTER making his debut appearance for Zimbabwe at an international tournament last week, 17-year old rising tennis star is looking forward to more caps. The Mutare- based tennis star, Ronan Tashinga Mtisi, played his first international match for Zimbabwe last week when the country hosted Morocco in a Davis Cup […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Fashion designer redefining Denim fashion with timeless designs",
            "url": "https://www.chronicle.co.zw/fashion-designer-redefining-denim-fashion-with-timeless-designs/",
            "content": "Sipepisiwe Moyo ,[emailprotected]\n\nBulawayo-based fashion designer, Emkay Brizzy (Thubelihle Mkhaliphi), is giving a new meaning to denim fabric.\n\nThe founder of Timeless Designs, located in the city centre, is seamlessly blending vintage aesthetics with contemporary style, creating unique, wearable art.\n\nEmkay has made a name for himself in the fashion industry by crafting distinctive designs for clients in and around Bulawayo, including renowned musician Holy Ten, video vixen Neesa Nobz, and MC King Kalue.\n\nMC King Kalue in a denim outfit designed by Emkay Brizzy.\n\nHis creativity was also on full display at Sandra Ndebeles Denim & Pearls event last month, where he designed an eye-catching outfit for one of the events organisers, Maxy Tekere.\n\nWere passionate about redefining the denim landscape. Our vision is to revolutionise the way people perceive jeans, transforming them from mere clothing into wearable art. We aim to blend vintage aesthetics with contemporary style, crafting unique pieces that resonate with the modern individual, Emkay Brizzy said.\n\nAs a designer, I rely on a combination of technical skills and creative expertise, which guide my design process. This includes pattern making, garment construction and texture manipulation, he said.\n\nEmkays passion for fashion began during his childhood, where he was captivated by how clothing could evoke emotions and tell stories. He draws inspiration from the vibrant colours, textures and patterns of his upbringing.\n\nHe is also influenced by the stories and emotions woven into the fabric of his community, ensuring his designs reflect not only his own journey but also resonate with others who share similar experiences.\n\nMy interest in fashion design was sparked by my childhood experiences and memories. I was always fascinated by the fact that clothes could convey emotions and narratives. I started experimenting with designs by creating my own clothing and accessories and soon realised that fashion was not just about aesthetics but also a form of self-expression and identity.\n\nFrom there, I began exploring different design techniques and seeking guidance from mentors in the industry. My journey as a fashion designer has been gradual, but it has always been driven by my passion for storytelling through fashion, he said.\n\nAccording to Emkay, Timeless Designs is a renowned apparel brand dedicated to creating exquisite pieces that transcend fleeting fashion trends.\n\nTo balance the creative and business aspects of running a fashion label, he prioritises tasks, focuses on one aspect at a time and surrounds himself with a talented team that supports both his creative and business endeavours.\n\nEmkay Brizzy design showcase by Video Vixen Nessa Nobz\n\nBy staying organised, delegating tasks effectively and trusting my instincts, I navigate the challenges of running a fashion label and keep the brand moving forward.\n\nRight now, we are focusing on expanding our denim line to include more sustainable, eco-friendly options.\n\nBesides his upcoming designs featuring bold and innovative denim pieces, Emkay also plans to collaborate with other designers and artistes to bring fresh perspectives and ideas to his brand.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fdfgdhshgfg.jpg",
            "description": "Sipepisiwe Moyo , moyosipepisiwe@gmail.com Bulawayo-based fashion designer, Emkay Brizzy (Thubelihle Mkhaliphi), is giving a new meaning to denim fabric. The founder of Timeless Designs, located in the city centre, is seamlessly blending vintage aesthetics with contemporary style, creating unique, wearable art. Emkay has made a name for himself in the fashion industry by crafting distinctive […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Manhize begins steel bars production",
            "url": "https://www.chronicle.co.zw/manhize-begins-steel-bars-production/",
            "content": "Patrick Chitumba,[emailprotected]\n\nTHE US$1,5 billion Manhize Steel Plant in the Midlands province has commenced the production of reinforced steel bars (rebars) in yet another milestone development aligning with Zimbabwes Vision 2030 and contributing more to the countrys economy.\n\nThe Chinese steel manufacturer begun producing rebars this week and these will support infrastructure development, reduce imports and boost the construction industry thereby contributing to economic growth.\n\nThe Manhize steel plant is one of the Tsingshan Group of Chinas mining projects in Zimbabwe.The investor is one of the biggest investors with various other projects such as Afrochine Smelting (Pvt) Ltd in Selous, Mashonaland West, which is into chrome smelting and Dinson Colliery (Pvt) Ltd in Hwange, Matabeleland North, which is into coke production.\n\nAll these projects are interlinked as both ferrochrome and coke are required in steel production.Other products that the company will eventually produce include pipes, bolts and nuts, smaller slags, rolled tubes, fences, shafts and wires, among others.\n\nThe company commenced operations last year, initially producing pig iron and now has expanded its production line to include rebars, with a target output of 600 000 tonnes of steel products in its first phase.\n\nIn an interview yesterday, Mr Wilfred Motsi, who is Discos project director confirmed the commencement of rebars production.\n\nThat is true, we have started production and most of the products will be for the local market. The surplus will be exported to improve on exports revenue generation and balance of payments, he said.\n\nSteel bars produced at Manhize Steel Plant\n\nCommenting on the development, Zimbabwe Building Contractors Association president, Dr Tinashe Manzungu, said production of rebars at Disco Manhize is a welcome development.\n\nWe are working to close the infrastructure gap as contractors and this requires huge capital outlay. Manufacturing such products locally will cut costs significantly thereby making the final products affordable, he said.\n\nDr Manzungu said in general, this development is going to drive capacity utilisation of industries.There has been an acute shortage of foreign currency to import raw materials such as what Disco Manhize is now producing, he said.\n\nZimbabwe Institute of Foundries chief operations officer Mr Dosman Mangisi said the manufacture of rebars will boost the construction industry.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/section-of-Manhize-iron-and-steel-plant5.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw THE US$1,5 billion Manhize Steel Plant in the Midlands province has commenced the production of reinforced steel bars (rebars) in yet another milestone development aligning with Zimbabwe’s Vision 2030 and contributing more to the country’s economy. The Chinese steel manufacturer begun producing rebars this week and these will support infrastructure development, reduce […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Let’s revive CSOSs so as to empower our rural folks",
            "url": "https://www.chronicle.co.zw/lets-revive-csoss-so-as-to-empower-our-rural-folks/",
            "content": "COMMUNITY share ownership schemes (CSOSs), launched in 2011 as part of the wider economic indigenisation and empowerment drive, transformed rural areas, mainly those adjacent to large mines.\n\nIn terms of the law, extractive companies must set aside up to 10 percent of their shareholdings to communities they operate in. Communities then decide on development projects they want executed.\n\nWe remember the big names  Mhondoro-Ngezi CSOS,which is supported by Zimplats, Marange-Zimunya CSOS, which is backed by diamond miners at Chiadzwa and the Tongogara CSOS supported by Unki Mine.\n\nThrough the schemes, roads, clinics and schools were built in many parts of the country.Scores secured fulltime jobs in the secretariats of the schemes and as project-based employees.Incomes and livelihoods improved markedly.\n\nFor the Government, this was a smart move. Instead of using its resources to build infrastructure, the private sector did the job. This meant a huge saving of public resources, which were then channelled to other pressing undertakings.\n\nHowever, CSOSs appear to have lost steam.\n\nSpeaking at Blanket Mine near Gwanda recently, Presidential Affairs and Devolution Permanent Secretary, Engineer Tafadzwa Muguti hailed the great work that CSOSs have done but said they must be more effective.\n\nHe wants decision-making to be more collective, not the situation now, which has seen a few making decisions for communities. He wants greater transparency on the impact of the schemes.\n\nOne major challenge is that when these schemes are introduced, only a few educated or privileged individuals tend to dominate decision-making. We must ensure greater community engagement so that everyone has a voice. Reports on the socio-economic impact of the 10 percent share ownership allocation must be shared openly, he said.\n\nThe Second Republic wants businesses that integrate themselves into local communities, where value is visible and felt by all.\n\nAs a matter of fact, CSOSs have been overshadowed by the devolution fund, which has built hundreds of projects, evenly spread across the country as opposed to the mainly mine-specific impact of CSOSs.\n\nEng Mugutis observations must be followed through for the empowerment initiative to perform to its full potential.\n\nWe ask Government to demand, from eligible companies, up-to-date, detailed reports showing the amounts of money they are allocating to their CSOSs.The trusts must identify the projects on which they spent their allocations and pinpoint them physically.\n\nAs Eng Muguti observed, the secretariats of the schemes should let the people prioritise projects they want done.\n\nIf CSOSs thrive alongside the devolution fund, rural areas would undergo a rapid, inclusive and sustainable transformation which we all desire.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hhhh.jpg",
            "description": "COMMUNITY share ownership schemes (CSOSs), launched in 2011 as part of the wider economic indigenisation and empowerment drive, transformed rural areas, mainly those adjacent to large mines. In terms of the law, extractive companies must set aside up to 10 percent of their shareholdings to communities they operate in. Communities then decide on development projects […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Disappointing amacimbi harvest despite good rains",
            "url": "https://www.chronicle.co.zw/disappointing-amacimbi-harvest-despite-good-rains/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nVILLAGERS in Bulilima District, Matabeleland South Province, a hotspot for mopane worms harvesting, say the yield of the popular delicacy was low this season despite good rains recorded across the region and the rest of the country.\n\nMatabeleland region received good rains in December and the greater part of January bringing relief to farmers as crops and livestock improved significantly.\n\nThe good rains, which saw some places receiving rainfall almost on a daily basis, turned out to be not a blessing at least as far as mopane worm harvesting is concerned, villagers in Mopane and Mbonqane villages lamented yesterday.\n\nThis time, I harvested just two buckets, which are equivalent to two 20kg bags, compared to previous seasons when we made a lot of money from selling amacimbi that we would have harvested.\n\nI will keep this seasons harvest for my family only, I cant afford to sell any as the harvest was not very good, said a Mbonqane villager, Mrs Atallia Mhlanga.\n\nWe received a lot of rain at a time when we expected to start harvesting amacimbi. So, we did not get ample time to go into the wild to harvest.\n\nAmacimbi grow so fast that if you dont harvest them while they are still feeding on tree leaves, they burrow into the ground and disappear.\n\nShe said villagers are hopeful the next mopane worms harvest season expected sometime in April will be much better.\n\nMrs Evelyn Ngwenya, another villager said this time around locals did not witness an influx of people from other regions rushing into Bulilima District in search of the delicacy.\n\nAmacimbi harvesting has in the past been a source of conflict between locals and dealers from other provinces.\n\nIn the past, traditional leaders in Matabeleland South province have expressed concern over rampant deforestation caused by people harvesting mopane worms in the area.\n\nIn less than three weeks, amacimbi were gone and I think by the time the outsiders learned that the harvesting season had started there was nothing in the wild to harvest. The difference between locals and outsiders is how we harvest amacimbi.\n\nAmacimbi\n\nWe simply pick them from the trees or the ground while they cut down trees and do not care about the destruction that they leave behind, said Mrs Ngwenya.\n\nShe showed The Chronicle part of the 20kg of amacimbi that she harvested in early January.\n\nIt rained so heavily in this area that it was difficult to harvest amacimbi and by the time the skies opened up, they were gone,\n\nA villager from Mopane village, Mr Aleck Siziba, said a few people in his area harvested the delicacy.\n\nWe had hoped to have a good amacimbi harvest since the vegetation is in a good state but surprisingly few people managed to get a good harvest.\n\nAmacimbi season comes in two stages, so we hope in April when rainfall is expected to be minimal, there will be plenty of them for villagers to harvest and keep for their families, said Mr Siziba.\n\nIn 2023, the Bulilima Rural District Council took practical steps to control the harvesting of amacimbi after noting that the delicacy was facing a high risk of extinction in the wild due to over-harvesting and deforestation.\n\nSince time immemorial, amacimbi widely consumed in Zimbabwe, Namibia, Botswana, South Africa and Zambia, has provided food at low cost and generated income for locals helping to fight hunger and poverty.\n\nAmacimbi constitute one of the cheapest sources of protein for locals.\n\nFor a long time, locals in the Matabeleland region have collected amacimbi from the wild and partly traded them to earn money to buy other needs.\n\nIn recent years, there have been growing concerns over unsustainable harvesting practices that have decimated amacimbi species in areas bordering Botswana and South Africa.\n\nUnder Bulilma by laws, persons harvesting amacimbi will be required to pay a certain amount of money to the council, which would then be ploughed back into the community.\n\nBotswana banned the harvesting of amacimbi after the government and conservation experts agreed that taking drastic measures would allow the popular delicacy to pupate or burrow into the ground and become stock for the next season to increase the severely depleted amacimbi population.\n\nAuthorities in that country have stopped issuing harvesting permits to amacimbi dealers who trade the delicacy both locally and in neighbouring countries.\n\nZimbabwe is yet to ban the harvesting of amacimbi for commercial purposes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/lhk.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com VILLAGERS in Bulilima District, Matabeleland South Province, a hotspot for mopane worms harvesting, say the yield of the popular delicacy was low this season despite good rains recorded across the region and the rest of the country. Matabeleland region received good rains in December and the greater part of January bringing relief to […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        },
        {
            "title": "Africa Amateur Champs, Women’s Invitational tee off",
            "url": "https://www.chronicle.co.zw/africa-amateur-champs-womens-invitational-tee-off/",
            "content": "Brandon Moyo,[emailprotected]\n\nAFTER two days of official practice rounds, Zimbabwes golfers are ready to tee off at the second edition of the Africa Amateur Championship and the Africa Amateur Womens Invitational at Leopard Creek in South Africa, this morning.\n\nZimbabwe will be represented by eight male golfers, Vincent Chidambazina (Hillside Golf Club, Mutare), Kelvin Muchenje (ZRP Golf Club, Harare), Keegan Shutt (Royal Harare Golf Club), Darlington Chikanyambidze (Royal Harare Golf Club), Shepherd Chiwaya (Wingate Park Golf Club, Harare), Elton Zulu (Bindura Golf Club), Michael Wallace (Royal Harare Golf Club), and Tanaka Chatora (Royal Harare Golf Club).\n\nThe Womens Invitational will feature three Zimbabwean female golfers, Primrose Chikwaya, Miriam Masiya and Danielle Bekker.\n\nLast years inaugural event saw Zimbabwes Matthew Bramford finish fourth with an impressive 10-under-par 288. Keegan Shutt also made history, setting a course record at Leopard Creek with a remarkable 10-under-par 62 in the fourth round.\n\nZimbabwe golfers in South Africa for the Africa Amateur Championship\n\nShutt started on the 10th tee and made six birdies on his front nine before adding shots on his 11th and 12th holes, followed by a brilliant eagle on the 15th.\n\nHe finished the tournament tied for eighth place with a level-par 288.In a statement, Zimbabwe Golf Association (ZGA) president, Martin Chikwana, who is also the head of delegation, said they are looking forward to solid performances from the players. Last year, Zimbabwe had four players at the inaugural event.\n\nThis is the second time that this competition is being hosted and we expect our golfers to do well in the competition, building on how they performed last year where we had four golfers. Matthew Bramford finished fourth while Keegan Shutt shot 10-under-par-62 and went on to set a new course record, said Chikwana.\n\nThe winner of the Africa Amateur Championship will earn exemptions into several prestigious tournaments, including The 153rd Open at Royal Portrush. The winner of the Africa Amateur Womens Invitational will earn starts in The Womens Amateur Championship and Final Qualifying for the AIG Womens Open, among others.\n\nA total of 71 golfers from 23 countries will compete in the tournament, which runs until Saturday. @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/how-can-you-tell-a-left-and-right-handed-golf-club.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com AFTER two days of official practice rounds, Zimbabwe’s golfers are ready to tee off at the second edition of the Africa Amateur Championship and the Africa Amateur Women’s Invitational at Leopard Creek in South Africa, this morning. Zimbabwe will be represented by eight male golfers, Vincent Chidambazina (Hillside Golf Club, Mutare), Kelvin […]",
            "time": "06:39",
            "date": "05 Feb 2025"
        }
    ]
}