{
    "news": [
        {
            "title": "President Mnangagwa reassigns Cabinet Ministers, appoints Director General",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-reassigns-cabinet-ministers-appoints-director-general/",
            "content": "Bongani Ndlovu, Online Reporter\n\nPRESIDENT Mnangagwa has reassigned two Cabinet Ministers and appointed a Director General in the Presidents Department.\n\nIn statements, Chief Secretary to the President and Cabinet Dr Martin Rushwaya said the appointments were with immediate effect.\n\nMinister Edgar Moyo\n\nThe Minister of Energy and Power Development is now July Moyo, replacing Edgar Moyo, who is now the Minister of Public Service, Labour and Social Welfare.\n\nMinister July Moyo held the Public Service portfolio while Minister Edgar Moyo held the Energy and Power Development portfolio.\n\nIn terms of Subsection 1 of Section 104 of the Constitution of Zimbabwe, His Excellency the President, Cde. Dr. Emmerson Dambudzo Mnangagwa has reassigned the under-listed Ministers as follows:Hon. J.G. Moyo, M.P. Minister of Energy and Power Development.Hon. E. Moyo, .. : Minister of Public Service, Labour and Social Welfare.The re-assignments are with immediate effect, he said.\n\nDr Rushwaya said the President has appointed Dr Fulton Mangwanya as Director General, in the Presidents Department.\n\nIn terms of Section 226(1) of the Constitution of Zimbabwe, His Excellency the President, Cde. Dr. Emmerson Dambudzo Mnangagwa has appointed Dr. Fulton Mangwanya as the Director General, Presidents Department. The appointment is with immediate effect, said Dr Rushwaya.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Food-security.jpg",
            "description": "Bongani Ndlovu, Online Reporter PRESIDENT Mnangagwa has reassigned two Cabinet Ministers and appointed a Director General in the President’s Department. In statements, Chief Secretary to the President and Cabinet Dr Martin Rushwaya said the appointments were with immediate effect. The Minister of Energy and Power Development is now July Moyo, replacing Edgar Moyo, who is […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "Man rapes form two on New Year’s Eve",
            "url": "https://www.chronicle.co.zw/man-rapes-form-two-on-new-years-eve/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA 25-year-old man employed as a herd boy in the Tshinvhazwimi area under Chief Tshitaudze in Beitbridge has been arrested for raping a form two pupil (aged 15) who had been left in his custody on New Years Eve.\n\nMickson Ncube is accused to have raped the complainant at knife point had been left by in the custody of her and her young brother on the fateful day.\n\nHe was not asked to a charge of rape when he appeared before Beitbridge regional magistrate Ms Charity Maphosa on Friday who remanded him in custody to January 7.\n\nProsecuting, Mr Willbrought Muleya told the court that on December 31 the accused was left in the company of the two children by their mother who went to Beitbridge town.\n\nThe mother did not return on the same day as promised due to other reasons.\n\nThe court heard that later in the night, the complaint was awakened by Ncube who was caressing her.\n\nShe then screamed for help, but it was in vain as Ncube threatened to stab her with a kitchen knife he had been holding.\n\nThe accused lifted the victim from her room and took her outside where he met her young brother who had been awakened by her cry for help.\n\nNcube also threatened to stab the minor before dragging the complainant to the bush where he raped her once at knife point.\n\nAfter the sexual abuse, he ordered the girl to return home where upon arrival informed her mother over the phone about the ordeal.\n\nA report was then made to the police who swiftly arrested Ncube.\n\nThe incident comes a few weeks after another herd boy from Gwanda who took turns with his friend to rape a 11-year-old girl from Mkhalipe area was sent to jail for an effective 18 years by a Beitbridge Regional Court.\n\nProud Mnkhandla aged 31 is accused of having committed the offence in May this year along with another accomplice who is still at large.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A 25-year-old man employed as a herd boy in the Tshinvhazwimi area under Chief Tshitaudze in Beitbridge has been arrested for raping a form two pupil (aged 15) who had been left in his custody on New Year’s Eve. Mickson Ncube is accused to have raped the complainant at knife point […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "The ultimate crosssover to 2025…KEC unites Zimbabweans in prayer and song",
            "url": "https://www.chronicle.co.zw/the-ultimate-crosssover-to-2025-kec-unites-zimbabweans-in-prayer-and-song/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nNUMBERS dont lie!\n\nTHIS aptly describes how well attended the Kingdom Empowerment Centre (KEC) Cross Over night was, on New Years Eve.\n\nThe event, held at the Zimbabwe Exhibition Centres Hall 2 in Bulawayo proved to be what every Christian would have wanted to attend before the New Year came by.\n\nThe hall was filled to capacity.\n\nThe rain didnt dampen the spirit of as many worshipers who came.\n\nPrayer, worship, song and dance were the mainstay of the night.\n\nLed by prominent man of the cloth and leader of KEC Prophet Bruce Edwards and his wife Prophetess Pamela Edwards, the night was filled with enjoyment as people celebrated the gift of life that saw seen survive the previous year and also witness the dawn of 2025.\n\nAside from Prophet Edwards teaching and revelations, people were entertained by an array of Gospel musicians, putting an icing to the New Years celebrations. All male music outfit Family Voices brought the house down shortly after midnight with their captivating perfomance. Not to be outshined on the night was the KEC choir and the KEC Temple Dance Juniors. So was upcoming musician Minister X who proved to be the crowds favourite with his energetic act, coupled with contemporary dance routines.\n\nThe KEC church also took the opportunity to appreciate the contribution of its members by awarding them and the most coveted award went to the media team which for the year 2024 worked immensely to contribute to the growth of the institution.\n\nFor Prophet Bruce Edwards and the entire KEC leadership, the Cross Over night capped a good year in ministering the Word of God and changing peoples lives for the better.\n\nUltimately, the crossover night was a hit!\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fjfgfgj.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com NUMBERS don’t lie! THIS aptly describes how well attended the Kingdom Empowerment Centre (KEC) Cross Over night was, on New Year’s Eve. The event, held at the Zimbabwe Exhibition Centre’s Hall 2 in Bulawayo proved to be what every Christian would have wanted to attend before the New Year came by. The […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "Man run over and dies on spot along Khami Road on New Year’s Day",
            "url": "https://www.chronicle.co.zw/man-run-over-and-dies-on-spot-along-khami-road-on-new-years-day/",
            "content": "Diana Baloyi Moyo,[emailprotected]\n\nA 23 year old man died on the spot after he was run over by a motor vehicle along Khami Road in Bulawayo on New Years Day.\n\nBulawayo Police are appealing for information that may assist in their investigation of the incident.\n\nThe accident, Police said, occurred along Khami Road near the DA Service Station.\n\nIn another hit and run, this time in Harare, where an unidentified man, approximately 30 years old, was also hit by an unknown vehicle and died along Magoda Road, opposite OK Supermarket, Pamubhedha, Budiro 5, Harare, on 1 January.\n\nHis body has been taken to Sally Mugabe Mortuary for a post-mortem examination.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/12/hit-and-run-incident.jpg",
            "description": "Diana Baloyi Moyo, moyodiana@gmail.com A 23 year old man died on the spot after he was run over by a motor vehicle along Khami Road in Bulawayo on New Year’s Day. Bulawayo Police are appealing for information that may assist in their investigation of the incident. The accident, Police said, occurred along Khami Road near […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "All set for Acting President Kembo Mohadi’s football and netball tournament in Bulilima",
            "url": "https://www.chronicle.co.zw/all-set-for-acting-president-kembo-mohadis-football-and-netball-tournament-in-bulilima/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nBulilima District in Matabeleland South province will host the KCD Mohadi football and netball tournament at Madlambudzi Business Centre grounds on Saturday.\n\nThe tournament is being held across all 12 constituencies in the province in honour of Vice President Kembo Mohadi and is organised as part of an ongoing campaign to encourage the youth to stay away from drugs and other abusive substances.\n\nSo far, other constituencies within Matabeleland South have hosted their games. Bulilima and Beitbridge East constituencies are set to conclude the competitions leg, leading up to the grand final on 25-26 January in Gwanda.\n\nTwelve football teams and eight netball teams are expected to participate in Saturdays event.\n\nThe chief organiser of the tournament, Zanu PF Matabeleland South Youth League chairperson Cde Moses Langa, stated that the tournament has been successfully held across the province with positive results, and they expect the same from the Bulilima event.\n\nWe are proud that we have so far organised successful competitions in other constituencies. We came up with the idea to host a sports competition to assist the youth in emulating the character and deeds of our Vice President Kembo Campbell Mohadi. He has been an inspiration not only in Matabeleland South but throughout the country. Young people should follow in the footsteps of our liberation struggle veterans like KCD Mohadi, who began their political careers at a young age.\n\nThe tournament also seeks to combat drug and substance abuse, an issue that has greatly affected the future generation of this nation, said Cde Langa.\n\nZanu PF Bulilima District Secretary for Youth Affairs Cde Dumisani Mpofu added:\n\nFor now, preparations are at an advanced stage as most youths have organised their teams for the tournament, and our leaders have also made significant contributions. All this demonstrates that the VP tournament will indeed be a success.\n\nMoreover, the significance of this tournament lies in its promotion of unity, patriotism, and love for the party, as everyone is gearing up for the day, said Cde Mpofu.\n\nFollow on X  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/hyutr556.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Bulilima District in Matabeleland South province will host the KCD Mohadi football and netball tournament at Madlambudzi Business Centre grounds on Saturday. The tournament is being held across all 12 constituencies in the province in honour of Vice President Kembo Mohadi and is organised as part of an ongoing campaign to encourage […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "Kwekwe Murder Investigation Underway After Bar Stabbing",
            "url": "https://www.chronicle.co.zw/kwekwe-murder-investigation-underway-after-bar-stabbing/",
            "content": "Diana Baloyi Moyo,[emailprotected]\n\nA murder suspect is on the run after fatally stabbing a man with a Columbia knife in the chest on 30 May at a bar in Zhombe Village, Kwekwe.\n\nThe unidentified suspect allegedly accused the victim, 21-year-old Lloyd Zhakata, of assaulting his younger brother, which led to the tragic incident.\n\nAnyone with information is urged to report to the nearest police station, stated the police on X.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/04/Knife-and-Gavel.jpg",
            "description": "Diana Baloyi Moyo, moyodiana@gmail.com A murder suspect is on the run after fatally stabbing a man with a Columbia knife in the chest on 30 May at a bar in Zhombe Village, Kwekwe. The unidentified suspect allegedly accused the victim, 21-year-old Lloyd Zhakata, of assaulting his younger brother, which led to the tragic incident. “Anyone […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "We’ll take a cop of kindness yet! Drunk Zambian officer freed 13 perps from cells to enjoy New Year",
            "url": "https://www.chronicle.co.zw/well-take-a-cop-of-kindness-yet-drunk-zambian-officer-freed-13-perps-from-cells-to-enjoy-new-year/",
            "content": "A Zambian police officer has been arrested after he drunkenly released 13 suspects from custody, stating they were free to cross over into the New Year.\n\nIn a statement released by the Zambia Police Service, Detective Inspector Titus Phiri from the Leonard Cheelo Police Post, allegedly opened the cells housing male and female detainees at around 10:00 on New Years Day.\n\nREAD |Intoxicated Gauteng cop kills girlfriend at her place of refuge\n\nPreliminary investigations reveal that Detective Inspector Phiri, in a state of intoxication, forcibly seized cell keys from Constable Serah Banda.\n\nSubsequently, Phiri unlocked both the male and female cells and instructed the suspects to leave, stating they were free to cross over into the New Year. Out of the 15 suspects in custody, 13 escaped. Following the incident, the officer fled the scene and disappeared into the nearby compound, read the statement.\n\nAccording to police, the suspects faced charges ranging from assault, theft, burglary and conduct likely to cause a breach of peace.\n\nAll the suspects, remain at large. A docket of case has been opened, and a manhunt has been launched. The Zambia Police Service has intensified efforts to locate and apprehend the escapees, stated local police.\n\nTheBBC in their reportsaid Phiri had yet to comment on the allegations.\n\nREAD |I was not drunk, I was sober as a judge  FlySafair passenger threatens to sue airline\n\nThe BBC highlighted a response to the incident by former presidential spokesperson and lawyer Dickson Jere, who took to Facebook and wrote: I keep laughing each time I picture the scenario  comical! But then, I remembered a similar incident in 1997.\n\nThis was in reference to an incident where the late High Court judge Kabazo Chana ordered the release of 53 suspects on New Years Eve in 1997, because he was annoyed they had not yet appeared in court despite being arrested as far back as 1992.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/kok.jpg",
            "description": "A Zambian police officer has been arrested after he drunkenly released 13 suspects from custody, stating they were ‘free to cross over into the New Year’. In a statement released by the Zambia Police Service, Detective Inspector Titus Phiri from the Leonard Cheelo Police Post, allegedly opened the cells housing male and female detainees at […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "Dynamos FC sporting director dies",
            "url": "https://www.chronicle.co.zw/dynamos-fc-sporting-director-dies/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nDYNAMOS Sporting director Richard Chihoro has died.\n\nHe was 68.\n\nAccording to the Dynamos board chairperson Bernard Marriot, one of the longest serving Dynamos sons passed on last night at a Harare hospital where he had been taken after complaining of a headache.\n\nI am still to get full details but what I gather is that he complained of a headache yesterday and was taken to hospital where he later passed on. I am still in a state of shock, said Marriot.\n\nChihoro leaves behind his widow, Hazvinei and two daughters, Angeline and Natasha.\n\nChihoro arrived at Dynamos in 1970 as a fresh-faced 14-year-old and went on to distinguish himself by rising through the ranks. At 18, Chihoro was already promoted to the senior team. Unfortunately for him, his arrival coincided with the era of the late legendary footballer George Shaya which meant he had to be content with a place on the bench.\n\nHe was then loaned out to KB Royals and later on to Mutapa Royals before he went on to have a stint with Caps United. After one year at the Green Machine, he was forced to hang his boots following a recurring injury that he had suffered whilst at Mutapa Royals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dynamos.jpg",
            "description": "Sikhumbuzo Moyo,smoyo@chronicle.co.zw DYNAMOS Sporting director Richard Chihoro has died. He was 68. According to the Dynamos board chairperson Bernard Marriot, one of the longest serving Dynamos sons passed on last night at a Harare hospital where he had been taken after complaining of a headache. “I am still to get full details but what I […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "Man jailed for burglary",
            "url": "https://www.chronicle.co.zw/man-jailed-for-burglary/",
            "content": "Tarisiro Tafirenyika,[emailprotected]\n\nA 32-year-old man from Nyanga appeared before the Nyanga Magistrates Court facing charges of unlawful entry.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) reported that on 4 December 2024, at around 7:00 p.m, the complainant closed her shop, locked all the doors, secured the windows, and went home.The following morning, she returned to find the lock broken. Upon entering the shop, she discovered that some goods were missing and subsequently made a police report.\n\nThe police arrested Phillip Nyamukama on 9 December after receiving a tip-off, and he assisted them in locating the stolen items.\n\nNyamukama was sentenced to 15 months in prison for his crime.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Tarisiro Tafirenyika, tarisirotafirenyika@gmail.com A 32-year-old man from Nyanga appeared before the Nyanga Magistrates’ Court facing charges of unlawful entry. In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) reported that on 4 December 2024, at around 7:00 p.m, the complainant closed her shop, locked all the doors, secured the windows, and went […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        },
        {
            "title": "Victoria Falls Councillors reinstate Town Clerk",
            "url": "https://www.chronicle.co.zw/victoria-falls-councillors-reinstate-town-clerk/",
            "content": "Leonard Ncube,[emailprotected]\n\nVictoria Falls City councillors have responded to a government directive to rescind their resolution that suspended Town Clerk Mr Ronnie Dube, who is set to return to work on Monday following the reversal of his suspension.\n\nMr Dube was suspended on 2 December by Victoria Falls Mayor, Councillor Prince Thuso Moyo, who cited Section 29(3) of the Urban Councils Act. The mayor alleged multiple complaints of abuse of office and corruption against Mr Dube.\n\nLocal Government and Public Works Minister Daniel Garwe declared the suspension non-procedural and unsupported by policy. He instructed the councillors to rescind their resolution and reinstate the Town Clerk.\n\nSuccessive council meetings failed to implement the government directive until Tuesday, when councillors convened a special council meeting. One of the meetings lacked a quorum, as only five of the 11 elected councillors attended, while another could not discuss the issue due to the mayors absence, who was in possession of the letter from the minister.\n\nResidents were closely watching the situation, opposing the reinstatement of the Town Clerk and putting councillors in a difficult position between following the government directive and satisfying the electorate.\n\nThe council had set up two bodies of inquiry to investigate the allegations and had presented a report advising the local authority to proceed with an internal disciplinary hearing against Mr Dube.\n\nThe mayor chaired a special full council meeting that rescinded the resolution on Tuesday, paving the way for normalcy and harmony, as directed by Minister Garwe.\n\nThe minister stated that the suspension contravened Section 139 of the Urban Councils Act and invoked Section 314 of the same Act to reverse the resolution. The final decision was to rescind the suspension of the Town Clerk, allowing him to resume work on Monday, 6 January.\n\nIn December, residents, under the civic consortium comprising the Victoria Falls Combined Residents Association (Vifacora) and Hwange District Residents Association (HWADRA), convened a series of meetings over the issue.\n\nMr Herbert Ncube, chair of HWADRA, emphasised that residents would remain steadfast in their resolution to hold public office leaders accountable.\n\nVifacora chair Mr Kelvin Moyo acknowledged that the suspension of the Town Clerk has had an impact on the city.\n\nThe impact of the events in Victoria Falls is that everyone is worried to know what exactly is happening and what can be done to alleviate the situation. Victoria Falls economy depends on tourism and investment, especially with the foreign currency stock exchange here, and we need to create investor confidence. In my view, this is not a personal matter.\n\nCouncillors are elected and have a mandate from the people, so if they see it fit to follow the directive from the government, so be it. That will be judged against residents, he said.\n\n@ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ronnie-dube.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw Victoria Falls City councillors have responded to a government directive to rescind their resolution that suspended Town Clerk Mr Ronnie Dube, who is set to return to work on Monday following the reversal of his suspension. Mr Dube was suspended on 2 December by Victoria Falls Mayor, Councillor Prince Thuso Moyo, who […]",
            "time": "20:25",
            "date": "03 Jan 2025"
        }
    ]
}