{
    "news": [
        {
            "title": "Action and advocacy: President Mnangagwa commits to disability rights",
            "url": "https://www.chronicle.co.zw/action-and-advocacy-president-mnangagwa-commits-to-disability-rights/",
            "content": "Wallace Ruzvidzo, Harare BureauPERSONS with disabilities can be assured that their voices will always be heard in the formulation of national policies and programmes, President Mnangagwa has said.\n\nSince the advent of the Second Republic, persons with disabilities have continued to be empowered and their living conditions have been improved.\n\nIn his address at a meeting with people with disabilities at State House in Harare yesterday, President Mnangagwa said under the Second Republic, the dignity of all persons with disabilities would be upheld.\n\nYou will recall that, in June 2021, I launched the National Disability Policy, which guides our efforts to craft, refine and implement responsive and inclusive disability frameworks across all sectors and levels.\n\nThe Policy draws from the United Nations Convention on the Rights of Persons with Disabilities and other International Conventions, which Government ratified, including the African Agenda 2063 and its disability inclusive protocols.\n\nPresident Mnangagwa presents cash and goodies to some of the persons with disabilities yesterday\n\nThis will enhance the empowerment of persons with disabilities and dovetails with international standards and best practices.\n\nGuided by our mantra of leaving no one and no place behind, be assured that your voices will always be heard in the formulation of national development policies and programmes, he said.\n\nGovernment, said President Mnangagwa, was scaling up efforts towards meeting the aspirations and concerns of persons with disabilities.\n\nAs such, Government Ministries have established Departments for Gender Mainstreaming, Inclusivity and Wellness, which are strategic focal entry points designed to enhance the inclusion of disability in the public sector.\n\nIt is pleasing to note that our efforts are aligned with the domestication of International Conventions and Protocols.\n\nThis unity of purpose and culture of working together must be sustained to promote the dignity of all persons with disabilities.\n\nOn its part, my Government is scaling up deliberate interventions towards the realisation of the aspirations of persons with disabilities. Our national Vision 2030 and National Development Strategy recognise disability inclusion as a fundamental and cross-cutting theme that should be considered by all socio-economic sectors, he said.\n\nThe President said Zimbabwes Constitution articulates a wide array of issues regarding the inclusion and empowerment of persons with disabilities, adding that the enactment of the Persons with Disabilities Bill must be expedited.\n\nSection 6 recognises Sign Language as one of the 16 Official Languages in the country. I commend efforts towards the inclusion of this critical language at public sector events. This must be intensified going forward.\n\nWhile, Section 22 of our Constitution emphasises the need to include disability at all levels in our development plans, a lot has been achieved towards embracing communication formats which are suitable for persons with disabilities, including braille.\n\nEnhancing accessibility to buildings, amenities and public transport, to improve convenience and the overall quality of life for persons with disabilities in all their diversity, is critically important, he said.\n\nPresident Mnangagwa said high impact national disability issues as well as a broad array of programmes and activities would be rolled out for the empowerment of persons with disabilities.\n\nNo one will be left behind. The Zimbabwe National Disability Expo has always been a successful event ever since its introduction.\n\nThe platform allows persons with disabilities, Government, the private sector, civil society organisations and communities to share ideas as well as perspectives, while enabling persons with disabilities to showcase their inherent abilities, he said.\n\nPresident Mnangagwa reaffirmed Governments commitment to facilitating and supporting persons with disabilities enterprises and income generating activities as well as other productive endeavours.\n\nTo this end, President Mnangagwa gifted persons with disabilities US$1 000 seed capital per association.\n\nSelf-reliance, self-sufficiency, and mastery of our destiny as individuals and as a country are key at this stage of our development.\n\nMy Government is determined to facilitate and support you in your enterprises and income-generating activities as well as other productive endeavours in areas such as agriculture, mining, and business, among others, said the President.\n\nHe urged the nation to adapt to the changing socio-economic environment and embrace innovative, inclusive and empowering models of development.\n\nInformation communication technologies continue to revolutionise the way we do things.\n\nTo this end, I challenge the sector to move with speed to set up a credible database for effective programming and projects for persons with disabilities.\n\nCapacity for the monitoring and evaluation of the various programmes for the sector should equally be enhanced.\n\nLet us begin to see more transformational results, said President Mnangagwa.\n\nThe President commended persons with disabilities for the successes they have achieved through the empowerment programmes being championed by his administration.\n\nI urge you, however, to build on the strong foundation set so far and develop your various enterprises into more productive and viable commercial brands.\n\nNyika inovakwa, inotongwa, inonamatigwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhu-le-kelwe ngabanikazi balo.\n\nTogether, in unity, ngativake nyika yedu. Let us rally our collective skills and will-power to build, modernise and industrialise our beloved motherland, Zimbabwe.\n\nBrick by brick and stone upon stone, we are realising Vision 2030, he said.\n\nPresident Mnangagwa presents cash and goodies to some of the persons with disabilities yesterday\n\nIn his remarks before introducing President Mnangagwa, Vice President Constantino Chiwenga said it was important to celebrate the progress that has been made in enhancing the livelihoods of persons with disabilities.\n\nThe VP also commended President Mnangagwa for his all-inclusive development stance.\n\nThrough the guest of honours leadership, we have witnessed significant milestones, he said.Minister of Defence Cde Oppah Muchinguri-Kashiri said under President Mnangagwa, persons with disabilities would not be left behind in the countrys developmental matrix.\n\nYour unwavering commitment to inclusivity and empowerment of the less privileged citizenry is truly inspiring, unparalleled and cannot be overemphasised, she said.\n\nPublic Service, Labour and Social Welfare Minister Edgar Moyo said the Second Republic would not waiver in meeting the needs and concerns of persons with disabilities.\n\nSpecial Advisor on National Disability Issues in the Office of the President and Cabinet (OPC) Ms Rossy Mpofu showered praises on President Mnangagwa and his administration for their continuous recognition and uplifting of people with disabilities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xcdfsxczxcz.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau PERSONS with disabilities can be assured that their voices will always be heard in the formulation of national policies and programmes, President Mnangagwa has said. Since the advent of the Second Republic, persons with disabilities have continued to be empowered and their living conditions have been improved. In his address at […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "Beauty beyond barriers . . .Michelle’s story of resilience, entrepreneurship",
            "url": "https://www.chronicle.co.zw/beauty-beyond-barriers-michelles-story-of-resilience-entrepreneurship/",
            "content": "Flora Fadzai Sibanda,[emailprotected]Despite being born with osteogenesis imperfecta, a rare genetic condition that causes fragile bones, Michelle Madau, a Bulawayo entrepreneur, has defied the odds to build a thriving business in the beauty therapy industry.\n\nGrowing up with brittle bone disease, Madaus daily life was marked by uncertainty and risk. Simple tasks, such as walking or even sitting, carried the risk of serious fractures.\n\nHowever, instead of letting her condition define her, she used it as fuel to push herself beyond the limits set by others. Her passion for beauty therapy, which began in her teenage years, became a source of empowerment and a means to prove her capabilities.\n\nMadaus interest in beauty therapy started when she would experiment with makeup and skincare products on herself and close friends. This early passion eventually led her to pursue a diploma in secretarial studies at Foundation Technical College, after completing her primary and secondary education at Bulawayos King George VI. Although her studies took her down a different path, her love for beauty therapy never faded, and she continued to hone her skills, working from home and building a loyal clientele.\n\nFoundation Technical College\n\nAs word spread about her exceptional skills, demand for her services grew, and Madaus business, Divas Inc., began to take shape. Today, her beauty therapy company is a sought-after brand in Bulawayos competitive beauty industry, offering a range of services, including skincare treatments, manicures, pedicures, facials, and makeup artistry.\n\nHer clients, which include everyday women seeking self-care and brides preparing for their big day, are a testament to her hard work and dedication.\n\nMadaus success is not just a personal achievement; it is also a triumph for people living with disabilities. Her story challenges the stereotypes and misconceptions that often surround disability, demonstrating that with determination and perseverance, anyone can overcome adversity and achieve their goals. Her business has created opportunities for employment and empowerment, not only for herself but also for others who may have been marginalised or overlooked.\n\nWhen I first applied makeup for my friends wedding in 2009, little did I know that this simple act would set the stage for my entrepreneurial journey. From there, l started advertising my work, said Ms Madau.\n\nI would do the advertising from the boot of my car where l would park at a strategic place so that potential clients would easily spot me on the roadside.\n\nDetermined to establish her own space, she launched Divas Inc., a beauty therapy company tailored not only for the general public but also with an inclusive approach to people with disabilities.\n\nHer salon, located in the heart of Bulawayo, has since grown beyond beauty therapy.\n\nUnder Divas Inc., we do makeup, and nails, and also run a kids clothing boutique.\n\nI also work as a professional assistant at a local clothing manufacturing company, said Ms Madau.\n\nI grew up in a loving and supportive family that never made me feel different. I believe the confidence instilled in me at home is what made me the woman I am today.\n\nBeyond beauty services, Ms Madau mentors aspiring beauty therapists, particularly young women with disabilities, encouraging them to pursue their passions despite societal limitations.\n\nTo all women who are physically challenged, self-acceptance is important. Disability will not disappear by feeling sorry for yourself. Instead, you must take charge and learn to work with it, she said.\n\nMs Madaus journey has earned her recognition, with local business groups and women empowerment organisations celebrating her achievements. She has been invited to speak at workshops, sharing her story of resilience and entrepreneurship.\n\nHer dream is to expand her brand, offering training programmes for people with disabilities who want to join the beauty industry.@flora_sibanda\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cfbxzdzxv.jpg",
            "description": "Flora Fadzai Sibanda, florafadzaisibz@gmail.com Despite being born with osteogenesis imperfecta, a rare genetic condition that causes fragile bones, Michelle Madau, a Bulawayo entrepreneur, has defied the odds to build a thriving business in the beauty therapy industry. Growing up with brittle bone disease, Madau’s daily life was marked by uncertainty and risk. Simple tasks, such […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "20 million Euro credit line to support women entrepreneurs",
            "url": "https://www.chronicle.co.zw/20-million-euro-credit-line-to-support-women-entrepreneurs/",
            "content": "Peter Matika, Business Reporter\n\nTHE European Investment Bank (EIB Global) in partnership with Stanbic Bank Zimbabwe has launched a 20 million Euro (ZWG525,9 million) credit line to provide long-term loans at favourable conditions to Small and Medium Enterprises (SMEs).\n\nIn a statement, the EU said the facility will focus on SMEs and businesses owned or run by women, which employ a significant number of women and offer services specifically to women.\n\nThe African continent has one of the highest percentages of women entrepreneurs in the world. More than half the SMEs in Zimbabwe are led by women, while over half of Zimbabwean companies say that limited access to credit is preventing their growth, said the EU.\n\nWorldwide, women-run businesses are less likely to be able to access the finance they need. In line with the EUs Global Gateway, which contributes to narrowing the global investment gap worldwide, the EIB-Stanbic facility will address this financing gap with financial tools targeting the needs of female entrepreneurs and advance womens economic empowerment in Zimbabwe.\n\nThe funding support also contributes to the 2X Challenge, an initiative to mobilise investment that increases womens participation in the economy in emerging markets, by improving womens access to finance, leadership opportunities and quality employment.\n\nEIB vice-president Mr Thomas stros, who is also responsible for diversity and inclusion as well as for operations in Southern Africa, was quoted as saying: With over half of the SMEs in Zimbabwe owned by women, EIB Global support for these businesses will have a real impact on economic growth, job creation and prosperity.\n\nHe said backing women in business contributes to more sustainable and inclusive growth that strengthens communities.Mr Ostros said the initiative aligns with the core belief that Zimbabwe holds huge potential for economic growth.\n\nBy supporting SMEs and enterprises owned or run by women and employing significant numbers of women, we are fostering economic inclusion and national development, he said.\n\nEuropean Investment Bank (EIB) Head of Division Mr Christophe Litt, Stanbic Bank CEO Mr Solomon Nyanhongo and EU Ambassador to Zimbabwe Jobst von Kirchmann\n\nMr Ostros said by empowering SMEs and women-run businesses, they were empowering families, communities and ultimately, the nation.\n\nThrough this partnership, the EU and Stanbic Bank are committed to driving meaningful change and unlocking opportunities for women entrepreneurs and SMEs across Zimbabwe through provision of much-needed medium-term funding, said Stanbic Bank chief executive, Mr Solomon Nyanhongo.\n\nEU Ambassador to Zimbabwe, Mr Jobst von Kirchmann, said investing in women is investing in Zimbabwes future.Through the Team Europe Initiative on Gender Equality and Womens Empowerment, the EU and EU member states are working together to create a transformative impact for Zimbabwean women, he said.\n\nMr Kirchmann said the dedicated credit line complements team Europes efforts on the ground in implementing the Global Gateway Strategy to not only unlock opportunities for women entrepreneurs but also drive inclusive economic growth.\n\nThis partnership between the EU, EIB Global, and Stanbic demonstrates our commitment to womens economic empowerment and financial inclusion, creating jobs and strengthening Zimbabwes private sector, he said.\n\nThe EIB loan is backed by the European Commission and European Union member states through the African, Caribbean and Pacific Trust Fund (ACP Trust Fund).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/stanbic-bank-logo.jpeg",
            "description": "Peter Matika, Business Reporter THE European Investment Bank (EIB Global) in partnership with Stanbic Bank Zimbabwe has launched a 20 million Euro (ZWG525,9 million) credit line to provide long-term loans at favourable conditions to Small and Medium Enterprises (SMEs). In a statement, the EU said the facility will focus on SMEs and businesses owned or […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "Miss Supranational Zimbabwe to be held in Polokwane",
            "url": "https://www.chronicle.co.zw/miss-supranational-zimbabwe-to-be-held-in-polokwane/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nPreparations for the Miss Supranational Zimbabwe pageant, one of the pageants that brought the reigning Miss Universe Zimbabwe to the spotlight, are underway.\n\nThe finale of the pageant, which focuses on natural beauty and grace, will be held on March 22 in Polokwane, Limpopo, South Africa and the finalists are drawn from across Zimbabwe. The finalists are Yolanda Chimusoro, Shelly Usman, Lerato Ivy Masocha, Ruvimbo Njomboro, Eva Mzondiwa, Anusi Chichi Mandevana, Pauline Marere, Brenda Kadewa, Agape Mandizvidza, Zhjanei Chimbioza and Stacey Hall.\n\nNtombi Gumede ,Miss Supranational Zimbabwe director\n\nWhen asked why the pageant will be held in South Africa, pageant director Ntombi Gumede explained: We are franchise holders and are based in South Africa. This plan is more convenient for our organisation to deliver the level of the pageant we wish to achieve. Well host it in South Africa for the next two years until we feel it is convenient for us and our contestants to host it in Zimbabwe.\n\nShe said the pageant will be part of a three-day beauty festival under the theme Aspire to Inspire,which will also include a charity programme.\n\nThis event marks a historic moment as the first-ever intercountry partnership between South Africa and Zimbabwe, bringing together pageantry, culture, and a shared vision for empowerment in a celebration that will be known as the Intercountry Festival of Beauty.\n\nThe ground-breaking festival will kick off on Friday, March 21 and run through Sunday at the Sun Meropa Casino in Polokwane. The three-day festival will showcase the finalists of Miss Supranational Zimbabwe, Miss Cosmo South Africa and Miss Teen Universe South Africa, all joining forces to celebrate the beauty, culture, and heritage of both nations, Gumede said.\n\nAmong the panel of judges will be Miss Supranational Africa 2023, Sakhile Dube and Miss Supranational Zimbabwe 2022, Tatenda Kimberly.\n\nIt will be a celebration of beauty with a purpose as the contestants showcase their talents and commitment to making a difference in their communities.\n\nThe winner will go on to represent Zimbabwe in Poland at the Miss Supranational 2025 competition on June 28.Twelve talented and inspiring finalists have been selected for this competition. However, only 10 of these finalists will be chosen to travel to South Africa and compete for the title of Miss Supranational Zimbabwe.\n\nThe competition will select two winners: a winner and a runner-up. The winner will go on to represent Zimbabwe at the Miss Supranational 2025 competition, taking place on June 28 in Poland. Should the winner be unable to compete internationally for any reason, the runner-up will step in to represent Zimbabwe at Miss Supranational 2025, Gumede said.\n\nThe festival, she added, is not just about beauty but also a testamentto the evolution of the pageantry industry, which today embraces sports, charity, and the promotion of culture and heritage.\n\nPageantry is no longer just about physical beauty; its about inspiring change, advocating for womens empowerment and fostering cross-cultural exchanges, said Gumede.\n\nThe Festival of Beauty is a partnership between Zimbabwe and South Africa. The two countries will share the stage for future collaborative events and charitable initiatives, marking the beginning of a new era in pageantry.\n\nThe festival represents inclusivity, growth and empowerment, offering contestants a platform to make meaningful impact and create positive change in their societies in Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/zrh.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com Preparations for the Miss Supranational Zimbabwe pageant, one of the pageants that brought the reigning Miss Universe Zimbabwe to the spotlight, are underway. The finale of the pageant, which focuses on natural beauty and grace, will be held on March 22 in Polokwane, Limpopo, South Africa and the finalists are drawn from […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "Do not be misled by hypocrites: President",
            "url": "https://www.chronicle.co.zw/do-not-be-misled-by-hypocrites-president/",
            "content": "Zvamaida Murwira and Joseph MadzimureZANU-PF members must guard against being misled by hypocrites who pretend to have the party at heart, but turn around and undermine its values,, President Mnangagwa has said.\n\nAddressing the 381st Ordinary Session of the Politburo in Harare yesterday, the President, who is also the partys First Secretary, said all party members must defend the party, promote its ideals and be vigilant against misplaced narratives that distort facts and foment divisions.\n\nUnfortunate and misplaced narratives that seek to distort facts, as well as stir divisions and discord, should not be given a footing in our body politic. True cadres of the party are clear on the correct line of the revolution, our partys history, values and traditions.\n\nDo not be clouded or misled by wolves in sheeps clothing abusing our rich liberation heritage for their own divisive ends. Loyal members are Zanu-PF by day and Zanu-PF by night; not merely when it is convenient, or expedient to be members. At no time should we, as the party leadership, question you about your sense of commitment, duty and loyalty. Ngatizvibvunze patiri ipapo.\n\nPresident Mnangagwa urged all leagues of the party to implement programmes that raise the state of the countrys national consciousness.\n\nParty members must be taught the correct line, discipline and protocols of the party. We are a party of order and discipline. The leadership from the Politburo as well as provinces, districts, branches, villages/cells are directed to complement the Chitepo School of Ideology and deliberately roll-out initiatives that will instil the appropriate decorum, values and discipline within the rank and file of the party, he said.\n\nThese critical aspects, the President said, should ensure that Zanu-PF grows stronger and remains dominant for posterity.\n\nZanu-PF musangano wevanhu, musangano woruzhinji rweZimbabwe. We have a duty to stay with the people, listening to them and helping them to develop solutions that deliver a higher quality of life. We should not confuse them.\n\nUnity, peace and development, as the guiding motto of Zanu-PF must never be treated as mere rhetoric, but an unending exhortation that propels our party and motherland, forward. Our love for the party and the people of Zimbabwe must be reflected through selfless efforts to serve, build our economy and consolidate the gains realised so far under the Second Republic, he said.\n\nPresident Mnangagwa urged Zanu-PF members to guard against complacency and continue working hard for national development and the improvement of the lives of ordinary people.\n\nWork is ongoing; we should resist the temptation of thinking that we have achieved enough or that we have arrived.\n\nFar from it, much more work must be done in terms of infrastructure development, agriculture, mining and tourism, as well as in human capital development, ICTs, and improving efficiency in public sector service delivery, he said.\n\nThe President said the party must take leadership in creating suitable conditions for small and medium-sized companies to grow, especially in rural areas, leveraging on the countrys vibrant agriculture sector, new technologies, science and innovations.\n\nI am pleased with the milestones realised in the agriculture sector, with the good rains generally received across the country adding to our optimism of a bumper harvest. We are now food self-sufficient. The time has come for us to put greater focus on the complete resuscitation and growth of our countrys agro-industrial sector, he said.\n\nPresident Mnangagwa congratulated Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka for receiving the best Minister award at the prestigious World Governments Summit recently held in Dubai.\n\nDr Anxious Masuka\n\nThe award attests to the successful policies of the Second Republic, which are anchored on hard-honest work, resilience, stakeholder collaboration and the whole-of-society approach to delivering impactful results. Meanwhile, I commend the unity of purpose demonstrated by the Ministry of Youth, in co-operation with the Youth League, and the party leadership in Bulawayo, our affiliates and other stakeholders, for the successful celebrations of the National Youth Day, he said.\n\nGoing forward, the Zanu-PF Youth League is called upon to strengthen and broaden the existing fraternal relations with other revolutionary movements within the region and beyond. Synergies should be scaled up towards more young people playing an active role in the economic affairs of the region for the realisation of the SADC Vision 2050.\n\nSome of the issues that were up for discussion during the Politburo included the partys short-term plans, as well as other strategic objectives that are critical in the long-term development for the party.\n\nPresident Mnangagwa said the overall and sectoral resolutions made by the party at last years Annual National Peoples Conference were an embodiment of the peoples aspirations and hopes.\n\nThese remain the foundation and pillar of the projects and initiatives that must guide our work for the year.\n\nIt is almost the half-way mark until we will be required to report to yet another conference. Greater zeal, focus and hard work are required from every member of the party for us to achieve our set targets. It is only in unity that we can fulfill all our plans and the major tasks that lie ahead of us. We cannot afford the luxury of indiscipline, distractions or lethargy.\n\nTo date, our revolutionary party is constantly proving that we can deliver, even under existential threats, risks, and challenges. The unity and resilience of people across all parts of the country and those abroad have been our strongest assets. This growing culture must make us proud as the ruling party and continue to be promoted and safeguarded, he said.\n\nPresident Mnangagwa urged party members to prepare for this years 45th Independence celebrations to be held in Gokwe, Midlands province, in keeping with the decentralisation of national events.\n\nLast year, Independence celebrations were held in Manicaland while Mashonaland Central hosted the 2023 commemorations. Bulawayo was the first province outside Harare to host the commemorations in 2022.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/zszxcsxzc.jpg",
            "description": "Zvamaida Murwira and Joseph Madzimure ZANU-PF members must guard against being misled by hypocrites who pretend to have the party at heart, but turn around and undermine it’s values,, President Mnangagwa has said. Addressing the 381st Ordinary Session of the Politburo in Harare yesterday, the President, who is also the party’s First Secretary, said all […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "COMMENT: Is a unity government a plausible remedy for DRC conflict?",
            "url": "https://www.chronicle.co.zw/comment-is-a-unity-government-a-plausible-remedy-for-drc-conflict/",
            "content": "Richard Muponde, Zimpapers Politics HubTHE crisis in the eastern region of the Democratic Republic of Congo (DRC) needs President Felix Tshisekedi to call for an all-inclusive dialogue involving all warring parties and political formations in the country including M23 and form an all-inclusive government to address the escalating violence.\n\nThe M23 rebels, alleged to be backed by Rwandan forces have captured three major towns of Goma, North Kivu and Bukavu, which allow access to Lake Kivu, the commercial hub for DRC and the outside world.\n\nThe towns also form the border with Rwanda, which accuses DRC government of harbouring Hutu militia responsible for the 1994 Tutsi massacres and are accused of constantly attacking Rwandan villages across the border.\n\nOn the other hand, President Tshisekedis administration in Kinshasa is accusing Rwanda of backing M23 rebels to plunder the countrys vast mineral resources.\n\nWith reports that over 7 000 people have been killed since January this year and above 7 million internally displaced, is it not the time for President Tshisekedi to call for an all-inclusive dialogue?\n\nThe swift advance of the M23 has raised alarm over the possibility of a wider regional conflict, with fears that the violence could spiral outside DRCs borders.\n\nIf dialogue is to be conducted, it surely needs to include DRC political parties, all warring parties, the M23 and Rwanda so that their interests are taken care of to curb future incursions.\n\nSADC and the East Africa Community (EAC) are doing their best to end the war through various initiatives and have ordered an immediate ceasefire and withdrawal of the M23 and Rwanda army from the DRC territory.\n\nThe United Nations Security Council has called for a ceasefire, urging all parties involved to halt hostilities and engage in dialogue.\n\nUnconfirmed reports suggest President Tshisekedi is not averse to the idea of a Government of National Unity (GNU).\n\nThe proposed, GNU which reportedly aims to include a broader range of political factions within the government, reflects President Tshisekedis desire for a more inclusive approach to end the war and achieve peace.\n\nWhat is worrisome is that the M23 rebels, that has been branded a terrorist organisation, might be included in the government as per the countrys constitutional provisions. Analysts have, however, argued that dialogue with armed groups like the M23 is essential to achieving lasting peace.\n\nViolence in the eastern DRC has intensified in recent months, with reports indicating more than 7 000 people have been killed since January. Despite the SADC, EAC and UN calls for a ceasefire, the M23 rebels have shown no signs of backing down, with calls for an emergency dialogue to avoid the escalation of the conflict.\n\nPresident Tshisekedis engagement in an all-inclusive dialogue involving political parties, armed groups like the M23, and neighbouring states like Rwanda is a crucial step toward achieving sustainable peace. Without such dialogue, resolving the conflict will remain an elusive goal, perpetuating cycles of violence, displacement and economic stagnation.\n\nAn all-inclusive dialogue matters because engaging political parties ensures that domestic governance issues are addressed, such as disputed elections, corruption and power-sharing.\n\nIncluding armed groups like the M23 provides an opportunity to address their grievances and integrate them into peace processes, instead of leaving them to operate as perpetual spoilers.\n\nRwanda, which has been accused of supporting armed groups like the M23 should also not be left out as it ensures that regional dynamics are addressed and fosters accountability in cross-border relations.\n\nA dialogue that excludes key stakeholders, risks deepening mistrust and prolonging the conflict. Bringing all actors to the table builds confidence and demonstrates a genuine commitment to peace. The DRC conflict is driven by complex factors such as ethnic tensions, resource control and regional rivalries. An all-inclusive approach ensures that the underlying causes are tackled comprehensively, rather than merely addressing the symptoms.\n\nTo achieve this, the DRCs President Tshisekedi should establish a neutral mediation framework consisting of respected mediators from neutral parties (SADC, EAC and international organisations or religious leaders) to foster impartiality.\n\nAlready, former presidents Uhuru Kenyatta of Kenya and Olusegun Obasanjo of Nigeria and former Prime Minister Hailemariam Desalegn of Ethiopia were appointed last Monday by the Southern African Development Community (SADC) and East African Community (EAC) blocs as facilitators of the regional peace process in eastern DRC.\n\nFormer President Uhuru Kenyatta\n\nThe move follows an extraordinary summit of Heads of State and Government from the EAC and SADC held in Dar es Salaam, Tanzania earlier this month to address the ongoing conflict in eastern Congo, where the M23 rebels are battling government forces.\n\nSADC Member states like South Africa and Angola can act as mediators and guarantors of the peace agreements. The EAC can address regional economic integration, fostering cross-border trade and economic development to reduce the incentive for armed conflict.\n\nThe EACs military force, which is already deployed in parts of eastern DRC, can help enforce disarmament agreements and protect civilians during the transition. Both organisations can monitor the implementation of resolutions, ensuring that commitments made during the dialogue are upheld. They can also provide technical expertise for rebuilding state institutions and reforming resource governance.\n\nThe M23 rebel group is the major destabilising force in eastern DRC and excluding them from peace efforts risks continued violence, as they have shown their capacity to disrupt peace and security.\n\nThe DRC has some of the largest reserves of cobalt, copper, gold, diamonds, and coltan in the world, essential for industries like electronics and renewable energy. If peace were achieved, the DRC could become an economic powerhouse, contributing significantly to global supply chains.\n\nDecades of war have led to the exploitation of resources by armed groups and foreign actors, depriving the state of revenue and fuelling corruption. Peace would allow the government to regulate resource extraction, attract foreign investment, and use revenues to fund infrastructure, education and healthcare.\n\nAn all-inclusive dialogue is critical for achieving peace in the DRC, as it addresses the interests of all stakeholders, including political parties, armed groups like the M23, and regional players like Rwanda.\n\nWith the support of organisations like SADC and the EAC, President Tshisekedi can create a framework for lasting peace and security. Ending the conflict would unlock the DRCs immense potential, transforming it into a global economic powerhouse.\n\nAt this moment, a GNU might not be just necessary but an urgent need to abate the continued loss of lives. It can pave the way for a prosperous, peaceful DRC that contributes significantly to the global economy while uplifting its people from decades of suffering.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/vcbngfxcv.jpg",
            "description": "Richard Muponde, Zimpapers Politics Hub THE crisis in the eastern region of the Democratic Republic of Congo (DRC) needs President Felix Tshisekedi to call for an all-inclusive dialogue involving all warring parties and political formations in the country including M23 and form an all-inclusive government to address the escalating violence. The M23 rebels, alleged to […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "Magwizi set for key talks in Morocco",
            "url": "https://www.chronicle.co.zw/magwizi-set-for-key-talks-in-morocco/",
            "content": "Langton Nyakwenda\n\nTHE Zimbabwe Football Association (Zifa) wants to create strong bonds with prospering African countries like Morocco, who are emerging as a key player in the development of football on the continent.\n\nZifa President, Nqobile Magwizi, left for Morocco yesterday morning and is expected to hold bilateral talks with the President of the Royal Moroccan Football Federation, Fouzi Lekjaa.\n\nMorocco have awakened from a slumber and have transformed into one of the football powerhouses on the continent.\n\nTheir rise has been anchored on a sound football development strategy that has groomed star players like Paris Saint Germain rightback, Achraf Hakimi.\n\nThe other top players from Morocco include goalkeeper Yassine Bonou, former Manchester United midfielder Sofyan Amrabat and ex-Chelsea star, Hakim Ziyech.\n\nMorocco became the first African country to reach the World Cup semis in 2022.\n\nThanks to their world class facilities, Morocco will host the 2025 Africa Cup of Nations finals in December.\n\nThe 2026 Womens Africa Cup of Nations finals will also be held in the North African country.\n\nAt number 14 on the Fifa rankings, Morocco are the best ranked African team on the global ratings.\n\nThats why Zifa have identified Morocco as a strategic partner in their bid to revive Zimbabwean football.\n\nWhen the new Zifa board came to power on January 25, Magwizi immediately emphasised the new thrust of transforming Zimbabwean football. One of the key aspects is junior football development andMorocco are one of the leading lights in that regard.\n\nThis engagement underscores Zifas commitment to fostering strong partnerships with leading football associations across the continent. Morocco has emerged as a key player in African football development, and this dialogue presents valuable opportunities for collaboration in areas such as technical development, infrastructure and administration, wrote Zifa.\n\nAfter engaging football authorities in Morocco, Magwizi will fly into Egypt for theCaf Extra-ordinary General Meeting.\n\nHis participation in this important gathering reflects Zifas dedication to contributing to the growth and governance of African football, added Zifa.\n\nVice president, Loveness Mukura, will serve as the acting president of the association.\n\nThis will be the first time in the history of Zimbabwe football that a woman is president ofZifa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/rr.jpg",
            "description": "Langton Nyakwenda  THE Zimbabwe Football Association (Zifa) wants to create strong bonds with prospering African countries like Morocco, who are emerging as a key player in the development of football on the continent. Zifa President, Nqobile Magwizi, left for Morocco yesterday morning and is expected to hold bilateral talks with the President of the Royal […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "Expand the Helidrive service, procure more air ambulances",
            "url": "https://www.chronicle.co.zw/expand-the-helidrive-service-procure-more-air-ambulances/",
            "content": "THE countrys first public air ambulance took off seven months ago.The goals were to expedite the transportation of emergency cases to health facilities and to be able to reach areas that would ordinarily be impossible via the traditional road ambulance.\n\nAs we wrote yesterday, the Helidrive Zimbabwe air ambulance service has done a great deal to bridge the health access gap across the country in a manner unimaginable before the Zimbabwe-Russia partnership was consummated.\n\nA total of 267 patients, among them 76 children under the age of 18, have been airlifted to health facilities since then. The service offers free transfers for critically ill patients to major health centres across the country.\n\nIn Bulawayo, Helidrive Zimbabwes medical teams have airlifted 30 patients, comprising 20 adults and 10 children, six of whom were under the age of one.\n\nIn January alone, we recorded 14 cases in Bulawayo comprising five males and nine females while in February, we had 16 cases. For Harare, we have had 75 cases this year, comprising 60 adults and 15 children, eight of whom were under the age of one, Helidrive Zimbabwes chief medical doctor, Dr Evgenii Kibakin told us.\n\nAir Ambulance lands at the airport\n\nThis partnership is yet another tangible example of the age-old, strong relationship between our country and Russia.It is assisting in moving patients to health facilities, which is very important as time is always important in times of acute illness. A patient who gets medical attention earlier stands a good chance of surviving than one who takes a day or two to get it.\n\nWe are confident that most of the 267 patients who got the Helidrive Zimbabwe service got the prompt service they needed at hospitals and are doing well.\n\nApart from offering speed, we find it important that this service is also being provided free of charge.Equally important is the fact that the initiative has created 300 local jobs  40 pilots, 50 doctors, 100 nurses, 100 dispatchers and 10 engineers.\n\nConsidering the good work that Helidrive Zimbabwe is doing for the people, we suggest that our Government and Russia expand the service by procuring more air ambulances.\n\nThis will ensure that more patients anywhere across the country can enjoy this free, expeditious service. Furthermore, this will mean more jobs for our people.\n\nHowever, as Helidrive Zimbabwe soars, let us ensure that the traditional road ambulance service is reinvigorated as well.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-4-2.jpg",
            "description": "THE country’s first public air ambulance took off seven months ago. The goals were to expedite the transportation of emergency cases to health facilities and to be able to reach areas that would ordinarily be impossible via the traditional road ambulance. As we wrote yesterday, the Helidrive Zimbabwe air ambulance service has done a great deal […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "Gamecocks take on bruised Yadah Stars",
            "url": "https://www.chronicle.co.zw/gamecocks-take-on-bruised-yadah-stars/",
            "content": "Fungai Muderere,[emailprotected]\n\nCHICKEN Inn will play their first away game of the season against Yadah Stars at the Heart Stadium in Harare tomorrow.\n\nIn their seasons opener, the Gamecocks faced Bikita Minerals in a match that ended in a nil-all stalemate at Luveve Stadium.\n\nIt was a game in which the Simbisa Brands bankrolled side paraded a couple of their new signings including skillful new signings Tadiwa Muchenje and Tinashe Mushaireni who all gave a good account of themselves.\n\nAlso fielded was Miguel Feldman who played a cameo role last year.\n\nWe hope to continue from where we left in our last game. We created a lot of chances that we should have buried. However, it will be a new game against Yadah and we are hoping for the best, said Chicken Inn head coach, Joey Antipas.\n\nAmong the seven new Gamecocks arrivals are ex-Arenel Movers goalminder Aron Arusha Ngwenya, former Chinhoyi Stars player Kumbirai Nyamutenha, Tinashe Mashaineri, Edward Musena (Kwekwe United), Walter Vuwa (Ngezi Platinum Stars) and Vincent Mugande who was snatched from Southern Region Division One side DRC United.\n\nAntipas men will be facing a side that was last weekend beaten 1-0 by Manica Diamonds at Mutare Sakubva Stadium.\n\nUnder the guidance of coach Ikabort Masocha, Yadah Stars will probably be again be understrength side. Last week, The Miracle Boys had two players on the bench Evans Rusike and Ryan Ncube as they are serving a Fifa transfer ban.\n\nYadah were last year sanctioned by Fifa over a US$82 000 salary dispute with three Brazilian players.\n\nWe will see how it goes but we are hoping for the best, Masocha.\n\nJust like, Highlanders Fifa banned Yadah from registering new players pending resolution of the issue and this has resulted in the present situation, which was worsened by the departure of key players from last season, who sought greener pastures.\n\nBosso were last weekend forced to travel with 17 players for their away match against MWOS due to the transfer ban, which was imposed after the outfit failed to settle US$27 000 in allowances and bonuses to their former coaches Baltemar Brito and Antonio Torres.\n\nHowever, Highlanders have since made good on their debt, after Wicknell Chivayo intervened by paying.\n\nGwerus Ascot Stadium will be the venue for the game between TelOne and Triangle United while FC Platinum do duty against Manica Diamonds at Mandava Stadium.\n\nPSL Week Two Fixtures\n\nTomorrow\n\nYadah Stars Chicken Inn v (Heart Stadium)\n\nSaturday\n\nTelOne v Triangle (Ascot Stadium), Ngezi Platinum Stars v Greenfuel (Baobab Stadium), Bikita Minerals MWOS (Sakubva Stadium), FC Platinum v Manica Diamonds (Mandava Stadium), ZPC Kariba v Simba Bhora (Nyamhunga Stadium), Herentals College v Dynamos (Rufaro Stadium).\n\nSunday\n\nCAPS United v Scottland FC (Rufaro Stadium, Highlanders v Kwekwe United (Barbourfields Stadium)@FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Joey-Antipas.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw CHICKEN Inn will play their first away game of the season against Yadah Stars at the Heart Stadium in Harare tomorrow. In their season’s opener, the Gamecocks faced Bikita Minerals in a match that ended in a nil-all stalemate at Luveve Stadium. It was a game in which the Simbisa Brands bankrolled […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        },
        {
            "title": "Matabeleland South to lead seedless watermelon cluster",
            "url": "https://www.chronicle.co.zw/matabeleland-south-to-lead-seedless-watermelon-cluster/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nEXPORT promotion and development agency, ZimTrade, has embarked on an initiative to boost the production of seedless watermelons under a specialised cluster in Matabeleland South with a focus on growing horticultural exports.\n\nThe trade agency introduced the export cluster initiative in 2022 following a directive by President Mnangagwa to ensure that every province contributes to economic growth through exports.\n\nAccording to ZimTrade, the climatic conditions in Matabeleland South, particularly the regions sandy and loamy soils are ideal for watermelon cultivation.\n\nThe programme is set to start at Mankonkoni Irrigation Scheme near Gwanda, with plans for expansion to other nearby schemes that include Raslas and Sebasa.\n\nIn its latest monthly newsletter, ZimTrade said seedless watermelons were in high demand internationally due to their convenience and longer shelf life compared to seeded varieties.\n\nThese watermelons are particularly popular among consumers because they eliminate the need to remove seeds, making them ideal for high-end retail markets, the food service industry, and health-conscious buyers, said ZimTrade.\n\nIn addition, their crisp texture and sweet flavour also make them a favoured choice in fresh fruit assortments, smoothies, and salads, which further drives their appeal in global markets.\n\nZimTrade has also highlighted that the watermelons must weigh a minimum of seven kilograms to align with global market preferences that meet international export standards.\n\nHowever, there are critical factors that must be taken into consideration for the initiative to succeed.For the initiative to succeed, several critical factors must be considered, including careful alignment of planting schedules with market demand to avoid competing with major global producers, said ZimTrade.\n\nOptimal planting windows in February and August will ensure premium pricing and better market access, said the agency.Moreover, farmers will be required to use chemicals approved by target export markets to meet safety and quality standards.\n\nDedicated teams will manage the planting, harvesting and logistics processes to ensure efficiency while maintaining quality, said ZimTrade.\n\nThe agency has pledged to work collectively with Agritex to offer continuous training sessions for farmers, focusing on both the export process and production best practices.\n\nZimbabwes horticultural sector is fast emerging as a major driving force for the development of the agricultural sector in the country.\n\nRecently, the country saw a notable surge in exports, largely propelled by a 5,2 percent increase in horticultural exports.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/eww.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com EXPORT promotion and development agency, ZimTrade, has embarked on an initiative to boost the production of seedless watermelons under a specialised cluster in Matabeleland South with a focus on growing horticultural exports. The trade agency introduced the export cluster initiative in 2022 following a directive by President Mnangagwa to ensure that […]",
            "time": "08:27",
            "date": "06 Mar 2025"
        }
    ]
}