{
    "news": [
        {
            "title": "Kalungwizi power project propels Matabeleland North to top of investment rankings",
            "url": "https://www.chronicle.co.zw/kalungwizi-power-project-propels-matabeleland-north-to-top-of-investment-rankings/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nMATABELELAND North Province has emerged as Zimbabwes top investment destination for the first quarter of the year, thanks largely to the proposed US$2 billion, 600MW thermal power project in Kalungwizi, Binga, by independent power producer Yuanlin Energy Investments (Pvt) Ltd.\n\nAccording to the Zimbabwe Investment and Development Agency (ZIDA), the massive coal-powered energy project, which has a total value of US$2,71 billion, propelled the province to the top of the national projected investment rankings.\n\nRegarding projected investment value, Matabeleland North Province led all provinces, with US$2,61 billion, representing 54.95 percent of the total. This was driven by one project, which plans to establish a 600MW coal-powered thermal power plant in Binga at an estimated cost of US$2 billion, ZIDA noted in its latest quarterly report.\n\nThe Kalungwizi project is expected to significantly sustain Zimbabwes energy security while catalysing broader economic development, particularly in the energy-hungry industrial and mining sectors.\n\nNationally, Zimbabwe recorded a total projected investment value of US$4,7 billion across all provinces during the period under review.\n\nMashonaland West ranked second with US$928,04 million (19,54 percent), followed by Masvingo with US$512 million.\n\nMidlands recorded US$262 million, Harare US$207 million, Matabeleland South US$152 million, and Mashonaland Central US$43 million. Bulawayo and Mashonaland East each registered US$13 million, while Manicaland had the lowest at US$5 million.\n\nZIDA said the energy sector emerged as the dominant investment magnet, attracting US$2,72 billion, which translates to approximately 57,39 percent of the national total.\n\nTrailing the energy sector was mining, which drew US$906,80 million, about 19 percent of overall projections. The manufacturing sector followed closely with US$877 million.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-18-at-09.13.44_d20d7530-680x380.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter MATABELELAND North Province has emerged as Zimbabwe’s top investment destination for the first quarter of the year, thanks largely to the proposed US$2 billion, 600MW thermal power project in Kalungwizi, Binga, by independent power producer Yuanlin Energy Investments (Pvt) Ltd. According to the Zimbabwe Investment and Development Agency (ZIDA), the massive […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Athletes gear up for Comrades",
            "url": "https://www.chronicle.co.zw/athletes-gear-up-for-comrades/",
            "content": "Lovemore Dube\n\nFITNESS First Athletics Club members on Friday engaged in a gruelling 50km road race as part of their preparations for the Comrades Marathon.\n\nClubs spokesperson Mudiwa Nyirenda said they had decided as a club to have the Independence Run for wellness, camaraderie and preparations for some of their members in the absence of the Matopos 33 Miler for the epic South African ultra-marathon.\n\nThe club members are competing commemorating Independence Day. Others in the absence of the Matopos 33 Miler, are using this 50km race to prepare for the Comrades Marathon.\n\nThe weather is fine, it is drizzling, they wont be dehydrated that much, said Nyirenda.\n\nZimbabwe athletes have used the PPC Matopos 33 Miler to qualify for the Comrades or to prepare for it.\n\nZimbabwean Stephen Muzhingi is the most successful Comrades Marathon runner with three titles.\n\nThe Comrades Marathon takes place in June.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gyhtj.jpg",
            "description": "Lovemore Dube FITNESS First Athletics Club members on Friday engaged in a gruelling 50km road race as part of their preparations for the Comrades Marathon. Club’s spokesperson Mudiwa Nyirenda said they had decided as a club to have the Independence Run for wellness, camaraderie and preparations for some of their members in the absence of […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Bulawayo athletes gear up for Comrades Marathon",
            "url": "https://www.chronicle.co.zw/bulawayo-athletes-gear-up-for-comrades-marathon/",
            "content": "Lovemore Dube\n\nFITNESS First Athletics Club members on Friday engaged in a grueling 50km road race as part of their preparations for the Comrades Marathon.\n\nClubs spokesperson Mudiwa Nyirenda said they had decided as a club to have the Independence Run for wellness, camaraderie and preparations for some of their members in the absence of the Matopos 33 Miler for the epic South African ultra marathon.\n\nThe club members are competing to commemorate Independence Day. Others, in the absence of the Matopos 33 Miler are using this 50km race to prepare for the Comrades Marathon.\n\nThe weather is fine, its drizzling, they wont be dehydrated that much, said Nyirenda.\n\nZimbabwe athletes have used the PPC Matopos 33 Miler to qualify for the Comrades or to prepare for it.\n\nZimbabwean Stephen Muzhingi is the most successful Comrades Marathon runner with three titles.\n\nThe Comrades Marathon takes place in June.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-18-at-08.24.01_e0c91b38-680x380.jpg",
            "description": "Lovemore Dube FITNESS First Athletics Club members on Friday engaged in a grueling 50km road race as part of their preparations for the Comrades Marathon. Club’s spokesperson Mudiwa Nyirenda said they had decided as a club to have the Independence Run for wellness, camaraderie and preparations for some of their members in the absence of […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Bulawayo gears up for 45th Independence Day celebrations",
            "url": "https://www.chronicle.co.zw/bulawayo-gears-up-for-45th-independence-day-celebrations/",
            "content": "Sikhumbuzo Moyo, Senior Reporter\n\nITS a drizzling morning in Bulawayo with overcast clouds as the City prepares to celebrate the countrys 45th independence, which also coincides with the start of the Easter weekend.\n\nOn this day, 2025 years ago, Jesus Christ shed blood as he was crucified to cleanse the world of its sins and bring peace.\n\nFor Zimbabwe, its sons and daughters took up arms to fight the brutal colonial regime and during the armed conflict, blood was shed, lives were lost, as brave sons and daughters of the soil were eager to cleanse the country of the evil leadership, bring peace by allowing the majority black to rule themselves.\n\nIt was a bloody and brutal war, but 45 years ago, the Union Jack was lowered at a packed Rufaro Stadium, giving birth to a new and free country called Zimbabwe.\n\nThe Bulawayo provincial Independence celebrations are set for the sentimental White City Stadium, a stones throw away from Father Zimbabwe, the late Vice President Dr Joshua Mqabuko Nkomos Pelandaba House.\n\nThe days programme was initially set to kick off with a procession led by Drum Majorettes from D Square near Mpopoma High School along Nketa Drive to the main venue, but weather conditions may have forced organizers to cancel the procession.\n\nWeather reports indicate that the day will be for the better part be overcast with 20 percent chance of intermittent showers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-18-at-07.59.27_531925e8-680x380.jpg",
            "description": "Sikhumbuzo Moyo, Senior Reporter IT’S a drizzling morning in Bulawayo with overcast clouds as the City prepares to celebrate the country’s 45th independence, which also coincides with the start of the Easter weekend. On this day, 2025 years ago, Jesus Christ shed blood as he was crucified to cleanse the world of its sins and […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Universal access to education for all — President",
            "url": "https://www.chronicle.co.zw/universal-access-to-education-for-all-president/",
            "content": "Blessings Chidakwa in GOKWE\n\nGOVERNMENT is working tirelessly to ensure universal access to education for all children to prepare them for a brighter future so that they contribute meaningfully to national development, President Mnangagwa has said.\n\nSpeaking at the 45th Independence Childrens Party at Nyamuroro High School in Gokwe yesterday, President Mnangagwa said unity, innovation and hard work are key to securing a prosperous future for all Zimbabweans.\n\nHe urged the nation to continue to respect the heroes and heroines who made it possible for the children of Zimbabwe to have access to education, health care and opportunities.\n\nAs the nation commemorates Independence Day today, the President said Uhuru is a time to reflect on the countrys journey and citizens should come together to build a shared vision.\n\nHe said this years Independence Day celebrations theme, Zimbabwe at 45: Devolve and Develop Together Towards Vision 2030, must remind children that, as Government and elders, they want them to have equal development, opportunities, and access to Information Communication Technology whether they live in rural or urban areas.\n\nOur national Independence represents the struggles and sacrifices made by many young boys and girls of the past, who were just like you and fought for our freedom.\n\nIt is a time to reflect on our liberation history, to also celebrate the progress we have made as a nation, and to look ahead to a brighter future, he said.\n\nPresident Mnangagwa said learners should be able to relate to relevant education so that they can solve the challenges which communities face on a day-to-day basis.\n\nThe reviewed curriculum is also meant to address the needs of the 21st-century economy. This demands a robust education system that produces graduates with the right characteristics that enable them to be competitive in the global environment.\n\nIf you are educated, you should be able to produce services and goods, not just be fluent in the Queens language, he said.\n\nBuilding from the skills-oriented curriculum framework, my Government has put in place the required changes for our children to acquire scientific, innovative, vocational and technical skills that empower them to develop enterprises and contribute to the nations socio-economic transformation.\n\nPresident Mnangagwa said as the nation celebrates Independence Day, it was proud of the vast potential, talent and brilliance of the countrys children.\n\nOn its part, he said, Government is implementing programmes that focus on increasing youth participation in development and decision-making processes.\n\nThey (children) are torch-bearers of the dreams and aspirations for a better, modern and industrialised Zimbabwe. I assure you that the Second Republic will support the young people of our country by providing the necessary teaching and learning resources to promote both quality and inclusive education for a higher quality of life for all our people, President Mnangagwa said.\n\nMy Administration is prioritising an e-teaching and e-learning policy within our schools. To make sure that this runs smoothly, electricity, internet connectivity and related ICT equipment to schools including those in marginalised communities is being provided.\n\nThe President called upon the Ministries of Energy and Power Development, as well as Information Communication Technology, Postal and Courier Services, among other service providers, to speedily implement projects and programmes in schools.\n\nThis should see our schools, especially those in rural and resettlement areas, recording critical infrastructure improvements that enhance the learning experiences of pupils, he said.\n\nPresident Mnangagwa urged all citizens to continue working together to build a nation that is just, equitable and prosperous for children, where they grow up with hope, dignity, and pride.\n\nMy Government will continue to equip you, our children, to face your future with confidence, zeal and determination so that you lay a strong foundation to play your part in transforming the socio-economic development of our nation.\n\nIn all that we do, we must be guided by our philosophy: Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, he said.\n\nPresident Mnangagwa said the Government is also engaging various stakeholders to guarantee the provision of quality education that is affordable to all children, as well as the promotion of learning skills to make learners ready for the world of the future.\n\nThrough the Ministry of Primary and Secondary Education, we are progressing well to realise universal primary and secondary education, the promotion of foundational learning, and ensuring that all children of school-going age have the relevant skills and equipment to innovate for employment creation and entrepreneurship.\n\nUnder our education system, boys and girls are being given equal opportunities to achieve their full potential, he said.\n\nPresident Mnangagwa said the health and well-being of every citizen, including school-going children, is critical for unlocking the countrys economic potential.\n\nIt is our collective responsibility to address the plight of vulnerable and disadvantaged pupils in schools. No matter where they are, they too must be facilitated to enrol for their education and pursue fulfilling careers, he said.\n\nPresident Mnangagwa also took a swipe at the scourge of cyberbullying, and drug and substance abuse.\n\nLet us join hands to fight substance and drug abuse, a moral cancer affecting mostly young boys and girls. The peddling of drugs, as well as the abuse of social media platforms, should be rejected by our children and the youth throughout the country. Say NO to drugs and harmful substances. Say NO to cyberbullying, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/bnbnvgnngvbn.jpg",
            "description": "Blessings Chidakwa in GOKWE GOVERNMENT is working tirelessly to ensure universal access to education for all children to prepare them for a brighter future so that they contribute meaningfully to national development, President Mnangagwa has said.  Speaking at the 45th Independence Children’s Party at Nyamuroro High School in Gokwe yesterday, President Mnangagwa said unity, innovation […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Easter joy, Independence pride as long weekend starts",
            "url": "https://www.chronicle.co.zw/easter-joy-independence-pride-as-long-weekend-starts/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nHoliday fever gripped Bulawayo yesterday as major bus termini and hitch-hiking spots teemed with excited travellers heading to different destinations, marking the rare overlap of Easter and Independence Day celebrations.\n\nFrom Old Renkini to Entumbane and Nkulumane bus ranks, the city was a hive of activity as travellers laden with luggage that included groceries, boarded buses, kombis and private cars on their way to reconnect with their loved ones mostly in rural areas while others were heading to different holiday destinations to enjoy the long holiday as families.\n\nFor the first time in years, Easter Friday and Independence Day, which falls on April 18, are being celebrated during the same long weekend, a convergence that has supercharged the usually busy Easter rush, transforming it into a dual celebration of spiritual reflection and national pride.\n\nIts a unique opportunity this year. Normally Id pick one holiday to go home but now I get to be with my family for both. It feels like a blessing, said Mrs Evelyne Sibanda, who was boarding a bus toGwelutshena in Nkayi with her three children.\n\nBeyond the joyful reunions, the long holiday is also proving to be a much-needed economic boost for informal traders, touts, and small business operators who rely heavily on holiday traffic.\n\nI make most of my money during holidays like this. Travellers stock up because they know things are more expensive in rural areas. Bread sells like gold, said Ms Anna Ngwenya, a vendor selling bread and other essentials at Old Renkini.\n\nFor Primrose Taurayi (22), who sells ice cream and airtime near the loading bays, business was brisk.\n\nKids always want a treat before the long bus ride. I sold 30 cups this morning alone, she said with a smile.\n\nEven pushcart operators are cashing in. A pushcart operator only identified as Mzex, who ferries goods for passengers between nearby suburbs and the bus rank, said hes doing as many as 15 trips a day.\n\nI charge US$1, no matter how heavy the load. Its good money over the holidays, he said.\n\nThe increase in travellers has pushed bus operators into overdrive. Some are dispatching several buses on popular routes such as Bulawayo-Gwanda and Bulawayo-Beitbridge.\n\nThis is the only time we run two or three trips a day and still fill up. We are barely coping with the demand for transport, said Luke Tshuma, a driver who was loading passengers heading to rural Gwanda.\n\nThe holiday rush wasnt just confined to the bus stations. Supermarkets and clothing stores across the city witnessed a flurry of last-minute shoppers.\n\nParents stocked up on food supplies, Easter treats, and Independence party essentials while children excitedly tugged along, pointing at colourful outfits and toys.\n\nNot everyone is leaving town, though. In Bulawayo, residents are gearing up for a number of events to mark the dual holidays. Foodies will flock to the Munch and Sip festival  a family-friendly celebration of local cuisine, music, and art.\n\nThose craving adrenaline will head to the ZKS Spinners Arena just past Emthunzini for an electrifying car-spinning showcase dubbed The Burnouts, marking Zimbabwes 45th birthday with tyre screeches and patriotic flair.\n\nZKS spinners\n\nFor the faithful, Easter remains a time of deep reflection. Churches across Bulawayo and beyond have lined up special services, revivals, and camp meetings.\n\nAs part of Easter festivities, the Christian Revival Centre (CRC) is celebrating the holiday with a special conference hosted by Apostle T and Prophetess Modern Kufakunesu.\n\nThe four-day event, which started on Wednesday and ends on Sunday, is a time of spiritual rejuvenation and celebration for CRC.\n\nThe United Congregational Church of Southern Africa (UCCSA), through its Zimbabwe Synod, has also lined up a series of spiritual and cultural observances.\n\nOur Easter preparation includes Lent fasting, Holy Week services, and commemorations on Palm Sunday, Maundy Thursday, Good Friday, and Easter Sunday, said the church leader, Reverend Sikhalo Cele.\n\nWe welcome all who will join us at various locations nationwide, including our Synod headquarters in Bulawayo.\n\nBishop Michael Dube of the Evangelical Lutheran Church in Zimbabwe (ELCZ) said Easter celebrations in the Western Diocese will take place across several suburbs in Bulawayo, including Njube, Mzilikazi, Tshabalala and Emganwini.\n\nFor the Apostolic Faith Church of Southern and Central Africa, this years Easter camp meeting will coincide with its 70th anniversary celebrations at its headquarters in Esiphezini, Umguza District.\n\nEaster is a time of reflection, prayer, and unity. Our preparations include revival services, fasting, and organising regional camp meetings, said Reverend Philisani Maphosa, pastor in charge of the Bulawayo branch.\n\nTo raise public awareness around safe driving and responsible road usage, the Traffic Safety Council of Zimbabwe (TSCZ) earlier in the week launched the National Easter and Independence Road Safety Education and Enforcement Campaign in Mashonaland Central Province.\n\nAs we approach the Easter and Independence holidays, we are also emphasising pedestrian safety, reinforcing the safe walking and safe road-crossing campaign under the theme Safety Starts with Me, said the TSCZ.\n\nThe National Blood Service Zimbabwe (NBSZ) has also urged members of the public to donate blood ahead of the long weekend, in order to boost blood stocks in case of road traffic accidents.\n\nThe Zimbabwe Republic Police has assured the nation that adequate arrangements have been made to ensure the safety and security of the public during the Easter and Independence holidays.\n\nIn a statement yesterday, Police Commissioner-General Stephen Mutamba urged the public to play its part during this period and to prioritise safety, especially motorists.\n\nAs the nation approaches the Easter and Independence holidays  a time of joy, reflection, and family gatherings  I urge everyone to prioritise safety and responsibility, he said.\n\nThe Zimbabwe Republic Police remains committed to ensuring a peaceful and secure environment for all. To achieve this, I call upon every citizen to play their part in upholding law and order.\n\nCommissioner-General Mutamba said adequate measures have been put in place to guarantee the safety and security of Independence Day commemorations across the country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cvvxzvcxzv.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw Holiday fever gripped Bulawayo yesterday as major bus termini and hitch-hiking spots teemed with excited travellers heading to different destinations, marking the rare overlap of Easter and Independence Day celebrations. From Old Renkini to Entumbane and Nkulumane bus ranks, the city was a hive of activity as travellers laden with luggage that included […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Milton High’s rugby  revival starts at home",
            "url": "https://www.chronicle.co.zw/milton-highs-rugby-revival-starts-at-home/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nAFTER successfully hosting the third edition of the Milton Rugby Schools Festival at Hartsfield Rugby Grounds last week, Milton High School headmaster Similo Ncube has revealed that plans are underway to ensure next years edition takes place at the schools own grounds.\n\nSince its inception in 2023, all three editions of the annual schoolboy rugby festival have been staged at the citys ceremonial home of rugby. However, Ncube says the time has come for Milton to host the tournament in their own backyard.\n\nTo that end, rehabilitation work on the schools rugby fields has already begun, with a major breakthrough being the identification of a viable water source for a borehole.\n\nI believe very soon well have the game at our own ground. We have already broken through a borehole that has a lot of water. Water has been a stumbling block in the development of our grounds, said Ncube.\n\nWe believe that as soon as everything is set, we should be able to have our ground revamped and greened. That is our target for 2026  we want our ground to be as good as we want it to be. With water, we cant go wrong.\n\nNcube watched proudly as his school delivered spirited performances across the two days of action during the festival. The Elephants opened with a 22-12 win over Goromonzi High before clinching a hard-fought 13-11 victory against Allan Wilson in the headline match of the day.\n\nOnce a dominant force in Zimbabwean schoolboy rugby, the Elephants are starting to find their feet again and climb back up the ranks.\n\nTheir recent success sets the tone for their next challenge  the prestigious St Johns Mukuru Derby Day, set for April 28 to May 3  a test they now approach with sharpened confidence and a proud roar.\n\nMilton are also celebrating the selection of two of their players, Mayibongwe Ncube and Joseph Ndovorwi, into the Junior Sables squad for the Barths Trophy.\n\nThis years festival featured teams from Christian Brothers College (CBC), Plumtree, Entumbane, Sobukhazi, Petra, Northlea, Lord Brighton, Nkulumane, Gifford, Midlands Christian College, Montrose, Western Suburbs, St Bernards, St Columbas, Direct Contact, and Bulawayo Select. @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/The-Milton-High-School-Rugby-team.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub AFTER successfully hosting the third edition of the Milton Rugby Schools Festival at Hartsfield Rugby Grounds last week, Milton High School headmaster Similo Ncube has revealed that plans are underway to ensure next year’s edition takes place at the school’s own grounds. Since its inception in 2023, all three editions […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Zim@45: Fireworks Mbeba blow hits Highlanders",
            "url": "https://www.chronicle.co.zw/zim45-fireworks-mbeba-blow-hits-highlanders/",
            "content": "Innocent Kurira, Zimpapers Sports Hub\n\nHIGHLANDERS and Chicken Inn are set to provide fireworks on the pitch in what promises to be an exciting Provincial Independence Cup final at White City Stadium this afternoon as Zimbabwe celebrates 45 years of Independence.\n\nBoth coaches, Kelvin Kaindu of Highlanders and Joey Antipas of Chicken Inn, have expressed their pride at being part of the nations celebrations, with both clubs aiming to leave their mark on the days festivities.\n\nWhile the match is an occasion to celebrate, it is also a vital opportunity for both teams to test their squads.Its an honour for a club like Highlanders to be part of the Independence celebrations, said Kaindu.\n\nIt makes it a bit difficult to prepare for two games as we have a league game on Monday, but we will regulate our players in terms of who played in the last match and who will feature tomorrow.\n\nBosso coach, Kelvin Kaindu\n\nDespite the tactical rotation, the intensity of this city derby is undeniable.Kaindu, who is no stranger to the fierce rivalry, predicted a thrilling encounter between the two teams. Playing Chicken Inn is never easy. Fans can expect an exciting game of football, said Kaindu.\n\nThe Bosso coach will have to make do without the injured Andrew Mbeba, who will miss both todays game and Mondays crucial league clash against Ngezi Platinum Stars.\n\nMbeba is set to see a specialist, and he will be out for a while. We also have a few players that picked up minor knocks but were hopeful they will be ready to go.\n\nFor Antipas, this derby offers a chance to give his fringe players some much-needed minutes. Its a good exercise for us.We need to give some of our players the opportunity to prove themselves. This is their chance to shine and show their worth.\n\nWe are looking forward to this match, said Antipas.Its a local derby, and I believe it will attract a lot of attention. Well be giving our other players a run as we continue to find our rhythm, added Antipas.\n\nThe match will serve as a fitting highlight of Zimbabwes Independence Day celebrations, though it is not the only major football event today.\n\nJoey Mafero Antipas\n\nThe national spotlight will also shine on Gokwe North, where Simba Bhora and FC Platinum will square off in the official Uhuru Cup match, marking a historic first for the Midlands Province.\n\nThis years theme, Zim@45: Devolve and Develop Together towards Vision 2030, reflects the Governments efforts to decentralise national events and bring major celebrations to the countrys various regions.\n\nMeanwhile, Gokwes Independence Day festivities included a womens football match between Herentals Queens and Black Rhinos Queens, underscoring the inclusivity of the days events.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-22.28.00-1.jpeg",
            "description": "Innocent Kurira, Zimpapers Sports Hub HIGHLANDERS and Chicken Inn are set to provide fireworks on the pitch in what promises to be an exciting Provincial Independence Cup final at White City Stadium this afternoon as Zimbabwe celebrates 45 years of Independence. Both coaches, Kelvin Kaindu of Highlanders and Joey Antipas of Chicken Inn, have expressed […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Presidential Internet Scheme launched",
            "url": "https://www.chronicle.co.zw/presidential-internet-scheme-launched/",
            "content": "Farai Dauramanzi in NEMBUDZIYA, Gokwe\n\nPRESIDENT Mnangagwa yesterday launched the Presidential Internet Scheme during the Childrens Party at Nyamuroro High School in Nembudziya, Gokwe.\n\nThis is a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe.\n\nAs part of the programme, President Mnangagwa also handed over 2 000 Starlink gadgets to boost connectivity at schools, clinics and police camps in areas where there is no internet connectivity.\n\nThe Presidential Scheme is being administered by the Ministry of Information Communication Technology, Postal and Courier Services.\n\nSpeaking on the sidelines of the launch, ICT, Postal and Courier Services Minister Tatenda Mavetera said the programme is meant to ensure connectivity of all Government departments.\n\nThe Presidential Internet Scheme is meant to connect all Government departments and avail connectivity to all these places, she said.\n\nWe previously had programmes where we used fibre to connect various places across the country, but we realised that there was a need to adopt the various technologies that are coming up, especially the low earth orbit satellites, and see how best we can reach out, especially to under-served areas.\n\nMinister Mavetera added that the ministry conducted a broadband mapping exercise and realised a gap in some areas.\n\nSo this is the gap that we want to fill with the Presidential Internet Scheme that will see us connecting all marginalised areas using Low-Earth Orbit satellites and all fibre technology.\n\nWe are going to co-ordinate with all companies that are into low-earth orbit satellite and fibre technology, she said.\n\nThe Presidential Internet Scheme will connect schools, clinics and all courts, including traditional courts.\n\nDuring the Childrens Party proceedings, President Mnangagwa also launched the school business units at Nyamuroro High School and Nyamuroro Primary School.\n\nThe business units comprise a garden, fish ponds and solar-powered boreholes.\n\nThe units are part of village and school business units being established across the country under the ongoing Presidential Rural Development Programme, which seeks to radically improve rural livelihoods and transform rural communities into active economic participants.\n\nPresident Mnangagwa also led top Government officials and school children in planting 45 trees, a number that signifies the countrys years of self-rule.\n\nWhile delivering his welcome remarks at the Childrens Party, Primary and Secondary Education Minister Dr Torerayi Moyo said school children in the country are grateful to President Mnangagwa for the various initiatives his Government is implementing.\n\nThey are especially grateful for the increased investment in infrastructure development, the provision of basic education, the introduction of digital learning platforms in schools, and the prioritisation of learner welfare through school feeding programmes and subsidised examination fees, especially for those coming from indigent backgrounds.\n\nThey are thankful that all these initiatives have not only improved access to education but have also enhanced the learning environment, allowing every child, regardless of background or location, to dream bigger, learn better, and aspire to become productive citizens of a prosperous Zimbabwe, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/sxcdxszx.jpg",
            "description": "Farai Dauramanzi in NEMBUDZIYA, Gokwe PRESIDENT Mnangagwa yesterday launched the Presidential Internet Scheme during the Children’s Party at Nyamuroro High School in Nembudziya, Gokwe.  This is a transformative initiative aimed at delivering high-speed broadband connectivity to all 2 400 administrative wards across Zimbabwe. As part of the programme, President Mnangagwa also handed over 2 000 […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        },
        {
            "title": "Building the Zimbabwe we want begins with us",
            "url": "https://www.chronicle.co.zw/building-the-zimbabwe-we-want-begins-with-us/",
            "content": "Today all roads lead to Nembudziya, Gokwe North in the Midlands Province which is playing host to this years National Independence Day celebrations. The celebrations which are at Mutora Business Centre are being held under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030 which underscores the Second Republics commitment to inclusive national development and decentralisation of key State events.\n\nMore than 60 000 people from across the country are expected to throng Mutora Business Centre for the National Uhuru celebrations. The national celebrations are being held outside the capital, Harare for the fourth year running since Government adopted a system of rotating the hosting of the celebrations to ensure no one and no place is left behind.\n\nLast year the national celebrations were at Murambinda Business Centre, Buhera District in Manicaland Province. Gokwe North, like other districts that have played host to the National Celebrations, has benefited from a number of legacy projects implemented ahead of the celebrations which include construction of new hostels at Nyamuroro High School to accommodate 3 000 children that attended the Childrens Party yesterday, a modern football stadium at Mutora Business Centre where the main celebrations are being held, improved road network and boreholes among other infrastructure projects.\n\nIt is our hope that as citizens converge for the Uhuru celebrations today at the different venues across the country, they will take the opportunity to reflect on the countrys achievements since 1980 when the country was freed from the yoke of colonialism.\n\nCitizens that are not able to travel to Gokwe North for the main celebrations are expected to attend their respective district or provincial celebrations. The countrys gallant sons and daughters sacrificed their lives to liberate the country and they should be smiling in their graves after Government successfully implemented the land reform programme.\n\nMore than 300 000 families are now owners of land in areas that include what used to be a preserve of the white commercial farmers. Most Zimbabweans before independence were confined to barren land while white commercial farmers occupied prime farming areas in different parts of the country.\n\nThe skewed land ownership was one of the major grievances that drove Zimbabweans to take up arms to fight the settler regime. Government has since independence implemented a number of life-changing projects across the country which include construction of roads, bridges, dams, schools, clinics, drilled boreholes and also established a number of irrigation schemes to enhance food security.\n\nThe challenge this year is therefore is to sustain this development momentum and this calls for each and every citizen to put shoulder to the wheel. What is encouraging is that most of the development projects are being implemented by local companies, a confirmation that the country has the required skilled manpower.\n\nThe country is however, under siege from both internal and external detractors that are peddling falsehoods to destabilise the peace and tranquillity that citizens are enjoying.\n\nToday we should therefore come in our numbers at the different Uhuru celebrations venues to shame our detractors that want to divide us. It is only us who can build the Zimbabwe we all want and to achieve this we should have a shared vision as a people. Nyika Inovakwa Nevene Vayo/ Ilizwe Lakhiwa Ngabaninilo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ty-1.jpg",
            "description": "Today all roads lead to Nembudziya, Gokwe North in the Midlands Province which is playing host to this year’s National Independence Day celebrations. The celebrations which are at Mutora Business Centre are being held under the theme: “Zim@45: Devolve and Develop Together Towards Vision 2030” which underscores the Second Republic’s commitment to inclusive national development […]",
            "time": "09:32",
            "date": "18 Apr 2025"
        }
    ]
}