{
    "news": [
        {
            "title": "Ster Kinekor closed",
            "url": "https://www.chronicle.co.zw/ster-kinekor-closed/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nIS it Dj vu for Bulawayo movie lovers in Bulawayo as motion picture powerhouse, Ster Kinekor Zimbabwe is currently closed reminiscent of 2017 when Bulawayo Rainbow Cinemas closed, for good.\n\nSter Kinekor Zimbabwe, nestled at the heart of Bulawayo Centre is closed, with only notices plastered in and around the entrance.\n\nWe regret to inform you that our business is currently closed. We appreciate your understanding and apologise for any inconvenience this may cause. Thank you for your loyalty and support, was the messaged on the paper.\n\nThis sudden closure of the establishment which has become a home for the premiere of movies and holding of the European Film Festival Zimbabwe (EuroFilmFestZW) has led to unanswered questions.\n\nThe number on the paper was unreachable at the time of press.\n\nIn recent times, cinemas have found it hard to stay afloat with streaming services like Netflix, Amazon Prime, and Disney+ impacting movie theatre attendance.\n\nThe recent trend of cinema closures is not unique to Bulawayo; it reflects a wider shift in the entertainment landscape. With the rise of streaming services like Netflix, Amazon Prime, and Showmax, movie theatres are grappling with declining attendance.\n\nMore audiences are opting for the convenience and affordability of watching films from the comfort of their homes, leading to a significant drop in ticket sales and revenue for traditional cinemas.\n\nThis shift in consumer behavior poses serious implications for the entire film industry, impacting everything from production budgets to exhibition strategies.\n\nAs the cinematic landscape continues to evolve, the future of Ster Kinekor Zimbabwe remains uncertain. Movie lovers are left hoping for clarity regarding when, or if, the cinema will reopen its doors.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fugiujkgg.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com IS it Déjà vu for Bulawayo movie lovers in Bulawayo as motion picture powerhouse, Ster Kinekor Zimbabwe is “currently closed” reminiscent of 2017 when Bulawayo Rainbow Cinemas closed, for good. Ster Kinekor Zimbabwe, nestled at the heart of Bulawayo Centre is closed, with only notices plastered in and around the entrance. “We […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Gwanda magistrate sentenced to seven years in prison for soliciting a bribe",
            "url": "https://www.chronicle.co.zw/gwanda-magistrate-sentenced-to-seven-years-in-prison-for-soliciting-a-bribe/",
            "content": "Trish Mukwazo,[emailprotected]A former Gwanda magistrate, Talent Phiri, was yesterday sentenced to seven years in prison after being found guilty of soliciting and accepting a bribe of US$2,500.\n\nHarare Regional Magistrate, Farai Gwitima, handed down the sentence, noting that a lesser punishment would undermine public trust in the justice system.\n\nPhiri will, however, serve five years in prison after two years of his sentence were suspended on condition of good behaviour.\n\nThe court heard that Phiri had granted an interim protection order in favour of Qiniso Ncube against her ex-husband, Lungisani Two Minutes Ncube. Phiri then contacted Ncube, falsely claiming high-level officials were seeking his imprisonment and demanded a US$3,000 bribe to prevent his arrest.\n\nNcube reported the matter to the police and, following negotiations, agreed to pay a reduced bribe of US$2,500. A sting operation was subsequently conducted, leading to Phiris arrest at his residence after he accepted the marked money.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/05/bribery-and-corruption.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com A former Gwanda magistrate, Talent Phiri, was yesterday sentenced to seven years in prison after being found guilty of soliciting and accepting a bribe of US$2,500. Harare Regional Magistrate, Farai Gwitima, handed down the sentence, noting that a lesser punishment would undermine public trust in the justice system. Phiri will, however, serve […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Bulawayo Children’s Choir strikes new chord with live Instruments and songwriting lessons",
            "url": "https://www.chronicle.co.zw/bulawayo-childrens-choir-strikes-new-chord-with-live-instruments-and-songwriting-lessons/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nEVEN at infancy, renowned Bulawayo Childrens Choir is taking huge strides in music with the introduction of live instruments and songwriting lessons.\n\nThis innovative approach aims to empower the young singers, equipping them with a comprehensive musical education that goes beyond vocal performance.\n\nAs of February 1, the choir will commence keyboard lessons, marking the beginning of an exciting journey towards accompaniment by child instrumentalists.\n\nThis bold move will not only enhance the choirs performances but also foster a sense of self-sufficiency among its members.\n\nIn addition to instrumental training, the choir will also introduce songwriting and composing coaching during rehearsals.\n\nThis creative outlet will allow the children to express themselves, exploring their imagination and talent. The next song the choir records will be a milestone achievement, as it will be co-composed by the children themselves.\n\nAccording to Trevor Mawaka, whos the creative director of the Bulawayo Childrens Choir, the decision to introduce live instruments and songwriting lessons was born out of a desire to provide a more holistic musical education.\n\nIn the past, our focus had been on vocal coaching, he acknowledged.\n\nHowever, without teaching learners the art of composing and playing instruments, I couldnt confidently say they had been truly empowered. This realisation led to the introduction of composition and instrument playing into our programme.\n\nMawaka emphasised that the ultimate goal of the choir is to empower its learners, not just to make them sing, but to stand on their own in the future.\n\nWe want our children to be well-rounded musicians, capable of composing, playing instruments, and singing, he said.\n\nBy providing them with these skills, were giving them the tools they need to succeed in the music industry and beyond.\n\nAs the Bulawayo Childrens Choir embarks on this exciting new chapter, audiences can look forward to experiencing the thrill of live instrumentation and original compositions, all crafted by the talented young minds of the choir.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsafhisdnmjcvbcb.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com EVEN at infancy, renowned Bulawayo Children’s Choir is taking huge strides in music with the introduction of live instruments and songwriting lessons. This innovative approach aims to empower the young singers, equipping them with a comprehensive musical education that goes beyond vocal performance. As of February 1, the choir will commence keyboard […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Rainfall brings relief to Bulilima farmers",
            "url": "https://www.chronicle.co.zw/rainfall-brings-relief-to-bulilima-farmers/",
            "content": "By Mthabisi Tshuma[emailprotected]FARMERS in Bulilima District, Matabeleland South Province, are hopeful for a successful harvest following substantial rainfall during December and January.According to a rainfall update from Matabeleland South Agricultural and Rural Development Advisory Services (ARDAS) as of 8 January, Bulilima District recorded varying amounts of rainfall from October 2024 to January 2025. Ward 1 received 304mm, Ward 2 recorded the highest at 396mm, while Ward 10 had the least at 209mm. The other wards reported as follows: Ward 3 (220mm), Ward 4 (248mm), Ward 5 (205mm), Ward 6 (265mm), Ward 7 (247mm), Ward 8 (278mm), Ward 9 (218mm), Ward 11 (270mm), Ward 12 (252mm), Ward 13 (210mm), Ward 14 (205mm), Ward 15 (204mm), Ward 16 (336mm), Ward 17 (315mm), Ward 18 (285mm), Ward 19 (219mm), Ward 20 (295mm), Ward 21 (233mm), and Ward 22 (284mm).\n\nMrs Shupikai Sibanda, the Matabeleland South Provincial Director for ARDAS, said that the increase in rainfall since mid-December had alleviated the drought conditions in Bulilima District.\n\nThe effective rainfall received across the district from 18 December onwards has provided relief to all livestock farmers. Intermittent streams are now flowing, ensuring water availability for livestock. Perennial and annual grasses are actively growing, providing feed for both browsers and grazers, although not yet in sufficient quantities. The body condition of surviving cattle is gradually improving, said Mrs Sibanda.\n\nShe added that the rainfall had spurred planting activities.Most farmers have taken advantage of the rains, and planting is now at its peak. However, many are replanting as their early crops were affected by poor emergence due to erratic and poorly distributed rainfall earlier in the season. Early-planted crops are now blooming and require top dressing, she explained.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/grdtfh.jpg",
            "description": "By Mthabisi Tshuma revmmthiretshuma@gmail.com FARMERS in Bulilima District, Matabeleland South Province, are hopeful for a successful harvest following substantial rainfall during December and January. According to a rainfall update from Matabeleland South Agricultural and Rural Development Advisory Services (ARDAS) as of 8 January, Bulilima District recorded varying amounts of rainfall from October 2024 to January […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Mafa and Matjinge teams advance to KCD Mohadi Football and Netball Tournament Finals",
            "url": "https://www.chronicle.co.zw/mafa-and-matjinge-teams-advance-to-kcd-mohadi-football-and-netball-tournament-finals/",
            "content": "Mthabisi Tshuma, reporting from Madlambudzi, Bulilima\n\nMAFA and Matjinge teams have secured their spots to represent Bulilima District in football and netball, respectively, at the KCD Mohadi Tournament finals, scheduled to take place in Gwanda on 25 and 26 January.Seven football teams and three netball teams participated in the Bulilima District edition of the tournament, held last Saturday at the Madlambudzi Business Centre grounds.The Matjinge netball team dominated their matches, winning all their games against Hingwe and Gwambe, who finished second and third, respectively. The winners received trophies, kits, balls, and monetary prizes donated by various dignitaries, including the Minister of State for Provincial Affairs and Devolution in Matabeleland South, Dr Evelyn Ndlovu, ICT Deputy Minister and Bulilima MP Dingumuzi Phuti, businessman Sikhumbuzo Mlalazi, ZANU PF Gwanda North shadow MP Lungisani Two Minutes Ncube, and ZANU PF Veterans League National Political Commissar Cde Ntombiyakhe Ndlovu.Additional support to ensure the events success came from Deputy Minister of Industry and Commerce Raj Modi, ZANU PF Matabeleland South Provincial Youth League Chairperson Cde Moses Langa, ZANU PF Politburo Member and Bulilima Senator Cde Richard Ndlovu, ZANU PF DCC Secretary for Transport and Welfare Cde Philasande Malinga Ndlovu, and ZANU PF National Youth League Executive Member Cde Charity Ndlovu.In the football tournament, seven teams were divided into two groups. Group A consisted of Ward 19, Ward 12, Luck Stars, and Nyele, with Luck Stars emerging as group winners with nine points. Nyele advanced to the semi-finals as runners-up due to goal difference. Group B featured Malanswazi, Bhangali, and Mafa, with Mafa leading the group with four points after a 10 victory over Bhangali and a goalless draw with Malanswazi.The semi-finals saw Luck Stars lose 10 to Bhangali following a late penalty. In the second semi-final, Mafa and Nyele played to a goalless draw, with Mafa eventually winning 87 in a penalty shootout to reach the finals.The final between Mafa and Bhangali ended in a goalless draw, with Mafa triumphing 54 in a penalty shootout to claim their place as Bulilimas representatives in the KCD Mohadi Tournament finals.In netball, Matjinge secured their spot with dominant performances, comfortably defeating their two competitors to earn the right to represent Bulilima Constituency.Deputy Minister Phuti, the guest of honour, commended the tournaments success and emphasised its significance.The KCD Mohadi Tournament is a noble initiative, brilliantly organised by the Youth League. It not only uplifts young people but also honours the legacy of Vice President and Acting President Kembo Mohadi, who has inspired many through his leadership and resilience, said Phuti.He highlighted the Vice Presidents role in nurturing young leaders, including himself.Many of us, including myself, are products of his leadership. His mentorship and guidance have shaped us into the leaders we are today. This tournament is a fitting tribute to his contributions, he added.Minister Ndlovu urged young people to use sports to combat drug and substance abuse.Sports play a crucial role in steering youths away from drugs. I encourage all young people to participate in sports and embrace healthy lifestyles. I also thank everyone for supporting the KCD Mohadi Youth Tournament, said Minister Ndlovu.Referees representative Taurai Muranganwa praised the organisers for their efforts.The tournament was well-organised, and we are grateful to the sponsors for initiating such a vital programme. It is a significant step towards fighting drug and substance abuse among youths, said Muranganwa.Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jhgj.jpg",
            "description": "Mthabisi Tshuma, reporting from Madlambudzi, Bulilima MAFA and Matjinge teams have secured their spots to represent Bulilima District in football and netball, respectively, at the KCD Mohadi Tournament finals, scheduled to take place in Gwanda on 25 and 26 January. Seven football teams and three netball teams participated in the Bulilima District edition of the […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Man jailed 5 years for attempting to kill crime committee member",
            "url": "https://www.chronicle.co.zw/man-jailed-5-years-for-attempting-to-kill-crime-committee-member/",
            "content": "Thupeyo Muleya Beitbridge Bureau\n\nA 26-YEAR-OLD man from the Ndambe area in Beitbridge has been slapped with a five-year jail term for attempting to kill a member of the local crime-fighting committee.\n\nRecomend Ndou was arrested for stabbing Mbonisi Ndou using a sharp object last year.\n\nHe denied a charge of attempted murder when the trial opened before Beitbridge regional magistrate Ms Charity Maphosa on Friday.\n\nHowever, he was convicted on the strength of the States evidence.\n\nNdou was left with two and half years effective in jail after Ms Maphosa conditionally suspended two and half years on his five-year term.\n\nAppearing for the State, Mr Willbrought Muleya said on December 26 last year, the complainant who a member of the local youth committee is fighting crime left Ndambe business centre at around 430 AM.\n\nAlong the way, Recomend intercepted him while carrying a sharp object and a whip.\n\nHe told the Mbonisi he wanted to kill him for his role in the youth committee.\n\nAfter which he stabbed the Mbonisi in the head resulting in a scuffle and he stabbed him again behind the ear.\n\nMbonisi tried to run away but Recomend chased after him and assaulted him with a whip.\n\nAs a result, the complainant incurred two deep wounds on the head.\n\nThe matter was later reported to the police who swiftly arrested Recomend.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2017/08/Man_Arrested.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 26-YEAR-OLD man from the Ndambe area in Beitbridge has been slapped with a five-year jail term for attempting to kill a member of the local crime-fighting committee. Recomend Ndou was arrested for stabbing Mbonisi Ndou using a sharp object last year. He denied a charge of attempted murder when the […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Zimsec releases 2024 Advanced level results",
            "url": "https://www.chronicle.co.zw/zimsec-releases-2024-advanced-level-results/",
            "content": "Sikhumbuzo Moyo[emailprotected]THE Zimbabwe School Examinations Council (ZIMSEC) has released the 2024 Advanced level results with candidates able to access their results for the next five days starting today on the Zimsec website www.zimsec.co.zw.Zimsec board chairperson Professor Paul Mapfumo said heads of examination centres will be able to collect the results for their respective schools/centres from the Provincial Offices starting Monday next week.A total of 33 585 candidates sat for the November 2024 examinations compared to 34 437 in 2023, which translates to a decrease of 852 in candidature, yielding a percentage decrease of 2.47.For those who wrote two or more subjects, 31 443 obtained Grade E or better in two or more subjects. This translates to 94.58 percent pass rate. In November 2023, however, 34 060 candidates wrote two or more subjects and 32 221 obtained Grade E or better in two or more subjects translating to a percentage pass rate of 94.60. The national pass rate for 2024 and that of 2023 is, therefore, the same, said Prof Mapfumo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/02/zimsec.jpg",
            "description": "Sikhumbuzo Moyo  smoyo@chronicle.co.zw THE Zimbabwe School Examinations Council (ZIMSEC) has released the 2024 Advanced level results with candidates able to access their results for the next five days starting today on the Zimsec website www.zimsec.co.zw. Zimsec board chairperson Professor Paul Mapfumo said heads of examination centres will be able to collect the results for their […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Man takes own life in Bulawayo following domestic dispute over infidelity",
            "url": "https://www.chronicle.co.zw/man-takes-own-life-in-bulawayo-following-domestic-dispute-over-infidelity/",
            "content": "Online Writer\n\nPOLICE in Bulawayo are investigating a tragic case of suicide after 49-year-old Kholisani Ncube of Lobengula West took his own life by ingesting pesticide following a domestic dispute.In a statement, Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele said the incident occurred on the night of 8 January 2024.\n\nNcube reportedly retired to bed with his wife, aged 44, at around 9:00 PM. An hour later, he awoke and left the bedroom. Upon returning, his wife noticed an unusual smell. Shortly after, he began experiencing difficulty walking and requested milk.The deceaseds wife discovered an open packet of ECT Etrap 50SP pesticide near a shoe rack, along with two purple plastic cups containing a white substance. Suspecting poisoning, she prepared a homemade remedy of milk and charcoal, which she administered to her husband. However, his condition did not improve.\n\nMr Ncube was then moved outside for fresh air but succumbed shortly thereafter. Police confirmed that a report was filed, and a preliminary investigation revealed that the couple had a dispute over allegations of infidelity the previous evening.Authorities have urged members of the public to seek counselling and resolve disputes amicably rather than resorting to self-harm.Asst Insp Msebele expressed condolences and reiterated the importance of professional support for mental health and interpersonal issues.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsfmkbvhxhivhbvfhbvhiobvbvujo.jpg",
            "description": "Online Writer POLICE in Bulawayo are investigating a tragic case of suicide after 49-year-old Kholisani Ncube of Lobengula West took his own life by ingesting pesticide following a domestic dispute. In a statement, Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele said the incident occurred on the night of 8 January 2024. Ncube reportedly retired to […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Gogo Chihoro to open base in Victoria Falls",
            "url": "https://www.chronicle.co.zw/gogo-chihoro-to-open-base-in-victoria-falls/",
            "content": "Leonard Ncube:[emailprotected]\n\nHARARE-based traditionalist and sangoma of the moment, Gogo Chihoro, whose birth name is Ms Memory Madamburi, is planning to establish a new base in Victoria Falls due to overwhelming demand from clients in Bulawayo and Harare.\n\nHaving started her sangoma practice at the age of 14, Gogo Chihoro claims to have helped millions of people with various challenges.\n\nShe began her work in Harare, gaining widespread attention for her claim of being able to unlock a gold panning password, referring to her ability to guide panners to significant gold deposits. Since November last year, she has been visiting Bulawayo to meet clients.\n\nNow, her focus is on the resort city of Victoria Falls, aiming to reduce travel distances for her clients and make her services more accessible.\n\nI think I have helped millions of people because I started this job when I was 14 years old up to now. I am planning to open a branch in Victoria Falls, but this will depend on the number of clients willing to consult there. In Bulawayo, I realised there were many criminals and thieves, which motivated me to open a branch. I want to encourage people in Victoria Falls and beyond to preserve our cultural values and continue using traditional herbs, said Gogo Chihoro in a brief phone interview.\n\nThough she prefers privacy, Gogo Chihoro urges people not to tolerate theft, claiming she can resolve such issues using bees and baboons to catch thieves.\n\nHer services address a variety of problems, including diseases, marital issues, mental health challenges, and financial difficulties.\n\nEven those starting businesses should consult me first. I am here to help businessmen prosper. Currently, I operate in Bulawayo and Harare, but I am considering opening more branches due to the growing clientele base. This will reduce travel expenses for clients and make it easier for them to access my services, she added.\n\nGogo Chihoro said she had a vision at the age of 12 and began offering spiritual guidance, though her parents, who were pastors, initially opposed her path as a traditional healer. Despite their disapproval, she claims to have excelled academically, though she has not disclosed specific details.\n\n@ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fjfhjf.jpg",
            "description": "Leonard Ncube: leonard.ncube@chronicle.co.zw HARARE-based traditionalist and sangoma of the moment, Gogo Chihoro, whose birth name is Ms Memory Madamburi, is planning to establish a new base in Victoria Falls due to overwhelming demand from clients in Bulawayo and Harare. Having started her sangoma practice at the age of 14, Gogo Chihoro claims to have helped […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        },
        {
            "title": "Moza’s Opposition Leader Returns to Maputo",
            "url": "https://www.chronicle.co.zw/mozas-opposition-leader-returns-to-maputo/",
            "content": "Joseph Madzimure Zimpapers Politics Hub\n\nRelative calm prevails in Maputo as Mozambican opposition leader Venncio Mondlane on Thursday returned from self-imposed exile, following violent protests by his supporters after the announcement of election results in October last year.\n\nLocal Mozambican media reported that security personnel had to fire tear gas to disperse rowdy opposition supporters gathered outside Mavalane International Airport in the capital, Maputo.\n\nUpon his arrival, the opposition leader stated that he was prepared to engage in talks regarding what he described as disputed election results. The Mozambican government has repeatedly called for dialogue, which the opposition leader had previously spurned, instead urging his supporters to protest the election outcome.\n\nMozambiques Constitutional Court confirmed the ruling party Frelimos victory in December. The results have positioned Podemos, the party under which Mr Mondlane contested, as the new largest opposition party in the next parliament. Its parliamentarians are set to be sworn in on 13 January.\n\nOf the 250 seats that comprise the Parliament, Renamo, previously the largest opposition party, has seen its representation drop from 60 seats in 2019 to 28. Frelimo has retained its parliamentary majority with 171 legislators.\n\nIn the presidential elections, Mozambiques top court declared Frelimos Daniel Chapo the winner with 65.17 per cent of the vote, while Mondlane received 24 per cent.\n\nPresident-elect Chapo is expected to be sworn in next Wednesday. He will succeed President Filipe Nyusi, who has served the maximum two terms\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/Venancio-Mondlane.jpg",
            "description": "Joseph Madzimure  Zimpapers Politics Hub Relative calm prevails in Maputo as Mozambican opposition leader Venâncio Mondlane on Thursday returned from self-imposed exile, following violent protests by his supporters after the announcement of election results in October last year. Local Mozambican media reported that security personnel had to fire tear gas to disperse rowdy opposition supporters […]",
            "time": "20:39",
            "date": "10 Jan 2025"
        }
    ]
}