{
    "news": [
        {
            "title": "46 in Labour Court judges short list",
            "url": "https://www.chronicle.co.zw/46-in-labour-court-judges-short-list/",
            "content": "Online Writer\n\nTHE Judicial Service Commission (JSC) has shortlisted 46 candidates, among them Bulawayo magistrates and lawyers, to fill eight positions on the Labour Court bench.\n\nIn a statement on Friday, JSC said the interviews for the shortlisted candidates would be conducted next Monday starting at 9AM in Harare.\n\nThe nominated candidates are required to attend the first stage of the interviews on Monday, April 14 April 2025, in Harare. Candidates are expected to bring their laptops and those who do not bring laptops will not be allowed into the interview, read the statement.\n\nThe successful candidates will soon be invited to participate in public interviews as the second and final stage of the selection process of section 180 (4) (c) of the Constitution of Zimbabwe, 2013.\n\nThe interviews will be open to the media and members of the public.\n\nBulawayo magistrates and lawyers shortlisted for the interviews include Mrs Sibongile Marondedze, Mr Abednico Ndebele, Mr Sikhumbuzo Nyathi, Ms Nozabelo Ndlovu and Mr Douglas Vakai Chikwekwe.\n\nThe JSC is on a drive to bring justice closer to the people and ensure that matters are heard on time.Last year in May, JSC conducted interviews for High Court and Administrative Court Judges where 39 candidates were invited for the process.\n\nThe recruitment process for the 10 High Court Judges was meant to replace judges who died, resigned or were removed from office in terms of the constitution, while the vacancy at the Administrative\n\nCourt arose following the retirement of Justice Herbert Mandeya.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-14.29.46.jpeg",
            "description": "Online Writer THE Judicial Service Commission (JSC) has shortlisted 46 candidates, among them Bulawayo magistrates and lawyers, to fill eight positions on the Labour Court bench. In a statement on Friday, JSC said the interviews for the shortlisted candidates would be conducted next Monday starting at 9AM in Harare. “The nominated candidates are required to […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "POTRAZ rolls out nationwide campaign to educate consumers on telecoms rights",
            "url": "https://www.chronicle.co.zw/potraz-rolls-out-nationwide-campaign-to-educate-consumers-on-telecoms-rights/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTHE Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) has rolled out an awareness campaign to sensitise people on their rights under postal and telecommunications services in the country.\n\nIn an interview during a roadshow in Gwanda, POTRAZ Consumer Affairs Manager, Mr Phibion Chaibva, said that during the programme they are educating consumers on their rights and the services offered by POTRAZ.\n\nThe postal and regulatory authority is also issuing flyers to the public.\n\nOne of our mandates as POTRAZ is to protect consumers and as such we have rolled out roadshows. We were in Mashonaland East and now we are in Matabeleland South. We have covered Beitbridge, Gwanda and then we will move to Umzingwane, Maphisa and Matobo.\n\nWe want consumers to be aware of their consumer rights. People have a right to access as many service providers, a right to quality services, and a right to complain if they are not happy about the service they are getting, he said.\n\nMr Chaibva said that when consumers fail to get assistance from service providers regarding their grievances, they can contact POTRAZ.\n\nHe said that consumers in some cases purchase services without knowing the terms and conditions. He said the roadshows will also help to raise awareness among consumers on how they can protect themselves to ensure quality service.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-16.35.21-680x380.jpeg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw THE Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) has rolled out an awareness campaign to sensitise people on their rights under postal and telecommunications services in the country. In an interview during a roadshow in Gwanda, POTRAZ Consumer Affairs Manager, Mr Phibion Chaibva, said that during the programme they are educating […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "WATCH: ICT Ministry bridges digital divide in Gokwe North – Lights up Nembudziya",
            "url": "https://www.chronicle.co.zw/watch-ict-ministry-bridges-digital-divide-in-gokwe-north-lights-up-nembudziya/",
            "content": "Mthabisi Tshuma in Gokwe\n\nTHE Ministry of Information Communication Technology, Postal and Courier Services working closely with its implementing partners among them Netone, Zimpost and Potraz have bridged the urban-rural divide in Gokwe North.\n\nThis comes through enhancing connectivity at the Nembudziya Growth Point Open Ground in Gokwe North, installing connectivity at Gokwe North District Hospital, refurbishing Gokwe Post Office where a Community Information Centre (CIC) will be opened and setting up a computer laboratory at Nyamuroro High School.\n\nICT Deputy Minister Dingumuzi Phuti on Thursday toured a Zimpost Digitruck which on Wednesday trained 154 villagers, Gokwe North District Hospital, Nembudziya Growth Point Open Ground, Gokwe Post Office and Nyamuroro High School.\n\nIn keeping with the Second Republics initiative to hold national events rotationally across the countrys provinces, the 45th Independence Anniversary Celebrations will take place in Gokwe North.\n\nSpeaking after the tour, Deputy Minister Phuti said President Mnangagwas Government is making strides all places countrywide in bridging the digital divide.\n\nFollow on X @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/kikikiikiki.jpg",
            "description": "  Mthabisi Tshuma in Gokwe THE Ministry of Information Communication Technology, Postal and Courier Services working closely with its implementing partners among them Netone, Zimpost and Potraz have bridged the urban-rural divide in Gokwe North. This comes through enhancing connectivity at the Nembudziya Growth Point Open Ground in Gokwe North, installing connectivity at Gokwe North […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "Sanganai/Hlanganani/Kumbanayi World Tourism Expo sparks curiosity at WTM Africa",
            "url": "https://www.chronicle.co.zw/sanganai-hlanganani-kumbanayi-world-tourism-expo-sparks-curiosity-at-wtm-africa/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nThe upcoming 18th edition of the Sanganai/Hlanganani/Kumbanayi World Tourism Expo, scheduled for Mutare in September has generated significant interest among international buyers at the World Travel Market (WTM) Africa in Cape Town, South Africa.\n\nThe event is especially drawing attention from those looking to explore fresh destinations beyond Zimbabwes more famous attractions, such as Victoria Falls and Hwange National Park.\n\nThis years expo set for 10 to 12 September will mark a historic shift, as it is the first time Zimbabwes premier tourism showcase will be held outside Bulawayo and Harare.\n\nThe Mutare Sports Club in Manicaland Province will serve as the venue and local preparations for the event are already underway.\n\nThe event is a key collaboration between Zimbabwes Ministry of Tourism and Hospitality Industry and the Zimbabwe Tourism Authority (ZTA).\n\nBoth organisations are leading the countrys participation at WTM Africa, where 15 key players from Zimbabwes tourism sector are currently showcasing the countrys offerings.\n\nZTA said the countrys participation is a show of commitment to revitalising its tourism sector.\n\nThe countrys presence at this premier global event reflects its commitment to reviving and repositioning the tourism sector as a cornerstone of national economic growth.\n\nZTA said interest in the Sanganai/Hlanganani/Kumbanayi World Tourism Expo is palpable at the WTM Africa event, with many buyers eager to learn more about the expo and the fresh tourism opportunities in Mutare.\n\nThe choice of Mutare has sparked curiosity among buyers, particularly those looking for fresh destinations beyond the well-known Victoria Falls and Hwange.\n\nZimbabwe is one of 96 countries participating in this years WTM Africa, which runs from April 9-11, 2025 at the Cape Town International Convention Centre.\n\nThe countrys goal at the event is to reconnect with established markets, open new ones, and strengthen Zimbabwes profile as a competitive and attractive destination for international tourists.\n\nWTM Africa serves as an invaluable platform for networking, establishing strategic partnerships, and engaging directly with global buyers.\n\nIt has also allowed Zimbabwe to promote lesser-known tourism regions like Kariba, Mana Pools and the Eastern Highlands, which continue to gain attention from buyers seeking unique, off-the-beaten-path travel experiences.\n\nZTAs update said that the first day of the exhibition saw strong engagement at the Zimbabwe stand, with industry players experiencing full schedules of business meetings and networking opportunities. Interest from international buyers was notably high.\n\nOverall, Zimbabwes participation at WTM Africa 2025 has made a strong impression. The delegations efforts are expected to translate into greater destination visibility, increased tourist traffic, and valuable business leads, ZTA said.\n\nIt said continued efforts in follow-up with buyers, proactive marketing of the Sanganai/Hlanganani Expo and addressing visa challenges will be crucial in maintaining the momentum generated at WTM Africa.\n\nZimbabwe has once again demonstrated that it has a compelling tourism offering and is ready to engage meaningfully with the global travel market.\n\nThe growing interest from international buyers signifies a promising future for Zimbabwes tourism industry, with the Sanganai/Hlanganani/Kumbanayi World Tourism Expo set to be a key milestone in the countrys efforts to position itself as a top global tourism destination, it added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-16.15.51-680x380.jpeg",
            "description": "Nqobile Bhebhe,Senior Business Reporter The upcoming 18th edition of the Sanganai/Hlanganani/Kumbanayi World Tourism Expo, scheduled for Mutare in September has generated significant interest among international buyers at the World Travel Market (WTM) Africa in Cape Town, South Africa. The event is especially drawing attention from those looking to explore fresh destinations beyond Zimbabwe’s more famous […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "It’s all systems go at the FNB Botswana Grand Prix",
            "url": "https://www.chronicle.co.zw/1103056-2/",
            "content": "Lovemore Dube in GABORONE, Botswana\n\nTHE BATSWANAS have worked day and night to ensure the Gaborone National Sports Stadium plays host to the FNB Golden Grand Prix an international event that has attracted a good field of international stars on Saturday.\n\nThere were doubts on Tuesday and Wednesday on whether workmen will be able to deliver.They have worked day and night since Tuesday laying a new surface, granules and what is outstanding are lines.\n\nAt some stage there were suggestions that the event be moved to the Obed Ithani Stadium in Francistown but Government through the Botswana Sports Commission assured the nation and athletics lovers that the stadium would be ready by Friday afternoon.\n\nAt 1500 hours what appeared outstanding was the marking of the lines.Botswana Sports Commission chief executive officer Tuelo Serhufo has been adamant about progress being in place.\n\nOn Friday the media jostled for accreditation at the stadium with tickets said to be selling well ahead of the event.Akhiwe Simbine the 100 and 200m runner from South Africa, Ferdinand Omanyala the Kenyan sprint king and Botswana favourite Letsile Tebogo are among some of the biggest names taking part.\n\nThe Batswanas are talking about Tebogo and their mens 4x400m relay team that has been making waves in the world.\n\nA number of nations are using the event to try and qualify for the World Relays set for China next month.\n\nAnother opportunity at hand are the World Championships in Tokyo, Japan in August.Zimbabwe has sent three teams for the event.\n\nThey are bidding to qualify in the womens 4x100m and mens 4100 and 4x400m relays.Last month the 4x400m mens team ran the 28th best time of the year in 3 minutes 03.39 seconds to stay in contention.\n\nThirty two relay teams with the best seasons times as of close of deadline tomorrow will compete in China.There have been several events since then where other nations have competed with a view of bettering their standards ahead of deadline day.\n\nNational Athletics Association of Zimbabwe boss Tendai Tagara, his technical directorPhakamile Lisimati are optimistic that the athletes will do well.\n\nSaturdays event will be a dress rehearsal for the Batswanas who will be the hosts of the 2026 World Relays.Zimbabwe teams4x100m MEN:1. Ngoni Makusha2. Daniel Magogo3. Delroy Reppoh4. Takudzwa Manhanga5. Elvis Mukuchura\n\n4x100M GIRLS1. Hayley Chingono2. Nyasha Doka3. Rutendo Vushe4. Gladys Mukome5. Rutendo Sixpence6. Samukheliso Ndebele\n\n4x400m1. Geren Muwishi2. Dennis Hove3. Leeford Zuze4. Aldrin Mafa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-15.41.08-680x380.jpeg",
            "description": "Lovemore Dube in GABORONE, Botswana THE BATSWANAS have worked day and night to ensure the Gaborone National Sports Stadium plays host to the FNB Golden Grand Prix an international event that has attracted a good field of international stars on Saturday. There were doubts on Tuesday and Wednesday on whether workmen will be able to […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "Tourism Minister Rwodzi attends 2nd UN Tourism Summit for Africa and the Americas in Zambia",
            "url": "https://www.chronicle.co.zw/tourism-minister-rwodzi-attends-2nd-un-tourism-summit-for-africa-and-the-americas-in-zambia/",
            "content": "Nqobile Bhebhe, Senior Business Reporter\n\nMINISTER of Tourism and Hospitality Industry Barbara Rwodzi is participating in the 2nd United Nations Tourism Summit for Africa and the Americas, taking place in Livingstone, Zambia.\n\nThe high-level summit builds on the success of the inaugural edition held in Punta Cana, Dominican Republic in October 2024.\n\nThis years event, thats runs from April 8 to 12, brings together Tourism Ministers from across Africa and the Americas, senior government officials, industry leaders, and global tourism experts.\n\nHeld under the theme Advancing Resilient Tourism through Connectivity, Investment, and Skilled Workforce Development, the summit focuses on strengthening the resilience of the tourism sector by prioritising infrastructure development, strategic investments and human capital growth.\n\nKey discussions at the summit highlight the urgent need to enhance regional integration, stimulate economic growth across both continents and promote an inclusive tourism industry.\n\nThis includes empowering local communities, farmers, women and youth through meaningful participation in the tourism value chain.\n\nMinister Rwodzi reaffirmed Zimbabwes commitment to achieving Upper Middle-Income status by 2030, identifying tourism as a key driver of this national vision.\n\nShe outlined the Governments progress under President Mnangagwas leadership, particularly in improving air connectivity through the refurbishment and expansion of three major international airports: Robert Gabriel Mugabe, Joshua Mqabuko Nkomo and Victoria Falls.\n\nShe emphasised the strategic importance of Victoria Falls Airport, now the largest aviation hub in the Kavango-Zambezi (KAZA) region, which facilitates the landing of wide-body aircraft and connects international tourists to Zimbabwe and neighboring KAZA countries.\n\nMinister Rwodzi also called for deliberate and strategic investment in national airlines by African governments to strengthen intra-African connectivity.\n\nShe stressed that limited air connectivity across the continent remains a critical policy challenge that must be urgently addressed to unlock Africas full tourism potential.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-13.00.46-1-680x380.jpeg",
            "description": "  Nqobile Bhebhe, Senior Business Reporter MINISTER of Tourism and Hospitality Industry Barbara Rwodzi is participating in the 2nd United Nations Tourism Summit for Africa and the Americas, taking place in Livingstone, Zambia. The high-level summit builds on the success of the inaugural edition held in Punta Cana, Dominican Republic in October 2024. This year’s […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "Rugby Thunder Set to Rock Hartsfield",
            "url": "https://www.chronicle.co.zw/rugby-thunder-set-to-rock-hartsfield/",
            "content": "Brandon Moyo,Zimpapers Sports Hub\n\nHARTSFIELD Rugby Grounds will erupt with youthful energy and national pride today and tomorrow as the 2025 Unforgettable Milton Rugby Festival kicks off, with organisers confirming that all systems are go for what promises to be a spectacular two-day showcase of schoolboy and schoolgirl rugby talent.\n\nFifteen schools from across Zimbabwe are set to descend on the iconic home of Zimbabwean rugby for the festival, which has grown into one of the flagship events of the local schools rugby calendar. Each participating school will field both an Under-16 and a first team, ensuring a packed schedule of high-octane matches across both days.\n\nIn a significant development for this years edition, girls teams will also take to the field, amplifying the inclusivity and reach of the tournament.\n\nThis years festival is bigger, better, and more inclusive, said Lovemore Mangwiro, the Milton Boys High teacher-in-charge of rugby and lead organiser of the event. All is in place and we are ready for Friday and Saturday. Its going to be massive.\n\nMangwiro, who has overseen months of preparation, said the venue is in top shape following the recent Under-20 league, and fans should expect seamless organisation and uninterrupted action across both the main and B-fields.\n\nOur preparations have gone well and weve ensured everything runs smoothly without disruptions. Once again, were thrilled to have girls teams participating. Its about giving equal opportunities. You never know whos watching from the terracesso were urging every player to give it their all.\n\nThe festival is more than just competitionits a stepping stone for young talent. Mangwiro noted that the event offers players a rare chance to impress scouts and coaches, with many schools using the tournament to fine-tune their squads ahead of the upcoming season.\n\nAll the teams are coming here to prepare for the new season, and rugby development is the ultimate winner, said Mangwiro. Itll be two days of rugby galore, and were looking forward to seeing the future of Zimbabwean rugby in action.\n\nAdding to the anticipation is the debut of Prince Edward School, one of the countrys rugby powerhouses, whose inclusion raises the stakes significantly. Their first teamthe feared Tigerswill feature in the festivals grand finale against hosts Milton Elephants in what is expected to be a titanic showdown to close the tournament.\n\nThe first teams will lock horns on the main field, while Under-16 and girls matches will unfold on the B-field, with action kicking off as early as 07:20am on both days.\n\nUnforgettable Milton Rugby Festival FixturesDay One  First TeamsMilton Second vs CBCPlumtree vs St BernardsPetra vs EntumbaneCBC vs NkulumaneDirect Contact vs NorthleaWestern Suburbs vs GoromonziMilton vs Allan WilsonChurchill vs GiffordPrince Edward vs Midlands Christian CollegeDay One  Under-16 & GirlsChurchill vs CBCPetra vs Allan WilsonMontrose Girls vs Goromonzi GirlsPlumtree Girls vs Northlea GirlsMilton vs Prince EdwardPlumtree vs GoromonziWestern Suburbs vs GiffordSt Bernards vs St ColumbasEntumbane Girls vs LBC GirlsEntumbane vs Direct ContactDay Two  First TeamsMilton Second vs NkulumaneSt Bernards vs EntumbaneNorthlea vs LBCCBC vs GiffordDirect Contact vs Western SuburbsAllan Wilson vs GoromonziPetra vs MCCPlumtree vs ChurchillMilton vs Prince EdwardDay Two  Under-16 & GirlsPrince Edward vs PlumtreeMilton vs Allan WilsonChurchill vs GiffordPlumtree Girls vs LBC GirlsEntumbane vs St ColumbasSt Bernards vs CBCNorthlea Girls vs Montrose GirlsEntumbane Girls vs Goromonzi GirlsDirect Contact vs Western SuburbsPetra vs GoromonziWith the stage set and anticipation at fever pitch, the Unforgettable Milton Rugby Festival looks ready to deliver on its promisetwo days of non-stop action, unforgettable rivalries, and the raw, unfiltered energy of Zimbabwes next generation of rugby stars.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ololka.jpg",
            "description": "Brandon Moyo,Zimpapers Sports Hub HARTSFIELD Rugby Grounds will erupt with youthful energy and national pride today and tomorrow as the 2025 Unforgettable Milton Rugby Festival kicks off, with organisers confirming that all systems are go for what promises to be a spectacular two-day showcase of schoolboy and schoolgirl rugby talent. Fifteen schools from across Zimbabwe […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "Ponera Construction comes to the aid of women’s football",
            "url": "https://www.chronicle.co.zw/ponera-construction-comes-to-the-aid-of-womens-football/",
            "content": "Online Reporter\n\nPONERA Construction has unveiled a USD $10,000 sponsorship in support of the 2025 Zimbabwe Womens Premier Soccer League (ZWPSL)\n\nThis partnership marks another step forward in empowering the womens game and creating more opportunities for growth and excellence.\n\nZWPSL makes its long-awaited return this weekend, and all eyes will be on a heavyweight showdown between reigning champions Herentals Queens and old rivals Black Rhinos Queens at One Commando.\n\nWhile Harare hosts the headline game, theres also a buzz around Bulawayo, where Mpopoma Stars Academy and Highlanders Royals are set to ignite the local football scene with a fiery city derby at Chiefs Village.\n\nInitially scheduled to kick off on April 5, the league was postponed by a week, but now eight fixtures will light up venues across the country on Saturday.Saturday WPSL Fixtures:\n\nBlack Rhinos Queens vs Herentals Queens (One Commando), Faith Drive Academy vs Kwekwe Queens (Chisamba Grounds), Conduit Soccer Academy vs Chapungu Queens (Manyame Sports Club), Maningi Queens vs Sheasham Gweru (The Heart Stadium), Correctional Queens vs Black Mambas (Wagadhugu), Mpopoma Stars Academy vs Highlanders Royals (Bulawayo Chiefs Village), Platinum Royals vs Harare City Queens (Mandava), Red Buffaloes vs Cranborne Royals (Vhengere)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-14.23.05-680x380.jpeg",
            "description": "Online Reporter PONERA Construction has unveiled a USD $10,000 sponsorship in support of the 2025 Zimbabwe Women’s Premier Soccer League (ZWPSL) This partnership marks another step forward in empowering the women’s game and creating more opportunities for growth and excellence. ZWPSL makes its long-awaited return this weekend, and all eyes will be on a heavyweight […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "WATCH: Preps in full throttle for Independence Cup clash",
            "url": "https://www.chronicle.co.zw/watch-preps-in-full-throttle-for-independence-cup-clash/",
            "content": "Mthabisi Tshuma in Gokwe\n\nPREPARATIONS are in full swing for the Independence Cup final, which will be held at the Nembudziya Growth Point Open Ground in Gokwe North.\n\nDefending champions Simba Bhora are set to play FC Platinum on April 18.\n\nIn keeping with the Second Republics initiative to hold national events rotationally across the countrys provinces, the 45th Independence Anniversary Celebrations will take place in Gokwe North.\n\nFollow on X-@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-15.12.55-680x377.jpeg",
            "description": "Mthabisi Tshuma in Gokwe PREPARATIONS are in full swing for the Independence Cup final, which will be held at the Nembudziya Growth Point Open Ground in Gokwe North. Defending champions Simba Bhora are set to play FC Platinum on April 18. In keeping with the Second Republic’s initiative to hold national events rotationally across the […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        },
        {
            "title": "WATCH: Vice President Mohadi raises concern over defunct radiotherapy machines at Mpilo",
            "url": "https://www.chronicle.co.zw/watch-vice-president-mohadi-raises-concern-over-defunct-radiotherapy-machines-at-mpilo/",
            "content": "Robin Muchetu,Lifestyle Health and Gender Editor\n\nVICE PRESIDENT Kembo Mohadi on Friday morning toured Mpilo Central Hospital in Bulawayo to assess the state of operations at one of the countrys major referral health institutions.\n\nDuring the visit, the Vice President expressed concern over the non-functional equipment at the hospitals Radiotherapy Centre, which provides treatment for cancer patients.\n\nMost of the critical machines at the centre are down, leaving patients with no option but to travel to countries such as India and South Africa to access life-saving cancer treatment.\n\nHospital officials acknowledged the challenges, saying the biggest hurdle is a lack of funding to service and maintain the specialised machines at the centre.\n\nThe Vice President has been in Bulawayo throughout the week, visiting various industries and engaging with potential investors as part of government efforts to promote industrial revival. On Thursday, he also paid a courtesy call to veteran nationalist Cde Angeline Masuku at her home in Warringham.\n\n@NyembeziMu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-11-at-14.54.47-680x380.jpeg",
            "description": "Robin Muchetu, Lifestyle Health and Gender Editor VICE PRESIDENT Kembo Mohadi on Friday morning toured Mpilo Central Hospital in Bulawayo to assess the state of operations at one of the country’s major referral health institutions. During the visit, the Vice President expressed concern over the non-functional equipment at the hospital’s Radiotherapy Centre, which provides treatment for […]",
            "time": "18:09",
            "date": "11 Apr 2025"
        }
    ]
}