{
    "news": [
        {
            "title": "ZITF makes key appointments",
            "url": "https://www.chronicle.co.zw/zitf-makes-key-appointments/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nThe Zimbabwe International Trade Fair (ZITF) Company has announced two key appointments aimed at advancing its strategic vision and strengthening its position in the exhibition industry.\n\nAccording to ZITF, Ms Doreen Dzamatira has been appointed as Sales and Relationships Manager, while Mr Thandolwenkosi Nkomo will serve as Marketing and Corporate Communications Manager.\n\nMr Thando Nkomo\n\nBoth appointments take effect from April 1.\n\nIn a statement, ZITF welcomed Ms Dzamatira, emphasising her role in driving business growth and enhancing client engagement:\n\nWe warmly welcome Ms Dzamatira to her new role at the Zimbabwe International Trade Fair (ZITF) Company, where she will continue to drive revenue growth and business development, cultivate lasting customer relationships, and play a key role in launching innovative events and initiatives that enhance the companys presence in the Meetings, Incentives, Conferences, and Exhibitions (MICE) sector.\n\nThe company also stressed Mr Nkomos expertise and the impact he is expected to have on the organisations marketing and communication strategies:\n\nHe brings with him a wealth of experience in media relations, community engagement, crisis communications, and stakeholder relationship buildingassets he will use to elevate the ZITF Companys marketing and corporate communications.\n\nThese appointments align with ZITFs broader strategy to enhance its market influence and expand its footprint in the MICE industry.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-03-at-08.21.21_af18f1bf.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter The Zimbabwe International Trade Fair (ZITF) Company has announced two key appointments aimed at advancing its strategic vision and strengthening its position in the exhibition industry. According to ZITF, Ms Doreen Dzamatira has been appointed as Sales and Relationships Manager, while Mr Thandolwenkosi Nkomo will serve as Marketing and Corporate Communications […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Alarm over child marriages",
            "url": "https://www.chronicle.co.zw/alarm-over-child-marriages/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nOVER 8 900 teenagers, including girls under the age of 10 fell pregnant in 2024 across eight districts in Zimbabwe with 6 800 giving birth either at home or at health facilities while six tragically died during delivery.\n\nThe alarming statistics were revealed during the Not in My Village campaign, which was piloted in Chipinge, Mutare, Goromonzi, Murehwa, Hurungwe, Chegutu, Beitbridge and Insiza districts.\n\nData from the Ministry of Health and Child Care highlights the severity of the issue where nine children under the age of 10 became pregnant in Chipinge, Mutare, Insiza and Chegutu. The districts also recorded significant numbers of antenatal visits and deliveries.\n\nChipinge recorded 1 665 antenatal visits, 1 755 deliveries, Mutare had 1 323 antenatal visits and 836 deliveries, Goromonzi recorded 1 160 antenatal visits and 361 deliveries while Murehwa recorded 723 antenatal visits and 653 deliveries.\n\nIn Hurungwe, 1 683 antenatal visits and 1 560 deliveries were recorded. In Chegutu 1 196 girls accessed antenatal visits while 836 delivered. In Beitbridge there were 659 antenatal visits and 542 deliveries, Insiza had 504 antenatal visits and 309 deliveries.\n\nIn a presentation made on her behalf during a Not in My Village chiefs orientation training workshop in Gweru by Masvingo provincial mental health officer, Ms Martina Nyazenga, Special Rapporteur for Children Without Parental Care in the Africa Union, Commissioner Anne Musiiwa, said many cases in districts were not being reported.\n\nShe said there is a need for stakeholders to assist in identifying these cases to fight teenage pregnancies and child marriages.\n\nComm Musiiwa said teenage pregnancies have severe physical, psychological and social effects on children.\n\nA childs body is still growing and pregnancy adds additional physical, psychological and social stress. Their brains, bones and muscles are not fully developed, which can make labour and delivery more complicated, she said.\n\nThe pelvis, for example, may not be fully developed, increasing the risk of obstructed labour.\n\nComm Musiiwa further noted that girls under the age of 15 are five times more likely to die during childbirth than women in their 20s.\n\nShe said beyond health concerns, teenage mothers, particularly in rural areas, face stigma, social exclusion and reduced economic opportunities. Many drop out of school and struggle to reintegrate into society.\n\nChildren who are pregnant are at an increased risk of developing pre-eclampsia (high blood pressure and organ damage. Young mothers, particularly those who are under the age of 18, often face judgment and stigma from their peers, families, and communities, said Comm Musiiwa.\n\nThey may be labelled as irresponsible or as a bad influence, which can result in social exclusion. This isolation can also affect their mental health and self-esteem.\n\nStatistics have also shown that teenage pregnancies and child marriages are rampant, particularly in rural, resettlement, mining and border areas.\n\nIn Hurungwe and Chegutu, about 30 percent of adolescents were married before reaching 18 years. Murehwa District recorded 2 976 child marriages in the past year, while Goromonzi had 1 048 cases.\n\nBeitbridge recorded over 30 000 child marriages, the highest in the country while Insiza recorded 20 872 cases. Chipinge has 12 863 cases of teenage pregnancies and child marriages combined.\n\nAccording to the 2019 Zimbabwe Multiple Indicator Cluster Survey (MICS) Mashonaland Central has the highest child marriage prevalence rate at 50 percent, followed by Mashonaland West at 41,7 percent, and Mashonaland East at 37,8 percent and Manicaland at 36 percent. Masvingo is sitting at 35,5 percent followed by Matabeleland North at 32,9 percent, Midlands at 30,4 percent, Matabeleland South at 22,2 percent, Harare at 21,7 percent and Bulawayo with 13,5 percent.\n\nSpeaking at the same meeting Ministry of Women Affairs, Community, Small and Medium Enterprises Development deputy director, Ms Matildah Singende, said other challenges faced include low reporting of cases of child marriages and failure to locate the survivors so that they can access help.\n\nShe said some families do not cooperate in cases of child marriages while other cases are reported late after the marriage has failed.\n\nThese startling figures have prompted urgent action from community leaders and stakeholders.\n\nThe Government, in collaboration with the United Nations Population Fund (UNFPA), is spearheading the Not in My Village campaign. The initiative is youth-led, driven by the Young Peoples Network on Health and Wellbeing (YPNHW), in partnership with NAC. The campaign which was was launched at Nzvimbo High School in Mazowe District, Mashonaland Central last year, is now expanding to Matabeleland South, Manicaland, Mashonaland East and Mashonaland West.\n\nThe fight against teenage pregnancies and child marriages aligns with National Development Strategy 1 (NDS1), which aims to create a prosperous and empowered upper-middle-income society by 2030.\n\nHowever, experts warn that without stronger enforcement of laws, community education and improved access to reproductive health services, child pregnancies crisis may worsen. @DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cfhgc-680x380-1.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw OVER 8 900 teenagers, including girls under the age of 10 fell pregnant in 2024 across eight districts in Zimbabwe with 6 800 giving birth either at home or at health facilities while six tragically died during delivery. The alarming statistics were revealed during the “Not in My Village” campaign, which was piloted […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Pesky armed robbers shot dead",
            "url": "https://www.chronicle.co.zw/pesky-armed-robbers-shot-dead/",
            "content": "Peter Matika,[emailprotected]\n\nTWO suspected criminals, believed to be part of a gang that shot and killed a police officer in Bulawayos Sizinda suburb last week, were shot dead in a dramatic shootout with police officers.\n\nA third suspect was arrested and is now in police custody pending further investigations.\n\nThe suspects reportedly engaged in a gun battle with police officers in Sauerstown on Sunday night. The gang is linked to the fatal shooting of Sergeant Abel Masava, who was gunned down while responding to a domestic violence case in Sizinda. The same gang is also linked to 25 armed robberies committed in the city between April last year and March this year.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident, saying the firearm used to kill Sergeant Masava was recovered from the suspects.\n\nNational police spokesperson, Commissioner Paul Nyathi\n\nHe said detectives received information linking a Honda Fit vehicle, registration number AGG 8380, to the murder and a string of armed robberies. They tracked the vehicle, leading to the arrest of Mandlenkosi Albert Munangati, who subsequently implicated his accomplices. This resulted in further arrests and the recovery of five firearms.\n\nRecovered weapons included a Browning pistol, a Blow F92 blank pellet gun, a long rifle 12GA 76/3-inch long, a Vizor pistol, a shotgun and a sword.\n\nDuring the operation, two suspects attempted to flee, triggering a shootout with detectives along Harrow Street in Sauerstown. The suspects were shot and later pronounced dead upon arrival at the United Bulawayo Hospitals. (UBH).\n\nThe suspects allegedly committed a string of armed robberies, including a December heist at a supermarket in New Luveve suburb where cash and three cellphones were stolen.\n\nAnother robbery linked to the group took place at a funeral parlour in Bulawayos Kelvin North industrial area on February 10, during which US$3 608, R21 130 and a cellphone were stolen.\n\nThe suspects were also involved in a spate of armed robberies at service stations across Bulawayo. In one incident on March 2, at a service station at the corner of Nketa Drive and Rangemore Road, a shotgun and a cellphone were stolen, said Comm Nyathi.\n\nInvestigations have revealed that the gang primarily targeted service stations, liquor outlets, supermarkets, funeral parlours and gas operators.\n\nComm Nyathi commended members of the public for their assistance in providing crucial information that led to the arrestof the suspects.\n\nHe urged citizens to continue reporting any suspicious activities to the National Complaints Desk or any nearest police station.\n\nThe Zimbabwe Republic Police remains committed to fighting robbery syndicates and ensuring public safety, he said.\n\nBulawayo continues to grapple with escalating gun violence with the latest incident involving a Neighbourhood Watch Committee (NWC) member in Bulawayos Nketa suburb who escaped death by a whisker when one of the three armed men her confronted during a night patrol fired at him and missed.\n\nFuel service stations have also become prime targets and this has forced the service stations that used to open 24 hours to close around 8pm.\n\nEarlier this month, six armed robbers were gunned down by police detectives at a tollgate along the Bulawayo-Victoria Falls Road. The gang had earlier robbed a grocery store in Juba, Insuza, in Umguza District.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/11/Armed-robbers-2.jpg",
            "description": "Peter Matika, peter.matika@chronicel.co.zw  TWO suspected criminals, believed to be part of a gang that shot and killed a police officer in Bulawayo’s Sizinda suburb last week, were shot dead in a dramatic shootout with police officers. A third suspect was arrested and is now in police custody pending further investigations. The suspects reportedly engaged in a […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "BCC sinks US$600k into refuse compactors",
            "url": "https://www.chronicle.co.zw/bcc-sinks-us600k-into-refuse-compactors/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nBULAWAYO City Council (BCC) invested over US$600 000 in the acquisition of four refuse compactors, a move aimed at strengthening its refuse collection capacity and improving service delivery across the city.\n\nThe new additions bring the citys fleet of refuse compactors to 17, although the council requires 30 refuse trucks to adequately cover all areas, according to BCC Director of Health Services, Dr Edwin Mzingwane.\n\nSpeaking at the commissioning of the new compactors at the City Hall parking yesterday, Bulawayo mayor Councillor David Coltart said council management and councillors, emphasised the importance of responsible use of ratepayers money.\n\nI stand here this afternoon with a great deal of pleasure in commissioning these four trucks, which to some people might look like its a small number, but we need to understand that we are in the process of rebuilding the city which doesnt happen overnight, he said.\n\nWe will rebuild the city step by step and the commissioning of these refuse compactors is a significant step in my view.\n\nClr Coltart commended the council management for ensuring transparency and accountability in the use of public funds.\n\nIt is important for residents to see tangible results from the rates they pay. Their contributions are not being squandered on luxury personal vehicles but are being used to enhance service delivery, he said.\n\nClr Coltart said the refuse compactors will go a long way in improving refuse collection in the city.\n\nI want to congratulate the town clerk and his management team for ensuring proper use of rate payers money as evidenced by the purchase of these trucks, he said.\n\nColtart said each refuse compactor cost US$150 600 bringing the total expenditure to US$602 400.\n\nHe said while the investment was a positive step, more needs to be done to fully address the citys refuse collection challenges.\n\nClr Coltart thanked Dr Mzingwane, management and staff in the citys health services department for ensuring that the city is kept clean despite challenges emanating from a shortage of refuse collection vehicles.\n\nDr Mzingwane said council needs 30 refuse compactors to meet the demand of refuse collection across the city including the industrial areas.\n\nThe CBD on its own needs three refuse compactors working daily to keep the city centre clean while business premises need two trucks. The four trucks will bring the total number of refuse compactors to about 17, but some of the trucks are 10 or more years old, he said.\n\nDr Mzingwane said despite the new acquisitions, the council will continue working with private refuse collection companies.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fdsf.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw BULAWAYO City Council (BCC) invested over US$600  000 in the acquisition of four refuse compactors, a move aimed at strengthening its refuse collection capacity and improving service delivery across the city. The new additions bring the city’s fleet of refuse compactors to 17, although the council requires 30 refuse trucks to adequately cover […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "All set for Chief Dakamela Achievers Awards in Nkayi",
            "url": "https://www.chronicle.co.zw/all-set-for-chief-dakamela-achievers-awards-in-nkayi/",
            "content": "Langalakhe Mabena,Zimpapers Arts and Entertainment Hub\n\nChief Dakamela is ready to host the highly-anticipated traditional event, Imiklomela kaDakamela  also known as the Dakamela Achievers Awards  this weekend at koDakamela Hall in Nkayi District, Matabeleland North.\n\nThe awards honour individuals from Matabeleland who have made significant contributions to their communities, serving as pillars of inspiration. Now in their third edition, the awards are expected to be bigger than ever, with over 8 000 attendees anticipated at this grand cultural gathering.\n\nDignitaries from Zimbabwe and beyond, including royal families, cultural practitioners, government officials and prominent social figures, have confirmed their attendance.\n\nEstablished in 2022 by the Nkayi traditional leader, the event is more than just an awards ceremony; it is a celebration of identity and culture. The celebrations will kick off on Friday with a soccer tournament, featuring teams such as Dakamela Select, Bosso 90, Nkayi Academy and Nkayi United. This will set the stage for a musical gala in the evening, where over 30 artistes are expected to perform. The star-studded line-up includes South African Maskandi musician Putsununu, Platform One, Sikhosana Buhlungu, Indosakusa, Iyasa, Amaqaqa and Germany-based hip-hop queen Awa Khiwe.\n\nFrom his base in Nkayi, Chief Dakamela expressed excitement about hosting the event for the third time.\n\nWe launched these awards in 2022, initially targeting the Nkayi community. However, after the overwhelming response to our first edition in 2023, we saw the potential to expand and honour individuals who preserve our culture and excel in various fields.\n\nAs we speak, final preparations are underway, with representatives from different ministries and sponsors ensuring everything is in place. Were determined to make this edition the biggest and most successful yet, said Chief Dakamela.\n\nTo accommodate the influx of visitors, special travel arrangements have been made. A bus from Bulawayo to Nkayi will depart on April 3 and return on April 6, with tickets available at a set fee.\n\nFor those travelling from South Africa, Fast Jet has partnered with the awards to offer a discount on flights from Johannesburg to Bulawayo. Travellers from Harare to Bulawayo can also enjoy a discount on airfare, the chief said.\n\nCamping facilities will be available for attendees who wish to immerse themselves in the full outdoor experience. Additionally, through the Isiphala seNkosi initiative, traditional-modern hybrid houses have been built to accommodate visitors at a fee, with proceeds supporting vulnerable members of the Nkayi community.\n\nChief Dakamela also praised the government and local authorities for rehabilitating the Bulawayo-Nkayi road, which has long been a challenge for travellers.\n\nOne of the major concerns from past editions was the poor road infrastructure, which discouraged some attendees. This year, we worked closely with government officials and rural councils to ensure the roads are in better condition, making travel smoother for everyone, he said.\n\nThe Chief encouraged attendees to arrive early to fully enjoy the diverse cultural experience, which will include traditional music and dance, fashion shows, authentic traditional cuisine and inganekwane (folklore storytelling).\n\nThis is more than just an awards ceremony  its a celebration of who we are as a people. I encourage everyone to come and experience the rich cultural heritage of Matabeleland North, said Chief Dakamela.\n\nWith all preparations in place, Nkayi is ready to host one of the biggest cultural gatherings of the year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gtsdd.jpg",
            "description": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub Chief Dakamela is ready to host the highly-anticipated traditional event, Imiklomela kaDakamela – also known as the Dakamela Achievers Awards – this weekend at koDakamela Hall in Nkayi District, Matabeleland North. The awards honour individuals from Matabeleland who have made significant contributions to their communities, serving as pillars of […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "COMMENT: Spread ‘Not in My Village’ campaign to all provinces",
            "url": "https://www.chronicle.co.zw/comment-spread-not-in-my-village-campaign-to-all-provinces/",
            "content": "Statistics on adolescent girls being subjected to sexual violence released by the National Aids Council (Nac) recently are very disturbing.\n\nAccording to Nac 23 percent of adolescent girls aged between 15 and 19 have experienced sexual violence, 17 percent of the girls in the same age group have given birth while another 17 percent are pregnant with their first child. Nine percent of the girls have sexually transmitted infections (STIs).\n\nThe statistics also revealed that between 40 and 70 percent of the girls with disabilities experience sexual abuse upon reaching 18 years.\n\nThe HIV/Aids burden among young women is high as adolescent girls aged 15 to 19 have an HIV incidence rate 7,3 times higher than their male counterparts.\n\nGovernment in partnership with the United Nations Population Fund (UNFPA) responded to these worrying statistics by spearheading the Not in My Village campaign. The initiative is youth led and is being driven by the Young Peoples Network on Health and Wellbeing (YPNHW) in partnership with Nac.\n\nThe campaign was launched at Nzvimbo High School in Mazowe District, Mashonaland Central province last year and the campaign is now expanding to Matabeleland South, Manicaland, Mashonaland East and Mashonaland West provinces. The targeted districts are Insiza, Beitbridge, Murehwa, Goromonzi, Hurungwe, Chegutu, Mutare and Chipinge.\n\nWe want at this juncture to commend Government and its partners for their timely intervention meant to reverse this disturbing trend which is threatening the future of the Girl Child.\n\nIt is our hope that the campaign will not only empower the Girl Child to fight sexual violence such as rape, child marriages, HIV and STI infections but will also educate community leaders such as chiefs on the importance of protecting the Girl Child against all forms of sexual abuse.\n\nThe Government is directing a lot of resources towards empowering the youths but unfortunately many girls who are victims of sexual violence might not benefit.\n\nRecently Government availed US$17 million to jumpstart youths projects but girls who are child mothers as a result of child marriages or are pregnant, might not benefit.\n\nThe availed funding is supposed to benefit youths in agriculture, mining and those involved in other income generating projects.\n\nYouths including the girls should take a leading role in the building of the Zimbabwe we all want and as such communities should protect girls from sexual violence so that they play their role.\n\nNot in My Village campaign should therefore be spread to all provinces and districts to ensure girls are protected so that they realise their full potential as drivers of economic growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/01/sex-abuser.jpg",
            "description": "Statistics on adolescent girls being subjected to sexual violence released by the National Aids Council (Nac) recently are very disturbing.  According to Nac 23 percent of adolescent girls aged between 15 and 19 have experienced sexual violence, 17 percent of the girls in the same age group have given birth while another 17 percent are […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Pressure mounts on PSL giants",
            "url": "https://www.chronicle.co.zw/pressure-mounts-on-psl-giants/",
            "content": "Fungai Muderere,[emailprotected]\n\nTHE Castle Lager Premier Soccer League (PSL) heads into its fifth round this weekend, with teams jostling for early-season momentum in what promises to be an explosive set of fixtures. Defending champions, Simba Bhora will be desperate to bounce back from their first loss of the season, while Highlanders, CAPS United and Dynamos all face crucial tests in their respective matches.\n\nAfter suffering a painful 1-0 defeat at the hands of Dynamos, Simba Bhora return to Wadzanai Stadium to host a determined TelOne side. The reigning champions, guided by former Warriors and Highlanders attacking midfielder Joel Luphahla, have endured a mixed start to the season  managing just one win, two draws and one defeat, with a concerning goal difference of zero. They have accumulated five points from a possible 12, a modest 42 percent success rate that leaves fans and analysts questioning whether they can rediscover their championship form.\n\nBefore their clash with Dynamos, Simba Bhora had been the only team yet to concede a goal in the 2025 PSL season. However, that run ended with a costly defensive lapse, a moment Luphahla acknowledged as a turning point.\n\nYeah, this thing was hanging over our shoulders, admitted Luphahla. Maybe that built some pressure. Unfortunately, our goalkeeper conceded, and it was a soft goal. Mistakes happen. Somebody has to make a mistake for a game to be decided and unfortunately, it was us. It was our goalkeeper, after three clean sheets. Sometimes, its harder when youre unbeaten because that streak starts weighing on you.\n\nLloyd MaBlanyo Chigowe\n\nMeanwhile, Highlanders, fresh from a frustrating 1-1 draw against newcomers Scottland FC, embark on a gruelling journey to the Lowveld, where they face a struggling Triangle United at Gibbo Stadium. Luke Masomeres Triangle side finds itself rooted at the bottom of the table with zero points after four straight defeats, their latest setback coming in a 2-0 loss to Ngezi Platinum Stars.\n\nDespite their dismal start, Masomere, famously referred to as Doctor of Zimbabwean Football, remains optimistic.\n\nWe will soon get it right. Its only a matter of time; we are not panicking yet, he declared.\n\nElsewhere, Dynamos travel to Sakubva Stadium for a showdown with Manica Diamonds. The Glamour Boys, led by their in-form captain Emmanuel Jalai, have seen their confidence soar after last weeks victory over Simba Bhora. Jalai has been a standout performer, impressing not only in domestic action but also with the Warriors in Zimbabwes recent 2026 World Cup qualifiers against Benin (2-2) and Nigeria (1-1).\n\nKelvin Kaindu\n\nIn other Saturday fixtures, Chicken Inn, still searching for their first win of the season, will welcome Herentals College at Luveve Stadium while newboys MWOS take on ZPC Kariba at Baobab Stadium. Kwekwe United will battle former champions, FC Platinum at Bata Stadium, Greenfuel will host Yadah Stars at Greenfuel Arena and Scottland FC will go head-to-head with Bikita Minerals at Rufaro Stadium.\n\nSundays PSL action will see CAPS United entertaining high-flying Ngezi Platinum Stars at Rufaro Stadium. The biggest match of the day, however, will see Highlanders attempting to shake off their early inconsistencies against a desperate Triangle United.\n\nAs the battle for PSL supremacy heats up, Round Five presents a crucial moment for teams looking to solidify their credentials  or, for those faltering, a chance to hit the reset button before the season truly takes shape.\n\nPSL Week Five Fixtures\n\nSaturday\n\nManica Diamonds vs Dynamos (Sakubva Stadium)\n\nChicken Inn vs Herentals (Luveve Stadium)\n\nSimba Bhora vs TelOne (Wadzanayi Stadium)\n\nMWOS vs ZPC Kariba (Baobab Stadium)\n\nKwekwe United vs FC Platinum (Bata Stadium)\n\nGreenfuel vs Yadah (Greenfuel Arena)\n\nScottland FC vs Bikita Minerals (Rufaro Stadium)\n\nSunday\n\nTriangle United vs Highlanders (Gibbo Stadium)\n\nCAPS United vs Ngezi Platinum Stars (Rufaro Stadium)  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fgfdsdf.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw THE Castle Lager Premier Soccer League (PSL) heads into its fifth round this weekend, with teams jostling for early-season momentum in what promises to be an explosive set of fixtures. Defending champions, Simba Bhora will be desperate to bounce back from their first loss of the season, while Highlanders, CAPS United and Dynamos […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zimra aims for US$7bn tax revenue",
            "url": "https://www.chronicle.co.zw/zimra-aims-for-us7bn-tax-revenue/",
            "content": "Business Writer\n\nTHE Zimbabwe Revenue Authority (Zimra) is targeting to collect US$7,155 billion tax revenue this year, representing a 17 percent increase from the 2024 target.\n\nThe tax collector has devised bold measures to achieve the national revenue target.\n\nZimra is the Governments revenue collection agency mandated to assess, collect revenue, facilitate trade and travel, and enforce the payment of taxes, levies, royalties, and duties for the country.\n\nIn the 2025 National Budget, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube projected revenue collections at ZiG270,3 billion, equivalent to approximately US$7,5 billion.\n\nExpenditure for the period is forecast to be ZiG276,4 billion. To enhance revenue collection, Minister Ncube proposed several new tax categories to widen the tax base.\n\nSome of the tax measures included the review of the Special Economic Zone (SEZ) regimes, the introduction of a 10 percent withholding tax (WHT) on gross winnings of sports betting punters, the introduction of a fast-foods tax at a rate of 0,5 percent on the sales value, and the reintroduction of duty on selected medical products.\n\nZimra board chairman, Mr Anthony Mandiwanza, in a statement of the authoritys revenue performance report for the second half of 2024, said gross annual tax revenue amounted to ZiG110,50 billion, surpassing the set target of ZiG105,73 billion by 4,51 percent.\n\nThis, he said, reflected strong performance across key revenue streams, indicating an effective tax collection strategy and improved compliance.\n\nHe said the projected revenues for 2025 would be supported by various revenue-enhancement measures, including improved tax compliance through improved enforcement, expanded digital platforms, and enhanced administrative efficiencies within Zimra.\n\nKey to achieving this target will be the successful implementation of policy interventions aimed at broadening the tax base and reducing evasion.\n\nWhile external factors like global economic conditions and commodity price fluctuations pose challenges, the combination of strategic reforms, technological advancements, and ongoing institutional improvements provides a strong foundation for meeting the revenue target and fostering economic growth, he said.\n\nMr Mandiwanza said that during the second-half of 2024, the authority successfully exceeded both its quarterly and annual revenue targets, a direct result of the improvements brought about by digitalisation.\n\nHe said the positive impact of the initiatives was expected to ensure sustainable benefits well into the future.\n\nThe digitalisation drive implemented by Zimra has delivered remarkable results, ushering in six transformative projects that have significantly elevated the tax administration process to new heights.\n\nThese projects have not only streamlined internal operations but also enhanced the overall efficiency and effectiveness of tax collection, positioning Zimra as a leader in modernising tax administration, he said.\n\nMoreover, Mr Mandiwanza said the taxpayer experience had greatly improved, with a substantial portion of services now automated, providing clients with faster, more convenient access to services and reducing processing times.\n\nThis shift towards automation has also enhanced transparency and compliance, fostering a more user-friendly environment, he said.\n\nAccording to the report, the total net revenue for the second half of 2024 reached ZiG69,22 billion, surpassing the target of ZiG64,60 billion by a variance of 7,15 percent, reflecting the effectiveness of the tax collectors revenue generation strategies, supported by the stabilisation of the exchange rate, which created a more predictable economic environment.\n\nThis stability provided businesses with the confidence to plan for the short to medium term. A new policy streamlining exemptions and zero-rated goods also boosted VAT on local sales, surpassing its target by 88 percent.\n\nThis was further complemented by the onboarding of VAT taxpayers to the newly introduced Fiscalisation Data Management System (FDMS), which enhances real-time data sharing with taxpayers, said Mr Mandiwanza.\n\nHe noted that the growth of digital money transfer platforms further enhanced revenue, with the Intermediated Money Transfer Tax (IMTT) showing remarkable performance in the second-half of the year.\n\nZimra said its efforts to combat transit fraud were also successful in restoring order and improving compliance with regulations.\n\nThe authority also indicated that while Excise Duty revenue fell short of expectations, the introduction of fiscalisation for fuel stations, as outlined in the 2024 Mid-Term Budget Statement, is expected to drive future improvements in compliance and revenue collection.\n\nThese initiatives, combined with the authoritys ongoing focus on innovation and process enhancement, position Zimra for continued success and sustainable revenue growth in the years ahead.\n\nAccording to the report, the tax authority is owed by both private companies and public institutions, including state enterprises and parastatals.\n\nNotably, Mr Mandiwanza said 80 percent of the outstanding debt stemmed from new assessments resulting from thorough audits and investigations, reflecting the authoritys proactive approach to identifying and addressing potential discrepancies.\n\nThe remaining 20 percent represents uncollected current obligations not honoured, and the authority is actively implementing a range of strategies to ensure the timely collection of taxes owed by clients.\n\nThese efforts are helping to support the authoritys ongoing mission of enhancing fiscal responsibility, he said.\n\nHe noted that the proportion of refunds decreased from 3,69 percent in the first-half of 2024 to 2,81 percent in the second-half, due to policy measures that shifted most products from zero-rated status to either standard VAT rates or exemptions.\n\nMr Mandiwanza said ongoing improvements in border management had significantly enhanced trade facilitation, with system upgrades designed to expedite processing times and enhance seamless integration for efficient information sharing and verifications.\n\nHe said the expansion of the single window project had played a key role in streamlining the operations of agents at border points, contributing to smoother trade flows.\n\nAdditionally, the increased use of drone surveillance has further strengthened border monitoring, ensuring greater security and efficiency in the movement of goods.\n\nThese initiatives reflect the Authoritys commitment to modernising operations and fostering a more effective and efficient trade environment, he said.\n\nMr Mandiwanza said Zimra also made significant strides in systems development with the successful launch of the electronic tariff, TaRMS (Tax and Revenue Management System), ASYCUDA (Automated System for Customs Data) upgrade and fiscalisation projects, which have provided secure and effective systems for managing domestic revenue.\n\nHe noted that in its quest to enhance the standardisation of processes and procedures, the authority has embarked on the ISO 9001:2015 certification journey, aiming to improve the quality of service to all stakeholders.\n\nHe highlighted that the construction of staff accommodation at various stations like Chirundu and Maitengwe border posts has gained momentum, with the expectation that these projects will be completed by 2025.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/05/Anthony-Mandiwanza.jpg",
            "description": "Business Writer THE Zimbabwe Revenue Authority (Zimra) is targeting to collect US$7,155 billion tax revenue this year, representing a 17 percent increase from the 2024 target. The tax collector has devised bold measures to achieve the national revenue target. Zimra is the Government’s revenue collection agency mandated to assess, collect revenue, facilitate trade and travel, […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "President sets empowerment record",
            "url": "https://www.chronicle.co.zw/president-sets-empowerment-record/",
            "content": "Theseus Shambare,Harare Bureau\n\nPresident Mnangagwa has handed over 72 tractors and 10 combine harvesters sourced from Belarus with a combined value of US$7,4 million to youths to boost their participation in agriculture.\n\nHe also announced a complementary initiative worth US$10 million to set up irrigation systems for Youth Business Units, as he delivers on his promise to facilitate young peoples participation in the economy. At the handover ceremony, which took place at the Agricultural Mechanisation Facility in Hatcliffe, Harare, yesterday, President Mnangagwa pledged to pay 50 percent of the total cost for the cutting-edge equipment from his own pocket.\n\nThe latest initiative is a follow up to the Presidential Youth Empowerment Revolving Fund which was launched by the President at the Harare International Conference Centre. The Government is buying tractors from Belarus to resell to farmers under flexible financing terms through Empower Bank.\n\nThe programme also comes with a three-year repayment period, no collateral and an interest rate of 7,5 percent per annum. For the Youth Mechanisation Facility, the President is paying US$3,7 million from his own pocket and youths will pay the balance.\n\nFarmers accessing the facility will receive heavy-duty tractors, including the 81, 107, 130 and 155 horsepower models.\n\nOverall, this year, the country will take delivery of 800 units of advanced farm equipment from Belarus, including over 700 tractors. Officiating at the event yesterday, Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka said the equipment is intended to be distributed among youth business clusters as part of the Governments broader strategy to modernise agriculture and create employment opportunities for young people.\n\nI appreciate and know the role of mechanisation as an enabler of agricultural modernisation, and accelerating agricultural transformation.\n\nIt is in this regard that today we gather here to formally hand over 72 tractors and two of 10 combine harvesters availed by the President, His Excellency Dr ED Mnangagwa, to accelerate the transformation of the agricultural space, said Dr Masuka.\n\nPresident Mnangagwa\n\nHe outlined the potential impact of the equipment.\n\nWith 72 tractors, you can till on average, we say, one horsepower per one hectare . . . so, 72 tractors are able to do 7 700 hectares.\n\nSo, it is an additional area that we want tilled for agriculture starting this winter and more importantly going into summer, Dr Masuka said.\n\nHe further projected that the initiative could yield substantial returns.\n\nAnd once this area has been tilled, my expectation is that being youth, your average yield will be nowhere near or less than five tonnes per hectare and with two crops a year, it means that these tractors will enable 77 000 metric tonnes of grain to be delivered to the Grain Marketing Board and other marketers. My expectation therefore is that the value addition as a result of this intervention will be US$26 million, Dr Masuka said.\n\nThe minister stressed the importance of accountability and proper utilisation of the equipment.\n\nThese tractors ought to be used for the specified purpose. The President said these are not charitable gifts. These go into defined youth business clusters through the right channels of a business. Long gone are the days where government used to distribute tractors and there was no accountability.\n\nThe US$10 million irrigation support, he said, is channelled through the Agricultural Finance Corporation (AFC), and seeks to complement the recent distribution of farm equipment and boost youth participation in agriculture.\n\nYesterday (Tuesday) evening, we had a discussion with the President regarding the US$10 million for irrigation support for youths to complement these efforts and that money is now going to be available through AFC and we will be making an announcement shortly.\n\nWe also hope that Empower Bank will be able to participate so that in addition to getting the tractors, they are now also able to get accelerated irrigation development assistance, said Dr Masuka.\n\nThe irrigation funds, he said, are intended to provide young farmers with the necessary resources to implement efficient and sustainable farming practices, particularly in light of climate change and fluctuating rainfall patterns.\n\nYouth Empowerment Development and Vocational Training Minister Tino Machakaire expressed gratitude for the Presidents initiative and emphasised that the equipment should be used specifically for agriculture.\n\nThis equipment must benefit the youths and the nation at large through agriculture production as we strive to achieve food security, said Minister Machakaire.\n\nDr Anxious Masuka\n\nReceiving the equipment, provincial youths representatives thanked the President for fulfilling his pledge.\n\nAfrican National Congress party of South Africa Youth League president, Cde Thlologelo Collen Malatji, witnessed the handover ceremony.\n\nHe described the initiative as a milestone in capacitating young people.\n\nWe expect other leaders to take a leaf from President Mnangagwas generosity in investing in future leaders. An empowered youth will be able to protect and safeguard the countrys interests without being compromised by national detractors, he said.\n\nZanu PF National Youth League Secretary General Cde Tendai Chiwetu said youths are grateful to President Mnangagwa for the empowerment initiative.\n\nWe have never seen this type of empowerment before. As the Youth League, we look forward to the sustainability of the project. I would also want to thank the leadership of Minister Machakaire for ensuring no one and no place is left behind as the President always says, he said.\n\nHarare Province Zanu-PF Youth Chairman Cde Emmanuel Mahachi said the empowerment initiative is responsive to the calls made by young people for empowerment.\n\nYouths make up over 60 percent of the national population and it will not be ideal to ignore such an important demographic on issues to do with food security and economic empowerment, he said.\n\nMatabeleland South Zanu-PF provincial youth chairman Cde Moses Langa said the equipment will go a long way in ensuring the province boosts livestock production.\n\nWe require tractors in our livestock production and these modern tractors are a key input. Indeed, we will utilise them for the betterment of the sector, he said.\n\nZanu-PF Mashonaland West provincial secretary for legal affairs Cde Decide Mananzva said the province will ensure that only youths in agriculture will benefit.\n\nAs we have promised the President before, for accountability purposes, we will ensure that only those who are active in agriculture benefit. This is not mining equipment but agriculture, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/daads.jpg",
            "description": "Theseus Shambare, Harare Bureau  President Mnangagwa has handed over 72 tractors and 10 combine harvesters sourced from Belarus with a combined value of US$7,4 million to youths to boost their participation in agriculture. He also announced a complementary initiative worth US$10 million to set up irrigation systems for Youth Business Units, as he delivers on his […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        },
        {
            "title": "How Rhodesian prisons became symbols of oppression & arenas of resistance",
            "url": "https://www.chronicle.co.zw/how-rhodesian-prisons-became-symbols-of-oppression-arenas-of-resistance/",
            "content": "Gibson Mhaka,Zimpapers Politics Hub\n\nALTHOUGH the walls of Khami Remand Prison, west of Bulawayo, convey an illusion of isolation and separation from the wider community, and visits are usually marked by a solemnity born from the detention of those awaiting trial, Cell 44 in B Hall offers a contrasting experience.\n\nDespite the surrounding atmosphere, this cell resonates with historical weight, having served as a site of imprisonment, banishment and isolation, notably for political activists during the colonial period.\n\nInitially, Ian Smiths colonial regime used this cell to detain both convicted criminals and political prisoners.\n\nIt was here that President Mnangagwa, now Zimbabwes first citizen, endured 10 years of detention as a teenager.\n\nPresident Mnangagwa\n\nHe was 18 years old when he was imprisoned for contravening Section 37(1)(b) of the notorious Law and Order Maintenance Act.\n\nHis prison number was 841/66, and he was bundled into Cell 44 of B Hall.\n\nThis period of imprisonment is said to have played a significant role in shaping his political views and his eventual rise to power.\n\nPresident Mnangagwas imprisonment, along with that of many other brave individuals, transformed the cell into a symbol of resistance and hope.\n\nThis very cell, once a place of solitary confinement for political activists during the colonial era, now stands as a symbol of the relentless fight against oppression and the quest for freedom.\n\nIts history serves as a stark reminder of the injustices of the Smith regime and the resilience of those who dared to challenge it.\n\nAs Zimbabwe celebrates 45 years of independence, its important to note that during the liberation struggle, Khami Prison, like other colonial prisons  such as Whawha, Chikurubi and Harare Maximum prisons  symbolised the oppressive nature of the Rhodesian regime. Prisons served as significant sites of Zimbabwes liberation struggle.\n\nVice-President Kembo Mohadi, Cde Moffat Hadebe, Cde Xaviers Muchemwa and Cde John Maluzo are among the surviving former political prisoners who were detained at Khami Prison.\n\nThese former liberation war detainees recounted experiencing horrors such as excessive hard labour, torture, general ill-treatment, hunger and persistent disease outbreaks during their time at Khami.\n\nAs the nation prepares to celebrate Independence Day in the Midlands Provinces Gokwe District, it is crucial to acknowledge the broader historical context of Zimbabwes liberation struggle.\n\nBeyond Khami Prison, another significant yet often overlooked site stands as a testament to the eras oppressive nature. Whawha Prison, a colonial-era institution, played a pivotal role in the struggle, mirroring the experiences of detainees at Khami.\n\nJust as Khami Prison served as a symbol of Rhodesian repression, Whawha Prison became a key site of detention and political struggle during the liberation war.\n\nKhami Prison\n\nMany nationalist leaders and activists were imprisoned there, including the late former President, Robert Mugabe.\n\nThe late Cde Ruth Chinamano and her late husband were imprisoned at Whawha Prison, where they remained until 1970.\n\nUpon their release, they were confined to an eight-kilometre radius restriction before being re-arrested and subsequently released in 1974.\n\nAdditionally, the late nationalist and liberation stalwart Cde Jane Lungile Ngwenya, was also a notable political prisoner incarcerated at Whawha. From 1964 to 1971, she and other top Zapu leaders were detained at Whawha Prison.\n\nInitially, the prisoners refused to take up studies while incarcerated. However, the Red Cross Society persuaded them, advising that as future leaders of a free Zimbabwe, they required the necessary education.\n\nConsequently, Cde Ngwenya and many of her comrades enrolled in various courses.\n\nCde Ngwenya herself pursued studies in Social Sciences and Administration. Their Zapu group at Whawha functioned as a government-in-waiting, maintaining party structures and practicing good governance within the prison.\n\nThey would receive the latest information from relatives visiting them in prison, which enabled them to develop strategic plans that were approved by the relevant party structures within the prison walls.\n\nThis highlights that Whawha Prison, like many others during the Rhodesian era, stood as a stark symbol of the regimes oppressive nature.\n\nIts walls held not only individuals but also the stories of countless struggles against colonial injustice.\n\nThis reinforces the understanding that prisons throughout Zimbabwe, including Whawha, Khami, Chikurubi and Harare Maximum, were not merely places of confinement but critical arenas of resistance and struggle for the nations freedom.\n\nIn his paper titled Suffering for the Nation: The Prison as a Site of Struggle during Zimbabwes Liberation War, author Munyaradzi B Munochiveyi, posited that although Rhodesian prisons were spaces of racialised abuse, curtailed freedoms and heightened repression, they were also spaces of struggle, subversion and negotiation.\n\nPrisoners told stories of how they struggled, coped and creatively adapted to the harsh prison regimes.\n\nPolitical prisoners are important historical subjects in the telling of the struggle for liberation in Zimbabwe  prisoners life stories and writings demonstrate how political prisoners confronted the colonial regime.\n\nAs political prisoners, they were important symbols of the struggle for liberation and were also producers of powerful critiques of the colonial regime through their writings.\n\nThe prison has long functioned in Zimbabwes official post-colonial history as a symbolic, ideologised, and often politicised mnemonic of colonial injustice.\n\nBy describing the Rhodesian prison as a terrain of struggle, we mean that the prison was doubly a space of repression and subversion, and that political prisoners were capable of challenging and negotiating their incarceration, noted Munochiveyi.\n\nMunochiveyi further noted that although Rhodesian prisons were centres of brutality, political detainees were not passive recipients of state penal terror.\n\nInstead, they actively negotiated, challenged, and subverted oppressive penal regulations.\n\nMunochiveyi further noted that although the Rhodesian prisons were centres of brutality, political detainees were not passive recipients of state penal terror as they actively negotiated, challenged, and subverted oppressive penal regulations. Based on Munochiveyis observation, it is clear that as political hostages of the Rhodesian regime, detainees played a crucial role in dismantling colonial rule.\n\nThey produced powerful critiques of the regime from within prison confines and served as symbols of African resistance. In fact, prisons became battlefields in their own right.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/qf-680x380.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub ALTHOUGH the walls of Khami Remand Prison, west of Bulawayo, convey an illusion of isolation and separation from the wider community, and visits are usually marked by a solemnity born from the detention of those awaiting trial, Cell 44 in “B” Hall offers a contrasting experience. Despite the surrounding atmosphere, this […]",
            "time": "08:43",
            "date": "03 Apr 2025"
        }
    ]
}