{
    "news": [
        {
            "title": "Man lies indentified at Filabusi District Hospital Mortuary",
            "url": "https://www.chronicle.co.zw/man-lies-indentified-at-filabusi-district-hospital-mortuary/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nPolice in Matabeleland South have called on members of the public to help identify the body of an unknown male adult, which has been housed at Filabusi District Hospital Mortuary for over six months.\n\nActing provincial police spokesperson, Assistant Inspector Stanford Mguni, said the mans body was found at Mthwakazi Business Centre. He said the man is suspected to be in his early 20s.\n\nWe have a case of a missing person where the body of a man, who is suspected to be approximately 20 years old, is housed at the Filabusi District Hospital Mortuary. The man was found lying unconscious on 5 June 2024 outside Sigidi Butchery at Mthwakazi Business Centre in Filabusi.\n\nHe was pronounced dead upon arrival at Filabusi District Hospital. Investigations have revealed that the man got into a fight with two unidentified men, who then attacked him. The man was wearing maroon chino trousers, a gold t-shirt, and a striped jacket, he said.\n\nAsst Insp Mguni urged members of the public with information that could assist in identifying the body to contact Constable Nyoni on 0712 599 306/084 282 4254 or to visit the nearest police station.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2017/08/mortuary.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw Police in Matabeleland South have called on members of the public to help identify the body of an unknown male adult, which has been housed at Filabusi District Hospital Mortuary for over six months. Acting provincial police spokesperson, Assistant Inspector Stanford Mguni, said the man’s body was found at Mthwakazi Business Centre. He […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "Four men arrested for smuggling dagga into Zimbabwe",
            "url": "https://www.chronicle.co.zw/four-men-arrested-for-smuggling-dagga-into-zimbabwe/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nFour men have been arrested after being found in possession of dagga, which they are suspected to have smuggled into the country through the Beitbridge Border Post.\n\nMatabeleland South acting provincial police spokesperson, Assistant Inspector Stanford Mguni, said the gang was found in possession of 34kg of dagga with a street value of about US$3,500.\n\nThe suspects are Shupikai Maruta (45), Rina Zvokureva (53), Branham Nyamandu (32) from Bindura, and Anthony Mauchi (53) from Gutu.\n\nI can confirm that we have arrested four men who were found in possession of dagga. The men were seen at Beitbridge Total Service Station on 1 January while looking for transport. They were approached by police who requested to search their bags. The accused persons were found in possession of a total of 34kg of dagga, which has a street value of R3,466.\n\nThe suspects are believed to have smuggled the dagga into the country with the help of anumalaitsha. We will continue with our operation to fight smuggling, he said.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/dagga.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw Four men have been arrested after being found in possession of dagga, which they are suspected to have smuggled into the country through the Beitbridge Border Post. Matabeleland South acting provincial police spokesperson, Assistant Inspector Stanford Mguni, said the gang was found in possession of 34kg of dagga with a street value of […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "42-year old woman steals from money club",
            "url": "https://www.chronicle.co.zw/42-year-old-woman-steals-from-money-club/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 42-YEAR-OLD Bulawayo woman has been ordered to perform 70 hours of community service for stealing US$723 and ZAR6 040 entrusted to her by a social club.\n\nMolly Ngorima of Entumbane Suburb, who had been responsible for managing funds for the Phakamani Social Club, was convicted on her own plea of guilty to the theft by Western Commonage magistrate, Mr Mehluli Moyo, on Wednesday.\n\nNgorima was sentenced to 14 months imprisonment of which six months were suspended for five years on condition that she does not commit a similar offence within that period.\n\nAn additional two months were suspended on condition that Ngorima performs 70 hours of community service at ZRP Entumbane.\n\nThe remaining six months were suspended on condition that she restitutes the full amount of US$723 and ZAR6 040 to the complainant.\n\nIn passing sentence, Mr Moyo noted that Ngorima was a first-time offender and had pleaded guilty, saving the court time. However, she emphasized that cases involving dishonesty were on the rise and that the law must send a clear message to potential offenders.\n\nProsecutor, Mrs Ellen Matenga said Ngorima was entrusted with the money by the Phakamani Social Club, and as the clubs treasurer, she was responsible for safe keeping of the clubs money.\n\nBetween July and November 2024, Ngorima was given a total of US$1 036 and ZAR9 390 to keep.\n\nInstead of fulfilling her duty, she converted the money to her personal use.\n\nMrs Matenga said Ngorima was supposed to handover the money on behalf of the club in December last year. Instead Ngorima failed to account for the money upon demand.\n\nOnly US$313 and ZAR 3 350 was recovered.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gavel.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 42-YEAR-OLD Bulawayo woman has been ordered to perform 70 hours of community service for stealing US$723 and ZAR6 040 entrusted to her by a social club. Molly Ngorima of Entumbane Suburb, who had been responsible for managing funds for the Phakamani Social Club, was convicted on her own plea of guilty to […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "22-year-old dragged to court for stealing Ford Ranger worth US$22 000",
            "url": "https://www.chronicle.co.zw/22-year-old-dragged-to-court-for-stealing-ford-ranger-worth-us22-000/",
            "content": "Trish Mukwazo,[emailprotected]\n\nA 22-year-old man has been arraigned before the courts on charges of stealing a Ford Ranger valued at US$22 000.\n\nRespect Khumalo appeared before Bulawayo Regional magistrate Mrs Dambudzo Malunga on Wednesday and was remanded to February 26.\n\nProsecuting, Mr Owen Mugari said on November 20 at around 9 PM Mr Jabulani Sibanda parked his white Ford Ranger double cab outside Chigumira Shopping Centre in Luveve suburb where he was approached by Khumalo and two other accomplices, Precautious Moyo and Litsha Moyo who are at large and were armed with guns.\n\nThe trio ordered Mr Sibanda to disembark from his car and he complied. The three fled with his car in high speed said Mr Mugari.\n\nThe court heard that Mr Sibanda not only lost his car but his two cellphones that were inside the car, a Techno and Nokia cellphone valued at US$200.\n\nMr Sibanda reported the matter to Luveve Police Station.\n\nInvestigations carried out led to Khumalos arrest and the recovery of the car, said Mr Mugari.\n\nMr Mugari said only the car recovered by police and the phones are still missing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com A 22-year-old man has been arraigned before the courts on charges of stealing a Ford Ranger valued at US$22 000. Respect Khumalo appeared before Bulawayo Regional magistrate Mrs Dambudzo Malunga on Wednesday and was remanded to February 26. Prosecuting, Mr Owen Mugari said on November 20 at around 9 PM Mr Jabulani Sibanda […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "Man sentenced to 15 months in prison for theft, abusing younger sister",
            "url": "https://www.chronicle.co.zw/man-sentenced-to-15-months-in-prison-for-theft-abusing-younger-sister/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 25-YEAR-OLD Bulawayo man has been ordered to perform 210 hours of community service for theft and physically abusing his younger sister.Lovemore Dube, who resides in Nkulumane, was convicted on his own plea of guilty to physical abuse and theft by Western Commonage magistrate Mr Mehluli Moyo.Dube was sentenced to 15 months in prison, of which nine months were suspended for five years on condition he does not commit a similar offence within that period.\n\nThe remaining six months were suspended on condition that Dube performs 210 hours of community service at Mgombane Primary School.\n\nIn passing the sentence, the magistrate took into account of Dubes age. Mr Moyo, however, stressed the importance of deterrent measures to combat the rising trend of physical abuse and theft.\n\nPhysical abuse is becoming a common issue, and it is essential to send a strong message to prevent further occurrences. The implications extend beyond the individual offender, potentially affecting the relationship between the two, he said.\n\nThe magistrate further explained that the sentence was intended to deter both Dube and others from engaging in violent and theft offences, reinforcing the legal consequences of such actions. He noted that the court aimed to send a clear message that abuse will not be tolerated in the community.\n\nProsecuting, Mrs Ellen Matenga, told the court that the physical abuse incident happened on 22 January at around 7am when Dube started to assault Miss Yolanda Dube (21) who is his sister for no apparent reason.\n\nDube came home that morning and Ms Dube was sitting outside where they stayed together. He became violent for no apparent reason and threatened to kill her, she said.\n\nDube then allegedly went to the gate and took the chain that was on the gate and used it to strangle his sister.\n\nTestifying in court Ms Dube told the court that she was sitting outside when her brother came from wherever he was.\n\nWithout even greeting me he started to threaten me saying that he will kill me. He then went to the gate and took a chain that was there and strangled me with it. I did not sustain any injuries, she said.\n\nOn the other count the court heard that Dube stole his sisters property and sold it.\n\nOn the day in question Ms Dube left the house after a misunderstanding with her brother. She came back after a few days and found her property stolen, said Mrs Matenga.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/10/jail-brreak.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 25-YEAR-OLD Bulawayo man has been ordered to perform 210 hours of community service for theft and physically abusing his younger sister. Lovemore Dube, who resides in Nkulumane, was convicted on his own plea of guilty to physical abuse and theft by Western Commonage magistrate Mr Mehluli Moyo. Dube was sentenced to 15 […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "Econet says its services are fully restored after brief hiatus",
            "url": "https://www.chronicle.co.zw/econet-says-its-services-are-fully-restored-after-brief-hiatus/",
            "content": "Business Writer\n\nLEADING telecoms giant, Econet Wireless Zimbabwe says it has resolved network challenges that caused some of its customers to be unable to make calls, use some mobile data services or transact using\n\nEcoCash between 2pm and 3:30pm on Wednesday.\n\nWe experienced some issues on the platforms that enable our subscribers to make calls, use data or carry out EcoCash transactions, resulting in some of our customers being unable to use the services for about an hour and half, starting around 2pm to 3:30pm today (February 5, 2025), said the company in a brief statement.\n\nWe are pleased to advise that the challenges have since been successfully resolved, and all services have been fully restored.\n\nWe sincerely apologise for the inconvenience this may have caused our valued customers, said the company.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/econet-logo.jpg",
            "description": "Business Writer LEADING telecoms giant, Econet Wireless Zimbabwe says it has resolved network challenges that caused some of its customers to be unable to make calls, use some mobile data services or transact using EcoCash between 2pm and 3:30pm on Wednesday. “We experienced some issues on the platforms that enable our subscribers to make calls, […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "Zim captain on Test glory hunt",
            "url": "https://www.chronicle.co.zw/zim-captain-on-test-glory-hunt/",
            "content": "Brandon Moyo,[emailprotected]ZIMBABWE are hopeful of a change of fortunes when they face Ireland in a one-off Test match at Queens Sports Club today.Chevrons captain Craig Ervine yesterday said they have hopes of having picked up some lessons from their series against Afghanistan last month.The visitors beat Zimbabwe 1-0 in a two-match Test series at Queens Sports Club last month.They return to the same venue as they seek to register their first ever Test match win against Ireland. The two sides have only played red-ball cricket against each other once with Ireland emerging victorious last year.For Ervine, the wicket prepared for this match is different to the one used against Afghanistan but believes that discipline will be key with the ball and with the bat, they need to work hard and try to convert the 50s to centuries.For us as a batting unit its about working hard to get yourself in and once you do get in, you need to go really big and make sure that counts. In Test cricket, 50s and 60s dont necessarily put you in good positions but like Afghanistan, getting 172s, 230 odd, those are the scores that really put you in good positions, said Ervine.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/xc.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com ZIMBABWE are hopeful of a change of fortunes when they face Ireland in a one-off Test match at Queens Sports Club today. Chevrons captain Craig Ervine yesterday said they have hopes of having picked up some lessons from their series against Afghanistan last month. The visitors beat Zimbabwe 1-0 in a two-match […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "13 injured in an accident, driver and conductor on the run",
            "url": "https://www.chronicle.co.zw/13-injured-in-an-accident-driver-and-conductor-on-the-run/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\n13 PASSENGERS were injured in a bus accident which occurred at the 26 kilometre peg along Kadoma-Sanyati Road.\n\nA Nehoreka bus with 51 passengers on Board overturned and landed on its left side\n\nIn a statement on X, Police said the bus driver and the conductor fled from the scene. The injured victims were admitted at Kadoma General Hospital.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-58.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com 13 PASSENGERS  were injured in a bus accident which occurred at the 26 kilometre peg along Kadoma-Sanyati Road. A Nehoreka bus with 51 passengers on Board overturned and landed on its left side In a statement on X, Police said the bus driver and the conductor fled from the scene. The injured […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "President Mnangagwa calls for unity, accountability and grassroots development in push towards Vision 2030",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-calls-for-unity-accountability-and-grassroots-development-in-push-towards-vision-2030/",
            "content": "Online Reporter\n\nPRESIDENT Mnangagwa has issued a rallying call for unity, accountability, and accelerated grassroots development as Zimbabwe marches towards its Vision 2030 goal of becoming a prosperous upper-middle-income economy.\n\nSpeaking at a high-level meeting with Provincial Ministers and government officials at State House in Harare, the President emphasised the critical role of the Devolution and Decentralisation Policy in driving equitable development and improving the quality of life for all citizens.\n\nThe main focus remains centred at the grassroots level. This meeting gives us the opportunity to take stock of the progress made under the Devolution and Decentralisation Policy, which is a critical cog of the 2nd Republic, said President Mnangagwa.\n\nMASHONALAND WESTHon. Marian Chombo Minister of State for Provincial Affairs and Devolution\n\nHe highlighted the commendable strides made in upgrading livelihoods but stressed the need for increased momentum in achieving national goals.\n\nThe President warned against complacency, stating: Dragging of feet and fancy seating are not acceptable dispositions under my watch. Increased momentum towards achieving our goals requires leaders who are dedicated. Decide to be counted as those carrying these traits.\n\nPresident Mnangagwa underscored the importance of unity and a people-centred approach, urging leaders to remain grounded in their responsibilities.Let us never forget where we come from. Always have a heart for the people. The policy of Devolution and Decentralisation is a beacon for national unity and equitable development, he said.\n\nBULAWAYO METROPOLITANHon. Judith Ncube Minister of State for Provincial Affairs and Devolution\n\nThe President directed Provincial Ministers to align their administrations with the national vision, ensuring that communities remain vibrant and hopeful.\n\nYou must fully play your part in advancing the industrialisation of our communities. Lead from the front in championing people-driven development programs, leaving no one behind, he said.\n\nThe President also emphasised the need for a positive work ethic and timely reporting.\n\nPositive work ethics must be sustained as we march towards Vision 2030. You must submit comprehensive and timely reports, both ad hoc and routine. Non-attendance to Cabinet Committee meetings is unacceptable, he said.\n\nMATABELELAND NORTHHon. Richard Moyo Minister of State for Provincial Affairs and Devolution.\n\nPresident Mnangagwa called for greater focus on implementing the National Development Strategy 2 (NDS2), particularly in building modern, sustainable economies at the subnational level.\n\nOur country is endowed with God-given natural resources. Through you, our communities must remain good custodians of these resources. Shun machinations that seek to reverse the 2nd Republics achievements, he said.\n\nHe urged Ministers to collaborate with traditional leaders and party structures in implementing government development programs, reiterating the mantra, Nyika inovakwa nevene vayo (A nation is built by its own people).\n\nMIDLANDSHon. Owen Ncube Minister of State for Provincial Affairs and Devolution\n\nPresident Mnangagwa called for unity of purpose and dedication.\n\nI urge Ministers to remain duty-bound and committed to our national interest and development aspirations. Unity of purpose and dedication in the implementation of government programs must be a key priority area. Preach unity and peace in your provinces, he said.\n\nPresident Mnangagwa urged Provincial Ministers to champion economic development programs and ensure that no community is left behind in the journey towards Vision 2030.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-05-at-11.56.49-2-680x380.jpeg",
            "description": "Online Reporter  PRESIDENT Mnangagwa has issued a rallying call for unity, accountability, and accelerated grassroots development as Zimbabwe marches towards its Vision 2030 goal of becoming a prosperous upper-middle-income economy. Speaking at a high-level meeting with Provincial Ministers and government officials at State House in Harare, the President emphasised the critical role of the Devolution […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        },
        {
            "title": "BCC Reduces Shop Licence Fees, Sports and Social Clubs Rates by 30 Percent",
            "url": "https://www.chronicle.co.zw/bcc-reduces-shop-licence-fees-sports-and-social-clubs-rates-by-30-percent/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHE Bulawayo City Council (BCC) has reduced business shop licence fees and sports and social clubs rates by 30 percent, while all other charges outlined in the initial 2025 budget remain unchanged.\n\nAccording to minutes from a special council meeting held last week, finance director Mr Tennyson Mpunzi reported that shop licensing tariffs were last gazetted under Statutory Instrument 7 of 2020, dated 17 January 2020, based on the 2019 budget.\n\nHowever, the 2019 tariffs were gazetted a year later, by which time they had already been overtaken by changes in economic conditions.\n\nMr Mpunzi said when tariffs were indexed to the US dollar in May 2022, the gazetted 2020 tariff for the smallest shop was equivalent to US$1.09.\n\nAn administration fee introduced in October 2021 increased the total fee for the lowest shop licence to US$238.11. He noted that at the time of preparing and approving the budget, the 2019 tariffs were in US dollars, as the multi-currency system was still in operation.\n\nFollowing an outcry over the level of tariffs charged from July 2022, it was proposed that the current USD tariffs be reviewed downwards, using the gazetted 2019 tariffs (USD) as the baseline. An increase of 51 percent on the 2019 tariffs (i.e., on the US$110.76) was expected to cover the increases in the cost of providing the service since 2019 to date. This would reduce the lowest shop licence fee by 30 percent, from US$238.11 to US$167.01, said Mr Mpunzi.\n\nHe added that the council had also considered residents concerns over the proposed cemetery and community facility fees for 2025.\n\nThe 2025 proposed budget reverted its proposed tariffs for cemetery and community facility fees to the gazetted tariffs, thereby lowering the cost of burial.\n\nIt was recommended that (i) business licence fees for 2025 be reduced by 30 percent, (ii) sports and social clubs property rates be reduced by 30 percent, while the rest of the proposed tariffs and charges for 2025 remain unchanged as proposed in the 2025 budget, said Mr Mpunzi.\n\nBulawayos initially proposed 2025 budget was declared null and void following the intervention of the Chief Secretary in the Office of the President and Cabinet, Dr Martin Rushwaya.\n\nHe instructed the Permanent Secretary in the Ministry of Local Government and Public Works, Dr John Basera, not to approve the budget until all objections raised by stakeholders, particularly the business community, were addressed.\n\nA special budget committee was subsequently established to revise the 2025 city budget, and it is yet to present the final document.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-1-copy-177.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Bulawayo City Council (BCC) has reduced business shop licence fees and sports and social clubs’ rates by 30 percent, while all other charges outlined in the initial 2025 budget remain unchanged. According to minutes from a special council meeting held last week, finance director Mr Tennyson Mpunzi reported that shop licensing […]",
            "time": "21:46",
            "date": "05 Feb 2025"
        }
    ]
}