{
    "news": [
        {
            "title": "President Mnangagwa commends church role in nation-building",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-commends-church-role-in-nation-building/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa yesterday reaffirmed the Governments commitment to partnering with churches, saying religious organisations play a critical role in fostering peace, nation-building, and economic development.\n\nHe made the remarks during the commissioning of the state-of-the-art 10 500-seater Harvest House International Church auditorium in Bulawayos Selbourne Brooke suburb.\n\nThe facility, which began construction in October 2018, is a testament to resilience and faith, having been completed during the challenges of the Covid-19 pandemic.\n\nAccording to your brief, the construction of this building commenced in 2018 and continued throughout the trying period of the Covid-19 pandemic. The completion of this building, therefore, stands as towering evidence of the determination, hard work and resilience of Harvest House International Church, he said.\n\nThrough this mammoth project, you demonstrated faith that moves mountains, and you are a livingexample that with God, all things are possible.\n\nThe sprawling 10-acre complex is one of the largest of its kind in Zimbabwe. It features five seminar halls, a gymnasium, a food court, a restaurant, and a medical centre equipped with a pharmacy, dental surgery, general practitioner services, a blood laboratory, and physiotherapy facilities. Additionally, the site includes multiple boardrooms and six retail outlets available for rent, catering to businesses such as jewellery and clothing.\n\nThe President commended the church for integrating community outreach into its mission, noting that the facility will offer both spiritual and socio-economic benefits.\n\nThis structure is one of the largest of its kind in our country. I am, further pleased to learn that in addition to spiritual nourishment, which is the reason for its existence, this building will also provide an outreach to the community.\n\nIt offers other facilities such as a gymnasium, restaurants, health and wellness centre, a mini-mall recording studios seminar hall, he said.\n\nPresident Mnangagwa encouraged the church to expand its presence, particularly in rural areas, in alignment with the Governments Vision 2030 philosophy of leaving no one and no place behind.\n\nIn line with Vision 2030, I challenge you to plant many more churches in rural areas, no one and no place should be left behind. The gospel should be preached to all our people wherever they are, as it was in the early church, he said.\n\nThe President also praised Harvest House International Church for nurturing leaders who contribute significantly to various sectors of society, both locally and abroad.\n\nSome of these leaders occupy influential positions in our nation, across various sectors of Government and industry while others play their part in socio-economic development in the diaspora. Siyabonga, tinotenda.\n\nGoing forward, I exhort you to scale up initiatives not only to inculcate Godly values and work ethics, but also spur production and productivity among your congregants towards economic prosperity as well as higher quality of life in our motherland, he said.\n\nHe further called on the church to support national efforts in combating drug and substance abuse, particularly among the youth.\n\nThe Harvest House Campus Ministry programme at our national institutions of higher education such as the National University of Science and Technology, Bulawayo Polytechnic, the University of Zimbabwe, Hillside Teachers College, Mpilo School of Nursing and United Bulawayo Hospitals School of Nursing among others are welcome, said President Mnangagwa.\n\nThese must also serve to foster unity, peace, love, harmony and greater social cohesion in our young adults while improving both their physical and spiritual health.\n\nHighlighting the churchs remarkable growth, President Mnangagwa noted that Harvest House International, founded in 1995 by Bishops Dr Collin and Dr Sarah Nyathi, has expanded from eight congregants in a home setting to over 800 branches worldwide, including in Botswana, Namibia, and the United Kingdom.\n\nAs the church continues its mission, the President assured it of the Governments unwavering support, emphasising the shared responsibility of building a prosperous Zimbabwe rooted in its African identity and heritage.\n\nMy Government has always cherished the role of the church in nation-building, as the church is a key partner with multi-dimensional responsibilities, said President Mnangagwa.\n\nWe must individually and collectively play our part towards socio-economic development, modernisation and industrialisation of our motherland, Zimbabwe, and the greater continent of Africa. That responsibility lies primarily with us.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/cvxzgr5we4sr.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  PRESIDENT Mnangagwa yesterday reaffirmed the Government’s commitment to partnering with churches, saying religious organisations play a critical role in fostering peace, nation-building, and economic development. He made the remarks during the commissioning of the state-of-the-art 10 500-seater Harvest House International Church auditorium in Bulawayo’s Selbourne Brooke suburb.  The facility, which began construction in […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Scores bid  farewell to National Hero Mphoko",
            "url": "https://www.chronicle.co.zw/scores-bid-farewell-to-national-hero-mphoko/",
            "content": "Peter Matika,[emailprotected]\n\nSCORES of mourners yesterday gathered to bid a solemn farewell to the late national hero and former Vice President, Cde Phelekezela Mphoko, who was laid to rest at his family plot in Douglasdale, Bulawayo.\n\nThe burial marked the conclusion of a life devoted to Zimbabwes independence, development, and reconciliation.\n\nPresident Mnangagwa, who had earlier conferred national hero status on Cde Mphoko, described him as a pillar of unity and resilience whose enduring legacy would continue to inspire future generations.\n\nCde Mphoko (84) passed away in India, where he had been receiving medical treatment. As his casket was lowered into the grave, a 21-gun salute echoed in tribute to his immense contributions to the nation.\n\nThe ceremony was attended by senior Government officials, liberation war veterans, diplomats, and members of the public, underscoring the high esteem in which Cde Mphoko was held.\n\nIn his eulogy, Retired Brigadier-General Abel Mazinyane praised Cde Mphokos pivotal role in Zimbabwes liberation struggle, saying: He was not my best friend as people think, but he was my commander. I shared many profound experiences under his leadership and guidance.\n\nFamily spokesperson and younger brother, Mr Ndabezinhle Mphoko, expressed the familys deep sense ofloss:\n\nNo words can explain how much we will miss him. He was a humble man who cherished his privacy and family. His journey may have ended, but the memories and lessons he imparted will inspire generations to come.\n\nMatabeleland North Provincial Affairs and Devolution Minister Richard Moyo described Cde Mphoko as a courageous leader who played a vital role in Zimbabwes liberation and development.\n\nCde Mphoko was born on June 11, 1940 at Gwizane, in Bubi District of Matabeleland North.\n\nHe attended David Livingstone Memorial School in Ntabazinduna and Mzilikazi High School in Bulawayo.\n\nBetween 1959 and 1960, he enrolled at the Tsholotsho Agricultural Breeding and Experimental School where he did cropping and animal husbandry.\n\nAfter school, Cde Mphoko was employed by Dunlop Rhodesia Ltd between 1962-63 and was a workers representative in the moulding section.\n\nIn 1963, Cde Mphoko was arrested after lashing out at a Rhodesian police officer who had set his dog on him and fellow youths.\n\nHe was sentenced to three years in jail and sent to Khami Prison, before appealing against the sentence and was granted bail awaiting a retrial.\n\nIn the same year, 1963, he was a delegate at the Cold Comfort Farm Peoples Caretaker Council Congress.\n\nThe congress created a Special Affairs Department and decided on an external wing of zapu that would plan and direct the armed struggle.\n\nUnder the Special Affairs programme, Cde Mphoko along with Albert Nxele, Walter Mbambo and Sam Dumaza Mpofu, were selected by Zapu leader Cde Joshua Nkomo to go for military training.\n\nOn April 4, 1964, while awaiting a retrial, Cde Mphoko left Zimbabwe as part of a group of six and received military training in the Soviet Union between May 1964 and February 1965.\n\nIn March 1965, he created the first military command structure, the military planning committee, to plan and direct the armed struggle.\n\nCde Mphoko was one of the first seven commanders commissioned by the revolution and by the political leadership to recruit, train and command Zimbabweans into a revolution for the liberation of Zimbabwe.\n\nIn 1967, he became a member of the Joint Military Command in charge of logistics and supply in the ANC/Zapu Alliance.\n\nHe commanded the Joint Military rehearsals for the Wankie operations at Dan Nang base, Luthuli Camp, which included South African freedom fighters Joe Modise and Chris Hani who was the Commander of the Detachment, and others.\n\nIn 1967 and 1968, he operated in Sipolilo (now Guruve) together with Modise, Abraham Nkiwane, Dumiso Dabengwa and others.\n\nIn 1976, he was a delegate at the formation of the Patriotic Front, in Maputo, Mozambique, with JZ Moyo, George Silundika and Joseph Msika.\n\nIn 1977, Cde Mphoko attended the OAU Adhoc Committee of Foreign Ministers in Luanda Angola with Cdes Joseph Msika, and George Silundika.\n\nIn 1979, he attended the Lancaster House peace talks as a military delegate.\n\nThe following year, Cde Mphoko was appointed as a Special Envoy for Dr Joshua Nkomo, to President Samora Machel of Mozambique, King Sobhuza II of Swaziland, Chief Leabuwa Jonathan of Lesotho, President Fidel Castro of Cuba, and Eric Honneker of the German Democratic Republic.\n\nHe served in the sub-committee that designed Zimbabwe national flag.\n\nIn 1981, Cde Mphoko worked in the Ministry of Labour and Social Welfare as Deputy Director for Demobilisation.\n\nIn 1987, he was transferred to the diplomatic service and, with junior stints in Mozambique as liaison officer and in 1996 appointed liaison officer to Austria, also covering the United Nations Drug Control Programme and the Comprehensive Nuclear-Test-Ban Treaty Organisation.\n\nBetween 1996 and 1999, he did advanced courses in semen collection, artificial insemination and embryo transfer at the Institute of Genetics, Austria.\n\nIn 2002, he was appointed Zimbabwes Ambassador to Botswana, before becoming Zimbabwes Ambassador to the Russian Federation. In 2010, he was appointed Zimbabwes Ambassador to South Africa.\n\nOn December 10, 2014, he was appointed Vice-President by the late former President Cde Robert Mugabe alongside Cde Mnangagwa, who is now President.\n\nThe late former President Mugabe assigned Cde Mphoko the ministerial portfolio of National Healing, Peace and Reconciliation.\n\nHe was sworn in as Vice- President on December 12, 2014.\n\nOn July 6, 2015, he assigned Cde Mphoko the responsibility for coordination and implementation of policy.\n\nHe ceased to be Vice-President in November 2017 when the Second Republic was ushered into power.\n\nCde Mphoko is survived by wife Laurinda, and they had three children together, daughters Sikhumbuzo, Siduduzo and son, Siqokoqela.\n\nHe was also blessed with three grandchildren.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/efdsadfdasdf.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw  SCORES of mourners yesterday gathered to bid a solemn farewell to the late national hero and former Vice President, Cde Phelekezela Mphoko, who was laid to rest at his family plot in Douglasdale, Bulawayo.  The burial marked the conclusion of a life devoted to Zimbabwe’s independence, development, and reconciliation. President Mnangagwa, who had […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Harvest House unveils stunning architectural marvel",
            "url": "https://www.chronicle.co.zw/harvest-house-unveils-stunning-architectural-marvel/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nNESTLED in Bulawayos serene Selbourne Brooke suburb, the newly commissioned 10 500-seater Harvest House International Church auditorium is a stunning architectural marvel.\n\nThis multi-million-dollar facility redefines grandeur and sets a new benchmark for places of worship in Zimbabwe.\n\nThe gleaming structure has become a defining feature of Bulawayos skyline. Its contemporary design blends modern aesthetics with spiritual symbolism, featuring a towering faade adorned with sleek glass panels and bold geometric lines. The building reflects the citys effervescent culture and the churchs vision of progress and inclusivity.\n\nAt night, the auditorium transforms into a visual spectacle, illuminated by an innovative LED lighting system that casts shifting hues across the structure, making it visible from a distance.\n\nInside, the auditorium is a masterpiece of engineering and design. The expansive main hall, with tiered seating meticulously arranged to ensure unobstructed views, offers an immersive experience for congregants.\n\nThe state-of-the-art acoustics enhance every sound, from powerful sermons to stirring choir performances and high-energy gospel concerts.\n\nThe stage, equipped with advanced audio-visual technology, features giant LED screens and cutting-edge sound systems, elevating the worship experience.\n\nThe facility also includes five seminar halls, a gymnasium, a food court, offices, a restaurant, and other modern amenities, all crafted with exceptional attention to detail.\n\nBeyond its physical grandeur, the Harvest House International Church auditorium is a beacon of community and hope, serving as a hub for social and developmental activities.\n\nSpeaking at the official commissioning yesterday, President Mnangagwa praised the project for aligning with the Governments vision to transform Bulawayo into a premier destination for conferences and events.\n\nHe said the auditorium plays a dual role as a place of worship and a community outreach centre, adding that it contributes to the Governments efforts to develop Zimbabwe.\n\nPresident Mnangagwa said the facility will aid in the Governments quest to position Bulawayo as a leading destination for Meetings, Incentives, Conferences, and Exhibitions(MICE).\n\nI have said, brick upon brick, stone upon stone, and step by step we are building Zimbabwe we all want to live in, work in, do business in, and indeed the Zimbabwe we want to worship in, he said, drawing applause from the audience.\n\nAs President and on behalf of the Government and the people of Zimbabwe, I join you in celebrating this great achievement which will benefit the church, the City of Bulawayo and our great motherland, Zimbabwe as awhole.\n\nPresident Mnangagwa also commended the church for its commitment to constructing similar facilities nationwide, including schools, to complement Government programmes.\n\nThis structure is one of the largest of its kind in our country. I am, further pleased to learn that in addition to spiritual nourishment, which is the reason for its existence, this building will also provide an outreach to the community.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube hailed the development as transformative.\n\nThis facility is not just a place of worship but a complex that includes a health centre, shops, restaurants, a gymnasium, and music studios. It has significantly changed the landscape of Selbourne Brooke, she said.\n\nBulawayo is rapidly gaining recognition as a premier MICE tourism destination,a sector poised to boost the citys economy.\n\nWith its strategic location, well-developed infrastructure, and rich cultural heritage, the city is becoming a hub for major events.\n\nRecent events such as the Sanganai/Hlanganani World Travel and Tourism Expo, Mine Entra, the Zimbabwe International Trade Fair, and the Zanu-PF National Peoples Conference underscore Bulawayos growing stature in tourism and business.\n\nThe ripple effects of MICE tourism are far-reaching, benefitting industries such as hospitality, transportation, and entertainment while positioning Bulawayo as a significant player in Zimbabwes economic transformation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/vdfgffff.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  NESTLED in Bulawayo’s serene Selbourne Brooke suburb, the newly commissioned 10 500-seater Harvest House International Church auditorium is a stunning architectural marvel.  This multi-million-dollar facility redefines grandeur and sets a new benchmark for places of worship in Zimbabwe. The gleaming structure has become a defining feature of Bulawayo’s skyline. Its contemporary design blends […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Electricity imports up 18,6pc in Q3: ZimStat",
            "url": "https://www.chronicle.co.zw/electricity-imports-up-186pc-in-q3-zimstat/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWE National Statistics Agency (Zimstat) has reported that the country imported 611,1 gigawatt-hours (GWh) of electricity during the third quarter of 2024, marking an 18,6 percent increase from the 515,4 GWh imported in the previous quarter.\n\nIn its latest update, Zimstat revealed that the Index of Electricity Generation (IEG) for the third quarter of 2024 stood at 105,8, reflecting a 4,2 percent quarter-on-quarter increase from 101,5 in the second quarter. Year-on-year, the index rose by 4,5 percent compared to 101,2 recorded in the same quarter of 2023.\n\nThe IEG measures relative changes in the volume of electricity generatedin the country over time, providing insights into the performance of the energy sector.\n\nDuring the third quarter, Hwange Power Station remained the leading contributor to domestic electricity generation, producing 2 075,7GWh, which accounted for 77,8 percent of the total output. Kariba Power Station followed, generating 495,8 GWh (18,6 percent), while Independent Power Producers (IPPs) contributed 3,6 percent.\n\nA total of 611,1GWh of electricity were imported during the third quarter 2024, reflecting an 18,6 percent increase from 515,4GWh imported in the second quarter 2024, said Zimstat.\n\nZimStat highlighted the growing reliance on electricity imports, with 50 percent sourced from Eskom in South Africa, 19 percent from Mozambiques Hidroelctrica de Cahora Bassa (HCB), and 18 percent from Mozambiques Electricidade de Moambique (EDM).\n\nOn the export front, Zimbabwe recorded a significant 301,2 percent increase in electricity exports, with 420,2GWh exported in the third quarter compared to 104,7GWh in the second quarter.\n\nThe total volume of electricity distributed during the third quarter was 2 279,5 GWh, a 6,7 percent increase from 2 135,7GWh in the previous quarter.\n\nOf the distributed electricity, users in manufacturing, transport and construction sectors consumed 790,6GWh (34,7 percent), while those in mining and quarrying used 413,7GWh (18,1percent) and domestic consumers 480,3GWh (21,1percent), said Zimstat.\n\nZimbabwe National Statistics Agency (ZimStats)\n\nZimbabwe continues to grapple with power challenges, exacerbated by climate change. Reduced water levels in Lake Kariba have adversely affected hydropower generation, leading to frequent load shedding across the country.\n\nTo address these challenges, the Government is promoting investments in renewable energy, particularly solar power, and encouraging large electricity consumers to generate their own energy.\n\nPresenting the 2025 National Budget, Minister of Finance, Economic Development, and Investment Promotion, Professor Mthuli Ncube, reaffirmed the Governments commitment to supporting renewable energy projects. This includes facilitating financial closure for Independent Power Producers (IPPs) through Government Implementation Agreements.\n\nProfessor Mthuli Ncube\n\nGovernment is also encouraging large electricity consumers to invest in generating their own energy needs.  @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/HIOD9DDDDDDDDSBGUHGUGSDU.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  ZIMBABWE National Statistics Agency (Zimstat) has reported that the country imported 611,1 gigawatt-hours (GWh) of electricity during the third quarter of 2024, marking an 18,6 percent increase from the 515,4 GWh imported in the previous quarter. In its latest update, Zimstat revealed that the Index of Electricity Generation (IEG) for the third quarter […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Fun, festivities & awards as Chronicle hosts epic year-end party",
            "url": "https://www.chronicle.co.zw/fun-festivities-awards-as-chronicle-hosts-epic-year-end-party/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nOn Friday, Chronicle, one of Zimbabwes leading dailies, hosted a vibrant end-of-year stakeholders engagement party, complete with an awards ceremony to celebrate outstanding staff members.\n\nHeld at the luxurious Stay Afrique Hotel in Bulawayo, the event was a resounding success, bringing together journalists, stakeholders, artistes, and Chronicle staff for an evening filled with music, laughter, and camaraderie.\n\nGuests were treated to captivating performances by the Friends Band, a popular act known for their regular gigs at Holiday Inn, while DJ Francis Ncube, a familiar face at Ingwebu Breweries Sports Bars, kept the energy high with a diverse playlist.\n\nFrom nostalgic classics to the latest hits, the music catered to all tastes, ensuring the dance floor was always alive.\n\nChronicle staffers embraced the festive spirit, donning stylish attire that added flair to the evening. A raffle draw with exciting prizes further heightened the excitement.\n\nThe highlight of the night was the awards ceremony, where outstanding individuals across various departments were recognised for their contributions. Chronicle Editor Lawson Mabhena, alongside Zimbabwe National Road Administration (Zinara) chief executive officer Nkosinathi Ncube who was the guest of honour, presented the awards.\n\nMost notable of the awards was the longest serving member award which was given to the Editors secretary, Esther Linje who has been with the publication for decades. Other winners included journalist Nqobile Tshili, news intern Ashley Phiri, Charity Mugabe from the advertising department, and sports reporter Brandon Moyo.\n\nMabhena addressed the gathering, outlining the publications vision for 2025.Next year will be a year of digital transformation for us, as we integrate our publications under the Zimpapers brand, he said.\n\nAdding a playful twist to the night, Star FM personality Babongile Sikhonjwa led a humorous awards segment. Light-hearted accolades such as the Most Inconsistent award, the Loudest Individual in the Newsroom award, and the Best Dressed award sparked laughter and strengthened the bonds among staffers.\n\nThe evenings MCs, Star FMs Mkhululi Ncube and ZTNs Andile Tshuma, kept the programme running seamlessly, engaging guests with their charm and wit.\n\nGuests were spoiled with a variety of cocktails courtesy of Josh from The Smokehouse, adding a trendy vibe to the festivities. A beautifully crafted cake resembling the Chronicle newspaper, designed by Cake Fairy, was another standout feature of the night.\n\nThe event brought together representatives from key stakeholders, including the Zimbabwe Republic Police (ZRP), Zinara, and Ingwebu Breweries. The celebration was made possible through partnerships with organisations such as Holiday Inn, Zinara, Delta Beverages, Afdis, Stay Afrique, Devine Assignments, and Ingwebu Breweries.\n\nCouncillor Sandra-Ndebele Sibindi, Heads and Hooves, Vivo Safari Bar, Cake Fairy, Pub Lagondola, Kingdom Empowerment Centre Media, Toppers, Mviyo Technologies, ZimTickets, Zimpost, Budget Cash and Carry, So Sweet, Kenneth Mhlophe, and Townshend and Butcher (Peter Leondios) also supported the event.@MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/SDFFESDA.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com On Friday, Chronicle, one of Zimbabwe’s leading dailies, hosted a vibrant end-of-year stakeholders’ engagement party, complete with an awards ceremony to celebrate outstanding staff members. Held at the luxurious Stay Afrique Hotel in Bulawayo, the event was a resounding success, bringing together journalists, stakeholders, artistes, and Chronicle staff for an evening filled […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Chevrons woes continue",
            "url": "https://www.chronicle.co.zw/chevrons-woes-continue/",
            "content": "Brandon Moyo,[emailprotected]ZIMBABWE will have to wait a little longer to secure a T20I series win over Afghanistan after losing yet another one at Harare Sports Club on Saturday afternoon.\n\nWith the three-match series tied at one-all going into Saturdays game, there was everything to play for. However, the Chevrons produced yet another dismal performance, losing the match by three wickets and surrendering the series 2-1.Following the conclusion of the T20I matches, Zimbabwe slumped to their seventh consecutive bilateral series loss in T20Is against Afghanistan. Their solitary win was also their first against the Asian side in the format five years.\n\nThe first bilateral series between the two nations was in 2014 and ended 2-2, before Afghanistan registered a 3-2 win in 2015/16. In the 2016/17 season, Afghanistan won a five-match series 3-2, followed by a 4-1 victory in 2016/17. In 2022, the Asian side completed a 3-0 whitewash.\n\nIn Saturdays match, Zimbabwe were asked to bat first and were bowled out for 127 runs in 19.5 overs, before Afghanistan chased down the target in 19.3 overs, finishing on 128/7.Speaking after the game, Chevrons captain Sikandar Raza said they did not put enough runs on the board to give their bowlers something to defend. He also highlighted the lack of discipline with the ball, which saw them concede 17 extras, costing them dearly.\n\nI dont think this is a wicket where you score 127; we needed 150 here. With the big boundaries, a lot of good running is required.We played too many big shots to get those runs, and were repeating those mistakes. But Im hopeful well turn it around. I dont think its mental; the dressing room is quite relaxed, and everyone is backing each other.\n\nWe targeted the wrong bowlers at the wrong time. Once the singles dried up, we only tried to hit boundaries. The top seven batters had 21 dismissals, and the majority played the wrong shots at the wrong time. We tried everything, and thats why the game went to the last over. Its just not meant to be. Its quite difficult to defend 127, and those extras certainly killed us today, said Raza.\n\nAfghanistan skipper Rashid Khan was pleased with his teams fighting spirit after losing the first game and is already looking forward to the One Day International (ODI) series.\n\nQuite happy with the series win after losing the first game. The way we came back was great, especially our fielding, which is very key on such big grounds. Its always crucial to finish games, especially low-scoring ones, which are tough.\n\nThe partnership between Azmat and Naib was crucial, but theres still a lot to learn, especially for big games in major events.\n\nAs a bowler, it gives you energy to get wickets before the ODI series. 80-90 percent of our team is the ODI team, so they know how to approach it; theyve seen the conditions, and winning always gives you a good vibe in the dressing room, he said.\n\nBrandon Bennett top-scored for Zimbabwe with 31 runs off 24 balls, while Wessly Madhevere chipped in with 21 runs from 22 deliveries. Khan led from the front for Afghanistan with figures of 4/27 in his four-over spell.\n\nDefending their low total, the Chevrons made a strong start, leaving Afghanistan in trouble at 44/4 in 6,5 overs, taking charge of the game.Azmatullah Omarzai and Gulbadin Naib, however, shifted the momentum, adding a composed 48 for the fifth wicket. The pair rotated the strike well, avoiding unnecessary risks, but Zimbabwe broke through when Raza trapped Naib lbw for 22 in the 14th over.\n\nRaza struck again in the 18th over, holding a high return catch to remove Omarzai for a crucial 34, leaving Afghanistan at 114 for six and still needing 14 runs from the last two overs.\n\nMohammad Nabi eased some of the pressure with a boundary off Gwandu, until Rashid pulled the final delivery straight to fine leg, where it was caught by Faraz Akram.Akram was given the final over, with seven runs needed to win, but Nabis experience shone through.\n\nHe struck the first ball past fine leg for four, followed by a two to level the scores, before nudging a single to mid-off to clinch the win with three balls to spare.\n\nBlessing Muzarabani, Trevor Gwandu, and Raza picked up two wickets apiece for the Chevrons, while Ngarava took the other scalp.Next up is the ODI series, which gets underway tomorrow at Harare Sports Club.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/DSGF4RSDR.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com ZIMBABWE will have to wait a little longer to secure a T20I series win over Afghanistan after losing yet another one at Harare Sports Club on Saturday afternoon. With the three-match series tied at one-all going into Saturday’s game, there was everything to play for. However, the Chevrons produced yet another dismal […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Go well Comrade Report",
            "url": "https://www.chronicle.co.zw/go-well-comrade-report/",
            "content": "Yesterday, we bade farewell to one of the countrys most decorated liberators, Cde Phelekezela Report Mphoko who also played major roles in the post-independence development of the country.\n\nHe was among the earliest people to have an appreciation of how deplorable the situation that Blacks were in was in their country way back in the early 1960s.\n\nOur interest is drawn to the episode that started it all. After training in crop and animal husbandry at Tsholotsho Agricultural Breeding and Experimental School from 1959 to 1960, he secured a job at Dunlop in Bulawayo from 1960.\n\nLike the few pacesetters during his time, his consciousness landed him a role as a trade unionist at the tyre making firm, serving from that year to 1963. The no-nonsense figure that he was exploded after a Rhodesian police officer had set his dog on him and his friends. His response to the dog attack was so robust and brave that it warranted an arrest, an appearance in a Rhodesian court and a three-year jail term at Khami Prison.\n\nKhami Prison\n\nHe appealed and was granted bail awaiting trial but he continued his political activism, securing the honour as a delegate at the Cold Comfort Farm Peoples Caretaker Council Congress in that year.\n\nTogether with other early nationalists such as Cdes Albert Nxele, Walter Mbambo and Sam Dumaza Mpofu he was picked to go for military training.\n\nRather than waiting for a humiliating reappearance in a Rhodesian court, Cde Mphoko decided to do something far much better by going for military training in the then Soviet Union with five colleagues between May 1964 and February 1965.\n\nThe late Former Vice President Phelekezela Mphoko\n\nHe later returned to fight for his country in various capacities including being one of the first seven commanders commissioned to train other cadres. He was in the thick of things during the Hwange operations as well as in Guruve and was among the leaders who participated in talks  Lancaster House included  that led to national freedom in 1980.\n\nThereafter he served in the civil and diplomatic service until he was appointed Second Vice-President in December 2014.\n\nHis story speaks for itself, from his brave, resolute response to the dog attack, to commanding cadres, participation in the independence talks, diplomatic service to his vice-presidency.\n\nWe are inspired by Cde Mphokos record. The weak and politically illiterate could have run away from the Rhodesian cop and his canine to nurse dog bite wounds quietly at home. He would have none of it.\n\nInstead, he personally took on the cop, a symbolic act of him personally taking on the colonial regime with his bare hands and understanding of the need to defend of the humanity of the majority from colonial humiliation and injustice.\n\nWe find that inspiring, as was his story from then on.Apart from the National Heros bravery, we are encouraged by his humility and simplicity.\n\nDespite his illustrious roles in the liberation war and post-independence development of the country, he remained the quiet giant from Gwizane until he rested on December 6 aged 84.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/Phelekezela-Mphoko-.jpg",
            "description": "Yesterday, we bade farewell to one of the country’s most decorated liberators, Cde Phelekezela “Report” Mphoko who also played major roles in the post-independence development of the country. He was among the earliest people to have an appreciation of how deplorable the situation that Blacks were in was in their country way back in the […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Zimpapers, BCC host memorable children’s Christmas party",
            "url": "https://www.chronicle.co.zw/zimpapers-bcc-host-memorable-childrens-christmas-party/",
            "content": "Ashley Phiri, ashleyphiri66@gmail\n\nIT was pomp and fanfare last Friday at the Kings Kraal in Bulawayo when children from various childrens homes around Bulawayo gathered for a Christmas celebration.\n\nThe event, organised by Zimpapers in partnership with the Bulawayo Mayors Cheer Fund, Kings Kraal and several sponsors aimed to spread Christmas cheer to underprivileged children.\n\nThe event, attended by 261 children and 18 caregivers was a resounding success. The children enjoyed a sumptuous feast, complete with juicy burgers, crispy fries, and refreshing soft drinks.\n\nChildren from various childrens homes being served lunch during a Christmas lunch organised by Zimpapers in partnership with Bulawayo City Council Mayors Cheer Fund and other businesses at Kings Kraal in Bulawayo on Friday\n\nWhat made the meal truly special was that the children had the opportunity to make their own burgers, carefully assembling the patties, lettuce, tomatoes, and cheese to create their perfect culinary masterpiece.\n\nAs the children savoured their delicious creations, Bulawayo mayor Councillor David Coltart addressed the gathering during which he stressed the importance of nurturing Bulawayos youth.\n\nI am special, I am precious, I am the future of Bulawayo, he told the children, encouraging them to repeat the affirmations after him.\n\nChildren you are our future and we love you. This Christmas I want you to ask your caregivers and teachers to tell you more about Jesus, he was born 2000 years ago and His birth changed our lives. This Christmas I want to encourage you to centre your hope in Him.\n\nThe event was made possible through the generous support of various organistions.Chronicle Editor, Lawson Mabhena expressed Zimpapers gratitude for being part of this initiative.\n\nMayor Councillor David Coltart\n\nQueen Elizabeth Childrens Home director, Mrs Helen Hall said the celebration was a wonderful way to bring joy and happiness to the children during the Christmas season.\n\nIt is wonderful to see individuals come together to do something for the children. The children are happy to be here, we are happy to be here with the children, you can say that Christmas has come early for us, she said.\n\nThe childrens homes that attended the event included In the Shadow of Hope, Isaiah, Sandra Jones, SOS, John Smale, Mustard Seed, Queen Elizabeth, and Khayelitsha.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfsfdgggggggggsd.jpg",
            "description": "Ashley Phiri, ashleyphiri66@gmail IT was pomp and fanfare last Friday at the Kings Kraal in Bulawayo when children from various children’s homes around Bulawayo gathered for a Christmas celebration. The event, organised by Zimpapers in partnership with the Bulawayo Mayor’s Cheer Fund, Kings Kraal and several sponsors aimed to spread Christmas cheer to underprivileged children. […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "ATAF pays tribute to Prof Ncube’s role on regional taxation",
            "url": "https://www.chronicle.co.zw/ataf-pays-tribute-to-prof-ncubes-role-on-regional-taxation/",
            "content": "Business Writer\n\nTHE African Tax Administration Forum (ATAF) has paid tribute to Zimbabwes Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, for his contribution towards enhancing Domestic Resource Mobilisation (DRM) in the continent through his close collaboration with the regional tax advocacy agency.\n\nFollowing the ATAF Exchange of Information Conference (EOI) held in October in Johannesburg, South Africa, this year, regional tax experts, policymakers and strategic partners made key pronouncements towards improving revenue generation to bolster Africas development.\n\nOne fundamental outcome from this conference was the call to African political leaders to support the implementation of EOI as a critical tool for DRM as opposed to compliance to international standards.\n\nAt the recent ATAF Annual General Meeting in Kigali, Rwanda, executive secretary, Mr Logan Wort, applauded Prof Ncubes contribution and urged other policy makers in the region to follow suit. Zimbabwe is a member of ATAF.\n\nWe continue to express our sincere gratitude to the Hon Prof Mthuli Ncube, Minister of Finance and Investment Promotion for the Republic of Zimbabwe for his offer to champion this agenda among his peers on the continent.\n\nWe call upon other African leaders to join this worthy course, said Mr Wort.\n\nZimbabwe is one of the regional champions in embracing digital technology in taxation matters and a few weeks ago, Prof led the launch of the Electronic Tariff Tool (e-Tariff Tool), marking a significant advancement in the countrys efforts to enhance trade facilitation and improve the ease of doing business in Zimbabwe.\n\nThe e-Tariff Tool will undoubtedly serve as a vital resource for traders, simplifying the complexities of tariff classification and duty estimation, said Prof Ncube during the launch.\n\nThis initiative is a remarkable step towards making our customs operations more efficient and user-friendly, ultimately benefiting the entire trading community.\n\nDuring the ATAF Indaba, Mr Wort noted that besides the digital transformation agenda and the domestic tax base expansion, this year ATAF embarked on a new journey of revamping effective use of exchange of information and promotion of tax transparency given its significance on the enhancement of DRM and for addressing illicit financial flows.\n\nTo support our members on this critical transformation, we have been providing technical assistance on EOI including support on the development of automatic exchange of information IT system, support on the necessary legislative reforms for implementation of EOI and provision of the necessary toolkits such as the Toolkit on Joining ATAF Agreement on Mutual Assistance in Tax Matters (AMATM), said Mr Wort.\n\nThe high-level meeting highlighted, among other things, that the African continent continues to be impacted by various challenges, including the debt crisis in many countries, the geopolitical conflicts and tensions, the changing political landscape and the climate and environmental considerations.\n\nDelegates stressed the need to embrace technology and digital solutions in tax administration as central to enhancing domestic resource mobilisation capacities for African countries, which is necessary for financing development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/Prof-Mthuli-Ncube-630x380.jpg",
            "description": "Business Writer THE African Tax Administration Forum (ATAF) has paid tribute to Zimbabwe’s Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, for his contribution towards enhancing Domestic Resource Mobilisation (DRM) in the continent through his close collaboration with the regional tax advocacy agency. Following the ATAF Exchange of Information Conference (EOI) held in October […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        },
        {
            "title": "Driving resilience and growth: A transformative budget for 2025",
            "url": "https://www.chronicle.co.zw/driving-resilience-and-growth-a-transformative-budget-for-2025/",
            "content": "Innocent Mujeri, Correspondent\n\nAS Zimbabwe charts a path towards sustainable development and economic resilience, the 2025 National Budget emerges as a pivotal tool to achieve these goals.\n\nPresented by the Minister of Finance, Economic Development and Investment Promotion Professor Mthuli Ncube recently, the budget is framed under the theme, Building Resilience for Sustained Economic Transformation.\n\nThis ambitious financial plan reflects a clear intent to overcome current challenges while paving the way for long-term growth and inclusivity.\n\nWith projected Gross Domestic Product growth of six percent for 2025, this budget balances fiscal prudence with an expansive vision for development. It targets critical areas such as agriculture, energy, infrastructure, and social equity, offering a robust framework to drive economic recovery, resilience, and transformation.\n\nProfessor Mthuli Ncube\n\nAgriculture is the backbone of Zimbabwes economy, contributing significantly to the GDP, employment, and exports. The 2025 National Budget makes transformative strides in addressing the vulnerabilities of this sector, especially in the context of climate change.\n\nWith the La Nia phenomenon expected to bring above-average rainfall, the budget capitalises on this opportunity to boost agricultural productivity.\n\nOne of the standout initiatives is the introduction of hybrid agricultural index insurance under the Farmers Basket programme. This innovative insurance mechanism provides financial protection to smallholder farmers against climate-induced losses, a critical step towards mitigating the adverse impacts of droughts and other extreme weather events.\n\nThe success of the pilot phase, which paid out US$232 997 to 4 014 farmers following drought-induced losses, highlights its potential to enhance resilience among rural communities.\n\nThe allocation of resources for irrigation infrastructure, rural development, and extension services further strengthens the agricultural framework. By empowering farmers with modern tools and techniques, the budget aims to achieve food security and position Zimbabwe as a regional agricultural powerhouse.\n\nEnergy shortages have long been a bottleneck for Zimbabwes economic progress. The 2025 budget takes a bold stance to address this issue by prioritising reforms in the energy sector. Recognising the private sector as a key partner, the Government plans to lower restrictions on self-generation and attract private investments in energy infrastructure. This approach is not only pragmatic but essential for ensuring a stable and sustainable energy supply.\n\nProf Mthuli Ncube\n\nThe allocation for energy development, though modest, is strategically focused on expanding domestic power generation. By integrating renewable energy sources and enhancing grid efficiency, Zimbabwe can reduce its reliance on imported electricity and achieve greater energy independence. This will, in turn, unlock productivity across sectors, from manufacturing to mining.\n\nInfrastructure investment is a cornerstone of the 2025 budget, reflecting the Governments commitment to economic modernisation. The budget allocates substantial resources to transport, water, housing, and digital infrastructure. These projects are not just about economic growth; they are about connecting communities, improving accessibility, and creating equitable opportunities.\n\nTransport infrastructure, for instance, is set to benefit from targeted road rehabilitation projects. By improving connectivity between urban and rural areas, these initiatives will enhance trade, reduce logistics costs, and boost market access for agricultural and industrial goods.\n\nSimilarly, investments in water and sanitation infrastructure aim to address critical public health and environmental challenges.\n\nHousing development receives a noteworthy allocation, reflecting the governments dedication to addressing urbanisation and housing shortages. Affordable housing projects, coupled with innovative financing mechanisms, will provide secure living conditions for thousands of families while stimulating the construction sector.\n\nIn a challenging fiscal environment, the Government has demonstrated commendable discipline in managing public finances. The projected fiscal deficit of 1,4 percent of GDP underscores a commitment to prudent spending and resource optimisation. This is achieved through a combination of measures, including limiting recurrent expenditures, rationalising public sector wages, and enhancing revenue collection mechanisms.\n\nDebt sustainability remains a critical focus. With external debt standing at U$12,3 billion, the Government is pursuing arrears clearance and restructuring processes to reduce debt servicing costs.\n\nThese efforts are complemented by cautious borrowing strategies, leveraging concessional loans for infrastructure projects while avoiding unsustainable debt accumulation.\n\nOne of the most inspiring aspects of the 2025 budget is its emphasis on social equity and empowerment. Programmes targeting women, youth, and marginalised communities are at the forefront, ensuring that economic growth translates into tangible benefits for all.\n\nThe expansion of financial inclusion initiatives, such as loans for women and youth entrepreneurs, is a game-changer. By increasing access to credit and business support services, the Government is fostering grassroots entrepreneurship and reducing economic disparities.\n\nThe data speaks volumes: loans to women as a percentage of total bank loans rose from 4,48 percent in 2023 to 9,86 percent in 2024, a testament to the impact of these initiatives.\n\nAdditionally, the focus on education and skills development, particularly in science, technology, and innovation, aligns with the Governments vision of building a knowledge-driven economy. Investments in human capital development will empower the workforce to adapt to evolving economic demands, driving productivity and competitiveness.\n\nZimbabwes vulnerability to climate change necessitates urgent action, and the 2025 budget does not disappoint. Substantial allocations for environmental protection, climate resilience, and renewable energy projects reflect a clear commitment to sustainability.\n\nProgrammes such as the African Risk Capacity drought insurance policy and reforestation initiatives are forward-thinking measures that address both immediate and long-term challenges.\n\nThe Governments emphasis on sustainable mining practices and reducing carbon emissions further aligns with global environmental goals. By integrating climate considerations into economic planning, Zimbabwe is positioning itself as a responsible global player.\n\nWhile the 2025 budget sets an impressive agenda, its success hinges on effective implementation and collaboration. Challenges such as external debt management, revenue generation, and corruption must be addressed to ensure that the allocated resources deliver maximum impact.\n\nHowever, these challenges also present opportunities. Public-private partnerships can play a pivotal role in financing and executing infrastructure projects. Strengthening institutions and governance frameworks will enhance transparency and accountability, building public trust in the budget process.\n\nThe 2025 National Budget is a transformative roadmap that balances ambition with realism. It addresses Zimbabwes immediate needs while laying the groundwork for sustainable growth and resilience. From agriculture and energy to infrastructure and social empowerment, the budget reflects a holistic approach to development.\n\nAs citizens and stakeholders, we must support this vision by actively participating in its implementation and holding our leaders accountable. The journey to economic transformation is not without challenges, but with collective effort and determination, Zimbabwe can achieve its goals and secure a prosperous future for all.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Mthuli-Ncube-nice.jpg",
            "description": "Innocent Mujeri, Correspondent AS Zimbabwe charts a path towards sustainable development and economic resilience, the 2025 National Budget emerges as a pivotal tool to achieve these goals. Presented by the Minister of Finance, Economic Development and Investment Promotion Professor Mthuli Ncube recently, the budget is framed under the theme, “Building Resilience for Sustained Economic Transformation.” […]",
            "time": "08:30",
            "date": "16 Dec 2024"
        }
    ]
}