{
    "news": [
        {
            "title": "I killed her! Cop confesses to shooting detective Hove who was allegedly slain by armed robbers",
            "url": "https://www.chronicle.co.zw/i-killed-her-cop-confesses-to-shooting-detective-hove-who-was-allegedly-slain-by-armed-robbers/",
            "content": "Peter Matika,[emailprotected]IN a shocking turn of events, a police officer stationed at Hillside Police Station in Bulawayo has allegedly confessed to the fatal shooting of Detective Constable Cassandra Hove a fortnight ago.The suspect has been identified as one constable Muradzikwa and is being held at Donnington Police Station.According to police sources, Muradzikwa confessed to the crime, saying he does not need the services of a lawyer.He is scheduled to appear in court this morning.Detective Const Hove, a 37-year-old member of Bulawayos elite all-female CID unit known as Team Lozikeyi, tragically lost her life during a police operation on March 6, 2025. The incident occurred around 8:40 PM in the Habek area of Pumula South suburb, where Hove and her colleagues were said to be pursuing suspects involved in a series of armed robberies.Initial reports had suggested she was shot by the robbers.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/0000-0.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw IN a shocking turn of events, a police officer stationed at Hillside Police Station in Bulawayo has allegedly confessed to the fatal shooting of Detective Constable Cassandra Hove a fortnight ago. The suspect has been identified as one constable Muradzikwa and is being held at Donnington Police Station. According to police sources, Muradzikwa […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "‘Africa must take care of its health’",
            "url": "https://www.chronicle.co.zw/africa-must-take-care-of-its-health/",
            "content": "Zvamaida Murwira, Harare BureauPRESIDENT Mnangagwa yesterday met a special envoy from Tanzanian President Dr Samia Suluhu Hassan with a call to have Africa become independent in managing its health affairs in the wake of the withdrawal of technical support from development partners from Western countries.\n\nTanzanias Foreign Affairs and East Africa Co-operation Minister, Ambassador Thabit Mahmoud Kombo, delivered a special message to President Mnangagwa at State House in Harare where they held bilateral discussions.\n\nBriefing journalists after the meeting, Amb Kombo said the primary objective was to present Professor Mohamed Yakub Janabi, a SADC endorsed candidate for the next regional director for the World Health Organisation African region.\n\nFive candidates nominated by their countries are competing for the position, which became vacant following the death of Dr Faustine Ndugulile, the former WHO regional director-elect for Africa and former Tanzanian Minister of Health, who passed away on November 27, 2024.\n\nI came with a special message from my President Dr Samia Suluhu Hassan who calls President Mnangagwa her senior elder brother to deliver a message.\n\nWe thank him for the kind and warm welcome and the hosting that we have always enjoyed as SADC members and him, President Mnangagwa, as our SADC Chair.\n\nI came also with another message about a candidate that will be running for the Afro Region World Health Organisation director, as you know we lost the previous one who was from Tanzania, Dr Faustine Ndugulile; we lost him just before starting his term as director of WHO for African region.\n\nBecause of the sudden loss, we have put up another candidate and according to the procedure of WHO, we have to go through all the member States, said Amb Kombo.\n\nHe added that in terms of their tradition as Tanzanians, they start by meeting elders and the elder in the region is SADC, which has 16 countries.\n\nFrom SADC, which is the sub-regional body, they go to the African Union.\n\nWe have already been to AU as our elder brother, we met President (Joao) Laurenco (of Angola) and today we are meeting another elder brother, Chairperson of our own SADC region.\n\nHe received our message very well. This candidate I have is Prof Janabi, he has already been endorsed by the SADC region as our sole candidate for all the 16 countries, Amb Kombo said.\n\nProf Janabi said his objective was to bring transformative changes in African health discourse and ensure the continent becomes independent.\n\nOne of the goals which I want to do is the transformative changes, which I am picking the baton from Dr Matshidiso Moeti, to continue the transformative changes if elected, especially now that we are all aware of the geopolitical tension with the donors in WHO.\n\nSo, I think you can look at it in two ways; you can look at it as a challenge or you can look at it as an opportunity. I look at it as an opportunity for the Afro region, which has got 47 countries.\n\nI think its high time we should think of being independent in managing our health matters, because African problems are supposed to be solved by Africans ourselves, said Prof Janibi, a cardiologist.\n\nHe said he would ensure universal healthcare for everyone if elected, using his vast experience in health issues.\n\nI am the chief executive officer of Muhimbili National Hospital, our largest hospital in the country with 2 400 beds (and) 4 000 staff. We see roughly 4 000 patients every day, but on top of that, I am senior advisor to the current President Dr Hassan on health matters, policy and nutrition.\n\nSo, I do advise a lot on primary healthcare, universal health coverage, and equity, because what we want is universal health coverage, so there should be equity. Every citizen, the 47 member States, should get the basic services, he said.\n\nApart from Prof Janabi, other contenders are Dr Nda Konan Michel Yao from Cte dIvoire, Dr Dram Mohammed Lamine from Guinea, Dr Boureima Hama Sambo from Niger and Prof Mijiyawa Moustafa from Togo.\n\nAccording to the WHO appointment process, any member State of the African region may propose a candidate for the post of regional director.\n\nThe nomination is conducted by secret ballot during a private meeting of the regional committee session scheduled to take place on May 18, 2025, in Geneva, Switzerland.\n\nFollowing the regional committee meeting, the nominated regional director will be officially appointed by the WHO Executive Board, based on the nomination made by the WHO Regional Committee for Africa.\n\nThe WHO regional director serves a five-year term, with the possibility of one reappointment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/vbctrvbvc.jpg",
            "description": "Zvamaida Murwira, Harare Bureau PRESIDENT Mnangagwa yesterday met a special envoy from Tanzanian President Dr Samia Suluhu Hassan with a call to have Africa become independent in managing its health affairs in the wake of the withdrawal of technical support from development partners from Western countries. Tanzania’s Foreign Affairs and East Africa Co-operation Minister, Ambassador […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "400 more jobs for Kamativi",
            "url": "https://www.chronicle.co.zw/400-more-jobs-for-kamativi/",
            "content": "Nqobile Tshili in HwangeFOUR hundred more jobs will be created by the end of this year at the formerly defunct Kamativi Tin Mine in Matabeleland North Province where pan-African mining giant, Bravura Group, is setting up a second lithium processing plant, in yet another milestone investment ushered in by the Second Republic.\n\nThe Bravura Lithium Project is situated within the Kamativi Tin compound and shares boundary with the Chinese owned Kamativi Mining Company (KMC), which was officially commissioned by President Mnangagwa last year.\n\nBravuras initial 400 employed workers will add to the 1 200 workers who were employed by KMC last year.\n\nPreparatory processes to set up the massive plant are underway on site with the Nigerian investor hinting that installation works would commence in April, with operations resuming before the end of the year.\n\nPresidential Affairs and Devolution Permanent Secretary, Engineer Tafadzwa Muguti, who was accompanied by Matabeleland North Provincial Affairs and Devolution Minister Richard Moyo and senior company managers, visited the site yesterday and were briefed that all the equipment has been brought to the ground ahead of installation.\n\nEngineer Tafadzwa Muguti\n\nThe company also handed over six houses to the Government as part of the relocation plans to those who would have their homes demolished to pave way for the project.\n\nBravura constructed four by eight-roomed houses and two, nine-roomed houses, with Government recommending that the houses be partitioned to accommodate two families as they were too big for a single family.\n\nBravura Lithium Project head, Engineer Tafadzwa Muridzi, said following the delivery of equipment, they will commence installation next month.\n\nIn terms of timelines, we expect that in April we will start the construction of the plant. We will start with the plant foundations. This is a 10-key project, meaning the vendor who manufactured the plant will be coming to the ground for the installations, she said.\n\nAfter that installation then comes the commissioning of the plant. We anticipate that all that will happen from April to the end of the year and then we should be able to run, said Eng Muridzi.\n\nShe said the investment was substantial and will contribute to national economic growth while uplifting lives of ordinary people in Kamativi. Eng Muridzi said already the company is incurring costs as it has employed staff who are doing the preliminary works.\n\nThis is a significant project for Zimbabwe because we will be contributing towards the total lithium that will be processed within the country, she said.\n\nThis will add to the Gross Domestic Product that is generated for the country. So, we will be playing our significant part in ensuring that value rises and in addition, we will be creating employment and developing the community itself. This will contribute a lot towards development within the country, said Eng Muridzi.\n\nIn his remarks, Eng Muguti said it was exciting that Zimbabwe was not just attracting Asian and European investors but continental investors as well.\n\nWe are quite excited that this is our own African brother, Bravura brothers and sisters from Nigeria who have come to take advantage of the Zimbabwe is open for business policy, he said.\n\nHis Excellency (President Mnangagwa), did met the investors last year and gave them all the blessings to come and invest. As you are aware, Kamative Tin has been closed for 30 years, it is quite exciting that we have KMC, our Chinese investors on the other side of the mountain, we also have an African investor, said Eng Muguti.\n\nAll along we have been seeing the Asian investors and European investors but there has been a few African investors. So, for the Nigerian Federal Government through its investors to start coming into Kamativi and start uplifting this community is quite good.\n\nHe said he was informed that the plant will employ at least 400 workers, which will transform lives.Eng Muguti also encouraged the company to conduct on-the-job training for some of the programmes as opposed to relying on skilled employees only, which will leave out the majority of the locals.\n\nIts quite significant we have a number of unemployed youths and in terms of social programmes, it has been difficult for Government as you can see these are very marginalised communities, he said.\n\nWe are quite excited that about 400 jobs will be created in the process. Many able-bodied girls and the youth will get jobs. Not all the 400 jobs will be for skilled people. It will be for locals who will be trained here. We should be processing lithium by December here in Matabeleland North, said Eng Muguti.\n\nHe said Government has allocated the previously owned Kamativi Tin Mine houses to Bravura Lithium Project for their employees.\n\nCommenting on the project, Minister Moyo said it was pleasing that investors continue to show confidence in Matabeleland North.\n\nMinister Richard Moyo\n\nBravura Zimbabwe, a subsidiary of the Bravura Group, has made a considerable commitment to this project, by investing hundreds of millions of dollars in the revival of the Kamativi Tin Mines, he said.\n\nThis project has reached advanced stages and will be operationalised from one of the largest plants in Africa, showcasing Bravuras dedication to excellence and its confidence in Zimbabwes economic potential, said Minister Moyo.\n\nHe said Bravura Groups investment in Zimbabwe is in sync with President Mnangagwas assertion that Africans must move beyond narratives where the continents rich natural resources are a blessing or a curse.\n\nMinister Moyo said the Second Republic has created a conducive environment for investment and investors must reciprocate the country by ensuring sustainable development.\n\nWe must be awake and leverage on our natural resource endowments to build our beloved continent, brick by brick; stone upon stone and step by step, leaving no place and no one behind, he said.\n\nWell done, Bravura Zimbabwe, we look forward to future collaborations for the betterment of the lives of our communities.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yjd.jpg",
            "description": "Nqobile Tshili in Hwange FOUR hundred more jobs will be created by the end of this year at the formerly defunct Kamativi Tin Mine in Matabeleland North Province where pan-African mining giant, Bravura Group, is setting up a second lithium processing plant, in yet another milestone investment ushered in by the Second Republic. The Bravura […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Caroline: a force to reckon with in theatre/film",
            "url": "https://www.chronicle.co.zw/caroline-a-force-to-reckon-with-in-theatre-film/",
            "content": "Mthabisi Tshuma,[emailprotected]Caroline Mashingaidze-Zimbizi, a creative powerhouse has become a force to reckon with in the Zimbabwean film industry. Popularly known for her roles on films, Ngoda (2023), Mugabe (2023) and No Matter What (2008), she is living one of the best moments of her life and career, excelling on a national level.\n\nThe multi-award-winning actress recently earned recognition at the 23rd National Arts Merit Awards (Nama) where she was named the Outstanding Actress for her role as Tete Sabina in Family Riots. This was her second Nama.\n\nTo trace her career in honour of Womens Month, Chronicle Showbiz caught up with Mashingaidze-Zimbizi, who shared insights into her nearly two-decade-long journey.\n\nI started in film in 2006 when I played Julian in Estate Blues. Ive always drawn my inspiration from entertainment  watching my favourite music and TV idols on screen. But theres one defining moment for me that made everything click: watching Studio 263 and Generations.\n\nCaroline Mashingaidze-Zimbizi\n\nI would literally dream about being on one of those prestigious soap operas, she said.\n\nAt the time, I was 19, and I auditioned for the local soap opera, Estate Blues. I immediately got cast in a supporting role as Juliane, the feisty young wife of Mr Tembera. I spent a year and a half at Estate Blues before seeking out other opportunities, Mashingaidze-Zimbizi recalled.\n\nAlong the way, watching live theatre became a turning point for her.\n\nI watched a play at Theatre in the Park and that inspired me to pursue theatre. Rooftop Promotions had auditions and I went there. I was cast in a star-studded play, Lovers, Friends, and Money. It featured legends like Steven Chigorimbo, veterans Tendayi Chakanyuka and Tatenda Mavetera who is now the Honourable ICT Minister. That play elevated my career to even greater heights, she said.\n\nHer journey into theatre was further solidified when she was scouted by the legendary, Jasen Mpepho.\n\nI worked at Patsime Trust for five years, where my theatre skills were honed. Along the way, I also collaborated with other theatre companies, such as Savanna Trust, working alongside incredible creatives like Daniel Maphosa and Leonard Matsa. I also worked on several productions with Joe Njagu Productions. Our film Ngoda won multiple awards and I received an international award for Best Supporting Actress in Nigeria at the Kano Indigenous Languages of Africa Film Market and Festival, she shared.\n\nWith over 20 projects in theatre and film, Mashingaidze-Zimbizi continues to work on exciting new ventures.\n\nI feel truly honoured and grateful to God for the Nama, my second win. Im so humbled and have something exciting lined up in both theatre and TV. People should stay on the lookout, she teased. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/gtfhgsgfdg.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Caroline Mashingaidze-Zimbizi, a creative powerhouse has become a force to reckon with in the Zimbabwean film industry. Popularly known for her roles on films, Ngoda (2023), Mugabe (2023) and No Matter What (2008), she is living one of the best moments of her life and career, excelling on a national level. The […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "‘A great leader and person’…Billiat celebrates Musona’s return",
            "url": "https://www.chronicle.co.zw/a-great-leader-and-person-billiat-celebrates-musonas-return/",
            "content": "Fungai Muderere,[emailprotected]\n\nWARRIORS poster boy, Khama Billiat, has welcomed Knowledge Musonas return to the Warriors fold ahead of the 2026 Fifa World Cup Qualifiers Group C encounters against Benin and Nigeria this week.\n\nThe Warriors are set to face Benin on Thursday, before taking on Nigeria next Monday.\n\nMusona was named in the squad for the two games after ending his international retirement. He had retired from national team duty in May 2022 to focus on his club career and give youngsters a chance.\n\nWarriors head coach Michael Nees, convinced him to reconsider his decision, and the forward is now back in the team.\n\nMichael Nees\n\nBilliat believes Musonas experience will be invaluable for the team.\n\nHaving Knowledge, with his experience, is a great motivation, Khama told ZBC News ahead of the Warriors departure to Durban, South Africa on Sunday.\n\nHe added: We have worked with him in the past, and it feels great. It has been a long time waiting for him and finally hes here.\n\nWe need his experience and it is going to add a lot (to the team). A great leader and person, having him back is going to be a great motivation.\n\nSpeaking about the Warriors chances of achieving positive results in the two games, Billiat added:\n\nWere taking every game as it comes, and we will focus on doing our best. The first one is in SA (against Benin), so we focus on that now.\n\nThe Warriors will host Benin at Moses Mabhida Stadium in Durban on Thursday, before travelling to Uyo, Nigeria, to face the Super Eagles on Monday.\n\nKnowledge Musona\n\nMeanwhile, Nees has urged France-based striker Tino Kadewere to put in the work and regain his form after missing national team call-ups due to injury.\n\nKadewere, who hasnt played this year for Nantes, is absent from the squad for the upcoming World Cup qualifiers against Benin and Nigeria.\n\nI have constant conversations with Tino. He was unfortunately made a scapegoat last time (after being) accused of faking an injury, Nees said.\n\nBut he was out for five months. So, I think everybody who publicly criticised him should apologise. He has been out of action since November.\n\nThe German coach said Kadewere is still part of his plans, but he needs to show he can earn back his spot in the team.\n\nTino is, of course, on our list. He plays at a very high level. He must just get the confidence back into his body, the fitness, the self-belief that his body can cope with everything.\n\nAnd then we will invite him and assess him. If hes performing well, he will be invited. Even if he returns to the squad, maybe over the weekend, it would be too early, the Warriors coach said.\n\nHe was out of action for five months. Its too early. Same with Bill Antonio. He was out of action for over a year with an ACL (anterior cruciate ligament) injury.\n\nBut with Tino, we have very good conversations and are very respectful. Theres no problem from my side with him.  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Khama-Billiat-grimace.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw WARRIORS poster boy, Khama Billiat, has welcomed Knowledge Musona’s return to the Warriors fold ahead of the 2026 Fifa World Cup Qualifiers Group C encounters against Benin and Nigeria this week. The Warriors are set to face Benin on Thursday, before taking on Nigeria next Monday. Musona was named in the squad for […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "AfCFTA springboard for Africa resilience against global headwinds",
            "url": "https://www.chronicle.co.zw/afcfta-springboard-for-africa-resilience-against-global-headwinds/",
            "content": "Prosper Ndlovu,[emailprotected]AMID the global economic landscape shift characterised by rising geopolitical tensions and increased trade protectionism, Zimbabwe has rallied its regional peers to urgently embrace the African Continental Free Trade Area (AfCFTA) and accelerate regional integration as a spring board of resilience and driving solid economic transformation of Africa.\n\nAfrican economies are not immune to the growing threat of tariff escalations and evolving trade restrictions, which have heightened, than ever before, highlighting the importance of regional trade blocs and the quest for a vibrant regional integration agenda.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, said this yesterday in Addis Ababa, Ethiopia where he is attending the 57th Session of the Conference of African Ministers of Finance, Planning, and Economic Development.\n\nAnchored on the theme: Advancing the implementation of the agreement establishing the African Continental Free Trade Area: Proposing Transformative Strategic Actions, the high-level event is being hosted by the United Nations Economic Commission for Africa and attended by distinguished delegates and experts from across the continent.\n\nZimbabwe is the outgoing chair and hosted last years Indaba in Victoria Falls.\n\nCalling on the African continent to rethink its strategic focus, Prof Ncube said the time has come for the region to come up with home-grown solutions on how to rebuild the Africa we want for future generations.\n\nWe can choose to see these developments as challenges or see them as opportunities, which we have to collectively as a continent take advantage as a spring board for accelerating economic reforms through economic transformation, he said.\n\nThe AfCFTA serves as a power tool at our disposal for addressing some of these global challenges.\n\nThe AfCFTA offers a critical pathway for Africa to build resilience, reduce dependence on external markets, and drive sustainable industrialisation.\n\nProf Ncube said it was disheartening that despite having a market of 1,4 billion people and a combined Gross Domestic Product (GDP) exceeding US$3.4 trillion, current intra-Africa trade remains minimal.\n\nIf fully embraced, he said, the AfCFTA has the potential to boost intra-African trade by 45 percent by 2045, and emphasised the need to address implementation gaps that result in uneven progress due to structural barriers, inadequate infrastructure, and limited access to trade finance.\n\nThe speed of success of the AfCFTA partially depends on the reform of the global financial architecture to make it responsive to the needs of the continent and other developing countries in general, said Prof Ncube.\n\nIn the short term, there is need for immediate implementation of the reallocation of the Special Drawing Rights (SDRs) resolution to the need countries.\n\nIn the medium to long term, there is need for the international community to come up with strategies to address the growing debt challenge for developing countries, as well as ease access concessional financing.\n\nIn view of global aid restructuring and weaponisation of donor support in some instances, Prof Ncube stressed the need for Africa to deepen domestic resource mobilisation capacity as a critical resilience pillar.\n\nHe commended the conference for mainstreaming the call to accelerate the implementation of the AfCFTA and establishing Africa as a key player in the reconfiguration of global trade.\n\nPrior to the ministers summit, experts who gathered earlier also tackled the pressing economic challenges facing the continent and proposed several strategic priorities to guide policy actions.\n\nThese included the need to enhance regional value chains and trade infrastructure, strengthening production and supply chains in key sectors such as agriculture, manufacturing, and services to maximise value-addition and reduce Africas reliance on raw commodity exports.\n\nBy fostering stronger intra-African linkages, we can transition to high-value industries and competitive regional markets, said Prof Ncube.\n\nThe need to address trade barriers, and access to finance, implementing harmonised trade regulations, eliminating non-tariff barriers, restrictions of movement of people across borders, and scaling up innovative financing mechanisms like blended finance, thematic bonds, and trade facilitation funds, also came to the fore.\n\nThe conference also shined the light on embracing digital innovations for trade expansion. On this, Prof Ncube said Africa must enhance its engagement in the digital economy by integrating e-commerce, digital trade platforms, and fintech solutions into the AfCFTA framework.\n\nThis will drive efficiency, reduce transaction costs, and open access to new markets, he said.\n\nProf Ncube also called for strengthening macroeconomic stability and governance, enhancing fiscal discipline, improving debt management, scaling up domestic resource mobilisation and aligning national policies with regional integration commitments.\n\nHe said South Africas presidency of the G20 must also be leveraged to ensure the continents voice is heard on the vital need to reform the global financial architecture to achieve desired sustainability, and combating illicit financial flows.\n\nBy leveraging our position, we can push for more inclusive frameworks that empower African nations to also engage meaningfully in the global economy, stimulate investment in key sectors, and support sustainable development goals, said Prof Ncube.\n\nDuring its tenure as chair, Zimbabwe has been a strong advocate for accelerating green industrialisation and climate finance, which Prof Ncube said will ensure that Africas trade growth aligns with its sustainable development goals.\n\nIntegrating climate-smart trade policies into the AfCFTA will unlock new opportunities in renewable energy, carbon markets, and green supply chains, positioning Africa as a leader in sustainable industrialisation. Africa cannot afford to remain on the margins, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dvfhuhuudgiodfgusdfd.jpg",
            "description": "Prosper Ndlovu, prosper.ndlovu@chronicle.co.zw AMID the global economic landscape shift characterised by rising geopolitical tensions and increased trade protectionism, Zimbabwe has rallied its regional peers to urgently embrace the African Continental Free Trade Area (AfCFTA) and accelerate regional integration as a spring board of resilience and driving solid economic transformation of Africa. African economies are not […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Umguza VTC leads training revolution",
            "url": "https://www.chronicle.co.zw/umguza-vtc-leads-training-revolution/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nWITH 58 students enrolled in a diverse range of industry-tailored courses, from plumbing and hotel catering to agriculture, the Umguza Vocational Training Centre (VTC) is proving to be a vital source of opportunity for young people in Matabeleland North Province, addressing a critical skills gap for both job creation and entrepreneurship.\n\nThe skills centre, located approximately 40 kilometres along the Bulawayo-Victoria Falls Road, offers courses in motor mechanics, hotel and catering, clothing and textile technology, building, solar installation, plumbing, welding, and cosmetology.\n\nAdditionally, an agriculture course is mandatory for all students.Umguza VTC stands as the sole operational centre in Matabeleland North Province, which encompasses seven districts: Binga, Bubi, Hwange, Lupane, Tsholotsho, Nkayi and Umguza.\n\nA Parliamentary Portfolio Committee on Youth Empowerment, Development and Vocational Training visited the facility on Thursday and were impressed by the services provided. The committee pledged to engage the parent ministry to replicate the programme in all other districts within Matabeleland North Province.\n\nThe visit formed part of a nationwide tour of selected VTCs, aimed at assessing the operational state of the centres, evaluating the relevance of the curriculum and identifying areas requiring intervention.\n\nActing head, Mrs Sarudzai Nyoni, stated that since opening its doors in 2015, Umguza VTC has produced hundreds of graduates who seamlessly integrate into the demanding environments of competitive industries, including hospitality, construction, agriculture and clothing.\n\nOur courses are specifically designed to meet the needs of industries and companies across the country. Umguza VTC has established partnerships with hotels, fast-food outlets and supermarkets, where our hotel and catering students, for example, undertake their industrial placements.\n\nOur students have a distinct advantage over their peers from other learning institutions, as our courses emphasise 80 percent practical work and 20 percent theory. This is reflected in the positive feedback they receive from companies during their industrial attachments, Mrs Nyoni said.\n\nThe agriculture department boasts a fully operational dairy production unit, currently housing 31 cows and calves, according to farm manager, Mr Bartholomew Njini.\n\nMilk produced on the farm is sold to a well-established milk processing company based in Bulawayo, with some also sold to local schools and the community.\n\nHotel and catering students serve their dishes (left), the centre field with maize and bean crop, and dairy cattle at Umguza Vocational Training Centre in Umguza District, Matabeleland North Province\n\nThe dairy farm provides our students with invaluable hands-on practical lessons in milk production and animal husbandry. As agriculture is compulsory, every student leaves Umguza VTC equipped with essential farming skills, contributing to the Governments advocated agricultural revolution, he said.\n\nThe committee expressed their appreciation for the operations of Umguza VTC and were particularly impressed with the centres business unit.\n\nCommittee chairperson, Cde Mutsawashe Ziyambi, stated that the committee will engage the Ministry of Youth Empowerment, Development and Vocational Training to replicate the business model at Umguza VTC in other centres nationwide.\n\nThe business unit here is unique to Matabeleland North Province, but there is much that can be learned and replicated at other skills centres to make our VTCs profitable and self-sustaining.\n\nWe want to see VTCs operational in all seven districts of Matabeleland North Province, and the work we have witnessed here demonstrates that our VTCs are capable of producing graduates who are industry-ready and prepared to embark on entrepreneurial ventures.\n\nThe ministry itself was formed in 2023 to focus solely on vocational training and youth empowerment, and the committee will push for the establishment of VTCs in all of the countrys districts, said Cde Ziyambi.\n\nThe committee has so far visited VTCs in Mutare, Masvingo, Filabusi and Umguza and is scheduled to visit Midlands Province today. There are 45 VTCs in Zimbabwe, along with 25 satellite stations distributed across 10 administrative provinces, divided into 64 districts.\n\nVTCs prioritise practical, hands-on learning, rather than a purely academic curriculum. They typically provide programmes in various fields, including carpentry, welding, cosmetology, computer repair and mechanics.\n\nThe training is designed to prepare individuals for employment by imparting industry-specific knowledge and skills. Some VTCs even assist graduates with job placement after graduation.\n\nLast year, Mr Ranson Madzamba, director of communications and advocacy in the Ministry of Youth Empowerment, Development and Vocational Training, stated that the Government is working to establish VTCs across the country.\n\nOur strategy as a ministry is to expand the vocational training initiative by setting up new VTCs in all districts within Zimbabwe, ensuring that young people and communities have access to skills training initiatives.\n\nCurrently, the ministry operates a total of 45 fully established VTCs and 25 satellite centres have been set up to support these existing centres due to the demand for VTCs within communities across the country, he said.The Government has developed a vocational training transformation roadmap, which is being implemented until 2027.\n\nThis exercise will oversee the modernisation of VTCs, ensure infrastructural development and quality assurance and standardisation of VTC operations. Financial models are also being developed to support this initiative, while also engaging other stakeholders within the public and private sectors, he said.\n\nA directive has been issued to the Public Service Commission to ensure that existing VTCs are adequately staffed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/saedf.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com WITH 58 students enrolled in a diverse range of industry-tailored courses, from plumbing and hotel catering to agriculture, the Umguza Vocational Training Centre (VTC) is proving to be a vital source of opportunity for young people in Matabeleland North Province, addressing a critical skills gap for both job creation and entrepreneurship. The […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "‘Bulawayo industrial focus requires re-orientation’",
            "url": "https://www.chronicle.co.zw/bulawayo-industrial-focus-requires-re-orientation/",
            "content": "Sikhulekelani Moyo,[emailprotected]BULAWAYO Mayor, Mr David Coltart, has said there is need to reimagine the citys industrialisation focus and anchor it on low-hanging fruit industries after the majority of the yesteryear industrial firms folded.\n\nOnce Zimbabwes industrial hub, most industries that used to operate in Zimbabwes second largest city closed due to the effects of illegal sanctions.\n\nThe passage of time has also made some of the industries irrelevant or less competitive in a global village while others migrated to other cities across the country. The demise of many industrial companies in Bulawayo resulted in the loss of jobs for many people, driving unemployment rates higher across the country.\n\nWith the Governments drive to reindustrialise the country, Mr Coltart said some of the industries were no longer relevant or able to withstand stiff global competition.\n\nHe said some industries survived in the past because Zimbabwe was a closed economy, with few imports finding their way into the domestic economy.\n\nThe world is now different to that of the 1980s, many of the industries that were present in the city were designed for a closed economy that has been subjected to the United States sanctions. (Back then) it was very difficult to get imports in, said Mr Coltart.\n\nUnfortunately, the world has moved on from that and the emergency in particular of China and its manufacturing capacity has affected strong economies like America and many jobs have moved from America to China.\n\nSo, Zimbabwe is no different, and Bulawayo too, we need to embrace that reality as we seek to industrialise the city. We cannot hope to get the same industries we had in the 1970s and 80s as it will be very difficult for us to compete.\n\nWe have to rethink the economy of the city, there is no doubt that there are some industries that can be redeveloped where we have a comparative advantage, where we can beneficiate certain products produced within Zimbabwe.\n\nFor example, the textile industry, assuming we can take cotton production to where it was, there is a potential that we could have a vibrant textile industry.\n\nMr Coltart said it would be difficult to bring back companies like Supersonic, which cannot compete with Chinese and Japanese giants in the electronic industry. However, he said the best way to reindustrialise the city was to lure multinational electronic companies to invest in the city and produce for the rest of Africa.\n\nThe city, he added, needed to come up with incentives to attract investors. Commenting on reimagining the citys economy, Mr Coltart said the city had many idle spaces, which could be used as call centers to create new employment opportunities.\n\nMr Coltart also said new industries could be created in tourism by making the city more accessible through increased flights, which could drive the utilisation of hotels, lodges, and other facilities, creating new jobs.\n\nTo drive economic growth, the mayor said the Bulawayo City Council needed to create an attractive environment for doing business. This included guaranteeing the delivery of basic services like water to ensure a healthy and clean city and enforcing the rule of law to curtail vices like illegal vending and corruption.\n\nHe also said the Government should entrench devolution to decentralise more essential services so that companies bring back their headquarters to Bulawayo.\n\nWith the National Development Strategy (NDS 1) running its course this year, President Mnangagwa is on record saying its successor, NDS2, will focus on value addition and industrialisation, to grow the manufacturing industry from US$4 billion to over US$10 billion.\n\nBulawayo businessman and former Zimbabwe National Chamber of Commerce Matabeleland Chapter vice president, Mr Louis Herbst, said the city thrived as an industrial hub due to a confluence of factors that fostered a vibrant economic landscape.\n\nMr Herbst\n\nThe city also benefited hugely from its strategic location at the centre of essential transportation networks that facilitated trade, making it the ideal site for manufacturing and distribution.\n\nSimilarly, abundant natural resources that supported various industries, particularly in manufacturing and processing and the presence of key educational institutions that produced skilled labour made the city attractive to industrial firms.\n\nTo effectively reindustrialise Bulawayo, a comprehensive approach is essential, involving collaboration among various stakeholders. One of the initial steps should be a thorough assessment of goods and commodities in demand, conducted locally and nationally and thereafter in partnership with SADC and the African Continental Free Trade Area, said Mr Herbst.\n\nThis will help to focus and identify opportunities for growth and key areas for improvement. Emphasising technological advancements such as artificial intelligence, robotics, and cybersecurity will be crucial for enhancing productivity and competitiveness.\n\nIndustries must also determine whether to prioritise manufacturing for local market growth or focus on exports, as this strategic choice will guide their retooling efforts to ensure competitiveness in both sectors.\n\nHe also said it was critical to implement stricter border controls to support the consumption of locally manufactured products, bolster the economy, promote industrial growth and create employment.\n\nMr Herbst also said to promote investment and stabilise the economic environment in Bulawayo and Zimbabwe in general, a minimum taxable wage policy should be introduced.\n\nHe said this initiative would not only benefit the Government by increasing its tax revenues but also drive economic growth and improve the livelihoods of citizens.\n\nEstablishing a minimum wage would create a more appealing framework for formal employment, encouraging individuals to transition from informal trading to stable jobs, he said.\n\nThis shift would foster a more productive workforce and contribute significantly to the overall economic development of Zimbabwe and the region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cvxzbstrbxcv.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com BULAWAYO Mayor, Mr David Coltart, has said there is need to reimagine the city’s industrialisation focus and anchor it on low-hanging fruit industries after the majority of the yesteryear industrial firms folded. Once Zimbabwe’s industrial hub, most industries that used to operate in Zimbabwe’s second largest city closed due to the effects […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Self-sufficient and equipped women break the backbone of poverty",
            "url": "https://www.chronicle.co.zw/self-sufficient-and-equipped-women-break-the-backbone-of-poverty/",
            "content": "AS the world celebrates International Womens Month, Bulawayo has become a beacon of hope and empowerment, showcasing the transformative impact of women breaking barriers in business.\n\nThe city is alive with stories of women who are not only overcoming challenges but also driving economic growth, contributing to their communities and reshaping the socio-economic landscape.\n\nAt the heart of this movement, the Isilwane Youth Centre in Bulawayos Old Pumula suburb buzzed with energy as women from diverse backgrounds gathered to commemorate Provincial International Womens Day.\n\nThis years theme, For All Women and Girls: Rights, Equality, and Empowerment, highlighted the significant strides women are making across various sectors.\n\nBulawayo Provincial Director for Economic Development Mr Simon Saunyama and Ministry of Women Affairs Community Small and Medium Enterprise Provincial Development Officer Bulawayo Province Glory Damba (left) tour the stands during International Womens Day Commemorations at Isilwane Youth Centre in Pumula.\n\nThe event was a celebration of resilience, innovation and determination, with women-led businesses proudly showcasing a range of products from beadwork to cosmetics and detergent production. These women are not just business owners; they are pioneers of change, proving that economic empowerment is not a distant dream, but a present reality.\n\nOne such inspiring figure is Anastacia Ncube, a detergent manufacturer who has turned her small-scale operation into a thriving business.\n\nAnastacias story is one of self-reliance, starting from humble beginnings by selling dried vegetables and later expanding into manufacturing.\n\nShe advocates for innovation and urges women to formalise their businesses to tap into broader markets. Her message is clear: women should start with what they have, be it small or large and build from there.\n\nSimilarly, 24-year-old Patience Malunga exemplifies the power of modern technology in skill development. By learning traditional crafts and bead-making techniques through online tutorials, Patience has not only enriched her own life but has contributed to her familys financial stability.\n\nHer success underscores the importance of embracing new learning methods and shows how young women are using digital platforms to turn their passion into profit.\n\nSupporting these women are organisations like Emthonjeni Womens Forum and Pumula Arts and Crafts Organisation, which focus on economic justice and skill-building for women. These initiatives teach women how to be self-sufficient, equipping them with the necessary tools to thrive. The emphasis on economic independence has become a driving force in the fight against poverty, illiteracy and malnutrition.\n\nPatience exhibits her wares at the International Womens Day Commemorations at Isilwane Youth Centre in Pumula suburb,\n\nThe Government also recognises the pivotal role of women in economic development.Bulawayo Provincial Affairs and Devolution Minister, Judith Ncube, reaffirmed the governments commitment to womens empowerment, stressing its role in poverty alleviation and national progress. Further support for aspiring businesswomen is being provided through initiatives such as Mist Corporate Services, which offers guidance on business registration and financial literacy.\n\nAs the global push for gender equality continues, Bulawayo is demonstrating that empowering women is not just a moral imperative, but a crucial ingredient for economic growth and social transformation. By fostering an environment of support, education and opportunity, women in Bulawayo are creating a brighter future for themselves and their communities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/SA.jpg",
            "description": "AS the world celebrates International Women’s Month, Bulawayo has become a beacon of hope and empowerment, showcasing the transformative impact of women breaking barriers in business. The city is alive with stories of women who are not only overcoming challenges but also driving economic growth, contributing to their communities and reshaping the socio-economic landscape. At […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        },
        {
            "title": "Seven penalties awarded  in PSL matches",
            "url": "https://www.chronicle.co.zw/seven-penalties-awarded-in-psl-matches/",
            "content": "Fungai Muderere,[emailprotected]\n\nTHE Castle Lager Premier Soccer League Week Three action produced a total of 16 goals to take the seasons tally to 41 after 27 matches.\n\nIn the opening week, 10 goals were scored before the number went up to 15 in the second week of the countrys elite football action.\n\nFormer Cup Kings, CAPS United and newbies, MWOS, were the biggest scorers of the weekend after posting identical 2-0 triumphs over Triangle United and Yadah Stars, respectively.\n\nTelOnes Washington Navaya took his seasons tally to three when they drew one all against Dynamos.\n\nHaving scored three goals, Navaya is now the leading goal scorer with Highlanders Brighton MaNinja Ncube.\n\nThe duo is followed by Jaun Mutudza (CAPS United), Masimba Mambare (Kwekwe United) and Billy Veremu (MWOS) who all have two goals each under their belts.\n\nSeven penalties have been awarded thus far, with Bossos Ncube, Veremu of MWOS, Ngezi Platinum Stars Kudzai Chigwida and Manica Diamonds Evans Katema converting theirs, while Blessing Sahondo of TelOne and Menford Mudzimu of Triangle missed their respective spot-kicks.\n\nCAPS United registered their first win of the 2025 Castle Lager Premier Soccer League (PSL) season after beating Triangle United 2-0 on Sunday.\n\nThe Green Machine had failed to win in their first two games of the campaign, drawing 1-1 against Green Fuel before losing 2-0 to Scottland FC in the previous round.\n\nMutudza delivered the victory for the visitors with his first half brace.\n\nMutudza scored the opener on the quarter hour mark before sealing his brace on minute 26.\n\nIt was the first brace of the season while Bossos Ncube found the first hat-trick of the 2025 PSL campaign.\n\nThe result also stretched Triangles poor start, with the Luke Masomere coached Sugar Boys yet to pick a point in their three opening games this season.\n\nTwo own goals have been scored, the latest being that of Pawell Govera when TelOne drew one all against Dynamos on Saturday.\n\nPSL 41 goals so far\n\n3 Brighton Ncube( Highlanders), Washington Navaya (TelOne),\n\n2 Jaun Mutudza CAPS United, Masimba Mambare Kwekwe United, Billy Veremu (MWOS)\n\n1 Tinashe Ruzive (Bikita Minerals), Jayden Bakare (CAPS United), Brian Muza (Chicken Inn), Thandolwenkosi Ngwenya ( FC Platinum), Vincent Nyangulu (FC Platinum), Denzel Mapuwa, Perfect Chikwende, Ronald Chitiyo (Greenfuel), Prince Chama Herentals Kundai Sangare (Herentals),Melikhaya Ncube, Prince Ndlovu, Reason Sibanda (Highlanders), Evans Katema, Fortune Binzi (Manica Diamonds), Salif Cheya, Wilson Mensah (MWOS) Ashwan Karengesha,KudzaiChigwida, Malvin Gaki (Ngezi Platinum), Isasker Gurirab (Simba Bhora), Tymon Machope, Sydney Urikhobo (Scottland), Tawanda Macheke,Bruno Mtigo, Blessing Sahondo (TelOne), Menford Mudzimu (Triangle)\n\nOG Blessing Chiota (Triangle) vs Scottland Week 1, OG Pawell Govera(Tel One) vs Dynamos Week 3.  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fvdvgdfvga.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.co.zw THE Castle Lager Premier Soccer League Week Three action produced a total of 16 goals to take the season’s tally to 41 after 27 matches. In the opening week, 10 goals were scored before the number went up to 15 in the second week of the country’s elite football action. Former Cup Kings, […]",
            "time": "08:42",
            "date": "18 Mar 2025"
        }
    ]
}