{
    "news": [
        {
            "title": "Government launches nationwide youth consultations to formulate empowerment strategy",
            "url": "https://www.chronicle.co.zw/government-launches-nationwide-youth-consultations-to-formulate-empowerment-strategy/",
            "content": "Sukulwenkosi Dube-Matutu[emailprotected]\n\nThe Government, through the Ministry of Youth Empowerment, Development and Vocational Training, has rolled out youth consultations across the country, which will lead to the formulation of a youth empowerment strategy.\n\nYouths and other stakeholders from Matabeleland South follow proceedings during a consultative meeting\n\nThe consultative process, which started yesterday in Masvingo, will run up to 3 March.\n\nThe exercise is being held in partnership with the United Nations and Silveira House.\n\nSpeaking during a Matabeleland South consultative meeting held at Mount Cazalet Lodge in Gwanda, the Director of Strategic Planning and Policy Planning, Monitoring and Evaluation, Dr Blazio Manobo, said the strategy will help guide the Government on how to tackle youth empowerment.\n\nAs a Ministry, we have engaged in a consultative process which will lead to the formulation of a youth empowerment strategy, which will guide the process of empowering youths. Out of about 5.4 million youths, 2.2 million are just idle.\n\nWe know the reasons why this is so, but now we want to know what the Government can do for you as youths. We are moving around all provinces in the country to get inputs from you as youths on what you would want to be done, he said.\n\nDr Manobo urged the youths to think big and come up with ideas that will have a huge economic impact.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/222.jpg",
            "description": "Sukulwenkosi Dube-Matutu sukulwenkosi.dube@chronicle.co.zw The Government, through the Ministry of Youth Empowerment, Development and Vocational Training, has rolled out youth consultations across the country, which will lead to the formulation of a youth empowerment strategy. The consultative process, which started yesterday in Masvingo, will run up to 3 March. The exercise is being held in partnership […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Four children swept away while sleeping under bridge",
            "url": "https://www.chronicle.co.zw/four-children-swept-away-while-sleeping-under-bridge/",
            "content": "Patrick Chitumba,[emailprotected]FOUR children, aged between nine months and four years, were swept away after they fell asleep under a bridge while seeking shelter from the rain with their parents in Gokwe on Valentines Day.Midlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed that the police are investigating a drowning case involving four children, which occurred on February 14 in Gokwe South.The incident occurred at around 3.30AM when a congregation of an Apostolic Church sect of about 20 people were praying near Tare Bridge along Gokwe-Siabuwa road, he said.Insp Mahoko said seeking refuge from the initial light rain, the group took shelter under a dry bridge.\n\nHowever, he said, as the rain intensified upstream, a sudden wave of floodwater swept in, catching them off guard.Insp Mahoko said although the adults were able to wake up and rescue themselves, tragically, the four children drowned.Two children are from Kamba Village and their names are Beauty and Devine Mavhiringani (9 months and 4 years). The other two are Pamela Natare (1 year 9 months) of Tsive Village and Effort Shava (3) of Mudzimiri Village.\n\nThe bodies Devine, of Pamela and Effort were later found at the river bank between 1 kilometre and about 20 kilometers from Tare bridge, he said.Insp Mahoko said a search is still going on to locate the outstanding body of Beauty.The retrieved bodies were taken to Gokwe South District Hospital Mortuary and investigations are still underway,  he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/01/Untitled-29-11.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw FOUR children, aged between nine months and four years, were swept away after they fell asleep under a bridge while seeking shelter from the rain with their parents in Gokwe on Valentine’s Day. Midlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed that the police are investigating a drowning case involving four children, […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Commercial trucks surge at new Beitbridge border",
            "url": "https://www.chronicle.co.zw/commercial-trucks-surge-at-new-beitbridge-border/",
            "content": "Thupeyo Muleya, Beitbridge BureauTHE volume of commercial trucks accessing many countries north of the Zambezi River through Beitbridge Border Post has increased in the last four years.It is understood things started changing at the border post following the transformation of the facility at a cost of US$300 million private public partnership between the Government and the Zimborders Consortium.Government among other things, in the last five years adopted the Zimbabwe is Open for Business mantra in conjunction with its massive regional and international re-engagement initiatives, primed to remove the country from isolation and to rebuild the economy.Prior to the latest development the Beitbridge Border Post had become a nightmare for many travellers and commercial cargo transporters (both local and in transit to other countries).In addition, the streamlining of operations under the border efficiency management system and a change in attitude by border workers has seen many transporters and travellers considering Zimbabwe as a transit route of choice in Sadc.\n\nZimbabwe Revenue Authoritys (Zimra) manager for Beitbridge region, Mrs Lonto Ndlovu told members of the Sadc secretariat on a study visit to the border last week that the volume of commercial trucks passing through the border was increasing yearly.The volume of commercial trucks entering or leaving the country through this border is increasing each year beginning from 2021, said Mrs Ndlovu.In 2021, we processed 83, 735 incoming and 149, 012 outgoing trucks and 93, 916 incoming and 125, 260 outgoing in 2022.Further, we processed 124, 171 incoming trucks and 130, 538 outgoing trucks in 2023 and last year we handled 217, 152 in coming and 254, 8752 outgoing trucks.She said among other things the tax authority had automated services and was using the pre clearance system to reduce the turnaround time of trucks at the border from the previous more than 24 hours to less than three hours.\n\nMrs Ndlovu said the use of fast mobile cargo scanners with the capacity to process 120 commercial trucks under one hour and also using the Authorised Economic Operators model had ensured that Zimra clears freight faster.According to Zimra an Authorized Economic Operator is any entity involved in the movement of goods internationally in accordance with terms and conditions, as well as functions set and approved by Zimra as complying with World Customs Organisation (WCO) or equivalent supply chain security standards.AEOs include, inter alia manufacturers, importers, exporters, clearing agents, carriers, consolidators, intermediaries, ports, airports, terminal operators, integrated operators, warehouses, distributors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bggfggh.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE volume of commercial trucks accessing many countries north of the Zambezi River through Beitbridge Border Post has increased in the last four years. It is understood things started changing at the border post following the transformation of the facility at a cost of US$300 million private public partnership between the […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Chillspot Records producer, Ribhe denies spiking drink, assaulting minor as rape trial opens",
            "url": "https://www.chronicle.co.zw/chillspot-records-producer-ribhe-denies-spiking-drink-assaulting-minor-as-rape-trial-opens/",
            "content": "Zvikomborero Parafinim, Harare Bureau\n\nChillspot Records producer Tafadzwa Ribhe Mandaza has pleaded not guilty to charges of raping a 14-year-old girl. Appearing before Harare magistrate Clever Tsikwa, Mandaza denied allegations of spiking the teenagers drink and assaulting her.\n\nMandaza asserted that he neither engaged in sexual activity with the minor nor administered any substances to her. He stated that on the alleged date, he was performing his duties as a DJ at entertainment venue, Mashwede Village in Harare, where the girl and her friends were present.\n\nThe prosecution alleges that on October 16, 2024, the victim failed to return home from school. Her father, upon investigation, discovered she had been absent from classes for two consecutive days. It is claimed that during this period, the girl was in the company of Mandaza and others at the entertainment venue, where she was given an unknown substance and later assaulted. The girl reportedly regained consciousness at Mandazas residence and was found in Highfield after a missing person report was filed.\n\nDuring a previous bail hearing, it was revealed that the victim provided conflicting statements. Initially, she did not mention any assault; however, in a subsequent statement, she alleged that her drink was spiked and she was assaulted. This inconsistency led the State to consent to Mandazas bail application, which was granted by Justice Regis Dembure.\n\nThe trial is set to continue, with the victims father scheduled to testify.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jnjk.jpg",
            "description": "Zvikomborero Parafinim, Harare Bureau Chillspot Records producer Tafadzwa ‘Ribhe’ Mandaza has pleaded not guilty to charges of raping a 14-year-old girl. Appearing before Harare magistrate Clever Tsikwa, Mandaza denied allegations of spiking the teenager’s drink and assaulting her. Mandaza asserted that he neither engaged in sexual activity with the minor nor administered any substances to […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Man Utd stars ‘speak behind Ruben Amorim’s back’ as squad lose faith in struggling boss",
            "url": "https://www.chronicle.co.zw/man-utd-stars-speak-behind-ruben-amorims-back-as-squad-lose-faith-in-struggling-boss/",
            "content": "Some Manchester United players are said to be losing confidence in Ruben Amorims tactics amid his underwhelming start to life at Old Trafford.\n\nAmorim, 40, has only been in the job since the middle of November, with United having paid 11million (9.25m) to bring him in from Sporting Lisbon. The Red Devils have averaged a match every four days since his first game, affording him limited time on the training ground to implement a system which is unfamiliar to most of his squad.\n\nOnly five teams have won fewer points in the Premier League since the Portugueses arrival, leaving United 15th in the table and on course for comfortably their worst season since their infamous relegation in 1974. Amorim wont change his approach, though, as hes welded to his 3-4-2-1 formation, a stance which is being questioned inside the dressing room.\n\nThe Mail report that a section of Uniteds squad believe that even when they win, its largely down to individual moments of quality or good fortune rather than Amorims tactics working out.\n\nAccording to the newspaper, a source revealed: The feeling is, We got away with one but we might not be so lucky next time.\n\nThe feeling from that particular group of unnamed players stems from the number of late goals that United have scored in recent weeks, turning draws into wins. The Red Devils have scored late against Leicester, Fulham, Rangers, Southampton, Manchester City and Viktoria Plzen, with their performances in most of those games being criticised.\n\nSimilar reports of behind-the-scenes discontent have emerged under previous managers, namely David Moyes, Louis van Gaal, Jose Mourinho, Ole Gunnar Solskjaer, Ralf Rangnick and Erik ten Hag. Amorims fuse appears to be shorter than his predecessors, who all bemoaned the rigours of the job later in their tenures.\n\nBut after Sundays dire 1-0 defeat at Tottenham, who theyve lost to three times this season, Amorim told Sky Sports: What you see guys and what you discuss every week, I also see. I have a lot of problems, my job is so, so hard here. But I stick with my beliefs.\n\nUnited are back in action on Saturday, as they make the trip to Goodison Park for the final time to face Everton. Mirror\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ghfghgf.jpg",
            "description": "Some Manchester United players are said to be losing confidence in Ruben Amorim’s tactics amid his underwhelming start to life at Old Trafford. Amorim, 40, has only been in the job since the middle of November, with United having paid €11million (£9.25m) to bring him in from Sporting Lisbon. The Red Devils have averaged a […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Bhutisi calls for fresh approaches to comedy content creation",
            "url": "https://www.chronicle.co.zw/bhutisi-calls-for-fresh-approaches-to-comedy-content-creation/",
            "content": "Showbiz Reporter\n\nVeteran comedian Admire Bhutisi Kuzhangaira, renowned for his satirical skits over the past 11 years, has urged emerging comedians to innovate beyond traditional formats.\n\nIn a recent social media post, Bhutisi spoke on the need for fresh approaches in content creation, particularly in skits, which he believes have become oversaturated.\n\nReflecting on his decade-long journey, Bhutisi noted, Ive been in the game for over 10 years . . . Ive made mistakes, learnt a lesson, and won along the path. Id like to say, its been an eye-opening experience.\n\nHe shared his evolution into a communication expert.Ive gained so much knowledge in the area over the years. Ive been manufacturing laughter and working with different companies in communicating messages to their target market. I mastered the art of persuasion and Ive since graduated into a communication expert.\n\nAddressing the future of skits, Bhutisi said, The format has stayed in fashion for too long. It has become something anyone can just do as if its an application that comes with any smartphone, (who will pay for something that they can do on their own), so is the podcast madness which has become oversubscribed.With the turning of tables in the content creation space, this is an alarm call to my fellow and junior skits producers to start creating new formats.\n\nHe suggested that reality television could be the next significant trend, advising, My lucky tip as you create, please go in the direction of reality television.\n\nBhutisi concluded with a call to action for fellow creators: The only way and hope that skits will remain is to make a hybrid format by adding unique elements to them. Lets create knowing we are in the last phase.\n\nThe Zimbabwean actor, comedian, and filmmaker gained recognition through his involvement in the comedy show P.O Box Reloaded and his work with the organisation P.O. Box. Kuzhangaira co-founded P.O. Box with Rolland Lunga (Boss Kedha) and Lucky Aaroni, and later co-founded P.O Box Reloaded with Lunga. He has also been involved in various film and television projects, earning accolades such as the Nama 2019 Film and Television Award for Outstanding Actor.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bhutisi.jpg",
            "description": "Showbiz Reporter Veteran comedian Admire “Bhutisi” Kuzhangaira, renowned for his satirical skits over the past 11 years, has urged emerging comedians to innovate beyond traditional formats. In a recent social media post, Bhutisi spoke on the need for fresh approaches in content creation, particularly in skits, which he believes have become oversaturated. Reflecting on his […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "DJ Mapressa calls for greater recognition of Themba ‘Boyoyo’ Mathe",
            "url": "https://www.chronicle.co.zw/dj-mapressa-calls-for-greater-recognition-of-themba-boyoyo-mathe/",
            "content": "Showbiz Reporter\n\nDJ Mapressa, a South Africa-based DJ, radio presenter, and dynamic MC from Tsholotsho, has praised maskandi musician Skhosana Buhlungu as the luckiest artiste in the Matabeleland region while highlighting Rhumba musician Themba Boyoyo Mathe as the most unfortunate.\n\nBuhlungu, born Clopas Sikhosana from Gwamba Village in Nkayi, gained prominence in 2020 with his viral Covid-19 song, Isomiso, which highlighted the pandemics impact on rural communities.\n\nThe songs relatable lyrics resonated deeply, leading to widespread recognition. Musician Madlela Skhobokhobo took the initiative to support Buhlungu by facilitating his recording sessions at Cite Zw studios in Bulawayo, enabling him to produce his first album. That same year, Buhlungu received the Best Newcomer award at the Bulawayo Arts Awards.\n\nFrom there, the self-taught guitarists career soared, leading to the release of his debut album. His inspiring journey attracted the attention of various companies and local communities, who rallied to support him in multiple ways, including assisting in building a modern home for the rising star.\n\nThis inspiring success story, led DJ Mapressa, recognised as the first DJ from Tsholotsho to gain significant recognition in the music industry, to single out Skhosana through a Facebook post on Tuesday.Wrote DJ Mapressa: Also known as umculi olenhlanhla yamaSwazi esiNdebeleni ngubaba u Skhosy. In less than a year, he has achieved remarkable milestones. He has built a house, received cattle as a gift, won a national award, and secured a brand ambassadorship.\n\nThemba Boyoyo Mathe\n\nHowever, DJ Mapressa also drew attention to the contrasting journey of Boyoyo, celebrated for his significant contributions to the Kalanga music genre. Born in Kezi, a region known for producing musical talents, Mathe has been instrumental in popularising Kalanga music both locally and internationally.\n\nIn 2013, Boyoyo departed from Mokis Connection to form his own ensemble, Boyoyo and Mthimbani Sound Blasters. Despite facing personal challenges, including blindness in 2014, he continued to produce music, releasing albums such as Nansi Ndoda, Sengi Discover Itsotsi and MaTouch Screen.\n\nHowever, according to DJ Mapressa, the former Mokis Connection band member, has faced challenges within the region, including a lack of support and recognition.The most unfortunate artiste among the Ndebele clan is Themba Boyoyo. But remember, he is notably the only Rhumba artiste known to have embarked on a seven-hour-long flight, to play his music in various countries. He is recognised as the godfather of the Ayibophe Rhumba version. He has choreographed nearly 80% of existing Rumba dance styles.Over 20 Rhumba groups have adopted his style (or his unique footwork). He is the first artiste to release more than eight hit albums consecutively. He is the first artiste to tour the entire country with a band that replicates the exact sound of his cassette recordings.His event holds the record for the highest CD sales in Rhumba history. Despite these significant achievements, he has not been fortunate within the Ndebele community, receiving no love from the people he has supported for years, wrote DJ Mapressa.\n\nDJ Mapressa indicated that it is important for locals to acknowledge the artistes contributions and offer him the love and appreciation he deserves.I understand that its easy to give him Boyoyo material things, but we should also show him love in this post or any positive comments we can make about him.\n\nFollowing DJ Mapressas post, there have been suggestions to provide an account number for donations to support Themba Boyoyo Mathe. Additionally, some have proposed organising a fundraising event to showcase his talent and provide financial assistance.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/mapressa.jpg",
            "description": "Showbiz Reporter DJ Mapressa, a South Africa-based DJ, radio presenter, and dynamic MC from Tsholotsho, has praised maskandi musician Skhosana Buhlungu as the luckiest artiste in the Matabeleland region while highlighting Rhumba musician Themba “Boyoyo” Mathe as the most unfortunate. Buhlungu, born Clopas Sikhosana from Gwamba Village in Nkayi, gained prominence in 2020 with his […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Bulawayo man faces court for alleged gang rape and robbery",
            "url": "https://www.chronicle.co.zw/bulawayo-man-faces-court-for-alleged-gang-rape-and-robbery/",
            "content": "Lesley Chikudo[emailprotected]\n\nA 30-YEAR-OLD Bulawayo man who allegedly gang-raped and robbed a 28 year old woman along with an accomplice who is still at large has been dragged to court facing charges of rape and robbery.Tedious Makani of Pumula South suburb appeared before the Western Commonage magistrate Mrs Sibongile Marondedze on Monday who remanded him in custody to 25 February.According to the State case presented by Ms Christine Manyika, the incident occurred on 31 December 2024 at around 10pm at Jabulani car park in Pumula South when Makani and his accomplice approached the complainant.When the accused approached the complainant with an okapi knife, he demanded everything the complainant had and the complainant did not cooperate, she said.Makani then threatened to stab the complainant and then slapped her once. After that the complainant surrendered her cellphone, said Ms Manyika.The court heard that Makani then dragged the complainant to where his accomplice was.After that the dragged her to a house located in Nkulumane suburb that is still under construction, where they ordered the complainant to remove her clothes, said the prosecutor.Makani then removed his trousers to knee level and raped the complainant once.Makani then allegedly ordered his accomplice to have sexual intercourse with the complainant but he refused at first.Makani insisted and that is when he raped the complainant. After the act the two accused left the complainant still down and went away, said Ms Manyika.After the two had left, the complainant walked out of the building, and crossed the road where she met an unidentified man.She then disclosed what had happened to her. The man then proceeded to call the complainants husband who then came and took the complainant to the police, said Mrs Manyika.\n\nThe accused was arrested when the complainant received a call from the police to come and identify if the man who they had arrested matches with the description of the man who robbed and raped her. She positively identified him, leading to the arrest of the man.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/gavel-rape.jpg",
            "description": "Lesley Chikudo chikudolesley@gmail.com A 30-YEAR-OLD Bulawayo man who allegedly gang-raped and robbed a 28 year old woman along with an accomplice who is still at large has been dragged to court facing charges of rape and robbery. Tedious Makani of Pumula South suburb appeared before the Western Commonage magistrate Mrs Sibongile Marondedze on Monday who […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Two-year-old boy vanishes in Bulawayo, family and police launch search",
            "url": "https://www.chronicle.co.zw/two-year-old-boy-vanishes-in-bulawayo-family-and-police-launch-search/",
            "content": "Sidumisile Mabena,[emailprotected]A TWO-YEAR-OLD boys disappearance has sparked a frantic search in Bulawayo, after he vanished while playing outside his home on 26 January 2025.Meluleki Junior Nkiwane, a toddler from Dankirk Farm along Solusi Road was playing outside with other minors when he went missing, leaving his family and authorities searching for answers.He was wearing a light blue short, he is light brown in complexion and is about 80 cm in height, said the police in a press statement.Anyone with relevant information about Melulekis whereabouts is urged to contact the ZRP Pumula on 0292 422907 or 0776118096 or visit any nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/missing-nana.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A TWO-YEAR-OLD boy’s disappearance has sparked a frantic search in Bulawayo, after he vanished while playing outside his home on 26 January 2025. Meluleki Junior Nkiwane, a toddler from Dankirk Farm along Solusi Road was playing outside with other minors when he went missing, leaving his family and authorities searching for answers. […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        },
        {
            "title": "Herd boy jailed 18 years for raping neighbour’s child",
            "url": "https://www.chronicle.co.zw/herd-boy-jailed-18-years-for-raping-neighbours-child/",
            "content": "Thupeyo Muleya, Beitbridge BureauA 25-year-old man employed as a herd boy in the Tshinvhazwimi area under Chief Tshitaudze in Beitbridge was on Friday jailed for an effective 15 for raping a form two pupil (aged 15) who had been left in his custody on New Years Eve.Mickson Ncube was arrested after raping the complainant at knife point.Although he pleaded not guilty to a charge of rape, he was convicted on the strength of the State evidence when he appeared before Beitbridge regional magistrate Ms Charity Maphosa.Ncube was left with 15 years effective in jail after the magistrate conditionally set aside three years of the 18-year term for five years.Prosecuting, Mr Willbrought Muleya told the court that on December 31 the accused was left in the company of the two children by their mother who went to Beitbridge town.The mother did not return on the same day as promised due to other reasons.The court heard that later in the night, the complaint was awakened by Ncube who was caressing her.She then screamed for help, but it was in vain as Ncube threatened to stab her with a kitchen knife he had been holding.The accused lifted the victim from her room and took her outside where he met her young brother who had been awakened by her cry for help.Ncube also threatened to stab the minor before dragging the complainant to the bush where he raped her once at knife point.After the sexual abuse, he ordered the girl to return home where upon arrival informed her mother over the phone about the ordeal.A report was then made to the police who swiftly arrested Ncube.Of late there has been a surge in cases of rape involving herd boys around Beitbridge.A few weeks ago another herd boy from Gwanda who took turns with his friend to rape a 11-year-old girl from Mkhalipe area was sent to jail for an effective 18 years by a Beitbridge Regional Court.Proud Mnkhandla aged 31 is accused of having committed the offence in May this year along with another accomplice still at large.In December last year, a 36-year-old man from the Musane area under Chief Tshitaudze in Beitbridge has been jailed for an effective 15 years for sneaking into a neighbours homestead and raping her at knife point.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/gavel-rape.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A 25-year-old man employed as a herd boy in the Tshinvhazwimi area under Chief Tshitaudze in Beitbridge was on Friday jailed for an effective 15 for raping a form two pupil (aged 15) who had been left in his custody on New Year’s Eve. Mickson Ncube was arrested after raping the […]",
            "time": "18:31",
            "date": "18 Feb 2025"
        }
    ]
}