{
    "news": [
        {
            "title": "“These are not our trains”: NRZ",
            "url": "https://www.chronicle.co.zw/these-are-not-our-trains-nrz/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nThe National Railways of Zimbabwe (NRZ) has dismissed as false and malicious a picture circulating on social media, purportedly showing piled-up locomotives in Bulawayo.\n\nThe NRZ said the same picture once circulated in December 2023, with claims that the rundown trains were located somewhere in the City of Kings.\n\nThe National Railways of Zimbabwe (NRZ) has noted with great concern the misinformation circulating on social media platforms containing a picture of a fleet of old locomotives purportedly piling up somewhere in Bulawayo.\n\nThe same picture once circulated in December 2023, and we indeed clarified that those locomotives do not belong to NRZ, said NRZ spokesperson Mr Andrew Kunambura.\n\nWe once again dismiss the glaring disinformation, which appears to harbour malicious intentions. For the record, the NRZs fleet of locomotives does not and has never included the specific locomotives appearing in that picture.\n\nMr Kunambura stated that the picture is consistent with a Mediterranean climate, while Bulawayo, where peddlers falsely claim it is located, has no such vegetation.\n\nMoreover, a basic reverse Google picture authentication reveals that the picture is from the old Plazaola Station in Lekunberri, Spain, where people often go and have coffee. We encourage members of the public to ignore these malicious falsehoods, he said.\n\nThe NRZ said it stands ready to organise a tour of its Bulawayo premises for those who wish to see for themselves that the parastatal does not own the locomotives shown in the misleading social media posts.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ssssss.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com The National Railways of Zimbabwe (NRZ) has dismissed as false and malicious a picture circulating on social media, purportedly showing piled-up locomotives in Bulawayo. The NRZ said the same picture once circulated in December 2023, with claims that the rundown trains were located somewhere in the City of Kings. “The National Railways of […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "“President Mnangagwa’s vision for economic transformation highlighted at Palm River Energy groundbreaking” – VP Chiwenga",
            "url": "https://www.chronicle.co.zw/president-mnangagwas-vision-for-economic-transformation-highlighted-at-palm-river-energy-groundbreaking-vp-chiwenga/",
            "content": "Nqobile Bhebhe in Beitbridge\n\nVice President Dr Constantino Chiwenga has said the groundbreaking ceremony of the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone in Beitbridge is a demonstration of President Mnangagwas unwavering commitment to unlocking the countrys abundant natural resources for transformative economic progress.\n\nSpeaking at the groundbreaking ceremony in Beitbridge, Dr Chiwenga said the event marked a significant milestone in Zimbabwes ongoing journey towards industrialisation, sustainable development, and economic growth under the Second Republic.\n\nThe project we are launching today stands as a testament to the unwavering commitment of our guest of honour in unlocking Zimbabwes abundant natural resources for transformative economic progress, he said.\n\nHe added that the special economic zone is strategically positioned to serve as a regional hub for metallurgical and energy production, benefiting not only Zimbabwe but the entire Southern African region.\n\nHe noted that through President Mnangagwas steadfast commitment to engagement and re-engagement, significant strides have been made in improving the countrys investment climate, streamlining the ease of doing business, and building investor confidence.\n\nIn doing so, the government has laid a solid foundation for sustainable economic growth. Furthermore, the prioritisation of economic diplomacy highlights the importance of strengthening international relations and positioning Zimbabwe as a leading destination for investment.\n\nThrough his steadfast commitment to engagement and re-engagement, our guest of honour has made significant strides in improving the countrys investment climate, streamlining the ease of doing business, and building investor confidence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/2222-1.jpg",
            "description": "  Nqobile Bhebhe in Beitbridge Vice President Dr Constantino Chiwenga has said the groundbreaking ceremony of the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone in Beitbridge is a demonstration of President Mnangagwa’s unwavering commitment to unlocking the country’s abundant natural resources for transformative economic progress. Speaking at the groundbreaking ceremony in Beitbridge, Dr […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Re-engagement and engagement a boost to investor confidence – President",
            "url": "https://www.chronicle.co.zw/re-engagement-and-engagement-a-boost-to-investor-confidence-president/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nPresident Mnangagwa has said that the re-engagement and engagement of old and new strategic partners has helped boost investor confidence in Zimbabwe.\n\nHe noted that more players were now taking up opportunities, especially in the mining and energy sectors.\n\nThe move, he said, will greatly contribute to Zimbabwes industrial and national economic development.\n\nThe President made the remarks while officiating at the ground-breaking ceremony at the Palm River Energy industrial park in Beitbridge on Monday.\n\nOur re-engagement and engagement initiative as the Second Republic is paying dividends, said the President.\n\nWe commend Xintai Resources for coming forward to invest in the mining and energy sector through the setup of this industrial park, whose first phase is almost complete.\n\nThe project, whose first phase is being carried out by the Government and the Chinese mining company, is being executed in four phases over 12 years.\n\nIt is expected to include a coking plant, a thermal power station, a ferrochrome processing plant, and a carbon and steel plant.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ccccccccccccccccccc.jpg",
            "description": "  Thupeyo Muleya, Beitbridge Bureau President Mnangagwa has said that the re-engagement and engagement of old and new strategic partners has helped boost investor confidence in Zimbabwe. He noted that more players were now taking up opportunities, especially in the mining and energy sectors. The move, he said, will greatly contribute to Zimbabwe’s industrial and […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Watch: Bulawayo’s Hip-Hop revival: Power Sessions bring the heat",
            "url": "https://www.chronicle.co.zw/watch-bulawayos-hip-hop-revival-power-sessions-bring-the-heat/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nAFTER a three-year hiatus, Bulawayos beloved Hip Hop Power Sessions made a triumphant return this past weekend at the Red Caf, reigniting the local rap and spoken word scene. The event showcased some of the citys hottest talent and set the stage for an unforgettable night of music and performance.\n\nAmong the standout acts was the electrifying TBK Smirk, born Tabaka Precious Moyo, who captivated the audience with her dynamic stage presence and intricate dance moves.\n\nLeading the charge towards a hip-hop revolution in the precinct, TBK Smirks verses, infused with her native Kalanga language, resonated deeply, making her one of the evenings highlights.\n\nHosted by Ganyaz, the reborn Hip-Hop Power Sessions saw TBK Smirk perform crowd favourites like MaMkhize and After Robot, which elicited enthusiastic responses from the audience. Her subsequent tracks, Impi/Isagila and Yay Yeah, quickly became sing-alongs, showcasing her ability to engage the crowd and deliver powerful messages through her music.\n\nKnown for addressing mental health issues and bragging rights in her lyrics, TBK Smirk demonstrated an impressive command of bars, metaphors, and rhymes.\n\nFollowing her performance, a jubilant TBK Smirk reflected on the event, saying, Well, it (the event) had a slow start, so that was disheartening at first because I thought people wouldnt show up. But eventually, the atmosphere changed, and I enjoyed every minute of my set and the reception as well. It was an honour to be considered as one of the first acts after the Hip Hop Power Sessions three-year hiatus, and I am grateful to the organisers for that.\n\nLooking ahead, TBK Smirk hinted at exciting projects in the pipeline.Ive got a few features in the works. Im working on my EP, although I havent found a title that Im married to yet. I also plan to release a single soon titled NXA! which will be a pure rap clap back to the Bulawayo music industry, motivated by my encounters these past couple of years. Youll be seeing a lot more of me this year!\n\nThe night was not just about the music; a talented dance group also brought the house down with their mind-blowing choreography, adding to the vibrant atmosphere of the event.\n\nOther performers included seasoned rappers Brintz, Chuck The Lunatic (CTL), Liz Taylor, and Curtis Dee Rovar, each contributing to the rich tapestry of talent that Bulawayo offers.\n\nBrintz, one of the event organisers, expressed his excitement about the successful turnout.It was a win for the Bulawayo hip-hop community and the city at large, he said, reflecting the collective joy of artistes and fans alike at the revival of this beloved event.\n\nBulawayo Chiefs Village hosted the No Heeps gig to move the hip-hop movement. Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jiio.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com AFTER a three-year hiatus, Bulawayo’s beloved “Hip Hop Power Sessions” made a triumphant return this past weekend at the Red Café, reigniting the local rap and spoken word scene. The event showcased some of the city’s hottest talent and set the stage for an unforgettable night of music and performance. Among the […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Beitbridge residents reap benefits of US$3.6 Billion energy and mining development",
            "url": "https://www.chronicle.co.zw/beitbridge-residents-reap-benefits-of-us3-6-billion-energy-and-mining-development/",
            "content": "Nqobile Bhebhe in Beitbridge\n\nThe Beitbridge community is enthusiastic about the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone, a partnership between the government and a Chinese mining company that has boosted local employment prospects.\n\nThe US$3.6 billion energy industrial park, situated 20 km west of Beitbridge, has already generated hundreds of jobs, spurring economic activity in the area.\n\nThis multi-sector project is anticipated to create thousands of job opportunities and foster economic growth in Beitbridge, a vital border town between Zimbabwe and South Africa.\n\nGiven its strategic location, Beitbridge has long been an economic hub.\n\nThe new investment will improve infrastructure, such as roads and utilities, which will enhance trading opportunities between Zimbabwe and neighbouring countries in the long term.\n\nThis is a clear demonstration of the governments commitment to ensuring no place is left behind. Employment opportunities have been enhanced for the community, especially the youth.\n\nWe urge the government and private sector to set up technical colleges to train the youth in mining activities, said a local representative, Mr Samuel Tlou.\n\nAccording to the project overview, upon its completion, it will provide 10,000 jobs for the community and address a significant number of employment challenges.\n\nAt the same time, it will provide technical training to Zimbabwean employees, improve their professional skills, and facilitate the integration of teaching and practice in technology transfer and skill enhancement.\n\nAt present, there are more than 300 Chinese teams and more than 800 Zimbabwean teams, totalling over 1,000 project teams.\n\nA joint venture has been established with the sovereign wealth fund directly under the Ministry of Finance, Economic Development and Investment Promotion to jointly develop the Turi open-pit coal mine, which has now entered normal mining operations.\n\nAdditionally, a high-quality coking coal mining agreement with Wanji Coal, a state-owned enterprise in Zimbabwe, has been signed, and exploration has been completed.\n\nThe coal washing, coking, ferrochrome smelting, and tail gas power generation projects in the Palm River Park have all commenced construction, with the coal washing and coking projects already successfully operational.\n\nThe tail gas power generation and ferrochrome smelting projects are set to be inaugurated at the end of February, marking the parks entry into the substantive production and operational stage.\n\nThe expansion of coal and energy projects in the Matabeleland region is set to play a pivotal role in advancing the countrys re-industrialisation agenda, with far-reaching benefits for various business sectors.\n\nA stable energy supply is crucial for domestic industries, as energy shortages remain a major constraint.\n\nAdditionally, potential foreign investors place significant emphasis on energy efficiency when assessing investment opportunities.\n\nStrong expertise in the energy sector, combined with a robust local raw material base and a business-friendly environment, positions the country as an attractive investment destination.\n\nThe manufacturing sector, in particular, is expected to gain substantially from these developmentsboosting export earnings, reducing the budget deficit, and creating high-value jobs.\n\nThese efforts align with President Mnangagwas vision of transforming Zimbabwe into an upper-middle-income economy by 2030.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/zzzzzz.jpg",
            "description": "Nqobile Bhebhe in Beitbridge The Beitbridge community is enthusiastic about the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone, a partnership between the government and a Chinese mining company that has boosted local employment prospects. The US$3.6 billion energy industrial park, situated 20 km west of Beitbridge, has already generated hundreds of jobs, spurring […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "President Mnangagwa launches US$3.6 Billion Palm River Energy Metallurgical Special Economic Zone in Beitbridge",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-launches-us3-6-billion-palm-river-energy-metallurgical-special-economic-zone-in-beitbridge/",
            "content": "Nqobile Bhebhe in BeitbridgePRESIDENT Mnangagwa has carried out a symbolic ground-breaking ceremony and plaque unveiling of the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone project here in Beitbridge.This marks an example of growing investor confidence in the country under the Second Republic.\n\nThe landmark initiative has the potential to significantly transform the economy of the Matabeleland region, boosting industrial development and job creation.Vice President Dr Constantino Chiwenga, Vice President Kembo Mohadi, Minister of State for Matabeleland South Provincial Affairs and Devolution Dr Evelyn Ndlovu, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube, Mines and Mining Development Minister Winston Chitando, Chinese embassy officials, several mining sector players, and Beitbridge community leaders witnessed the event.The President and his delegation toured the industrial park.\n\nThe occasion marks a significant milestone in Zimbabwes economic development journey.With its focus on energy, mining, and value addition, the project has the potential to transform the Matabeleland region into a hub of industrial activity and economic growth.The initiative is expected to play a crucial role in strengthening Zimbabwes mining and energy sectors.The project was set up following discussions between the companys chairman and President Mnangagwa, who directed that it be established as an integrated mining and energy park.Palm River is a multi-faceted project that will encompass mining, power generation, coke production, and steel manufacturing.The project, which will ultimately produce stainless steel, is being implemented in phases.The project covers an area of 5,163 hectares and is planned to be constructed in five phases, with a total construction period of 12 years.The construction period for the first phase of the project is two years, with a total investment of US$237 million, mainly used for the construction of an annual output of 200,000 tonnes of ferrochrome and supporting coal mines, coking, infrastructure, and other projects.In 2018, President Mnangagwa declared Beitbridge a Special Economic Zone as part of the Second Republics broader strategy to attract investment under the Zimbabwe is Open for Business policy.The Governments adoption of the SEZ model aims to enhance foreign direct investment (FDI), improve local business competitiveness, and drive economic growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gggggg.jpg",
            "description": "Nqobile Bhebhe in Beitbridge PRESIDENT Mnangagwa has carried out a symbolic ground-breaking ceremony and plaque unveiling of the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone project here in Beitbridge.This marks an example of growing investor confidence in the country under the Second Republic. The landmark initiative has the potential to significantly transform the […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "ICT Ministry supports promotion of technology and innovation through educational platforms",
            "url": "https://www.chronicle.co.zw/ict-ministry-supports-promotion-of-technology-and-innovation-through-educational-platforms/",
            "content": "Mthabisi Tshuma in BulawayoTHE Ministry of Information Communication Technology, Postal and Courier Services is fully committed to supporting the promotion of technology and innovation through educational platforms, Deputy Minister Dingumuzi Phuti has said.In his keynote address at the World Robot Olympiad (WRO) Zimbabwe, Bulawayo Hackathon, held at Girls College on Monday, ICT Deputy Minister Phuti praised Girls in Stem director Victoria Nxumalo for her organisations contribution to ensuring the uptake of ICTs from the grassroots level.\n\nParticipants at the WRO include students from the Ministry of Primary and Secondary Education, ranging from Grade Four pupils to Form Six students.\n\nAs the Deputy Minister of Information Communication Technology, Postal and Courier Services, it is important to highlight how initiatives such as this align perfectly with the strategic goals of our Ministry. Our vision is to foster a dynamic and inclusive ICT ecosystem that will enable Zimbabweans to thrive in a digital and knowledge-driven world.The promotion of technology and innovation through educational platforms such as the World Robot Olympiad is at the heart of our Ministrys objectives, said Deputy Minister Phuti.More to follow.Follow on X  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/unnamed-file-3.jpg",
            "description": "Mthabisi Tshuma in Bulawayo THE Ministry of Information Communication Technology, Postal and Courier Services is fully committed to supporting the promotion of technology and innovation through educational platforms, Deputy Minister Dingumuzi Phuti has said. In his keynote address at the World Robot Olympiad (WRO) Zimbabwe, Bulawayo Hackathon, held at Girls College on Monday, ICT Deputy […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "President Mnangagwa arrives in Beitbridge for the ground-breaking of a US$3.6bn industrial park",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-arrives-in-beitbridge-for-the-ground-breaking-of-a-us3-6bn-industrial-park/",
            "content": "Thupeyo Muleya, Beitbridge BureauPresident Mnangagwa has arrived in Beitbridge, Matabeleland South province for the ground-breaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone.The Government, in collaboration with a Chinese mining company, is developing a US$3.6 billion energy industrial park.The President is accompanied by his two Vice Presidents, Constantino Chiwenga and Kembo Mohadi; Matabeleland South Minister of State, Dr Evelyn Ndlovu; Finance Minister, Prof Mthuli Ncube; Mines and Mining Development Minister, Winston Chitando; and other senior Government officials, representatives from the Chinese embassy, and mining experts.The project, located 20km west of Beitbridge town, seeks to introduce the production of stainless steel.\n\nThe energy and steelworks initiative has already employed 400 local workers in its first year, with the expectation that it will ultimately employ over 2,000 people once it becomes fully operational.\n\nThe establishment of the park as an integrated mining and energy hub follows discussions between the chairman of Palm River Energy, Mr Xong Xi Dong, and President Mnangagwa.\n\nThe project will cover 5,100 hectares within a Special Economic Zone and is expected to make substantial contributions to Zimbabwes mining and energy sectors.The first phase of the project is being carried out through a joint venture between the Government, Xintai Resources, and Tuli Coal.\n\nAfter the ground-breaking ceremony, the President is expected to tour the park, which comprises a coking plant that will have an annual capacity of producing one million tonnes of coke, a ferrochrome smelting plant that will produce 100,000 tonnes of high-carbon ferrochrome and a 1,200MW coal-fired thermal power plant.Any surplus electricity will be transmitted to the national grid, while the ferrochrome plant will facilitate the production of special and stainless steel and castings.Coal supply to the project will be obtained from Tuli Coal Mine and, in line with plans to export coal products to international markets, will yield significant foreign currency earnings.Ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/11111.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau President Mnangagwa has arrived in Beitbridge, Matabeleland South province for the ground-breaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone. The Government, in collaboration with a Chinese mining company, is developing a US$3.6 billion energy industrial park. The President is accompanied by his two Vice Presidents, Constantino Chiwenga […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Man axes daughter to death, while beating up wife",
            "url": "https://www.chronicle.co.zw/man-axes-daughter-to-death-while-beating-up-wife/",
            "content": "Midlands BureauA Gokwe man fatally struck his four-year-old daughter with an axe while attempting to strike his wife before consuming pesticide in a bid to commit suicide following allegations of infidelity.Midlands Provincial police spokesperson Inspector Emmanuel Mahoko said the police are investigating two cases of murder and attempted murder which occurred on Wednesday in Kasamara Village under Chief Nemangwe in Gokwe South around 11:53 pm.He said Thomas Nyamadzawo (53) allegedly arrived at his homestead entered their bedroom and started accusing his wife Eunice Mawisa(45) of infidelity.It is alleged, that he ordered her to leave during that night but she refused and a misunderstanding broke up. The suspect armed himself with an axe which was behind the door, she screamed for help as he raised the axe, he said.Insp Mahoko said their daughter Precious (4) woke up and jumped onto her mothers chest and was struck with the back of the axe once on the head crushing her skull.He said Nyamadzawo continued with the assault using the same axe, severely striking his wife on the head before she fell down.Mawisa managed to wake up and ran away while carrying her daughter to seek refuge at a neighbours homestead, he said.Insp Mahoko said Nyamadzawo followed them and was refrained by their neighbour before disappearing into a nearby bush.He said villagers formed a search party and found Nyamadzawo lying unconscious on the ground after he had tried to commit suicide by drinking a pesticide.The police attended the scene and are conducting investigations to gather prosecution evidence. The body of the daughter is being held at Gokwe South District Hospital mortuary while the couple, Mawisa and Nyamadzawo are admitted to the same hospital where they are being treated,  he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/11/axes.jpg",
            "description": "Midlands Bureau A Gokwe man fatally struck his four-year-old daughter with an axe while attempting to strike his wife before consuming pesticide in a bid to commit suicide following allegations of infidelity. Midlands Provincial police spokesperson Inspector Emmanuel Mahoko said the police are investigating two cases of murder and attempted murder which occurred on Wednesday […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Pan-African Parliament Gears Up for Key Discussions on Reparations and Justice",
            "url": "https://www.chronicle.co.zw/pan-african-parliament-gears-up-for-key-discussions-on-reparations-and-justice/",
            "content": "Jerry Chifamba\n\nNearly 30 African legislators will be sworn in as Pan-African Parliamentarians during the Sitting of Permanent Committees, set to take place from February 18 to 28, 2025, in Midrand, South Africa. The session, held under the African Unions 2025 theme, Justice for Africans and People of African Descent Through Reparations, aims to address critical issues such as reparations, justice, and sustainable development across the continent.\n\nThe event will bring together African Heads of State, Pan-African Parliamentarians, government officials, civil society organizations, and representatives from AU member states to deliberate on pressing matters affecting Africa and its diaspora.\n\nThe Pan-African Parliament (PAP) operates through its eleven Permanent Committees, which align with the African Unions commissions and strategic goals, including Agenda 2063. These committees play a vital role in enabling the Parliament to carry out its oversight, advisory, and consultative functions.\n\nThis Sitting will also explore programs aligned with the Parliaments strategic plan and AU priorities, facilitating detailed investigations and discussions on the challenges and opportunities facing the continent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/4444.jpg",
            "description": "Jerry Chifamba Nearly 30 African legislators will be sworn in as Pan-African Parliamentarians during the Sitting of Permanent Committees, set to take place from February 18 to 28, 2025, in Midrand, South Africa. The session, held under the African Union’s 2025 theme, “Justice for Africans and People of African Descent Through Reparations,” aims to address […]",
            "time": "20:41",
            "date": "24 Feb 2025"
        }
    ]
}