{
    "news": [
        {
            "title": "Bakers Inn NASH athletics championships start",
            "url": "https://www.chronicle.co.zw/bakers-inn-nash-athletics-championships-start/",
            "content": "Lovemore DubeTHE Bulawayo Metropolitan Province National Association of Secondary Schools Track and Field Championships sponsored by Bakers Inn kicked off at White City Stadium yesterday with fierce competition.Athletes battled it out in both track and field events for a place in the team to take part in the national championships set for Chipadze Stadium at the end of this month.Sikhumbuzo Ndlovu, the head in charge of athletics in Bulawayo is happy and looking forward to a better outing than the eighth position attained in Victoria Falls last year.\n\nNdlovu said unlike last year where they took a large contingent of athletes, this year they will go for quality and take only those that they think measure to national standards. Last year every event had an athlete.We learnt a lesson from last years championships. Instead of two or three buses this year if it means traveling in a Dyna Coaster with medal hopefuls we will do so, we are strict with our selection processes, we do not want to disappoint, said Ndlovu whose province was catered well for by Bakers Inn.\n\nInstead of the usual hall or classroom sleeping, Bulawayo Province athletes slept at a hotel and even had the opportunity to visit the Falls, a rarity for school teams.Sobukhazi sprinter Methembe Tshuma running for Reigate fired warning shots with gold in the boys Under-20 100m dash in a competitive time of 10.46 seconds. He was chased to the finishing line by a determined Makhosi Sibanda of Magwegwe High School which is under Mzilikazi District. Sibanda was home in 10.64 seconds with Prince Moyo third in 10.84 seconds.\n\nTshuma attested to his growing reputation as the boy to beat this year in the province when he ran the fastest 200m in 21.52 seconds in the semi-finals but his effort was even better than Sibandas 22.21 in the other semi-final group.Moyo seemingly set to give the duo the toughest competition this season ran the 200m in 22.46 seconds.The talented Moyo had the fastest 400m time of 49.05 seconds while Brendon Ndlovu of Magwegwe and Mzilikazi District was second best in 49.47 seconds.Angeline Mkratirwa of Nkulumane and Mzilikazi District was first in the girls Under-20 100m in 12.77 seconds with REigates Rejoice Dlodlo of Northlea High School second in a decent 13.01 seconds.Remoneiloe restored pride for the Eastern Suburbs schools finishing third in 13.19 seconds.Raymond Maqethuka Dube, the Bakers Inn sales and distribution manager was impressed with the turn out by fans and competition exhibited by the pupils.He confirmed that they are sponsoring the two-day event and that they will foot the teams bill to Bindura with the most outstanding athletes to receive cash incentives on return.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/04/hgfkjk.jpg",
            "description": "Lovemore Dube THE Bulawayo Metropolitan Province National Association of Secondary Schools Track and Field Championships sponsored by Bakers Inn kicked off at White City Stadium yesterday with fierce competition. Athletes battled it out in both track and field events for a place in the team to take part in the national championships set for Chipadze […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Johannes Ngodzo courts younger Josta brother out of retirement",
            "url": "https://www.chronicle.co.zw/johannes-ngodzo-courts-younger-josta-brother-out-of-retirement/",
            "content": "Fungai[emailprotected]LEGENDARY former Highlanders and Warriors midfield magician Johannes Tshisa Ngodzo says he has taken it upon himself to court his younger brother Joel to come out of retirement and join newly promoted Zifa Central Region Division One side Gwanda Pirates.Interestingly, ambitious Gwanda Pirates recently appointed Johannes as their head coach. Joel, who is warmly known as Josta, retired from professional football at the beginning of last year at the age of 35, after his contract with CAPS United was not renewed.I personally approached Josta on a brother to brother basis, I told him he should consider coming out of retirement because I feel he has some few more years to play. At that age, he cannot be just sitted at home, he should consider joining Gwanda Pirates, a club that Im coaching, said Johannes.He has been in this football industry for long and it will now be up to him and the clubs executive to go for contractual negotiations. Him (Josta) and the clubs executive will need to reach an agreement, added Johannes.Josta, who is also a former Warriors and Young Warriors midfielder, recently featured in Gwanda Pirates two friendly matches against Bulawayo Chiefs and Bulawayo Chiefs. A creative mastermind, endowed with good ball control and visionary play, the midfielder was promoted to the Bosso senior team in 2009 and immediately shone like a beacon in his debut campaign.The following year, moneybags FC Platinum came knocking for his signature, dangling a record US$60 000 fee to sign the gifted midfield maestro.Josta was just 20 years old and already revered as the liveliest young talent in the land.After his stay at FC Platinum, Josta re-joined Highlanders at the end of his four-year contract.Josta did not stay longer as he moved to Harare to join Caps United in 2015, where his career was revived, helping them to win the league championship in 2016.His major personal acknowledgement came in 2019 when he was named Castle Lager Soccer Star of Year following an outstanding season in which he scored 10 goals to help CAPS United finish as runners-up in the league title race.Jostas excellent show attracted interest from Zambian side Buildcon in 2020 for his first foreign move.But things did not work out for Joel in the neighbouring Zambia.A season later, he resurfaced at his boyhood team Highlanders but due to wanting fitness levels, he did not stay long.In July 2022 and after spending just six months in Bulawayo, he was released by Bosso and he went back to the capital city to join Makepekepe before he hung his boots in early 2024.Josta had not kicked a ball since then.-@FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yujnhn.jpg",
            "description": "Fungai Mudererefungai.muderere@bmetro.co.zw LEGENDARY former Highlanders and Warriors midfield magician Johannes “Tshisa” Ngodzo says he has taken it upon himself to court his younger brother Joel to come out of retirement and join newly promoted Zifa Central Region Division One side Gwanda Pirates. Interestingly, ambitious Gwanda Pirates recently appointed Johannes as their head coach. Joel, who […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Bulawayo boxers inspired us",
            "url": "https://www.chronicle.co.zw/bulawayo-boxers-inspired-us/",
            "content": "Lovemore Dube,[emailprotected]\n\nCLYDE Musonda who is trying to bring the first professional boxing tournament to Bulawayo says hosting a bill in the City of Kings is honouring yesteryear greats.\n\nWe have to honour Bulawayos yesteryear greats hoping that can inspire the next generation of boxers. Bulawayo was at some stage the hub of Zimbabwean boxing with a lot of talented boxers some of whom were dominant forces. If we do not bring tournaments to Bulawayo those legends will be forgottern, said Musonda whose Deltaforce Promotions stable arrives in the city this afternoon for more explaratory work ahead of their forthcoming event.\n\nTheir mission is to finalise on the venue and other logistics ahead of their Trade Fair time boxing extravaganza next month.\n\nWe have identified one or two places as potential venues for the tournament. It is going to be a big event that should announce the return of professional boxing to Bulawayo. Boxers are hungry for fights and so are our boxing fans. Bulawayo people have loved boxing from the days of Jimmy Ellis, Kid Power, Dave Wellings, Bright Spider and Kilimanjaro right up to the time of Jeff Dube when they dominated the three middleweight divisions with Fredrick Chisoro champion in the light middle weight, Ambrose Mlilo (middleweight) and Sipho Moyo (super middleweight).\n\nBulawayo had heavyweights Tony Bollo Benson and Thamsanqa Dube, even Elvis Bomber Moyo who is into mixed martial arts is from Bulawayo, Nokuthula Tshabangu, Trust Ndlovu, Commonwealth aspirants Jabulani Gombiro and Bright Spider, we have to keep the legacy of champions flourishing with regular activity. Bulawayo boxers inspired us, said Musonda.\n\nThe proposed boxing bill, Musonda said will be a mixed bag of Bulawayo sons and daughters, top national boxers and some from outside the country.\n\nWe want it to be an event to savour and when the boxing board makes a formal announcement, the line up will be one of the best by any promoter anywhere in Zimbabwe. We want to attract the nation back to boxing, said Musonda.\n\nBoxing used to attract crowds to stadia. In the 1980s several tournaments were held at Rufaro Stadium and big municipal halls and parks.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/thyththa.jpg",
            "description": "Lovemore Dube,lovemore.dube@chronicle.cozw CLYDE Musonda who is trying to bring the first professional boxing tournament to Bulawayo says hosting a bill in the City of Kings is honouring yesteryear greats. “We have to honour Bulawayo’s yesteryear greats hoping that can inspire the next generation of boxers. Bulawayo was at some stage the hub of Zimbabwean boxing […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "AFM Pastor rapes and impregnates daughter in two year ordeal",
            "url": "https://www.chronicle.co.zw/afm-pastor-rapes-and-impregnates-daughter-in-two-year-ordeal/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nA COURT has convicted a 34-year-old pastor with the Apostolic Faith Mission of Zimbabwe, and sentenced him to 30 months in prison for incest.The court heard that between 2022 and 2024, the offender repeatedly had sexual relations with his stepdaughter, who is now 18-years old, at different locations. The illicit affair began in 2022 when the victims mother left her in the offenders custody. They first had sexual relations in his bedroom while they were watching videos. The abuse continued over the years, leading to a pregnancy in 2023, which he later arranged to be terminated.A tip-off led to investigations, leading to his arrest. The offender was convicted and sentenced for incest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A COURT has convicted a 34-year-old pastor with the Apostolic Faith Mission of Zimbabwe, and sentenced him to 30 months in prison for incest. The court heard that between 2022 and 2024, the offender repeatedly had sexual relations with his stepdaughter, who is now 18-years old, at different locations. The illicit affair […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "SADC withdraws troops from DRC",
            "url": "https://www.chronicle.co.zw/sadc-withdraws-troops-from-drc/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nSADC has resolved to withdraw its troops deployed in the Eastern Democratic Republic of Congo (DRC) while non-military solutions are being pursued to end hostilities in the Great Lakes region.\n\nThis came out in the Extraordinary virtual summit drawing Heads of State and Government from across the region that was chaired by President Mnangagwa yesterday to reflect on the conflict in Eastern DRC.\n\nSADC had deployed troops from Tanzania, Malawi and South Africa to help contain the raging conflict that is pitting DRC Government forces and armed group M23 in the Eastern Congo. The conflict has left thousands of people dead with millions of them including women, children, the elderly and the disabled displaced.\n\nThe regional bloc deployed troops under the SADC Mission in the DRC (SAMIDRC) to help end the conflict.The troops were deployed on December 15, 2023 after an Extraordinary SADC Summit held in Windhoek, Namibia in May 2023 to support the Government of DRC owing to the resurgence of armed groups.\n\nIn his closing remarks, President Mnangagwa described the withdrawal as bold.On the basis of well-considered factors and reflections on the initial mandate, this Extraordinary SADC Summit has made the bold decision to withdraw our Mission from the Eastern DRC. The withdrawal of SAMIDRC notwithstanding, our august regional body will remain seized with the political and security situation in eastern DRC, said President Mnangagwa.\n\nAllow me as we conclude our meeting, to extend sincere appreciation and gratitude to the Troop Contributing Countries and all Member States, for the backing rendered to SAMIDRC. As our Mission enters a withdrawal phase, we appeal for continued support, to facilitate the safe withdrawal of all our troops and evacuation of our equipment.\n\nHe called for the implementation of decisions made during the Joint SADC-East African Community meeting.These include the merger of the Luanda and Nairobi Peace Processes, more so that dialogue is a key cog to usher lasting peace to the people of DRC. Our collective pursuit for peace is the greatest tribute we can accord our heroes and heroines, both living and fallen, who selflessly answered the call of duty. Their sacrifice can never be in vain, he said.\n\nPresident Mnangagwa\n\nThe summit resolution followed an Extraordinary Troika summit on the Organ on Politics, Defence and Security Affairs chaired by Tanzanian President Dr Samia Suluhu Hassan that met last week and tabled their report for consideration yesterday.Earlier on, in his speech to officially open the Extraordinary Summit, President Mnangagwa called for the cessation of hostilities in DRC saying it had the potential to spread to other borders.\n\nAs we convene today, we remain cognisant of the fact that repercussions of the instability extend beyond the DRC borders, affecting the broader region at large. It is noteworthy that the implementation of the resolutions of the Joint SADC-EAC Summit is now underway, said President Mnangagwa.\n\nEmphasis must be on collaborative strategies to improve peace and security in the DRC. SADC thus, welcomes efforts by the International Community to end the conflict, particularly, the adoption of Resolution 2773 by the United National Security Council. This resonates with the ongoing initiatives by our African regional bodies.\n\nAs SADC, we reaffirm our commitment to play our part in promoting lasting and sustainable peace. In this regard, an inclusive and comprehensive dialogue process is essential, to strengthen security mechanisms that safeguard the human rights and dignity of the affected communities. Undoubtedly, there have been many setbacks and challenges in our quest for peace in eastern DRC.\n\nDelivering his introductory remarks, SADC Executive Secretary Mr Elias Magosi said there was need to protect the SADC-EAC platform saying it was the only trusted structure by stakeholders including the belligerents.\n\nI wish to also highlight, Your Excellencies, that the EAC-SADC engagement process must be protected and nurtured. It is probably the only structure in recent times that has brought some level of trust for both the DRC and Rwanda, and hope to multiple stakeholders, namely the SADC and EAC regions, the African Union Peace and Security Council, the UN Security Council, and the international community.\n\nThe two RECs must, therefore, jealously guard this structure and ensure it does not become another failed process.We must do everything in our power, as SADC especially, and ensure this structure achieves its objectives, and that it remains credible, trusted and free from blemishes, said Mr Magosi.\n\nHe described the security situation in eastern DRC as worrisome and continued to be a concern for the region.The attacks by the M23 armed group against DRC Government Forces, SAMIDRC Troops, and the civilian population and the subsequent capture of various cities and towns in the area, have resulted in the loss of lives and injuries, and led to a sharp increase in internally displaced persons, forcing many people, particularly women, children, the elderly and disabled, to flee their homes.\n\nSADC strongly condemns the unwarranted attacks on innocent people by the rebel groups and is resolute in standing in solidarity with our sister country, to address the prevailing security challenges through the relevant SADC structures, he said.\n\nThe situation is compounded by the blockade of main supply routes and the capture by the M23 Armed Group of both Goma International Airport and Kavumu Airport in Bukavu. Urgent diplomatic intervention is, therefore, needed to open these airports to facilitate delivery of humanitarian assistance and allow SADC and its structures to find an immediate and workable solution for our Mission.\n\nAfter the two-hour engagement, Mr Magosi, leading a secretariat team from the regional bloc in Harare, read out the communique which indicated that Heads of State and Governments had resolved to withdraw their troops.\n\nYesterdays meeting was attended by Foreign Affairs and International Trade Minister, Professor Amon Murwira, Defence Minister Oppah Muchinguri Kashiri, Minister of State for National Security, Lovemore Matuke, Tourism and Hospitality Industry Minister Barbara Rwodzi, and Zimbabwe Defence Forces Commander General Valerio Sibanda.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/UMY-680x380.jpg",
            "description": "Zvamaida Murwira, Harare Bureau SADC has resolved to withdraw its troops deployed in the Eastern Democratic Republic of Congo (DRC) while non-military solutions are being pursued to end hostilities in the Great Lakes region. This came out in the Extraordinary virtual summit drawing Heads of State and Government from across the region that was chaired […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "17 countries, 24 foreign exhibitors for ZITF",
            "url": "https://www.chronicle.co.zw/17-countries-24-foreign-exhibitors-for-zitf/",
            "content": "Nqobile Bhebhe,[emailprotected],zw\n\nTWENTY-FOUR international exhibitors from 17 countries have confirmed their participation in this years 65th edition of the Zimbabwe International Trade Fair, scheduled for next month.\n\nThe event promises to be bigger and better than ever.The increase in foreign exhibitor participation is a strong endorsement of Zimbabwe as a favourable investment and trade destination, reflecting positively on the Second Republics engagement and re-engagement foreign policy.\n\nLast year, 13 countries participated in Zimbabwes premier annual trade exhibition. This year, the country aims to attract even more participants as preparations gain momentum.\n\nSince coming to power in 2017, President Mnangagwas administration has made economic diplomacy an integral part of the Governments foreign policy. The mandate of the ZITF Company, responsible for organising the exhibition, includes spearheading national branding efforts, promoting investment, and driving economic growth.\n\nOrganisers have stated that, to date, 47,140.87 square metres of the available space  representing 95,2 percent of the total  has been taken up by 435 direct exhibitors.\n\nThis years trade showcase will run from April 21 to 26 at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo under the theme Industrialisation: Crafting an Integrated Economic Landscape.Providing an update on the state of preparedness yesterday, ZITF Company board chairman Mr Busisa Moyo said the exhibition would position Zimbabwe as a competitive hub for trade and investment. He further highlighted the ZITF Companys enduring legacy and role in shaping Zimbabwes industrial landscape over the decades.\n\nZimbabwe International Trade Fair\n\nPreparations for the ZITF 2025 edition, taking place from April 21-26 2025 at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo, are gaining momentum, said Mr Moyo.\n\nAs one of Africas premier trade showcases, ZITF continues to play a pivotal role in driving industrial growth, fostering business connections, and positioning Zimbabwe as a competitive hub for trade and investment.\n\nThis years edition is expected to bring together a diverse mix of local and international exhibitors, investors, and policymakers, setting the stage for transformative economic dialogue and collaboration.As the annual trade showcase celebrates its Blue Sapphire edition  marking 65 years of exhibition excellence  Mr Moyo said this years event is expected to make significant strides in fostering collaboration among industries and countries, strengthening economic ties, and advancing mechanisation in industrial sectors.\n\nThis milestone edition will highlight ZITFs enduring legacy and its role in shaping Zimbabwes industrial landscape over the decades, said Mr Moyo.\n\nAs preparations for the international, multi-sectoral trade show reach their peak, exhibitor uptake has been highly encouraging.\n\nWe are currently at 95.2 per cent of space capacity, with 435 direct exhibitors having taken up 47,140.87 square metres of the designated 49,499 square metres.\n\nInternational participation is also very strong. To date, we have 24 confirmed international exhibitors from 17 countries.This compares favourably with the booking situation at the same time last year, when 13 countries had secured space. Last years closing total was 27 countries represented, he added.\n\nThe ZITF Company recently launched a series of regional roadshows in Botswana, South Africa, and Zambia to signal the official countdown to the 65th edition of its annual exhibition in Bulawayo.The Botswana leg of the roadshow, set for Gaborone, is scheduled for today. Mr Moyo said more international roadshows were planned.\n\nThe roadshows tailored presentations and interactive networking sessions have been highlighting the benefits of participating in ZITF events and exploring regional collaboration opportunities.\n\nEach roadshow has had between 50 and 80 delegates in attendance, including heads of mission based in the visited countries but accredited to Zimbabwe, trade promotion agencies, chambers of commerce, business member organisations (BMOs), media, Zimbabwean diaspora business associations, as well as individual potential private-sector exhibitors, said Mr Moyo.\n\nThese engagements have received positive feedback from industry stakeholders, with many expressing enthusiasm about the opportunities ZITF 2025 will offer.\n\nThe roadshows have not only expanded ZITFs reach but also reinforced its role as a key driver of regional economic cooperation.\n\nHe said the event would feature individual companies and organisations from Afghanistan, Canada, Egypt, Ethiopia, Kenya, and Pakistan, showcasing their products and services.\n\nAdditionally, several countries and regional bodies will participate through organised delegations, underscoring their commitment to fostering trade and economic partnerships.\n\nThese include Belarus, China, the European Union, Japan, Malawi, Mozambique, South Africa, Tanzania, the United Kingdom, and the United States of America.\n\nBeyond exhibitors, the event will also welcome high-level delegations from India (organised by the Federation of Indian Chambers of Commerce and Industry (FICCI)), who will be attending as visitors to explore business and investment opportunities, added Mr Moyo.\n\nThe ZITF Company has projected that more than 800 exhibitors, 30 exhibiting countries, at least 10,000 business exhibitors, and over 75,000 visitors will take part in this years exhibitions.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/XS.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co,zw TWENTY-FOUR international exhibitors from 17 countries have confirmed their participation in this year’s 65th edition of the Zimbabwe International Trade Fair, scheduled for next month. The event promises to be bigger and better than ever. The increase in foreign exhibitor participation is a strong endorsement of Zimbabwe as a favourable investment and […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Vendors plead for dialogue, leniency",
            "url": "https://www.chronicle.co.zw/vendors-plead-for-dialogue-leniency/",
            "content": "Chronicle Writers\n\nVENDORS have called for dialogue with the authorities and other stakeholders regarding the 48-hour ultimatum issued by the Government to clear them from illegal vending sites.\n\nThe directive is part of a nationwide crackdown on unregulated trading activities, driven by concerns over public health, security and economic stability.\n\nLocal Government and Public Works Minister, Daniel Garwe, announced the measure on Wednesday, stressing the need to restore order in cities and towns.\n\nHowever, the announcement has sparked mixed reactions among vendors in Bulawayo, and other cities, many of whom are calling for constructive engagement with authorities.\n\nWe understand the need for order and regulation in our city, but a collaborative approach involving vendors and relevant stakeholders is essential in finding a sustainable solution, said Mr Sawu Jere, a representative of Bulawayo vendors.\n\nHe stressed that since the Governments action will impact their livelihoods, vendors must be included in decision-making processes.\n\nMr Jere said the vendors call for dialogue reflects their willingness to work with authorities to address the underlying causes of illegal trading. There is a need for a balanced approach that considers both the Governments concerns and the realities vendors face on the ground, he said. We are ready to engage in meaningful discussions to find common ground and ensure a fair outcome for all parties.\n\nMs Benhilda Zinyemba, a vendor operating along the Fifth Avenue marketplace, welcomed the Governments move but pointed out irregularities in the allocation of vending spaces.\n\nThis place was allocated to us by the authorities, but the problem started when vendors who had applied for space here were overlooked, while others, whom we do not know, were given bays. This is a major issue, she said.\n\nMs Zinyemba suggested that the 48-hour ultimatum should solely apply to those operating in undesignated areas.For those of us in designated places where there have been administrative errors, consideration should be given. Many of us are in this situation due to mistakes by the authorities, she said.Mr Vusumuzi Mabhena, a second-hand clothing vendor, pleaded with authorities to reconsider the ultimatum, saying street vending is their only means of survival.\n\nMr Nicholas Gombera, a vegetable vendor, echoed the same sentiments. He said selling on the streets is their sole source of income and removing them would severely affect their families.\n\nWe cannot vacate the streets in just 48 hours. We are pleading with our leaders to be considerate, as this is the only livelihood for many families, he said.\n\nBulawayo mayor Councillor David Coltart said the city has designated vending areas, but some vendors are reluctant to move to these locations.\n\nThere are hundreds of bays across the city for vendors. For instance, space is available at Bhaktas, and it has functional ablution facilities. Regarding allocation, I want to clarify that these bays are reserved for Bulawayo residents only, he said.Clr Coltart said BCC would conduct an audit to determine who benefited from the allocation of stands.\n\nWe want to restore law and order in the city. For this operation, we will work with the police and vendors associations. As you know, municipal police do not have arresting powers, so we will collaborate with the relevant authorities, he said.\n\nThe mayor said the operation would be carried out with compassion and urged vendors to cooperate.In the Midlands Province, Gweru Vendors Association chairperson Mr Everisto Mbenjani said the directive was issued on short notice, leaving vendors with little time to find alternative vending spaces.\n\nWe are in the streets not by choice but by necessity. We dont want to engage in cat-and-mouse games with authorities. Our plea is for them to provide proper vending stalls, he said.\n\nZvishavane Mayor Councillor Takarangana Keta noted that the town has over 1 000 legal vendors and about 800 operating illegally.\n\nWe are in the process of relocating illegal vendors from the streets and working with the police to enforce regulations, he said.Local economist Mr Trust Chikohora welcomed the move to clear vendors from shop pavements, saying vending should be conducted in proper locations.\n\nIn the first place, vendors should not have been allocated shop pavements. While they are trying to make a living, they need to be in proper vending areas with adequate amenities such as ablution facilities, he said.Mr Chikohora urged the Government and local authorities to find alternative vending spaces to ensure vendors livelihoods are not destroyed.\n\nConfederation of Zimbabwe Retailers president, Mr Denford Mutashu, acknowledged that vending is a global phenomenon but stressed the need for proper regulation.\n\nVendors contribute to the economy. In Zimbabwe, the situation is unregulated, and we need a cautious approach. However, in countries like China, there are designated malls for vendors, categorised according to the goods they sell, he said.Mr Mutashu said lawlessness must be curbed, citing concerns over young children being recruited into vending, exposing them to criminal activities such as drug abuse and prostitution.\n\nTake Harare and Bulawayo CBDs, for example. Young children are recruited, exposing them to vices that must be controlled. As a country, we need to restore law and order, not just in vending but in many areas of economic activity, he said.Mr Mutashu said the ultimate goal is for local authorities to ensure that all economic activities are properly regulated and accounted for.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgfdsfgsdggfvvvvvcv.jpg",
            "description": "Chronicle Writers VENDORS have called for dialogue with the authorities and other stakeholders regarding the 48-hour ultimatum issued by the Government to clear them from illegal vending sites. The directive is part of a nationwide crackdown on unregulated trading activities, driven by concerns over public health, security and economic stability. Local Government and Public Works […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "COMMENT: New era of Zifa leadership to inspire women, young girls",
            "url": "https://www.chronicle.co.zw/comment-new-era-of-zifa-leadership-to-inspire-women-young-girls/",
            "content": "History was made last week in Zimbabwean football when, for the first time, both the chairperson and chief executive officer of the Zimbabwe Football Association (Zifa) were women.\n\nYvonne Manwa, the chief executive officer and Loveness Mukura, the vice chairperson, stepped into leadership roles simultaneously, making a strong statement about gender equality in sports administration.\n\nThis milestone is not only a victory for Zimbabwean football but a beacon of hope for gender representation across the African continent.\n\nThe significance of this achievement cannot be overstated. Zimbabwe has taken a progressive step by ensuring that women are represented at the highest levels of football governance.\n\nHistorically, leadership in sports, particularly in Africa, has been male-dominated, with women often relegated to the sidelines. The presence of Mukura and Manwa at the helm challenges these long-standing norms and provides a visible example that women can lead and shape the future of football.\n\nMukuras appointment as the first woman to act as Zifa president is particularly noteworthy. It underscores Zimbabwes commitment to fulfilling the objectives set out in the 2008 SADC Protocol on Gender and Development, which advocated for equal representation in all spheres of life. This move signals a shift in mindset, demonstrating that womens voices and leadership are not only valued but essential in shaping the future of sport.\n\nThe composition of the current Zifa executive is further proof of this transformation. Out of the eleven members, four are women: Mukura, Alice Zweure, womens soccer boss Barbara Chikosi and Kudai Kadzombe. This marks a significant improvement from previous years when only the womens soccer boss was included in the Zifa board. Such inclusivity is crucial in ensuring that policies and decisions are reflective of the diverse stakeholders in Zimbabwean football.\n\nProminent voices in sports have hailed this development as a major step forward. Tennis coach Tambu Tapera, praised football for leading the charge in empowering women, while former footballer Fungai Mupfeka, expressed hope that these women would make a lasting impact rather than merely filling quotas. Similarly, advocate Busi Bhebhe described this as a ground-breaking moment for both Zimbabwean football and womens empowerment, emphasising the need to continue breaking systemic barriers that hinder female leadership in sports.\n\nThis milestone comes at a fitting time, coinciding with International Womens Month under the theme Accelerate Action. It is a reminder that while progress has been made, there is still much work to be done.\n\nThe inclusion of women in football governance should not be seen as a token gesture but as a commitment to long-term change.The hope now is that this historic moment will inspire more young girls and women to pursue careers in football  both on and off the pitch. By fostering an environment where women can lead, Zimbabwean football is taking a crucial step toward true inclusivity.\n\nThe challenge remains to ensure that this progress is sustained, paving the way for a future where leadership in sports is defined by merit rather than gender.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dfsdd.jpg",
            "description": "History was made last week in Zimbabwean football when, for the first time, both the chairperson and chief executive officer of the Zimbabwe Football Association (Zifa) were women. Yvonne Manwa, the chief executive officer and Loveness Mukura, the vice chairperson, stepped into leadership roles simultaneously, making a strong statement about gender equality in sports administration. […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Celebrating broadcasting trailblazer Maria Masoka",
            "url": "https://www.chronicle.co.zw/celebrating-broadcasting-trailblazer-maria-masoka/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nThis month, the world celebrates extraordinary women making remarkable strides, and among them is Maria Nombulelo Mntase Masoka, a seasoned radio broadcaster and station manager of Khulumani FM, who continues to make her mark.Born and raised in Marhawane, Mbembesi, Matabeleland North, Masoka has over two decades of experience in radio broadcasting.\n\nA proud Xhosa woman, she is breaking barriers in the broadcasting scene, proving that excellence knows no boundaries. She has navigated various roles in the industry, covering topics ranging from politics to entertainment.\n\nReferred to by many as Mntase, a shortened form of mntasekhaya, meaning homeboy or homegirl, Masoka began her career at the Zimbabwe Broadcasting Corporations National FM. She was among the stations pioneers, working under the leadership of the formidable iron lady, Phathutshedza Manala, who was the station manager at the time.\n\nDespite never envisioning a career in broadcasting, Masoka grew up as an ardent radio fan, listening to the likes of Mr Cool (Kudzi Marudza) on the then Radio Three and James Maridadi. In fact, she was set to become a temporary teacher at Emqwashini Primary School in Umguza district when fate intervened. A relative heard a radio advertisement calling for presenters proficient in indigenous languages and encouraged her to audition.\n\nI was preparing to join our local primary school as a temporary teacher while waiting for my A-Level results when I got the opportunity to audition in Harare.\n\nAt first, I was nervous and struggled to follow studio instructions, but the then-executive producer at Pockets Hill, Elias Mange, helped me loosen up. The audition was on a Saturday, and by the next day, I received a call saying I had made the cut and was shortlisted. I couldnt believe it.\n\nWhat scared me the most was that most of my peers were armed with diplomas and degrees, while I only had a birth certificate and an O-Level certificate. The rest, as they say, is history, she recalled.\n\nMasoka later served in ZBCs News and Current Affairs department as an anchor before joining Khulumani FM in 2018. From starting with just an O-Level certificate, she has since obtained a Diploma in Public Relations and a Degree in Media Studies.\n\nHer appointment as Khulumani FMs station manager last year marked a major milestone in her career  one she attributes to divine intervention.\n\nHe (God) says in the book of Jeremiah, I knew you while you were still in your mothers womb and anointed you. So, again, because my time was about to come, God did it for me. He moved people around  some got promoted, others left for greener pastures  and that created a space for me, she shared with Chronicle Showbiz.\n\nMasokas leadership style is built on empathy, passion, dedication and humility. She believes in empowering her team and fostering a collaborative environment.\n\nI lead a very vibrant and supportive team, which makes it easy for the station to grow. Were a team of young, talented, and strong producers/presenters, and our motto is: When we win, we win together. When we fail, we fail together.\n\nUnder her stewardship, Khulumani FM  now celebrating its seventh anniversary  achieved a first as they managed to broadcast live from outside the country, with a ground-breaking event in South Africa. From March 6 to 7, the Khulumani FM team conducted four live broadcasts, hosted a music concert, and facilitated a workshop in the neighbouring country.\n\nMasoka described the experience as stepping into a larger world, where every broadcast becomes a bridge connecting hearts and cultures across borders.\n\nDeeply rooted in her culture, Masoka has actively participated in programmes promoting the IsiXhosa language in Zimbabwe and was part of the team that translated the countrys constitution from English to IsiXhosa. Her moniker, Mntase, is not just a name  it embodies her spirit of community, resilience, and cultural pride.\n\nAs a woman in broadcasting, Masoka sees Womens History Month as a time for reflection and celebration.This month is especially inspiring to me, as it brings to mind the legacy of Matabeleland queens like Queen Lozikeyi, whose leadership and vision continue to inspire and impact my work today.\n\nTo her younger self, Masoka would say: All things are possible with hard work, dedication, focus and discipline. Embrace every opportunity, knowing that challenges are just stepping stones to growth. Miracles happen when you persevere.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/EFF.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com This month, the world celebrates extraordinary women making remarkable strides, and among them is Maria Nombulelo “Mntase” Masoka, a seasoned radio broadcaster and station manager of Khulumani FM, who continues to make her mark. Born and raised in Marhawane, Mbembesi, Matabeleland North, Masoka has over two decades of experience in radio broadcasting. […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        },
        {
            "title": "Kaindu’s selection dilemma",
            "url": "https://www.chronicle.co.zw/kaindus-selection-dilemma/",
            "content": "Innocent Kurira,[emailprotected]\n\nTHE lifting of Highlanders Fifa transfer ban has brought a sense of relief but coach Kelvin Kaindus preparations for Saturdays Castle Lager Premier Soccer League encounter against Greenfuel remain clouded by the possibility of not having any new signings for the assignment.\n\nDespite the ban being lifted earlier this week, the teams injury woes and uncertainty surrounding the registration of new signings continue to trouble the Bosso coach.\n\nIn their opening two matches, Highlanders have lost 1-0 away to MWOS and won 4-0 against Kwekwe United at Barbourfields Stadium last weekend.\n\nAhead of the Greenfuel clash, Kaindu said some of his players are battling to recover from various injuries without releasing names of the specific players.\n\nIt becomes a bit difficult for us as coaches to give names of players who are injured or have knocks because we have to protect some of these boys. That is why we keep some of these things confidential. We just hope that some of our few players that were on the injury list and those that picked up minor knocks on the last game will be fit for the game that we are playing on Saturday. We are just hopeful that today as we do our last training session, they will be available for selection, said Kaindu.\n\nHe also refused to discuss specifics about the clubs new additions after the lifting of the ban, but spokesperson Nozibelo Maphosa revealed that an official announcement will be made soon.\n\nWe are likely to release our new signings together with the entire squad for the season. The ban was lifted earlier this week, and we are still working on the paperwork for some of the players, said Maphosa.\n\nKaindu said it is the responsibility of the club to give updates.Once there are any developments the club will certainly give an update. Of course, the lifting of the ban gives us an advantage as the technical team. We have struggled to come up with a 20-man squad, he said.\n\nKaindu said in the first game they had 17 players including injured players and in the second game 18 players were available.Among the new recruits expected to join Bosso is defender Marlvern Hativagoni, who joins on a one-year loan deal from Bulawayo Chiefs.\n\nA seasoned campaigner with several caps for the Zimbabwe Warriors, Hativagoni previously played for Ngezi Platinum on loan and will bring invaluable experience to Bossos defence.\n\nStriker Never Rauzhi is set to return to Highlanders despite interest from TelOne.Rauzhi, a talented and quick forward, has struggled with injuries since his initial move to Bosso last season but is now fit and ready to rediscover his form.\n\nOther new signings include winger Tendai Muvuti from Hwange FC, who previously played for Bulawayo Chiefs and midfielder Hubert Ncube from ZPC Hwange, who will bring energy and creativity to the team. Striker Mbonisi Ncube who has previously played in Botswana is expected to be one of the new signings.\n\nThese signings are expected to strengthen Bossos squad as they prepare to face teams like Greenfuel, whom they have met four times in the league since the latter was promoted to the top-flight league in 2022.\n\nLast season, Bosso won 4-0 at Barbourfields after the two teams had played to a 1-1 draw in Chisumbanje in the first leg.In 2023 the two teams played to one all stalemates in both encounters.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/10/Kelvin-Kaindu-680x379.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw THE lifting of Highlanders’ Fifa transfer ban has brought a sense of relief but coach Kelvin Kaindu’s preparations for Saturday’s Castle Lager Premier Soccer League encounter against Greenfuel remain clouded by the possibility of not having any new signings for the assignment. Despite the ban being lifted earlier this week, the team’s […]",
            "time": "09:29",
            "date": "14 Mar 2025"
        }
    ]
}