{
    "news": [
        {
            "title": "‘Steel, key in Zimbabwe industrial landscape’",
            "url": "https://www.chronicle.co.zw/steel-key-in-zimbabwe-industrial-landscape/",
            "content": "Patrick Chitumba and Freedom Mupanedemo\n\nPRESIDENT Mnangagwa has stressed the crucial role that reviving Zimbabwes iron and steel industry will play in boosting the countrys economy and supporting the industrial transformation of SADC.\n\nIn his keynote address at the Iron and Steel Indaba held in Kwekwe yesterday, President Mnangagwa presented a strategic plan for the revival of the sector, with a focus on meeting domestic demand and positioning Zimbabwe as a key regional manufacturing hub.\n\nThe President emphasised the urgent need for a resurgence in the iron and steel sector, noting that Zimbabwe is currently one of the largest net importers of steel products in the region, having spent more than US$1 billion on imports over the past six years.\n\nThis reality is undesirable given Zimbabwes significant mineral resources, including iron ore and chrome, which could be utilised to develop a thriving domestic industry and reduce the countrys reliance on imports.\n\nAs you are aware, the engineering, iron and steel industry has always been a cornerstone of Zimbabwes industrial landscape.In the past this was through the operations of Zisco Steel, then the largest steelworks in Zimbabwe, he said. In light of this, the resurgence of this sector is of urgent necessity.\n\nPresident Mnangagwa arrives for the official opening of the Iron and Steel Indaba in Kwekwe yesterday. He is accompanied by the Midlands Minister of State for Provincial Affairs and Devolution, Owen Ncube (second from left), and Industry and Commerce Minister Nqobizitha Ndlovu\n\nThis Indaba is, therefore, taking place at an opportune time. It is in line with our vision to ultimately establish a robust and sustainable iron and steel industry that meets domestic demand, while also positioning Zimbabwe as a regional manufacturing hub.\n\nPresident Mnangagwa identified the commencement of operations at Dinson Iron and Steel Company, spearheaded by Chinese conglomerate, Tsingshan Group, in Manhize, Mvuma, as a transformative step for the sector.\n\nResting on the mantle of Sub-Saharan Africas biggest steel behemoth and the sixth worldwide, the President commended the investment for underlining the confidence of a major global industry behemoth in Zimbabwes iron and steel subspace.\n\nThe development is in keeping with the Second Republics aspirations of spurring a robust and competitive industrial foundation.\n\nThe investment by Tsingshan Group, which is the largest steel giant in Sub-Saharan Africa, and the sixth leader in the world, is a show of confidence, by one of the global industry leaders, in our iron and steel sub-sector, he said.\n\nPresident Mnangagwa highlighted the immense potential of Zimbabwes industrial sector, applauding its significant role in value addition, beneficiation, and support of other industries such as agriculture, construction, energy, and transport. The President expressed his satisfaction with the ongoing revival of the manufacturing sector, citing a remarkable growth in capacity utilisation from 36,4 percent in 2019 to 53,2 percent in 2023.\n\nCapital investments worth a staggering US$747 million have been pumped into the sector over the past three years, with locally produced goods now occupying 80 percent of the shelves, up from 64 percent in 2019.\n\nIn light of these notable developments, President Mnangagwa emphasised that Zimbabwe, being the current chair of SADC, is well-placed to spearhead both national and regional industrialisation agendas.\n\nFurther, the present round of the Industrial Revolution is moving at a heightened pace, characterised by increased digitalisation, artificial intelligence, and innovation.\n\nThese are in turn transitioning traditional modes of production as well as broadening the range of products required by the markets.\n\nI, thus, challenge stakeholders in this sector to take leadership and implement forward-looking business models which impact beyond our borders and the continent.\n\nZimbabwe and the SADC region are part of the global village and should not be left behind, he declared.To support industrial growth, the President underlined ongoing infrastructure projects, including the Shurugwi-Mhandamabwe Road, which he commissioned yesterday, and key energy developments such as the new 720MW power plant in Hwange, which will aid the countrys drive for a robust and growing iron and steel sector anchored on broader value chains.\n\nA section of the upgraded and widened Shurugwi-Mhandamabwe road that was commissioned by President Mnangagwa in Shurugwi yesterday\n\nWith regards to the key industry enablers, infrastructure development is ongoing with both major highways and trunk roads being modernised. Later today (yesterday), I will be commissioning the Shurugwi-Mhandamabwe Road which is an important route for this and other sectors.\n\nOther national development projects such as the Gwayi- Tshangani Dam in Matabeleland North, and Tugwi Mukosi Dam, among others, are important for the realisation of our national targets, said President Mnangagwa.\n\nHe challenged stakeholders to work collaboratively, modernise legal frameworks, and strengthen partnerships between industry and academia to drive innovation.\n\nGiven that energy is the lifeblood of industrialisation and also a critical input for the iron and steel industry, I challenge stakeholders to collaborate, from the onset, towards innovative energy solutions, including renewable energy and energy-efficient technologies, said President Mnangagwa.\n\nA skilled workforce equipped with modern technical expertise is an integral component for sustaining innovation, productivity, and growth of the iron and steel industry. Hence, investments in human capital development are essential, as well as partnerships between industry players and the academia.\n\nThe President reaffirmed his administrations commitment to providing a supportive policy environment, encouraging investment, and addressing industry challenges through dialogue.\n\nWe are meeting today after my Government, through Treasury, recently presented an elaborate 2025 National Budget, which is both citizen and pro-business-centric. It is my sincere hope that as businesses, you will capitalise on the wide spectrum of both fiscal and non-fiscal incentives availed transformation, he said.\n\nAs we engage and deliberate throughout this Indaba, it is critically important that we collectively find lasting solutions to resuscitate and grow the iron and steel sector. The generality of our population counts on our unity of purpose to deliver a prosperous economy, sector by sector.\n\nOn its part, President Mnangagwa said the Second Republic continues to take a robust approach to ensure the achievements outlined in the National Development Strategy 1.\n\nWe have equally laid a solid foundation for accelerated socio-economic development and a sustained growth trajectory, under the upcoming National Development Strategy 2. A supportive policy environment to promote investments as well as increase value addition and beneficiation is assured under my administration, he said.\n\nWe are always open for dialogue and guarantee responsive measures in addressing challenges faced by local industry and commerce.\n\nHe said the countrys vast natural resources and youthful population should be continuously harnessed for sustainable industrial transformation.\n\nIt is a misnomer that we continue to lose millions every year on the importation of iron and steel and other related products. This is despite the numerous investments within our manufacturing sector.\n\nIt is on this background that the Second Republic, resolved to facilitate a vibrant, dynamic, and competitive industrial base, driven by smart and strategic value-chain linkages.\n\nWe are fostering the structural transformation of our economy by putting in place deliberate and systematic measures to graduate from being resource-driven to a knowledge-based economy, said President Mnangagwa.\n\nThis will be achieved through incremental step-by-step, brick-upon-brick, and stone-upon-stone processes.\n\nThe event, held under the theme Leveraging the Resurgence of Zimbabwes Iron and Steel Industry, was organised by the Ministry of Industry and Commerce in collaboration with the Confederation of Zimbabwe Industries (CZI) and the Engineering, Iron and Steel Association of Zimbabwe.\n\nAmong those who attended were Vice-President Dr Constantino Chiwenga, Industry and Commerce Minister Mangaliso Ndlovu, captains of industry and other players in the mining sector.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/xcvefsfd.jpg",
            "description": "Patrick Chitumba and Freedom Mupanedemo PRESIDENT Mnangagwa has stressed the crucial role that reviving Zimbabwe’s iron and steel industry will play in boosting the country’s economy and supporting the industrial transformation of SADC. In his keynote address at the Iron and Steel Indaba held in Kwekwe yesterday, President Mnangagwa presented a strategic plan for the […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "‘Road infrastructure anchor for regional integration’",
            "url": "https://www.chronicle.co.zw/road-infrastructure-anchor-for-regional-integration/",
            "content": "Zvamaida Murwira in SHURUGWI\n\nZIMBABWE will continue developing and upgrading road infrastructure as it is a key enabler for economic development and growth not only for the country but for the region and beyond, President Mnangagwa has said.\n\nThe President said this addressing thousands of people gathered at Mkandapi Business Centre in Shurugwi district soon after commissioning a resurfaced 43-kilometre stretch of the Shurugwi-Mhandamabwe Highway.\n\nThe commissioning of Shurugwi-Mhandamabwe road is part of the Second Republics elaborate plans to stimulate economic growth anchored on infrastructural development.\n\nGovernment particularly wants to improve the countrys road network to enhance connectivity as envisaged in the National Development Strategy 1.\n\nPresident Mnangagwa arrives for the official opening of the Iron and Steel Indaba in Kwekwe yesterday. He is accompanied by the Midlands Minister of State for Provincial Affairs and Devolution, Owen Ncube (second from left), and Industry and Commerce Minister Nqobizitha Ndlovu\n\nAddressing a cheerful bumper crowd soon after unveiling a plaque at the nearby Chachacha Business Centre, President Mnangagwa said the project is part of the Governments development trajectory towards the attainment of Vision 2030.\n\nHe said Vision 2030 entailed the implementation of a harmonised regional strategy for road infrastructure development.\n\nThis project is part of Governments broader plan by the Second Republic aimed at attaining Vision 2030, which we should celebrate. The implementation of a harmonised regional strategy for road infrastructure in our region is not only for Zimbabwe but for the region. We collaborate in many respects so that when our neighbours visit us, they should cherish what we are doing, said President Mnangagwa.\n\nHe commended the Ministry of Transport and Infrastructural Development led by Minister Felix Mhona for spearheading several road projects in the country.\n\nTodays event is impactful as we transform and upgrade our transport infrastructure which is a key enabler of our economic growth and development. I grew up in this area and in the 1940s and 1950s, we would travel long distances from here to\n\nShurugwi and Gweru to sell sweet potatoes and other products with my mother. We would take the whole day travelling but now because of modernisation, it is taking a few hours. This has all changed, President Mnangagwa said.\n\nHe urged ministries to continue pushing projects that have a national impact and also bear economic benefits\n\nPresident Mnangagwa cuts the ribbon at Chachacha Business Centre to officially commission the Shurugwi-Mhandamabwe Road project in Shurugwi district, Midlands Province yesterday. Assisting him are Ministers Felix Mhona (second from right) and Lovemore Matuke (right), and Permanent Secretary in the Transport Ministry Engineer Joy Makumbe (left).  Picture: Believe Nyakudjara\n\n.\n\nWe need to provide an efficient transport network which is essential for enabling people to exchange visits and access markets and also to promote regional and international integration. Zimbabwe cannot grow in isolation. The development of Zimbabwe is inter-related with the development of other countries in the region. Any challenges that might affect one country in the region hurt other countries in the region, said President Mnangagwa.\n\nFor our country to develop we require robust infrastructure, planning and development, we need to develop the necessary domestic linkages. You must have a zeal to develop your own country. What determines the development of a country is its infrastructure, road network, schools and clinics that are adjacent to communities. You do not need to travel long distances to access social services such as education and health.\n\nHe commended Road Truckers Construction, the company that resurfaced Shurugwi Mhandamabwe Highway, for a job well done.\n\nTurning to the countrys natural resources, President Mnangagwa said minerals must benefit the communities from which they are being extracted.\n\nWe also do not allow indiscriminate mining without due regard to the environment and land degradation, he said.On agriculture, President Mnangagwa said farmers should continue preparing for the summer cropping season and assured villagers that the Government will continue providing seed inputs.\n\nHe also urged motorists not to drink and drive ahead of the festive season, calling on law enforcement agencies to apply the law firmly to ensure an accident-free holiday.\n\nTransport and Infrastructural Development Minister Felix Mhona commended President Mnangagwa for his leadership which he said had seen his Ministry registering several milestones in infrastructure development.\n\nYour wise leadership has registered wonders despite illegal sanctions that would have ordinarily affected the projects, he said.Midlands Provincial Affairs and Devolution Minister, Owen Ncube, said the province has been a hub of development owing to the leadership of President Mnangagwa.\n\nA section of the upgraded and widened Shurugwi-Mhandamabwe road that was commissioned by President Mnangagwa in Shurugwi yesterday\n\nThe Shurugwi-Mhandamabwe road is viewed as a catalyst for enhancing transport movement along the Southern corridor and has gone through a substantial transformation to improve border-to-border connectivity.\n\nIt primarily connects Beitbridge with other borders, including Chirundu and Nyamapanda.The event was attended by Cabinet Ministers, legislators, traditional leaders and senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/xxcczxzxcxc.jpg",
            "description": "Zvamaida Murwira in SHURUGWI ZIMBABWE will continue developing and upgrading road infrastructure as it is a key enabler for economic development and growth not only for the country but for the region and beyond, President Mnangagwa has said. The President said this addressing thousands of people gathered at Mkandapi Business Centre in Shurugwi district soon […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "Bulawayo City Council forced to rebase budget on 2017 tariffs",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-forced-to-rebase-budget-on-2017-tariffs/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nFOLLOWING a contentious meeting involving residents associations, business representatives, and other stakeholders, the Bulawayo City Council (BCC) has been forced to revise its proposed 2025 budget.\n\nThe meeting, chaired by the Ministry of Local Government and Public Works director of local authorities inspectorate, Ms Priscillar Mudzinge, resolved to base the revised budget on 2017 tariffs.\n\nA committee representing industry leaders, residents groups, tourism players, and academic institutions has been tasked with crafting the revised budget by December 20 and presenting it to the ministry by January 7.\n\nThis decision was made in response to sharp criticism from the Confederation of Zimbabwe Industries (CZI) Matabeleland Chapter, and the Zimbabwe National Chamber of Commerce (ZNCC), among other stakeholders, over alleged miscalculations in tariff adjustments for 2022 and 2023, resulting in exorbitant charges that forced businesses to scale down or relocate.\n\nYesterday, a no-holds-barred meeting at the council chambers was held between BCC, residents associations, ZNCC and CZI representatives to discuss the matter.\n\nBCC presented a US$309 million budget for 2025 in September, aimed at enhancing service delivery, focusing on gender-specific projects and revitalising the citys recreational facilities.\n\nHowever, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, directed the Ministry of Local Government and Public Works last month not to approve the budget until the local authority addresses concerns raised by the business community regarding the 2024 budget.\n\nCZI Matabeleland Chamber accused BCC of using an incorrect formula to index tariffs for 2022 and 2023 in US dollars, resulting in exorbitant charges.\n\nDespite a series of meetings between CZI representatives, BCC officials and Bulawayo Provincial Affairs and Devolution Minister, Judith Ncube, there was no resolution resulting in an impasse.\n\nIn his letter to the Ministry of Local Government and Public Works permanent secretary, Dr John Basera, Dr Rushwaya said he found issues raised by the CZI to be invaluable and deserving of engagement by the local authority.\n\nActing town clerk, Mrs Sikhangele Zhou, acknowledged the concerns and stated that the new budget would incorporate inflation-adjusted increases from 2017 to 2025 while striving to strike a balance between affordability and service delivery.\n\nMrs Sikhangele Zhou (second from left) and other council officials follow proceedings at the stakeholders meeting yesterday\n\nWhat the business community is saying is that when we changed in 2022 we used a factor which gave higher rates yet if we had just used inflation figures on the United States dollar tariffs, we would probably have come up with different figures, said Mrs Zhou.\n\nWhat the council is saying is that even without those figures, the prices of goods have affected the tariff increases so the committee ought to see what is reasonable and strike a win-win situation.\n\nCZI Matabeleland Chapter president, Mr Stephen Ncube, welcomed the resolution, calling it a relief for industry and residents.He noted that the agreement could pave the way for Bulawayos industrial revival after years of stagnation due to high operational costs.\n\nWe are excited that we have found each other with the council because their tariffs, particularly fixed costs, were one of the cost drivers for industries which forced some to scale down operations while others relocated to business-friendly cities, he said.\n\nNow that we are reverting to the 2017 figures, going forward this will be a huge relief to industry and commerce and even residents.\n\nMr Ncube said the 2025 budget that will be presented in January will be based on financial facts not estimates.Bulawayo United Residents Association (BURA) secretary-general, Mr Edward Nare, said the councils lack of transparency had caused the impasse but commended the collaborative spirit of the meeting.\n\nPeople were failing to work together as a team, but I am happy that from todays meeting, parties found each other. I also realised that in terms of recommendations, while other stakeholders put forward theirs, the council failed to do the same, said Mr Nare.\n\nHe said during their engagements, BCC claimed that the increases were being fuelled by the market as prices of goods and services were constantly going up.\n\nWe did our investigations together with CZI and ZNCC and our findings were that most businesses had zero or minimal increases in United States dollars which made us conclude that BCC was not being honest about the matter, said Mr Nare.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/u7pl.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw FOLLOWING a contentious meeting involving residents’ associations, business representatives, and other stakeholders, the Bulawayo City Council (BCC) has been forced to revise its proposed 2025 budget. The meeting, chaired by the Ministry of Local Government and Public Works’ director of local authorities’ inspectorate, Ms Priscillar Mudzinge, resolved to base the revised budget […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "COMMENT| Council must fix every water leak without delay",
            "url": "https://www.chronicle.co.zw/council-must-fix-every-water-leak-without-delay/",
            "content": "BULAWAYO City Council has shown a lack of concern for the plight of its residents by failing to attend to a water leak at the Criterion Water Works in Burnside for the past 12 months.\n\nSimilarly, other leaks around the city have been left unaddressed, while residents continue to suffer acute water shortages for at least six days each week.\n\nThis situation is unacceptable, to say the least, especially when we are in the midst of a crippling drought, and every drop of water counts.\n\nIt is disheartening that the council, which should be at the forefront of preserving this precious liquid, has taken such a lackadaisical approach. This is a water crisis, and as such, it demands a co-ordinated and urgent response from all stakeholders.\n\nAs the guardians of our water infrastructure, the council has a solemn obligation to ensure that every leak is fixed immediately and that all efforts are made to conserve water.\n\nIt is unfathomable that a water leak of this magnitude has gone unattended for a year, while residents suffer the consequences of this negligence.\n\nAny leak, no matter how small, has the potential to waste thousands of litres of water every day.With Bulawayo experiencing severe water scarcity, such wastage is unacceptable and must not be allowed to continue.\n\nWater is a precious resource, and it must be treated as such. The council should be leading by example, showing residents that water conservation is a top priority and that every effort is being made to ensure we have access to this essential commodity.\n\nInstead, it is subjecting residents to a punishing water-shedding schedule that affects their everyday lives and businesses.It is not enough for the council to explain that it is facing financial constraints and that the situation is beyond its control.\n\nThis is a municipal body, and it has a responsibility to serve residents in the best way possible, and this includes providing basic services such as clean water.\n\nThe council must find innovative ways of addressing this water crisis, including exploring partnerships with other stakeholders to fund water conservation initiatives.\n\nThe council must fix every water leak without delay, and institute measures to conserve water.It must also be transparent in its plan to address this crisis, communicating with residents effectively, and providing regular updates on the progress made.\n\nIt is time for the council to take the issue of water conservation seriously, and to act in the interest of residents who rely on it for their daily needs.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/01/tower-and-revenue-block.jpg",
            "description": "BULAWAYO City Council has shown a lack of concern for the plight of its residents by failing to attend to a water leak at the Criterion Water Works in Burnside for the past 12 months. Similarly, other leaks around the city have been left unaddressed, while residents continue to suffer acute water shortages for at […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "State of Ingutsheni Hospital appals minister",
            "url": "https://www.chronicle.co.zw/state-of-ingutsheni-hospital-appals-minister/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nHEALTH and Child Care Minister, Dr Douglas Mombeshora, has expressed concern over the appalling state of infrastructure at Ingutsheni Central Hospital in Bulawayo, including the nurse-patient ratio, and called for urgent remedial action to address the problem.\n\nThe minister, who was on a familiarisation tour of the institution, was told by the chief medical officer, Dr Nemache Mawere, that there are 578 patients at Ingutsheni Central Hospital whose carrying capacity is 708. The hospital, which sits on a 130-hectare land, has 14 wards.\n\nDr Mombeshora visited one of the wards, Khumalo, where he was told that there are 139 patients and 98 beds. After the ward tour, he visited the institutions thriving horticulture and poultry projects.\n\nMinister of health and child care Dr Douglas Mombeshora tour Ingutsheni\n\nSpeaking to the media after the tour, Dr Mombeshora said there is a serious challenge with the infrastructure at the institution which is failing to accommodate patients with acute psychosis.\n\nThere is a lot of work that needs to be done in the wards because patients who are here are not the same as those you find in other central hospitals because they need special care. We need adequate and trained staff to be here, he said.\n\nI know that the hospital is at a nine percent vacancy rate which is better than in the ministry, but obviously, we have to prioritise this hospital because of the kind of patients they attend to.\n\nDr Mombeshora further noted that the ablution facilities are in a deplorable state while water supplies are critical.He said there is a need to strengthen security in the wards. Some of the window panes are broken while doors have been vandalised.\n\nWe understand that most of the infrastructure was vandalised by patients who would have become acute psychotic yet we dont have anti-psychotics to calm them down. As a ministry, we have promised to put more effort into acquiring the drugs and we must ensure that by the end of January, some of these drugs will have been procured to improve the stocks, said Dr Mombeshora.\n\nHowever, it is pleasing that the hospital now has doctors who are doing psychiatric training. We hope that these doctors will come back after training and help in improving service delivery in the institution.\n\nOn the nursing side, Dr Mombeshora said the ministry has now planned to double the intake of nurses.In some of the wards you need a nurse-to-patient ratio of 1:1 yet its actually 1: 20 which is not an ideal situation. So, we hope with time that will be covered through training, he said.\n\nDr Mombeshora, who arrived at the Khumalo ward during lunchtime for the patients, said he was not happy with the diet the institution was giving to patients.\n\nI was not happy with the type of food being eaten by our patients, it must be improved. We cannot have our patients having the same diet of isitshwala, cabbage and beans every day, he said.\n\nThe minister lauded the institution for thinking outside the box by coming up with income-generating projects.The hospital was established in 1908 as an asylum centre where prison guards were the original carers.\n\nIn the 1940s, psychiatry services were established but the services were racially biased until the country attained independence in 1980.\n\nSt Marys 1, a female ward, carries a significant number of substance-use patients, including survivors of gender-based violence and sexual assault.\n\nThe major substances used include alcohol, cannabis, crystal meth, and cough mixtures.The other wards are also occupied by patients who developed chronic illnesses that were complicated by substance use and these are Mzilikazi 2 (46 patients/40 beds) and Dawson Ward (40/75). The Mambo ward (56/49) is occupied by patients who committed serious crimes like murder and rape.\n\nThey are a danger to society and their families are not keen to welcome them back. We thus keep them for life. When patients become old and mostly suffer from substance use complications and other dementias, the patients are put in Nandi and St Lukes geriatric wards, said Dr Mawere.\n\nThe rest of the hospital comprises patients who have severe to profound intellectual disability and accompanying physical disabilities. These live at Ingutsheni all their lives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/MINIST1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw HEALTH and Child Care Minister, Dr Douglas Mombeshora, has expressed concern over the appalling state of infrastructure at Ingutsheni Central Hospital in Bulawayo, including the nurse-patient ratio, and called for urgent remedial action to address the problem. The minister, who was on a familiarisation tour of the institution, was told by the […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "Chevrons to ride on momentum",
            "url": "https://www.chronicle.co.zw/chevrons-to-ride-on-momentum/",
            "content": "Eddie Chikamhi,Zimpapers Sports hub\n\nTOP-ORDER batter Brian Bennett believes that his team needs to maintain its momentum to secure the T20I series against Afghanistan.\n\nThe second match will take place today at Harare Sports Club. With a 1-0 lead in the three-match series, Zimbabwe has the opportunity to clinch a rare T20I series win, having defeated Afghanistan by four wickets in the first match on Tuesday.\n\nThe Chevrons have won their previous two T20I matches, including a close match against Pakistan in their last series held in Bulawayo.\n\nDespite his personal achievement of being named Man of the Match in both recent games, Bennett emphasised that it will require a significant amount of hard work and dedication from the entire team to secure a series victory.\n\nObviously, winning the T20 last week gave us momentum coming into this week. So, to win the first game against Afghanistan and to start the series with a win gives confidence.\n\nBut you know what? Therere still two more games to go, so theres still a lot to work on, said Bennett.\n\nThe Chevrons last won a T20I series almost two years ago when they beat Ireland 2-1 at Harare Sports Club. But they failed to clinch a win in the subsequent six series, despite coming close on occasions.\n\nBennett is slowly establishing himself in the team. His knock of 43 runs won him the Man of the Match against Pakistan at Queens Sports Club last week. But it came a bit late as Zimbabwe lost the series 2-1.\n\nBut on Tuesday he was more focused with a run-a-ball 49, which again turned out to be a Man of the Match performance.\n\nThe 21-year-old, together with Tinotenda Maposa (21), Tashinga Musekiwa (24), Dion Myers (22) and wicketkeeper/batsman Tadiwa Marumani (22), are regarded as the future of the Zimbabwe team.\n\nI did make my debut last year in December, so Ive been in the national set-up for a year now. So, you know what; Im still young, said Bennett.\n\nIm still learning with each game as well. And its nice to have the senior guys in camp helping you and just learning. There are good experienced coaches as well.\n\nIve still got a long way to go. So, theres still a lot more learning to do, said Bennett.\n\nSenior players like Richard Ngarava, Blessing Muzarabani and skipper Sikandar Raza are expected to guide the younger players in the setup.\n\nNgarava was the pick of the Zimbabwe bowlers in the last match with figures of 3/28. If he could provide the same kind of leadership, the Zimbabwean bowlers could achieve more today.\n\nZimbabwe also need to work on their batting inconsistencies, which at times have resulted in familiar collapses.\n\nHowever, Afghanistan are not easy opponents for Zimbabwe, especially in this format. Out of the 16 games played between these two nations in almost two decades, Zimbabwe have only been able to beat Afghanistan twice.\n\nChevrons skipper Raza believes the win on Tuesday could spur on his side.\n\nZimbabwe needed that victory, he said.\n\nWe really needed it for the changing room and for the fans to start believing. A win like that basically will tell us where we went wrong.\n\nSometimes, the result is not in our control. We have agreed to give it everything we have for the nation, said Raza.\n\nAfghanistan will be eager to turn the tables and keep the series alive. The Afghans have the personnel to do that with several seasoned campaigners in their squad such as Rashid Khan, Rahmanullah Gurbaz, Hazratullah Zazai, Mohammad Nabi, Fazal Haq Farooqi and frontline spinner Mujeeb Ur Rahman, among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/cxzzzz.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports hub  TOP-ORDER batter Brian Bennett believes that his team needs to maintain its momentum to secure the T20I series against Afghanistan.  The second match will take place today at Harare Sports Club. With a 1-0 lead in the three-match series, Zimbabwe has the opportunity to clinch a rare T20I series win, having […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "Miss Rural Zim contestants take a stand against Gender-Based Violence",
            "url": "https://www.chronicle.co.zw/miss-rural-zim-contestants-take-a-stand-against-gender-based-violence/",
            "content": "Sipepisiwe Moyo\n\nTHE 16 Days of Activism Against Gender-Based Violence, which ran from November 25 to December 10 under the theme Towards 30 Years of the Beijing Declaration and Platform for Action: UNITE to End Violence Against Women and Girls, has seen Miss Rural Zimbabwe Matabeleland South contestants raising awareness on issues affecting women and girls in rural areas.\n\nNyasha Mareza from Bulilima who was crowned Miss Rural Zimbabwe Matabeleland South this year, highlighted the plight of teenage girls in her community.\n\nMost teenage girls from Bulilima fall victim to abuse, leading to teenage pregnancies and a high number of single mothers, she said.\n\nMany aspire to go to Botswana or South Africa, often falling prey to men who promise a better life but abandon them after impregnating them. This cycle repeats every December, leaving young girls with shattered educational dreams, multiple children by the age of 18, and often infected with HIV or other STDs.\n\nShe called for awareness campaigns starting at primary school level to empower girls and educate them about the dangers of early and unprotected sex.\n\nNomvula Mafu, another contestant from Matabeleland South, echoed Nyashas sentiments.\n\nMiss Rural Zimbabwe Matabeleland South Queen, Nyasha Mareza\n\nRural girls face abuse even on their way to buy bread. In areas like Mbondweni, where there is no police station, girls are beaten and forced into relationships by boys with no avenues for reporting such incidents. We endure daily exposure to violence, said Mafu.\n\nMiss Rural Zimbabwe founder, Sipho Mazibuko, attributed the rise in GBV to drug and substance abuse.\n\nAs the founder of Miss Rural Zimbabwe and Mental Voices Trust, I use the pageant to spread awareness of GBV in rural areas. We teach girls their rights and emphasise the importance of preserving their bodies until theyre older and more informed about sexual activities, she said.\n\nMazibuko also called for the government to ban njengu, a cheap and harmful alcohol prevalent in Matabeleland.\n\nNjengu is destroying our youth. Drunken perpetrators rape and abuse girls and even assault their parents when denied money to buy alcohol. Legislators who profit from selling njengu are complicit in fuelling GBV, she charged.\n\nShe further highlighted the urgent need for awareness campaigns to reach remote rural areas.\n\nEducation on drug and substance abuse only reaches growth points. Deep rural communities are left in the dark, she said.\n\nMental Voices Trust has partnered with Ingutsheni Hospital to show contestants the impact of drug abuse by visiting mental health patients.\n\nSifiso Moyo, a Community Child Care worker from Insiza district, shared the grim reality of GBV in rural areas.\n\nGirls fall victim to illegal gold panners (amakorokoza) who impregnate schoolchildren by luring them with money and false promises of a lavish lifestyle, she explained.\n\nMoyo revealed that care workers often fear for their safety, as police disclose their identities after reporting cases.\n\nWere working tirelessly to raise awareness about GBV, teenage pregnancies, and drug abuse, but the lack of enforcement and support from authorities hinders our efforts, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/XCVXCVXCVXCVXCVXCVXCVXCVXCV.jpg",
            "description": "Sipepisiwe Moyo THE 16 Days of Activism Against Gender-Based Violence, which ran from November 25 to December 10 under the theme “Towards 30 Years of the Beijing Declaration and Platform for Action: UNITE to End Violence Against Women and Girls”, has seen Miss Rural Zimbabwe Matabeleland South contestants raising awareness on issues affecting women and […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "US$20K grants for smallholder farmers",
            "url": "https://www.chronicle.co.zw/us20k-grants-for-smallholder-farmers/",
            "content": "Leonard Ncube,[emailprotected]\n\nSMALLholder farmers across selected provinces in Zimbabwe can now access grants of up to US$20 000 for agricultural projects under the Smallholder Agriculture Cluster Project (SACP), a Government initiative aimed at fostering market-led, climate-smart agriculture.\n\nThe SACP is a six-year programme running from 2021 to 2027, and it is being implemented by the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development in collaboration with the International Fund for Agricultural Development (IFAD) and the Opec Fund for International Development (Ofid).\n\nFocusing on 18 districts across five provinces  Matabeleland North, Mashonaland Central, Mashonaland East, Mashonaland West, and parts of Midlands  the project seeks to develop value chains, enhance resilience to climate change, and improve irrigation systems to cushion farmers from adverse weather conditions.\n\nSACP national project co-ordinator, Dr Godfrey Nehanda, said the project has three components which include value chain development, formation of agriculture producer groups, and micro and small enterprises.\n\nActivities include capacity building, business development and financial literacy for farmers.\n\nDr Nehanda said SACP is working with the Reserve Bank for Zimbabwe (RBZ) on the line of credit for smallholder farmer groups.\n\nThe focus is on value chain mobilisation where there is the identification of key lead enterprises and formation of agriculture producer groups constituted by smallholder farmers of which 50 percent should be women and 30 percent youth operating in specific value chains, he said.\n\nThe idea is to build the capacity of those producer groups to increase production and productivity.\n\nDr Nehanda said the third component is the micro and small enterprises that offer services to smallholder farmers.\n\nSACP, in collaboration with the Reserve Bank of Zimbabwe (RBZ) and partner financial institutions, is introducing a line of credit and matching grants for smallholder farmers.\n\nReserve Bank of Zimbabwe (RBZ)\n\nWe are also assisting smallholder farmers to be able to produce business plans that can attract funding. SACP is putting money in the form of a line of credit to be administered through the Reserve Bank of Zimbabwe working with partner financial institutions that will onward lend, said Dr Nehanda.\n\nThe grants will be provided on an 80:20 matching ratio, where the project contributes 80 percent of the required funding, while beneficiaries provide the remaining 20 percent. The maximum grant amount ranges from US$15 000 to US$20 000.\n\nDr Nehanda said the project borders around climate-proofed infrastructure components, value chain, and irrigation schemes rehabilitation where a total of 1 780ha will be worked on, fenced, and drip irrigation facilities installed.\n\nThe project also focuses on the development of last mile feeder roads where a maximum of 89km will be worked on in rural areas connecting main roads to the main activity areas such as the market to facilitate the movement of goods.\n\nSACP is also targeting prolific boreholes in partnership with the Zimbabwe National Water Authority and Rural Development Agency.\n\nBoreholes are being solarised and installed with 10 000 litre tanks.\n\nWe are introducing climate-smart agriculture providing drinking troughs, washing basins, and potable water points for the targeted communities as we complement the efforts of Government.\n\nThere is a fourth contingency component where the lead funder can mobilise funding to respond to issues. We are trying to respond to drought issues in collaboration with Government, said Dr Nehanda.\n\nThe project works closely with Government agencies, including Agritex, Zinwa, and the Irrigation Department, to ensure effective implementation. SACPs team is currently operational in Matabeleland North, while capacity testing for boreholes is ongoing in other provinces to identify sites for the next phase.  @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2017/05/usdollar.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw SMALLholder farmers across selected provinces in Zimbabwe can now access grants of up to US$20 000 for agricultural projects under the Smallholder Agriculture Cluster Project (SACP), a Government initiative aimed at fostering market-led, climate-smart agriculture. The SACP is a six-year programme running from 2021 to 2027, and it is being implemented by the […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "Packed programme for President in Botswana",
            "url": "https://www.chronicle.co.zw/packed-programme-for-president-in-botswana/",
            "content": "Wallace Ruzvidzo in GABORONE, Botswana\n\nPRESIDENT Mnangagwa will have a packed itinerary today when he arrives for his maiden visit to the SADC Secretariat Headquarters since assuming Chairmanship of the regional bloc.\n\nThe President will meet and engage with the Secretariat staff, receive the recently purchased SADC Secretariat Headquarters Building, and preside over a ground-breaking ceremony to construct the SADC Standby Force Regional Logistics Depot (RLD).\n\nAs chair, President Mnangagwa has the overall mandate of providing policy direction and controlling the functions of the regional bloc.\n\nUpon arrival at the Secretariat Headquarters, the President will be ushered by the SADC Executive Secretary, Mr Elias Magosi, to sign the guest book.\n\nMr Elias Magosi\n\nThereafter, President Mnangagwa will proceed to the Julius Nyerere SADC Library, where he will appreciate the SADC History Collection. This will be followed by the unveiling of the Visiting Placard by the regional bloc Chairperson.\n\nThe President will then meet the SADC Management team, where Deputy Executive Secretary for Corporate Affairs, Dr Judith Kateera, will brief him on the mandate, functions, and structure of the Secretariat and the division of responsibilities.\n\nDeputy Executive Secretary, Corporate Affairs Dr Judith Kateera\n\nHe will also be briefed on the Priorities of SADC, and the overall status of regional integration in the region (status, emerging issues, and recommendations).\n\nThe SADC Chair will then proceed to proffer guidance on the implementation of the blocs programmes going forward and preside over a meeting with all SADC Secretariat Staff accompanied by Botswana President Duma Boko.\n\nDuring their tenure, SADC Chairpersons traditionally visit the Secretariat to engage with management and address staff.\n\nThereafter, there will be a ceremonial hand over of the SADC Headquarters Building from Bongwe Investments Proprietary Limited to President Mnangagwa as Chair of the regional bloc, on behalf of the regions Heads of State and Government.\n\nPrior to its handover today, the building was being governed through a Public-Private-Partnership (PPP) Agreement involving SADC, Bongwe Investments (Proprietary) Limited as the private party and the Botswana Government as a guarantor to the PPP arrangement.\n\nFollowing engagements at the SADC Secretariat Headquarters, President Mnangagwa and his counterpart President Boko will proceed to preside over the grounding-breaking ceremony of the Regional Logistics Depot at Rasesa village, located about 40km from Gaborone.\n\nThe RLD will serve as a storage for materials, equipment and end-user stocks for use by the SADC Standby Force when undertaking mandated peace support and humanitarian missions.\n\nIn an interview yesterday, Zimbabwes Ambassador to Botswana, Henry Mukonoweshuro, said everything was in place forPresident Mnangagwas arrival this morning.\n\nHe said both the Zimbabwe and Botswana Governments, as well as the SADC Secretariat had pulled all the stops to ensure the SADC Chairs visit was a resounding success.\n\nThere is a lot of assistance from the host country and we are ready to roll. The SADC Secretariat is waiting for His Excellency (President Mnangagwa) to come and all logistics are going very well at this point in time, he said.\n\nDuring his tenure, President Mnangagwa will push for the realisation of the SADC Regional Indicative Strategic Development Plan (RISDP 2020-2030) and SADC Vision 2050.\n\nThe two strategic plans, which were approvedby the 40th Ordinary SADC Summit in Maputo, Mozambique, in 2020, seek to further deepen Southern Africas regional integration and foster development.\n\nThey are premised on three interrelated pillars; Industrial Development and Market Integration; Infrastructure Development in support of Regional Integration; and Social and Human Capital Development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/1212-2-680x380.jpg",
            "description": "Wallace Ruzvidzo in GABORONE, Botswana PRESIDENT Mnangagwa will have a packed itinerary today when he arrives for his maiden visit to the SADC Secretariat Headquarters since assuming Chairmanship of the regional bloc. The President will meet and engage with the Secretariat staff, receive the recently purchased SADC Secretariat Headquarters Building, and preside over a ground-breaking […]",
            "time": "2024-12-13 08:41:44"
        },
        {
            "title": "COMMENT| Al-Assad’s fall is Iran and Russia’s loss, but are there winners?",
            "url": "https://www.chronicle.co.zw/al-assads-fall-is-iran-and-russias-loss-but-are-there-winners/",
            "content": "Marwan Kabalan, Correspondent\n\nAfter 54 years in power, the al-Assad familys rule in Syria has come to an end. On December 8, Bashar al-Assad fled the country and sought asylum in Russia.\n\nThe collapse of one of the most brutal regimes in the modern history of the Middle East came after just 12 days of fighting between the Syrian army and a coalition of opposition forces, and put an end to the 13-year Syrian civil war.\n\nThe Syrian conflict took the lives of more than 350 000 Syrians and displaced at least 13 million. Brutal repression by the al-Assad regime turned a peaceful revolution into an internationalised civil war with Russia, Iran, Turkiye and the United States as the key players.\n\nRussias President Vladimir Putin\n\nIts collapse will inevitably rearrange the geopolitical map of the region.Syrias decades-long alliancesSyria established a diplomatic relationship with the Soviet Union in 1944 and became the first Arab country to buy Soviet-made arms a decade later.\n\nAs other Arab countries, like Egypt, began moving away from the Soviet orbit in the 1970s, Hafez al-Assads regime in Syria remained a staunch Soviet ally.\n\nRelations remained strong even after the collapse of the USSR as Russia retained its naval military base in Tartous. In 2004, Bashar al-Assad made his first state visit to Moscow in an attempt to revive the Cold War-era relationship and sought Russian assistance to modernise his army.\n\nSimilarly, Syrias strong ties with Iran are decades old. In 1979, the two countries established an enduring alliance, driven by the shared animosity towards the regime of Iraqi President Saddam Hussein. The 2003 US invasion of Iraq gave the two countries one more reason to close ranks in order to block US attempts to destabilise them.\n\nThe devastation that the US left behind in Iraq and the 2006 Lebanon war played out in favour of Iran. The so-called Shia Cresent that stretched from western Afghanistan to the Mediterranean started to take shape and Syria was at the heart of it.\n\nWhen the Arab Spring hit Syria in 2011, Iran rushed to support its ally. Tehran interpreted the Syrian revolution as an attempt by Turkiye and the Gulf states to undermine its regional influence. Pro-Iranian fighters, including members of Hezbollah, were dispatched to fight on behalf of al-Assad, whose army was plagued by desertion.\n\nIran also provided billions of dollars in financial aid and loans to support the Syria regime. When al-Assad was on the verge of collapse in 2015, Iran walked the extra mile and requested Russian support.\n\nInjuries were reported after a Russian missile struck an apartment building in Kryvyi Rih on Monday.CNN\n\nMoscows intervention helped turn the tide in favour of al-Assad as he battled opposition factions supported by the US, Turkiye and Gulf countries. It also helped establish a Russian military and diplomatic foothold, allowing the Kremlin to project power throughout the Arab world. Various state and non-state actors reached out to Russia, seeing it as a counterforce to US dominance or a possible source of leverage.\n\nAs al-Assads narrative equating the opposition with terrorists succeeded in turning public opinion in the US and the West in general, Western support for the opposition dwindled. Turkiye remained the sole foreign supporter and in 2017, it felt compelled to join the Russian-sponsored Astana format to negotiate a political solution of the conflict.\n\nIn the following years, al-Assad, backed by his Russian and Iranian allies, pushed to recapture more territory from the opposition, breaking various de-escalation agreements and ceasefires. By 2024, it looked as if Iran and Russia had succeeded in stabilising his regime and solidifying their own positions in the region. Arab and European states were starting to normalise relations with Damascus.\n\nBut an opposition offensive upended this regional balance of power within 12 days.A changing geopolitical map\n\nThe rapid collapse of the Syrian army stunned Russia and Iran and they could not do much to help the crumbling al-Assad regime.\n\nDuring a meeting within the Astana format in Doha on December 7, Iranian and Russian representatives seemed resigned to accepting that the battle for Syria had been lost to Turkiye.\n\nWith the fall of the al-Assad regime, Iran has lost a key pillar of its Shia Crescent. The land corridor it used to arm Hezbollah and project its influence in Lebanon and throughout the Levant has been cut. Irans role in the Palestinian-Israeli conflict is likely to be diminished, as it has lost key bargaining chips.\n\nIt will now be forced to retreat and look inward or it may opt for accelerating its effort to build a nuclear weapon to compensate for its dwindling regional power.\n\nRussia too has been weakened by the fall of al-Assad, as it considered the battle for Syria part of its conflict with Western imperialism. Losing its only Arab ally has dented its reputation as a global power  one that can have a say in regional affairs in the Middle East.\n\nAlthough Moscow is likely to retain for now its air force base in Hmeimim and its naval base in Tartous, its continuing presence in Syria is untenable.\n\nRussian President Vladimir Putin and Syrian President Bashar al-Assad visit an Orthodox Christian cathedral in Damascus, Syria on January 7, 2020\n\nTurkiye, by contrast, has emerged as the winner from the 14-year-old Syrian civil war. It managed to undermine its two rivals positions and is now able to exert influence over a territorial corridor that links Europe and the Gulf through Syria.\n\nThe US and the European Union have welcomed the collapse of the al-Assad regime. Both see it as a major blow to their nemesis, Russia, as well as Iran. European countries hope this development can help them resolve their refugee crises by having Syrians voluntarily return to their country.\n\nThe news of al-Assads collapse was received with mixed feelings in Israel. On one hand, Israel was thrilled to see the Iran-led alliance weakened by the fall of al-Assad as this will solidify Israeli domination of the Levant.\n\nYet, the Israeli government does not seem comfortable with its replacement.The new political power in Damascus is likely to exhibit greater solidarity with the Palestinians.\n\nThis explains why the Israeli army launched a massive aerial bombardment of all of Syria, seeking to destroy the Syrian strategic arms reserve. It fears that it might be used against it in a future confrontation with the new government in Damascus.\n\nAl-Assads fall and the new regional realignment that ensued are likely to bring a dramatic change to the balance of power in the Middle East and well only fully understand its implications in the years to come. Al Jazeera\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Russian-President-Vladimir-Putin-and-Syrian-President-Bashar-al-Assad-visit-an-Orthodox-Christian-cathedral-in-Damascus-Syria-on-January-7-2020.jpg",
            "description": "Marwan Kabalan, Correspondent After 54 years in power, the al-Assad family’s rule in Syria has come to an end. On December 8, Bashar al-Assad fled the country and sought asylum in Russia. The collapse of one of the most brutal regimes in the modern history of the Middle East came after just 12 days of […]",
            "time": "2024-12-13 08:41:44"
        }
    ]
}