{
    "news": [
        {
            "title": "Russia backs Zimbabwe …UN  Security Council bid gains ground",
            "url": "https://www.chronicle.co.zw/russia-backs-zimbabwe-un-security-council-bid-gains-ground/",
            "content": "Wallace Ruzvidzo,Harare Bureau\n\nZIMBABWEs bid for a non-permanent seat on the United Nations Security Council (UNSC) has received a major boost after Russia announced its support for the country.\n\nRussian Ambassador to Zimbabwe Mr Nikolai Krasilnikov, yesterday paid a courtesy call on President Mnangagwa at State House in Harare, to convey a message from his counterpart President Vladmir Putin as well as Russias support for Zimbabwes bid.\n\nZimbabwe will be bidding for a non-permanent seat on the UNSC for the period 2027 and 2028, a move that has been endorsed by various countries, including Cuba andIndia.\n\nSADC has also backed the country, along with other regional bodies.\n\nIn an interview after their closed-door meeting, Ambassador Krasilnikov said Russia was not only supporting Zimbabwes bid but looking forward to working with Zimbabwe on the UNSC to usher in a more democratic multipolar world.\n\nWe look forward to having Zimbabwe as a United Nations Security Council non-permanent member very soon and we are confident that together we can intensify our efforts of establishing a new, more just and democratic multipolar world, he said.\n\nThe UN Security Council has five permanent members, namely China, France, Russia, the United Kingdom and the United States of America.\n\nThe non-permanent members serve on a rotational basis.\n\nTo pass a resolution, at least nine of the 15 members must vote in favour. However, any of the five permanent members can veto a resolution, and it is in this context that Ambassador Krasilnikov said there is a need for like-minded progressive nations on the powerful UN body.\n\nYou know that together we promote very important resolutions in the United Nations, like for example the UN resolution against glorification of Nazism, neo-Nazism and other forms of racism.\n\nThis issue is very important for Russia and like-minded countries, including Zimbabwe, especially this year when we celebrate and commemorate together the 80th anniversary of the victory in the Great Patriotic War that facilitated the end of the Second World War, the establishment of the United Nations and the triumph of the liberation movements across the globe, including in Africa, he said.\n\nZimbabwe last served on the UNSC between 1991-1992 and before that in 1983-1984.\n\nThe Russian envoy said the existing cordial relations between President Mnangagwa and President Putin continued to be the backbone of Harare and Moscows increasing bilateral co-operation and partnership on the global stage.\n\nThe political dialogue between our principals reflects the very deep, very intensive and at the same time very cordial relations between President Mnangagwa and President Putin and also between our two brotherly nations.\n\nIt also gives impetus to the whole mechanism of our bilateral co-operation. We enhance our partnership along various directions, including the very close, deep co-ordination in the international arena, he said.\n\nThe Russian Ambassador said both countries were satisfied with the existing sound political relations which continued to be mutually beneficial.\n\nWe are happy with the quality and the essence of our political dialogue, our mutual comprehension of the current situation in the world and we are absolutely confident that together we can move forward not only in terms of co-ordinating our political agendas but also in terms of developing tangible co-operation to produce certain results for the benefit of our brother nations, he said.\n\nAmbassador Krasilnikov said Russia was also appreciative of Zimbabwes efforts in fostering peace in the region.\n\nWe highly appreciate and recognise the very significant role Zimbabwe plays in SADC as the chair of SADCthat was demonstrated by the recent (SADC) Extraordinary Summit held in Harare on a very crucial topic of a peaceful settlement in the eastern DRC, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bfvvcbgcvxfv.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau ZIMBABWE’s bid for a non-permanent seat on the United Nations Security Council (UNSC) has received a major boost after Russia announced its support for the country. Russian Ambassador to Zimbabwe Mr Nikolai Krasilnikov, yesterday paid a courtesy call on President Mnangagwa at State House in Harare, to convey a message from his […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "Air ambulance saves Nkayi mother, baby",
            "url": "https://www.chronicle.co.zw/air-ambulance-saves-nkayi-mother-baby/",
            "content": "Flora Fadzai Sibanda,[emailprotected]\n\nMS Rumbidzai Mwembe of Nkayi District in Matabeleland North Province and her newborn baby are alive today, thanks to a dramatic air rescue on Sunday afternoon.\n\nA Helidrive Zimbabwe helicopter transported them from Nkayi District Hospital to Mpilo Central Hospital for an emergency Caesarean section, after complications threatened both their lives.\n\nSome of the helicopters that form the basis of Zimbabwes modern medical aviation fleet.\n\nMs Mwembe, who gave birth to a healthy baby girl, was transferred after struggling to deliver naturally. Her baby, now in the neonatal intensive care unit, is responding well to treatment.\n\nReflecting on the experience, Ms Mwembe described the helicopter ride as life-saving.\n\nThe flight felt like five minutes. It got me to the hospital quickly, where doctors were already waiting for me. Without it, I dont know what would have happened to me and my baby, she said.\n\nHer ordeal began when she went into labour earlier than expected. Initially, she assumed the pain was normal, having experienced similar discomfort in her first pregnancy. However, as the pain worsened, she alerted her mother-in-law, who took her to Matemu Clinic using an ox-drawn cart.\n\nGiven her history of a previous Caesarean section, clinic staff referred her to Nkayi District Hospital. However, upon arrival, she faced another challenge as there was no electricity at the facility, while she was unable to push the baby out.\n\nThe nurses suggested I travel to Bulawayo by bus and hire a car from there, but I was in too much pain. Meanwhile, the doctors warned that my baby was in distress and at risk of infection because all the amniotic fluid was gone, Ms Mwembe said.\n\nRecognising the urgency, hospital staff contacted the helicopter ambulance service.\n\nWhen the helicopter arrived, I was told to leave my bags behind. Only the midwife who had been monitoring me could accompany me. The ride was like a dream, it was scary but comfortable and incredibly fast.\n\nMs Rumbidzai Mwembe\n\nBefore I knew it, the nurse told me that we had arrived, and the doctors immediately took me into surgery, she recounted.\n\nMs Mwembe expressed her gratitude to the Government for the life-saving initiative.\n\nHad this service not existed, I might have lost my life and my baby, she said.\n\nThe helicopter, a flying intensive care unit, is one of two air medical rescue service ambulances that are stationed at the United Bulawayo Hospital to offer swift medical responses for emergencies, such as the critically injured in road accidents. The air ambulance is used to airlift patients from hard-to-reach areas, which would typically take hours to get to by road.\n\nIf the air ambulance is summoned to an area where there is no helipad, the pilots use their discretion to use an open space such as a sports field to land.\n\nThe helicopter ambulance system, introduced last year, has since saved hundreds of lives. Last year alone, more than 100 expecting mothers were airlifted to various hospitals across the country for emergency medical care.\n\nUnder the Second Republic, President Mnangagwa is actively modernising the countrys health sector as part of a strategic initiative to transform the country into a prosperous, highly industrialised nation by 2030.\n\nIn June last year, the President travelled to Russia to seek investors for establishing air ambulance services for the public health sector. Russian HeliDrive Air Ambulance Medical Services quickly responded, arriving in Zimbabwe to assist in developing an efficient air ambulance system staffed by highly skilled medical professionals, including doctors, nurses, engineers, dispatchers and pilots.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/te.jpg",
            "description": "Flora Fadzai Sibanda, florafadzaisibz@gmail.com MS Rumbidzai Mwembe of Nkayi District in Matabeleland North Province and her newborn baby are alive today, thanks to a dramatic air rescue on Sunday afternoon.  A Helidrive Zimbabwe helicopter transported them from Nkayi District Hospital to Mpilo Central Hospital for an emergency Caesarean section, after complications threatened both their lives.  Ms […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "‘Keep your America, I keep my South Africa’",
            "url": "https://www.chronicle.co.zw/keep-your-america-i-keep-my-south-africa/",
            "content": "Nqobile Tshili,[emailprotected]\n\nDespite numerous challenges, chief among them, illegal Western sanctions, Zimbabwe stands out as a notable example of successful land reclamation in Africa, as South Africas land reform policies face scrutiny from the United States.\n\nSouth Africas recently signed land expropriation without compensation law has attracted attention and criticism from the United States, which has emphasised the importance of maintaining a balance between land redistribution and the protection of property rights to ensure investor confidence and economic growth.\n\nAnalysts and political leaders have condemned US President Donald Trumps attempts to bully the South African government, describing his stance as unwarranted interference in African governance.\n\nPosting on his X account, President Trump, who recently assumed office for his second term, accused South Africa of confiscating land and discriminating against certain groups, labelling the new law a massive human rights violation. He further threatened to cut all future funding to South Africa until a full investigation into the matter was conducted.\n\nIn response, South African President Cyril Ramaphosa dismissed the allegations, saying his countrys land expropriation policies adhere strictly to legal frameworks and constitutional provisions.\n\nSouth Africa is a constitutional democracy that is deeply rooted in the rule of law, justice and equality. The South African government has not confiscated any land. The recently adopted Expropriation Act is not a confiscation instrument, but a constitutionally mandated legal process that ensures public access to land in an equitable and just manner as guided by the constitution, he said in a statement.\n\nSouth Africa, like the United States of America and other countries, has always had expropriation laws that balance the need for public usage of land and the protection of rights of property owners.\n\nHe further clarified that, aside from the Presidents Emergency Plan for Aids Relief (Pepfar), which contributes 17 percent of South Africas HIV/Aids programme, the country does not receive any funding from the US.\n\nPresident Ramaphosa said he would engage the Trump administration to find common ground on land reform and broader bilateral relations.\n\nWe are certain that out of those engagements, we will share a better and common understanding over these matters. The US remains a key strategic political and trade partner for South Africa. With the exception of Pepfar Aid, which constitutes 17 percent of South Africas HIV/Aids programme, there is no other funding that is received by South Africa from the United States, he said.\n\nLocal analysts have criticised President Trumps stance, arguing that his approach mirrors the punitive actions taken against Zimbabwe at the turn of the millennium.\n\nUS President Donald Trump\n\nFollowing Zimbabwes land reform programme, the US and its Western allies imposed economic sanctions under the pretext of human rights violations, despite the initiative being aimed at addressing colonial land imbalances.\n\nZanu-PF Secretary General Dr Obert Mpofu said the land issue remains one of Africas most critical political and economic challenges. He urged South Africa to remain resolute in implementing land redistribution.\n\nIf you try to be diplomatic about land redistribution, you will achieve nothing. The process is often met with resistance, sanctions and vilification. However, for the benefit of the majority, ultimately, it must be done, he said.\n\nDr Mpofu said Zimbabwes land reform programme was a success, noting that it has empowered the black majority and considerably improved national food security.\n\nNegotiating land redistribution with Western powers has never yielded results. Africa must take decisive action on this matter, he added.\n\nNational University of Science and Technology (Nust) lecturer and political analyst Mr Methuseli Moyo said President Trumps approach reflects a broader effort to undermine African sovereignty.\n\nThe tragedy is that Trump leads a global superpower that sees itself as the worlds prefect. Donald Trump seeks to dehumanise black people to the extent that he thinks they are not fit to have access to anything, especially land, even their God-given land, he said.\n\nMr Moyo also criticised the irony of the US positioning itself as a human rights advocate while opposing African-led efforts to rectify historical injustices.\n\nAre black South Africans not human beings? The hypocrisy is staggering. Thankfully, President Ramaphosa has firmly stood his ground, he added.\n\nMr Moyo said more African countries need to take a leaf from Zimbabwe in the manner in which the Government handled the land question.\n\nZimbabwe did very well to pioneer a forceful land reclamation process, which stands as a reference point and inspiration to the dispossessed masses in South Africa and elsewhere. They must bite the bullet and take back their land, he said.\n\nMr Moyo said African countries must never be apologetic about controlling their resources.\n\nPolitical governance expert Mr Teddy Ncube echoed similar sentiments, stating that land reform in South Africa, like in Zimbabwe, is about correcting historical injustices rather than pursuing radical agendas.\n\nPolitics is not solely about economic transactions. It is also about people, history and justice. His (President Trumps) perspective on South Africas land reform overlooks the deep historical injustices that necessitated this conversation in the first place, he said.\n\nMr Ncube emphasised that the current reform efforts seek to promote fairness and inclusivity while rectifying past wrongs.\n\nThe issue of land reform in South Africa is not about confiscation or radical agendas; it is about addressing the long-standing disparities created by colonialism and apartheid, he said.\n\nMr Ncube said for generations land was grabbed from Africans leading to poverty and exclusion while also perpetuating inequities.\n\nThe current efforts are aimed at rectifying these imbalances in a way that promotes fairness and inclusivity. Trumps approach of reducing complex issues to simple economic calculations can be problematic when applied to international relations, he said.\n\nMr Ncube said the South African land issue is a domestic matter that should be handled internally, arguing that external interference from the US is unwarranted.\n\nHe said President Trump must respect South Africas sovereignty and allow its people to shape their own future.\n\nIt is essential that South Africans are given the space to resolve this matter themselves, free from external interference. President Trump should recognise this and allow South Africa to determine its own future based on its own principles and aspirations.\n\nAs the debate over land expropriation intensifies, Zimbabwes experience remains a key reference point for African nations seeking to address land ownership disparities. South Africas approach, though different in execution, is part of the broader continental effort to ensure equitable land distribution and economic empowerment for historically marginalised communities.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/x-xvcvxcvcvx.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  Despite numerous challenges, chief among them, illegal Western sanctions, Zimbabwe stands out as a notable example of successful land reclamation in Africa, as South Africa’s land reform policies face scrutiny from the United States. South Africa’s recently signed land expropriation without compensation law has attracted attention and criticism from the United States, which […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "The call for bold and strategic reforms in our financial sector spot on",
            "url": "https://www.chronicle.co.zw/the-call-for-bold-and-strategic-reforms-in-our-financial-sector-spot-on/",
            "content": "PRESIDENT Donald Trumps decision to withdraw the United States from the World Health Organisation (WHO) has significant implications for global health, while his executive order banning new US foreign aid spending and the subsequent stop-work order on January 24 have far-reaching consequences, particularly for countries reliant on US aid for critical health programmes.\n\nAs we report in our business section today, FBC Securities Private Limited, a stockbroker listed on the Zimbabwe Stock Exchange, has called on the Government to take decisive measures in response to the US foreign aid freeze, cautioning that the situation could destabilise key sectors, exacerbate exchange rate volatility and heighten inflationary pressures.\n\nThe clarion call by FBC Securities is the cry of the entire Global South. Many US-funded aid programmes have begun firing staff and shutting down operations. This sudden halt affects a wide range of initiatives, from healthcare to education and infrastructure development.\n\nProfessor Mthuli Ncube\n\nLocally, Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, has announced that the revenue generated from the sugar tax and the newly-introduced fast food tax will be specifically allocated to support the health sector.\n\nThe US was the largest contributor to WHO, providing about 22 percent of its mandatory contributions. This withdrawal is expected to undermine international public health efforts in several ways.\n\nBecause WHO relies heavily on contributions from member states to fund its operations, the US withdrawal creates a substantial funding gap, potentially reducing the organisations ability to respond to global health crises, conduct research and support health initiatives worldwide.\n\nWHO plays a crucial role in co-ordinating international responses to pandemics and without US support, the organisations capacity to track disease outbreaks and mobilise resources may be compromised, making it harder to combat future pandemics.\n\nThe USs withdrawal from the WHO could weaken international co-operation and leadership in addressing health challenges, potentially leading to fragmented and less effective responses.\n\nThe freeze on funding to Pepfar threatens to disrupt the supply of antiretroviral drugs (ARVs) and resources for HIV, tuberculosis (TB) and malaria programmes in countries like Zimbabwe. Pepfar has been instrumental in providing life-saving treatments and support to millions of people living with HIV/Aids.\n\nZimbabwe, which has one of the highest HIV prevalence rates in the world, relies heavily on Pepfar for ARV supplies. The funding freeze could lead to shortages of these essential drugs, jeopardising the health and lives of those dependent on them.\n\nThe halt in US foreign aid affects not only HIV/Aids programmes but also efforts to combat TB and malaria. These diseases require sustained funding and resources to manage and control. Any disruption in support can lead to increased morbidity and mortality.\n\nHealth crises have broader economic and social impacts. Disruptions in health programmes can strain healthcare systems, increase healthcare costs and reduce productivity, further exacerbating poverty and inequality in affected regions.\n\nAs we have tried to illustrate, the US withdrawal from WHO and the freeze on foreign aid spending pose significant challenges to global health efforts. These actions undermine international cooperation, reduce funding for critical health programmes, and threaten the well-being of millions of people, particularly in vulnerable regions.\n\nWe concur with FBC Securities that bold and strategic reforms are essential to guide the country toward financial stability and sustainable growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/2025-01-20t170506z-653893305-rc2sdcamzd2k-rtrmadp-3-usa-trump-inauguration-680x380.jpg",
            "description": "PRESIDENT Donald Trump’s decision to withdraw the United States from the World Health Organisation (WHO) has significant implications for global health, while his executive order banning new US foreign aid spending and the subsequent “stop-work order” on January 24 have far-reaching consequences, particularly for countries reliant on US aid for critical health programmes. As we […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "Test match: Zimbabwe vs Ireland | We just need to utilise home advantage: Ervine",
            "url": "https://www.chronicle.co.zw/test-match-zimbabwe-vs-ireland-we-just-need-to-utilise-home-advantage-ervine/",
            "content": "Brandon Moyo,[emailprotected]\n\nZIMBABWE captain, Craig Ervine, is confident that his Chevrons side will be able to grind a positive result when they host Ireland in a one-off Test match scheduled for Queens Sports Club, starting on Thursday.\n\nThe first and last time the Chevrons played a Test match against Ireland was in Belfast in 2023 and the latter secured a four wicket win. The forthcoming game will be the second red ball meeting between the two nations.\n\nErvine is confident that playing at home, they will be able to make maximum use of home advantage and make it count. He said what is crucial is to stick to their processes and is pleased with the improvement he has seen from the players over the past couple of months.\n\nAction from the Chevrons vs Pakistan match at Queens Sports Club in Bulawayo yesterday\n\nWe didnt get the results we wanted when we played Ireland, it was in their conditions. For us, we are now at home, we have the home advantage and hopefully, we can utilise that. We just need to stick to our processes.\n\nWe have improved a lot in the last couple of months, especially with the amount of cricket that we have been playing. So, just because of the opposition, I dont think we need to change too much but a lot of focus should be on us and not them, said Ervine.\n\nZimbabwes Test squad includes two new faces, the uncapped duo of 27-year-old leg-spinner Vincent Masekesa and 26-year-old top-order batter Nicholas Welch, who have both been rewarded for their impressive performances on the domestic front.\n\nThe Chevrons skipper added that it is exciting to see new faces in the set-up and is hopeful that if they do make their debuts, they will continue with their good form.\n\nIts really exciting to see some new faces in the squad. A lot of credit to them for the hard work that they have put in during our domestic season. Its nice to see guys getting rewarded for some good performances and hopefully, if they do get a crack at this\n\nChevrons celebrate a wicket\n\nTest, they can continue with their good form, said Ervine.Zimbabwe and Ireland are set to face off in a series that comprises one Test, three One Day Internationals (ODIs) and as many T20Is.\n\nWith the solitary Test match taking place at Queens Sports Club, the white ball matches will be played in Harare.The three one-dayers are pencilled in for February 14, 16 and 18 while the 20-over matches will be played on February 22, 23 and 25.\n\nGate charges for the Test match are pegged at US$3 for the rest of the ground and US$5 for the grandstand.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/aa.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com ZIMBABWE captain, Craig Ervine, is confident that his Chevrons side will be able to grind a positive result when they host Ireland in a one-off Test match scheduled for Queens Sports Club, starting on Thursday. The first and last time the Chevrons played a Test match against Ireland was in Belfast in […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "Kwantuthu Comedy Fest 4th edition to honour MaForty",
            "url": "https://www.chronicle.co.zw/kwantuthu-comedy-fest-4th-edition-to-honour-maforty/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nThe fourth edition of the Kwantuthu Comedy Festival is set to take place from October 30 to November 1 under the theme The 4th Quarter.\n\nThis years highlight will be the Roast of MaForty, a special event celebrating his decade-long career in comedy.Kwantuthu Comedy Festival programme curator, Yananai Mavingire, announced that due to last years overwhelming attendance, additional venues will be introduced.\n\nThe festival, which focuses on schools, aims to promote comedy across various art forms, including music, dance, visual arts, poetry, theatre, and stand-up comedy.\n\nOn day one, October 30, it will be Theatre Day where a floating trophy will be introduced for the best high school theatre production.\n\nThe participating schools will be announced before the end of the school term. Day two, there will be High School Short Films Screening.\n\nEvent organisers said due to increased participation, the screening has been moved to the Zimbabwe Academy of Music to accommodate a larger audience. More schools from different towns will also take part.\n\nMavingire said for day three, there will be The Roast of MaForty to celebrate the comedians 10th anniversary in comedy.The festival will host a special roast in MaFortys honour. The Roast Panel has been selected and will be announced soon.Mavingire also called on interested schools to register for participation.\n\nSchools keen on taking part should register before the end of February to secure workshop dates, he said. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jghkjds.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com The fourth edition of the Kwantuthu Comedy Festival is set to take place from October 30 to November 1 under the theme “The 4th Quarter”. This year’s highlight will be the “Roast of MaForty”, a special event celebrating his decade-long career in comedy. Kwantuthu Comedy Festival programme curator, Yananai Mavingire, announced that […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mandatory lease agreements for vendors. . . BCC seeks to formalise informal traders operations",
            "url": "https://www.chronicle.co.zw/mandatory-lease-agreements-for-vendors-bcc-seeks-to-formalise-informal-traders-operations/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nVENDORS in Bulawayo will now be required to sign lease agreements with the Bulawayo City Council (BCC), a move aimed at formalising the operations of one of the citys largest economic sectors, which has often been plagued by illegality and lawlessness.\n\nThousands of vendors operate in the city, some legally, while many others conduct business illegally, frequently engaging in cat-and-mouse chases with municipal police for violating city by-laws.\n\nAccording to Bulawayo Vendors and Traders Association (BVTA) executive director Mr Michael Ndiweni, his organisation has 10 000 registered members, while thousands more operate illegally or belong to other associations.Late last year, BCC issued a circular informing vendors that, starting at the end of January, all traders would be required to sign lease agreements with the municipality.\n\nWe have observed that some traders have been neglecting their monthly financial obligations and, in some cases, have failed to renew their licenses for 2024. To address these concerns, council officials will be conducting regular enforcement visits starting immediately, said BCC.\n\nWe expect all traders to fulfil their monthly payment obligations promptly and to ensure that any outstanding arrears are cleared by December 31, 2024. Furthermore, from January 2025, all traders will be required to sign a lease agreement with the local authority. This can only be done once all outstanding arrears have been settled.\n\nThe council warned that it would not hesitate to forfeit vending bays from traders who fail to meet their financial obligations.Mr Ndiweni noted that the requirement for lease agreements is not new, citing the Egodini terminus, where vendors were required to sign similar agreements. However, he urged BCC to introduce flexible payment plans to prevent vendors from losing their trading spaces.\n\nWhen Egodini terminus was re-opened vendors and traders operating there were asked to sign lease agreements, so its not something new. We, however, hope that the council will come up with a mechanism that will allow for payment plans so that vendors can settle outstanding obligations over a period of time and sign their lease agreements with BCC, said Mr Ndiweni.\n\nHe said in the event a majority of vendors lose their vending bays, they will turn to illegal vending, something that the council and his organisation are trying to eradicate.\n\nAt the moment, vendors pay US$11,50 per month to BCC, while the lease agreement will require an additional US$23.\n\nIn 2022, vendors and traders negotiated with BCC to maintain the monthly fee, provided payments were made in US dollars. This agreement benefitted both parties. With 10 000 members, we hope to engage the council further to ensure vendors do not lose their trading spaces, said Mr Ndiweni.\n\nMrs Caroline Machache, a vendor operating at TM/Pick and Pay Hyper, said many traders welcome the lease agreements, provided they help eliminate illegal vendors.\n\nAs long as the council removes illegal vendors who are killing our businesses, we have no problem signing lease agreements.\n\nIm the chairperson of an association of vendors who operate here at TM/Pick and Pay and I can tell you that all our members are not against signing the lease agreements, she said.\n\nIllegal vending remains a significant issue, particularly at night when streets and pavements become overcrowded with traders selling groceries, second-hand clothes, cooked food, meat and vegetables.\n\nBulawayo Streetwise Informal Traders Association director Mr Percy Mcijo said his organisation does not support illegal vending, whether during the day or night.\n\nVendors operating from the TM/Pick and Pay Hyper market in Bulawayo sell their wares yesterday. (Picture by Nkosizile Ndlovu)\n\nWe dont believe that vendors that are registered with any association operate during the night so we urge police to arrest these people to bring back sanity into the streets of Bulawayo, he said.\n\nWe urge citizens and specifically our members to be law-abiding and follow the citys by-laws, which allow them to operate formally and in an organised manner.\n\nWard 1 Councillor Josiah Mutangi echoed these sentiments, saying: We seek to bring an end to illegal vending and provide designated vending bays for fruit and vegetables, new and used clothing in various points in and around the CBD.\n\nMeanwhile, organisations such as BVTA continue to advocate for the establishment of a micro-finance bank specifically for vendors.\n\nThis initiative would allow them to access credit without the need for collateral, which is often required by traditional financial institutions.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/yui.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com VENDORS in Bulawayo will now be required to sign lease agreements with the Bulawayo City Council (BCC), a move aimed at formalising the operations of one of the city’s largest economic sectors, which has often been plagued by illegality and lawlessness. Thousands of vendors operate in the city, some legally, while many […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "Zimbabwe to review seed certification frameworks to align with global standards",
            "url": "https://www.chronicle.co.zw/zimbabwe-to-review-seed-certification-frameworks-to-align-with-global-standards/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWE is set to review and update its seed certification regulatory frameworks to align with regional and international standards, a move expected to enhance seed quality, boost food production and improve food security.\n\nThe Department of Research and Specialist Services under the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, in partnership with the Food and Agriculture Organisation (FAO), is holding a five-day writeshop in Bulawayo to review the countrys 25-year-old seed regulations.\n\nThe workshop, which started yesterday, has brought together seed production specialists, ministry officials and other stakeholders to identify areas that require updates.\n\nSpeaking on the sidelines of the event, Seed Services Institute head Mr Edmore Mtetwa, said Zimbabwes seed system is already recognised by two international standard-setting bodies and two regional seed systems. However, some aspects of the current regulations, outlined in Statutory Instrument 213 of 2000, are now outdated.\n\nAcross those four systems, there are certain standards that no longer align with our old regulations. The reason we are here today is to review, update, and realign local legislation to comply with international best practices, said Mr Mtetwa.\n\nHe noted that updating the framework will benefit both farmers and seed producers, enabling them to access high-quality certified seed while also ensuring that the industry can penetrate international markets.\n\nMinistry of Lands, Agriculture, Fisheries, Water and Rural Development\n\nWhile we are already implementing some of these changes administratively, we want them to be reflected in the law, which is why this writeshop is crucial, said Mr Mtetwa\n\nHe said a well-regulated seed industry is key to agricultural growth, as quality seeds are the foundation of productive farming systems.\n\nSeed is a cross-cutting enabler across all agricultural value chains. Our seed industry is vibrant, and we are even exporting grass seed to markets as far as the Middle East, said Mr Mtetwa.\n\nThrough international seed certification systems, local seed producers can obtain Orange International Certificates, allowing seed consignments to cross borders without technical barriers.\n\nWith growing concerns over climate change and food security, Mr Mtetwa stressed the importance of using certified seeds to improve productivity.\n\nIt is critical to use certified seeds. As a ministry, we have been promoting traditional grains, but even within these, we are introducing new and improved varieties that are climate-resilient, said Mr Mtetwa.\n\nSpeaking at the workshop, FAO representative Mr Zwelo Ndebele said revising the seed certification regulatory frameworks will strengthen the certification process, ensuring farmers have access to high-quality seed, increased production and better nutrition.\n\nEverything we are doing aligns with the Government of Zimbabwes development priorities, which aim to improve livelihoods. This is a very strategic partnership for FAO in Zimbabwe, he said.\n\nThe writeshop will be officially opened on Friday by the Permanent Secretary in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Professor Obert Jiri.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ndbdbgufufuf.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  ZIMBABWE is set to review and update its seed certification regulatory frameworks to align with regional and international standards, a move expected to enhance seed quality, boost food production and improve food security. The Department of Research and Specialist Services under the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, in partnership […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "Journalists, politicians pay tribute to Zvikomborero Sibanda",
            "url": "https://www.chronicle.co.zw/journalists-politicians-pay-tribute-to-zvikomborero-sibanda/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nBULAWAYO Provincial Affairs and Devolution Minister Judith Ncube yesterday described the late broadcaster, Zvikomborero Sibanda, as an exceptional journalist who carried out her work with professionalism and dedication.\n\nPopularly known as Kombo or Zviko, Sibanda passed away in Bulawayo last Wednesday at the age of 46. She was laid to rest yesterday at Athlone Cemetery in Bulawayo.\n\nA packed church service at the Salvation Army Mpopoma branch drew a diverse crowd, including politicians from various parties, such as Zanu-PF Bulawayo provincial chairman Cde Jabulani Sibanda, Pelandaba-Tshabalala Member of Parliament Joe Tshuma, former legislator Temba Mliswa, Ward Nine Bulawayo Councillor Donaldson Mabuto, as well as numerous journalists and friends.\n\nIn her address during the service Minister Ncube praised Sibandas commitment to journalism, saying she told Zimbabwes story with honesty and without exaggeration.\n\nOn behalf of the Government, I bring President Mnangagwas condolences. The Bulawayo office stands with the family during this difficult time, she said.\n\nHer contribution to the nation was immense. We are proud of journalists like her who portray Zimbabwes true story. She was talented and gifted, and I always looked forward to watching her broadcasts. Her presentation was captivating, Minister Ncube added.\n\nVeteran journalist, Tafuma Machakaire, highlighted Sibandas adaptability, noting that she excelled even in challenging times within the media landscape.\n\nShe joined broadcasting at a time of major reshuffles at the Zimbabwe Broadcasting Corporation (ZBC), which meant she had to take on multiple roles. As a young journalist, she was deployed to head the Midlands Bureau before later being appointed Executive Producer for news hour, he said.\n\nDespite the demands of the job, she performed exceptionally well, earning the respect of her peers.\n\nSeveral journalists reflected on Sibandas impact on the profession. Former ZBC newsreader Sugar Chagonda recalled their close working relationship.\n\nZviko was exactly one year younger than me but joined ZBC earlier. When I became a news anchor, she would call me after every bulletin with constructive feedback. If I mispronounced a word, she would tease me, saying,Muzukuru,I could tell youre from Masvingo today! She took great pride in guiding and challenging me to improve. Well miss her humility and dedication. Journalism has lost a true gem.\n\nZimbabwe Independenteditor Faith Zaba, who also worked with Zvikomborero at ZBC, said: I worked with Kombo in 2002 at ZBC when I was a news editor. She was a trailblazer and an inspiration for female journalists. At a time when few women took centre stage in the newsroom, she stood tall  dedicated to the profession.\n\nAs a reporter, she embodied excellence; as a colleague, she inspired and paved the way for many female journalists. Rest in power, Kombo.\n\nZBC news anchor Nqobile Malinga, remembered her as a hardworking and engaging journalist, particularly during her time as Midlands Bureau Chief.\n\nAnother former ZBC colleague, Terrence Mapurisana, described her passing as a significant loss to the media industry.\n\nIn Zvikomborero, we lost a dedicated journalist with a keen eye for news. She was always smiling and contributed immensely to teamwork. We would review each others scripts before recording news bulletins, fostering a culture of excellence, he said.\n\nWhen she left ZBC, it created a huge void. Our generation has lost an outstanding broadcaster.\n\nFamily and friends described Sibanda as a supportive person with a natural ability to resolve complex family matters with ease.\n\nHer high school classmate, Nyasha Museki, explained how much influence Zvikomborero had on her.\n\nIn 1993, I transferred from St Francis and Claire Secondary School to SOS Herman Gmeiner Secondary School. Thrust into Form 3A, I met a lot of new friends and classmates and, among them was Zvikomborero Sibanda.\n\nKombo was a friend to all and an enemy to none. She was ever-smiling, a thorough student who competed with the boys and an incredibly smart and highly intelligent person. She was one of our top students, earning multiple As and passing all her subjects, Museki said.\n\nBorn on April 5, 1978, in Mpopoma, Bulawayo, Sibanda attended Nkulumane Primary School before completing her high school education at Usher High and Hermann Gmeiner High School. She then pursued a qualification in Mass Communication and Journalism at Harare Polytechnic.\n\nHer media career began atChronicle, where she completed her attachment before moving to ZBCtv. She later worked at the National Oil Company of Zimbabwe before relocating to South Africa following her marriage to a South African national.\n\nShe returned to Zimbabwe in November last year while battling long-term health issues related to fibroids, a condition for which she had previously undergone surgery.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/JKJRJJDD-1.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw BULAWAYO Provincial Affairs and Devolution Minister Judith Ncube yesterday described the late broadcaster, Zvikomborero Sibanda, as an exceptional journalist who carried out her work with professionalism and dedication. Popularly known as “Kombo” or “Zviko”, Sibanda passed away in Bulawayo last Wednesday at the age of 46. She was laid to rest yesterday at […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mberengwa man fatally stabbed by rival suitor",
            "url": "https://www.chronicle.co.zw/mberengwa-man-fatally-stabbed-by-rival-suitor/",
            "content": "Midlands Bureau\n\nA 35-YEAR-OLD man from Mberengwa was allegedly fatally stabbed by a rival suitor while seeking shelter from the rain at Rengwe Business Centre in Mberengwa District.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the suspected murder, which occurred on January 26 at around 7pm.\n\nCircumstances are that Freeman Pazamongo (35) was in the company of his two friends when it started raining as they were about to go home. They decided to seek shelter under the shop verandas at Rengwe Business Centre, he said.\n\nAccording to police reports, Pazamongo stood about seven metres away from his companions.\n\nAfter about 10 minutes, his friends heard him screaming for help. When they rushed to where he was, they found him lying on the ground, bleeding profusely from a deep stab wound in the chest, he said.\n\nPazamongo was rushed to Mnene Mission Hospital, where he was pronounced dead upon arrival.\n\nPreliminary investigations revealed that Pazamongo had earlier been involved in an altercation with Ferdinand Dzimba (24) of Mapenzi Village, under Chief Maziofa in Mberengwa.\n\nPolice have since launched a manhunt for Dzimba, who is now on the run.\n\nWe are appealing to the public for any information regarding the suspects whereabouts. Anyone with information should report to the nearest police station, said Insp Mahoko.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Midlands Bureau A 35-YEAR-OLD man from Mberengwa was allegedly fatally stabbed by a rival suitor while seeking shelter from the rain at Rengwe Business Centre in Mberengwa District. Midlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the suspected murder, which occurred on January 26 at around 7pm. “Circumstances are that Freeman Pazamongo (35) was in […]",
            "time": "06:27",
            "date": "04 Feb 2025"
        }
    ]
}