{
    "news": [
        {
            "title": "Govt urges rehabilitated irrigation farmers to boost production for Vision 2030",
            "url": "https://www.chronicle.co.zw/farmers-that-have-benefited-from-rehabilitated-schemes-have-been-urged-to-contribute-to-national-development-through-production-as-their-input-is-critical-to-the-attainment-of-an-upper-middle-income-s/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nFARMERS that have benefited from rehabilitated schemes have been urged to contribute to national development through production as their input is critical to the attainment of an upper middle-income society in line with Vision 2030.\n\nAddressing farmers recently during a visit to irrigation schemes in Matabeleland South Director Irrigation Development in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Engineer Bezzel Chitsungo said Government has not just rehabilitated the schemes but also rolled out various strategies to capacitate the farmers.\n\nGovernment has remembered you as farmers and engaged various partners to assist in development irrigation infrastructure. When we look at irrigation farmers, we see you as priviledged farmers because not every farmer with access to land has access to irrigation. With irrigations it means you can produce throughout the year.\n\nA lot of funds have been put into developing these irrigation schemes and as farmers that have benefited, we expect you to contribute to national development through production. In the past we would develop the scheme and leave you with little supervision from extension officers but now we realised that as farmers you were having challenges in maintaining the schemes, he said.\n\nDr Chitsungo said Government has gone a step ahead by introducing the V30 accelerator model which will play a crucial role in attainment of Vision 2030.\n\nHe said Agricultural Rural Development Authority (ARDA) managers have been further deployed to help farmers run their schemes as businesses while Agritex extension officers will continue providing technical support.\n\nDr Chitsungo said intervention from Government has also seen farmers being capacitated through access to loans, equipment and farming inputs.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-16-at-14.14.53-680x380.jpeg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw FARMERS that have benefited from rehabilitated schemes have been urged to contribute to national development through production as their input is critical to the attainment of an upper middle-income society in line with Vision 2030. Addressing farmers recently during a visit to irrigation schemes in Matabeleland South Director Irrigation Development in the […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "WATCH: Record demand for ZITF 2025: All traditional exhibition space sold out",
            "url": "https://www.chronicle.co.zw/watch-record-demand-for-zitf-2025-all-traditional-exhibition-space-sold-out/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nALL traditional exhibition space at the Zimbabwe International Trade Fair has been taken up with additional space created for exhibitors, ZITF Company board chair Mr Busisa Moyo has said.\n\nAddressing the media on Wednesday, Mr Moyo said Preparations for the ZITF 2025 edition, taking place from 21-26 April 2025 at the Zimbabwe International Conference and Exhibition Smart City in Bulawayo, are at an advanced stage, with exhibitors currently on the ground setting up their exhibits so they are ready for the show.\n\nTraditional exhibition space is 100 percent full and the ZITF Company has prepared extra space to accommodate the high volume of exhibitors currently standing at 596. Currently direct exhibitors have taken up 51,204.62 Square Meters of exhibition space\n\nHe added, We can confirm the participation of 45 direct international exhibitors with 28 Countries represented in the show, a notable increase from last years 27 countries\n\nThe exhibition runs from Monday to Saturday next week under theme Industrialisation: Crafting an Integrated Economic Landscape.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/4wst.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter ALL traditional exhibition space at the Zimbabwe International Trade Fair has been taken up with additional space created for exhibitors, ZITF Company board chair Mr Busisa Moyo has said. Addressing the media on Wednesday, Mr Moyo said “Preparations for the ZITF 2025 edition, taking place from 21-26 April 2025 at the […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Council clerk vanishes in the US$2 k church, City Hall fraud scandal",
            "url": "https://www.chronicle.co.zw/council-clerk-vanishes-in-the-us2-k-church-city-hall-fraud-scandal/",
            "content": "Sikhumbuzo Moyo, Investigations Desk\n\nA Bulawayo City Council clerical officer has reportedly gone AWOL after allegedly colluding with a local church to defraud the council of US$2,072 through fraudulent bookings of the City Hall for church services.\n\nAccording to the councils internal audit report, the church exploited weak internal controls, using the Large City Hall five times without payment, causing a confirmed loss of US$2,072.05. The probe was triggered after the Town Clerks office flagged concerns over the legitimacy of the churchs bookings.\n\nAuditors uncovered that receipt 0151638434 was used twice: once legitimately, then fraudulently. On 21 June 2024 at 14:22, the church paid US$415 for hall hire, receiving the receipt without specified dates or times. Two days later, security officer Mr Maickel Ndlovu logged the receipt, recording a booking from 10:00 to 14:00details absent from the original receipt. The booking for 23 June was pencilled in, signalling unpaid fees.\n\nOn 14 July 2024, the same receipt resurfaced on CS Form 573, fraudulently extending the halls use by an hour. Further scrutiny revealed receipt 0141590226 was also duplicated.\n\nDuring interviews, Mr Charamba admitted to unknowingly reusing receipts, claiming he received them from council officer Mr Busani Nyoni in exchange for local currency transactions. He pledged to repay the council.\n\nThe audit also exposed discrepancies in 2023 bookings: the church used council halls 25 times but paid for only six. While the church paid ZWL 7,415,659.46 in bulk payments, this exceeded the actual fees of ZWL 3,920,254.16. The report warned: Discrepancies raise suspicion of possible money laundering if not linked to system failures in adjusting for exchange rates or policy changes.\n\nMore details to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Bulawayo-City-Hall.jpg",
            "description": "  Sikhumbuzo Moyo, Investigations Desk A Bulawayo City Council clerical officer has reportedly gone AWOL after allegedly colluding with a local church to defraud the council of US$2,072 through fraudulent bookings of the City Hall for church services. According to the council’s internal audit report, the church —exploited weak internal controls, using the Large City […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Kay_Kid Umfanomsotho relocates to Bulawayo, tops city’s radio charts",
            "url": "https://www.chronicle.co.zw/kay_kid-umfanomsotho-relocates-to-bulawayo-tops-citys-radio-charts/",
            "content": "Mthabisi Tshuma,Zimpapers Arts and Entertainment Hub\n\nGwanda-bred musician Kay_Kid Umfanomsotho has relocated to Bulawayo, and if his debut solo performance in the city is anything to go by, he is quickly winning over new fans.\n\nHis hit track Amawala is dominating the Skyz Metro FM Top 20 weekly charts, holding the number one spot last week.\n\nhttps://youtube.com/shorts/qXTK8s2XZQs\n\nOn April 5, Kay_Kid hosted his first one-man show at a restaurant in the city, which drew a supportive crowd who kept the vibe alive for nearly 90 minutes as he performed a catalogue of his hits.I truly enjoyed the set. Shout out to Sibonginkosi Mudau, the manager at Epic Restaurant, for organising the event, and thank you to everyone who made time to come through that evening.\n\nReflecting on the chart success of Amawala, he said: Im beyond grateful. The songs success is thanks to my fans who keep voting. Their love motivates me to keep creating more music, knowing they connect with what I put out.\n\nKay_Kid said he is focusing on expanding his network and collaborating with local artistes.Relocating has opened doors that were difficult to unlock while I was still in Gwanda. Im now reaching new audiences and working on exciting collaborations.\n\nAmong the upcoming projects, he revealed INhliziyo featuring Khwezi zw, UMaqondana Wam with LaDee and EMaweni featuring Bhila.  Follow Mthabisi Tshuma on X:@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-16-at-15.58.58-680x380.jpeg",
            "description": "Mthabisi Tshuma,Zimpapers Arts and Entertainment Hub Gwanda-bred musician Kay_Kid Umfanomsotho has relocated to Bulawayo, and if his debut solo performance in the city is anything to go by, he is quickly winning over new fans. His hit track Amawala is dominating the Skyz Metro FM Top 20 weekly charts, holding the number one spot last […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Kumalo Primary School headmistress granted bail over embezzlement",
            "url": "https://www.chronicle.co.zw/kumalo-primary-school-headmistress-granted-bail-over-embezzlement/",
            "content": "Chronicle Reporter\n\nKUMALO Primary School headmistress, Stella Mhlanga (63), together with three other staff members who are facing charges of fraud were this morning granted bail.\n\nThey were granted US$50 bail each on grounds that they and do not to interfere with State witnesses and reside at their given addresses.\n\nThe matter was remanded to April 30.\n\nMhlanga was arrested on Monday alongside four other staff members for alleged embezzlement of school funds.\n\nThey appeared before Bulawayo magistrate Beverly Madzikatire.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-16-at-16.07.56-680x380.jpeg",
            "description": "Chronicle Reporter KUMALO Primary School headmistress, Stella Mhlanga (63), together with three other staff members who are facing charges of fraud were this morning granted bail.  They were granted US$50 bail each on grounds that they and do not to interfere with State witnesses and reside at their given addresses.  The matter was remanded to […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Zimbabwean prospect trains with Arsenal senior team ahead of Real Madrid clash",
            "url": "https://www.chronicle.co.zw/zimbabwean-prospect-trains-with-arsenal-senior-team-ahead-of-real-madrid-clash/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWEAN prospect Teshaun Tarumbidzwa Murisa was among the academy players who trained with Arsenals first team on the eve of their UEFA Champions League quarterfinal clash against Real Madrid tonight.The 16-year-old United Kingdom-born midfielder, whose parents are from Zimbabwe, has been featuring for Arsenals Under 18 team.\n\nMurisa was joined by left-back Josh Ogunnaike, midfielder Ife Ibrahim, and forward Nathan Butler-Oyedeji.\n\nHowever, it remains unclear whether Murisa or the other academy players will be included in the matchday squad for tonights game, as coach Mikel Arteta has not confirmed their availability.Arsenal hold a strong advantage going into the fixture after securing a 3-0 victory in the first leg.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-16-at-15.40.32.jpeg",
            "description": "Zimpapers Sports Hub ZIMBABWEAN prospect Teshaun Tarumbidzwa Murisa was among the academy players who trained with Arsenal’s first team on the eve of their UEFA Champions League quarterfinal clash against Real Madrid tonight. The 16-year-old United Kingdom-born midfielder, whose parents are from Zimbabwe, has been featuring for Arsenal’s Under 18 team. Murisa was joined by […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "WATCHED: Bulawayo geared up to host 65th ZITF edition",
            "url": "https://www.chronicle.co.zw/watched-bulawayo-geared-up-to-host-65th-zitf-edition/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nMINISTER of State for Bulawayo Provincial Affairs and Devolution Minister Judith Ncube says the city is eagerly anticipating hosting the prestigious 65th edition of the Zimbabwe International Trade Fair (ZITF), which kicks off on Monday next week.\n\nMinister Ncube has expressed confidence in the citys readiness to deliver a successful edition of the countrys premier trade showcase, one that she believes will make a significant imprint on Zimbabwes economic trajectory.\n\nIn an interview with Zimpapers Business Hub on Wednesday, Minister Ncube said the level of interest from local and international participants has been overwhelmingly positive.\n\nAs host city, Bulawayo is ready to host this years edition of ZITF. What excites me is the high number of foreign countries exhibiting, and ZITF chief executive officer Dr Nicholas Ndebele briefed me on this development, said Minister Ncube.\n\nShe said potential exhibitors are still making inquiries and bookings.\n\nThe exhibition will run from 21  26 April under the theme Industrialisation: Crafting an Integrated Economic Landscape, and will be held at its traditional venue, the Zimbabwe International Conference and Exhibition Smart Centre.\n\nThe event is expected to attract a wide array of exhibitors and stakeholders from across the globe, positioning Bulawayo once again as a vital hub for business exchange, innovation and investment dialogue.\n\nAdding to the events prestige, Mozambican President Daniel Chapo is scheduled to officially open the trade fair on Friday, 25 April.\n\nThe ZITF remains one of Africas largest multi-sectoral trade exhibitions, offering a strategic platform for countries and businesses to forge synergies and explore new markets.\n\n",
            "image_url": null,
            "description": "Nqobile Bhebhe,Senior Business Reporter MINISTER of State for Bulawayo Provincial Affairs and Devolution Minister Judith Ncube says the city is eagerly anticipating hosting the prestigious 65th edition of the Zimbabwe International Trade Fair (ZITF), which kicks off on Monday next week. Minister Ncube has expressed confidence in the city’s readiness to deliver a successful edition […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Plumtree Prepares for Historic Independence Celebrations",
            "url": "https://www.chronicle.co.zw/plumtree-prepares-for-historic-independence-celebrations/",
            "content": "Ronald Mpofu,Online Reporter\n\nPLUMTREE town is in the final phase of preparations ahead of hosting Matabeleland South Provinces celebrations for Zimbabwes 45th Independence Day this Friday.\n\nThe festivities will take place at the Plumtree School Pavilion grounds, with over 5,000 people expected to attend. Members of the Joint Operations Command (JOC) and Public Works staff are working tirelessly to ensure the events success, marking the towns inaugural hosting of the provincial celebrations.\n\nMrs Ruth Saurava, Acting District Co-ordinating Committee (DCC) Chairperson for Mangwe, shared insights on the preparations, stating:\n\n*We are putting the final touches on preparations for the Independence Day celebrations. Budgets have been presented, and funds allocated to respective departments.*\n\nThe planning meeting was led by Matabeleland South Provincial Affairs and Devolution Permanent Secretary, Mrs Latiso Dlamini-Maseko, and attended by senior ZANU PF officials from the province, including:\n\n War Veterans Chairlady, Cde Makomo Moyo Womens League Chairlady, Mrs Sindisiwe Nleya Provincial Chairlady, Cde Sipilisiwe Nawira National Representative, Cde Tjedza Ncube Provincial Secretary for Environment and Tourism, Cde Duduzile Moyo DCC Chairperson for Mangwe, Mr Bakani Nleya Acting Director for Local Government Services, Mr Zachariah Jusa\n\nAlso present were staff from local community broadcaster Radio Bukalanga and other government officials.\n\nThe gathering highlights the collaborative efforts between government departments, ZANU PF, and local businesses in preparing for the 45th Independence Day celebrations in Plumtreea historic moment for Matabeleland South Province.\n\nThe Minister of State for Provincial Affairs and Devolution in Matabeleland South, Honourable Albert Nguluvhe, will grace the celebrations. His presence as the provinces representative underscores the events significance, reflecting the governments commitment to quality service delivery and socio-economic development in the region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/olokmjhn.jpg",
            "description": "  Ronald Mpofu,Online Reporter PLUMTREE town is in the final phase of preparations ahead of hosting Matabeleland South Province’s celebrations for Zimbabwe’s 45th Independence Day this Friday. The festivities will take place at the Plumtree School Pavilion grounds, with over 5,000 people expected to attend. Members of the Joint Operations Command (JOC) and Public Works […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Bosso, Chicken Inn to spice up Byo Independence celebrations",
            "url": "https://www.chronicle.co.zw/bosso-chicken-inn-to-spice-up-byo-independence-celebrations/",
            "content": "Zimpapers Sports Hub\n\nBULAWAYO football giants Highlanders and Chicken Inn will spice the City of Kings and Queens Independence Day celebrations when they fight it out at White City Stadium on Good Friday.Last year, Joey Antipas Chicken Inn charges played against former Premier Soccer League (PSL) side Bulawayo Chiefs in an Independence Day game at the same venue that went in favour of the latter.\n\nIn main celebrations, Dynamos will not be able to defend the Independence Cup title as the traditional giants will this year take the back seat and pave the way for FC Platinum and Premiership champions Simba Bhora to battle it for the Uhuru silverware in Gokwe.\n\nThe Uhuru Cup will be played in the Midlands area for the first time in line with the thrust of the Second Republic to hold national events rotationally across the countrys 10 provinces.The countrys 45th Independence anniversary celebrations will be held in Gokwe North.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Highlanders-Squad.jpg",
            "description": "Zimpapers Sports Hub BULAWAYO football giants Highlanders and Chicken Inn will spice the City of Kings and Queens Independence Day celebrations when they fight it out at White City Stadium on Good Friday. Last year, Joey Antipas Chicken Inn charges played against former Premier Soccer League (PSL) side Bulawayo Chiefs in an Independence Day game […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        },
        {
            "title": "Real Madrid vs Arsenal: Match preview",
            "url": "https://www.chronicle.co.zw/real-madrid-vs-arsenal-match-preview/",
            "content": "REAL Madrid return to the Champions League after a 1-0 win over Deportivo Alaves in La Liga on Sunday. The defending European champions host Arsenal at the Estadio Santiago Bernabeu tonight in the second leg of their quarter-final meeting in the competition.Los Blancos were blown away by Arsenal in last weeks first leg as Mikel Artetas men won 3-0, courtesy of Declan Rices brace and a neat finish by Mikel Merino. The Merengues have a massive task on their hands if they are to overturn the deficit, more so against one of the continents best defensive sides.\n\nCarlo Ancelotti will be without Andriy Lunin, Dani Carvajal, Eder Militao and Ferland Mendy for the game as they continue to recover from injuries, whereas Eduardo Camavinga is suspended following his red card at the Emirates Stadium in last Tuesdays fixture against the Gunners.Dani Ceballos is back, however, as he marked his return from injury at the weekend against Alaves. He could start and in addition to the former Arsenal loanee, all eyes will be on Kylian Mbappe, Rodrygo Goes and Vinicius Junior if Real Madrid are to stand any chance of reversing the first leg arrears.\n\nMeanwhile, Arsenal come into the game having been held at home by Brentford in the Premier League. A 1-1 draw further derailed their title hopes, more so after Liverpools win, so very realistically, the Champions League is the only piece of silverware the Londoners can claim this season.Arsenal will be without Ben White, Gabriel Magalhaes, Riccardo Calafiori, Takehiro Tomiyasu, Gabriel Jesus and Kai Havertz. Jorginhos participation is doubtful but Thomas Partey has made the travelling party after a minor fitness worry. The English giants have no suspension worries.\n\nReal Madrid will have to put in one of their best performances of not just this season but in their illustrious history as they bid to achieve a feat that has eluded them for close to five decades. The 15-time European champions have not come back from three goals down in the competition since 1976.\n\nThe Santiago Bernabeu will be in its full glory though it is hard to escape the supposition that Arsenal are the clear favourites to progress into the semi-final and end Real Madrids title defence in the process. For context, Artetas charges last conceded thrice in a match more than 80 outings ago.An exciting second leg between two fantastic teams awaits and Real Madrid will hope they can defy all odds to produce yet another magical night on home soil in the European Cup.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/yujmnh.jpg",
            "description": "REAL Madrid return to the Champions League after a 1-0 win over Deportivo Alaves in La Liga on Sunday. The defending European champions host Arsenal at the Estadio Santiago Bernabeu tonight in the second leg of their quarter-final meeting in the competition. Los Blancos were blown away by Arsenal in last week’s first leg as […]",
            "time": "18:34",
            "date": "16 Apr 2025"
        }
    ]
}