{
    "news": [
        {
            "title": "President mourns Beitbridge crash victims… Accords accident victims state assisted burial",
            "url": "https://www.chronicle.co.zw/president-mourns-beitbridge-crash-victims-accords-accident-victims-state-assisted-burial/",
            "content": "Thupeyo Muleya,[emailprotected]\n\nPRESIDENT Mnangagwa has declared the Beitbridge road accident that claimed 24 lives yesterday morning a national disaster, assuring state assistance for the victims families.\n\nZimbabwe awoke to the devastating news of a fatal head-on collision between an Urban Connect bus and an Auro Transport haulage truck near Lutumba Tollgate, about 25km from Beitbridge Town.\n\nThe accident occurred around 8am on the Beitbridge-Masvingo Highway. Seventeen people died on the spot, while seven others succumbed to injuries upon admission to Beitbridge District Hospital.\n\nBus-Haulage truck head on collision claims lives along Beitbridge highway\n\nIn a statement yesterday, President Mnangagwa expressed deep sorrow over the tragedy.The death of fellow Zimbabweans in a head-on collision between an Urban Connect bus and a commercial truck along the Beitbridge-Masvingo highway this morning (yesterday), left me horrified and heartbroken, he said.\n\nFellow Zimbabweans, our nation does not deserve this at all, let alone experiencing such a bloody incident at the beginning of the year. We have to do all that is possible to curb this unjustified loss of life.\n\nPresident Mnangagwa also called for urgent measures to improve road safety, urging motorists to exercise extreme caution and law enforcement agencies to step up efforts in curbing road carnage.\n\nAll arms of the Government that are responsible for ensuring safety on our roads are thus constantly reminded to work around the clock and invoke all legal means and powers available to them, to reduce and subsequently put an end to such carnage, he said.\n\nPresident Mnangagwa\n\nThe Government, President Mnangagwa announced, will provide state-assisted burials for the victims as part of disaster relief efforts.\n\nGovernment has, therefore, declared this incident a national disaster and will accord victims of this horrendous crash State-assisted burial.\n\nAs I express my deepest, heartfelt condolences to families and relatives who have lost their loved ones in this horrific crash, I also heartily and prayerfully reach out to all those injured and hospitalised, wishing them a speedy recovery, he said.Preliminary investigations indicate that the Urban Connect bus, bound for Beitbridge, was overtaking another vehicle near Lutumba Tollgate when it crashed into a haulage truck that had just pulled out of the tollgate.\n\nThe commercial truck, en route to Chirundu, was suspected to be carrying 34 tonnes of magnesium.Dr Lenos Samhere, the District Medical Officer for Beitbridge, said 17 passengers died on the spot while eight others who had sustained head injuries died upon admission at the local district hospital.\n\nA total of 53 other passengers were admitted for medical attention, with 10 in critical condition and transferred to Gwanda Provincial Hospital. Among the injured are 26 men and 30 women with varying degrees of injuries, he said.Rescue efforts were swiftly coordinated by the police, local motorists, and the Beitbridge Civil Protection Committee.\n\nIn a statement yesterday, Urban Connect Bus Company expressed its condolences to the grieving families and pledged to compensate each of the victims families with US$500.\n\nAs Urban Connect, we want to express our heartfelt condolences to families and relatives of our fellow Zimbabweans who passed on in the bus accident on Thursday 13 February 2025 near the Lutumba Tollgate along the Masvingo-Beitbridge Highway. We wish a speedy recovery to those injured, said the company.\n\nWe will offer compassionate assistance to relatives of the departed and we have started rendering assistance to the injured. In addition, we pledge to co-operate with authorities in investigations into this accident.\n\nNational police spokesperson, Commissioner Paul Nyathi, said the bodies of all the victims were taken to Beitbridge District Hospital mortuary pending post-mortem examinations. He said investigations are ongoing, with more details set to be availed in due course.\n\nCommissioner Paul Nyathi\n\nWhen the Zimpapers news crew arrived at the scene, police, community members, and the Municipality of Beitbridge emergency services were busy retrieving bodies trapped in the wreckage.\n\nDistraught relatives rushed to Beitbridge District Hospital, desperately seeking information about their loved ones who had boarded the bus.\n\nMr Thomas Nhundu, an undertaker from Great Hope Funeral Parlour, was driving towards Beitbridge when he witnessed the accident.\n\nThe bus had just overtaken another vehicle. When we arrived, bodies were strewn across the tarmac. We helped retrieve some victims trapped in the wreckage and transported them to the hospital with the assistance of police and other motorists, he said.Another witness, Mr Leonard Wanderson from Tshapfutshe Village, rushed to the scene after hearing a loud bang.I had seen the bus passing through our business centre, then suddenly heard a loud crash. When I arrived, we started rescuing the injured and covering the dead bodies with blankets and clothes, he said.Survivors described harrowing experiences. Mr Tinashe Chingo from Chitungwiza said he was asleep when the accident happened.\n\nI woke up to a loud bang and saw bodies lying on the road. I was terrified and was later rushed to the hospital where medical staff attended to us, together with other injured victims, he recounted.Another survivor, Ms Tambudzai Mugasa, recalled seeing the impending collision but being unable to react.\n\nI saw death before my eyes and put everything to God. The next moment, I was outside the bus, surrounded by lifeless bodies, she said.\n\nThe Environmental Management Authority (EMA) is expected to assess the accident scene to determine whether hazardous materials were spilled from the haulage truck.\n\nOur team will conduct an on-site inspection to confirm whether the truck was indeed carrying magnesium and to assess any potential environmental impact, said EMAs environmental education and publicity manager, Ms Amkela Sidange. She said at the moment its still speculation that a mineral could have been spilled at the crash site.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/GGGGGG.jpg",
            "description": "Thupeyo Muleya, thupeyo.muleya@zimpapers.co.zw PRESIDENT Mnangagwa has declared the Beitbridge road accident that claimed 24 lives yesterday morning a national disaster, assuring state assistance for the victims’ families. Zimbabwe awoke to the devastating news of a fatal head-on collision between an Urban Connect bus and an Auro Transport haulage truck near Lutumba Tollgate, about 25km from […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "President in Ethiopia for AU Summit",
            "url": "https://www.chronicle.co.zw/president-in-ethiopia-for-au-summit-2/",
            "content": "Garikai Fadzi in ADDIS ABABA, Ethiopia\n\nPresident Mnangagwa, who is also the SADC Chairperson, arrived here last night for the 38th Ordinary Session of the African Union and went straight into a series of engagements with senior officials.\n\nThe President was received at Bole International Airport by Foreign Affairs and International Trade Minister, Professor Amon Murwira, Zimbabwes Permanent Representative to the AU Commission, Sophia Nyamudeza and Ethiopias Minister of Transport and Logistics, Dr Alemu Sime.\n\nThe summit is running under the theme, Justice for Africans and people of African descent through reparations.This theme was decided on by the Heads of State and Government at the 37th Ordinary Session of the Assembly of the AU held in February 2023 in Addis Ababa.\n\nPresident Mnangagwa, arrived in Ethiopia for the 38th Ordinary Session of the African Union Summit\n\nThe summit is expected to draw African Heads of State and Government, as well as leaders from international organisations.Prof Murwira, who had earlier attended the 46th ordinary session of the AU Executive Council, said this years theme speaks towards Africas long cherished dream of demanding reparations for losses suffered during decades of colonial subjugation.\n\nThe AU aims to define a unified vision for reparations, including financial compensation, formal acknowledgment of past injustices, and policy reforms.\n\nWe believe that this is a very important topic for us, especially us as Zimbabwe after having gone through a gruelling phase of our liberation struggle and facing a lot of adversity in the process.We believe that Africa has to talk about that topic, it has to have a position on that topic because it is a just topic for Africa, he said.\n\nProf Murwira said President Mnangagwa has a series of bilateral engagements lined up, especially now that he is the SADC Chairperson.\n\nHis Excellency is the Chairman of the SADC region, and in that capacity, it gives him more responsibilities.So, we are looking forward to his coming here and sharing with his colleagues the future plans for Africa, he said.\n\nAhead of the main weekend summit, the leaders will hold an emergency session today to discuss the violence in the DRC, where the M23 armed group has seized large parts of the east of the mineral-rich country.\n\nKenyan President William Ruto\n\nSADC and the East African Community recently held a joint summit in Tanzania to deliberate on the war in the DRC and called for a cessation of hostilities. President Mnangagwa, in his capacity as SADC Chairperson, and his Kenyan counterpart President William Ruto, the EAC Chairperson, co-chaired the summit held in the Tanzanian capital Dar es Salaam.\n\nAngolan President Joo Loureno, will take over the rotating presidency of the AU at the weekend while a new AU Commission Chair would be chosen by vote.\n\nPresident Joo Manuel Gonalves Loureno\n\nIncumbent Mr Moussa Faki Mahamat of Chad, has reached the two-term limit and the trio of Djiboutis Foreign Minister Mahmoud Ali Youssouf, Kenyan politician Raila Odinga and Madagascars ex-foreign minister Mr Richard Randriamandrato is vying to replace him.In the spirit of rotation, the AU Commission chairs post is reserved for East Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-3-3.jpg",
            "description": "Garikai Fadzi in ADDIS ABABA, Ethiopia President Mnangagwa, who is also the SADC Chairperson, arrived here last night for the 38th Ordinary Session of the African Union and went straight into a series of engagements with senior officials. The President was received at Bole International Airport by Foreign Affairs and International Trade Minister, Professor Amon […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Rains spur optimism in farming community",
            "url": "https://www.chronicle.co.zw/rains-spur-optimism-in-farming-community/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nFARMERS across Matabeleland have expressed optimism following the ongoing rains, which have significantly improved the outlook for the 2024/25 farming season, with the Government projecting a bumper harvest of 3,2 million metric tonnes of grain.\n\nThe wet spell, which has been consistent since the onset of the planting season, has revitalised fields, with crops such as maize, sorghum, and millet showing healthy growth.\n\nA thriving maize crop along Plumtree road yesterday\n\nFarmers in both Matabeleland North and South have hailed the rains as a relief, as some crops, particularly in areas such as Hwange District, were beginning to show signs of moisture stress.\n\nThe Government has stated that major crop production volumes for the current farming season are expected to increase by 340 percent, from 915 000 metric tonnes to over four million metric tonnes.\n\nAgricultural and Rural Development Advisory Services (Ardas) director for Matabeleland North, Mr Thulani Ndlovu, said crops that were struggling were those planted during the last rains in late December to early this year, with maize being the most affected compared to traditional grains.\n\nWith the recent rains, I am sure the maize crop will now recover. Our traditional grains were not affected much. For those who planted much earlier, particularly maize, it was not much of a concern as their crop is now at the tasselling stage, said Mr Ndlovu.\n\nHis Matabeleland South counterpart, Mr Bheki Ncube, echoed the same sentiments, adding that top-dressing fertiliser was now needed.\n\nCrops were beginning to show signs of permanent wilting. We had 20 days without any rain, and our farmers were becoming concerned, but fortunately, the rains arrived just in time.\n\nCrops are now showing some life, even though farmers may still need top-dressing fertiliser, he said.A farmer from Maraposa Village in Umguza District, Mr Jaheni Ncube, said he was relieved at the resumption of the rains and was now looking forward to a bumper harvest.\n\nWe were beginning to worry after a prolonged dry spell as our crops were showing signs of stress, but with these rains, our hopes of a good harvest have been revived, he said.\n\nMs Lindiwe Ndlovu, a communal farmer in the Kasibo area of Hwange District, said this seasons rains have restored hope among smallholder farmers.\n\nWe planted early this time, following the weather forecast that predicted good rains. Our crops are growing well, and if the rains continue, we are confident of a good yield, she said.\n\nMr Itani Ndou, a farmer from Shashe in Beitbridge District, said the availability of water following the ongoing rains has boosted their confidence, ensuring that crops receive adequate moisture even in the event of dry spells.\n\nThe current rains have replenished our water sources. This gives us confidence that we will have a better harvest compared to previous years, he said.\n\nDr Jenfan Muswere, Minister of Information, Publicity and Broadcasting Servces.\n\nIn his post-Cabinet briefing on Tuesday, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, said the Government is confident of surpassing the national grain requirements.\n\nHe said the 2024/25 summer season plan aims to increase cereal production to 3.2 million metric tonnes, from the 744,000 metric tonnes produced during the 2023/24 summer season.\n\nThe overall production volumes of major crops are expected to increase by 340 percent, from a mere 915,000 metric tonnes to over four million metric tonnes. Preliminary data shows that about 99 percent of the maize area targeted for the 2024/25 season has been planted, he said.\n\nDr Muswere stated that the Government-led First Round Crops, Livestock, and Fisheries Assessment, which is being finalised, will provide more accurate statistics and reveal the extent of crop plantings.\n\nUnder the Presidential Input Scheme, the farming sector has achieved 11.4 million plots from a targeted 9.5 million plots, which translates to 20 percent above the target and 16 percent above the 2023/24 season performance of 9.8 million plots.The total area planted under cotton is 203,875 hectares, reflecting a 40 percent increase from the 145,265 hectares recorded in the 2023/24 season.\n\nGrain Marketing Board (GMB)\n\nOn food security, Dr Muswere said the current grain stock at the Grain Marketing Board is sufficient to meet the needs of rural communities until the next harvest, expected in April 2025.\n\nHe stated that a total of 1,349,877 metric tonnes, comprising 1,127,411 metric tonnes of maize, 220,092 metric tonnes of wheat, and 374 metric tonnes of wheat flour, were imported by the private sector from April 2024 to 2nd February.To date, 1,021 maize import permits have been issued to import five million metric tonnes. The Government continues to monitor import volumes, stocks at millers, import prices, and import sources to eliminate arbitrage opportunities, said Dr Muswere.\n\nThe Meteorological Services Department has urged farmers to continue monitoring weather patterns and adhere to best farming practices to maximise yields. Zimbabwe is experiencing a La Nia weather season, which is expected to be characterised by normal to above-normal rainfall.\n\nThe anticipated bumper harvest is expected to bolster the countrys food security and reduce reliance on grain imports. If the projections hold, the surplus grain could be utilised for strategic reserves and export markets, further strengthening the agricultural sectors contribution to the national economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-14-1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw FARMERS across Matabeleland have expressed optimism following the ongoing rains, which have significantly improved the outlook for the 2024/25 farming season, with the Government projecting a bumper harvest of 3,2 million metric tonnes of grain. The wet spell, which has been consistent since the onset of the planting season, has revitalised fields, […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Mighty Warriors striker confident",
            "url": "https://www.chronicle.co.zw/mighty-warriors-striker-confident/",
            "content": "Zimpapers Sports Hub\n\nSeasoned Mighty Warriors striker Rutendo Makore is hopeful that the Zimbabwe senior womens football team will perform well in the upcoming Womens Africa Cup of Nations qualifier against Angola.\n\nThe first leg is set to take place in Angola on February 20, with the return fixture scheduled for Pretoria, South Africa, six days later.\n\nMakore, who just two seasons ago had ruled herself out of the game due to injury, is confident that they will do well, considering they have a strong squad comprising both youth and experience.\n\nMakore, also known in football circles as Madzimai, believes they have what it takes to beat Angola over the two-legged qualifier, especially with the support of a strong technical team.\n\nI think we are ready for the challenge, and we are looking forward to the games against Angola. We are very happy in camp. There are a lot of experienced players who are capable of doing the job, and I am happy to be one of the senior players. Playing away is always tricky, but we will not focus too much on that.\n\nWe need to perform well on their turf so that it will be easier for us when we meet them in South Africa for the return fixture, she said.\n\nMighty Warriors prepare for Africa Cup of nations qualifier against Angola\n\nMakore, who made a remarkable comeback after a career-threatening knee injury from which she once thought she would never recover, is now back to her best and eager to play.\n\nFollowing her injury, the womens football star was unable to afford the corrective surgery that doctors had recommended.\n\nMakore, who was part of the history-making Mighty Warriors team that qualified for the Rio Olympic Games in 2016, has now regained her form.\n\nIn a previous interview, she admitted that she never saw herself reaching the top level again, but today, she is standing tall.\n\nThe Mighty Warriors have not qualified for the Womens Afcon since 2016, and their record at the tournament remains limited, with their best performance coming in 2000 when they finished fourth.\n\nHowever, their qualification for the 2016 Rio Olympics remains a significant achievement.\n\nUnder the leadership of new Zifa president Nqobile Magwizi, the team has received increased support, raising hopes that the Mighty Warriors will get the backing they need to succeed in the qualifiers. The squad is set to depart for Angola on Monday.\n\nZimbabwe Squad\n\nGoalkeepers: Vanessa Lunga, Precious Mudyiwa, Lindiwe MagwedeDefenders: Egness Tumbare, Sheila Antonio, Purity Mugayi, Nobukhosi Ncube, Alice Moyo, Fortunate NgochoMidfielders: Daisy Kaitano, Morelife Nyagumbo, Ennetty Chemhere, Natasha Ndowa, Danai Bhobho, Emmaculate Msipa, Mavis Chirandu, Shylne DambamuromoStrikers: Christabel Katona, Rutendo Makore, Ethel Chinyerere, Yolanda Kanyai, Ruvimbo Mucherera.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/0a.jpg",
            "description": "Zimpapers Sports Hub Seasoned Mighty Warriors striker Rutendo Makore is hopeful that the Zimbabwe senior women’s football team will perform well in the upcoming Women’s Africa Cup of Nations qualifier against Angola. The first leg is set to take place in Angola on February 20, with the return fixture scheduled for Pretoria, South Africa, six […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Tanganda Tea pursues alternative markets",
            "url": "https://www.chronicle.co.zw/tanganda-tea-pursues-alternative-markets/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nTANGANDA Tea Company Limited says it is pursuing alternative routes to market while maintaining relationships with traditional wholesale, retail, and catering customers, despite recording a decline in packed tea sales volumes.\n\nIn its trading update for the first quarter ended December 31, 2024, Tanganda reported that packed tea sales volumes for the quarter were 31 percent below the previous volumes of 475 tonnes.\n\nThis was due to challenges prevalent in the formal wholesale and retail market, which constitute the bulk of the packed tea customer base, said Tanganda.\n\nAccording to the company, this move aims to create a balance of growth without hindering the recovery and performance of its traditional customers.\n\nTanganda Tea company estates\n\nDuring the period under review, revenue declined by 12 percent to US$4,4 million from US$5 million recorded in the previous year.\n\nThe company suffered a loss before tax of US$853 917 during the quarter due to a decline in tea production volumes, the firm stated.\n\nAdditionally, the company noted that an inadequate electricity supply disrupted productivity.\n\nTanganda further pointed out that the late onset of the rains negatively impacted bulk tea production for the quarter under review, resulting in a 26 percent decline in volumes to 1,463 tonnes from 1,986 tonnes produced in the previous year.\n\nAs a result, export volumes declined by 11 percent to 1,134 tonnes from 1,274 tonnes achieved in the same period the previous year.\n\nCommenting on the latest monetary policy statement, the firm lamented the Reserve Bank of Zimbabwes (RBZ) decision to reduce exporters currency retention threshold from 75 percent to 70 percent, further affecting the viability of exporters.\n\nReserve Bank of Zimbabwe\n\nMeanwhile, a consignment of 286 tonnes of macadamia nuts, whose export was delayed in the previous financial year due to logistical issues caused by the rescheduling of ships, was subsequently shipped during the quarter under review.\n\nTanganda has also implemented mitigating strategies to enhance process efficiencies and manage costs to improve performance.\n\nThe company stated that it will continue to pursue sustainable market diversification to expand into regional and international markets.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vfgtr.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com TANGANDA Tea Company Limited says it is pursuing alternative routes to market while maintaining relationships with traditional wholesale, retail, and catering customers, despite recording a decline in packed tea sales volumes. In its trading update for the first quarter ended December 31, 2024, Tanganda reported that packed tea sales volumes for […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zifa board meets to chart way forward",
            "url": "https://www.chronicle.co.zw/zifa-board-meets-to-chart-way-forward/",
            "content": "Lovemore Dube,[emailprotected]\n\nTHE newly constituted Zimbabwe Football Association (Zifa) executive committee will meet for the first time on Sunday for a crucial meeting that should shape the way forward for the game.\n\nZifas media desk confirmed yesterday afternoon that the executive committee, under new president Nqobile Magwizi, had set Sunday as the date on which they would meet to craft a pathway to take Zimbabwean football forward.\n\nMagwizi was the overwhelming favourite, winning 66 of the 77 votes cast on January 25.\n\nKennedy Ndebele was elected vice president of the national association, with Loveness Mukura occupying the womens quota for the vice presidency.\n\nAlso ushered in by the January 25 elections were board members Alice Zeure, Tafadzwa Benza, Thomas Marambanyika, Brighton Ushendibaba, and Kudzai Kadzombe.\n\nKennedy Ndebele\n\nThe associations leaders will meet as part of the way forward for the new board, which takes over from Lincoln Mutasa, who has been in charge since July 11, 2023.\n\nFollowing Sundays meeting, they will officially assume management of the association, taking over from Mutasa, whose final responsibilities included working with Rosemary Mugadza and Nyasha Samanyandwe to ensure elections were held and new management was ushered into office.\n\nThe newly elected Zifa executive committee will have its first meeting in Harare on Sunday. This will be the first transitional step after the Normalisation Committee ceased to exist, and it will map a way forward. The executive committee will be consolidating its authority following the transitional arrangement that has been in place, said Zifa in a statement.\n\nThey are expected to establish subcommittees to assist in running the local game.\n\nThey are expected to set up committees to help with the administrative side of Zifa as they open a new chapter, added Zifa.\n\nZifa is expected to draw on the expertise of some councillors and other stakeholders from specialised fields, including external experts.\n\nAmong the long-overdue committees is the referees body, previously under Norman Matemera, as well as the development, technical team, finance, marketing, legal, football history, and legacy committees.\n\nFormer Bosso secretary and committee member Nhlanhla Dube headed the technical team, which assisted in identifying personnel for national teams.\n\nNhlanhla Dube\n\nMeanwhile, Zifa has encouraged clubs with womens football teams to employ a female chief executive officer.\n\nThe association stated that this was a Fifa club licensing requirement, as all efforts are being made to ensure the growth of womens football.\n\nZifa is aware of the challenges clubs face and acknowledges that many cannot afford to hire a chief executive officer. Those with resources are expected to engage a chief executive officer. We understand that some clubs can afford it, while others cannot. In cases such as Highlanders, where a chief executive officer is already in place, they would not be required to appoint another, said Zifa, reiterating that clubs that can afford to do so should consider hiring one specifically for womens football.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dfsfe.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw THE newly constituted Zimbabwe Football Association (Zifa) executive committee will meet for the first time on Sunday for a crucial meeting that should shape the way forward for the game. Zifa’s media desk confirmed yesterday afternoon that the executive committee, under new president Nqobile Magwizi, had set Sunday as the date on […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Tongogara RDC gets fire tenders",
            "url": "https://www.chronicle.co.zw/tongogara-rdc-gets-fire-tenders/",
            "content": "Patrick Chitumba,[emailprotected]\n\nTHE Second Republic continues demonstrating its commitment to strengthening local authorities, with Tongogara Rural District Council (RDC) receiving a fire tender under the Belarus facility.\n\nThe development is expected to enhance the local authoritys ability to effectively respond to fire incidents and other emergencies.\n\nMidlands Provincial Affairs and Devolution Minister Owen Ncube officially commissioned the fire tender at the Tongogara RDC offices in Shurugwi District. The occasion also marked the commissioning of a 28-tonne tipper truck, purchased using council funds to improve service delivery within the district.\n\nSpeaking at the event, Minister Ncube hailed the Governments unwavering support for local authorities, saying the provision of the fire tender represents a bold step by the Second Republic in capacitating rural councils to enhance service delivery.\n\nI am filled with great pride and joy as we witness the commissioning of the Tongogara RDCs devolution-funded fire tender and the tipper truck procured through the councils revenue. This milestone is part of the Governments inclusive and people-centric roadmap towards attaining Vision 2030, said Minister Ncube.\n\nMinister of State for Midlands Provincial Affairs and Devolution, Owen Ncube\n\nHe noted that this initiative marks a historic moment, as it is the first time RDCs have received fire tenders, a crucial addition to their service delivery infrastructure. The new equipment will be instrumental in responding to emergencies such as fire outbreaks and road traffic accidents in Shurugwi and surrounding areas.\n\nThe provision of this fire tender ensures that lives and property are safeguarded. It is now unacceptable for people to perish in road traffic accidents or lose property to fires when local authorities are being equipped with essential disaster response resources, said Minister Ncube.\n\nThe minister has recently commissioned similar fire tenders for Redcliff Municipality and Vungu RDC. He reaffirmed that under the leadership of President Mnangagwa, the Second Republic remains dedicated to uplifting rural communities, guided by the mantra of leaving no one and no place behind in the pursuit of Vision 2030.\n\nTodays event is also a testament to the success of the New Dispensations engagement and re-engagement policy. Through this initiative, 133 fire tenders from Belarus have been secured, alongside several rescue air ambulances from the Russian Federation, bolstering Zimbabwes civil protection efforts despite the illegal economic sanctions imposed on our country, Minister Ncube said.\n\nHe commended the Governments strategic policy direction, noting that the devolution and decentralisation agenda is central to improving the accessibility and affordability of essential services for communities. President Mnangagwa, during his recent engagement with Ministers of State for Provincial Affairs and Devolution, underscored the pivotal role they play in driving socio-economic development and achieving national economic growth targets.\n\nDuring his recent interface with Ministers of State for Provincial Affairs and Devolution President Mnangagwa underscored the pivotal role we play in the national socio-economic development matrix and his desire to grow and leapfrog the economy, a development trajectory which underpins the mandate bestowed upon him under the Resolution number 1 for the attainment of a prosperous and empowered upper middle-income society by 2030, said Minister Ncube.\n\nHe further noted that President Mnangagwa was unanimously endorsed at the 21st Zanu-PF National Peoples Conference in Bulawayo last year to continue leading beyond 2028.\n\nSADC Chairperson President Mnangagwa\n\nHe urged all local authorities to align with the Presidents Call to Action: No Compromise to Service Delivery blueprint to ensure efficient and effective governance.\n\nThe recently concluded heritage training of councillors and local authority senior management in Gweru provides a practical, time-sensitive, and people-centred framework for local authorities to adopt. Councils must prioritise critical service delivery issues, including urban beautification, refuse collection, water and sewer reticulation, pothole filling, road servitude maintenance, cemetery management, and the establishment of designated vending sites, he said.\n\nThe minister also encouraged councils to enhance operational efficiencies by adopting digital solutions such as e-billing systems, online service applications, and improved internal control mechanisms to facilitate the ease of doing business.Tongogara RDC Chief Executive Officer, Engineer Liberty Ncube, expressed gratitude for Governments support, acknowledging the positive impact the fire tender will have on emergency response capabilities.\n\nAs Tongogara RDC, we are among the beneficiaries of the fire tenders procured by the Government, and we sincerely appreciate this gesture. This intervention will significantly enhance our capacity to respond to emergencies swiftly and effectively, he said.\n\nThe commissioning of the fire tender and tipper truck underscores the Governments continued commitment to equipping local authorities with the necessary tools to improve service delivery and ensure the safety and well-being of communities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-12-2.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw THE Second Republic continues demonstrating its commitment to strengthening local authorities, with Tongogara Rural District Council (RDC) receiving a fire tender under the Belarus facility. The development is expected to enhance the local authority’s ability to effectively respond to fire incidents and other emergencies. Midlands Provincial Affairs and Devolution Minister Owen Ncube […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Minister assures continued support for community radio",
            "url": "https://www.chronicle.co.zw/minister-assures-continued-support-for-community-radio/",
            "content": "Fairness Moyana in Hwange\n\nTHE Government has pledged continued support for community radio stations to enhance their sustainability and effectiveness, recognising their critical role in providing early warning systems and disseminating vital information in the face of climate change.\n\nSpeaking at the World Radio Day commemorations held at Lyeja Community Radio in Hwange District yesterday, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, in a speech delivered on his behalf by his deputy, Dr Omphile Marupi, emphasised the indispensable role of radio in bridging information gaps and empowering communities.\n\nWe are living in interesting times when the world is undergoing rapid technological innovation and environmental transformations that are impacting human lives. It is not by coincidence that this years celebration is running under the theme, Radio and Climate Change, which has been localised to Radio and Climate Resilience in Zimbabwe, he said.\n\nDr Jenfan Muswere, Minister of Information, Publicity and Broadcasting Servces.\n\nThe minister underscored the role of radio in shaping public discourse and enhancing communities preparedness for climate-related disasters.\n\nRadio stations act as early warning systems, providing crucial alerts to communities about impending natural disasters. By broadcasting weather updates, emergency procedures, and evacuation plans, radio plays a vital role in saving lives and reducing the impact of climate-related disasters, he said.\n\nDr Muswere reiterated the Governments commitment to fostering media diversity and inclusivity through ongoing media reforms that promote access to information, particularly in rural communities.\n\nI want to applaud His Excellency, Dr ED Mnangagwa, for creating an enabling environment for media plurality and diversity through media reforms that have resulted in the establishment of more newspapers, radio, and television stations.This has worked well in reducing the information divide between urban and rural communities, he said.\n\nAs part of efforts to ensure that no one is left behind, the Second Republic has so far licensed 14 community radio stations across the country, aligning with its broader vision of universal access to information.\n\nSpeaking at the same event, Unesco Director-General Ms Audrey Azoulay hailed radio as a crucial tool in global efforts to combat climate change.\n\nThis year we are paying tribute to the different ways in which radio serves as a tool for adapting to and mitigating the effects of climate disruption in our rapidly changing world. At a time when such extreme weather events are becoming increasingly common, we must recognise the critical and often life-saving role of radio, she said.\n\nThis is also why Unesco recently launched its Global Initiative for Information Integrity on Climate Change. This initiative will help promote and defend the integrity of information on climate change.\n\nThe initiative seeks to go beyond research funding to include advocacy, diplomacy, and strategic action.Vice-convenor of the Zimbabwe Association of Community Radio Stations (Zacras), Mr Luka Katako, lauded the Governments commitment to opening the airwaves and called for collaborative efforts to enhance the sustainability of community radio stations.\n\nYour support is invaluable in ensuring that voices from every corner of our nation are heard, respected, and empowered. We encourage the Government to continue licensing more community radio stations to ensure that we can bridge the information gap that many communities still experience, as access to information is essential for development and disaster resilience, he said.\n\nIn the spirit of collaboration, we believe that the question of sustainability for community radio warrants our joint attention.Mr Katako said Zacras is open to working with the Ministry of Information, Publicity and Broadcasting Services to establish effective sustainability models that ensure the longevity and impact of community radio stations.\n\nWorld Radio Day is an international event celebrated annually on February 13. Designated by Unesco on November 3 2011 during its 36th General Conference, the day highlights the resilience of radio in linking communities, fostering free expression, and serving as a lifeline during crises.\n\nYesterdays event was attended by senior Government officials, traditional leaders, stakeholders, and community members. Several broadcasters, including Zimpapers, AB Communications, and ZBC, also participated in the celebrations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-9-2.jpg",
            "description": "Fairness Moyana in Hwange THE Government has pledged continued support for community radio stations to enhance their sustainability and effectiveness, recognising their critical role in providing early warning systems and disseminating vital information in the face of climate change. Speaking at the World Radio Day commemorations held at Lyeja Community Radio in Hwange District yesterday, […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Rains fill up open sand pits, pose risks to children",
            "url": "https://www.chronicle.co.zw/rains-fill-up-open-sand-pits-pose-risks-to-children-2/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nFOR years, sand poachers have been wreaking havoc in Bulawayos western suburbs, leaving a trail of destruction in areas such as Methodist Village, Pumula East, Old Pumula, Nkulumane, and Pumula South.\n\nThese illegal activities have resulted in severe land degradation, posing a growing threat to both residents and infrastructure.The poachers, driven by the increasing demand for construction materials, operate with impunity, digging deep trenches and pits to extract sand. The harvested sand is then transported to suburbs like Cowdray Park, Emthunzini, and Mbundane, where large-scale housing developments are underway. Despite the evident environmental damage, the illegal operations continue unabated, often taking place in broad daylight.\n\nWith the ongoing rainy season, the abandoned pits are rapidly filling up with water, turning into potential death traps. The Meteorological Services Department (MSD) has forecast a normal to above-normal rainfall season, further exacerbating the risks posed by these open pits.\n\nMeteorological Services Department (MSD)\n\nIn Pumula East, along the main road leading to Nkulumane, the landscape is marred by scattered pits, some already filled to the brim with rainwater. Parents and community leaders fear for the safety of schoolchildren who attend nearby institutions such as Amhlophe High School and Ingwegwe Primary School.\n\nWard 19 Councillor Lazarus Mphadwe expressed deep concern over the situation. He said residents have been raising the alarm for years, but the problem continues to escalate.\n\nThe demand for sand is pushing poachers to dig indiscriminately, leaving dangerous pits behind. Some of these pits are so close to major roads that if left unchecked, we could soon lose critical road infrastructure, said Clr Mphadwe.As parents, our biggest fear is that young children, drawn by curiosity, might attempt to swim in the water-filled pits and drown.\n\nPumula East resident Mrs Gloria Banda, whose home is located near some of the pits, said she has to constantly monitor her grandchildren to prevent them from wandering too close to the water-filled craters.\n\nThe pits are so deep that even an adult could drown if they accidentally fell in. I have two young grandchildren, and Ive strictly forbidden them from playing anywhere near these dangerous areas, she said.She recalled a tragic incident about six years ago when a schoolchild drowned while swimming in one of the pits.\n\nRecent heavy downpours have worsened the situation, filling the largest pits with water and increasing the risk of accidents.Bulawayo City Council (BCC) has acknowledged the severity of the problem but admitted to struggling with enforcement due to limited resources.\n\nBulawayo City Council\n\nIn Methodist Village, illegal sand mining has not only scarred the landscape but also destroyed homes.Mrs Primrose Ndebele, a resident, said the poachers are often individuals from nearby communities who operate with little regard for the consequences of their actions.\n\nThey usually dig at night and sometimes during the day. We just watch them do their thing because when we approach them and tell them to stop, they shout at us and threaten us, she said.\n\nWard 17 Councillor Sikhululekile Moyo said the poachers prioritise profit over the well-being of the community.These are our own children engaging in these activities. They have been selling sand for years without considering the long-term damage. Now, the situation is out of control, she said.\n\nThe Environmental Management Agency (EMA) has called for stronger measures to protect affected areas.EMA environmental education and publicity manager Ms Amkela Sidange said local authorities have to fence off areas affected by sand poaching to protect human life, livestock, and wildlife.\n\nShe revealed that EMA has so far rehabilitated 464 hectares of land affected by sand poaching and illegal mining across the country, with efforts ongoing.\n\nThrough implementing principles of NDS1, EMA has been able to rehabilitate areas that were degraded through sand abstraction across the country. By the end of last year, we had rehabilitated 464 hectares of land, and the rehabilitation is still ongoing, said Ms Sidange.\n\nShe urged the public to only purchase sand from registered suppliers and to ensure that sand extraction follows proper environmental regulations.\n\nWe encourage people to buy sand from licensed companies and to extract sand only from designated points. This ensures that the environment is protected while maintaining public safety, she said.Ms Sidange said registered sand extraction companies must backfill pits after mining to mitigate environmental damage and prevent accidents.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-12-1.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com FOR years, sand poachers have been wreaking havoc in Bulawayo’s western suburbs, leaving a trail of destruction in areas such as Methodist Village, Pumula East, Old Pumula, Nkulumane, and Pumula South. These illegal activities have resulted in severe land degradation, posing a growing threat to both residents and infrastructure. The poachers, driven […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        },
        {
            "title": "Hippo Valley assures adequate sugar stocks amid market shifts",
            "url": "https://www.chronicle.co.zw/hippo-valley-assures-adequate-sugar-stocks-amid-market-shifts/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nSUGAR producer Hippo Valley Estates Limited has assured the nation that it has sufficient stocks to meet both local demand and key export commitments.\n\nIn a trading update for the third quarter ended December 31, 2024, the company reported an increase in local sugar sales following the repeal of Statutory Instrument (SI) 180 at the end of January 2024. This policy shift sparked a surge in demand for its flagship Huletts Sunsweet brand.\n\nHowever, export sales volumes declined by 53 percent as the company deliberately prioritised the domestic market.\n\nHippo Valley noted that despite having adequate sugar stocks, illegally imported unfortified sugar brands continue to be present in the local market, and the relevant authorities have been alerted to address the issue.\n\nHippo Valley Estates\n\nThe company reported strong performance in the latest harvesting season, with cane deliveries from its plantations (miller-cum-planter) increasing by 18 percent. This growth was driven by a 7 percent improvement in yields and a more consistent sugarcane delivery rate.\n\nPrivate farmers recorded a marginal drop in cane deliveries despite a 4 percent increase in yield, resulting from reduced area under cane by 124 hectares, said the firm.\n\nIn addition, the crushing period ended with increased sugar production, supported by improved mill uptime after a successful off-crop (annual) maintenance programme before the commencement of the 2024/25 season.\n\nThe company noted that the focus remains on the current off-crop maintenance programme, which commenced in December 2024, and is progressing well with the anticipation to commence the 2025/26 season in April.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/04/hippo-valley.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com SUGAR producer Hippo Valley Estates Limited has assured the nation that it has sufficient stocks to meet both local demand and key export commitments. In a trading update for the third quarter ended December 31, 2024, the company reported an increase in local sugar sales following the repeal of Statutory Instrument […]",
            "time": "06:09",
            "date": "14 Feb 2025"
        }
    ]
}