{
    "news": [
        {
            "title": "President celebrates excellence. . .Salutes moot court champions",
            "url": "https://www.chronicle.co.zw/president-celebrates-excellence-salutes-moot-court-champions/",
            "content": "Zvamaida Murwira\n\nPRESIDENT Mnangagwa has commended learners who excel in their educational pursuits, saying they deserve recognition as it gives impetus to the countrys Heritage-based Education 5.0 and cements milestones achieved in the education sector.\n\nThe President made these remarks yesterday at State House, where he met Team Zimbabwe learners from Heritage School and St Georges College, winners of the prestigious Orate Africa Moot Court Competition for the SADC region held recently in Gaborone, Botswana.\n\nPresident Mnangagwa\n\nThe learners are now destined for an African competition to be held in Ghana in August this year.Commenting on the learners performance, President Mnangagwa expressed pride in pupils who excel in their studies.\n\nI delight in meeting our young people who excel. This is critically important. There are so many children of the same age, same school, but those who find their way to this place should feel privileged. Most importantly, it is because they have performed well, that is why they are able to come and meet the Head of State; I congratulate them, he said.\n\nThe Minister of Primary and Secondary Education, Torerayi Moyo, highlighted the significance of the awards, emphasising the richness of Zimbabwes Heritage-based Education and the milestones achieved in the sector.\n\nMinister Torerayi Moyo\n\nThe importance of this competition is that education should be meaningful. Education that does not produce goods and services that our people need is useless and is not important. Through the Heritage-based curriculum, we want to identify talents in our students. Those who are good in law, so be it. They were competing as lawyers. A moot court is like a mock court session, where we have judges as adjudicators and they have won.\n\nSo the Heritage-based curriculum ensures that they have identified their career pathway. On completion of A-level, I can envision that these students will proceed to university and study law and become lawyers.\n\nThat is the advantage of Heritage-based education that our President has approved, and we are implementing it very well, said Minister Moyo.\n\nMinister Moyo also commended President Mnangagwa for creating an educational environment that allows good students to excel.\n\nI want to appreciate and thank His Excellency, the President, Cde Emmerson Dambudzo Mnangagwa, for affording our students an opportunity to interact and engage with others. I want to congratulate the students for performing exceptionally well.\n\nThey managed to come first out of 19 schools, and there were seven countries that participated in the moot court competition. So, Zimbabwe will represent the Southern region in the next competition to be held in Ghana in August, and we wish our students very well, he said.\n\nTheir coach, Ms Bernadette Mazambani Chigwida, attributed their success to sheer hard work.\n\nIt is a competition, which is a simulation of court proceedings. We had seven countries and 19 schools and out of those 19 schools, our Team Zimbabwe managed to come out first. We have the best speaker from the competition from Zimbabwe; we also have the best female speaker, and I was voted the best adjudicator, said Ms Chigwida.\n\nThe best student speaker, Simbarashe Mujuru, expressed his delight at meeting President Mnangagwa, saying it will spur him to continue working hard.\n\nThe competition was difficult, but through sleepless nights and hard work, we managed to win. The exposure itself and the chance to represent the country is something we will not forget. The opportunity to meet the President; this is the person who runs the country and for him to take his time to meet us, is something we appreciate, he said.\n\nThe best female speaker, Kimberly Chamboko, echoed similar sentiments.\n\nIt was very tough  there were many schools, many countries, but we managed to push through many sleepless nights. It was a learning experience, trying to learn about the laws and everything, but we managed to come through, and we brought the trophy back home to Zimbabwe, said Chamboko from Heritage School in Borrowdale.\n\nOther students who participated are James Charumbira, Samuelson Kapingidza and Munotida Foya from St Georges College and Trish Kadenhe and Beverly Chifeya from Heritage School.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-22.22.12-680x380.jpeg",
            "description": "Zvamaida Murwira PRESIDENT Mnangagwa has commended learners who excel in their educational pursuits, saying they deserve recognition as it gives impetus to the country’s Heritage-based Education 5.0 and cements milestones achieved in the education sector. The President made these remarks yesterday at State House, where he met Team Zimbabwe learners from Heritage School and St […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "Maphisa mine creates over 2 500 jobs",
            "url": "https://www.chronicle.co.zw/maphisa-mine-creates-over-2-500-jobs/",
            "content": "Judith Phiri\n\nTHE implementation of mechanisation and advanced technology at Stella B Mine in Maphisa, Matobo District, Matabeleland South Province, has driven substantial efficiency gains and increased output, while simultaneously generating over 2 500 local jobs.\n\nThis job creation, facilitated by the Second Republics business reforms, has significantly improved economic prospects within the regions gold mining community.\n\nThe mines revitalisation is vital, not only for economic stability, but also for supporting diverse community groups, including women, young people and war veterans, thereby promoting a more inclusive path to prosperity.\n\nOperations at Stella B Mine in Maphisa\n\nMine owner and Zanu-PF Gwanda-Tshitaudze Member of Parliament, Mr Fisani Moyo, said the business has invested in cutting-edge mining equipment and is committed to further contributing to the national economy.\n\nMechanisation is transforming the mining landscape at Stella City B Mine. We have moved from a small to a medium-scale operation, he said. Investing in cutting-edge mining equipment has significantly boosted our productivity, creating over 2 500 jobs in Matabeleland South and across the country.\n\nBeyond job creation, mechanisation is unlocking new levels of efficiency and profitability in the mining sector. To date, we have seen numerous changes and developments. We previously only had stamp mills, but today we have bore-mills that can crush between five to ten tonnes an hour.\n\nMr Moyo said the objective is to increase output and contribute to mining sector growth, aligning with President Mnangagwas Vision 2030 for an upper-middle-income economy. He affirmed the businesss commitment to ongoing community partnerships for sustainable livelihood improvements.\n\nWe have transitioned from a small-scale mining company to a medium-scale one. What we look forward to is that, in five to six years, we will have scaled up to a large-scale mining operation. Currently, we are focusing on sinking more shafts. The one we are working on is 54 metres wide, and we have installed a headgear. We expect to produce 100 to 150 tonnes, said Mr Moyo.\n\nTour of Stella B Mine in Maphisa\n\nHe added that they hoped to complete some of the projects by years end, with the crushing circuit at 95 percent completion, able to crush between five and ten tonnes of ore per hour.\n\nThis will allow us to generate revenue to upgrade our system and income. We also aim to be counted as those who are positively contributing to the mining industry and the countrys economic growth.\n\nWe urge everyone to take up responsible mining, as the sector is open to all Zimbabweans to help sustain their livelihoods and contribute to national development, he said.\n\nMr Moyo encouraged miners and others to raise the Zimbabwean flag high and be proud of the country, aligning with President Mnangagwas philosophy: Nyika inovakwa nevene vayo / Ilizwe lakhiwa ngabanikazi balo.\n\nMachinery and equipment at Stella B Mine in Maphisa\n\nWe have between 20 to 50 claims and are calling upon the community and various stakeholders, including investors, to join us. Together, we can empower everyone by using proper channels to sell our minerals directly to Fidelity Gold Refinery. We also commend Fidelity Gold Refiners for establishing gold-buying centres across the country, making it easier for miners.\n\nArtisanal and small-scale miners are the primary contributors to national gold production, accounting for over 65 percent, highlighting the positive effects of formalisation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-22.43.07-1.jpeg",
            "description": "Judith Phiri THE implementation of mechanisation and advanced technology at Stella B Mine in Maphisa, Matobo District, Matabeleland South Province, has driven substantial efficiency gains and increased output, while simultaneously generating over 2 500 local jobs. This job creation, facilitated by the Second Republic’s business reforms, has significantly improved economic prospects within the region’s gold […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "Zimbabwe battles costly third-line ARVs treatment",
            "url": "https://www.chronicle.co.zw/zimbabwe-battles-costly-third-line-arvs-treatment/",
            "content": "Robin Muchetu, Lifestyle, Health and Gender Editor\n\nZIMBABWE is facing a significant financial strain as it is allocating thousands of US dollars monthly to secure third-line Antiretrovirals (ARVs) for 603 individuals.\n\nThis escalating expenditure is occurring against a backdrop of dwindling global donor support, placing immense pressure on the nations healthcare resources.\n\nThe exorbitant cost of drug resistance tests, required to determine suitable third-line treatment, further exacerbates the financial strain.\n\nWhile first-line treatment remains relatively affordable, rigorous adherence is crucial to mitigate the catastrophic expenses associated with advanced regimens, which divert funds from other vital treatment programmes.\n\nDr Owen Mugurungi, Director of Aids and Tuberculosis (TB) Unit in the Ministry of Health and Child Care, underscored the substantial financial burden of third-line treatment.\n\nThe challenge with third-line treatment is that it is expensive to manage. First-line costs US$6 to US$8 per month, while the third line goes into hundreds of US dollars and even thousands per month per person.\n\nIt means you have to go by resistance; if you are now resistant to the drugs that we use on you in the first and second line and that drug is not registered here in Zimbabwe or it is not available here, it means we have to source it for you.\n\nConsidering the three-in-one combination (TLD) that we use for first-line treatment is US$8, treatment for the third line is US$86-US$90 per month, which is 10 times higher and thats expensive. So, we try as much as possible to limit or reduce the chances of people getting to the second line and third line of treatment, said Dr Mugurungi.\n\nDr Mugurungi said that while it is easy to determine the cost of treatment for those in the first and second line of therapy, it is not the same for the third line.\n\nWe have a standard cost for ARVs because it is a three-in-one combination for the first line, but for the third line, they are separate treatments. The biggest cost is with the drug resistance testing; it entails that we test, which drugs you are resistant to and, which drugs your infection is sensitive to and so on. So, it is not standard and it is very expensive to do these processes that can spill into thousands.\n\nDr Owen Mugurungi\n\nDr Mugurungi said the 603 patients on third-line medication is too large a number, considering the associated costs of their treatment, and noted that the availability of the drugs is also a challenge and is not always guaranteed.\n\nIt is important to note that the less a drug is used, the less it is also produced, making it extremely expensive to buy. If we had one million people on a particular drug, manufacturers also lower costs as there is a huge demand, but producing special drugs for a very small population also increases the costs significantly, and that is why third-line drugs are very expensive to buy. Their availability is also not guaranteed, always looking at small numbers required, he said.\n\nDr Mugurungi revealed that people are developing resistance to first and second lines of treatment due to myths and misconceptions.\n\nOne of the most obvious reasons is knowledge and behaviours. We have had people who have been told it is not HIV they are suffering from but something else to do with spiritual and traditional things. They are told to stop taking their ARVs. That misinformation is dangerous, and we know that the media can assist in addressing some of those myths and misconceptions, which will make it difficult for people to continue taking their medication, he said.\n\nDr Mugurungi further revealed how resistance to ARVs comes about.\n\nIf you have a headache or malaria, which you are supposed to get treated for, get treated. However, in a few days, some people stop taking medication because they have side effects or they forget or they have challenges in getting medication.\n\nFor people with diabetes, hypertension and others, there are days that one can forget and you can be forgiven because once you take your medication for diabetes your sugar levels go normal. But for HIV, when you forget or are unable to get your medication or the medication gets lost, the virus changes its morphology. At the end of the day, the virus becomes resistant to the medication that you are taking, he said.\n\nOther people naturally become infected with a drug-resistant strain of HIV, which may not respond to the initial lines of treatment, prompting the need for a third line of intervention, which is very expensive.Dr Mugurungi said in terms of trying to address the challenge of people having to go on third-line treatment, they were working with the media to make sure they reduce myths and misconceptions around HIV and people adhere to their medication.\n\nWe are also advancing medication to the patient for six months so that people do not have an excuse as to why they could not collect their medication on time. Even if you are unable to travel to the health centre to access your medication, you can ask your colleague or even your neighbour to collect medicines for you so that at least you are always in constant supply of medication, he said.\n\nARV therapy was introduced in 2004 but did not include a third line of treatment, which was later developed. According to the Guidelines for HIV Prevention, Testing and Treatment of HIV in Zimbabwe, adherence to treatment regimens and schedules is critical to the success of therapy and without high adherence rates, viral resistance to the medicines emerges readily.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-22.29.58.jpeg",
            "description": "Robin Muchetu, Lifestyle, Health and Gender Editor ZIMBABWE is facing a significant financial strain as it is allocating thousands of US dollars monthly to secure third-line Antiretrovirals (ARVs) for 603 individuals. This escalating expenditure is occurring against a backdrop of dwindling global donor support, placing immense pressure on the nation’s healthcare resources. The exorbitant cost […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "VFEX, ZSE reduce settlement periods",
            "url": "https://www.chronicle.co.zw/vfex-zse-reduce-settlement-periods/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE Victoria Falls Stock Exchange (VFex) has announced the reduction of its trade settlement cycle from three days to two (T+2), effective April 14, 2025, to improve efficiency, deepen the pool of liquidity and boost investor confidence in the market.\n\nT+2, which stands for trade date plus two business days, means that investors will now receive proceeds from sales or delivery of purchased securities within two working days.\n\nThe shortened cycle enhances the speed of transactions, reduces counterparty risk and aligns VFex with global best practices.\n\nIn an official market notice, VFex Head of Markets, Mr Robert Mubaiwa, said: The Victoria Falls Stock Exchange Limited (VFex) wishes to advise the market of the migration of the settlement cycle from T+3 to T+2, effective Monday, April 14, 2025.\n\nVICTORIA Falls Stock Exchange\n\nGiven the successful tests and co-operation received from the market, VFex expects a seamless transition. Migrating to T+2 means investors can receive their funds or securities two days after trading, he said.\n\nThe shift follows a successful test run and wide engagement with market participants, reinforcing VFexs ongoing efforts to modernise Zimbabwes financial infrastructure and attract both local and international investors.\n\nAnalysts say the reduced settlement period may increase market participation by making the local bourse more attractive to both institutional and retail investors seeking quicker access to capital or securities.\n\nSimilarly, the Zimbabwe Stock Exchange Limited (ZSE), Chengetedzai Depository Company Limited (CDC), and ZSE Depository (ZSE Depository) also advised the market of the migration of the settlement cycle from T+3 to T+2, effective Monday, April 14 ,2025.\n\nFollowing the market consultations and successful testing phase on the migration to T+2, the Securities and Exchange Commission of Zimbabwe (SECZim) has approved proceeding to the live implementation stage, the companies said in a joint statement.\n\nWe are expecting a seamless transition, given the successful tests and co-operation received from the market. Migrating to T+2 means investors can receive their funds or securities two days after trading.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-22.05.13.jpeg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw THE Victoria Falls Stock Exchange (VFex) has announced the reduction of its trade settlement cycle from three days to two (T+2), effective April 14, 2025, to improve efficiency, deepen the pool of liquidity and boost investor confidence in the market. T+2, which stands for “trade date plus two business days,” means that […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "COMMENT: ZMTi bridges theory practice gap in journalism training",
            "url": "https://www.chronicle.co.zw/comment-zmti-bridges-theory-practice-gap-in-journalism-training/",
            "content": "YESTERDAY we published a story about the establishment of the Zimpapers Training Institute (ZMTi), which we firmly believe represents a potentially significant moment for the media landscape in Zimbabwe.\n\nWhile existing institutions have diligently striven to equip aspiring journalists with fundamental skills, the industrys rapid evolution demands a more comprehensive and specialised approach. The ZMTi, with its focus on practical, industry-relevant training, will play a vital role in elevating the quality of journalism across the nation.\n\nOne of the most pressing challenges facing Zimbabwean media is the need to bridge the gap between theoretical knowledge and the realities of contemporary newsrooms. In an era of digital disruption, where multimedia storytelling and data-driven journalism are paramount, training must extend beyond traditional print-centric models. The ZMTi will provide crucial hands-on experience in areas such as digital content creation, social media management and verification techniques.\n\nFurthermore, the institutes potential to complement existing training providers is undeniable. Rather than competing, a collaborative approach could foster a more robust and diverse training ecosystem.\n\nZMTi, with its access to Zimpapers extensive resources and industry connections, will offer specialist modules and workshops that supplement the broader curricula of other institutions. Joint initiatives, such as guest lectures, mentorship programmes and shared research projects, will create a synergistic effect, benefitting the entire journalistic community.\n\nThe success of ZMTi hinges on several critical factors. Firstly, the institute must seek to uphold the highest ethical standards and promote critical thinking, which are essential for producing journalists who can serve the public interest with integrity. Secondly, continuous professional development for existing journalists is equally vital. The ZMTi should offer refresher courses and specialised training to help seasoned practitioners adapt to the changing media landscape.\n\nFinally, the institute should strive for accreditation and recognition from reputable international bodies. This will not only enhance its credibility but also ensure that Zimbabwean journalists are equipped with skills that meet global standards.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-2.jpg",
            "description": "YESTERDAY we published a story about the establishment of the Zimpapers Training Institute (ZMTi), which we firmly believe represents a potentially significant moment for the media landscape in Zimbabwe. While existing institutions have diligently striven to equip aspiring journalists with fundamental skills, the industry’s rapid evolution demands a more comprehensive and specialised approach. The ZMTi, […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "New boss at Bosso",
            "url": "https://www.chronicle.co.zw/new-boss-at-bosso/",
            "content": "Fungai Muderere, Zimpapers Sports Hub\n\nHIGHLANDERS chairman, Kenneth Mhlophe has voiced confidence in interim CEO Kindman Ndlovu, following the resignation of Brian Moyo amid serious corruption allegations. Moyo is accused of orchestrating a fraudulent player transfer deal with Bulawayo Chiefs, resulting in a US$5 000 overcharge, allegedly siphoned off with the assistance of Bulawayo Chiefs administrator, Andrew Mandigora.\n\nThe pair are accused of inflating player transfer fees, misleading club executives and misappropriating the illicit funds.\n\nBulawayo Chiefs\n\nSources close to the deal revealed that while the actual agreed transfer fee between the clubs stood at US$18 000, Moyo submitted a doctored invoice reflecting US$23 000  triggering alarm bells within the Bosso corridors.\n\nAn internal audit swiftly unearthed what insiders have described as a deliberate scheme to siphon funds, allegedly with Moyo taking US$2 000 and Mandigora, US$3 000.\n\nThe fraud accusations, coupled with mounting internal pressure, forced Moyo to resign on Saturday.Despite the money being returned, Mandigora has also been thrown under the bus. Bulawayo Chiefs officially suspended him from his duties yesterday, citing his involvement in the deceitful transaction and breach of club policy.\n\nIn a strongly-worded letter addressed to Mandigora, Bulawayo Chiefs made it clear they would not tolerate any form of interference in the ongoing investigation.\n\nThis decision has been made in light of serious allegations regarding your involvement in fraudulent transactions, specifically concerning the submission of invoices with exaggerated amounts in collaboration with another clubs official.\n\nPlease return all club property and ensure that you have no further access to club resources, systems, or confidential information during this period. We take these allegations seriously and appropriate steps will be taken to ensure a thorough investigation is conducted, read the letter.\n\nWhile the footballing fraternity reels from the revelations, Highlanders have moved quickly to restore order. In a statement issued yesterday, Bosso chairman Kenneth Mhlophe expressed full backing for the newly-appointed interim CEO, Ndlovu, a member of the clubs executive committee.\n\nFollowing the resignation of Brian Moyo as the chief executive officer, Highlanders is pleased to announce the appointment of Kindman Ndlovu as interim chief executive officer. The club has every confidence that Ndlovus leadership will ensure stability and continuity in the clubs operations, driving operations and success in the coming period, said Mhlophe.\n\nNdlovu steps into the role at a volatile time for the Bulawayo giants, with supporters demanding accountability and a fresh start.\n\nMoyos resignation, although anticipated, came just as disciplinary processes had been triggered against him  a move that underscored the seriousness with which the club is treating the matter.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-23.59.01.jpeg",
            "description": "Fungai Muderere, Zimpapers Sports Hub HIGHLANDERS chairman, Kenneth Mhlophe has voiced confidence in interim CEO Kindman Ndlovu, following the resignation of Brian Moyo amid serious corruption allegations. Moyo is accused of orchestrating a fraudulent player transfer deal with Bulawayo Chiefs, resulting in a US$5 000 overcharge, allegedly siphoned off with the assistance of Bulawayo Chiefs […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "Government goes full throttle digital at ports of entry",
            "url": "https://www.chronicle.co.zw/government-goes-full-throttle-digital-at-ports-of-entry/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHE Government has begun implementing digitally inclined measures aimed at streamlining operations to enhance the movement of cargo and travellers at ports of entry.\n\nThis latest initiative is part of a comprehensive drive to align service delivery with the modernisation of the Beitbridge Border Post.\n\nSo far, the Department of Immigration has introduced automated gate systems commonly known as eGates as well as an online border management system.\n\nThe Zimbabwe Revenue Authority (Zimra) is already using fast cargo scanners, drones, the Zimbabwe Single Window platform and the eTIP (electronic Temporary Import Permit), which have contributed to improved services.\n\nSpeaking during an oversight visit to the border by the Parliamentary Portfolio Committee on Defence, Home Affairs and Security, Assistant Regional Immigration Officer at Beitbridge, Mr Lucky Joe Matyora, said that eGates were introduced in October last year.\n\nZimbabwe Revenue Authority (Zimra)\n\nUnder the new setup, the eGates allow travellers to scan their biometric passports and undergo automated identity verification, replacing the need for manual passport checks by border officials, he said.\n\nThis system is expected to significantly reduce waiting times and improve the efficiency of border control procedures. It forms part of the Governments broader efforts to modernise its ports of entry.It also aligns with global trends towards more streamlined and secure border management through the use of advanced technologies, Mr Matyora added.\n\nWe expect to use the same system, which we are piloting, to efficiently clear the anticipated surge in traffic during the forthcoming Easter holidays.\n\nThe new immigration system is capable of capturing travellers biometric data, flagging certain individuals and auto-generating durations for visitors  for example, allocating 30 days for those on holiday, seven days for business travellers and three days for those transiting through the country.We are piloting the project and so far, we are pleased with the situation on the ground, said Mr Matyora.\n\nWe are also collaborating with other border agencies to tighten security through the use of CCTV cameras and drones. This has enabled us to detect and eliminate undesirable individuals at the border and its periphery.\n\nMr Matyora said through collaboration with other agencies, they have managed to reduce the smuggling of unaccompanied minors across the border.\n\nIn 2023, authorities intercepted over 300 minors and last year, they successfully detained 149 minors.Zimra Manager at Beitbridge, Mrs Winfred Chiyangwa, said they were using the Zimbabwe Electronic Single Window (ZESW) initiative, which was introduced in 2022, to enhance the ease of doing business.Zimra is the lead agency responsible for co-ordinating and harmonising clearance processes at the countrys ports of entry.\n\nThere are 22 border agencies at major port authorities, including Beitbridge, whose operations will be harmonised and streamlined under the ZESW.\n\nUnder the new system, clients and stakeholders will no longer need to move from one agency to another, as all regulatory and transitory services, processes and payments will now be conducted online through a single platform. This will result in faster, more efficient and transparent operations, she said.The key benefits of the Single Window include improved compliance among agencies, more efficient and productive use of resources and enhanced collection of fees, duties and penalties.\n\nWe are tightening security along the border in response to an increase in smugglers using floating boats to cross into the country from South Africa, said Mrs Chiyangwa.\n\nShe said when the river is dry, smugglers use the riverbed, but now that the river is flooded, they are using floating boats.\n\nWe have strengthened security with drones both inside and outside the border, which has helped us reduce crime, she said.\n\nIn some cases, we have dismantled shacks at illegal crossing points where vendors were supplying goods to smugglers. It is encouraging to note that through integrated border management, we are succeeding in securing the border.\n\nParliament has acknowledged the operational challenges at Beitbridge Border Post and its periphery, which are hindering the effective reduction of illegal activities and irregular migration.\n\nActing Chairperson of the visiting joint Parliamentary Committee, Cde Albert Nguluvhe, said the committee was touring all major ports of entry.\n\nHe said at Beitbridge, they observed challenges related to lack of a security fence, the absence of a border inspection road on the border flanks and issues regarding manpower of certain Government agencies.So far, we are impressed with the operations at this border, which is now more secure following its upgrade by the Second Republic, said Cde Nguluvhe.\n\nWe have seen drone surveillance, fast cargo scanners, canine units, e-gates, biometric services and the separation of traffic.\n\nIn addition, the security forces have been addressing issues related to touts and other individuals, who had become a menace at the border.\n\nThe team is scheduled to visit Plumtree and Mulambepele ports of entry on a similar mission, on Tuesday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-6.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE Government has begun implementing digitally inclined measures aimed at streamlining operations to enhance the movement of cargo and travellers at ports of entry. This latest initiative is part of a comprehensive drive to align service delivery with the modernisation of the Beitbridge Border Post. So far, the Department of Immigration […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "Dakamela awards attract  5 000+",
            "url": "https://www.chronicle.co.zw/dakamela-awards-attract-5-000/",
            "content": "Langalakhe Mabena, recently in Nkayi\n\nTHE Chief Dakamela Achievers Awards have firmly established themselves as a significant traditional and cultural movement, with the third edition attracting over 5 000 attendees at koDakamela Hall, koDakamela in Nkayi, Matabeleland North.\n\nHeld over two days, on April 4 and 5, the awards, which were launched in 2022, celebrated individuals and institutions from Matabeleland, which have made outstanding contributions to their communities.\n\nThe first day of the festival was marked by various activities, including a mini football tournament featuring Dakamela Select, Bosso 90, Nkayi Academy and Nkayi United.\n\nNkayi United triumphed, defeating Bosso 90 in the final to claim the trophy. On the main stage, children from local schools and various artistes, including Sikhosana Buhlungu, Ipuntsununu, Khaya Arts, Evias Bhebhe of Dzibalemvula fame and Madlela Skhobokhobo (who also served as the events MC), captivated the audience with their performances, which ran from the afternoon until midnight.\n\nThe second day of the festival saw an estimated 5 000 attendees, with people arriving from across Bulawayo, South Africa, Zambia, Botswana and the United Kingdom.\n\nA high-profile guest list was in attendance, including the Minister of Tourism and Hospitality Industry, Barbara Rwodzi; Deputy Minister of Local Government and Public Works responsible for Local Authorities and Traditional Leaders, Albert Mavunga; and the Permanent Secretary in the Ministry of Sports, Arts and Culture, Nicholas Moyo.\n\nThe royal delegation from the Ndebele Kingdom in South Africa added further prestige, featuring Princess Agnes Nomngoma Mabhena, sister to King Makhosonke Mabhena; Prince Siyabonga Mabena of the Manala-Makerana Traditional Council; Prince Ayanda Manala-Sibindi; Princess Lungile Mabena; and Princess Meisie Mabena-Baloyi. Local traditional leaders also came out in support, including Chiefs Mphini, Mathema, Menyezwa, Bhidi, Nkalakatha, Fuyana and others.\n\nZana Kay receiving her award at Imiklomela kaDakamela\n\nClad in traditional attire representing their ethnic backgrounds whether Ndebele, Zulu, Southern Ndebele, Sotho, or Nguni, the atmosphere was vibrant, enriched by traditional songs and poetry. As Chief Dakamela made his way from his homestead to the main arena, his entourage was led by the Inyosi ZeNkosi (praise poets), who recited ballads and quatrains in his honour. Behind them, were the Amabutho, blending traditional songs with the poets recitals, adding a royal touch as the high table entered.\n\nAmatshitshi, dressed in traditional red and white attire, played a significant role by parading in the main arena, singing and dancing as the chief and guests arrived. The infectious energy of the performance invited everyone in attendance to join in, creating a harmonious atmosphere as the venue erupted with Ndebele traditional and praise songs.\n\nEntertainment was a major highlight, with dynamic performances by Iyasa, Iputsununu, Khaya Arts, Evias Bhebhe (of Dzibalemvula fame), Madlela Skhobokhobo, and veteran artiste, Sikhosana Buhlungu. The event was also graced by a host of creatives, including South African actor Abdul Khoza of Shaka iLembe and Kings of Joburg fame, veteran actor Ernest Ndlovu from Isithembo, Germany-based hip-hop artiste Awa Khiwe, actor Zenzo Nyathi and fashion designer, Zana Kay.\n\nThe awards honoured a broad spectrum of achievers, including Professor Solwayo Ngwenya, Queen Sowa, Virgie Ncube (Virgie Foundation), Madlela Skhobokhobo, Zana Kay, Mngane Ncube (Hawk Flight), Zenzo Nyathi, Mzoe 7 and Nkululeko Innocent Dube. Meluleki Mhlanga (DJ Maranatha), Public Policy and Research Institute of Zimbabwe (PPRIZ), Mthwakazi kaMzilikazi Association, Adonis Msimanga (Best Performed Inmate, Nkayi Prison), Ezra Tshisa Sibanda, Thandolwenkosi Tshuma, Arnold Nkala (Historian), Mlayo Magadlela Ncube, Iputsununu and David Mhambinyana Ngwenya were also awarded.\n\nSeveral businesses showcased their products at the event, alongside locals who were given stalls to sell traditional attire, food and beverages. In keeping with the spirit of rural tourism, visitors were hosted at nearby homesteads built under the Isiphala seNkosi initiative. Some also set up camping tents, utilising nature for their accommodation.\n\nIn his address on the second day of the event, Deputy Minister Mavunga, who served as the guest of honour, commended the initiative for its role in promoting and preserving cultural heritage.Its a great honour to be part of this gathering, where our culture and traditions are preserved and celebrated. Being here is truly humbling. Ive never experienced such unity, with people from different regions and countries coming together. Isizwe sakhiwa ngabanikazi baso (a nation is built by its people), he said.Renowned traditionalist and praise poet, Albert Nyathi, echoed these sentiments, hailing the awards as a unifying force.These awards are instrumental in uniting people from diverse backgrounds. I saw amatshitshi (maidens) and young boys being taught cultural values  an investment in our future. Guests came from Zambia, Tanzania and South Africa, all joining to celebrate and preserve our heritage. Such festivals should be replicated across the country, Nyathi said.\n\nChief Dakamela expressed satisfaction with the growth and direction of the awards.\n\nWhen we created these awards in 2022, our goal was to establish an event that would constantly remind us of who we are while celebrating our culture and traditions. As I reflect on the third edition we just hosted, I am pleased with the growing number of attendees.\n\nDeputy Minister Albert Mavunga and Nicholas Moyo\n\nWe consistently have guests from outside Zimbabwe and key government speakers, which underscores the importance of this event. Beyond the awards, it has evolved into a significant rural tourism driver, attracting people from various regions who come here to enjoy an exceptional blend of culinary experiences, dance, music and culture.\n\nChief Dakamela added: As we begin to plan for next years event, I foresee it being even bigger, as this is a unique festival where people reconnect with their roots and share the diverse values of our traditions.\n\nHowever, as the awards continue to grow year after year, it will be essential to implement solutions that can better accommodate the increasing number of visitors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-21.46.41.jpeg",
            "description": "Langalakhe Mabena, recently in Nkayi THE Chief Dakamela Achievers’ Awards have firmly established themselves as a significant traditional and cultural movement, with the third edition attracting over 5 000 attendees at koDakamela Hall, koDakamela in Nkayi, Matabeleland North. Held over two days, on April 4 and 5, the awards, which were launched in 2022, celebrated […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "Double centuries earn  Curran Bangladesh Test spot",
            "url": "https://www.chronicle.co.zw/double-centuries-earn-curran-bangladesh-test-spot/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nBEN CURRAN could hardly have made a louder statement. The stylish top-order batter blasted twin centuries in a four-day match at Harare Sports Club over the weekend, earning his way into Zimbabwes Test squad for this months tour of Bangladesh.\n\nThe 28-year-old left-hander smashed 147 in the first innings and followed up with a polished unbeaten 105 in the second, lighting up the domestic scene as national selectors put the finishing touches to the 15-man squad. His red-hot form saw him recalled to the Chevrons side for the two-Test series in Bangladesh  Zimbabwes first red-ball visit to the Asian nation since 2020.\n\nChevrons\n\nCurrans rare double-century feat hadnt been seen since Brendan Taylor produced scores of 110 and 106* in a Test against the same opposition in Mirpur during the 2018/19 season. Veteran all-rounder Sean Williams also returns to bolster the squad after sitting out the previous Test against Ireland with a back injury.\n\nCaptain Craig Ervine, reclaims the armband, having pulled out on the eve of that match in February due to a personal emergency.\n\nThe first Test is scheduled for April 20  24 at the Sylhet International Cricket Stadium, with the second to follow from April 28 to May 2 in Chattogram. Zimbabwe head coach, Justin Sammons was upbeat about the squads chances.\n\nWe are very excited to be heading into a period where Test cricket will be our sole focus. The squad has been set up to give us the best balance to deal with whatever may be thrown our way, he said.\n\nZimbabwe last played a Test in Bangladesh five years ago, suffering an innings defeat in Dhaka.\n\nThe squad features three changes from the one selected for Ireland tour earlier this year. Wicketkeeper-batter Joylord Gumbie, was dropped for Tafadzwa Tsiga, who returns to the fold two years after debuting against the West Indies. Left-arm spinner, Wellington Masakadza also earns a recall at the expense of seamer Newman Nyamhuri, while Takudzwanashe Kaitano misses out. Wessly Madhevere retains his place after being drafted in late to face Ireland.\n\nJohnathan Campbell, who captained in Ervines absence, keeps his spot, along with Nicholas Welch, who impressed with a fluent 90 on debut. Pacers, Victor Nyauchi and Brian Bennett held onto their places after decent outings in the recent provincial match, while frontline quick Blessing Muzarabani  fresh from a record seven-wicket haul against Afghanistan  will spearhead the attack with Richard Ngarava. The only uncapped name in the squad is leg-spinner, Vincent Masekesa.\n\nZimbabwe are due to arrive in Bangladesh on April 15 to prepare for the subcontinent conditions. The Chevrons have not enjoyed much success in the format lately, losing eight of their last 10 Tests and drawing the other two. Their last Test win came more than three years ago  in March 2021 against Afghanistan.\n\nHosts Bangladesh, who havent played Zimbabwe in a Test since February 2020, are also under pressure, having failed to win a red-ball match since November last year.Zimbabwe Test Squad:\n\nCraig Ervine (Captain), Brian Bennett, Johnathan Campbell, Ben Curran, Trevor Gwandu, Wessly Madhevere, Wellington Masakadza, Vincent Masekesa, Nyasha Mayavo, Blessing Muzarabani, Richard Ngarava, Victor Nyauchi, Tafadzwa Tsiga, Nicholas Welch, Sean Williams.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-23.59.01-1.jpeg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub BEN CURRAN could hardly have made a louder statement. The stylish top-order batter blasted twin centuries in a four-day match at Harare Sports Club over the weekend, earning his way into Zimbabwe’s Test squad for this month’s tour of Bangladesh. The 28-year-old left-hander smashed 147 in the first innings and […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        },
        {
            "title": "NRZ seeks investors for US$2,4million concrete plant",
            "url": "https://www.chronicle.co.zw/nrz-seeks-investors-for-us24million-concrete-plant/",
            "content": "Sikhulekelani Moyo\n\nTHE National Railways of Zimbabwe (NRZ) is developing a US$2,4 million concrete manufacturing plant and is actively seeking investors and partnerships for the project.\n\nNRZs Chief Strategy and Planning Manager, Mr Jacob Chionyere, announced this initiative at the recent Bulawayo Investment Indaba, where NRZ appealed to investors to consider participating in the project.This project, which we are embarking on as NRZ, will assist us in covering our existing and proposed rail routes that are being operated by NRZ, as well as those that have the potential for our investors to join us in operationalising them, thereby creating demand for concrete sleepers, said Mr Chionyere.\n\nThe project will produce pre-stressed monolithic concrete sleepers and rail products, with an anticipated annual factory output of 60 000 sleepers. It is projected to generate approximately US$4,6 million in revenue, with a payback period of six months.\n\nNRZ\n\nMr Chionyere highlighted the existing market, noting that the National Railways of Zimbabwe (NRZ) is expected to purchase 60 percent of the factorys output.\n\nThe national railway operator is among nearly 30 state-owned companies, whose assets were transferred to capitalise the Mutapa Investment Fund. NRZ has been struggling with declining revenue due to a significant drop in business volumes from 12 million tonnes annually in the 1990s to current levels of 2,3 million tonnes. This decline is largely attributed to outdated infrastructure and a deteriorating fleet.\n\nZimbabwes rail network is not only hindering NRZs operations but also poses a significant challenge to businesses across the country. The inefficiencies of the Zimbabwean railway system are creating a ripple effect, placing considerable strain on the countrys road network.\n\nWith a decline in freight being transported by rail, there has been a corresponding rise in the number of heavy goods vehicles using the roads.\n\nThe increased traffic load can lead to premature road degradation, necessitating more frequent and expensive repairs.\n\nThe compromised state of roads not only increases transportation costs for businesses but also disrupts travel and commerce, hindering overall economic activity.\n\nMr Chionyere said establishing the sleeper plant would help reduce costs for the entity, as most of the sleepers are currently being imported. He added that local suppliers were demanding payment in hard currency.\n\nIf we have our plant, we can take advantage of our Nalatale Quarter plant that we are running to produce quarry aggregation, to supply the production of concrete sleepers. From the 60 000 we are assuming to produce, NRZ will take about 60 percent, with the balance supplied to other rail entities around us, he said.\n\nHe said that having their plant would also help improve the quality of the sleepers, as they would be working with their engineers according to their specifications. The plant would require approximately US$2,4 million, with some of the requirements being fulfilled internally.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-07-at-22.05.13-1.jpeg",
            "description": "Sikhulekelani Moyo THE National Railways of Zimbabwe (NRZ) is developing a US$2,4 million concrete manufacturing plant and is actively seeking investors and partnerships for the project. NRZ’s Chief Strategy and Planning Manager, Mr Jacob Chionyere, announced this initiative at the recent Bulawayo Investment Indaba, where NRZ appealed to investors to consider participating in the project. […]",
            "time": "06:10",
            "date": "08 Apr 2025"
        }
    ]
}