{
    "news": [
        {
            "title": "WATCH: European Union affirms investment in Zimbabwe",
            "url": "https://www.chronicle.co.zw/watch-european-union-affirms-investment-in-zimbabwe/",
            "content": "Peter Matika,[emailprotected]\n\nThe European Union (EU) has assured Zimbabwe that it stands firm on its promise to foster investment opportunities within its member states.\n\nThis commitment comes just as preparations ramp up for the much-anticipated EU-Zimbabwe business forum, aimed at strengthening economic ties and exploring new avenues for collaboration.\n\nThe forum, set to take place from 20 to 22 May, is a significant step for both parties.\n\nIt represents not just a meeting of minds but a chance for Zimbabwe to showcase its potential as an investment destination.\n\nThe EUs assurance is particularly encouraging for local businesses and entrepreneurs who have been eagerly awaiting the opportunity to engage with European investors.\n\nSpeaking during a media briefing with the seven-member States, EU ambassador to Zimbabwe, Jobst von Kirchmann, said the collaboration between the EU and the bloc will be beneficial to both parties.\n\nThis is not a donation but a platform that seeks to benefit both parties. We are committed to walking this journey together with Zimbabwe, he said.\n\nThis sentiment resonates deeply, especially since Zimbabwes path to economic recovery has often been fraught with challenges.\n\nThe EUs assurance of support could mean a fresh wave of investment, which is crucial for job creation and economic stability in Zimbabwe.\n\nKirchmann said the EU-Zimbabwe business forum aims to facilitate discussions on various sectors, including agriculture, technology, and renewable energy.\n\nBy bringing together stakeholders from both sides, the hope is to cultivate relationships that will lead to sustainable investment and growth. The message is clear: the future is bright, and the EU is here to help light the way. With mutual commitment and collaboration, both parties are poised to embark on a journey that could redefine economic landscapes for years to come, said Kirchman.\n\nThe meeting was attended by bloc representatives, namely EU ambassador Jobst von Kirchmann, Romania  Head of Mission, Alexandru Irimia, Italy- Head of Mission, Umberto Malnati, France ambassador, Paul-Bertrand Barets, Swedish ambassador, Per Lindgrde, The Netherlands ambassador, Margaret Verwijk, and Portugal- Head of Mission, Rui Gonalves Monteiro.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-25-at-17.18.54-680x380.jpeg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw The European Union (EU) has assured Zimbabwe that it stands firm on its promise to foster investment opportunities within its member states. This commitment comes just as preparations ramp up for the much-anticipated EU-Zimbabwe business forum, aimed at strengthening economic ties and exploring new avenues for collaboration. The forum, set to take place […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "US$10 000 Brahman bull shines at ZITF",
            "url": "https://www.chronicle.co.zw/us10-000-brahman-bull-shines-at-zitf/",
            "content": "Raymond Jaravaza, Online Reporter\n\nA Brahman bull, valued at US$10 000, was the toast of the Bulawayo Agricultural Society (BAS) after it scooped the 2025 Champion Brahman Bull category.\n\nThe 30-month-old Brahman bull is owned by Mr Jairos Mahlangu of Hlango Ranch based in Mbalabala, Matabeleland South Province.It was a tight competition and we are happy that our pedigree cattle did well in the BAS competition. The champion Brahman bull is worth US$10 000 and people might wonder why it is so highly priced. We are in the business of pedigree breeding and a bull is worth that much because we are selling genetics and not beef, said Mr Mahlangu.\n\nSemen straws drawn from the champion Brahman bull will be available for sale mid-year.The bull is young and ready to mate. The semen has been tested and its fertility rate approved,\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-25-at-16.36.40.jpeg",
            "description": "Raymond Jaravaza, Online Reporter A Brahman bull, valued at US$10 000, was the toast of the Bulawayo Agricultural Society (BAS) after it scooped the 2025 Champion Brahman Bull category. The 30-month-old Brahman bull is owned by Mr Jairos Mahlangu of Hlango Ranch based in Mbalabala, Matabeleland South Province. “It was a tight competition and we […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "Presidents arrive for ZITF official opening",
            "url": "https://www.chronicle.co.zw/presidents-arrive-for-zitf-official-opening/",
            "content": "Vusumuzi Dube, Deputy Radar editor\n\nMOZAMBIQUE President Daniel Chapo and host President Mnangagwa have arrived at the Zimbabwe International Exhibition Centres main arena ahead of the official opening of the 65th edition of the Zimbabwe International Trade Fair.\n\nThe Mozambican leader is the guest of honour at this years global expo.\n\nIn the morning the two leaders toured various stands exhibiting.\n\nOn arrival the two Presidents proceeded to reviewing stand for the singing of the Mozambican national anthem.\n\nAfter the singing of the national anthem, President Chapo will proceed to inspect a guard of honour that has been mountedPresident Chapo is on record saying one of his goals is to improve the economic ties of both nations.\n\nVice President Kembo Mohadi isc present at the arena to witness the official opening.\n\nAlso present are Cabinet Ministers, Service Chiefs, various ambassadors, mayors and towmlns from various local authorities, exhibitors and members of the public.\n\nAfter officially opening the trade showcase, President Chapo will issue awards to winning exhibitors in their various categories.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Presidents-arrive-680x380.jpg",
            "description": "Vusumuzi Dube, Deputy Radar editor  MOZAMBIQUE President Daniel Chapo and host President Mnangagwa have arrived at the Zimbabwe International Exhibition Centre’s main arena ahead of the official opening of the 65th edition of the Zimbabwe International Trade Fair. The Mozambican leader is the guest of honour at this year’s global expo. In the morning the […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "Man Found trapped in Plumtree water drainage system",
            "url": "https://www.chronicle.co.zw/man-found-trapped-in-plumtree-water-drainage-system/",
            "content": "Ronald Mpofu in Plumtree\n\nA MAN was discovered trapped in a drainage tunnel in Lakeview Dingumuzi, Plumtree, by local residents on Friday afternoon.\n\nResidents suspect the man, who appeared to have mental health challenges, may have entered the tunnel seeking refuge from the cold weather after he was seen shivering in the area the previous day.\n\nConcerned locals acted swiftly, pulling the man from the tunnel after detecting a faint heartbeat. Their timely intervention brought relief to onlookers, who had feared the worst.\n\nThe man was successfully rescued and handed over to authorities for medical assistance.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hui87y7-680x360.jpg",
            "description": "Ronald Mpofu in Plumtree A MAN was discovered trapped in a drainage tunnel in Lakeview Dingumuzi, Plumtree, by local residents on Friday afternoon. Residents suspect the man, who appeared to have mental health challenges, may have entered the tunnel seeking refuge from the cold weather after he was seen shivering in the area the previous […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "US Ambassador unveils support for Bulawayo Natural History Museum",
            "url": "https://www.chronicle.co.zw/us-ambassador-unveils-support-for-bulawayo-natural-history-museum/",
            "content": "Mbulelo Mpofu\n\nTHE Zimbabwe International Trade Fair (ZITF) is in full swing, showcasing a vibrant exchange of ideas and collaborations among international stakeholders. Among the prominent participants is the US Embassy, led by Ambassador Pamela Tremont, who recently took a significant step to bolster Zimbabwes paleontological research and education.\n\nOn Thursday, during a special event at the Natural History Museum of Zimbabwe, Ambassador Tremont unveiled a generous donation from Yale University: 16 specimen cabinets designed to organise, store, and protect the museums invaluable fossil collections. This donation aligns with the US Embassys ongoing commitment to advance educational opportunities and scientific research in Zimbabwe.\n\nThe unveiling ceremony coincided with the annual US Fulbright Exchange lecture, which featured Associate Professor of Ethnomusicology Dr Jennifer Kyker from the University of Rochester.\n\nDr Kyker presented on the life and work of renowned Zimbabwean photographer Chicago Dzviti, further emphasising the cultural and educational initiatives supported by the US Embassy.\n\nThe US Embassy is extremely privileged to partner with the museum and Yale University. These fossils are millions of years old. They predate Zimbabwe. They predate the United States. They are all of our histories. Preserving them for research, science, and future generations is in all of our interests. I hope these cabinets are extremely useful in your important work, Ambassador Tremont said during the handover.\n\nThe donation was made possible through the collaborative efforts of Museum director Dr Moira FitzPatrick and Dr Chris Griffin, an Assistant Professor of Geosciences at Princeton University. Dr Griffin previously conducted post-doctoral work in the Department of Earth and Planetary Sciences at Yale and was part of an international team that unearthed the remains of Mbiresaurus, Africas oldest known dinosaur, in 2017.\n\nAt the event, Dr Griffin shared the critical role the museum plays in scientific exploration.\n\nThis partnership simply wouldnt have happened without the scientists and staff at the museum, and all the logistical support it provides, on top of giving the fossils we find a safe home. The museum really is the home base for all these expeditions, and while we have been able to bring sources of funding to help mount these projects, they are driven by the knowledge of the Zimbabwean scientists on our team and the institutional support from the museum.\n\nThe acting regional director of the museum, Violah Makuvaza said: I want to extend our heartfelt thanks to the American Embassy for facilitating the transportation of the fossil cabinets from Yale University to Zimbabwe. These empty cabinets, though devoid of fossils, are an incredibly significant donation to our museums fossil collection. They represent much more than just containers; they are symbols of the valuable partnership and collaboration between our institutions and countries.\n\nMakuvaza further elaborated on the museums vital role in education and national identity.\n\nThe museum plays a vital role in educating the public, fostering scientific inquiry, and building national pride through the preservation of our natural history. The support from Yale University and the American Embassy speaks volumes about the importance of international collaboration and the shared responsibility we have to protect and understand the world around us.\n\nThe US Embassys commitment to Zimbabwe extends beyond paleontology. Over the years, it has actively engaged in various educational, artistic, and cultural initiatives that aim to uplift communities and foster a spirit of collaboration. This latest donation is a testament to the embassys ongoing efforts to support Zimbabwes educational landscape and cultural heritage.\n\nThe fossil cabinets are expected to significantly contribute to the museums ongoing research, ensuring that Zimbabwes rich paleontological heritage is preserved and celebrated for generations to come. Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ythnu-680x360.jpg",
            "description": "Mbulelo Mpofu THE Zimbabwe International Trade Fair (ZITF) is in full swing, showcasing a vibrant exchange of ideas and collaborations among international stakeholders. Among the prominent participants is the US Embassy, led by Ambassador Pamela Tremont, who recently took a significant step to bolster Zimbabwe’s paleontological research and education. On Thursday, during a special event […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "Years later: Nkayi snake bite victim still going strong",
            "url": "https://www.chronicle.co.zw/years-later-nkayi-snake-bite-victim-still-going-strong/",
            "content": "Raymond Jaravaza, Online Reporter\n\nTWO years ago, an 18-year-old teenager, Nomabutho Ncube from Nkayi in Matabeleland North Province, received a free artificial leg years after she was bitten by a venomous snake.\n\nNomabutho Ncubes leg was amputated after the near-fatal attack by a snake, forcing the then young girl to crawl several kilometres to primary school.\n\nA timely donation of an artificial leg, courtesy of the orthopaedic centre  Leonard Cheshire Disability Zimbabwe  ensured she walked to school and enjoyed her life like any other child.\n\nThis year, CAMFED Zimbabwe, a non-profit organisation that addresses challenges of girls exclusion from education, donated another artificial leg to replace the first one that Nomabutho had outgrown.\n\nNomabutho is a learner at Tsheli Secondary School in Nkayi.\n\nNomabutho had outgrown the first artificial leg as she is a growing young lady, and we are happy that she is comfortable with her new leg that was donated by CAMFED Zimbabwe.\n\nOur organisation strives to make the lives of people living with disabilities and amputees as comfortable as possible through our tailor-made products, which range from wheelchairs to artificial limbs, among others, said an official from Leonard Cheshire Disability Zimbabwe, Mrs Ophia Bwanali.\n\nNomabutho was attacked by a snake while in Grade Four, and her leg was amputated at Gweru Provincial Hospital three months after the incident in 2016.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/4645e6-680x360.jpg",
            "description": "  Raymond Jaravaza, Online Reporter TWO years ago, an 18-year-old teenager, Nomabutho Ncube from Nkayi in Matabeleland North Province, received a free artificial leg years after she was bitten by a venomous snake. Nomabutho Ncube’s leg was amputated after the near-fatal attack by a snake, forcing the then young girl to crawl several kilometres to […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "WATCH: “We want to deepen our economic ties” – President Chapo",
            "url": "https://www.chronicle.co.zw/watch-we-want-to-deepen-our-economic-ties-president-chapo/",
            "content": "Rutendo Nyeve,Online Reporter\n\nTHE Mozambican President Daniel Chapo has reiterated the need to increase trade and deepen economic ties between Mozambique and Zimbabwe.\n\nPresident Chapo said this on Friday soon after touring various exhibition stands at the 65th Edition of the Zimbabwe International Trade Fair (ZITF) where he is set to preside over its official opening.\n\nPresident Chapo, who was accompanied by his host President Mnangagwa and ZITF Board Chairman Mr Busisa Moyo, said he was happy with the innovations exhibited which are key in unlocking economic freedom.\n\nWe want to talk about our economic relations, about our political relations, and above all we want to increase trade between our countries and our region. You know that we have the Beira corridor, and we have a pipeline from our port to Zimbabwe.\n\nWe have railways, we have roads, but we want to export many things from Mozambique to Zimbabwe and we want to import many things from Zimbabwe to Mozambique. We want to increase our trading to grow up our economies and to give good life to our people, said President Chapo.\n\nHe emphasised that the two nations achieved their first challenge which was political freedom and it was time they united towards economic emancipation.\n\nWe are here in Zimbabwe because we know that Mozambique is Zimbabwe and Zimbabwe is Mozambique and we have historical relations with Zimbabwe. I think that our first challenge was political freedom and now that we achieved it, we now want to talk about economic freedom in our countries.\n\nThat is why we are here, because I think that it is very important to be together, to be closer, to be united and to be stronger, said President Chapo.\n\nThe two Presidents commenced their tour in Hall 4 where they visited various stands that included Geo Pomona, British Embassy, Embassy of Japan, ZimTrade, Ministry of Industry and Commerce and Belarus amongst others, interacting with diplomats and various captains of industry.\n\nThe two Presidents then proceeded to Hall 5 which houses various exhibitions under the ruling ZANU PF party.\n\nPresident Chapo and his host President Mnangagwa then proceeded to United Refineries before heading to the agricultural stands where they had an appreciation of the various crop and livestock exhibitions.\n\nThe two Presidents concluded their tour with visits to the Zimbabwe Defence Forces stands, the Mozambican Pavilion and the Office of the President and Cabinet.\n\nSoon after the tour, President Chapo is set to officially open the 65th edition of the ZITF where exhibitors who excelled in various categories will be awarded.\n\n@nyeve14\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-25-at-13.56.51-680x380.jpeg",
            "description": "Rutendo Nyeve, Online Reporter THE Mozambican President Daniel Chapo has reiterated the need to increase trade and deepen economic ties between Mozambique and Zimbabwe. President Chapo said this on Friday soon after touring various exhibition stands at the 65th Edition of the Zimbabwe International Trade Fair (ZITF) where he is set to preside over its official […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "All set for ZITF official opening",
            "url": "https://www.chronicle.co.zw/all-set-for-zitf-official-opening/",
            "content": "Vusumuzi Dube, Deputy Radar Editor\n\nHundreds have gathered at the Zimbabwe International Exhibition Centres main arena where Mozambique President, Daniel Chapo will soon officially open the 65th edition of the Zimbabwe International Trade Fair.\n\nPresident Chapo, who is accompanied by his host, President Mnangagwa have just completed touring stands at this years trade showcase.\n\nThe Mozambican leader is the guest of honour at this years oversubscribed global expo, which is running under the theme,Industrialisation: Crafting an Integrated Economic Landscape\n\nThe trade showcase has attracted exhibitors from across Zimbabwe, the region, and the globe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-25-at-13.07.45-680x380.jpeg",
            "description": "Vusumuzi Dube, Deputy Radar Editor Hundreds have gathered at the Zimbabwe International Exhibition Centre’s main arena where Mozambique President, Daniel Chapo will soon officially open the 65th edition of the Zimbabwe International Trade Fair. President Chapo, who is accompanied by his host, President Mnangagwa have just completed touring stands at this year’s trade showcase. The […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "President Mnangagwa and President Chapo arrive at the ZITF",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-and-president-chapo-arrive-at-the-zitf/",
            "content": "Online Reporter\n\nPRESIDENT Mnangagwa and his Mozambique counterpart Daniel Chapo have arrived for the official opening of this year 65th Zimbabwe International Trade Fair (ZITF) edition in Bulawayo.\n\nThe two Presidents jetted into Bulawayo yesterday ahead of todays official opening of the 65th edition of the ZITF.\n\nPresident Chapo is the guest of honour at this years oversubscribed global expo and is scheduled to conduct a tour of stands at the Zimbabwe International Conference and Exhibition Smart City this morning before the official opening session in the afternoon.\n\nThe two Heads of States will have a hectic schedule today at the ZITF where they are scheduled to interact with scores of local and foreign exhibitors whose increased participation has seen the hosts extend space with 29 countries participating.\n\nAmong the foreign countries is Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the European Union delegation, Egypt, Ethiopia, France, German, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the United Kingdom, the United States of America, United Arab Emirates and Zambia.\n\nZimbabwe and Mozambique enjoy cordial bilateral relations dating back to pre-independence times and have blossomed over the years on the socio-economic and political front.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-25-at-10.56.19-680x380.jpeg",
            "description": "Online Reporter PRESIDENT Mnangagwa and his Mozambique counterpart Daniel Chapo have arrived for the official opening of this year 65th Zimbabwe International Trade Fair (ZITF) edition in Bulawayo. The two Presidents jetted into Bulawayo yesterday ahead of today’s official opening of the 65th edition of the ZITF. President Chapo is the guest of honour at […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        },
        {
            "title": "ZNCC hosts Business Luncheon at ZITF 2025",
            "url": "https://www.chronicle.co.zw/zncc-hosts-business-luncheon-at-zitf-2025/",
            "content": "Judith Phiri ,Business Reporter\n\nTHE Zimbabwe National Chamber of Commerce (ZNCC) is hosting a Business Luncheon on the sidelines of the Zimbabwe International Trade Fair (ZITF) 2025.\n\nThe Minister of Industry and Commerce Nqobizitha Mangaliso Ndlovu is set to deliver remarks as the Guest of Honour. Deputy Minister of Finance, Economic Development and Investment Promotion, David Mnangagwa will also deliver special guest remarks.\n\nAmong other key speakers on panel discussions are British Ambassador to Zimbabwe Petter Vowles, Zimbabwe Resident and Humanitarian Coordinator Edward Kallon, Bulawayo Mayor Councillor David Coltart, Confederation of Zimbabwe Industries (CZI) CEO Sekai Kuvarika, ZNCC Immediate Past President Mike Kamungeremu and ZNCC Past President Dr Obert Sibanda among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-25-at-11.39.50-2-680x380.jpeg",
            "description": "Judith Phiri , Business Reporter THE Zimbabwe National Chamber of Commerce (ZNCC) is hosting a Business Luncheon on the sidelines of the Zimbabwe International Trade Fair (ZITF) 2025. The Minister of Industry and Commerce Nqobizitha Mangaliso Ndlovu is set to deliver remarks as the Guest of Honour. Deputy Minister of Finance, Economic Development and Investment Promotion, […]",
            "time": "20:42",
            "date": "25 Apr 2025"
        }
    ]
}