{
    "news": [
        {
            "title": "Old Mutual Zimbabwe launches 5th edition of ‘Value Creation Challenge, Expanding Opportunities for Youths and Startups",
            "url": "https://www.chronicle.co.zw/old-mutual-zimbabwe-launches-5th-edition-of-value-creation-challenge-expanding-opportunities-for-youths-and-startups/",
            "content": "Chronicle Correspondent\n\nTHE Eight2Five Innovation Hub, powered by Old Mutual Zimbabwe, has launched the 5th edition of its renowned and award-winning Value Creation Challenge (VCC).\n\nThis year, the initiative aims to cast a wider net, and will see the Eight2Five Innovation Hub team embarking on a nationwide tour to onboard and educate startups and businesses led by youths, women, and persons with disabilities about the opportunities presented by the programme.\n\nThis years challenge has grown significantly with the addition of new partners. The British Council and the British Embassy, who have been partners since the programmes inception, are now joined by the Zimbabwe Agricultural Development Trust (ZADT), SNV, Delta Corporation, the Swiss Embassy, and the Embassy of Sweden.\n\nThese collaborations have enhanced the programs reach and impact, providing participants with more resources, mentorship, and networking opportunities.\n\nThe tour will ensure that young entrepreneurs from various regions are aware of and can take advantage of the support offered by the Value Creation Challenge.\n\nLast year, approximately 646 youths participated in the challenge. VCC5 aims to build on this momentum, solidifying its role as a pivotal part of Zimbabwes entrepreneurial ecosystem. Efforts are being made to ensure that all corners of Zimbabwe are aware of the challenge, providing equal opportunities for youths to apply.\n\nThe countrywide tour began in Kadoma on Monday, March 17, and will conclude in Lupane in May. During the workshops, participants will receive assistance with registration and submitting quality applications. They will also benefit from business training designed to equip them with practical tools for implementation in their businesses. Additionally, participants will be made aware of the immense potential for entrepreneurship to reshape the economic landscape, paving the way for a brighter, more sustainable future for themselves and the country.\n\nThe Value Creation Challenge recognizes that entrepreneurship is key to driving economic growth through investment in the capacitation of youths creative ideas, business development, and job creation. Organizers have stated that VCC5 will not only celebrate the innovative spirit of Zimbabwes young entrepreneurs but also serve as a catalyst for economic growth and transformation.\n\nBy empowering emerging businesses with essential resources, mentorship, and funding, VCC5 will foster a new generation of leaders poised to tackle the countrys challenges head-on, said Lillian Mbayiwa, Old Mutual Zimbabwes head of group marketing, public affairs, and sustainability.\n\nSince its inception, the Value Creation Challenge has focused on enhancing participants business acumen and refining their strategies through expert mentorship, bespoke training, and invaluable resources. It has also facilitated networking opportunities, connecting entrepreneurs with industry luminaries, potential investors, and collaborative partners.\n\nMbayiwa highlighted that the Value Creation Challenge is built on four key pillars: Innovative Technology, Creative Industries, Emerging Industries, and Sustainability. Each pillar is designed to promote growth and provide entrepreneurs with essential resources and support.\n\nAs Zimbabwes largest integrated financial conglomerate, Old Mutual has made entrepreneurship a cornerstone of its responsible business strategy, with sustainable transformation at the heart of its operations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/wewret-1.jpg",
            "description": "Chronicle Correspondent THE Eight2Five Innovation Hub, powered by Old Mutual Zimbabwe, has launched the 5th edition of its renowned and award-winning Value Creation Challenge (VCC). This year, the initiative aims to cast a wider net, and will see the Eight2Five Innovation Hub team embarking on a nationwide tour to onboard and educate startups and businesses […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Southern African Power Pool, game changer for Sadc",
            "url": "https://www.chronicle.co.zw/southern-african-power-pool-game-changer-for-sadc/",
            "content": "Online Reporter\n\nTHE Southern African Power Pool (SAPP) has made significant contribution to development of power infrastructure which has increased trade and regional integration among Sadc member states.\n\nThe SAPP was created in August 1995 at the SADC summit held in Kempton Park, South Africa, when member states signed an Inter-Governmental Memorandum of Understanding for the formation of an electricity power pool in the region.\n\nA revised Inter-Governmental MoU was signed by Ministers responsible for Energy in the SADC Region on 23 February 2006 to allow private sector players to become members of SAPP, and now has 22 members across 12 Sadc states.\n\nOfficiating at the 64th SAPP Management Committee Meeting in Victoria Falls recently, Energy and Power Development Minister July Moyo said in the last 10 years, a total of 14 546 GWh were traded on the SAPP competitive markets resulting in the exchange of US$986 million among members.\n\nHe said trading on the competitive electricity market is continuing and SAPP has five products namely the Day Ahead Market, Intra Day Market, Week Ahead Market, Month Ahead Market, and Balancing Market which was launched in April 2022.\n\nFrom the time that the SAPP was created, several transmission projects have been successfully completed including key transmission projects such as the 400kV Matimba-Phokoje-Insukamini interconnector. This line was commissioned in 1995 and is one of the flagships projects in the region as it opened for trading of electricity from as far to the North as the DRC and as far South as Lesotho and Namibia through Zimbabwe- Botswana and South Africa.\n\nNumerous electricity trading transactions continue to be traded along this cross-border transmission line which gave birth to the operationalisation of the Southern African Power Pool in 1995. The SADC Regions economies are continuing to grow in fulfilment of the SADC industrialisation thrust and hence the region needs more power, said Minister Moyo.\n\nHe said currently nine out of the 12 mainland Sadc countries are inter-connected while work is underway to connect the remaining three namely Angola, Malawi and Tanzania.\n\nMinister Moyo said the interconnection of Malawi to Mozambique is under construction and the project is expected to be commissioned in September this year while construction of the Zambian portion of the Zambia  Tanzania interconnection will start this year.\n\nThe completion of these projects will result in the 12 mainland states of Sadc being electrically inter-connected marking a significant milestone allowing the region to fully benefit from regional integration in the power sector.\n\nThese market products are providing opportunities for power utilities to trade among themselves over and above the bilateral contracts that exists. It is quite remarkable to note that, the SAPP competitive market is being used by various utilities to meet their short and medium-term power requirements and providing opportunity for those with excess power to generate additional revenue, said the Minister.\n\nZimbabwe is a leader and top developer in power generation in the region, with the country implementing various power project including renewable energy nationwide to increase capacity from about 2 1000MW to about 6 000MW.\n\nZesa Holdings hosted the meeting whose purpose was to look at various issues from planning, project preparation, operations, markets and environmental areas.\n\nMinister Moyo said apart from the transmission inter-connectors, the SAPP has achieved other milestones including establishment of a Co-ordination Centre in Harare in 2000 as an International Development Organisation and nerve centre of SAPP.\n\nOthers include the Markets Sub-Committee (MSC) and Day Ahead Competitive Electricity Market (DAM) implemented in 2009 as a step towards migrating from a cooperative power pool to a competitive power pool.\n\nThere is also the custom-made market trading platform, Supervisory Control and Data Acquisition/Energy Management System (SCADA/EMS) Project, setting up of a SAPP Project Advisory Unit, and purchase and setting up of the SAPP offices in Harare.\n\nMinister Moyo said the region has huge energy resource potential in the form of coal, gas, nuclear, hydro and renewable energy that need to be exploited in an economically sound and sustainable manner for the benefit of the whole region.\n\nHe bemoaned the impact of climate change that has over the years affected hydro power generation at Kariba dam due to reduced water allocation, hence affecting availability of electricity in the whole region.\n\nI need to register my appreciation for how the Southern African Power Pool is assisting in meeting some of the power shortfalls of the Sadc countries through the regional electricity power market clearly illustrating the benefits of regional integration.\n\nElectricity is one of the critical driving forces for economic development and you are at the centre of making it work. As we go into the future, the huge and diverse power generation resources in our region need to be tapped. I hope that as experts in the power sector you will come up with solutions that will look at risk mitigation for such scenarios. I therefore call upon you as experts in the field to continue to apply your minds and bring to the table solutions that will keep the lights on, commerce ticking, industry running and agriculture flourishing even in these challenging environments, he said.\n\nThe Minister bemoaned prevalence of vandalism of transmission infrastructure and said Ministers responsible for Energy were prioritising strategies to combat the scourge.\n\nHe said the industry faces insufficient generation capacity to meet the growing power demand where the current generation capacity shortfall is close to 4 000 MW, lack of adequate transmission and distribution infrastructure, high transmission and power distribution losses, limited regional trade of power due to transmission constraints, and the the effects of climate change on generation production.\n\nMinister Moyo said the region can save up to US$37 billion in net present value terms if coordinated planning is followed.\n\nHe said SAPP is also working on the Regional Transmission Infrastructure Financing Facility to unlock transmission constraints through promoting the blended financing and development of new transmission infrastructure.\n\nHe called for more private sector participation riding on changing regulatory environment, and commended some independent power producers for development of renewable energy projects.\n\nHe urged member states to invest more in electricity supply infrastructure for additional power generation.\n\nThis SAPP committee meeting came soon after the 10th Africa Partnership Summit held in Washington, US where the critical role of energy in driving economic growth was underscored while the US government expressed commitment to partnering with Africa to eliminate energy poverty.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/TGHTYUTY.jpg",
            "description": "Online Reporter THE Southern African Power Pool (SAPP) has made significant contribution to development of power infrastructure which has increased trade and regional integration among Sadc member states. The SAPP was created in August 1995 at the SADC summit held in Kempton Park, South Africa, when member states signed an Inter-Governmental Memorandum of Understanding for […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Vulnerable women gifted Presidential rice in Bubi district",
            "url": "https://www.chronicle.co.zw/vulnerable-women-gifted-presidential-rice-in-bubi-district/",
            "content": "Online Reporter\n\nMATABELELAND North proportional representation Member of Parliament Cde Elizabeth Masuku extended a Womens Month cheer to dozens of vulnerable and elderly women in Bubi where she distributed bags of rice and sugar.\n\nCde Masuku represents Bubi and Umguza Constituencies.\n\nThe rice was donated by President Mnangagwa who allocated the consignment to all legislators countrywide to distribute to vulnerable communities.\n\nCde Masuku distributed the rice to more than 50 women in Bubi recently. The beneficiaries were largely drawn from Womens League members and ordinary community members.\n\nShe also used her resources to mobilise sugar to add to what each beenficiary was getting, further putting smiles on the womens faces.\n\nA similar distribution will be done in Umguza where more women and vulnerable community members are set to benefit.\n\nDistributing the rice and sugar, Cde Masuku encouraged the community to support Government programmes.\n\nShe said the ruling Zanu-PF under President Mnangagwa was pro-people and listens to concerns hence distribution of food.\n\nWe should always support our President as women in Bubi and Umguza. There are many programmes and projects that we can benefit from hence we remain in full support of Government and Zanu-PF, she said.\n\nIn a follow-up interview, Cde Masuku said: This is the rice donated by President Mnangagwa and we decided that our people would also need a cup of tea as they eat their rice hence we added a packet of sugar for each beneficiary. We had more than 50 women in Bubi and we are moving to Umguza where more women will also receive.\n\nBeneficiaries were grateful to the gesture, thanking Cde Masuku and President Mnangagwa for making sure they have food on their tables.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-22-at-11.17.33-AM-680x380.jpeg",
            "description": "Online Reporter MATABELELAND North proportional representation Member of Parliament Cde Elizabeth Masuku extended a Women’s Month cheer to dozens of vulnerable and elderly women in Bubi where she distributed bags of rice and sugar. Cde Masuku represents Bubi and Umguza Constituencies. The rice was donated by President Mnangagwa who allocated the consignment to all legislators […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "AHFoZ expresses reservations on proposed amendment bill",
            "url": "https://www.chronicle.co.zw/ahfoz-expresses-reservations-on-proposed-amendment-bill/",
            "content": "Online Reporter\n\nTHE Association of Healthcare Funders of Zimbabwe (AHFoZ) has expressed reservations about the proposed Insurance and Pensions Commission (IPEC) Amendment Bill of 2024 which it says will disadvantage healthcare seekers.\n\nIPEC publicised on its social media platforms that the Parliamentary Portfolio Committee on Budget, Finance and Investment Promotion will conduct public hearings on the Insurance and Pensions Commission Amendment Bill in major parts of the country starting this Monday 24 March.\n\nThe first meeting will be in Gweru on Monday followed by the Bulawayo meeting the next day on 25 March while Harare and Bindura will be the last on 28 March after Masvingo and Mutare during the week.\n\nIn a statement, AHFoZ said it had noted with concern that there will be countrywide Public Hearings on the Amendment Bill which it says seeks to classify Medical Aid Societies under financial services for regulation under IPEC as is the case with other insurances.\n\nThe Public Hearings will be hosted by the Parliamentary Portfolio Committee on Budget, Finance, and investment Promotion from 24-28 March 2025 countrywide.\n\nAHFoZ said it was concerned that the change will bring significant disruption which may be detrimental to the sustainability of the medical aid system.\n\nMedical Aid Societies are in the business of health and they focus on a holistic approach to peoples well-being by prioritising prevention, wellness, treatment and rehabilitation and they are run by their members.\n\nTypically, medical aid societies rely on member contributions whereas insurance companies have shareholders who provide capital and manage the affairs of the insurance fund. Insurance corporations are established with the primary objective of generating profits while Medical Aid Societies are predominantly non-profit entities and they are tax exempt.\n\nThe principal purpose of these societies is to facilitate the funding of private healthcare services for their members through pooling funds, as opposed to generating profit. These societies are owned by their members, and any surplus funds are typically reinvested into the society to enhance services and benefits for the members, said AHFoZ Chief Executive, Ms Shylet Sanyanga.\n\nShe said the essence of Medical Aid Societies lies in their voluntary nature.\n\nShe said over-regulation by classifying them as financial entities threatens their continuity, as restrictive regulations may lead members to opt out and collapse of the sector.\n\nMs Sanyanga said the proposed Bill introduces regulatory oversight that may not align with the unique operational framework of Medical Aid Societies and the entire ecosystem, which includes Healthcare Service Providers.\n\nSubjecting these societies to the same regulatory framework as insurance entities whilst Healthcare Service Providers are under Ministry of Health and Child Care could create a mismatch and discord which could compromise health outcomes.\n\nA unified regulatory authority is essential for the healthcare sector, not only for monitoring health outcomes, but also for effective dispute resolution and ensuring the interests of the Health Citizen are prioritised, she said.\n\nMs Sanyanga said among other things, the Bill mandates Medical Aid Societies to maintain an asset register and notify IPEC prior to selling any assets, imposing an unnecessary administrative burden. The punitive fines for non-compliance, potentially equating to the asset value, are excessively high and could stifle the operational efficiency of these societies and increase costs of medical aid, she added.\n\nRegulation under Financial services puts emphasis on Profit and Financial compliance. This poses a risk of insufficient coverage for healthcare needs, stringent Global limits and expensive Medical Aid contributions as the priorities will be forced to shift from People to Profits, bemoaned Ms Sanyanga.\n\nShe said when comparing medical aid and insurance, there is a need to note that with funeral cover, there is one incident as a person dies once, with motor vehicle insurance, there are few incidents as people hardly get involved in road traffic accidents while with medical aid, there are numerous incidents as people fall sick numerous times and in some cases the treatment requires extensive investigations, surgery, rehabilitation and follow-ups, among other things.\n\nMedical aid treatment might be obtained locally or outside the country.\n\nMs Sanyanga said Medical Aid Societies have over the years complimented the Government in facilitating access to healthcare services, with 80 percent of Healthcare Service Providers income coming from Medical Aid societies.\n\nThe collapse of this sector would impact on the entire healthcare sector, she said.\n\nMs Sanyanga said AHFoZ has not yet been consulted on the issue.\n\nAHFoZ represents medical aid societies across the nation with the mission to promote sustainable healthcare funding solutions and advocate for policies that enhance the quality and accessibility of healthcare in Zimbabwe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fhbj.jpg",
            "description": "Online Reporter THE Association of Healthcare Funders of Zimbabwe (AHFoZ) has expressed reservations about the proposed Insurance and Pensions Commission (IPEC) Amendment Bill of 2024 which it says will disadvantage healthcare seekers. IPEC publicised on its social media platforms that the Parliamentary Portfolio Committee on Budget, Finance and Investment Promotion will conduct public hearings on […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Man jailed 45 years for raping 12 year old girl",
            "url": "https://www.chronicle.co.zw/man-jailed-45-years-for-raping-12-year-old-girl/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nA 45-YEAR-OLD from Chiendambuya, Inyathi was jailed 45 years for repeatedly raping a 12-year-old.\n\nThe man cannot be named to protect the identity of the victim.\n\nHe was convicted by the Rusape Regional Magistrate Court on three counts of rape which occurred at different times between January 2023 and July 2024.\n\nIn a statement on X, the National Prosecuting authority of Zimbabwe said this case highlights the devastating impact of child sexual abuse and the importance of holding perpetrators accountable.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jail.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com A 45-YEAR-OLD from Chiendambuya, Inyathi was jailed 45 years for repeatedly raping a 12-year-old. The man cannot be named to protect the identity of the victim. He was convicted by the Rusape Regional Magistrate Court on three counts of rape which occurred at different times between January 2023 and July 2024. In […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Heavyweight boxing legend George Foreman dies aged 76",
            "url": "https://www.chronicle.co.zw/heavyweight-boxing-legend-george-foreman-dies-aged-76/",
            "content": "Boxing heavyweight legend George Foreman has died aged 76.\n\nKnown as Big George in the ring, the American built one of the most remarkable and enduring careers in the sport, winning Olympic gold in 1968 and claiming the world heavyweight title twice, 21 years apart  the second making him the oldest champion in history aged 45.\n\nHe lost his first title to Muhammad Ali in their famous Rumble in the Jungle fight in 1974. But overall, he boasted an astonishing total of 76 wins including 68 knockouts, almost double that of Ali.\n\nForeman retired in 1997 but not before he agreed to put his name to a best-selling grill  a decision that went on to bring him fortunes that dwarfed his boxing earnings.\n\nHis family said in a post on Instagram on Friday night: Our hearts are broken. A devout preacher, a devoted husband, a loving father, and a proud grand and great grandfather, he lived a life marked by unwavering faith, humility, and purpose.\n\nThe statement added: A humanitarian, an Olympian, and two time heavyweight champion of the world, He was deeply respected  a force for good, a man of discipline, conviction, and a protector of his legacy, fighting tirelessly to preserve his good name  for his family.\n\nTributes poured in from others across the sport, with former world heavyweight champion Mike Tyson saying Foremans contribution to boxing and beyond will never be forgotten.\n\nThe Ring magazine, often dubbed the Bible of Boxing, described him as one of the greatest heavyweights of all time.\n\n[He] will be remembered as an icon of the sport forever.\n\nForeman was born in Marshall, Texas, on 10 January 1949, and raised along with six siblings by a single mother in the segregated American South.\n\nHe dropped out of school and turned to street robberies before eventually finding his outlet in the ring.\n\nForeman won the heavyweight gold medal at the 1968 Olympics in Mexico City, aged 19, before turning pro and winning 37 consecutive matches. He lost only five bouts over his career.\n\nHe recalled that his preaching started small, on street corners and with friends, then grew.\n\nWe began meeting informally at various homes in Houston, and before long, the crowds became too large for most houses to accommodate, Foreman said on his website.\n\nEventually, we bought a piece of land and an old, dilapidated building on the north-east side of Houston.\n\nForeman came out of retirement in 1987 to raise money for a youth centre he founded. He won 24 matches before losing to Evander Holyfield after 12 rounds in 1991.\n\nIn 1994, Foreman knocked out undefeated Michael Moorer to become the oldest ever heavyweight champion at age 45.\n\nHe became ad pitchman for his George Foreman Grill, which millions have purchased since it hit the market in 1994, thanks in part to his memorable catchphrase, the Lean Mean Grilling Machine.\n\nForeman was married five times. He has a dozen children, including five sons who are all named George.\n\nHe explained on his website that he named them after himself so they they would always have something in common.\n\nI say to them, If one of us goes up, then we all go up together, he explained. And if one goes down, we all go down together!'\n\nHe beat previously undefeated reigning champion Joe Frazier in Kingston, Jamaica, in 1973 knocking him down six times in the first two rounds.\n\nHis 1974 Rumble in the Jungle against Ali in Kinshasa, Zaire, now the Democratic Republic of the Congo, remains one of the most famous boxing matches ever.\n\nAli, the older man, was the underdog after he was stripped of his crown seven years earlier for refusing to be drafted into the Vietnam War.\n\nForeman reflected on the legendary fight 50 years later in an October interview with BBC World Service Newshour, explaining that everyone thought he was going to decimate Ali.\n\nOh, hes not going to last one round, the boxer said experts were predicting at the time.\n\nForeman told the BBC he typically would get real nervous and have butterflies before any boxing match, but that night  it was the most comfortable he had felt.\n\nBut the wily Ali used a tactic that later became known as rope-a-dope, which wore out Foreman, causing him to throw out hundreds of punches before Ali unloaded on him in the eighth round and scored a knockout.\n\nAfter a second professional loss, Foreman retired in 1977 and became an ordained minister at the Church of the Lord Jesus Christ in Texas, which he founded and built.\n\nHe told the BBC his defeat to Ali became the best thing that ever happened to me as it ultimately led him to get my message out through preaching.\n\nBBC. COM\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/skynews-george-foreman_6863793-680x380.jpg",
            "description": "Boxing heavyweight legend George Foreman has died aged 76. Known as Big George in the ring, the American built one of the most remarkable and enduring careers in the sport, winning Olympic gold in 1968 and claiming the world heavyweight title twice, 21 years apart – the second making him the oldest champion in history […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Warriors arrive in Nigeria",
            "url": "https://www.chronicle.co.zw/warriors-arrive-in-nigeria/",
            "content": "Tadious Manyepo in ABUJA, Nigeria\n\nThe Warriors arrived in Lagos, Nigeria last night and are this morning to catch a connecting flight to Uyo where they will play the Super Eagles in a 2026 World Cup qualifier on Tuesday.\n\nZimbabwe, who are bottom of the six-team Group C with only three points in five games played a 2-2 draw against Benin at the Moses Mabhida Stadium in Durban, South Africa on Thursday.\n\nThey would fly to Johannesburg where they caught their flight to Lagos yesterday.\n\nThey will be out to try and salvage a faltering campaign against a Nigerian team which took their points tally to six after beating Rwanda 2-0 in their backyard yesterday.\n\nThe Warriors will have a recovery training late in the day before they move in to tactical sessions tomorrow.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fgbhtyh.jpg",
            "description": "Tadious Manyepo in ABUJA, Nigeria The Warriors arrived in Lagos, Nigeria last night and are this morning to catch a connecting flight to Uyo where they will play the Super Eagles in a 2026 World Cup qualifier on Tuesday. Zimbabwe, who are bottom of the six-team Group C with only three points in five games […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "60 years in prison for three brothers convicted of brutal murder",
            "url": "https://www.chronicle.co.zw/60-years-in-prison-for-three-brothers-convicted-of-brutal-murder/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nTHREE brothers from Mariwo Village in Mutare have been each been sentenced to 20 years in prison for the brutal murder of Liberty Kambaramu, who died after being stabbed and assaulted at Tsanza Business Centre in September 2023.\n\nStanley Kadzura (34), Petros Kadzura (37), and Tawanda Bayai Kadzura (33) were convicted of murder by the High Court of Zimbabwe in Mutare. The court heard that the three brothers acted together to kick, punch and stab Kambaramu.\n\nThe State presented evidence showing that Kambaramu suffered fatal stab wounds to the lower side of the chest and abdomen. He died as a result of these injuries.\n\nThe brothers sentence was handed down after the court considered the evidence and found them guilty of murder with intent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/2303-1-1-MURDER-CHARGE-680x380.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com THREE brothers from Mariwo Village in Mutare have been each been sentenced to 20 years in prison for the brutal murder of Liberty Kambaramu, who died after being stabbed and assaulted at Tsanza Business Centre in September 2023. Stanley Kadzura (34), Petros Kadzura (37), and Tawanda Bayai Kadzura (33) were convicted of […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "Zimbabwe army issues warning over social media comments and abuse of military uniform",
            "url": "https://www.chronicle.co.zw/zimbabwe-army-issues-warning-over-social-media-comments-and-abuse-of-military-uniform/",
            "content": "Online writer\n\nTHE Zimbabwe Defence Forces (ZDF) has expressed concern over recent comments made on social media by certain members of the public, including some former members, which they say may misrepresent the position of the forces.\n\nThe military body issued a press release, urging citizens to refrain from making public statements that may harm the credibility of the ZDF and the nations security.\n\nThe ZDF said citizens should be aware that the organisation has established channels for communicating with the public, and social media is not one of them. It also distanced itself from some of the social media utterances made by individuals, including some retired members, which the ZDF feels could be misconstrued.\n\nIn addition to the social media concerns, the ZDF highlighted the continued abuse of military uniforms by members of the public. They referred to Section 99 (2) (c) of the Defence Act (Chapter 11:02), which prohibits the wearing of military uniforms by individuals not authorised to do so. Those found wearing such uniforms, or items closely resembling them, will face prosecution.\n\nThe army stressed the importance of respecting the Defence Act, which criminalises the use of military uniforms by unauthorised individuals. The public was urged to avoid acquiring or wearing any items of military apparel without proper authority, as those caught breaching the law would be prosecuted.\n\nThe ZDF has called for all citizens to adhere to the law and refrain from actions that may undermine national security or misrepresent the position of the armed forces.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/08/zdf11.jpg",
            "description": "Online writer THE Zimbabwe Defence Forces (ZDF) has expressed concern over recent comments made on social media by certain members of the public, including some former members, which they say may misrepresent the position of the forces. The military body issued a press release, urging citizens to refrain from making public statements that may harm […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        },
        {
            "title": "US heavyweight boxing legend George Foreman has died age 76",
            "url": "https://www.chronicle.co.zw/us-heavyweight-boxing-legend-george-foreman-has-died-age-76/",
            "content": "US heavyweight boxing legend George Foreman has died age 76.\n\nThe ring icon regained his world title 20 years after a shock loss to Muhammad Ali and fought some of the biggest names of his era. He also had a colourful life away from boxing, making millions from kitchen appliances, becoming a minister and having 12 children.\n\nThe two-time champion fought Muhammad Ali in one of the sports most legendary fights, the Rumble in the Jungle.\n\nHe was also known for putting his name to a popular range of electric grills.\n\nA statement on his Instagram account said he died peacefully on Friday surrounded by loved ones after an extraordinary life.\n\nHis family called him a devout preacher, a devoted husband, a loving father, and a proud grand and great grandfather  and said he lived with unwavering faith, humility, and purpose.\n\nMike Tyson said on X that his contribution to boxing and beyond will never be forgotten.\n\nForeman was considered virtually unbeatable in the famous 1974 fight in the Democratic Republic of the Congo.\n\nAli, 32, was trying to return to the top against his fearsome, undefeated opponent  just 25 at the time.\n\nDespite being a huge underdog, Alis rope-a-dope tactics of soaking up Foremans attacks wore out the brutal puncher and he regained the title.\n\nBelieved to be one of the most-watched sports events ever, a documentary about the fight, When We Were Kings, won an Oscar in 1996.\n\nForeman was devastated by the loss, but 20 years later staged his own miraculous comeback  knocking out Michael Moorer to become the oldest-ever heavyweight champion at age 45.\n\nOutside the ring, his transformation from a brooding boxer to a jovial, TV-friendly personality helped make him a fortune with his range of grills in the 1990s.\n\nThe boxer known to fans as Big George was born in Marshall, Texas, on 10 January 1949.\n\nHe and his six siblings were raised by a single mother.\n\nForeman dropped out of school and got mixed up in street robberies, but left Texas at 16 and was encouraged to direct his energy into boxing.\n\nJust three years later, in his 25th amateur bout, he won gold at the 1968 Olympics in Mexico City.\n\nForeman turned pro and reeled off 37 wins before demolishing the undefeated Joe Frazier in two rounds to become heavyweight champion for the first time in 1973.\n\nCrushed by his shock loss to Ali a few fights later, he took a year off before stepping inside the ring again.\n\nBut after a second career defeat in 1977  and what he described as a near-death experience in the dressing room  he stopped fighting.\n\nHe became a born-again Christian and ordained minister. However, Big George was back inside the ropes a decade later.\n\nTrimming down his physique along the way, he won 24 fights in a row before losing on points to Evander Holyfield in 1991.\n\nForeman wasnt done though  and his long road back was finally complete in Las Vegas three years later.\n\nWearing the same red shorts from the Ali fight and behind on the scorecards, he knocked out Michael Moorer, 19 years his junior, to win the IBF and WBA titles.\n\nForemans 20-year gap between world titles was a record  and he retired for good in 1997  with a record of 76 wins and five losses.\n\nHe was married five times and had five sons  all called George  and seven daughters.\n\n Sky News\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/skynews-george-foreman_6863793-680x380.jpg",
            "description": "US heavyweight boxing legend George Foreman has died age 76. The ring icon regained his world title 20 years after a shock loss to Muhammad Ali and fought some of the biggest names of his era. He also had a colourful life away from boxing, making millions from kitchen appliances, becoming a minister and having […]",
            "time": "18:29",
            "date": "22 Mar 2025"
        }
    ]
}