{
    "news": [
        {
            "title": "Jimmy Carter funeral: Joe Biden, Donald Trump and other living presidents gather for state funeral",
            "url": "https://www.chronicle.co.zw/jimmy-carter-funeral-joe-biden-donald-trump-and-other-living-presidents-gather-for-state-funeral/",
            "content": "Iona HampsonReporting from Washington National Cathedral\n\nOn a freezing day in Washington, Jimmy Carters casket stands in front of members of the press outside the National Cathedral.\n\nTheres silence until the service starts. All you can hear is the bitter wind.\n\nSeveral international and US political VIPs are attending Jimmy Carters funeral, including Vice-President-elect JD Vance and his wife Usha Chilukuri Vance, former Vice President Al Gore.\n\nSupreme Court Justices Amy Coney Barrett and Elena Kagan, top House leaders Mike Johnson and Hakeem Jeffries and Canadian Prime Minister Justin Trudeau are also among the congregation.\n\nSome have already taken their seats in the cathedral.\n\nJimmy Carters casket, accompanied by his family, have just arrived at the National Cathedral.\n\nInside, hymns are being performed by the US Marine orchestra and Armed Forces chorus, while mourners await the start of the service.\n\nAnthony ZurcherNorth America correspondent, reporting from Washington National Cathedral\n\nThe cathedral is filling up, and the attendees have been told to take their seats.\n\nThe organ and piano music has been replaced by booming orchestral chords.\n\nVarious dignitaries and politicians are still chatting, however  like a sombre black-suit-and-dress Washington cocktail party.\n\nAs Jimmy Carters casket makes its way from the US Capitol to the National Cathedral, mourners are beginning to gather ahead of his state funeral service.\n\nYou can see some images from inside the cathedral below:\n\nCarter is now being driven by motorcade to the Washington National Cathedral  about a 15 minute journey  where his state funeral is to take place.\n\nThe route is taking the cortege past some of the set-up for incoming President Donald Trumps inauguration, which will take place on 20 January.\n\nPresident Joe Biden and President-elect Trump are both expected to attend todays service.\n\nGary ODonoghueSenior North America correspondent\n\nIt was a long time ago since Jimmy Carter was in the White House. A lot of people alive in America wont remember much about him, or will remember more about his post-presidency.\n\nThis includes the building of homes around the world, working to eliminate disease around the world, and the building of democracy. He got the Nobel Peace Prize for all that work in 2002.\n\nOne of the words that Joe Biden has been using when talking about Jimmy Carter is decency, which I think is one of the things well hear today in the eulogy.\n\nThere has been a lot of focus on what a decent man Jimmy Carter was, even if his presidency was beset with a lot of problems, particularly economic problems, the energy shock and other issues he was having at the time with inflation.\n\nPresident Jimmy Carters casket is being carried out of the US Capitol, and well continue to bring you updates as the ceremony begins in the National Cathedral.\n\nRemember, you can also watch along with us by pressingwatch liveat the top of the page.\n\nAnthony ZurcherNorth America correspondent, reporting from Washington National Cathedral\n\nThe 10-page programme for todays memorial service is embossed in gold with the seal of the President of the United States.\n\nJoe Biden is listed as giving the tribute, but several of Carters grandchildren are also scheduled to speak, as are the sons of former Vice-President Walter Mondale and former President Gerald Ford.\n\nAndrew Young, who served as Carters ambassador to the UN, will deliver the homily.\n\nAs a reminder, you can watch the funeral service by pressing theWatch livebutton at the top of this page.\n\nAnthony ZurcherNorth America correspondent, reporting from Washington National Cathedral\n\nHello from the Washington National Cathedral, which is still blanketed in snow from the winter storm earlier this week.\n\nSecurity is tight around the grounds of the building, which should be no surprise give the long list of VIPs who will be attending the memorial service for former President Jimmy Carter.\n\nThe president, the president-elect and three former presidents will be in attendance along with countless Washington politicians, policymakers and dignitaries.\n\nState funerals of this magnitude are rare in Washington  reserved for only the most solemn occasions of national mourning.\n\nIll be perched with other reporters high inside the cathedral, where Ill have an elevated, if distant, view of the proceedings. Ill report what I see as the services get under way.\n\nJimmy Carter was born in 1924 and grew up on the family peanut farm.\n\nHe entered politics and in 1970 was elected governor of Georgia, where he was a strong advocate for racial and gender equality.\n\nCarter became US president in 1977, serving one term before losing to Ronald Reagan.\n\nHe founded the Carter Center, which works to promote human rights and resolve international conflicts, for which he won the Nobel Peace Prize in 2002.\n\nCarter is survived by his four children, 11 grandchildren and 14 great-grandchildren. His wife, Rosalynn, who he married 77 years ago, died in November 2023.\n\nOnly six years after starting out in politics, Jimmy Carter, a former peanut farmer, took the highest office in the US when he was elected as the 39th president in November 1976.\n\nHe was sworn in on 20 January, 1977 in Washington DC  you can see that moment in the clip below:\n\nA state funeral in the US a highly ceremonial event that is typically reserved for a former president. These funerals are sometimes also held for high-ranking officials or military leaders, as designated by the sitting president.\n\nThey include a Lying in State period, where the body is flown into Washington DC, often aboard a military aircraft. It is kept at the Capitol Rotunda for a few days, where mourners from the public are allowed to come in and pay their respects.\n\nThis is followed by a state funeral service at the National Cathedral, where many dignitaries are often among the attendees.\n\nAfter that, the body is then transported to the chosen place of burial. In President Carters case, that chosen place is his hometown of Plains, Georgia, where he will be buried next to his wife, Rosalynn, at his familys peanut farm.\n\nAll five living US presidents are expected to attend the state funeral service for Jimmy Carter later today, with Joe Biden set to lead the tributes.\n\nBiden will be delivering the eulogy when the ceremony begins at the Washington National Cathedral, after he said Carter had asked him to give the eulogy while planning the proceedings in March 2023.\n\nBill Clinton, George W Bush, Barack Obama and Donald Trump  who takes office again in the White House this month  are also expected to be in attendance.\n\nThe state funeral service for Jimmy Carter is due to begin at 10:00 local time (15:00 GMT). Heres a look at how todays events will unfold:\n\nAfter Carters passing was announced in late December, tributes poured in for the former US president and Nobel Peace Prize, who died aged 100.\n\nPresident Joe Biden  who is also set to give a eulogy today  remembered his fellow Democrat as a man of principle, faith and humility.\n\nHe showed that we are great nation because we are a good people  decent and honourable, courageous and compassionate, humble and strong.\n\nPresident-elect Donald Trump, who previously called Carter a nice man and a terrible president on the campaign trail, struck a different tone in his tribute.\n\nThe challenges Jimmy faced as president came at a pivotal time for our country and he did everything in his power to improve the lives of all Americans, Trump said in a post on his platform Truth Social.\n\nFor that, we all owe him a debt of gratitude.\n\nOthers who remembered Carter include King Charles III, who said his dedication and humility served as an inspiration to many.\n\nI remember with great fondness his visit to the United Kingdom in 1977, the King said.\n\nFrench President Emmanuel Macron called him a steadfast advocate for the rights of the most vulnerable, while UK Prime Minister Keir Starmer said Carter redefined the post-presidency with a remarkable commitment to social justice and human rights.\n\nRead more here.\n\nAdam GoldsmithLive reporter\n\nWere restarting our live coverage, as the state funeral for former US president Jimmy Carter is due to begin in Washington in the next few hours, before he is laid to rest in Georgia.\n\nSince Tuesday, Carter has been lying in state at the US Capitol Rotunda, where thousands of mourners have visited to pay their respects following his death last month aged 100.\n\nUS President Joe Biden will deliver the eulogy at Carters funeral, which is due to begin at 15:00 GMT. All four living former presidents are also expected to attend: Bill Clinton, George W Bush, Barack Obama and Donald Trump, who takes office again in the White House this month.\n\nAfter the service, Carter will be returned to his hometown to be buried alongside his wife, Rosalynn, who died last year at age 96.\n\nWell be bringing you live text coverage from todays proceedings here, but you can also watch along by pressing theWatch livebutton at the top of this page.\n\nHello and welcome to our live video stream, which shows the ceremony of former US President Jimmy Carter as he lies in state in Washington DC.\n\nCarters body will lie in state at the Capitol for two days, during which period the public can come to pay their respects.\n\nCarter died on 29 December, aged 100, in his hometown of Plains, Georgia.\n\nA first funeral service was held for him in Atlanta on Saturday at the Carter Presidential Center, where hundreds of members of the public came to pay their respects.\n\nA state funeral will be held for the former president on Thursday.\n\nThis coverage is a live stream only and there will be no further text updates.\n\nSource:BBC\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/lllll.jpg",
            "description": "  Former President Barack Obama and President-elect Donald Trump have taken their seats in the cathedral.The pair have exchanged a few words and taken a look through the programme for the service. Silence outside cathedralpublished at 14:52 Greenwich Mean Time Iona Hampson Reporting from Washington National Cathedral On a freezing day in Washington, Jimmy Carter’s […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "NetOne commits to Zimbabwe’s Digital Revolution in 2025",
            "url": "https://www.chronicle.co.zw/netone-commits-to-zimbabwes-digital-revolution-in-2025/",
            "content": "Mthabisi Tshuma[emailprotected]AS Zimbabwes Information and Communication Technology (ICT) sector stands on the brink of transformation, 2025 is set to be a pivotal year, with state-owned telecommunications provider NetOne spearheading the countrys digital revolution.Driven by its unwavering commitment to innovation, inclusivity, and excellence, NetOne is poised to redefine Zimbabwes digital economy. The company is not just evolving; it is revolutionising how Zimbabwe connects, transacts, and thrives, with bold ambitions, cutting-edge technology, and a drive to create value for all.NetOne Group Chief Executive Officer, Engineer Raphael Mushanawani, outlined the companys ambitious vision to become a billion-dollar enterprise,while fostering a digital ecosystem that uplifts communities and accelerates economic growth.This ambition goes beyond revenue. It is about fostering a digital ecosystem that uplifts communities, accelerates economic growth, and bridges socio-economic divides.In 2025, we are delivering not just connectivity but empowerment. Our mission is to harness the power of technology to create opportunities for every Zimbabwean. From AI-driven solutions to transformative financial services, we are building a future where innovation meets inclusivity, said Eng Mushanawani.He emphasised that every milestone NetOne achieves in 2025 aligns with Zimbabwes National Development Strategy 1 (NDS1) and Vision 2030.By expanding our network into underserved areas and providing transformative digital solutions, we are actively driving the countrys socio-economic progress. Whether its empowering rural communities with connectivity, equipping schools with digital tools, or enabling businesses to thrive in a tech-driven marketplace, NetOnes contributions are tangible and transformative.Our work is deeply aligned with national priorities. As we deliver on our commitments in 2025, we are laying the groundwork for Zimbabwe to emerge as a regional leader in digital innovation and economic development, said Eng Mushanawani.NetOne Chief Commercial Officer, Learnmore Musunda, underscored the companys mission, stating:NetOne is not merely a telecommunications provider; it is the engine of Zimbabwes digital economy. This year, we are introducing solutions that will not only transform lives but also inspire confidence in the limitless potential of a connected Zimbabwe.At the heart of NetOnes 2025 strategy lies its commitment to leveraging artificial intelligence (AI) to enhance connectivity and optimise customer experiences. This technological leap is set to deliver an unparalleled level of personalisation and efficiency, redefining how individuals and businesses interact with digital platforms, said Mr Musunda.He highlighted the transformative impact of the planned ICT developments on productivity within communities.Imagine a world where farmers use AI-powered insights to improve yields, students in rural areas access real-time educational resources, and businesses streamline operations with intelligent tools. This is the future NetOne is buildinga future that is equitable, innovative, and transformative.The companys seamless network continues to provide uninterrupted connectivity, ensuring every Zimbabwean, regardless of location, can participate in and benefit from the digital economy. Upcoming 5G rollouts and enhanced network infrastructure will further solidify NetOnes position as the backbone of Zimbabwes digital transformation, said Mr Musunda.NetOnes flagship mobile financial service, OneMoney, is also playing a crucial role in promoting financial inclusivity in Zimbabwe.With new innovations set to launch in 2025, OneMoney is becoming an indispensable tool for both individuals and businesses. From enabling seamless digital payments to offering financial solutions for the unbanked, OneMoney is breaking barriers that once limited access to financial services.For small businesses, it is a lifeline; for individuals, it is a gateway to economic participation. Financial inclusion is not just a goalit is a necessity for national development. OneMoney is at the forefront of this mission, ensuring that no Zimbabwean is left behind in our journey toward a fully digitised economy, said Mr Musunda.NetOnes efforts in 2025 aim to establish Zimbabwe as a regional leader in digital innovation while contributing significantly to the nations socio-economic development.Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/pppp.jpg",
            "description": "Mthabisi Tshuma  revmmthiretshuma@gmail.com AS Zimbabwe’s Information and Communication Technology (ICT) sector stands on the brink of transformation, 2025 is set to be a pivotal year, with state-owned telecommunications provider NetOne spearheading the country’s digital revolution. Driven by its unwavering commitment to innovation, inclusivity, and excellence, NetOne is poised to redefine Zimbabwe’s digital economy. The company […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "TV model avoids jail after admitting false rape claim against AC Milan star",
            "url": "https://www.chronicle.co.zw/tv-model-avoids-jail-after-admitting-false-rape-claim-against-ac-milan-star/",
            "content": "Luisa Kremlevas lawyer called in sick at the last minute last October ahead of her scheduled trial, alleging a medical emergency and forcing a suspension as public prosecutors tried to get her jailed for two years on conviction. The Russian-born beauty opted to stay away from the court in the Costa del Sol capital of Malaga at the time so she didnt have to face waiting media.\n\nOn Thursday, court officials confirmed Kremleva had been handed a six-month suspended jail sentence and fined 1,500 after striking a hush-hush plea bargain deal with public prosecutors and admitting perjuring herself by claimingFranceinternational Hernandez, 27, raped her in the back of aPorscheoutside a Marbella nightclub.\n\nThe 28-year-old has been warned she will be made to do time if she reoffends in the next two years after being formally convicted of a crime of making a false criminal complaint. The plea bargain deal is understood to have been rubber-stamped last November following talks between her defence lawyer and state prosecutors, but it was only made public today in a five-page written sentence.\n\nKremlevas conviction brings to an end a near-seven-year saga which began on June 4, 2017. The real estate boss daughter, who forged a name for herself on Spanish TV reality and dating shows between modelling assignments, prompted a police probe by accusing Hernandez of an early-hours rape in a friends Porsche Cayenne parked outside glitzy Marbella nightclub Olivia Valere where they had both been partying.\n\nInvestigators took just two days to halt their probe after viewing CCTV car park cameras showing she had fallen to the ground accidentally instead of being pushed out of the car after forced sex as she had claimed. Police are also believed to have obtained a phone message Kremleva sent the Marseille-born footballer around 6.15am two hours after the supposed rape, asking him repeatedly when he was going to go home with her.\n\nAttacking left-back Hernandez, capped 35 times by France at senior level, was never arrested before a court dismissed her rape claim and police started preparing a case against her. She was charged with making a false criminal complaint following her arrest in January 2020 on a warrant after she failed to answer a court summons.\n\nLuisa Kremleva is the daughter of a real estate boss\n\nThe Russian-born models accusation was from 2017\n\nHer trial was delayed by a string of suspensions, including one linked to medical treatment Kremleva was thought to have been undergoing in her homeland when a previous court date was set.\n\nA public prosecution indictment submitted ahead of her scheduled trial last October and before the plea bargain deal accused her of maliciously making up the rape after consensual sex with Hernandez out of revenge for the footballer snubbing her attempts to get him to go home with her after they made out in the back of the Porsche.\n\nIn a newspaper interview after investigators dismissed her rape claims early on in their probe, Kremleva insisted: I have proof of the attack which are on my backside and knees. I would love it if Theo apologised. Its the least I deserve.\n\nHer mum, Mila, went on Spanish TV after news of her January 13, 2020 detention broke to claim: My daughter is not under arrest. She went to pick up a court notification. With time the truth is going to come out.\n\nKremleva admitted to acting maliciously in accusing Hernandez of raping her as part of the plea bargain deal she struck to lift the threat of a two-year prison sentence hanging over her head if she had decided to plead innocent and go to trial.\n\nSentencing judge Lourdes Sanchez Esquinas ruled following the TV models admission of guilt, referring to her by her first name and initials in her written sentence: It has been proven that in the early hours of June 4, 2017, the accused Luisa T.K was in the Olivia Valere nightclub in Marbella, where she had arranged to meet up with Theo H. who was in a VIP area with a group of friends.\n\nAbout 4am both left the venue with the intention of having sex. They went to the car park and in Theos friends car they had full consensual sex before returning to the nightclub. The accused subsequently tried but failed to get Theo to spend the night alone with her at her home, getting into a fight with other women who formed part of Theos group before she returned home alone without him.\n\nAbout 8am, in revenge and taking advantage of Theos fame she called police telling them she had been the victim of a rape and informed them about her intention of making a formal complaint before being taken by officers to hospital for a medical examination.\n\nOn June 4 at 5.25pm she went to a police station in Marbella and maliciously reported that after initially agreeing to sex with Theo H, she said she didnt want to continue and despite making that clear, Theo forced himself on her against her will before pushing her out of the car onto her knees and injuring her.\n\nShe unlawfully hid the fact that she had previously fallen onto the ground by accident and then again during the aforementioned fight.\n\nHernandez, who was due to give evidence at last Octobers scheduled trial, is said to be close to penning a new deal withSerie Aside AC Milan which will make him one of the highest-paid players in their squad. The star footballer played a key role in his clubs 3-2 Italian Super Cup final victory in Riyadh on Monday, scoring a goal and setting up another in their stunning comeback against city rivalsInter.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/teryt.jpg",
            "description": "TV model avoids jail after admitting making false rape claim against international footballer AC Milan left-back and France international Theo Hernandez was accused of rape by TV model Luisa Kremleva in 2017, with court proceedings coming to an end on WA TV model has been handed a suspended prison sentence and fined after admitting to […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Chigumira finds new home at Scottland",
            "url": "https://www.chronicle.co.zw/chigumira-finds-new-home-at-scottland/",
            "content": "Innocent Kurira  Online ReporterSCOTTLAND have continued with their transfer spree with the confirmation of the capture of Highlanders utility player Marvellous Chigumira.Chigumira who bade farewell to Highlanders at the end of last season had, prior to the announcement been linked with the Premiership debutants.Scottland are not done with their business on the transfer market with yet another Highlanders player Godfrey Makaruse set to be officially unveiled at any moment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ghjnm.jpg",
            "description": "Innocent Kurira   Online Reporter SCOTTLAND have continued with their transfer spree with the confirmation of the capture of Highlanders utility player Marvellous Chigumira. Chigumira who bade farewell to Highlanders at the end of last season had, prior to the announcement been linked with the Premiership debutants. Scottland are not done with their business on […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Immigration Compliance Unit arrests 3 493 at Beitbridge Border Post",
            "url": "https://www.chronicle.co.zw/immigration-compliance-unit-arrests-3-493-at-beitbridge-border-post/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHE Department of Immigrations Regional Compliance and Enforcement Unit has stated that it is not relenting in its quest to prevent criminals and illegal migrants from accessing the transformed Beitbridge Border Post.\n\nFigures from the department indicate that 3 493 people were arrested for offences related to illegal activities between Zimbabwe and South Africa from December 1 to January 7. The ongoing regional compliance operation, which is also supported by other border agencies, aims to curtail criminal activities, including border jumping and touting.\n\nOther crimes include the use of fake immigration stamps and counterfeit travel documents, which are associated with a surge in human trafficking.\n\nAssistant Regional Immigration Officer in charge of Beitbridge, Mrs Canisia Magaya, said the department is collaborating with other border agencies to minimise illegal activities at the border post. She noted that during the same period under review, 591 people had been refused entry between South Africa and Zimbabwe for various reasons. Among these were 538 Zimbabweans, 46 Malawians, two Tanzanians, two Congolese, one Ghanaian, and two Kenyans.\n\nSome of the reasons for refusal of entry include the lack of visas, unpaid fines, undocumented status, and being blacklisted as undesirable immigrants, said Mrs Magaya.\n\nWe are unwavering in our quest to maintain the safety and security of travellers and to ensure a smooth flow of traffic this festive season. Our regional enforcement and compliance efforts remain robust, and from December 1 to January 7, we intercepted a total of 3 493 individuals for violating immigration laws, handing them over to the ZRP (Police) for further management.\n\nShe said some irregular migrants were intercepted on the South African side of the border after navigating illegal crossing points along the Limpopo River. Mrs Magaya said the team is cracking down on child smuggling cases, having prevented 61 minors from being illegally transported to South Africa during the festive period. The unaccompanied minors have since been handed over to the Department of Social Development (DSD) for contact tracing and reunification with their parents or guardians.\n\nWe have deployed sufficient manpower and are targeting all known hotspots and areas, said Mrs Magaya.\n\nAt the same time, the department is urging travellers to continuously use the designated ports of entry and exit for their own safety. They should approach the immigration office should they have any questions or queries, as touts are always eager to take advantage of their lack of information on certain migration issues.\n\nThe compliance operation is ongoing, and the official said they will not give criminals any breathing space. Spot checks are being conducted at the border on vehicles and buses leaving or entering the country, as well as along major highways.\n\nThe senior immigration official advised parents to ensure their children have valid travel documents. In cases where they are not travelling with them, they need to adhere to the legal requirements necessary for such clearance. Under border regulations, children travelling with guardians should, in addition to having a valid passport, possess a copy of the childs birth certificate and affidavits from the parents granting consent for the minors to travel with them. For a single parent travelling with a child, an affidavit from the non-travelling parent is required, along with copies of the parents ID or passport.\n\nAutomation of services and the separation of traffic at the transformed Beitbridge Border Post have significantly enhanced efficiency and security systems at the countrys busiest port of entry.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Beitbridge-Border-Post.....jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE Department of Immigration’s Regional Compliance and Enforcement Unit has stated that it is not relenting in its quest to prevent criminals and illegal migrants from accessing the transformed Beitbridge Border Post. Figures from the department indicate that 3 493 people were arrested for offences related to illegal activities between Zimbabwe […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Mourners bid farewell to prominent novelist, Nkosana Moyo",
            "url": "https://www.chronicle.co.zw/mourners-bid-farewell-to-prominent-novelist-nkosana-moyo/",
            "content": "Mbulelo Mpofu[emailprotected]\n\nMOURNERS have gathered at Selborne Park SDA church to pay their last respects to late creative Nkosana Mposwa Moyo.\n\nMoyo died on Monday after a short illness. He was 85.\n\nHe was a renowned IsiNdebele novelist with titles such as, Uthando luyingozi, Ubukhosi ngamazolo, Ngakutshela, and Emgwaqweni Wemathimbeni.\n\nHe worked hand in hand with the likes of the late Pathisa Nyathi and uSlandulo.\n\nAs a thespian and actor, Moyo featured in dramas and one of the famous radio drama$ he was in was, Sakhelene zinini and he played the role of Chikwangwara.\n\nHe was also a teacher.\n\nHe is set to be laid to rest at his rural home eGwatemba tomorrow.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jik.jpg",
            "description": "Mbulelo Mpofu mbulelo.smpofu@gmail.com MOURNERS have gathered at Selborne Park SDA church to pay their last respects to late creative Nkosana Mposwa Moyo. Moyo died on Monday after a short illness. He was 85. He was a renowned IsiNdebele novelist with titles such as, Uthando luyingozi, Ubukhosi ngamazolo, Ngakutshela, and Emgwaqweni Wemathimbeni. He worked hand in […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "SAPS dismiss ritual murder claims in Limpopo Province",
            "url": "https://www.chronicle.co.zw/saps-dismiss-ritual-murder-claims-in-limpopo-province/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nSOUTH Africas police commander for Limpopo province, Lieutenant General Thembi Hadebe, has dismissed as false the claims circulating on social media that migrants (foreign nationals) are allegedly collaborating with South Africans to kill people for their body parts.\n\nAccording to the allegations, these supposed organised criminals rob vehicles and approach homes under the pretext of seeking help. Once granted entry, they reportedly kill occupants and harvest their body parts while they are still alive.\n\nIn a statement issued on Thursday, Lt Gen Hadebe condemned the rumours as baseless and untrue.\n\nOne of our biggest threats at the moment is fake news, she said. We strongly condemn the spreading of fake news, unverified information, rumours, or threats, as this causes panic, confusion, and, in some cases, incites potential violence. We urge members of the public to fact-check before sharing anything on social media platforms.\n\nLt Gen Hadebe warned that the police would arrest those found sharing inflammatory messages. She urged the public to report instances of fake news to law enforcement for prompt action against the culprits.\n\nRecently, there has been an increase in the spread of misinformation in South Africa, with some falsely attributing the countrys persistent crime issues to foreigners.\n\nAccording to the 2024 World Population Review, South Africa was ranked fifth globally for the highest crime rate, with a crime index of 75.5 per 100,000 people.\n\nThe country faces high rates of violent crimes, including assault, rape, and murder.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/bjnj.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau SOUTH Africa’s police commander for Limpopo province, Lieutenant General Thembi Hadebe, has dismissed as false the claims circulating on social media that migrants (foreign nationals) are allegedly collaborating with South Africans to kill people for their body parts. According to the allegations, these supposed organised criminals rob vehicles and approach homes […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Nqam’Ebomvu unstoppable… Shines in SA, scooping Five awards in December",
            "url": "https://www.chronicle.co.zw/nqamebomvu-unstoppable-shines-in-sa-scooping-five-awards-in-december/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nZIMBABWEAN-born Maskandi artist NqamEbomvu is making waves in South Africa, where last month he scooped five awards.\n\nNqamEbomvu (born Onesimo Tshuma) won Best Male Artist, Best Maskandi Artist, and the Top Voter Award at the Yisona iSbaya Samaciko Creativity, an organisation that seeks to promote artists based in KwaZulu-Natal. The artist also won Phakama Radio Song of the Year and Amaqhawanentaba FM Song of the Year for his track Ngisize Gologo.\n\nIn September and October, he also won several prestigious accolades, including PAA FM Best Maskandi, Amaqhawanentaba FM Best Male Artist, KZN Awards Best Male Artist, KZN Awards Best Maskandi Traditional, and KZN Most Voted Artist awards.\n\nNqamEbomvu said he is elated about these milestone achievements and expressed his gratitude to his fans for their unwavering support.\n\nI feel so happy to have excelled in my music career this past year, and I thank everyone who has supported my music from the start to where we are today.\n\nI promise to continue giving my fans good music, and they should gear up for an album titled Ufuna Kunguwe, which I am planning to drop this April, said NqamEbomvu.\n\nOriginally from Nkayi, NqamEbomvu is not only a talented musician but also a pastor at Followers of Christ Gospel Ministries in Johannesburg. By profession, he works as a truck driver and operates a drilling machine.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jjunji.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com ZIMBABWEAN-born Maskandi artist Nqam’Ebomvu is making waves in South Africa, where last month he scooped five awards. Nqam’Ebomvu (born Onesimo Tshuma) won Best Male Artist, Best Maskandi Artist, and the Top Voter Award at the Yisona iSbaya Samaciko Creativity, an organisation that seeks to promote artists based in KwaZulu-Natal. The artist also […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Watch: Evangelical Lutheran Church in Zimbabwe (ELCZ) installs new Dean",
            "url": "https://www.chronicle.co.zw/watch-evangelical-lutheran-church-in-zimbabwe-elcz-installs-new-dean/",
            "content": "Thokozile MbedziTHE Northern Deanery of the Evangelical Lutheran Church in Zimbabwe (ELCZ) of Western Diocese has welcomed and installed its new Dean, Nkosikhona Dube, during a ceremony held on Sunday.\n\nThe event, attended by congregants from Matabeleland South and North, marked the beginning of a new leadership era for the church.Outgoing Dean Thembinkosi Nsingo, who served for a decade, reflected on his tenure and offered his blessings to his successor.\n\nThe congregants are very committed and prayerful. I worked with them for 10 years and wish the incoming Dean all the best in leading the Northern Deanery to greater heights. The sky is the limit, Dean Nsingo said.\n\nHe highlighted the importance of ongoing projects and urged the church to remain proactive.As a church, we need to undertake multiple projects to advance the work of God. The incoming Dean will find strength in prayer, supported by a dedicated and faithful congregation.\n\nIncoming Dean Dube acknowledged the challenges of leadership but expressed enthusiasm for the role.As a young dean, I understand there are challenges, but I am prepared to exhaust my energy while serving the church. The congregation has entrusted me with this responsibility, and I will work tirelessly to glorify Gods work, said Dean Dube. He also pledged to build on the foundation laid by his predecessor.\n\nThe outgoing Dean has left a legacy of significant projects, and I aim to continue this progress. I will collaborate closely with committees and congregants to ensure the smooth running of church activities and the success of our initiatives.\n\nNorthern Deanery of Western Diocese Bishop, Dr Michel MS Dube, emphasised the significance of the installation ceremony.\n\nWe are gathered here to install Dean Nkosikhona Dube, as part of the leadership framework of our church. We elect a Dean every five years to oversee pastors and supervise church activities.\n\nStretching from Matabeleland South to Matabeleland North, the Deanery has vast responsibilities, and we are grateful to the Almighty for enabling this function to proceed successfully. We look forward to the new Deans leadership and the growth of our mission.\n\nBishop MS Dube gave some advice to the incoming Dean Dube saying he should be a servant of God\n\nAs you assume the office of Deanship l charge you to be a faithful servant of the lord to proclam the gospel in its purity to administer the sacrements , to provide quality leadership , guidance to the church of God and communities.\n\nThe installation ceremony underscored the churchs commitment to fostering effective leadership and advancing its regional spiritual and developmental goals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/qwert.jpg",
            "description": "Thokozile Mbedzi THE Northern Deanery of the Evangelical Lutheran Church in Zimbabwe (ELCZ) of Western Diocese has welcomed and installed its new Dean, Nkosikhona Dube, during a ceremony held on Sunday. The event, attended by congregants from Matabeleland South and North, marked the beginning of a new leadership era for the church. Outgoing Dean Thembinkosi […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        },
        {
            "title": "Auditions to revive Impumelelo Shining Stars",
            "url": "https://www.chronicle.co.zw/auditions-to-revive-impumelelo-shining-stars/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nAUDITIONS to revive Impumelelo Shining Stars, a former imbube glory, will be held tomorrow at Selborne Brook in Bulawayo, starting at 12pm.\n\nThe group, which was formed in 2001, ran for 17 years before becoming defunct as members sought greener pastures in other fields.\n\nThe auditions are open to artists from across the country, with those coming from outside Bulawayo being offered accommodation. Interested performers will also be ferried from the Large City Hall Car Park starting at 10am.\n\nThe founder of Impumelelo Shining Stars, Lungisani Costa Two Minutes Ncube, said the revival of the group aims to create formal employment opportunities for talented artists.\n\nWe will be holding auditions tomorrow to revive the group. This time around, we wont be limited to an imbube outfit but will also focus on other genres, such as rhumba.\n\nMany artists are struggling to make ends meet, and through this group, I want to support them so they can put food on the table. This initiative also aims to combat drug and substance abuse, said Two Minutes.\n\nFollow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/htrght.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com AUDITIONS to revive Impumelelo Shining Stars, a former imbube glory, will be held tomorrow at Selborne Brook in Bulawayo, starting at 12pm. The group, which was formed in 2001, ran for 17 years before becoming defunct as members sought greener pastures in other fields. The auditions are open to artists from across […]",
            "time": "20:35",
            "date": "09 Jan 2025"
        }
    ]
}