{
    "news": [
        {
            "title": "WATCH: Junior Sables beat Australia’s Outback Barbarians in Bulawayo",
            "url": "https://www.chronicle.co.zw/watch-junior-sables-beat-australias-outback-barbarians-in-bulawayo/",
            "content": "Brandon Moyoat Hartsfield Rugby Grounds\n\nZIMBABWES national mens Under-20 rugby team, the Junior Sables, staged a remarkable second-half comeback to register a six-point win over the Outback Barbarians at Hartsfield Rugby Grounds.\n\nThe Junior Sables were trailing 20-21 at halftime but managed to stick to their guns to register a 39-33-win, courtesy of a last-minute Tafara Dewa try, which was successfully converted by Tinotenda Rusike.\n\nWayne Kunaka scored the first try for the Junior Sables in the ninth minute, with co-vice-captain Rusike converting to make it 7-0.\n\nThe big Australians, playing a physical and aggressive game, responded two minutes later with a converted try.\n\nMoments later, Tinotenda Rusike nearly made a grave mistake before Shammah Jackson came to the rescue with a kick.\n\nQuick hands from the Junior Sables saw PK Manyakara beat the Outback Barbarians defence to restore Zimbabwes lead in the 22nd minute. Rusike, however, missed the conversion in front of the posts.\n\nIn the 29th minute, Kunaka played the ball on the ground for a penalty. The visitors opted to tap and managed to score a try, which was successfully converted under the posts to take a two-point lead.\n\nRusike comfortably converted a Junior Sables penalty to reclaim their lead.\n\nThe lead was short-lived, as poor decision-making from the hosts cost them. The Outback Barbarians scored their third try and successfully converted.\n\nTwo minutes before halftime, the Outback Barbarians flyhalf missed a penalty after they had decided to go for posts.\n\nA minute later, Shammah Jackson made a brilliant interception and run to score the Junior Sables third try. However, Rusike missed the conversion with the last kick of the first half.\n\nThe Barbarians scored their fourth try in the 55th minute, which was successfully converted once again to make it 20-28.\n\nImpact player Ethan Chiponda scored a brilliant try from a drop kick in the 60th minute, whose conversion, however, was missed by Phillip Chimhaka.\n\nThe miss, which would have levelled the score, left Zimbabwe trailing 25-28.\n\nFive minutes later, Chimhaka went on to score a brilliantly worked-out try, which Tatenda Kambvumbi successfully converted to make it 32-28 in favour of the Junior Sables.\n\nIn the 69th minute, the Outback Barbarians scored another try but missed the conversion to make it 32-33.\n\nIn the 77th minute, Zimbabwe missed a penalty, but a minute later, Tafara Dewa scored a try that sealed the game for the hosts. It was successfully converted by Rusike to make it 39-33.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-19-at-16.36.10-680x380.jpeg",
            "description": "Brandon Moyo at Hartsfield Rugby Grounds ZIMBABWE’S national men’s Under-20 rugby team, the Junior Sables, staged a remarkable second-half comeback to register a six-point win over the Outback Barbarians at Hartsfield Rugby Grounds. The Junior Sables were trailing 20-21 at halftime but managed to stick to their guns to register a 39-33-win, courtesy of a last-minute […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "WATCH: Junior Sables seat Australia’s Outback Barbarians",
            "url": "https://www.chronicle.co.zw/watch-junior-sables-seat-australias-outback-barbarians/",
            "content": "Brandon Moyoat Hartsfield Rugby Grounds\n\nZIMBABWES national mens Under-20 rugby team, the Junior Sables, staged a remarkable second-half comeback to register a six-point win over the Outback Barbarians at Hartsfield Rugby Grounds.\n\nThe Junior Sables were trailing 20-21 at halftime but managed to stick to their guns to register a 39-33-win, courtesy of a last-minute Tafara Dewa try, which was successfully converted by Tinotenda Rusike.\n\nWayne Kunaka scored the first try for the Junior Sables in the ninth minute, with co-vice-captain Rusike converting to make it 7-0.\n\nThe big Australians, playing a physical and aggressive game, responded two minutes later with a converted try.\n\nMoments later, Tinotenda Rusike nearly made a grave mistake before Shammah Jackson came to the rescue with a kick.\n\nQuick hands from the Junior Sables saw PK Manyakara beat the Outback Barbarians defence to restore Zimbabwes lead in the 22nd minute. Rusike, however, missed the conversion in front of the posts.\n\nIn the 29th minute, Kunaka played the ball on the ground for a penalty. The visitors opted to tap and managed to score a try, which was successfully converted under the posts to take a two-point lead.\n\nRusike comfortably converted a Junior Sables penalty to reclaim their lead.\n\nThe lead was short-lived, as poor decision-making from the hosts cost them. The Outback Barbarians scored their third try and successfully converted.\n\nTwo minutes before halftime, the Outback Barbarians flyhalf missed a penalty after they had decided to go for posts.\n\nA minute later, Shammah Jackson made a brilliant interception and run to score the Junior Sables third try. However, Rusike missed the conversion with the last kick of the first half.\n\nThe Barbarians scored their fourth try in the 55th minute, which was successfully converted once again to make it 20-28.\n\nImpact player Ethan Chiponda scored a brilliant try from a drop kick in the 60th minute, whose conversion, however, was missed by Phillip Chimhaka.\n\nThe miss, which would have levelled the score, left Zimbabwe trailing 25-28.\n\nFive minutes later, Chimhaka went on to score a brilliantly worked-out try, which Tatenda Kambvumbi successfully converted to make it 32-28 in favour of the Junior Sables.\n\nIn the 69th minute, the Outback Barbarians scored another try but missed the conversion to make it 32-33.\n\nIn the 77th minute, Zimbabwe missed a penalty, but a minute later, Tafara Dewa scored a try that sealed the game for the hosts. It was successfully converted by Rusike to make it 39-33.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Gmahe7mWEAAJCEh-680x380.jpg",
            "description": "Brandon Moyo at Hartsfield Rugby Grounds ZIMBABWE’S national men’s Under-20 rugby team, the Junior Sables, staged a remarkable second-half comeback to register a six-point win over the Outback Barbarians at Hartsfield Rugby Grounds. The Junior Sables were trailing 20-21 at halftime but managed to stick to their guns to register a 39-33-win, courtesy of a last-minute […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Binga police bust illicit alcohol ring at school Athletics event, arrest four",
            "url": "https://www.chronicle.co.zw/binga-police-bust-illicit-alcohol-ring-at-school-athletics-event-arrest-four/",
            "content": "Sikhumbuzo Moyo at Manjolo High School in Binga\n\nALERT Binga police station details have confiscated a consignment of illicit alcoholic beverages that was being sold at the National Association of Secondary School Heads Matabeleland North track and field athletics competition at Manjolo High School in Binga.\n\nThe officers who are on civilian and uniform attire also arrested four suspects, two teenagers, Twalwisi Mudenda and Virgilant Mudenda, both aged 18, a female, Yolanda Mpofu (30) and 52-year-old Moses Mudenda.\n\nGovernment has declared zero tolerance to drugs and substance abuse amid calls for custodial jail sentences for those found on the wrong side of the law.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-19-at-17.10.04-680x380.jpeg",
            "description": "Sikhumbuzo Moyo at Manjolo High School in Binga ALERT Binga police station details have confiscated a consignment of illicit alcoholic beverages that was being sold at the National Association of Secondary School Heads Matabeleland North track and field athletics competition at Manjolo High School in Binga. The officers who are on civilian and uniform attire […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Warriors bank on fan factor",
            "url": "https://www.chronicle.co.zw/warriors-bank-on-fan-factor/",
            "content": "Innocent Kurira,[emailprotected]\n\nWARRIORS utility player Jordan Zemura has called on Zimbabwean fans to come in numbers for this evenings crucial World Cup qualifier against Benin at Moses Mabhida Stadium in Durban.\n\nWith the Warriors facing a must-win scenario, Zemura highlighted the important role the fans will play in this game, especially given the teams challenging position in the group.\n\nWe urge fans to come down in their numbers and support the Warriors, said Zemura, knowing that the energy of the fans could provide the extra motivation needed to push the team to victory.\n\nWe are hoping to see you guys at the stadium. We hope for the same support as we had in Johannesburg and Polokwane, said Zemura.\n\nThey have several players enjoying good form at the different top leagues across the world including Germany, Bundesliga, which is undoubtedly one of the best leagues on the planet. You have to respect those players and the team in general, said Zemura.\n\nBoth teams are coming into the match buoyed by their successful qualification for the 2025 Africa Cup of Nations finals.\n\nHowever, with Zimbabwe sitting at the bottom of Group C with just two points from four matches, this fixture is crucial if the Warriors are to keep their World Cup dreams alive.\n\nWith only six matches remaining in the campaign, the Warriors will need to secure as many points as possible, starting with this clash against Benin.\n\nThe Warriors have reason to be optimistic, especially with the return of former captain Knowledge Musona, who is rejoining the national team after a three-year hiatus.\n\nCoach Michael Nees will bank on the likes of Zemura, Marshall Munetsi, Tawanda Maswanhise, Prince Dube and Tawanda Chirewa for this difficult task.\n\nBenin, under coach Gernot Rohr, will provide tough competition. Despite missing key players like Aiyegun Tosin and Cdric Hountondji due to injury, they still boast a strong squad. Young talents such as 19-year-old Candas Fiogb, who has been in excellent form for Atalantas U-19 team, and seasoned players like striker Steve Mouni and midfielder Sessi DAlmeida, will be crucial for Benins push for victory.\n\nAfter this game, Zimbabwe will travel to Nigeria to face the three-time African champions on March 25.\n\nThe Warriors are counting on the support of their fans home away from home to help propel them towards a vital victory.Goalkeepers\n\nWashington Arubi (Marumo Gallants), Marley Tavaziva (Brentford), Martin Mapisa (MWOS FC)Imvimbi: Jordan Zemura (Udinese), Divine Lunga (Sundowns), Gerald Takwara (Al Minaa SC), Munashe Garananga (FC Copenhagen, Isheanesu Mauchi (Simba Bhora), Peter Muduhwa (Scottland), Godknows Murwira (Scottland), Emmanuel Jalai (Dynamos)MidfieldersMarshall Munetsi (Wolves ), Andy Rinomhota (Cardiff City), Marvelous Nakamba (Luton Town), Mihood), Tawanda Chirewa (Hudders filli TScottand), Knowledge Musona (Al-Okhdood), Tawanda Chirewa (Huddersfield Town)StrikersPrince Dube (Young Africans), Tawanda Maswanhise (Motherwell), Terrence Dzvukamanja (Supersport United), Tymon Machope (Scottland), Walter Musona (Scottland)-@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/01/Untitled-74-1.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw WARRIORS utility player Jordan Zemura has called on Zimbabwean fans to come in numbers for this evening’s crucial World Cup qualifier against Benin at Moses Mabhida Stadium in Durban. With the Warriors facing a must-win scenario, Zemura highlighted the important role the fans’ will play in this game, especially given the team’s […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Consumer protection policy nears finality – Minister",
            "url": "https://www.chronicle.co.zw/consumer-protection-policy-nears-finality-minister/",
            "content": "Harare Bureau\n\nTHE Ministry of Industry and Commerce is finalising the National Consumer Protection Policy, a comprehensive blueprint meant to advance consumer rights and foster a fair marketplace, a Cabinet Minister has said.The policy builds upon the Consumer Protection Act, gazetted in 2019 and represents a significant step towards safeguarding Zimbabwean consumers from growing unethical and unfair business practices.The Act also provides for the establishment of the Consumer Protection Commission, which is already in place.Over the years, consumers have faced various challenges that include substandard goods and services and misleading marketing information.Previously, consumers suffered unjust treatment at the hands of traders or service providers due to limited knowledge about their rights and available recourse while inadequate consumer protection legislation did not help matters.The new consumer policy will address the issues, providing a robust framework for consumer protection and consumer rights enforcement.Industry and Commerce Minister Mangaliso Ndlovu said this in a speech he delivered during the World Consumer Rights Day commemorations in Harare on Monday.The Ministry of Industry and Commerce is currently in the final stages of developing a comprehensive national consumer protection policy that seeks to advance the current interests of the consumer through the enforcement of consumer rights.In this regard, the Consumer Protection Policy seeks to separate consumers from unfair and unethical business practices.In other words, business malpractices that we all get access to these days. The policy will not only protect consumers but also hold businesses accountable for their actions.It aims to promote consumer welfare by ensuring that businesses are responsible for any malpractices.This proactive approach signifies a paradigm shift towards a more transparent and equitable market, he said.The Minister said the policy would serve as the cornerstone for Government efforts to enhance consumer rights and create a more profitable marketplace.We are dedicated to establishing a framework that addresses the diverse needs of consumers, that fosters competition, and that promotes innovation, Minister Ndlovu said.The ministry acknowledges the crucial role played by various sector regulators in ensuring consumer protection.The minister said organisations such as the Postal and Telecommunications Regulatory Authority of Zimbabwe, Consumer Council of Zimbabwe, Reserve Bank of Zimbabwe, Zimbabwe Energy Regulatory Authority, Environmental Management Agency, and Common Market for Eastern and Southern Africa had been instrumental in upholding high standards and enforcing regulations.Minister Ndlovu said success in protecting consumer rights would not be possible without the collaborative efforts of the various sector regulators.These organisations have all played a crucial role in ensuring that consumers are treated with fairness and with the respect they deserve, the minister said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/Untitled-20-1.jpg",
            "description": "Harare Bureau THE Ministry of Industry and Commerce is finalising the National Consumer Protection Policy, a comprehensive blueprint meant to advance consumer rights and foster a fair marketplace, a Cabinet Minister has said. The policy builds upon the Consumer Protection Act, gazetted in 2019 and represents a significant step towards safeguarding Zimbabwean consumers from growing […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Black Diva’s “Thilo Lilo” gains momentum, hits 40 000 views ahead of debut Zim show",
            "url": "https://www.chronicle.co.zw/black-divas-thilo-lilo-gains-momentum-hits-40-000-views-ahead-of-debut-zim-show/",
            "content": "Mkhululi Ncube\n\nSouth Africa-based Leslie Black Diva Muleya, the rising star in the music scene, is set to make her mark with a show in Shangani, her hometown, on Independence Day, April 18.\n\nThe homecoming performance, promoted by Underground Entertainment, will be Black Divas first live show in the country.Its an incredible feeling to perform in my home country, in the place where I grew up. People are excited to see me live, and I cant wait to deliver an electrifying performance that theyve never seen before, she shared.\n\nBlack Diva is gaining traction with her hit single Thilo Lilo, which was released last month. Accompanied by a high-quality music video now available on YouTube, the catchy song has been making waves since its release last month. It has already surpassed 40 000 views, with fans praising both the production and Black Divas electrifying performance.\n\nAs she gears up for her debut show, Black Diva revealed that more shows are in the works, with Beitbridge, Gwanda, and Bulawayo being the next targeted locations.She said fans can expect to hear a mix of her tracks, including Why, Badgyal, Ngilombuzo, Kamuendero, Mntanami, Moses Kwamakazoita, and Ndozvaninomudira.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yhghg.jpg",
            "description": "Mkhululi Ncube South Africa-based Leslie “Black Diva” Muleya, the rising star in the music scene, is set to make her mark with a show in Shangani, her hometown, on Independence Day, April 18. The homecoming performance, promoted by Underground Entertainment, will be Black Diva’s first live show in the country. “It’s an incredible feeling to […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Armed gang shot dead by police, bought cigarettes before robbing rural grocery store in Insuza",
            "url": "https://www.chronicle.co.zw/armed-gang-shot-dead-by-police-bought-cigarettes-before-robbing-rural-grocery-store-in-insuza/",
            "content": "Raymond Jaravaza ,[emailprotected]\n\nTWO members of an armed gang bought cigarettes at a rural grocery store in Jiba Village, Insuza, Umguza District, just minutes before closing time on Monday night, only to return hours later to rob the shop and terrorise its employees.\n\nThe gang of six spent the day drinking alcohol and casing the shop before launching their attack. According to a shop employee, the two suspects purchased cigarettes around 8 PM, shortly before the store closed.\n\nThey seemed like ordinary customers at the time. Little did we know they were planning something sinister, said a shopkeeper.\n\nAfter the employees retired for the night, the gang broke into the shop, tied up the employees with an electric cable, and ransacked the place.\n\nThey were armed with pistols, knives, and axes. They demanded gold and cash, and then proceeded to take everything they could lay their hands on, said the shopkeeper.\n\nThe stolen items included an unknown amount of cash, groceries, a 48-volt lithium battery, an inverter, an amplifier, a nine-kilogramme gas tank, and cellphones. The loot was loaded into a getaway silver Honda Fit vehicle, registration number AEY 4843.\n\nThe shop owner alerted the police, who later intercepted the suspects at the toll gate along the Victoria Falls-Bulawayo Road.\n\nDetectives ordered the suspects to stop, but they opened fire, leading to a shoot-out, said national police spokesperson, Commissioner Paul Nyathi.\n\nThe suspects were confirmed dead at the United Bulawayo Hospitals.\n\nMore to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ololkhanga-.jpg",
            "description": "Raymond Jaravaza ,raymondjaravaza@gmail.com TWO members of an armed gang bought cigarettes at a rural grocery store in Jiba Village, Insuza, Umguza District, just minutes before closing time on Monday night, only to return hours later to rob the shop and terrorise its employees. The gang of six spent the day drinking alcohol and casing the […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Junior Sables coach names squad",
            "url": "https://www.chronicle.co.zw/junior-sables-coach-names-squad/",
            "content": "Brandon Moyo\n\nZIMBABWE mens national Under-20 rugby team, the Junior Sables head coach Shaun De Souza has named his starting XV for their match against Australian side, Queensland Outback Barbarians at Hartsfield Rugby Grounds this afternoon.The team was announced yesterday during a kit presentation ceremony.The hosts will be captained by Emmanuel Tawana Gabi with three co-vice-captains in Louange Ujenza Mutima, Tinotenda Rusike, and Shammah Jackson.The Junior Sables had their captains run yesterday while the Outback Barbarians held their warm up this morning.The Junior Sables have been making steady progress in their preparations for the game. Through dedicated training sessions, the team has been working on analysing their strengths and weaknesses, as well as refining their strategies. They are eagerly looking forward to the challenge of facing the Australian team and are confident in their abilities.In addition to preparing the team, efforts have also been made to ensure that the venue meets the necessary standards for hosting the teams, with collaboration from Bulawayo Metropolitan Rugby Football Board, said ZRU vice-president south Thembelani Ncube.The Junior Sables are using this match as part of their preparations for the 2025 Barthes Trophy while the Australians are on a pre-season tour of Africa.Earlier, Milton Boys High Elephants and Plumtree High School Amabhubesi faced off in a curtain raiser which the later won 7-5.In another curtain raiser, Zimbabwe women Under-20 select beat Bulawayo women under-20 select 12-7.The eagerly anticipated match is scheduled to start at 3.30pm.Junior Sables Team to face Queensland Outback Barbarians:Starting XV:Takudzwa Matsvimbo, Louange Ujenza Mutima (Co-Vice Captain), Emmanuel Tawana Gabi (Captain), Nyasha Ngwarati, Tafara Dewa, Tinashe Nyanyiwa, Pharrell Mudiwa Maziwa, Rufaro Shenje, Wayne Kunaka, Tinotenda Rusike (Co-Vice Captain), Shammah Jackson (Co-Vice Captain), Tadiwanashe Unganai, Munangi Kamwendo, PK Manyakara, Tinotenda Chinyadza.Replacements:Wayne Kuraimunashe, Kudzai Waylen Tsvakirai, Joseph Ndovorwi, Mayibongwe Ncube, Kudzai Chenda, Tatanda Kambvumbi, Tadiwanashe Maradze, Phillip Chimhaka, Tafadzwa Chataika, Shaun Kuda Ndowa, and Ethan Chaponda.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/Junior-Sables-2.jpg",
            "description": "Brandon Moyo ZIMBABWE men’s national Under-20 rugby team, the Junior Sables’ head coach Shaun De Souza has named his starting XV for their match against Australian side, Queensland Outback Barbarians at Hartsfield Rugby Grounds this afternoon. The team was announced yesterday during a kit presentation ceremony. The hosts will be captained by Emmanuel Tawana Gabi […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Tanga WekwaSando tightens control over music usage, demands clearance",
            "url": "https://www.chronicle.co.zw/tanga-wekwasando-tightens-control-over-music-usage-demands-clearance/",
            "content": "Showbiz Reporter\n\nWake hit-maker, Tanga WekwaSando has announced a new policy regarding the use of his music, stressing the need for proper clearance.\n\nThrough the Zimbabwe Music Rights Association (Zimura), Tanga, best known for his distinctive blend of Afro-fusion and traditional music, has informed cover bands, promoters, event organisers, and corporates that they must seek written permission before using his songs in any performance or event.\n\nA statement issued by Zimura today stated: This official communication serves to inform all cover bands, promoters, event organisers, conference organisers, and corporates that permission to cover or perform Tanga Wekwa Sandos songs will only be granted through a written permit from Tanga Wekwa Sando or his authorised representatives.Alternatively, you may negotiate with Zaggamusik, a record label owned by Tanga Wekwa Sando, to obtain an arrangement or agreement to cover his music.\n\nThe statement ended with a clear warning: All cover bands are strictly forbidden from performing Tanga Wekwa Sandos music without his explicit authority. By order of Tanga Wekwa Sando.\n\nThis development comes at a time when Zimura is already facing criticism from local artistes, particularly those who perform cover songs, as the association has announced that a licensing fee of $150 is now required to perform cover versions of songs at events.\n\nThis move by Tanga WekwaSando is significant for the Zimbabwean music industry, as it underscores the need for musicians to take control of their intellectual property and protect their creative work. By enforcing stricter regulations on the use of his music, Tanga is sending a message to other Zimbabwean artistes about the importance of valuing their craft and asserting ownership over their creations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yujhnb.jpg",
            "description": "Showbiz Reporter Wake hit-maker, Tanga WekwaSando has announced a new policy regarding the use of his music, stressing the need for proper clearance. Through the Zimbabwe Music Rights Association (Zimura), Tanga, best known for his distinctive blend of Afro-fusion and traditional music, has informed cover bands, promoters, event organisers, and corporates that they must seek […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        },
        {
            "title": "Awa Khiwe, Don Dada of Ndebele rap, readies album . . . teaser drops tomorrow",
            "url": "https://www.chronicle.co.zw/awa-khiwe-don-dada-of-ndebele-rap-readies-album-teaser-drops-tomorrow/",
            "content": "Mbulelo Mpofu\n\nRap queen Awa Khiwe, who captivated audiences with her hit single Rap Gandaganda last year, is gearing up to release an album next month. Fans can expect a teaser tomorrow, offering a glimpse into what promises to be a powerful project.\n\nThe album, produced by Outhere Records, a label for African music, has been in the works for some time, and Awa is eager for the world to hear it.I have been working on this album with Outhere Records for a while now, and Im excited to finally share it. I poured my heart and soul into this piece of art, and I cant wait for you guys to hear it, she said.\n\nSet for release on April 11, 2025, the album will be available on all major streaming platforms.\n\nIn the meantime, Awa has a special treat for her fans.While we wait for the album to drop, Ghanaian Stallion and I have a surprise for you tomorrow. A huge thanks to Lomedy Mhako for the beautiful artwork, she said.\n\nIn addition to her album release, Awa Khiwe is also rumoured to be performing at the upcoming Swan Music Festival, set to take place at White City Stadium in Bulawayo on March 29. With the festival set to bolster its line-up, it boasts of an already impressive line-up, featuring recently-split South African Amapiano duo, Murumba Pitch, Insimbi ZeZhwane and Iyasa. Awa Khiwes performance at the Swan Music Festival would mark a triumphant return to her Zimbabwean roots.\n\nSince launching her career in 2012, Awa Khiwe has carved a unique space in the music scene, seamlessly blending Hip-Hop with the depth of her IsiNdebele heritage. Her performances are more than just electrifying displays  they serve as platforms for storytelling, tackling pressing social issues such as gender-based violence and child marriage. With her signature rapid-fire delivery in IsiNdebele and English, Awa Khiwe continues to push boundaries, using her music as a tool for education, empowerment, and cultural pride.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/olkhj.jpg",
            "description": "Mbulelo Mpofu Rap queen Awa Khiwe, who captivated audiences with her hit single Rap Gandaganda last year, is gearing up to release an album next month. Fans can expect a teaser tomorrow, offering a glimpse into what promises to be a powerful project. The album, produced by Outhere Records, a label for African music, has […]",
            "time": "21:07",
            "date": "19 Mar 2025"
        }
    ]
}