{
    "news": [
        {
            "title": "SADC, EAC unite to restore DRC stability",
            "url": "https://www.chronicle.co.zw/sadc-eac-unite-to-restore-drc-stability/",
            "content": "Fungi Kwaramba in DAR ES SALAAM, Tanzania\n\nSADC Chairperson President Mnangagwa will today chair a joint summit of SADC and the East Africa Community (EAC) along with EAC Chairperson Kenyan President William Ruto, to persuade all involvevd in the Democratic Republic of Congo conflict to lay down arms and return the eastern parts of the resource-rich country to normalcy.\n\nThe President, who arrived here yesterday, will be leading the SADC Double Troika for the crucial indaba with their EAC counterparts in a unique and extraordinary summit that brings all parties involved in the decades-old conflict to the same table.\n\nTodays meeting was preceded by a joint meeting of Councils of Ministers from SADC and the EAC which discussed the deteriorating security situation in Eastern DRC, where rebels have gained a foothold, leaving an estimated 2 000 people dead and thousands more displaced.\n\nThe Joint SADC-EAC Meeting of Ministers was co-chaired by Zimbabwes Foreign Affairs and International Trade Minister Professor Amon Murwira and Kenya Prime Cabinet and Secretary for Foreign and Diaspora Affairs Dr Musaila Mudavadi.\n\nProffessor Amon Murwira\n\nProf Murwira said the joint effort involving Southern Africa and East Africa underlines the importance of joint political and diplomatic efforts for normalcy to prevail in the Eastern DRC.\n\nIt is regrettable that the security and humanitarian crisis in Eastern DRC continues to deteriorate despite the noble efforts through the Luanda and the Nairobi (peace) processes.\n\nIt is heart-breaking that around 400 000 people have been displaced in the city of Goma, this year alone, said Prof Murwira.\n\nDRC President Felix Tshisekedi, Rwanda President Paul Kagame, Tanzanian President Samia Suluhu Hassan, South Africa President Cyril Ramaphosa, Ugandan President Yoweri Museveni and Somalian President Hassan Sheikh Mohamud are all expected to attend todays make-or-break talks.\n\nPresident Flix Tshisekedi\n\nSADC has 16 members and the EAC has eight but DRC, which has been plagued by conflicts for years now, is along with Tanzania a member of both blocs.\n\nRwanda, which is accused by the DRC of backing the M23 rebels that have taken key towns in Eastern DRC, is a member of EAC. Rwanda stridently denies sponsoring renegades in its neighbouring country.\n\nYesterday, SADC Executive Secretary Mr Elias Magosi hailed the convening of the Joint Meeting of SADC and EAC as a vital step in the spirit of solidarity and collaboration between members of SADC and EAC in finding a lasting solution to the security situation in the DRC.\n\nThe Joint SADC-EAC Summit will be held in fulfilment of the decision of the Extraordinary Summit of SADC Heads of State and Government of January 31 in Harare, where the summit assessed the precarious and fast-evolving security situation in the Eastern DRC, and called for an immediate joint Summit of SADC and EAC to find the best way forward, and a collective approach to the security situation in the DRC.\n\nSilencing the Guns is a key initiative within the African Unions (AU) Agenda 2063, a long-term plan aiming to achieve peace and sustainable development across the continent by 2063, to end all wars and violent conflicts in Africa by addressing the root causes of conflict and promoting dialogue-based conflict resolution mechanisms; essentially, its a flagship project within Agenda 2063 focused on creating a peaceful Africa through conflict prevention and resolution.\n\nFurther, the summit urged political and diplomatic leaders engaged in the conflict to collaborate in a unified dialogue effort.\n\nThis includes backing the Luanda Process and the United Nations Organisation Stabilisation Mission in the DRC (MONUSCO) to help restore peace and security in Eastern DRC.\n\nBoth the African Union and the United Nations have called for a peaceful resolution to the conflict in DRC, which threatens to throw the whole of the Great Lakes region into a wider conflagration.\n\nAhead of the joint summit, President Mnangagwa has said he is determined to ensure that guns are silenced in the region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/89f7f7f67.jpg",
            "description": "Fungi Kwaramba in DAR ES SALAAM, Tanzania SADC Chairperson President Mnangagwa will today chair a joint summit of SADC and the East Africa Community (EAC) along with EAC Chairperson Kenyan President William Ruto, to persuade all involvevd in the Democratic Republic of Congo conflict to lay down arms and return the eastern parts of the […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "‘Headmaster’ clocks 51 years at Ingutsheni Hospital",
            "url": "https://www.chronicle.co.zw/headmaster-clocks-51-years-at-ingutsheni-hospital/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHEY say real life begins at 40 but for a 91-year-old Ingutsheni Central Hospital patient, whom hospital staff have named Headmaster, that was the time he began his 51-year odyssey of solitude at the institution.\n\nLight in complexion and still looking sharp despite having difficulties speaking, Headmaster (his real name known but protected), was brought into the institution on August 29, 1974, by his parents who said he tended to wander about aimlessly and sometimes being violent to anyone he came across.\n\nThat was the last time he was in the company of his parents. Yet, according to hospital staff, Headmasters records show that he is from Mzilikazi suburb in Bulawayo.\n\nHe is now the longest-staying patient at the institution without any visitor after a 104-year-old immigrant worker who died in June last year spent 68 years.\n\nHeadmaster\n\nThe late immigrant worker is still awaiting a paupers burial, eight months after his death. His body is at the United Bulawayo Hospitals.\n\nSaturday Chronicle visited Ingutsheni Central Hospital this week and spoke to the institutions professional and friendly staff, led by the Clinical Director, Dr Wellington Ranga.\n\nThe interview was held at the hospitals public relations office, led by Vongai Chimbindi with Remekedzo Mufuka from the Department of Social Work, also present.\n\nDr Ranga said there seems to be some stigma at being associated with Ingutsheni Hospital in one way or the other.\n\nThis is why we even have taxis servicing the Mpilo and UBH routes but you never hear touts calling out for passengers going to Ingutsheni. Its because people somehow dont want to associate themselves with the institution yet its just a hospital where unwell people get treated, said Dr Ranga.\n\nThe news crew was taken through the process of how a patient is admitted until discharged.\n\nPeople with mental health challenges cant be admitted on their own, their admission has to be confirmed by other people who are independent from us.\n\nWhen you get a mental health challenge, you dont have insight into what will be happening to you. So, most people with mental health issues deny that they have got a problem, said Dr Ranga.\n\nRemekedzo Mufuka\n\nThe patient goes through what we call certification, where other independent people check you, confirm, and concur that there is a mental health issue. This has to be done at a different health facility, not here. A form is then completed, and the people accompanying the patient have to also consent, he added.\n\nDr Ranga said the discharge process starts at the point of admission because someone has to get the patient admitted and when one is set for discharge hospital staff check who got them admitted so that they are informed about the impending discharge and they come to the hospital to collect their relative.\n\nWhen the patient goes home, its not a discharge straight away, there is a process we call leave of absence, remember mental health issues are not predictable hence we give patients the benefit of the doubt to go home and see if they can fit into the environment so that relatives also assess and see if they are comfortable. If there is a challenge, the patient can always be brought back, said Dr Ranga.\n\nAs you probably would know, when people come to Ingutsheni Hospital, it is the last resort, they would have tried everything and their patience would have been stretched to the limit.\n\nSo, they come with that mentality and that is what we get from a good number of people who bringtheir relatives here and after that, they vanish into thin air.\n\nDr Ranga emphasised that no one is released on their own, regardless of whether the patient knows where they stay because some people would either give the wrong contact details or choose not to come and collect their relatives who would have been certified fit to go home.\n\nIn such scenarios, he said staff from the Department of Social Work visit the concerned relatives. However, there seems to be a stigma associated with any interaction with Ingutsheni Hospital.\n\nSome patients can give you the correct address and that is when the home visit comes in where we do a home assessment and also try and understand why they came to dump their relative at the hospital and sometimes why they didnt visit the patient, he said. What generally causes relatives not to come back is that they dont have insight into what the patient will be going through because, in their minds, they will be still seeing someone who did horrible things, which may even include rape or murder before they brought him to Ingutsheni Hospital. Yet the person would have changed, said Mufuka.\n\nShe said mental illness can be like any other disease just as someone may get into a hospital suffering from malaria but cant be ill perpetually as they will be treated hence the reason they came to the hospital.\n\nMrs Vongai Chimbindi\n\nIngutsheni Central Hospital public relations officer, Chimbindi, said some of the patients who have not had visitors are those who were immigrants working on farms and after the farm owners left, they were left with no one to look after.\n\nSome of course are considered outcasts either by the family or the community for varying reasons, which may include but not necessarily so, what they may have done as a result of their mental condition, said Chimbindi.\n\nAt the St Lukes Psychogeriatric Ward, where Headmaster stays, there is a former guitarist with a renowned music group whose songs illuminated the music industry in the 1980s until the early 90s, as well as a former magistrate.\n\nIngutsheni Hospital was established in 1908 as an asylum where prison guards were the original caregivers. In the 1940s psychiatry services were established but the services were racially biased and at independence radical changes were made.\n\nThe female ward-St Marys 1 carries a significant number of substance use patients as well as victims of substance use including survivors of gender-based violence and sexual assault.\n\nThe major substances used include alcohol, cannabis, crystal meth, and cough mixtures. The other wards are also occupied by patients who developed chronic illnesses, which were complicated by substance use and these are Mzilikazi 2 and Dawson Ward.\n\nThe Mambo Ward is occupied by patients who committed serious crimes like murder and rape whilst mentally ill (including substance use-related crimes).\n\nThose at Mambo Ward are a danger to society and their families are not keen to receive them back and are thus kept for life.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/cvbgnbnbcvbnbn.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THEY say real life begins at 40 but for a 91-year-old Ingutsheni Central Hospital patient, whom hospital staff have named ‘Headmaster’, that was the time he began his 51-year odyssey of solitude at the institution. Light in complexion and still looking sharp despite having difficulties speaking, Headmaster (his real name known but protected), […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "ZC chief slams ‘unfair’ World Test Championship exclusion",
            "url": "https://www.chronicle.co.zw/zc-chief-slams-unfair-world-test-championship-exclusion/",
            "content": "Brandon Moyo,[emailprotected]\n\nAmid growing calls for the International Cricket Council (ICC) to ensure an inclusive bilateral programme for all Full Members, Zimbabwe Cricket (ZC) chairperson Tavengwa Mukuhlani has criticised the current World Test Championship (WTC) cycle.\n\nZimbabwe, along with Afghanistan and Ireland, are the only three Test-playing nations excluded from the WTC, three cycles into its format. Only nine Full Members participate, with no explanation given for the omission of the other three.\n\nRecent months have seen calls for the ICC to introduce a two-tier Test system, allowing for promotion and relegation, creating a pathway for other teams to compete against the elite.\n\nThe proposed second tier would include Zimbabwe, Afghanistan, Ireland, West Indies, and Bangladesh, while the leading boards  India, Australia, England, South Africa, Pakistan, New Zealand, and Sri Lanka  would compete in the top tier. However, this proposal has also faced scrutiny.\n\nMany teams have been denied opportunities to play regular Test cricket, with the big three  India, Australia, and England  enjoying significantly more game time. They frequently play five-match series against each other, while some teams are limited to two-match series.\n\nMukuhlani, speaking to ESPNcricinfo, believes the current set-up is unfair and contradicts the logic of Full Membership.To be a Full Member, you must play all three formats. That is an eligibility criterion. So, every member must have an equal and fair opportunity to play all three formats, without discrimination. The current set-up negates the purpose of being a Test-playing Full Member, said Mukuhlani.\n\nIntegration of Zimbabwe, Afghanistan, and Ireland into the WTC cycle can only happen after the current ICC Future Tours Programme (FTP) concludes in 2027.\n\nSince 2020, Zimbabwes Test cricket activity has been minimal, averaging just two Tests a year. However, the current FTP schedules nine Tests for Zimbabwe this year. They have already played two: a New Years Day Test against Afghanistan and the ongoing Test against Ireland.\n\nTavengwa Mukuhlani\n\nFollowing the Ireland Test, the Chevrons travel to England for a one-off four-day Test from 22 to 25 May, their first visit to England since 2003.\n\nAfter England, Zimbabwe will host South Africa for a two-match Test series in June, their first against the Proteas in eight years, since a day/night pink-ball Boxing Day Test in Gqeberha in 2017.\n\nThe ZC boss expressed satisfaction with the growth of the domestic set-up, evidenced by the increasing number of overseas players participating. Will Fraine (Tuskers) and Alex Russell (Eagles), both English nationals, are among those playing in the current Logan Cup and Pro50 Championships.\n\nWhile praising domestic structures, Mukuhlani lamented the talent drain, where players representing Zimbabwe at age-group level subsequently move abroad, often attracting interest from those countries while at university.Mukuhlani argued that the receiving board should compensate Zimbabwe for the development work invested in these players.\n\nOur five-team Logan Cup is improving every season and attracting foreign players. But our biggest challenge, and one we have faced before, is that our good players, who we could bring into the Zimbabwe national set-up, end up mainly in England, but also in other countries.\n\nIf a player has represented a nation at Under-19 level, particularly in a World Cup team, and then switches citizenship, the receiving board must pay us for development. It cannot be free, said Mukuhlani.\n\nNotable examples include Garry Ballance, who moved to England before returning to Zimbabwe in 2023, and Colin de Grandhomme, who moved to New Zealand. Ballance represented Zimbabwe at the 2006 Under-19 World Cup, and de Grandhomme at the 2004 World Cup.-@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/sryjh.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com Amid growing calls for the International Cricket Council (ICC) to ensure an inclusive bilateral programme for all Full Members, Zimbabwe Cricket (ZC) chairperson Tavengwa Mukuhlani has criticised the current World Test Championship (WTC) cycle. Zimbabwe, along with Afghanistan and Ireland, are the only three Test-playing nations excluded from the WTC, three cycles […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "ZIPRA braveheart Chigudu declared national hero",
            "url": "https://www.chronicle.co.zw/zipra-braveheart-chigudu-declared-national-hero/",
            "content": "Zvamaida Murwira,Harare Bureau\n\nFormer Zanu-PF provincial chairperson for Manicaland and career civil servant, Cde Tinaye Elisha Nzirasha Chugudu who died on Wednesday, has been declared a national hero in honour of his contribution before and after independence.\n\nPresident Mnangagwa has since sent a message of condolence to the Chigudu family and described him as a principled man.\n\nZanu PF Politburo member, Cde Supa Mandiwanzira was dispatched by the President yesterday to deliver the message of the decision by the party to declare Cde Chigudu a national hero.\n\nHe delivered the message to mourners gathered at his Mount Pleasant residence in, Harare yesterday.\n\nCde Mandiwanzira was accompanied by the partys Central Committee member, Dr Jenfan Muswere, who is also Information, Publicity and Broadcasting Services Minister and Makoni West legislator.\n\nFormer legislator for Buhera North and Zanu PF Central Committee member, Cde Willian Mutomba, was among those at the funeral wake.\n\nIn his condolence message, President Mnangagwa said Cde Chigudu demonstrated bravery when he became one of the first cadres to be trained to fight in the liberation struggle.\n\nI received with deep sorrow and sadness, news of the untimely death of Cde Tinaye Elisha Nzirasha Chigudu, a veteran of our liberation struggle, former Permanent Secretary in the Ministry of Home Affairs, former Governor of Manicaland Province and former ZANU PF Manicaland Provincial Chairman, he said.\n\nCde Chigudu was among the brave sons and daughters of the soil who took a stand and fought for the Independence of Zimbabwe.\n\nHe was one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZIPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU).\n\nPresident Mnangagwa added that Cde Chigudu demonstrated his bravery when he was deployed as an intelligence operative in the then Salisbury. The critical information he gathered regarding the modus operandi of the racist Rhodesian forces assisted the guerilla operations and recruitment of young Zimbabweans for guerilla training.\n\nCde Chigudu, said President Mnangagwa, was arrested and imprisoned for 12 years for his revolutionary role.\n\nAs he pursued the important mission, Cde Chigudu was captured and imprisoned for 12 years by the Rhodesian regime. After his release from prison, Cde Chigudu crossed into Zambia, reunited with his fellow comrades and resumed his duties and chores of the armed war of liberation. Cde Chigudu was a principled cadre who served the ruling ZANU PF Party and the Government with unquestionable allegiance, loyalty and dedication, he said.\n\nPresident Mnangagwa described him as a fountain of wisdom who offered wise counsel and advice in conducting both party and Government business, drawing from his vast experiences.\n\nOn behalf of the party, ZANU PF, Government, my family and on my behalf, I wish to express my deepest, heartfelt condolences to the Chigudu Family on this sad loss.\n\nMay the family derive comfort from the contribution he made to this great nation. In recognition of his immense contribution to our nation, both before and after Independence, the ZANU PF Politburo agreed to accord him the status of national hero. May his dear soul rest in eternal peace, said President Mnangagwa.\n\nPresident Mnangagwa\n\nIn his message to mourners yesterday, Cde Mandiwanzira, who is also Nyanga South legislator, said there was unanimity among Politburo members when the issue of the hero status of Cde Chigudu came up for discussion.\n\nI have come here with a message from His Excellency, President Mnangagwa, who said he was deeply touched by the death of Cde Chigudu. He said Cde Chigudu ought to be conferred with the highest honour of a national hero owing to his contribution.\n\nWhen President Mnangagwa consulted his colleagues, there was unanimity that he deserved to be a national hero, said Cde Mandiwanzira.\n\nHe said Cde Chigudu remained principled and never wavered up until the end.\n\nUnlike cadres who made huge contributions but later deviated from the ethos of the liberation struggle, Cde Chigudu remained steadfast, said Cde Mandiwanzira.\n\nCde Chigudus brother, Mr Tafiramambo Chigudu, said the family felt humbled by the decision of the party and Government to confer their relative the highest honour.\n\nI want to thank the President, the party and the Government for the honour conferred on our relative.\n\nWe do not take this honour for granted because not every person is granted that honour. We are elated as a family, said Mr Chigudu.\n\nIn an interview, his widow, Mrs Ester Chigudu, described him as a loving husband and father.\n\nHe helped a lot of people in the family even within the extended family. His death is quite painful. He has been unwell for a long time, she said.\n\nHis daughter, Rudo, said her father was determined to see them prosper and do well in education.\n\nCde Chigudu was born on August 13, 1942. He had his early education at Chigudu School, Cyrene Mission and Harare Secondary School where he was expelled in 1964 because of his political activism.\n\nHe left the country in 1964 and went to Zambia under ZAPU. He then trained guerilla warfare in the Democratic Republic of Korea as a ZIPRA cadre.\n\nUpon his return he was deployed in the country as an intelligence officer. In May 1965, he was captured and detained in Gonakudzingwa, Gweru and finally Whawha.\n\nHe was in detention for 12 years and was released in 1977 and exiled. He went to the UK and was enrolled at Exeter University where he studied law between 1978 and 1981.\n\nOn coming home, he joined the civil service, first as under Secretary (Legal Affairs) Ministry of Transport from 1981. He was appointed Deputy Secretary for the Ministry of Home Affairs and then Permanent Secretary in the same Ministry from 1994 to 2004.\n\nHe later became Permanent Secretary for Mines and Mining Development from 2004 to 2005. He was then appointed Governor and Resident Minister of Manicaland in 2005 and retired in 2008.\n\nHe is the former ZANU PF provincial chairman of Manicaland and worked as a senior consultant under the United Nations Development Programme to structure the Ministry of Interior for South Sudan.\n\nAt the time of his death, he was farming in Makoni District.\n\nHe is survived by his wife, Mrs Esther Chigudu and seven children.\n\nMourners are gathered at Number 9, Belsize Close, Northwood, Mount Pleasant in Harare.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/JBNJMCGMJMN.jpg",
            "description": "Zvamaida Murwira, Harare Bureau Former Zanu-PF provincial chairperson for Manicaland and career civil servant, Cde Tinaye Elisha Nzirasha Chugudu who died on Wednesday, has been declared a national hero in honour of his contribution before and after independence. President Mnangagwa has since sent a message of condolence to the Chigudu family and described him as a […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Clean water for  100 000 rural homes",
            "url": "https://www.chronicle.co.zw/clean-water-for-100-000-rural-homes/",
            "content": "Chronicle Writer\n\nOVER 100 000 rural households across the country now have access to clean and safe water since the launch of the Presidential Rural Development Programme in December 2021.\n\nThe households benefit from communal water points established as part of village business units (VBUs) and water reticulation systems installed by the Zimbabwe National Water Authority (Zinwa) under the programme. Each communal water point or reticulation system serves an average of 60 to 100 households.\n\nThe scheme, which was launched by President Mnangagwa at Sekusile-Makorokoro nutrition garden in Jinjika Village, Makorokoro area of Mangwe District, Matabeleland South Province, has helped uplift livelihoods in rural communities through the creation of employment opportunities for women and youths, among other vulnerable members of society.\n\nUnder the Presidential Rural Development Programme, the Government is in the process of drilling and equipping one borehole in each of the countrys 35 000 villages, 9 600 schools, and 4 500 youth centres.\n\nEach village is also being empowered with a nutrition garden with a wide range of fruit trees and sweet potato vines being distributed to households.\n\nIn a statement,Zinwas head of corporate communications and marketing, Mrs Marjorie Munyonga said by January 28, a total of 1 846 communal water points had been successfully established, each providing safe potable water to between 60 and 100 households.\n\nThe 1 846 communal water points were established, either as part of village business units (VBUs) or as stand-alone solar powered water points, she said.\n\nThe Presidential Rural Development Programme aims to provide rural communities with safe potable water as both a constitutional right and a resilience mechanism against climate change.\n\nCommunities in Matabeleland South are also accessing safe water from 51 points and a further 30 communal water points forming part of the business units in the province.\n\nThe Midlands Province has 117 solar equipped water access points and a further 45 communal water points established as part of business units while Harare Province has a total of 83 water access points installed under the programme.\n\nIn Mashonaland Central, there are 58 water reticulations and 68 communal water points established as part the VBUs whereas Mashonaland West has 38 water reticulations systems and 39 more communal water points attached to fully set up village and school business units. In Mashonaland East Province 106 community water points are in place in addition to the 60 communal water points which are part of village and school business units.\n\nAs for Matabeleland North Province 97 standalone communal water points are providing clean water to villages while there are also 38 more communal water points situated at village business units in the province, said Mrs Munyonga.\n\nManicaland has 108 communal water points which also add to the other 48 communal water points that are part of the business units in the province while in Masvingo there are 153 water access points and a further 100 which form a component of the established business units.\n\nMrs Munyonga said Bulawayo Province has 65 solar-powered water access points established under the programme.\n\nThese interventions have ushered in serious relief to the beneficiary rural communities, especially those in the dry provinces where people would travel as long as 15 kilometres in search of water with children sometimes having to miss school to fetch water for family requirements, she said.\n\nMrs Munyonga said the Presidential Rural Development programme has also improved the lives of women and girls, who are largely responsible for fetching water in rural communities, exposing them to sexual and gender-based violence.\n\nUnder the programme, Zinwa, which is responsible for infrastructure development, is set to drill and equip a borehole in each of the countrys 35 000 villages and a borehole for each of the 9 600 schools and 4 500 youth centres by the end of the programme, she said.\n\nThese boreholes form the anchor infrastructure for the establishment of village, school, youth and vocational training centre business units whose components typically include a solar-powered borehole, water storage tanks, a one-hectare drip technology horticulture project, a communal water point and two fishponds.\n\nThe business units are run on sound commercial lines with beneficiaries being both shareholders and employees of the village business units.\n\nThe Agricultural and Rural Development Authority (Arda) has the responsibility of registering the business units as formal companies, overseeing their day-to-day management and ensuring that they are operated viably.\n\nThe Agricultural Marketing Authority develops the business case for the business units and secures ready markets for the produce from the village business units while the Agricultural Finance Corporation provides funding.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/FGNVNFFGBVBV.jpg",
            "description": "Chronicle Writer OVER 100 000 rural households across the country now have access to clean and safe water since the launch of the Presidential Rural Development Programme in December 2021.  The households benefit from communal water points established as part of village business units (VBUs) and water reticulation systems installed by the Zimbabwe National Water […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Why women do not report battering",
            "url": "https://www.chronicle.co.zw/why-women-do-not-report-battering/",
            "content": "Fredrick Qaphelani Mabikwa\n\nIN my last two articles, I have examined the cultural and general drivers of wife-beating in Zimbabwe. Having suffered physical abuse, it is both surprising and concerning that some women do not take legal action against their partners or husbands. Some women will choose to confide in a friend, but will not report the matter to the family elders or the police. Below are some reasons why many women do not report abuse.\n\nSome women still hold onto outdated beliefs. They consider beating to be a part of marriage and do not see anything wrong with it. They may even become anxious if their husband does not beat them for a long time, as they see it as a sign that he no longer cares for them.\n\nThese are often women who come from backgrounds where they were socialised to believe that no matter how unbearable a marriage becomes, one must endure, as that is the supposed nature of marriage. They grew up in families where abuse was considered normal, making it difficult for them to recognise when a relationship becomes toxic. These women suffer in silence.\n\nAt times, they may even think that it is their fault they were beaten  they must have deserved it.Some women do not report physical abuse due to economic reasons. Some battered women are entirely dependent on their husbands financially. The husband is the sole breadwinner in the family, and his imprisonment would mean no rent, no food, and no school fees for the children.\n\nThere is also fear that even if he is jailed for a short time and is released, he may not be able to get his job back. The woman has no other means of survival and feels she has no choice but to remain silent and endure, or risk becoming destitute. In some cases, it is not just economic dependency, but also sympathy for her husband. She fears that she will ruin his life, as he is a respected professional and may be deregistered by the relevant authorities if he acquires a criminal record.\n\nMy husband is a lawyer; what will happen to his career if he gets a criminal record? she might ask.In some cases, women are threatened with consequences if they report. Threats of having their children taken away from them are made, as well as threats of further physical harm. At times, some women even receive death threats if they dare go to the police or tell anyone about the abuse. They fear for their own life and the safety of their children. They are willing to sacrifice their own safety to protect their childrens well-being, so that they do not grow up in poverty or without a father.\n\nFear of family and community plays a significant role in why women do not report abuse. They fear the judgement of their husbands family, who may question her decision to report their son. The husbands family would likely assume that she provoked the abuse and deserved it, and they would insist that their son is a good husband, pushed too far. She may also fear the wrath of her husbands siblings, who could be hostile toward her for reporting their brother.\n\nShe would also be afraid of her in-laws accusing her of dishonouring their child. This is a major fear, as it could damage her relationship with them permanently, regardless of the outcome of the reporting.\n\nSome women do not report because everyone around them thinks the abuser is a good guy, and she is embarrassed, knowing that no one would believe her. She realises that family, friends, and the community would likely not support her. At times, she may even blame herself because she is told it is her fault and that she deserved the beating. In certain situations, she may not report because she genuinely loves him and believes he regrets his actions. Every time it happens, he apologises and promises it will never happen again.\n\nThe woman wants him to change and gives him another chance. So, the husband is given a last chance time and again. If the beatings are triggered by alcohol consumption, she convinces herself that it is the alcohol that causes the violence. She resolves to help him control or stop drinking. She will endure the punches quietly, hoping to make the relationship work and help him change.\n\nRather than asking why isnt she reporting? or why doesnt she just leave?, we should ask different questions when we read about physical abuse. We should ask, why is he abusive?, how can we break the cycle of abuse?, or how can I support her to be safe? Some women find the courage to take action against their husbands because they do not want their children to grow up in an abusive environment. They firmly believe that battering is criminal behaviour that must be punished by law.\n\nWhile it may be difficult for a woman to report physical abuse, it may be worthwhile to have a violent man charged by the police. Taking legal action and following through, despite community and gender-based pressures, may be the only way for women to persuade abusive men and the justice system that they will not tolerate violence\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2012/09/man%20beats%20up%20wife2.jpg",
            "description": "Fredrick Qaphelani Mabikwa IN my last two articles, I have examined the cultural and general drivers of wife-beating in Zimbabwe. Having suffered physical abuse, it is both surprising and concerning that some women do not take legal action against their partners or husbands. Some women will choose to confide in a friend, but will not […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "COMMENT:  Rural areas blossom with success of water programme",
            "url": "https://www.chronicle.co.zw/comment-rural-areas-blossom-with-success-of-water-programme/",
            "content": "SINCE its launch in December 2021, the Presidential Rural Development Programme has proven to be a game-changer for rural Zimbabwe, providing over 100000 households with access to clean and safe water.\n\nThis significant step forward is addressing the long-standing water challenges that rural communities have faced for years, offering much-needed relief and creating an opportunity for long-term economic and social transformation.\n\nPresident Mnangagwas initiative, which was introduced at Sekusile-Makorokoro in Mangwe District, has brought not only the provision of water but also a comprehensive approach to rural development. This initiative links the provision of clean water to local economic growth, benefiting vulnerable groups and enhancing climate resilience.\n\nCentral to the success of this programme are the communal water points and water reticulation systems established by the Zimbabwe National Water Authority (Zinwa). Each of these systems serves between 60 and 100 households, ensuring access to potable water for entire communities, thus addressing a persistent issue of water scarcity.\n\nThese water points are either part of village business units (VBUs) or stand-alone solar-powered units. The integration of water infrastructure with economic activities in the VBUs creates job opportunities, especially for women and youth, offering much-needed employment and contributing to economic empowerment. This has led to the upliftment of many rural households, who no longer have to rely on distant or unreliable water sources.\n\nThe programmes benefits extend beyond water access. The creation of nutrition gardens, stocked with fruit trees and sweet potato vines, is helping households secure a reliable source of nutritious food. These gardens also serve as income-generating projects, further strengthening rural economies. As a result, rural communities are not only gaining access to safe water but also improving their health outcomes and economic stability. By linking water infrastructure with agricultural and business development, the Presidential Rural Development Programme is fostering self-sufficiency, reducing vulnerability to food insecurity, and improving the overall well-being of rural families.\n\nIn addition to providing water, the Governments goal of drilling and equipping a borehole in every village, school, and youth centre across Zimbabwe reflects the immense scale of the programme. The project is already making substantial progress, with over 1800 communal water points established so far, and more are planned. This expansion ensures that even the most remote areas of Matabeleland, Mashonaland, and the Midlands will have access to clean, sustainable water. Each region is benefitting from solar-powered water systems, offering long-term solutions to water access while reducing dependency on traditional, unsustainable methods.\n\nThe success of the Presidential Rural Development Programme demonstrates the positive impact of targeted policy interventions in rural areas. By focusing on both immediate needs and long-term development goals, the programme is improving lives through access to clean water, creating jobs, boosting local economies, and enhancing resilience against climate change. The programme not only addresses a critical challenge but also sets the stage for broader societal and economic transformation, ultimately empowering rural Zimbabweans and ensuring they have the resources to thrive in the face of future challenges. As the initiative continues to expand, it stands as a powerful example of how government investment in rural areas can deliver tangible, lasting benefits.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/FOPOFROFOFO.jpg",
            "description": "SINCE its launch in December 2021, the Presidential Rural Development Programme has proven to be a game-changer for rural Zimbabwe, providing over 100 000 households with access to clean and safe water. This significant step forward is addressing the long-standing water challenges that rural communities have faced for years, offering much-needed relief and creating an opportunity […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Romantic surprises and traditional love. . . Zimbabweans share their unique takes on Valentine’s Day",
            "url": "https://www.chronicle.co.zw/romantic-surprises-and-traditional-love-zimbabweans-share-their-unique-takes-on-valentines-day/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nAs February unfolds, love is set to take centre stage across the globe, with Valentines Day on February 14 bringing romantic celebrations. Traditionally, the day is marked by exchanging gifts such as flowers, chocolates, lingerie, and teddy bears, while some go the extra mile with extravagant gestures like gifting cars and houses.\n\nIn Bulawayo, residents have shared mixed views on the significance of Valentines Day, with many expressing that love should be celebrated daily, making February 14 just another ordinary day.\n\nInterestingly, in recent years, romantic celebrations have increasingly featured live saxophone performances. In the southern region of Zimbabwe, Vuyi Sax has become the go-to performer for such events, while in the northern region, Denilson Musekiwa takes the spotlight. These musicians are often hired for surprise performances, appearing at workplaces, restaurants, or even on the streets to serenade unsuspecting loved ones.\n\nValentines Day preparations at one of Bulawayos shops yesterday\n\nBulawayo resident Wilson Chipaza shared his enthusiasm for Valentines Day surprises, stating that receiving an unexpected saxophone performance from his partner would be a meaningful gesture.\n\nI do appreciate the Valentines theme, especially when I get a surprise from my woman. Sending a saxophonist to serenade me would be amazing. If she can do that for me, then Ill shower her with love all night.\n\nThis gesture also assures me that Im the only man in her life, given our countrys economic situation where such gestures are not affordable for everyone, he said.\n\nSimilarly, Esther Dube expressed her desire to experience a romantic saxophone surprise, though she lamented that her partner is not receptive to the idea.\n\nI always envy other women who get surprises like these. Who wouldnt love being caught off guard by a saxophonist playing their favourite song? That tall, dark guy playing beautiful music would make my day! But sadly, my man doesnt like the idea. Ive hinted at it several times, but he just doesnt get it, she said.\n\nHowever, not everyone shares the same enthusiasm for grand romantic gestures. A local engineer, Kingstone Makaure, who is based in Cuba, believes love should be a private affair rather than a public spectacle.\n\nI dont see the need for such performances. Why invite unnecessary attention to my marriage? Im content with a simple kiss from my wife in the kitchen  its enough for me. We celebrate love daily; we dont need a marked date for it.\n\nIn our African culture, love is private. Thats why you dont see couples holding hands on the streets  its just not part of our values. Lets stick to our traditions and leave Western displays of affection to them, he said.\n\nCar dealer Shepherd Shumba echoed similar sentiments, calling saxophone surprises a waste of money.\n\nI dont like unnecessary attention. A public display like that could make me trend and even bring enemies into my marriage. However, I do love flowers, though my wife doesnt know that.Interestingly, Shumba said: What I really want is for women to change the gifts they give us. Every year, we get the same boxer shorts, vests, and socks. Why not surprise us with something bigger, like a car or a house? Even taking me and my friends out for drinks on my birthday would be great.\n\nSaxophonist Vuyi Sax, who pioneered the walk-in saxophone surprises in 2020, noted that what started as a Valentines Day trend has now become an everyday occurrence.\n\nPeople have embraced this unique art form. A special day no longer passes without someone booking a saxophonist to deliver a heartfelt performance. Previously, the saxophone was mostly associated with live concerts, but now its a central part of intimate celebrations, he said.\n\nVuyi Sax\n\nHe added that women tend to be more expressive when receiving saxophone surprises, while men take time to process the moment before fully appreciating it.\n\nWomen dont hold back their emotions; they show pure joy when surprised. Men, on the other hand, tend to overthink before reacting. However, appreciation is balanced because men are usually the ones hiring me for their wives, he explained.Due to the high demand for his services, Vuyi Sax revealed that he will not be offering promotions this year.\n\nMy schedule for Bulawayo and surrounding areas is already fully booked. The demand is so high that Ill maintain my normal rates without special Valentines Day discounts, he said.Earlier this week, Harare-based saxophonist Musekiwa, renowned for creating pressure among couples with the high-end gifts he delivers while performing on behalf of his clients, announced that he was still accepting bookings for Valentines Day.\n\nLet the countdown begin Your boyfriend lied to you, Im still taking Valentines bookings! February 14 is gonna be fun, he posted on his Facebook page.\n\nVuyi the Saxophonist on Valentines preparations.\n\nAs February 14 approaches, it is clear that while some embrace grand romantic gestures, others prefer to celebrate love in their own quiet ways. Whether through saxophone performances, flowers, or simple acts of affection, love remains a deeply personal and diverse experience for all.\n\nMeanwhile, the city is awash with red as boutiques and pharmacies showcase Valentines Day gifts such as mugs, teddy bears, chocolates, and cards. Numerous events have been arranged at hotels, restaurants, and lodges, with many anticipating a high turnout.\n\nAnother regular standout on Valentines Day, luxury event designer Tendai Kevin Zhou, renowned for delivering exquisite, high-end bouquets of Luxe Flora flowers on behalf of clients to ladies, has also hinted that something special is brewing for the day to make it even more memorable.\n\nThe day is always exciting, as couples eagerly anticipate special treats from their loved ones, and now we are looking forward to next week Friday!\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/nmbmnbvfgn.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com As February unfolds, love is set to take centre stage across the globe, with Valentine’s Day on February 14 bringing romantic celebrations. Traditionally, the day is marked by exchanging gifts such as flowers, chocolates, lingerie, and teddy bears, while some go the extra mile with extravagant gestures like gifting cars and houses. […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Entrepreneur extols value of vocational training skills",
            "url": "https://www.chronicle.co.zw/entrepreneur-extols-value-of-vocational-training-skills/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTHE journey of a rising culinary entrepreneur, Buhlebenkosi Nkala, who made a mark in the industry by participating in last years United Nations Gastronomy Competition, began with simple training in tourism and hospitality at Phangani Vocational Training Centre in Insiza District.\n\nNkala, who hails from Umzingwane District, trained from 2015 to 2017 and graduated as the best student in Tourism and Hospitality.\n\nShe now owns an events company and has founded Kosiben Organics, which specialises in promoting local cuisine through products like umviyo and baobab fruit jam. She said her vocational training laid a solid foundation on which she has built her career.\n\nNkala shared her experiences with students who recently graduated during a combined graduation ceremony for Matabeleland South vocational training centres, held at Phangani Vocational Training Centre.\n\nShe urged fellow graduates to make full use of the skills they have acquired to become innovative and productive. Graduates should either develop their skills further through additional studies or utilise them to generate income, Nkala advised.\n\nLast year, 963 students graduated from five vocational training centres in Matabeleland South.\n\nDuring my training at Phangani Vocational Training Centre, I studied tourism and hospitality, specialising in hotel and catering. I acquired a range of skills that have been essential in my career, she said.\n\nSome of these skills include food and beverage management, accommodation management, customer service, teamwork and leadership, events planning and management, as well as cultural awareness and sensitivity.\n\nI learnt menu planning, food preparation and presentation techniques. These skills have helped me manage kitchen operations, control inventory, and ensure high-quality food service.\n\nMy training emphasised the importance of providing exceptional customer experiences. I learnt effective communication, conflict resolution, and problem-solving techniques, which have helped me handle customer complaints and ensure guest satisfaction, said Nkala.\n\nShe added that group projects and assignments helped her develop teamwork, leadership, and time management skills. These abilities have enabled her to work effectively with colleagues, supervise teams, and manage multiple tasks.\n\nDuring her training, Nkala also gained experience in planning and coordinating events such as weddings, conferences, and banquets. While some people often undermine vocational training, she stressed that it plays a crucial role in building careers.\n\nShe highlighted the importance of continuous training, as the world is constantly evolving, along with client demands.\n\nAfter completing my training in tourism and hospitality, I was determined to break into the industry. I started by gaining practical experience through internships and volunteering, said Nkala.\n\nThis hands-on experience helped me build a network of industry contacts, gain insight into the latest trends and best practices, and develop a deeper understanding of the industry.\n\nI also identified a gap in the market for promoting local Zimbabwean cuisine and saw an opportunity to fill it. I founded Kosiben Organics, which specialises in manufacturing and promoting local products such as umviyo jam and baobab jam, she said.\n\nTo get her business off the ground, Nkala has leveraged social media platforms, attended industry events, and collaborated with other entrepreneurs and stakeholders. She said participating in the Traditional Cookout Competition 2024 has helped raise her profile and provided a platform to showcase her products.\n\nNkala emphasised that breaking into the industry after training requires hard work, determination, and a willingness to take calculated risks.\n\nShe has remained focused on her goals, consistently seeking growth and learning opportunities while staying committed to promoting and celebrating Zimbabwean cuisine and culture.\n\nNkala has successfully showcased her products at the Sanganai/Hlanganani World Tourism Expo under the Gastronomy Hub, the Umzingwane Agricultural Show, and the national launch of the 16 Days of Activism Against Gender-Based Violence 2024.\n\nShe was nominated for the Top Innovator of the Year 2024 award at the African Influencer Awards and for the Manufacturer of the Year 2024 award at the She Awards.\n\nAdditionally, she has undergone training under ZimTrades The Next She Exporter programme, equipping her with the skills and knowledge to successfully export Zimbabwean products to global markets.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fhghmmg.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw THE journey of a rising culinary entrepreneur, Buhlebenkosi Nkala, who made a mark in the industry by participating in last year’s United Nations Gastronomy Competition, began with simple training in tourism and hospitality at Phangani Vocational Training Centre in Insiza District. Nkala, who hails from Umzingwane District, trained from 2015 to 2017 and […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "BCC forges ahead with water company plan",
            "url": "https://www.chronicle.co.zw/bcc-forges-ahead-with-water-company-plan/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Bulawayo City Council (BCC) says the establishment of a corporate water utility company is critical in unlocking and ring-fencing the necessary funding to finance the upgrading of obsolete water and sewerage infrastructure, which requires between US$600 million and US$1 billion.\n\nThis emerged yesterday as the council conducted a consultation meeting with the citys stakeholders on its plans to establish the new utility company.\n\nThe move comes at a time when the city is experiencing recurring pipe bursts, resulting in the loss of up to 50 per cent of non-revenue water amid acute shortages due to low levels at the citys supply dams.\n\nThe council has over 2,000km of water infrastructure, much of which is old and urgently needs replacement to curb leakages. The consultations come as the Government has hinted that local authorities should privatise water provision.\n\nThe Deputy Director of the Water and Sanitation Department, Engineer Kwanele Sibanda, outlined to residents how the council intends to establish the water utility company.\n\nShe said the agency would be wholly owned by the council and run as a private unit within the local authority, answerable to a board. Eng Sibanda also explained to residents the asset structure and management of the water utility company.\n\nWhile the presentation provided clarity on the structure of the water utility, some residents questioned what had failed under the existing system that would be resolved by a privately run entity.\n\nBulawayo Town Clerk, Mr Christopher Dube, responding to questions from residents, said that ring-fencing water finances would improve the councils ability to supply water efficiently. He noted that the council was struggling to attract investors under the prevailing conditions.\n\nMr Christopher Dube\n\nOur infrastructure has collapsed, and the collapse was a result of a lack of maintenance. These pipes were installed more than 50 years ago, and over the years, there has been no maintenance.\n\nEven if you bring in external experts, there is nothing they can do because what is needed is financing. With a water utility company, we hope to be more attractive to investors. At the moment, potential investors say we are unattractive and that there is too much red tape, said Mr Dube.\n\nOur employees are dedicated, but there is nothing they can do without resources. The water utility will bring efficiency, enabling us to raise the money we need to fix the collapsed infrastructure.\n\nWe need between US$600 million and US$1 billion, and we may not be able to secure that funding unless we seek external investors. Investors want to invest in the Government; they do not want to invest in the council.\n\nHe said the proposed establishment of a water utility company was the result of wider engagement to address water shortages.\n\nMr Dube also acknowledged that creating a water utility company could cause anxiety, particularly among poorer citizens who may fear that access to water will become a privilege for the wealthy.\n\nWhat we are trying to do is not unique; we are trying to create a more efficient system. We know there are residents who cannot afford to pay bills, and as a council, we are working on a pro-poor policy, he said.\n\nThis policy will cater for residents who are unable to pay bills. However, those who are able to pay should do so. Right now, the budget we have submitted to the Government is US$309 million. Even if we allocated the entire amount to water, it would still be inadequate, said Mr Dube.\n\nMr Dube dismissed claims that the Dutch water company Vitens Evides International (VEI) was taking over Bulawayos water resources, clarifying that the company had provided financial resources and expertise to the local authority free of charge.\n\nDeputy Mayor, Councillor Edwin Ndlovu, added that residents should trust their elected representatives and management in their plans to improve water services.\n\nThis company (VEI) has been assisting the City of Bulawayo, but they have highlighted the limitations of what they can do. It is not just themother organisations that want to help us have also stated that unless we establish a water utility company that separates accounts, they will not provide resources, he said.\n\nThey are not the ones setting up the water utility company. This will enable the council staff to provide efficient services to residents, said Cllr Ndlovu.\n\nAlthough the engagement was heated, Bulawayo United Residents Association chairman, Mr Winos Dube, sought to calm tensions, calling for extensive engagement in policy formulation.\n\nWinos Dube\n\nHe said the council needed to address issues of mistrust, particularly when introducing new projects, as residents had previously been let down during implementation.\n\nWhen ZESA took over the power station, we were promised a reliable power supply, yet today we still experience outages. When Terracotta came, we were promised that Egodini would be transformed into something akin to South Africas Park Station, but to date, nothing has changed, he said.\n\nIt is our concern that the way consultations are conducted does not inspire confidence, said Mr Dube.\n\nHe noted that when the Zimbabwe Electricity Transmission and Distribution Company introduced prepaid electricity meters, there was widespread resistance. However, the system has since been fully embraced due to its efficiency.\n\nMrDube said the council had previously attempted to introduce prepaid water meters, but the initiative was met with resistancenot because it was a bad idea, but due to a lack of understanding of how it would work.\n\nIn hindsight, if the council says it will introduce prepaid water meters, I will be the first to volunteer for a pilot project at my home, said Mr Dube.@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/bcc.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE Bulawayo City Council (BCC) says the establishment of a corporate water utility company is critical in unlocking and ring-fencing the necessary funding to finance the upgrading of obsolete water and sewerage infrastructure, which requires between US$600 million and US$1 billion. This emerged yesterday as the council conducted a consultation meeting with the […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        }
    ]
}