{
    "news": [
        {
            "title": "Police recover 681 boxes of counterfeit brake fluid and adhesives",
            "url": "https://www.chronicle.co.zw/police-recover-681-boxes-of-counterfeit-brake-fluid-and-adhesives/",
            "content": "Police have recovered 681 boxes of counterfeit brake fluid and prime bond multipurpose adhesives which were being sold to unsuspecting customers at Keacy Motor Spares along Harare Street.\n\nThe 88 boxes of prime bond (8 800 units) and 593 boxes of brake fluid (26 000 units) were recovered by a team of officers from the ZRP Licence Inspectorate who were patrolling Harare Street.\n\nSelina Nyurwa and Ashley Kasambarara, employers at the shop, were arrested in connection with the crime, while the prime bond and brake fluid were taken to Harare Central Police Station for further investigations.\n\nA manhunt has since been launched for the company directors.\n\nNational police spokesperson, Commissioner Paul Nyathi said investigations are in progress.\n\nWe have launched a manhunt for the company owners as investigations into this case continue, he said.\n\nThese two suspects are just employees. We are appealing for information that might assist us with investigations.\n\nSince last month, there has been an operation targeting counterfeit products.\n\nThe crackdown, led by the Consumer Protection Commission (CPC) in collaboration with other Government agencies, aims to combat business malpractice.\n\nCabinet ordered the operation which involves inspections conducted by the CPC along with the Ministry of Industry and Commerce, Trade Measures Department, the Zimbabwe Revenue Authority, the Zimbabwe Republic Police, and the\n\nMinistry of Health and Child Care.\n\nThis has resulted in the prosecution of over 90 businesses in Zimbabwe, with a shop in Bindura, suspected of being a major supplier of illegally repacked sugar, having been closed.\n\nThe Bindura shop was selling 1,6kg of sugar in 2kg packets.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/22982cf2-df13-4161-b358-f374713a8196-680x380.jpeg",
            "description": "Crime Reporter Police have recovered 681 boxes of counterfeit brake fluid and prime bond multipurpose adhesives which were being sold to unsuspecting customers at Keacy Motor Spares along Harare Street. The 88 boxes of prime bond (8 800 units) and 593 boxes of brake fluid (26 000 units) were recovered by a team of officers […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zimbabwe’s 2027 Trade Fair bid in focus as Afreximbank delegation inspects key facilities",
            "url": "https://www.chronicle.co.zw/zimbabwes-2027-trade-fair-bid-in-focus-as-afreximbank-delegation-inspects-key-facilities/",
            "content": "Sikhulekelani Moyo [emailprotected]\n\nThe INTRA-Africa Trade Fair Bid Evaluation Committee is currently in Zimbabwe to evaluate the countrys preparedness to host the Intra-Africa Trade Fair in 2027.\n\nThe committees three-day visit, which began on 10 February, will conclude on 12 February.\n\nThe delegation, led by Mr Gainmore Zanamwe from Afreximbank, comprises representatives from esteemed organisations, including the African Union Commission (AUC), Afreximbank, the African Development Bank (AfDB), the United Nations Economic Commission for Africa (UNECA), the African Continental Free Trade Area (AfCFTA), the Arab Bank for Economic Development in Africa (BADEA), Reeds Exhibitions, and many others. This follows Zimbabwes shortlisting as a potential host country, alongside Malawi and Nigeria, for the flagship event.\n\nAs part of their evaluation, the committee is touring exhibition facilities, accommodation options, and other critical infrastructure. The delegation has already visited the Zimbabwe International Trade Fair grounds to assess the venues suitability for the trade fair. They inspected the exhibition halls, conference facilities, and other amenities.\n\nAdditionally, the committee evaluated airport facilities, courtesy of the Airports Company of Zimbabwe, to determine the countrys capacity to handle international flights and visitors.\n\nFurthermore, the delegation inspected accommodation facilities in Bulawayo, including hotels and other lodging options, to assess their suitability for delegates and visitors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dfbgffgbhfg.jpg",
            "description": "Sikhulekelani Moyo – mskhulekelani16@gmail.com The INTRA-Africa Trade Fair Bid Evaluation Committee is currently in Zimbabwe to evaluate the country’s preparedness to host the Intra-Africa Trade Fair in 2027. The committee’s three-day visit, which began on 10 February, will conclude on 12 February. The delegation, led by Mr Gainmore Zanamwe from Afreximbank, comprises representatives from esteemed […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "African journalists take a stand for tax justice, drive Domestic Resource Mobilization (DRM) in the region",
            "url": "https://www.chronicle.co.zw/african-journalists-take-a-stand-for-tax-justice-drive-domestic-resource-mobilization-drm-in-the-region/",
            "content": "Prosper Ndlovu in Ouagadougou, BURKINA FASO\n\nJOURNALISTS from across Africa are gathered in Ouagadougou in Burkina Faso this week to deliberate on the regional taxation systems and how to scale up collaboration between the media sector and tax administrators towards achieving tax justice and boosting revenue generation to drive sustainable development in the continent.Given the high dependence of many developing states on aid, which is increasingly being weaponized and is seen as a threat to Africas sovereignty, the conference has brought together journalists, tax administration experts, communicators, advocacy groups, policymakers and development partners for intense engagements on different topic areas.\n\nATAF official, Mr Ziggy Fikiri, and panelists engage with media and stakeholder participants during a panel discussions in Ouagadougou, Burkina Faso\n\nSupported by the African Tax Administration Forum (ATAF), the meeting seeks to equip media and communications professionals with key insights on emerging tax issues and foster collaborative discussions for impactful reporting.There is consensus already that efficient and effective tax systems in Africa would not be complete without a robust communication strategy, and journalists are called upon to play a key role in this drive.Between today and tomorrow, participants will engage over critical issues in taxation, including international tax trends, shining the light on United Nations conventions on tax as well as the problem of Illicit Financial Flows (IFFs). These will be discussed in view of how the media can have an impact in shaping public opinion as well as enhancing collaboration in bridging communication gaps.\n\nMore to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/DRM.jpg",
            "description": "Prosper Ndlovu in Ouagadougou, BURKINA FASO JOURNALISTS from across Africa are gathered in Ouagadougou in Burkina Faso this week to deliberate on the regional taxation systems and how to scale up collaboration between the media sector and tax administrators towards achieving tax justice and boosting revenue generation to drive sustainable development in the continent. Given […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zimra clamps down hard on Limpopo River smuggling, Burns 21 boats",
            "url": "https://www.chronicle.co.zw/zimra-clamps-down-hard-on-limpopo-river-smuggling-burns-21-boats/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe Zimbabwe Revenue Authority (Zimra), in collaboration with other border agencies, intercepted and destroyed 21 boats used for smuggling contraband between Zimbabwe and South Africa along the Limpopo River on Tuesday.\n\nMost of the boats were located with the aid of drone surveillance technology.\n\nZimras elite drones used to combat border crime\n\nIn a statement, Zimras Commissioner General, Ms Regina Chinamasa, confirmed the confiscation and destruction of 21 smuggling boats and 20 paddles along the Limpopo River.\n\nThis operation, a testament to Zimbabwes strengthened border security measures, highlights the growing impact of drone surveillance and a whole-of-government approach to tackling illicit trade, said Ms Chinamasa.\n\nThe sting operation saw Zimras elite Drone Operations Team, Customs Officers, and other border security stakeholders patrolling key smuggling hotspots, providing real-time aerial intelligence that led to the swift interception and destruction of smuggling infrastructure.\n\nShe added that drones have revolutionised border security, providing unparalleled aerial surveillance and enabling the tracking of smugglers in real-time, even in remote areas that were previously difficult to monitor.\n\nThe Commissioner General noted that the drones are also equipped with night vision and high-resolution cameras.\n\nShe said the drones have been instrumental in identifying illegal crossing points and exposing deeply entrenched smuggling networks.\n\nThis is a game-changer in our fight against smuggling. The use of drones has allowed us to detect smuggling activities with precision and speed, ensuring that illicit goods never make it into the market, said the Commissioner General.\n\nSmuggling is not just about tax evasionits an attack on Zimbabwes economy, local industries, and the safety of our communities. Through this collaborative approach, we are sending a strong message: Zimbabwes borders will not be a playground for criminals.\n\nMs Chinamasa said the latest intelligence-driven operation targeted five notorious smuggling corridors, informally known as Valley 1 & 2, Proof, Godfather, and Thembani.\n\nAt these illegal crossing points, surveillance teams uncovered a fleet of inflatable boats strategically positioned on both the South African and Zimbabwean sides; vehicles on standby, ready to transport smuggled goods inland; and donkey-drawn carts, motor vehicles, and boats being used to ferry illicit goods across the border.\n\nThe Commissioner General emphasised that such smuggling operations threaten local businesses, flood the market with untaxed goods, weaken Zimbabwean manufacturers, and deprive the government of much-needed revenue for essential services.\n\nThis operation underscores the effectiveness of multi-agency cooperation in tackling illicit trade. Zimra, border security forces, law enforcement agencies, and local intelligence teams have intensified their efforts, working hand-in-hand to disrupt smuggling syndicates and uphold economic integrity, said Ms Chinamasa.\n\nShe added that the revenue collector will continue to intensify aerial patrols, deploy more drones, and increase joint border operations with security agencies to completely dismantle smuggling syndicates.\n\nFurthermore, she emphasised that the integration of AI-driven analytics and night-time drone surveillance will further bolster enforcement efforts, ensuring that smugglers have nowhere to hide.\n\nSmuggling is not just a crimeits economic sabotage, Ms Chinamasa stated. Those engaging in these illegal activities must understand that the net is tightening. We will find you, we will stop you, and we will ensure that Zimbabwes legitimate businesses and economy are protected.\n\nWe remain committed to facilitating legitimate trade while aggressively combating smuggling. The agency calls upon all citizens, businesses, and stakeholders to report smuggling activities and support ongoing efforts to secure the nations borders.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jack.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The Zimbabwe Revenue Authority (Zimra), in collaboration with other border agencies, intercepted and destroyed 21 boats used for smuggling contraband between Zimbabwe and South Africa along the Limpopo River on Tuesday. Most of the boats were located with the aid of drone surveillance technology. In a statement, Zimra’s Commissioner General, Ms […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Car imports fraud case: Duo further remanded in custody",
            "url": "https://www.chronicle.co.zw/car-imports-fraud-case-duo-further-remanded-in-custody/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe trial of two Beitbridge-based customs clearing agents, Lloyd Mawadze (36) and Lauren Mawadze (32), who were recently arrested for allegedly defrauding vehicle importers of nearly US$20,000 over two years, has been postponed to 18 February for a formal bail application. The duo had gone on the run after each fraud and theft case.\n\nThe two accused were recently tracked down in Beitbridge district following a series of investigations.\n\nThey reportedly abused their positions to receive funds from unsuspecting car importers, promising to facilitate the import of vehicles from South Africa. Instead, they would disappear with the money, leaving their victims empty-handed.\n\nThe pair is alleged to have duped four victims of R81,500, US$11,700, and Z$17.5 million between 2023 and 2024.\n\nThey briefly appeared before Beitbridge Resident Magistrate on Tuesday, where the matter was postponed for a formal bail application.\n\nThrough their lawyer, Mr Muchiwande Sithole of Samp Mlaudzi and Partners, they denied the charges of fraud and theft of trust property.\n\nProsecutor Mr Tawanda Chigavazira stated that in August 2023, the Mawadze duo began their criminal activities by allegedly swindling Harare resident Tendai Tshuma of US$600 and Z$17.5 million, claiming the funds would cover import duty for a Ford Ranger single cab. After receiving the money, they vanished.\n\nIn another instance, the two allegedly took US$4,100 from Tendai Tobias Bonga, who had enlisted their services to pay import duty for a Mercedes-Benz C180. They disappeared after receiving the money.\n\nIn January 2024, they purportedly conned Tinashe Kutsukutsa out of US$7,000 intended for buying a car and paying duty.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The trial of two Beitbridge-based customs clearing agents, Lloyd Mawadze (36) and Lauren Mawadze (32), who were recently arrested for allegedly defrauding vehicle importers of nearly US$20,000 over two years, has been postponed to 18 February for a formal bail application. The duo had gone on the run after each fraud […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Men threaten to gate-crash Doek & Slay . . . organisers stand firm: ‘no men allowed’",
            "url": "https://www.chronicle.co.zw/men-threaten-to-gate-crash-doek-slay-organisers-stand-firm-no-men-allowed/",
            "content": "Maria Chiguvari, Harare Bureau\n\nSince the inception of the Doek & Slay all-women party, men have been curious and increasingly eager to join in. This time, however, they are making their intentions clear, with some openly vowing to break tradition and gate-crash the event when the record-breaking show arrives in Harare on April 13.\n\nThe organisers have vowed that the grand parties, which have become a hit with women, will remain exclusive for women and there will be strict security at the new show in Harare.\n\nOver the weekend, social media exploded after the organisers announced the artistes who will perform at the first edition of Doek & Slay to be held in Harare this year. There will be performances from Intotal Band, Feli Nandi, Winky D and Iyasa on April 13.\n\nHowever, several men, who were commenting online after the announcement of the line-up of artistes, vowed that they would break with tradition and attend the show.\n\nIn an interview with H-Metro, one of the organisers said the event remains strictly for women only and they are going to make sure that no man will be allowed to enter the show.\n\nThey also addressed the issue of why male artistes dominate their stages.Feli Nandi will be the only female artiste for the show.We stand by our culture, the party is for ladies only and no man will be allowed to enter. Doek & Slay was created as a safe space for the ladies and that is why it is only held on Sundays.The issue of male artistes dominating our stages is because the ladies decide on who they want to perform. We noticed that most of the local shows happen at night and at that time most women will be at home taking care of children.So, we thought why not bring those artistes that they want during the day so that they, too, can enjoy the magic, he said.\n\nDoek & Slay will hit The Odyssey Kadoma on March 30 with Freeman and The Travellers Band entertaining the women. It will then move to Mutare Sports Club on April 6 with Freeman and Master H providing the entertainment.\n\nThe Bulawayo edition will be held at the ZIEC main arena and Master H, The Travellers Band and Iyasa will be the artistes on show.\n\nThe Doek & Slay party has become the biggest show, in terms of attendance, on the local entertainment scene. The Harare edition is always the prime show, attracting women from all over the country, and the last one to be held in the capital attracted a record-breaking crowd of over 23 000.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/doek.jpg",
            "description": "Maria Chiguvari, Harare Bureau Since the inception of the Doek & Slay all-women party, men have been curious and increasingly eager to join in. This time, however, they are making their intentions clear, with some openly vowing to break tradition and gate-crash the event when the record-breaking show arrives in Harare on April 13. The […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Gospel greats, Mai Mwamuka, Dorcas Moyo collaborate",
            "url": "https://www.chronicle.co.zw/gospel-greats-mai-mwamuka-dorcas-moyo-collaborate/",
            "content": "Mthabisi Tshuma [emailprotected]\n\nTwo Zimbabwean gospel music powerhouses, Bulawayo-based Mai Mwamuka and Mutares Dorcas Moyo, have joined forces on a new single, Mavodloza.\n\nReleased last month, the song is rapidly gaining popularity across radio stations nationwide.\n\nMai Mwamuka shared the inspiration behind the track.Mavodloza speaks of an individual who is unstoppable, unconquerable, and a relentless barrier-breaker. Its drawn from Isaiah 54:17 (NKJV), which declares: No weapon formed against you shall prosper, and every tongue which rises against you in judgment you shall condemn. This is the heritage of the servants of the Lord, and their righteousness is from Me.\n\nReflecting on the collaboration, Dorcas Moyo said: We worked on the track last year, and I can say it was an incredible experience collaborating with such a talented, focused, and spiritually deep artiste.\n\nMeanwhile, Mai Mwamuka is set to launch the first live session of Worship Well 2025, a Thanksgiving event, tomorrow. She revealed that this years edition will expand beyond traditional venues, reaching homes, families, villages, cities, churches, conferences, all-night prayers, prayer retreats, crusades, weddings, parliament, schools, and hospitals. Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gvb.jpg",
            "description": "Mthabisi Tshuma – revmmthiretshuma@gmail.com Two Zimbabwean gospel music powerhouses, Bulawayo-based Mai Mwamuka and Mutare’s Dorcas Moyo, have joined forces on a new single, Mavodloza. Released last month, the song is rapidly gaining popularity across radio stations nationwide. Mai Mwamuka shared the inspiration behind the track. “Mavodloza speaks of an individual who is unstoppable, unconquerable, and […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "A Zimbabwe man was further remanded in custody for smuggling R14 million cigarettes into SA",
            "url": "https://www.chronicle.co.zw/a-zimbabwe-man-was-further-remanded-in-custody-for-smuggling-r14-million-cigarettes-into-sa/",
            "content": "Thupeyo Muleya Beitbridge Bureau\n\nA Zimbabwean truck driver, Jiant Janos Bimha (44) has been further remanded in custody by a Musina magistrate court after he was arrested for allegedly smuggling Remington Gold cigarettes into South Africa worth R14 million.\n\nBimha was arrested on January 18, 2025, after he was allegedly found in possession of illicit cigarettes at the Beitbridge Border Post soon after entering the neighbouring country.\n\nSouth Africas spokesperson for the National Prosecuting Authority (NPA) in Limpopo province Ms Mashudu Malabi-Dzhangi said the matter was postponed to March 7 for bail application.\n\nShe said Bimha briefly appeared at the Musina Magistrate court last Thursday where the case was further postponed.\n\nThe matter has been postponed to 07/03/2025 for bail application, said Ms Malabi-Dzhangi.\n\nCharges against Bimha are that on January 18, this year he was driving a white truck with a tanker trailer when he was stopped by the police at the port of entry.\n\nUpon being asked about his load, Bimha claimed the tanker was empty but the police suspected that it was loaded.\n\nThey then directed him to the ramp zone at the commercial side and searched the vehicle leading to the discovery of 710 boxes of Remington Gold brand cigarettes worth R14 449 363..\n\nDuring further interrogations, Bimha failed to give the police a satisfactory explanation regarding the origin of the cigarettes and he was immediately placed under arrest on the spot.\n\nThe police have since confiscated the 710 boxes of Remington Gold cigarettes and a truck tanker valued at R2 500 000.\n\nThe smuggling of cigarettes has become a perennial headache for authorities in both countries who in most cases are collaborating to minimise the vice.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Thupeyo Muleya – Beitbridge Bureau A Zimbabwean truck driver, Jiant Janos Bimha (44) has been further remanded in custody by a Musina magistrate court after he was arrested for allegedly smuggling Remington Gold cigarettes into South Africa worth R14 million. Bimha was arrested on January 18, 2025, after he was allegedly found in possession of illicit […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Mbare woman jailed 5 years over 6,3kg of mbanje",
            "url": "https://www.chronicle.co.zw/mbare-woman-jailed-5-years-over-63kg-of-mbanje/",
            "content": "Thupeyo MuleyaBeitbridge Bureau\n\nA 33-year-old woman from Mbare in Harare has been jailed for five years by a Beitbridge magistrate court after she was arrested while carrying 6,3kgs of Mbanje (dagga) that is believed to have been smuggled from South Africa.\n\nOf late there is an upsurge in cases where drug peddlers are smuggling Mbanje from South Africa in huge quantities via the Limpopo River or through the border using light cross-border transporters known as Omalaitsha.\n\nMost of the hallucinating drugs are destined for high-density suburbs in Bulawayo and Harare.\n\nBrenda Chipfunde who was busted on February 7 while attempting to hike lifts to Harare was convicted on her own plea of guilty to contravening a section of the Dangerous Drugs Act when she appeared before Mr Mbonisi Kaweni.\n\nShe was left with four years and two months effective in jail when the trial magistrate conditionally suspended 10 months of the five-year sentence for 5 years.\n\nThe dagga was forfeited to the State as part of the sentence.\n\nProsecuting, Mr Tawanda Chigavazira said on February 7 at around 6 pm, detectives from Beitbridge police station were on patrol when they got information that Chipfunde was transporting the dangerous drugs from Beitbridge to Harare.\n\nThey then tracked her to a hiking spot along the Beitbridge-Harare road where they found her flagging vehicles for lifts.\n\nThe police detectives identified themselves and requested to search her luggage resulting in the discovery of 12 cobs of mbanje.\n\nThese were wrapped in a duvet. Chipfunde was subsequently arrested and the dagga was taken for weighing giving a weight of 6,3 kilograms.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Thupeyo Muleya – Beitbridge Bureau A 33-year-old woman from Mbare in Harare has been jailed for five years by a Beitbridge magistrate court after she was arrested while carrying 6,3kgs of Mbanje (dagga) that is believed to have been smuggled from South Africa. Of late there is an upsurge in cases where drug peddlers are smuggling Mbanje […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        },
        {
            "title": "Watch: Revived & Restored – Baba Harare prepares for 2nd gospel album release",
            "url": "https://www.chronicle.co.zw/watch-revived-restored-baba-harare-prepares-for-2nd-gospel-album-release/",
            "content": "Showbiz Reporter\n\nMusician Baba Harare (Braveman Chizvino), who made his mark in the Jiti genre, and has now turned his focus to gospel music, is set to launch his second gospel album next month, following the success of Repentance last year.\n\nAfter facing moments of doubt and even considering leaving the music industry entirely, Baba Harare found a renewed sense of purpose with gospel music. His upcoming album, Revived & Restored, is slated for release on March 7.At one point, I wanted to quit music altogether, but I realised that singing is my gift, Baba Harare said in a previous interview.\n\nhttps://youtube.com/shorts/1d4yGcs0sNM\n\nThe album, which features an exciting blend of collaborations, promises to deliver a fresh gospel sound. The tracklist includes seven songs: Level raJosefa, 24/7 featuring Tanto Wavie, Ndinofara featuring Minister Michael Mahendere, Shame on You! featuring Kudzi Nyakudya, Muri Mutsvene featuring Psalmist Blessing Shumba, Hatirwe Nenyama featuring ZimPraise, and Ngatipembere featuring Dorcas Moyo. The album is produced by Nyasha Timbe, Tadezz Made It, and Kuk Beats.In the lead-up to the albums release, Baba Harare has shared a teaser of the track Level raJosefa, accompanied by dance moves that fans can learn and enjoy in anticipation of the full album.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fdfy.jpg",
            "description": "Showbiz Reporter Musician Baba Harare (Braveman Chizvino), who made his mark in the Jiti genre, and has now turned his focus to gospel music, is set to launch his second gospel album next month, following the success of Repentance last year. After facing moments of doubt and even considering leaving the music industry entirely, Baba […]",
            "time": "20:24",
            "date": "11 Feb 2025"
        }
    ]
}