{
    "news": [
        {
            "title": "President warns in-disciplined party cadres",
            "url": "https://www.chronicle.co.zw/president-warns-in-disciplined-party-cadres/",
            "content": "Zvamaida Murwira, Harare BureauPRESIDENT Mnangagwa has warned people who put on Zanu-PF regalia but then go on to deviate from the principles the revolutionary party stands for through indiscipline such as disrespect of leadership, especially at public events.\n\nHe said Zanu-PF values discipline as a cornerstone of its survival and everyone was duty bound to uphold discipline.\n\nZANU-PF\n\nPresident Mnangagwa said this on Monday at an interactive meeting with editors from the public and private media at State House.\n\nThe President made the remarks after being asked on the apparent disrespectful conduct shown by some Zanu-PF supporters and some members of the public, who sometimes seek to denigrate the party leadership, particularly the Presidium at national events such as burials of national heroes at the National Heroes Acre.\n\nI am so happy; this is the vibrancy of democracy. The foolish and the wise both have their day. I think those who really are Zanu-PF at heart go by the rules and decorum of Zanu-PF, he said.\n\nWe have other people who are in Zanu-PF, who in themselves are not Zanu-PF, but they dress in Zanu-PF regalia, so you must always see when people talk and see which camp they belong to when they open their mouths, said President Mnangagwa.\n\nTurning to political developments on the globe, President Mnangagwa said the decision by the United States administration led by President Donald Trump to impose sanctions against South Africa for its policy to embark on land reform would not affect the region, but would galvanise Pretoria and the region as a whole to work hard.\n\nI can assure you that those who impose sanctions on other countries should have learnt a lesson. Zimbabwes growth was faster when we were under sanctions than before sanctions.\n\nSo, if you want an economy to grow faster, impose sanctions. So, we are a good lesson, we have developed and grew our economy under sanctions and I do not think that South Africa would be an exception.\n\nSouth Africa is a solid country with a solid economy based on its resources and I have belief that the people of South Africa are rooted in South Africa themselves. The outside world can only assist what the South Africans themselves can do for their country. So do not lose sleep about people imposing sanctions on others, said President Mnangagwa.\n\nWith respect to the anxiety among Zimbabweans on the countrys ability to respond to health emergencies particularly road accidents, after pictures of cardboard boxes used by health officials to support and stabilise fractures, went viral on social media, President Mnangagwa said it was a wake-up call.\n\nThat was a sad situation when I saw it. We must make sure we correct that. I saw it in the media. I am happy that the media exposed such weaknesses, so we must address that immediately, said President Mnangagwa.\n\nThe pictures circulated after the accident which killed 25 people when an Urban Connect intercity bus and an Auro Transport commercial truck collided head-on, 21km north of Beitbridge Town last Thursday. Government declared the accident a state of disaster and assisted to bury the victims.\n\nThere was huge debate among social media users, with some saying it was a bad indictment for the countrys health sector while others argued that it was normal in emergencies to use cardboard boxes to prevent further injury and stabilise fractures while transporting a patient to the hospital.\n\nDuring the interaction, some editors asked if the Government was considering constructing more referral hospitals to improve the health delivery system.\n\nThe editors said Government seemed to have focused more on education as evidenced by the number of State universities in all provinces since independence, but the situation was not the same in the health sector.\n\nPresident Mnangagwa said while the observation might be noble, it was up to the responsible Government Ministry to make recommendations for more facilities should it become necessary.\n\nI am not really aware of that urgent need but my Minister responsible for that sector has the mandate to demand from the Government of what he thinks is needed to expand the facilities, said President Mnangagwa.\n\nOn the efforts being pursued to resolve the countrys debt arrears, the President said there will eventually be a reflection on achievements made, given that African Development Bank (AfDB) president, Dr Akinwumi Adesinas term at the bank was coming to an end this year.\n\nTHE African Development Bank\n\nDr Adesina is the Champion of Zimbabwes arrears clearance and debt resolution process while former Mozambican President Joachim Chissano is the high level facilitator.\n\nWe are still in that process; our facilitator is still engaged in that process. Everything possible is being done and we shall know what achievement we will have at the end of his term and we will pick it from there, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/GFSRWERW.jpg",
            "description": "Zvamaida Murwira, Harare Bureau PRESIDENT Mnangagwa has warned people who put on Zanu-PF regalia but then go on to deviate from the principles the revolutionary party stands for through indiscipline such as disrespect of leadership, especially at public events. He said Zanu-PF values discipline as a cornerstone of its survival and everyone was duty bound […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Tobacco  revolution  in Mangwe  & Bulilima",
            "url": "https://www.chronicle.co.zw/tobacco-revolution-in-mangwe-bulilima/",
            "content": "Raymond Jaravaza,[emailprotected]NOW in its second season, the pioneer commercial tobacco farming revolution that began last year with a handful Marula villagers in Mangwe District, has grown in leaps and bounds with over 170 farmers growing the golden leaf in the 2024/25 season to tap into the rich pickings of the cash crop.\n\nWhen tobacco growing was introduced to Marula villagers in the 2023/24, only 17 communal farmers heeded the call to switch from traditional small grains and maize to commercial tobacco farming.\n\nIn the 2024/25 tobacco season, the project has spread to villages deep in the Mangwe District to areas such as Ingwizi and Tshitshi.\n\nMore farmers have also joined the project from neighbouring Bulilima District.\n\nTobacco is predominantly grown in Mashonaland provinces with a few farmers involved in the Midlands province and not so common in the entire Matabeleland region, which majors in cattle ranching.\n\nThe pioneer tobacco scheme was introduced last year at Syringavale Farm in Ward 11, Marula  breaking the decades cycle of reliance on grain and livestock farming.\n\nThe tobacco that was planted in both Mangwe and Bulilima Districts is at different stages of growth as the rainfall patterns were staggered so farmers could not plant at the same time.\n\nFrom the initial 17 farmers who joined the scheme when it was introduced in Matabeleland South we now have more that 170 tobacco farmers, said tobacco farming specialist Mr Rodrick Musiiwa.He is a former Tobacco Industry and Marketing Board (TIMB) employee with vast knowledge and experience in tobacco farming.\n\nSome of the farmers in the Greenfield Farm area in Mangwe District are close to harvesting while some in the Figtree area have started harvesting.\n\nThe rains have been good, which is a bonus for tobacco farmers in Matabeleland South and we expect them to have a good harvest, said Mr Musiiwa.Mrs Ellen Sibanda, a first-time tobacco farmer at Greenfield Farm said she planted half a hectare for a start.\n\nI started planting on 17 December 2024 and in a week I had planted 8 300 plants although the figure fell short of my target of over 9 000 plants, she said.\n\nTobacco farming is hard but together with the one employee that I hired, we persevered and finished planting on time as advised by Mr Musiiwa, said Mrs Sibanda.\n\nShe said she was inspired to venture into tobacco farming last year when she attended a field day hosted by one of the pioneer farmers of the cash crop.\n\nInstead of planting maize on two hectares of land, I decided to set aside half a hectare and try tobacco farming. I should start harvesting in about two weeks, said Mrs Sibanda.\n\nYesterday she was finishing work on a barn where her tobacco crop will be cured.\n\nUnlike in other parts of the country where tobacco is dried by burning wood in the barns thus contributing to deforestation, farmers in Matabeleland South use the sun to cure their crop  an eco-friendly method that does not damage the environment.\n\nThe dry spell that hit Marula village in late December forced Mrs Nonsikelelo Ndlovu to postpone planting as the conditions were not ideal to transplant her tobacco seedlings.\n\nI planted a bit late around 10 January 2025 and the plants did well for the first two weeks but we received too much rain and part of the field became water logged, damaging some of the crop, she said.\n\nI re-planted on one side of the field, which is why the tobacco is at different stages of growth, said Mrs Ndlovu.\n\nShe harvested close to 300 kilogrammes last season and is optimistic she will get a better yield this time around.\n\nMrs Sibonele Mathe planted 14 900 tobacco plants on one hectare and is confident she will reap the rich pickings of the cash crop.\n\nIm a first time tobacco farmer and I was inspired to try the crop when I walked past a tobacco farm at Syringavale Farm in Marula last year.\n\nTobacco farmer Sibonile Mathe (right) with Melody Nyathi (left), at her field in Mangwe District, Matabeleland South Province (Pictures by Allen D Ndebele)Lignis dollis reperum si aliquia sum\n\nI told other villagers that I would try tobacco farming but they did not take me seriously, she said.\n\nThere was a time when we had a long dry spell and I almost lost hope. We are happy now because we have been receiving good rains during the past few weeks. Im hopeful that we will get a good harvest, said Mrs Mathe.\n\nIn her village in Ward 3, Mangwe District, only four farmers have taken up tobacco farming and she says other villagers are eager to see if they will be paid well for their efforts.\n\nMr Musiiwa said the idea of introducing tobacco farming in Marula was motivated by the need to capacitate farmers in the southern parts of Zimbabwe to try cash crops that can do well in drought conditions so that the country continues to meet the demand for tobacco.\n\nThe increasing incidences of drought in the region have greatly affected yields, plunging the majority of the communal farmers in the area into poverty hence the need to shift to tobacco farming.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/BZFERDFCVXCV.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com NOW in its second season, the pioneer commercial tobacco farming revolution that began last year with a handful Marula villagers in Mangwe District, has grown in leaps and bounds with over 170 farmers growing the golden leaf in the 2024/25 season to tap into the rich pickings of the cash crop. When […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "COMMENT: Media challenged to be well-informed",
            "url": "https://www.chronicle.co.zw/comment-media-challenged-to-be-well-informed/",
            "content": "PRESIDENT Mnangagwa has urged the media industry to adjust to the evolving technology landscape that has changed the old ways of information dissemination in order for the industry to remain vibrant.\n\nSpeaking at an interactive meeting with editors from both the public and private media, President Mnangangwa said Government values a vibrant media industry hence the need for the industry to keep abreast with the changing technology landscape.\n\nPresident Mnangangwa\n\nI am acutely aware that your industry is having to survive in a very complex and challenging environment where many things have to change, he said.\n\nPresident Mnangagwa said there was a seismic shift in reader, viewer and listener interest and behavior much of it caused, motivated or aided by giant technological changes and possibilities.\n\nThe old media is dead and with it, old modes, models and ways of doing your craft. We feel the impact and repercussions of these changes of technologies even in our own sphere of Government which is supposed to be stable and traditionally change averse, he said.\n\nPresident Mnangagwa said Government was keen to share with the media industry their challenges and explore how it could assist to survive the headwinds of the global change.\n\nHe said the vibrancy of the media industry is underwritten by viability of the media industry as individual businesses.\n\nIt is a fact that the media industry is facing serious viability challenges hence many companies are struggling to even pay salaries.\n\nThere are reports of some media houses contemplating reducing journalists working hours to just two weeks a month which means journalists working for such companies will be paid half of what they are getting now. There is therefore an urgent need for Government bailout if the country is to continue enjoying a vibrant media industry.\n\nWhat is comforting is that the Government is aware of the media industrys challenges and what is even encouraging is that President Mnangagwa said Government is keen to share with the media industry their challenges and explore how it could assist the industry to survive the headwinds of the global change.\n\nHe however challenged the media to be well-informed as they interpret the society and developments, particularly in proffering directional insights on the political trajectory.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Social-media.jpg",
            "description": "PRESIDENT Mnangagwa has urged the media industry to adjust to the evolving technology landscape that has changed the old ways of information dissemination in order for the industry to remain vibrant.  Speaking at an interactive meeting with editors from both the public and private media, President Mnangangwa said Government values a vibrant media industry hence […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Curran’s century leads Zimbabwe to victory",
            "url": "https://www.chronicle.co.zw/currans-century-leads-zimbabwe-to-victory/",
            "content": "Brandon Moyo,[emailprotected]\n\nBEN Currans maiden One Day International (ODI) century propelled Zimbabwe to a commanding nine-wicket victory over Ireland in the series decider at Harare Sports Club yesterday.\n\nThe 28-year-olds unbeaten ton, which featured contributions to two record-breaking partnerships, helped Zimbabwe secure the three-match series 2-1.\n\nThe Chevrons controlled the match with the bat, ensuring that for the 20th time in the format, they chased a target exceeding 240 runs.\n\nCurran and his record-breaking opening partner, Brian Bennett, batted with intent from the start, putting on an entertaining display before captain Craig Ervine came in to continue the excellent batting show.\n\nCraig Ervine\n\nStars had to align for an under-pressure Zimbabwean side, and fortune smiled early when, for the first time this series, Ervine won the toss and chose to field first.\n\nHis bowlers delivered, restricting Ireland to 240/6 before Zimbabwe comfortably chased down the target in just 39.2 overs, finishing on 246/1. This secured their first series win since 2023, when they defeated the Netherlands 2-1 in Harare.\n\nIt also marked the Chevrons joint-largest margin of victory by wickets, matching their nine-wicket win over Kenya in Bulawayo in 2002.\n\nCurran and Bennetts 124-run opening stand is now the joint seventh-highest first-wicket partnership for Zimbabwe in ODIs, tied with that of Grant and Andy Flower (vs New Zealand in 1992; vs Kenya in 1997).\n\nIt was also the first century opening stand for Zimbabwe in the past 10 years, with the previous one coming in 2014 when Sikandar Raza and Hamilton Masakadza put on 224 runs against Afghanistan at Queens Sports Club.\n\nAfter Bennett fell, Curran and Ervine had a 122-run stand for the second wicket, which is now the 10th-highest second-wicket partnership for Zimbabwe in ODIs.\n\nIn the 10th over, Curran smashed 15 runs off Josh Little, including three boundaries, setting up Zimbabwes best powerplay score in ODIs at 77/0, surpassing the previous best of 75.\n\nCurran, in just his sixth ODI for Zimbabwe, brought up his maiden century off 120 balls with a four. He also became the first member of the Curran family to score a century in international cricket.\n\nUnbelievable feeling, and also to get the series win is a big thing for us. Just happy to contribute. To be honest, I wouldnt say theres too much of a difference (in the games). I think in the first two games, I didnt face many balls in the Power Play, and hit a couple fielders so it didnt quite necessarily go my way, but it was running smoothly as I would have liked. Luckily, today, I hit the gaps a couple over for twos then, all good.\n\nUnbelievably a good feeling and very proud to be here representing Zimbabwe, said Curran.\n\nBennett finished the series with 247 runs from three innings at an impressive average of 82.33, etching his name into Zimbabwes cricketing history.\n\nHis tally in this series now stands as the third-highest by a Zimbabwean batter in a three-match ODI series, following Brendan Taylors 310 runs against New Zealand in 2011/12 and Sikandar Razas 252 runs against Bangladesh in 2022.\n\nI am just doing my best and doing one for the team, said Bennett.\n\nHeading into the decider, both Zimbabwe and Ireland fielded unchanged teams.\n\nZimbabwes bowlers did well to restrict Irelands scoring, claiming the first breakthrough in the seventh over when Richard Ngarava dismissed Paul Stirling for nine runs, caught by Johnathan Campbell.\n\nTrevor Gwandu then struck to remove Curtis Campher for 11 runs, also caught by Campbell, leaving Ireland on 42/2 in 13,3 overs.\n\nAndy Balbirnie and Harry Tector put together an 86-run partnership for the third wicket before Balbirnie was dismissed for 64 off 99 balls.\n\nTector fell in the 39th over for 51 off 84 balls, leaving Ireland on 159/4. Lorcan Tucker contributed 61 runs off 54 balls, but Blessing Muzarabani dismissed him, helping drag Ireland to a respectable total of 240/6.\n\nNgarava and Gwandu picked up two wickets apiece, finishing with figures of 2/42 and 2/44 respectively, while Muzarabani (1/47) and Wellington Masakadza (1/58) claimed the other two wickets.\n\nZimbabwes chase started strongly, with Bennett and Curran playing aggressively, hitting boundaries.\n\nBennett would fall just two runs shy of his half-century, trapped in front by Graham Hume. Bennett departed for 48 off as many ball, bringing Ervine to the crease.\n\nThe captain brought up his 23rd half-century off 43 balls and scored the winning runs with a towering six.\n\nCurran remained unbeaten on 118 from 130 balls, while Ervine finished on 69 not out from 59 deliveries.\n\nCurran was named Player of the Match, while Bennett was named Player of the Series.\n\nUp next is a three-match T20I series, which kicks off on Saturday at Harare Sports Club.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/xcbzhbvfzrtfhx-1.jpg",
            "description": "Brandon Moyo, brandonamalvin9@gmail.com BEN Curran’s maiden One Day International (ODI) century propelled Zimbabwe to a commanding nine-wicket victory over Ireland in the series decider at Harare Sports Club yesterday. The 28-year-old’s unbeaten ton, which featured contributions to two record-breaking partnerships, helped Zimbabwe secure the three-match series 2-1. The Chevrons controlled the match with the bat, ensuring […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Feli Nandi’s journey inspires new album",
            "url": "https://www.chronicle.co.zw/feli-nandis-journey-inspires-new-album/",
            "content": "Showbiz Reporter\n\nNo doubt, 2024 was a great year for Afro-fusion musician Feli Nandi, and indications are that 2025 will be equally outstanding for the talented artiste.\n\nBorn Felistus Chipendo, Feli is celebrated for her dynamic musical style and exceptional fashion sense.\n\nLast year, the Mubayei, Mufudzi Wangu and Unotyei hit-maker became a regular fixture at Doek & Slay events, and successfully staged a nationwide tour.\n\nShe secured notable local gigs, including slots at the famed OK Grand Challenge and Chibuku Road to Fame national finals. She also crossed the countrys borders, performing in Germany at the Moto Moto Festival and in the UK.\n\nThe founder of Feli Nandi Apparels, a fashion line that showcases her talent in African attire, Feli expanded her entrepreneurial ventures last year as she opened a restaurant, Kwa Nandi, in Harare, specialising in traditional Zimbabwean meals.\n\nThis year, she is continuing on that trajectory with plans to release her second studio album, Ndisiyei at 7 Arts Theatre in Harare on March 22. The album, which follows her debut, Izwi features eight tracks.\n\nSpeaking on the upcoming release, Felis manager, Connie Mazanhi, said: The album has eight tracks. Its quite personal as its based on real-life events and true stories, including themes of death and suicide.\n\nAsked which track is likely to be a hit, Mazanhi said: All of them are Felis favourites, so I cant quite single out any one.\n\nShe also hinted at collaborations on the album but kept the featured artistes under wraps.\n\nThe album, available from March 22 on all digital platforms, experiments with new sounds and techniques, she said.\n\nWith Feli Nandi now boasting a significant following both locally and internationally, Mazanhi confirmed plans for a nationwide tour.\n\nFelis musical journey began in 2018 as a backing vocalist for Mbeu and the Mhodzi Tribe where she honed her craft before launching a solo career in 2020.\n\nHer collaboration with Trevor Dongo on the single Mufudzi WeMombe was a pivotal moment that propelled her into the spotlight.\n\nInfluenced by legendary Zimbabwean artistes such as Oliver Mtukudzi, Thomas Mapfumo and Chiwoniso Maraire, Feli Nandis music seamlessly blends traditional and contemporary sounds.\n\nHer powerful vocals and emotive lyrics often explore themes of love, resilience and cultural pride.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jhgfhjfghghfdxsd-1.jpg",
            "description": "Showbiz Reporter No doubt, 2024 was a great year for Afro-fusion musician Feli Nandi, and indications are that 2025 will be equally outstanding for the talented artiste. Born Felistus Chipendo, Feli is celebrated for her dynamic musical style and exceptional fashion sense.  Last year, the “Mubayei”, “Mufudzi Wangu” and “Unotyei” hit-maker became a regular fixture […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Competitiveness  Summit kicks off: Set to address informal sector challenges",
            "url": "https://www.chronicle.co.zw/competitiveness-summit-kicks-off-set-to-address-informal-sector-challenges/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE National Competitiveness Commission (NCC) inaugural annual Competitiveness Summit kicks off in Bulawayo amid hopes the platform will provide solution-based resolutions to creating a fair level-playing field where business operations across sectors are integrated to drive mutual economic gains.\n\nPresident Mnangagwa is expected to grace the event tomorrow during which he will interact with industry leaders and other key stakeholders.\n\nOrganisers have said the event provides a dynamic convergence of public, private, development partners, academia and other non-state actors to engage in dialogue and develop sustainable reforms and resolutions that will improve productivity and competitiveness.\n\nZimbabwe Chamber of Commerce vice president for Matabeleland Chapter, Mr Louis Herbst, said the Competitiveness Summit presents a crucial opportunity to address the challenges posed by the informal sector while fostering a more competitive environment for formal traders.\n\nIts essential to recognise the contributions that informal traders make to our economy. Rather than simply pushing them out, we should develop educational programmes that help them understand the value of their businesses and the benefits of operating legally, said Mr Herbst.\n\nBy providing resources and support, we can encourage these vendors to formalise their trade, which in turn can enhance their sustainability and profitability.\n\nMoreover, we need to address the role of the formal sector in this equation. Its important for formal businesses to discourage practices that support the informal sector as this can create a reverse effect that ultimately impacts their operations.\n\nMr Herbst said the Government isputting measures in place to combat smuggling and other illegal activities and businesses should collectively accept that these changes would not happen overnight, urging the industry to support these initiatives for long-term stability.\n\nHe said it can be a bitter pill to swallow as many in the industry have become accustomed to adapting and seeking out loopholes to maximise profits.\n\nHowever, Mr Herbst said it was time everyone treat Zimbabwe as their home.\n\nWe must revisit our foundational values and support the countrys development rather than operating as if were planning a mass exodus, he said.\n\nThis mindset encourages short-term accumulation of wealth without considering the long-term impacts of our actions on the economy and society at large.\n\nI hope the summit will lead to actionable strategies that not only address the challenges of the informal sector but also promote a collaborative approach to building a more robust and competitive economic environment for all stakeholders.\n\nThe event is expected to serve as a powerful tool for building national consensus on enhancing the countrys global competitiveness and fostering collaboration, innovation and adaptability among stakeholders.\n\nConfederation of Zimbabwe Industries Matabeleland Chapter president, Mr Stephen Ncube, said industry expects discussions on improving the ease of doing business with emphasis on regulatory costs.\n\nHe said over the past decade, the economy has been beset by escalating regulatory costs and licensing requirements thereby significantly undermining competitiveness.\n\nRegulatory costs account for 20 percent of the total overheads. This is evident in the decline of domestic market share to imports and the loss of export markets for locally manufactured goods, said Mr Ncube.\n\nAs the industry, we strongly advocate for a reduction of the regulatory costs.\n\nElectricity charges went up in 2024 so much that this became strenuous to industry. Charges went up by between 75 percent and 100 percent. Industry has proposed a tariff reduction roadmap from 17cents per kilowatt-hour to nine cents per kilowatt-hour to enhance competitiveness.\n\nHe said the industry expects the Summit to interrogate tariffs charged by city councils and recommend tariffs that are sustainable for the industry to attract investment. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vxsdef4qw5gf.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com THE National Competitiveness Commission (NCC) inaugural annual Competitiveness Summit kicks off in Bulawayo amid hopes the platform will provide solution-based resolutions to creating a fair level-playing field where business operations across sectors are integrated to drive mutual economic gains. President Mnangagwa is expected to grace the event tomorrow during which he will interact […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Hwange’s giant ‘Big Charlie’ dies at almost 60",
            "url": "https://www.chronicle.co.zw/hwanges-giant-big-charlie-dies-at-almost-60/",
            "content": "Sikhumbuzo Moyo,Chronicle WriterTHE Hwange community has been plunged into mourning following the death of iconic figure, Charles Nyoni, popularly known as Big Charlie whose gigantic stature mesmerised anyone seeing him for the first time.\n\nNyoni, who was set to celebrate his 60th birthday next month, died yesterday morning at St Patricks Hospital in Empumalanga.\n\nHe was admitted to the hospital on Thursday last week.\n\nAccording to his sister and family spokesperson, Ms Susan Ndlovu, Big Charlie had a high blood pressure and was diabetic.\n\nHe was rushed to hospital on Thursday night last week and has been in hospital since then. We were hopeful that he would make it but unfortunately he could not, she said.\n\nMs Ndlovu said Big Charlie died yesterday and as a family they were very devastated following his death.\n\nWe are still to meet as family to discuss funeral arrangements but mourners are gathered at his house at A 52 Lwendulu Village, said Ms Ndlovu.\n\nTowering at over 2,1m and weighing 300kgs, Nyoni was 41cm shorter than the tallest man in the world, Turkeys Sultan Kosen. He wore a size 22 shoe.\n\nBig Charlie used to have a big teapot for breakfast while for lunch or dinner, he required a meal that is normally eaten by three men. He could eat a full chicken in one sitting.\n\nFor many years, many residents in Hwange thought his surname was Gumbo because everyone called him Charles Gumbo unbeknown to them that it was in reference to his big feet.\n\nBig Charlie was retrenched in 2012 by the Hwange Colliery Company where he worked as a builder and refuse collector. Legend has it that during his time at the Colliery, while his workmates would carry a 50kg bag of cement in pairs, Big Charlie would easily carry four 50kg bags at one go.\n\nHis condition is known as gigantic acromegaly, a rare disorder caused by high levels of growth hormone. People with the condition have a short lifespan owing to their susceptibility to infection and metabolic disorders.\n\nBy the time I reached 11, I could not fit into a shoe size for children of my age. Initially, my mother bought me the type of shoes that are known as Farmer Shoes but I quickly outgrew even the biggest size, Nyoni said in one of his many interviews with the Zimpapers stable.\n\nWhen he was 17, his mother sent him for tests at Parirenyatwa Hospital in Harare where a lot of tests were done but due to financial constraints, he was not able to complete them.\n\nBig Charlie was raised by a single mother as his father was a victim of the Kamandama Mine Disaster that claimed the lives of 427 miners when an underground shaft collapsed at Hwange Colliery Mine.\n\nBriefly employed by Hwange Colliery as a refuse collector, the company struggled to get him overalls and safety shoes.\n\nHwange Colliery Company Limited\n\nAt one time, the mine contracted a shoe-manufacturing company to produce shoes specifically for him. The shoe-manufacturing company later ran out of the special material that was used to produce the custom shoes.\n\nNyoni died without fulfilling his wish of personally meeting the First Lady, Amai Auxilia Mnangagwa as he had told our sister publication, Sunday News during an interview in 2020.\n\nDuring the interview, Big Charlie said he was hopeful that if he was to meet the First Lady, his life and living conditions would change for the better.\n\nI would like to meet Amai venyika, Amai Mnangagwa so that she gets to see and appreciate my plight, I cannot walk. My car is down too. If I try to use public transport the drivers do not allow me, he said then.\n\nThey dont want. I would be glad to meet her in person, Cde Victor Matemadanda visited me at one time and he said she would come and see me one day but I am still waiting for that visit, Nyoni was quoted saying then.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/xasssssxc-2.jpg",
            "description": "Sikhumbuzo Moyo,Chronicle Writer THE Hwange community has been plunged into mourning following the death of iconic figure, Charles Nyoni, popularly known as ‘Big Charlie’ whose gigantic stature mesmerised anyone seeing him for the first time. Nyoni, who was set to celebrate his 60th birthday next month, died yesterday morning at St Patrick’s Hospital in Empumalanga. […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Bulawayo ready to host memorable National Youth Day commemorations",
            "url": "https://www.chronicle.co.zw/bulawayo-ready-to-host-memorable-national-youth-day-commemorations/",
            "content": "Nqobile Tshili,[emailprotected]ALL is set for the hosting of the National Youth Day commemorations in Bulawayo this Friday where President Mnangagwa will lead proceedings amid expectations that the event will spotlight key youth empowerment programmes and investments ushered in by the Second Republic as part of its inclusive development agenda.\n\nThe National Youth Day is commemorated annually on February 21 and this year the event will be held at the Zimbabwe International Exhibition Centre (ZIEC).\n\nThousands of youths from across the country are expected to attend the gathering, which will run under the theme: Empower Youth, Secure the Future.\n\nExcitement has already gripped the City of Kings ahead of the event amid high hopes the programme will inspire young people and deliver solutions to some of the challenges facing the country while unlocking opportunities for the youths.\n\nSpeaking ahead of the event, Bulawayo Provincial Affairs and Devolution Minister, Judith Ncube, said the province is ready to host the National Youth Day commemorations.\n\nHon. Judith Ncube Minister of State for Provincial Affairs and Devolution\n\nOn Monday we had a preparatory meeting for the National Youth Day commemorations. Due to the prevailing weather conditions we resolved that we move the venue for the event from Barbourfields Stadium to ZITF grounds (ZIEC). Preparations are moving swiftly and we are happy with the progress so far, said Minister Ncube.\n\nShe said hosting another national event is very significant for the City of Bulawayo as it speaks to local development.\n\nIts very important for Bulawayo to be hosting such national events. It gives us the opportunity to show our capabilities and capacity. While we might not have adequate accommodation we have successfully played host to these national events, she said.\n\nIm challenging young people to come in their numbers and showcase the Bulawayo culture.Minister Ncube said tomorrow various stakeholders that are involved in youth programming will be showcasing their projects and it will be essential for young people to participate.\n\nShe said issues to do with drugs and substance abuse will be tackled during the engagements.Government has empowered many young people through its various programmes and some of them are now running their own businesses.\n\nHigher and Tertiary Education, Innovation, Science and Technology Development Permanent Secretary, Professor Fanuel Tagwira, said universities and colleges are now churning out graduates with knowledge and skills to compete in the 21st century.\n\nThrough Heritage Education 5.0, universities and polytechnic colleges provide students with a solid foundation in their chosen field, equipping them with theoretical knowledge, practical skills and entrepreneurial mind set, he said.\n\nPolytechnic colleges, in particular, focus on providing hands-on training in technical fields that enable young people to go and start businesses, said Prof Tagwira.\n\nHe said Government has this year mandated universities to ensure students innovations are commercialised.\n\nIn 2025, President Mnangagwa has directed the ministry to support commercialisation of student prototypes and ideas from innovation hubs into start-up businesses that can create employment, he said.\n\nBy providing young people with a comprehensive education, practical skills, and personal development opportunities, our universities and polytechnic colleges empower them to succeed in their careers, make meaningful contributions to society, and become active, responsible citizens, said Prof Tagwira.\n\nHe said the introduction of innovation hubs at institutions of higher learning has been prioritised to promote critical thinking, analysis and problem-solving, thereby helping students develop essential life skills.\n\nProf Tagwira said students are encouraged to collaborate and build strong relationships with peers as well as mentors while developing leadership skills.\n\nMost of our universities and colleges now offer opportunities for students to take on leadership roles, participate in extracurricular activities and develop entrepreneurial skills, he said.\n\nAll our Universities and colleges in Zimbabwe offer strong industrial internship programmes, providing students with valuable learning experience and job opportunities.\n\nInstitutions offer career counselling services, helping students explore their interests, identify career paths, and create personalised career plans, said Prof Tagwira.\n\nHe said the Government is also cognisant that some students may be handicapped to pay their tertiary fees hence the work for fees programme being rolled at all the institutions.\n\nStudents in tertiary institutions face challenges of raising school fees for their studies. The Government has started a work study programme at all our universities and colleges to make sure no child fails to get higher education because of the circumstances of the parents, said Prof Tagwira.\n\nStudents with disabilities tend to get disadvantaged by their physical condition. Government has now come up with a programme of providing assistive devices to such students to enhance their learning.\n\nProf Tagwira said the Government also encourages students to be part of alumni communities, which have also become a key enabler for professional growth through networking.\n\nHe said institutions of higher learning also provide platforms for young people to address social issues including drugs and substance abuse.\n\nUniversities and polytechnic colleges foster diverse and inclusive environments, promoting cross-cultural understanding, empathy, and social responsibility.\n\nWith the current drug menace in Zimbabwe our Institutions offer counselling services, support groups, and wellness programmes to promote students mental health and overall well-being, he said.-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vcxsgrag.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw ALL is set for the hosting of the National Youth Day commemorations in Bulawayo this Friday where President Mnangagwa will lead proceedings amid expectations that the event will spotlight key youth empowerment programmes and investments ushered in by the Second Republic as part of its inclusive development agenda. The National Youth Day […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Bulawayo dams cumulatively receive 21pc rain water",
            "url": "https://www.chronicle.co.zw/bulawayo-dams-cumulatively-receive-21pc-rain-water/",
            "content": "Nqobile Tshili,[emailprotected]\n\nBULAWAYOs water supply dams have received a cumulative 21 percent inflows since the beginning of the rainy season with water levels rising to 44 percent, according to a latest report.\n\nThe water levels are a percent higher than during the same period last year, indicating that the citys supply dams have not recorded significant inflows despite the heavy rains being received across the country.\n\nMost parts of the country have been receiving heavy rains with some dams spilling but the rains have not translated to improved inflows to Bulawayos supply dams.\n\nAccording to the Bulawayo City Council report, Insiza has recorded 18 percent inflows since the start of the rainy season with Inyakuni recording six percent, Lower Ncema 11 percent, Umzingwane 40 percent and Mtshabezi 46 percent  all translating to a 21 percent cumulative average.\n\nThe global increase to date due to the rains this season is 21,29 percent of overall dam capacity, said council.\n\nUpper Ncema Dam gates were opened to release water into Lower Ncema, which had reached a critical low of 9,26 percent on Wednesday 12 of February 2025.\n\nBulawayo remains under a 130-hour weekly water shedding programme as part of measures to conserve water.\n\nBulawayo mayor, Councillor David Coltart, said the city is coming from a dry season and the illegal mining activities have also contributed to reduced inflows into the citys supply dams.\n\nWe have three main reasons why our inflows are still very low. The first one is that some of our dams such as Umzingwane Dam were now empty and secondly, we are coming from a very dry season, meaning the soil was very dry. The illegal gold mining activities are also contributing to the reduced inflows, he said.\n\nUmzingwane Dam\n\nClr Coltart said he was hopeful that more rains will be received, which will enable the council to review its water shedding programme.\n\nAs you might have seen, our inflows are one percent higher than they were last year.\n\nSo, it will be foolish to suspend the water shedding programme at the moment. We hope that more rains will be received so that we review the existing schedule, he said.\n\nThe country is expecting more rains until the end of March with the Meteorological Service Department advising that Matabeleland region and Midlands are expected to receive heavy downpours today and tomorrow.  -@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bdfzbxcvzdxcv.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw BULAWAYO’s water supply dams have received a cumulative 21 percent inflows since the beginning of the rainy season with water levels rising to 44 percent, according to a latest report. The water levels are a percent higher than during the same period last year, indicating that the city’s supply dams have not […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        },
        {
            "title": "Zimbabwe National Youth Day: A celebration of the country’s future",
            "url": "https://www.chronicle.co.zw/zimbabwe-national-youth-day-a-celebration-of-the-countrys-future/",
            "content": "Innocent Mujeri,Correspondent\n\nEVERY year on February 21, Zimbabweans come together to celebrate National Youth Day, a day dedicated to honouring the vital role that young people play in shaping the countrys present and future. Established as a national holiday in 2017, this day is an opportunity to reflect on the immense potential that Zimbabwean youth possess and to encourage their active participation in national development. More than just a commemoration, National Youth Day is a call to action  a reminder that investing in young people is investing in the countrys prosperity.\n\nZimbabwes youth make up a significant portion of the population. According to recent statistics, over 60 percent of Zimbabwes population consists of young people under the age of 35. This demographic structure presents both a challenge and an opportunity. The challenge lies in ensuring that young people are provided with adequate education, employment opportunities, and platforms to contribute meaningfully to the countrys development. The opportunity, however, is immense: a well-equipped and empowered youth population can drive innovation, economic growth, and social progress. National Youth Day is more than just a public holiday  it is a symbol of hope, unity, and renewal. It highlights the importance of youth empowerment and the role of young people in shaping a better Zimbabwe. The day is also tied to the legacy of former President Cde Robert Mugabe, who played a significant role in advocating for youth inclusion in national matters. The essence of this day is to celebrate the young generation and their potential to transform the country.\n\nDespite their potential, young Zimbabweans face numerous challenges, including limited access to capital for entrepreneurial ventures, and gaps in the education system that do not always align with modern job market demands. However, these challenges should not be seen as roadblocks but rather as areas that require strategic solutions and government intervention. One of the most pressing issues is unemployment. Many young people graduate from universities and technical colleges only to find limited job opportunities. The key to solving this issue lies in promoting entrepreneurship and equipping young people with skills that enable them to create their own opportunities. The government has taken steps toward youth empowerment through initiatives such as the Zimbabwe Youth Council (ZYC), youth empowerment banks, and skills development programmes. However, there is still a need for more robust and sustainable policies that support young people in translating their ideas into successful businesses and careers.\n\nEducation also plays a crucial role in youth development. While Zimbabwe boasts a high literacy rate, the education system must continue evolving to meet the demands of the digital age. STEM (Science, Technology, Engineering, and Mathematics) education, vocational training, and digital literacy should be emphasised to ensure that young people are equipped with relevant skills. Additionally, there should be stronger collaboration between educational institutions and industries to bridge the gap between theoretical knowledge and practical skills. Zimbabwes young people are not just the leaders of tomorrow they are the changemakers of today. Across various sectors, youth are making significant contributions, from agriculture and technology to arts and civic engagement. In agriculture, young farmers are embracing modern techniques, such as hydroponics and organic farming to boost food security and contribute to the economy. With the right support, agriculture can become an attractive and viable career option for young Zimbabweans, helping to reduce unemployment and increase productivity.\n\nTechnology is another area where youth are driving progress. The rise of startups in fintech, e-commerce, and software development demonstrates the innovative spirit of Zimbabwes young entrepreneurs. Access to technology and internet connectivity remains a challenge in some rural areas, but as the government and private sector invest in digital infrastructure, more opportunities will open up for young innovators. The arts and entertainment industry is another space where Zimbabwean youth are excelling. From music and film to fashion and literature, young creatives are telling Zimbabwes stories and making an impact on both local and international platforms. Recognising and supporting the creative economy can provide sustainable livelihoods for many talented young people. Additionally, youth engagement in civic and political matters is increasing. More young people are participating in policy discussions, advocating for their rights, and contributing to community development. It is essential to create more platforms where youth voices are heard and considered in decision-making processes.\n\nAs Zimbabwe celebrates National Youth Day, it is essential to move beyond rhetoric and take concrete steps to support youth development. Enhancing youth participation in governance is crucial, and young people should be given more opportunities to participate in leadership and decision-making at local and national levels. This can be achieved through youth representation in government structures, policy-making bodies, and advisory councils. Strengthening vocational training and entrepreneurship support is equally important. There is a need to expand access to vocational training and mentorship programmes that equip youth with practical skills. Additionally, financial institutions should provide flexible funding options for young entrepreneurs.\n\nInvesting in digital infrastructure and innovation is another key area. Expanding internet access and technology hubs can help young Zimbabweans tap into global markets and opportunities. The government and private sector should collaborate in fostering an environment that supports digital startups and tech-driven solutions.\n\nExpanding access to funding for youth projects is essential, as financial support remains a critical factor in youth empowerment. Government initiatives, private sector investments, and international partnerships should provide funding and grants for youth-led businesses and community projects. Encouraging community involvement and volunteering should also be a priority, as youth should be encouraged to engage in community service, environmental conservation, and social impact initiatives. Volunteering not only benefits communities but also builds leadership and teamwork skills among young people.\n\nZimbabwes National Youth Day is a powerful reminder of the resilience, talent, and potential of young people. As the country looks ahead, it must continue to prioritise youth development by providing the necessary support, resources, and opportunities for young people to thrive. A nation that invests in its youth is a nation that secures its future. By celebrating National Youth Day with optimism and a commitment to action, Zimbabwe can harness the energy, creativity, and ambition of its youth to build a brighter and more prosperous future for all. Let this day serve as both a celebration and a call to action  because the future of Zimbabwe is in the hands of its youth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fgrgerf.jpg",
            "description": "Innocent Mujeri, Correspondent EVERY year on February 21, Zimbabweans come together to celebrate National Youth Day, a day dedicated to honouring the vital role that young people play in shaping the country’s present and future. Established as a national holiday in 2017, this day is an opportunity to reflect on the immense potential that Zimbabwean youth […]",
            "time": "08:35",
            "date": "19 Feb 2025"
        }
    ]
}