{
    "news": [
        {
            "title": "Mugshot, khaki uniform and solitary cell for South Korea’s detained President Yoon",
            "url": "https://www.chronicle.co.zw/mugshot-khaki-uniform-and-solitary-cell-for-south-koreas-detained-president-yoon/",
            "content": "SEOUL, Jan 20 (Reuters)  South Koreas impeached President Yoon Suk Yeol has spent his first night incarcerated as a pre-trial inmate at the Seoul Detention Centre after a court issued a formal detention warrant on Sunday to hold him for up to 20 days.\n\nHe became the first incumbent president to be arrested in South Korea last week and was detained for an initial 48 hours of questioning, over a probe into whether he committed insurrection with his bid to declare martial law on Dec. 3.\n\nThe following are some facts about the facility and what is expected to unfold for the former prosecutor-turned-president.\n\nAfter becoming a pre-trial inmate, he had photographs taken for identification and underwent a thorough physical inspection, a corrections service official said.\n\nIt doesnt matter if youre the president, everyone gets a photograph taken 100 percent of the time when youre entering the facility, said the official, who declined to be identified because he was not authorised to speak to the media.\n\nThe physical inspection is not only to check on health, but also on whether youre hiding something, said the official.\n\nKorea Correctional Service chief Shin Yong-hae told a parliament judiciary committee on Monday that Yoon had cooperated and the process went without any incident.\n\nInmates held in detention before trial such as Yoon are given a two-piece khaki-coloured uniform, while convicted inmates wear blue-grey uniforms.\n\nYoon spent the night well, Shin said.\n\nAfter he was processed, Yoon was moved to the general detention section where he was allocated a solitary cell measuring about 12 square metres (129 square feet), Shin said. That is larger than the usual 3.4 square metre single cell.\n\nThe Seoul Detention Centre, despite its name, is in the city of Uiwang, 22 km (14 miles) south of Seoul, and previously held high-profile figures including former President Park Geun-hye and Samsung Electronics\n\n(005930.KS), opens new tabChairman Jay Y. Lee.\n\nAs a pre-trial detainee, Yoon will rise with other inmates at 6:30 a.m. and lights out will be at 9 p.m.\n\nThe Korea Correctional Service, which operates the countrys prisons and detention centres, says in its regulations and menu section that it provides inmates with 2,500 calories of food per day at a cost of about 1,600 won ($1.09) per meal.\n\nFood is normally traditional Korean fare. Dinner on Wednesday when Yoon spent the first night there under arrest was bean sprout soup, barbecued beef and kimchi, according to information provided by the centre.\n\nBreakfast details for Monday were not immediately available.\n\nYoon was arrested last week under a warrant that allowed authorities to hold him for up to 48 hours, issued by a court when the suspect in a criminal case refuses to answer summons or cooperate.\n\nUnder South Korean law, detention is a separate process where investigators can hold a suspect for up to 20 days, for further questioning if deciding there are grounds to believe a suspect may try to tamper with evidence or witnesses or is a flight risk.\n\nIf an indictment is brought, the detention can last for another six months.\n\nThe criminal investigation against Yoon is led by the Corruption Investigation Office for High-ranking Officials (CIO) launched in 2021 to investigate high-ranking officials including the president and their family members.\n\nBut it does not have the authority to prosecute the president and must refer any case to the prosecutors office for further action.\n\nYoon has up to now refused to answer questions from the CIO and his lawyers have argued the arrest is illegal because the warrant was issued in the wrong jurisdiction and the investigating team had no mandate for their probe.\n\nInsurrection, the crime that Yoon may be charged with, is one of the few that a South Korean president does not have immunity from and is technically punishable by death. South Korea, however, has not executed anyone in nearly 30 years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/kt76.jpg",
            "description": "SEOUL, Jan 20 (Reuters) – South Korea’s impeached President Yoon Suk Yeol has spent his first night incarcerated as a pre-trial inmate at the Seoul Detention Centre after a court issued a formal detention warrant on Sunday to hold him for up to 20 days. He became the first incumbent president to be arrested in […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "Triumphant Trump returns to White House, launching new era of upheaval",
            "url": "https://www.chronicle.co.zw/triumphant-trump-returns-to-white-house-launching-new-era-of-upheaval/",
            "content": "WASHINGTON, Jan 20 (Reuters) Donald Trumpwill be sworn in as U.S. president on Monday, ushering in another turbulent four-year term with promises to push the limits of executive power, deport millions of immigrants, secure retribution against his political enemies and transform the role of the U.S. on the world stage.\n\nTrumpsinauguration completes a triumphant comebackfor a political disruptor who survived two impeachment trials, a felony conviction, two assassination attempts and an indictment for attempting to overturn his 2020 election loss.\n\nThe ceremony will take place at noon (1700 GMT) inside the Rotunda of the U.S. Capitol, four years after a mob of Trump supporters breached the symbol of American democracy in an unsuccessful effort to forestall the Republican Trumps 2020 defeat to Democrat Joe Biden. The swearing-in was moved indoors for the first time in 40 years due to the extreme cold.\n\nTrump, the first U.S. president since the 19th century to win a second term after losing the White House, has said he will pardon on Day One many of the more than 1,500 people charged in connection with the Jan. 6, 2021, attack.\n\nThat promise is among a flurry of executive actions concerning immigration, energy and tariffs that Trump intends to sign as soon as Monday after taking the oath of office. At a campaign-style rally on Sunday in Washington, Trumpvowed to impose harsh immigration restrictionson his first day.\n\nAs he did in 2017, Trump enters office as a chaotic and disruptive force, vowing to remake the federal government and expressing deep skepticism about the U.S.-led alliances that have shaped post-World War Two global politics.\n\nThe former president returns to Washington emboldened after winning the national popular vote over Vice President Kamala Harris by more than 2 million votes thanks to a groundswell of voter frustration over persistent inflation, though he still fell just short of a 50% majority. In 2016, Trump won the Electoral College  and the presidency  despite receiving nearly 3 million fewer votes than Hillary Clinton.\n\nJeremi Suri, a presidential historian at the University of Texas at Austin, compared the present era to the late 19th century, when Grover Cleveland became the only other president to win non-consecutive terms. Like now, he said, that was a time of upheaval, as industrial advances transformed the economy, wealth inequality exploded and the proportion of immigrant Americans reached a historical peak.\n\nWhat were really talking about is a fundamentally different economy, a fundamentally different country in terms of its racial and gender and social makeup, and we are as a country struggling to figure out what that means, he said. Its an existential moment.\n\nTrump will enjoy Republican majorities in both chambers of Congress that have been almost entirely purged of any intra-party dissenters. His advisers have outlined plans to replace nonpartisan bureaucrats with hand-picked loyalists.\n\nEven before taking office, Trump established a rival power center in the weeks after his election victory, meeting world leaders and causing consternation by musing aloud about seizing the Panama Canal, taking control of NATO ally Denmarks territory of Greenland and imposing tariffs on the biggest U.S. trading partners.\n\nHis influence has already been felt in theIsrael-Hamas announcementlast week of a ceasefire deal. Trump, whose envoy joined the negotiations in Qatar, had warned ofhell to payif Hamas did notrelease its hostagesbefore the inauguration.\n\nTrump claimed during the campaign he would end the Russia-Ukraine war on his first day, but hisadvisers have acknowledgedany peace deal will take months.\n\nUnlike in 2017, when he filled many top jobs with institutionalists, Trump has prioritized fealty over experience in nominating a bevy of controversial cabinet picks, some of whom are outspoken critics of the agencies they have been tapped to lead.\n\nHe also has the backing of the worlds richest man, Elon Musk, whospent more than $250 millionto help get Trump elected. Other billionaire tech leaders who have sought to curry favor with the incoming administration, such as Amazons Jeff Bezos, Metas Mark Zuckerberg, Alphabets Sundar Pichai and Apples Tim Cook, will join Musk in attending Mondays ceremony, according to Reuters and other media.\n\nTrump said on Sunday he will travel to California on Friday to visit fire-ravaged Los Angeles County.\n\nThe inauguration will proceedamid heavy securityafter a campaign highlighted by anincrease in political violencethat included two assassination attempts against Trump, including one in which a bullet grazed his ear.\n\nFederal authorities are also on alert after the New Years Day attack in New Orleans, when investigators say a U.S. Army veteran inspired by the Islamic State drove a pickup truck into a crowd of revelers, killing 14. Last week, the FBIwarned of potential copycat attacks.\n\nEight years ago, Trump delivered a bleak inaugural address vowing to end the American carnage of what he said were crime-ridden cities and soft borders, a departure from the tone of optimism most newly elected presidents have adopted.\n\nForeign governments will be scrutinizing the tenor of Trumps speech on Monday after he waged a campaign laced with inflammatory rhetoric.\n\nThe traditional parade down Pennsylvania Avenue past the White House will now take place indoors at the Capital One Arena, where Trump held his victory rally on Sunday. Trump will also attend three inaugural balls in the evening.\n\nAmid the pageantry of the day, Trump will begin signing the first of what could be dozens of executive orders.\n\nSome actions will begin tightening immigration rules by seeking to classify drug cartels as foreign terrorist organizations and declare an emergency at the U.S.-Mexico border, among other moves, a source familiar with the planning said.Other ordersmay aim to scrap Bidens environmental regulations and withdraw the U.S. from the Paris climate agreement, sources have said.\n\nMany of the executive orders are likely to face legal challenges.\n\nTrump will be thefirst felon to occupy the White Houseafter a New York jury found him guilty of falsifying business records to cover up hush money paid to a porn star. He escaped punishment at his sentencing, in part because the judge acknowledged the impossibility of imposing penalties on a soon-to-be president.\n\nWinning the election also rid Trump of two federal indictments  for plotting to overturn the 2020 election and for retaining classified documents  thanks to a Justice Department policy that presidents cannot be prosecuted while in office.\n\nIn a report released last week, Special Counsel Jack Smith said he had gatheredenough evidence to convict Trumpin the election case if Trump had reached trial.\n\nGet weekly news and analysis on U.S. politics and how it matters to the world with the Reuters Politics U.S. newsletter. Sign uphere.\n\nReporting by Joseph Ax; Additional reporting by Steve Holland and Tim Reid; Editing by Ross Colvin and Howard Goller\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/3tr535ry.jpg",
            "description": "Summary Trump promises flurry of executive orders on Day One Trump returns to office more emboldened, experienced Tech billionaires, including Musk, flock to Trump’s side Heavy security for swearing-in after two assassination bids Trump to become first felon to occupy White House WASHINGTON, Jan 20 (Reuters) – Donald Trump will be sworn in as U.S. […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "Trump’s Inauguration Day – what to expect",
            "url": "https://www.chronicle.co.zw/trumps-inauguration-day-what-to-expect/",
            "content": "WASHINGTON, Jan 20 (Reuters) Donald Trumpwill be sworn in as president of the United States on Monday, ushering in his second term in office and capping one of the most astounding political comebacks in American history.\n\nInauguration Dayis, by tradition, largely dedicated to pomp and circumstance. One president leaves the White House, and another moves in. But Trump also has pledged tosign a flurry of executive orderson subjects ranging from border security to oil and gas production on his first day in office.\n\nHere is what we know about Inauguration Day:\n\nTrump will take the oath of office, administered byChief Justice of the United StatesJohn Roberts, at 12 p.m. EST (1700 GMT). It was originally due to take place in front of the U.S. Capitol but will now take placeinside the congressional complexbecause of bitter cold.\n\nTrump will then deliver his inaugural address. In interviews, he has said he intends it to be uplifting and unifying. That would mark a departure from his first Inauguration Day speech in 2017, which detailed a broken country he described asAmerican Carnage.\n\nThe outgoing president, DemocratJoe Biden, has said he plans to attend the ceremony and witness the transfer of power, a courtesy Trump, a Republican, did not afford him four years earlier.\n\nCountry music starCarrie Underwood is scheduled to performat the swearing-in ceremony.\n\nTrump has broken with precedent and invited several foreign leaders to the ceremony. Historically, they have not attended the inauguration due to security concerns and have sent diplomats in their stead.\n\nArgentinas president, Javier Milei, a strong supporter of Trumps, has said he will attend, according to reports.\n\nItalian Prime Minister Giorgia Meloni has said she hopes to attend. Chinese President Xi Jinping is not attending, despite an invitation, but is sending a senior envoy.\n\nTrump adviserElon Musk, CEO of Tesla\n\n(TSLA.O), opens new taband SpaceX, Jeff Bezos, executive chairman of Amazon\n\n(AMZN.O), opens new taband Mark Zuckerberg, CEO of Meta Platforms\n\n(META.O), opens new tab, are also attending.\n\nThe temperatures have also forced organizers to scrap a planned parade down Pennsylvania Avenue of military regiments, school marching bands, floats and citizens groups. The parade will now take place at the 20,000-seat Capital One Arena in downtown Washington.\n\nDuring arallyon Sunday, Trump said he would sign a number of executive actions on Monday covering a range of issues, from ending government programs aimed at ensuring gender and racial diversity in the workplace to securing the southern border with Mexico.\n\nA source familiar with the planning said Trump is preparing to sign more than 200 executive actions on Day One.\n\nThe actions will focus in large part on border security. Among them are directives to classify drug cartels as foreign terrorist organizations, declare an emergency at the U.S.-Mexico border and move toward reinstatement of theRemain in Mexico policywhich forces non-Mexican asylum seekers to wait in Mexico for their U.S. court dates.\n\nHe is expected to signordersthat give immigration officers more latitude to arrest migrants with no criminal records, send more troops to the U.S.-Mexico border and restart construction of a border wall.\n\nThe orders will include a drive to increase fossil fuel production and follow through on Trumps oft-stated campaign vow to drill, baby, drill.\n\nTrump said on Sunday he would issue awave of pardonsfor defendants convicted for their participation in the Jan. 6, 2021, attack on the U.S. Capitol.\n\nTrump also said he wouldrestore TikToksaccess to the U.S. market on Monday.\n\nThere will be at least 18 inaugural galas held throughout Washington over the weekend and Monday, three of which are considered official and which Trump is expected to attend.\n\nOn Sunday, the eve of the inauguration, Trump held a campaign-styleMake America Great Again Victory Rally at the Capital One Arena. It was Trumps first rally in the District of Columbia since the Jan. 6, 2021, attack on the U.S. Capitol.\n\nOn Monday, Metas Zuckerberg will co-host a reception for billionaire Republican donors along with casino magnate Miriam Adelson and Houston Rockets owner Tilman Fertitta, Trumps pick for ambassador to Italy.\n\nOil and gas tycoon Harold Hamm, a top Trump donor, will host an inauguration watch party on Monday on the roof of the historic Hay-Adams hotel near the White House.\n\nThe official events are financed by Trumps inauguration committee, which is chaired by longtime Trump allies Steve Witkoff, a real estate developer who is Trumps pick to be his Middle East envoy, and Kelly Loeffler, a former U.S. senator and Trumps choice to head the Small Business Administration.\n\nThe committee will be responsible for covering the costs of everything but the swearing-in ceremony at the Capitol, which is borne by taxpayers.\n\nBezos and Zuckerberg pledged todonate $1 millioneach to the committee, as have Apple\n\n(AAPL.O), opens new tabCEO Tim Cook and OpenAI CEO Sam Altman. Uber\n\n(UBER.N), opens new taband its CEO, Dara Khosrowshahi, have each donated $1 million to the fund.\n\nTrump raised a record $106.7 million for his 2017 inauguration festivities. His committee has raised more than $170 million this time, according to media reports.\n\nGet weekly news and analysis on U.S. politics and how it matters to the world with the Reuters Politics U.S. newsletter. Sign uphere.\n\nReporting by James Oliphant and Tim Reid in Washington; Editing by Ross Colvin and Howard Goller\n\nSource: Reuters\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jmkj.jpg",
            "description": "WASHINGTON, Jan 20 (Reuters) – Donald Trump will be sworn in as president of the United States on Monday, ushering in his second term in office and capping one of the most astounding political comebacks in American history. Inauguration Day is, by tradition, largely dedicated to pomp and circumstance. One president leaves the White House, […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "Grand send-off for National Hero Siziba",
            "url": "https://www.chronicle.co.zw/grand-send-off-for-national-hero-siziba/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nIT was a fitting tribute for a national hero as the body of the late Major-General (Retired) Solomon Siziba was welcomed with ululations, songs, poetic praises and traditional rituals yesterday at his rural home in Nhwali Village in Gwanda District, Matabeleland South.\n\nHundreds of villagers, Government officials and traditional leaders gathered to pay their respects to a man whose life was devoted to the liberation and development of Zimbabwe.\n\nThe solemn yet celebratory atmosphere was marked by the hauntingly beautiful chants of women, who performed traditional poetry, extolling Sizibas bravery, wisdom and enduring legacy.\n\nPall bearers remove a hearse carrying the body of the late national hero Major General (Rtd) Solomon Siziba from a military helicopter at Nhwali High School in Gwanda\n\nThe village reverberated to life as elderly Venda women led the poetic praises, a cultural ritual to honour his lifes work and formally present him to his ancestors for a warm reception in the afterlife. The moving ceremony reflected the deep respect and gratitude for the contributions of the late national hero.\n\nThe body of the national hero, who passed on last Wednesday, arrived in Gwanda from Bulawayo aboard a military helicopter that landed at Nhwali High School. It was greeted by a large gathering, including Matabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu, Gwanda South legislator and Deputy Minister of Information, Publicity, and Broadcasting Services Dr Omphile Marupi, service chiefs, family members and the local community.\n\nAfter a farewell service at his homestead, the body was transported to Killarney suburb, Bulawayo, where it will lie in state. A Zimbabwe National Army (ZNA) funeral parade is scheduled to take place at Imbizo Barracks today, with burial at the National Heroes Acre on Wednesday.\n\nSpeakers at the farewell ceremony praised Major-General Siziba for his dedication to the nation and his community.\n\nGwanda Ward 24 war veterans chairperson, Cde King Mtlokwa, expressed gratitude for the opportunity to bid farewell to a comrade within their community. He reflected on their shared upbringing and the valuable lessons he learned from the late hero.\n\nFamily representative Mr Isaac Siziba described Major-General Siziba as a selfless individual who prioritised empowering his relatives and extending his generosity to the wider community.\n\nHe said the late national hero was a father figure, even to the elderly.\n\nThe late Major-General (Retired) Solomon Siziba\n\nDr Ndlovu, the chief mourner, said the national hero status bestowed upon Major General Siziba was well-deserved, given his significant contributions to the countrys liberation. Major-General Siziba was a shining example of courage, loyalty and dedication. His unwavering commitment to justice, equality, and freedom made him a true patriot who served our nation with honour and distinction.\n\nHis bravery and strategic thinking shaped the course of our history and his contributions to our defence and security will never be forgotten, she said.\n\nDr Ndlovu expressed her deepest condolences to the Siziba family and the entire community for their loss.\n\nDeputy Minister Marupi, speaking on behalf of Zanu-PF, highlighted the sacrifices made by freedom fighters like Major-General Siziba.\n\nMajor-General Siziba sacrificed a lot of luxuries to liberate the country and hence people like him should be honoured. We are what we are today because of the works of people like him, he said.\n\nBorn in Nhwali, Maj-Gen (Rtd) Siziba attended Nhwali Primary School and proceeded to Manama High School in 1976.\n\nThe following year, he was part of the group that joined the armed struggle together with the now late national hero, Lt-Gen Sibusiso Busi Moyo, Beitbridge East legislator Cde Albert Nguluvhe, former commander of the Airforce, Chief Marshal (Rtd) Elson Moyo and former Zimbabwe International Trade Fair (ZITF) public relations manager, Mrs Cecilia Bhebhe, among others\n\nHe trained in Zambia and was attested into the ZNA during the ceasefire period.\n\nLeft: Pallbearers lift a casket carrying the body of the late national hero Major-General (Rtd) Solomon Siziba from a military helicopter at Nhwali High School in Gwanda. Above: Mourners pay their last respects at the Siziba homestead in Gwanda yesterday\n\nMaj-Gen (Rtd) Siziba was stationed at the Zimbabwe Military Academy in Gweru where he rose to the rank of Captain.\n\nHe was then transferred to the ZNA headquarters where he worked until 2005, rising to the position of Lieutenant-Colonel. He was posted to Botswana as Defence Attach from 2005 to 2013.\n\nUpon his return to Zimbabwe in 2013, Maj-Gen (Rtd) Siziba was appointed the Deputy Commander of One Brigade following his elevation to the rank of Colonel.\n\nFrom 2013 until 2018, he was appointed Director of Administration at the National Prosecuting Authority. Maj-Gen (Rtd) Siziba returned to the ZNA in 2018 and was elevated to the rank of Brigadier-General and was assigned to the Brigadier-General Inspectorate, a post he held until he retired from the military last year.\n\nHe was elevated to the position of Maj-Gen upon his retirement.\n\nMaj-Gen (Rtd) Siziba is survived by two children.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/111-680x380.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw IT was a fitting tribute for a national hero as the body of the late Major-General (Retired) Solomon Siziba was welcomed with ululations, songs, poetic praises and traditional rituals yesterday at his rural home in Nhwali Village in Gwanda District, Matabeleland South. Hundreds of villagers, Government officials and traditional leaders gathered to pay […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "Double heroes’ burial on Wednesday",
            "url": "https://www.chronicle.co.zw/double-heroes-burial-on-wednesday/",
            "content": "Harare Bureau\n\nNATIONAL Heroes Major General (Retired) Solomon Siziba and Cde Chenhamo Chen Chakezha Chimutengwende, who both passed away last week, will be buried at the National Heroes Acre in Harare on Wednesday.\n\nThe Government, through the Ministry of Home Affairs and Cultural Heritage, announced the twin heroes burial.\n\nMaj-Gen Siziba died at Josiah Magama Tongogara Barracks Camp Hospital last Wednesday after a long battle with cancer.\n\nHe was 67.\n\nCde Chimutengwende, a former Minister of Information, Posts and Telecommunications, succumbed to chronic kidney disease last Thursday.\n\nHe was 81.\n\nIn a statement yesterday, the Ministry of Home Affairs and Cultural Heritage, said following the conferment of National Hero status on the two patriots and indefatigable sons of the soil, there will be a twin burial for late Major General (Rtd) Solomon Siziba and Cde Chen Chimutengwende.\n\nBurial will be on Wednesday, 22 January 2025 at the National Heroes Acre, added the statement.\n\nOn Saturday, Maj-Gen Sizibas body was flown to Bulawayo, where friends, relatives, and the leadership of Bulawayo and the Matabeleland region paid their last respects.\n\nYesterday, his body was airlifted to his village and farm in Gwanda before returning to Bulawayo to lie in state at his family home.\n\nA funeral parade in his honour will be held this morning at 11am at Imbizo Barracks in Bulawayo.\n\nFollowing this, his body will be airlifted back to Harare to lie in state at Charles Gumbo Barracks ahead of burial on Wednesday.\n\nSimilarly, Cde Chimutengwendes body will be airlifted to his rural home in Chiweshe, at Majome Primary School, Mazowe District, where the entire Mashonaland Central Province will be able to pay their respects.\n\nHis body will lie in state in Chiweshe before being airlifted back to Harare on Tuesday.\n\nIt will lie in state at Charles Gumbo Barracks ahead of burial.\n\nGovernment said people should attend the burial proceedings on Wednesday, to give a fitting send-off to the two great sons of the soil.\n\nCde Chimutengwende has been described as a strong member of Zanu-PF, who played a major role before and after independence.\n\nHe served as a Government Minister, Member of Parliament for Mazowe and a Politburo member.\n\nBorn on August 28, 1943, Cde Chimutengwende first became a Zanu-PF Member of Parliament in 1985 in Mazowe and served as a legislator for over 25 years.\n\nHe also served for 14 years as a Cabinet Minister.\n\nCde Chimutengwende served as Senator and Deputy President of the Senate, Member of the Pan-African Parliament (PAP) and Head of the Zimbabwe delegation to the PAP.\n\nHe earned a Masters degree in Social Science and a PhD from the University of Bradford in the UK.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Chen-Chimutengwendeleft-The-late-Major-General-Retired-Solomon-Siziba.jpg",
            "description": "Harare Bureau NATIONAL Heroes Major General (Retired) Solomon Siziba and Cde Chenhamo “Chen” Chakezha Chimutengwende, who both passed away last week, will be buried at the National Heroes’ Acre in Harare on Wednesday. The Government, through the Ministry of Home Affairs and Cultural Heritage, announced the twin heroes’ burial. Maj-Gen Siziba died at Josiah Magama […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zifa polls countdown…Gwesela pledges to  end 6% levy on PSL clubs",
            "url": "https://www.chronicle.co.zw/zifa-polls-countdown-gwesela-pledges-to-end-6-levy-on-psl-clubs/",
            "content": "Innocent Kurira,[emailprotected]\n\nASPIRING Zifa board member Xolisani Gwesela says once elected, he will propose for the abolition of the six percent levy presently deducted from Premier Soccer League (PSL) clubs match-day revenues.\n\nThis bold initiative is at the heart of Gweselas comprehensive set of proposals, which aim to promote financial sustainability and development within the sport.\n\nBy scrapping the six percent levy, Gwesela believes that clubs will be able to invest more in player development, infrastructure and other essential areas.\n\nIn addition, Gwesela has pledged to engage in robust discussions with the Sports and Recreation Commission (SRC) to abolish the six percent deduction imposed on PSL clubs.\n\nThis move is expected to further alleviate the financial burden on clubs and allow them to focus on competing at the highest level.\n\nGweselas proposals also extend to the realm of governance, where he has advocated for the abolition of affiliation fees paid by ZIFA members and player registration fees paid by clubs.\n\nThis, he believes, will help to create a more inclusive and equitable football ecosystem in Zimbabwe.\n\nIn a gesture of leadership by example, Gwesela has proposed that the elected Zifa president forfeit the $50 000 annual payment deducted from the CAF grant.\n\nThis move is seen as a vital step towards optimising the use of resources and ensuring that funds are channelled towards meaningful development initiatives.\n\nFurthermore, Gwesela has emphasised the need to prioritise the welfare of Zifa staff, pledging to ensure that salaries and staff benefits are paid in full and on time. This, he believes, will help to boost morale and motivate staff, ultimately contributing to a more efficient and effective administration.\n\nFinally, Gwesela has proposed the establishment of a tripartite agreement involving ZIFA, local authorities and the Central Government. This partnership will focus on driving infrastructural development, with the aim of creating modern, state-of-the-art facilities that can host international matches and provide a fitting platform for Zimbabwean football to thrive.\n\nAs a passionate advocate for Zimbabwean football, I am committed to creating a more sustainable and equitable future for our beloved sport, Gwesela said.\n\nThese proposals are designed to unlock the full potential of our football ecosystem and I am excited to work with stakeholders to turn this vision into a reality.\n\nGweselas qualifications make him a strong candidate for the Zifa board.\n\nHe holds a Masters of Science in Media and Society Studies, a Postgraduate Diploma in Media and Society Studies and a Bachelor of Science (Hons) in Administration.\n\nGweselas experience in football administration is impressive, having worked as a Caf General Co-ordinator, a Cosafa General Co-ordinator and a Zifa Administration Instructor. He has also held various positions within Zifa, including Chief Operations Officer, Communications and Competitions Manager and Acting CEO.\n\nWith his wealth of experience and qualifications, Gwesela is confident that he has what it takes to contribute to the success of Zifa.\n\nThe elections are scheduled for January 25.\n\nGwesela will face competition from several other candidates for the Zifa board member post, including veteran administrator Chris Mtungwazi, former Warriors manager Sharrif Musa, Alois Bunjira, Highlanders secretary Morgen Dube, former Warriors coach Sunday Chidzambga, ex-Zifa Southern Region chairperson Andrew Tapela, Tizirayi Luphahla and womens football administrator, Sibekiwe Ndlovu.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ujkiyuy.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw ASPIRING Zifa board member Xolisani Gwesela says once elected, he will propose for the abolition of the six percent levy presently deducted from Premier Soccer League (PSL) clubs’ match-day revenues. This bold initiative is at the heart of Gwesela’s comprehensive set of proposals, which aim to promote financial sustainability and development within […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "COMMENT: Let’s all as citizens unite and fight the scourge of corruption",
            "url": "https://www.chronicle.co.zw/comment-lets-all-as-citizens-unite-and-fight-the-scourge-of-corruption/",
            "content": "ZIMBABWEANS have once again been reminded that the anti-corruption fight is a collective responsibility hence the need for citizens to unite and fight the scourge.\n\nCommenting on the recent arrest of its four employees on allegations of corruption, the Zimbabwe Revenue Authority said it believes civic responsibility is essential in the collective effort to fight corruption.\n\nIt therefore urged members of the public to report any suspected corruption promptly so that appropriate measures can be taken.\n\nThe four employees were arrested at Beitbridge Border Post for soliciting bribes for the release of confiscated goods.\n\nZimra said it is committed to combating corruption and maintaining its integrity as an institution. It said it wants to ensure its operations are conducted transparently for the benefit of citizens.Together we can foster a culture of integrity that benefits all citizens, it said.\n\nZimra said it does not tolerate or support corrupt practices among its employees. It said it is committed to upholding the highest standards of integrity hence it takes any corruption allegations against its employees very seriously.\n\nPresident Mnangagwa has said there is a need for the private sector and other stakeholders to complement Government efforts to fight corruption.\n\nHe said Government on its part has embarked on a robust programme to strengthen good corporate governance and accountability in the management of public resources.\n\nIntegrity committees have been set up at public institutions to prevent corruption and promote good corporate governance.\n\nPresident Mnangagwa said the private sector, civil society and other stakeholders should also prioritise transparency and accountability through in-house anti-corruption efforts.\n\nThe Chartered Governance and Accountancy Institute of Zimbabwe (CGAIZ) has trained police officers and Zimbabwe Anti-Corruption Commission (Zacc) officials in forensic accounting, auditing and cyber security.\n\nPresident Mnangagwa said such collaboration goes a long away in strengthening public institutions to effectively and efficiently deliver on their mandate. He also urged members of the security sector to constantly upgrade their skills to keep abreast with criminals and corrupt elements modern techniques to evade the law.\n\nGovernment has already announced that plans are underway to introduce anti-corruption curricula from ECD to tertiary education as the nation steps up its fight against corruption.\n\nPresident Mnangagwa has said his administration will not shy away from taking corruption by the horns as the scourge has debilitating effects of retarding economic growth and development.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube said last Thursday that Government in its effort to fight corruption, is empowering anti-graft agencies and reinforcing the value for money concept.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/President-Mnangagwa.jpg",
            "description": "ZIMBABWEANS have once again been reminded that the anti-corruption fight is a collective responsibility hence the need for citizens to unite and fight the scourge. Commenting on the recent arrest of its four employees on allegations of corruption, the Zimbabwe Revenue Authority said it believes civic responsibility is essential in the collective effort to fight […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "WATCH: Scotts Maphuma shakes off January disease…leaves fans clamouring for more",
            "url": "https://www.chronicle.co.zw/watch-scotts-maphuma-shakes-off-january-disease-leaves-fans-clamouring-for-more/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nAMAPIANO musician Scotts Maphuma had people shake off January disease as he performed to a packed Cosmopolitan VIP Lounge in Bulawayo on Saturday night.\n\nWhen he landed at the Joshua Mqabuko Nkomo International Airport from South Africa, the Amapiano man of the moment, Scotts Maphuma promised his fans lightning during his show and from the experience it was just that.\n\nAt first it seemed the crowd was not that engaged in the proceedings as some were lazily dancing to the songs and seemed uninterested.\n\nHowever, the mood shifted a gear up as various local DJs took turns on the decks with DJ Sands dishing out everyones favourite tunes setting the mood for the night, followed by Umlungu Omnyama who did not disappoint either as well as DJ Liz.\n\nThere was hardly breathing space in the VVIP section and most people could be seen moving to the VIP section though they had to stand as all seats were occupied.\n\nThe music was pumping and the place was rocking, and the mood reached fever pitch when the man of the moment, Scotts Maphuma then took to the stage, amid a cacophony of cheers, screams and whistles.\n\nTaken by surprise and almost causing a stampede, his fans rushed to take a closer look with some fighting to get the best shot of his entrance.\n\nAfter taking to the stage, Scotts Maphuma lived up to his promise.\n\nHe dropped hit after hit of the peoples favourite, Wishi Wishi, One man side to side, Shaymoto and Biri Marung a track which was a crossover track on New Years Eve.\n\nIn the crowd many were dripping in sweat and could not sit down at the VVIP section as most opted to climb on top of tables just to get a clear view of the performance.\n\nThe crowd could not get enough of his time on stage as some were disappointed when he left.Some immediately left the night spot as they felt he should have performed longer than he did.\n\nOne reveller Edwin Makawure said he enjoyed the show and would love to see Scotts Maphuma on stage again.\n\nThe show was on fire, Scotts is a good performer but I feel he should have stayed on stage longer than he did.\n\nHowever, he made us dance throughout which is good and I hope we will be having more promoters bringing him in upcoming shows as he is clearly loved in Zimbabwe, he said.\n\nCharmaine Nkomo from Pumula said she enjoyed the performance too.\n\n I enjoyed the performance,I feel Scotts did justice on the stage. It was also a dream come true for me to witness a performance from my favourite artiste, she said.\n\nThough people wanted more from Maphuma, DJ Feel G contained the situation keeping the already blazing mood on fire through Zimdancehall and club anthems.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/lklklklj.jpg",
            "description": "Sipepisiwe Moyo,moyosipepisiwe@gmail.com AMAPIANO musician Scotts Maphuma had people shake off January disease as he performed to a packed Cosmopolitan VIP Lounge in Bulawayo on Saturday night. When he landed at the Joshua Mqabuko Nkomo International Airport from South Africa, the Amapiano man of the moment, Scotts Maphuma promised his fans “lightning” during his show and […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "Woman in court for  attack on co-wife  over husband",
            "url": "https://www.chronicle.co.zw/woman-in-court-for-attack-on-co-wife-over-husband/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 28-YEAR-OLD Bulawayo woman has appeared in court facing charges of assaulting her sister wife during a dispute over their husband.\n\nCaroline Pindani was arraigned before Western Commonage magistrate Mr Mehluli Moyo, who remanded her out of custody to January 27.\n\nThe prosecutor, Mrs Ellen Matenga said the incident occurred on January 12 when Pindani visited her sister wife, Mrs Grace Sibanda, at her home.\n\nAn argument arose between the two over their husband, leading to Pindani allegedly assaulting Mrs Sibanda, said Mrs Matenga.\n\nThe court heard that Pindani allegedly punchedMrs Sibanda, leaving her with a bruised face and a blue eye.\n\nIn her defence, Pindani denied the allegations, claiming there was no physical assault but rather a misunderstanding.\n\nI never assaulted her. I went to her house to ask if our husband could accompany me to the hospital. I have twins, and one of them needed to go to a local hospital for physiotherapy. I needed his help with the other twin since I am still breastfeeding, she said.\n\nPindani said while she was speaking with their husband, Mrs Sibanda came outside and intervened.\n\nWhen she held his hand, I also held his other hand. She then dragged him to her side while I tried to pull him to mine.\n\nIt was during this struggle that she overpowered me. She is the one who assaulted me, said Pindani.\n\nTestifying in court, Mrs Sibanda refuted Pindanis claims, insisting that she was the victim.\n\nShe came to my house and started insulting me, accusing me of not allowing our husband to go with her to the hospital. I stood on the left side of our husband, but she began pulling him to her side.\n\nWhen I resisted, she slapped me and hit me with her fists, leaving me with bruises, said Mrs Sibanda.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/08/court.gavel_.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com  A 28-YEAR-OLD Bulawayo woman has appeared in court facing charges of assaulting her sister wife during a dispute over their husband. Caroline Pindani was arraigned before Western Commonage magistrate Mr Mehluli Moyo, who remanded her out of custody to January 27. The prosecutor, Mrs Ellen Matenga said the incident occurred on January 12 […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        },
        {
            "title": "Businessman posted ‘disturbing  messages’",
            "url": "https://www.chronicle.co.zw/businessman-posted-disturbing-messages/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nA Bulawayo businessman Mr John Tafara Madzikatire allegedly fatally shot himself near his girlfriends house in Cowdray Park suburb on Saturday night.\n\nAccording to sources, Mr Madzikatire had, before the tragedy, been posting messages about death and suicide on his social media platforms.\n\nThe late Mr Madzikatire, who owned butcheries at KoChigumira Leisure Centre in Luveve and in Pumula North suburb, was found with a gunshot wound to his head outside his girlfriends house.\n\nBulawayo provincial spokesperson Assistant Inspector Nomalanga Msebele confirmed the incident, saying investigations are underway.\n\nPolice confirm the death of John Tafara Madzikatire who was found with a gunshot wound in the head.\n\nPolice are treating the case as suicide and investigations are underway, she said.\n\nAccording to people close to the late Mr Madzikatire, two days before his death, he posted a troubling message on his WhatsApp status:\n\nIf I leave this world u (you) will not say I am a coward, you better call me a coward, and I have no choice.\n\nA friend of the late Mr Madzikatire who refused to be named, said although the message appeared to hint at suicidal thoughts, it was not taken seriously at the time.\n\nSometimes people post messages that make it appear as if they are suicidal, but we didnt take it seriously. We dont really know what happened, whether it was suicide or something else, but his WhatsApp messages were disturbing, the friend said.\n\nWorkers at Samaz Butchery, one of the late Mr Madzikatires businesses, recalled seeing their boss on Saturday around 5 pm when he delivered meat to the Luveve outlet in his black Mercedes Benz.\n\nHe was accompanied by a young woman who stayed behind in the car while he unloaded the meat.\n\nWe were alerted by one of his friends that he had shot himself outside the womans house in Cowdray Park. We are still in disbelief that the boss killed himself. The butcheries will remain closed until we hear from the family, said an employee, who requested to remain anonymous.\n\nThe workers said soon after receiving the news about their boss death, they quickly hired a Honda Fit vehicle and rushed to the scene, where they found the police already present. The late businessmans vehicle was later parked outside the Luveve butchery after police released it to the family.\n\nThe late Mr Madzikatire is believed to have been with his girlfriend when he allegedly shot himself.\n\nThe girlfriend was questioned by police and later released.\n\nPolice sources said large sums of money were found at the scene of the shooting.\n\nThe cause of Mr Madzikatires death is still under investigation but the concerning social media posts have added to the mystery.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/business-man-shoots-self1.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com A Bulawayo businessman Mr John Tafara Madzikatire allegedly fatally shot himself near his girlfriend’s house in Cowdray Park suburb on Saturday night. According to sources, Mr Madzikatire had, before the tragedy, been posting messages about death and suicide on his social media platforms. The late Mr Madzikatire, who owned butcheries at KoChigumira Leisure […]",
            "time": "09:46",
            "date": "20 Jan 2025"
        }
    ]
}