{
    "news": [
        {
            "title": "3,5m youths targeted for digital skills training",
            "url": "https://www.chronicle.co.zw/35m-youths-targeted-for-digital-skills-training/",
            "content": "Sikhumbuzo Moyo and Sikhulekelani Moyo, Chronicle WritersTHOUSANDS of youths from across the country will today converge at the Zimbabwe International Exhibition Centre where President Mnangagwa would lead the National Youth Day celebrations.\n\nThe event is also expected to coincide with the official launch of the ambitious digital skills training programme meant to empower 3,5 million youths with digital skills and enhance their global competencies.\n\nThe commemorations will also focus on initiatives aimed at enhancing the welfare and livelihoods of young people across the country, thereby buttressing the Second Republics inclusive development thrust.\n\nBy end of the day yesterday, the venue for the event was a hive of activity as final touches were being put ahead of todays programme. An electronic monitor at the side of the VIP stand had been installed beaming: Zimbabwe Digital Skills Training Programme Launch; Empowering 3,5m youths with digital skills.\n\nThe main commemorations will be held in Hall Four while in Hall Three there will be exhibitions by youngsters from various schools, tertiary institutions, Government Ministries, Departments and Agencies.\n\nAll the available 162 cubicles in Hall Three were taken while Bulawayo schools will exhibit under one cubicle where they showcase their innovative and cultural works. This years commemorations are being held under the theme: Empower the Youths, Secure the Future.\n\nThe Minister of Youth Empowerment, Development and Vocational Training, Cde Tino Machakaire, expressed excitement about the event and said Government was committed to empowering youths and urged them to take a proactive role in the nations economic transformation.\n\nAs we celebrate the 21st February Movement, we encourage the youth of Zimbabwe to unite and concentrate on the economy rather than getting distracted by petty issues, he said.\n\nThere will be opportunities for young people to exchange innovative and entrepreneurial ideas to enhance their skills and knowledge, enabling them to contribute to our great nation.\n\nMinister Machakaire said Government was determined to address all the pressing issues affecting youths such as drug and substance abuse, which is threatening the future of many youths.\n\nWe are committed to launching projects that engage young people so that they have meaningful activities to occupy their time and steer clear of drug and substance abuse, he said.\n\nThe law enforcement agencies will fulfil their responsibilities in addressing drug abuse. However, we must also empower our youths by providing them with life-changing opportunities.\n\nMinister Machakaire said plans to ensure the youth can participate in various Government projects, including construction and road refurbishment were being implemented to give them tangible work opportunities, regardless of the projects scale.\n\nHe said reducing the high unemployment rate among young people remains a primary objective for the Government.\n\nOur youths are the future leaders of this nation, and it is essential to empower them through quality education and entrepreneurial skills to shape their futures and improve their livelihoods.\n\nWe aim to promote youth-led projects by facilitating technology transfer and creating connections between technology suppliers, financial institutions, and young innovators, said Minister Machakaire.\n\nSpeaking in separate interviews, various youth groups expressed excitement and had high hope that todays event will speak to their issues and inspire them.\n\nZimbabwe Vision (ZimVi) 2030 Implementers leader Mr Archbald Siziba said they will use the platform express appreciation of President Mnangagwa positive policies.\n\nAs a beneficiary of the Second Republics youth empowerment programs, I can confidently say that success is within reach only takes participation, dedication, and a willingness to see beyond misinformation, said Mr Siziba.\n\nBy 2030, I see myself as a millionaire, not because I waited for handouts, but because I took advantage of the opportunities provided by President Emmerson Mnangagwa.\n\nPRESIDENT Mnangagwa\n\nThe future is bright for those who embrace Vision 2030 and walk the path of progress. The President has opened the doors, its up to the youth to walk through them.\n\nAnother youth, Mr Addington Mpofu, said the Second Republic has done extremely well in empowering young people and making sure they become drivers of the economy and critical party of the mainstream economy.\n\nIf you look at the agriculture sector, we have seen young people now participating and Zimbabwe is now one of the very few countries that have the highest number of young people in the agriculture sector, said Mr Mpofu.\n\nIf you go to the mining sector, most of the people there are young people, traditionally mining is an old sector but now its being run by youth.\n\nThe President has been very instrumental in making sure that young people are the drivers of the economy and if you look at our ministers now, most of them are young capable people who are in key strategic ministries.\n\nZanu-PF Bulawayo provincial spokesperson Cde Archie Chiponda said Zimbabwe is blessed to be endowed with hardworking and highly intelligent youths who have shown the ability to adapt to any economic environment.\n\nThe issue of reserved sectors for indigenous needs to be implemented effectively as those sectors are the sectors in which we would naturally see a high amount of youth participation, said Cde Chiponda.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/TFFF.jpg",
            "description": "Sikhumbuzo Moyo and Sikhulekelani Moyo, Chronicle Writers THOUSANDS of youths from across the country will today converge at the Zimbabwe International Exhibition Centre where President Mnangagwa would lead the National Youth Day celebrations. The event is also expected to coincide with the official launch of the ambitious digital skills training programme meant to empower 3,5 […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "New era for Zimbabwe business, President urges collaboration for competitiveness",
            "url": "https://www.chronicle.co.zw/new-era-for-zimbabwe-business-president-urges-collaboration-for-competitiveness/",
            "content": "Nqobile Bhebhe,[emailprotected]President Mnangagwa has reaffirmed his administrations dedication to swiftly enhancing the business climate by fostering innovation and attracting new investments, addressing the challenges that hinder seamless business operations.\n\nAt the highly subscribed inaugural National Competitiveness Commission (NCC) Summit, which ended in Bulawayo yesterday, captains of industry and commerce raised concerns over regulatory and compliance burdens as well as associated costs that weigh heavily on business operations, accounting for approximately 18 percent of total overhead costs.\n\nThese hurdles were blamed for discouraging the informal sector from transitioning into the formal economy.\n\nStakeholders also stressed the need for an in-depth review of regulations to streamline processes and lower the cost of doing business to enhance competitiveness.\n\nBusiness leaders also identified energy generation and supply gaps, and transport infrastructure factors as key enablers of competitiveness, and urged policymakers to improve these to boost productivity and build a resilient economy.\n\nCabinet ministers present also acknowledged these challenges and indicated that the Government is actively addressing them.\n\nIn his keynote address at the summit yesterday, President Mnangagwa who has consistently said he is a listening leader, reaffirmed the Governments commitment to urgently responding to business concerns.\n\nThe Second Republic is alive to issues affecting businesses and is scaling up measures that create a supportive business operating environment, which encourages innovation and investment, he said.\n\nThis is poised to enhance the competitiveness of the countrys manufacturing sector at a time when the African Continental Free Trade Area Agreement is now operational.\n\nI urge stakeholders to tap into the new market opportunities presented by these emerging conditions of trade. Hence, the need to ensure that our countrys goods and services are competitive cannot be overemphasised.\n\nAll sectors, therefore, have a duty and responsibility to embrace the competitiveness agenda and take it to another level.\n\nThe Presidents sentiments follow this weeks Cabinet approval of various measures to tackle challenges in the formal business environment and support micro, small, and medium enterprises (MSMEs).\n\nThe Government has already committed to streamlining fees, reducing duplication of work by Government agencies, and improving electricity supply. These efforts aim to facilitate MSMEs transition into formal businesses.\n\nGoing forward, President Mnangagwa told delegates that the Governments economic thrust is centred on driving higher value addition and beneficiation of raw materials and minerals to establish vibrant industrial value chains.\n\nHe said the Zimbabwe Industrial Reconstruction and Growth Plan is a transitional strategy to address current challenges in the industrial and commercial sectors.\n\nSpecific sectors, including the soya bean and dairy value chains, have been identified as having a national comparative advantage and significant potential to contribute to manufacturing growth.\n\nTurning to competitiveness, President Mnangagwa reiterated the Governments commitment to working collaboratively with stakeholders, including the private sector, development partners, and academia, to address barriers to Zimbabwes global competitiveness.\n\nThe building blocks are already there in the form of the abundant God-given natural resources, highly educated and hardworking human capital as well as our heritage-based development policies and programmes, he said.\n\nAll these resources must be fully exploited and blended for enhanced competitiveness and sustainable development.\n\nThe President commended the summit for providing resolutions that inform competitive policy interventions and help insulate the economy against global shocks, and emphasised the need for collective action to achieve global competitiveness.\n\nCollaboration between the public and private sectors remains essential for a thriving ecosystem, he said.\n\nThe various Ministries, Departments and Agencies stand ready to spearhead reforms that encourage innovation and investments, enhanced productivity, and efficient markets. We must all work in tandem and not at cross purposes to achieve overall economic growth and improved standards of living for our people.\n\nIt is critically important that as we undertake the various internal stages, we should think with the bigger socio-economic picture in mind to achieve global competitiveness, said President Mnangagwa.\n\nIt is my hope, therefore, that recommendations from this Summit will aid in the formulation of sustainable reforms to enhance competitiveness critical for attracting both local and foreign investment and increasing confidence in the economy.\n\nHe also noted that the Competitiveness Summit, now set to be an annual event, marks a significant milestone for the Second Republic in its mission to reinforce Zimbabwes global competitiveness.\n\nThe President also reaffirmed the Governments commitment to strengthening the National Competitiveness Commission, which plays a key role in facilitating a competitive business environment.\n\nThe Commission is tasked with analysing various aspects of Zimbabwes economy to enhance both local and global competitiveness.\n\nHe praised the Commission for producing the annual Zimbabwe Competitiveness Report, which informs policy interventions aimed at eliminating barriers to national competitiveness.\n\nThe report also seeks to ensure that our nation offers products and services that meet quality standards of local and world markets at prices that provide good returns, said the President.\n\nI am advised that the 2024 Zimbabwe Competitiveness Report is under consideration by the Cabinet Committee on the Ease of Doing Business and will soon be presented to Cabinet for approval and adoption.\n\nA National Competitiveness Strategy will be developed this year by the Ministry of Industry and Commerce through the Commission, which will be instrumental in guiding national policy formulation.\n\nMy Government stands ready to lend you as much support as possible, to successfully acquit yourselves on this very noble endeavor, said the President.\n\nThe Competitiveness Summit stands as a critical platform for shaping policies that drive economic growth and position Zimbabwe as a competitive player in international markets.\n\nThe summit delegates said commitment from all stakeholders will be key in ensuring that the countrys economic transformation remains sustainable and inclusive.\n\nThe summit was held under the theme: Building Sustainability Towards Enhanced Productivity and Competitiveness in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/yrf.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw President Mnangagwa has reaffirmed his administration’s dedication to swiftly enhancing the business climate by fostering innovation and attracting new investments, addressing the challenges that hinder seamless business operations. At the highly subscribed inaugural National Competitiveness Commission (NCC) Summit, which ended in Bulawayo yesterday, captains of industry and commerce raised concerns over regulatory […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "Meet Zimbabwe’s saxophonists keeping the romance alive",
            "url": "https://www.chronicle.co.zw/meet-zimbabwes-saxophonists-keeping-the-romance-alive/",
            "content": "Mbulelo Mpofu,[emailprotected]THE saxophone has long been synonymous with romance, its sultry tones weaving through the fabric of love songs and intimate moments. Over the years, this beloved instrument has transcended its jazz roots, emerging as a contemporary emblem of passion and affection. Today, it finds itself at the heart of romantic expressions worldwide, whether through heartfelt wedding serenades, smooth R&B melodies, or soulful pop covers.\n\nThe wind instrument has assumed a new role, being an element of surprise whenever one wants to show their affection, a saxophonist will be on speed dial.\n\nSocial media has played a pivotal role in elevating the saxophones status as a romantic instrument. Platforms like TikTok and Instagram have become stages for saxophonists to showcase their talent, with viral videos of heartfelt renditions of popular love songs capturing the attention of millions.\n\nThis new-found exposure has redefined the saxophones image, transforming it from a jazz staple into a modern symbol of romance.\n\nMusicians around the globe are harnessing the saxophones rich, warm tones to create unforgettable experiences. From weddings to proposals and recently-celebrated Valentines Day celebrations, the saxophone has become a go-to instrument for setting the mood and evoking deep emotions. It is no wonder that couples are increasingly turning to saxophonists to enhance their most cherished moments.\n\nBulawayo saxophonist, Emmanuel B Ndlovu, who performs under the name Iam_Benjamin, captured the essence of the saxophones romantic appeal.\n\nBigStar Nash\n\nAs a saxophonist, Ive always felt that my instrument has a unique power to express love in ways words cannot. The saxophones voice is warm, intimate, and deeply emotional  it can whisper like a lover or soar with passion, he said.\n\nSome have said the saxophones sound felt like a voice expressing what they couldnt put into words.\n\nWhen Ndlovu plays at weddings and romantic events, he witnesses first-hand, how music can touch hearts and create connections.\n\nI see how the music brings couples closer or stirs memories of love. The saxophones ability to bend notes and mimic the human voice makes it feel personal, like Im telling a story of love through every performance, he adds.\n\nAccording to Harare-based saxophonist BigStar Nash (real name Panashe Zvingowanisei), the saxophone has morphed from being just a regular portable instrument into being a staple for events.\n\nThe saxophone over the past few years, has become a means to express love in Zimbabwe. Its a soulful instrument and has always been used to express emotion. The innate connection between jazz music and romance cant be overlooked and the saxophone is one of the brass instruments used in Jazz.\n\nIn terms of expressing love in Zimbabwe, it has created a platform for song dedication and gift presentation in an artistic manner. Furthermore, its also about icing and complementing a special event, BigStar Nash said.\n\nFor Bulawayo-based Vuyi Sax (born Vuyisile Qongo), the saxophone has been more than just an instrument  it has been a lifeline.\n\nIt has transformed my life because, almost every day, someone is celebrating a special occasion  be it a birthday, graduation, anniversary, or simply a day to spoil a loved one. This has become my daily bread, allowing me to perform three or four sets in a single day, he said.\n\nHe added that the saxophones ability to speak and interpret musical ideas makes it uniquely expressive.\n\nThe way it evokes emotions and brings melodies to life sets it apart from other musical instruments. If I were to express myself musically, the saxophone would be my voice.\n\nAs the popularity of cover songs continues to rise, saxophonists are finding innovative ways to navigate copyright issues while showcasing their talents. According to Iam_Benjamin, crediting the original artistes or composers is crucial, as it not only acknowledges their contributions but also serves as a promotional tool, expanding the reach of the music to untapped audiences.\n\nHowever, the landscape becomes more complex when these covers are monetised on various platforms. Proper licensing and revenue sharing are essential to ensure that the original creators are compensated fairly.\n\nWith the advent of numerous music distribution sites, saxophonists have greater access to resources that facilitate these processes. Ultimately, seeking permission to perform covers remains the safest route for artistes looking to respect copyright laws while sharing their interpretations of beloved songs.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gfdgfdgdfgdfg.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE saxophone has long been synonymous with romance, its sultry tones weaving through the fabric of love songs and intimate moments. Over the years, this beloved instrument has transcended its jazz roots, emerging as a contemporary emblem of passion and affection. Today, it finds itself at the heart of romantic expressions worldwide, […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "Youthful sacrifices endure",
            "url": "https://www.chronicle.co.zw/youthful-sacrifices-endure/",
            "content": "Dr. Obert MpofuZimbabwe will not die, young people will save it  I cannot think of a more powerful statement than these words by Father Zimbabwe, our late Vice-President Dr Joshua Mqabuko Nkomo.\n\nIndeed, the task is always for the youth to save this motherland and defend the gains of the liberation struggle, which some of us fought for in our youth. President Mnangagwa, myself and other comrades realised that we could no longer accept the status quo that existed at the time and thus at an early age we made the decision to fight for our freedom.\n\nLate Vice-President Dr Joshua Mqabuko Nkomo\n\nWe sacrificed our youthfulness and youthful cravings to rescue the country form the jaws of colonialism, an act we do not regret till this day. As a matter of fact, we in leadership have spent our entire lives in sacrifice and service to the cause.\n\nZimbabwe was fought for and liberated by the youth. The entire life or earlier life of us who are in leadership today was a time of sacrifice as youths. This country was mostly fought for by the young people, the youths who are old people today. It was because of their discipline and their resolve to liberate the country that made them sacrifice for the emancipation of this country. President Mnangagwa was incarcerated when he was a young man. He went to prison and was incarcerated because he had made the bold decision to fight for the independence of his motherland at an earlier age.\n\nIt is amazing that at that young age, he had realised that his life would be meaningless if he did not fight for the motherland. And thus, our youthfulness was spent serving a noble cause.\n\nIndeed, each generation is often confronted by its own struggles. Ours was to free our motherland and take back our land. The youth of today face the same conundrum and must defend the gains of the liberation struggle against the relentless attacks from our detractors. Youthfulness is indeed the greatest resource and the ultimate weapon against those who seek to keep us under subjugation.\n\nOur youth must be torch-bearers and carry forth the light until we are fully emancipated.Dear youth born in a free Zimbabwe, yours is a simple task, one of defending your motherland against our detractors. Discipline, patriotism and loyalty are the tenets we espoused during our time and these are the tools that our dear youth should rely on in defence of our motherland. The comrades often talked about, who died in Mozambique, Zambia and here in Zimbabwe during the liberation struggle were not old people but were in actual fact the youth. This country was indeed liberated by the youth and its foundation built by the sweat and blood of these youth.\n\nIn order to attain a future we can all be proud of, the Second Republic, under the apt leadership of President Mnangagwa, proclaimed February 21 the Robert Gabriel Mugabe National Youth Day.\n\nThe purpose of the National Youth Day, formally known as the 21st February Movement is to instil the right ideology into the youth.\n\nNational Youth Day serves as a stark reminder of what a patriotic youth should do to play a part in the development of their country. This is more so now that the independence that we have and the deliberate policies that have been introduced by the successive Zanu-PF governments since 1980 have allowed them to acquire the necessary skills for spurring our country forward. We have one of the best education systems on the continent and our people are among the most educated.\n\nIndeed, the youth of yesterday made the ultimate sacrifice so that the youth of today can prosper and flourish. Our youths of today are quite fortunate to be living at a time when most of the work has been done by the youths of yesterday. The schools, the universities and the colleges have afforded them the opportunity to acquire skills which they are to use responsibly. Evidently, had it not been for the youths of yesterday, they wouldnt have had these opportunities they are enjoying today.\n\nLate former President Robert Mugabe\n\nYoung people indeed have a critical role to play in economic development and they are an important resource that should be tapped into. Our youths will determine where our nation goes in the future and it is up to us to determine what kind of leaders we create out of these youths.\n\n*Dr. Obert Moses Mpofu is an Academic and the Secretary General of Zanu-PF. He writes in his own capacity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/iuyythdfh.jpg",
            "description": "Dr. Obert Mpofu “Zimbabwe will not die, young people will save it” — I cannot think of a more powerful statement than these words by Father Zimbabwe, our late Vice-President Dr Joshua Mqabuko Nkomo. Indeed, the task is always for the youth to save this motherland and defend the gains of the liberation struggle, which […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "COMMENT: Empowering the youth for a brighter Zimbabwe",
            "url": "https://www.chronicle.co.zw/comment-empowering-the-youth-for-a-brighter-zimbabwe/",
            "content": "Thousands of youths from across the country are in Bulawayo for the National Youth Day commemorations being held at the Zimbabwe International Exhibition Centre (ZIEC). Barbourfields Stadium was supposed to play host to the commemorations but due to the prevailing weather conditions, the event was moved to ZIEC.\n\nBarbourfields Stadium\n\nThe National Youth Day was set aside to honour the late National Hero and former President Cde Robert Mugabe who was born on February 2,1924 and died on September 6, 2019.\n\nPresident Mnangagwa is leading the proceedings at the commemorations that are being attended by youths drawn from a wide spectrum of society that include pupils from primary and secondary schools, students from tertiary institutions, youths living with disabilities, graduates from colleges and universities that are either employed or running their own businesses and farmers.\n\nThe theme for this years National Youth Day commemorations is Empower Youth, Secure the Future. February is a special month for Zimbabwean youths as it affords them an opportunity to reflect on the rich legacy of one of Zimbabwes liberation icons, Cde Mugabe.\n\nThe youths are the countrys future and should therefore emulate national heroes that sacrificed their lives to bring about our freedom and independence. The youths should strive to promote the legacy of unity, love and peace that our gallant heroes fought for as they work to build the Zimbabwe we all want.\n\nThe Government, as has become the norm, invited all youths regardless of their religion, political affiliation or social status because the event is national event that should be commemorated by all Zimbabwean youths.\n\nThe youths, who are the countrys future, should take a leading role in building a prosperous Zimbabwe taking advantage of our abundant natural resources like minerals.\n\nWe want at this juncture to remind the youths that they can only build the Zimbabwe we all want if they have a shared vision as Zimbabweans. The Government leaders that are pushing for an upper-middle-income economy by year 2030 are not doing this for themselves but for the youths and future generations. They want to bequeath to the youths and future generations, a better Zimbabwe.\n\nIt is the youths who will occupy leadership positions tomorrow and they should start preparing now. Ilizwe lakhiwa ngabaninilo/Nyika inovakwa nevene vayo. What is encouraging is that we have youths who are already excelling in farming, mining, manufacturing and other sectors of the economy and the challenge is to mobilise those still idle and abusing drugs to come on board.\n\nIt is disturbing to learn that drug abuse among the youths is on the increase yet the nation looks up to the youths to play an active role in building a better Zimbabwe. The youths therefore, have an obligation to fight drug abuse by engaging their peers who have fallen victim.\n\nThe resources being spent on drugs should be put to good use hence the need for those youths already in the productive sectors of the economy to mobilise especially drug addicts to come on board. Those promoting drug abuse among the youths are killing a whole generation and all efforts should be directed at putting a stop to this.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/09/The-late-former-President-Mugabe.jpg",
            "description": "Thousands of youths from across the country are in Bulawayo for the National Youth Day commemorations being held at the Zimbabwe International Exhibition Centre (ZIEC). Barbourfields Stadium was supposed to play host to the commemorations but due to the prevailing weather conditions, the event was moved to ZIEC.  The National Youth Day was set aside […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "‘Protecting formal businesses not Government duty alone’",
            "url": "https://www.chronicle.co.zw/protecting-formal-businesses-not-government-duty-alone/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nECONOMIC experts have called on businesses to operate legally and refrain from profiteering through cheap supplies to the informal sector, which creates an unfair playing field for formal traders.\n\nThe Government has also been urged to intervene to address the issue of unfairly low prices offered by informal businesses and the impact of smuggled goods, which find their way into local shops.\n\nThe unregulated nature of informal sector operations presents numerous challenges to formal businesses, while the Government struggles to collect tax for national development.\n\nFormer Zimbabwe National Chamber of Commerce (ZNCC) Matabeleland Chapter vice president, Mr Louis Herbst, said that in evaluating the prevailing retail landscape, it is clear that the formal sector often finds itself navigating a complex duality. Retailers aim to operate within a legitimate framework while simultaneously benefiting from the lucrative margins arising from informal trading practices.\n\nZimbabwe National Chamber of Commerce (ZNCC)\n\nHe said this dichotomy complicates the discourse surrounding the necessity of safeguarding the formal sector, as it requires a commitment from these businesses to eliminate practices that undermine their sustainability.\n\nProtecting the formal sector is not solely the responsibility of Government intervention and regulatory oversight. It demands a proactive commitment from businesses within the sector, said Mr Herbst.\n\nThis includes ceasing the troubling practice of offloading expired or inferior goods into informal markets  an action that they decry while simultaneously engaging in.\n\nFor a genuinely competitive environment to flourish, it is essential to enforce stricter penalties on wholesalers and retailers found exploiting the system.\n\nHe said such measures would serve to deter unethical practices that compromise consumer trust and threaten the viability of legitimate traders.\n\nAdditionally, Mr Herbst highlighted that retailers, along with fuel suppliers, have historically leveraged fluctuations between the US dollar and local currencies such as the Bond, RTGS, or ZWL for significant profit gains. In this scenario, he noted that profitability has shifted from being product-centric to being largely dependent on currency manipulation.\n\nRetailers have been known to achieve profit margins exceeding 150 percent through such practices, while margins on essential goods like fuel or bread often hover around a mere 15-20 percent, he said.\n\nAs the market stabilises due to Government initiatives, the decline in retailer profits is increasingly attributed not to the quality of goods sold but rather to the diminished ability to exploit currency fluctuations for inflated gains.\n\nMr Herbst stated that retailers face standard profit margins that may threaten their operational viability.\n\nConsequently, some retailers may find it strategically advantageous to consolidate operations by reducing staff and temporarily closing branches. This approach allows them to assess the long-term sustainability of Government policies over a six-to 12-month horizon, particularly when efforts for modest monthly returns may not justify ongoing expenses.\n\nIt is crucial for retailers and industry stakeholders to rationalise their operations and adopt a more principled approach to business, said Mr Herbst.\n\nThis entails moving away from practices that exploit consumers and circumvent Government policies for short-term monetary gain.\n\nThe concerning trend of offloading expired or substandard products into informal markets not only complicates the retail landscape but also undermines the integrity of legitimate traders. This unethical behaviour must be addressed with robust policies and enforcement mechanisms designed to uphold market integrity.\n\nMoreover, Mr Herbst stressed that vigilance over wholesalers is critical to preventing them from diverting goods to the informal sector under the guise of business closures.\n\nThis manoeuvre allows them to significantly reduce overhead costs while potentially enhancing profit margins.\n\nFor instance, he said a wholesaler might find it strategically beneficial to close several branches and redirect products to the informal market, thereby avoiding expenses related to licensing, taxes, and other operational costs such as Zimbabwe Revenue Authority (Zimra), Pay-As-You-Earn (PAYE), Zimbabwe Manpower Development Fund (ZimDef), National Social Security Authority (Nssa), and local council fees.\n\nSuch actions only exacerbate the challenges faced by legitimate businesses and further erode market integrity, said Mr Herbst.\n\nWhile the informal sector can serve as a necessary survival mechanism in certain scenarios, it is essential to recognise that, in many cases, the driving forces are profit and opportunism rather than genuine necessity.\n\nThis reality calls for a thorough examination and restructuring of the informal market to ensure its operations align with ethical standards that promote fair competition and support the formal sector. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gfc.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com ECONOMIC experts have called on businesses to operate legally and refrain from profiteering through cheap supplies to the informal sector, which creates an unfair playing field for formal traders. The Government has also been urged to intervene to address the issue of unfairly low prices offered by informal businesses and the impact of […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mighty Warriors in narrow loss in Angola",
            "url": "https://www.chronicle.co.zw/mighty-warriors-in-narrow-loss-in-angola/",
            "content": "Zimpapers Sports Hub\n\nAngola 2-1 Mighty Warriors\n\nISRAEL-BASED Ruvimbo Mucherera made a scoring debut albeit in a losing cause in an Africa Womens Cup of Nations qualifier against Angola in Luanda, yesterday.\n\nThe result left the Zimbabwe ladies team with a tall order ahead of the return leg to be played in Pretoria next week.\n\nMucherera equalised in the 17th minute after the home team had capitalised on lapse of concentration in the first minute of the encounter.\n\nThis allowed Ary Papel to put Angola ahead barely a minute into kick off.\n\nUsually when a team is scored in the first 15 minutes of the game or last, fitness issues be it physical or mental prop up.\n\nAngola found cracks to score their second in the 75th minute to put a leg into the next round where Malawi, one of Africas rising powerhouses are waiting after going through following Congos withdrawal.\n\nThe qualifier comes at a time when the local league which provides most of the players is still off-season.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gdfwttr.jpg",
            "description": "Zimpapers Sports Hub Angola 2-1 Mighty Warriors ISRAEL-BASED Ruvimbo Mucherera made a scoring debut albeit in a losing cause in an Africa Women’s Cup of Nations qualifier against Angola in Luanda, yesterday. The result left the Zimbabwe ladies’ team with a tall order ahead of the return leg to be played in Pretoria next week. […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "Women lead  in carousel’s us$1,2m boost",
            "url": "https://www.chronicle.co.zw/women-lead-in-carousels-us12m-boost/",
            "content": "Nqobile Tshili,[emailprotected]THE upgrading of Edgars Stores Carousel Manufacturing Division in Bulawayo to the tune of US$1,2 million has created massive job opportunities for women and the youth who dominate the staff complement at the giant garment-making factory.\n\nSituated in Belmont, the plant is a hub for modern fashion designs  producing high-quality clothes and supplying its three main chain stores, Edgars, Jet, and Express Stores countrywide as well as servicing exports.\n\nPresident Mnangagwa, who conducted a tour of the factory yesterday, was impressed by the companys new look and its latest equipment with women constituting the majority of workers.\n\nAs he entered the factory with his delegation for the first time, he marvelled at the dominance of women of different age groups who were busy doing their work alongside their male counterparts.\n\nEach team member was strategically positioned along the production line with a specific duty in the production of a single garment with the final product exhibiting excellent teamwork.\n\nIn his remarks, President Mnangagwa said he was impressed by Carousel and commended the company for employing more women and investing in cutting-edge manufacturing technologies, which cements Bulawayos status as the industrial hub of the country.\n\nIm very impressed, I have never been here before. This is my first visit to this place. Im so impressed that we have these facilities in the country, said President Mnangagwa in a brief interview with journalists.\n\nIts so vast, providing employment, especially to women. Im very, very impressed. So, when you say Bulawayo is the hub for manufacturing I now realise that it is true. Im very impressed with what is happening here, he added.\n\nPresident arrived at the companys premises shortly after 11AM accompanied by Vice President, Dr Constantino Chiwenga, Cabinet ministers, Bulawayo Provincial Affairs and Devolution Minister Judith Ncube, among other senior Government officials and corporate executives.\n\nMinister Judith Ncube\n\nThe delegation undertook a briefing before the tour of the company commenced during which President Mnangagwa was taken through the various production lines by senior Carousel officials who unpacked how the company had modernised its production processes.\n\nCarousel managing director Mr Manfree Tanyanyiwa, said the company was honoured to host President Mnangagwa. He also said the company used the tour to apprise the President of some of its challenges and how it seeks the Governments interventions to address them.\n\nWe engaged the President on issues around smuggling and what the Government is doing to curb that so that we can boost the manufacturing industry in Zimbabwe, said Mr Tanyanyiwa.\n\nThe issue of smuggling cuts across so many sectors but I think the clothing industry is one of those most affected.\n\nWe engaged him about our retooling exercise, our desire to upgrade even more machinery. We were asking for support so that we continue with the retooling exercise, he added.\n\nMr Tanyanyiwa said when the company successfully retools, it will be able to increase its capacity while increasing its capacity utilisation hovering at around 60 percent.\n\nHe said the Edgars Groups subsidiary was targeting to increase its production to 100,000 garments per month as it used to do in 1999.\n\nIt [retooling] means we can produce more garments and production becomes cheaper making us more attractive to exports.\n\nThat is the value at the end of the day. We need to go back to those 1999 levels where we were producing 100,000 a month, supplying our overseas markets, said Mr Tanyanyiwa.\n\nAt the moment we are around 60 percent capacity utilisation. For instance, in November 2024, we were producing over 60,000 units a month.\n\nBut we can easily go back to the 1999 levels of producing 100 000 units but to be able to do that we need to ensure that the retooling exercise continues.\n\nMr Tanyanyiwa said through retooling the company will be able to produce high standards and quality and said the company has so far pumped in US$1,2 million in its recapitalisation programme.\n\nFrom last year, we are talking about US1,2 million investment where we brought in new equipment. Some of that machinery you have already seen here has already been installed, he said.\n\nSome of that machinery is also being made, for instance, we have a boiler being made in Harare and it will take out approximately over US$300 000. We expect it to be in-house in the next one and a half months, said Mr Tanyanyiwa.\n\nHe said the company is employing about 550 people at the moment as it is focusing on winter productions with an additional 200 employees expected to be employed when they are approaching the summer season.\n\nMr Tanyanyiwa appealed to the public to support his company saying buying in the formal sector improves national social amenities as they remit taxes to the Government.\n\nCome support us, come support formalised businesses and that is the only way we can contribute to the revenue generation for the Government, he said.\n\nWhen revenue is generated this is how the Government can provide essential services like health, and education. So, we do appeal to members of the public to come and support us.-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/trwrfgsdf.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE upgrading of Edgars Stores’ Carousel Manufacturing Division in Bulawayo to the tune of US$1,2 million has created massive job opportunities for women and the youth who dominate the staff complement at the giant garment-making factory. Situated in Belmont, the plant is a hub for modern fashion designs — producing high-quality clothes […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "Anele Sithole: The dance maestro taking Zimbabwe to the world",
            "url": "https://www.chronicle.co.zw/anele-sithole-the-dance-maestro-taking-zimbabwe-to-the-world/",
            "content": "ArtistEs emerge from various backgrounds  some develop their craft by imitating others, some are formally trained, while others turn a habit into a profession. However, for Anele Sithole, a 2023 Bulawayo Arts Awards Outstanding Dancer recipient, art runs in his veins. His exceptional talent has made him one of Zimbabwes top dancers, representing the country on international stages in Japan and China.\n\nSithole who is part of Iyasa, shared his journey, reflecting on the cultural similarities and differences he observed between Zimbabwe and these nations.\n\nQ: Please tell us more about yourself.\n\nA: My name is Anele Sithole. I come from a family of five, and Im the fourth-born. I have a seven-year-old son, Happy Sithole.\n\nQ: How did you venture into the arts?\n\nA: I attended Gampu Primary School and later Mpopoma High School, where I actively participated in the arts. My journey began with Bambelela Arts Ensemble before joining Iyasa in 2001.\n\nQ: How did you become one of the best dancers in Zimbabwe?\n\nA: I believe dance is in my genes. My mother, an award-winning traditional dancer, leads the renowned Thandanani Womens Ensemble. Watching her perform inspired me from a young age, and that passion has driven me to where I am today.\n\nAnele Sithole\n\nQ: You have toured China and Japan with various groups. How did it feel, and were there cultural differences in dance?\n\nA: It was an honour to represent my country on such prestigious platforms. It affirmed my purpose as an artist. One thing I noticed is that dance is a universal language. While there were differences in drums and dance styles, adapting was easy because, like us, they also incorporate drums into their performances.\n\nQ: What was your most memorable experience in Japan?\n\nA: Performing a collaborative piece with Japanese dancers was an unforgettable experience. Learning their moves and sharing ours was exciting. Seeing them enjoy our performances was fulfilling  and, of course, I loved the food too!\n\nQ: How has international exposure impacted your career?\n\nA: My experiences abroad have significantly shaped my growth as a dancer. They have given me the confidence to explore and teach various dance styles. My mother also played a huge role in shaping my journey  just as she teaches others, I now find joy in mentoring young dancers.\n\nQ: What advice do you have for young Zimbabwean dancers who aspire to perform internationally?\n\nA: Its not easy to make it to the top, but hard work and patience always pay off. Believe in yourself, trust your craft, and keep pushing forward.\n\nQ: Do you have plans to share your experiences through workshops, teaching, or mentoring?\n\nA: Yes, I am already involved in mentoring young talent. I often work with schoolchildren, teaching them dance and stage performance techniques. I believe in giving back to the community by nurturing the next generation of dancers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/anele-sithole.jpg",
            "description": "ArtistEs emerge from various backgrounds — some develop their craft by imitating others, some are formally trained, while others turn a habit into a profession. However, for Anele Sithole, a 2023 Bulawayo Arts Awards Outstanding Dancer recipient, art runs in his veins. His exceptional talent has made him one of Zimbabwe’s top dancers, representing the […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        },
        {
            "title": "President presides over Youth Day celebrations in Bulawayo",
            "url": "https://www.chronicle.co.zw/president-presides-over-youth-day-celebrations-in-bulawayo/",
            "content": "Sikhumbuzo MoyoPRESIDENT Mnangagwa will preside over this years main National Youth Day celebrations at the Zimbabwe International Exhibition Centre (ZIEC) in Bulawayo today in line with the Second Republics decentralisation of State events.\n\nThis years celebrations will run under the theme: Empower Youth, Secure the Future.\n\nThe day is celebrated on February 21 each year to reflect on issues affecting young people in Zimbabwe. The national event upholds the principles of effective youth participation.\n\nIn his post-Cabinet briefing on February 11, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, said that as a duly proclaimed and gazetted national holiday, the event will provide a platform for young people to interact with President Mnangagwa.\n\nCabinet considered and approved the preparations for the 21st February commemorations report, as presented by the Minister of Local Government and Public Works in his capacity as acting chairman of the Cabinet Committee on State Occasions and National Monuments, Honourable Engineer Daniel Garwe, he said.\n\nThe nation is informed that the 2025 National Youth Day Celebrations will be held at Barbourfields Stadium, Bulawayo, from February 20 to 21, in line with the Second Republics policy of rotating national events.\n\nDr Muswere said young people will showcase their talents, businesses, and contributions to national development, raise awareness on the dangers of drug and substance abuse, and promote commitment and investment in youth development initiatives, programmes, and projects.\n\nRunning under the theme Empower Youth, Secure the Future, the main event on February 21 is expected to attract a total of 20 000 youths drawn from the countrys nine provinces, with the rest of the youths in all provinces following proceedings in real-time at designated Vocational Training Centres and institutions of Higher Learning, he said.\n\nDr Muswere stated that foreign visitors, including ministers and youth council representatives from selected African countries, are expected to attend the event.\n\nThe pre-celebrations events on 20 February 2025 will attract an estimated total of 5,000 youths drawn from schools and institutions of higher and tertiary education within Bulawayo Metropolitan Province and the adjoining provinces.\n\nHighlights of the day will include a sporting and cultural fiesta, youth exhibitions, a clean-up campaign programme, a community outreach initiative on drug and substance abuse, and the distinctive Ixhiba/Nhanga/Gota exposition by the First Lady, Amai Dr Auxillia Mnangagwa, he said.\n\nFirst Lady Dr Auxillia Mnangagwa\n\nDr Muswere added that logistical preparations are already underway, with a total of 250 buses earmarked for equitable distribution across the countrys provinces.\n\nAdditionally, 15 shuttle buses will be made available to all constituencies in Bulawayo Metropolitan Province to facilitate the successful execution of the 20 February 2025 programme, he said.\n\nLast year, National Youth Day celebrations were held at Mushagashe Vocational Training Centre in Masvingo Province.\n\nCelebrated annually on 21 February, the national holiday marks the birth date of the late former President Robert Mugabe. It seeks to honour his legacy and encourage youths to embrace strong leadership values by emulating the ethos upheld by national liberators.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/BDFXC.jpg",
            "description": "Sikhumbuzo Moyo PRESIDENT Mnangagwa will preside over this year’s main National Youth Day celebrations at the Zimbabwe International Exhibition Centre (ZIEC) in Bulawayo today in line with the Second Republic’s decentralisation of State events. This year’s celebrations will run under the theme: “Empower Youth, Secure the Future.” The day is celebrated on February 21 each […]",
            "time": "09:28",
            "date": "21 Feb 2025"
        }
    ]
}