{
    "news": [
        {
            "title": "Made in Zimbabwe!… 100% local Coal Tar Project ushers road construction revolution",
            "url": "https://www.chronicle.co.zw/made-in-zimbabwe-100-local-coal-tar-project-ushers-road-construction-revolution/",
            "content": "Rutendo Nyeve, Zimpapers Writer\n\nA GROUND-BREAKING project poised to revolutionise road construction in Zimbabwe has been unveiled, showcasing how strong partnership between Government, academia and the private sector can yield innovative, cost-effective and sustainable solutions for national development.\n\nThe project, known as the Coal Tar Project, is a joint initiative by the Ministry of Transport and Infrastructural Development, the Research Council of Zimbabwe (RCZ) and Midlands State University (MSU).\n\nIt aims to produce a locally manufactured, environmentally friendly road binder as an alternative to costly imported bitumen.The first prototype overlay is scheduled to be rolled out on the Kwekwe-Gokwe Road this week where it will serve as a live testing site for the innovations effectiveness.\n\nDeveloped at Zimchems industrial plant in Redcliff, the project utilises crude tar from Hwange coking ovens and recycled chrysotile fibres from the Shabanie-Mashava mines to create a fibre-modified coal tar binder.The result is a more durable and eco-conscious material that is also significantly cheaper  US$0,70 per litre compared to US$2,50 per litre for imported bitumen.\n\nSpeaking during the inaugural Research for Sustainable Industrialisation and Economic Development indaba held during the recent Zimbabwe International Trade Fair (ZITF) in Bulawayo, the ministrys chief research and testing officer who is also the principal investigator, Mr Actor Zonde, said the innovation is a game changer for the construction industry.\n\nBy combining coal tar with recycled chrysotile fibres, we have engineered a binder that outperforms traditional materials.Laboratory tests show a 50 percent increase in tensile strength, reaching 5,8 mega pascals and thermal stability up to 90C, significantly reducing road degradation in extreme weather, he said.Mr Zonde said the innovation also addresses environmental and health concerns associated with older coal tar variants.\n\nThrough silicate catalysis, we have slashed toxic polycyclic aromatic hydrocarbons (PAHs) emissions, making the material safer for workers and communities, said Mr Zonde.\n\nDr Thomas Utete Wushe\n\nHe said the project aligns with Zimbabwes push for industrial self-reliance.The Zimchem plant, with a monthly capacity of 150 tonnes, is already operational and supplying materials for the ongoing resealing of the Kwekwe-Gokwe Road. Beyond enhancing road quality, the innovation is contributing to job creation and industrial revival in areas like Redcliff and Zvishavane.\n\nThis isnt just about building better roads, its about building livelihoods. Reviving operations at Shabanie-Mashava mines and scaling up production at Zimchem will boost employment and cut infrastructure development costs, making housing more affordable in under-served areas, said Mr Zonde.\n\nPreliminary results show the binder is highly resistant to bleeding and cracking, and the Department of Roads plans to expand its use for pothole patching and rejuvenation of recycled asphalt, further slashing maintenance costs.Speaking at the same event, Permanent Secretary in the Ministry of Industry and Commerce, Dr Thomas Utete Wushe, hailed the project as a model for research-driven industrial growth.\n\nThis innovation demonstrates the power of transforming academic research into practical commercial solutions. We must deepen collaboration between universities, research institutions, Government and the private sector to solve the challenges facing our industries, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/3t443.jpg",
            "description": "Rutendo Nyeve, Zimpapers Writer A GROUND-BREAKING project poised to revolutionise road construction in Zimbabwe has been unveiled, showcasing how strong partnership between Government, academia and the private sector can yield innovative, cost-effective and sustainable solutions for national development. The project, known as the Coal Tar Project, is a joint initiative by the Ministry of Transport […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Air ambulance for everyone… Helidrive service expands operations",
            "url": "https://www.chronicle.co.zw/air-ambulance-for-everyone-helidrive-service-expands-operations/",
            "content": "Sikhumbuzo Moyo, Senior Reporter\n\nZIMBABWE is leading the way to becoming the first African country to have a public air rescue service covering the entire country following the establishment of Helidrive National Air Rescue Service that was officially launched in August last year.\n\nThe air ambulance service was set up through a friendship between the Russian Republic and the Republic of Zimbabwe where President Vladimir Putin and President Mnangagwa saw it fit to have a well-developed system of air evacuation, given the challenges the country faced in terms of air rescue transportation services.\n\nSpeaking in an interview at the Ministry of Health and Child Care stand at the just-ended 65th edition of the Zimbabwe International Trade Fair, one of the doctors, Dr Rudo Gumbo said the company was brought into existence to try and validate some of the medical transportation challenges the country faced. The service started operating in Harare in July 2024 under the Ministry of Health and Child Care while the second base in Bulawayo started functioning in December of the same year.Since July 2024, the company has evacuated 450 patients, 150 of whom were neonates (less than 28 days old).60 patients evacuated so far were from the Matabeleland region, said Dr Gumbo.\n\nNext month, we are hoping that our Victoria Falls branch will start operating. We have identified bases throughout the country, which are future bases and these are Masvingo, Mutare, Kariba and Buffalo Range, said Dr Gumbo.\n\nThese bases are determined by the range, which our helicopters cover, that is 180km one way. This is probably the first national air rescue service, which is not privatised on the continent, thanks to the visionary leadership of the Second Republic as led by President Mnangagwa, she added.\n\nDr Gumbo said in identifying bases, they took into account the availability of refuelling services and hopes were high that by the end of the year, the services should cover the whole country.\n\nShe said plans were underway to establish a national call centre to make it easy for those seeking services.The national call centre will establish through questioning whether or not a patient needs an air rescue service, said Dr Gumbo.\n\nShe said the beauty about the Helidrive Air Rescue Service is that it has a critical care service unit on board so the patient starts receiving health care on board.\n\nA Russian doctor, who is part of the crew, Dr Dmitry Senuita, said the experience to date has been excellent and also expressed gratitude that they have been able to save lives.\n\nThe experience has been great so far, we have a lovely team of medical personnel we are working with, yes, medical systems between the two countries are different but its not something to worry about, we are coping well, he said.\n\nDr Senuita said there were six doctors in Bulawayo and the same number in Harare as well as nurses.Vice-President Constantino Chiwenga visited the ministrys stand on Thursday during the Zimbabwe International Trade Fair (ZITF) in Bulawayo and was taken through the air rescue services operations.\n\nThe Second Republic under the stewardship of President Mnangagwa is modernising the health sector as part of deliberate efforts to create a modern, prosperous, and highly industrialised country by 2030.\n\nIn June last year, the President was in Russia where he scouted for investors to help set up the air ambulances rescue service.Russian Helidrive Air Ambulance swiftly responded, bringing in expertise to set up a highly efficient emergency medical service.\n\nThe air ambulance service boasts a fleet of over 100 medical helicopters, which have been saving lives across Russia for the past nine years.\n\nLocal capacity building has been a key component of the initiative and as such Helidrive Zimbabwe has recruited and trained 40 local pilots, 50 doctors, 100 nurses, 100 dispatchers and 10 engineers to operate and manage the new service.Air ambulances play a vital role in transporting patients requiring higher levels of medical care or those unable to travel by road due to their condition.\n\nThe helicopters are specifically designed to navigate geographical barriers while offering intensive care comparable to that available in hospital settings.\n\nEquipped with cutting-edge medical technology and staffed by highly trained personnel, air ambulances are an essential component of emergency medical response systems worldwide.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/refwwf.jpg",
            "description": "Sikhumbuzo Moyo, Senior Reporter ZIMBABWE is leading the way to becoming the first African country to have a public air rescue service covering the entire country following the establishment of Helidrive National Air Rescue Service that was officially launched in August last year. The air ambulance service was set up through a friendship between the […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "‘Only SADC can tell its own story’",
            "url": "https://www.chronicle.co.zw/only-sadc-can-tell-its-own-story/",
            "content": "Clarkson Mambo\n\nUntil the lion learns how to write, every story will glorify the hunter.\n\nThis famous African saying, which stresses the importance of being able to tell your own story, summarises the sentiment of southern African communication experts on why the region must always be first in telling its own story.\n\nExactly 45 years ago, the founding fathers of the Southern African Development Community (SADC), then known as the Southern African Development Coordination Conference (SADCC), came together to establish a regional organisation.\n\nAt its inception in April 1980, the organisation was established to champion national political liberation across southern Africa and to reduce economic dependence on apartheid-era South Africa.\n\nThrough strategic coordination and efficient utilisation of each countrys unique strengths and resources, the organisation sought to foster regional self-sufficiency and cooperation, laying the foundation for sustainable development and political autonomy in the region.\n\nIn 1992, SADCC transformed to SADC, with a refined mandate focused on promoting sustainable development, fostering economic growth, reducing poverty and improving the quality of life for the peoples of southern Africa.\n\nIts membership has grown from the initial nine countries to 16, while the population has grown from around 60 million in 1980 to about 400 million at present, and gross domestic product has expanded from US$20 billion to more than US$800 billion.\n\nThe stories of how the region has transitioned, the successes recorded and challenges faced as well as opportunities for deepening regional integration are unlimited, but largely remain unknown by the regions citizens.\n\nTo ensure greater public understanding and engagement, regional communication experts met in Johannesburg, South Africa from 15 to 16 April to validate the Draft SADC Communication, Awareness and Visibility Strategy 2025-2030.\n\nThe experts emphasised that SADC member states must actively and consistently communicate the organisations mission, achievements and ongoing initiatives, enabling both citizens and external stakeholders to recognise, appreciate and support efforts aimed at advancing regional development and integration.\n\nSADC is relevant, and the region is better off with SADC than without SADC. We need more, and more stories in various channels in our countries and beyond, showcasing SADCs impact on regional development and successes across different sectors in fostering economic growth, regional integration, and sustainable development, said Barbara Lopi, the Head of Communication and Public Relations at the SADC Secretariat.\n\nThe strategy aims to strengthen SADCs strategic communication capacity, fostering greater awareness, understanding and visibility of the organisations mission and initiatives.\n\nBy engaging SADC citizens and member state officials, the strategy seeks to stimulate sustained interest and active participation, ultimately supporting the realisation of the Regional Indicative Strategic Development Plan (RISDP) 2020-2030 and the SADC Vision 2050.\n\nThe RISDP 2020-2030 and SADC Vision 2050 are the two blueprints guiding the regions development and integration.\n\nAmong other things, the strategy aims to adapt to the shifting media exposure patterns and audience engagement habits, ensuring relevance in a rapidly evolving communication landscape shaped by technological advancements such as artificial intelligence and diverse stakeholder expectations.\n\nBy embracing innovation and responsiveness, the strategy seeks to enhance outreach, engagement and visibility across multiple platforms.\n\nThe new strategy signals the regions renewed commitment to enhancing the visibility and communication capacity of SADC, ensuring it resonates with our citizenry and engages them actively in our regional agenda, said Lawrence Masera from Zimbabwe, representing the chairperson of the SADC Council of Ministers.\n\nBy actively implementing the strategy, SADC aims to reshape public perception, shifting from an image of an elitist organisation primarily serving member state leadership to one that actively prioritises the interests of citizens, the experts said.\n\nTo enhance awareness and visibility of SADC Day celebrated annually on 17 August to commemorate the signing of the SADC Declaration and Treaty, a proposal was put forward during the meeting to officially recognise the day as a public holiday across all the 16 member states.\n\nThis initiative aims to strengthen regional identity and foster greater citizen engagement in SADC affairs. The proposal also envisions country-specific programmes and activities, ensuring that each member state celebrates the occasion through events that highlight SADCs achievement, vision and ongoing regional integration efforts.\n\nDr Thabani Moyo, Regional Director of the Media Institute of Southern Africa, cautioned that the lack of effective communication regarding the successes of the regional organisation was contributing to a declining sense of Pan-Africanism among citizens in the region.\n\nHe emphasised that clear, consistent, and impactful messaging is essential to fostering regional unity, identity and collective progress, ensuring that communities remain actively engaged in the vision and achievements of the organisation.\n\nGoing down memory lane, Dr Moyo said there was unquestionable regional solidarity when different countries such as Mozambique and Tanzania hosted liberation movements from other countries in the region that were fighting for their independence.\n\nNowadays, you hear people from a country that is providing support to the SADC Mission in the Democratic Republic of Congo questioning why their soldiers are being involved as if what is happening elsewhere in the region does not affect them as well, he said.\n\nClear and effective communication by the SADC Secretariat and member state leadership plays a vital role in promoting a deeper understanding of the benefits of regional integration. By consistently engaging citizens on the shared vision and objectives of SADC, leadership can enhance public awareness of the benefits of belonging to a unified regional community.\n\nStrengthening this connection ensures that citizens recognise SADC as more than an institutionit is a collective family working towards economic development, stability and prosperity for all.\n\nIf SADC does not tell its own story, someone else will, Dr Moyo said.\n\nAs part of initiatives to tell its story, the SADC Secretariat has launched editions of the SADC Success Stories initiative that highlight major institutional, socio-economic, and peace and security achievements and milestones.\n\nSome of the major milestones relating to deepening integration include the signing of more than 30 protocols across strategic areas which laid a strong legal, institutional and strategic foundation for advancing regional cooperation.\n\nOn economic integration, for example, the region launched the SADC Real Time Gross Settlement System multi-currency platform, which went live in October 2018 to facilitate faster and more effective payment for transactions in the region.\n\nIn 2008, the SADC Free Trade Area (FTA) was launched. By attaining the status of the FTA, consumers in the region are now getting better products at lower prices due to increased production, while producers are benefiting from a tariff-free trade for all goods originating within the region.\n\nIn the energy sector, SADC facilitated the establishment of the Southern African Power Pool in 1995, where regional power utilities are afforded the platform to sell and buy surplus electricity from each other, thereby helping some countries meet their growing demand for energy.\n\nWith respect to political stability, the region has largely succeeded in consolidating peace and security through various initiatives. This is despite challenges being faced in a few countries.\n\nIt was through the then SADCC, with support from other countries, speaking with one voice against apartheid in South Africa that culminated in the independence of Namibia (1990) and South Africa (1994).\n\nWhile the list of achievements and milestones is long, citizens of the region largely remain unaware due to limited communication and awareness.\n\nThis is what SADC, through the draft Communication, Awareness, and Visibility Strategy (2025-2030) is aiming to achieve.\n\nThe draft strategy is based on a strong foundation established by the previous Communication and Promotional Strategy (2016-2020).\n\nThe review of the strategy was supported by the German Agency for International Co-operation (GIZ) under its Strengthening National-Regional Linkages Programmes (SNRL).\n\nThe SNRL initiative seeks to address challenges that hinder success of regional integration in SADC by focusing on improving the linkages between SADC and its member states through the provision of capacity building programmes for national structures that are responsible for co-ordination of regional integration initiatives and support and alignment between regional protocols and policies in the member states. Another key focus is to enhance co-ordination, planning implementation, monitoring and evaluation of SADC policies, protocols and legal instruments.  sardc.net.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/sadc-logo-680x380.jpg",
            "description": "Clarkson Mambo Until the lion learns how to write, every story will glorify the hunter.” This famous African saying, which stresses the importance of being able to tell your own story, summarises the sentiment of southern African communication experts on why the region must always be first in telling its own story. Exactly 45 years […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Once queens, always queens. . . Former national titleholders in Miss Universe Zim Top 10",
            "url": "https://www.chronicle.co.zw/once-queens-always-queens-former-national-titleholders-in-miss-universe-zim-top-10/",
            "content": "Tafadzwa Zimoyo,Zimpapers Arts and Entertainment Editor\n\nOn Saturday night, Miss Universe Zimbabwe organisers unveiled the top 10 contestants who will battle for the crown. The finalists are: Onesimo Nkomo, Samkhele Dhlamini, Charmaine Emmanuel, Chiedza Mhosva, Brenda Kadewe, Rumbidzai Muzopa, Annie Grace Mutambu, Charlotte Muziri, Talic Magaiza and Lyshanda Moyo.\n\nAccording to the organisation, this years Top 10 represents a diverse range of professions, including a town planner, healthcare professionals, businesswomen, a nurse, fashion models, entrepreneurs and a purchasing management student, among others.\n\nThe group was selected by an elite panel of judges comprising Miss Universe Zimbabwe board members, undisclosed guest judges and outgoing queen Sakhile Dube.\n\nIn the coming weeks, the finalists will enter a boot camp as they gear up for the grand finale scheduled for May 17 at Harares Hippodrome amphitheater. The winner will go on to represent Zimbabwe at Miss Universe 2025 in Thailand.\n\nThis years edition promises excitement and surprises, with the inclusion of married women, mothers, and returning pageant veterans. This marks a historic moment, as married women and mothers compete for the first time in Zimbabwes pageant history.\n\nNotably, former beauty queens such as Chiedza Mhosva (Miss World Zimbabwe 2017), Annie Grace Mutambu (Miss Zimbabwe 2015), and Charlotte Muziri (Miss Zimbabwe International 2023) are back to stake their claim for the title. Other finalists including Brenda Kadewe (Miss Planet Zimbabwe 2024) and Charlotte Muziri (Miss International Zimbabwe 2023) also boast national crowns showing how stiff competition is going to be.\n\nThe global Miss Universe Organisations 2023 reforms, removing the upper age limit and allowing married, divorced and parenting women to compete, have profoundly reshaped the beauty industry, making the competition more inclusive. This shift has already produced inspiring contestants worldwide, such as Brazils Luana Cavalcante and Costa Ricas Elena Hidalgo at Miss Universe 2023.\n\nMiss Universe Zimbabwe national director, Tendai Hunda, hailed this years line-up as amazing and shared the importance of representation.\n\nIt takes a lot of respect and trust in the organisation to return to pageantry after holding national titles. Miss Universe remains every girls dream, and these women are willing to trade their big crowns for an even bigger one.\n\nShe admitted that narrowing the pool from 20 to 10 finalists was an extremely difficult task for the judges.\n\nThe Top 10 is one of a kind, highly inclusive, brilliant, aggressive and beautiful women. Im excited for this years edition and looking forward to seeing Zimbabwes flag soar high in Thailand, she said.\n\nHunda also revealed that this years grand finale will be a tightly scripted two-hour show, suited for television broadcast.\n\nThe main event is on May 17, with a pre-show on May 16 where the Top 5 and Top 3 will be decided.\n\nThe hosts, judges, and red-carpet presenter will be announced closer to the date. As this is a modelling event, not a concert, well only feature one performing artiste, whose identity will be revealed soon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Annie-Grace-Mutambu.jpg",
            "description": "Tafadzwa Zimoyo, Zimpapers Arts and Entertainment Editor On Saturday night, Miss Universe Zimbabwe organisers unveiled the top 10 contestants who will battle for the crown. The finalists are: Onesimo Nkomo, Samkhele Dhlamini, Charmaine Emmanuel, Chiedza Mhosva, Brenda Kadewe, Rumbidzai Muzopa, Annie Grace Mutambu, Charlotte Muziri, Talic Magaiza and Lyshanda Moyo. According to the organisation, this year’s […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Presidential schemes see farm output shoot up under local hands",
            "url": "https://www.chronicle.co.zw/presidential-schemes-see-farm-output-shoot-up-under-local-hands/",
            "content": "Precious Manomano, Zimpapers Writer\n\nA cocktail of schemes and facilities that have been rolled out by President Mnangagwa in the past few years have this year seen an impressive 85 percent of the total crops produced coming from small-scale farmers.\n\nAmong these, 60 percent are beneficiaries of the land reform initiative.Thanks to the interventions introduced by President Mnangagwa, Zimbabwes agricultural sector has thrived, focusing on increasing both production and productivity.\n\nFarming is now viewed as a full-time profession, providing many families with decent wages.The Crop, Livestock, and Fisheries Assessment (CLAFA-1) for the 2024/25 season shows significant growth in maize, sorghum, sweet potatoes, and tobacco cultivation, highlighting the effectiveness of the land reform initiative and the accompanying Government interventions.\n\nProfessor Obert Jiri, the Permanent Secretary for Lands, Agriculture, Fisheries, Water, and Rural Development, said that the various schemes have had a transformative impact on local farmers, resulting in increased crop production, especially in wheat and maize, which marks a major shift in the agricultural landscape.\n\nProf Jiri said that the bumper harvests achieved illustrate the effectiveness of Government policies in enhancing agricultural output.\n\nSince the land reform, we have managed to achieve a bumper harvest of all crops this season. The Government has introduced various policies to support farmers and boost productivity levels. These include the Presidential Input Scheme, Pfumvudza, and Command Agriculture, he said.\n\nAdditional schemes include the Presidential Cotton Scheme, Presidential Tick Grease Scheme, Presidential Rural Horticulture Scheme, Presidential Community Fisheries Scheme, Presidential Rural Poultry Scheme, Presidential Rural Goat Pass-on Scheme, Presidential Solar Scheme, Presidential Borehole Scheme, and Presidential Rural Development Scheme.\n\nMore than 11 million people have benefited from the various initiatives designed to enhance household and national food security.Through these tailored schemes, beneficiaries are earning a decent living and creating a foundation for an upper-middle-income economy by 2030.\n\nProf Jiri further noted that success is not just about the amount of land cultivated but about maximising productivity per unit area.\n\nIts about producing more from fewer resources, which is the hallmark of agricultural transformation in Zimbabwe.He stressed the importance of engaging with the private sector saying the partnerships can drive substantial growth in agriculture.\n\nProf Jiri encouraged farmers to collaborate with landholders who may lack resources and form strategic partnerships through joint ventures.\n\nApart from providing inputs Government has successfully implemented 460 smallholder irrigation schemes, benefiting 35 585 households across 26 173 hectares of land to enhance farmers incomes while ensuring efficient water resource management.A total of 19 264ha representing 74 percent of the equipped area are functional, with 15 859 hectares fully operational and 3 405 hectares partially operational.\n\nStatistics from the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development revealed that Manicaland has 9 257 registered beneficiaries who benefited from 67 irrigation schemes with a capacity to irrigate 5 683ha.\n\nIn Mashonaland West, 2 287 beneficiaries benefited from 50 schemes covering 1 553ha. Matabeleland North has 1250 beneficiaries from 33 schemes that can irrigate 1 161ha, while Mashonaland East supports 1 594 beneficiaries through 56 schemes with a capacity of 2 933ha. The Midlands region has 3 719 registered beneficiaries from 56 schemes that irrigate 1 821ha. Masvingo boasts 8 172 beneficiaries supported by 73 schemes with a capacity of 4 168ha, and Mashonaland Central contributes 2 594 beneficiaries through 49 schemes that can irrigate 5 218ha.\n\nMatabeleland South has 6 712 beneficiaries benefiting from 74 schemes with a capacity to irrigate 2 945ha.The Vision 2030 accelerator model, launched by President Mnangagwa in 2021, focuses on imparting agribusiness skills to rural, urban, and peri-urban households to ensure that their farming enterprises are self-sustaining and run profitably.\n\nThis model supports rural industrialisation as part of the Second Republics drive to scale up agricultural transformation, transforming irrigation schemes into viable business units, and managing 35 000 Village Business Units (VBUs), 9 600 School Business Units (SBUs), and 68 Vocational Training Centre Business Units (VTCBUs).\n\nThe Village Business Unit concept aims to establish 35 000 companies across villages, each equipped with a solar-powered borehole and linked to aggregation and value-addition centres.\n\nBeneficiaries from the schemes have expressed profound gratitude for the opportunities it has created.\n\nThese sentiments were echoed at the tobacco auction floor, where beneficiaries expressed satisfaction with the prices of their tobacco sales. Various interventions that have been made in the agriculture sector have not only improved farmers economic prospects but also restored their dignity, allowing them to thrive as farmers in an independent Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ggte.jpg",
            "description": "Precious Manomano, Zimpapers Writer A cocktail of schemes and facilities that have been rolled out by President Mnangagwa in the past few years have this year seen an impressive 85 percent of the total crops produced coming from small-scale farmers. Among these, 60 percent are beneficiaries of the land reform initiative. Thanks to the interventions […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Monthly inflation stays low, returns to positive territory",
            "url": "https://www.chronicle.co.zw/monthly-inflation-stays-low-returns-to-positive-territory/",
            "content": "Tapiwanashe Mangwiro,Harare Bureau\n\nZimbabwe Gold (ZiG) monthly inflation rate returned to positive territory, gaining 7 percentage points to 0,6 percent for April 2025, after the slight deflation in March when prices dipped by -0,1 percent.\n\nAnnual inflation rate, officially the first since ZiG was introduced in April last year, came in at 85,7 percent.\n\nThe yearly rate matches the elevated annual inflation forecast due to price increases that ensued the devaluation of the domestic currency in October to address exchange rate distortions in the market.\n\nAccording to the Zimbabwe National Statistical Agency (ZimStat), This means that prices as measured by the all-items ZiG CPI, increased by an average of 0,6 percent from March 2025 to April 2025.\n\nThe ZiG Consumer Price Index (CPI) now stands at 185,68, up from 184,50 in March and from 100,00 in April 2024, reflecting the baseline at the time of the currency transition.\n\nThe modest monthly increase follows several rounds of price adjustments and market realignment after the Government introduced the structured currency system in 2024 to curb chronic inflation, stabilise the economy and restore confidence in the monetary system.\n\nOn the US dollar front, inflation remained subdued.\n\nZimStat reported a USD month-on-month inflation rate of 0,2 percent in April 2025, compared to 0,1 percent in March.\n\nThe USD CPI rose to 122,12 from 121,87 over the same period.\n\nFood prices in US dollars remained steady, while non-food items posted a mild increase of 0,3 percent.\n\nThis means that prices as measured by the all-items USD CPI, increased by an average of 0,2 percent from March 2025 to April 2025, ZimStat said.\n\nIn a combined picture, the Weighted Consumer Price Index, which accounts for price changes in both US dollar and ZiG currencies, showed a month-on-month inflation rate of 0,3 percent in April 2025, up from 0,0 percent in March.\n\nThe weighted CPI rose to 126,18 from 125,84.\n\nWhile these month-on-month figures appear tame, the statistical agency reported the ZiG annual inflation rate paints a somewhat complex picture.\n\nThe ZiG year-on-year inflation rate for April 2025 as measured by the all-items ZiG CPI was 85,7 percent, ZimStat said. The elevated annual inflation, expected to moderate through the year on durable price stability, was anticipated by monetary authorities.\n\nThe Reserve Bank of Zimbabwe (RBZ) has maintained that the high annual inflation was inevitable following the sharp exchange rate correction implemented in September2024.\n\nAt the time, the central bank devalued the local currency to curb parallel market activity and boost foreign currency inflows, causing a temporary spike in prices.\n\nThe RBZ, however, remains optimistic that inflation will gradually decline over the coming months.\n\nIt projects that annual inflation will moderate to around 20 percent by the end of the fourth quarter of 2025, anchored by a tight monetary policy, increased market discipline, and growing confidence in the structured currency framework.\n\nEconomists are cautiously optimistic about the trajectory of inflation and the RBZs policy stance.\n\nGladys Shumbambiri-Mutsopotsi said the RBZs move to liberalise the exchange rate and adopt the ZiG had brought much-needed transparency to the pricing system.\n\nThis was a bold monetary stance. It is helping to anchor inflation expectations and reduce distortions in the market, she said. However, inflation is still largely driven by cost-push factors, and these will take time to tame.\n\nAnother economic analyst, Tinevimbo Shava, echoed the same sentiments, adding that while price stability is a welcome development, fiscal stimulus is needed to sustain demand.\n\nThe challenge now is not hyperinflation but weak aggregate demand, Mr Shava said.\n\nThe Government, as the biggest employer and consumer, needs to increase its spending on goods and services to boost disposable income in the real economy. Otherwise, we risk sliding into deflation in some sectors.\n\nIndeed, the food and non-alcoholic beverages category, often used as a reflector of consumer behaviour, showed mixed trends.\n\nIn ZiG terms, food prices declined by 0,2 percent month-on-month in April, despite the broader CPI rising. In USD terms, food prices remained unchanged, and the weighted food inflation rate was negative at -0,1 percent.\n\nThis softening of food prices provides temporary relief for households, but it also signals sluggish demand, a concern for businesses trying to rebuild margins post-currency transition.\n\nEconomist Dr Prosper Chitambara described the monetary policy framework as generally sound but warned that stability alone will not spur growth.\n\nThe RBZ has done well to rein in monetary expansion and restore discipline. But monetary stability is only half the battle, Dr Chitambara said.\n\nFiscal policy must now play its part.\n\nPublic sector spending needs to support industrial production, infrastructure and social protection.\n\nThats how you avoid a low-growth equilibrium.\n\nThe RBZ has signalled that it will maintain its tight liquidity management stance in the short term, relying on non-inflationary instruments such as open market operations, digital platforms, and interest rate signalling to steer the economy.\n\nZimStats release also highlighted the average price changes since January 2025.\n\nThe mean month-on-month inflation rate for ZiG from January to April was 2,9 percent, slightly below the 3 percent mean recorded for both the US dollar and weighted indices.\n\nThis suggests a broad stabilisation trend since the new monetary framework tookroot.\n\nThe data for the April inflation report was collected between April 11th and 17th, 2025, with ZimStat employing geometric aggregation to compute the weighted index based on household expenditure shares in US dollar and ZiG.\n\nAs Zimbabwe continues to adapt to its restructured monetary system, all eyes will be on consumer sentiment and fiscal policy to determine whether the economy can maintain disinflation without sliding into stagnation.\n\nFor now, the figures show a cautiously encouraging outlook, one in which price growth is slowing, but momentum remains fragile.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/tejt.jpg",
            "description": "Tapiwanashe Mangwiro, Harare Bureau Zimbabwe Gold (ZiG) monthly inflation rate returned to positive territory, gaining 7 percentage points to 0,6 percent for April 2025, after the slight deflation in March when prices dipped by -0,1 percent. Annual inflation rate, officially the first since ZiG was introduced in April last year, came in at 85,7 percent. The […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "NOT AGAIN! Dembare fail to score once more",
            "url": "https://www.chronicle.co.zw/not-again-dembare-fail-to-score-once-more/",
            "content": "Eddie Chikamhi,Zimpapers Sports Hub\n\nDynamos 0-0 Kwekwe United\n\nDISGRUNTLED Dynamos supporters yesterday refused to entertain head coach Lloyd Mablanyo Chigowe after the giants produced yet another drab performance in a drawn Castle Lager Premiership match against struggling Kwekwe United at Rufaro Stadium.\n\nChigowes efforts to pacify the dejected crowd in the Vietnam Bay turned awry as the DeMbare faithful were clearly unhappy after watching their side fail to score for a fourth consecutive game.\n\nThe Dynamos fans would have none of it, and Chigowe was forced to turn back halfway after the crowd rose in a chorus of disapproval.\n\nYeah, its normal and natural at Dynamos, he said.\n\nEven if you look at Scottland, they are not happy with draws. So, you must expect that when results are not coming, the fans will not be fond.\n\nTheyll not be happy, and I understand that pretty well because they want a win nothing less, nothing more.\n\nThe Dynamos fans felt their team missed a big chance to bag a rare win against a side whose preparations were hampered by instability in the camp due to financial strife.\n\nKwekwe United, who failed to fulfil a home fixture against Herentals in Gweru because of these squabbles, yesterday matched DeMbare in all departments, and a point was huge for them considering they had only about 24 hours to prepare for the duel.\n\nThe visitors wanted to avoid defeat at all costs and slowed down the game at every opportunity to frustrate their hosts, who were under pressure following a disappointing run of three defeats in succession.\n\nKwekwe United had a strong penalty appeal turned down in the 28th minute when DeMbare midfield strongman Shadreck Nyahwa handled the ball inside the penalty box.\n\nTheir forward Maxwell Murimba, who was a threat to the DeMbare defence for most of the afternoon, then blasted his shot over the bar from close range with the Dynamos defenders at sea.\n\nHowever, DeMbare had more scoring opportunities which they squandered. Ghanaian Frank Agyemang and Elton Chikona were the main culprits.\n\nAgyemang was gifted possession inside the penalty box following a defensive blunder, but made a poor decision to blast his shot straight into the badly exposed goalkeeper Lenon Goneses legs.\n\nThe Ghanaian later crashed a header against the crossbar as DeMbare searched for the elusive goal in the dying minutes.\n\nExperienced forward Valentine Kadonzvo also had an opportunity just before the breather when he almost caught the goalkeeper off his line, but his attempted lob narrowly missed the target.\n\nThe back-pedalling Gonese crashed against the upright, causing a brief delay.\n\nI thought we dominated and created goal-scoring opportunities. Unfortunately, our Achilles heel has been finishing. I think we did everything, said Chigowe.\n\nThe boys gave their heart out to get a result. Its unfortunate we ended up sharing the spoils. I think sometimes its a question of psychology, a question of confidence.\n\nOnce these boys hit the net, I think one of these days theyll tear another team apart. You saw the clear chances that Frank Agyemang got, the header.\n\nYou saw Eltons corner miss a lot, but I think its a question of us getting one goal, said Chigowe.\n\nHe also felt Kwekwe United, despite sitting bottom of the table going into the fixture, were not easy opponents.\n\nThe problem with Kwekwe United is not about ability; it is about their financial woes, which are way beyond every other team. You saw yesterday they received a windfall from elsewhere and they were motivated. In Kariba, they actually had to be persuaded to leave the changing room.\n\nThey were not interested in playing. And today I think their motivation levels were high. So, if you saw that theyve drawn against two of the big giants in the league, it tells you that theyve got pedigree, said Chigowe.\n\nDynamos dropped into 14th place with the draw, with seven points from eight games. The draw was good enough to lift Kwekwe United off the bottom of the table, but they remained in the bottom three.\n\nHowever, only one point now separates them from Dynamos. Saul Chaminukas men looked comfortable on the ball yesterday, powered by veterans such as Allen Gahadzikwa, Masimba Mambare, and Denis Dauda.\n\nWinger Andile Taruvinga could have punished the hosts after he was released inside the box by veteran midfielder Allen Gahadzikwa, but blasted his effort wide late in the game.\n\nI think the boys did a good job today, said Kwekwe United coach Chaminuka.\n\nWe probably wouldnt have come again for this game against Dynamos. But, you know, players being who they are if they say they want to play, they will play. If they say they dont want to play, you will see it with what happens on the field.\n\nIm happy that we had a good performance, we looked organised, and I think we had answers to a lot of questions that we asked in the field of play.\n\nThis must see us getting off the basement and going up. And maybe in a few games, we will start to compete because I dont think these other teams have run away with the possibility of winning the title.\n\nWe are still very much within, and I think we still have 10 games in this first round. As long as the boys are prepared to support us, we will go through, said Chaminuka.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Lloyd-“Mablanyo”-Chigowe.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub Dynamos 0-0 Kwekwe United DISGRUNTLED Dynamos supporters yesterday refused to entertain head coach Lloyd “Mablanyo” Chigowe after the giants produced yet another drab performance in a drawn Castle Lager Premiership match against struggling Kwekwe United at Rufaro Stadium. Chigowe’s efforts to pacify the dejected crowd in the Vietnam Bay turned awry […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Asaph on new track",
            "url": "https://www.chronicle.co.zw/asaph-on-new-track/",
            "content": "Lesley Chikudo\n\nMambo hit-maker, Asaph is set to release a new track, Living the Life on May 9, a song that will likely resonate deeply with todays fast-paced, material-driven world. The tracks core message: Live in the moment and embrace the journey rather than chasing after possessions.\n\nIn a candid podcast conversation with media personality DJ Ollah 7 at a Zimbabwe International Trade Fair (ZITF) Media Indaba, hosted by the Ministry of Information and Broadcasting Services in Bulawayo last Thursday, the hip-hop artiste shared the inspiration behind the song.\n\nThis track is about celebrating life, the little things that make us who we are. In a world that often pushes us to chase after possessions, I wanted to remind people to cherish the here and now, he said, hinting that the song will connect with audiences on both a personal and cultural level.\n\nLiving the Life, Asaph said, is not just another hip-hop track; it is a fusion of vibrant hip-hop and traditional African rhythms.\n\nThe song is a personal reflection for the musician.\n\nI want this song to remind people that life is about appreciating the now, the little moments that make us who we are.\n\nAsaphs musical journey has been ordinary. Transitioning to hip-hop from gospel was a pivotal turning point in his career but it was not without challenges. Initially, his decision to pursue hip-hop was met with scepticism from his family. Their concerns stemmed from the positive nature of his music  an approach that was a stark contrast to the sometimes gritty and rebellious tone of mainstream rap.\n\nHowever, as Asaphs music began to gain traction and make an impact, his familys apprehensions turned to support.\n\nMy parents were my backbone. They saw how my music was not just entertaining, but how it was fostering change in peoples lives. They became my biggest supporters.\n\nHis inspiration draws heavily from the intersection of faith and hip-hop, a fusion that resonates deeply within his artistry. He credits pioneering artistes who seamlessly integrated spirituality and rap, using their platform to uplift and inspire.\n\nThe multi-award-winning artistes hit song Mambo, which talks about self-empowerment, has become a motivational anthem for Zimbabwes youth, urging them to embrace their identity and chase their dreams. The songs message is clear: its about self-love, perseverance, and believing in ones own power.\n\nThe cultural significance of Asaphs music goes beyond entertainmentit is about representing Zimbabwe and amplifying the voices of the people.\n\nI believe its essential for artistes like me to represent where we come from. Zimbabwe has so much to offer, and I want the world to see that.\n\nHis goal is to put Bulawayo on the map, elevating the citys cultural presence on both a national and international scale.\n\nAsaph said he is not just a participant in the growing wave of hip-hop in Zimbabwehe is a leader. With the genre becoming more popular by the day, he urged his fellow artistes to take bold steps in representing their cultural narratives and embracing their authenticity.\n\nWe have so much to offer, and we need to show the world that Zimbabwean hip-hop is here to stay, he said.\n\nEmpowerment is at the heart of Asaphs music. His tracks encourage listeners to take control of their lives, believe in their potential, and embrace their cultural identity with pride. Drawing inspiration from old-school hip-hop, which stressed authenticity and community, Asaph is determined to create a sense of unity and empowerment through his lyrics.\n\nMusic is about the community. I want to create that connection, a shared experience through my music, just like the artistes who came before me.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Asaph-Africa-on-a-live-podcast-at-the-National-Art-Gallery-of-Zimbabwe-in-Bulawayo-last-Thursday.jpg",
            "description": "Lesley Chikudo Mambo hit-maker, Asaph is set to release a new track, Living the Life on May 9, a song that will likely resonate deeply with today’s fast-paced, material-driven world. The track’s core message: “Live in the moment and embrace the journey rather than chasing after possessions”. In a candid podcast conversation with media personality […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Zimbabwe names 40-man squad for Zambezi series",
            "url": "https://www.chronicle.co.zw/zimbabwe-names-40-man-squad-for-zambezi-series/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWE senior mens national rugby team head coach, Pieter Benade has named a strong 40-man squad that will take on regional rivals, Zambia and Botswana in the Zambezi Series set for May.\n\nLocal-based players were entrusted with carrying the torch for the national team in the series.\n\nThe campaign kicks off on May 4 with the Sables facing Zambia at Harare Sports Club before the hosts go on to face Botswana, six days later, also in the capital. This series marks the start of the Sables international season.\n\nWe took a short break from November last year after the international window and we were back at work in January. You can tell just from the commitment and work ethic that the boys want this more than ever.\n\nOur locally based players have been working together and some great combinations have formed, we are pretty excited about playing against Zambia and Botswana. The Battle of the Zambezi wont have a dull moment  this is our showcase to local fans, and we thrive off their support, said team manager Takunda Chifokoyo.\n\nThe series also comes at a crucial time for Zimbabwe Rugby as the Sables look to defend their Rugby Africa Cup title in Uganda in July. This years edition of the continental showdown serves as the direct qualifier for the 2027 Rugby World Cup, with only one team from the tournament set to directly book their ticket to Australia.\n\nAmong the new leaders in the squad is Dion Khumalo, the energetic midfielder who has been named one of the vice captains. Khumalos rise from the 2023 Under-20 setup to the senior teams leadership group underlines the value of Zimbabwes development programme.\n\nAs preparations ramp up, all eyes will be on the Sables as they look to build momentum, showcase depth, and ignite fan support across Zimbabwe.\n\nAdding star power to the Harare fixture, multi-award-winning artists Bryan K and Gemma Griffiths will lead the national anthem in a special duet performance.\n\nFor the Africa Cup, Zimbabwe were placed in Group A and will start their campaign at the quarter-final stage against Morocco while other group members Kenya and Uganda square off in the other match. The winners of these two matches will meet in the first semi-final.\n\nGroup B is made up of Namibia, Senegal, Ivory Coast and Algeria. Namibia will face Senegal while Algeria will lock horns against Ivory Coast.\n\nZimbabwe Squad for Zambezi Series\n\nFront Row:Jeff Makoni, Zvikomborero Chimoto, Deanne Makoni, Wade Petzer, Brain Makamure, Bornwell Gwinji, Bryan Chang, Vuyiswa Mpofu, Tanaka Mpofu.\n\nSecond Row: David Makamba, Nyasha Shiripinda, Takunda Kundishora, Tadiwa Parirenyatwa, Hagler Muchenje.\n\nBack Row:Tadiwa Gwashu, Vuyani Dhlomo, Brian Nyaude, Aiden Burnett (vc), Tonderai Chiwambutsa, Quinton Jones, Admire Shonhiwa, Lucky Sithole.\n\nHalf Backs:Hilton Mudariki (c), Tyrone Gombe, Nigel Tinarwo, Lenience Tambwera, Tino Chifumbu, Wayne Kunaka, Boyd Rouse.\n\nMidfield: Tapiwa Malenga, Brandon Mudzekenyedzi, Tamuka Pamire, Dion Khumalo (vc), Shingi Katsvere, Munopa Muneta, Kudzai Mashawi (vc),.\n\nOutside Backs:Darrel Makwasha, Munesu Muneta, Trevor Gurwe, Gamu Nekati, Munyaradzi Ngandu, Puwavi Chinoda, Tadius Dzandiwandira, Ryan Mushumi, Campbell Nyakudya, Benoni Nekairo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Local-based-Sables-players.jpg",
            "description": "Zimpapers Sports Hub ZIMBABWE senior men’s national rugby team head coach, Pieter Benade has named a strong 40-man squad that will take on regional rivals, Zambia and Botswana in the Zambezi Series set for May. Local-based players were entrusted with carrying the torch for the national team in the series. The campaign kicks off on […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Businesses wary over impact of US dollar on competitiveness",
            "url": "https://www.chronicle.co.zw/businesses-wary-over-impact-of-us-dollar-on-competitiveness/",
            "content": "Zimpapers Business Hub\n\nBusiness lobby groups and economists have expressed concern over the widespread dominance of the US dollar, saying it is significantly impairing the overall competitiveness of the economy.\n\nThis comes after the Confederation of Zimbabwe Industries (CZI) 2024 Manufacturing Survey Report highlighted high cost of production as the main factor hindering competitiveness, a situation that could significantly limit Zimbabwes benefits under the African Continental Free Trade Area (AfCTA).\n\nHowever, some analysts argue that while the US dollar dominance presents challenges by increasing local production costs and lowering competitiveness, policies supporting de-dollarisation, particularly the tight monetary stance, will help increase the acceptance and circulation of the domestic currency, thereby enhancing competitiveness.\n\nStill, some maintain that Zimbabwes competitiveness against regional peers like Zambia, South Africa, and Malawi is fundamentally linked to the dominance of the US dollar, which is driving up local business costs.\n\nThey argue that Zimbabwes economy, burdened by structural issues like power shortages, raw material scarcity, and reliance on imported inputs, is inherently disadvantaged by using an overly strong international reserve currency like the US dollar. They emphasise the need for Zimbabwean firms to implement internal devaluation strategies, such as cost reduction and containment.\n\nHowever, this presents a significant challenge, considering difficulties due to low-capacity utilisation.\n\nIn my view, the worst enemy for the economy in terms of competitiveness, one of the major drivers (of costs) is the existence of the US dollar in the economy because the US dollar is not a soft currency, its a hard currency, said economist Patience Sandra Makunike. We need our (domestic) currency, but we need to be productive to defend it. We need to build confidence, we need production.\n\nThe decline in Zimbabwes current account surplus, from US$1 billion during the 2018-2020 period when the soft local currency (RTGS) was the major transacting currency, compared to the current US$100 million surplus, strongly suggests a significant erosion of the nations competitiveness edge. The dramatic 10-fold reduction coincides with the widespread adoption and dominance of the US dollar within the economy.\n\nThe Reserve Bank of Zimbabwe (RBZ) first reintroduced the local currency in February 2019, after a 10-year hiatus, initially called the Real Time Gross Settlement (RTGS) dollar, which later became the Zimbabwean dollar.\n\nIn June 2019, the Government briefly outlawed the use of foreign currencies, making the RTGS dollar the sole legal tender. However, the move coincided with a sharp depreciation of the local unit, leading to a resurgence in the widespread use of hard currencies like the US dollar in informal transactions.\n\nDue to the struggling local currency and the economic pressures exacerbated by the onset of the Covid-19 pandemic, the RBZ reintroduced the multi-currency system in March 2020. This officially allowed the use of foreign currencies, primarily the US dollar, alongside the Zimbabwean dollar.\n\nIn October 2023, the Government officially extended the multi-currency system until December 31, 2030, through Statutory Instrument (SI) 218 of 2023. The decision superseded a previous plan that anticipated the eventual phasing out of foreign currencies by 2025.\n\nWith Zimbabwe already in the process of transitioning to a domestic monocurrency system by 2030, analysts suggest local businesses should adopt internal devaluation to mitigate the impact of US dollar usage.\n\nThe hard currency nature of the US dollar, while offering stability in some aspects (including inflation), appears to have amplified production costs, hindering their ability to compete effectively in regional and international markets.\n\nConsequently, the countrys capacity to generate foreign currency through exports is diminishing, directly impacting its overall current account balance and highlighting a growing challenge to its economic competitiveness in a dollarised environment, economist Carlos Tadya said.\n\nEconomist and RBZ monetary policy committee member Mr Persistence Gwanyanya said in an interview that the Reserve Bank of Zimbabwe (RBZ)s tight monetary policy will incentivise individuals and entities, particularly banks holding US dollars, to unwind their US dollar positions in favour of holding ZiG.\n\nHe explained that these institutions will be compelled by market forces to liquidate their US dollar holdings to acquire ZiG and expand their lending activities, which will, in turn, increase the circulation of the local currency.\n\nMr Gwanyanya said the dominance of the US dollar was primarily due to its role as a store of value and the tendency among economic agents to prefer it over the ZiG.\n\nThe dominance really reflects its value preservation, leading people to favour holding the US dollar. However, the tight monetary policy stance will cause the unwinding of these positions, said Mr Gwanyanya.\n\nImagine a bank with significant US dollar holdings. It becomes very difficult for them to expand credit (in local currency), and they are forced to liquidate some of their US dollar holdings for ZiG to improve their lending capacity. This will consequently lead to more ZiG in circulation.\n\nZimbabwe National Chamber of Commerce (ZNCC) chief executive Mr Takunda Mugaga acknowledged that while the use of US dollars was eroding competitiveness, he argued defending the local currency was most critical for sustainable competitiveness.\n\nWe need to establish robust institutional frameworks that clearly delineate the responsibilities of the central bank, ensuring it focuses on managing money supply in a manner consistent with economic growth.\n\nThis will be crucial in fostering a stable currency that transactional agencies can have confidence in, said Mr Mugaga.\n\nThe CZI highlighted several factors beyond the use of the US dollar that negatively impact competitiveness and hinder the countrys ability to compete within the African Continental Free Trade Area.\n\nThe key impediments include obsolete technology, lack of funding, high taxes and compliance costs, and electricity supply challenges.\n\nThe competitiveness summit hosted by the National Competitiveness Commission (NCC) in February this year produced recommendations outlining a comprehensive strategy encompassing regulatory streamlining, tax burden reduction, and strategic support for key industries to improve competitiveness.\n\nOne of the key recommendations was the adoption and institutionalisation of Regulatory Impact Assessments (RIA) in policy and regulation formulation. This measure is deemed essential for improving the quality of regulations and enhancing competitiveness by providing crucial cost-benefit analyses.\n\nThe summit, which was officiated by President Mnangagwa, noted the overregulated business operating environment, with compliance costs accounting for about 17,8 percent of total overhead costs.\n\nAll ministries should ensure that business does not suffer from prohibitive regulations as well as punitive administrative licences and fees, President Mnangagwa said in February.\n\nIn his address at the First Meeting of the 2025 Cabinet Year on February 11, the President said that instead of being restrictive, fees, licences, permits and regulations should promote economic development.\n\nAs such, streamlining regulations and implementing RIA are vital steps toward fostering a more conducive business environment, ultimately attracting investment and stimulating economic expansion.\n\nFurther emphasising the need for regulatory reform, the summit participants called for a comprehensive study to assess the burden, appropriateness, and cost of existing regulations on businesses.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/07/us-dollars.jpg",
            "description": "Zimpapers Business Hub Business lobby groups and economists have expressed concern over the widespread dominance of the US dollar, saying it is significantly impairing the overall competitiveness of the economy. This comes after the Confederation of Zimbabwe Industries (CZI) 2024 Manufacturing Survey Report highlighted high cost of production as the main factor hindering competitiveness, a […]",
            "time": "06:38",
            "date": "28 Apr 2025"
        }
    ]
}