{
    "news": [
        {
            "title": "President opens door to vendors",
            "url": "https://www.chronicle.co.zw/president-opens-door-to-vendors/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nGOVERNMENTs doors are always open to vendors and those in the informal sector as they play a vital role in the countrys economic development, President Mnangagwa has said.\n\nDemonstrating his open door policy, President Mnangagwa yesterday met with representatives of vendors at State House in Harare, where issues afflicting the sector were discussed. The President said the Second Republics attempt to formalise the informal sector should not be perceived as a threat but rather as an initiative to bring order and sanity to the sector. As we are all aware, the informal sector plays a crucial role in Zimbabwes economy, providing livelihoods for millions of citizens. However, there have been some worrisome trends affecting the sector, which if left unchecked will have dire ripple effects on our country and overshadow the important role of this critical sector, he said.\n\nAn attempt by Government to formalise your sector, and create decent work spaces should never be seen by vendors and the informal sector as a direct threat to your survival. As a Government, our doors are always open and we are always ready to hear your concerns.\n\nThe President also called upon vendors and those in the informal sector to complement Government efforts to bring order and sanity to the crucial sector.\n\nI trust that you are also ready to hear our concerns. I hope that this meeting will give insights to Government officials as we address grievances and explore policy solutions for both the formalisation and modernisation of this sector, as well as its integration into the mainstream economy.\n\nBy engaging with vendors and informal traders, the Government hopes to address their challenges and create a more conducive business environment, he said. Under my leadership, our national development mantra is Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nRepresentatives of vendors at State House in Harare, where issues afflicting the sector were discussed.\n\nThus, the President added, all sectors of the economy had the obligation to contribute positively rather than negatively to the countrys current development trajectory.\n\nWe all have a responsibility to build, modernise and industrialise our country, not only for us but for future generations. This duty lies with all of us, together as a united and patriotic people with one shared vision for Zimbabwe, he said.\n\nPresident Mnangagwa called for free and frank dialogue between Government and informal sector players towards the realisation of national goals.\n\nIt is in this spirit that I urge us to feel free and have frank and honest discussions. I hope that we will also come up with solutions that will move our country forward to prosperity and greater unity.\n\nLet our dialogue, therefore, be guided by the true spirit of nation-building and in the national interest.President Mnangagwa said it was important that Government develops a framework for structured vendor regulation that balances urban order and the need for vendors to earn a living.\n\nBe assured that my Administration is committed to facilitate the establishment of convenient and accessible decent work spaces for vendors.\n\nEqually, we recognise the need to avail micro-finance and training as well as to ensure that licencing and permits for vendors and the informal sector are streamlined, in line with our ease of doing business reforms.\n\nIt is important that you undertake your trade in an orderly manner, respecting those that operate around you and the broader environment and community where you operate, he said.\n\nPresident Mnangagwa said the maintenance of order was non-negotiable and, in this regard, the Ministry of Local Government and Public Works was directed to work with Local Councils and the private sector to build market stalls and decent work spaces for vendors as a matter of urgency.\n\nHe added that the facilities must include the requisite water and sanitation infrastructure.We must have order and as responsible citizens; we should never gloss over this matter. We must be honest that we cannot let the state of our country degenerate right under our eyes, President Mnangagwa said.\n\nHe also rallied vendors to be alert and vigilant and never allow the abuse of their sector by criminal elements and drug king-pins.\n\nWe must take ownership and be upright citizens as a sector for the good of our motherland, Zimbabwe, President Mnangagwa said.\n\nSpeaking after the meeting, Local Government and Public Works Minister Dr Daniel Garwe said the President had warned against night vending.\n\nThe Minister added that Government was concerned that Municipal Police were harassing vendors.There are better ways to deal with them, he said.\n\nWomens Affairs, Community, Small and Medium Enterprises Development Minister Monica Mutsvangwa weighed in saying vendors had expressed their commitment to orderly conduct.\n\nThey have been asked to come and talk to the President about the situation on the ground. These vendors are committed to making sure that they meet the cost of bringing up their families. We are seeing everyone becoming very actively involved, she said.\n\nSecretary for all tuckshop associations Mr Lovemore Mudzoki said the informal sector and vendors were willing to play ball for broader national development.\n\nWe are committed to working together with Government and we are saying no to demonstrations because they affect our work. Let us work and solve whatever issues amicably, he said.\n\nThe meeting sought to foster a collaborative relationship between Government and the informal sector, which is a significant contributor to Zimbabwes economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-3-4-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau GOVERNMENT’s doors are always open to vendors and those in the informal sector as they play a vital role in the country’s economic development, President Mnangagwa has said. Demonstrating his “open door policy”, President Mnangagwa yesterday met with representatives of vendors at State House in Harare, where issues afflicting the sector […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "President opens door to vendors… reads riot act to malcontents in the party",
            "url": "https://www.chronicle.co.zw/president-opens-door-to-vendors-reads-riot-act-to-malcontents-in-the-party/",
            "content": "Zvamaida Murwira and Joseph Madzimure,Harare Bureau\n\nPRESIDENT Mnangagwa has issued a stern warning to rogue party members seeking to disrupt the peace, unity, and harmony within Zanu-PF, declaring that those who fail to adhere to the party line will face dire consequences.\n\nSpeaking during the 382nd Ordinary Session of the Politburo at the partys headquarters in Harare yesterday, the President  who also serves as Zanu-PFs First Secretary  said the revolutionary party would rigorously enforce its constitution to maintain discipline.\n\nZanu-PF is a colossal revolutionary party, we have a job to do and a Vision to deliver for the good of the people of our great motherland, Zimbabwe. I applaud all my fellow citizens from across the country, for their clarity, national consciousness and patriotism that continue to squash efforts by malcontents and rogue delusional elements bent on disturbing our peace, unity and harmony, he said.\n\nOur motherland, Zimbabwe, will forever be a constitutional democratic and sovereign nation, with all of us living in unity, peace and harmony. Vanoukura, vanoramba vachiukura, nyika ichienda mberi. (Those who bark will continue doing so while the country moves forward).\n\nPresident Mnangagwa said Zanu PF is an unstoppable train while the party constitution is sacred and those who do not toe the correct line will fall by the wayside.\n\nZanu PF chitima chirikufamba. MuZanu PF tinotevera gwara remusangano, nguva dzose, mangwanani, masikati nemanheru. (We follow the party line all the time, whether in the morning, afternoon or evening.) Our Party Constitution is sacred, it is like roots and the trunk of a tree, and we the members are its branches.\n\nAs with any other revolution, those who do not toe the correct line of the revolution must fall by the wayside, he said.\n\nPresident Mnangagwa said all party members must be responsive to the needs of the people and ensure that their concerns are addressed.\n\nZanu PF must be first responders to the challenges facing our people and communities. I challenge all party members to walk alongside our people and always seek to respond to their needs. In seamless co-ordination, structures of our party, right from the Cell level, District, Province up to the Central Committee and Politburo, must provide honest leadership and guidance, with refocus on matters that affect the livelihoods of our people, he said.\n\nPresident Mnangagwa added that party members must be preoccupied with ensuring that all efforts are directed at developing the country.\n\nAll our energies, hands and minds must be fixated on modernising and growing our party membership base. Undertaking projects and initiatives that improve household incomes and the quality of life of our people must be the main focus of our party and the nation as a whole, he said.\n\nPresident Mnangagwa said the Zanu PF Government was facing challenges head-on and seizing opportunities in the unstoppable march towards the realisation of a shared national Vision and goals.\n\nMore importantly, in the ongoing economic revolution, the peoples needs and aspirations are at the core of our priorities. In the agriculture sector, transformational programmes are underway to guarantee national food security and sovereignty. A clear framework is now in place to facilitate the issuance of title deeds towards guaranteeing security of tenure and access to financing for the sector, he said.\n\nMeanwhile, I call upon stakeholders in the agriculture sector to ramp up preparations for the upcoming 2025 Winter Wheat Season.\n\nWith the rainy season coming to an end, Government is set to resume its infrastructural projects.Infrastructure projects are set to resume in earnest with the impending end of the rainy season. The housing stock in our country is increasing at a phenomenal pace, with remarkable improvement and modernisation, especially in rural areas and growth points. Tourist arrivals are reaching unprecedented levels, while mining sector projects are coming on stream, and having an overall positive impact on our countrys GDP, said President Mnangagwa.\n\nHe briefed the Politburo that he met yesterday with representatives of small and medium enterprises and vendors in the quest to build consensus and explore policy solutions for formalising and modernising the sector.\n\nThese indicators are evidence that we are a country on the rise and Vision 2030 is attainable. In the sports and recreation sector, our party, Zanu PF, takes pride in the election of the Honourable Minister of Sports, Recreation, Arts and Culture, Kirsty Coventry, as the first female and 10th president of the International Olympics Committee. Indeed, this is a historic and phenomenal feat. Congratulations, Makorokoto Zimbabwe, President Mnangagwa said.\n\nKirsty Coventry\n\nHe commended the party, Youth League, and partners for the unity of purpose and strong collaboration that enabled the successful launch of the Presidential Youth Empowerment Facility.\n\nThe significant participation of industry stakeholders in this strategic initiative re-ignites the Party-State and private sector partnerships. Well done to the Youth League, well done to you all. Support for innovative and private enterprises as well as long-term multi-sectoral empowerment pathways, which benefit the youth and women, are being implemented at an accelerated pace.\n\nUnder my leadership, Zanu PF is prioritising the dignity of hard honest work, production and productivity, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/eegq.jpg",
            "description": "Zvamaida Murwira and Joseph Madzimure, Harare Bureau PRESIDENT Mnangagwa has issued a stern warning to rogue party members seeking to disrupt the peace, unity, and harmony within Zanu-PF, declaring that those who fail to adhere to the party line will face dire consequences. Speaking during the 382nd Ordinary Session of the Politburo at the party’s headquarters […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "Anju Farm’s successful farming, rehabilitation story",
            "url": "https://www.chronicle.co.zw/anju-farms-successful-farming-rehabilitation-story/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE Zimbabwe Prisons and Correctional Service (ZPCS)-run Anju Farm in Nyamandlovu, Matabeleland North Province stands as a shining example of successful commercial farming and rehabilitation.\n\nThis initiative not only aims to achieve self-sufficiency through cash crop production but also equips inmates with vital life skills for reintegration into society upon release.\n\nThe farm, home to over 140 inmates serving sentences of 36 months or less, operates year-round on expansive arable land. It produces maize, winter wheat, sugar beans, cabbages and butternuts. Powered by a centre pivot irrigation system during dry seasons and supported by five electric boreholes feeding a 4-million-litre reservoir, the farm ensures continuous agricultural activity.\n\nZimbabwe Prisons and Correctional Service (ZPCS)-run Anju Farm in Nyamandlovu\n\nIn 2016, ZPCS partnered with the Agricultural and Rural Development Authority (Arda) through a Memorandum of Understanding (MoU) to enhance farming activities across correctional facilities nationwide. ZPCS Commissioner General Moses Chihobvu and Arda board chairman Mr Ivan Craig yesterday toured Anju Farm to get an appreciation of the farming activities.\n\nComm-Gen Chihobvu expressed satisfaction with the farms focus on horticulture and cash crops, which contribute to self-sustainability by generating income to meet prison needs. He said plans are underway to expand farming operations by adding 40 hectares of irrigated land.\n\nI would like to applaud the decision by management at Anju Farm to venture more into horticulture and cash crops. This will drive the prison into self-sustainability because the money earned from the sale of farm produce will be used to cater for the needs of the prison, he said.\n\nThe MoU that we signed with Arda some years ago means that ZPCS can leverage the labour that we have in the form of prisoners as part of the rehabilitation and reintegration process to venture into commercial farming with Arda supporting us with technical skills and expertise.\n\nComm-Gen Chihobvu stressed the importance of replicating Anju Farms model across all prisons to ensure nationwide self-sufficiency. He cited instances where Anju Farm supplied food to other correctional facilities during droughts and contributed surplus produce to local markets in Bulawayo.\n\nLast year, Anju Farm Prison supplied food to Chikurubi Maximum Prison in Harare due to the drought that hit the country and affected several prisons food production capabilities, he said.\n\nZimbabwe Prisons and Correctional Service (ZPCS)-run Anju Farm in Nyamandlovu\n\nAnju Farm currently has 35 hectares under maize and five hectares under sugar beans. Principal Correctional Officer Engineer James Musutu, the provincial farm manager, said drilling additional boreholes would significantly enhance irrigation capacity.\n\nHe said the maize crop was not affected due to rainwater that was abundant in the last few months, but Anju Farm needs more boreholes to feed water into the main reservoir and ultimately supply the centre pivot in the drier seasons.\n\nThe reservoir, which is our main source of water for the 35 hectares under centre pivot irrigation, has a carrying capacity of 4 million litres of water. The capacity of the centre pivot pump is 120 cubic metres per hour from the water reservoir that is supplied by five boreholes, said Eng Musutu.\n\nDuring the dry season, when we dont depend on rain water it takes about two and a half days for the all the boreholes to fill the water reservoir, which is why we are asking for more boreholes to be drilled to solve water challenges here at Anju Farm.\n\nBeyond crop production, Anju Farm boasts projects in goat breeding, cattle rearing, poultry farming, and fisheries. These ventures further diversify income streams while providing inmates with practical skills applicable after their release.\n\nMr Craig praised the partnerships success, saying inmates are at the heart of these initiatives. He said the skills they acquire will empower them upon reintegration into society,\n\nI have to appreciate the work that I saw here at Anju Farm starting from the fisheries project, the horticulture that includes growing of seedlings to the butternut and the sugar beans. The magnitude of the projects is not what people would generally expect from a prison-run farm, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ege.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@chronicle.co.zw THE Zimbabwe Prisons and Correctional Service (ZPCS)-run Anju Farm in Nyamandlovu, Matabeleland North Province stands as a shining example of successful commercial farming and rehabilitation. This initiative not only aims to achieve self-sufficiency through cash crop production but also equips inmates with vital life skills for reintegration into society upon release. The […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "Matrine ‘Spax’ Mleya: A dance, acting sensation",
            "url": "https://www.chronicle.co.zw/matrine-spax-mleya-a-dance-acting-sensation/",
            "content": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub\n\nMatrine Mleya, widely known as Spax, is a woman of many talents  an actress, dancer, and choreographer whose career spans nearly three decades in the creative industry.\n\nZimpapers Arts and Entertainment Hub caught up with the Bulawayo-based artiste resident in Nkulumane suburb, who reflected on her extensive journey in the arts sector.\n\nBEHIND THE SCENES: (Top) Matrine Spax Mleya and Nonhlanhla Ngubeni who plays Matshidiso on South African soap Isitha The Enemy and Spax with Kere Nyawo\n\nSpaxs love for the arts began in 1997 while in Grade 4 at Mgombane Primary School, where she joined the schools dance and drama club before branching into modelling and drum majorettes.\n\nWith my mother as my inspiration, I nurtured my talent throughout my school years, she said.After primary school, I joined a local Nkulumane dance group led by Robert from the Skull Crackers Musical group. Later, between 2003 and 2004, I was part of Inyathi High Schools dance and drama club.\n\nHer professional journey took off in 2009 when she joined Victory Siyanqoba, an arts organisation, where she featured in several thought-provoking theatre productions written and directed by Desire Moyo.\n\nBetween 2011 and 2014, I was with Simunye Simunye Arts, under the direction of Future Dube and later Tichaona Karuma. This gave me the opportunity to work alongside legends like the late Dr Simon Mahlaba Banda, Ndolwane Super Sounds, and Jeys Marabini, she said.\n\nAfter gaining vast experience, Spax turned to mentoring young dancers.I began choreographing traditional dances for Jikinya competitions at schools such as Mgombane, Sigombe, Morray Primary, and Mncumbatha Secondary School. I also worked with King George and Sir Humphrey Gibbs schools. Mgombane Primary Schools dance group, which I choreographed, performed at the 2024 Independence celebrations at White City Stadium in Bulawayo, she said.\n\nShe then co-founded Izenzo Performing Arts, working with NGOs, including PSI Zimbabwe, on male circumcision awareness campaigns.\n\nAt one point, Spax took a four-year break from the industry due to challenges she described as beyond my control as a woman in the arts sector. However, she made a strong comeback in 2022, venturing into film.I was cast as the lead actress, Bathabile, in a short film by Aldridge Nqabayomuzi Gumede, a Cape Town Film and TV student, she said.\n\nShe has since choreographed contemporary dances for the Association of the Deaf (Assod) and featured in The Other Cecil, a theatre production by Sunduza Dance Theatre. Her acting credits include Izeneze (ZBC production) where she played Zexs wife, Izitha (Ekasi Home of Light production) where she played Thereziya, Mr Wrong (film by Nonduduzo Ncube) where she played NaThamu, Umthunzi Womendo (ZBC production) where she played Madawu, and Ijazi (film by Sipho Kamanga).\n\nSpaxs talent has caught the attention of South African filmmakers, opening doors to exciting new opportunities. She recently secured a role as a background artiste in South African production Isitha: The Enemy.\n\nI was cast in The Heir, a Native Arts Media theatre production, where I played Soshangane, a Ndebele Chief, and Chulu, a Shona warrior, she said.\n\nI also secured a background artiste role in Isitha: The Enemy, a South African Black Brain Pictures production, and appeared on SABC 3s Ready Steady Cook as a studio audience artiste.\n\nLooking to the future, Spax is determined to leave a lasting legacy. She recently founded Inganani Arts and is working on The Message, a theatre production by Stanis Theatre. She is also involved in another new project with Native Arts Media.\n\nWith an impressive rsum and a passion for storytelling, Spax continues to push boundaries in dance, theatre, and film, proving that dedication and resilience can take Zimbabwean talent to international heights.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/FD-F.jpg",
            "description": "Mthabisi Tshuma, Zimpapers Arts and Entertainment Hub Matrine Mleya, widely known as Spax, is a woman of many talents — an actress, dancer, and choreographer whose career spans nearly three decades in the creative industry. Zimpapers Arts and Entertainment Hub caught up with the Bulawayo-based artiste resident in Nkulumane suburb, who reflected on her extensive […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "AfCFTA to boost Zimbabwe trade by 59 percent",
            "url": "https://www.chronicle.co.zw/afcfta-to-boost-zimbabwe-trade-by-59-percent/",
            "content": "Nqobile Bhebhe, Senior Business Reporter\n\nZIMBABWE is expected to see a 59 percent rise in industrial exports to African markets under the African Continental Free Trade Area (AfCFTA), highlighting the potential for economic growth through regional integration, a report from the United Nations Economic Commission for Africa (ECA) reveals.\n\nAfCFTA would improve access to markets on the continent, fostering growth in key sectors such as manufacturing, agriculture and services.\n\nZimbabwes participation in the AfCFTA is also expected to accelerate industrialisation by enabling increased value-addition to raw materials and commodities.\n\nIt is projected that the industrial sector will dominate the intra-African trade gains, with Zimbabwe positioned to benefit from increased exports in wood and paper products, chemicals, rubber, plastic, pharmaceuticals, metals, manufactured goods, vehicles, and transport equipment.\n\nThe AfCFTA is viewed as a transformative initiative poised to reshape economic dynamics across the continent.\n\nFor Zimbabwe, the agreement presents significant opportunities to enhance trade, industrialisation and economic diversification.\n\nBy reducing tariffs and non-tariff trade barriers, AfCFTA is expected to substantially boost intra-African trade, particularly benefiting Zimbabwes industrial and agrifood sectors.\n\nAccording to estimates by the United Nations Economic Commission for Africa (ECA), overall intra-African trade (exports) is projected to increase by approximately 45 percent (or US$275,7 billion) by 2045.\n\nIt is not surprising that the most impressive expected macro-economic benefits from the implementation of the AfCFTA agreement, considering just tariff and non-tariff barrier reductions within the continent, would be for intra-African trade.\n\nECA estimates that, in relative terms, overall intra-African trade (exports) would increase by about 45 percent (or US$275,7 billion) in 2045, while intra-African trade is expected to increase by 60 percent (or US$58,6 billion) for agrifood, 48 percent for industry (or US$165,6 billion), and 34 percent for services (or US$4,9 billion), from a baseline situation without the agreement, reads part of the report.\n\nThe Economic Report on Africa 2025 (ERA 2025) examines AfCFTAs implementation, highlighting achievements, challenges and its potential to reshape Africas economic landscape.\n\nThe expected increase in intra-African trade for energy and mining, while significant at an estimated 28 percent (or US$46,6 billion), would be notably lower than in other major sectors, the report added.The report further identifies sub-sectors with the greatest potential to drive intra-African trade expansion following AfCFTA implementation.\n\nThese include industries encompassing wood and paper products, chemicals, rubber, plastic, pharmaceuticals, vehicles and transport equipment, metals and other manufactured goods.Agrifood grains and crops, milk and dairy products, sugar, rice, meat, and other processed foods are also included.\n\nTourism and transport is covered under the services sector, while energy and mining is also considered.However, the report noted that the expected benefits of refined oil must be analysed with caution due to environmental concerns associated with CO2 emissions from fossil fuels.\n\nSimilarly, the expanded intra-African trade in mining products should be carefully examined to promote value-addition.\n\nThe industrial sectors dominance in intra-African trade gains is evident across most African countries, with industrial product exports showing notable growth.\n\nIn fact, even in the few countries where industry would not account for the largest share of the benefits, gains would still be sizable in relative terms (as a percentage) as exports of industrial products to their African partners would increase from Cameroon by 141 percent, Ethiopia by 104 percent, Mozambique by 32 percent, Namibia by 66 percent, or Zimbabwe by 59 percent.\n\nEconomist Ms Alice Chironzi noted that Zimbabwe stands to gain significantly from AfCFTA through increased trade, industrial expansion, and economic diversification.\n\nThe projected rise in exports, particularly in industry and agrifood, highlights the countrys potential to become a competitive regional player.\n\nTo fully capitalise on AfCFTA, Zimbabwe must prioritise infrastructural development, investment in value-added industries and policies that enhance competitiveness.\n\nWith strategic planning, AfCFTA can serve as a catalyst for Zimbabwes economic transformation and sustainable growth.\n\nAfCFTA will be the worlds largest new free trade area since the establishment of the World Trade Organisation (WTO) in 1994.\n\nZimbabwe is among the pioneer countries that embraced AfCFTA, recognising its vast market potential estimated at trillions of US dollars and a population exceeding 1,3 billion.\n\nTo maximise its benefits from the AfCFTA), Zimbabwe needs to focus on strengthening its trade facilitation, investing in infrastructure, promoting the beneficiation of its resources, and building capacity, particularly for women and youth-led businesses.\n\nBy focusing on beneficiation, Zimbabwe can increase export earnings, reduce dependence on commodity price fluctuations, and create employment opportunities for its citizens.Industrialisation enhances competitiveness, allowing locally produced goods to compete with imports within the AfCFTA market.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/08/Untitled-35-3.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter ZIMBABWE is expected to see a 59 percent rise in industrial exports to African markets under the African Continental Free Trade Area (AfCFTA), highlighting the potential for economic growth through regional integration, a report from the United Nations Economic Commission for Africa (ECA) reveals. AfCFTA would improve access to markets […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "COMMENT: Courts must impose stiff penalties on drug offenders",
            "url": "https://www.chronicle.co.zw/comment-courts-must-impose-stiff-penalties-on-drug-offenders/",
            "content": "Hardly a day passes with no news of a significant drug bust or court appearance on drug-related matters since police launched a blitz against narcotics trade and consumption in September last year.\n\nMid-last month, Bulawayo police arrested dozens, including three school children, following a raid in the city centre and some Western suburbs. On March 6, they nabbed a suspected drug peddler, Pigors Tyron Siegfried, after they found him with two kilogrammes of crystal meth worth $7 000.\n\nA few days earlier, Zimbabwe Revenue Authority (Zimra) officials had intercepted a consignment of mbanje worth $32 000.\n\nTwo weeks ago, Bulawayo police arrested a 30-year-old and seized some mbanje and cough syrups. On Monday, two Bulawayo women appeared in court for alleged illegal possession of narcotic medicine.\n\nBetween early September last year and the end of January this year, police arrested 9 527 people and crushed 79 drug dens nationwide. Of the arrested, 8 911 were users while 616 were supplies.\n\nThe total number of arrests made from September and now has obviously grown higher than the 9 527 who had been accounted for over the five months to January.\n\nWe commend police, Zimra, other law enforcement agencies as well as the general public for the work that they are doing to clean the country of drugs.\n\nThe substances are dangerous to the health of users. They cause serious mental and physical illnesses. They can destroy families and marriages and can lead to jail and loss of life.\n\nDrugs are a danger to national development actually. If the number of users continues to grow, we can end up with a huge fraction of the population being always drunk or high.\n\nAnyone who is in that state cannot be useful to the smooth functioning of society, to any development.We are sure that drug dealers are fearful of arrest now given the strength with which authorities are clamping down on their illicit activities.\n\nSome might have dropped the trade altogether for something more useful.With the supply lines frozen, we think some users are sobering up now.\n\nEarlier on, we detailed only the arrests of drug peddlers and users and the appearance of some of them in court. That is worth celebrating but we await the decisions by the courts on most of the cases.As we eagerly await the conclusions of the court cases, we encourage the courts to mete out stiff punishment on the suppliers and users of the drugs.\n\nIf they are locked away for five years or longer, that will make the country cleaner of narcotics. That, too, will ensure that those who take the drugs get the rehabilitation, treatment and care they need to break free from this life-threatening infamy.\n\nAuthorities must maintain the campaign against drug trade and consumption. In fact, the campaign must be intensified and made permanent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/courthammer-680x380.jpg",
            "description": "Hardly a day passes with no news of a significant drug bust or court appearance on drug-related matters since police launched a blitz against narcotics trade and consumption in September last year. Mid-last month, Bulawayo police arrested dozens, including three school children, following a raid in the city centre and some Western suburbs. On March […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "‘Warriors future bright’",
            "url": "https://www.chronicle.co.zw/warriors-future-bright/",
            "content": "Fungai Muderere,[emailprotected]\n\nWITH Zimbabwes World Cup Qualifier campaign all but over, fans reflect on who stays, who goes and what the future holds for the Warriors.\n\nReacting to the Warriors 2-2 draw against Benin and 1-1 stalemate against Nigeria, the local football fraternity was left with a huge sense of belief, saying the senior national team German coach Michael Nees, is really in the kitchen, preparing a team that has all the potential to conquer all and sundry. It is the manner in which the Warriors fought back in Nigeria with Tawanda Chirewa coming to the rescue, to score Zimbabwes equaliser at a packed and heaving, Godswill Akpabio Stadium.\n\nIt was a goal that came right at the death of the match to cancel Victor Osimhens goal, much to the amusement of Zimbabweans and football neutrals from other countries.\n\nMy confidence has grown in the last year, every camp, I believe more and more, even though they changed (players) often in the past, but you see in the last camps, its now the same players.\n\nIt means the coach has found his team. I am confident in the team, weve seen them playing in the last three or four games against good opponents, good games, so theres quality and potential in this group, said\n\nCathrine Mkhwananzi, a soccer enthusiast.That was a really good show by the boys. They played as a unit and defended well. They showed some tactical discipline.\n\nThis is a squad that must be kept together and help them prepare for the pending Afcon finals, said Tavengwa Zidya, a local lawmaker and football fan.\n\nPopular local football follower MaCloud Moyo, said he was really impressed by how the Warriors performed.It was a great performance from our Warriors, at a time some did not give them any chance to do well. The boys need to keep on believing in themselves.\n\nI was happy to see the short Emmanuel Jalai stand tall and absorb all the pressure that came on the right flank, said Moyo.\n\nThe South African football community is celebrating the Warriors bravery as it boosted their own Bafana Bafanas chances of winning the group and securing a ticket to the 2026 Fifa World Cup.\n\nSouth Africas Bafana Bafana are now overwhelming favourites to qualify for the 2026 World Cup qualifiers following a 2-0 victory over Benin in another Group C match that was played on Tuesday night.\n\nIt was no wonder that when Warriors substitute, Tawanda Chirewa, got the equaliser for the Warriors against the Super Eagles, South Africans took to social media to salute the Warriors for stealing a point from their opponents and keep Bafana Bafana on track.\n\nMeanwhile, Warriors veteran goal minder Washington Arubis breathtaking performance between the sticks played a pivotal role in the Warriors ability to survive Nigerias early onslaught, making him one of the standout players in the match and earning his place in the prestigious squad for the upcoming World Cup qualifiers.\n\nThe Africa Soccer Zone 2026 Fifa World Cup Qualifiers Matchday 6 squad is filled with big names from across the continent, including Abubeker Nasir, Amereck Abameyaung, Mohamed Amoura, Jordan Ayew, Bryan Mbeumo, Elio Capradossi, Chancel Mbemba and Ali Abdi.  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Warriors-head-coach-Michael-Nees.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw WITH Zimbabwe’s World Cup Qualifier campaign all but over, fans reflect on who stays, who goes and what the future holds for the Warriors. Reacting to the Warriors’ 2-2 draw against Benin and 1-1 stalemate against Nigeria, the local football fraternity was left with a huge sense of belief, saying the senior […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "Big Brother Mzansi’s success… What Zimbabwe can learn from South African’s social media integration",
            "url": "https://www.chronicle.co.zw/big-brother-mzansis-success-what-zimbabwe-can-learn-from-south-africans-social-media-integration/",
            "content": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub\n\nAs the curtains closed on Big Brother Mzansi season 5 on Sunday, local media expert and arts commentator, Raisedon Baya sounded the alarm on the state of entertainment content creation in Zimbabwe.\n\nBayas observations highlighted the disconnect between mainstream media and social media, urging local producers to revamp their programming and engagement strategies.\n\nIn his analysis, Baya noted that reality shows like Big Brother offer valuable insights into human behaviour, making them a fascinating study for writers and content creators.\n\nThe curtain has closed on Big Brother Mzansi season 5, dubbed Umlilo, and what a wild ride its been. Congratulations to Sweet Guluva umfana kamaOledi! Some have asked me whats entertaining about watching ordinary people sleep, eat, play, and gossip 24/7. They think it must be mind-numbingly boring. But theyre wrong.\n\nFor me, reality shows like Big Brother offer a fascinating study of human behaviour under specific conditions. Throw people into a confined space, add rules and conditions, and watch the drama unfold. Big Brother Umlilo season was full of surprises, and I was hooked from the first week, wrote Baya.\n\nHe mentioned that, as a writer, he appreciates the value of reality shows in helping him develop characters.Observing human behaviour in different situations is invaluable for crafting authentic, relatable characters. Sweet Guluva staying away from alcohol and still having wild, crazy moments, Uyanda not really becoming wise after taking in the wise waters, and housemates reaction to one of them being a rape victim were all great material for the study of human behaviour.\n\nBut what really caught my attention was the intersection between mainstream media (Mzansi Magic) and social media. Its astonishing how seamlessly social media can complement mainstream media, even influencing viewership.\n\nFor producers, social media provides a unique opportunity to gauge audience engagement and feedback  if theyre not talking about your content, then theyre not watching it. The feedback loop is crucial for refining content and increasing its appeal.\n\nThe power of social media was on full display during the voting process. Fans campaigned fiercely on various platforms for their favourite housemates, using every trick in the book to save or propel them to the big money prize. The passion and dedication were palpable.\n\nRaisedon Baya\n\nHe lamented the lack of excitement and engagement surrounding local mainstream media content on social media platforms.\n\nThis experience got me thinking about our own situation, especially how local mainstream media interacts with social media. Unfortunately, its clear that this relationship is not being fully exploited. There is still a lot to be done, especially by mainstream media, he said.\n\nBayas comments come at a time when Zimbabwes entertainment industry is struggling to produce content that resonates with local audiences. With the rise of social media, the traditional broadcasting model is being challenged, and local producers must adapt to stay relevant. To revitalise the industry, Baya suggests that mainstream media must prioritise programming that captivates audiences and encourages social media engagement.\n\nThis can be achieved by investing in high-quality content, promoting audience interaction, and leveraging social media platforms to gauge feedback and refine programming.\n\nReflecting on her upbringing, the Rap Gandaganda hit-maker recalled a childhood shaped by limited access to local media, stating, Growing up eNkayi we did not have access to ZBC; my father bought a satellite dish in 2002. From then on, I consumed South African content daily, while local shows like Studio 263 and Amakorokoza were merely whispers from my cousins.\n\nThe same satellite televisions and streaming platforms are the ones producing shows like the acclaimed Big Brother Mzansi that kept viewers glued to their phones and television sets for over two months.By embracing the intersection of mainstream media and social media, producers can create a more engaging and interactive viewing experience that puts Zimbabwean entertainment back on the map.\n\nZimbabwe, through the Broadcasting Authority of Zimbabwe (BAZ) has launched a number of television and radio stations to diversify content to be consumed by masses, a step in the right direction if the entertainment landscape is to go toe-to-toe with regional, if not international entertainment channels.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/UD.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub As the curtains closed on Big Brother Mzansi season 5 on Sunday, local media expert and arts commentator, Raisedon Baya sounded the alarm on the state of entertainment content creation in Zimbabwe. Baya’s observations highlighted the disconnect between mainstream media and social media, urging local producers to revamp […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "Gobakhulu classroom blocks commissioned",
            "url": "https://www.chronicle.co.zw/gobakhulu-classroom-blocks-commissioned/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nA REMOTE community in Jotsholo, Matabeleland North Province, has taken a significant step towards improving access to education, thanks to the commissioning of two classroom blocks and a teachers cottage at Gobakhulu Primary School.\n\nThe development, funded by Japans Grant Assistance for Grassroots Human Security Projects (GGP) programme to the tune of US$72 000, is set to ease the burden of long-distance travel for learners.\n\nFor years, children in Ward 8 endured treacherous 10km walks to the nearest Government school, a journey that was particularly difficult during the rainy season. Now, with the new infrastructure, learners like Grade Six pupil Sisasenkosi Nyoni can finally focus on their studies without the fear of long and exhausting trips.\n\nWe were excited when construction of the two blocks started. Before then, I used to walk long distances to the nearest school, but now, I live within a stones throw of the school. I can now concentrate on my lessons instead of worrying about the distance, said Sisasenkosi.\n\nSpeaking at the commissioning ceremony yesterday, Local Government and Public Works Minister Daniel Garwe, in a speech read on his behalf by Deputy Minister Albert Mavhunga, said that deliberate investment in school infrastructure was key to fostering quality education.\n\nWe believe that good education is the key to a bright future. These new classroom blocks will help our children learn better and achieve their goals, while the cottage will provide decent accommodation for teachers, he said.\n\nGobakhulu Primary School classroom blocks\n\nMinister Garwe affirmed the Government is committed to ensuring every child, regardless of background, has access to quality education. He also paid tribute to teachers, calling them the backbone of the education system.Teachers are the backbone of our schools, and we greatly appreciate their efforts and determination. Let us continue to support our schools and build a better future for our children, he said.\n\nThe commissioning ceremony was attended by the Japanese Ambassador to Zimbabwe, His Excellency Mr Shinichi Yamanaka, who reaffirmed Japans commitment to supporting Zimbabwes education sector.\n\nLet me take this opportunity to highlight that the support for this project is part of Japans broader approach to Zimbabwe, focusing on providing quality school infrastructure and promoting the positive nurturing of young people in schools, as our government believes education is key to the future development of this country, he said.\n\nAmbassador Yamanaka revealed that since 1989, one-third of Japans grassroots development projects in Zimbabwe have been in the education sector.\n\nSpeaking during the same event, Regent Chief Zanele Khumalo made an impassioned plea for the provision of piped water at the school to ease the burden on teachers and learners.I am so grateful to all the parties that contributed to this project, particularly the Embassy of Japan and Hand to Hand Zimbabwe.\n\nHowever, I appeal to Honourable Deputy Minister Mavhunga to assist in the provision of piped water to the school.\n\nThere is no water here and the little learners, as well as our teachers, are having difficulty in that regard, she said.\n\nThe new classroom blocks and cottage are expected to not only improve learning conditions but also attract and retain dedicated teachers, ensuring a brighter future for the children of Jotsholo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-25-at-20.09.11-18.jpeg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw A REMOTE community in Jotsholo, Matabeleland North Province, has taken a significant step towards improving access to education, thanks to the commissioning of two classroom blocks and a teachers’ cottage at Gobakhulu Primary School. The development, funded by Japan’s Grant Assistance for Grassroots Human Security Projects (GGP) programme to the tune of […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        },
        {
            "title": "Magwizi hails Chahwanda stadium",
            "url": "https://www.chronicle.co.zw/magwizi-hails-chahwanda-stadium/",
            "content": "Tongai Mashonga\n\nZimbabwe Football Association (Zifa) president, Nqobile Magwizi, expressed his satisfaction with the rapid progress being made at Chahwanda Stadium- Heart Main Arena, which is currently under construction in Kwekwe.\n\nMagwizi toured the 15 000-seater facility yesterday in Kwekwe, where he was accompanied by Zifa, Projects and Infrastructure Committee, chairperson, Brighton Ushendibaba being led by Prophet Walter Magaya and Sherpherd Chahwanda, proprietor of the facility.\n\nDuring his tour of the facility, Magwizi was impressed by the sheer scale and quality of the work being done.I am thrilled to see immense progress taking place here at Chahwanda Stadium, Magwizi said.The stadium is going to be a game changer for Zimbabwean football and I am confident that it will host many international matches.\n\nI never imagined that there will be something like this in Kwekwe. I express my gratitude to Prophet Walter Magaya and his team for such an amazing job that has been done so far. When I passed through this place, on my way to my rural home a few months ago, there was nothing and today, seeing this infrastructure in place is really impressive.\n\nMagwizi said Zifa was keen on having adequate infrastructure for the game.At Zifa, we are looking at a situation where we have adequate infrastructure for football. Recently, the chairperson of the Projects and Infrastructure Committee, Brighton Ushendibaba who is with me here today, has been conducting a survey to come up with statistics on the number of football pitches we have in every province. The numbers coming out shows we have a bit of a challenge, but with such interventions, I think the future is very bright. We are indeed destined for greater achievements in future as a country, said Magwizi.\n\nMagwizi revealed that the completion of the facility will mark the return of international football at home as he will communicate with the Confederation of African Football (Caf) to arrange for preliminary assessment of the stadium.\n\nWe want to ensure that Chahwanda Stadium meets the international standards and we will communicate with Caf, to arrange for a preliminary assessment of the stadium. By engaging Caf at this early stage, we can ensure that the stadium is fully compliant with their requirements and we can avoid any potential issues of delay. When they come for final inspection of the stadium, they will just tick all the boxes. If the stadium is completed in the next few months to come, this will mark our return to playing international matches at home. I am hoping that in the few months to come, when the stadium is complete, we will have something big here.\n\nThis facility has an array of amenities, its a lifestyle centre with amenities ranging from entertainment, shopping, health facility, gym and a provision of administration offices for Zifa.\n\nWe have travelled to Spain, England and other countries going to see projects for football pitches and this facility matches the qualities you see elsewhere in the world. Unfortunately Zimbabweans, we have a tendency of undermining what we have but here we are seeing Zimbabwean excellency, Magwizi explained.\n\nThe founder of Prophetic Healing and Deliverance Ministries (PHD) Prophet Magaya, revealed that the initial completion date of the stadium has been moved from the earlier targeted end of March to May.\n\nWe have since revised the date of completing construction of the stadium from the earlier targeted date of end of March to May. This is due to the decision to increase the capacity of the stadium from the earlier targeted 10 000 seating capacity to 15 000, which is the minimum carrying capacity recommended by the Federation of International Football Association (Fifa) for hosting national teams international matches, said Magaya.\n\nMagaya also appealed for duty and rebates assistance when importing materials for construction at the stadium.\n\nWe bought all these material here on our own, no duty free, no tax rebates but we are trying by all means to add value in our countrys football development.\n\nWe are looking forward to a small assistance and your coming here as a football leader is a great inspiration, which motivates us to do more, said Magaya.\n\nChahwanda Stadium is expected to become a state of the art facility, capable of hosting high-profile international matches.\n\nAt the moment, the citys only Premier Soccer League club, Kwekwe United play their home matches in Gweru because Kwekwe has no homologated facility.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/XTHF.jpg",
            "description": "Tongai Mashonga Zimbabwe Football Association (Zifa) president, Nqobile Magwizi, expressed his satisfaction with the rapid progress being made at Chahwanda Stadium- Heart Main Arena, which is currently under construction in Kwekwe. Magwizi toured the 15  000-seater facility yesterday in Kwekwe, where he was accompanied by Zifa, Projects and Infrastructure Committee, chairperson, Brighton Ushendibaba being led […]",
            "time": "06:30",
            "date": "27 Mar 2025"
        }
    ]
}