{
    "news": [
        {
            "title": "Zimbabwe’s universities join forces to boost internet connectivity for research",
            "url": "https://www.chronicle.co.zw/zimbabwes-universities-join-forces-to-boost-internet-connectivity-for-research/",
            "content": "Sikhulekelani Moyo\n\n[emailprotected]\n\nINSTITUTIONS of higher learning in the country have partnered with Internet Society Foundation to tackle internet bottlenecks for research and development.\n\nSolusi University, hosted the inaugural Low Earth Orbiting Technologies workshop this week.\n\nThis saw Zimbabwe research network- ZIMREN, National University of Science and Technology (NUST), Lupane State University (LSU), Gwanda State University (GSU), Chinhoyi University of Technology (CUT) and service providers come together to work on augmenting existing internet infrastructure with LEO Technologies@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-27-at-17.11.02_40909c19-680x380.jpg",
            "description": "Sikhulekelani Moyo sikhu.moyo@chronicle.co.zw INSTITUTIONS of higher learning in the country have partnered with Internet Society Foundation to tackle internet bottlenecks for research and development. Solusi University, hosted the inaugural Low Earth Orbiting Technologies workshop this week. This saw Zimbabwe research network- ZIMREN, National University of Science and Technology (NUST), Lupane State University (LSU), Gwanda State […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Matabeleland South police launch manhunt for 11 murder suspects",
            "url": "https://www.chronicle.co.zw/matabeleland-south-police-launch-manhunt-for-11-murder-suspects/",
            "content": "Sukulwenkosi Dube-Matutu\n\n[emailprotected]\n\nPOLICE in Matabeleland South Province have launched a manhunt for 11 suspects linked to two separate murder cases that occurred in Beitbridge and Matobo districts.\n\nIn the first incident, three men allegedly fatally assaulted a fellow patron during a drinking spree in Beitbridge. In the second case, eight men attacked and killed a co-worker in Matobo following a dispute over money earned from mining activities.\n\nMatabeleland South acting provincial police spokesperson, Assistant Inspector Stanford Mguni, confirmed the two incidents and appealed to the public for information that could lead to the suspects arrests.\n\nHe said the suspects, Prenny Mudau, Francis Ndou and Clive Mudau, are accused of killing Titus Ndou following an altercation.\n\nOn March 23, 2025, at around 10 AM, Francis Ndou and the deceased were drinking traditional beer at a homestead in their village when they got into an argument. Other patrons intervened, and Francis Ndou left the scene, said Asst Insp Mguni.\n\nHowever, at around 4 PM, the three suspects regrouped and confronted Titus Ndou.\n\nThey attacked him, and Prenny Mudau stabbed him once on the right side of the neck with an okapi knife, causing him to bleed profusely. The suspects then fled, said Asst Insp Mguni.\n\nThe victim staggered for a few metres before collapsing. Police were alerted and attended the scene. The suspects are still at large.\n\nIn the second case, Braveman Ndlovu (33) was allegedly killed by Nkosi and seven other unidentified men following a dispute over payment for their mining work.\n\nOn March 25, 2025, at around 3 PM, Ndlovu and the suspects argued over how to share money they had earned from working at a mine in Matobo. The suspects began assaulting him with stones but were restrained by bystanders, Asst Insp Mguni said.\n\nHowever, later that night, at around 9 PM, the group attacked Ndlovu again. Witnesses intervened, but the violence did not stop.\n\nThe following morning, around 4 AM, Ndlovu was found lifeless near a mine shaft, while the suspects had vanished, he said.\n\nAsst Insp Mguni expressed concern over the increasing number of murder cases in the province, saying there is a need for peaceful conflict resolution.\n\nIt is an issue of concern to record two murder cases within a space of just three days. We urge people to find non-violent ways of resolving disputes. Lives are being unnecessarily lost over issues that could be settled amicably, he said.\n\nAs police, we are calling on anyone with information that could lead to the arrest of the suspects to inform us or visit any nearest police station.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Sukulwenkosi Dube-Matutu sukulwenkosi.dube@chronicle.co.zw POLICE in Matabeleland South Province have launched a manhunt for 11 suspects linked to two separate murder cases that occurred in Beitbridge and Matobo districts. In the first incident, three men allegedly fatally assaulted a fellow patron during a drinking spree in Beitbridge. In the second case, eight men attacked and killed […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Kadoma teen convicted of unlawful entry, theft",
            "url": "https://www.chronicle.co.zw/kadoma-teen-convicted-of-unlawful-entry-theft/",
            "content": "Langelihle Nyathi, langae2001@gmail,com\n\nThe Kadoma Magistrates Court has convicted Rufaro Muchohonyi, an 18-year-old female, for unlawful entry and theft.The convicted teen was found guilty of unlawfully entering the residence of Anna Zhuwao on March 13, 2025, stealing $27 worth of personal belongings and cash.\n\nAccording to a statement by the National Prosecuting Authority of Zimbabwe (NPA), all stolen items were subsequently recovered.The court took into consideration Muchohonyis prior conviction for a similar offense and sentenced her to eight months in prison\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2015/05/court-hammer.jpg",
            "description": "Langelihle Nyathi, langae2001@gmail,com The Kadoma Magistrates’ Court has convicted Rufaro Muchohonyi, an 18-year-old female, for unlawful entry and theft. The convicted teen was found guilty of unlawfully entering the residence of Anna Zhuwao on March 13, 2025, stealing $27 worth of personal belongings and cash. According to a statement by the National Prosecuting Authority of […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Bulawayo socialite, girlfriend fined for forgery",
            "url": "https://www.chronicle.co.zw/bulawayo-socialite-girlfriend-fined-for-forgery/",
            "content": "Trish Mukwazo\n\n[emailprotected]\n\nBULAWAYO socialite Brendon Shoko, popularly known as Brizzy, his girlfriend and an accomplice have each been fined US$400 or face four months in prison for swindling a local woman of US$520, which was intended for her sons school fees, by forging bank deposit slips.\n\nThe trio was given until April 25 to pay back the money.\n\nThey were further sentenced to four months, which were wholly suspended for five years on condition that they do not commit a similar offence within that period.\n\nShoko (28), his girlfriend, Priscah Chipeta (38), and Knowledge Mhlanga (41) were convicted of two counts of forgery by Bulawayo magistrate Mr Maxwell Ncube.\n\nIn passing sentence, Mr Ncube took into consideration that the trio pleaded guilty and did not waste the courts time and the fact that they were first-time offenders.\n\nThe trio forged CBZ deposit slips to falsely claim that Ms Phethekile Madonkos sons school fees at Gloag High School had been paid. Instead of depositing the money, they converted it for personal use and created fake CBZ deposit slips to mislead Ms Madonko. The scheme was uncovered when the school contacted Ms Madonko about unpaid fees, prompting her to file a police report.\n\nThe prosecutor, Ms Mufaro Ndirayire, said the first incident occurred on 7 February, when Ms Madonko handed Chipeta US$350 to deposit into the schools account. Chipeta then approached Shoko, who enlisted Mhlanga to forge a deposit slip using a fake stamp and printed confirmation slip. A second incident followed on 20 February, involving US$210, which Chipeta again failed to deposit.\n\nChipeta then approached Shoko and asked for a forged CBZ deposit slip. Shoko then engaged the services of Mhlanga, who forged the slip by designing a fake stamp and printing a CBZ bank confirmation of cash deposit slip, said Ms Ndirayire.\n\nThey were represented by lawyer, Simon Mutandi of Sandi and Matshakaile Attorneys who pleaded for leniency, citing their status as first-time offenders and noting that they had compensated the complainant.\n\nChipeta faces additional charges of theft of trust property and fraud in connection with violating a trust agreement with Ms Madonko and misrepresenting the payment of school fees to Gloag High School. These charges stem from her role in producing fake deposit slips and deceiving both Ms Madonko and the school administration.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Brendon-Shoko-1.jpg",
            "description": "Trish Mukwazo trishmukwazo515@gmail.com BULAWAYO socialite Brendon Shoko, popularly known as “Brizzy,” his girlfriend and an accomplice have each been fined US$400 or face four months in prison for swindling a local woman of US$520, which was intended for her son’s school fees, by forging bank deposit slips. The trio was given until April 25 to […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Mutare man jailed for smuggling secondhand clothes",
            "url": "https://www.chronicle.co.zw/mutare-man-jailed-for-smuggling-secondhand-clothes/",
            "content": "Langelihle Nyathi, langae2001@gmail,comVitalis Katayi, a 28-year-old man from Mutare, Manicaland Province has been sentenced to an effective five months imprisonment for smuggling second-hand clothes bales.Katayi was convicted at the Mutare Magistrates Court after he failed to provide proper documentation for the smuggled second-hand clothes.\n\nHe was also found in contempt for violating Customs and Excise Act.In a statement, the National Prosecuting Authority of Zimbabwe revealed that Katayi was found in possession of five bales of undeclared second-hand clothes and shoes, which were seized by detectives from the Mutare CID department on 18 February 2025.\n\nHe was intercepted while driving a white Honda Fit from Mozambique.Katayi, who is said to have fled the scene, abandoning his vehicle and contraband was later apprehended and his goods seized by the Zimbabwe Revenue Authority (ZIMRA).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2013/06/court-hammer1.jpg",
            "description": "Langelihle Nyathi, langae2001@gmail,com Vitalis Katayi, a 28-year-old man from Mutare, Manicaland Province has been sentenced to an effective five months imprisonment for smuggling second-hand clothes bales. Katayi was convicted at the Mutare Magistrates’ Court after he failed to provide proper documentation for the smuggled second-hand clothes. He was also found in contempt for violating Customs […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Government cracks down on night vending, Mayors, Town Clerks ordered to enforce ban",
            "url": "https://www.chronicle.co.zw/government-cracks-down-on-night-vending-mayors-town-clerks-ordered-to-enforce-ban/",
            "content": "Sikhumbuzo Moyo\n\nMAYORS and Town Clerks have been ordered to ensure that there is no night vending in their local authorities with immediate effect.\n\nThe order was given by the Minister of Local Government and Public Works Daniel Garwe in his keynote address at the mayors and town clerks training on diplomatic protocol and etiquette that started at a Bulawayo hotel on Tuesday.\n\nOur constitution does not have provisions for any night vending and as Government, we have noted many ills that come with night vending which include drug and substance abuse, so forthwith make sure there is no night vending in your local authorities, said Minister Garwe.\n\nHe said local authorities have no sanitary provisions for night vending, which has resulted in the vendors using undesignated areas to relieve themselves, a vehicle for disease outbreaks.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-27-at-13.58.01_0e6fb736-680x380.jpg",
            "description": "Sikhumbuzo Moyo MAYORS and Town Clerks have been ordered to ensure that there is no night vending in their local authorities with immediate effect. The order was given by the Minister of Local Government and Public Works Daniel Garwe in his keynote address at the mayors and town clerks training on diplomatic protocol and etiquette […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Tavengwa Hara gets Cosafa post",
            "url": "https://www.chronicle.co.zw/tavengwa-hara-gets-cosafa-post/",
            "content": "Fungai Muderere\n\n[emailprotected]\n\nCHICKEN Inn FC secretary-general Tavengwa Hara has with immediate effect been appointed to the Council of Southern Africa Football Associations (Cosafa), Legal and Statutes Committee, Zimpapers Sports Hub can reveal.\n\nThe Legal and Statutes Committee plays a critical role in ensuring that Cosafas regulations align with international best practices while safeguarding the integrity and legal framework of Cosafa competitions and operations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/09/Chicken-Inn-secretary-Tawengwa-Hara-360x197.jpg",
            "description": "Fungai Muderere fungai.muderere@bmetro.co.zw CHICKEN Inn FC secretary-general Tavengwa Hara has with immediate effect been appointed to the Council of Southern Africa Football Associations (Cosafa), Legal and Statutes Committee, Zimpapers Sports Hub can reveal. The Legal and Statutes Committee plays a critical role in ensuring that Cosafa’s regulations align with international best practices while safeguarding the […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Caledonia Mining Delays Bilboes Feasibility Study to Explore Optimisation Opportunities",
            "url": "https://www.chronicle.co.zw/caledonia-mining-delays-bilboes-feasibility-study-to-explore-optimisation-opportunities/",
            "content": "Sikhulekelani Moyo\n\nCaledonia Mining Corporation Plc has said it is pleased to announce that with the support of DRA Projects (Pty) Ltd and other technical consultants, it has been making good progress on the feasibility study for the Bilboes project.\n\nWhile the feasibility study was initially targeted for completion in the first quarter of 2025, the company has decided to extend the timeline to fully explore several material optimisation opportunities that have the potential to enhance project economics and reduce upfront capital requirements.\n\nThe company said the feasibility study will supersede the Preliminary Economic Assessment released on June 3, 2024, which outlined attractive project economics and a mine plan capable of tripling Caledonias gold production and positioning the company as an intermediate gold producer.\n\nEncouragingly, ongoing work continues to confirm the projects attractive fundamentals. Against the backdrop of a strong gold price, Bilboes remains both compelling and financeable, said Caledonia in a statement.\n\nKey areas of optimisation currently under review include: engaging with the authorities to explore the potential sale of concentrate, which could significantly reduce upfront capital expenditures by deferring the capital expenditure on a BIOX processing circuit, at least in the first few years of production, and evaluating the potential relocation of the Tailings Storage Facility to a more efficient site, including on Caledonias Motapa property adjacent to Bilboes, where the topography could lead to lower initial construction costs.\n\nCaledonia also said is is incorporating near-term opportunities at Motapa into the Bilboes feasibility study, following strong exploration results in 2024 and the additional exploration and development work planned at Motapa this year.\n\nThe gold production giant also saod the exploration at Motapa, which is located directly adjacent to Bilboes, has been particularly promising, indicating the presence of new mineralised zones within a few hundred metres of the proposed Bilboes processing plant. Demonstrating significant resource additions at Motapa has the potential to materially improve the long-term economics of a combined Bilboes-Motapa project said Caledonia.\n\nIn addition, Caledonia continues to assess near-term revenue opportunities across its portfolio. In\n\nparticular, high-grade mineralisation recently identified at the Blanket Mine could make a meaningful contribution to the initial capital requirements for Bilboes, providing further flexibility around funding.\n\nThe board remains fully committed to maximising shareholder value: this means ensuring that Bilboes is optimised both technically and financially, while continuing discussions with funding partners and relevant authorities in Zimbabwe, they said.\n\nThe optimisation work is advancing well, and the company will provide a further update on the expected timing of the feasibility study in due course.\n\nCaledonia chief executive officer Mark Learmonth, said Bilboes has the potential to be truly transformative for Caledonia, and the work we are doing now is about making sure we get it right.\n\nWe are encouraged by the results to date and are taking a disciplined approach to optimisationboth to enhance returns and to ensure we can fund the project in the most\n\nefficient way possible, he said.\n\nWith strong exploration results at Motapa, promising developments at Blanket, and supportive market conditions, we remain confident in Bilboes ability to significantly reshape Caledonias growth profile.\n\n@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/caleced.jpg",
            "description": "Sikhulekelani Moyo Caledonia Mining Corporation Plc has said it is pleased to announce that with the support of DRA Projects (Pty) Ltd and other technical consultants, it has been making good progress on the feasibility study for the Bilboes project. While the feasibility study was initially targeted for completion in the first quarter of 2025, […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Nust Art Club challenges youth exodus narrative through art",
            "url": "https://www.chronicle.co.zw/nust-art-club-challenges-youth-exodus-narrative-through-art/",
            "content": "Musawenkosi Moyo\n\nThe National University of Science and Technology (NUST) Art Club is set to host the second edition of its annual art exhibition this Friday at the National Gallery of Zimbabwe in Bulawayo.\n\nSponsored by Nust, the event will run under the theme: Unravelling Zimbabwean Potential in Health, Innovation, Technology, Entertainment, and Lifestyle.\n\nMusa Musema, head of operations and events for the Art Club, said the theme aims to highlight the Zimbabwean story through the eyes of the youth.Theres a prevailing narrative that many young people are leaving the country, but we want to challenge that. Despite the challenges we face, were still the future of Zimbabwe, and we must take responsibility for shaping it, he said.\n\nHe said that the exhibition provides a platform for young artists to showcase their talents and inspire creativity among their peers.These events are vital because they bring people and communities together. They give artists a space to connect, learn from one another, and grow their artistic abilities, he added.Reflecting on the exhibitions growth, Musema noted that last years edition featured 15 artists, while this years event has attracted around 30 exhibitors.Our goal is to see this number grow even further in the coming years, he said.\n\nAttendees can expect a diverse showcase of visual artworks, a short film depicting youth life in Zimbabwe, and performances from emerging local artists.We encourage art enthusiasts and the community to come out and support young, budding talent, Musema urged.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-27-at-14.53.21-680x380.jpeg",
            "description": "Musawenkosi Moyo The National University of Science and Technology (NUST) Art Club is set to host the second edition of its annual art exhibition this Friday at the National Gallery of Zimbabwe in Bulawayo. Sponsored by Nust, the event will run under the theme: “Unravelling Zimbabwean Potential in Health, Innovation, Technology, Entertainment, and Lifestyle”. Musa […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        },
        {
            "title": "Grammy award-winning Kenny G headed to South Africa",
            "url": "https://www.chronicle.co.zw/grammy-award-winning-kenny-g-headed-to-south-africa/",
            "content": "Mbulelo Mpofu,Zimpapers Arts and Entertainment Hub\n\nGLOBAL sensation, saxophonist Kenny G is set to embark on a highly-anticipated South African tour this October. The smooth jazz icon will grace audiences with his signature melodies in cities across South Africa, providing an unforgettable experience for both long-time fans and newcomers to his music.\n\nThe South Africa tour in October will feature three major performances October 1, at Durban ICC, October 2 at Grand Arena, GrandWest, Cape Town as well as October 4 at SunBet Arena, Time Square, in Pretoria.\n\nKenny G, whose career has spanned more than four decades, is recognised as one of the best-selling instrumental artistes of all time. With over 75 million albums sold globally, his unique sound and timeless hits, such as Songbird and Forever in Love, have captured the hearts of millions. Now, South African fans will have the rare opportunity to experience his magic live on stage.\n\nThe upcoming South Africa tour will feature Kenny G performing a collection of his most beloved hits, as well as new material from his latest album. Audiences can expect an evening of breathtaking musicality, soulful improvisation, and signature smooth jazz that has made Kenny G a household name worldwide.Its been way too long since our last visit to South Africa. We had an incredible time performing for such a warm and passionate audience last time. We are really looking forward to finally coming back to share our music with all of you again. said Kenny G.\n\nTickets for the tour will go on sale from 28 March and fans are encouraged to purchase their tickets early, as demand is expected to be high. Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-27-at-14.30.13-666x380.jpeg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub GLOBAL sensation, saxophonist Kenny G is set to embark on a highly-anticipated South African tour this October. The smooth jazz icon will grace audiences with his signature melodies in cities across South Africa, providing an unforgettable experience for both long-time fans and newcomers to his music. The South Africa […]",
            "time": "18:33",
            "date": "27 Mar 2025"
        }
    ]
}