{
    "news": [
        {
            "title": "Another Zimbabwean explosives smuggler arrested at South Africa border",
            "url": "https://www.chronicle.co.zw/another-zimbabwean-explosives-smuggler-arrested-at-south-africa-border/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nSouth African border authorities have arrested another immigrant (48) for smuggling from Zimbabwe, a contraband of explosives worth at least R600, 000 through the Beitbridge Port of Entry (PoE) on Monday.\n\nThe nationality of the suspect is yet to be revealed.\n\nThe Beitbridge border post provides a link to South Africa by road to Malawi, Tanzania, Zambia, Mozambique, DRC, Angola, Botswana and Zimbabwe.\n\nIn a statement, the specialised police, the Hawks, said the man was stopped by the police while driving a horse and trailers truck that was travelling from Zimbabwe to South Africa at the PoE weigh bridge.\n\nThey asked a driver to open a trailer so that the search can be conducted. The driver informed the police that he did not have keys for the trailers. Police forcibly opened the trailer. The search was conducted and they found bags containing items suspected to be explosives, said the Hawks.\n\nPolice then summoned the Musina based Bomb Technicians, Hawks Serious Organised Crime Investigation and Local Criminal Record Central to the scene for assistance. Upon the arrival of the above-mentioned units, the truck was thoroughly searched.\n\nAs a result, the team found 16 reels of detonating fuse explosives and 2182 Superpower 90 blasting cartridge explosives. The suspect was arrested. He is expected to make his first court appearance in the Musina Magistrate soon.\n\nLast Thursday, the Hawks arrested a 55-year-old Zimbabwean truck driver with a contraband of drugs worth an estimated R7 million, which he was transporting through the same border.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-11-at-17.18.07.jpeg",
            "description": "Thupeyo Muleya, Beitbridge Bureau South African border authorities have arrested another immigrant (48) for smuggling from Zimbabwe, a contraband of explosives worth at least R600, 000 through the Beitbridge Port of Entry (PoE) on Monday. The nationality of the suspect is yet to be revealed. The Beitbridge border post provides a link to South Africa […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Victoria Falls gears up for Ramsar COP15 with stakeholder awareness meetings",
            "url": "https://www.chronicle.co.zw/victoria-falls-gears-up-for-ramsar-cop15-with-stakeholder-awareness-meetings/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE City of Victoria Falls is today hosting a series of awareness meetings with stakeholders in preparation for the upcoming Ramsar COP15, scheduled to take place from 23 to 31 July 2025.\n\nThe resort city recently received Wetland City Accreditation from the Conference of Contracting Parties (COP), further cementing its status as a key player in global wetland conservation efforts.\n\nThe Ramsar Convention, an international treaty adopted in 1971, promotes the conservation and sustainable use of wetlands. With over 170 contracting parties, the convention underscores the critical role of wetlands in supporting biodiversity, human livelihoods, and ecosystem sustainability.\n\nIn a public notice, Victoria Falls Town Clerk, Mr Ronnie Dube, announced a series of stakeholder engagement meetings.\n\nThe awareness meetings will ensure that all stakeholders are well-informed and engaged in preserving the citys natural heritage ahead of this prestigious event.\n\nThe City of Victoria Falls is pleased to announce that the City recently received Wetland City Accreditation from the Conference of Contracting Parties (COP). This comes as the City will host the Ramsar COP15 from 23 to 31 July 2025.\n\nIn that regard, the City has lined up awareness meetings with its stakeholders and therefore invites everyone, including residents, the business community, cooperating partners, groups, associations, and others, to all-stakeholders meetings to raise awareness about Wetland City Accreditation and the upcoming COP15.\n\nThe proposed agenda include overview of RAMSAR Convention, Wetland City Accreditation, importance of wetland conservation, Collaborative initiatives and stakeholder roles and benefits to the public.\n\nAs a UNESCO World Heritage Site and a Ramsar-listed wetland of international importance, Victoria Falls is an ideal location for COP15. Its selection highlights Zimbabwes commitment to balancing environmental conservation and sustainable tourism.\n\nVictoria Falls\n\nThe conference is expected to attract environmentalists, policymakers, scientists, and international delegates, all coming together to discuss wetland conservation strategies in the face of climate change and human impact.\n\nZimbabwes selection as the host country for COP15 signifies its growing role as a leader in wetland conservation.\n\nThe country is home to seven Ramsar-designated wetlands, including Victoria Falls, Driefontein Grasslands, and Lake Chivero, which are internationally recognised for their ecological significance.\n\nThese wetlands play a crucial role in biodiversity conservation, water purification, and climate change mitigation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/rsgr.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw THE City of Victoria Falls is today hosting a series of awareness meetings with stakeholders in preparation for the upcoming Ramsar COP15, scheduled to take place from 23 to 31 July 2025. The resort city recently received Wetland City Accreditation from the Conference of Contracting Parties (COP), further cementing its status as […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "“She Will Not Fail”: Upcoming event aims to uplift young women",
            "url": "https://www.chronicle.co.zw/she-will-not-fail-upcoming-event-aims-to-uplift-young-women/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nMARCH belongs to women and is known as the Womens History Month a time to celebrate feminine excellence and in tandem with that, a young Harare-based woman, Uratile Nare, is making waves in her community through her spiritual leadership and community development initiatives.\n\nBorn and raised in Bulawayo, Nare is the founder of, Rooted in Grace, a spirit-led Christian community that aims to empower young women to become spiritual leaders and change their communities.\n\nUratile is set to host the Bibles and Picnic event, slated for May 10 in Bulawayo, which will be a follow-up from the A table of Grace event in Harare on 12 April.\n\nUratile Nare (second from right) with other members of the Rooted in Grace Christian Community\n\nIn an interview with Chronicle Showbiz, Uratile narrated how eager she is to be a vehicle of civic change.\n\nIm a young lady with a big dream. Over the years, Ive always gone above and beyond to make an impact in my community.\n\nIm on an assignment to empower many women, and with Gods grace, and Im confident that Ill not fail in all I do, she said.\n\nNares latest initiative aims to bring together young women to fellowship, pray, and support one another.\n\nMany young people are trying to figure out life, some are confused, some are broken, and some need guidance. Hence the theme of this event is, She will not fail. So, were gathering with a purpose to make young women rise, she explained.\n\nAs Rooted in Grace celebrates its first anniversary, Uratile reflected on the challenges and triumphs she has faced.Oh, not many challenges, she said with a smile.\n\nVery few challenges actually. God has my back! We are growing, we are conquering.\n\nOne of the highlights of the past year was a successful pad drive, where the organisation donated over 500 sanitary pads to Chikurubi Maximum Prison.\n\nUratiles connection to Bulawayo is deep, and she is excited to take her events to the city.\n\nBulawayo is home. Bulawayo is where the heart is. Ill always come back to where it all started. My roots, she said.\n\nAs a spiritually-filled woman, Uratile believes that putting God first is key to success in all areas of life.\n\nAll I can say is, In life, put God first and you will flourish in all aspects. Your career, your marriage, your education, your children. If there is a God in-between everything, nothing will come to fail.\n\nHer message to fellow young women is one of empowerment and encouragement.\n\nI encourage every woman to serve the Lord in some kind of way. Love God first and everything in your life will be blessed.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hjabka.jpg",
            "description": "Mbulelo Mpofu,mbulelo.smpofu@gmail.com MARCH belongs to women and is known as the “Women’s History Month” a time to celebrate feminine excellence and in tandem with that, a young Harare-based woman, Uratile Nare, is making waves in her community through her spiritual leadership and community development initiatives. Born and raised in Bulawayo, Nare is the founder of, […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Counterfeit goods under the spotlight",
            "url": "https://www.chronicle.co.zw/counterfeit-goods-under-the-spotlight/",
            "content": "Senior Business Writer\n\nStrengthening customs regulations, policy frameworks, law enforcement and addressing the proliferation of counterfeit products will take center stage at an upcoming National Economic Consultative Forum (NECF) indaba in Harare on Wednesday.\n\nBringing together government ministers, industry leaders, and civil society representatives, the event will revolve around the theme: Combating Counterfeit Products in Zimbabwe and Fostering Economic Growth.\n\nThis forum follows the governments intensified countrywide crackdown on counterfeit and smuggled goods, resulting in the seizure of over US$2.4 million worth of illegal imports and substandard products.\n\nAs part of this initiative, the Zimbabwe Revenue Authority (ZIMRA) on Monday closed Unity Village Flea Market in Bulawayo, a significant trading hub known for selling various goods.\n\nThis bustling market, located in the city center, features numerous traders offering clothing, footwear, cell phones, accessories, and kitchenware, among other items.\n\nAccording to the draft programme, Minister of Industry and Commerce Nqobizitha Mangaliso Ndlovu is set to deliver the keynote address.\n\nSeveral Government ministers expected to participate, include Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi, Minister of Home Affairs and Cultural Heritage Kazembe Kazembe, and Minister Douglas Mombeshora, Health and Child Care.Women Affairs, Community, Small and Medium Enterprise Development Minister Monica Mutsvangwa and Local Government and Public Works Minister Daniel Garwe\n\nThe business sector will also be well-represented, with key industry leaders expected to attend, including Confederation of Zimbabwe Industries (CZI) President, Mr Mucha Mkanganwe ,Zimbabwe Revenue Authority (ZIMRA) Commissioner General, Ms Regina Chinamasa, Confederation of Zimbabwe Retailers President, Mr. Denford Mutashu, Delta Corporation CEO, Mr. Matlhogonolo Valela, new OK Zimbabwe CEO, Mr Willard Zireva and Small Enterprises Association of Zimbabwe CEO, Mr Farai Mutambanengwe.\n\nThe NECF indaba provides an opportunity for stakeholders to address the serious threats posed by counterfeit products to economic growth, consumer safety, and fair trade.\n\nThe event is anticipated to yield policy recommendations, enforcement strategies, and enhanced partnerships among government, the private sector, and civil society in combating counterfeits.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WTHNHNH.jpg",
            "description": "Senior Business Writer Strengthening customs regulations, policy frameworks, law enforcement and addressing the proliferation of counterfeit products will take center stage at an upcoming National Economic Consultative Forum (NECF) indaba in Harare on Wednesday. Bringing together government ministers, industry leaders, and civil society representatives, the event will revolve around the theme: “Combating Counterfeit Products in […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "21-year-old missing in Bulawayo",
            "url": "https://www.chronicle.co.zw/21-year-old-missing-in-bulawayo/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA search is underway for a 21-year-old man, Anodiwa Yope Marenguka, who has gone missing in the Nkulumane suburb of Bulawayo. Marenguka was last seen on 6 January 2025 when he went to bed, and the following day, he was nowhere to be found.\n\nAccording to a press statement from the Zimbabwe Republic Police (ZRP), Marenguka is approximately 1.61 metres tall, with a slim build and a light complexion. The police are appealing to the public for any information that could aid in locating him.\n\nAnyone with information is urged to contact ZRP Nkulumane at 0292481145 or visit their nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ano.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A search is underway for a 21-year-old man, Anodiwa Yope Marenguka, who has gone missing in the Nkulumane suburb of Bulawayo. Marenguka was last seen on 6 January 2025 when he went to bed, and the following day, he was nowhere to be found. According to a press statement from the Zimbabwe […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Prince Dube honoured in Tanzania",
            "url": "https://www.chronicle.co.zw/prince-dube-honoured-in-tanzania/",
            "content": "Online Reporter\n\nWARRIORS striker Prince Dube received his first major award at Young Africans SC after being named the clubs Player of the Month for February.\n\nDube netted 11 goals and became the top scorer in the Tanzanian Premier League during the month.\n\nThis is Dubes first major recognition since moving to Young Africans at the start of the season.\n\nThe Warriors International joined the Tanzanian giants after leaving Azam.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/o0990.jpg",
            "description": "Online Reporter WARRIORS striker Prince Dube received his first major award at Young Africans SC after being named the club’s Player of the Month for February. Dube netted 11 goals and became the top scorer in the Tanzanian Premier League during the month. This is Dube’s first major recognition since moving to Young Africans at […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Zifa wants to hire coaching and technical staff for junior teams",
            "url": "https://www.chronicle.co.zw/zifa-wants-to-hire-coaching-and-technical-staff-for-junior-teams/",
            "content": "Online Reporter\n\nZIFA on Tuesday announced that it is seeking to hire passionate, experienced, and dedicated individuals to fill key coaching and technical staff positions for the countrys youth football teams.\n\nThe association said it wants to hire both head and assistant coaches for Under 15, 17 and 20 ages groups.\n\nThe seeked coaches will take charge of both genders.\n\nGoalkeeping coaches, fitness and conditioning coaches, physiotherapists, team doctors, and analysts are also being sought.\n\nThose willing to assume the positions of head coaches should be holders of CAF A or CAF B coaching certificates while assistant coaches should have CAF B or CAF C coaching badges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/ZIFA-2.jpg",
            "description": "Online Reporter ZIFA on Tuesday announced that it is seeking to hire passionate, experienced, and dedicated individuals to fill key coaching and technical staff positions for the country’s youth football teams. The association said it wants to hire both head and assistant coaches for Under 15, 17 and 20 ages groups. The seeked coaches will […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Kuly Tangu celebrates women in new song",
            "url": "https://www.chronicle.co.zw/kuly-tangu-celebrates-women-in-new-song/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nAfro-centric artiste Kuly Tangu (born Sikulile Tangu) has released a new song, Type Yangu, celebrating love and devotion to women.\n\nNow based in Harare after previously living in Bulawayo, Kuly Tangu shared the inspiration behind the track.This song celebrates the women in my life, especially my wife. It expresses the respect and admiration I have for her. At the end of the day, I want people to appreciate and celebrate the good partners they have, he said.\n\nSome of the lyrics say, mind and body intertwined, your love is cosmic, to highlight the depth of love and sacrifice she makes for me.\n\nHe further explained the songs title: When I say, Iyi ndo type yangu (this is my type), Im affirming my commitment to my partner. She is the one I choose to spend my life with and would do anything for.\n\nType Yangu follows the release of Loud Summer, further enriching Kuly Tangus discography. The artiste has previously asserted himself as one of the best in the local music scene, a claim backed by his ambitious 52-track playlist album K.U.L.Y, released in 2020.Releasing romantic love songs has always been on Kuly Tangus agenda, and Type Yangu reinforces his commitment to themes of love and appreciation for women.  Follow on X: @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sdfwvg.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Afro-centric artiste Kuly Tangu (born Sikulile Tangu) has released a new song, Type Yangu, celebrating love and devotion to women. Now based in Harare after previously living in Bulawayo, Kuly Tangu shared the inspiration behind the track. “This song celebrates the women in my life, especially my wife. It expresses the respect […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Seven months missing: Bulawayo community searches for Jethro Ndebele",
            "url": "https://www.chronicle.co.zw/seven-months-missing-bulawayo-community-searches-for-jethro-ndebele/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nThe Bulawayo community is rallying together to help locate a missing person, Jethro Ndebele, who was last seen in August 2024.\n\nAccording to a press statement from the Zimbabwe Republic Police (ZRP), the 48-year-old Nkulumane resident was reported missing after he failed to return home from collecting a parcel at an unknown destination.\n\nNdebele is approximately 1.5 metres tall, with a medium build and a dark complexion. At the time of his disappearance, he was wearing black trousers and a white shirt.\n\nThe ZRP is investigating Jethros disappearance and is appealing to the public for any information that may lead to his safe return. Anyone with information is urged to contact ZRP Nkulumane on 0292481145 or visit their nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fagheth.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com The Bulawayo community is rallying together to help locate a missing person, Jethro Ndebele, who was last seen in August 2024. According to a press statement from the Zimbabwe Republic Police (ZRP), the 48-year-old Nkulumane resident was reported missing after he failed to return home from collecting a parcel at an unknown […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        },
        {
            "title": "Grave affair: waterlogging threatens Plumtree Cemetery",
            "url": "https://www.chronicle.co.zw/grave-affair-waterlogging-threatens-plumtree-cemetery/",
            "content": "Ronald Mpofu [emailprotected]\n\nPLUMTREES Megatroity Cemetery, also known as MaDubes Cemetery, is grappling with waterlogged grave pits, leading to soil erosion and instability. The flooding of graves in Plumtree has become a significant concern for the community, making it increasingly difficult for families to bury their loved ones with dignity.\n\nAs a temporary solution, some families have resorted to building brick walls inside the graves to prevent further soil erosion and water accumulation. Heavy downpours have affected the region, exacerbating the national flooding crisis.\n\nNeighbouring Bulilima District endured a similar predicament earlier this year, experiencing a series of destructive storms, dam breaches, and floods that caused water levels to rise to knee height.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Megatroity-Cemetery-Plumtree.jpg",
            "description": "Ronald Mpofu – itsronaldrox@gmail.com PLUMTREE’S Megatroity Cemetery, also known as MaDubes Cemetery, is grappling with waterlogged grave pits, leading to soil erosion and instability. The flooding of graves in Plumtree has become a significant concern for the community, making it increasingly difficult for families to bury their loved ones with dignity. As a temporary solution, […]",
            "time": "18:09",
            "date": "11 Mar 2025"
        }
    ]
}