{
    "news": [
        {
            "title": "Zimbabwe commits to people- centred development",
            "url": "https://www.chronicle.co.zw/zimbabwe-commits-to-people-centred-development/",
            "content": "Wallace Ruzvidzo in KAMPALA, Uganda\n\nZIMBABWE is committed to playing its role in ensuring sustainable and people-centred development across the world and Africa in particular, SADC Chairman President Mnangagwa has said.\n\nThe President, who arrived here yesterday, will join fellow Heads of State today at the 11th session of the Africa Regional Forum on Sustainable Development (ARFSD-11), which will be held under the theme: Driving job creation and economic growth through sustainable, inclusive, science-and evidence-based solutions for the 2030 Agenda and Agenda 2063.\n\nWriting on his official X handle soon after touching down at the Entebbe International Airport VVIP Pavillion, where he was welcomed by Ugandan Public Service Minister Wilson Mukasa and Zimbabwean Ambassador to Uganda Mrs Winpeg Moyo among other officials, President Mnangagwa reaffirmed Zimbabwes commitment to the attainment of the United Nations agenda 2030 and the African Unions agenda 2063.\n\nI have arrived in Entebbe, Uganda for the 11th Africa Regional Forum on Sustainable Development (ARFSD11).\n\nWe are committed to building a prosperous Africa through sustainable, people-centred development anchored in innovation and regional co-operation for Agenda 2030 and 2063, he said.\n\nPresident Mnangagwa is welcomed by Zimbabwe Ambassador to Uganda Winnie Moyo (left) and Ugandan Public Service Minister Wilson Muluri Mukasa. President Mnangagwa is in Uganda for the Eleventh Session of the African Regional Forum on Sustainable Development to be held at Speke Resort Convention Centre, Munyonyo.- Picture: Presidential Photographer Tawanda Mudimu\n\nAs the current SADC Chair, the President is set to deliver remarks during a Presidential Panel session alongside his counterparts  President William Ruto of Kenya (East Africa Community Chair), President Bola Tinubu of Nigeria (Chair of the Economic Community of West African States), President Teodoro Mbasogo of Equatorial Guinea (Chair of the Economic Community of Central African States), President Ismael Guelleh of Djibouti (Chair of the Intergovernmental Authority for Development), President Alassane Ouattara of Ivory Coast champion of the Second Ten-year implementation plan (STYIP) of Agenda 2063 and Philemon Yang of the UN General Assembly.\n\nThe ARFSD-11 is a timely opportunity to drive real change and to rescue the SDGs and Agenda 2063.Africa like the rest of the world, is off track in meeting most targets of the Sustainable Development Goals and has even regressed in some areas.\n\nAlongside the SDGs, Heads of State and Government of the African Union have adopted and called for effective implementation of the Second Ten-year implementation plan (STYIP) of Agenda 2063.In an interview in Harare yesterday, just before departure for Uganda, Minister of Foreign Affairs and International Trade Professor Amon Murwira said the President is expected to contribute to a panel that will discuss the financing of all socio-economic indicators.\n\nPresident Mnangagwa is attending the United Nations meeting, under the United Nations Economic Commission for Africa. He is going there as chair of SADC and he is going to contribute to a very important panel on socio-economic development indicators, as well as the financing of all these socio-economic indicators.\n\nThe high-level meeting brings together governments, officials, experts and stakeholders to discuss progress, challenges and opportunities in implementing sustainable development goals in Africa.Tomorrow, (today) he will join that panel of other regional economic communities, like the East African community, the Ecowas. He is going there as SADC chair. And he is going to make very important interventions, said Professor Murwira.\n\nAdditional reporting by Joseph Madzimure in Harare\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-6-1.jpg",
            "description": "Wallace Ruzvidzo in KAMPALA, Uganda ZIMBABWE is committed to playing its role in ensuring sustainable and people-centred development across the world and Africa in particular, SADC Chairman President Mnangagwa has said. The President, who arrived here yesterday, will join fellow Heads of State today at the 11th session of the Africa Regional Forum on Sustainable […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Mozambican President Chapo to officially open ZITF",
            "url": "https://www.chronicle.co.zw/mozambican-president-chapo-to-officially-open-zitf/",
            "content": "Peter Matika,[emailprotected]\n\nMOZAMBICAN President, Daniel Chapo, is expected to officially open the 65th edition of the Zimbabwe International Trade Fair (ZITF) later this month in Bulawayo.\n\nHis presence at the countrys premier annual international event will further strengthen the friendly bilateral and economic relations between the two neighbouring nations.\n\nThis years international trade expo will run from April 21 to 26, 2025, under the theme: Industrialisation: Crafting an Integrated Landscape.\n\nThe Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, announced President Chapos planned visit during his post-Cabinet media briefing in Harare yesterday.\n\nMinister Dr Jenfan Muswere\n\nHe also revealed that the Ministry of Industry and Commerce is engaging in strategic dialogue with national business associations and industry groups to maximise private sector participation and input in the prominent trade showcase.\n\nThe President of the Republic of Mozambique, His Excellency Daniel Chapo, will officially open the 65th Edition of ZITF on April 25, 2025, said Dr Muswere.\n\nIn preparation for the event, Air Zimbabwe and FastJet have been engaged to increase flight frequencies for exhibitors and visitors, ensuring a positive customer experience. As of April 7, 2025, 596 direct exhibitors had registered, compared to 428 at the same point in 2024. Of these, 98 are first-time exhibitors. Dr Muswere further stated that 95% of the exhibition space has already been booked, compared to 87% at the same time last year.\n\nThere has been a marked increase in international exhibitor participation, with 29 countries now registered. These include Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the European Union delegation, Egypt, Ethiopia, France, Germany, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, the Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the United Kingdom, the United States of America, the United Arab Emirates and Zambia, he added. India is also expected to participate this year.\n\nDr Muswere outlined some of the key events scheduled for the expo, including the International Business Conference, the Connect Africa Symposium, the CZI Original Equipment Manufacturers Indaba and the Rural Industrialisation Conference, which will be held for the first time.\n\nThis years event promises to be bigger and better than ever, reinforcing Zimbabwes economic transformation journey towards Vision 2030, supported by improved ease of doing business under the Second Republic.\n\nThe rise in foreign exhibitor participation is a strong endorsement of Zimbabwe as a prime destination for investment and trade, reflecting positively on the Second Republics engagement and re-engagement foreign policy.\n\nIn 2024, 13 countries participated in Zimbabwes premier annual trade exhibition. This year, the country aims to attract even more participants as preparations intensify.\n\nSince President Mnangagwa came to power in 2017, his administration has made economic diplomacy a key component of the Governments foreign policy.\n\nThe ZITF Company, which is responsible for organising the exhibition, also plays a key role in national branding efforts, promoting investment and driving economic growth.\n\nRecently, the ZITF Company launched a series of regional roadshows in Botswana, South Africa, and Zambia to mark the official countdown to the 65th edition of the annual exhibition in Bulawayo. These roadshows have provided tailored presentations and interactive networking sessions, highlighting the benefits of participating in ZITF events and exploring regional collaboration opportunities.\n\nMr Busisa Moyo\n\nZITF Company board chairman, Mr Busisa Moyo, stated that the exhibition will position Zimbabwe as a competitive hub for trade and investment. He also highlighted the enduring legacy of the ZITF Company and its role in shaping Zimbabwes industrial landscape over the decades.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-23.39.33.jpeg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw MOZAMBICAN President, Daniel Chapo, is expected to officially open the 65th edition of the Zimbabwe International Trade Fair (ZITF) later this month in Bulawayo. His presence at the country’s premier annual international event will further strengthen the friendly bilateral and economic relations between the two neighbouring nations. This year’s international trade expo […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Golden harvest for Marula’s tobacco pioneers",
            "url": "https://www.chronicle.co.zw/golden-harvest-for-marulas-tobacco-pioneers/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTOBACCO farmers in Marula, Mangwe District, have begun harvesting their crop, marking a significant shift from traditional subsistence farming to a promising commercial venture that is transforming livelihoods.\n\nIntroduced in 2023 at Syringavale Farm in Ward 11, the commercial tobacco farming initiative began with just 17 farmers. In its second season, the project has expanded to over 160 farmers across Marula, Figtree, Dawson, and parts of Bulilima District, demonstrating widespread acceptance of tobacco as a viable alternative in the drought-prone Matabeleland region.\n\nFor first-time grower Mrs Ellen Sibanda, the transition from maize farming to tobacco has been both challenging and hopeful.\n\nWe began harvesting about three weeks ago. Some leaves are already stored, others are drying on racks and the freshly picked ones are in the barn, turning from green to a golden colour, she said.\n\nMrs Sibanda, a widow managing over 8 000 plants on half a hectare, relies on weekly guidance from tobacco expert Mr Rodrick Musiiwa and his team. She hopes the harvest will help cover the college fees of her two grandchildren studying in Bulawayo.\n\nWe were provided with inputs such as seeds, fertiliser and chemicals. The cost will be deducted from our total harvest and the remainder is ours, she explained.\n\nYears of poor maize yields, due to erratic rainfall, have pushed many communal farmers into poverty, prompting a shift to high-value crops like tobacco. The golden leaf, traditionally associated with the Mashonaland provinces, is now gaining traction in Matabeleland South.\n\nTobacco farming requires a farmer to be hands-on daily, from planting the seasons seedlings and transplanting them to the field until the crop is ready for harvest. The experts meet with us every week to guide us through the next phase, said Mrs Sibanda.\n\nI have no idea how many kilograms I will harvest, but Ive been told the yields will be good, as Mangwe received good rains this year, she added.\n\nTobacco is primarily grown in the Mashonaland provinces, with only a few farmers involved in the Midlands Province. It is not widely cultivated in the Matabeleland region, which is traditionally focused on cattle ranching.\n\nMrs Molly Ndlovu from Figtree was inspired to take up tobacco farming after a field day last year, following a devastating drought that destroyed her maize crop.\n\nI planted nearly 15 000 tobacco plants on a hectare. The experts told us our sandy soils are ideal for the crop, so we seized the opportunity, she said.\n\nLast year, we lost everything due to the drought, but the first farmers who grew tobacco at Syringavale Farm managed to harvest the crop and earn money. I decided to try my hand at tobacco farming as well, she explained.\n\nWe were told that our area is suitable for tobacco farming, despite the sandy soil. Weve been growing maize for decades, but the yields have been decreasing year on year.\n\nTobacco farming specialist, Mr Rodrick Musiiwa, a former Tobacco Industry and Marketing Board (Timb) official, said the project has now spread to Mangwe and Bulilima districts as local villagers embrace the lucrative crop.\n\nFrom the initial 17 farmers who joined the tobacco farming project in 2023, we have expanded to over 160 farmers, and the number continues to rise as more villagers show interest in cultivating the crop, he said.\n\nWe have farmers from Syringavale, Greenfield and even as far as Dawson villages, deep in Mangwe District. Some farmers are from Figtree, while others are in Bulilima District.\n\nMr Musiiwa also highlighted that, unlike in other areas where tobacco farming leads to widespread deforestation, the community does not face such issues here.\n\nThe problem of cutting down trees to cure tobacco is a sensitive issue in many communities, but we wont encounter that challenge here.\n\nThe tobacco is sun-dried for about three weeks after harvesting, so theres no need for tree cutting to cure the crop, he explained.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-23.18.07-3.jpeg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw TOBACCO farmers in Marula, Mangwe District, have begun harvesting their crop, marking a significant shift from traditional subsistence farming to a promising commercial venture that is transforming livelihoods. Introduced in 2023 at Syringavale Farm in Ward 11, the commercial tobacco farming initiative began with just 17 farmers. In its second season, the […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "COMMENT: Dismissal not deterrent enough for exam leakages",
            "url": "https://www.chronicle.co.zw/comment-dismissal-not-deterrent-enough-for-exam-leakages/",
            "content": "Our public examinations system has faced a few challenges in recent years, especially through leakage of papers and unauthorised people seeking to, or actually writing, the tests on behalf of registered candidates.\n\nLeakages happened as a result of school heads or other gate keepers getting carried away to think they can make money out of it.\n\nFraud happened with educators involved or the registered candidate making an arrangement with an unauthorised person to write the public examination for them without the knowledge of school authorities.\n\nWhile in most cases, the culprits have been caught and punished, the breaches exacted considerable harm on the integrity of our examination system, even on the local education system more broadly, especially abroad.\n\nThe Government has moved in by drafting the Zimbabwe School Examinations Amendment Bill, 2024, which seeks to boost security measures around examinations and stem the infractions.\n\nWe report elsewhere today that the Bill proposes amendments to the Zimbabwe School Examinations Council (Zimsec) Act to effectively deal with exam paper leakages, irregularities in registration, and fraudulent conduct at various examination centres across the country.\n\nUnder the legislative programme, Cabinet considered and approved the Zimbabwe School Examinations Amendment Bill. The decision to amend the Zimbabwe School Examinations Council Act (Chapter 25:18) is intended to address challenges in the education sector, particularly exam leakages, registration anomalies, and fraudulent practices at certain examination centres nationwide,\n\nInformation, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere said yesterday.If approved, the law will also ensure Zimsec is fully equipped to prevent and deal with the malpractices, provide for de-registration of non-compliant examination centres and introduce tougher penalties on transgressors.\n\nMinister Dr Jenfan Muswere\n\nAuthorities have done well by initiating this process, which will ensure that the good reputation of our education system is maintained and further improved.\n\nIt will be a good idea if all the arms of Government involved in the law-making process, right to Parliament, fast-track this proposed piece of legislation so that it begins governing the examination system by the time this years September to November public examinations begin.\n\nIt will take a few months for the equipping of Zimsec to be done, but there will be no harm if the body and the Government itself begin the process now in anticipation of the enactment of the law.\n\nIn terms of the punishment that the law will provide for, we hope that it, indeed, would be deterrent. We have seen some school heads, teachers and other officials caught on the wrong side of the law being sacked for that.\n\nHowever, we think dismissal is not really tough enough given the seriousness of their offences.If the proposed law provides for a jail term for the culprits, in addition to obvious dismissal that would provide enough deterrence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/04/ZIMSEC.jpg",
            "description": "Our public examinations system has faced a few challenges in recent years, especially through leakage of papers and unauthorised people seeking to, or actually writing, the tests on behalf of registered candidates. Leakages happened as a result of school heads or other gate keepers getting carried away to think they can make money out of […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "NRZ reports zero financial returns from 25-year venture",
            "url": "https://www.chronicle.co.zw/nrz-reports-zero-financial-returns-from-25-year-venture/",
            "content": "Chronicle Writer\n\nTHE National Railways of Zimbabwe (NRZ, has yet to receive any financial benefit from its joint venture with Landela Safari Adventures, for the management of the Landela Complex in Victoria Falls.\n\nThis is despite the partnership having been in place since 1998, as revealed by the Parliamentary Public Accounts Committee.\n\nShockingly, no board meetings have been held since the inception of the agreement over two decades ago.\n\nThe committee, chaired by Kuwadzana East legislator Honourable Charlton Hwende, is currently conducting inspections of public assets across the country. On Saturday, the delegation, which included representatives from the Auditor Generals Office, the Ministry of Finance, Economic Development and Investment Promotion, NRZ and Landela Safari Adventures, visited several NRZ properties in Victoria Falls. These included Victoria Falls Station, Victoria Falls Hotel, an 8 000-square-metre plot and the Landela Complex.\n\nPublic Accounts Parliamentary Committee tours Landela Complex\n\nThis marks Parliaments second visit to Victoria Falls to assess NRZs properties. During a similar tour last year, the Parliamentary Portfolio Committee on Transport and Infrastructural Development learned that NRZ was losing out on substantial revenue  estimated to be in the tens of thousands of US dollars  due to its failure to manage its extensive real estate portfolio effectively.\n\nAt the time, NRZ management acknowledged the issue and stated that the parastatals real estate department was in the process of identifying and reclaiming control of its assets to boost revenue and address its financial difficulties.\n\nThe Landela Complex, which houses over 30 shops, including a bank, two restaurants, two microfinance institutions and an airline office, has been at the centre of a long-standing dispute between NRZ and Landela Safari Adventures.\n\nNRZ is now seeking to terminate the relationship, citing a loss of potential income and a lack of transparency.\n\nThe partnership was established in November 1998 under a rent-based lease agreement. Landela Safari Adventures was to lease three NRZ staff houses and, at its own expense, convert them into lodges. In return, NRZ would retain ownership of the land and take over the lodges after 25 years, without any compensation.\n\nHowever, instead of lodges, Landela developed a commercial complex  now known as the Landela Complex  on the site. This deviation from the initial agreement led to a dispute and the signing of a new agreement in October 1999, under a joint venture company named Victoria Falls Trading Post.\n\nSince then, disagreements over shareholding, financial disclosures and general management have persisted. NRZ maintains that the partnership has not generated any returns and that delays in resolving the dispute have disproportionately benefitted Landela.\n\nNRZ\n\nBriefing the Public Accounts Committee, NRZ chief finance officer Mr Patrick Mwashita, revealed that no board meetings had been held since 1998, due to ongoing disagreements.\n\nThree of the houses were constructed, but one remains outstanding. In terms of sharing information, trading accounts and audited accounts, this has not been done, he said.\n\nMr Mwashita stressed that NRZ has not financially benefitted from the agreement since its inception in 1999.\n\nOver the years, NRZ has been following up and, we have extensive correspondence between us and Landela, requesting financial statements and formal board meetings. Unfortunately, to date, there has not been a positive response from Landela, and we are now pursuing legal action, he said. Landela Safari Adventures, represented by its lawyer Mr Garikai Sithole, acknowledged the committees concerns and requested additional time to compile written submissions.\n\nThe Parliamentary Public Accounts Committee had questions, they wanted us to address and we provided responses. They require further information, which we have committed to providing by next Friday, to the best of our ability.\n\nFrom the outset, since 1998, this has always been a business relationship, and I believe the intentions of the two partners should ultimately guide the resolution, he said.\n\nMr Hwende said that the purpose of the visit was to gather as much information as possible regarding the matter. He encouraged the parties involved to find common ground and resolve the issue, despite the ongoing court proceedings.\n\nWe have requested both NRZ and Landela to submit all necessary documentation by Friday. This will enable the committee to address the Auditor Generals findings effectively, said Mr Hwende.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-21.59.24.jpeg",
            "description": "Chronicle Writer THE National Railways of Zimbabwe (NRZ, has yet to receive any financial benefit from its joint venture with Landela Safari Adventures, for the management of the Landela Complex in Victoria Falls. This is despite the partnership having been in place since 1998, as revealed by the Parliamentary Public Accounts Committee. Shockingly, no board […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Zim@45: Gokwe awaits Sandy’s spark",
            "url": "https://www.chronicle.co.zw/zim45-gokwe-awaits-sandys-spark/",
            "content": "Trust Khosa, Zimpapers Arts and Entertainment Hub\n\nIF there is one event that holds a special place in the heart of musician and dancer, Sandra Sandy Ndebele-Sibindi, it is the Independence Day gala. This event has played a pivotal role in shaping her illustrious career, establishing her as a beloved figure in Zimbabwean entertainment.\n\nAt these commemorations, Sandy has consistently wowed audiences with her electrifying dances and vibrant stage presence, with many considering the events incomplete without her.\n\nA seasoned performer with a global footprint, she has graced stages in India, Dubai, China, the United Kingdom, Russia, Canada and Japan. Her ever-growing brand continues to attract gigs and endorsement deals.\n\nWith a career spanning over two decades, Sandy says being invited to perform at galas remains an honour.\n\nIn an interview with Zimpapers Arts and Entertainment Hub, she revealed that she is hard at work preparing for her upcoming performance at the 45th Uhuru Gala, scheduled for April 18 at Mutora Grounds in Gokwe, Midlands Province.\n\nHer inclusion in the line-up comes as the Government decentralises national celebrations  a move Sandy applauds, particularly as it brings high-profile events to communities in remote areas.\n\nSandra Ndebele-Sibindi\n\nI cant wait to perform in Gokwe. The rural community has been yearning for such great events, and its always a marvel to see people in rural areas being exposed to big stages, lights and powerful sound, she said.\n\nI would like to commend the Government for this noble idea because people in rural areas were not used to this phenomenon. It also shows that we have the rural folk at heart, as national events are now being held across Zimbabwe.\n\nThese galas are more than just musical celebrations; they represent history in the making for our country.\n\nHaving last performed in Gokwe over a decade ago, Sandy is eager to reconnect with her fans.\n\nYou can imagine how I feel, being reunited with my fans. Were going to deliver our best performance of the night in Gokwe. We are promising fireworks, and we are busy with rehearsals.\n\nRunning under the theme Zim@45: Devolve and Develop Together Towards Vision 2030, the event promises to be a vibrant celebration of Zimbabwean culture and heritage.\n\nSandy will share the stage with a stellar line-up of artistes, including Sulumani Chimbetu, Mark Ngwazi, Jah Master, Andy Muridzo, Chief Hwenje, Tendai Dembo, Sasha Madhuve and Argatha Murudzwa.\n\nWhile Sandy has already promised fireworks, much is also expected from Sulumani Chimbetu, the galas headline act. Following in the footsteps of his legendary father, Simon Chopper Chimbetu, Sulumani is no stranger to State functions, with a reputation for delivering unforgettable performances. His Gokwe appearance coincides with the upcoming release of his much-anticipated album, Tsapo.\n\nChief Hwenje, a Midlands native and a regular favourite at national events, is expected to receive a heros welcome as he entertains his home crowd with his trademark energy.\n\nMark Ngwazi, known for blending humour and song, is set to light up the stage with his Njanja Express band. Despite keeping a low profile lately, he aims to remind fans that his star power remains undiminished.\n\nTendai Dembo, leader of Barura Express and son of the late Leonard Dembo, continues to improve with age, delivering nostalgic performances that keep his fathers musical legacy alive.\n\nSasha Madhuve, inspired by her late aunt Edna Mbuya Madhuve Chizema, will add a rich blend of culture and tradition to the event through her mastery of the mbira.\n\nAlso taking the stage will be Andy Muridzo and Jah Master, both renowned for their electrifying performances. For gospel music lovers, Argatha Murudzwa promises a treat. With over 20 years of experience, she remains one of Zimbabwes most consistent and creative gospel artistes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-21.03.52-4.jpeg",
            "description": "Trust Khosa, Zimpapers Arts and Entertainment Hub IF there is one event that holds a special place in the heart of musician and dancer, Sandra “Sandy” Ndebele-Sibindi, it is the Independence Day gala. This event has played a pivotal role in shaping her illustrious career, establishing her as a beloved figure in Zimbabwean entertainment. At […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Residents unite against drug abuse. . .Bura launches awareness campaign",
            "url": "https://www.chronicle.co.zw/residents-unite-against-drug-abuse-bura-launches-awareness-campaign/",
            "content": "Trish Mukwazo,[emailprotected]\n\nTHE Bulawayo United Residents Association (Bura) has launched an anti-drugs awareness campaign aimed at educating communities across the city, with a particular focus on young people. Dubbed the Substance Abuse Community Intervention Programme, the initiative is mobilising residents from various suburbs to take an active role in combating drug and substance misuse.\n\nSpeaking during one of the workshops, Bura programme leader, Mr Mthulisi Moyo, said that the initiative was introduced in response to the growing prevalence of drug abuse in Bulawayo.\n\nWhen you go to Ingutsheni Central Hospital, you will discover that 60 percent of cases are drug-related, he said.\n\nIngutsheni Central hospital\n\nMr Moyo highlighted that substance abuse is a major contributor to criminal activity in the city.\n\nSome children even go to the extent of stealing valuables from their homes to feed their addiction. Each day, police from the drugs and narcotics section conduct raids, he said.\n\nMr Moyo also expressed concern about the increasing number of schoolchildren attending Vuzu parties, where they engage in substance abuse and risky behaviour.\n\nAccording to Mr Moyo, studies have shown that the main drivers of substance abuse include peer pressure, idleness, stress and trauma.\n\nSince February, Bura has been conducting workshops in various suburbs, working in partnership with community leaders, churches and other stakeholders. Mr Moyo noted recent collaborations, including engagements with the Family of God Church and Confederation of Zimbabwe Industries (CZI).\n\nThe goal is to unpack basic knowledge for community leaders, so they can play an informed role in addressing this crisis. When communities are empowered, they are more motivated to act, said Mr Moyo.\n\nHe pointed out that commonly abused substances include crystal meth, dagga and marijuana, with alcohol being the most widely consumed.\n\nResidents follow proceedings during an anti-drugs awareness campaign held at Nketa Hall recently.  Picture by Lubelihle Mathe\n\nDuring a recent workshop held at Nketa Hall, Mr Moyo reiterated that 60 percent of admissions at mental health institutions stem from drug and substance abuse.\n\nWard 25 Councillor, Aleck Ndlovu commended the initiative, emphasising the importance of awareness.We have so many youths involved in drugs, many of them doing it in hiding. This is affecting their behaviour; they become disobedient at home and turn into bullies. The most important thing is educating them, he said.\n\nBura chairperson, Mr Winos Dube, said the programme is a direct response to President Mnangagwas call to action, following his declaration of drug and substance abuse as a national disaster.\n\nDrug and substance abuse is destroying our youth and some have even lost their lives. It is now the leading cause of murders in our country. We must take this seriously by creating awareness and taking corrective action, he said.\n\nMr Dube added that Bura is also assisting those already affected by referring drug-dependent individuals to mental health institutions.\n\nYoung people are the future and the seed of our country, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-00.20.52-3.jpeg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com THE Bulawayo United Residents’ Association (Bura) has launched an anti-drugs awareness campaign aimed at educating communities across the city, with a particular focus on young people. Dubbed the “Substance Abuse Community Intervention Programme,” the initiative is mobilising residents from various suburbs to take an active role in combating drug and substance misuse. […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Bosso, CAPS renew rivalry",
            "url": "https://www.chronicle.co.zw/bosso-caps-renew-rivalry/",
            "content": "Fungai Muderere, Zimpapers Sports Hub\n\nITS only Week Six of the 2025 Castle Lager Premier Soccer League season, but the stakes are already sky-high.\n\nOn Sunday, the countrys two most passionately supported football institutions, Highlanders and CAPS United reignite their fierce rivalry in the first instalment of the Battle of the Cities at Barbourfields Stadium.\n\nAlthough the season is still in its infancy, there is no downplaying the importance of this fixture. Both teams have endured frustrating starts and a victory in this high-stakes showdown could be the spark that reignites their faltering campaigns.\n\nFor Highlanders, it has been a stuttering start under the guidance of Kelvin Kaindu. From five outings, Bosso have managed just six points, courtesy of one win, three draws and a single loss, a run that leaves them sitting in ninth place.\n\nLast weekend, they were held to a 1-1 draw by struggling Triangle United, a side that had not registered a point this season.\n\nThe dropped points have raised alarm bells within the Bosso faithful, who expected the team to build on the momentum from last year.\n\nMakepekepe have fared even worse. The Green Machine have collected a paltry four points from a possible 15, with their only win coming early in the campaign.\n\nTheir last outing ended in a 2-1 defeat at the hands of Ngezi Platinum Stars at Baobab Stadium, a result that sent CAPS supporters over the edge. Furious fans barricaded the stadiums main exit, temporarily trapping the team bus and head coach Lloyd Chitembwes car, in protest over the teams underwhelming form.\n\nLloyd Chitembwe\n\nFor Chitembwe, a coach who knows better than most the weight of the CAPS badge, the pressure is mounting.\n\nIts a natural reaction, he admitted after the match. Ive been here long enough to understand what this football club is all about. Results are what matter at the end of the day. If they dont come, the people will demand them.\n\nThis clash could be a defining moment for both clubs. Last season, Highlanders triumphed 2-0 in the reverse fixture at Emagumeni, only for CAPS United to exact revenge with a thrilling 3-2 win in the return leg. These games are never short on drama and Sundays encounter is expected to be no different.\n\nWhile the quality of football from both sides has yet to reach the heights of previous seasons, the rivalry itself injects an intensity that often lifts performances. This is more than just a football match, it is a battle for pride, bragging rights and a chance to rewrite the early narrative of the season.\n\nFor Highlanders, its a chance to reaffirm Barbourfields as a fortress and assert dominance over a wounded rival. For CAPS, its about redemption, regaining belief and proving that they are more than the sum of recent results.\n\nWith thousands expected to pack into Emagumeni, the atmosphere will be electric. The players, coaches and fans know that no one wants to come out of this clash second best, not in a game where history, emotion and reputation collide so fiercely.\n\nOther Week Six Fixtures:Saturday: TelOne v Ngezi Platinum Stars (Ascot Stadium) Bikita Minerals v Triangle United (Gibbo Stadium) Yadah Stars v Scottland FC (Rufaro Stadium) FC Platinum v Greenfuel (Mandava Stadium) ZPC Kariba v Kwekwe United (Nyamhunga Stadium) Simba Bhora v Manica Diamonds (Wadzanayi Stadium)Sunday: Highlanders v CAPS United (Barbourfields Stadium) Herentals College v MWOS (Wadzanayi Stadium) Dynamos v Chicken Inn (Rufaro Stadium)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cxvvdcxvcx.jpg",
            "description": "Fungai Muderere, Zimpapers Sports Hub IT’S only Week Six of the 2025 Castle Lager Premier Soccer League season, but the stakes are already sky-high. On Sunday, the country’s two most passionately supported football institutions, Highlanders and CAPS United reignite their fierce rivalry in the first instalment of the Battle of the Cities at Barbourfields Stadium. […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "High-level international cricket meetings set for Zimbabwe",
            "url": "https://www.chronicle.co.zw/high-level-international-cricket-meetings-set-for-zimbabwe/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nIN a major endorsement of Zimbabwes growing stature in international cricket, Zimbabwe Cricket (ZC) will this week host the International Cricket Council (ICC) Board and Committee Meetings, bringing some of the most powerful figures in the sport to Harare and Victoria Falls.\n\nThe high-level meetings will commence in Harare on Thursday and Friday, before moving to the iconic Victoria Falls for the weekend sessions.\n\nAmong the distinguished delegates expected is ICC chairman Jay Shah, who made history in December by becoming the youngest-ever person to hold the position, alongside members of the ICC Board and other global cricket leaders.\n\nThe meetings will deliberate on key issues surrounding governance, strategy and the operational direction of world cricket.\n\nZC chairman Tavengwa Mukuhlani, said hosting the meetings was a proud moment for both the organisation and the country.\n\nThis is a proud and historic moment for Zimbabwe Cricket and our country as a whole. We are fully prepared to host the esteemed cricket leaders and to showcase the beauty, warmth and hospitality of our nation, he said.\n\nCricket\n\nMukuhlani added that the meetings underline Zimbabwes increasing relevance on the global stage and offer a unique opportunity to help shape the future of the game.\n\nMeanwhile, the recently concluded four-day regional clash between Southerns and Northerns served as a timely form-check for the Chevrons ahead of their two-Test tour to Bangladesh, starting on April 20.Southerns triumphed by 10 wickets at Old Hararians Sports Club, powered by Ben Currans extraordinary feat of scoring centuries in both innings  147 and an unbeaten 105  becoming the first Zimbabwean-based player to do so in a first-class match since Brendan Taylor in the 2018/19 season.\n\nJonathan Campbell, who captained Zimbabwe in their last Test, scored a gritty 65 for Northerns, while Victor Nyauchi impressed with 4/28 for Southerns.\n\nCampbell also starred with the ball, taking 3/70 in the first innings, alongside Wellington Masakadzas 3/98, although Masakadza missed out on the squad for Bangladesh, with Vincent Masekesa preferred as the frontline spinner.\n\nIn the second innings, Takudzwanashe Kaitano  who was omitted from the Test squad  struck a commanding 139, supported by Wessly Madheveres 91. Northerns set a target of 212, which Curran and Brian Bennett chased down with ease, sealing victory with an unbeaten opening stand. Curran ended with 105 not out and Bennett on 92*.\n\nZimbabwe, who have only ever won two Tests in Bangladesh, will be hoping their in-form players can lead a strong showing. The first Test is scheduled for April 20  24 in Sylhet, with the second from April 28 to May 2 in Chattogram  marking Zimbabwes first Test series in Bangladesh since February 2020.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-21.03.53-5.jpeg",
            "description": "Brandon Moyo, Zimpapers Sports Hub IN a major endorsement of Zimbabwe’s growing stature in international cricket, Zimbabwe Cricket (ZC) will this week host the International Cricket Council (ICC) Board and Committee Meetings, bringing some of the most powerful figures in the sport to Harare and Victoria Falls. The high-level meetings will commence in Harare on […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Gokwe’s unsung hero: Ex-prison guard’s Uhuru wish to meet his former inmate, President Mnangagwa",
            "url": "https://www.chronicle.co.zw/gokwes-unsung-hero-ex-prison-guards-uhuru-wish-to-meet-his-former-inmate-president-mnangagwa/",
            "content": "Gibson Mhaka, Zimpapers Politics Hub\n\nFOR Mr Shepherd Madanhire (93) from Gokwe Norths Matambo Village under Chief Chireya, a former prison guard who served under the Rhodesia Prison Service and courageously risked his life to protect political prisoners, notably President Mnangagwa, during their time at Khami Remand Prison, the forthcoming Independence Day celebrations carry a profound meaning.\n\nHe views the upcoming Uhuru celebrations as a pivotal opportunity, representing a chance to finally fulfill his long-cherished wish: to reunite with his former inmate, now the President of Zimbabwe, after 53 years.\n\nMr Madanhire, born on March 9, 1932 and President Mnangagwa first met around 1967 when Zimbabwes first citizen was serving a life sentence at Khami Remand Prison. President Mnangagwa and other prisoners of his ilk were, at that time, classified by the regime as most dangerous terrorists.\n\nPresident Mnangagwa\n\nThey were isolated from other prisoners in a special section of single cells and automatically placed in the infamous D category.\n\nThey were the proverbial bad apples that the regime feared would spoil the bunch, if they were allowed to mingle with other prisoners.\n\nThe President had been arrested in Salisburys Highfield Township in 1965, for being part of the Crocodile Gang that carried out sabotage activities against the Rhodesian regime after receiving military training in China.\n\nAs preparations for the forthcoming Independence Day celebrations at Nembudziya Growth Point in Gokwe North gain momentum, Zimpapers Politics Hub delved into its archives, seeking hidden gems from the district and fortunately managed to contact Mr Madanhire, who is indisputably one of Gokwes unsung heroes.\n\nThis remarkable individual played a courageous role in the liberation struggle, by risking his life smuggling letters and vital information from political prisoners like President Mnangagwa during his time at Khami Prison.\n\nIn a telephone interview, Mr Madanhire expressed immense excitement upon learning that the Independence Day celebrations would be held at Nembudziya Growth Point, particularly because his former Khami Remand Prison inmate, President Mnangagwa, would be leading the national event.Despite his advanced age and difficulty in walking, he fervently prayed the commemorations would present the perfect opportunity to reunite with his erstwhile inmate.\n\nHe reminisced about their lighter moments behind bars, sharing anecdotes of their unlikely friendship, and expressed a long-held desire to meet the President since he became Zimbabwes number one citizen.It has always been my long-held wish to meet President Mnangagwa since he became President. I first met him many years ago, when he was an inmate at Khami Remand Prison in 1967, where he was incarcerated.\n\nWhen I heard that the Independence Day celebrations would be held at Nembudziya Growth Point, I was very excited.\n\nThis is something we have cherished and we never expected such an event to happen in Gokwe. Many thanks to President Mnangagwa for bringing the celebrations to Gokwe, which is often regarded as a backward district, said Mr Madanhire.\n\nHe said that despite his old age and difficulties walking, he believed that if he received assistance with transport to Nembudziya, he would consider it the perfect opportunity to meet President Mnangagwa again.\n\nI had been trying to engage some party officials (Zanu-PF) from the constituency to assist me in meeting him, but without success. However, I believe that since he is coming to Nembudziya Growth Point to lead the independence celebrations, if I manage to get transport, it will be a perfect opportunity to meet him.\n\nDespite the good relationship we had, it was unfortunate that I couldnt bid him farewell, as my job and life were at risk. I have not met him since the 1960s. My long-cherished wish is to meet him. It would be truly wonderful to meet him and reminisce, he said.\n\nIn an earlier interview at his rural home in April 2022, Mr Madanhire shared part of the story of President Mnangagwas long years behind bars, during which he served a life sentence for contravening Section 37 (1) (b) of the notorious Law and Order Maintenance Act.\n\nIt was around 1967 when I came face-to-face with a young Emmerson Mnangagwa. I was a prison guard at Khami Maximum Security Prison, where he was serving a life sentence. I met him through one of my relatives, Ishmael Dube, who was also a political prisoner there. The two  Emmerson and Ishmael were friends.\n\nWhen I first met the young Emmerson Mnangagwa, I was immediately taken by his ready smile and the gentleness in his eyes. He was down-to-earth and courteous, Mr Madanhire said then.\n\nAn elder with an encyclopaedic knowledge of all landmarks in the Rhodesia Prison Service, Mr Madanhire said he had too many stories to tell about President Mnangagwa, adding that the Presidents experiences at Khami Prison deserve to be in a book.\n\nNot many prison officers during that time can say they shook hands with him. Very few have encountered him personally since he was classified by the regime as most dangerous, he said with pain scribbled all over his face.\n\nI saw his suffering and near desperation when I used to stand behind him during the few visits his relatives were allowed, and I could also see the anguish in him each time I talked to him or delivered a letter from his relatives and friends. After a while, even though he was a political prisoner, a friendship grew between us. It was a friendship behind bars and I never dreamt that one day he was going to be the countrys President.\n\nHe also details how he came to do favours for President Mnangagwa, smuggling his letters from prison, which were demonising the colonial regime and posting them.\n\nMr Madanhire broke the rules to allow President Mnangagwa to communicate with relatives while he was behind bars.\n\nOne of the cruellest rules was that prisoners should never write or receive letters containing subversive statements. Inmates were initially prohibited from writing about prison conditions. But he (President Mnangagwa) could write and receive such letters through me. At times, he was worried that I would get caught and be punished.\n\nIt was quite a risky exercise, and I didnt want many people to know about this. It was also one of my main duties to censor the letters that were being written by political prisoners. I was also accommodating his relatives at my house whenever they came to visit him, explained Mr Madanhire.\n\nI would also smuggle newspaper cuttings into cells of these political prisoners so that they could read about the liberation struggle, he added.\n\nMr Madanhire said many ex-political prisoners who were serving their jail sentences together with President Mnangagwa remembered him from their time inside as one of those rare phenomena: a prison officer with a heart.\n\nKhami Prison\n\nOther political prisoners I remember very well who served during the same time with him (President Mnangagwa) are Boniface Madzimbamuto, John Mashakada, John Mukoko, Saunders Mahwite and Ishmael Dube who I said was his close friend, said Mr Madanhire.\n\nHe said he also connected a lot of political prisoners to some charitable organisations that helped them pay for their studies.\n\nMr Madanhire who retired in the late 70s, showed off a medal he was given upon his retirement from the Rhodesia Prison Service. It is one of his most prized possessions.\n\nHe said that before he retired, he had asked for a transfer from Khami Prison to Chikurubi Maximum Prison after one of the prison officers discovered that he was allowing letters from political prisoners to pass without being censored.\n\nTo show that he is a decades-long admirer of President Mnangagwa, Mr Madanhire also showed off the poster of President Mnangagwa for the 2018 Harmonised Elections, which was hanging on the walls of his living room.\n\nHe also narrated how the Smith regime was ruthless to political prisoners, with some being hanged in a barbaric fashion.\n\nPolitical prisoners like President Mnangagwa were ill-treated. The living conditions were terrible, the cells were too small and we would allow them outside early in the morning for very few minutes for exercise and bathing.\n\nDuring those few minutes, they were also expected to clean their toilet buckets. This is one of the reasons I risked my life smuggling letters for these political prisoners who were so determined that one day they will fight away white rule in the country, said Mr Madanhire.\n\nHe said that although he was a prison guard, he loved politics.\n\nMr Madanhire seemed to have resigned to the fact that life is a just a clock that is counted down until one finally gives up and breathes his or her last. His wife Herena died in 2005. Four of his eight children are also late.\n\nThe old man lives with his grandchildren.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-5-1.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub FOR Mr Shepherd Madanhire (93) from Gokwe North’s Matambo Village under Chief Chireya, a former prison guard who served under the Rhodesia Prison Service and courageously risked his life to protect political prisoners, notably President Mnangagwa, during their time at Khami Remand Prison, the forthcoming Independence Day celebrations carry a […]",
            "time": "06:41",
            "date": "09 Apr 2025"
        }
    ]
}