{
    "news": [
        {
            "title": "Antum Naqvi honoured to have captained Rhinos to their maiden Domestic T20 title",
            "url": "https://www.chronicle.co.zw/antum-naqvi-honoured-to-have-captained-rhinos-to-their-maiden-domestic-t20-title/",
            "content": "Brandon Moyo,[emailprotected]\n\nALL-ROUNDER, Antum Naqvi has said that it is a pleasing honour to have captained Rhinos to their maiden Domestic T20 title after a commanding 49-runs victory over Eagles in the final that was played at Harare Sports Club on Sunday.\n\nThe 25 year old produced a crucial captains performance with both bat and ball in the final to help his side bag the title of the competition which officially marked the conclusion of Zimbabwes 2024/25 domestic season.\n\nIt was a well-deserved victory for Rhinos who finished as runners up in 2010/11 and 2022/23. They also lost the Pro50 Championship this season.\n\nThrilled to captain Rhinos to our first Zimbabwe Cricket Domestic T20 trophy. A huge thank you to my teammates, coaches, support staff and our supporters. Each and every one of you played a crucial role in the success. The Rhino took the trophy, Naqvi posted on X.\n\nRhinos won the toss and elected to bat first and managed to finish their innings on 174/9 with Naqvi scoring a half century. The new kings of domestic T20 cricket, Rhinos went on to produce a superb bowling display to restrict Eagles to 125/9.\n\nRhinos didnt have the best of starts with the bat as they lost three quick wickets. They found themselves in all sorts of trouble on 25/3 having lost the wickets of Takudzwanashe Kaitano (13), Ben Curran (seven) and Ryan Burl (five).\n\nNaqvi went on to produce a brilliant performance with the bat, scoring 50 runs off 32 deliveries consisting two sixes and four fours. There were also handy knocks from Tashinga Musekiwa (33), Victor Chirwa (27) and Nyasha Mayavo (22).\n\nRichard Ngarava and Tinotenda Maposa picked up two wickets apiece for Eagles while Wallace Mubaiwa, Wessly Madhevere and Kundai Matigimu picked up one scalp apiece.\n\nNaqvi went on to complete an all-round performance as he picked up two wickets for 19 runs in the games second innings. Bradley Evans, and Hendrichs Macheke also picked up two wickets apiece to help guide their team to victory.\n\nCraig Ervine top scored for Eagles with 21 runs off 19 deliveries.\n\nMeanwhile, Zimbabwe Cricket (ZC) has congratulated cricketer Kelis Ndhlovu and umpire, Langton Rusere for scooping accolades at the Annual National Sports Awards (ANSA) which were held in Harare on Sunday evening.\n\nThe 19-year old Ndhlovu was honoured as Zimbabwes Junior Sportswoman of the Year and Junior Sportsperson of the Year while Rusere was named the Technical Official of the Year for 2024. The association, ZC was named Zimbabwes National Sport Association of the Year, making it a triple delight for the game in the country.\n\nWe did it. Zimbabwe Cricket has been named Zimbabwes National Sport Association of the Year 2024 at the Annual National Sports Awards. A huge honour.\n\nHuge congratulations to Zimbabwe Crickets top umpire Langton Rusere for being named the Technical Official of the Year 2024 at the Annual National Sports Awards. A well-deserved recognition for his dedication and excellence in the sport.\n\nOur very own Kelis Ndhlovu, the Zimbabwe national Under-19 womens captain and senior womens team star, has been honoured as Zimbabwes Junior Sportswoman of the Year and Junior Sportsperson of the Year at the Annual National Sports Awards! What an achievement, ZC posted on their social media pages.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/image-680x380.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com ALL-ROUNDER, Antum Naqvi has said that it is a pleasing honour to have captained Rhinos to their maiden Domestic T20 title after a commanding 49-runs victory over Eagles in the final that was played at Harare Sports Club on Sunday. The 25 year old produced a crucial captain’s performance with both bat […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "Zanu PF Harare Province recommends co-option of businessman Tagwireyi into Central Committee",
            "url": "https://www.chronicle.co.zw/just-in-zanu-pf-harare-province-nominates-tagwireyi-into-central-committee/",
            "content": "Joseph Madzimure,Zimpapers Politics Hub\n\nZanu PF Harare Province has resolved to recommend the co-option of businessman, Cde Kudakwashe Tagwirei, into the ruling partys Central Committee.\n\nSpeaking at the Zanu PF Harare Provincial Coordinating Committee (PCC) meeting held at the partys provincial headquarters this afternoon, the ruling partys provincial chairperson Cde Godwills Masimirembwa said: Members of the Central Committee in Harare have proposed that Cde Tagwirei be recommended for co-option into the Central Committee of Zanu PF.\n\nCde Tagwirei is a party member in the Harare Metropolitan Province.\n\nHe is a business strategist; a visionary business leader.\n\nCde Masimirembwa said Cde Tagwirei is an asset to Harare Province.\n\nSo the proposal was put forward and the PCC unanimously agreed to recommend him for co-option into the Central Committee of Zanu PF.\n\nWe are going to submit this recommendation to the partys Secretary-General, Dr Obert Mpofu, said Cde Masimirembwa.\n\nZanu PF Harare Youth chairperson Cde Emmanuel Mahachi commended the decision, saying Cde Tagwirei has been instrumental in mobilising resources for the party.\n\nWe are happy that Cde Tagwirei will give advice and direction to help in the growth of the party. He is always available in times of need for the party. We really support the co-option of Cde Tagwirei.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Chairperson-of-the-Land-Tenure-Implementation-Committee-Mr-Kudakwashe-Tagwirei.jpg",
            "description": "Joseph Madzimure, Zimpapers Politics Hub Zanu PF Harare Province has resolved to recommend the co-option of businessman, Cde Kudakwashe Tagwirei, into the ruling party’s Central Committee. Speaking at the Zanu PF Harare Provincial Coordinating Committee (PCC) meeting held at the party’s provincial headquarters this afternoon, the ruling party’s provincial chairperson Cde Godwills Masimirembwa said: “Members of […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "10 companies to exhibit at the Zimtrade organised Mozambique outward seller mission.",
            "url": "https://www.chronicle.co.zw/10-companies-to-exhibit-at-the-zimtrade-organised-mozambique-outward-seller-mission/",
            "content": "Sikhulekelani Moyo\n\nZIMTRADE WILL, lead a delegation of 10 local businesses on an outward seller mission to Malawi from 13-15 May 2025.In its latest newsletter, Zimtrade said the mission, focused on Blantyre is designed to strengthen trade ties between Zimbabwe and Malawi, with a primary focus on increasing Zimbabwes exports and boosting economic growth by tapping into Malawis rapidly expanding market.\n\nThe mission will spotlight sectors including agricultural inputs and implements, fast-moving consumer goods (FMCGs), building and construction materials, household and office furniture, packaging, and personal protective equipment (PPEs), reads the newsletter.\n\nThe delegation, consisting of businesses from diverse sectors, will have a packed schedule that includes a business forum, one-on-one business meetings, a trade exhibition, and company tours.At the business forum, Zimbabwean companies will showcase their products and services to a wide audience of Malawian stakeholders, including buyers, importers, distributors, and government officials.Zimtrade said the exhibition will provide a prime opportunity for Zimbabwean businesses to present their strengths and establish direct contact with potential partners.\n\nIn addition to the business forum, the mission will feature scheduled business-to-business (B2B) meetings aimed at connecting Zimbabwean exporters with Malawian buyers.These personalised meetings will enable both sides to engage in direct negotiations, explore trade possibilities, and sign deals, making the process of business matchmaking much more efficient and results oriented.The outward mission follows the growing interest and market opportunities for Zimbabwean products in Malawi.A survey conducted by ZimTrade underscores proximity, and Malawis unique and strategic position, making it an excellent market for Zimbabwes export products.\n\nMalawi shares many similarities with Zimbabwe in terms of consumer preferences, which further strengthens its potential as a target market for a diverse range of Zimbabwean goods.Moreover, Malawis low logistics costs and proximity offer Zimbabwean exporters a competitive edge when it comes to pricing and trade efficiency.\n\nMalawi presents a fantastic opportunity for Zimbabwean businesses to expand their reach and explore new market channels, said Ziomtrade director of operations Mr Similo Nkala.We are excited to lead this mission as it provides a unique platform for local businesses to build meaningful relationships with Malawian counterparts, secure new trade leads, and ultimately grow exports that will contribute to the strengthening of both economies.\n\nThe Mission is expected to further deepen the trade relations between Zimbabwe and Malawi, following the success of previous missions.During ZimTrades 2021 Mission to Malawi, Zimbabwean secured trade deals worth over US$1,5 million during the event, with over US$10 million orders under negotiation.Zimbabwes export figures to Malawi have been rising year after year, with 2023 exports reaching a value of US$27, 4 million, up from US$11, 1 million in 2022.In 2023, Zimbabwes top exports to Malawi included paper, mineral fuels, electrical machinery, and ceramics.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Similo-Nkala.jpg",
            "description": "Sikhulekelani Moyo ZIMTRADE WILL, lead a delegation of 10 local businesses on an outward seller mission to Malawi from 13-15 May 2025. In its latest newsletter, Zimtrade said the mission, focused on Blantyre is designed to strengthen trade ties between Zimbabwe and Malawi, with a primary focus on increasing Zimbabwe’s exports and boosting economic growth […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "Everything is normal in Zimbabwe",
            "url": "https://www.chronicle.co.zw/everything-is-normal-in-zimbabwe/",
            "content": "Chronicle Reporter\n\nZimbabwes Ambassador to South Africa, Mr David Hamadziripi reassured the public this morning that the situation in Zimbabwe remains stable, emphasising that social media does not reflect the true state of affairs.\n\nIts what you see in the social media, but social media is not reality. There is nothing happening in Zimbabwe. Its quiet. Everything is normal. And what is on the social media is not the reality, said Mr Hamadziripi\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/erfddryy.jpg",
            "description": "Chronicle Reporter Zimbabwe’s Ambassador to South Africa, Mr  David Hamadziripi reassured the public this morning that the situation in Zimbabwe remains stable, emphasising that social media does not reflect the true state of affairs. “It’s what you see in the social media, but social media is not reality. There is nothing happening in Zimbabwe. It’s […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "Arts regulatory clash: Zimura snubs NACZ registration demand",
            "url": "https://www.chronicle.co.zw/arts-regulatory-clash-zimura-snubs-nacz-registration-demand/",
            "content": "Trust Khosa  Zimpapers Arts and Entertainment Hub\n\nThe Zimbabwe Music Rights Association (Zimura) has firmly rejected a directive from the National Arts Council of Zimbabwe (NACZ) to register as an arts association. This defiance stems from an ongoing dispute over Zimuras operational framework and its recent imposition of a US$150 fee on cover bands.\n\nThe controversy erupted earlier this year when Zimura introduced the tariff, prompting widespread debate and a stakeholders meeting aimed at resolving the matter. However, on Friday, March 28, Zimura issued a public notice reaffirming its stance. The statement warned cover bands and event organisers that performing copyrighted music without a valid license constitutes a violation of the Copyright and Neighbouring Rights Act (Chapter 26:05).Effective immediately, all performers and organisers must obtain the necessary licenses before staging any event featuring protected musical works, Zimura stated.\n\nThe organisation further announced nationwide monitoring efforts in collaboration with law enforcement, threatening legal action against violators.In response, NACZ director Napoleon Nyanhi issued a statement on Monday, March 31, directing Zimura to suspend the $150 tariff on bands pending further registration, dialogue, and negotiation processes.Additionally, NACZ called for Zimura to regularise its registration under national arts regulations.The Zimbabwe Music Rights Association should register with the NACZ as an arts association, in line with the National Arts Council of Zimbabwe Act (Chapter 25:07), read in conjunction with Section 4 of Statutory Instrument 87 of 2006, Nyanhi said.\n\nHowever, Zimura swiftly dismissed this directive, asserting that it is not legally obligated to register with NACZ.In response to the assertion that Zimura must register with NACZ, we would like to clarify our legal standing and regulatory framework. Zimura operates within the provisions of the law and is duly registered under the appropriate statutes governing copyright and intellectual property rights in Zimbabwe, the association declared in a statement.\n\nThe Zimura board further said there is no legal requirement for it to register with NACZ.Zimura is registered as a private entity without the term Limited, as it is a non-profit organisation governed by the Companies and Other Business Entities Act [Chapter 24:31]. Zimura holds a valid certificate of incorporation.Additionally, Zimura is legally recognised as a Collecting Society under the Copyright and Neighbouring Rights Act [Chapter 26:05]. Contrary to common belief, Zimura is not classified as an Arts Association, despite its name.\n\nThe board concluded by stating that no regulation requires Zimura to register under two separate Acts of Parliament.\n\nDespite Zimuras defiance, NACZ remains firm in its position.We appeal for restraint, civility, and patience on social media and in all engagements while we strive to protect musicians intellectual property, ensure fair use, and guarantee proper compensation from users, Nyanhi said.\n\nWith both parties holding their ground, the dispute over Zimuras regulatory status and its licensing fees remains unresolved.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/zimura.jpg",
            "description": "Trust Khosa – Zimpapers Arts and Entertainment Hub The Zimbabwe Music Rights Association (Zimura) has firmly rejected a directive from the National Arts Council of Zimbabwe (NACZ) to register as an arts association. This defiance stems from an ongoing dispute over Zimura’s operational framework and its recent imposition of a US$150 fee on cover bands. […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "Watch: Zanu-PF vows to remain in contact with electorate",
            "url": "https://www.chronicle.co.zw/watch-zanu-pf-vows-to-remain-in-contact-with-electorate/",
            "content": "Mthabisi Tshuma in Mbimba, Bulilima\n\nZANU-PF leadership in Matabeleland South province has vowed to remain in touch with the electorate in order to address their needs and wants.\n\nThe ruling party in Bulilima district led by the area legislator Cde Dingumuzi Phuti held a get together event on Sunday at Mbimba in Bambadzi Ward 10.\n\nZanu PF Bulilima legislator Cde Dingumuzi Phuti and Umalayitsha Mr Roy Ndebele during a get together event in Mbimba, Bambadzi Ward 10\n\nGuest of honour, Zanu PF Politburo member and Insiza Senator Esther Nyathi hailed the Bulilima community for putting their trust on President Emmerson Mnangagwa, Cde Phuti and Ward 10 Clr Sikhumbuzo Dube.\n\nShe implored the leadership to continue their commitment in serving the people with dignity and respect.\n\nCde Phuti said he will pursue developmental projects in the area with some of these including the construction of Jutshume clinic, installing of a base station in the ward, renovating Bambadzi Primary School among other initiatives.\n\nUmalayitsha representative Mr Roy Ndebele pledged to work closely with the ruling party in enhancing development across the constituency.\n\nZanu PF Politburo member and Insiza Senator Cde Esther Nyath\n\nIn attendance was Matabeleland South Minister of State for Provincial Affairs and Devolution Dr Evelyn Ndlovu who is also Bulilima PR MP, Zanu PF Veterans League political commissar Cde Ntombiyakhe Ndlovu, former Bulilima East MP Cde Mathias Ndlovu, Zanu PF DCC chairman Cde Felix Ncube and his committee, Headman Mbimba and Zanu PF supporters.\n\nFollow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/khhh.jpg",
            "description": "Mthabisi Tshuma in Mbimba, Bulilima ZANU-PF leadership in Matabeleland South province has vowed to remain in touch with the electorate in order to address their needs and wants. The ruling party in Bulilima district led by the area legislator Cde Dingumuzi Phuti held a get together event on Sunday at Mbimba in Bambadzi Ward 10. […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "SDA church in partnership with Faith-Based organisation drills boreholes at Khami Prison Complex",
            "url": "https://www.chronicle.co.zw/sda-church-in-partnership-with-faith-based-organisation-drills-boreholes-at-khami-prison-complex/",
            "content": "Rutendo Nyeve [emailprotected]\n\nA faith-based organisation, Jesus Behind Bars in partnership with Selbourne Park Seventh-day Adventist Church has drilled three boreholes at Khami Prison Complex set to alleviate water challenges faced by inmates and staff.The humanitarian and spiritual outreach initiative rolled out last Saturday and valued at over US$12 000 also included the donation of 300 pairs of shoes, 225 towels, 50 metres of orange linen for inmate uniforms and an assortment of groceries.\n\nThe gesture aims to improve living conditions for prisoners while supporting their rehabilitation.The outreach also took a spiritual turn as 225 Khami Remand Prison inmates at were baptised, marking a transformative moment in their lives.\n\nSpeaking during the handover ceremony, Jesus Behind Bars founder Mr Dumisani Nkomo said the donations are part of the organisations commitment to complementing Government efforts in prisoner welfare.Our mission goes beyond material donations as we seek to restore dignity and hope to those behind bars. By providing clean water, basic necessities and spiritual guidance, we believe inmates can be rehabilitated and reintegrated into society as changed individuals, said Mr Nkomo.\n\nHe expressed his gratitude to the Selbourne Park SDA church which came forth with the valuable donations.We are grateful for the partnership with Selbourne Park SDA Church and the support from the prison authorities. We hope to expand our programs to other correctional facilities, said Mr Nkomo.The Zimbabwe Prisons and Correctional Services (ZPCS) Officer Commanding Bulawayo Province Commissioner Mkhunjulelwa Ngwenya\n\nexpressed his gratitude toward the SDA church saying they look forward to a continued sustainable partnership.We would like to thank the SDA church for their donation of three boreholes to complement Government efforts in terms of provision of water to Khami Complex. We really appreciate the gesture and the Khami community is generally happy and we look forward to a sustainable partnership that will assist the inmates and the entire Khami community, said Comm Ngwenya.\n\nThe development comes barely a month after the prison complex benefitted three solerised boreholes from the Presidential Borehole Drilling Scheme.Khami Prison Complex houses prisons that include Khami Maximum, Khami Remand, Khami Medium and Mlondolozi female prison.@nyeve14\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/frjigfdi.jpg",
            "description": "Rutendo Nyeve – rutendo.nyeve@sundaynews.co.zw A faith-based organisation, Jesus Behind Bars in partnership with Selbourne Park Seventh-day Adventist Church has drilled three boreholes at Khami Prison Complex set to alleviate water challenges faced by inmates and staff. The humanitarian and spiritual outreach initiative rolled out last Saturday and valued at over US$12 000 also included the […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "Insiza North MP dies",
            "url": "https://www.chronicle.co.zw/insiza-north-mp-dies/",
            "content": "Rutendo Nyeve  rutendo.nyeve\n\nINSIZA North Member of the National Assembly Cde Farai Taruvinga has died.He was 53.Cde Taruvinga died on Monday in Bulawayo.Matabeleland South Zanu PF Provincial Chairman Cde Mangaliso Ndlovu confirmed Taruvingas death.I can confirm that we have lost the Member of the National Assembly for Insiza North. He had been unwell for some time, said Cde Ndlovu.The late Taruvinga was serving his second term as a member of the National Assembly and was an established business man with interests in mining.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Farai-Taruvinga.jpg",
            "description": "Rutendo Nyeve – rutendo.nyeve INSIZA North Member of the National Assembly Cde Farai Taruvinga has died. He was 53. Cde Taruvinga died on Monday in Bulawayo. Matabeleland South Zanu PF Provincial Chairman Cde Mangaliso Ndlovu confirmed Taruvinga’s death. “I can confirm that we have lost the Member of the National Assembly for Insiza North. He […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "Insiza North MP Cde Farai Taruvinga dies",
            "url": "https://www.chronicle.co.zw/insiza-north-mp-cde-farai-taruvinga-dies/",
            "content": "Rutendo Nyeve, Online Reporter\n\nINSIZA North Member of the National Assembly Cde Farai Taruvinga has died.\n\nHe was 53.\n\nCde Taruvinga died on Monday in Bulawayo.\n\nMatabeleland South Zanu PF Provincial Chairman Cde Mangaliso Ndlovu confirmed Taruvingas death.\n\nI can confirm that we have lost the Member of the National Assembly for Insiza North. He had been unwell for some time, said Cde Ndlovu.\n\nThe late Taruvinga was serving his second term as a member of the National Assembly and was an established businessman with interests in mining.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-31-at-16.08.16-680x380.jpeg",
            "description": "Rutendo Nyeve, Online Reporter  INSIZA North Member of the National Assembly Cde Farai Taruvinga has died. He was 53. Cde Taruvinga died on Monday in Bulawayo. Matabeleland South Zanu PF Provincial Chairman Cde Mangaliso Ndlovu confirmed Taruvinga’s death. “I can confirm that we have lost the Member of the National Assembly for Insiza North. He […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        },
        {
            "title": "Veteran journalist loses $20,000 in mysterious fire",
            "url": "https://www.chronicle.co.zw/veteran-journalist-loses-20000-in-mysterious-fire/",
            "content": "Sikhumbuzo Moyo [emailprotected]\n\nVeteran Zimbabwean journalist Methuseli Moyo yesterday lost US$20,000 in a baffling fire that has been tormenting him since late last year.The Bulawayo based Moyo, who is also a lecturer at the National University of Science and Technology, had just sold a house in Rangemore suburb, intending to use the proceeds to complete a family new home in Pumula North. The money had been placed inside a wooden wardrobe, which, strangely, remained untouched by the flamesalong with the clothes inside it.\n\nMethuseli Moyo points to the spot where they had put the US$20 000 that for burnt to ashes yesterday\n\nI have been living in hell. Someone is tormenting me, and I dont know why, said Moyo during an emotionally charged interview at his New Magwegwe family home.\n\nWe have been experiencing mysterious fires, and I have even suffered burns on my back. On Sunday, we had just collected US$20,000 from the house sale. Aware of these strange occurrences, I was planning to wrap the money in a plastic bag and place it in a bucket of water.The unexplained fires continue to haunt Moyo, leaving him searching for answers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/grdddtt.jpg",
            "description": "Sikhumbuzo Moyo – smoyo@chronicle.co.zw Veteran Zimbabwean journalist Methuseli Moyo yesterday lost US$20,000 in a baffling fire that has been tormenting him since late last year. The Bulawayo based Moyo, who is also a lecturer at the National University of Science and Technology, had just sold a house in Rangemore suburb, intending to use the proceeds […]",
            "time": "20:37",
            "date": "31 Mar 2025"
        }
    ]
}