{
    "news": [
        {
            "title": "WATCH: The moment Kirsty Coventry was announced as IOC president",
            "url": "https://www.chronicle.co.zw/watch-the-moment-kirsty-coventry-was-announced-as-ioc-president/",
            "content": "IOC election voting results:\n\nKirsty Coventry 49\n\nJuan AntonioSamaranch 28\n\nPrinceFeisal Al Hussein 2\n\nDavid Lappartient 4\n\nJohan Eliasch 2\n\nLord Sebastian Coe 8\n\nMorinari Watanabe 4\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-20-at-18.12.57-680x380.jpeg",
            "description": "      IOC election voting results: Kirsty Coventry 49 Juan Antonio Samaranch 28 PrinceFeisal Al Hussein 2 David Lappartient 4 Johan Eliasch 2 Lord Sebastian Coe 8 Morinari Watanabe 4",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "“I will lead with pride and commitment” – newly elected IOC president Kirsty Coventry",
            "url": "https://www.chronicle.co.zw/i-will-lead-with-pride-and-commitment-newly-elected-ioc-president-kirsty-coventry/",
            "content": "NEWLY elected president of the International Olympic Committee (IOC) Kristy Coventry, a seven-time Olympic medalist in swimming, says it was a dream she could not have imagined as a little girl, promising to lead the organisation with pride and dedication.\n\nThe 41-year-old Zimbabwean was chosen in a secret ballot of seven candidates at the 144th IOC Session being held in Costa Navarino, Greece, on Thursday (20 March), for an eight-year term of office.\n\nShe will be the first woman and the first African to serve as IOC President.\n\nThe Zimbabwean Minister of Sports, Recreation and Arts said her election was an honour and a reminder of her commitment to those who elected her.\n\nThis is not just a huge honour, but it is a reminder of my commitment to every single one of you that I will lead this organisation with so much pride, and I will make all of you very, very proud and hopefully extremely confident in the decision youve taken today, Coventry said during her acceptance speech.\n\nShe expressed deep gratitude to the IOC members.\n\nThank you from the bottom of my heart, and now weve got some work to do together. Coventry also reflected on the election process, calling it an incredible race that has strengthened the Olympic movement.\n\nMs Coventrys election marks a significant milestone, as she becomes one of the few women to hold the prestigious position. Her leadership is expected to bring a fresh perspective to the IOC, with a focus on unity, innovation, and the continued growth of the Olympic movement.\n\nThe newly elected president concluded her speech by thanking the members for their trust, saying, Thank you very much for this moment, and thank you very much for this honour.\n\nIn her candidature document, IOC president elect Coventry listed five priorities: harnessing the power of sport; maximising collaboration and engagement; strengthening partnerships for mutual growth; championing sustainable development; and advancing credibility and trust.\n\nThe document ends with a quote in large font, centred on an otherwise empty page: I am because we are. As she explains elsewhere:\n\nMy mission to drive empowerment, strengthen engagement, and ensure we remain relevant, is guided by the Ubuntu philosophy: I am because we are. This principle highlights the combined strength of the Olympic community and our responsibility to uplift one another. It also underscores the close partnership we share with the International Paralympic Committee. Together, these events serve as a beacon of hope and inspiration, a symbol of human progress with limitless possibilities.\n\nPresident-elect Coventry will assume office after the handover from President Bach on Olympic Day, 23 June. President Bach, who remains in the role until then, will also resign as an IOC Member after the transfer of power and will then assume the role of Honorary President.\n\nThe President-elect will oversee the Olympic Winter Games Milano Cortina 2026 as her first Olympic Games, with under 11 months to go to the Opening Ceremony.\n\nOnline Reporter/Guardian/Telegram\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-20-at-17.53.16.jpeg",
            "description": "NEWLY elected president of the International Olympic Committee (IOC) Kristy Coventry, a seven-time Olympic medalist in swimming, says it was a “dream she could not have imagined as a little girl,” promising to lead the organisation with pride and dedication. The 41-year-old Zimbabwean was chosen in a secret ballot of seven candidates at the 144th […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "ATAF lobbies for tax reforms to speed up AfCFTA",
            "url": "https://www.chronicle.co.zw/ataf-lobbies-for-tax-reforms-to-speed-up-afcfta/",
            "content": "Business Writer\n\nTHE African Tax Administration Forum (ATAF) has emphasised the importance of harmonizing tax systems and advocating for revenue-generation mechanisms that would sustain government finances while fostering trade liberalisation.The regional tax lobby body delivered the message during the 57th Session of the Economic Commission for Africa (ECA): Conference of African Ministers of Finance, Planning, and Economic Development held in Addis Ababa, Ethiopia this week.Outgoing conference chairperson, Professor Mthuli Ncube, represented Zimbabwe at the conference, which reinforced the urgency of transformative actions to drive the implementation of the African Continental Free Trade Area (AfCFTA).During the meeting, ministers, policymakers, and technical experts discussed strategies for strengthening regional integration and unlocking the full potential of intra-African trade.The conference underscored, in particular, the critical role of tax and customs policies in ensuring that AfCFTA delivers on its promise of economic transformation.ATAF used this platform to strengthen its collaboration with key continental institutions, including the United Nations Economic Commission for Africa (UNECA), the African Union (AU), the African Development Bank (AfDB), and Afreximbank, said the organisation in a post conference statement.These partnerships remain essential in advancing tax and customs reforms that align with AfCFTA s objectives, ensuring that trade policies are designed to enhance rather than hinder economic integration.According to ATAF, one of the pressing concerns raised at the conference was the financial impact of reducing tariffs under AfCFTA.Many African governments rely heavily on trade taxes for revenue, making it necessary to explore alternative sources of income.ATAF advocated for tax policy reforms that would maintain fiscal stability while promoting trade facilitation, said the agency.Discussions focused on optimising domestic taxation to support revenue mobilisation, enhancing digital tax solutions, and strengthening indirect tax measures to ensure sustainable government financing.The need for improved tax administration and coordination was also emphasised to help countries navigate the evolving trade landscape.ATAF has since its establishment championed the adoption of enhanced domestic revenue mobilisation strategies, stressing the importance of strengthening tax administration, broadening tax bases, and harnessing digital solutions to improve tax collection efficiency.Through its active engagement at the conference, ATAF said it reaffirmed its commitment working closely with its partners towards shaping effective tax and trade policies that support AfCFTA implementation and fostering sustainable economic growth across Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/02/AfCFTA-88.jpg",
            "description": "Business Writer THE African Tax Administration Forum (ATAF) has emphasised the importance of harmonizing tax systems and advocating for revenue-generation mechanisms that would sustain government finances while fostering trade liberalisation. The regional tax lobby body delivered the message during the 57th Session of the Economic Commission for Africa (ECA): Conference of African Ministers of Finance, […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "72-year-old man exonerated of indecent assault charges for lack of evidence",
            "url": "https://www.chronicle.co.zw/72-year-old-man-exonerated-of-indecent-assault-charges-for-lack-of-evidence/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 72-YEAR-OLD Bulawayo man who was accused of indecently assaulting his neighbours 15-year-old daughter has been discharged at the close of the States case due to lack of evidence linking him to the alleged offence.Yusuf Osman from Pumula North suburb was allegedly to have indecently assaulted the juvenile in September last year.In acquitting the accused, Western Commonage magistrate Mr Mehluli Moyo said there were inconsistencies in the testimony of the two complainants.After hearing the testimonies by the complainants, the court noted that there is a lack of evidence linking the accused to the rape and indecent assault. Accordingly, he is found not guilty and acquitted, ruled the magistrate.Prosecuting, Ms Mandrela Chisiiwa told the court that the alleged assaults occurred repeatedly between September last year and January this year.The alleged incidents began when the teenage girl visited Yusufs home where her friend resides.On an unknown date in September 2024, during the daytime, the accused called the complainant into his house. He then convinced her to allow him to fondle her breasts and touch her buttocks, said Ms Kufandikanwe.The court heard that Yusuf allegedly exploited the girls visits to her friend, turning what should have been innocent interactions into a pattern of abuse.Each time the complainant came to see her friend at the accuseds residence, he would take advantage of her presence and indecently assault her, said Ms Kufandikanwe.The court heard that the assaults continued unchecked for months, with the teenager initially too frightened or confused to speak out.The matter came to light under distressing circumstances. In January 2025, the girl went missing, prompting her frantic parents to file a missing person report with the police. After an anxious search, she returned home, and upon being quizzed on her whereabouts by her parents, she narrated her ordeal.The complainant disclosed that she had been at Yusufs residence. She revealed that he had been sexually assaulting her from September 2024 until January this year, said Ms Kufandikanwe. A report was made to the police, leading to Yusufs arrest.In his defence Yusuf said this was a fabricated story as he was dating the complainants grandmother.I was in a relationship with the complainants grandmother, so they have fabricated this story as a way of getting back to me.As for the complainant I know her since she was three years old and there is no way I could do that to someone who grew up around me, said Yusuf\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 72-YEAR-OLD Bulawayo man who was accused of indecently assaulting his neighbour’s 15-year-old daughter has been discharged at the close of the State’s case due to lack of evidence linking him to the alleged offence. Yusuf Osman from Pumula North suburb was allegedly to have indecently assaulted the juvenile in September last […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "Another smuggler caught at border with R2 million cigarettes",
            "url": "https://www.chronicle.co.zw/another-smuggler-caught-at-border-with-r2-million-cigarettes/",
            "content": "Online,Thupeyo Muleya, Beitbridge Bureau\n\nZimbabwean and South African border security officials are continuing with a crack down on border crime that has resulted in the interception of a trucker with a contraband of cigarettes worth R2, 1 million that had been smuggled from Zimbabwe through Beitbridge border post.\n\nTo reduce crime, the officials are carrying out periodic joint operations along the boundaries of the two countries.\n\nLimpopo police spokesperson Colonel Malasela Ledwaba said they arrested a 44-year-old foreign national male at the Beitbridge Port of Entry on Thursday, at approximately 3.15AM for attempting to smuggle illicit cigarettes with customs value of R2,139,000\n\nDuring routine profiling and searches of trucks at the South Gate entering the Republic of SA , police stopped a freight liner truck with Gauteng registration. The driver presented a manifest indicating that the truck was empty, he said.\n\nHowever, a thorough search revealed that the truck was laden with pallets and several boxes positioned in front of the pallets. The vehicle was subsequently taken to the commercial ramp where it was opened, revealing it was loaded with 460 boxes. Each box, when opened, contained 100 cartoons of Remington Gold cigarettes. \n\nCol Ledwaba said following the discovery, the suspect was detained at SAPS Musina and charged with smuggling of illicit cigarettes.\n\nHe is scheduled to appear before the Musina Magistrates Court on Monday, March 24.\n\nSouth Africa has become one of the major destinations and conduits where mostly cigarettes are smuggled through Beitbridge border post or illegal crossing points along the Limpopo River.\n\nIt is understood that 30 percent of cigarettes in South Africa are from Zimbabwe, including Pacific, Remington gold, Mega, Dullahs, Branson, and Servilles.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-20-at-15.41.14-2.jpeg",
            "description": "Online, Thupeyo Muleya, Beitbridge Bureau Zimbabwean and South African border security officials are continuing with a crack down on border crime that has resulted in the interception of a trucker with a contraband of cigarettes worth R2, 1 million that had been smuggled from Zimbabwe through Beitbridge border post. To reduce crime, the officials are carrying […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "BREAKING: Kirsty Coventry elected new International Olympic Commitee president",
            "url": "https://www.chronicle.co.zw/breaking-kirsty-coventry-elected-new-international-olympic-commitee-president/",
            "content": "Zimbabwes Minister of Sports, Recreation and Arts Kirsty Coventry has been elected the 10th President of the International Olympic Committee.\n\nThe 41-year-old Zimbabwean was chosen in a secret ballot of seven candidates at the 144th IOC Session being held in Costa Navarino, Greece, on Thursday (20 March), for an eight-year term of office.\n\nPresident-elect Coventry replaces outgoing President Thomas Bach, who was first elected in 2013 and re-elected in 2021.\n\nShe will be the first woman and the first African to serve as IOC President.\n\nPresident-elect Coventry will assume office after the handover from President Bach on Olympic Day, 23 June. President Bach, who remains in the role until then, will also resign as an IOC Member after the transfer of power and will then assume the role of Honorary President.\n\nThe President-elect will oversee the Olympic Winter Games Milano Cortina 2026 as her first Olympic Games, with under 11 months to go to the Opening Ceremony.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-20-at-18.02.07-680x380.jpeg",
            "description": "Zimbabwe’s Minister of Sports, Recreation and Arts Kirsty Coventry has been elected the 10th President of the International Olympic Committee. The 41-year-old Zimbabwean was chosen in a secret ballot of seven candidates at the 144th IOC Session being held in Costa Navarino, Greece, on Thursday (20 March), for an eight-year term of office. President-elect Coventry […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "Bulawayo socialite Breezy arrested for alleged US$520 school fees scam",
            "url": "https://www.chronicle.co.zw/bulawayo-socialite-breezy-arrested-for-alleged-us520-school-fees-scam/",
            "content": "Peter Matika,[emailprotected]\n\nA BULAWAYO socialite  Brendon Shoko, popularly known as Breezy, has been arrested for alleged forgery in a scandal involving his girlfriend and an accomplice.\n\nShoko (28) allegedly connived with his girlfriend Priscah Chipeta (38) popularly known as Gugulethu Banda to swindle Ms Phethekile Madonko of US$520.\n\nBrendon Shoko\n\nThe money was given to Chipeta by Ms Madonko to pay school fees for her child, but the two lovers and a third accomplice Knowledge Mhlanga (41) converted the money to their own use.\n\nThey then allegedly forged bank deposit slips to create the false impression that the fees had been paid.\n\nThe crime was discovered after the school contacted Ms Madonko reminding her to settle the childs outstanding fees.\n\nShe then filed a police report leading to the arrest of the trio who appeared at the Bulawayo Magistrates Court on Thursday and were remanded in custody pending their bail hearing on Friday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Brendon-Shoko.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw A BULAWAYO socialite – Brendon Shoko, popularly known as Breezy, has been arrested for alleged forgery in a scandal involving his girlfriend and an accomplice. Shoko (28) allegedly connived with his girlfriend Priscah Chipeta (38) popularly known as Gugulethu Banda to swindle Ms Phethekile Madonko of US$520. The money was given to […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "Nees speaks on Warriors potential ahead of Benin game",
            "url": "https://www.chronicle.co.zw/nees-speaks-on-warriors-potential-ahead-of-benin-game/",
            "content": "OnIine ReporterWARRIORS head coach Michael Nees believes his side has the potential to come out with a positive result when they face Benin in the 2026 World Cup Qualifiers Group C encounter this evening.The national team will play host to the match at Moses Mabhida Stadium in Durban, South Africa.Kick-off is at 6 pm.Zimbabwe has had a slow start to the campaign after picking just two points in their first four games and are currently sitting on the bottom of Group C.Speaking at a press conference on, Nees said: I think the impression so far, we can be confident and positive going into this match without being overconfident, with focus and concentration. And I think if we bring our best into the match, we can be successful. Its very simple. We have to throw in the best possible plan to get a win and reduce the gap. A draw wouldnt really help a lot.Benin currently top the group with seven points after four games.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Michael-Nees.jpg",
            "description": "OnIine Reporter WARRIORS head coach Michael Nees believes his side has the potential to come out with a positive result when they face Benin in the 2026 World Cup Qualifiers Group C encounter this evening. The national team will play host to the match at Moses Mabhida Stadium in Durban, South Africa. Kick-off is at […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "Watch :’We’ll thrash you 4-0!’: Scott Sakupwanya warns Bosso",
            "url": "https://www.chronicle.co.zw/well-thrash-you-4-0-scott-sakupwanya-warns-bosso/",
            "content": "Innocent KuriraSCOTTLAND FC owner, Pedzisayi Scott Sakupwanya, has boldly predicted a 4-0 victory over Bulawayo giants Highlanders FC in their upcoming Castle Lager Premier Soccer League date set for Barbourfields Stadium on March 30.\n\nhttps://youtube.com/shorts/jLrA4BzY7zwAs the two teams prepare to meet at Barbourfields Stadium after the international break, Sakupwanya has sent a strong warning to Highlanders.We are going to Bulawayo. We are definitely winning that one and the scoreline will be 4-0, said Sakupwanya.Sakupwanya has also confidently predicted a top-five finish for his expensively assembled side this season, expressing his firm belief that the club will go on to win the championship next season.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-20-at-16.10.31.jpeg",
            "description": "Innocent Kurira SCOTTLAND FC owner, Pedzisayi “Scott” Sakupwanya, has boldly predicted a 4-0 victory over Bulawayo giants Highlanders FC in their upcoming Castle Lager Premier Soccer League date set for Barbourfields Stadium on March 30. https://youtube.com/shorts/jLrA4BzY7zw As the two teams prepare to meet at Barbourfields Stadium after the international break, Sakupwanya has sent a strong […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        },
        {
            "title": "Bubi District retains NASSAH Provincial title",
            "url": "https://www.chronicle.co.zw/bubi-district-retains-nassah-provincial-title/",
            "content": "Sikhumbuzo Moyo at Manjolo High School in Binga\n\nBUBI district has ascertained its dominance in Matabeleland North athletics by retaining their inter district National Association of Secondary School Heads provincial title.The two day event was held at Manjolo High School where the province also selected its provincial team to do duty at the national finals set for Chipadze High School in Bindura, Mashonaland Central province from April 1-4.Bubi garnered 25 gold and 14 silver and bronze medals respectively, two gold medals more than runners up Lupane who along with Binga had the highest silver medals at 20.\n\nThe provincial athletes managed 14 bronze medals.In third position was Umguza with 16 gold, 14 silver and eight bronze medals.Hwange came fourth with 15 gold, eight silver and 17 bronze medals and coming fifth was Tsholotsho with eight gold, 17 silver and 21 bronze medals.Hosts Binga came sixth with seven gold and 15 bronze.Occupying last position was Nkayi with seven gold and silver medals as well as 11 bronze medals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-20-at-15.41.14-1-1.jpeg",
            "description": "Sikhumbuzo Moyo at Manjolo High School in Binga BUBI district has ascertained it’s dominance in Matabeleland North athletics by retaining their inter district National Association of Secondary School Heads provincial title. The two day event was held at Manjolo High School where the province also selected its provincial team to do duty at the national […]",
            "time": "21:07",
            "date": "20 Mar 2025"
        }
    ]
}