{
    "news": [
        {
            "title": "Zifa announces women’s Under-17 and 20 sides",
            "url": "https://www.chronicle.co.zw/zifa-announces-womens-under-17-and-20-sides/",
            "content": "Zimpapers Sports Hub\n\nZIFA have announced two womens national junior teams to take part in international engagements next month.The Under-17s to be coached by Lindiwe Ndlovu, whose assistant will be Yohane Chikaola and with Choice Dambuza as manager will be taking part in the Cosafa Championships in Namibia next month.\n\nWith the Under-20s, the junior team was expected in camp on Monday despite Zifa announcing both on Saturday.In a statement, Zifa said they delayed announcing the team as they were communicating with clubs and players first.\n\nWe held on to the announcement until such a time we were sure the clubs and players had responded to the call up by acknowledging, said Zifa Media on Tuesday afternoon.Zifa have also confirmed Garthly Chipuka as Under-20 head coach and they are preparing for a World Cup qualifier in Rwanda next month.\n\nWinners of the Zimbabwe versus Rwanda tie will face Nigeria.He is assisted by Irene Mwanza of Victoria Falls Herentals and Alice Ruzani. Kimberley Chigwedere is the fitness and conditioning coach with Edith Gowere as manager.\n\nThe selectors have cast their net countrywide and even picked up some players based abroad.Under-17 Cosafa Team1. Chitsa Yolanda (Maningi), 2. Nyoni Talent (MPOSA), 3. Mugute Shantel (Scottland), 4. Kanyuru Hazel (Rufaro High), 5. Giwa Gladys (Rufaro High), 6. Neya Faliosa (Lobengula), 7. Mukandla Rosemarry (Las Palmas), 8. Tunduwe Tadiwa (Football Academy Trust), 9. Gambiza Tatenda (MPOSA), 10. Chinyoka Alicia (FC Platinum), 11. Khumalo Chiedza (MPOSA), 12. Makoni Tawananyasha (FC Porto Academy), 13. Muyambo Itai (Faithdrive), 14. Nyamucherera Ivy (COSA), 15. Brownd Ronica (Faithdrive), 16. Chisuro Perpetua L (Faithdrive), 17. Chipoya Shalom (COSA), 18. Chibvongodze Natasha (Rufaro High), 19. Munyanduki Mya (West Ridding Girls FC, UK), 20. Genti Merian (Football Academy Trust), 21. Nyakuchena Tanyaradzwa (Brighton & Hove Albion, UK), 22. Zvinoira Anotidaishe (Faithdrive), 23. Gwenzi Miriam (Faithdrive), 24. Mutonho Shyline, 25. Kuwanda Akanakaishe (Faithdrive), 26. Tshingila Cleopatra (Somvubu High)TECHNICALHead Coach: Lindiwe NdlovuAssistant Coach: Yohane ChikaolaManager: Choice DambuzaUnder-201. Mberende Blessing (Chapungu), 2. Nyangani Emily (Ngezi Platinum), 3. Semba Nadia (Correctional)4. Nyongo Chido (Harare City), 5. Muzembiwa Tafadzwa (Maningi), 6. Mwarehwa Amanda.M (Harare City), 7. Bandason Plaxina (COSA), 8. Chirinda Cotlida (Faithdrive), 9. Kondo Bethel (Faithdrive), 10. Dangirwa Dadisai.S (Cranborne Royals), 11. Chihwena Passion (Chapungu), 12. Mhambi Michelle.T (Rufaro High), 13. Migeri Marylin.T (Scotland), 14. Ncube Anitha.B (Faithdrive), 15. Chikumba Beauty (Black Rhinos), 16. Johnson Saliah (San Domenico, USA), 17. Mhlalauli Sandra (MPOSA), 18. Ndlovu Patience (MPOSA), 19. Siyakurima Sandra (FC Platinum), 20. Kanyumbo Beatrice (FC Platinum), 21. Vurumundu Tracy (FC Platinum), 22. Njere Antonio (Las Palmas), 23. Donga Nomqhele (MPOSA), 24. Mpofu Ntokozo (Lobengula), 25. Dube Tasha (Sheasham), 26. Goronga Faith (Sheasham), 27. Magara Sithandweyinkosi (Highlanders), 28. Makaonesu Monica (FC Platinum), 29. Mbulawa Linda (Las Palmas),30. Munaro Nolwazi (Lobengula)TECHNICAL TEAMHead Coach: Garthly ChipukaAssistant Coach: Irene MwanzaGoalkeepers Coach: Alice RuzaniFitness & Conditioning Coach: Kimberely ChigwedereTeam Manager: Edith Govere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-22-at-17.59.43.jpeg",
            "description": "Zimpapers Sports Hub ZIFA have announced two women’s national junior teams to take part in international engagements next month. The Under-17s to be coached by Lindiwe Ndlovu, whose assistant will be Yohane Chikaola and with Choice Dambuza as manager will be taking part in the Cosafa Championships in Namibia next month. With the Under-20s, the […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Truck driver, passenger nabbed after being found with Broncleer",
            "url": "https://www.chronicle.co.zw/truck-driver-passenger-nabbed-after-being-found-with-broncleer/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe countrys security agents have arrested a truck driver and his passenger after they were found with an assortment of prohibited drugs worth US$16,400 that they had smuggled from South Africa.\n\nThe arrest is part of the continuous crackdown by the Government on drug peddlers.\n\nA special unit has already been set up at the Beitbridge border post to deal with drug peddlers and smugglers between Zimbabwe and South Africa.\n\nIn the latest case, Charles Gumbo (56) a truck driver from Chitungwiza and Witness Chinemo of Mabelreign in Harare were nabbed on Independence Day.\n\nThey have since appeared before Beitbridge magistrate Mr Mbonis Kaweni charged for contravening a section of the Medicines and Allied Substances Control Act.\n\nGumbo and Chinemo were remanded in custody to April 29 pending trial.\n\nProsecutor, Mr Ronald Mugwagwa told the court that on 18 April, the two were travelling to Harare in a South African-registered truck that was being driven by Gumbo.\n\nThey were stopped at a security checkpoint along the Beitbridge to Masvingo highway during a routine anti-smuggling operation.\n\nA search of the vehicle was then carried out, leading to the discovery of a contraband of Broncleer Cough Syrup with a street value of USD 16 400.00.\n\nGumbo and Chinemo were subsequently arrested and the unregistered medicine was seized.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-22-at-17.11.18_5a107b01-679x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The country’s security agents have arrested a truck driver and his passenger after they were found with an assortment of prohibited drugs worth US$16,400 that they had smuggled from South Africa. The arrest is part of the continuous crackdown by the Government on drug peddlers. A special unit has already been […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Bulawayo doctor acquitted in US$38,500 maintenance case",
            "url": "https://www.chronicle.co.zw/bulawayo-doctor-acquitted-in-us38500-maintenance-case/",
            "content": "Trish Mukwazo\n\nA prominent Bulawayo medical practitioner, Dr Nkonzo Ndebele, has been acquitted of charges relating to the non-payment of US$38,500 in child maintenance.\n\nDr Ndebele (59), of Bellevue suburb, appeared before Bulawayo magistrate Mr Chellenge Mahembe, facing allegations of failing to comply with a court-ordered maintenance payment. However, the court ruled in his favour, citing legal technicalities arising from Zimbabwes evolving currency policies.\n\nIn delivering his judgment, Mr Mahembe explained that the original maintenance order, issued in 2015, was denominated in US dollars, the legal tender in Zimbabwe at the time.\n\nIt should be noted that in 2015, Zimbabwe was using the US dollar as legal tender, and the court ordered the accused to pay maintenance in that currency, said Mr Mahembe.\n\nAlthough it is clear the accused did not consistently make payments, the court has considered the impact of various statutory instruments enacted since 2019, specifically SI 142 of 2019, which reintroduced the Zimbabwean dollar as the sole legal tender, and SI 33 of 2019, which, under Section 4(1)(d), equated RTGS dollars to US dollars at a 1:1 rate.\n\nThe magistrate noted that the complainant had failed to demonstrate how the arrears amount of US$38,500 was calculated, given the significant changes in monetary policy over the years. He further pointed out that the complainant should have applied for a variation of the original maintenance order under Section 8 of the Maintenance Act, to reflect the currency transition.\n\nThe State has not managed to prove the arrears beyond reasonable doubt. In a criminal matter, the burden is on the State to prove its case beyond reasonable doubt. It therefore follows that the accused is found not guilty and is acquitted, Mr Mahembe ruled.\n\nThe complainant, Ms Grace Ndlovu (49), had taken Dr Ndebele to court, accusing him of failing to pay maintenance for their daughter, an amount she claimed had accumulated to US$38,500 between December 2017 and December 2024.\n\nIn his defence, Dr Ndebele stated that he had co-founded a business, Quick Ketch Enterprises, with his wife and had invited Ms Ndlovu to assist in running the company, appointing her as a co-director.\n\nHe testified that in 2010, the landlord of their business premises offered an alternative location, and Ms Ndlovu, unbeknownst to him, signed a lease agreement in the name of her own company, Maiden Form Enterprises (Pvt) Ltd.\n\nDr Ndebele further claimed that Ms Ndlovu later purchased the premises using proceeds generated from Quick Ketch Enterprises.\n\nFollowing the issuance of the maintenance order in August 2015, which required him to pay US$500 per month (Order M1136/13), Dr Ndebele asserted that the two parties had agreed Ms Ndlovu would use business profits from Quick Ketch Enterprises to cover the maintenance payments.\n\nHe also stated that he had since been removed as a co-director and that the company was no longer profitable, leaving him financially incapacitated.\n\nIt was alleged that he had accrued maintenance arrears totalling US$38,500 over a seven-year period. However, the court found that the charges could not be sustained under current legal and financial frameworks.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Trish Mukwazo A prominent Bulawayo medical practitioner, Dr Nkonzo Ndebele, has been acquitted of charges relating to the non-payment of US$38,500 in child maintenance. Dr Ndebele (59), of Bellevue suburb, appeared before Bulawayo magistrate Mr Chellenge Mahembe, facing allegations of failing to comply with a court-ordered maintenance payment. However, the court ruled in his favour, […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Junior Sables coach sees defeat as learning curve ahead of Tunisia match",
            "url": "https://www.chronicle.co.zw/junior-sables-coach-sees-defeat-as-learning-curve-ahead-of-tunisia-match/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nZIMBABWE mens national Under-20 rugby team head coach, Shaun De Souza has said that their defeat against Namibia in their opening match of the 2025 Barthes Trophy was a learning curve.The Junior Sables suffered a 41-22 defeat at the hands of the young Welwitschias, their first loss in four years.\n\nDe Souza said they will take learnings from that encounter ahead of the second match on Wednesday where they will face Tunisia at Old Hararians Sports Club.We have lost our second game in the Barthes Trophy since 2022. This was not easy to take knowing the plans one puts in place as a coach with a dream and a passion thats Godsend. We let ourselves down in the game against Namibia, this was the biggest score against us in my tenure as Head coach and our first loss to Namibia in four years.\n\nThis team, in my opinion, has the potential to be one of the top two sides I have ever coached. I know time is always a factor, not everyone shares a coachs vision, yes everyone has a dream not everyone can see the dream with you.\n\nWe have taken this set back and have reflected on our mishaps. Tactically, come game two on Wednesday versus Tunisia you will see a transformed team. Come out in your numbers to Old Hararians Sports Club and support the Zimbabwe under 20 Junior Sables, said De Souza.\n\nAs Zimbabwe Tourism Authority (ZTA) ambassadors, De Souza added that the Barthes Trophy offers the opportunity to market Zimbabwes hospitality.\n\nThe Deputy Minister of tourism Mr. Tongai Mnangagwa says the Barthes Trophy tournament gives Zimbabwe the opportunity to show the rugby community our country as we welcome Namibia, Kenya and Tunisia. Support our boys, ZTA Tourism ambassadors, as they bounce back from defeat on Saturday.\n\nTo all Tunisians, Kenyans and Namibians in Zimbabwe, come out and support your teams to make them feel at home. All roads lead to Old Hararians Sports Club, said De Souza.Wednesdays match starts at 15.00pm\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-22-at-17.28.49_5660ef82-680x380.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub ZIMBABWE men’s national Under-20 rugby team head coach, Shaun De Souza has said that their defeat against Namibia in their opening match of the 2025 Barthes Trophy was a learning curve. The Junior Sables suffered a 41-22 defeat at the hands of the young Welwitschias, their first loss in four […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "‘Resist destabilisation efforts’-Africa Youth Congress urges Zimbabweans",
            "url": "https://www.chronicle.co.zw/resist-destabilisation-efforts-africa-youth-congress-urges-zimbabweans/",
            "content": "Joseph Madzimure,Zimpapers Politics Hub\n\nMembers of the African Youth Congress who were in Zimbabwe to attend the 45th Independence Day celebrations have implored Zimbabweans to desist from any form of aggression against the Government under the instigation of malcontents in the form of former ZANU PF Central Committee Member Blessed Geza and his foreign handlers.\n\nDuring their visit, the delegation visited companies affected by the impact of sanctions such as Zisco Steel among others.\n\nThey also visited farms owned by youthful farmers who benefited from the land reform programme.\n\nSpeaking before their departure at the Robert Gabriel Robert Mugabe International Airport yesterday, the delegations leader, Mr Vincent Sakala from Zambia, said Zimbabweans should not be hoodwinked by some rogue elements who are being used by their handlers in foreign land to destabilise the country.\n\nWe have reports of some rogue elements who are being used to unsettle an elected Government from power. It is high time for the youth to continue with their day-to-day activities to improve the well-being of their country. It is only the youth who can shape the future of this country. Whose benefit will it be for one turn against the Government? Lets work hard towards the development of our countries as youth, said Mr Sakala.\n\nTurning to their visit, Mr Sakala said they were impressed with what they saw in Zimbabwe.\n\nWe came here to join our colleagues in celebrating their independence. We also went to Ziscosteel in Kwekwe to appreciate the impact of sanctions that were imposed by the countrys detractors.\n\nWe saw how a steel plant that used to employ about 7,500 workers and 150,000 casual workers was brought down to rubble, he said.\n\nHe stated that sanctions are not just inhuman, but they are an injustice against humanity, and must be lifted.\n\nWe also want to squash the false narrative that indigenous Zimbabweans are not managing their land.\n\nIts a false narrative that the Western powers would want to push so that they achieve their agenda of reversing the land reform programme. Contrary to the false narrative being pushed, we visited a number of farms to witness how productive they are.\n\nHe highlighted that as African youth, they will stand with Zimbabwe shoulder to shoulder in good and bad times.\n\nHe commended President Mnangagwa for showing resilience under the difficult circumstances.\n\nThey are still able to lead from the front and push the development agenda through the mantra Nyika Inovakwa nevene vayo. Only Zimbabweans will build this country.\n\nAs youth, we will push until we attain economic freedom during our lifetime, he said.\n\nAfrican Youth Congress chair Cde Taurai Kandishaya said the visiting delegation appreciated what they saw in Zimbabwe.\n\nCde Kandishaya also took a swipe at Geza, saying Zimbabweans cannot be told what to do by a fugitive.\n\nYou know; bitterness is the result of failure. Youths cannot be told what to do with a fugitive, one who has failed in his life. The approach of Geza is that of a person who is driven by personal ambition, echoed Cde Kandishaya.\n\nGeza as a war veteran is a beneficiary of the Government policies\n\nSo we dont listen to individuals like Geza. We cannot go for a shut down. We will be shutting down our own life. Its not Gezas life that you shut down. So they must just leave us alone, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Students-have-arrived-from-Namibia-and-Zambia-680x380.jpg",
            "description": "Joseph Madzimure, Zimpapers Politics Hub Members of the African Youth Congress who were in Zimbabwe to attend the 45th Independence Day celebrations have implored Zimbabweans to desist from any form of aggression against the Government under the instigation of malcontents in the form of former ZANU PF Central Committee Member Blessed Geza and his foreign handlers. […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Agriculture ministry showcases new technologies, innovations to boost value chains",
            "url": "https://www.chronicle.co.zw/agriculture-ministry-showcases-new-technologies-innovations-to-boost-value-chains/",
            "content": "Raymond Jaravaza, Online Reporter\n\nTHE Ministry of Lands, Agriculture, Water, Fisheries and Rural Development has stressed the need to embrace new technologies, innovations and mechanisations to accelerate the sectors transformation as well as revitalising economic value chains.\n\nThese are part of its comprehensive plans and key exhibitions expected to drive results at the ongoing 65th edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo.The premier trade showcase kicked off on a higher note on Monday and will end on Saturday.\n\nThrough exhibitors drawn from different directorates, the ministry will showcase agriculture technologies, innovations, mechanised equipment, irrigation and systems, and all products related to agriculture and value addition, said the ministry in its brief shared with the media.The ministry will also showcase the demonstrations of new technologies and agriculture practices, innovation and\n\nIdeas, with clients as well as its policies, programmes and projects.Raising awareness on agriculture value chains, commodity markets, investment opportunities are also at the core of the ministrys programmes and master plan.\n\nAs the ZITF progresses, the ministry has said it will strongly leverage on networking opportunities to exchange ideas, build strategic and sustainable trade, investment, and marketing partnerships.As part of expected results after ZITF, the ministry hopes to have forged alliances, partnerships as well as business linkages.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gnhb-680x360.jpg",
            "description": "Raymond Jaravaza, Online Reporter THE Ministry of Lands, Agriculture, Water, Fisheries and Rural Development has stressed the need to embrace new technologies, innovations and mechanisations to accelerate the sector’s transformation as well as revitalising economic value chains. These are part of its comprehensive plans and key exhibitions expected to drive results at the ongoing 65th […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Pope Francis’s funeral to be held on Saturday, world leaders expected",
            "url": "https://www.chronicle.co.zw/pope-franciss-funeral-to-be-held-on-saturday-world-leaders-expected/",
            "content": "Pope Francis, 88, died unexpectedly on Monday after suffering a stroke and cardiac arrest, the Vatican said, ending an often turbulent reign in which he repeatedly clashed with traditionalists and championed the poor and marginalised.\n\nThe pontiff spent five weeks in hospital earlier this year suffering from double pneumonia. But he returned to the Vatican almost a month ago and had seemed to be recovering, appearing in St Peters Square on Easter Sunday.\n\nThe Vatican on Tuesday released photographs of Francis dressed in his vestments lying in a wooden coffin in the chapel of the Santa Marta residence, where he lived during his 12-year papacy.\n\nHis body will be taken into the adjacent St Peters Basilica on Wednesday morning in a procession led by cardinals, allowing the faithful to pay their last respects to the first Latin American pope.\n\nUS President Donald Trump, who clashed repeatedly with the pope about immigration, said he and his wife would fly to Rome for the service.\n\nAmong other heads of state set to attend are Javier Milei, President of Pope Francis native Argentina, Brazilian President Luiz Inacio Lula da Silva and Ukrainian President Volodymyr Zelenskiy, according to a source in his office.\n\nIn a break from tradition, Francis confirmed in his final testament, released on Monday, that he wished to be buried in Romes Basilica of Saint Mary Major and not St Peters, where many of his predecessors were laid to rest.  REUTERS\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Pope-Francis-B-W.jpg",
            "description": "Pope Francis’ funeral will be held on Saturday in St Peter’s Square, Vatican City, Roman Catholic cardinals decided on Tuesday, setting the stage for a solemn ceremony that will draw leaders from around the world. Pope Francis, 88, died unexpectedly on Monday after suffering a stroke and cardiac arrest, the Vatican said, ending an often […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Who could be the next pope? Some possible candidates",
            "url": "https://www.chronicle.co.zw/who-could-be-the-next-pope-some-possible-candidates/",
            "content": "The Reuters Tariff Watch newsletter is your daily guide to the latest global trade and tariff news. Sign uphere.\n\nReporting and writing by Philip Pullella, Crispian Balmer, Alvise Armellini, Joshua McElwee in Rome and Chris Scicluna in Malta Editing by Frances Kerry\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/EV3Y5P22GRKYFKQTCLBOPGVFAY-680x380.jpg",
            "description": "VATICAN CITY, April 21 (Reuters) – Predict who the next pope will be at your peril. An old Italian saying warns against putting faith, or money, in any presumed front-runner ahead of the conclave, the closed-door gathering of cardinals that picks the pontiff. It cautions: “He who enters a conclave as a pope, leaves it as a cardinal”. […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Road accidents spike during 2025 Easter holidays, but fatalities decline",
            "url": "https://www.chronicle.co.zw/road-accidents-spike-during-2025-easter-holidays-but-fatalities-decline/",
            "content": "Online Reporter\n\nROAD traffic accidents surged during this years Easter and Independence holidays compared to 2024, though fatalities saw a marginal decrease, according to the latest statistics released by the Zimbabwe Republic Police (ZRP).\n\nIn a statement, National Police spokesperson Commissioner Paul Nyathi said there were a total of384 road accidentsrecorded this year, marking a34 percent increasefrom the286 incidentsreported in 2024.\n\nHowever, he said, fatal crashes dropped from26 to 21, while the number of deaths slightly declined from27 to 24.\n\nDespite fewer fatalities, injuries rose significantly, with178 people injuredin 2025 compared to159last year. The overall rise in accidents is attributed to reckless driving, speeding, and hit-and-run incidents, said Commissioner Nyathi.\n\nHe said three fatal hit-and-run accidents were reported this year, including one along theHarare-Bulawayo Road, where a pedestrian was struck and killed by an unidentified vehicle.\n\nCommissioner Nyathi said another incident inMutokoclaimed the life of a pedestrian hit by a fleeing motorcyclist.\n\nOne of the deadliest crashes occurred onApril 21along theHarare-Bulawayo Road, where a Toyota Hiace kombi carrying 18 passengers overturned, killingfourand injuring14, said Commissioner Nyathi.\n\nHe said as police they reiterate calls for drivers tostop, assist victims and report accidentsto authorities.\n\nMotorists must observe road rules to safeguard lives, said Commissioner Nyathi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/koliopi.jpg",
            "description": "Online Reporter  ROAD traffic accidents surged during this year’s Easter and Independence holidays compared to 2024, though fatalities saw a marginal decrease, according to the latest statistics released by the Zimbabwe Republic Police (ZRP). In a statement, National Police spokesperson Commissioner Paul Nyathi said there were a total of 384 road accidents recorded this year, […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        },
        {
            "title": "Would you spend R4 500 on a rooster?",
            "url": "https://www.chronicle.co.zw/would-you-spend-r4-500-on-a-rooster/",
            "content": "Raymond Jaravaza, Online Reporter\n\nA LOCAL chicken breeder broke the bank after he bought a rooster worth R4 500 (approximately US$250) from South Africa to improve the genetic pool in his chicken breeding business.\n\nMr Taffy Chiwashira runs the chicken breeding business from his Kumalo suburb home.\n\nHe first ventured into the chicken business in 2014, keeping road runners before going into exotic breeds.\n\nIt took the farmer who started breeding the Frizzle Buff Orpington about 12 years to come up with this breed that I bought for R4 500. Chicken breeding is a delicate business that requires perseverance, hard work and dedication, Mr Chiwashira told Chronicle on Tuesday afternoon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-22-at-15.46.31-680x380.jpeg",
            "description": "  Raymond Jaravaza, Online Reporter A LOCAL chicken breeder broke the bank after he bought a rooster worth R4 500 (approximately US$250) from South Africa to improve the genetic pool in his chicken breeding business. Mr Taffy Chiwashira runs the chicken breeding business from his Kumalo suburb home. He first ventured into the chicken business […]",
            "time": "21:07",
            "date": "22 Apr 2025"
        }
    ]
}