{
    "news": [
        {
            "title": "‘Unity Accord pillar of national cohesion’",
            "url": "https://www.chronicle.co.zw/unity-accord-pillar-of-national-cohesion/",
            "content": "Nqobile Tshili,[emailprotected]\n\nPRESIDENT Mnangagwa has described the 1987 Unity Accord as the cornerstone of Zimbabwes sustainable and inclusive development, which provides a strong foundation for national cohesion and peace in line with the Second Republics development agenda of leaving no one and no place behind.\n\nZimbabwe annually commemorates Unity Day on December 22 to mark the signing of the Unity Accord between Zanu (PF), led by the late former President Robert Mugabe and PF-Zapu, led by the late Vice-President Dr Joshua Nkomo. The agreement ended the post-independence conflict of the early 1980s, ushering in an era of peace that endures today.\n\nWhile the Unity Accord is credited with addressing political challenges, some social issues stemming from the conflict remained unresolved. President Mnangagwas Second Republic has taken further steps to address these challenges, including mandating traditional leaders to spearhead the Gukurahundi Community hearings as the Second Republic takes a bold step towards finding a lasting solutions to the Gukurahundi disturbances. Government is presently procuring resources to facilitate these hearings, which aim to address the lingering social effects of the conflict.\n\nIn October 2022, President Mnangagwa launched a manual on the Gukurahundi community engagement processes by chiefs including a report on their consultative meetings. The manual, which is a product of inclusive engagements between chiefs and various stakeholders, is a culmination of traditional leaders meetings with President Mnangagwa, which started in March 2019. The document will guide chiefs on how to conduct the consultative and engagement process.\n\nIn his Unity Day speech on Saturday, President Mnangagwa acknowledged that the post-independence unrest disrupted Zimbabwes development trajectory. However, he emphasised that the signing of the Unity Accord paved the way for sustainable peace and national development.\n\nThe late President Mugabe and the late Vice-President Nkomo hold hands after signing the Unity Accord on 22 December, 1987\n\nThe accord ushered in unity, peace and stability in our great motherland, Zimbabwe, and laid a firm foundation for national cohesion and development that subsists to this day. Those early years of post-independence unrest unnecessarily delayed our socio-economic growth and cast a dark cloud of disharmony among our people, said President Mnangagwa.\n\nHe said Unity Day serves as a reminder of the collective duty to uphold peace, unity and love as the guarantors of sustainable development.This day, therefore, will forever be etched on our national calendar as a sombre reminder of our individual and collective duty to defend, promote and consolidate the grand national heritage of peace, unity and love. This is the guarantor for sustainable multi-pronged development, said President Mnangagwa.\n\nSince the 1987 Unity Accord, our nation has stood firm and united even in difficult times.\n\nPresident Mnangagwa said the Second Republic is leveraging the prevailing peace to promote inclusive development, ensuring that no one and no place is left behind.\n\nPresently, our nation is moving forward with fervent hope and determination to build a more prosperous future for all Zimbabweans, leaving no one and no place behind. We remain inspired to continue demonstrating unparalleled national strength, resilience and unflinching patriotism to our country, he said.\n\nPresident Mnangagwa commended Zimbabweans for their resilience in the face of external attempts to sow division, noting that self-belief and confidence remain key to the countrys progress.\n\nHe reiterated his administrations commitment to transforming Zimbabwe into an upper middle-income economy by 2030.\n\nThis national consciousness is now imprinted in our individual and collective mindset, embodied by our national development philosophy: Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo, he said.\n\nPresident Mnangagwa added that the policies and programmes of the Second Republic are driving increased production and productivity, propelling the country toward Vision 2030.\n\nBrick by brick, stone upon stone and step by step, we are unapologetically marching forward. As the people of Zimbabwe, we are entrenching our identity as an independent, sovereign, free, united and truly liberated African people, he declared.\n\nPresident Mnangagwa highlighted the implementation of the devolution policy as a key driver of inclusive development. The policy has facilitated the funding of development projects across all districts, including the construction of clinics, schools, roads and the installation of piped water systems in rural areas. Additionally, the Government has increased social protection for vulnerable communities, further demonstrating its commitment to inclusive growth. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jyukiyuiu-680x380.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw PRESIDENT Mnangagwa has described the 1987 Unity Accord as the cornerstone of Zimbabwe’s sustainable and inclusive development, which provides a strong foundation for national cohesion and peace in line with the Second Republic’s development agenda of leaving no one and no place behind. Zimbabwe annually commemorates Unity Day on December 22 to […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "Festive season rush hits Bulawayo’s bus termini",
            "url": "https://www.chronicle.co.zw/festive-season-rush-hits-bulawayos-bus-termini/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nMAJOR bus termini in Bulawayo were bustling with activity yesterday as scores of travellers jostled to board long-distance buses to their rural homes ahead of the Christmas holiday.\n\nThe festive season is in full swing, with Unity Day celebrations marking the start of the holiday period across the country yesterday. The hustle and bustle at Bulawayos bus termini reflected the excitement and determination of travellers eager to spend the holidays with loved ones in their rural homes.\n\nWhen a Chronicle news crew visited long-distance bus termini in Makokoba, Entumbane and Nkulumane suburbs, the scenes were vibrant as passengers sought transport to destinations such as Binga, Nkayi, Tsholotsho, Plumtree, Filabusi and Gwanda.\n\nMost passengers expressed excitement about reuniting with their families for Christmas and New Year celebrations.\n\nUnlike in previous years when bus operators took advantage of the high demand for transport to hike fares, this year fares have not been increased.\n\nWe could make more money by increasing fares during this busy period but we must not forget that these are the same people who support our businesses throughout the year, said Mr Michael Khabo, a CAG bus driver on the Bulawayo-Nkayi route.\n\nMr Khabo said his companys management had instructed crews not to increase the fares despite the high demand for transport.\n\nOur customers have been loyal to us and its unfair to take advantage of the high demand for transport during the Christmas season to increase the fares, he said.A trip from Bulawayo to Nkayi costs US$10, with additional charges for luggage. At Renkini Bus Terminus, Mr Emmanuel Phiri, who was transporting a newly purchased scotch cart to his rural home in Gwelutshena, Nkayi, shared his excitement.\n\nThey charged me US$60 for the scotch cart. Ive been saving for months to buy it, and Im happy to finally take it home, he said. Vendors at Old Renkini Bus Terminus also enjoyed brisk business, capitalising on the surge in travellers.\n\nAt Entumbane Complex Bus Terminus, buses to Lupane, Binga, and Tsholotsho were packed with passengers, many of whom had bought groceries for their families back home.\n\nMiss Lisa Bukhosi, travelling to Lupanes Sivalo Village, said: I bought sugar, cooking oil, mayonnaise, flour and rice so that my family can enjoy on Christmas. Ill get bread from the local shops at Sivalo. Christmas and New Year are about family, and I cant wait to see my grandparents.\n\nHowever, some travellers, especially those heading to Binga, faced challenges due to high demand and limited transport availability. Mrs Elina Zombe, travelling with her three children, had been waiting for a bus since early morning.\n\nThe bus we usually use broke down on its way from Binga last night. Theyve promised it will arrive by noon but if not, well take any bus that can drop us at Binga Centre and then we look for transport to our area, she said.\n\nA Galaxy Bus Company driver, who identified himself as Kudzi, said business had picked up significantly since Friday.\n\nThis time of the year is always busy. We have another bus on standby for passengers travelling on the Bulawayo-Victoria Falls route, he said.\n\nAt Nkulumane Complex Bus Terminus, a similar rush was observed, with passengers heading to places such as Matopo, Plumtree, Filabusi and Gwanda.\n\nMr Isaac Mlalazi, travelling to Plumtree, said he preferred buses for their convenience, especially when carrying heavy luggage. It costs me US$3 or R50 to get to Plumtree. Its affordable and convenient, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/RTGTHTY.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com MAJOR bus termini in Bulawayo were bustling with activity yesterday as scores of travellers jostled to board long-distance buses to their rural homes ahead of the Christmas holiday. The festive season is in full swing, with Unity Day celebrations marking the start of the holiday period across the country yesterday. The hustle […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "‘Local is Lekker’ initiative promotes Zimbabwean products",
            "url": "https://www.chronicle.co.zw/local-is-lekker-initiative-promotes-zimbabwean-products/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nLOCAL producers have praised Budget Cash and Carry for its continued support through the Local is Lekker programme, which showcases locally manufactured products and promotes the Governments import substitution strategy.\n\nThe initiative, hosted at the Budget Cash and Carry in Belmont industrial area in Bulawayo, features exhibition stands displaying a wide range of products made in Zimbabwe. It aims to encourage consumers to buy local products which are of high quality compared to imports.\n\nSpeaking at the Local is Lekker event on Saturday, exhibitors expressed gratitude for the platform, which they said helps them expand their market reach.\n\nBudget Cash and Carry is helping us immensely. Every time we display our products here, we interact with customers and receive positive feedback, said Mr Fahad Maniyar from Kreckle Foods.\n\nThe event attracted both emerging businesses seeking market penetration and established enterprises introducing new products.\n\nAllied Security Company operations manager, Mr Simon Bota, highlighted the significance of the initiative.\n\nIts a good move because it gives us exposure, people can get more information about Allied Security as a provider of security guards and electronic security systems, he said.\n\nFinancial service providers like NMB Bank also participated.\n\nWhat is being done by Budget Cash and Carry around here is commendable, there are other businesses that have new products that are not yet on the market so they are given an opportunity to try and showcase these products, said NMB Bulawayo branch manager Ms Ntombizami Nyathi.\n\nShe said NMB has a lot of financial initiatives that are targeting micro and women-led businesses. Budget Cash and Carry managing director, Mr Raeez Lunat, said the programme plays a critical role in fostering local economic growth.We are trying to promote local products and assist some companies to launch new products, he said.\n\nNew businesses like Chemicare are already reaping the benefits of the initiative.\n\nWith Budget Cash and Carrys help, weve connected with local customers and are gaining popularity, said Mr Dennis Mtoki from Chemicare. Mamas Sauces representative, Ms Thobile Nkomo, echoed similar sentiments.\n\nThe quality of local products is excellent but consumers are unaware of their availability. This initiative bridges that gap and allows us to interact directly with customers, she said.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Budget-Cash-And-Carry-Promotion-1.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com LOCAL producers have praised Budget Cash and Carry for its continued support through the “Local is Lekker” programme, which showcases locally manufactured products and promotes the Government’s import substitution strategy. The initiative, hosted at the Budget Cash and Carry in Belmont industrial area in Bulawayo, features exhibition stands displaying a wide range […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "RPDA triumphs at the International Schools Debate Championships",
            "url": "https://www.chronicle.co.zw/rpda-triumphs-at-the-international-schools-debate-championships/",
            "content": "Langalakhe Mabena\n\nTHE Royal Pact Debate Academy (RPDA) debate team were crowned the International Schools Debating Champions at a tournament which was held in Cape Town, South Africa which ran from December 9 to 13.\n\nThe team was representing Zimbabwe at a tournament which saw more than 15 teams from different countries participating.\n\nLed by high profile coach Maison Maphosa, RPDA members were Makaita Makwanya (Harare), captain of the team,Tanatswa Moyo (Harare), Kudzanai Munyanyi (Mashonaland Central), Tadiwanashe Manyemwe (Masvingo) as well as Gabriel Marumahoko (Matabeleland South).\n\nCoach Maphosa said he is happy with the teams achievements as it represented Zimbabwe with great pride.Following a notably intense and highly competitive tournament, our team impressively managed to break first in the senior division with six wins in seven matches.\n\nThe team progressed to quarter-finals and won convincingly and in the semi-finals we met a team from Kenya, it was an intense yet enlightening match. However, we won unanimously.\n\nWe then met a team from South Africa in grand finals  it was an extremely competitive match and we won unanimously again opposing the idea that political protests have failed African states, said Maphosa.\n\nTeam members also managed to win individual accolades at the tournament. The captain of the team Moyo was crowned the Overall Best Debater of the tournament out of 160 students.\n\nMakwanya, Marumahoko and Munyanyi were awarded the Second, Third and Fourth Best Debater of the tournament accolades respectively.\n\nManyemwe was awarded the Seventh Best Debater of the tournament. Meanwhile, the Zimbabwe National Debate Team has named the 2025 squad which will represent the country in different regional and international tournaments next year.\n\nThe team, which comprises 14 students from different schools, was chosen at the national debate tournament which was held in Bulawayo and Harare.\n\nThe team will do duty for the country at the World debate championships to be held in Panama, Asian Championships to be held in Thailand and the African Championships set for Kenya, among other major tournaments.\n\nStudents who made it to the national team are Tanatswa Moyo (St Johns College), Mthokozisi Dube (Founders High School) Chuhan Cheng and Makaita Makwanya (both from Arundel School), Kudakwashe Mahambo (Gifford High School), Divine Rabvukwa and Christian Nhika (both from St Georges College), Dean Femayi and Mbonisi Nkala (both from Christian Brothers College).\n\nOther debaters who are part of the team are Zoey Simbini and Munotida Nyamanhindi (both from Dominican Convent-Harare), Brooklyn Hayter and Barry Kamanga (both from Hellenic Academy) and Gabriel Marumahoko from Falcon College.\n\nCoaches from 2024 are retained and they are expected to guide the new team to glory.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/12-4.jpg",
            "description": "Langalakhe Mabena THE Royal Pact Debate Academy (RPDA) debate team were crowned the International Schools Debating Champions at a tournament which was held in Cape Town, South Africa which ran from December 9 to 13. The team was representing Zimbabwe at a tournament which saw more than 15 teams from different countries participating. Led by […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "Economic Empowerment Bill set for gazetting in 2025",
            "url": "https://www.chronicle.co.zw/economic-empowerment-bill-set-for-gazetting-in-2025/",
            "content": "Walter Nyamukondiwa,Mashonaland West Bureau Chief\n\nTHE crafting of the Economic Empowerment Act is in the final stages, with Government planning to gazette it early next year.\n\nPresently, the Bill is with the Attorney Generals Office and seeks to address legislative gaps resulting from amendments to the Indigenisation and Economic Empowerment Act that while still wanting to see citizens involved, allows investors to come into the country.\n\nAt a workshop focused on the operations of community share ownership trusts (CSOT) held in Kadoma last week, Industry and Commerce Minister Mangaliso Ndlovu announced that provincial consultations have been conducted to develop the new Bill that will try and connect investors with the communities where they operate.\n\nHe expressed optimism about its timely gazetting.\n\nI am happy to inform you that the Ministry of Industry and Commerce is in the process of coming up with a new Economic Empowerment Act to close legislative gaps brought about by previous amendments to the Indigenisation and Economic Empowerment Act, Minister Ndlovu said.\n\nThe Bill is now with the Attorney Generals Office, and we are positive it will be gazetted during the first quarter of 2025.\n\nMinister Ndlovu emphasised the importance of community share-ownership trusts in the formulation of the industrial policy, highlighting their role in rural industrialisation.\n\nChiefs that attended the workshop suggested that the Bill should replace the word may with shall when it comes to major investors supporting their local trusts, arguing that many companies exploiting natural resources are not legally required to contribute to the trusts.\n\nOur wish is that the new Economic Empowerment Act does not give businesses the leeway to decide whether to contribute to a trust or not, said Chief Chikwaka of Goromonzi.\n\nThe word may has contributed to the failure of most community share-ownership trusts as they were not funded or supported.\n\nOf the 61 CSOTs established, only 26 received funding and support, with just six being economically viable and impactful in their communities.\n\nMashonaland West Provincial Affairs and Devolution Minister Marian Chombo spoke about the potential of the trusts to transform communities and stimulate economic development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/FGTR.jpg",
            "description": "Walter Nyamukondiwa, Mashonaland West Bureau Chief THE crafting of the Economic Empowerment Act is in the final stages, with Government planning to gazette it early next year. Presently, the Bill is with the Attorney General’s Office and seeks to address legislative gaps resulting from amendments to the Indigenisation and Economic Empowerment Act that while still wanting […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "WATCH: Bosso to appoint ambassadors",
            "url": "https://www.chronicle.co.zw/watch-bosso-to-appoint-ambassadors/",
            "content": "Lovemore Dube and Panashe Marijeni\n\nHIGHLANDERS chief executive officer Brian Moyo says former sensational winger Andrew Shue is among a long list of players the club would like to work with.\n\nHe was an exceptional player for us. One of the best and gave great value on the field and off even after retiring. Whenever he gets the chance to, we have seen photos of him in his beloved Highlanders colours, a true ambassador, said Moyo.\n\nHe said the club intends roping in some of its former players to be ambassadors who market the club wherever they are.\n\nHe is among the players we intend inviting to come on board as ambassadors as we want to grow the Bosso brand and tap in the commercial value we could extract through the images of some of these former players who are all over the world, said Moyo.\n\nShue was recently captured in a video which has since gone viral where he speaks of the magical 1990 season in which he was part of the cast of stars that guided Bosso to their first league and cup double.\n\nIn the interview Shue spoke of his time at the club and disclosed how they used muti.\n\nFor decades African football has been associated with voodoo to confuse the opposition and strengthen the user both physically and mentally.\n\nShue arrived at the beginning of 1990 as a young Maths teacher who was attached to Founders High School. He described the African science as one of the lows of his stay in an interview with a US based Zimbabwean which has gone viral.\n\nHowever, he appears to have had a buy-in as they won a double that season.\n\nI will never forget going to camp during the weekend before games. We had to stay in camp so that we wouldnt be out there partying and drinking. There was this old man who would come to camp, he would walk in and had a little package and within that package was this special muti and we would drink it as tea, put it in the bath tub and rub it on ourselves, people thought that was crazy but we won a double that year so it was special magic, said Shue.\n\nThese practices, which can include prayer, blessings and the use of amulets, are believed to provide spiritual protection and motivation, helping players overcome the pressures of competition. Additionally, rituals are deeply rooted in the cultural and spiritual identities of African communities, helping players connect with their heritage and fostering pride in their cultural background.\n\nThe then 23-year-old Shue played alongside football legends such as Peter Ndlovu, Adam Ndlovu, Rahman Gumbo, Peter Nkomo, Pernell Mckop, Benjamin Mpofu, Benjamin Nkonjera, Cleopas Dlodlo, Alexander Maseko and Mercedes Sibanda. He speaks fondly of his relationship with the fans.\n\nI will never forget that year, I was treated so well by the players and the fans. When I went to Barbourfields people would whistle and that made me feel at home, he said.\n\nAfter winning the 1990 league and cup double, Shue returned to his native United States of America. He took up acting, a field in which he already had a sister Elizabeth Shue established.\n\nHe went on to star as Billy Campbell in the popular television series, Melrose Place and also made an uncredited appearance in The Karate Kid.\n\nReflecting on his football experience, he said, I had a lot of confidence after playing for Highlanders, and that year I decided to try acting.\n\nAs African football continues to evolve, the intersection between cultural traditions and modern sport which is shifting to science remains a complex issue.\n\nWhile rituals can enhance team spirit and mental resilience, they should be carefully navigated to avoid alienating or pressuring players.\n\nThe influence of these traditional practices continues to spark debate, with both positive and negative consequences depending on the context in which they are employed.\n\nUltimately, balancing cultural heritage with professional standards is key to the continued success of African football. Shue left a mark at Bosso and there were other American players after him who played for Highlanders like Geoff Wheeler, Dereck Odwod and Kirk Fredricks.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Andrew-Shue.jpg",
            "description": "Lovemore Dube and Panashe Marijeni HIGHLANDERS chief executive officer Brian Moyo says former sensational winger Andrew Shue is among a long list of players the club would like to work with. “He was an exceptional player for us. One of the best and gave great value on the field and off even after retiring. “Whenever […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "Concern over sexual exploitation of female cross-border traders",
            "url": "https://www.chronicle.co.zw/concern-over-sexual-exploitation-of-female-cross-border-traders/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Zimbabwe Gender Commission (ZGC) has raised concerns over the sexual exploitation of female cross-border traders at the countrys ports of entry.\n\nAccording to the ZGC 2023 report tabled in Parliament, women face sexual and gender-based violence (SGBV) while attempting to smuggle goods into the country.\n\nBorder employees, smugglers and truck drivers are cited as key perpetrators, with reports of rape, robbery and coercion for sexual favours. Women using illegal entry points are particularly vulnerable as they fear arrest if they report these crimes.\n\nThe ZGC, in collaboration with the Zimbabwe Human Rights Commission, conducted an investigation at Plumtree Border Post to substantiate allegations of abuse. The investigation revealed systemic gender issues at both legal and illegal ports of entry, with the exploitation of female traders being a widespread problem.\n\nThis was a culmination of social media reports indicating the prevalence of sexual crimes of rape and various forms of GBV being perpetrated on women trying to cross the border and smuggling of commodities across the border, read the report.\n\nThis gave birth to the need to gather countrywide information as it was discovered that these were not isolated incidences and that women cross-border traders were facing systemic gender issues at ports of entry and exits.\n\nZGC said the severity of the sexual exploitation is fully documented as investigations are still ongoing.\n\nFemale cross-border traders often find themselves vulnerable to border officials who allegedly demand sexual favours in exchange for allowing them to cross without financial extortion. Truck drivers and smugglers were also identified as major perpetrators of sexual exploitation and abuse towards female cross-border traders, read the report.\n\nThe document stated that some women reported being raped by robbers while using illegal entry points. However, fear of legal repercussions or societal judgment prevents many from reporting these crimes.\n\nIt was difficult to report such cases to the police because they occurred during an illegal act. The victims feared that they would also be arrested for using undesignated ports of entry, read the report.\n\nThe report highlighted a lack of basic facilities for cross-border traders such as bathrooms and safe houses. These amenities are crucial for providing temporary shelter and protection, especially for breastfeeding mothers and deportees.\n\nIn areas like Chirundu and Kariba, where communities are located within game reserves, cross-border traders face additional risks from wildlife, including attacks by baboons, lions and elephants.\n\nThe ZGC has called on the Government to amend the Zimbabwe Gender Commission Act to include stiffer penalties for SGBV cases. The commission also recommends empowering the ZGC to fine organisations that hinder investigations and that Government should impose penalties on entities that fail to comply with constitutional gender equality provisions.\n\nIt also wants Government to come up with regulations that allow the ZGC to seek court interdicts against employers that punish workers who report sexual harassment or discrimination.\n\nThe commission says Government should also accelerate the alignment of laws with constitutional provisions on childrens rights and gender equality.\n\nThe ZGC also advocates for a review of the National Action Plan to end child marriage and stricter regulation of faith-based organisations to eradicate harmful practices.\n\nIt further recommends that the judiciary should impose punitive and deterrent jail sentences to perpetrators of all forms of gender-based violence. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/TYTT.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE Zimbabwe Gender Commission (ZGC) has raised concerns over the sexual exploitation of female cross-border traders at the country’s ports of entry. According to the ZGC 2023 report tabled in Parliament, women face sexual and gender-based violence (SGBV) while attempting to smuggle goods into the country. Border employees, smugglers and truck drivers […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "COMMENT: Banks must embrace the new land title deeds",
            "url": "https://www.chronicle.co.zw/comment-banks-must-embrace-the-new-land-title-deeds/",
            "content": "PRESIDENT Mnangagwa on Friday launched the Land Tenure Implementation programme at Pricabe Farm in Kwekwe where he handed over title deeds to the first group of land reform beneficiaries.\n\nThis means land allocated to farmers under the land reform programme is now more secure, bankable and transferable.\n\nThe title deeds enable farmers to access credit facilities, buy inputs and hire labour, thereby boosting production.\n\nPresident Mnangagwa implored financial institutions to embrace the title deeds in order to improve the farmers access to finance and capital which is critical for production.\n\nHe said the Constitution gives rights to every Zimbabwean citizen to acquire, hold, occupy, use, transfer or dispose of agricultural land.\n\nLand tenure security is therefore critically important to Zimbabwes economic growth and development. It encourages investment, improves agricultural production and productivity, and lifts many out of poverty, said President Mnangagwa.\n\nHe said Government had therefore made a bold decision to empower the beneficiaries of the Land Reform Programme by giving them tenure that will unlock the value of the countrys land by allowing it to be used as collateral.\n\nIt is our hope that once the farmers receive the title deeds, they are able to fund their operations and buy the required inputs instead of waiting for Government inputs as has been the case over the years.\n\nGovernment, we want to believe, has weaned off the farmers who have been given title deeds as they can use their land as collateral to access loans. This, however, needs the support of the financial institutions hence President Mnangagwa has urged banks and other financial institutions to embrace the new title deeds.\n\nIt is however, pleasing to note that some beneficiaries of the land reform programme are already fully utilising the land and we expect the number of such farmers to rise sharply now that farmers can access loans and other credit facilities.\n\nThere is therefore no excuse for Zimbabwe to fail to reclaim its status as the food basket of southern Africa. Farmers should shame the doomsayers who have been criticising the countrys land reform programme by boosting production so that the country does not just produce for its consumption but surplus for export.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/HE-on-land-tenure-27.jpg",
            "description": "PRESIDENT Mnangagwa on Friday launched the Land Tenure Implementation programme at Pricabe Farm in Kwekwe where he handed over title deeds to the first group of land reform beneficiaries. This means land allocated to farmers under the land reform programme is now more secure, bankable and transferable. The title deeds enable farmers to access credit […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "Bernard on verge of penning South Africa move",
            "url": "https://www.chronicle.co.zw/bernard-on-verge-of-penning-south-africa-move/",
            "content": "Innocent Kurira,[emailprotected]\n\nZIMBABWE Goalkeeper of the Year Donovan Bernard is set to leave Chicken Inn, with the club reportedly close to signing Aron Ngwenya from Arenel as his replacement.\n\nBernard, who has been linked with several South African clubs, including SuperSport United, Polokwane City and Kruger United, is believed to be on the verge of securing a move to either of the three sides.\n\nNgwenya, on the other hand has also attracted interest from a number of Premiership teams despite Arenel getting relegated this past campaign.\n\nHighlanders and TelOne are some of the teams that have been linked with the imposing goalkeeper. Bosso are said to have had several conversations with the player who is on coach Kelvin Kaindus wish-list but an agreement could not be reached between the two parties on the signing-on fee for the player.\n\nAs things stand, a move to Kruger United for Bernard seems more likely according to sources close to proceedings at the club.Kruger United play in the National First Division in South Africa.\n\nChicken Inn secretary-general Tavengwa Hara remained tight-lipped about the developments but said: Anything is possible, but were happy with our squad. Were confident of building on our present team and preparing for the next season.\n\nWe may add one or two players to our squad but we are generally happy with the personnel we have and will not be making any major changes to our team.\n\nBernard began his football career at Aces Academy in 2003 before his senior career took off when he joined Motor Action, followed by stints at How Mine and Chicken Inn.\n\nHis impressive performances have earned him a number of call-up to the Zimbabwe national team. He managed to keep 20 clean sheets this past season.\n\nWhat makes Bernard an even more special talent is the fact he has earned his stripes without playing for the traditional big three.\n\nBernards potential move to South Africa is expected to not only boost his career but also raise the profile of Zimbabwean football.\n\nWith his exceptional talent and growing reputation, he is set to become a household name in South African football. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Donovan-Bernard.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw ZIMBABWE Goalkeeper of the Year Donovan Bernard is set to leave Chicken Inn, with the club reportedly close to signing Aron Ngwenya from Arenel as his replacement. Bernard, who has been linked with several South African clubs, including SuperSport United, Polokwane City and Kruger United, is believed to be on the verge […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        },
        {
            "title": "Zimbabwe records over 1,2 million visitors in 2024 third quarter With graphs",
            "url": "https://www.chronicle.co.zw/zimbabwe-records-over-12-million-visitors-in-2024-third-quarter-with-graphs/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWE recorded over 1,2 million visitors during the third quarter of 2024, reflecting a 25,7 percent increase compared to the same period last year, the Zimbabwe National Statistics Agency (ZimStat) has said.\n\nPresenting the third-quarter international migration statistics, ZimStat demographic analysis manager, Mr Perfect Makumbe, said 63,5 percent of these visitors were returning residents while 26,8 percent were international tourists.\n\nZimbabwe recorded a total of 1 245 348 visitors during the third quarter of 2024. Of the 454 043 visitors who came to Zimbabwe during the quarter under review, 47,9 percent came for holiday purposes, he said.\n\nThe data revealed a notable 4,8 percent increase in the proportion of international holidaymakers compared to the previous year.\n\nOther categories of visitors included transit travellers (26,5 percent), business travellers (18,2 percent), shoppers (5,1 percent), and those visiting for education purposes (2,3 percent).\n\nAfrican countries accounted for the majority of visitors, contributing 57,8 percent of the total. South Africa topped the list, representing 18,8 percent of all visitors.\n\nIn an interview, Tourism and Hospitality Industry Deputy Minister Tongai Mnangagwa attributed the surge in visitor numbers to President Mnangagwas engagement and re-engagement initiatives.\n\nHe also highlighted the success of the ministrys Meet and Greet programme, which has encouraged global interest in Zimbabwe as a holiday destination.\n\nDeputy Minister Mnangagwa said the engagement efforts are bearing fruit, and Zimbabwe is gaining recognition as a prime tourist destination. He said the continued rise in visitor numbers underscores Zimbabwes growing appeal as a tourist destination, bolstered by improved accessibility and targeted promotional campaigns.\n\nZimStat further reported that road transport remained the most popular mode of entry, with 71,9 percent of visitors arriving by road. Beitbridge Border Post accounted for 24,9 percent of these entries.\n\nAir travel accounted for 127 529 visitors, with 49,5 percent arriving through Robert Gabriel Mugabe International Airport. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/1-5.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com ZIMBABWE recorded over 1,2 million visitors during the third quarter of 2024, reflecting a 25,7 percent increase compared to the same period last year, the Zimbabwe National Statistics Agency (ZimStat) has said. Presenting the third-quarter international migration statistics, ZimStat demographic analysis manager, Mr Perfect Makumbe, said 63,5 percent of these visitors were […]",
            "time": "08:36",
            "date": "23 Dec 2024"
        }
    ]
}