{
    "news": [
        {
            "title": "Illegal night economy…Vendors, night buses drive Bulawayo’s after-dark activities",
            "url": "https://www.chronicle.co.zw/illegal-night-economy-vendors-night-buses-drive-bulawayos-after-dark-activities/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nAS soon as Bulawayo City Council municipal officers  the enforcers of the citys by-laws regarding parking, and the picking up and dropping off of passengers  finish their duties for the day, lawlessness in the City of Kings shifts into high gear.\n\nA full of life scene unfolds at the corner of Fort Street and Leopold Takawira Avenue as a large public bus, operated by one of the countrys major transport companies, pulls up to the curb.\n\nPassengers eager to travel to Harare begin to board the vehicle. Just a short distance away, on the opposite side of Fort Street, another bus is attracting passengers. Located near the iconic Tredgold Building, this brightly coloured 75-seater bus is ready to embark on its journey.\n\nEven though its only 5.30pm on a Thursday afternoon, the area surrounding Tredgold Building is already transforming into a busy food market. Vendors are setting up their stalls, offering a diverse range of meals, from traditional Zimbabwean cuisine to international fast food. This culinary spectacle is primarily driven by the influx of night bus passengers, who rely on these vendors for sustenance during their long journeys.\n\nAs the sun sets, a different and illicit night economy takes shape on Fort Street. Vendors, capitalising on the demand from night bus passengers, set up their stalls and engage in informal transactions, often involving US dollars. This underground economy operates outside the regulatory framework of the Bulawayo City Council.\n\nOn average, I sell about 50 takeaway food packages on a single night, and the majority of my customers are divided between passengers boarding the Harare buses and taxi drivers, said Marylene Sibanda, a food vendor who sells isitshwala, rice, beef and chicken.\n\nNight activity: As early as 17.30 a new business activity begins. The picture taken along Fort Street near Tredgold Building shows a Harare-bound bus loading passengers\n\nBusiness is brisk around 7pm when the second or third long-distance bus parks at the illegal rank that is popular among passengers travelling to the capital city at night, she says. Each takeaway costs US$1.\n\nMost people prefer the buses that leave for Harare between 7pm and 9PM, and that is during that time when business is good, she said.\n\nFor someone who doesnt pay rent or any other utility bills that registered food outlets pay in the formal sector, making a gross total of US$50 per night cannot be considered bad business for the middle-aged woman.\n\nCold drink vendors can also be seen milling around the long-distance buses, hoping for a thirsty passenger to stick their head out of the bus windows and make a purchase. Vendors are seldom allowed into the buses, even when they are stationary. The other commodity that sells like hot cakes, riding on the back of dollar deals, is airtime. An airtime vendor who only identified himself as Mbuso doubles up as a money changer  the individuals who sell and buy foreign currency at premium rates.\n\nThe night economy at Tredgold has also given a lifeline to taxi drivers who bring passengers to the long-distance buses or anyone looking for convenient and quick transport in and around the city. The irony of the booming business at Tredgold is that some of it, especially the illegal kind, is conducted right in front of the building where transgressors of the law are reprimanded or punished.\n\nOn the other side of the street, at the corner of Leopold Takawira Avenue and Herbert Chitepo, one man has close to 100 pairs of sneakers lined up on the pavement. He sells his merchandise right in front of what used to be a building that housed Edgars, the clothing retailer who deserted the building after complaining that competition from unlicensed clothes vendors was pushing the giant retailer out of business. The sneakers cost between US$10 and US$30.\n\nAfter Edgars vacated the building, it was taken over by numerous small shopowners selling a variety of items, including cell phones, clothes, and kitchenware. The long-distance buses that operate overnight on the Bulawayo/Harare route have been flagged by the Bulawayo City Council (BCC) as operating illegally, as the location is not an authorised bus terminus. The BCC has not yet responded to questions sent to the municipalitys communication and public relations department.\n\nOvernight travel has become a lucrative business for bus companies, and the National Railways of Zimbabwe (NRZ) is also looking to capitalise on this market. The NRZ is working on resurrecting its passenger coaches following a complete overhaul of its railway network, which is currently in a poor state.\n\nWe suspended our passenger coaches for operational reasons as it was no longer profitable. NRZ is working on revising passenger coaches operations but that can only be done when the freight services is profitable to a point that we can subsidise passenger coaches, said NRZ public affairs and stakeholder relations manager, Mr Andrew Kunambura\n\nPassenger services are currently suspended due to financial constraints and the poor condition of the existing coaches. According to Section 37 of the Railway Act, passenger services are supposed to be subsidised by the Government, as they are more of a social service than a business venture.\n\nMr Kunambura stated that once the NRZ addresses the freight side of its business and ensures it runs profitably, the company will be able to efficiently run passenger trains, subsidising the operations as part of their corporate social responsibility.\n\nEarlier this year, NRZ general manager, Miss Respina Zinyanduko, mentioned that the parastatal aims to emulate the rail and port authority of Mozambique, CFM Mozambique, which provides a 90 percent subsidy to its passenger service.\n\nCommenting on the illegal activities that occur at night around the Tredgold area, Bulawayo United Residents Association Chairman Mr Winos Dube said there is a need for the BCC to introduce a night shift for its municipal security department.\n\nPeople engage in all sorts of illegal activities at night around the Tredgold area taking advantage of the fact that BCC officers will have knocked off. At this rate, Bulawayo will turn into a slum as a result of people breaking the law by selling food everywhere and buses picking up and dropping off passengers at every street corner, said Mr Dube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgfdsfgsdggfvvvvvcv.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  AS soon as Bulawayo City Council municipal officers — the enforcers of the city’s by-laws regarding parking, and the picking up and dropping off of passengers — finish their duties for the day, lawlessness in the City of Kings shifts into high gear. A full of life scene unfolds at the corner of […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "Justice Ministry, ZPCS collaborate to reform parole system",
            "url": "https://www.chronicle.co.zw/justice-ministry-zpcs-collaborate-to-reform-parole-system/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE Ministry of Justice, Legal and Parliamentary Affairs, in partnership with the Zimbabwe Prisons and Correctional Service (ZPCS), is undertaking a comprehensive review of existing policies and regulations to facilitate the effective implementation of the parole system and establish community correctional centres.\n\nThis initiative underscores Zimbabwes commitment to transforming its prison system from one of punishment to one focused on rehabilitation and reintegration.\n\nThe initiative aligns with the provisions of the new Prisons and Correctional Service Act Chapter 7:23.\n\nParole is the conditional release of prisoners before they complete their sentences.\n\nThe Prisons and Correctional Service Act Chapter 7:23 provides for the establishment of the State Parole Board and sets conditions for ones release from prison.\n\nAn inmate can be released through a decision made by the President, the State Parole Board, the Commissioner General of Prisons, or the Minister responsible for Prisons and Correctional Services.\n\nThe State Parole Board is authorised to release inmates on day parole.\n\nSome of the considerations for granting parole include whether an inmate has displayed meritorious conduct, self-discipline, responsibility and industriousness while in prison.\n\nPersons to be pardoned must not present undue risk to society when on parole, and their release must contribute to the rehabilitation and reintegration of the inmate into society as a law-abiding citizen.\n\nIn his address at the combined 154th and 155th recruit correctional officers courses pass-out parade held at ZPCS Ntabazinduna Training School on Monday, Justice Minister Ziyambi Ziyambi said that in liaison with ZPCS, the ministry is reviewing policies and regulations in line with the provisions of the new Prisons and Correctional Service Act Chapter 7:23.\n\nThis will positively see the effective implementation of the parole system and establishment of community correctional centres, among other aspects.\n\nThese programmes are crucial in advancing the reintegration process and also assisting in reducing overcrowding in correctional facilities, he said.\n\nMinister Ziyambi added that ZPCS is leaving no stone unturned to address challenges faced by inmates and ex-inmates in their passage to reintegration back to society.\n\nMinister Ziyambi Ziyambi\n\nHe said ZPCS has initiated a bid to facilitate the establishment of a foundation aimed at addressing these challenges.\n\nThrough stakeholder involvement, the foundation will provide support programmes and mobilise resources necessary for the successful implementation of reintegration initiatives. As a Ministry, we are fully behind this ingenuity and will ensure that the vision becomes a reality.\n\nHe noted that it is also vital to make concerted efforts and continue fostering regional collaboration among Correctional Services to holistically enhance successful reintegration.\n\nI therefore urge all Correctional Services in Africa to fully utilise the African Correctional Services Association in order to propel exchange programmes for mutual benefit towards successful reintegration. It is our belief that African problems should be solved by African solutions.\n\nSpeaking at the same ceremony, ZPCS Commissioner-General Moses Chihobva said the enactment of the new Prisons and Correctional Service Act (Chapter 7:23) has empowered ZPCS to bolster its efforts in the rehabilitation and reintegration purview.\n\nBy focusing on rehabilitation over punishment, the new legislation aims to strengthen the furnishing of former inmates with the requisite skills and support for successful re-entry back to society after serving their sentences, he said.\n\nReintegration is crucial not only for the personal growth of released inmates but also for enhancing public safety and reducing recidivism rates. When ex-offenders are provided with access to education, employment opportunities, and social services, they are more likely to become contributing members of society.\n\nHe noted that the holistic approach fosters a sense of belonging and encourages positive citizenship, ultimately strengthening the fabric of the nation.\n\nHe said through effective reintegration efforts, ZPCS seeks to transform lives and promote a more inclusive and resilient society.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jdghbvxb.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  THE Ministry of Justice, Legal and Parliamentary Affairs, in partnership with the Zimbabwe Prisons and Correctional Service (ZPCS), is undertaking a comprehensive review of existing policies and regulations to facilitate the effective implementation of the parole system and establish community correctional centres.  This initiative underscores Zimbabwe’s commitment to transforming its prison system from […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "Wholesaler spreads festive season cheer",
            "url": "https://www.chronicle.co.zw/wholesaler-spreads-festive-season-cheer/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nIN a heart-warming display of community spirit as the festive season approaches, Budget Cash and Carry recently donated food hampers to less fortunate members of the community.\n\nThe handover ceremony, presided over by chairman of the Zanu-PF District Coordinating Committee for Area Five in Bulawayo, Cde Mnothisi Nsingo, saw approximately 10 individuals receive hampers filled with essential foodstuffs, including maize meal.\n\nCde Nsingo highlighted the critical role that officials at Budget Cash and Carry play in supporting communities.\n\nBudget Cash and Carry has been with us for a long time; we have done many programmes with them. When Mr Raeez Lunat called me saying, Nsingo, I want to donate to the vulnerable, can you get me ten people, I was so excited thinking that its towards Christmas and with what is happening, there is no rain, El Nio is everywhere, people are suffering. For me, it was a blessing.\n\nMost of the people who benefited here are widows, and they are heading families now, so just imagine, when you get something like this during this time, it means a lot to them. Mr Lunat is one of our fundraising committee members in Bulawayo, so he has been helpful in many ways. We thank him for giving back to the community, said Cde Nsingo.\n\nAfter receiving the hampers, the beneficiaries expressed their gratitude, noting that receiving a gift during this time of the year means a lot, especially as some of them had nothing to depend on during this festive season.\n\nWe thank Budget Cash and Carry for what they did. We are going to celebrate the holidays in style with our grandchildren; we didnt even know where to start. They gave us a surprise gift; may God bless the owners of Budget Cash and Carry and give them everything they wish in life, said Ms Prudith Mtebe.\n\nBudget Cash and Carry Managing Director, Mr Lunat, said that in whatever capacity, they try to give back to the community they serve.\n\nBesides supporting local manufacturers, we also try to give back to the community by assisting wherever we can, in whatever capacity we can, he said.\n\nMeanwhile, Budget Cash and Carry is passionate about supporting local manufacturers and promoting the growth of Zimbabwes economy. Their commitment to local procurement is reflected in their innovative Local is Lekker brand activation day, which showcases the best of local products and provides a platform for local businesses to shine. On Saturday, different companies displayed their products at Budget Cash and Carry in Belmont.\n\nMr Lunat said that by choosing local commodities from local manufacturers, customers are not only getting high-quality products but also contributing to the growth and development of the local community.\n\nHere are just a few reasons why local matters: stimulating economic growth and creating jobs, fostering innovation and entrepreneurship, improving quality and safety standards, supporting unique and culturally relevant products, and improving quality and safety.\n\nOur Local is Lekker brand activation day is a celebration of all things local. We invite local manufacturers to showcase their products, connect with customers, and receive valuable feedback. This initiative is our way of promoting local procurement, driving sales and revenue for local manufacturers, and empowering our local community, he said.  @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/evwh6.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  IN a heart-warming display of community spirit as the festive season approaches, Budget Cash and Carry recently donated food hampers to less fortunate members of the community.  The handover ceremony, presided over by chairman of the Zanu-PF District Coordinating Committee for Area Five in Bulawayo, Cde Mnothisi Nsingo, saw approximately 10 individuals receive […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "BCC spends US$700K on roads annually",
            "url": "https://www.chronicle.co.zw/bcc-spends-us700k-on-roads-annually/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Bulawayo City Council (BCC) allocates approximately US$700000 annually to its road rehabilitation programmes. Given the extensive scope of road maintenance work, the local authority engages private sector contractors to complement its own efforts, a council official has revealed\n\nWhile 70 percent of the citys roads have outlived their lifespan, limited resources prevent the council from fully reconstructing most of them. Instead, the local authority has resolved to conduct periodic maintenance to keep the roads trafficable. In recent months, the council has been patching some of the citys major roads.\n\nResponding to questions, Bulawayo communication officer, Ms Bongiwe Ngwenya, said the council covered a total of 3000 square metres of pothole patching this year at a cost of nearly US$700000. Contractors hired for the current year have completed the scope of works for 2024, which totalled 3000 square metres citywide.\n\nWe will engage contractors again for pothole patching during the first quarter of 2025 through an open tender system. The pothole patching programme will continue using both the councils in-house teams and private contractors year on year until the councils road maintenance teams are fully resourced.\n\nWe normally give the contractors the scope in terms of the area to be covered in patching and the budget varies. The average annual budget for patching is about US$600000 to US$700000, said Ms Ngwenya.\n\nShe explained that the council resolved to hire private contractors as it cannot rehabilitate the citys roads on its own.\n\nMs Ngwenya said the council outsources equipment from five contractors, while two others are involved in road maintenance.\n\nThe City of Bulawayo outsources or subcontracts road maintenance activities and plant and equipment to augment council resources (i.e., plant, equipment, labour). The council on its own does not have the capacity to undertake all road maintenance activities citywide. The council has been outsourcing pothole patching for years. For the year 2024, the council outsourced pothole patching to two companies and hired plant and equipment from more than five companies, said Ms Ngwenya.\n\nShe revealed that the city implements a periodic road maintenance programme, which includes reconstruction, overlays, reseals and road markings, as well as routine maintenance works such as pothole patching and drain clearing.\n\nThe budget allocation split is 75 percent to periodic works and 25 percent to routine maintenance works, she said.\n\nMeanwhile, a local construction company has patched potholes along Khami Road to Emthunzini suburb on the outskirts of the city as a donation. Over the past few weeks, workers from Hawkflight Construction have been patching potholes on the section of Khami Road, while road markings have also been done on the same road.\n\nThe current works on patching the carriageway on Khami Road from Emthunzini Suburb towards the city centre is a donation. The works are carried out at no cost to the council, she said.\n\nBy October this year, the Zimbabwe National Roads Administration (Zinara) had disbursed over ZWG 13 million to Bulawayo for road rehabilitation.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/bxcbdfxcv-1.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  THE Bulawayo City Council (BCC) allocates approximately US$700 000 annually to its road rehabilitation programmes. Given the extensive scope of road maintenance work, the local authority engages private sector contractors to complement its own efforts, a council official has revealed  While 70 percent of the city’s roads have outlived their lifespan, limited resources prevent […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "150 MSMEs formally registered",
            "url": "https://www.chronicle.co.zw/150-msmes-formally-registered/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nTHE Government continues to demonstrate its commitment to womens empowerment through the Women Development Fund. From January to September 2024, the Fund provided crucial support to 33 projects, reflecting the Governments ongoing efforts to enhance womens economic participation.\n\nIn the 2025 National Budget statement, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, highlighted that the projects funded through the WDF benefitted a total of 261 women and sustained 450 jobs.\n\nDuring the period January to September 2024, thirty-three projects were funded through the Women Development Fund, benefitting a total of 261 women and sustaining 450 jobs, he said.\n\nThe Ministry of Women Affairs, Community, Small and Medium Enterprises, in its 2022 annual report, noted that the Women Development Fund supported 240 projects worth US$297 million. Professor Ncube also mentioned that a total of 76,741 women entrepreneurs across all provinces received training in diverse areas, including technical skills, business management, climate change adaptation, health access and life skills.\n\nHe stated that 5 228 MSMEs were facilitated to participate in local, regional and international fairs and exhibitions, including events such as the Zimbabwe International Trade Fair (ZITF), provincial and district agricultural shows, as well as regional market fairs in Zambia, Malawi, Botswana, Eswatini, Mozambique and Tanzania. MSMEs are acting as pathfinders in regional and international markets through participation in exhibitions and fairs such as the upcoming Tokyo Expo 2025.\n\nAccording to Professor Ncube, through the Start-up Business Advisory Program, 150 MSMEs were formally registered in 2024. He also highlighted that the Government is working with the Women Owned Business Trust and UN Women, including Praz, to promote the participation of women entrepreneurs across various supply chains in supplying goods and services to the public sector.\n\nProfessor Ncube said that the Government will continue to expand support towards SME initiatives and women empowerment through the capitalisation of the Zimbabwe Women Micro Finance Bank, EmpowerBank, Small and Medium Enterprises Development Corporation and the National Venture Capital Company of Zimbabwe.\n\nAccording to the Finscope Survey of 2022, Zimbabwe has 3.4 million micro, small and medium enterprises (MSMEs) owned by 4,2 million entrepreneurs, employing 4.8 million people and contributing US$8,6 billion to the countrys gross domestic product (GDP).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/mthuli.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com THE Government continues to demonstrate its commitment to women’s empowerment through the Women Development Fund. From January to September 2024, the Fund provided crucial support to 33 projects, reflecting the Government’s ongoing efforts to enhance women’s economic participation. In the 2025 National Budget statement, Finance, Economic Development and Investment Promotion Minister, […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "Zifa polls twist. . . giants fall, Mliswa threatens to appeal",
            "url": "https://www.chronicle.co.zw/zifa-polls-twist-giants-fall-mliswa-threatens-to-appeal/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nTHE script for the much-awaited Zifa elections took an unexpected twist yesterday with revelations that the decision by the Electoral Committee to bar four candidates from contesting the upcoming association presidential elections could be challenged in court.\n\nThis comes as some of the candidates touted among the favourites fell at the first hurdle after failing to meet the stringent edibility criteria as set by the new Zifa statutes.\n\nThe quarter of outspoken former legislator Themba Mliswa, Farai Jere, Walter Magaya and ex-national team captain Benjani Mwaruwari will not play any further part, according to a statement released by the Zifa Normalisation Committee yesterday.\n\nThemba Mliswa\n\nThis leaves six candidates in contention for the associations hot seat, and these are veteran football administrator Martin Kweza, former footballer Makwinji Soma-Phiri, ex-Zifa board member Philemon Machana, former Premier Soccer League chairman Twine Phiri, UK-based football administrator Marshall Gore and business executive, Nqobile Magwizi.\n\nThe announcement was made by the Fifa-appointed Normalisation Committee led by Lincoln Mutasa, which is also acting as the Electoral Committee for the purpose of these elections meant to restore order in the association.\n\nZifa also announced 10 successful candidates to stand for the associations vice-presidency and 37 for ordinary board members.\n\nWalter Magaya\n\nThe positions to be contested for on January 25 include the president, two vice-presidents, of which one must be a woman, and six ordinary board members.\n\nHowever, some of the candidates barred to run for the Zifa presidency have indicated they could exercise their right to appeal.\n\nAccording to the football statutes, aggrieved individuals could still approach the Court of Arbitration for Sport in Switzerland for redress.\n\nFormer Norton Member of Parliament, Mliswa, said he was contemplating challenging the decision to exclude him from the successful candidates.\n\nBenjani Mwaruwaru\n\nThe vetting process, through which all the aspiring candidates for the January 25 ballot were subjected to an eligibility test, has been taking place in the last two weeks, with the assistance of the Zifa Ethics Committee led by renowned legal practitioner Muchadeyi Masunda.\n\nI would like to, first of all, congratulate those who made it in the various positions that they are seeking to stand in the Zifa, the new Zifa Executive Committee.\n\nUnfortunately, I didnt make it, but fortunately I can appeal. I will appeal, said Mliswa.\n\nHe said he will seek to challenge the loopholes in the new Zifa constitution, that was recently adopted by the associations congress and registered with the Sports Commission.\n\nThe process of appeal is critical, not because Im bitter, but its ones right to also test the constitution. I always say that this constitution is flawed in many ways. Being flawed in many ways, it has to be tested, said Mliswa.\n\nFarai Jere\n\nThe interpretation of a constitution can only be known to be what it is through the processes and the courts. I intend to start the process as soon as possible, but like any other method of appeal, you need to be given the reasons why you did not make it. And then from there, it becomes the basis for you to appeal.\n\nThe process to appeal must not be seen as a bitter way of responding, but it is a right and its good for the people of Zimbabwe. We need the best leaders.\n\nAnd even in a political election, you know that the appeal process is there, the constitutional court is there The process starts now. The game is not over. The game has just started.\n\nMliswa and some of the barred candidates that spoke to Zimpapers Sports Hub were unhappy there was no explanation from the Zifa Normalisation Committee why they failed to make the cut.\n\nVeteran football administrator Jere, who had announced he was leaving the Premier Soccer League chairmanship to focus on the Zifa job,\n\nI have nothing to react to at the moment, I cannot even say what the next step would be because I have not received any communication from Zifa to say I have failed to meet the eligibility criteria because of ABC.That way I can be able to make a decision, whether to appeal or not to. If you also look at it from another angle, maybe their decision is correct but that we can only know if they say something.As people versed with tenets of good corporate governance I thought they were going to communicate beforehand and explain why my candidature was not successful. Probably the letters are on the way. We wait, said Jere.There has been an overwhelming interest in the upcoming elections, with a record number of nominations for the various posts in the Zifa board.In announcing the successful candidates, a statement from the association yesterday said, The Zifa Normalisation Committee acting as the Zifa Electoral Committee in accordance with Article 85(9) is pleased to announce the names of all the candidates who have met the eligibility criteria stipulated in the Zifa Statutes, 2024. The list of successful candidates is as follows:Presidential CandidatesMarshall Gore, Philemon Machana, Nqobile Magwizi, Martin Kweza, Twine Phiri, Makwinji Soma-PhiriVice President CandidatesMavis Gumbo, Patience Mutumwa, Winnet Murota, Joyce R Kapota, Loveness Mukura, Kennedy Ndebele, Omega Sibanda, Peter Dube, Francis Nyamutsamba, Makwinji Soma-Phiri, Simbarashe J TakavadaOrdinary MembersGilbert Saika, Sharif Mussa Umerjee, Thomas Marambanyika, Nicholas Munyonga, Tavengwa Hara, Xolisani Gwesela, Bhekhimpilo Nyoni, Vincent Chawonza, Sweeny Mushonga, Lewis Muzhara, Modern Ngwenya, Jerrymike Gumbo, Alice Zeure, Alois Bunjira, Morgen Dube, Sabelo Maphosa, Edward Mutukwa, Tizirayi Luphahla, Sibekikwe Ndlovu, Tafadzwa Benza, Cecilia Gambe, Kudzai Kadzombe, Sunday Chidzambwa, Walter Musanhu, Desmond Ali, Simbarashe Ndoro,Makwinji Soma-Phiri, Francis Nyamutsamba, Davison Muchena, Brighton Ushendibaba, Edmore Chivero, Terence T Malunga, Harlington Shereni, Cuthbert C Chitima, Norman Matemera, Beaullar Msarah, Gilbert Chiminya.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/zifa-cc.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub THE script for the much-awaited Zifa elections took an unexpected twist yesterday with revelations that the decision by the Electoral Committee to bar four candidates from contesting the upcoming association presidential elections could be challenged in court. This comes as some of the candidates touted among the favourites fell at […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "Bulawayo leaders call for unity and peace in families",
            "url": "https://www.chronicle.co.zw/bulawayo-leaders-call-for-unity-and-peace-in-families/",
            "content": "Nqobile Tshili,[emailprotected]\n\nZIMBABWES Unity Accord commemorations should not be viewed solely through a political lens but should also address family dynamics amid rising concerns over discord among relatives, increasing divorce rates and family members harming each other over minor issues, a top Government official has said.\n\nBulawayo Provincial Affairs and Devolution Minister, Judith Ncube, highlighted this yesterday as the province commemorated Unity Day with a thanksgiving church service. The event, held at the Large City Hall, saw participation from Government officials, churches, residents and members of the media.\n\nMinister Ncube acknowledged that the signing of the December 22, 1987 Unity Accord by the late President Cde Mugabe and the late Vice-President Joshua Nkomo laid the foundation for the peaceful country we have today. She noted that the Unity Accord ended years of conflict that threatened to tear the nation apart.\n\nThe Unity Accord is one of the major political milestones in Zimbabwe since independence. It extinguished the fires of conflict in our nation and established the foundation of peace and unity that we enjoy up to now. Some may not value the Unity Accord because they dont know what was happening. Even today,in our homes, in our families, there are serious conflicts.\n\nSome are even forced to relocate as they dont want to interact with their siblings. We need the church to unite families as some end up killing each other. We are aware of some children who kill their parents and siblings, blaming them for their misfortunes, said Minister Ncube.\n\nExpressing concern over the alarmingly high divorce rates in the country, Minister Ncube underlined the importance of prioritising national interests over personal gains when resolving family conflicts. Mirroring the selfless dedication of the countrys founding fathers, Minister Ncube urged citizens to approach family disputes with a spirit of national unity and a commitment to preserving the sanctity of the family unit.\n\nWhatever contradictions and differences we face as a nation, we should always find resolutions through peaceful dialogue. No nation can develop if there is conflict. As His Excellency, the President of Zimbabwe Dr Emmerson Mnangagwa always says,ilizwe lakhiwa ngabanikazi balo, likhulekelwe ngabanikazi balo.We thought it fitting that as we hold this Unity Day commemoration, we invite the clergy because the clergy needs to pray for the country. More than ever, we need to embrace the power of coming together, said Minister Ncube.\n\nAcknowledging the numerous challenges facing Bulawayo, including the ongoing water crisis, she emphasised that unity of purpose is crucial to overcoming these obstacles.\n\nWe need to pray for rain as the water situation is causing conflicts in the city. As a Government, we are closely working with the council through the Town Clerks office and the Mayor to address the water issue. Right now, feasibility studies are being conducted to establish whether we can draw water from an aquifer in Hope Fountain. All these efforts are aimed at addressing the citys water challenges, she said.\n\nSpeaking during the same event, Bulawayo Deputy Mayor Edwin Ndlovu said the Unity Accord is an important day in the nations calendar as it reminds us of the countrys shared history, struggles and enduring spirit.\n\nThis Unity Accord marked a watershed moment in our nations history. It was a time when we chose to prioritise our collective future over individual differences. It was also a time for healing, reconciliation and a commitment to building a brighter future for all Zimbabweans.\n\nThe journey to this unity was not an easy one. It was fraught with challenges, sacrifices and profound losses. Yet, the leaders of that time had the foresight to recognise that our strength lies not in division but in togetherness. They understood that, despite our varying backgrounds, languages and cultures, we share a common destiny. Today, we honour their vision and the legacy they left us, said Clr Ndlovu\n\nHe said that for Bulawayo to thrive, a spirit of unity and a collective focus on the citys interests must guide the provinces development.\n\nAs Bulawayo, we are in a space that symbolises community and collaboration. Let us take a moment to reflect on what unity truly means. Unity is not the absence of conflict or disagreement; rather, it is the ability to come together, to listen to one another and to work collaboratively towards common goals. It is a reminder that as Bulawayo, we need to embrace our diversity, recognising that each of us brings unique perspectives and strengths to the table.\n\nIn our current context, as we face both local and global challenges, the spirit of unity is more crucial than ever. We live in times of uncertainty, where divisions can easily be exacerbated by misinformation and fear, he said\n\nRepresenting the Roman Catholic Church of Bulawayo, Archbishop Alex Thomas stated that Unity Day commemorations provide a valuable opportunity for the nation to reflect upon its past and collectively plan for a brighter future.\n\nThis is an important part of our country where we chose peace and national cohesion. This Unity Accord marks a significant step towards healing the divisions that once threatened to tear us apart, said Archbishop Thomas.\n\nHe said that a united front is essential for the development of both Bulawayo and the nation. While acknowledging that conflicts are inevitable, he stressed that mutual respect and the spirit of Ubuntu  characterised by humaneness, compassion and collective well-being  should guide the nations development agenda.\n\nThis is about coming together, setting aside our differences to build a nation where each one is valued, respected, heard, understood and included in all the development processes. It is through unity that we can face many economic challenges and social injustices. When we stand together, we are stronger, more resilient and better equipped to address the issues that confront us in our daily lives, said Archbishop Thomas.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fdsxcvbvxc.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  ZIMBABWE’S Unity Accord commemorations should not be viewed solely through a political lens but should also address family dynamics amid rising concerns over discord among relatives, increasing divorce rates and family members harming each other over minor issues, a top Government official has said.  Bulawayo Provincial Affairs and Devolution Minister, Judith Ncube, highlighted […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "Olympic athlete gets City Award",
            "url": "https://www.chronicle.co.zw/olympic-athlete-gets-city-award/",
            "content": "Innocent Kurira,[emailprotected]\n\nFOR the second year running, Isaac Mpofu has been crowned the Bulawayo Athletics Board (Bab) Athlete of the Year.\n\nMpofu had a remarkable year, participating in the 2024 Olympics where he finished in position 19.\n\nHe also brought home a bronze medal from the African Games in Accra, Ghana.\n\nIn Ghana, Mpofu crossed the finish line on third position in a time of 1 hour 05 minutes 58 seconds.\n\nMpofu could not be part of the awards ceremony held at Palace Hotel on Sunday evening as he is in camp in Binga preparing for future competitions.\n\nBab chairperson, Watson Madanyika congratulated Mpofu and the athlete on a successful year.\n\nI would like to extend my warmest congratulations to Isaac Mpofu on being crowned the Bab Athlete of the Year for the second consecutive year. This is a testament to his hard work, dedication and perseverance. We are proud to have him as part of our athletics family.\n\nolympics\n\nMpofus achievements are not only a reflection of his individual talent but also a testament to the hard work and commitment of our coaches, trainers and support staff. We are grateful for their tireless efforts in helping our athletes reach their full potential, said Madanyika.\n\nMadanyika hopes for a more successful season next year.\n\nAs we celebrate Mpofus success, we also recognise the achievements of all our athletes who have worked hard to represent our city and country proudly. We look forward to another successful year ahead and continue to support and nurture our athletes to reach greater heights.\n\nI would like to thank our sponsors, partners and stakeholders for their continued support. Your contributions have been invaluable in helping us achieve our goals and we look forward to continuing our partnerships in the future, said Madanyika.\n\nOne of the highlights of the evening was the presentation of the Most Promising Athlete award to Bingas long distance runner ,Tulange Mudenda.\n\nMudendas impressive performances on the track have marked him as one to watch in the future.\n\nSprinter, Alpha Mpofu, who recently earned a scholarship to the United States of America, was named the Best Junior Athlete of the Year.\n\nMpofus hard work and dedication to his craft was rewarded and Bab officials are confident that he will go on to achieve great things in the world of athletics.\n\nIn the veterans categories, Helen Kufa was named the Best Veteran Female Athlete of the Year, while Trust Chidomaya took home the award for Best Veteran Male Athlete.\n\nThese awards recognise the outstanding contributions these athletes have made to the sport and Bab officials were delighted to have honoured them in this way.\n\nCaron Chashamba was named the Most Promising Technical Official for the Year, in recognition of her hard work and dedication to ensuring that athletics competitions in Bulawayo are run smoothly and efficiently.\n\nThree coaches were identified as the Most Promising Coaches of the Year and they are Themba Mhlophe, Benson Mwanza and Jamaine Chilufya.\n\nThese coaches have all demonstrated a commitment to developing the talents of their athletes and Bab officials are confident that they will go on to achieve great things in the world of athletics.\n\nFinally, White City Stars Academy was named the Athletics Club of the year, in recognition of their outstanding contributions to the development of athletics in Bulawayo.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/trhweyh.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw FOR the second year running, Isaac Mpofu has been crowned the Bulawayo Athletics Board (Bab) Athlete of the Year. Mpofu had a remarkable year, participating in the 2024 Olympics where he finished in position 19. He also brought home a bronze medal from the African Games in Accra, Ghana. In Ghana, Mpofu […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "Government to form audit teams to ensure mining compliance",
            "url": "https://www.chronicle.co.zw/government-to-form-audit-teams-to-ensure-mining-compliance/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nTHE Government has announced plans to establish audit teams comprising various ministries, departments and agencies (MDAs) as part of responsible mining initiatives to ensure compliance with the countrys laws and curb illegal mining.\n\nThe mining sector is central to the attainment of the countrys vision to become an upper-middle-income economy by 2030, hence the Governments commitment to increase oversight over all mining activities in the country to curb malpractices.\n\nIn the 2025 National Budget statement, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, noted that the flagrant violation of mining and environmental laws has resulted in unethical mining practices, causing financial loss and environmental degradation.\n\nHe said that the Government will intensify awareness and enforcement of the responsible mining initiative to ensure compliance with the countrys laws and curb illegal mining.\n\nProf Mthuli Ncube\n\nAs part of the implementation of this initiative, the Government will also establish audit teams, comprising various Ministries, Departments and Agencies (MDAs), including Mines and Mining Development, Environment, Climate and Wildlife, as well as Local Government and Public Works, to conduct thorough investigations into mining operations, to assess the activities of mining companies and identify any non-compliant mining activities, he said.\n\nMining is one of Zimbabwes key economic sectors, accounting for 73 percent of foreign direct investment, 83 percent of exports, 19 percent of Government revenue, two percent of formal employment and 11 percent of individual incomes.\n\nThe Responsible Mining Audit instituted by the Government into the operations of mining companies revealed mixed findings regarding the conduct of mining companies in their operations in 2023.\n\nAccording to the findings, medium to large-scale miners were found to be operating within the confines of the law, while some small-scale miners have been accused of violating the countrys laws.\n\nThe initiative was conducted countrywide between May and June last year to establish if mining companies were complying with requirements relating to the submission of production returns as required by law.\n\nAmid growing concerns over the contribution of unsustainable mining and land degradation, the Government will next year promulgate a policy to compel mining companies to disclose their Environmental, Social and Governance (ESG) plans before obtaining mining title. The policy move, which is in line with international best practices, is aimed at addressing ESG concerns due to mining activities impact on climate change.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghnjghgj.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com THE Government has announced plans to establish audit teams comprising various ministries, departments and agencies (MDAs) as part of responsible mining initiatives to ensure compliance with the country’s laws and curb illegal mining. The mining sector is central to the attainment of the country’s vision to become an upper-middle-income economy by […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        },
        {
            "title": "Police warn against mob justice after fatal incident",
            "url": "https://www.chronicle.co.zw/police-warn-against-mob-justice-after-fatal-incident/",
            "content": "Trish Mukwazo,[emailprotected]\n\nPOLICE have issued a stern warning to the public against taking the law into their own hands, following a tragic incident of mob justice in Lobengula suburb.\n\nIn a statement, Bulawayo deputy spokesperson Assistant Inspector Nomalanga Msebele urged residents to take any apprehended suspects to the nearest police station rather than resorting to violence.\n\nThis comes in the wake of a murder involving two community members from Lobengula, who allegedly killed a man they believed to be a thief. The deceased, accompanied by three other men, had reportedly robbed one of the accused of his Samsung A23 mobile phone and earphones.\n\nThe suspects, identified as Advice Dibula (36) and Khulekelani Mhlanga (43) of Lobengula West, are accused of fatally attacking the alleged thief. The incident occurred on December 21 at approximately 3am, as the three men were returning home from Marisha Night Club in Old Magwegwe suburb.\n\nAssistant Inspector Msebele stressed the importance of allowing the police to handle criminal matters to prevent such tragic outcomes.\n\nAs the three were walking near a certain house in Lobengula West suburb, they met the now deceased, whose identity is still unknown, in company of three other male adults who began to assault them using unknown objects for no reason.\n\nOne of the now deceaseds team forcibly took one of the threes Samsung A23 mobile phone and earphones from his trousers pocket, said Assistant Inspector Nomalanga Msebele.\n\nAssistant Inspector Msebele stated that the deceased had assaulted one of the three men, striking him in the face three times with his fists, causing him to fall to the ground.\n\nOne of the men managed to escape from the scene and alerted the residents. Police attended the scene and found the now deceased lying on the ground unconscious bleeding from the mouth with a cut on his head.\n\nAn ambulance was summoned which ferried the now deceased to Mpilo Hospital where he was pronounced dead upon arrival. The body was conveyed to the mortuary for post mortem and the accused persons were arrested, said Assistant Inspector Nomalanga Msebele.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsfmkbvhxhivhbvfhbvhiobvbvujo.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com  POLICE have issued a stern warning to the public against taking the law into their own hands, following a tragic incident of mob justice in Lobengula suburb.  In a statement, Bulawayo deputy spokesperson Assistant Inspector Nomalanga Msebele urged residents to take any apprehended suspects to the nearest police station rather than resorting to […]",
            "time": "06:38",
            "date": "24 Dec 2024"
        }
    ]
}