{
    "news": [
        {
            "title": "President Mnangagwa to attend Zimbabwe National Day at Expo 2025 in Osaka",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-to-attend-zimbabwe-national-day-at-expo-2025-in-osaka/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa is set to attend the Zimbabwe National Day in July during the upcoming six-month-long Expo 2025 in Osaka, Japan.\n\nThe Expo 2025 will run from 13 April to 13 October in Osaka, providing a global platform for trade, investment, and cultural exchange.\n\nDuring a post-Cabinet briefing today, the Minister of Information, Publicity, and Broadcasting Services, Dr Jenfan Muswere, announced that Cabinet had considered and approved the Preparations for the Expo 2025 Osaka Report, as presented by the Minister of Foreign Affairs and International Trade, Professor Amon Murwira.\n\nThe highlights of the six-month-long Expo 2025 programme will include the Zimbabwe National Day, to be graced by His Excellency President Cde Dr E.D. Mnangagwa on 16 July 2025. The event will provide a platform to harness investment dividends and other collaborative opportunities, as the President will be engaging both international investors and the Diaspora community in Japan, said Dr Muswere.\n\nZimbabwe will participate under the theme, Beyond Limits, aiming to attract at least 3 million visitors to its strategically located pavilion.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/iuyythdfh.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa is set to attend the Zimbabwe National Day in July during the upcoming six-month-long Expo 2025 in Osaka, Japan. The Expo 2025 will run from 13 April to 13 October in Osaka, providing a global platform for trade, investment, and cultural exchange. During a post-Cabinet briefing today, the Minister of […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Bulawayo City Council to present revised plan for water utility formation",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-to-present-revised-plan-for-water-utility-formation/",
            "content": "Online Writer\n\nTHE City of Bulawayo is set to present a revised document on the formation of a water utility at a consultative meeting scheduled for Thursday, 6 March 2025.The meeting, which will take place at 11am in the Council Chambers, follows a resolution made during a previous engagement with Civic Society Organisations (CSOs) on Friday, 7 February 2025.\n\nDuring the February meeting, the City and a selected group of CSO representatives agreed to collaborate on finalising an information pack outlining the proposed water utility. This initiative aims to address the citys longstanding water challenges and improve service delivery to residents.\n\nThe upcoming meeting will be attended the Mayor David Coltart, Councillors, representatives of Civic Society Organisations, and members of the media. The city has extended an invitation to all stakeholders to participate in this critical discussion.\n\nMs Bongiwe Ngwenya, Corporate Communications Officer for the City of Bulawayo, emphasised the importance of the meeting, saying: This is a pivotal step towards ensuring sustainable water management and service provision for the city. We encourage all stakeholders to attend and contribute to this vital process.\n\nThe formation of a dedicated water utility is seen as a key strategy to enhance efficiency, accountability, and transparency in water resource management. The revised document to be presented on 6 March is expected to outline the proposed structure, funding mechanisms, and operational framework for the utility.\n\nThis development comes against the backdrop of Bulawayos persistent water shortages, which have been exacerbated by ageing infrastructure and climate change-induced droughts. The City has been exploring long-term solutions to ensure reliable water supply for its growing population.\n\nStakeholders are urged to attend the meeting and provide input to ensure the proposed water utility meets the needs of all residents.Bulawayo, Zimbabwes second-largest city, has faced chronic water shortages for years, with residents enduring prolonged water rationing. The City Council has been exploring various strategies to address the crisis, including the establishment of an independent water utility. The proposed utility is expected to streamline operations, attract investment, and improve service delivery.\n\nThe consultative process with CSOs and other stakeholders underscores the Citys commitment to inclusive and participatory governance.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bdfzbxcvzdxcv.jpg",
            "description": "Online Writer THE City of Bulawayo is set to present a revised document on the formation of a water utility at a consultative meeting scheduled for Thursday, 6 March 2025. The meeting, which will take place at 11am in the Council Chambers, follows a resolution made during a previous engagement with Civic Society Organisations (CSOs) […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Hwange Man Guilty of Property Damage",
            "url": "https://www.chronicle.co.zw/hwange-man-guilty-of-property-damage/",
            "content": "Langelihle Nyathi,[emailprotected]\n\nA 39-YEAR-OLD man from Makwila Village, Hwange, has been sentenced to 103 hours of community service for malicious damage to his neighbours property.\n\nEdmore Muleya (39) is said to have thrown stones at Siphathisiwe Mathes house around 9pm on 25 January 2025.\n\nAccording to the National Prosecuting Authority (NPA) on X, the stones caused damage to 14 asbestos sheets, a grey deep freezer, a green bucket, and a door, with losses totalling US$614.\n\nMathe was reportedly praying when the incident occurred. She reported the matter to the police, leading to Muleyas arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Langelihle Nyathi, langae2001@gmail.com A 39-YEAR-OLD man from Makwila Village, Hwange, has been sentenced to 103 hours of community service for malicious damage to his neighbour’s property. Edmore Muleya (39) is said to have thrown stones at Siphathisiwe Mathe’s house around 9pm on 25 January 2025. According to the National Prosecuting Authority (NPA) on X, the […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Over 20 000 Beitbridge rural homes to get solar power",
            "url": "https://www.chronicle.co.zw/over-20-000-beitbridge-rural-homes-to-get-solar-power/",
            "content": "Over 20 000 Beitbridge rural homes to get solar power\n\nThupeyo Muleya, Beitbridge Bureau\n\nAT least 22 000 rural households across the Beitbridge district are set to be connected to solar energy under the Presidential Rural Solarisation project over the next six years, with the roll-out expected to begin at the end of this month.\n\nThe project aims to provide solar power to at least 3 700 households annually in the district during the implementation period.\n\nCabinet recently approved the Governments plan to roll out the project in 1,2 million households across all eight rural provinces.\n\nThis initiative is expected to enhance energy access, improve living conditions, and promote sustainable development in rural communities.\n\nThe project is part of the broader Rural Development 8.0 Strategy, which aims to uplift rural livelihoods, enhance agricultural productivity, and boost food security.\n\nThe Rural Infrastructural Development Agency (RIDA) is overseeing the implementation of the project through an Inter-Ministerial Steering Committee, comprising experts from local universities.\n\nRIDA coordinator for Beitbridge, Mr Tinashe Ngundu, said during an inception meeting on Tuesday that significant progress had already been made in terms of logistics ahead of the full implementation.\n\nWe expect to launch the project at the end of March and are currently holding inception and sensitisation meetings with the Rural District Development Committee members and key stakeholders, with the help of the District Development Coordinator, said Mr Ngundu.\n\nHe added that the project will be financed by the Government, while other stakeholders will provide affordable advanced solar technologies.\n\nThis includes batteries, inverters, solar panels, and cables to power gadgets such as light bulbs, radios, televisions, phone chargers, laptops, small refrigerators, submersible pumps (for boreholes), and Wireless Fidelity (Wi-Fi) services.\n\nUnder this initiative, local youths and women will be trained to participate in the installation programmes implemented in villages across the district. This will boost a lifelong skills transfer programme and also help with the maintenance of the facilities by those trained by our teams, said Mr Ngundu.\n\nThe beneficiaries, including traditional leaders, war veterans, vulnerable members of the community, and ordinary villagers, are set to benefit from this initiative over the six-year implementation period.\n\nThis project is a key intervention expected to boost domestic productivity, create employment opportunities, and promote self-sustenance in our rural communities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/Solar-panels-at-Nkulumane-Clinic-in-Bulawayo-For-renewable-energy-feature.jpg",
            "description": "Over 20 000 Beitbridge rural homes to get solar power Thupeyo Muleya, Beitbridge Bureau AT least 22 000 rural households across the Beitbridge district are set to be connected to solar energy under the Presidential Rural Solarisation project over the next six years, with the roll-out expected to begin at the end of this month. […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Simba Bhora to face FC Platinum in Independence Cup Final",
            "url": "https://www.chronicle.co.zw/simba-bhora-to-face-fc-platinum-in-independence-cup-final/",
            "content": "Innocent Kurira,[emailprotected]DEFENDING champions Simba Bhora are set to play FC Platinum in this years Independence Cup final, which will be held at the Nembudziya Growth Point Open Ground in Gokwe North, where national celebrations will take place.In keeping with the Second Republics initiative to hold national events rotationally across the countrys provinces, the 45th Independence Anniversary Celebrations will take place in Gokwe North.According to a post-cabinet briefing by Minister of Information, Publicity, and Broadcasting Services, Jenfan Muswere, the celebrations will run under the theme, Zim@ 45: Devolve and Develop Together towards Vision 2030. The celebrations are expected to attract 60,000 people.Simba Bhora and FC Platinum football clubs will entertain the crowds during the main Independence Day anniversary celebrations, while Herentals Queens and Black Rhinos Football Clubs will play as the first and second-placed teams in the Premier League during the 2025 Childrens Party celebrations, Muswere said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-2.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw DEFENDING champions Simba Bhora are set to play FC Platinum in this year’s Independence Cup final, which will be held at the Nembudziya Growth Point Open Ground in Gokwe North, where national celebrations will take place. In keeping with the Second Republic’s initiative to hold national events rotationally across the country’s provinces, the […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Police investigate murder of unidentified man",
            "url": "https://www.chronicle.co.zw/police-investigate-murder-of-unidentified-man/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nPOLICE in Harare have launched an investigation into the murder of an unidentified man whose body was found along the Harare-Bulawayo Road in Dzivarasekwa on 28 February 2025.\n\nThe victim, who had a deep cut on his head, was discovered lying in the grass.\n\nIn a statement on X, the police said the man was wearing a grey tracksuit with maroon stripes, black jeans, black shorts with yellow stripes, a dark green jacket, and a white T-shirt.\n\nPolice are appealing to anyone with information about the victims identity or the circumstances surrounding his death to come forward and report to the nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com POLICE in Harare have launched an investigation into the murder of an unidentified man whose body was found along the Harare-Bulawayo Road in Dzivarasekwa on 28 February 2025. The victim, who had a deep cut on his head, was discovered lying in the grass. In a statement on X, the police said […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Man breaks neighbour’s wrist in assault over missing money",
            "url": "https://www.chronicle.co.zw/man-breaks-neighbours-wrist-in-assault-over-missing-money/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA 25-YEAR-OLD man from Makwika Village in Hwange has been sentenced to 10 months in prison for assaulting his neighbour, Mr Njabulo Mahlangu, aged 38.\n\nThe incident occurred on 9 February 2025, after Leviticus Sichoni suspected Mr Mahlangu of stealing money from his phone pouch.\n\nIn a fit of rage, Sichoni attacked Mahlangu with a stick, leaving him with serious injuries.\n\nAccording to a statement by the National Prosecuting Authority (NPA) on X, Mahlangu sustained a fractured left wrist and a cut on his left eyebrow.\n\nHe was treated at St. Patricks Hospital.\n\nSichoni was sentenced to 10 months in prison.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/02/cuffs.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A 25-YEAR-OLD man from Makwika Village in Hwange has been sentenced to 10 months in prison for assaulting his neighbour, Mr Njabulo Mahlangu, aged 38. The incident occurred on 9 February 2025, after Leviticus Sichoni suspected Mr Mahlangu of stealing money from his phone pouch. In a fit of rage, Sichoni attacked […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Msiz’kay reminisces about sharing the stage with Blaq Diamond",
            "url": "https://www.chronicle.co.zw/msizkay-reminisces-about-sharing-the-stage-with-blaq-diamond/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nBulawayo-based musician Msizkay has described sharing the stage with South African superstar duo Blaq Diamond in Victoria Falls as a dream come true in his career.\n\nThe artiste was among the 200 alumni selected to attend the Southern Africa US Exchange Alumni Summit, which was held last week in the resort city.\n\nRiding on the success of his latest hit Khethomthandayo, Msizkay said the event provided a valuable opportunity to network and learn from incredible individuals across the SADC region.Sharing the stage with Blaq Diamond was an out-of-this-world experience. The Victoria Falls crowd was warm and welcoming, and the chance to interact with the legendary Blaq Diamond duo was beyond amazing.\n\nHe expressed deep gratitude for being part of the inaugural event, describing it as a humbling experience.I feel honoured to have been considered for such a unique and ground-breaking event. While in Victoria Falls, I also enjoyed the incredible @simunye.live theatre production, which I thoroughly enjoyed. Visiting the majestic Victoria Falls and witnessing its wonder and magic first-hand was mind-blowing. Last week was nothing short of a dream, said Msizkay.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/msiziblaq.jpg",
            "description": "Mthabisi Tshuma,revmmthiretshuma@gmail.com Bulawayo-based musician Msiz’kay has described sharing the stage with South African superstar duo Blaq Diamond in Victoria Falls as a dream come true in his career. The artiste was among the 200 alumni selected to attend the Southern Africa US Exchange Alumni Summit, which was held last week in the resort city. Riding […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Kadoma woman jailed as crackdown on Ganja smuggling intensifies",
            "url": "https://www.chronicle.co.zw/kadoma-woman-jailed-as-crackdown-on-ganja-smuggling-intensifies/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA 33-YEAR-OLD woman from Ingezi suburb in Kadoma has been jailed for an effective two and a half years by a Beitbridge magistrates court, as authorities continue their crackdown on the illegal drug trade and smuggling between South Africa and Zimbabwe.\n\nSphelile Kufa was convicted on her own plea of guilty when she appeared before Beitbridge Resident Magistrate Mr. Takudzwa Gwazemba on Tuesday. She was charged with contravening a section of the Criminal Law Codification and Reform Act (Chapter 9:23).\n\nShe was sentenced to 30 months imprisonment after the trial magistrate set aside six months of the three-year sentence conditionally for five years.\n\nThe 6,2kg of marijuana (mbanje) was forfeited to the State as part of the sentence.\n\nProsecuting, Ms Tinayeishe Matenga told the court that on 3 March, at around 1 pm, police detectives on patrol received a tip-off about Kufa transporting marijuana that had allegedly been smuggled into Zimbabwe from South Africa.\n\nThey tracked the accused to the Masvingo turn-off, where she was flagging down lifts to Kadoma. The police searched her luggage, leading to the discovery of three well-wrapped packets of marijuana. She was arrested, and the contraband was taken for weighing at the local post office.\n\nIt was discovered that the three packages weighed a combined 6.260 kilograms, with an estimated street value of US$626.\n\nMeanwhile, the police are still pursuing the driver of a South African commercial truck who fled after the discovery of 163kg of marijuana he had smuggled into Zimbabwe on Sunday.\n\nThe smuggling of marijuana from South Africa via the Beitbridge border post has been increasing in recent weeks, forcing border authorities to tighten controls on the movement of cargo and travelers to weed out drug peddlers and those shipping prohibited goods.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/09/jailed.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A 33-YEAR-OLD woman from Ingezi suburb in Kadoma has been jailed for an effective two and a half years by a Beitbridge magistrate’s court, as authorities continue their crackdown on the illegal drug trade and smuggling between South Africa and Zimbabwe. Sphelile Kufa was convicted on her own plea of guilty […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        },
        {
            "title": "Suspected Bulawayo drug dealer to face bail hearing over possession of broncleer and dagga",
            "url": "https://www.chronicle.co.zw/suspected-bulawayo-drug-dealer-to-face-bail-hearing-over-possession-of-broncleer-and-dagga/",
            "content": "Lesley Chikudo,[emailprotected]\n\nTHE Western Commonage Magistrate Court will on Tuesday hear the bail application of a suspected Bulawayo drug dealer, Elton Ndlovu, who was found in possession of several bottles of Broncleer cough syrup and dagga following a police raid at his home.\n\nNdlovu appeared before Western Commonage Magistrate Mr. Mehluli Moyo, facing two counts of unlawful possession of controlled substances, in violation of Section 73 (1) of the Medicine and Allied Substances Control General Regulations SI 150/91, as read with Section 38 of the Medicines and Allied Substances Control Act.\n\nProsecuting, Ms Audrey Kufandikanwe told the court that on 14 February, at around 8pm, detectives from the Criminal Investigations Department (CID) Drugs and Narcotics, in conjunction with officers from ZRP Entumbane, received information that Ndlovu had illegal drugs at his house in Entumbane.\n\nActing on the tip-off, law enforcement agents proceeded to his house, conducted a search, and recovered 40 bottles of 100ml Broncleer cough syrup containing codeine. The seized bottles had an estimated street value of US$200.\n\nIn addition to the cough syrup, police also discovered loose dagga weighing 556g hidden in the house, with a street value of US$100. Ndlovu was immediately arrested.\n\nBroncleer, commonly known as Bronco, is a codeine-based cough syrup often abused for its intoxicating effects. It has become a drug of choice among young people, leading authorities to intensify crackdowns on its illegal distribution. Similarly, dagga (marijuana) remains a controlled substance in Zimbabwe, with strict penalties for those found in possession without authorisation.\n\nAuthorities have urged communities to report drug-related activities to help curb substance abuse, which continues to be a significant problem in urban areas like Bulawayo.\n\nEnds\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Drug-abuse.jpg",
            "description": "Lesley Chikudo,chikudolesley@gmail.com THE Western Commonage Magistrate Court will on Tuesday hear the bail application of a suspected Bulawayo drug dealer, Elton Ndlovu, who was found in possession of several bottles of Broncleer cough syrup and dagga following a police raid at his home. Ndlovu appeared before Western Commonage Magistrate Mr. Mehluli Moyo, facing two counts […]",
            "time": "18:37",
            "date": "04 Mar 2025"
        }
    ]
}