{
    "news": [
        {
            "title": "Unisa rejects Prophet Walter Magaya’s claims of graduation and honorary doctorate",
            "url": "https://www.chronicle.co.zw/unisa-rejects-prophet-walter-magayas-claims-of-graduation-and-honorary-doctorate/",
            "content": "University of South Africa (Unisa) has firmly rejected recent claims made by clergy and businessman Walter Magaya that he is a graduate and an honorary doctorate recipient from the institution.\n\nIn a statement, the university expressed concern over the spread of the false claims which have gained significant attention, particularly through a video circulating on social media.\n\nMagaya, who has been at the centre of various controversies, was seen in the video alleging that he had graduated from Unisa and received an honorary doctorate from the university.\n\nUnisas media affairs office said they had thoroughly checked their records and found no evidence to support Magayas claims.\n\nBased on the information provided, the system of the university could not find any record showing that Mr Magaya was ever registered or graduated with Unisa, reads the statement.\n\nThis means that Unisa does not have Mr Magaya as a student or a graduate. Any certificate he may present claiming to be from Unisa is fraudulent.\n\nThe university also categorically denied Magayas claim of receiving an honorary doctorate.\n\nUnisa has never conferred any honorary doctorate upon Mr Magaya. We strongly condemn this false assertion.\n\nUnisa expressed alarm at the damage such misinformation could cause to its reputation and emphasised that it would take the necessary legal steps to address the situation.\n\nWe believe that conduct of this nature damages and brings our brand into disrepute, and we reserve the right to take appropriate corrective action, reads the statement.\n\nThe university further confirmed that relevant authorities have been instructed to initiate legal proceedings against those spreading false claims about the institutions affiliation with Magaya.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Leader-of-PHD-Ministries-church-in-Zimbabwe-self-proclaimed-prophet-Walter-Magaya-insists-he-was-given-a-PhD-by-Unisa-but-the-university-has-rubbished-the-claims-680x380.jpeg",
            "description": "Harare Bureau University of South Africa (Unisa) has firmly rejected recent claims made by clergy and businessman Walter Magaya that he is a graduate and an honorary doctorate recipient from the institution. In a statement, the university expressed concern over the spread of the false claims which have gained significant attention, particularly through a video […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Eight men, including teen, up for US$283,000 copper cable theft",
            "url": "https://www.chronicle.co.zw/eight-men-including-teen-up-for-us283000-copper-cable-theft/",
            "content": "[emailprotected]\n\nEIGHT men, including a teenager, appeared in court today for stealing 60 metres of armoured copper cables valued at US$283,000 from the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) Richmond substation in Bulawayo.\n\nRonald Moyo (32), Qhubekani Nyathi (28), Kudakwashe Ndlovu, Eddie Mishiri Dube (20), Tafadzwa Ncube (18), Sydney Moyo (22), Prince Ntonga (35), and Simon Chamhudze (36) devised a plan to steal the cables from the ZETDC Glenview substation in Richmond suburb.\n\nThey were apprehended after Ntonga and Chamhudze were caught with 92 kilograms of copper, which they could not account for by producing a licence. The two are facing a separate charge of possessing the copper cables without a licence.\n\nThe apprehension of Ntonga and Chamhudze led to the discovery of the theft they committed with the other accused persons at the Richmond substation.\n\nThe eight briefly appeared before Bulawayo Regional Magistrate Mr Joseph Mabeza, charged with violating The Electricity Act. They were remanded in custody until tomorrow.\n\nFor the State, Mr Dominic Moyo stated that on 25 January, the eight accused hatched a plan to steal the copper cables from the ZETDC Glenville substation in Richmond.\n\nAt around 8 PM, they proceeded there and, upon arrival, used a ladder to break into the station. While inside, they used a hacksaw and a bolt cutter to cut the 60 metres of 185 mm three-core armoured copper cable that was installed to distribute electricity from the substation to Richmond suburb, said Mr Moyo.\n\nThe eight dragged the cables out of the substation and made off with them.\n\nOn the morning of 27 January, Ntonga and Chamhudze were caught with burnt armoured copper cables after police requested to search their Toyota Hilux at Ages Industrial Solutions near Kelvin West.\n\nThe cables weighed 198 kilograms at Zimpost. An engineer from ZETDC discovered that the cables were the companys property used in the distribution of electricity.\n\nThe total cut and burnt armoured copper cables are valued at US$283,000, said Mr Moyo.\n\nThe police recovered the overhead cables, the car, a makeshift ladder, and a bolt cutter, which will be presented in court as evidence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/COPPER.jpg",
            "description": "Trish Mukwazo trishmukwazo515@gmail.com EIGHT men, including a teenager, appeared in court today for stealing 60 metres of armoured copper cables valued at US$283,000 from the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) Richmond substation in Bulawayo. Ronald Moyo (32), Qhubekani Nyathi (28), Kudakwashe Ndlovu, Eddie Mishiri Dube (20), Tafadzwa Ncube (18), Sydney Moyo (22), Prince […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Prosecutor in court for extortion",
            "url": "https://www.chronicle.co.zw/prosecutor-in-court-for-extortion/",
            "content": "Online Reporter\n\nA public prosecutor stationed at Guruve Magistrates Court has appeared before the same court for extorting an accused persons relative.\n\nYolanda Alufasi (32) was facing extortion charges when she appeared in court. She was released on US$150 bail and was ordered to surrender her passport, reside at her given address, and report weekly to the Zimbabwe Republic Police Chiwaridzo.\n\nThe court heard that between January 19 and 27, 2025, Alufasi allegedly demanded US$200 from Chiedza Mutunami saying she could fast track the release of Innocent Mutunamis docket from the police and facilitate his bail application.\n\nInnocent was in remand prison on charges of motor vehicle theft and Chiedza is his sister.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Online Reporter A public prosecutor stationed at Guruve Magistrates’ Court has appeared before the same court for extorting an accused person’s relative. Yolanda Alufasi (32) was facing extortion charges when she appeared in court. She was released on US$150 bail and was ordered to surrender her passport, reside at her given address, and report weekly […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Nkayi freedom fighter declared liberation war hero",
            "url": "https://www.chronicle.co.zw/nkayi-freedom-fighter-declared-liberation-war-hero/",
            "content": "Leonard Ncube[emailprotected]\n\nZANU-PF provincial member Cde Zayere Elias Mavule of Nkayi has died and declared a liberation war hero. He was 78.\n\nCde Mavule from Gezekhaya Village in Nkayis Ward 5 under Chief Madliwa, died on Sunday. He was also a provincial member of the Matabeleland North War Veterans Association.\n\nIn a statement, the party said: He passed on, on the 26th of January and was declared a Liberation War Hero. He will be buried on Thursday 30 January 2025 at his homestead.\n\nCde Mavule was born on 28 December 1947. He did his education at Gwitshi Primary School from Sub A to Standard 6.\n\nAfter school he worked at Home Furnitures in Bulawayo for seven years starting in 1965. He left the job in 1972 and became self employed. He joined the liberation war as a freedom fighter in 1977.\n\nHe returned into the country after independence after cease fire and demobilised form the army in 1982 when he went to stay in his rural area as a Zapu member.\n\nHe was in Zapu structures until the Unity Accord in 1987 when he became a Zanu-PF member and rose through the ranks from Cell until he became a provincial member.\n\nHe was also in the War Veterans Association provincial structures. Cde Mavule is survived by his wife and 16 children, 34 grand children and seven great-grandchildren.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/qwerty.jpg",
            "description": "Leonard Ncube leonard.ncube@chronicle.co.zw ZANU-PF provincial member Cde Zayere Elias Mavule of Nkayi has died and declared a liberation war hero. He was 78. Cde Mavule from Gezekhaya Village in Nkayi’s Ward 5 under Chief Madliwa, died on Sunday. He was also a provincial member of the Matabeleland North War Veterans Association. In a statement, the […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Government takes action against gender-based violence",
            "url": "https://www.chronicle.co.zw/government-takes-action-against-gender-based-violence/",
            "content": "The Government is committed to creating a more equitable society through the regulation of progressive laws and policies that promote gender equality, Women Affairs, Community, Small and Medium Enterprise Development MinisterMonica Mutsvangwa has said.\n\nMinister Mutsvangwa said this while addressing participants who took part in a march from Rainbow Towers to Town House in Harare today (Wednesday).\n\nThe event was organised by the European Union Delegation to Zimbabwe and UN Women, in partnership with Team Europe.\n\nMinister Mutsvangwa said the event was crucial as it served as one of the commemorative activities of the Beijing +30 Campaign, following Zimbabwes launch of the campaign on December 9, 2024.\n\nThe minister highlighted that this year marks the thirtieth anniversary of the Fourth World Conference on Women (Beijing 1995) and the adoption of the Beijing Declaration and Platform for Action.\n\nThe Beijing Declaration and Platform for Action, adopted at the Fourth World Conference on Women in 1995, outlines a comprehensive roadmap for achieving gender equality and womens empowerment. It addresses 12 key areas, she said.\n\nThe HeForShe solidarity march is a significant initiative that highlights the crucial involvement of men in our shared efforts to attain gender equality and eliminate gender-based violence (GBV). GBV is a widespread problem that demands the active participation of everyone, especially men and boys, she said.\n\nThe minister urged stakeholders to join hands in eradicating gender inequality.\n\nTogether, we must challenge societal norms that perpetuate violence and create environments where women and girls can navigate public spaces with confidence and dignity, free from fear.\n\nWhile the 16 Days of Activism Against Gender-Based Violence is celebrated each year from November 25 to December 10, conducting this initiative today reflects our understanding that the fight against GBV is not confined to a specific timeframe, she said.\n\nThe minister stressed that in 2021, the Government of Zimbabwe committed to ending GBV by officially launching the first-ever High-Level Political Compact (HLPC) on Ending Gender-Based Violence and Harmful Practices (2021-2030).\n\nThe incoming #HeForShe co-chair, Canadian Ambassador to Zimbabwe Adler Aristide said they are committed to providing more support for the advancement of gender equality in Zimbabwe.\n\nI see it as an opportunity for me to commit to promoting gender equality in all spaces, both physical and online, that I have access to by virtue of my position as the Ambassador of Canada, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/TT11.jpg",
            "description": "Harare Bureau The Government is committed to creating a more equitable society through the regulation of progressive laws and policies that promote gender equality, Women Affairs, Community, Small and Medium Enterprise Development Minister Monica Mutsvangwa has said. Minister Mutsvangwa said this while addressing participants who took part in a march from Rainbow Towers to Town House […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Insiza district vendors take Councillor to court for allegedly embezzling licence fees",
            "url": "https://www.chronicle.co.zw/insiza-district-vendors-take-councillor-to-court-for-allegedly-embezzling-licence-fees/",
            "content": "Trish Mukwazo,[emailprotected]\n\nA GROUP of vendors from Insiza District today dragged their ward councillor to court after she allegedly collected money from them on the pretext of awarding them vending licences.\n\nWard 23 Councillor Nomusa Moyo appeared before Bulawayo Regional Magistrate Mr Joseph Mabeza, accused of criminal abuse of duty as a public officer.\n\nShe allegedly collected money amounting to US$933 from 13 vendors as vending licence fees. The vendors never received the licences, prompting them to report the matter to the police.\n\nMoyo was represented by Prince Butshe Dube of Mathonsi Ncube Law Chambers.\n\nMoyo is set to appear in court on 19 February for the continuation of the trial, where other witnesses are expected to testify.\n\nThree vendors took to the stand in court, narrating how they paid their money to the councillor in the hope of receiving a vending licence but never did.\n\nFor the State, Dominic Moyo told the court that from 1 May to 18 October last year, at Shangani Business Centre in Fort Rixon, the accused abused her duties as a public officer when she collected a total of US$933 from the 13 vendors and later converted the money for her personal use, prompting them to report the matter to the police.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/5-usd-court.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com A GROUP of vendors from Insiza District today dragged their ward councillor to court after she allegedly collected money from them on the pretext of awarding them vending licences. Ward 23 Councillor Nomusa Moyo appeared before Bulawayo Regional Magistrate Mr Joseph Mabeza, accused of criminal abuse of duty as a public officer. She […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "State presses more charges against gun-wielding Chinese nationals",
            "url": "https://www.chronicle.co.zw/state-presses-more-charges-against-gun-wielding-chinese-nationals/",
            "content": "Trish Mukwazo,[emailprotected]\n\nTHE State has pressed more charges against Chinese nationals who were arrested for allegedly pointing a gun at their employee at a Gweru farm where they also fired three shots in the air during a confrontation over unpaid wages.\n\nKholwani Dube (38), who was employed as an excavator operator, has also been arrested after he allegedly stabbed his boss Liu Haikeng on the leg during the scuffle, resulting in him firing three warning shots. Liu has since been remanded in custody to 7 February.\n\nWang Jun, also a Chinese national who intervened in the scuffle by pressing Dubes head to the ground and also pointing the firearm at him has also been remanded in custody to the same date.\n\nLiu and Wang appeared in Gweru Magistrates Court yesterday. Haikeng is facing charges of unlawful use of explosives without a blasting license and conducting illegal gold prospecting at Bijou Farm without a permit while Wang is facing three charges under the Explosives, Mines and Minerals Act.\n\nIt is alleged that that on 21 January this year at Bijou Farm in Gweru Haikeng fired three shots using a Canik pistol towards Kholwani Dube after he barged into the farm demanding to get his unpaid wages of US$600.\n\nAccording to the National Prosecuting Authority (NPA), Haikeng is alleged to have unlawfully used explosives without a blasting license in 2024 and was also charged for illegal gold prospecting at Bijou Farm without a permit.\n\nWang is alleged to have intervened in the scuffle by pressing Dubes head to the ground and pointing a firearm at him.\n\nIn 2024, the accused person is alleged to have used explosives without a blasting license at Bijou Farm and is also alleged to have excavated and blasted the ground at Bijou Farm without a Permit, the NPA said.\n\nThe incident, which occurred at the farm owned by Ming Chang Sino-Africa Mining Investments, went viral on social media platforms with videos showing the worker, Dube, demanding unpaid wages while shouting: Give me my money. I want my money. Shoot me!\n\nAccording to close sources, Dube had gone to the mine demanding US$600 in unpaid wages. Upon arrival, he was informed of his dismissal, sparking a heated argument with his supervisors.\n\nDube came to work demanding his dues, but his bosses refused to pay him, leading to the confrontation, said an employee who requested anonymity.\n\nFollowing the incident the Ming Chang Sino-Africa Mining Investments released a statement providing their account of the incident.\n\nThe company alleged that Dube had been warned and suspended for repeatedly disregarding instructions from his supervisors. Despite this, he reportedly seized the keys to an excavator and drove it toward two supervisors, endangering employees and equipment.\n\nMr Dube even attempted to run over the manager with the excavator, putting other employees and assets at risk, read the statement.\n\nThe company claimed that Mr Liu Haifeng, the farm manager, fired a warning shot into the air to de-escalate the situation. However, the confrontation escalated into a physical altercation during which Dube allegedly stabbed Mr Liu in the leg.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Chinese.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com THE State has pressed more charges against Chinese nationals who were arrested for allegedly pointing a gun at their employee at a Gweru farm where they also fired three shots in the air during a confrontation over unpaid wages. Kholwani Dube (38), who was employed as an excavator operator, has also been arrested […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "WATCH: Multitudes of Illegal gold miners invade Rhodes Estate",
            "url": "https://www.chronicle.co.zw/watch-multitudes-of-illegal-gold-miners-invade-rhodes-estate/",
            "content": "Raymond Jaravaza, Online Reporter\n\nMultitudes of illegal gold miners have invaded the largest pedigree cattle farm in the country, the Rhodes Estate in Matabeleland South Province.\n\nThe illegal panners continue to dig hundreds of pits on the farm in search of gold, leaving deep trenches into which cattle have been falling and dying.\n\nOn Wednesday, the Matabeleland South Minister of State for Provincial Affairs and Devolution, Dr Evelyn Ndlovu, toured the farm to gain a first-hand understanding of the damage caused by illegal mining activities.\n\nIn the video below, illegal miners hoist a fellow miner from a deep pit where they were digging for the precious mineral.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gold-panners.jpg",
            "description": "Raymond Jaravaza, Online Reporter  Multitudes of illegal gold miners have invaded the largest pedigree cattle farm in the country, the Rhodes Estate in Matabeleland South Province. The illegal panners continue to dig hundreds of pits on the farm in search of gold, leaving deep trenches into which cattle have been falling and dying. On Wednesday, […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Police bust second hand clothes smugglers in Kwekwe",
            "url": "https://www.chronicle.co.zw/police-bust-second-hand-clothes-smugglers-in-kwekwe/",
            "content": "Midlands Bureau\n\nPOLICE in Kwekwe have arrested three suspected second hand clothes smugglers leading to the recovery of 14 bales.\n\nMidlands Provincial police spokesperson Inspector Emmanuel Mahoko said the 14 second hand clothes bales were recovered from a bus at a police road block last week.\n\nZimbabwe Republic Police Midlands is updating the public on progress of an operation against smuggling of goods, launched in December 2024 by the Government, said Insp Mahoko.\n\nOur latest arrest for Kwekwe happened on 24 January 2025. A total 14 bales of second-hand goods were recovered from two buses owned by Triptrans Bus Company.\n\nInsp Mahoko said three people were arrested after being identified to have had smuggled the goods and were charged for contravening section 38 (1) of The Customs and Exercise Act, Chapter 23.02.\n\nThe suspects are Eliaza Ndlovu (35) of Malbereign, Harare, Tinashe Sevenzayi (31) of Magwegwe, Bulawayo and Bonita Dozva (42) of Hatfield, Harare.\n\nThey all paid fines  US$800, ZWG1 812 and ZWG 6000 respectively, he said.\n\nInsp Mahoko said the anti-smuggling operation in Kwekwe is being spearheaded by Criminal Investigation Department, Police Intelligence and Operations sections of Zimbabwe Republic Police in conjunction with Zimbabwe Revenue Authority.\n\nPeople who intend to import goods into the country for personal use or for business purposes are called upon to abide by the countrys laws governing importation of goods. The operation is going ahead, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/klklpj.jpg",
            "description": "Midlands Bureau   POLICE in Kwekwe have arrested three suspected second hand clothes smugglers leading to the recovery of 14 bales. Midlands Provincial police spokesperson Inspector Emmanuel Mahoko said the 14 second hand clothes bales were recovered from a bus at a police road block last week. “Zimbabwe Republic Police Midlands is updating the public […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        },
        {
            "title": "Watch : Government incentives to boost manufacturing sector – Professor Mthuli Ncube",
            "url": "https://www.chronicle.co.zw/watch-government-incentives-to-boost-manufacturing-sector-professor-mthuli-ncube/",
            "content": "Senior Business Writer\n\nFINANCE, Economic Development, and Investment Minister Professor Mthuli Ncube on Wednesday said it is critical for the Government to support the manufacturing sector as it has the potential to create employment and generate revenue for the economy.\n\nSpeaking after touring the Zimbabwe Stock Exchange (ZSE)  listed Pro Plastics, a leading manufacturer of plastic pipes and fittings in Harare, Prof Ncube said several incentives exits for the sector.\n\nHe referred to the Value added Tax deferment which enables companies to import retooling equipment\n\nProf Ncube hailed the companys productive capacity and automation efforts and also expressed optimism about the countrys business environment, predicting improvements that could double Pro Plastics turnover.\n\nWith a turnover of US$25 million, Pro Plastics has been a key supplier of high-performance piping solutions to various sectors in Zimbabwe, such as mining and construction, the ministry said on its X account.\n\nThe company produces polyvinyl chloride (PVC), High-Density Polyethylene (HDPE), Low-density Polyethylene (LDPE) pipes and related fittings.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/t554gew.jpg",
            "description": "Senior Business Writer FINANCE, Economic Development, and Investment Minister Professor Mthuli Ncube on Wednesday said it is critical for the Government to support the manufacturing sector as it has the potential to create employment and generate revenue for the economy. Speaking after touring the Zimbabwe Stock Exchange (ZSE) – listed Pro Plastics, a leading manufacturer […]",
            "time": "20:25",
            "date": "29 Jan 2025"
        }
    ]
}