{
    "news": [
        {
            "title": "Mainline FC fans outcry: “We are unhappy with the new team set up.”",
            "url": "https://www.chronicle.co.zw/mainline-fc-fans-outcry-we-are-unhappy-with-the-new-team-set-up/",
            "content": "Ronald Mpofu[emailprotected]\n\nPLUMTREES Mainline FC holds its only hope for football, but fans are left disheartened after a goalless draw against Victoria Falls City FC yesterday.\n\nThe Zimbabwe Football Association (ZIFA) Division 1 Southern Region League is in its second week, with Mainline FC having already played two matches: losing 5-1 to Casmyn FC at Turkmine Stadium and drawing 0-0 against Victoria Falls City FC at their home ground, Dingumuzi Stadium in Plumtree.\n\nMainline FC currently occupies 13th position on the league table with just 1 point, and their recent home match saw a disappointing turnout from supporters.\n\nIn an interview, the newly appointed head coach for Mainline FC, Siza Mguni said Its one of those games of two halves. They had a chance to steal it first half, thanks to our slow start. We came back stronger and a better side. Second half, we just couldnt see the ball across the line. Not the result we wanted but coming back from a loss last weekend, we take the point and look forward positively to the next game.\n\nMainline FC is set to face Talen Vision on their next match. The team is yet awaiting for an update from ZIFA on where and when the match will played.\n\nIrene Mwanza the Head coach for Victoria Falls City FC said her team created more chances to win, but the opponents defence was strong. We created a lot of chances, I wish we could have won this game. I was appointed Head Coach for this team in September last year. Our 2nd coach is Zivanayi Chawanji and Innocent Ndlovu is our 3rd coach. She Said\n\nI am also so excited as I recently received a call from ZIFA to be an Under 20 girls assistant coach for the national team. She added.\n\nMainline fans expressed disappointment after the draw against Victoria Falls City FC, with many nostalgically stating, We miss Gumede, referring to the teams former head coach.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vgt.jpg",
            "description": "Ronald Mpofu itsronaldrox@gmail.com PLUMTREE’S Mainline FC holds its only hope for football, but fans are left disheartened after a goalless draw against Victoria Falls City FC yesterday. The Zimbabwe Football Association (ZIFA) Division 1 Southern Region League is in its second week, with Mainline FC having already played two matches: losing 5-1 to Casmyn FC […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "WATCH: Hospitality sector eyes growth at ZITF, showcases new offerings",
            "url": "https://www.chronicle.co.zw/watch-hospitality-sector-eyes-growth-at-zitf-showcases-new-offerings/",
            "content": "Nqobile Bhebhe,Zimpapers Business Hub\n\nTHE hospitality sector is aiming to capitalise on the Zimbabwe International Trade Fair (ZITF) which kicks off in Bulawayo on Monday to unveil new offerings and reinforce its role as a key driver of the national Gross Domestic Product (GDP).\n\nThis years Sapphire edition is held under the theme, Industrialisation: Crafting an Integrated Economic Landscape.\n\nSpeaking to the Zimpapers Business Hub at the ZITF exhibition park on Sunday, Tourism and Hospitality Industry Deputy Minister Tongai Mnangagwa stressed the importance of industry participation in such events.\n\nIt is very important to be part of such events where we can showcase our new products, hotels, restaurants, and activities that we are developing within the tourism industry, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-20-at-16.40.47-680x380.jpeg",
            "description": "  Nqobile Bhebhe, Zimpapers Business Hub   THE hospitality sector is aiming to capitalise on the Zimbabwe International Trade Fair (ZITF) which kicks off in Bulawayo on Monday to unveil new offerings and reinforce its role as a key driver of the national Gross Domestic Product (GDP). This year’s Sapphire edition is held under the theme, […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Faith key to national healing – President Mnangagwa",
            "url": "https://www.chronicle.co.zw/faith-key-to-national-healing-president-mnangagwa/",
            "content": "Blessings Chidakwa in Masvingo\n\nThe churchs role as a key pillar in nation building took centre stage as President Mnangagwa addressed thousands of congregants at the 2025 Zion Christian Church (ZCC) Easter Conference held at Mbungo Estate in Masvingo today.\n\nIn a speech read on his behalf by Local Government and Public Works Minister Daniel Garwe, President Mnangagwa emphasised the role of faith in national development, urging Zimbabweans to anchor their efforts on spiritual foundations.We must depend on Jehovah God in building our nation, brick by brick; in working for our communities and families, stone upon stone; in modernising and industrialising our country step by step, and also in winning souls to our faith, he said.\n\nPresident Mnangagwa said sustainable development and unity stem from moral conviction and collective purpose.\n\nThe ZCC Easter Conference, a major religious event that draws congregants from across the region and beyond, served as a platform for the President to link faith with national progress, calling on citizens to commit to both spiritual and socio-economic renewal.\n\nAmong the top officials present was Lands, Agriculture, Fisheries, Water, and Rural Development Minister, Dr Anxious Masuka;\n\nMinister of State for National Security Lovemore Matuke, Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira, Zanu PF Politburo members, service chiefs, and senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-20-at-16.42.14-680x380.jpeg",
            "description": "Blessings Chidakwa in Masvingo The church’s role as a key pillar in nation building took centre stage as President Mnangagwa addressed thousands of congregants at the 2025 Zion Christian Church (ZCC) Easter Conference held at Mbungo Estate in Masvingo today. In a speech read on his behalf by Local Government and Public Works Minister Daniel […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Kumalo School bursar sentenced to community service for theft",
            "url": "https://www.chronicle.co.zw/kumalo-school-bursar-sentenced-to-community-service-for-theft/",
            "content": "Online Reporter\n\nA KUMALO Primary School bursar who misappropriated over US$500 in school development levies collected from learners has been ordered to perform 420 hours of community service.\n\nRumbidzai Magwaku (36) was convicted on her own plea of guilty to theft by Bulawayo magistrate Mrs Eva Matura. She converted US$502 in school funds to her personal use.\n\nMagwaku was sentenced to 12 months in prison, of which six months were suspended on condition that she restitutes the stolen amount. The remaining six months were further suspended on the condition that she completes 420 hours of community service.\n\nMagwaku was arrested last week alongside the schools headmistress, Stella Mhlanga (63), deputy head Enelesi Sibanda (56), and teachers Nombulelo Maiswa (57) and Siphatheleni Sibanda (52). The group faces fraud charges relating to alleged embezzlement of school funds.\n\nThe prosecutor, Mr Samuel Mpofu told the court that between February and December last year, Magwaku breached her fiduciary duty by failing to remit funds she had collected.She received a total of US$502 meant for the school and instead converted it to her own use, said Mr Mpofu.\n\nThe offence was uncovered during a workshop attended by Government and school development bursars, where Magwaku admitted that her books were not balancing. A subsequent financial reconciliation and audit revealed the misappropriation, with auditors\n\nWhile Magwaku has been sentenced, her co-accused are out on bail and are set to return to court on April 30.\n\nBulawayo magistrate Ms Beverly Madzikatire granted each of the four accused US$50 bail, ordering them to reside at their given addresses and not interfere with State witnesses.\n\nThe ongoing investigation stems from an audit by the Ministry of Primary and Secondary Education, which exposed gross financial irregularities at the school. According to court documents, Mhlanga allegedly received US$7 835 in levy payments but only banked US$2 727, with the remaining US$5 108 unaccounted for. Enelesi Sibanda is\n\naccused of receiving US$1 299, but only depositing US$208, effectively misappropriating US$1 091, Siphatheleni Sibanda allegedly kept US$630 after banking just US$121 from the US$751 she received. Maiswa is alleged to have banked only US$20 out of US$2 574, leaving US$2 554 unaccounted for.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2013/11/court-hammer.jpg",
            "description": "Online Reporter A KUMALO Primary School bursar who misappropriated over US$500 in school development levies collected from learners has been ordered to perform 420 hours of community service. Rumbidzai Magwaku (36) was convicted on her own plea of guilty to theft by Bulawayo magistrate Mrs Eva Matura. She converted US$502 in school funds to her […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Government launches probe into Rovos Rail and BBR train collision",
            "url": "https://www.chronicle.co.zw/government-launches-probe-into-rovos-rail-and-bbr-train-collision/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTHE Government has launched an investigation into the collision between a Rovos Rail luxury passenger train and a Bulawayo-Beitbridge Railway (BBR) goods train, which occurred on Good Friday.\n\nAuthorities are also working tirelessly to repair the damaged railway infrastructure along the Bulawayo-Beitbridge line.\n\nThe head-on collision, which happened at around 7AM in Hantinya Village, just outside Gwanda Town, rendered the railway line impassable and disrupted a key tourism corridor that brings international travellers into Zimbabwe.\n\nThe impact of the crash caused one of the Rovos Rail coaches to derail and overturn approximately five metres from the track, trapping a crew member inside. Gwanda Fire Brigade personnel conducted a two-hour rescue operation to extricate the injured man. Another coach veered off the rails into nearby bushland, while a third coach rammed into the one ahead of it.\n\nThe luxury train, operated by a private company based at Capital Park Station in Pretoria, South Africa, had departed on Thursday en route to Victoria Falls, with arrival scheduled for Sunday.\n\nTourism and Hospitality Industry Minister Barbara Rwodzi visited the accident scene on Saturday to assess the damage and confirmed that efforts were underway to remove the wreckage and repair the line.Im here with a team to assess the extent of the damage at the accident scene. As a ministry, its in our interest to do this because, as part of our national strategy, we are leveraging tourism to foster positive relations with other countries, she said.The Rovos train had nationals from several countries, including Canada, the USA, the UK, Denmark, Switzerland and South Africa. We stand in solidarity and sympathise with them, and His Excellency President E.D. Mnangagwa is doing everything possible to ensure the Rovos train is removed and returned to service as soon as possible.\n\nMinister Rwodzi noted that the Rovos Rail service plays a crucial role in Zimbabwes tourism strategy, connecting the country to international markets through South Africa. She commended Rovos Rail for its positive contribution to the local tourism industry and its collaboration with domestic tourism operators.\n\nShe emphasised that the Government, through her ministry, the Ministry of Transport and Infrastructure Development, and the National Railways of Zimbabwe (NRZ), remained on standby to provide all necessary assistance.\n\nMinister Rwodzi also praised the swift response by all stakeholders involved in the rescue efforts.While investigations are ongoing, Rovos must be supported to continue its operations. This train route is cherished by many international tourists, particularly those from the USA and Canada, who prefer rail travel from South Africa to Victoria Falls. It is in our national interest to ensure that it becomes operational again as soon as possible, she said.We are grateful to Rovos for the work they have done, and to our rescue teams. We always strive to foster positive relationships with other nations through our hospitality and culture, which is essential to our foreign policy goals.\n\nThe collision resulted in eight people being hospitalised at Mater Dei Hospital: seven Rovos Rail crew members and one female tourist from the United States. Injuries varied in severity, with one South African crew member undergoing a complex 12-hour spinal surgery.\n\nThe train was carrying 47 tourists from several countries, including the USA, Canada, Denmark, Switzerland and the UK.\n\nOn Saturday, Minister Rwodzi, accompanied by Bulawayo Provincial Affairs and Devolution Minister Judith Ncube, visited the injured at hospital and later met with uninjured tourists, who were accommodated at a local hotel. She offered reassurances of full Government support until their recovery.\n\nShe revealed that the visit had been made at the behest of President Mnangagwa, who expressed deep concern over the incident and directed that the wellbeing of the affected tourists be prioritised.\n\nThe two ministers also visited Rovos Rail crew members at a lodge in Gwanda.\n\nRovos Rail manager Mr Louis Jonga expressed gratitude to Minister Rwodzi and the Government for their support, saying it had provided immense comfort during a difficult time.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-20-at-14.54.16-680x380.jpeg",
            "description": "  Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw THE Government has launched an investigation into the collision between a Rovos Rail luxury passenger train and a Bulawayo-Beitbridge Railway (BBR) goods train, which occurred on Good Friday. Authorities are also working tirelessly to repair the damaged railway infrastructure along the Bulawayo-Beitbridge line. The head-on collision, which happened at around 7AM in […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Car Dealer jailed for 60 Months",
            "url": "https://www.chronicle.co.zw/car-dealer-jailed-for-60-months/",
            "content": "Peter Matika,[emailprotected]\n\nA 29-year-old car dealer who sold two vehicles on behalf of his clients but failed to remit the proceeds has been sentenced to an effective five years imprisonment.\n\nPatson Khumalo, who in one incident drove off at high speed with a clients vehicle during a test drive, was initially handed a 97-month custodial sentence. However, the term was reduced on condition he does not commit a similar offence within the next five years.\n\nBulawayo magistrate Mrs Eva Matura delivered the ruling on Wednesday, after Khumalo, of Pumula South suburb, was convicted on two counts of theft of trust property.\n\nProsecutor Mr Samuel Mpofu outlined the offences, which took place in 2024.\n\nThe first incident occurred on 26 April 2024, when Khumalo was entrusted with a Ford Ranger by his client, Mr Alec Chayukebawa. He was asked to sell the car for US$5 400 which he did but he did not give Mr Chayukebawa the money.\n\nThe second offence involved a Toyota Allion, valued at US$6 400, which he received from Mr Thadeous Ndlovu under similar terms. Once again, he sold the vehicle but did not surrender the money to Mr Ndlovu.\n\nMrs Matura said Khumalos conduct was a serious breach of trust which soiled the reputation of car dealers in Bulawayo.\n\nShe said there was a need to pass a sentence that served as warning to those who did notvalue integrity in business.\n\nTrust is the foundation of any transaction. When that trust is broken, the consequences can be severe, said Mrs Matura.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/iui.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw A 29-year-old car dealer who sold two vehicles on behalf of his clients but failed to remit the proceeds has been sentenced to an effective five years imprisonment. Patson Khumalo, who in one incident drove off at high speed with a client’s vehicle during a test drive, was initially handed a 97-month custodial […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Four killed, seven injured in Gweru-Zvishavane road accident",
            "url": "https://www.chronicle.co.zw/four-killed-seven-injured-in-gweru-zvishavane-road-accident/",
            "content": "Online ReporterFOUR people died, and seven others were injured in a road accident along the Gweru-Zvishavane Road on Wednesday morning.\n\nThe crash occurred around 8:30 AM at the 20km peg when a Toyota Ragius ACE omnibus lost control after its right rear tyre burst. The vehicle overturned before coming to rest on its wheels.\n\nEmergency services responded to the scene, and the injured were transported to Gweru Provincial Hospital for treatment. The deceased were taken to the hospitals mortuary for post-mortem examinations.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident and reminded public transport operators to ensure their vehicles are properly maintained to prevent similar tragedies.\n\nAuthorities are continuing investigations into the accident.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/12/road-accident.png",
            "description": "Online Reporter FOUR people died, and seven others were injured in a road accident along the Gweru-Zvishavane Road on Wednesday morning. The crash occurred around 8:30 AM at the 20km peg when a Toyota Ragius ACE omnibus lost control after its right rear tyre burst. The vehicle overturned before coming to rest on its wheels. […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Exhibitors make final preparations ahead of 65th Zimbabwe International Trade Fair",
            "url": "https://www.chronicle.co.zw/exhibitors-make-final-preparations-ahead-of-65th-zimbabwe-international-trade-fair/",
            "content": "Zimpapers Business Hub\n\nEXHIBITORS were hard at work on Sunday putting final touches on their pavilions in preparation for the 65th edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo.\n\nRunning from Monday to Saturday, the annual exhibition is one of the countrys premier trade and investment platforms, attracting local, regional and international players across various sectors.\n\nThis years Sapphire Edition, held under the theme Industrialisation: Crafting an Integrated Economic Landscape, underscores ZITFs pivotal role in promoting industrial growth, economic integration and strategic partnerships that drive Zimbabwes development agenda.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gfg-1.jpg",
            "description": "Zimpapers Business Hub EXHIBITORS were hard at work on Sunday putting final touches on their pavilions in preparation for the 65th edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo. Running from Monday to Saturday, the annual exhibition is one of the country’s premier trade and investment platforms, attracting local, regional and international players […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Sundowns frustrated by Al Ahly at Loftus",
            "url": "https://www.chronicle.co.zw/sundowns-frustrated-by-al-ahly-at-loftus/",
            "content": "SOUTH Africa football giants Mamelodi Sundowns and defending champions Al Ahly drew 0-0 in the first leg of the CAF Champions League semi-final at Loftus Versfeld on Easter Saturday.\n\nCoach Miguel Cardoso made changes after their loss to Kaizer Chiefs last week, Aubrey Modiba, Mosa Lebusa, Jayden Adams and Tashreeq Matthews came in for injured Zimbabwe international Divine Lunga, Lucas Suarez, Bathusi Aubaas and Iqraam Rayners respectively\n\nBafana Bafana international Teboho Mokoena, who scored a cracker last Sunday, looked to hit another from the edge of the area but sent his effort just wide of Mohamed El Shenawys upright.\n\nThe Cairo Red Devils werent unfazed and carved out an opening of their own when Emam Ashour came short to the area and forced Ronwen Williams into a save with a curling attempt.\n\nWilliams was put to work again moments later where he had to pull across his goal-line to gather a potent header from Ashour.\n\nSundowns almost found themselves trailing on the stroke of halftime, as a first-time header by Nejc Gradisar bounced off the upright with Williams well beaten.\n\nMasandawana struggled to breakdown the stubborn defence in the early parts of the second half and were forced to play through the wings, although there was not much joy on that front.\n\nCardoso refreshed their attack and saw Arthur Sales come on for Peter Shalulile before Matthews made way for Rayners.\n\nLong-serving Themba Zwane, who just returned from a lengthy injury lay-off, was also introduced for the first time since October, with Adams making way in the midfield.\n\nThe Cairo Red Devils had the ball in the net in the last 20 minutes as Gradisar side-footed into the top-corner following a cutback, but the goal ruled out for offside by the assistant referee.\n\nSundowns contained the Red Devils threat in the latter stages with a balanced approach, as the encounter ended all square. -KickOff\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/rfr.jpg",
            "description": "  SOUTH Africa football giants Mamelodi Sundowns and defending champions Al Ahly drew 0-0 in the first leg of the CAF Champions League semi-final at Loftus Versfeld on Easter Saturday. Coach Miguel Cardoso made changes after their loss to Kaizer Chiefs last week, Aubrey Modiba, Mosa Lebusa, Jayden Adams and Tashreeq Matthews came in for […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        },
        {
            "title": "Bangladesh/Chevrons Test available to stream online",
            "url": "https://www.chronicle.co.zw/bangladesh-chevrons-test-available-to-stream-online/",
            "content": "Zimpapers Sports Hub\n\nTHE first Test match between Bangladesh and Zimbabwe, at the Sylhet International Cricket Stadium is available to stream live on the Bangladesh TV website.\n\nThe Test match got underway on Sunday morning with the hosts winning the toss and opting to bat first.\n\nFans can also download the Bangladesh TV application on the Google PlayStore or Apple Appstore.\n\nAfter they were sent in to field first, Zimbabwe made early inroads with Victor Nyauchi getting the wickets of Bangladesh openers, Mahmudul Hasan Joy for 14 runs and Shadman Islam for 12 runs.\n\nNajmul Hossain Shanto (30*) and Mominul Haque (21*) have stabilised the hosts innings.\n\nAt the lunch break, Bangladesh are on 84/2 (24 overs). Covers have been put on during the break due to a slight drizzle.\n\nThe stream is accessible via the link: https:\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/yty6ty6tyutfytfydythrt.jpg",
            "description": "  Zimpapers Sports Hub THE first Test match between Bangladesh and Zimbabwe, at the Sylhet International Cricket Stadium is available to stream live on the Bangladesh TV website. The Test match got underway on Sunday morning with the hosts winning the toss and opting to bat first. Fans can also download the Bangladesh TV application […]",
            "time": "21:26",
            "date": "20 Apr 2025"
        }
    ]
}