{
    "news": [
        {
            "title": "Africa must produce, feed itself  — President",
            "url": "https://www.chronicle.co.zw/africa-must-produce-feed-itself-president/",
            "content": "Mashudu Netsianda in Victoria FallsPRESIDENT Mnangagwa has called for a paradigm shift in Africas education systems, urging stakeholders to adopt transformative strategies that will equip learners with practical skills to drive the continents industrialisation and economic growth.\n\nSpeaking at the 3rd Africa Education Summit in Victoria Falls yesterday, the President boldly stressed the need for education on the continent to move beyond policy discussions and reforms towards tangible action that translates learning into development.\n\nBuilding the Africa we want, demands a continuous paradigm shift from us stakeholders, policy makers, educators, innovators and learners alike, he told the delegates. Bold and decisive strategies have to be adopted so that we foster education systems that inculcate solution-driven minds and not produce merely certificate-holding graduates. Our discussions during this summit must, therefore, enable convergence towards scaling up transformative strategies that drive education and developmental progress across Africa. Together, we have yet another opportunity to innovate, think outside the box and promote impactful best practices to up-scale resilient systems, as we shape the future of our continent through education.\n\nPresident Mnangagwa said there was an urgent need for skills-based education, urging institutions to bridge the gap between academic learning and industry needs.\n\nOur schools and institutions of higher learning must become incubators of innovation, entrepreneurship and leadership, taking into account our indigenous knowledge systems, he said. Students and graduates should be capacitated to produce goods and services that meet the demands of our communities.\n\nWe must become a continent that can produce and feed itself.\n\nThe establishment of innovation hubs at the countrys state universities has already kick-started Zimbabwes industrial modernisation agenda through the pursuit of the Education 5.0 policy, which has so far seen the Government registering over 500 patents in various fields, thereby aiding national development.\n\nUniversities with innovation hubs and industrial parks so far are the National University of Science and Technology, Midlands State University, University of Zimbabwe, Harare Institute of Technology, Zimbabwe Defence University, and the Chinhoyi University of Technology.\n\nNational University of Science and Technology (Nust)\n\nDespite progress in literacy rates and access to higher education, President Mnangagwa said Africa still faces significant challenges in the education sector, including resource shortages and lack of trained educators.\n\nHe pointed out that about 30 million children in Sub-Saharan Africa, for instance, are out of school and called for increased collaboration among African states in teacher training to address this gap and ensure inclusive education.\n\nZimbabwe is ready to share experiences in this regard, said President Mnangagwa, stressing the importance of knowledge exchange among nations.\n\nTo reduce school absenteeism due to poverty, Zimbabwe has implemented a nationwide School Feeding Programme covering both rural and urban schools.\n\nIn our case as Zimbabwe, increased school infrastructure across the country, especially in new settlements has ensured that learners do not walk more than 5km to access educational facilities, said President Mnangagwa.\n\nGovernment has also embarked on a project to sink a borehole at every rural school and village, complemented by nutrition gardens to enhance food security, water access and sanitation in schools.\n\nLet us build on the solid foundation set out at previous engagements under this initiative to leap forward our education systems. To further translate our educational advancement for continental development, it is important to be holistic in our propositions, taking into account the unique African realities, said President Mnangagwa.\n\nThe quality of education varies widely, with many institutions lacking adequate resources and trained educators. These gaps and disparities hinder our ability to harness the full potential of our youth and translate educational advancements into tangible development outcomes, he added.\n\nPresident Mnangagwa further stressed the need for Africa to invest in clean energy and modern infrastructure to fully integrate ICTs, e-learning, and digital transformation in education\n\nLimited access to energy hinders prospects for most African learners, especially those in rural communities. Hence, investments in clean energy, along with modern school infrastructure, must now be deemed a dual necessity, he noted.\n\nCalling for further support for Science, Technology, Engineering and Mathematics (STEM) education, alongside vocational training and digital literacy, he said these will ensure students graduate with skills that empower them to create jobs and establish industries.\n\nOur students should exit education institutions with skills that empower them to create jobs, establish viable industries and solve societal challenges. Therefore, the need to enhance collaboration, scale up synergies and strengthen partnerships cannot be over emphasised, he said.\n\nUnder the Second Republic, President Mnangagwa said Government has increased support for the provision of modern teaching and learning materials.\n\nThese are having a positive impact on learning outcomes and resulting in dynamic teaching-learning processes that benefit both learners and educators. The digital divide remains a significant barrier to educational access across the continent, he said.\n\nLeveraging technology to bridge the educational divide will, in the main, enable even the most remote communities to access quality learning. Our governments have a duty to increase support for infrastructure to broaden digital access and literacy, particularly for students and teachers.\n\nPresident Mnangagwa noted that limited access to energy hinders prospects for most African learners, especially those in rural communities.\n\nHence, investments in clean energy, along with modern school infrastructure, must now be deemed a dual necessity. This is more urgent given the centrality of energy access for the deployment of ICTs, e-learning, innovation and overall digital transformation industrialisation of Africa, he said.\n\nUltimately, e-learning platforms, smart classrooms and Artificial Intelligence driven learning tools should no longer be luxuries but day to day teaching and learning necessities.\n\nUnder the Second Republic, the Government has increased support for modern teaching and learning materials, resulting in improved learning outcomes, said the President. Resource centres and libraries with digital capabilities are being promoted across the country, with the establishment of community information centres and deployment of mobile information buses.\n\nFurthermore, the countrys education reforms have seen curriculum revisions aimed at fostering critical thinking, creativity, and problem-solving abilities.\n\nWe are ensuring that education is accessible to all, regardless of socio-economic background, gender, or disability. Women and girls, in particular, must be empowered to excel in all fields and contribute meaningfully to our continents progress, said President Mnangagwa.\n\nThe 3rd Africa Education Summit is a premier event dedicated to fostering educational advancement across the continent. The event, which started on Thursday and ending today, brought together education ministers, policymakers and stakeholders from across Africa to deliberate on strategies for enhancing the continents education systems in line with Agenda 2063 and Vision 2030.\n\nVision 2030\n\nIt is running under the theme: Translating our Educational Advancement to Continental Development.\n\nThe summit is jointly hosted by Global Skills Hub United Kingdom, Africa Education Stakeholders, and the government of Zimbabwe. It seeks to create a transformative experience that will drive educational and developmental progress across Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hj76rrj7676j.jpg",
            "description": "Mashudu Netsianda in Victoria Falls PRESIDENT Mnangagwa has called for a paradigm shift in Africa’s education systems, urging stakeholders to adopt transformative strategies that will equip learners with practical skills to drive the continent’s industrialisation and economic growth. Speaking at the 3rd Africa Education Summit in Victoria Falls yesterday, the President boldly stressed the need […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "Bulawayo descends into Wild West as gun violence escalates",
            "url": "https://www.chronicle.co.zw/bulawayo-descends-into-wild-west-as-gun-violence-escalates/",
            "content": "Bruce NdlovuTHE details surrounding the alleged murder of Sergeant Abel Masava are as brutal as they are utterly chilling. On the morning of March 28, Sergeant Masava, alongside his colleague, Constable Magaya, was attending to a domestic violence complaint in Sizinda when he noticed five suspicious men walking past.\n\nThe five were clad in black, blending seamlessly into the inky darkness of an autumn night in the densely populated suburb.\n\nAs a law enforcement officer, the mens attire and the fact that they carried sacks long after most had retired from their daily labours, prompted Sergeant Masava to inquire about their activities. It was a fatal inquiry.\n\nMoments later, Sergeant Masava lay prone on the ground, bleeding profusely from a gunshot wound to the head. He was later pronounced dead on arrival at United Bulawayo Hospitals.\n\nIn the Bulawayo of yesteryear, the incident would have plunged the city into a prolonged period of mourning, as people grappled with the untimely death of an officer of the law in such a violent manner.\n\nCollective tears shed over Sergeant Masavas death had even dried, another hair-raising incident involving firearms brought the city to a standstill only a few days later. Yeki Ncube, a member of the Nketa 8 Neighbourhood Watch Committee, found himself staring down the barrel of a gun when he and his colleagues encountered three men carrying bags and requested to search them. Before he could fully comprehend the situation, one of the three men produced a firearm and discharged it in his direction. As the suspects fled, swallowed by the inky blackness of the night, Ncube was left thanking his lucky stars for his continued existence.\n\nThese two incidents, occurring in suburbs so geographically proximate, highlighted the escalating problem of gun violence in the City of Kings. Nowadays, the people of Bulawayo scarcely have the time to process the shock, let alone mourn a death or injury resulting from a gun-related incident, before another one transpires. Gun violence, once thought to be the exclusive domain of Johannesburg, the city to which many from Bulawayo migrate in search of prosperity, now seems to be the staple of all crime-related conversations in Bulawayo.\n\nPolice officers, just like ordinary citizens, are increasingly finding themselves in the line of fire, as armed robbers in the city demonstrate a chilling willingness to use deadly force, even against law enforcement agents. Only a few weeks ago, Constable Cassandra Hove, a victim of alleged friendly fire, illustrated the perilous stakes that the countrys crime fighters face as they pursue some of the nations most dangerous criminals. Yet, barely a month after her demise, more police officers have found themselves in the crosshairs, as Bulawayo seemingly descends into a lawless Wild West.\n\nThe 2024 third-quarter crime statistics report, recently released by the Zimbabwe National Statistics Agency (Zimstat), revealed that Bulawayo has the highest crime rate in the country, nearly doubling the national average. The data paints a deeply concerning picture of rising crime in the province, with Bulawayo residents bearing a disproportionate share of the nations criminal burden. According to the report, Bulawayos crime rate is an alarming 2,506.1 per 100,000 people, significantly surpassing the national average of 1,370.6 per 100,000.\n\nThe late Sgt Abel Masava [Left] , The late Det Cst Cassandra Hove [Right]\n\nThe crime rate in Bulawayo Province nearly doubled the national crime rate, at 2,506.1 per 100,000 people against the national average of 1,370.6. Of the 205,925 cases recorded in the third quarter nationally, 84,001 were crimes against public safety and state security. The second most common type of crime recorded was acts against property only, with 48,566 cases. Acts leading to harm or intending to cause harm to the person were 40,078. The total number of persons charged by the police for all offences was 150,263, of which 89 percent were male, reads the report.\n\nA significant proportion of these incidents are gun-related robberies, which have left everyone, from business owners to private residents, living in fear of encountering gun-toting criminals. Fuel stations, in particular, have borne the brunt of the recent surge in crime, forcing business owners to alter their operating hours by closing early instead of remaining open 24 hours for security reasons. Their fears are not unfounded. Within the space of two days last week, robbers raided two service stations in Bulawayo and bound the attendants hands before escaping with cash. In the first incident, four men armed with a pistol pounced on Trek Garage in Gwabalanda and escaped with more than US$15,000 and R800 after attacking the fuel attendant and security guard, while in the second case, three men armed with pistols raided Amakhosi Service Station along the Bulawayo-Victoria Falls Road.\n\nWe have witnessed the upsurge of armed robberies at fuel service stations around the city. We urge petrol attendants not to keep large sums of money on themselves or their premises but to deposit their monies in the safes under lock and key and day sales to be banked, said Acting Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele.\n\nPerhaps a greater concern for Bulawayo residents is that the perpetrators of gun crimes at times seem motivated by more than mere financial gain. High drama and sometimes callous violence have become hallmarks of some gun-related incidents. On 31 March, a 37-year-old man and his girlfriend had the misfortune of encountering a pair of particularly unpleasant individuals in Mbuyazwe along the Nyamandlovu road. What may have begun as a romantic getaway for the couple soon descended into a nightmare as the two assailants seized the man and wrestled with him for approximately 10 minutes before producing a black pistol and striking him twice on the back of the head. For good measure, they stabbed the man twice on each buttock with a knife, and to add insult to injury, they ransacked his car, taking four Samsung Galaxy cellphones and cash amounting to US$1,000 from his wallet. More gruesomely, one of the robbers then proceeded to sexually assault the mans girlfriend.\n\nWith President Mnangagwa declaring war on armed robbers in 2022, the countrys law enforcement officers have also demonstrated their readiness for the fight, subduing some of Bulawayos most notorious criminals. A Hollywood-style shootout between police officers and six robbers near the Bulawayo-Victoria Falls tollgate resulted in the demise of the six gunmen who had robbed a general dealership in Insuza.\n\nMeanwhile, two suspects were fatally shot, and three others were arrested in connection with last weeks Tshabalala incident. As police continue their crackdown on gun-toting criminals, it remains to be seen whether their efforts will restore Bulawayo to the once peaceful, gun-free city it used to be.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gnfhgdf.jpg",
            "description": "Bruce Ndlovu THE details surrounding the alleged murder of Sergeant Abel Masava are as brutal as they are utterly chilling. On the morning of March 28, Sergeant Masava, alongside his colleague, Constable Magaya, was attending to a domestic violence complaint in Sizinda when he noticed five suspicious men walking past. The five were clad in […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "Turbulence proves ANC is  on right course",
            "url": "https://www.chronicle.co.zw/turbulence-proves-anc-is-on-right-course/",
            "content": "The world, particularly the Global South, has a lot to learn from our country.\n\nOur experience over the past 25 years provides a huge number of lessons that can help Africa and the rest of the developing world to overcome challenges that typically confront those that decide to be masters of their destinies.\n\nIn 2000, Zimbabweans took a decision to reclaim their land that 90 years of British colonialism had stolen from them. Up to 380 000 formerly landless blacks are now proud owners of farmland. They are doing wonders on it, achieving records in maize, wheat and tobacco production. Among the beneficiaries are youths, who are also excelling.\n\nBut the land reforms attracted Western sanctions. Yes, the economy is progressing but there is no denying that the sanctions have had a detrimental impact on the economy and the peoples well-being.\n\nIn addition, the same forces piled much political pressure and malign scheming that was meant to remove Zanu-PF from power. The scheming almost succeeded in 2008 when the ruling party lost its parliamentary majority and emerged second in the presidential race. An inclusive government had to be formed and the following five years were all about discordance in government.\n\nDespite the challenges, the past 25 years have engendered a consciousness among our people to build capacity in themselves to be truly self-reliant. Instead of them going about seeking formal jobs, generally hard to get in a sanctioned economy, they are doing it all themselves, running small but thriving businesses.\n\nIndeed, our country provides multiple lessons in the importance of pro-people policies and resourcefulness in difficult times.\n\nIt is in this context that the African National Congress (ANC) of South Africa has sent its Youth League here to learn from our development experience.\n\nCde Collin Malatji, the leagues president, said on Thursday that they are here to learn how Zanu-PF survived the 2008-2013 inclusive government, how it executed land reform and empowerment programmes.\n\nSouth Africas ANC Youth League President, Cde Collin Malatji\n\nIn May last year, the ANC lost its parliamentary majority partly due to a resurging Western-backed political party, Democratic Alliance. That forced the revolutionary party to form a unity government the following month. It has been a turbulent 10 months for the ANC.\n\nIn January, President Cyril Ramaphosa answered a centuries-old call for deracialisation of land ownership in his country when he signed a relevant law. The piece of legislation seeks to ensure that blacks, who constitute 80 percent of that nations population and own just four percent of the land, are given much more of the factor of production.\n\nA month after he enacted that law, the US cut all aid to his country and is threatening sanctions. There has been much American rhetoric against South Africa over the past two months, accusing our neighbour of practising racism in its just drive to actually correct racially-entrenched land ownership.\n\nOur message to the ANC is that in fighting to deliver land to the people, to govern alone without the encumbrance of sharing power with counter-revolutionaries and to economically empower the masses, they are on the right path.\n\nThey will face stiff opposition and much scheming from the usual suspects but they have to be determined to fight because their cause is just.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hdbfgd.jpg",
            "description": "The world, particularly the Global South, has a lot to learn from our country. Our experience over the past 25 years provides a huge number of lessons that can help Africa and the rest of the developing world to overcome challenges that typically confront those that decide to be masters of their destinies. In 2000, […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "‘Plots against President  won’t succeed’",
            "url": "https://www.chronicle.co.zw/plots-against-president-wont-succeed/",
            "content": "Blessings Chidakwa, Zimpapers Politics HubEFFORTS by some renegade former Zanu-PF officials to unseat the democratically elected Government of Zimbabwe will fail dismally, a senior official has said.\n\nSpeaking at a rally to drum up support for Zanu-PF Glen View South Constituency candidate Cde Tsitsi Tranquillity Tawomhera in Harare on Wednesday, Zanu-PF Mashonaland East Provincial Chairman, who is also the Local Government and Public Works Minister, Cde Daniel Garwe, said efforts by some former Zanu-PF officials to unconstitutionally undermine or remove the democratically elected Government would come to grief.\n\nHe said the ruling party and Government are solidly behind the leadership of President Mnangagwa.\n\nPresident Mnangagwa won the election (in 2023). Now, in his second term, some people are already plotting, saying they cant wait for his term to end and are calling for demonstrations to remove him. What do they mean they cant wait?\n\nThere is no office without a leader. Cde Mnangagwa is our President, whether they like it or not, Cde Garwe said.\n\nHe said President Mnangagwa has the people at heart, as demonstrated by life-changing development programmes, including the Emergency Road Rehabilitation Programme (ERRP) and the Presidential Borehole Scheme.\n\nThe developmental programmes spearheaded by President Mnangagwa give us an advantage and show that our leader is pragmatic and committed to the people.\n\nRoad rehabilitation is ongoing under ERRP, and the borehole scheme is progressing countrywide, Cde Garwe said.\n\nHe also took a swipe at fugitive former Zanu-PF member Blessed Geza.\n\nBlessed Geza\n\nA stray dog always has an owner. If you want to know its master, beat the dog, and the owner will come out. If you want to find out the mother of a puppy, grab the puppy, and the mother will bark and charge at you.\n\nRight now, we are dealing with Geza. Even if he calls for demonstrations, do not be misled, said Cde Garwe.\n\nThanking citizens for ignoring Gezas calls for protests, Cde Garwe challenged him to come out of hiding and face him directly.\n\nI will make Geza wear an apology jersey for his rebellious utterances. Let me warn you, Geza do not rebel against Zanu-PF again. Comrades, tell Geza the time for rebels is over.\n\nGeza, stay in South Africa with (Saviour) Kasukuwere if you want. Our President is Emmerson Mnangagwa, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Cde-Daniel-Garwe-copy.jpg",
            "description": "Blessings Chidakwa, Zimpapers Politics Hub EFFORTS by some renegade former Zanu-PF officials to unseat the democratically elected Government of Zimbabwe will fail dismally, a senior official has said. Speaking at a rally to drum up support for Zanu-PF Glen View South Constituency candidate Cde Tsitsi Tranquillity Tawomhera in Harare on Wednesday, Zanu-PF Mashonaland East Provincial […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "Magical Fires torment…Black magic suspected in arson attacks on journalist’s home",
            "url": "https://www.chronicle.co.zw/magical-fires-torment-black-magic-suspected-in-arson-attacks-on-journalists-home/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nDESPITE a two-year onslaught of disturbing and escalating threats from an embittered ex-girlfriend, delivered via numerous local and foreign phone numbers, married journalist Methuseli Moyo maintained a composed silence.\n\nThe threats stemmed from his decision to end the relationship with the now bitter ex (name withheld) and marry his sweetheart, Natasha Mhlanga. The couple married in a traditional ceremony last September to cement their union.\n\nFrom the fringes of a breakup that the ex-girlfriend did not accept, according to Moyo, his family has endured a torrid time for the last couple of months with unexplained fires that threaten to tear apart a home grounded on the foundations of love and prayer. So severe are the fires that a recent unexplained inferno destroyed US$20000 from the sale of a Rangemore suburb home that Moyo, a National University of Science and Technology (Nust) lecturer, intended to use to finish the construction of another family home in Pumula North.\n\nThe burns he sustained\n\nWhile the existence of the dark world and witchcraft are subjects of intense debate in society, Moyos harrowing ordeal from what he believes to be the work of black magic is a stark reminder of the lengths some people take to seek revenge. He shared his story withSaturday Chroniclefrom his home in Magwegwe West suburb on Thursday, the same home whose peace and tranquillity have been shattered by unexplained fires.\n\nI have been receiving a lot of abusive messages for the last two years and I had no doubt in my mind that the messages were coming from my ex-girlfriend. Although she was using anonymous numbers, I could tell from the content, diction, tone, demeanour, and even the spelling errors that she typically made when we were still together that she was the source of the messages, said Moyo.\n\nTo avoid an online tiff with the ex-girlfriend, Moyo simply blocked the several numbers she used to launch the barrage of insults and threats on him and his family.\n\nInitially, she used her own phone number, which I blocked, and then she turned to South African registered mobile numbers, but the tone and content of the messages were still the same, so I blocked those numbers as well.\n\nWhen the relationship with his then fiance, Mhlanga, got serious, the intensity and tone of the messages escalated.\n\nShe changed tact and started sending the threatening messages to my wife, who was still my fiance at that time, but we had both resolved to block the mobile numbers and not entertain her.\n\nHaving realised that the couple was ignoring her, Moyo says the bitter ex turned to his son, sending him even more menacing and threatening messages.\n\nThe most hurtful message sent to my son was you, your father, and his new wife will be burnt alive in your home, and it was sent sometime early this year, I think around January 5. At one point, she sent another anonymous letter stating that no woman, including my wife, will ever stay in our house, as the situation will become unbearable.\n\nThat was the last straw, and Moyo opened a case of harassment at the Magwegwe Police Station against the woman. She was called to the police and cautioned. It appears the decision to report the bitter ex triggered explosive emotions. Then the fires started late last year.\n\nThe first fire started in the bedroom, and we assumed it was an electrical fault. The second fire was in a spare room, and we removed everything to ensure nothing flammable had ignited the fire. Then the fires moved to the sitting room and other rooms, he said.\n\nThe Nust lecturer showed the news crew one sofa that he said had been burnt several times as the sporadic blazes intensified.\n\nHe shows the wardrobe where $20 000 got burnt\n\nThen the fires started attacking him.\n\nI was sleeping one February night when I felt intense heat on my upper body and screamed to my wife that I was on fire. She could not see the fire but nevertheless poured water on my body and realised that I had blisters on my back. The next day, late in the afternoon, I was with my wife and 20-year-old son and felt the intense heat all over my body again, and my son poured water all over me. I was taken to Galen House (a private hospital in Bulawayo city centre) where I received treatment for burns. The whole experience was just traumatic and painful, he said.\n\nDetermined to find a solution to the mysterious fires, the family sought the assistance of a prophet who came to the home, but before he could do anything, three fires broke out in the house.\n\nHe did what he came to do and assured us that it was the end of the ordeal, and for four weeks we lived in peace.\n\nMoyo shows a sofa that has been burnt several times\n\nIn the midst of the temporary tranquillity that the family enjoyed for one month, tragedy struck when the family least expected it. $20 000 was destroyed in a fire that started in a wardrobe in the main bedroom. He had just collected the money on a Sunday to buy building material the following day when yet another fire engulfed the main bedroom while he was outside with his mechanic.\n\nBecause we had not been terrorised by the fires for four weeks, we felt safe to keep the money in the house just for a day before using it on Monday, he said.\n\nHe had a nagging feeling at the back of his mind to place the money in a plastic bag and put it in a container with water, but before he could do that, he attended to the mechanic.\n\nSuddenly, smoke was billowing from inside the main bedroom. For about 30 seconds, I couldnt see anything because of the thick smoke. I opened the windows and realised that the fire was coming from the wardrobe where we kept the money.\n\nEvery bill of the $20000 was reduced to ashes. The family is seeking assistance to find a permanent solution to the bizarre fires. Harare-based Gogo Chihoro offered to assist Moyo when she makes her weekly trips to Bulawayo at the Woodville suburb park, where she assists people with various life challenges.\n\nI read the story in the Chronicle during the week and Im ready to assist the family. Every problem has a solution, and seeking assistance is the right thing for the family to do, she said.\n\nMoyo said he was desperate to save his family from the black magic cast by his adversaries and would take any assistance as long as it would not cost him financially, as the family lost its savings in the latest fire.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/brdfvcbv.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw  DESPITE a two-year onslaught of disturbing and escalating threats from an embittered ex-girlfriend, delivered via numerous local and foreign phone numbers, married journalist Methuseli Moyo maintained a composed silence. The threats stemmed from his decision to end the relationship with the now bitter ex (name withheld) and marry his sweetheart, Natasha Mhlanga. The […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "Traditional football rivalries blurred by common opponent",
            "url": "https://www.chronicle.co.zw/traditional-football-rivalries-blurred-by-common-opponent/",
            "content": "Innocent Kurira,[emailprotected]\n\nTHE supposed marriage of convenience between Dynamos and CAPS United fans, united against Scottland FC at Rufaro Stadium, pales in comparison to the marriage from hell witnessed when Dynamos fans wholeheartedly supported Highlanders.\n\nDynamos supporters, renowned for their fervent and vocal nature, erupted in palpable excitement as news filtered through the Vietnam Stand at Rufaro Stadium that Highlanders had scored against Scottland, 439 kilometres away at Barbourfields Stadium. This display of solidarity, though surprising, was not entirely unexpected, given Dynamos fans pre-game declarations of support for their traditional rivals.\n\nWhere once Dynamos fans employed Bosso chants as a form of derisive mockery, now they chanted with genuine jubilation, anticipating a Highlanders victory. A shared adversary had emerged, temporarily dissolving the long-standing animosity between the two footballing giants. This unprecedented alliance, a surreal spectacle, united Bosso and DeMbare in their common cause against Scottland.\n\nThe question remains: what does this extraordinary alliance signify for Zimbabwean football? Scottland has undeniably injected a new dynamism into the local league. They have not only challenged the established dominance of the traditional big three  Dynamos, Highlanders, and CAPS United  but also introduced a captivating flamboyance.\n\nBoasting some of the nations finest players and gradually showcasing a quality of football that surpasses that of their rivals, Scottlands ascent has been nothing short of remarkable. In past encounters, Dynamos fans, particularly those in the Mpilo End at Barbourfields, would routinely cheer for any opponent facing Highlanders.\n\nHowever, Scottland has shattered these traditional rivalries. The spontaneous celebration in the Vietnam Stand served as a tangible indicator of a shift in the power dynamics of Zimbabwean football, a shift that may prove permanent.\n\nCould this be the dawn of a new era? A fundamental realignment of power? Former Highlanders CEO Nhlanhla Dube offered a compelling perspective via social media.\n\nA very short, sharp lesson in football fandom. Bosso and DeMbare are rivals, not enemies. Theres a confluence of football interests once in a while when a common foe is identified collectively.\n\nScottland has emerged as that common foe, a force capable of bridging the seemingly insurmountable divide between two historically antagonistic fan bases.\n\nScottlands CEO, Ronald Moyo, also shared his observations on this peculiar yet significant development.\n\nFor me, the celebration of Highlanders FCs goal by Dynamos FC fans challenges the traditional discourse surrounding football rivalries. From a Foucauldian perspective, discourse regulates what is thinkable and what is sayable within a particular context. In this case, Dynamos FC fans thought the unthinkable, did the undoable, and chanted the unchantable.\n\nCould this be an event that disrupts our conventional norms of football fandom where rival teams are compelled to be sworn enemies? Or is it simply a matter of a common enemy? And what are the consequences?  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gfsdthiuu9yjyo.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw THE supposed “marriage of convenience” between Dynamos and CAPS United fans, united against Scottland FC at Rufaro Stadium, pales in comparison to the “marriage from hell” witnessed when Dynamos fans wholeheartedly supported Highlanders. Dynamos supporters, renowned for their fervent and vocal nature, erupted in palpable excitement as news filtered through the Vietnam Stand […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "Vice President  Mohadi re-affirms Goverment’s drive to create inclusive schools",
            "url": "https://www.chronicle.co.zw/vice-president-mohadi-re-affirms-goverments-drive-to-create-inclusive-schools/",
            "content": "Thupeyo Muleya, Beitbridge BureauVICE-President Kembo Mohadi yesterday re-affirmed the Governments commitment to establishing inclusive schools nationwide where no child is refused admission to any learning facility by the imposition of onerous terms and conditions.\n\nHe said discrimination on grounds of race, tribe, place of origin, national or ethnic origin, political opinions, colour creed or gender was not welcome under the Second Republic.\n\nVice-President Mohadi said the constitution provides for the right to education for all citizens and permanent residents of this country.\n\nThere should be no discriminatory tendencies in any form and manner when admitting the children to school but instead they should be motivated to develop a sharp focus and zeal to prosper at school, said VP Mohadi.\n\nHe said the right to education, especially to children of school going age, is fundamental.\n\nVP Mohadi made the remarks in a speech read on his behalf by the Matabeleland South Minister of State for Provincial Affairs, Dr Evelyn Ndlovu, during the commissioning of a solarised borehole system he donated along with some computers to his former school, Beitbridge Mission primary.\n\nThe school is also the only learning centre in Matabeleland South province that has boarding facilities for pupils with disabilities.\n\nMinister Ndlovu commissioned the borehole system that was sourced and equipped by TelOne while some of the donated computers have already been installed in the schools computer lab.\n\nDiscovery Ambulances has also trained 70 pupils on first aid services to the school to complement the initiatives being made by the Vice-President to boost child friendly schools in the area.\n\nThe education sector mainly falls under the Governance and Inclusive Economic Growth pillars with the pathway towards realisation of Vision 2030, said VP Mohadi.\n\nMatabelaland South Minister of State for Provincial Affairs Dr Evelyn Ndlovu (left) and TelOne CEO, Engineer Lawrence Nkala shake hand over first aid certificates to puplis at Beitbridge Mission primary school during the commissioning of a solar powered water source that was donated by Vice President Kembo Mohadi-picture by Thupeyo Muleya\n\nThis is being regulated through the following Thematic Working Groups, that is, Youth, Gender, Sports and Culture, Social Protection, as well as Human Capital Development and Innovation.\n\nSo, its important that in our prioritisation to build our economy, we view our context in line with the national focus so that we also contribute to the Gross Domestic Product (GDP) and the Gross National Product (GNP) from the provincial and national perspective.\n\nThe Constitution of Zimbabwe provides for the Right to Education for all citizens and permanent residents of this country.\n\nEvery Zimbabwean has a right to a basic state-funded education, including adult basic education and further education, which the state through reasonable legislative and other measures, must make progressively available and accessible.\n\nVP Mohadi said the provision of State-funded education is the basis of education delivery hence the national budget has fiscal space that accommodates all children of school-going age.\n\nHe noted that the donation made to Beitbridge Mission Primary School follows his initial visit at the school in July last year where he made pledges in response to their specific requests and needs.\n\nBy the way of giving back to the community it is significant to respond to the challenges that when addressed, will provide the need to bridge gaps, said VP Mohadi.\n\nMy visit today, other than to meet kinship, relatives, friends, children and grandchildren, as well as the community at large, is to honour my pledge to augment water services at this institution.\n\nIndeed, water is the source of life to all of us. Im also continuously indebted to this school where my foundation in education was established.\n\nIn an effort to improve education provision to the Beitbridge community, the school is implementing poultry, nutritional garden, tuck shop, orchard and ornamental trees, mushroom growing and fish farming projects.\n\nAll these projects desire a dependable source of water, which I trust the solarised borehole will provide to keep the school green, he added.\n\nVP Mohadi commended TelOne for their participation and offer in the installation of the solarised borehole system.\n\nHe called on the business community to assist where they can to improve service delivery systems in the communities around them.\n\nThe new water system at Beitbridge Mission will support the sustainability and environmental stewardship of agricultural programmes at the institution.\n\nClean water will enable students to practise proper hygiene reducing the risk of water borne diseases. This also contributes to a healthier learning environment where students can focus on their studies without the constant threat of illness, said VP Mohadi.\n\nThis is in line with the Disaster Risk Management and Resilient Plan for the Education Sector in Zimbabwe 2021-2025. Adequate water supply will ensure proper sanitation facilities promoting dignity and well-being of learners.\n\nHe said access to clean water was a fundamental human right essential for the health, well-being and education of all learners.\n\nThe Beitbridge Mission water system project, said VP Mohadi, was a crucial step towards ensuring that school children have access to this basic necessity and is a shining example of the results of collaboration.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vcxvxcdgxcv.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau VICE-President Kembo Mohadi yesterday re-affirmed the Government’s commitment to establishing inclusive schools nationwide where no child is refused admission to any learning facility by the imposition of onerous terms and conditions. He said discrimination on grounds of race, tribe, place of origin, national or ethnic origin, political opinions, colour creed or […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "‘They framed me’…Award-winning dancer denies rape, now teaches traditional dance",
            "url": "https://www.chronicle.co.zw/they-framed-me-award-winning-dancer-denies-rape-now-teaches-traditional-dance/",
            "content": "Givemore Muzariri\n\nDESPITE a past marred by a conviction for rape, which resulted in a 20-year prison sentence, 2024 National Merit Arts Awards (Nama) winner Philani Mabasa is now dedicated to preserving Zimbabwean culture. He has launched traditional dance training programmes for primary and secondary school students, a project conceived during his time in prison.\n\nEmboldened by a presidential amnesty, the traditional dancer re-entered the arts, forging an independent path dedicated to educating both the wider community and incarcerated individuals through dance, and sharing the lessons gleaned from his time within prison walls.\n\nIn an exclusive interview with the Saturday Chronicle, Mabasa detailed the sequence of events that culminated in his rape conviction and incarceration.\n\nI am aware that many people were disappointed when they read in various media outlets about my 20-year conviction for the alleged rape of a female member of the Hloseni traditional dance group. The truth is, we were in a relationship, and she was also seeing another group member. On the day in question, her other partner found us together in one of the rooms booked for the group, he said.\n\nFollowing the discovery of their relationship, the traditional dancer claimed the womans other partner demanded payment, a request he denied. He alleges this refusal prompted the couple to fabricate rape charges, a story that gained widespread attention due to his prominent status as an award winner.\n\nWhen I began my relationship with this woman, she was not married. To my surprise, another member of the Hloseni traditional dance group claimed he was her husband. He made these claims after finding us together in a room where the group was staying for a performance. He then began harassing me for money, which I ignored, little realising they would conspire to have me imprisoned for over ten years, he said.\n\nTwo weeks after the incident, Mabasa received a summons from the central police station regarding a disagreement with another group member; he was not informed of the rape accusation at that juncture.\n\nWhen I arrived at the police station, I was told I was there to discuss the matter with the other man, to find common ground. However, I was then informed that I was under arrest for rape.\n\nInitially, I thought it was a joke, but the seriousness of the charges made me realise my life had been ruined by this couple. I was remanded in custody for over two months while the case was heard in court. The evidence presented convinced the judges that I had forced myself on the woman, leading to my conviction. As it was my first time in court, I had no legal representation and could not defend myself, making it easy for the prosecution to secure a conviction.\n\nInitially facing a harsh 20-year prison term, the dancers sentence was later mitigated to 11 years, a result of a one-third remission for exemplary conduct. Following this significant sentence, he was relocated to Khami Remand Prison, a high-security facility.\n\nWhen I arrived at Khami Remand Prison, I was surprised by the number of inmates. Among them, I met artistes I had previously worked with. They gave me hope that I could complete my sentence.\n\nWhile in prison, I joined the rehabilitation programme and worked on various productions, some of which were sold to the Zimbabwe Broadcasting Corporation. One such production, Crime and Strings, focused on community crime and its consequences.\n\nPhilani Mabasa (far right)\n\nMabasa credited the Zimbabwe Prisons and Correctional Services (ZPCS) shift towards rehabilitation for providing him with the platform to cultivate his talent in traditional dance instruction. This newly honed expertise resulted in invitations to train fellow inmates for the 2015 Chibuku Neshamwari dance competitions held in Bulawayo.\n\nWe came second in the Chibuku Neshamwari competition, receiving prize money that boosted our confidence. I started training inmates, and the positive results led to invitations to train schoolchildren from Khami Primary School. These students also excelled, confirming my aptitude for teaching traditional dance. This inspired me to pursue teaching as a career after my release, he said.\n\nMabasa credited the ZPCS rehabilitation programmes with transforming prison life, fostering an environment where inmates could hone their artistic talents. This led to the formation of Insizwa Zomdumo, a musical group that provided entertainment for both inmates and officers at Khami Remand Prison.\n\nAt Khami Remand Prison, I met talented artistes serving their sentences. We formed Insizwa Zomdumo, an acapella group, entertaining inmates and officers while improving our singing skills.\n\nIn 2024, I benefited from the presidential amnesty and began conducting workshops on various traditional dances. These workshops enabled me to fulfil my dream of teaching schoolchildren. Currently, primary students are learning the Chinyambera dance from Manicaland province, and secondary students are learning the Amabhiza dance.\n\nI hope to establish an organisation to train inmates, as they are often excluded from community programmes, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hdfgds.jpg",
            "description": "Givemore Muzariri DESPITE a past marred by a conviction for rape, which resulted in a 20-year prison sentence, 2024 National Merit Arts Awards (Nama) winner Philani Mabasa is now dedicated to preserving Zimbabwean culture. He has launched traditional dance training programmes for primary and secondary school students, a project conceived during his time in prison. […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "UNITED IN MEDIOCRITY…The curious confluence of DeMbare, Bosso",
            "url": "https://www.chronicle.co.zw/united-in-mediocrity-the-curious-confluence-of-dembare-bosso/",
            "content": "Stanford Chiwanga\n\nA peculiar phenomenon has gripped the football loving nation of Zimbabwe  a temporary truce made in the fires of common anxiety.\n\nThe grand old names of the game, Dynamos and Highlanders, traditionally fierce rivals, have found themselves united, not in glory, but in a shared apprehension of a growing force  Scottland FC.\n\nLast week, a sight once unimaginable happened  Dynamos fans at Rufaro Stadiums Vietnam End, in a moment of startling solidarity, erupted in cheers as Highlanders took the lead against Scottland in Bulawayo.\n\nThis unholy alliance, born of a mutual threat, raises pertinent questions about the shifting landscape of Zimbabwean football.\n\nThe rise of Scottland has been nothing short of meteoric. Once a minnow in the nations footballing narrative, they now command attention, their talented squad rattling the very foundations upon which Dynamos and Highlanders have long stood.\n\nThis newfound supremacy has exposed a raw nerve, a collective vulnerability within the traditionally dominant clubs. Is this a mere blip, or a seismic shift in the power dynamics of the Premier Soccer League?\n\nThis unexpected camaraderie, however fleeting, reveals a deeper malaise. DeMbare and Bosso, once symbols of footballing prowess, now appear to be united in a shared experience of relative decline.\n\nTheir on-field struggles, compounded by off-field administrative woes, have created a fertile ground for Scottlands ascendance.\n\nLloyd MaBlanyo Chigowe\n\nThe once fierce rivalry, fuelled by blood and thunder clashes and title races, has been temporarily suspended, replaced by a nervous, almost desperate, unity.\n\nThe implications of this unholy alliance extend beyond a momentary show of solidarity. It signifies a potential reshaping of the football environment in Zimbabwe.\n\nThe established order is being challenged, and the traditional giants are being forced to confront their own shortcomings. This unexpected unity signals a recognition that the threat posed by Scottland is not merely a passing phase.\n\nIt is a stark reminder that complacency has no place in football, a sport where fortunes can change in an instant.\n\nThe question now is whether this alliance, born of necessity and perhaps a shared reliance, will translate into a sustained effort by the fans to help their clubs reclaim their former glory.\n\nWill Dynamos and Highlanders use this shared adversity as a catalyst for change, or will they continue to cling to past glories, allowing the likes of Scottland, Simba Bhora and FC Platinum to further consolidate their position?\n\nIt is a stark reality that their very existence, their ability to field teams, is largely dependent on the financial lifeline provided by Sakunda Holdings.\n\nWithout this sole significant sponsor, both clubs would be teetering on the brink of extinction, a fact that underscores the urgency of their situation.\n\nThe temporary truce has exposed the fragility of their dominance, and the future of football in Zimbabwe may well hinge on how these two giants respond to this unprecedented challenge.\n\nHowever, this response must extend beyond mere on-field performance. It requires a fundamental shift in their administrative and financial structures, which are currently propped up almost entirely by Sakunda.\n\nTo survive in the long term, and to truly challenge the ascendant forces within the league, Dynamos and Highlanders must find a way to stand on their own feet, independent of this single, vital support.\n\nWithout it, their rivalry, their survival, and indeed their newly found unity, would be rendered moot.  @plainstan\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cxvcbhdvcbfhcvb.jpg",
            "description": "Stanford Chiwanga A peculiar phenomenon has gripped the football loving nation of Zimbabwe — a temporary truce made in the fires of common anxiety.  The grand old names of the game, Dynamos and Highlanders, traditionally fierce rivals, have found themselves united, not in glory, but in a shared apprehension of a growing force — Scottland […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        },
        {
            "title": "Zimbabwe’s road infrastructure needs urgent attention",
            "url": "https://www.chronicle.co.zw/zimbabwes-road-infrastructure-needs-urgent-attention/",
            "content": "Stephen Mpofu\n\nAS a developing country Zimbabwe faces many challenges, what with illegal western imperialist sanctions meant to ground us completely. But our country is far, far from being an imperialist backyard as our sworn foreign enemies wish us to be.\n\nNevertheless, infrastructure, particularly road networks, requires urgent attention. Resident concerns, such as those voiced in Masvingo, regarding the deteriorating state of roads, demand a prompt and effective response from relevant authorities.\n\nThese concerns are rooted in the collective desire for efficient movement of goods and services, vital for national progress.\n\nResidents in Masvingo have highlighted the severely potholed road connecting the province to Beitbridge, a critical artery for trade with South Africa and a key route for tourism. The condition of this road impedes business transactions and hinders the smooth flow of tourists, both of which are essential for revenue generation and national development.\n\nThe people concerned should not be viewed as saying: kuMasvingo ne carpet/ eMasvingo ngecarpet/ to Masvingo on the carpet.\n\nThe poor state of the road has also created opportunities for criminal activity, with slow-moving traffic becoming a target.\n\nThe road has become a thorn in the flesh for motorists as it is no longer trafficable. (Picture by Nkosizile Ndlovu)\n\nThis necessitates immediate action from law enforcement agencies to ensure the safety of travellers. The Masvingo-Beitbridge highway is not an isolated case. The road from Zvishavane, through Buchwa mountain, to Rutenga, where it intersects with the Masvingo-Beitbridge road, is also reported to be in a state of disrepair.\n\nThis poses significant challenges for those travelling from Bulawayo, particularly in the absence of a reliable rail service, which previously served as a vital link for local communities.\n\nFurthermore, the decline in inter-city passenger train services has compounded the transport difficulties faced by many. Questions arise regarding the disappearance of the once-common road maintenance teams, equipped with basic tools, who diligently addressed potholes and bridge damage. Its unclear whether this absence reflects a shift in labour practices or a perceived association with past colonial systems. Regardless, the impact on rural communities, where even basic transport like ox-drawn sledges and donkey carts struggle, is significant.\n\nIronically, urban centres, despite possessing greater resources, also grapple with potholed roads, both within city limits and in surrounding suburbs. Residents consistently report vehicle damage due to these conditions. Roads and railways are fundamental to the movement of goods and services, driving economic advancement and enabling Zimbabwe to secure a prosperous future.\n\nIn conclusion, this communicologist humbly believes that the powers that be might wish to conduct a review of the state of this countrys road infrastructure in order to strengthen it where necessary to help drive our national development in compliance with our governments mantra: nyika inovakwa nevene vayo/ilizwe lakhiwa ngabanikazi balo/a country is built by its owners.\n\nThus, no part of the foregoing discourse should be viewed as a harsh critique aimed at any government section but should instead be seen for what the whole discussion is intended: an enabler for the common good of all Zimbabweans.\n\nOur country should not be viewed by outsiders as a NO-GO place because of dilapidated roads that, for instance, make visits to some tourist spots nightmarish.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/uu56u.jpg",
            "description": "Stephen Mpofu AS a developing country Zimbabwe faces many challenges, what with illegal western imperialist sanctions meant to ground us completely. But our country is far, far from being an imperialist backyard as our sworn foreign enemies wish us to be. Nevertheless, infrastructure, particularly road networks, requires urgent attention. Resident concerns, such as those voiced […]",
            "time": "08:35",
            "date": "05 Apr 2025"
        }
    ]
}