{
    "news": [
        {
            "title": "Parents jailed for stashing loot stolen by their son",
            "url": "https://www.chronicle.co.zw/parents-jailed-for-stashing-loot-stolen-by-their-son/",
            "content": "Online Reporter\n\nA man and his wife from Kwekwehave been thrown behind bars for hiding stolen cash linked to their sons daring US$40,000 heist in Midlands city.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said the couple, John Tuhwe (51) and his wife Gciniso Ndlovu (43) secretly stashed US$680 in a wardrobe and US$5,200 in a fridge filled with meat, helped their son Calvinnow on the runcover up his crime.\n\nThe theft, carried out on the 15th of May 2024 involved Calvin and his accomplices who broke into the complainants home, stealing the large sum. Calvin fled after sharing the loot with his parents. The court found John and Gciniso guilty of assisting in hiding stolen funds.\n\nThe couple was jailed for 6 months each, the NPAZ said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/10/jail-brreak.jpg",
            "description": "Online Reporter  A man and his wife from Kwekwe have been thrown behind bars for hiding stolen cash linked to their son’s daring US$40,000 heist in Midlands city. In a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said the couple, John Tuhwe (51) and his wife Gciniso Ndlovu (43) secretly stashed US$680 in a wardrobe […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Copper cable thieves jailed 10 years",
            "url": "https://www.chronicle.co.zw/copper-cable-thieves-jailed-10-years-2/",
            "content": "Online Reporter\n\nTHREE men have been jailed 10 years each for trying to steal copper cables and transformer windings worth over US$15 000.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe saidHatina Payiwa (51), Johane Masaire (21) and Peter Zuze (38) were sentenced to 10 years imprisonment each by the Mutare Magistrates Court.\n\nThe trio were found guilty fortampering with ZETDC Infrastructure at Greater Sisal Dairy Farm, Old Mutare.The trio attempted to steal copper cables and transformer windings, causing US$15200 worth of damage.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/10/WhatsApp-Image-2022-10-17-at-10.21.05-1.jpeg",
            "description": "Online Reporter  THREE men have been jailed 10 years each for trying to steal copper cables and transformer windings worth over US$15 000. In a statement, the National Prosecuting Authority of Zimbabwe said Hatina Payiwa (51), Johane Masaire (21) and Peter Zuze (38) were sentenced to 10 years imprisonment each by the Mutare Magistrates’ Court. The […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Fuel company fined for selling petrol with high amounts of ethanol",
            "url": "https://www.chronicle.co.zw/fuel-company-fined-for-selling-petrol-with-high-amounts-of-ethanol/",
            "content": "Online Reporter\n\nCOMOIL (Pvt) Ltd has been fined US$250 after being found guilty of selling petrol with an ethanol content exceeding the legal limit, the Lupane Magistrates Court has ruled.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe said the company, represented by supervisor Livingstone Mubvumbi, was charged following an inspection by the Zimbabwe Energy Regulatory Authority (ZERA) at the Lupane Station, Matabeleland North province on December 6, 2024.\n\nTesting of fuel samples revealed ethanol levels above the 50percent threshold set by E20 ZWS 964 standards, leading to the sealing of non-compliant fuel tanks. The breach was later confirmed by the Standards Authority of Zimbabwe (SAZ). The company was found in violation of fuel quality regulations under SI 23/2013 and SI 171/2014.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-102.jpg",
            "description": "Online Reporter COMOIL (Pvt) Ltd has been fined US$250 after being found guilty of selling petrol with an ethanol content exceeding the legal limit, the Lupane Magistrates’ Court has ruled. In a statement, the National Prosecuting Authority of Zimbabwe said the company, represented by supervisor Livingstone Mubvumbi, was charged following an inspection by the Zimbabwe […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Teen escapes prison for stealing",
            "url": "https://www.chronicle.co.zw/teen-escapes-prison-for-stealing/",
            "content": "Online Reporter\n\nA BULAWAYO teenager accused of stealing goods worth US$1 300 was discharged yesterday at the close of the States case due to insufficient evidence.\n\nMichael Madzora (17) was alleged to have committed the crime in May last year. However, Western Commonage magistrate Mr Mehluli Moyo acquitted him, citing inconsistencies in the testimonies of the complainant and witnesses.\n\nAfter listening to the testimonies by the complainant and other State witnesses, the court noted that there is a lack of evidence linking the accused to the offence. Accordingly, he is found not guilty and acquitted, ruled the magistrate.\n\nThe prosecutor, Mrs Ellen Matenga, told the court that the incident occurred on 27 May last year, at Kelvin Shopping Centre in Bulawayo.\n\nMrs Nonjabulo Ndlovu, the complainant, testified that she had gone to Kelvin to have her car fixed and left her belongings in the vehicle. These included a laptop, a mobile phone, US$380, her identification card, and bank cards.\n\nMichael, in his defence, claimed he was in South Africa on the day of the alleged crime and only returned on 31 May. He stated that he bought a phone from someone at Unity Village upon his return and later swapped it for another device.\n\nI was not in the country on 27 May. I was in South Africa and when I returned, I bought a phone from someone as I didnt have one. After using it for a few days, I swapped it for another phone, he said.\n\nMichael told the court that he voluntarily led the police to the person who had the phone.\n\nMrs Ndlovu recovered her phone, identification card, and bank cards, which had been picked up along Khami Road by a good Samaritan.\n\nSomeone called me and said they had found my particulars along Khami Road. I informed the officer handling my case, and he advised me to collect them, she said.\n\nOf the stolen goods, US$500 worth was recovered.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/05/8i8i78tggfbf.jpg",
            "description": "Online Reporter A BULAWAYO teenager accused of stealing goods worth US$1 300 was discharged yesterday at the close of the State’s case due to insufficient evidence. Michael Madzora (17) was alleged to have committed the crime in May last year. However, Western Commonage magistrate Mr Mehluli Moyo acquitted him, citing inconsistencies in the testimonies of […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Woman loses over US$6 000 to bogus housing agent",
            "url": "https://www.chronicle.co.zw/woman-loses-over-us6-000-to-bogus-housing-agent/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nPolice in Bulawayo are investigating a case of fraud in which a 27-year-old woman from Paddonhurst was defrauded of a total of US$6,350 by an unscrupulous housing agent.\n\nJacob Rabatwa, who is employed as a housing agent, went to Upper Rangemore to show the unnamed complainant stands for sale on 21 June 2024.\n\nThe complainant selected a 250 square metre stand priced at US$6,250 and paid a US$1,400 cash deposit the next day. She subsequently made additional payments totalling US$4,950, and they signed a sales agreement for the stand.\n\nIn a statement, Inspector Nomalanga Msebele said that on 25 January, the complainant visited the stand she had purchased and discovered a foundation already dug there. A neighbour informed her that the stand actually belonged to someone in South Africa.\n\nAfter confirming with the real owner, she questioned the accused, who provided an unsatisfactory response. A police report was filed, but the accused has not yet been arrested. The total loss is US$6,350, with no recovery.\n\nPolice urge the public to verify the authenticity of agents before making transactions to avoid financial loss and to seek any information leading to the accuseds arrest, said Inspector Msebele.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Assistant-Inspector-Nomalanga-Msebele.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com Police in Bulawayo are investigating a case of fraud in which a 27-year-old woman from Paddonhurst was defrauded of a total of US$6,350 by an unscrupulous housing agent. Jacob Rabatwa, who is employed as a housing agent, went to Upper Rangemore to show the unnamed complainant stands for sale on 21 June 2024. […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "New Toll Fees at Beitbridge Border Post",
            "url": "https://www.chronicle.co.zw/new-toll-fees-at-beitbridge-border-post/",
            "content": "Online Reporter\n\nAS from February 1, toll fees at Beitbridge Border post will be adjusted upwards for some vehicles, Zim Borders has announced.\n\nIn a statement, Zimborders revealed that there will be no increase in fees for non-commercial vehicles, including motorcycles, light vehicles, and minibuses.\n\nThis decision reflects the companys commitment to absorbing the inflationary impacts for these vehicle categories in 2025, read the statement.\n\nHowever, Zimborders said a modest increase will be applicable to commercial vehicles, including light goods vehicles, coaches, heavy vehicles, goods vehicles, abnormal vehicles, and parking bays. The respective toll fee adjustments are available on the Zimborders website.\n\nThe new toll fees, effective February 1, 2025, are as follows: motorcycles will be charged $6.00, light vehicles US$28, minibuses US$41, coaches US$85, light goods vehicles US$85, heavy vehicles US$122, and goods vehicles US$213. Parking fees for freight and abnormal vehicles will be US$49 and US$61, respectively.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/A-birds-view-of-the-transformed-Beitbridge-Border-Post-at-night-Picture-Zimborders1.png",
            "description": "Online Reporter  AS from February 1, toll fees at Beitbridge Border post will be adjusted upwards for some vehicles, Zim Borders has announced. In a statement, Zimborders revealed that there will be no increase in fees for non-commercial vehicles, including motorcycles, light vehicles, and minibuses. “This decision reflects the company’s commitment to absorbing the inflationary […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Police intensify crack down on illegal kombis",
            "url": "https://www.chronicle.co.zw/police-intensify-crack-down-on-illegal-kombis/",
            "content": "Online Reporter\n\nThe Zimbabwe Republic Police (ZRP) has intensified its ongoing operation, No to Mushikashika and Lawlessness on the Roads, aimed at restoring order and promoting public safety in the country.\n\nThis comes amid growing concerns over the proliferation of unregistered kombis and pirate taxis disrupting traffic and endangering lives.\n\nIn a statement, ZRP national spokesperson, Commissioner Paul Nyathi said there is need for compliance and warned operators that are flouting the law.\n\nWe want to make it clear that only registered kombis with verifiable documentation will be allowed to operate as public service vehicles, said Commissioner Nyathi.\n\nUnregistered kombis and pirate taxis have no place on our roads, and we urge operators to comply with the law to avoid facing legal consequences.\n\nThe police have also highlighted that unroadworthy vehicles, illegal pick-up and drop-off points and corruption have exacerbated road safety concerns.\n\nCommissioner Nyathi called on the public to exercise caution when choosing transporters.\n\nPassengers must avoid boarding ramshackled kombis, especially those without registration plates or with windows covered by makeshift materials like cardboard boxes. Public safety is a collective effort and we urge everyone to play their part, he said.\n\nThe ZRP has also vowed to address internal corruption within its ranks.\n\nCommissioner Nyathi said the police are determined to root out corrupt elements and restore public trust.\n\nThe police are also focusing on illegal operations along high-traffic routes such as the Chitungwiza-Harare Central Business District corridor.\n\nUnregistered kombis dropping passengers near Seke Bridge have come under scrutiny, with the police pledging decisive action.\n\nZRP Commissioner-General Stephen Mutamba has also directed Police Commanders to facilitate the smooth passage of fully compliant kombis at checkpoints to avoid unnecessary delays.\n\nMeanwhile, the public has been encouraged to report any instances o\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/sdfafdcx.jpg",
            "description": "Online Reporter The Zimbabwe Republic Police (ZRP) has intensified its ongoing operation, “No to Mushikashika and Lawlessness on the Roads,” aimed at restoring order and promoting public safety in the country. This comes amid growing concerns over the proliferation of unregistered kombis and pirate taxis disrupting traffic and endangering lives. In a statement, ZRP national […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Man (28) “assaults” girlfriend (58)’s father (77)",
            "url": "https://www.chronicle.co.zw/man-28-assaults-girlfriend-58s-father-77/",
            "content": "Trish Mukwazo,[emailprotected]\n\nA 28-YEAR-old man who is dating a 58-year-old woman was dragged to court for allegedly assaulting his girlfriends 77-year-old father.\n\nMilton Mpala of Mzilikazi suburb appeared before Bulawayo magistrate Mr Abednico Ndebele facing an assault charge.\n\nMpala denied the allegations, claiming he did not assault the victim but only pushed him.\n\nHe was remanded in custody until 4 February.\n\nPresenting the case for the State, Ms Mufaro Ndiraire said the incident occurred on 25 January around 1 AM after Mpala stormed the complainant Mr Peter Mgunis bedroom and indiscriminately assaulted him with an unknown object all over the body.\n\nMguni was rushed to the hospital for medical assistance, and the matter was reported to the police station, leading to Mpalas arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/05/tyh56y54.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com A 28-YEAR-old man who is dating a 58-year-old woman was dragged to court for allegedly assaulting his girlfriend’s 77-year-old father. Milton Mpala of Mzilikazi suburb appeared before Bulawayo magistrate Mr Abednico Ndebele facing an assault charge. Mpala denied the allegations, claiming he did not assault the victim but only pushed him. He was […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Police impound truck filled with smuggled goods",
            "url": "https://www.chronicle.co.zw/police-impound-truck-filled-with-smuggled-goods/",
            "content": "Midlands Bureau\n\nPolice in Gweru have impounded a truck that was travelling from South Africa to Kadoma with smuggled goods worth thousands of United States dollars.\n\nThe syndicate evaded police roadblocks through a surveillance car that was travelling ahead and communicating with those in the truck through a radio.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-28-at-14.43.28-680x380.jpeg",
            "description": "Midlands Bureau Police in Gweru have impounded a truck that was travelling from South Africa to Kadoma with smuggled goods worth thousands of United States dollars. The syndicate evaded police roadblocks through a surveillance car that was travelling ahead and communicating with those in the truck through a radio.",
            "time": "21:46",
            "date": "28 Jan 2025"
        },
        {
            "title": "Kwekwe man jailed 26 years for rape and robbery",
            "url": "https://www.chronicle.co.zw/kwekwe-man-jailed-26-years-for-rape-and-robbery/",
            "content": "Online Reporter\n\nA Kwekwe man has been sentenced to 26 years in prison for raping a woman five times before robbing her.\n\nThe 40-year-old man appeared before the Kwekwe Magistrates Court facing charges of rape and robbery.\n\nThe court heard that on January 18, the man forcefully entered the complainants workplace while she was sleeping.\n\nHe threatened her with a knife and raped her five times without protection. On the same day, the man hurt the complainant on her pelvis with an iron bar before forcefully taking US$80 and groceries worth US$623.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Online Reporter A Kwekwe man has been sentenced to 26 years in prison for raping a woman five times before robbing her. The 40-year-old man appeared before the Kwekwe Magistrates Court facing charges of rape and robbery. The court heard that on January 18, the man forcefully entered the complainant’s workplace while she was sleeping. […]",
            "time": "21:46",
            "date": "28 Jan 2025"
        }
    ]
}