{
    "news": [
        {
            "title": "Bulawayo school  pioneers robotics for ECD, primary classes",
            "url": "https://www.chronicle.co.zw/bulawayo-school-pioneers-robotics-for-ecd-primary-classes/",
            "content": "Nqobile Tshili,[emailprotected]\n\nMODERN learners must be equipped with skills for a fast-paced digital world and there is no best way to do so than anchoring them fully on this path from a tender age.\n\nThis is what a Nkulumane-based Charleston Trust Primary School in Bulawayo is doing, having championed the teaching of robotics for all its classes to foster critical thinking and problem solving at infant level.\n\nThe move aligns with the Heritage-Based Curriculum whose thrust is to exploit local resources for national development.\n\nThe introduction of robotics follows the introduction of coding classes last year, making it one of the pioneer schools to introduce coding and robotics classes.\n\nThe schools innovation last year attracted the attention of Primary and Secondary Education Minister Torerai Moyo, who visited the school to observe Grade One pupils attending coding lessons.\n\nThe school is one of the private schools that are complementing Government efforts to provide quality education to all citizens.\n\nThe schools Information Communication Technology (ICT) teacher, Mr Admore Ndlovu, said they want to produce pupils with skills to tackle 21st century challenges while aligning to national development goals.\n\nThe decision to introduce robotics was driven by our commitment to preparing learners for a rapidly evolving digital world. Globally, robotics is revolutionising industries (from agriculture to healthcare) and we aim to equip our pupils with foundational skills to thrive in these fields, he said.\n\nAdditionally, Zimbabwes National Development Strategy (NDS1) and Vision 2030 emphasise innovation, science, technology, engineering and mathematics education, which aligns perfectly with this initiative, said Mr Ndlovu.\n\nHe said the positive reception of the schools coding programme last year further motivated the authorities to expand into robotics to ensure their learners stay ahead.\n\nMr Ndlovu said robotics is integrated into the curriculum for all learners, starting from Early Childhood Development (ECD) up to Grade 7.\n\nHe said infants engage in basic concepts through play-based activities while older grades tackle more complex projects involving programming and problem-solving.\n\nRobotics foster critical thinking, creativity and collaboration. It encourages learners to approach problems methodically, test solutions, and persist through challenges, said Mr Ndlovu.\n\nHe said these skills empower pupils to address local issues such as designing tech solutions for agriculture or renewable energy.\n\nRobotics nurtures digital literacy, positioning our learners to compete nationally and globally, said Mr Ndlovu.\n\nHe said the schools robotics curriculum combines hands-on engineering (building robots using kits like LEGO Education) with programming (coding robots to perform tasks).\n\nLearners explore concepts like sensors, motors and automation while applying mathematics and science practically, said Mr Ndlovu.\n\nHe said last years introduction of coding provided the foundation for teaching robotics. Mr Ndlovu said while coding teaches logical thinking and algorithm design such as creating animations or games, robotics brings the code to life in the physical world.\n\nThink of coding as writing a story and robotics as performing that story on stage! Together, they create a holistic understanding of how technology shapes reality, he said.\n\nMr Ndlovu said Zimbabwes Heritage-Based Curriculum prioritises innovation and problem-solving rooted in local context.\n\nCoding aligns with this by teaching learners to create solutions that honour our cultural values while embracing modernity, he said.\n\nMr Ndlovu said coding and robotics can be used to promote indigenous languages or simulate historical events.\n\nCharleston Trust Primary School showcasing robotics kits.\n\nThis blend of heritage and technology ensures our youth preserve their identity while driving national progress. Early exposure cultivates computational thinking, which entails breaking down complex problems into manageable steps. Pupils also develop resilience and creativity, said Mr Ndlovu.\n\nThis, Mr Ndlovu said, demystifies technology thereby inspiring confidence in fields often perceived as difficult, especially for girls.\n\nOver time, this prepares them for advanced STEM studies and careers, bridging gender and skill gaps in Zimbabwes tech sector, he said. Mr Ndlovu said the schools innovations reflect its belief in holistic and future-ready education.\n\nWeve partnered with local tech hubs to enhance resources and teacher training. Upcoming events include a Robotics Fair where pupils will showcase projects addressing community challenges.\n\nThrough blending tradition with technology, were nurturing agile thinkers who honour their heritage while shaping Zimbabwes future, he said.\n\nMr Ndlovu said parents can support the school through encouraging curiosity through STEM toys, books, or family coding challenges.\n\nHe said parents and guardians can also buy devices that enable children to utilise technology they use at school.\n\nMeanwhile, the school has also introduced French as an international subject and the subject is taught from ECD to Grade 7.\n\nAs Zimbabwe strengthens ties within SADC and the African Union, French (a key language in 30+ African countries) opens doors for future collaboration.\n\nLearning French enhances cognitive flexibility, cultural empathy, and global communication skills. For instance, pupils can engage in pan-African projects or pursue opportunities in Francophone nations, said Mr Ndlovu. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/BNNBCBNV.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw MODERN learners must be equipped with skills for a fast-paced digital world and there is no best way to do so than anchoring them fully on this path from a tender age. This is what a Nkulumane-based Charleston Trust Primary School in Bulawayo is doing, having championed the teaching of robotics for all […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "600MW power plant for Binga",
            "url": "https://www.chronicle.co.zw/600mw-power-plant-for-binga/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nZIMBABWE continues to attract massive private sector-driven energy investments with the latest pitch for a 600MW thermal power plant project set for Kalungwizi, Binga District, in Matabeleland North province.\n\nThe investment proposal by Yuanlin Energy Investments (Pvt) Ltd, an Independent Power Producer (IPP), adds impetus to the growing energy value-chain investments in the province, and is expected to significantly boost Zimbabwes power generation capacity as the country strives to produce enough electricity to meet its demand.\n\nThe proposed investment is a confirmation that Zimbabwe is fast becoming an investment destination of choice in the region and beyond. Binga, which is now attracting big investors, is also home to a giant coal mining project being run by British investor, Contango Holdings in Muchesu area.\n\nThe new investments being witnessed across the country highlight the positive impact of comprehensive reforms introduced by the Second Republic.\n\nGovernment is encouraging greater private sector participation in energy production, particularly renewable energy.\n\nThe 600MW Kalungwizi project is expected to play a pivotal role in this broader strategy, reinforcing Zimbabwes energy security and supporting economic development.\n\nYuanlin Energy Investments has since engaged local environmental consulting firm ELWAS (Pvt) Ltd to conduct an Environmental and Social Impact Assessment (ESIA), in compliance with the Environmental Management Act and the Environmental Impact Assessment & Ecosystems Protection Regulations.\n\nYuanlin Energy Investments (Pvt) Ltd intends to develop a 600MW thermal power project in Kalungwizi, Binga, Matabeleland North Province.\n\nThe project aims to contribute to the countrys energy mix and support economic growth by generating 600MW of electricity that will be added to the National Grid, said the company in a public notice.\n\nThe company has since asked interested and affected parties to submit their comments, views and concerns by April 3.\n\nEconomic analysts have said such projects are set to boost Zimbabwes electricity generation to meet rising demand while reducing electricity imports.\n\nIPPs are already playing a crucial role in complementing Governments efforts to increase power generation.\n\nNotable IPP projects include ZZEEs 50MW thermal power plant in Hwange, which is already feeding power into the national grid.\n\nDinson Iron and Steel Companys 50MW thermal power project in Manhize near Mvuma town, Blanket Mines 13MW solar photovoltaic (PV) plant, Zimplats 35MW solar PV plant and Centragrids 25MW solar PV plant in Nyabira, west of Harare are some of the projects feeding power into the national grid.\n\nZimbabwe Power Company (ZPC) daily reports indicate that IPPs are now contributing between 85MW to 120MW to the national grid, and more is expected as new projects are completed.\n\nZimbabwe-Power-Company\n\nEconomist, Ms Alice Chironzi, said investments in energy sector particularly the expansion of thermal and renewable power projects, are a positive step toward addressing the countrys electricity deficit.\n\nThe entry of independent power producers (IPPs) has injected much-needed capital and innovation into the sector, complementing Government efforts to achieve energy self-sufficiency, she said.\n\nMs Chironzi said while thermal power remains a key component of Zimbabwes energy mix, balancing this with sustainable renewable energy investments is crucial in the long-term.\n\nPolicy consistency, infrastructure upgrades and a stable regulatory environment will be essential to attract further investments and ensure reliable electricity supply for industrial growth and economic stability, she said.\n\nZimbabwe has historically relied on coal reserves, particularly from the Hwange region, to fuel its thermal power plants.\n\nThe Hwange Thermal Power Plant has been a key component of this strategy, along with older facilities in Bulawayo, Munyati and Harare.\n\nHowever, aging infrastructure has led to frequent breakdowns and declining power output, exacerbated by periods of under-investment.\n\nAccording to the latest Index of Electricity Generation (IEG) report from the Zimbabwe National Statistics Agency (ZimStat), IPPs have become a critical part of Zimbabwes energy diversification strategy, and contributed 4,9 percent of the total supplies in the fourth quarter of last year, highlighting the latitude for increased private-sector involvement.\n\nThe increasing output from IPPs has helped Zimbabwe trim on imports, which have declined by 20,2 percent from 611,1 GWh in the third quarter of 2024 to 487,8 GWh in the fourth quarter.\n\nZimbabwes power supply, at about 1 400MW, remains significantly lower than the estimated 2 200MW required to meet the peak period demand. The Government is working on various public-funded and private sector-led initiatives to drive production to meet the countrys demand.\n\nElectricity is the backbone of industrial productivity. While a temporary decline poses challenges, it also signals where investment is needed to stabilise supply and unlock new growth, economist Namatai Maeresera, said.\n\nDespite these challenges, the Government is actively working to strengthen the thermal power sector. Recent efforts to expand and upgrade the Hwange Thermal Power Plant underscore its commitment to ensuring a stable energy supply.\n\nDeclining water levels at Lake Kariba caused by recurring droughts have significantly reduced hydroelectric output, thereby worsening the countrys energy deficit.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/BVNBVNVBN.jpg",
            "description": "Nqobile Bhebhe , nqobile.bhebhe@chronicle.co.zw ZIMBABWE continues to attract massive private sector-driven energy investments with the latest pitch for a 600MW thermal power plant project set for Kalungwizi, Binga District, in Matabeleland North province. The investment proposal by Yuanlin Energy Investments (Pvt) Ltd, an Independent Power Producer (IPP), adds impetus to the growing energy value-chain investments in the […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "Nyarota death plunges media fraternity into mourning",
            "url": "https://www.chronicle.co.zw/nyarota-death-plunges-media-fraternity-into-mourning/",
            "content": "Peter Matika,[emailprotected]\n\nTHE media fraternity was at the weekend plunged into mourning following the death of veteran journalist, former Chronicle Editor and Daily News founding Editor, Geoffrey Nyarota on Saturday.\n\nHe was 74.\n\nNyarota, who was famous for exposing the Willowgate vehicle scandal involving ministers and top Government officials in 1989, succumbed to colon cancer in Mutare.\n\nMembers of the fraternity have described him as a selfless journalist who dedicated his life to informing and educating the public.\n\nServing and retired journalists yesterday said Nyarota was one of the founding and most iconic members of the post-independencejournalism community in Zimbabwe, who left behind a lifetime legacy and inspired many.\n\nInformation, Publicity and Broadcasting Services permanent secretary, Mr Nick Mangwana, described Nyarotas death as a loss to the media fraternity.\n\nSaddened by the loss of Zimbabwean media giant Geoff Nyarota. As a pioneering editor, he left an indelible mark on the countrys journalism landscape.\n\nHis contributions to investigative journalism and robust public discourse will be remembered, he said.\n\nFormer Deputy Minister of Information, Media and Broadcasting Services, Kindness Paradza, said Nyarota was a fearless journalist who was very supportive of the profession.\n\nIn Geoff Nyarota we have lost one of Zimbabwes fearless post-independence journalists who mentored most of our young men and women running our various media outlets today, he said.\n\nHe was one of the finest journalists to emerge in independent Zimbabwe, resulting in him winning local and international media freedom awards, he said.\n\nChronicle editor, Lawson Mabhena, described Nyarota as a legendary figure who was always willing to share his knowledge.\n\nAs the current editor of the Chronicle, I am deeply saddened to learn of the passing of Geoffrey Nyarota, a legendary figure in Zimbabwean journalism, he said. Geoffreys tireless dedication to truth, justice, and press freedom inspired generations of journalists, including myself. Geoff was always willing to share his wisdom with others hence his death leaves a huge void in the body of journalism intellect, said Mabhena.\n\nChronicle managing and production editor, Isaac Waniwa, said the late Nyarota mentored many journalists.\n\nHe did not hesitate to throw a reporter to the deep end. This enabled us who worked under him straight from college to quickly grasp and appreciate the demands of the profession.\n\nThe media fraternity is poorer without veterans and good mentors like the late Nyarota, said Waniwa.\n\nItai Musengeyi, a former editor of the Chronicle, said Nyarota was among the crop of editors who took over the running of the countrys publications in the early years of independence and laid the path for future generations.\n\nHis accomplishments and legacy in journalism need no amplification as they are towering and leave an indelible imprint on the Zimbabwean media, he said.\n\nNyarota was a fountain of wisdom and knowledge, always willing to share his experience with young journalists and editors.\n\nHe indeed was an inspiration to many journalists and editors. His demise is a sad loss to his family and the journalism fraternity, said Musengeyi.\n\nAnother former Chronicle editor, Mduduzi Mathuthu, said Nyarota had an eye for talent.\n\nGeoff was my first employer and he is for that reason a big part of my journalism career. What he had, apart from all the other praise he will deservedly get, was a keen eye for talent, said Mathuthu.\n\nThe news team he assembled at The Daily News was a fearsome bunch. That ability, and his mastery of the front page  the stories to sell the paper on the street  were key ingredients to the legend of Geoff Nyarota, he added.\n\nThe Zimbabwe Union of Journalists (ZUJ) also poured its grief, stating that Nyarotas legacy has left an indelible mark on the nations media.\n\nZimbabwe Union of Journalists (ZUJ)\n\nMr Nyarotas contributions as editor at the Chronicle, as the founding editor of The Daily News, as chairperson of the Information Media Panel of Inquiry (IMPI), and as an author stand as testaments to his dedication to the principles of journalism and his unwavering commitment to informing the public and growth of the sector.\n\nHis work exemplified the power of journalism to shape narratives and hold power to account, said ZUJ secretary-general, Mr Perfect Hlongwane.\n\nMore journalists took to social media to mourn the fraternitys fallen giant and reflected on his legacy, emphasising their commitment to carrying forward his vision of journalism rooted in integrity and empathy. Nyarota was born in 1951 and started as a teacher before joining The Rhodesian Herald as a trainee journalist in 1978.\n\nHe was promoted to editor of Manica Post in Mutare before being appointed editor of The Chronicle in 1983. In 1989, Nyarota came to national prominence after exposing Willowgate scandal.\n\nNyarota battled with cancer and at one time members of the fraternity raised funds to meet his medical expenses. He is survived by wife, Ursula, and three children.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/VCXNB.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw THE media fraternity was at the weekend plunged into mourning following the death of veteran journalist, former Chronicle Editor and Daily News founding Editor, Geoffrey Nyarota on Saturday. He was 74. Nyarota, who was famous for exposing the Willowgate vehicle scandal involving ministers and top Government officials in 1989, succumbed to colon cancer […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "Taylor eyes international comeback",
            "url": "https://www.chronicle.co.zw/taylor-eyes-international-comeback/",
            "content": "Zimpapers Sports Hub\n\nFORMER Zimbabwe captain Brendan Taylor, serving a three-and-a-half year ban for breaching the International Cricket Councils (ICC) anti-corruption code, is eyeing an international comeback when his sanction ends in July.\n\nTaylor (39) had initially considered a move into coaching but has been convinced to resume his playing career by Zimbabwe Crickets (ZC) Managing Director Givemore Makoni, with a view to playing the 2027 ODI World Cup, which Zimbabwe will co-host with South Africa and Namibia.Taylor will be eligible to play again on July 25, this year.\n\nI still want to play and I believe I could make an impact as a player. I look at where Im physically and mentally and if I didnt feel I could do it, I wouldnt bother. Givemore has really supported me on this.\n\nHe sort of shut down the coaching role for now and said, Can you play and try to push yourself up until the 2027 World Cup? Granted, Ill be 41 then but with sobriety, Im living my truest form, Taylor told ESPNCricinfo.\n\nBrendan Taylor\n\nTaylor admitted to drug and alcohol addiction problems at the same time he revealed an approach by match-fixers to spot fix after they filmed him using cocaine.He was threatened with the video being made public if he did not co-operate with them. Instead of going through with the fix, Taylor abruptly retired from international cricket in September 2021 and did not reveal the reasons.\n\nHe only reported the incident to the ICC four months later and made the story public in January 2022.At that point, Taylor also checked himself into a rehabilitation centre in Nyanga and spent 90 days there, with one other patient and a sponsor who showed me a new way to live.\n\nHe has since been clean and has started a private coaching facility at his home as well as, more recently, a gradual return to training.The conditions of his sanction mean Taylor cannot play any officially recognised cricket or train with domestic or international sides. Instead, he has been using facilities at an elite independent school, St Johns College in Harare, often twice a day.\n\nTheyve got some great grass nets and I spend a lot of time in the indoor high-performance centre there. I get in there nice and early, and I come back in the afternoon and do it all again and push myself.\n\nTheres lots of work to do, but I feel like Im there. Im not far off. Ive been doing some batting, and I need to incorporate some fielding and some keeping work because Ive got four months to go, he said.\n\nAlthough it would have been great to be able to, Taylor will not be cleared to play by the time of Zimbabwes Test in England in May  their first against that opposition in more than two decades. But, he hopes to be in the plans for a home series against New Zealand in August.\n\nThat will be followed by Zimbabwes hosting of the Africa Regional Qualifiers for next years T20 World Cup in September, though Taylor feels he has some work to do on his T20 game, where he has a strike rate of 123.96.\n\nI see myself definitely playing Tests and ODIs. With T20s, thats probably something I would have to really try and sharpen myself up at. But I look forward to that, he said.He added: Having a home World Cup is quite special and weve had some heartache over these last few World Cups so hopefully we can turn that around.\n\nShould his comeback be successful, Taylor will be the fourth player in the Zimbabwe side in his late 30s, after Test and ODI captain Craig Ervine (39), T20I captain Sikandar Raza (38), and long-serving all-rounder Sean Williams (also 38).Ultimately its the feeling of having unfinished business that is calling Taylor back to playing.\n\nI wish I had offered a bit more to Zimbabwe cricket. Ive apologised and moved forward from that and I want to work with them.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/brendan.jpg",
            "description": "Zimpapers Sports Hub FORMER Zimbabwe captain Brendan Taylor, serving a three-and-a-half year ban for breaching the International Cricket Council’s (ICC) anti-corruption code, is eyeing an international comeback when his sanction ends in July. Taylor (39) had initially considered a move into coaching but has been convinced to resume his playing career by Zimbabwe Cricket’s (ZC) […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "Europe going nuclear would be a catastrophic mistake",
            "url": "https://www.chronicle.co.zw/europe-going-nuclear-would-be-a-catastrophic-mistake/",
            "content": "Dr Olamide SamuelCorrespondent\n\nThe second administration of United States President Donald Trump has brought about tectonic shifts in the European security calculus. Growing anxieties about American retrenchment and the collapse of post-World War II security arrangements have sent European leaders scrambling to put forward alternatives.\n\nAhead of the German elections last month, Friedrich Merz, the head of the Christian Democratic Union, who was already expected to become the next German chancellor, opined: We need to have discussions with both the British and the French  the two European nuclear powers  about whether nuclear sharing, or at least nuclear security from the UK and France, could also apply to us.\n\nFrench President Emmanuel Macron recently said that in response to Merz, he has decided to open the strategic debate on the protection of our allies on the European continent through our (nuclear) deterrence.\n\nThe proposal for some form of European nuclear sharing arrangement with France and the United Kingdom to protect against threats from Moscow is not new. Versions of it have been floated around for decades.\n\nBut today, resurfacing this proposal is not just a geopolitical miscalculation; it is a strategic dead end. It reflects a misreading of both the nuclear balance of power and the existential risks of fragmenting Europes security architecture further. Rather than bolstering deterrence, this gambit risks accelerating the very instability it seeks to avert.\n\nAmid the growing unpredictability of United States-Russia relations under the second Trump administration, Europe must pivot from nuclear escapism to a bold agenda of diplomatic engagement on nuclear disarmament.\n\nFriedrich Merz\n\nThe fantasy of European\n\nnuclear sharing\n\nThe proposal for European nuclear sharing founders on arithmetic and strategic reality. Russias nuclear arsenal boasts 5 580 warheads, including hypersonic Avangard glide vehicles and Sarmat intercontinental ballistic missiles (ICBMs). This dwarfs the combined Anglo-French stockpile of 515 warheads.\n\nThis asymmetry isnt merely quantitative; it is also doctrinal. Moscows escalate to de-escalate strategy represents a calculated approach to conflict escalation designed to coerce adversaries into concessions. It is a strategy the British and French nuclear arsenals, optimised for minimal deterrence, cannot counter.\n\nData on defence spending reveals a deeper flaw: Europeans do not have the funds or the technological capabilities to carry it out while executing their ambitious rearmament plans.\n\nGermanys 90,6-billion euro (US$98 billion) military budget remains crippled by inefficiencies, with only 50 percent of army equipment meeting Nato readiness standards. Meanwhile, France and the UK lack the conventional force multipliers  global surveillance networks, intelligence capabilities, or even complete nuclear triads  that underpin US extended deterrence. Even if every euro cent of the European Unions recently announced 800 billion-euro (US$867 billion) defence boost were spent on nuclear weapons programmes, cold-starting the sort of production complexes required for a credible deterrent would still take decades.\n\nAttempting to replicate NATOs nuclear-coalition model at a European level ignores six decades of integrated command structures and fails to address hybrid threats now defining modern conflict.\n\nWhat is more, replacing one dependency with another solves nothing. Proponents claim nuclear sharing offers protection, but the reality is that it can lead to strategic subjugation.\n\nNeither France nor the UK is likely to give up control over its nuclear arsenals and transfer it to the EU. That means that a nuclear-sharing agreement would reduce Germany and other European countries participating in the arrangement to Franco-British warhead warehouses with no real agency. This Potemkin deterrence  all ceremony, no substance  would only further irritate Washington.\n\nTrump has already shown that he has no qualms about abandoning allies if he sees no benefit for the US strategic interest. His recent moves to stop intelligence sharing and military aid for Ukraine and his conditioning mutual defence on military spending have exposed Natos fraying norms  the alliance is witnessing a collapse of shared purpose.\n\nAs experts note, Trumps MAGA Carta foreign policy explicitly rejects strategic altruism. A European nuclear caucus would signal panic, validating Trumps transactional world view while undermining NATOs cohesion.\n\nA European nuclear club would deepen fragmentation, emboldening revisionist actors like Russia and China while diverting resources from critical gaps in AI advancement, sustainable economic output, and energy resilience that define 21st-Century power.\n\nThe economic argument compounds the folly. Pouring billions of euros from Europes finite resources into redundant warheads while neglecting practical gaps in conventional capability isnt statecraftits generational malpractice.\n\nDisarmament and\n\nfiscal realpolitik\n\nThe EUs opportunity lies not in nuclear posturing, but in revitalising arms control and mediation. The collapse of the US-Russia strategic dialogue since the invasion of Ukraine has left critical arms control frameworks in disarray.\n\nThe New START treaty, which limits deployed strategic nuclear warheads to 1 550 each for Russia and the US, remains the last pillar of bilateral arms control. Its expiration in 2026 without a successor would mark the first time since 1972 that the worlds nuclear superpowers operate without mutually verified limits  a scenario that could trigger a new nuclear arms race.\n\nHerein lies Europes opportunity. Rather than pursuing a European nuclear umbrella, it could lead efforts to revive nuclear disarmament dialogue.\n\nAustria, an EU member, has already played a key role in nuclear talks between the West and Iran as well as the 2020 US-Russia-China trilateral arms control discussions. This positions it as an ideal venue for restarting negotiations on nuclear risk reduction issues, especially at a time when Washington is open to renewed dialogue with Moscow.\n\nTaking a lead on nuclear disarmament would be the sort of leadership that would reflect a more mature interpretation of security policy, as opposed to seeking an impossible nuclear deterrence.\n\nSome critics maintain that negotiating with Russia rewards aggression. Yet history shows even bitter adversaries can cooperate on arms control when interests align. The 1987 Intermediate-Range Nuclear Forces Treaty, which eliminated 2 692 missiles, was finalised after years of heightened tensions between the USSR and the US in the early 1980s.\n\nThe treaty succeeded not because US President Ronald Reagan and Soviet leader Mikhail Gorbachev trusted each other, but because dismantling missiles saved both sides a significant amount of funds that would have gone into continuing the arms race and maintaining the destroyed ordinance.\n\nToday, with Russias economy faltering amid the war in Ukraine and Trumps fixation with cost-cutting, there is an opportunity to pursue another deal if disarmament is framed not as idealism, but as fiscal pragmatism. Europe can help broker a deal that serves all parties wallets  and humanitys survival.\n\nThe unintended consequences of Trumps first-term nuclear gambits  escalated arms racing, eroded alliances, and emboldened adversaries  offer cautionary lessons. His second term, however, can offer an opportunity to shift the Doomsday Clock back from its position of 89 seconds to midnight.\n\nEurope now faces a choice: to cling to Cold War relics while the planet burns, or to pioneer a security paradigm prioritising planetary survival over great-power vanity. The decision it makes will define not just Europes future  but all of humanitys.  Al Jazeera\n\nDr Olamide Samuel is a renowned international security expert and Network Specialist at the Open Nuclear Network. Previously, he served as Special Envoy of the African Commission on Nuclear Energy (AFCONE), established by the African Nuclear-Weapon-Free Zone Treaty, also known as the Treaty of Pelindaba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/bnmjvnmn.jpg",
            "description": "Dr Olamide Samuel  Correspondent  The second administration of United States President Donald Trump has brought about tectonic shifts in the European security calculus. Growing anxieties about American retrenchment and the collapse of post-World War II security arrangements have sent European leaders scrambling to put forward alternatives.  Ahead of the German elections last month, Friedrich Merz, […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "Feli Nandi shines at electrifying album launch",
            "url": "https://www.chronicle.co.zw/feli-nandi-shines-at-electrifying-album-launch/",
            "content": "Maria Chiguvari,Harare Bureau\n\nOn Saturday, Feli Nandi proved why she remains one of the biggest stars in music today.\n\nLooking stunning in a cream dress and performing barefoot, the songstress delivered a captivating 50-minute set to officially launch her second album, Ndisiyei, at 7 Arts Theatre in Harare.\n\nAccompanied by her talented band and energetic dancers, Feli Nandi delivered a two-part set to a packed theatre, blending her older hits with new material. She wowed the crowd with fan-favourites like Muti Watemwa and Ndobatirira before transitioning into her latest songs. For the final segment, she emerged in a striking African print dress, setting the perfect mood for the official presentation of Ndisiyei.\n\nFeli Nandi performs during the Ndisiyei album launch in Harare\n\nI feel the love in this room; love from so many of you who have been there for me since the beginning, she told the crowd, beaming with gratitude.\n\nOne of the most touching songs on the album, Vakaita Sewe, is dedicated to Tinaye Chibaya, an 11-year-old boy whose tragic death last year deeply moved thousands. Tinaye suffered fatal head injuries after being dragged by a horse he was riding during a family Easter holiday outing.\n\nAn album launch can be just as expressive as the music itself, and Feli Nandi set the bar high for artistes. Ndisiyei was more than just an album release  it was an unforgettable experience that left a lasting impression on her fans.\n\nHowever, it was her soul-stirring performance of Muti Watemwa that truly cemented her status as one of Zimbabwes finest vocalists. The moment was pure magic, sending chills down the spines of those in attendance. It felt as though she was possessed by a higher force, singing with unmatched passion and depth.\n\nFeli Nandi proved that true greatness comes from confidence, comfort in ones craft and unwavering self-belief. She described Ndisiyei as a deeply personal project, a reflection of her journey in the music industry.\n\nThe album features tracks, Tongai, Munamato, Ndisiyei, Ahungasiye, Kukoromoka, Muranda, Shamwari, Fambai Neni and Vakaita Sewe.\n\nNdisiyei marks Feli Nandis second studio album, following her successful debut Inzwi.\n\nFeli Nandi performs during the Ndisiyei album launch in Harare\n\nThe album launch was not only a musical success but also a financial triumph. The album was bought for over US$15 000 by various supporters.\n\nMadam Boss alone parted with US$5 000. Other notable socialites who bought the album included Jacquie Ngarande and KingSolomon.\n\nWith her unmatched stage presence and undeniable talent, Feli Nandi continues to redefine the Zimbabwean music landscape, proving that she is here to stay.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/VBBVBBV.jpg",
            "description": "Maria Chiguvari, Harare Bureau On Saturday, Feli Nandi proved why she remains one of the biggest stars in music today. Looking stunning in a cream dress and performing barefoot, the songstress delivered a captivating 50-minute set to officially launch her second album, Ndisiyei, at 7 Arts Theatre in Harare. Accompanied by her talented band and energetic […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "Companies must  take a leaf from Disco’s workplace safety standards",
            "url": "https://www.chronicle.co.zw/companies-must-take-a-leaf-from-discos-workplace-safety-standards/",
            "content": "Dinson Iron and Steel Company (Disco) in Manhize area near Mvuma town has been commended for upholding high occupational health and safety standards that has seen the steel producer recording zero fatalities since its inception.\n\nThe company, a subsidiary of Chinese global investment group, Tsingshan Holdings, is one of the Second Republics signature projects that are transforming livelihoods of communities. The national Social Security Authority (Nssa) said for the past four years that Disco has been in operation, it has not recorded any fatalities at the workplace.\n\nSpeaking after the tour of the giant steel plant by experts and engineers that were attending the annual Nssa Engineers Workshop in Masvingo recently, Nssa acting general manager Dr Charles Shava commended Disco for upholding high occupational health and safety standards.\n\nNssa Acting General Manager Dr Charles Shava (third from left, front row) listens during a tour of the Disco plant in Manhize by experts and engineers attending a OSH workshop in Masvingo\n\nHe said Disco which has the potential to be the largest steel plant in Africa, has done well in terms of occupational health and safety.They have had only incidents where some workers have suffered some minor injuries but I think overall they have done very well because we are talking about a very big steel plant, said Dr Shava.\n\nThe steel plant has a potential to produce 1,2 tonnes of steel per annum when operating at full throttle. Dr Shava said Nssa was happy that Disco has a very good medical team on the ground, a confirmation that they are on top of the game and are able to deal with the issue of diseases.\n\nThe company is producing 50MW of electricity using coal but has very limited pollution. The coal is emitting very little pollutants in the air. What is obtaining at Disco should be emulated by other companies so that we reduce fatalities at the workplace.\n\nWe want to applaud Disco for not just creating thousands of jobs but also ensuring that its employees work under a conducive working environment. The company has invested a lot of money in occupational health and safety hence it has recorded zero fatalities since it started operating.\n\nThe company has demonstrated that it is possible to drastically reduce fatalities at the workplace and as already stated, other companies should learn from Disco.Occupational health and safety should be a priority for all companies if we are to reduce fatalities at the workplace.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/01/Untitled-86.jpg",
            "description": "Dinson Iron and Steel Company (Disco) in Manhize area near Mvuma town has been commended for upholding high occupational health and safety standards that has seen the steel producer recording zero fatalities since its inception. The company, a subsidiary of Chinese global investment group, Tsingshan Holdings, is one of the Second Republic’s signature projects that […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "Luveve community’s thriving waste recycling project",
            "url": "https://www.chronicle.co.zw/luveve-communitys-thriving-waste-recycling-project/",
            "content": "Nqobile Tshili,nqobile.tshili@chronicle.co.zw\n\nA GROUP of residents from Luveve suburb in Bulawayo is turning trash into cash after establishing a community health and environment taskforce involved in picking up waste and selling it to recycling companies.\n\nThe Mafakela Health and Environment Taskforce, a community-based organisation with over 150 members, has become champions of anti-littering.\n\nThe group also runs a sorting cage situated at Chigumira Business Centre, which is used to sort plastics and tins that are delivered to them.\n\nAfter collecting the waste, the group sells it to a local recycling company, which then supplies the products to local and external manufacturers.\n\nWhile for most individuals an empty plastic bottle, broken plastic container or even an empty beverage can is unwanted, members of the Mafakela Health and Environment Taskforce see opportunities.\n\nTheir efforts are contributing to a clean environment while generating revenue that enables members to support their families.\n\nThe groups work has not gone unnoticed as the Environmental Management Agency (EMA) in collaboration with Skies Recyclers handed them a bailing machine on Thursday to enable them to compact their waste.\n\nEnvironmental Management Agency (EMA)\n\nSpeaking during the event, EMA environment education and publicity officer, Miss Kayleen Dube, said the Luveve community stands out in tackling littering menace.\n\nWe always encourage communities to take leadership in terms of environmental stewardship. We realise that we have a growing challenge of solid waste management, she said.\n\nMiss Dube said EMA was conducting training and awareness campaigns across Bulawayo.\n\nLuveve community is one of the communities that really embraced our programme as waste can also be a business, said Miss Dube.\n\nShe said Luveve has become a champion of anti-littering through its community initiative.\n\nThey established a community-based organisation that has managed to lead in community clean-up programmes. As a result, we have seen a reduction of some of the illegal dump sites that were a problem, said Miss Dube.\n\nShe said the community started a recycling project which has seen them picking different streams of waste.\n\nMiss Dube said the residents sell the waste to Skies Recyclers and as such were generating revenue from waste.\n\nThese are the initiatives that we want to see across Bulawayo as residents take the lead in environmental health stewardship, she said.\n\nMiss Dube said the donation of the bailing machine is part of EMAs initiatives to support community-based environmental protection projects.\n\nMafakela Health and Environment Taskforce project manager, Mr Ishmael Mkandla, said residents were making a living through picking up waste.\n\nHe said the taskforce was established to promote cleanliness in Luveve after the 2021 tragedy when 13 residents died after drinking contaminated water.\n\nMr Mkandla said residents moved from just picking up waste to creating an economy around it.\n\nThis was established not only for monetary benefits but also to keep our environment clean. You will remember that in 2021, we lost 13 residents and environmental issues were raised, he said.\n\nMr Mkandla said there are instances when some of the community members collect up to 170kg of waste, adding that picking of waste has made residents environmentally conscious as it also has a financial incentive.\n\nSome waste pickers have become creative, especially those who pick aluminium cans. Some of them are now directly selling the cans to individuals who are making amabhodo (pots), he said.\n\nSkies Recyclers administrator and co-ordinator Sandra Mangombe, with the assistance of Environmental Management Agency (EMA) environment education and publicity officer Kayleen Dube (right) explains how a waste bailing machine works during the hand over of the machine in Luveve suburb on Thursday, and (picture right) a sorting cage where picked waste is stored\n\nWhen they deliver aluminium cans, they are given pots, which they resell in rural areas. So, this is something that is keeping them going, said Mr Mkandla.\n\nOne of the waste pickers, Ms Sibusisiwe Dube, said she is able to support her family through picking upwaste.\n\nIn the past, I didnt realise that litter was a resource that could even help me support my family. Through picking up waste, I have been able to buy groceries and other necessities for my family, she said.\n\nMs Dube said they have been empowered as women as they no longer depend on men for income.\n\nTo ensure the safety of Luveve waste pickers, EMA partnered Skies Recyclers to provide them with personal protective equipment consisting of work suits, gloves and masks.  @nqotshili.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/nknrinrinrt.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw A GROUP of residents from Luveve suburb in Bulawayo is turning trash into cash after establishing a community health and environment taskforce involved in picking up waste and selling it to recycling companies. The Mafakela Health and Environment Taskforce, a community-based organisation with over 150 members, has become champions of anti-littering. The group […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "OK Zimbabwe reverses Entumbane branch closure",
            "url": "https://www.chronicle.co.zw/ok-zimbabwe-reverses-entumbane-branch-closure/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nRETAIL giant OK Zimbabwe, plans to re-open its Entumbane branch, which it closed early this year, and convert it into a wholesale business with lower operating costs.\n\nThis comes after the retailer experienced stock-outs during the quarter ending December 31, 2024, which reduced product availability to around 50 percent of normal stocking levels.\n\nZimbabwes largest retail chain, with 67 branches across the country, cited a tough trading environment and debt constraints for the stocking challenges.Group company secretary Mrs Margaret Munyuru told a Parliamentary Portfolio Committee on Industry and Commerce that toured the Entumbane shopping complex recently that with the support of the Bulawayo City Council, the company was reversing the decision to close the branch.\n\nHowever, it indicated the branch will not continue as a retail business, but will be converted to a wholesale operation.\n\nThe last time we met, we referenced the closure of a supermarket in the Bulawayo Matabeleland region, OK Entumbane, and Im very happy to say that we have reversed that decision with the support of Bulawayo City Council. We are now converting the supermarket into a wholesale facility, said Mrs Munyuru.\n\nWe have received confirmation that they will support us with the wholesale license so that we can transform our operations from a traditional supermarket into a wholesale facility that operates at a lower cost than the ordinary supermarket that we traditionally do.\n\nMrs Munyuru said the retailer will assess the entire estate to find ways to optimise and utilise the premises in a manner that helps revive the business, give it fresh relevance and improve demand from the market.\n\nThe Parliamentary Committee on Industry and Commerce, which is conducting nationwide tours to evaluate business conditions across the country and engage directly with retailers to understand their challenges, toured OK Zimbabwes outlets in Harare on Tuesday.Mrs Munyuru told the parliamentary committee led by Zaka South Member of Parliament Clemence Chiduwa that the firm was now recovering.\n\nWe have already started restocking. A few weeks ago, even a month-and-a-half ago, you would have noticed that even Mazoe was missing from the shelves. The shelves are now filling up, she said.\n\nLast month, OK Zimbabwe rehired former chief executive officer Mr Willard Zireva to lead the retail group to lift it from its operational challenges, which saw the company closing five branches.\n\nThe return of Mr Zireva followed the departure of three senior executives.The Entumbane community expressed joy after hearing that the supermarket will be reopened, albeit only as a wholesale business.\n\nThey said the availability of supermarkets in different townships and suburbs assists in bringing services closer to the people, thereby reducing the expenses of travelling to town.Mr Edington Virimayi from Makhandeni B said following the closure of OKs Entumbane branch, the residents had to travel to town for shopping and other services, which OK Zimbabwe offered.\n\nThe closure of OK affected the community, we used to collect money here from our relatives abroad since the shop had World Remit, Mukuru and other money transfer services, but now we are forced to go to town, said Mr Virimayi.\n\nEven buying groceries, OK used to offer better prices compared to other shops here in the suburbs, the supermarket accepted both US dollars and ZiG, which made it easy for us, so the closure made our lives expensive.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xqwxxxxxxxxxxxxxxxxxxxxxx.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com RETAIL giant OK Zimbabwe, plans to re-open its Entumbane branch, which it closed early this year, and convert it into a wholesale business with lower operating costs. This comes after the retailer experienced stock-outs during the quarter ending December 31, 2024, which reduced product availability to around 50 percent of normal stocking […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        },
        {
            "title": "MSU igniting national development through innovation and community engagement",
            "url": "https://www.chronicle.co.zw/msu-igniting-national-development-through-innovation-and-community-engagement/",
            "content": "Patrick Chitumba,[emailprotected]\n\nMIDLANDS State University (MSU) has made substantial contributions to the countrys national development trajectory, closely aligning with Education 5.0 and Vision 2030.\n\nHigher and Tertiary Education, Innovation, Science and Technology Development Minister, Dr Fredrick Shava, made these remarks following a recent tour of the MSU main campus in Gweru to appreciate the contributions the institution is making towards the countrys development.\n\nHe emphasised that higher and tertiary education institutions must be the catalysts for national progress, focusing on knowledge creation, innovation, and human capital development.\n\nDr Shava was taken through a virtual tour of MSUs expansive footprint across Zimbabwe and its groundbreaking projects.\n\nThese included community-based initiatives in Chirumhanzu, the Modified Coal Plant, the MSU Radio Station in Zvishavane, the Industrial Park, the National Pathology Research and Diagnostic Centre, the Innovation Hub, the MSU Cannabis Centre and the ED Mnangagwa School of Law Campus in Kwekwe.\n\nAt the Innovation Hub, Dr Shava was captivated by a vibrant ecosystem of creativity, where ideas are transformed into tangible goods and services.\n\nThe developments I witnessed during my time here have left an indelible mark, reinforcing my conviction that MSU is a pivotal contributor to national development, he said.\n\nMidlands State University (MSU)\n\nDr Shava said developments on the ground reinforced the Governments belief that MSU is a key player in national development.\n\nMSU is showcasing a significant impact on national development and its alignment with Zimbabwes Education 5.0 agenda, which aims to position higher and tertiary institutions as drivers of national progress through knowledge creation, innovation, and human capital development, he said.\n\nMinister Shava also expressed his admiration of MSUs groundbreaking projects, including community-based initiatives and praised the universitys commitment to Education 5.0, highlighting its focus on research, innovation, industrialisation and community engagement.\n\nGovernment commends MSUs dedication to rural industrialisation through projects such as the ecotourism initiative in Chirumhanzu, which is a shining example, said Dr Shava.\n\nMSU Vice Chancellor, Professor Victor Ngonidzashe Muzvidziwa, commended the Government for its unwavering financial support to the institution over the years.\n\nThe success of MSU is largely due to the Governments steadfast backing, which has enabled the university to spearhead high-impact research and drive community transformation, he said.\n\nProf Muzvidziwa highlighted MSUs remarkable achievements, including its 18th position in the 2024 Sub-Saharan Africa University Rankings by the Times Higher Education Index.\n\nThis recognition underscores MSUs growing influence as a hub of academic excellence and innovation. As the university for tomorrow, MSU remains steadfast in its mission to drive national development and transform lives, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/nxgbvncbnc.jpg",
            "description": "Patrick Chitumba , patrick.chitumba@chronicle.co.zw MIDLANDS State University (MSU) has made substantial contributions to the country’s national development trajectory, closely aligning with Education 5.0 and Vision 2030. Higher and Tertiary Education, Innovation, Science and Technology Development Minister, Dr Fredrick Shava, made these remarks following a recent tour of the MSU main campus in Gweru to appreciate the contributions […]",
            "time": "08:38",
            "date": "24 Mar 2025"
        }
    ]
}