{
    "news": [
        {
            "title": "Bulawayo Childrens Choir’s debut song tops on Skyz Metro FM",
            "url": "https://www.chronicle.co.zw/bulawayo-childrens-choirs-debut-song-tops-on-skyz-metro-fm/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nBARELY, a month after the release of their debut single, Banolila  Mother nature is crying, the Bulawayo Childrens Choir has topped the charts with that very song which premiered on the Skyz Metro FMs Top 20 show last week.\n\nFormed just a month ago in December, the choirs rapid rise to fame is a testament to their talent and dedication.\n\nThe choirs Creative Director, Trevor Mawaka, expressed his excitement and gratitude at the singles success.\n\nWe are thrilled and humbled by the overwhelming response to our debut single, said Mawaka.\n\nIts a dream come true for the children and the entire team who have worked tirelessly to make this project a reality.\n\nAccording to Mawaka, the choir isnt resting on their laurels.\n\nThey are set to launch their second single, Bulawayo  The Place We Call Home, this coming Friday.\n\nThe song is a heartfelt tribute to the city of Bulawayo and its rich cultural heritage.\n\nThe Bulawayo Childrens Choirs achievement is not only a milestone for the group but also a source of pride for the city of Bulawayo and the country as a whole.\n\nWith their unique sound and energetic performances, the choir is set to make waves in the music industry for years to come.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/YUJT.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com BARELY, a month after the release of their debut single, “Banolila – Mother nature is crying”, the Bulawayo Children’s Choir has topped the charts with that very song which premiered on the Skyz Metro FM’s Top 20 show last week. Formed just a month ago in December, the choir’s rapid rise to […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "TikTok shuts down in the United States hours ahead of a ban",
            "url": "https://www.chronicle.co.zw/tiktok-shuts-down-in-the-united-states-hours-ahead-of-a-ban/",
            "content": "TikTok went offline in the United States Saturday night, less than two hours before a ban was slated to go into effect. The extraordinary blackout prevents access to one of the worlds most popular social media apps  one that had been used by 170 million Americans.\n\nVisitors to the app were met with a message reading: Sorry, TikTok isnt available right now. A law banning TikTok has been enacted in the U.S. Unfortunately, that means you cant use TikTok for now.\n\nTikToks action comes after the Supreme Court on Friday upheld a ban that was passed with broad bipartisan support in Congress and signed into law in April by President Joe Biden. The law prevents American companies from hosting or serving content for the Chinese-owned social media platform unless it sells itself to a buyer from the United States or one of its allies.\n\nBut TikTok may not be gone for long. The company suggested it could be back soon  perhaps as early as Monday.\n\nWe are fortunate that President Trump has indicated that he will work with us on a solution to reinstate TikTok once he takes office, the company posted in its pop-up message to users who opened the app beginning late Saturday night. Please stay tuned!\n\nPresident-elect Trump said he will most likely delay a ban on TikTok for 90 days after he takes office on Monday, adding that he has not made a final decision in a phone interviewwith NBC Newson Saturday.\n\nI think that would be, certainly, an option that we look at. The 90-day extension is something that will be most likely done, because its appropriate. You know, its appropriate. We have to look at it carefully. Its a very big situation, Trump said in the interview.\n\nIf I decide to do that, Ill probably announce it on Monday, he added.\n\nThe blackout from TikTok  and the suggestion that it could soon restore its service  is the latest twist in a saga thats dragged on for months, leaving the fate of the app in limbo.\n\nThe app also has disappeared from Apples App Store and the Google Play store. And other apps owned by TikToks parent company, ByteDance  including CapCut  also displayed a similar message Saturday night.\n\nLawmakers said TikToks ties to China and its access to reams of data posed a threat to national security.\n\nMany US users told CNN they were bracing for an end to the app, including influencers and other small businesses that said theydepended on the platform for a living. Still, they said, they held out hope the app would somehow be saved.\n\nBut the Supreme Courts decision dashed hopes of a last-second judicial assist.\n\nSome of the companies that operate app stores and run computer servers are said to be concerned that they will be held liable for violating terms of the ban. Those service providers pledged to stop carrying the app to avoid legal consequences, a person familiar with companies discussions told CNN.\n\nMeanwhile, Trump  who first warned of TikToks dangers five years ago  is now casting himself as the apps savior. Earlier this month, on his Truth Social account, he posted stats about his own popularity on TikTok and asked, Why would I want to get rid of TikTok?\n\nTikToks CEO Shou Chew has met with Trump at his Mar-a-Lago home in the weeks leading up to the ban taking effect and is expected to attend Trumps inauguration on Monday.\n\nTikTok did not immediately respond to a request for comment late on Saturday.\n\nThe law passed last year allows the president to delay the ban from going into effect by 90 days but requires evidence that parties working to arrange a sale of TikTok to a US-owned company have made significant progress.\n\nBut TikToks owner, ByteDance, has rejected would-be buyers. The company has cited its popularity among American users, and its value to small businesses across the country, as it fights to stay online without any change in ownership.\n\nAfter the Supreme Court ruled, 9-0, to uphold the ban, White House press secretary Karine Jean-Pierre signaled the administration wouldnt enforce the law on Bidens final day in office.\n\nDue to the federal holiday weekend and the inauguration, actions to implement the law simply must fall to the next administration, she said.\n\nBut TikTok wasnt satisfied by that statement. According to a person familiar with the matter, some service providers  companies like Google and Apple that would face exorbitant fines for allowing US access to TikTok once the ban takes effect  told TikTok they believed they were vulnerable under the law starting Sunday.\n\nA person close to TikTok says multiple critical service providers indicated to TikTok that they would no longer carry the app or its data, which forced the app offline. The service providers cited fears that the ban might be enforced starting Sunday, despite the Biden administrations signals to the contrary.\n\nSo TikTok took action to take the app down  at least for now.\n\nThe move, and the pop-up naming Trump, could put even more pressure on the president-elect to negotiate a solution in the days or weeks to come.\n\nTikTok employees were also told by the company on Saturday that the situation was disappointing but that the company was working on a solution.\n\nWe know this is disappointing for you not only as employees, but as users. However, we are fortunate that President Trump has indicated that he will work with us on a solution to reinstate TikTok once he takes office. Please know our teams are working tirelessly to bring our app back to the U.S. as soon as possible, read the message to employees.\n\nA White House source reiterated to CNN that there will not be any fines by the Biden administration associated with keeping TikTok active on Sunday.\n\nAt the same time, however, some Biden officials are content with TikTok going dark for a day, since the law was passed with strong support from both parties.\n\nThe decision is going to be made by the next president anyway, Biden told reporters Friday.\n\nOn Saturday, the White House called TikToks warning about going dark a stunt.\n\nWe see no reason for TikTok or other companies to take actions in the next few days before the Trump administration takes office on Monday, Jean-Pierre said. We have laid out our position clearly and straightforwardly: actions to implement this law will fall to the next administration. So TikTok and other companies should take up any concerns with them.\n\nA TikTok spokesperson had no immediate reaction to the statement from the White House.\n\nThe company said it expected service providers  like companies that operate servers full of videos  to restrict access to the app at 12:01 a.m. ET on Sunday.\n\nOn Apple and Googles app stores, the most popular free apps for the past week have been TikTok-like apps, including two that are also owned by Chinese companies. One of them, photo-sharing app Lemon8, is owned by ByteDance, just like TikTok. But Lemon8 may have the same fate as TikTok in the future.\n\nGiven Trumps public remarks about TikTok any blackout may not last long.\n\nTrump is said to be considering issuing an executive order that could effectively pause the ban and provide some time to sort out a long-term solution.\n\nBut he will face pressure from multiple directions. Some Republican senators, like Josh Hawley of Missouri and Tom Cotton of Arkansas, remain strongly supportive of the ban.\n\nByteDance and its Chinese Communist masters had nine months to sell TikTok before the Sunday deadline, Cotton wrote on X. The very fact that Communist China refuses to permit its sale reveals exactly what TikTok is: a communist spy app.\n\nAnalyst Richard Greenfield of LightShed Partners, who has long followed the TikTok saga, anticipates that TikTok will ultimately stay online in the United States.\n\nOn Saturday, Perplexity AI, a San Francisco-based AI search-engine startup, confirmed to CNN that it submitted a bid to ByteDance to merge with TikTok.\n\nSource: CNN\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/07/Tik-Tok.jpg",
            "description": "TikTok went offline in the United States Saturday night, less than two hours before a ban was slated to go into effect. The extraordinary blackout prevents access to one of the world’s most popular social media apps – one that had been used by 170 million Americans. Visitors to the app were met with a […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "Bulawayo businessman fatally shoots self in the head",
            "url": "https://www.chronicle.co.zw/bulawayo-businessman-fatally-shoots-self-in-the-head/",
            "content": "Raymond Jaravaza[emailprotected]\n\nA BULAWAYO businessman, who owned butcheries in the citys western suburbs, was Saturday night found dead with a gunshot wound in an apparent suicide.\n\nJohn Tafara Madzikatire reportedly shot himself outside his girlfriends house in Cowdray Park suburb on Saturday night.\n\nHe owned a popular butchery at koChigumira leisure centre in Luveve and another one in Pumula North suburb.\n\nPolice confirmed the businessmans death.\n\nPolice confirm the death of John Tafara Madzikatire who was found with a gunshot wound in the head. Police are treating the case as suicide but investigations are continuing, said Bulawayo provincial spokesperson Assistant Inspector Nomalanga Msebele.\n\nWorkers who spoke to Chronicle on Sunday morning said they last saw their boss on Saturday around 5pm when he delivered meat at the koChigumira outlet, known as Samaz Butchery, in his black Mercedes Benz vehicle.\n\nHe was in the company of a young lady, they said.\n\nHe collected beef from the butchery in Pumula North and delivered it here in Luveve around 5pm. He was with a young woman who stayed behind in the car when we collected the meat from the boot of his car.\n\nWe were alerted by one of his friends that he had shot himself outside the womans house in Cowdray Park, said the employee who asked not be named.\n\nThe employee said the workers hired a Honda Fit vehicle and rushed to the scene of the fatal shooting in Cowdray Park and found police at the scene.\n\nWe are still in disbelief that the boss killed himself. The butcheries will remain closed until we hear from the family, he added.\n\nHe said mourners will most likely gather at Madzikatires plot in Kensington, on the outskirts of Bulawayo.\n\nMadzikatire is originally from Manicaland Province.\n\nThe vehicle that the late businessman was driving when he reportedly shot himself was on Sunday morning parked outside the Luveve butchery after police released it to the family.\n\nPolice sources said Madzikatire was found with the large sums of money at the scene.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/6y745.jpg",
            "description": "Raymond Jaravaza raymondjaravaza@gmail.com A BULAWAYO businessman, who owned butcheries in the city’s western suburbs, was Saturday night found dead with a gunshot wound in an apparent suicide. John Tafara Madzikatire reportedly shot himself outside his girlfriend’s house in Cowdray Park suburb on Saturday night. He owned a popular butchery at koChigumira leisure centre in Luveve […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "Watch: Body of national hero Major-Gen (Rtd) Siziba arrives in Bulawayo – ZBC NEWS",
            "url": "https://www.chronicle.co.zw/body-of-national-hero-major-gen-rtd-siziba-arrives-in-bulawayo-zbc-news/",
            "content": "Story by Yolanda Moyo\n\nThe body of the late national hero, Major General (Rtd) Solomon Siziba has arrived at Khumalo Barracks in Bulawayo.\n\nThe body was received by Bulawayo Minister of State for Provincial Affairs and Devolution, Hon Judith Ncube, service chiefs, family members and the Bulawayo community.Major General (Rtd) Siziba died on the 15th of this month in Harare after a long battle with cancer.\n\nThe late national hero will be taken to his home area in Gwanda tomorrow where hundreds are expected to bid farewell to the liberation stalwart.On Monday, a funeral parade will be held at the Lookout Masuku Barracks.Funeral arrangements will be announced in due course.\n\nSource-ZBC NEWS\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jfjf.jpg",
            "description": "Justin Mahlahla ~1 minute Story by Yolanda Moyo The body of the late national hero, Major General (Rtd) Solomon Siziba has arrived at Khumalo Barracks in Bulawayo. The body was received by Bulawayo Minister of State for Provincial Affairs and Devolution, Hon Judith Ncube, service chiefs, family members and the Bulawayo community. Major General (Rtd) […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "Alarming Rise in HIV infections among young women in Plumtree despite overall decline",
            "url": "https://www.chronicle.co.zw/alarming-rise-in-hiv-infections-among-young-women-in-plumtree-despite-overall-decline/",
            "content": "Ronald Mpofu\n\nPLUMTREE Town District Hospital has recorded an alarming increase in new HIV infections among young women aged 2039, despite a general decline in the rate of new infections and an increase in the number of individuals tested.Hospital data shows that between January 2023 and November 2024, 5 235 individuals underwent HIV testing, with 287 new HIV-positive cases recorded. A disproportionate number of these infections were among women aged 2039, highlighting a concerning trend in this demographic.\n\nIn 2023, 2 527 individuals were tested for HIV, leading to 157 new positive cases, with the majority of infections recorded in young women aged 2029. In contrast, data from January to November 2024 indicates that 2 708 individuals were tested, resulting in 130 new infections, with most cases affecting women aged 3039.This represents a decline in new infections from 6,2 percent in 2023 to 4,8percent in 2024, even as the number of individuals tested increased by 7,16 percent.\n\nHowever, the hospital has observed a decrease in the number of patients on antiretroviral therapy (ART). In 2023, there were 3,960 patients on ART, but this number dropped to 3,864 by November 2024.The decline in ART numbers could be attributed to patients lost to follow-up, deaths, or transfers, said Miss Samukeliso Moyo, the Health Information Assistant for Plumtree District Hospital. She also noted that a newly established clinic at Izimnyama opened in August 2023, might help address some of these issues by improving accessibility.\n\nThe data highlights the need for targeted interventions to address the high prevalence of HIV among young women in Plumtree and to ensure sustained ART coverage for all affected individuals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ggsg.jpg",
            "description": "Ronald Mpofu PLUMTREE Town District Hospital has recorded an alarming increase in new HIV infections among young women aged 20–39, despite a general decline in the rate of new infections and an increase in the number of individuals tested. Hospital data shows that between January 2023 and November 2024, 5 235 individuals underwent HIV testing, […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "Bosso elections nomination process closes",
            "url": "https://www.chronicle.co.zw/bosso-elections-nomination-process-closes/",
            "content": "Innocent Kurira -Online Reporter\n\nTHE Highlanders election nomination process for the positions of vice-chairman and treasurer has closed.The elections returning officer, Peter Dube, will announce the names and number of candidates on Monday after the electoral college verifies the nominations.\n\nTo qualify, candidates must have been club members for 24 months, obtain signatures from 10 members in good standing, and pay a US$200 nomination fee. The fee is refundable if the candidate receives at least 10% of the total votes cast.\n\nThe verification process will take place on Monday, after which the Nomination and Electoral Review Committee will publish the list of successful candidates.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/highlanders-580x380.jpg",
            "description": "Innocent Kurira -Online Reporter THE Highlanders election nomination process for the positions of vice-chairman and treasurer has closed. The elections returning officer, Peter Dube, will announce the names and number of candidates on Monday after the electoral college verifies the nominations. To qualify, candidates must have been club members for 24 months, obtain signatures from […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "Bulawayo grapples with vehicle shortages, waste management challenges , and by-law enforcement",
            "url": "https://www.chronicle.co.zw/bulawayo-grapples-with-vehicle-shortages-waste-management-challenges-and-by-law-enforcement/",
            "content": "Online Writer\n\nTHE City of Bulawayo is battling significant challenges in waste management, including vehicle shortages, landfill hazards, and by-law enforcement issues, as highlighted during the November 2024 council meeting, contained in the latest council report.\n\nCouncillors and officials outlined a series of logistical and environmental issues requiring urgent attention to safeguard public health and maintain the citys reputation for cleanliness.\n\nA report tabled during the meeting revealed that only half of the citys 16 refuse trucks are operational, while the other half are out of service. The lone skip hauler, critical for managing high-volume waste areas, remains non-functional, alongside other vital machinery such as tipper trucks.\n\nThese shortages are severely affecting service delivery, noted the Director of Health Services Dr Edwin Mzingwane. Efforts are underway to assemble our own skip hauler, but this will not address the immediate challenges of waste accumulation in high-demand areas.\n\nCouncillor S. Moyo expressed frustration over the lack of progress: High-volume areas no longer have skip bins, and residents are resorting to illegal dumping. This is unacceptable for a city like Bulawayo, which prides itself on cleanliness.\n\nThe Trenance Landfill site, which has been plagued by recurring fires, is posing serious health hazards for nearby residents. Councillor A.R. Moyo raised the alarm during the meeting: The smoke from these fires is affecting the surrounding communities. This is a health disaster waiting to happen.\n\nCllr Moyo proposed innovative solutions to mitigate the risks. The only sustainable way forward is waste-to-energy generation, he said. Relocating the landfill is not an option as it would cost over US$1.8 million. Instead, maintaining the current site and procuring equipment for US$950,000 is more feasible.\n\nThe Director of Health Services added that improved recycling could significantly reduce waste going to the landfill. Currently, only 5 percent of waste is being recycled, yet this could dramatically decrease the volume of waste and reduce fire risks, he said.\n\nStaff shortages in the Central Business District (CBD) have also been blamed for worsening waste management. We currently have only two cleansing supervisors for the entire CBD, said the Dr Mzingwane. This is clearly insufficient.\n\nCllr Moyo praised the citys enforcement of anti-littering by-laws but pointed out obstacles. Political interference is making enforcement difficult, she said. We need a stronger presence on the ground and more support from stakeholders to address lawlessness.\n\nThe council confirmed that it is recruiting security guards to enhance by-law enforcement, with training expected to begin later this month.\n\nA consultative meeting involving stakeholders is planned for January 2025 to address landfill management and explore waste-to-energy partnerships. For these initiatives to succeed, we need partners, Cllr Moyo said.\n\nIn the interim, the council has approached the Procurement Regulatory Authority of Zimbabwe (PRAZ) to expedite the hiring of equipment. Additionally, skip bins will be reinstated in high-demand areas, particularly as waste levels increase during the farm produce season.\n\nWhile Bulawayos leadership remains committed to addressing these challenges, councillors stressed the need for swift action. If we do not invest in adequate machinery and enforce our by-laws more effectively, these problems will only escalate, Cllr Moyo warned.\n\nWith solutions such as recycling, waste-to-energy initiatives, and enhanced enforcement, Bulawayo has the opportunity to set a benchmark for sustainable urban waste management in Zimbabwe. However, success will depend on timely implementation and collective effort.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/03/Untitled-4-copy.jpg",
            "description": "Online Writer THE City of Bulawayo is battling significant challenges in waste management, including vehicle shortages, landfill hazards, and by-law enforcement issues, as highlighted during the November 2024 council meeting, contained in the latest council report. Councillors and officials outlined a series of logistical and environmental issues requiring urgent attention to safeguard public health and […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "West Ham may hijack Marcus Rashford deal amid ‘huge’ claim – ‘watch this space’",
            "url": "https://www.chronicle.co.zw/west-ham-may-hijack-marcus-rashford-deal-amid-huge-claim-watch-this-space/",
            "content": "West Ham could look to hijack any potential deal for Marcus Rashford with a foreign team as they look to keep him in the Premier League.\n\nSpeaking on the latest edition ofFootball Insiders Inside Track podcast, former Leeds goalkeeper Paul Robinson admitted he believes United would ideally like to explore their options outside of the Premier League.\n\nThe 20-time champions would prefer the England international to move away from the Premier League to avoid any potential embarrassment if he rediscovers his form away from Old Trafford.\n\nThe 27-year-old has been deemed surplus to requirement under Ruben Amorim which has alerted top European teams such as AC Milan, Napoli, and PSG.\n\nThe Hammers are also keeping tabs on Rashford, but industry insider Mick Brown revealed toFootball Insiderthat he believes they are unlikely to complete a deal for him.\n\nWatch this space is what Ill say on that one,Robinson toldFootball Insider.\n\nManchester United would ideally like to explore their options outside of the Premier League.\n\nThey could well end up with egg on the face because hes a top player and we know the potential that he can reach.\n\nThere is nothing to say that Marcus Rashford couldnt go into another Premier League side and score 15, 20 goals before now on the end of the season because hes that type of player, he could do that.\n\nIf he goes to Serie A, the Bundesliga or elsewhere, then maybe not so apparent that hes in everybodys face there, he carries a huge salary.\n\nWe know theres a huge financial obligation when it comes with Marcus Rashford. We know that his representatives are scouring Europe.\n\nIf we get to that last weekend before February and theres no deal in place and theres no set destination for Marcus Rashford, then dont rule out West Ham.\n\n[They have a] real chance at nicking him.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/west-ham.jpg",
            "description": "West Ham could look to hijack any potential deal for Marcus Rashford with a foreign team as they look to keep him in the Premier League. Speaking on the latest edition of Football Insider’s Inside Track podcast, former Leeds goalkeeper Paul Robinson admitted he believes United would “ideally like to explore their options outside of the […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "Baby swap at Bulawayo hospital",
            "url": "https://www.chronicle.co.zw/baby-swap-at-bulawayo-hospital/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nShocked to be discharged with a baby girl after giving birth to a boy via Caesarean section, a new mother from Bulawayos Cowdray Park suburb confirmed her suspicions through DNA testing about a month later.\n\nThe incident happened at United Bulawayo Hospitals (UBH) where the mother, who cannot be named due to ethical concerns, was discharged with a baby girl whose parents had already travelled to Esigodini in Matabeleland South with her son.\n\nThe testing, which cost a considerable US$220, was conducted at a laboratory in Bulawayos city centre to prove that the child given to the insistent mother by a maternity nurse at the hospital was not her biological offspring.\n\nThe day before the birth, she underwent a scan which confirmed she was expecting a boy. After the delivery, a nurse took the child for cleaning and returned it to the mother.\n\nThe mother, who had been taking photographs of her son, noticed the babys identification tag indicated it was a girl, said the source close to the woman, who lives in Cowdray Park.\n\nInitially unaware of the discrepancy, the new mother immediately alerted the nurse, expressing her concern. However, the nurse dismissed her concerns, suggesting that the effects of the anaesthesia for the Caesarean section might have clouded her judgment.\n\nAccording to the source, another expectant mother had been admitted to the ward just fifteen minutes before the operation, but she had already been discharged by the time the alert mother raised the alarm.\n\nShe contacted her relatives to inform them of the situation. Her uncle suggested DNA testing, but the nurse vehemently opposed the idea, claiming it was too expensive and unaffordable for the family. However, the uncle insisted, and they proceeded with the testing at a laboratory in the Bulawayo city centre. The results unequivocally confirmed that the baby girl was not her biological child.\n\nFurious, the family returned to the hospital, demanding answers and demanding the return of their biological son. Hospital staff were compelled to locate the other mother, who resided in Esigodini, Umzingwane District.\n\nA hospital vehicle was dispatched to retrieve her.However, the womans husband was unco-operative, adamantly insisting that the child was his.The police were subsequently involved, and the couple was brought to Bulawayo.\n\nAt the insistence of the aggrieved family, the hospital engaged the National University of Science and Technology (Nust) for DNA testing. The results unequivocally confirmed that the two babies had been exchanged.\n\nZephania Dlamini, head of the Applied Genetics Testing Centre at Nust, confirmed this shocking discovery.In the Bulawayo cases, two women who were in the same ward at UBH delivered around the same time.\n\nThe complainant asserted that her child was a boy, but when it was returned after cleaning, she was given a girl.Dlamini further said that when confronted with the discrepancy, the other mother adamantly insisted that her child was indeed a boy, a claim vehemently supported by her husband.\n\nHe even insisted that the ultrasound scan had confirmed the sex of the child as male. Before approaching Nust, the complainant had sought testing at Global DNA lab in the city centre, which confirmed that the baby girl was not hers.Our results corroborated these findings. Subsequent testing on the couple claiming to be the parents of the boy yielded negative results, while the boys DNA matched that of the complainant, and the girls DNA matched that of the other woman, said Dlamini.\n\nDr William Busumani\n\nDlamini revealed that the entire hospital administration was present at the laboratory during the testing process. UBH chief medical officer, William Busumani, declined to comment on the incident.\n\nWe do not discuss patient information, he stated.Maphios Siamuchembu, Provincial Medical Director for Bulawayo Metropolitan Province, said he was not aware of any reports of baby swapping from UBH.\n\nRenowned medical expert, Solwayo Ngwenya, described baby-swapping errors as tragic but avoidable with proper diligence.Receiving a child who is not your own is a devastating experience, particularly from a cultural perspective. In private medical practice, staff are rigorously trained to prevent such occurrences, and the lower volume of deliveries facilitates closer monitoring. We strive to ensure such errors never occur in private healthcare settings, as they would severely damage the institutions reputation, said Ngwenya.\n\nProfessor Solwayo Ngwenya\n\nHe stressed the importance of rigorous procedures in ensuring that each newborn is correctly identified and returned to their biological mother.\n\nImmediately after birth, each baby should be assigned a unique identification tag. This, combined with meticulous attention to detail and adherence to established protocols, is crucial in preventing these tragic errors.\n\nThere are likely many individuals who have been unknowingly raised by parents who are not their biological parents due to similar incidents. These individuals may have grown up in entirely different environments, speaking different languages, leading to profound and unforeseen consequences.\n\nNgwenya urged healthcare institutions to prioritise staff training on the importance of accurate newborn identification.These tragic incidents are entirely preventable. By adhering to strict protocols and maintaining a vigilant approach, we can ensure that such errors do not occur, Ngwenya stressed.\n\nThe case raises serious concerns about the potential for similar incidents to have occurred undetected, particularly among families who may not have the financial resources to pursue DNA testing.\n\nRichard Ndebele, a cultural expert, said that baby swapping was unheard of in the past due to the traditional system of village midwives.\n\nThose involved in such an act must be prepared to face the consequences, as misfortune may befall both the child and themselves. The child may experience difficulties throughout their life, and the perpetrators may face the wrath of their ancestors, Ndebele warned.\n\nHe further explained that traditional birth rites cannot be effectively performed for a child who is not biologically related to the family, as the ancestors would not recognise the child.\n\nThere can be no righteousness in such an act of deception. You may deceive mortal beings, but the ancestors will be aware of your actions, and any rituals performed will be rendered meaningless.\n\nMargaret Makumbe, a retired nurse with a distinguished career spanning four decades and delivering over 10 000 babies, stressed the unwavering commitment to excellence that characterised her profession.\n\nShe highlighted the paramount importance of meticulous attention to detail, a skill that every nurse and supervisor had to master to prevent any medical errors, such as the tragic case of a mother being mistakenly given the wrong baby.\n\nIn my entire career, I never experienced that wherever I was deployed, neither did I hear of it anywhere else and I think this was because we did what we did out of love. I just wonder how such a mistake can happen because once a baby is delivered the mother is shown the child before its taken away for cleaning with a name tag already strapped on the wrist, said Makumbe who at one time while at Mpilo delivered an incredible 15 babies in a single night.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-1-11.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw Shocked to be discharged with a baby girl after giving birth to a boy via Caesarean section, a new mother from Bulawayo’s Cowdray Park suburb confirmed her suspicions through DNA testing about a month later. The incident happened at United Bulawayo Hospitals (UBH) where the mother, who cannot be named due to […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        },
        {
            "title": "Siziba, Chimutengwende declared national heroes",
            "url": "https://www.chronicle.co.zw/siziba-chimutengwende-declared-national-heroes/",
            "content": "Nqobile Tshili and Joseph Madzimure\n\nPRESIDENT Mnangagwa yesterday conferred National Hero status on Major General (Retired) Solomon Siziba and former Information, Posts and Telecommunications Minister Cde Chenhamo Chen Chakezha Chimutengwende, in recognition of their contributions to the country before and after independence.\n\nMaj-Gen Siziba died on Wednesday and will be buried at the National Heroes Acre in Harare next week while burial arrangements for Cde Chimutengwende will be announced in due course as his family is expected to meet Government representatives today.\n\nThe National Heroes Acre\n\nMaj-Gen Siziba died at the Josiah Magama Tongogara Barracks Camp Hospital in Harare after battling cancer.He was 67.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube delivered the national hero status to the Siziba family at his Killarney residence in Bulawayo yesterday evening after receiving communication from the Presidents Office.\n\nThis message comes from Dr Martin Rushwaya, the Chief Secretary in the Office of the President and Cabinet, and is referenced: National Hero Status, the late Maj-Gen (Rtd) Solomon Siziba. His Excellency, the President and First Secretary of Zanu PF, Cde. Dr. E.D Mnangagwa, has conferred national hero status on the late Cde Maj Gen (Rtd) Solomon Siziba, who died on the 15th of January 2025.\n\nMourners are gathered at 527 Bulawayo Drive, Killarney, Bulawayo. The late Maj Gen (Rtd) Siziba will be interred at the National Heroes Acre in Harare at a date to be announced. I shall be most grateful if you would make the usual arrangements for his burial and payment of benefits to his family, said Minister Ncube.\n\nMinister Judith Ncube\n\nShe described Maj-Gen Sizibas death as a great loss, saying her office had started to initiate the processes expected with the handling of a funeral of a national hero.\n\nMaj-Gen Sizibas brother, Mr Leonard Siziba, expressed gratitude to the President for declaring his brother a national hero. He said the status was befitting for a man who served the country since his childhood as a learner at Manama High School, where he and other learners joined the armed struggle.\n\nWe want to thank His Excellency, the President, for declaring my brother a national hero. We also want to thank the Minister of State for Provincial Affairs and Devolution for delivering the message to the family. My brother joined the armed struggle when he, together with other learners from Manama, left school and crossed into Botswana.\n\nHe did his primary level at Nhwali Primary School and proceeded to Manama High School in 1976, where he started his Form One.\n\nHe was part of the group that joined the armed struggle from Manama Mission in 1977. He did his military training in Zambia, and during the ceasefire, he was attested to the Zimbabwe National Army. He was stationed at the Zimbabwe Military Academy, where he rose to the rank of Captain. He was then transferred to the ZNA, where he worked until 2005, rising to the position of Lieutenant-Colonel. He was posted to Botswana as Defence Attach from 2005 to 2013, stationed at the Zimbabwean Embassy, he said.\n\nProvincial Affairs and Devolution Ministers for Bulawayo and Matabeleland South console each other at the funeral of the late Retired-Major General Solomon Siziba in Bulawayo yesterday\n\nMr Siziba said upon his return to Zimbabwe in 2013, Rtd Maj Gen Siziba was appointed the Deputy Commander of One Brigade and had been elevated to the rank of Colonel.\n\nFrom 2013 until 2018, he was appointed Director of Administration at the National Prosecuting Authority.Mr Siziba said Maj-Gen Siziba returned to the ZNA in 2018 and was elevated to the rank of Brigadier General and was assigned to the Brigadier General Inspectorate position, a post he held until he retired from the military last year. He said his brother was elevated to the position of Maj-Gen upon his retirement.\n\nHe described his death as a great loss, saying Maj-Gen Siziba had become a father figure in the family. The Government has already taken over the funeral processes, including the provision of meals, tents, and other necessities.Maj-Gen Sizibas body is expected to arrive in Bulawayo today and will be received at HQ One Brigade Barracks (Mzilikazi Barracks). After that, it will be taken to Doves Funeral Parlour. Tomorrow, a send-off funeral service will be held at his rural home in Nhwali, Gwanda, Matabeleland South.\n\nMatabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu, service chiefs, and other senior government officials were among the mourners at the familys residence.\n\nCde Chimutengwende died on Thursday and was declared a national hero last night.Zanu PF National Political Commissar Cde Munyaradzi Machacha delivered the message to the family at their Milton Park, Harare, home.\n\nCde Machacha was accompanied to the Chimutengwende family home by Home Affairs and Cultural Heritage Minister Kazembe Kazembe, who is also the Zanu PF Mashonaland Central provincial chairman.Earlier in the day, Zanu PF National Chairman and Defence Minister Oppah Muchinguri-Kashiri had told the media that Mashonaland Central province had written to the national leadership requesting national hero status for Cde Chimutengwende.She described Cde Chimutengwende as a strong member of the ruling party Zanu PF, who played a major role before and after independence.\n\nHe was a principled person who persevered and was consistent and these are some of those values that we consider (when declaring one a national hero), Cde Muchinguri-Kashiri said.\n\nCde Chimutengwende served as a Government Minister, Member of Parliament for Mazowe and a Politburo member.He succumbed to chronic kidney disease.\n\nBorn on August 28, 1943, Cde Chimutengwende first became a Zanu PF Member of Parliament in 1985 in Mazowe, and served as a legislator for over 25 years.\n\nHe also served for 14 years as a Cabinet Minister.Cde Chimutengwende served as Senator and Deputy President of the Senate, Member of the Pan-African Parliament (PAP) and Head of the Zimbabwe delegation to the PAP.He earned a Masters degree in Social Science and a PhD from the University of Bradford in the UK.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-2-3.jpg",
            "description": "Nqobile Tshili and Joseph Madzimure PRESIDENT Mnangagwa yesterday conferred National Hero status on Major General (Retired) Solomon Siziba and former Information, Posts and Telecommunications Minister Cde Chenhamo ‘Chen’ Chakezha Chimutengwende, in recognition of their contributions to the country before and after independence. Maj-Gen Siziba died on Wednesday and will be buried at the National Heroes […]",
            "time": "21:26",
            "date": "19 Jan 2025"
        }
    ]
}