{
    "news": [
        {
            "title": "President’s initiative enhances food security and livelihoods",
            "url": "https://www.chronicle.co.zw/presidents-initiative-enhances-food-security-and-livelihoods/",
            "content": "Blessing Chidakwa, Harare BureauBUSINESS units under the Presidential Rural Development Programme established in every village and some schools across the country are yielding positive benefits for communities, enhancing food security and improving livelihoods.\n\nThis initiative, spearheaded by President Mnangagwa, promotes a collaborative approach across various Government departments to maximise benefits for farmers.Each business unit is designed to be self-sufficient and includes a solar-powered borehole, provided under the Presidential Borehole Drilling Scheme, two 10,000-litre water tanks, four community water taps, one-hectare fenced-drip horticultural garden (size may vary based on borehole yield) and two fish ponds (100 cubic meters or 100 square metres).\n\nPresident Mnangagwa\n\nAdditionally, the units may include feeding and water troughs for livestock, tailored to the specific needs of the area. The goal is to establish 35,000 units nationwide.In districts like Buhera, villagers are already selling produce from these business units, reaping substantial rewards.\n\nProfessor Obert Jiri, the Permanent Secretary for Lands, Agriculture, Fisheries, Water and Rural Development, said the units are more than just gardens but comprehensive businesses aimed at supporting community livelihoods.We anticipate that the entire village will rally behind the village business unit to ensure its operational success. The benefits include access to water for both livelihoods and production, and the production of vegetables ensures nutritional security for every household, he said.\n\nThe average village requires about 33 metric tonnes of grain per year. If a business unit is well-managed, it can produce approximately seven tonnes of grain in one cycle, covering nearly a fifth of the villages grain needs. With two production cycles, this can meet about a third of the requirement.The income generated from the sale of grains, vegetables, and fish can enhance community welfare. Households can afford to send their children to school and purchase essential goods, leading to direct positive impacts on community well-being.\n\nFor schools, the funds generated will support learners by supplementing fees and feeding programmes. Pupils will also gain valuable agronomic skills, learning to view agriculture as a viable business from a young age.\n\nAggregation of these village business units allows for economies of scale, enhancing marketing opportunities beyond the village to local business centres, provincial capitals and even for export, Prof Jiri said.\n\nDuring the El Nio-induced drought, business units were adapted to serve as drought mitigation centres, providing crucial support to affected communities.Apart from villages, a total of 9,600 schools will receive business units, along with 43 vocational training centres under the Ministry of Youth Empowerment, Development and Vocational Training.\n\nThe Agricultural Rural Development Authority (Arda) will appoint trained managers to oversee daily operations, including labour management, agronomic activities and water supply oversight.\n\nThe Agricultural Rural Development Authority (Arda)\n\nThese managers will also report any operational issues, while Ardas business advisors will provide ongoing agronomic support, ensuring the sustainability and success of the business units.\n\nThrough this initiative, Government seeks to foster food security, enhance livelihoods, and promote sustainable agricultural practices across the nation.In Buhera, the Davhe Village Business Unit yielded an impressive 10 tonnes of maize despite the drought.With consistent water supplies, Davhe Business Unit adopted crop rotation techniques, cultivating maize, vegetables, tomatoes and cabbages.This years maize harvest marked a major milestone for the unit, as all 10 tonnes were purchased at a lucrative price of US$4,000 by Prevail Group International (PGI).\n\nThe organisation has not only facilitated access to water but has also created sustainable market linkages for small-scale farmers.Special Advisor to the President also PGI chairperson Dr Paul Tungwarara, whose company is Governments implementing partner, said the Scheme spearheaded by President Mnangagwa, has transformed the agricultural narrative for Buhera.Despite being in a drought-prone region, local communities are now producing surplus yields, improving food security and transforming lives, he said.Ms Maria Nyamunda, a beneficiary and mother of three, shared how the Business Unit has been a game-changer for her family.\n\nBefore this noble initiative, we relied on inconsistent rains and our crops often failed. Under this scheme, I can now grow food throughout the year. I sold my share of the maize harvest and will use the money to send my children to school and buy groceries, said Ms Nyamunda.Another beneficiary, Mr Tatenda Mhiripiri said: This initiative has empowered women like me to be financially independent.\n\nI no longer worry about feeding my family, and I even managed to start a small poultry project with the proceeds from our Business Unit earnings.In Mt Darwin, the Business Units are already bearing fruit with some beneficiaries earning a monthly income of up to US$80 and up to US$3 000 in dividends.Mr Staford Kabaira of Zunde D Village Business Unit said the project will go a long way in addressing the scourge of hunger in the area, adding that they can provide food and send their children to school.\n\nOur business is thriving, we can sell our produce and send our children to school. Markets are guaranteed and so far, the scheme is paying well, he said.Mrs Sheila Gwaze said the business helped to stabilise marriages in the community adding that divorce cases are likely to decrease since the majority of women are now empowered.This empowerment is critical. We do not fully depend on husbands hence cases of domestic violence are minimal. Poverty is the major issue, which drives violence in marriages. We thank our President for such initiatives, which help to improve peoples livelihoods, she said.\n\nCamperdon Village Business Unit chairman, Mr Gift Machipisa said they are earning a reasonable amount of money every month through the Business Unit.We are earning a living through various farming activities, which are taking place here. We are utilising the borehole well. We have extension workers who also provide us with guidance in the growing of our crops. If funding is increased, we are sure we can penetrate international markets, he said.Agricultural Marketing Authority chief executive officer, Mr Clever Isaya, recently revealed that it is critical for communities to utilise the Business Units.We are happy with progress so far at the Business Units. They are selling produce, which is in demand on the market.\n\nUnder the Presidential Rural Development Programme, a total of 35,000 village business units and 9,600 school business units will be established by end of this year. These village business units will help spur rural industrialisation and address gaps in food security, income generation and employment creation.In Manicaland province, 2 822 villages are expected to benefit. Elsewhere, 4 244 villages in Mashonaland East, 3 335 villages in Mashonaland West, 8 692 villages in Masvingo, 3 205 villages in Matabeleland North, 2 418 villages in Matabeleland South and 6 342 villages in Midlands are also benefitting from the programme.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/fgefe.jpg",
            "description": "Blessing Chidakwa, Harare Bureau BUSINESS units under the Presidential Rural Development Programme established in every village and some schools across the country are yielding positive benefits for communities, enhancing food security and improving livelihoods. This initiative, spearheaded by President Mnangagwa, promotes a collaborative approach across various Government departments to maximise benefits for farmers. Each business […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "Floods misery for Cowdray Park residents",
            "url": "https://www.chronicle.co.zw/floods-misery-for-cowdray-park-residents/",
            "content": "Nqobile Tshili,[emailprotected]AS heavy clouds gather, promising another deluge, Mrs Millian Nyoni of Cowdray Parks Hlalani Kuhle/Garikai area braces herself for yet another sleepless night.\n\nFor her and many others in this flood-prone neighbourhood, rain has become a source of dread rather than a blessing.Mrs Nyonis home, once a symbol of security, has turned into a waterway, with torrents from upstream surging through her rooms despite her desperate attempts to block the flow.\n\nI havent rested since Sunday, she says, standing in her waterlogged living room, where furniture has been precariously stacked on chairs to prevent further damage.\n\nThe water was knee-deep, and Ive been scooping it out ever since. My sofas, beds, and so much else are ruined. I now hate the rain.Mrs Nyonis voice quivers as she recounts the harrowing nights spent battling the floodwaters while worrying about her young grandchildren, aged two and four.\n\nCowdray Park houses submerged in Water\n\nWe should be loving the rain, but I now hate the rain. I couldnt even go to work for the past two days. Every time it rains, I have to rush home, no matter where I am, to protect what little I have left, she says.Mrs Nyonis plight is shared by many in the area, where homes were built without a proper drainage system.\n\nThe situation has worsened over the years, with each rainy season leaving a trail of destruction. Bulawayo has been experiencing heavy rains, with the Meteorological Service Department (MSD) warning of continued downpours until Saturday. For residents of Hlalani Kuhle/Garikai, these rains spell disaster.\n\nLast year, the Bulawayo City Council (BCC) resolved to demolish 17 houses in the area to make way for a long-overdue drainage system. However, progress has been stalled due to funding constraints.\n\nCowdray Park houses submerged in Water\n\nOn Monday, we invited the councillor and the city engineer to assess our situation. While some homeowners are set to be compensated, others, like me, have not been included on the list, and were living in limbo, explains Mrs Nyoni.Ward 6 Councillor, Nkosinathi Mpofu admits that the situation has become a personal torment.\n\nResidents call me at all hours, even at 2 AM, seeking help, but the truth is, we dont have the resources to address this crisis adequately.The entire area lacks a drainage system, and water flows indiscriminately, flooding homes, he says.\n\nCowdray Park houses submerged in Water\n\nOn Monday, Clr Mpofu, accompanied by BCCs public works acting director, Engineer Methusi Dibidi, visited the affected homes. They found a community in despair, with residents demanding immediate action.He said Eng Dibidi explained that the council doesnt have the funds to compensate the 17 homeowners whose houses need to be demolished, let alone construct the drainage system.\n\nClr Mpofu said as a temporary measure, Eng Dibidi promised to send a grader to create trenches. Which is just a stopgap solution.The flooding problem in Hlalani Kuhle/Garikai is not new. The housing project, handed over to the council in 2012, was meant to include water, sewer and drainage infrastructure. Residents were expected to contribute US$50 monthly to fund these amenities, but the financial burden proved too heavy for many.From the records, it has been shown that 75 percent of the allocated beneficiaries had failed to meet their agreed monthly obligations of US$50, according to council minutes.\n\nBCC later reduced the contribution to US$15 per month, but this led to a significant drop in revenue. Only 25 percent of beneficiaries consistently paid their dues, crippling the projects cash flow. As a result, the timeline for completing the infrastructure was extended from five years to a staggering 16 years.Clr Mpofu called on the central Government to intervene, acknowledging that the council alone cannot resolve the crisis.\n\nBCC identified stand numbers 18666, 18667, 18712, 18853, 18852, 20144, 20145, 20113, 20074, 20060, 20063, 19837 and 19807 for relocation.In some areas, houses were even built on wetlands, making the flooding problem worse.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-9.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw AS heavy clouds gather, promising another deluge, Mrs Millian Nyoni of Cowdray Park’s Hlalani Kuhle/Garikai area braces herself for yet another sleepless night. For her and many others in this flood-prone neighbourhood, rain has become a source of dread rather than a blessing. Mrs Nyoni’s home, once a symbol of security, has […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "Inaugural #53 Nkayi Festival a success",
            "url": "https://www.chronicle.co.zw/inaugural-53-nkayi-festival-a-success/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nTHE inaugural #53 Nkayi Festival, an event aimed at promoting music and creating opportunities for artistes in Nkayi District, Matabeleland North Province, was held successfully despite the rains that threatened the cancellation of the event at some venues.\n\nA brainchild of artistes Intombi Yabelungu, Precious Diana Indlovukazi, Collen Moyo and Bheki Fuzane, the seven-day festival ran from Christmas Day to New Years Eve.\n\nIt was held in multiple locations across the district, starting on 25 December at Gonye Shopping Centre.\n\nThe other venues included Nkayi Shopping Centre (26 December), Nyaje (27 December), Gwelutshena (28 December), Mateme (29 December), Khomayanga (30 December) and Mpumelelo (New Years Eve).\n\nAcross all the events, over 20 artistes were expected to perform, but only 11 managed to show up due to other commitments.\n\nThese included Collen Moyo, Bheki Fuzane, Intombi Yabelungu, Precious Diana Indlovukazi, Magwizi the comedian, Mchasisi Dube, Intenjane Indiyazani, Velabahleke, Amagodonga Amahle, The Melodious Psalms and Manqoba.\n\nNonetheless, the artistes brought their A-game to the stage, with the festivities lighting up Nkayi District as people enjoyed affordable live entertainment during the festive period.\n\nOne of the organisers, Precious Diana Indlovukazi, said they were happy with the support received and hope that the next edition would be bigger.\n\nAll the shows at the seven venues went extremely well, as artistes managed to showcase their talents to the crowds that attended. I am happy to say that there was also no violence, which is often experienced at such gatherings. This showed the unity of the Nkayi people and we commend them for this.\n\nAlthough the rains posed a challenge during some of the events, we managed to ensure that when it was not raining, we capitalised on the time and successfully hosted the events, said Precious Diana Indlovukazi.@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/bvxcbbbbbbbbbbbbbc.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com THE inaugural #53 Nkayi Festival, an event aimed at promoting music and creating opportunities for artistes in Nkayi District, Matabeleland North Province, was held successfully despite the rains that threatened the cancellation of the event at some venues. A brainchild of artistes Intombi Yabelungu, Precious Diana Indlovukazi, Collen Moyo and Bheki Fuzane, the […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "SA police smash cross-border smuggling ring",
            "url": "https://www.chronicle.co.zw/sa-police-smash-cross-border-smuggling-ring/",
            "content": "Thupeyo Muleya,[emailprotected]\n\nSOUTH African police have confiscated two vehicles and an inflatable boat used to ferry smuggled goods across the Limpopo River between South Africa and Zimbabwe.\n\nThe operation, conducted in the Masisi area, also led to the arrest of six suspects.\n\nLimpopo police spokesperson, Lieutenant Colonel Stephen Thakeng, confirmed the arrests and the seizure of the vehicles during a cross-border operation targeting smuggling activities.\n\nThe operation involved roadblocks, stop-and-search exercises and cross-border patrols in the Masisi policing area.\n\nWe arrested four suspects for contravening the Immigration Act and two others for aiding and abetting smuggling near the Limpopo River, he said.\n\nThe arrests were made on Monday during a co-ordinated cross-border operation.\n\nThe Provincial Commissioner of Limpopo, Lieutenant General Thembi Hadebe, commended the collaboration between the police, the Cross-Border Business Forum and the Farmers Union, which resulted in the successful operation.\n\nThe confiscation of the vehicles and arrests demonstrates our commitment to combating cross-border crime.\n\nThe suspects are expected to appear in their local magistrates court soon, she said.\n\nThe arrests come as Zimbabwes national anti-smuggling task force intensifies its efforts to dismantle smuggling syndicates operating along the border with South Africa.\n\nThe Government is losing significant revenue due to illicit trade, with smuggled goods bypassing customs duties and flooding local markets.\n\nThe task force, led by the Ministry of Industry and Commerce, collaborates with the Zimbabwe Revenue Authority (Zimra), police, the Reserve Bank of Zimbabwe (RBZ), the Consumer Protection Commission and other law enforcement agencies.\n\nReserve Bank of Zimbabwe (RBZ)\n\nThe crackdown has already resulted in the seizure of goods worth millions of dollars in unpaid import duties along the Beitbridge-Harare corridor.\n\nSmugglers often avoid official border posts, using remote border flanks to transport goods into Zimbabwe, where they are loaded onto intercity buses or cargo trucks for distribution.\n\nTo counter these activities, the Government has deployed advanced security technologies, including drone surveillance systems and fast cargo scanners, at the Beitbridge border post. Since their introduction in January last year, Zimra has intercepted numerous smuggling attempts daily.\n\nPresently, seven drones are operational at the border, with plans to deploy more to other key entry and exit points, including Forbes and Chirundu. Enhanced Container Tracking Systems (ECTS) and additional fast scanners are also being introduced to strengthen border surveillance.\n\nNational police spokesperson, Commissioner Paul Nyathi, reaffirmed the Governments commitment to enforcing customs laws and curbing smuggling.\n\nCommissioner Paul Nyathi\n\nWe are conducting joint anti-smuggling operations with stakeholders, including Zimra said Commissioner Nyathi. Importers and exporters must comply with the countrys customs laws.\n\nDuty must be paid where applicable. Smuggling cannot be tolerated.\n\nComm Nyathi said the operation targets buses, private vehicles and commercial trucks often used as conduits for smuggled goods.\n\nOur joint efforts are yielding results, and we have intercepted numerous smuggled goods. This illegal activity cannot continue indefinitely, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-2-18-630x380.jpg",
            "description": "Thupeyo Muleya, Thupeyo.muleya@zimpapers.co.zw SOUTH African police have confiscated two vehicles and an inflatable boat used to ferry smuggled goods across the Limpopo River between South Africa and Zimbabwe. The operation, conducted in the Masisi area, also led to the arrest of six suspects. Limpopo police spokesperson, Lieutenant Colonel Stephen Thakeng, confirmed the arrests and the […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "Schoolwear producers stretched as demand gallops",
            "url": "https://www.chronicle.co.zw/schoolwear-producers-stretched-as-demand-gallops/",
            "content": "Sikhulekelani Moyo,[emailprotected]AS the first term of 2025 looms, Bulawayo producers of school uniforms and learning accessories are facing an overwhelming surge in demand, with many small to medium enterprises (SMEs) working around the clock to meet orders.The back-to-school season has presented a lucrative opportunity for uniform manufacturers and traders.\n\nIn recent years, many established companies have closed, leaving room for smaller, more nimble producers to step in and fill the gap.These SMEs, operated by skilled personnel, are meeting the growing demand and competing with former industry giants, offering high-quality school wear products at competitive prices.\n\nPreviously, parents and guardians would crowd major uniform suppliers weeks before school opening. However, the rise of local SMEs in Bulawayo offers an alternative, with many parents opting for high-quality, locally produced school wear at competitive prices.\n\nToday, indigenous fashion designers and producers are capitalising on this space, providing uniforms for schools. With over six million learners in the country, the market is vast and local SMEs are eager to claim their share.\n\nAt the SMEs Centre at OK Mart in Bulawayo, a Chronicle news crew found a bustling scene of garment producers working tirelessly to meet deadlines. Various uniforms, including those for almost every school, were on display, with prices ranging from US$10 for a complete uniform, set to US$25 for bags.Ms Samkeliso Nyambiri, one of the producers at the SMEs Centre, said they are struggling to keep up with the demand.\n\nOK Mart\n\nWe are ready to supply the market with school uniforms, but our capacity is being stretched. We had three days without electricity, which set us back, and some of our clients wont receive their orders on time, she said.\n\nMs Nyambiris small team of five employees is simply not enough to meet the growing orders. Despite being stocked with common materials, the shortage of manpower is a significant challenge.\n\nWere doing our best, but its hard to keep up with the pace, she added.Another producer, Ms Juliana Mujuru, shared similar frustrations.\n\nThe customers come all at once, and the pressure is immense. Sometimes, we have to sleep at work just to meet the deadline. The mosquito bites and cold winds make it tough, but were committed to delivering, she said.Ms Mujuru also cited working capital as a significant hurdle.\n\nWe get more orders than we can handle, and without enough funds, its hard to meet the demand, she said.Adding to the challenges, substandard products flooding the market at lower prices are making it difficult for SMEs to compete. Some uniforms are being sold for as little as US$3, which undercuts the prices of high-quality, locally produced garments.\n\nPower cuts are another persistent issue, with many businesses struggling to maintain consistent production. Mr Adam Mlambo, a shop assistant at Prigar Marketing, said: The power cuts are making it hard to meet deadlines. To compensate, were working night shifts to cover the gap, but its not easy.Bulawayo SMEs Chamber programmes co-ordinator, Mr Nketa Mangoye Dlamini, pointed out that many of the SMEs are struggling with working capital, which limits their ability to produce in large quantities.\n\nMost of our members depend on their personal finances, which affects their production capacity. We need to address this issue, and it is important to stock materials at the centre to reduce the time spent sourcing supplies from town, he said.\n\nDespite these challenges, there is a bright spot in the form of the Maker Space initiative. Funded by UN Women in partnership with the Government, the Maker Space provides a collaborative environment for women entrepreneurs in garment manufacturing. The facility offers advanced machinery and software, enabling women to enhance their productivity and competitiveness.This has helped reduce the time spent outsourcing services like embroidery and promotes mass production, said Mr Dlamini. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/GFGGFGFJGF8GF.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com AS the first term of 2025 looms, Bulawayo producers of school uniforms and learning accessories are facing an overwhelming surge in demand, with many small to medium enterprises (SMEs) working around the clock to meet orders. The back-to-school season has presented a lucrative opportunity for uniform manufacturers and traders. In recent years, […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "CAS, Zifa note receipt of nomination appeals",
            "url": "https://www.chronicle.co.zw/cas-zifa-note-receipt-of-nomination-appeals/",
            "content": "Lovemore Dube and Sikhumbuzo Moyo\n\nTHE Zifa Electoral Committee, seized with organising elections for a substantive board on January 25, has commended two disqualified candidates for following the proper appeal procedure.\n\nThey remained hopeful that elections would go ahead on the set date despite legal challenges.\n\nBenjani Mwaruwari and Gift Banda, who were after the Zifa president and vice-presidents posts respectively, approached Court of Arbitration in Sport (CAS) after being disqualified from the list of eligible candidates.\n\nSpeculation is rife that they were disqualified for not having five O-levels or the equivalent.\n\nThe Zifa Normalisation Committee, which is also the electoral committee, disqualified several candidates for reasons that were kept away from the public to save the candidates from embarrassment.\n\nFarai Jere and Temba Mliswa were among the biggest casualties of those deemed not to meet the criteria set down following the drafting of a new constitution adopted on November 22 and the appointment of an ethics and integrity committee led by veteran legal personality, Muchadei Masunda.\n\nWe applaud Benjani and Gift Banda on their willingness to comply with Zifa Statutes and procedurally challenge their ineligibility at CAS and we are co-operative in our approach and will ensure the process remains as transparent as possible and will respect the CAS verdict when it comes.\n\nGift Banda\n\nWe are working closely with our external Counsel to ensure we respond within the stipulated dies induciae of two days and will be following closely the CAS proceedings. For the avoidance of doubt, we received the CAS application on Monday afternoon the 6th of January 2025, wrote Zifa in their response to questions on the matter sent on Monday evening.\n\nThe Zifa Normalisation Committee also acknowledged receiving Walter Magayas Court Application with the High Court of Zimbabwe.\n\nAccording to election processes, appeals should be made with CAS.\n\nThe Zifa Normalisation Committee acting as the Zifa Electoral Committee has acknowledged receipt of Walter Magayas Court Application for Review filed with the High Court of Zimbabwe following his ineligibility to run for Zifa Presidency which was communicated on the 23rd of December 2024.\n\nWalter Magaya\n\nIn response Zifa Electoral Committee stipulates that Magayas actions of approaching local courts is ultra vires Zifa Statutes albeit it being an application for review  it does not address any procedural irregularities, but substantive issues, which should have been taken at the level of CAS under Zifa Statutes, Zifa said.\n\nHowever, the appeals through CAS may have thrown the elections into uncertainty.\n\nThe duos appeal is registered under CAS 2024/A/11104.\n\nThank you for your enquiry. On 31 December 2024, the Court of Arbitration for Sport (CAS) registered the following appeal arbitration procedure: CAS 2024/A/11104 Benjani Mwaruwari & Gift Banda v Zifa Normalisation Committee. The arbitration is at an early stage and no further information is available at this time, said CAS in an emailed response to an inquiry by Zimpapers Sports Hub.\n\nMwaruwari and Banda were two of the four aspirants who were barred from contesting by the Normalisation Committee, others being former Premier Soccer League chairman Jere and former legislator Themba Mliswa, who were both eyeing the Zifa presidency post.\n\nWith the appeal confirmation, the elections are now in doubt this month, unless CAS sets an earlier date for adjudication.\n\nIn another development, Mliswa has filed High Court papers seeking nullification of the whole Zifa Electoral process arguing that it was being run using a constitution rectified by an illegitimate body.\n\nIn his application, the former legislator now turned traditional leader sighted the Zifa Normalisation Committee, the Sports and Recreation Commission (SRC) and the Ministry of Sports, Arts and Recreation as the first, second and third respondents, respectively.\n\nTake notice that the following grounds shall be relied upon in the application; The Zifa Congress Delegates who met at the Annual General Meeting of the First Respondent on the 18th of October 2024 and thereat passed the resolution to adopt the amended Zifa Constitution were devoid of authority to so act by virtue of some of the Congress delegates terms of office having expired in the period preceding the Annual General Meeting, wrote Mliswa through his lawyers, MD Hungwe Attorneys at Law.\n\nMliswa argues that the amended Zifa Constitution, having been adopted by a body lacking in requisite mandate and authority, is a product of grossly flawed and irregular proceedings and therefore a legal nullity and no lawful process can emanate therefrom.\n\nThe Second respondent assented to and adopted the amended Zifa Constitution on the 7th of November 2024 despite the lack of authority or mandate regards the congress delegates of the first respondent and thus adopted a Constitution that was a product of a grossly flawed process, which adoption is in that score equally a legal nullity and ought to be vacated.\n\nThe subsequent electoral processes instigated by the first respondent through the Zifa Normalisation Committee under a Constitution that was irregularly adopted is equally flawed as it is premised on a Constitution whose existence is a legal nullity by dint of having been adopted by a body lacking the requisite authority and mandate, argued Mliswa.\n\nHowever Mliswa had sought nomination by the same councillors and submitted his papers to Zifa, who are the operational arm of the Assembly.\n\nHe allegedly even took some councillors to South Africa to watch the Warriors as part of the familiarisation exercise towards the elections.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jfhjfhjsh.jpg",
            "description": "Lovemore Dube and Sikhumbuzo Moyo THE Zifa Electoral Committee, seized with organising elections for a substantive board on January 25, has commended two disqualified candidates for following the proper appeal procedure. They remained hopeful that elections would go ahead on the set date despite legal challenges. Benjani Mwaruwari and Gift Banda, who were after the […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "COMMENT: Let’s expand use of solar power to other health centres nationwide",
            "url": "https://www.chronicle.co.zw/comment-lets-expand-use-of-solar-power-to-other-health-centres-nationwide/",
            "content": "WITH the national grid constrained due to poor hydropower production and inefficiencies associated with ageing coal-based facilities, many local electricity users are investing in alternatives.\n\nFrequent droughts mean Kariba Hydropower Plant cannot produce to design capacity.Since early last year, for example, it is dispatching around 215 megawatts (MW), down from its optimum capacity of about 1 050 MW.On the other hand, some units at Hwange Thermal Power Plant are old, having been in action for decades.\n\nHwange Thermal Power Plant\n\nAs a result, the plants overall production has declined.\n\nInitially, the constraints hampering the two major facilities got users investing in diesel generators to keep the lights on. But diesel is very costly, dirty and noisy.\n\nLately, institutions and households are investing in solar systems to power their properties in times of blackouts or to totally go off-grid. There are a few biogas and wind power projects here and there but solar is the commonest alternative. It is clean, renewable, cost-effective and, depending on the level of investment made as well as the quality of equipment used, is just as reliable as the national grid even for heavier tasks.\n\nIt is reassuring that the Government has partnered the UN Development Programme (UNDP) to install solar power systems at Mpilo and United Bulawayo hospitals.\n\nThere is now little to no risk of power going off while a patient is on the operating table or a ventilator.\n\nWe are sure this is a national project.If not, we urge authorities and the UNDP to expand it to other health centres nationwide.\n\nIt is also important to take this investment not as a stop-gap measure during load shedding periods but to actually wean them off the grid. They can obviously switch back if the elements make it impossible for solar systems to run as efficiently as expected or in times of system failure and scheduled maintenance.\n\nOther essential Government services must follow that route. The same must apply to private business and households.\n\nThese individual investments will, when brought together, ease pressure on Kariba and Hwange, leaving them with enough capacity to power up other households, businesses and institutions that, for one reason or another, cannot go off-grid.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-1-copy-2.jpg",
            "description": "WITH the national grid constrained due to poor hydropower production and inefficiencies associated with ageing coal-based facilities, many local electricity users are investing in alternatives. Frequent droughts mean Kariba Hydropower Plant cannot produce to design capacity.  Since early last year, for example, it is dispatching around 215 megawatts (MW), down from its optimum capacity of […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "Diaspora remittances surge by 16,5pc",
            "url": "https://www.chronicle.co.zw/diaspora-remittances-surge-by-165pc/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nGOVERNMENTS ongoing engagement with Zimbabweans in the diaspora is paying dividends, with remittances from abroad increasing by an impressive 16,5 percent in the first nine months of 2024 compared to the same period in 2023.\n\nIn the 2025 National Budget statement, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, highlighted the pivotal role of diaspora remittances in sustaining the countrys current account surplus.\n\nThe surplus is projected to close at US$2,49 billion in 2024 and improve slightly to US$2,51 billion in 2025.\n\nDiaspora remittances grew from US$1,6 billion recorded in the first nine months of 2023 to US$1,9 billion during the same period in 2024, said Prof Ncube.\n\nInternational remittances, comprising funds from Zimbabweans abroad and international organisations, have become a critical pillar of the national economy, significantly improving household livelihoods and bolstering liquidity.\n\nZimbabweans in the diaspora are encouraged to actively participate in the countrys economic growth through investments in capital markets, venture capital funds, pension schemes and various bonds issued by the Government or private sector players.\n\nThe diaspora community, estimated at over three million, is predominantly based in South Africa, the United Kingdom, Canada, Australia and the United States. These individuals contribute significantly to their families welfare back home, providing a vital lifeline for many.\n\nEconomist, Mr George Nhepera, noted that remittances are emerging as a key source of income for households, particularly during periods of economic slowdown and drought recovery.\n\nRemittances not only sustain families but also boost aggregate demand for goods and services, leading to increased sales and revenues for the retail sector, he said. \n\nAdditionally, a portion of these funds is channelled into housing construction in both urban and rural areas, aligning with the Governments Vision 2030 objective of ensuring decent accommodation for all.\n\nThe impact of remittances extends beyond household consumption.\n\nThe Reserve Bank of Zimbabwe (RBZ) reported a significant increase in international reserves, which rose from US$285 million in April 2024, when the Zimbabwe Gold-Backed Digital Token (ZWG) was launched, to approximately US$540 million by October 2024.\n\nReserve Bank of Zimbabwe (RBZ)\n\nProf Ncube attributed this improvement to a deliberate reserve accumulation strategy that has bolstered foreign currency and gold holdings. This strategy ensures adequate coverage for ZWG reserve money and contributes to financial stability.\n\nMoving forward, the Reserve Bank will continue building international reserves to provide a buffer for ZWG stability and maintain sufficient import cover, said Prof Ncube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghnjghgj.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  GOVERNMENT’S ongoing engagement with Zimbabweans in the diaspora is paying dividends, with remittances from abroad increasing by an impressive 16,5 percent in the first nine months of 2024 compared to the same period in 2023. In the 2025 National Budget statement, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, highlighted the […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "Herding cattle fires farmer’s passion for livestock",
            "url": "https://www.chronicle.co.zw/herding-cattle-fires-farmers-passion-for-livestock/",
            "content": "Chronicle Writer\n\nBeitbridge farmer Mr Phumudzo Mudau (32) has turned his passion for sheep farming into a thriving enterprise and now eyeing investing in high-quality Boer and Dorper sheep breeds, known for their resilience and meat quality.\n\nWhen he was only 16, Mr Mudau started reading a lot of books and other material related to sheep and goat rearing, which helped him acquire basic knowledge of livestock farming.\n\nAfter finishing Ordinary Levels in 2010, Mr Mudau pursued his childhood dream by venturing into livestock production starting with goats.\n\nTo add value to goat farming, he decided to expand to include sheep. Starting with a modest flock of a ram and three ewes in 2022, Mudau now manages over 100 sheep on his plot in rural BeitbridgeHe got one of the ewes from his late grandmother after exchanging it for a doe.\n\nI grew up herding cattle, but I always dreamed of diversifying into sheep farming. Sheep require more care, but the rewards are worth the effort, he said.\n\nMudaus journey was not without challenges. Initially, he struggled with diseases like foot rot and inadequate grazing lands due to the semi-arid climate. However, through persistence and a thirst for knowledge, he attended workshops and worked closely with veterinary officers to improve his flocks health and breeding practices.\n\nMr Mudau said his long-term plan is to venture into stud breeding and be able to introduce Dohne Merino sheep to enhance the quality of his flock for export purposes.\n\nI am working on improving my breed by cross-breeding the indigenous breed with high-quality Boer and Dorper sheep. By cross-breeding these with local breeds, I want to create a line of sheep that thrive in Beitbridges harsh conditions, he said.\n\nThe Dohne Merino sheep is a breed of domestic sheep from South Africa. The breed was started in the late 1930s by the South African Department of Agriculture.\n\nIt was developed by interbreeding Peppin-style Merino ewes and German Mutton Merino rams. The Dohne Merino is a dual-purpose breed providing meat and fine wool production.\n\nMr Mudau also practices rotational grazing to prevent overgrazing and ensures year-round fodder availability by planting drought-resistant lucerne and sorghum. He recently installed a solar-powered borehole to ensure his livestock always have access to clean water.\n\nFarming is about adapting to your environment. You cant fight nature; you must work with it. My ultimate goal is to transform my plot into a hub for sharing knowledge on animal husbandry, said Mr Mudau.\n\nHe supplies lamb to local markets and supermarkets in Beitbridge.\n\nAs a long-term goal, I want to explore value-added products like sheep milk, cheese and organic fertilizer from manure. My dream is to see Beitbridge recognised as a hub for high-quality livestock farming, said Mr Mudau.\n\nSuccessive droughts linked to the effects of climate change in the last decade have brought agony and misery to most communal farmers across the Matabeleland region, especially Beitbridge, where crop production can only do well under irrigation-based farming.\n\nBeitbridge falls under Agriculture Natural Region five and the Meteorological Services Region three, respectively. In recent years, the district has received less than 350mm to 450mm needed to sustain the summer cropping season for both livestock and crops to do well.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/aweo.jpg",
            "description": "Chronicle Writer Beitbridge farmer Mr Phumudzo Mudau (32) has turned his passion for sheep farming into a thriving enterprise and now eyeing investing in high-quality Boer and Dorper sheep breeds, known for their resilience and meat quality. When he was only 16, Mr Mudau started reading a lot of books and other material related to […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        },
        {
            "title": "Bosso vice-chairman seeks re-election",
            "url": "https://www.chronicle.co.zw/bosso-vice-chairman-seeks-re-election/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS vice-chairman Fiso Siziba, will seek re-election at the clubs elections set for February 2.\n\nSiziba, whose present term expires at the end of this month, has already engaged leaders of supporters chapters informing them about his quest, citing his experience and the need for leadership stability as key reasons for his decision.\n\nMy term officially lapses at the end of January 2025. You trusted and tasked me to be part of a leadership team at our esteemed club. It hasnt been all rosy or smooth sailing, yet it would be a lie to say it was always uphill. What is a fact is that the past three years have exposed me more to the demands of the club and made me wiser even, said Siziba.\n\nHe emphasised the importance of continuity in leadership in ensuring the club progresses.\n\nThe institution is entering a critical time, where leadership stability should be the rallying call. The leadership structure at Highlanders provides for a non-individual band but promotes teamwork. I believe I have learnt and adapted to the system and believe continuity guarantees the much-needed stability, said Siziba.\n\nThe elections for the office bearers are set to take place at the Highlanders clubhouse, with aspiring candidates required to obtain nomination forms from the club office by January 18.\n\nHighlanders Football Clubs Clubhouse\n\nOnly two positions are being voted for  the vice chairman and treasurer.\n\nA refundable fee of US$200 is payable and is only refunded if the candidate polls more than 10 percent of the total votes cast.\n\nThe outcome of the elections will be closely watched, as the club seeks to navigate the challenges of the Premier Soccer League and build on its rich history and tradition.\n\nAs Siziba hopes to convince the clubs members to give him another term, one thing is clear  the future of the club hangs in the choice of leadership. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/vcvxgdzxcv.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS vice-chairman Fiso Siziba, will seek re-election at the club’s elections set for February 2. Siziba, whose present term expires at the end of this month, has already engaged leaders of supporters’ chapters informing them about his quest, citing his experience and the need for leadership stability as key reasons for his decision. […]",
            "time": "06:38",
            "date": "08 Jan 2025"
        }
    ]
}