{
    "news": [
        {
            "title": "Three more mbanje dealers caged for 4 years",
            "url": "https://www.chronicle.co.zw/three-more-mbanje-dealers-caged-for-4-years/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHREE more drug peddlers who were on Friday arrested with a contraband of mbanje in Beitbridge, have been jailed for an effective four years by the Beitbridge magistrate court.\n\nThe three, Primrose Madhume (31) [female] , Sharon Nyadzayo (29) [female] and Takudzwa Malimi (20) [male] were intercepted aboard local intercity bus at a Beitbridge service station in connection with unlawful possession of eight cobs of dagga.\n\nThe contraband was found stashed inside gas stoves.\n\nMadhume and her accomplices were convicted on their own plea of guilty to contravening a section of the dangerous drugs act, when they appeared before Miss Annia Chimweta on Saturday.\n\nThey were left with four years effective in jail when Miss Chimweta set aside two years of their six years term for five years.\n\nAppearing for the State, Miss Esnath Vengedza said on April 25, the trio boarded a bus at the Engen service station bus stop.\n\nThey had luggage including four boxes of two plate gas stoves where they had hid the mbanje, two satchels, two plastic bags and a blanket packed in a plastic bag.\n\nLater that day , detectives from the CID Drugs and Narcotics Beitbridge received information about the trios mission.\n\nThe detectives swiftly reacted and found the accused persons in the bus with their luggage and ordered them to disembark with their goods.\n\nMadhume and her accomplices had their luggage searched in their presence leading to the discovery of the dagga that had been concealed in the gas stoves.\n\nThe dagga weighing 11,7kgs and worth Us$1,173-40 was in turn seized by the police who also arrested them.\n\nGovernment has since established a special team to deal with drug peddlers and smugglers at the Beitbridge border post.\n\nThis follows a surge in cases of smuggling of mostly mbanje and prohibited cough syrup among them broinclear and benylin that is being used as drugs by many citizens.\n\nIndications are that the mbanje is finding its way to mainly high density suburbs in urban settlements in the country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/courthammer-270x270.jpg",
            "description": "  Thupeyo Muleya, Beitbridge Bureau THREE more drug peddlers who were on Friday arrested with a contraband of mbanje in Beitbridge, have been jailed for an effective four years by the Beitbridge magistrate court. The three, Primrose Madhume (31) [female] , Sharon Nyadzayo (29) [female] and Takudzwa Malimi (20) [male] were intercepted aboard local intercity […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Tsholotsho woman killed by buffalo",
            "url": "https://www.chronicle.co.zw/tsholotsho-woman-killed-by-buffalo/",
            "content": "Mkhululi Ncube[emailprotected]\n\nA 55-YEAR-OLD woman from Tsholotsho in Matabeleland North Province was killed by a buffalo last Tuesday while on her way to her field, as cases of human-wildlife conflict continue to affect rural communities.The woman, Mrs Gladys Nkomo (ne Ndebele), of Mpanidziba Village in Ward 2 was attacked around 5 PM when she encountered the animal hidden in a thicket.\n\nLocal ward councillor Sehlule Mathema, confirmed the tragic incident.The buffalo attacked her and left her with a swollen neck. Villagers found one of her tennis shoes stuck in a tree, while her unconscious body was discovered some distance away from the scene, said Cllr Mathema.\n\nInitially, family members thought she had been attacked by goblins and tried traditional remedies, but sadly, she passed away at home around 7PMCllr Mathema said this was the first fatal wildlife attack in the area in a long time, raising concerns among villagers.Mrs Nkomo is set to be buried tomorrow, as the family was still awaiting the arrival of her husband, who is based in South Africa.\n\nTsholotsho Rural District Council chief Executive officer, Mr Nkululeko Sibanda, said the buffalo was tracked and killed on Friday following the incident.He urged villagers to immediately report any sightings of wild animals to authorities to prevent further tragedies.\n\nIt is an unfortunate incident and as a council, we are covering all funeral expenses. We urge our communities never to provoke or attempt to chase away wild animals, said Mr Sibanda.Our parks teams are reporting an increasing number of animals moving from national parks into human settlements.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ddewed.jpg",
            "description": "Mkhululi Ncube themkhust@gmail.com A 55-YEAR-OLD woman from Tsholotsho in Matabeleland North Province was killed by a buffalo last Tuesday while on her way to her field, as cases of human-wildlife conflict continue to affect rural communities. The woman, Mrs Gladys Nkomo (née Ndebele), of Mpanidziba Village in Ward 2 was attacked around 5 PM when […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Social media as a catalyst for digital disinformation and electioneering in Zimbabwe",
            "url": "https://www.chronicle.co.zw/social-media-as-a-catalyst-for-digital-disinformation-and-electioneering-in-zimbabwe/",
            "content": "Duduzile Lupahla and Annita Mukahiwa\n\nIn the digital age, social media has become a double-edged sword, offering unprecedented opportunities for communication and information sharing at any given time while serving as a fertile ground for the spread of disinformation at the same time.\n\nIn Zimbabwe, social media has also emerged as a powerful tool for shaping public opinion and influencing election outcomes. However, its role as a catalyst for digital disinformation has raised serious concerns about the integrity of the democratic process.\n\nOver the past decade, Zimbabwe has witnessed a significant increase in internet penetration and social media usage. Platforms such as Facebook, Twitter, WhatsApp, YouTube and TikTok have become integral to the daily lives of millions of Zimbabweans. According to recent statistics, over 60% of the population now has access to the internet, with a substantial portion of users relying on social media for news and information. This digital revolution has transformed the way political information is disseminated and consumed. Political parties, activists, and ordinary citizens alike have embraced social media as a means of engaging with the electorate, mobilizing support, and holding leaders accountable. However, the same platforms that empower citizens have also been weaponized to spread false information, manipulate public opinion, and undermine trust in democratic institutions.\n\nDisinformation, defined as the deliberate spread of false or misleading information, has become a prevalent issue in Zimbabwes digital landscape. During election cycles, social media platforms are flooded with fabricated stories, doctored images, and misleading videos designed to sway voters in favour of or against particular candidates or political parties. These campaigns are often orchestrated by politically motivated actors, including foreign entities seeking to influence Zimbabwes political trajectory. One of the most notorious examples of digital disinformation in Zimbabwe occurred during the 2018 general elections.\n\nIn the lead-up to the vote, social media was overflowing with false claims about the health of one leading candidate. These narratives, amplified by fake accounts, created an atmosphere of fear and uncertainty. Ahead of the 2023 elections, disinformation campaigns targeted key issues such as the economy, corruption, and national security. For instance, the alleged involvement of political leaders in illicit activities has been widely circulated on social media. These narratives are often designed to delegitimise political opponents.\n\nThe spread of digital disinformation in Zimbabwe is not a random phenomenon but a coordinated effort. Political actors have accused each other of using social media to spread falsehoods. Foreign actors, particularly those with vested interests in Zimbabwes natural resources and geopolitical positioning, have also played a role in shaping the countrys digital information ecosystem.\n\nThe spread of digital disinformation poses a significant threat to the integrity of Zimbabwes electoral process. By distorting public discourse and eroding trust in credible sources of information, disinformation undermines the ability of citizens to make informed decisions at the ballot box. This, in turn, weakens the legitimacy of election outcomes and worsens political instability. Moreover, the spread of false information often incites violence and social unrest. Disinformation campaigns have been linked to incidents of intimidation, harassment, and even physical violence against perceived opponents. This not only undermines the democratic process but also threatens the safety and well-being of citizens.\n\nTo effectively tackle this issue, the government must prioritise the development of policies and legislation that promote transparency and accountability in the digital space. This includes regulating the activities of social media platforms, holding perpetrators of disinformation accountable, and safeguarding freedom of expression. Civil society organisations and media outlets also have a critical role to play in countering disinformation. Additionally, technology companies must take responsibility for curbing the spread of false information on their platforms by investing in advanced detection algorithms and collaborating with local stakeholders.\n\nAs Zimbabwe prepares for future elections, the role of social media in shaping political outcomes cannot be ignored. While the platform offers immense potential for fostering democratic engagement, its misuse as a tool for disinformation poses a grave threat to the countrys democratic aspirations. To safeguard the integrity of the electoral process, it is imperative that all stakeholders work together to create a digital environment that prioritises truth, transparency, and accountability.\n\nDuduzile Lupahla and Annita Mukahiwa are students at Africa University. Follow them on Twitter and Instagram\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/pofd-680x360.jpg",
            "description": "Duduzile Lupahla and Annita Mukahiwa In the digital age, social media has become a double-edged sword, offering unprecedented opportunities for communication and information sharing at any given time while serving as a fertile ground for the spread of disinformation at the same time. In Zimbabwe, social media has also emerged as a powerful tool for […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Chaos as Kwekwe Queens refuse to play on substandard pitch",
            "url": "https://www.chronicle.co.zw/chaos-as-kwekwe-queens-refuse-to-play-on-substandard-pitch/",
            "content": "Media Mpofu\n\nKWEKWE United refused to fulfil their away fixture to Herentals in the Zimbabwe Womens Premier Soccer League because of a poor field in Harare on Saturday.The pitch with overgrown grass was deemed unplayable.\n\nInitially the match was set for National Sports Stadium B Arena and was shifted to Tomlinson Depot where Kwekwe United Queens refused to play because of unplayable surface, no proper goal nets and pitch markings.The league management on Monday said they were waiting for the reports from officials and clubs. They vowed that it would be dealt within the confines of the league rules and regulations.\n\nThe Zimbabwe Women Premier Soccer League regrets to advise its stakeholders that the ZWPSL match between Herentals Queens and Kwekwe United Queens which was scheduled to be played today (Saturday) at National Sports Stadium B Arena did not take place.\n\nZimbabwe Women Premier Soccer League awaits an official match report on the matter, after which the matter will be dealt with according to the ZPWSL rules and regulations. Once all the reports are in place, we promise to issue a detailed and informed statement, wrote the association in a press release.\n\nMatch venues continue to be lower divisions challenges with even Division One clubs playing at community grounds and schools without dressing rooms.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/htyt.jpg",
            "description": "Media Mpofu KWEKWE United refused to fulfil their away fixture to Herentals in the Zimbabwe Women’s Premier Soccer League because of a poor field in Harare on Saturday. The pitch with overgrown grass was deemed unplayable. Initially the match was set for National Sports Stadium B Arena and was shifted to Tomlinson Depot where Kwekwe […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "British Council, City of Bulawayo artistic collaboration on the cards",
            "url": "https://www.chronicle.co.zw/british-council-city-of-bulawayo-artistic-collaboration-on-the-cards/",
            "content": "Mbulelo MpofuZimpapers Arts and Entertainment Hub\n\nTHE British Council country director for Zimbabwe, Dr Lloyd Anderson, highlighted the British Councils commitment to promoting arts and culture as key drivers of sustainable development, particularly within the creative economy on Friday at the National Gallery of Zimbabwe (NGZ) in Bulawayo.\n\nHe spoke at the second edition of the Bulawayo Creative Showcase, an event organised by the British Council and the US Embassy in Zimbabwe.\n\nDr Anderson hinted at the British Council and the City of Bulawayo discussing ways to formulate a Creative Economy Strategy to help creative entrepreneurs thrive.I have been here (Zimbabwe) for a short time and lately, I have been in conversation with the City fathers with regards to a formulation of a creative economy strategy, he said.\n\nDr Andersons utterances are consistent with the British Councils commitment to advance the creative economy not only in Zimbabwe as a whole but also Bulawayo as evidenced in it curating initiatives like the Creative Economy Week and the Magitare Confluence, which have been pathways to supporting local creatives, building sustainable growth, and promoting collaboration within the creative sector.\n\nThe announcement came at a timely juncture when the creative sector has been reeling, accusing the City of Bulawayo of stifling its growth.\n\nGiven the accusations of stifling creative growth, a joint strategy can help BCC demonstrate its commitment to nurturing the creative sector, showcasing its willingness to listen and adapt to the needs of creatives.\n\nThe City of Bulawayos Mayor, Councillor David Coltart said, The proposal to forge a partnership between BCC and the British Council is critically important. I have only had a very brief discussion with Dr Anderson and have not yet been briefed on the detail of the proposal. I met him at the UK Embassy opening reception for ZITF but it was very brief.\n\nBulawayo Mayor, Councillor David Coltart\n\nA well-crafted strategy can highlight the creative sectors role in driving economic growth, creating opportunities for networking, and contributing to the citys economic development.\n\nThose in the Creative and Cultural Industries (CCIs) are waiting in anticipation of what is to come from these negotiations.\n\nThe second Bulawayo Creative Showcase saw the following artistes perfroming; Asaph Afrika, Brintz, Noluntu J, Novuyo Seagirl, Kyla Blac, Kereng, Lemmzy Beats, Indigo Saint, MJ Sings, and Charles Mahlaba.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dr-680x360.jpg",
            "description": "Mbulelo Mpofu Zimpapers Arts and Entertainment Hub THE British Council country director for Zimbabwe, Dr Lloyd Anderson, highlighted the British Council’s commitment to promoting arts and culture as key drivers of sustainable development, particularly within the creative economy on Friday at the National Gallery of Zimbabwe (NGZ) in Bulawayo. He spoke at the second edition […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Bangladesh claw back as Zimbabwe collapse with the bat",
            "url": "https://www.chronicle.co.zw/bangladesh-claw-back-as-zimbabwe-collapse-with-the-bat/",
            "content": "Brandon Moyo,Zimpapers Sports Hub\n\nZIMBABWE blew up an early advantage on the first day of the second Test against Bangladesh, finishing the day on 227/9.\n\nThe Chevrons started the third session of the day looking brightly set on 161/2 having lost both their openers in the morning session and going without losing a wicket in the second session.\n\nHowever, the Chevrons collapsed after Tea, losing seven wickets for just 66 runs in 34 overs, making it Bangladeshs session.\n\nThe day started with Craig Ervine winning the toss and electing to bat first while also making two changes to the team that won the Sylhet Test last week. Tafadzwa Tsiga replaced Nyasha Mayavo while Vincent Masekesa was handed his debut, replacing Victor Nyauchi.\n\nBrain Bennett was the first to fall in the 11th over, caught behind for 21 runs off 33 balls before his opening partner, Ben Curran followed in the 19th over, also for 21 runs off, leaving Zimbabwe on 72/2.\n\nSean Williams and Nick Welch would go on to swing the game into Zimbabwes favour again with an unbeaten 90-run third wicket partnership. Welch retired hurt on 54, his second Test half century.\n\nWilliams top scored for the Chevrons with his fifth Test half century, falling for 67 runs off 166 balls, while Welch didnt add anymore runs when he came back to bat, bowled for 54 runs off 133 deliveries.\n\nTaijul Islam starred with the ball for the Tigers, closing with figures of 5/60 in 27 overs while Nayeem Hasan took 2/42 in 20 overs. Tanzim Hasan Sakib took the other wicket that fell.\n\nPlay resumes at 06.00 tomorrow with Tsiga (18) and Blessing Muzarabani (two) in the middle for the Chevrons.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/williams-680x380.jpg",
            "description": "  Brandon Moyo,Zimpapers Sports Hub ZIMBABWE blew up an early advantage on the first day of the second Test against Bangladesh, finishing the day on 227/9. The Chevrons started the third session of the day looking brightly set on 161/2 having lost both their openers in the morning session and going without losing a wicket […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "ICZ launches toll-free call centre for emergency insurance services",
            "url": "https://www.chronicle.co.zw/icz-launches-toll-free-call-centre-for-emergency-insurance-services/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Insurance Council of Zimbabwe (ICZ) has introduced a call centre service, which is meant to provide quick responses to emergencies, with road accidents being the major concern.\n\nIn a statement, the ICZ said the call centre service is freely accessible through the 591 toll-free number from any network nationwide. The costs that callers will incur are for emergency services provided where there is no active insurance cover.\n\nThe service points the call centre will address are: timely response to emergencies, mainly road traffic accidents, and linking callers to required services, which include ambulances for medical attention, Civil Protection Unit intervention, fire brigade, police, and funeral services in the unfortunate event of death, reads the statement.\n\nIt also guides road accident victims to easily access insurance compensation, assists policyholders through the process of lodging a claim, from putting together the required documentation to submission at the correct office.\n\nThe call centre also provides insurance information to callers, including insurance services/product knowledge, policy management guidance, lodging complaints, and anonymous tip-offs.\n\nFunded by short-term insurance companies, this is a value-adding service for policyholders, road accident victims, and the general public who have faced difficulties in accessing insurance services and compensation or lack knowledge about insurance products and claims processes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/icz.jpg",
            "description": "Sikhulekelani Moyo, sikhu.moyo@chronile.co.zw THE Insurance Council of Zimbabwe (ICZ) has introduced a call centre service, which is meant to provide quick responses to emergencies, with road accidents being the major concern. In a statement, the ICZ said the call centre service is freely accessible through the 591 toll-free number from any network nationwide. The costs […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Matopos Research Institute commended for innovative insects for stock feed protein",
            "url": "https://www.chronicle.co.zw/matopos-research-institute-commended-for-innovative-insects-for-stock-feed-protein/",
            "content": "Judith PhiriBusiness Reporter\n\nMATOPOS Research Institute has been commended for its innovation through the use of insects as alternative protein source (mealworms) as well as using locally available resources such mopane and acacia leaves to formulate feed for livestock.As the demand for animal feed continues to rise, more research is being carried out to find alternative feed due to limited availability of natural resources, continued climate change and food-feed-fuel competition.\n\nSo far, the mealworm starter, grower and finisher diets were registered as feed for poultry in Zimbabwe under Farm Feeds. Another ground-breaking innovation they developed a multi-nutrient block for ruminant animals the frass blocks are being given to goats and sheep.Speaking at a recent familiarisation tour to gain an appreciation of the specialised institutes innovation, Ministry of\n\nLands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri commended the work being done by scientists.What we have seen here for the feed trials and all the experiments that they are doing, it is very fantastic. This is the base of our agriculture, from here we know that we can have new feed formulations and we can then commercialise from this, he said.\n\nOf course some will fail at the commercialisation stage so not all this will go to commercialisation but some will succeed and that is the nature of science. When something succeeds from science we know that its tried and tested also proven and we will have confidence on it.He said such feed formulations were critical considering periods such as the El Nio-induced drought where most of the livestock was lost due to lack of feed.\n\nMatopos Research Institute principal research officer, Ms Primrose Nkomboni who is a nutritionist said it was their mandate to formulate feed using locally available resources.\n\nThese are resources the farmers can easily access. When we identify the resources we take them to the laboratory for testing. We would be testing for crude protein, fibre and other nutrients, after that we then formulate our feed for example lucerne, mopane or black soldier fly based pallets.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/blurs-680x360.jpg",
            "description": "Judith Phiri Business Reporter MATOPOS Research Institute has been commended for its innovation through the use of insects as alternative protein source (mealworms) as well as using locally available resources such mopane and acacia leaves to formulate feed for livestock. As the demand for animal feed continues to rise, more research is being carried out […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "WATCH: Taking Physiotherapy to the world",
            "url": "https://www.chronicle.co.zw/watch-taking-physiotherapy-to-the-world-video-pics/",
            "content": "Peter Matika[emailprotected]\n\nAward-winning physiotherapist Precious Madzimbe is thrilled to have had the opportunity to showcase the services offered at his clinic in Bulawayo during the recently concluded Zimbabwe International Trade Fair.Madzimbe and his team have been dedicated to informing and educating the public about various physical medical conditions that are often misunderstood.\n\nThe event, held under the theme Industrialisation: Crafting an Integrated Economic Landscape, attracted a vibrant mix of exhibitors from across the nation and beyond, and the clinic is over the moon to have been part of it.This years event was particularly thrilling for the clinic, as it marked its first time showcasing its services to a wider audience.\n\nKudzai Kwahla, a physiotherapist at Madzimbe and Tsiga Physiotherapy Clinic, expressed enthusiasm.We are overjoyed to be part of this prestigious event. It is a fantastic opportunity for us to not only showcase what we do but also to educate people about various conditions and disabilities that affect so many lives, she said.The booth was filled with engaging demonstrations, informative pamphlets, and a warm team eager to connect.\n\nThe clinic aims to break down barriers of understanding around physiotherapy and its vital role in recovery and rehabilitation. Many people are unaware of the benefits of physiotherapy. Whether its recovering from an injury, managing chronic pain, or improving mobility, we want to spread the word about how we can help, said Kwahla.\n\nWhile ZITF typically highlights a variety of sectors, Kwahla said their presence underscored the importance of the often-overlooked field of physical health.By sharing their expertise, they hope to spark conversations that foster greater acceptance and understanding of physiotherapy as an essential component of healthcare.\n\nWe are excited to meet new faces and share our passion for helping others. Lets start a conversation about health and wellness. We are ready to embrace this opportunity at the ZITF  a chance not just to showcase our services, but to ignite awareness and support for a healthier community, she said.Specialist Paediatric Physiotherapist Precious Madzimbe, who co-runs the clinic and possesses over a decade of clinical and academic experience, said exhibiting at ZITF was truly inspiring and awe-inspiring, adding that it is a chance to create new dimensions in the field while also creating new opportunities for those in the field.\n\nWe are truly inspired and joyed at the opportunity to be exhibiting at the ZITF. This assists us as medical experts to interact with the public to show and educate them on various conditions. Some of which are associated with witchcraft, he said.\n\nMadzimbe said his services and academic engagements across Africa, including his current research work, reflect the fruit of independence and the continuing transformation of Zimbabwes health sector.He said these platforms have allowed him to contribute not only as a clinician but also as a researcher, mentor, and advocate for inclusive, culturally relevant rehabilitation.\n\nSpecialised services such as physiotherapy are unknown in rural areas. Children with congenital conditions like cerebral palsy or clubfoot were often hidden from society, their needs unmet and their dignity disregarded, Madzimbe said.Rehabilitation, as I have stated in my previous engagements, is no longer a foreign luxury; it has become a national priority. I am a proud product of that transformation. Allowing health services to be exhibited shows that we are in the right direction.\n\nWe are no longer limited to reactive care; we are shaping futures through preventative and developmental health. We are proud to see our Government leading the way and allowing us to practice, said Madzimbe.He noted that people living with disabilities in Zimbabwe have long suffered under the weight of stigma. But through community education, inclusive policy, and the mobilisation of local leaders, this narrative is changing.He said exhibiting at ZITF facilitated international collaborations.\n\nI have contributed to the development of Zimbabwe-specific paediatric physiotherapy guidelines and educational materials now in use at training institutions and rehabilitation departments across the country, he said.Most recently, Madzimbe authored a book on prostate cancer and family support systems in Africa, reaffirming that healing must engage the emotional, spiritual, and psychological dimensions of care.\n\nOne of the greatest honours of such events is to be given the chance and ability to teach and be taught. I have had the privilege of shaping the future of physiotherapy through my engagements at a local university and nationwide workshops, and now I can engage the public, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hospital-680x360.jpg",
            "description": "Peter Matika peter.matika@chronicle.co.zw Award-winning physiotherapist Precious Madzimbe is thrilled to have had the opportunity to showcase the services offered at his clinic in Bulawayo during the recently concluded Zimbabwe International Trade Fair. Madzimbe and his team have been dedicated to informing and educating the public about various physical medical conditions that are often misunderstood. The […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        },
        {
            "title": "Munjanji-Karis stars as Zambezi Eagles register first win",
            "url": "https://www.chronicle.co.zw/munjanji-karis-stars-as-zambezi-eagles-register-first-win/",
            "content": "Media Mpofu\n\nLESIBANI Munjanji-Karis was voted Player of the Match as she helped the Zambezi Eagles, Zimbabwes netball representatives in the prestigious South African Telkom League in Potchefstroom, North West Province in South Africa on Monday morning.\n\nThe Eagles beat Limpopo Baobabs 56-48 with Munjanji-Karis outstanding in her role as a wing defender.For her efforts, she walked away with R1000.\n\nIt was the Zimbabwe teams first win in three matches having lost their opening matches 51-46 to North West Flames and the second 61-40 to Golden Fireballs on Sunday.\n\nZimbabwe are using these championships to widen selection base ahead of the World Cup Qualifiers later in the year.Australia will play host to the World Cup finals in 2027.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/netball-680x360.jpg",
            "description": "Media Mpofu LESIBANI Munjanji-Karis was voted Player of the Match as she helped the Zambezi Eagles, Zimbabwe’s netball representatives in the prestigious South African Telkom League in Potchefstroom, North West Province in South Africa on Monday morning. The Eagles beat Limpopo Baobabs 56-48 with Munjanji-Karis outstanding in her role as a wing defender. For her […]",
            "time": "18:38",
            "date": "28 Apr 2025"
        }
    ]
}