{
    "news": [
        {
            "title": "Zimbabwe, China turn agreements into action",
            "url": "https://www.chronicle.co.zw/zimbabwe-china-turn-agreements-into-action/",
            "content": "Zvamaida MurwiraZIMBABWE and China have commenced the implementation of projects agreed upon last year by President Mnangagwa and President Xi Jinping during the state visit to the Asian nation, signifying a deepening of the two countries bilateral relations.\n\nPresident Mnangagwa visited China in September last year, where he also attended the Forum on China-Africa Co-operation (Focac), resulting in the signing of 17 Legal Instruments of Co-operation, including 14 Memoranda of Understanding (MoUs) and three Letters of Exchange.\n\nFurthermore, the Chinese leadership committed to broadening and deepening collaboration with Zimbabwe across sectors such as investment, trade, infrastructure development, mineral extraction, renewable energy, and digital economy growth.\n\nPresident Mnangagwa meets the head of the Chinese delegation and the Executive Vice Governor of Jiangsu Province, Ma Xin, who paid a courtesy call on him at State House in Harare yesterday.  Picture: Believe Nyakudjara\n\nYesterday, President Mnangagwa hosted a Chinese delegation led by the Executive Vice Governor of Jiangsu Province, Mr Ma Xin, one of the provinces President Mnangagwa visited during his State visit to China. The discussions centred on a range of issues that mutually affect the two countries.\n\nBriefing journalists on behalf of Vice Governor Mr Ma, Head of Chancery in the Chinese Embassy to Zimbabwe, Mr Cheng Yan, said the delegation came to commit themselves to the agreements made by the two leaders.\n\nIt is our great honour to have the delegation pay a courtesy call on His Excellency President Emmerson Mnangagwa. As we all know, we received His Excellency President Mnangagwa last year when he made a very important State visit to China and attended the Focac Summit.\n\nSo, this visit by the provincial delegation is a follow-up action to implement the important consensus reached by the two Heads of State. The delegation is coming to commit itself to strengthen and deepen co-operation with Zimbabwe, especially in areas such as infrastructure, biomedicine, and solar power supply, which is a very strong area of Jiangsu province, said Mr Cheng.\n\nMr Cheng noted that Jiangsu province is the second biggest provincial economy in China after Guangdong. He said there were good prospects of expanding co-operation in many areas for the benefit of both countries.\n\nSo, we believe there is a lot of potential to deepen our collaboration and co-operation with Zimbabwe. And we are looking forward to more and more detailed fruits between Jiangsu province and Zimbabwe-aligned ministries and local government. This kind of co-operation has very good prospects, Mr Cheng said.\n\nDuring his visit to China, President Mnangagwa met the Communist Party of China (CPC) Secretary for Jiangsu Province, Xin Changxing, and attended other business engagements. He also visited the city of Shenzhen in Guangdong Province, another economic hub of technology.\n\nPresident Mnangagwa also went to Hunan Province, where he visited the home of Chinese founding father Mao Zedong and toured the factory of the Sany Group, a world leader in heavy construction machinery. He later met Chinese Communist Party Committee Secretary of Hunan, Cde Shen Xiaoming. The President concluded his visit to Hunan by visiting a model rural village.\n\nDuring the State visit, President Mnangagwa also attended a high-level meeting on State Government and made a presentation in which he outlined his vision of an independent development path for Africa and the Global South, free from undue foreign influence and called for the removal of sanctions on Zimbabwe.\n\nHe also attended the 8th Conference of Chinese and African Entrepreneurs, where he delivered a speech promoting the countrys vast business opportunities.\n\nIn his remarks, President Xi said China stands ready to co-operate with Zimbabwe. Under President Mnangagwas leadership, Zimbabwe has witnessed a significant surge in trade with China. Notably, Chinese private sector investments in Zimbabwe have grown exponentially from US$445,9 million in 2019 to a substantial US$3,4 billion in 2023, representing a remarkable seven-fold increase.\n\nIn recent years, China has invested heavily in Zimbabwe, committing over US$2,2 billion to multi-billion dollar projects, primarily in mining and manufacturing.\n\nThe investments include the US$1,5 billion Manhize Dinson Iron and Steel project, the Afrochine Ferrochrome Smelters, the Sinomine Resources, Zhejiang Huayon Cobalt and Chengxin Lithium Group, among others.\n\nTo date, more than 472 investment licences have been issued to Chinese companies, with more in the pipeline.\n\nChinas support has solidified its position as Zimbabwes all-weather friend, with bilateral ties yielding significant benefits that also include concessional funding for projects in energy, telecommunications, agriculture, defence and health.\n\nThe construction of Hwange Thermal Power Station Units 7 and 8 and Kariba South Hydro Power are some of the signature projects that have cemented co-operation between the two countries.\n\nThere is also Zimbabwes magnificent new Parliament building constructed through a Chinese grant in Mount Hampden.\n\nYesterdays event was attended by Foreign Affairs and International Trade Minister Professor Amon Murwira, Transport and Infrastructural Development Deputy Minister Joshua Sacco, and other senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/xzcvvzfbvzbvx.jpg",
            "description": "Zvamaida Murwira ZIMBABWE and China have commenced the implementation of projects agreed upon last year by President Mnangagwa and President Xi Jinping during the state visit to the Asian nation, signifying a deepening of the two countries’ bilateral relations. President Mnangagwa visited China in September last year, where he also attended the Forum on China-Africa […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Steel production  cuts import reliance",
            "url": "https://www.chronicle.co.zw/steel-production-cuts-import-reliance/",
            "content": "Patrick Chitumba,[emailprotected]A major stride in Zimbabwes import substitution drive has been realised with the start of extensive finished steel production at the Dinson Iron and Steel Company (Disco) plant in Manhize, Midlands Province; a development that holds the promise of significantly propelling the nations industrial transformation agenda forward.\n\nThe successful implementation of the multi-million-dollar project reflects the positive impact of the Second Republics pro-investment policies and promises far-reaching benefits for the domestic economy and the region at large.\n\nThe revival of the iron and steel industry marks a turning point for Zimbabwe, which has been spending an estimated US$1 billion annually on steel imports. With this development, the nation can narrow its trade deficit and enhance export earnings.\n\nFollowing the completion of preliminary test runs and the production of steel billets, Disco is now manufacturing ready-to-use finished steel products, including deformed bars in various sizes.\n\nThe plant has a daily production capacity of approximately 300 tonnes, with an ambitious annual target of 600 000 tonnes.\n\nAt this scale, Zimbabwe will not only meet domestic demand but also support infrastructure development, contributing to economic growth and industrialisation.\n\nWe are now producing 16mm, 20mm and 25mm deformed bars, which are final products suitable for construction purposes. Currently, we are producing about 300 tonnes of deformed bars per day, with an annual target of 600 000 tonnes, said Disco public relations manager, Mr Joseph Shoko.\n\nMr Shoko expressed confidence that local demand will be adequately met, stressing that their steel products will be more affordable than imports.\n\nZimbabwe has been importing nearly all its steel, but soon we will be substituting those imports with our local production. Dinson Steels operations will contribute to increased steel production capacity in Zimbabwe, reducing reliance on imports and enhancing self-sufficiency, he said.\n\nThe plant has already created about 2 000 jobs for locals, with additional employment opportunities expected as production ramps up.\n\nThe steel production facility is creating employment opportunities, stimulating economic growth, and contributing to the development of the manufacturing sector. Steel production will also support infrastructure projects, such as construction, transportation, and energy, driving economic progress, said Mr Shoko.\n\nThe Manhize plant is regarded as one of Africas largest integrated steelworks. It is owned by Disco, one of the three local subsidiaries of Tsingshan Holdings Group Limited, a leading global stainless steel producer.\n\nTsingshan also owns Dinson Colliery in Hwange and the Afrochine Smelting ferrochrome plant in Selous.\n\nMr Shoko described the steel production breakthrough as a game-changer for economic diversification, reducing reliance on traditional sectors like agriculture and mining. He also highlighted the role of domestic steel production in advancing economic development, industrialisation and infrastructure growth.\n\nTo support its operations, Disco has established a 50-megawatt power plant, though it is not yet connected to the national grid.\n\nSteel manufacturing requires substantial power. At the moment, our usage is around 24 megawatts. The surplus could be directed into the national grid once we fulfil the necessary requirements, said Mr Shoko.\n\nIn line with global sustainability efforts, Disco plans to develop a wind power station to complement its operations.\n\nWe have identified a suitable site around the Manhize Range, which has already been surveyed. The next step is securing funding, he said.\n\nAddressing environmental concerns, Mr Shoko highlighted the companys commitment to land reclamation and fostering smooth co-existence with local communities.\n\nWe acknowledge the environmental impact of our operations. As part of our reforestation efforts, we planted 5 000 trees last year in collaboration with the Forestry Commission during National Tree Planting Day, he said.\n\nDisco has also initiated upgrades on the 23km gravel road connecting the plant to the highway, a project expected to be completed in time for the plants commissioning in the first or second quarter of the year.\n\nThe Manhize steel project positions Zimbabwe as a global steel manufacturing hub, with projections indicating the countrys potential to emerge as a powerhouse in the steel and iron industry. What was once a dense forest has transformed into a thriving industrial zone, with modern buildings emerging from the wilderness.\n\nThe mega-investment also includes plans for the creation of a Smart City, named Manhize Town, and a science university, underscoring the transformative impact of the investment.\n\nPresident Mnangagwa, who toured the factory in March last year, was impressed by the progress. Company officials expressed gratitude to the Government for facilitating smooth investments and committed to creating opportunities for locals.\n\nThe plant is expected to generate 3 000 direct jobs in its first phase, with numbers projected to exceed 10 000 in the fourth phase of production.\n\nThe steel plant is set to produce 600 000 tonnes of products in the first phase, rising to 1,2 million tonnes in the second phase, 3,2 million tonnes in the third phase, and ultimately five million tonnes per year in the final phase. This output will earn the country substantial foreign currency.\n\nFuture products include pipes, bolts, nuts, slag, rolled tubes, fences, shafts, wires and bars, among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gwetrgrtewg.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw A major stride in Zimbabwe’s import substitution drive has been realised with the start of extensive finished steel production at the Dinson Iron and Steel Company (Disco) plant in Manhize, Midlands Province; a development that holds the promise of significantly propelling the nation’s industrial transformation agenda forward. The successful implementation of the […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Kokotela madness! Leemckrazy & Crew rock the ‘Ama2k’ crowd",
            "url": "https://www.chronicle.co.zw/kokotela-madness-leemckrazy-crew-rock-the-ama2k-crowd/",
            "content": "Sipepisiwe Moyo,[emailprotected]THE City of Kings came alive on Saturday evening as thousands gathered at the Zimbabwe International Exhibition Centre, for the second edition of the Bulawayo Piano Festival, transforming the venue into a hub for Amapiano enthusiasts from across the country.\n\nThe electrifying event featured an impressive line-up of South African Amapiano heavyweights, including DJ Maphorisa, Scotts Maphuma, Leemckrazy, Uncool Mc and Ricky Lenyora, supported by a remarkable ensemble of local talent such as Kotwane Hikwa, Keezy_am and DJ Sida.\n\nFashion stole the spotlight as stylish revellers made their way into the venue, with boyfriend jeans, bum shorts, tennis skirts, baggy denim and statement tees, setting the tone for the night. Inside, the atmosphere was vibrant  champagne flowed freely in the VIP lounges, complemented by sizzling braai meat as the meal of choice, while cocktails and mocktails kept the general section energised.\n\nThe venue reached full capacity, with the spirited ama2k generation leading the charge, grooving to their favourite Amapiano tracks. Security remained tight and efficient, ensuring a seamless and safe experience for all attendees.\n\nScotts Maphuma\n\nDJ Sida, set the mood with an energetic opening set, followed by DJ Keezy_am, DJ Umlungu Omnyama and DJ Kotwane Hikwa Omnyama, each captivating the crowd with pulsating mixes. A heart-warming highlight of the evening was DJ Umlungu Omnyamas on-stage birthday celebration, with the audience joining in for a lively chorus.\n\nMCs, Mzoe7 and Metty Intombi Emfishane kept the momentum alive, commanding the stage with engaging charisma and seamlessly introducing the headline acts.\n\nWhen the South African stars finally appeared, the crowds energy surged. Fans erupted in excitement as Scotts Maphuma made his entrance, but it was Leemckrazy, who ignited the stage first with his chart-topping hits Kokotela and Jealousy. His strong live vocals and captivating stage presence earned admiration, especially in a genre where lip-syncing is common.\n\nScotts Maphuma, a clear crowd favourite, delivered a dynamic performance that demonstrated his versatility  beginning as a DJ on the decks before transitioning into a medley of his hit tracks, including Shayimoto, Wishi Wishi and Yebo Lapho. In a playful moment, he grabbed a camera mid-set to snap photos of the crowd, much to their delight.\n\nDJ Maphorisa delivered a masterclass in pacing and crowd engagement. He started his set with lesser-known tracks, gradually building momentum before igniting the crowd with his classic banger Bopha, showcasing his Madumane alter ego.\n\nUncool Mc and Ricky Lenyora, making their Zimbabwean debut, left an indelible impression with explosive performances that connected effortlessly with the audience, as if they were seasoned local favourites.\n\nAttendees raved about the event, with Mildred Zhou, who travelled from Harare, commenting: I had the time of my life! I came all the way from Harare for this and it was worth every cent. We got value for money.\n\nMethuseli Mlotshwa expressed his admiration for local performers: Im genuinely amazed by how much talent Bulawayo has. All the DJs and MCs held their own, absolutely impressive.\n\nThe evening highlighted the dominance of South African artistes in Zimbabwes entertainment scene while shining a spotlight on the growing talent among local performers. Organisers revealed that the Piano Festival was merely a teaser for the upcoming Bulawayo Shutdown next weekend, which promises an even more impressive line-up of regional and local stars.\n\nInitially launched in December last year with a focus on local DJs, the Bulawayo Piano Festival has grown into a dynamic platform that celebrates regional Amapiano talent  solidifying the citys rising influence on the music scene.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/CXZBFBVXC.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com THE City of Kings came alive on Saturday evening as thousands gathered at the Zimbabwe International Exhibition Centre, for the second edition of the Bulawayo Piano Festival, transforming the venue into a hub for Amapiano enthusiasts from across the country. The electrifying event featured an impressive line-up of South African Amapiano heavyweights, […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "COMMENT: Government’s decisive action on Victoria Falls Road welcome",
            "url": "https://www.chronicle.co.zw/comment-governments-decisive-action-on-victoria-falls-road-welcome/",
            "content": "THE news that seven additional firms have been engaged to accelerate the rehabilitation of the Bulawayo-Victoria Falls Road, is a development worthy of sincere commendation. For long, this vital artery has languished in a state of disrepair and inconvenienced countless travellers.\n\nThe Governments decisive action to deploy further resources and expertise to the crucial project, show its undoubted commitment to national development.\n\nThe initiative is not merely about fixing potholes; it is a strategic investment with far-reaching benefits for Zimbabwes economic prospects. A well-maintained Bulawayo-Victoria Falls Road is fundamental to several key sectors.\n\nFirstly, it has a huge impact on tourism, a cornerstone of Zimbabwes economy. Victoria Falls, a natural wonder of the world, draws visitors from across the globe. However, the arduous and time-consuming journey along a dilapidated road has undoubtedly deterred some and diminished the overall tourist experience for others. A smooth, efficient transport link will not only make the destination more accessible but will also enhance the appeal of the entire region, encouraging longer stays and increased spending. This, in turn, will stimulate local economies, create employment opportunities and boost the nations foreign currency earnings.\n\nSecondly, the rehabilitation of this road is a significant boon for national development more broadly. Efficient transport infrastructure is the lifeblood of a thriving economy. It facilitates the movement of goods and services, reduces transportation costs and improves connectivity between urban and rural centres. For businesses operating along this corridor, a reliable road network translates to greater efficiency, lower operational expenses and enhanced competitiveness. This will foster economic growth, attract investment and contribute to the overall prosperity of the nation.\n\nFurthermore, the Bulawayo-Victoria Falls Road is a crucial route for cross-border truckers. As a vital link to neighbouring countries like Zambia, the Democratic Republic of Congo and South Africa, its poor condition has undoubtedly created logistical challenges and increased transit times for international trade. A rehabilitated road will streamline cross-border commerce, facilitating smoother trade flows and strengthening Zimbabwes position as a key player in regional trade networks.\n\nThis will enhance the countrys attractiveness as a trading partner and contribute to its economic integration within the Southern African Development Community (SADC).\n\nThe Governments decision to adopt a similar approach to the successful Harare-Beitbridge Road project, assigning specific sections to individual contractors, demonstrates a pragmatic and results-oriented strategy. This distributed model is likely to expedite the rehabilitation process and ensure greater accountability.\n\nWhile the initial delays in commencement are noted, the commitment demonstrated by the deployment of additional firms is a positive sign. It underscores the Governments well-known recognition of the urgency and importance of this project.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/09/Untitled-5-5.jpg",
            "description": "THE news that seven additional firms have been engaged to accelerate the rehabilitation of the Bulawayo-Victoria Falls Road, is a development worthy of sincere commendation. For long, this vital artery has languished in a state of disrepair and inconvenienced countless travellers. The Government’s decisive action to deploy further resources and expertise to the crucial project, […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Jindu slapped with two life sentences",
            "url": "https://www.chronicle.co.zw/jindu-slapped-with-two-life-sentences/",
            "content": "Danisa MasukuDouble murder convict, Rodney Tongai Jindu stood before a Bulawayo High Court Judge yesterday for re-sentencing and broke down as he received two life sentences.\n\nJindu committed the callous murders of his two friends in 2017, for which he was initially sentenced to death. However, following President Mnangagwas abolition of the death penalty last year, a re-sentencing hearing was mandated. For each murder count, he was sentenced to life imprisonment.\n\nHis legal representatives, Bob Sansole and Dixon Abraham, conveyed their clients remorse for the double killings, portraying him as a reformed individual who now dedicated himself to reading the Bible and had turned to religion.\n\nThey argued that Jindu had spent his time in prison assisting fellow inmates with literacy. The lawyers suggested that should he be granted a pardon, he would be willing to offer compensation to the families of the deceased.\n\nRepresenting the State, deputy prosecutor general for the Southern region, Mrs Tariro Rosa Takuva, argued that the accused had committed two murders under severely aggravating circumstances, both of which were premeditated. Mrs Takuva pointed out that the second count involved the murder of Cyprian Kudzurunga during the commission of a robbery.\n\nIn delivering the sentence, Justice Nokuthula Moyo stressed that Jindu had committed the offences in aggravating circumstances by fatally shooting his victims. The Judge also noted his apparent lack of compassion and failure to express remorse, highlighted by his not sending emissaries to apologise to the parents of either deceased. She deemed his courtroom apology an afterthought.\n\nJustice Moyo dismissed Jindus defence that he was under the influence of drugs when he heartlessly murdered his two friends, stating that he did not deserve to be part of society, having begun a life of crime with such extreme acts.\n\nShe further stated that the murders were committed using a dangerous weapon, a firearm, and involved the mutilation of body parts. Shockingly, the whereabouts of these body parts remain unknown. Mrs Takuva described this as the most heinous type of murder committed under aggravating circumstances.\n\nThis publication first reported the chilling details of his cold-blooded murder of his childhood friend, Kudzurunga, a young man of just 28, whose remains he heartlessly buried in a shallow grave on a property in Bulawayos affluent Burnside suburb.\n\nJindu disturbingly confessed to investigators that he murdered Kudzurunga out of fear  the fear of exposure. Kudzurunga, it was alleged, had inadvertently discovered evidence of Jindus ritualistic murder of Mboneli Ncube. In a calculated attempt to conceal his horrific actions, Jindu even sent a deceptive message to Kudzurungas mother, impersonating her son and falsely claiming a sudden departure from the country.\n\nWhile the public was still reeling from the sheer horror of this revelation, Jindu, already a figure of morbid fascination both within Zimbabwe and internationally, committed another atrocity, plunging the nation into further despair. He chillingly recounted to detectives from the Homicide division how a cross-border transporter had approached him, offering a gruesome exchange: US$20 000 or a Toyota Quantum vehicle for the body parts of Mboneli Ncube. This grotesque proposition, he claimed, ignited his desire to murder his friend, Mboneli, a 30-year-old, who lived just four houses away in Bulawayos Glengarry suburb.\n\nShortly thereafter, he delivered Ncubes lifeless body to the transporter, who proceeded to remove the head, hands and both legs, leaving Jindu with the torso. This he placed in a plastic bag, transported on a wheelbarrow to the same plot in Burnside and there, with chilling indifference, burnt and buried the remains in four separate shallow graves, mere metres from Kudzurungas final resting place. The gruesome discovery was swiftly reported to the police, triggering an urgent manhunt that led to Jindus arrest.\n\nWith a disturbing lack of remorse, Jindu led detectives to the scene, where the fragmented remains of Ncube were exhumed. When questioned by Homicide detectives, he confessed to the dismemberment. Following this horrifying revelation, he was brought before the court.\n\nHis initial court appearance in 2018 was marked by macabre drama as he openly confessed to shooting his two friends and the unspeakable act of consuming their flesh. This prompted Justice Moyo to order a psychiatric evaluation by two state doctors to ascertain his mental state under the provisions of the Mental Health Act.\n\nThe accused persons conduct is prima facie bizarre and abnormal. It is for these reasons that the court finds it fit that a mental examination be conducted to rule out any possibility of mental issues. This will allow the court to proceed to try the accused person after having been satisfied that he is mentally stable, ruled Justice Moyo.\n\nFollowing that, armed with a medical report certifying his mental soundness and fitness to stand trial, he returned to court. He appeared before Justice Moyo again, and during his initial trial appearance, he confessed to hiring his two neighbours to dig the graves. He also claimed to have been intoxicated by heroin and methamphetamine, a synthetic stimulant at the time of the murders.\n\nHowever, Justice Moyo ultimately rejected this defence, convicting Jindu on two counts of murder with actual intent, committed under aggravating circumstances. In delivering the sentence, Justice Moyo deemed capital punishment the most fitting and appropriate for Jindus heinous crimes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/XCBVFRVXCXCV.jpg",
            "description": "Danisa Masuku Double murder convict, Rodney Tongai Jindu stood before a Bulawayo High Court Judge yesterday for re-sentencing and broke down as he received two life sentences. Jindu committed the callous murders of his two friends in 2017, for which he was initially sentenced to death. However, following President Mnangagwa’s abolition of the death penalty […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Tredgold fake IDs masterminds nabbed",
            "url": "https://www.chronicle.co.zw/tredgold-fake-ids-masterminds-nabbed/",
            "content": "Sikhumbuzo Moyo, Investigations DeskTWO suspects, Brian Veririzhe and Thamsanqa Moyo, have been arrested for allegedly masterminding a national identity card fraud and forgery scheme at the Umguza Civil Registry Department, housed in the Tredgold Building in Bulawayo.\n\nThe arrests were made on Friday, by officers from the Criminal Investigations Department (CID) following the publication of an expos by the Zimpapers Investigations Desk. Acting on the information, detectives swiftly apprehended the duo.\n\nCriminal Investigations Department (CID)\n\nCID spokesperson, Detective Inspector Rachel Muteweri, confirmed the arrests yesterday.\n\nThe Zimbabwe Republic Police has arrested Brian Veririzhe of Stand 3 Wellington Road, Montrose, Bulawayo, and Thamsanqa Moyo of House Number 63 Derby Road, Bellevue, Bulawayo, for fraud and forgery following a case involving the attempted replacement of an identity document, she said.\n\nAccording to Detective Inspector Muteweri, on January 3, 2025, a woman identified as Buhle Sibanda approached the Tredgold Civil Registry office to replace her lost national identity card. There, she encountered the two suspects, who offered to assist her in obtaining a duplicate.\n\nFollowing their agreement, Brian Veririzhe captured Buhle Sibandas passport-sized photograph using his mobile phone and forwarded it to Thamsanqa Moyo, who printed a counterfeit copy of the national identity document using his computer, said Detective Inspector Muteweri.\n\nAfter producing the forged ID, the trio attempted to present it at the Umguza District Civil Registry office. Veririzhe posed as a civil servant employed under the Companies, Deeds and Intellectual Property Office in Bulawayo and introduced Sibanda as a relative in need of a replacement ID.\n\nHowever, an alert registry officer noticed discrepancies in the document and flagged it as counterfeit. On April 10, 2025, Veririzhe and Moyo were arrested. The case is pending trial.\n\nMeanwhile, we are appealing to the public for information regarding the whereabouts of Buhle Sibanda, who is still at large. The Zimbabwe Republic Police commends the vigilance of Civil Registry officials and urges citizens to report any suspicious activity, Detective Inspector.\n\nFurther investigations revealed that Veririzhe is employed by Dokma Private Limited, a company contracted to digitise operations for the Deeds, Companies and\n\nIntellectual Property Office under the Ministry of Home Affairs and Cultural Heritage.\n\nAlthough the counterfeit document appeared authentic, it raised suspicions due to the photograph, which matched Sibandas attire and makeup on the day of the applicationdespite her claim that the copy had been made from an original document issued in 2019.\n\nBorn in 1995, Sibanda listed her rural home as under Chief Tshabanda in Tsholotsho District. However, authorities confirmed that no such chief exists in the district.\n\nUpon further questioning, she admitted the photo had been taken outside the Tredgold Building earlier that day, and that Veririzhe had charged her US$30 for his illicit services.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/BGGBGBD.jpg",
            "description": "Sikhumbuzo Moyo, Investigations Desk TWO suspects, Brian Veririzhe and Thamsanqa Moyo, have been arrested for allegedly masterminding a national identity card fraud and forgery scheme at the Umguza Civil Registry Department, housed in the Tredgold Building in Bulawayo. The arrests were made on Friday, by officers from the Criminal Investigations Department (CID) following the publication […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Automated plant boosts flour production",
            "url": "https://www.chronicle.co.zw/automated-plant-boosts-flour-production/",
            "content": "Sikhulekelani Moyo,Business Writer\n\nDiversified agro-industrial concern, National Foods Limited (NFL), has said the newly established flour milling plant in Bulawayo has seen an improvement in capacity utilisation from about 200 tonnes to 300 tonnes of wheat milled a day.\n\nNational Foods installed a state-of-the-art US$6,5 million flour milling plant in Bulawayo, an investment that took the company about two years to finalise.\n\nLast week, the Ministry of Industry and Commerce toured the facility during the industry tour, in preparation for the upcoming Zimbabwe International Trade Fair.\n\nWith the plant having run for about a year and a half now, National Foods Southern Region operations executive Mr Ngqabutho Moyo, said their efficiency has also improved, with the plant being fully automated.\n\nThe plant has been running for about a year and a half now, we have found that our efficiencies have greatly improved as compared to what we had with the old plant, said Mr Moyo.\n\nThe capacity of this plant is 300 tonnes of wheat milled per day, so we run it 24 hours, depending on the market size at the moment. The capacity of the silos is 11 000 tonnes of wheat, which translates to about 36 to 40 days of milling.\n\nMr Moyo elaborated that a fully automated plant will reduce human interface, which poses some risks of contamination.\n\nHe said the plant also moves in line with global trends, where the use of automated machinery has become a game changer in improving capacity and efficiency.\n\nNational Foods has invested millions in setting up state-of-the-art processing plants to replace old mills and ramp up production in the country.\n\nSince 2022, the company has invested about US$30 million into hi-tech plants, replacing the 72-year-old mill to ramp up production by more than 2 000 tonnes, and other plants in Harare.\n\nThis comes as the NFL is celebrating 103 years since establishing operations in Zimbabwe.\n\nThe company produces human and livestock feed that has become part of every Zimbabwean household throughout the century.\n\nIn an interview during the tour, Ministry of Industry and Commerce Permanent Secretary, Dr Thomas Utete Wushe said the ministry is impressed with the new plant at National Foods, which moves in line with global trends.\n\nDr Thomas Utete Wushe\n\nHe said having a company investing about US$6,5 million shows how confident National Foods is in this economy.\n\nIm excited, I have seen the transformation from around 200 tonnes to 300 tonnes production a day and also, more exciting is the realisation that this plant is achieving up to 90 percent capacity utilisation. This is a significant improvement, looking at the national average capacity utilisation, which is currently sitting at 52 percent, said Dr Wushe.\n\nWe want to see more of the National Foods plants as far as national capacity utilisation is concerned.\n\nMeanwhile, Dr Wushe said the Government, through the Ministry of Industry and Commerce, is engaging industries to upgrade and retool with the national blueprint, stating the need for companies to move in line with global trends.\n\nWe are also encouraging the Ministry of Higher and Tertiary Education to produce current skills that align with the new level of upgraded machinery, said Dr Wushe.\n\nThis is why we are here, to ensure that the country is ready for retooling through upskilling and getting our graduates out of university with the required skills that align with what is happening in the industry.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/edfhgvju.jpg",
            "description": "Sikhulekelani Moyo, Business Writer Diversified agro-industrial concern, National Foods Limited (NFL), has said the newly established flour milling plant in Bulawayo has seen an improvement in capacity utilisation from about 200 tonnes to 300 tonnes of wheat milled a day. National Foods installed a state-of-the-art US$6,5 million flour milling plant in Bulawayo, an investment that took […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Kaindu sees momentum: Gritty victory sparks optimism",
            "url": "https://www.chronicle.co.zw/kaindu-sees-momentum-gritty-victory-sparks-optimism/",
            "content": "Innocent Kurira,Zimpapers Sports Hub\n\nHIGHLANDERS coach, Kelvin Kaindu, believes their gritty 1-0 triumph over CAPS United could be the spark that ignites their 2025 campaign  a season he insists is only just beginning.\n\nAfter a stuttering start, plagued by pre-season disruptions, Bosso finally look to be hitting stride  and at just the right time, with the Easter Football Fiesta looming.\n\nWe had planned to use the first six games as our periodisation period because we didnt have adequate pre-season preparations. I believe were now in the kind of shape that can bring us more wins like this one, said Kaindu, visibly relieved and hopeful after the final whistle.\n\nIt wasnt a performance for the purists, but Bossos faithful wont mind  not when it delivered three precious points and a dash of momentum. Reason Sibandas decisive strike, beautifully set up by Brighton Ncube, ensured the Bulawayo giants edged a cagey contest that could prove a turning point in their season narrative.\n\nKaindu didnt downplay the significance.\n\nThis win is special. The three points are very crucial. Weve drawn several games that we dominated and could have won. We let points slip in the dying minutes, so getting the full three points is a huge positive, he reflected.\n\nBefore the match, Highlanders sat 10th on the log  a position that felt alien for a club of their stature. The victory lifted them to seventh, and while still early days, theres a sense that Kaindus boys are beginning to turn the gears.\n\nSlowly, we are climbing. I said we would use these first six games to prepare for the season, and I hope weve now found our rhythm. Sometimes, all you need is a bit of luck. Today, we werent at our best, but we managed to grind out a result. Thats football, said Kaindu.\n\nHe also reserved special praise for the Highlanders faithful.\n\nWe are grateful to the crowd  their energy kept us going and helped us secure the win.\n\nBut it wasnt all rosy. The defence continues to wobble, with Highlanders having conceded five goals in as many matches. Kaindu didnt shy away from that elephant in the room.\n\nThats an area we need to fix. The goals we have conceded havent been from great play by the opposition, but from our own costly mistakes. Thats not acceptable at this level, he admitted.\n\nAs Bosso prepare for a blockbuster Easter Monday showdown against unbeaten Ngezi Platinum Stars at Baobab, belief is quietly building in their camp. And off the pitch, the club is also preparing for something far more monumental.\n\nHighlanders chairman, Kenneth Mhlophe, took the opportunity to stir hearts with a rallying cry to the Bosso family ahead of the clubs 100-year celebrations next year.\n\nAs we stand on the brink of an incredible milestone  celebrating 100 years of Highlanders  I want to take a moment to express my heartfelt gratitude to each and every one of you. Your unwavering support has been the backbone of our beloved club, and it is your passion that fuels our journey, Mhlophe said.\n\nIn a time when moneybags teams have emerged, attracting many players, your loyalty has shone through. Thank you for sticking by us, for filling up Barbourfields Stadium week in and week out, and for travelling with the team, even in challenging times. Your presence is not just a show of support; it is a testament to the true spirit of Highlanders.\n\nMhlophe extended an open invitation to corporate Zimbabwe to rally behind the Bosso cause.\n\nTo our corporate partners, we invite you to continue believing in the Highlanders brand. Dont hesitate to associate with us; together, we can shape the future of football in our community.\n\nOur players and coaches need your support now more than ever, and it is the people  the heartbeat of Highlanders  that will propel us to new heights.\n\nLets make this centenary celebration one for the ages! Together, we will honour our past and pave the way for a glorious future. Thank you for being the heart and soul of Highlanders. Heres to many more years of success together.\n\nEaster Weekend fixtures\n\nSaturday\n\nGreenFuel vs ZPC Kariba (Green Fuel Arena)\n\nSunday\n\nCAPS United vs Bikita Minerals (Rufaro Stadium),Manica Diamonds vs TelOne (Sakuva Stadium),Triangle vs Yadah (Gibbo Stadium)\n\nMonday\n\nChicken Inn vs Simba Bhora (Luveve Stadium),Kwekwe United vs Herentals (Bata Stadium), MWOS vs Dynamos (Ngoni Stadium),Ngezi Platinum vs Highlanders (Baobab Stadium) Scottland vs FC Platinum (Rufaro Stadium).  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/sadasda.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub HIGHLANDERS coach, Kelvin Kaindu, believes their gritty 1-0 triumph over CAPS United could be the spark that ignites their 2025 campaign — a season he insists is only just beginning. After a stuttering start, plagued by pre-season disruptions, Bosso finally look to be hitting stride — and at just the right […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Baldmin Bulawayo Half Marathon registration deadline extended",
            "url": "https://www.chronicle.co.zw/baldmin-bulawayo-half-marathon-registration-deadline-extended/",
            "content": "Innocent Kurira,Zimpapers Sports Hub\n\nORGANISERS of the Baldmin Bulawayo Half Marathon have extended the registration deadline to Friday, April 18, in a final push to encourage more athletes to sign up for the eagerly awaited event.\n\nThe race is set for Saturday, April 19, 2025, at White City Stadium, marking a much anticipated return after a long hiatus since its last sponsorship by Coca-Cola in 2005.\n\nOnce one of Zimbabwes premier running events, the Baldmin Bulawayo Half Marathon boasts a rich legacy and is renowned for its scenic course that winds through Bulawayos western suburbs.\n\nThe race has traditionally attracted both local and international athletes, and this years edition is expected to reignite that vibrant spirit.\n\nVeteran administrator Themba Mhlophe, who is leading the organising committee, confirmed the extension and the reasoning behind it.\n\nWe have extended the registration deadline to April 18, which is just a day before the event. We are hoping that by then,most athletes will have registered and that is when they will receive their running vests, Mhlophe said.\n\nWe are excited to be hosting this iconic event, which holds significant importance for the city of Bulawayo.\n\nHe stressed the broader impact of the race, particularly in reviving the citys sporting culture after years without this marquee event.\n\nThis marathon is more than just a race; its a chance to bring the community together, to inspire people to live healthier lives and to showcase Bulawayos rich sporting heritage. The city has always been a hub for athletic talent, and this event will once again bring that spirit to the forefront, said Mhlophe.\n\nHe admitted initial registration numbers had been slow, but expressed optimism following a recent uptick in interest.\n\nWe understand that people often wait until the last moment to commit, but we have seen a positive shift in momentum recently. The community is coming on board, and we are confident that the final registrations will meet our expectations. With the extended deadline, we hope to see even more participants eager to take part in this historic event, Mhlophe said.\n\nRegistration for the race opened on January 15, 2025.\n\nParticipants can collect their race numbers from April 16 to 18 at White City Stadium between 09:00 and 17:00, or on race day from 05:00 to 06:00. Athletes will receive confirmation of their race number via email or SMS, and are reminded to ensure their contact information is accurate. When collecting race packs, athletes must present proof of identity and confirmation of registration. Those collecting on behalf of others will also need to provide identification. The event features three race categories: the 21km, 10km and five kilometre races, with an entry fee of US$15. Beyond the competition, the marathon promotes fitness, community spirit and support for local causes. Organisers are confident it will be a thrilling and unifying day for participants and spectators alike.\n\nMeanwhile, another exciting event is set to take place at White City Stadium in July. The Queens with Wigs track and field meet, an all-female competition, is scheduled for July 5. The entry fee for that event is US$2. It will feature a variety of races, including the 3 000m, 100m hurdles, 100m, 50m, 1 500m, 4100m relay, 400m, 800m and 200m. Field events include the long jump, high jump, triple jump, shot put, discus and javelin.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/03/ergbbnhjmm.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub ORGANISERS of the Baldmin Bulawayo Half Marathon have extended the registration deadline to Friday, April 18, in a final push to encourage more athletes to sign up for the eagerly awaited event.  The race is set for Saturday, April 19, 2025, at White City Stadium, marking a much anticipated return after […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        },
        {
            "title": "Chief Dakamela appointed continental AKDA director",
            "url": "https://www.chronicle.co.zw/chief-dakamela-appointed-continental-akda-director/",
            "content": "Blessing KarubwaCHIEF Dakamela of Nkayi District in Matabeleland North Province has been appointed as the continental executive director of the African Kingdoms Diaspora Alliance (AKDA).\n\nThe appointment underscores the young chiefs steadfast dedication to the people of Nkayi, the Matabeleland region and further afield. It also heralds a fresh chapter of youthful and forward thinking leadership within the organisation, established in 2017 with the aim of championing the principles of Ubuntu and safeguarding African cultural heritage.\n\nChief Dakamela, recognised for his inventive strategies in community development and his resolute commitment to the betterment of the less fortunate, has earned considerable respect and admiration both at home and abroad. His leadership ethos embodies the very spirit of Ubuntu, stressing our shared humanity, collective advancement and the paramount importance of cultural identity.\n\nI am truly humbled by this appointment. Its a great opportunity not just for me, but for the people of Nkayi, Matabeleland and Zimbabwe as a whole, he said in a recent interview. I hope to contribute immensely to uniting the African Kingdoms and fostering a sense of purpose and development across the continent.\n\nSince assuming leadership in 2019, Chief Dakamela has engaged in transformative initiatives that have revitalised Nkayi, a district historically plagued by underdevelopment and limited access to essential services.\n\nHe has taken significant strides to combat food insecurity, improve housing conditions and enhance educational opportunities for the less privileged in his community.\n\nHis journey began with the launch of the Isiphala Senkosi Programme in 2020, which aimed to provide a safety net for families during times of drought, ensuring food security in a region that has faced climate-related challenges for decades.\n\nWe are stronger when we stand together, he often emphasises, a mantra that resonates deeply with the community he serves.\n\nIn 2021, Chief Dakamela initiated the Imiklomelo KaDakamela Awards, an annual event that honours individuals making significant contributions to the development of Nkayi and beyond.\n\nBy celebrating achievements, we remind ourselves that positive change is possible and that we can uplift our community together, said Chief Dakamela.\n\nChief Dakamela\n\nHis commitment to improving living conditions culminated in 2022 with the Dakamela Housing Project (DHP), designed to provide safe and dignified housing for underprivileged families and the elderly.\n\nEducation, a cornerstone of Chief Dakamelas vision for a brighter future, saw further emphasis with the establishment of the Dakamela Education Foundation Scholarship (DEFS) in 2023.\n\nInvesting in our children is investing in the future of Nkayi, said the chief.\n\nChief Dakamela has pioneered the Isibaya Senkosi project, promoting sustainable livestock management to enhance food security and economic resilience, among local farmers during drought conditions. By establishing a communal livestock fund, he empowers families and strengthens community bonds, positioning Nkayi on a path towards sustainable development.\n\nEarly this year, he was honoured as the Most Unsung Hero in Matabeleland North at the Herald Heroes Community Awards, a recognition emphasising the impact of his work.\n\nThis award is not just for me; it belongs to every villager who has believed in our vision. We are all part of this journey, he said while accepting the award.\n\nAs Chief Dakamela takes on his new role with AKDA, he brings a vision that aligns perfectly with the organisations mandate to promote unity, culture and socio-economic development across Africa.\n\nChief Dakamela is not just a talker; he is a doer. He embodies the passion and dedication that we need to bridge the gap between traditional leadership and the communities they serve, said Princess Mncube, a representative of AKDA.\n\nChief believes that empowering the youth will pave the way for the next generation of leaders who will surpass the achievements of their predecessors.  @TeamKarubwa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/FGDSGSGFSD.jpg",
            "description": "Blessing Karubwa CHIEF Dakamela of Nkayi District in Matabeleland North Province has been appointed as the continental executive director of the African Kingdoms Diaspora Alliance (AKDA). The appointment underscores the young chief’s steadfast dedication to the people of Nkayi, the Matabeleland region and further afield. It also heralds a fresh chapter of youthful and forward […]",
            "time": "08:44",
            "date": "15 Apr 2025"
        }
    ]
}