{
    "news": [
        {
            "title": "Watch: Joy and screams as little ones start school",
            "url": "https://www.chronicle.co.zw/watch-joy-and-screams-as-little-ones-start-school/",
            "content": "Raymond Jaravaza [emailprotected]\n\nTUESDAY morning marked the beginning of the academic journey for thousands of little boys and girls starting Early Childhood Development (ECD) at schools across Bulawayo.Children as young as four years old started ECD classes on the first day of the 2025 first term. For some, the first day at school signalled a new chapter in their young lives as they entered a classroom for the first time.Accompanied by parents and guardians, some of the children dressed in school uniform for the first time and began the experience of spending half the day at school compared to staying at home.ECD classes typically start early in the morning and end at noon.\n\nWe have enrolled 10 ECD learners for the 2025 class but expect more parents to bring their children as the week progresses although the class wont exceed 20 learners, said Growing Minds Academy marketing manager Miss Samantha Manyathela.The school has a strict teacher-to-pupil ratio that it adheres to where one ECD teacher and as assistant cater for 20 learners or less.Some of the kids cried when their parents dropped them off in the morning while the few brave ones were happy to stay behind and mingle with other learners, said Ms Manyathela.The school has entered into agreements with parents who cannot afford to pay the full school fees to pay in instalments until mid-March.At another ECD centre in Mzilikazi suburb, Mrs Angelina Ndlovu said the little kids will adjust to being dropped off at school by their parents and spending half the day in class as well as playing outside in the sports fields.Kids adapt to new environments very quickly and by the end of the week they will be looking forward to coming to school every day. Parents come to pick up the kids at 12:30PM and anyone whose name is not registered with the school is not allowed to fetch a child here, said Mrs Ndlovu.By noon on Tuesday afternoon, parents and guardians of kids in ECD had started arriving at various schools to pick them up.At Ingwegwe Primary School in Pumula East, parents had started trickling into the school to pick up the young ones around 12:15PM.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled20-1.jpg",
            "description": "Raymond Jaravaza – raymondjaravaza@gmail.com TUESDAY morning marked the beginning of the academic journey for thousands of little boys and girls starting Early Childhood Development (ECD) at schools across Bulawayo. Children as young as four years old started ECD classes on the first day of the 2025 first term. For some, the first day at school […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Professor Edson Gandiwa appointed ZimPark boss",
            "url": "https://www.chronicle.co.zw/professor-edson-gandiwa-appointed-zimpark-boss/",
            "content": "Raymond Jaravaza [emailprotected]\n\nPROFESSOR Edson Gandiwa has been appointed the director general of the Zimbabwe Parks and Wildlife Management Authority (ZimParks) with immediate effect.\n\nProf Gandiwa takes over from Dr Fulton Mangwanya who was recently appointed the position of director general of the Central Intelligence Organisation (CIO) by President Mnangagwa.\n\nProfessor Gandiwa has over 20 years of experience in wildlife conservation and higher education. Previously, Professor Gandiwa served as Director of Scientific Services at ZimParks (January 2021-January 2025); Associate Professor, Inaugural Executive Dean and Full Professor in the School of Wildlife, Ecology and Conservation at Chinhoyi University of Technology (May 2013-January 2021), Ecologist and Senior Ecologist based in Gonarezhou National Park (Chiredzi) at ZimParks (October 2004-April 2013), said ZimParks spokesperson Mr Tinashe Farawo in a statement.\n\nProf Gandiwa holds a Doctor of Philosophy (PhD) Degree in Wildlife Conservation and Management from Wageningen University and Research, The Netherlands (2013), a Master of Science Degree in Tropical Resource Ecology (with merit) from the University of Zimbabwe (2007), and a Bachelor of Science (Honours) Degree in Environmental Science and Health (with first class) from the National University of Science and Technology (NUST), Zimbabwe (2004).Prof Gandiwa has (co) authored over 200 peer-reviewed scientific publications.\n\nHis research interests include biodiversity and wildlife conservation, protected area management, community-based natural resource management, ecotourism and media framing of wildlife conservation.He is the chairperson of the African Elephant Fund Steering Committee under the United Nations Environment Programme (Nairobi, Kenya) and sits on several boards.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/karibaehhylephantmove.jpg",
            "description": "Raymond Jaravaza – raymondjaravaza@gmail.com PROFESSOR Edson Gandiwa has been appointed the director general of the Zimbabwe Parks and Wildlife Management Authority (ZimParks) with immediate effect. Prof Gandiwa takes over from Dr Fulton Mangwanya who was recently appointed the position of director general of the Central Intelligence Organisation (CIO) by President Mnangagwa. “Professor Gandiwa has over […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Rusape Town Council introduces certification for Water Tank Stands",
            "url": "https://www.chronicle.co.zw/rusape-town-council-introduces-certification-for-water-tank-stands/",
            "content": "Online Writer\n\nRUSAPE Town Council has issued a public notice mandating the certification of water tank stands in its jurisdiction, for US$20 per application.\n\nThe move comes in response to concerns over substandard structures posing risks to public safety, infrastructure, and the community at large.\n\nUnder the new policy, all water storage tanks with a capacity of 5 000 litres or more must be certified, irrespective of their height. Additionally, tanks with a capacity of 1 000 litres or more that are elevated at least two metres above ground must also undergo certification. Property owners with existing tank stands are required to regularise their structures by obtaining certification from qualified structural engineers by 31 May 2025.\n\nThe council has set a certification fee of US$20 for the submission of certificates to local authorities. Non-compliance may result in penalties or other enforcement measures.\n\nResidents have been urged to contact the councils Engineering Department or visit their offices for further information.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tutr.jpg",
            "description": "Online Writer RUSAPE Town Council has issued a public notice mandating the certification of water tank stands in its jurisdiction, for US$20 per application. The move comes in response to concerns over substandard structures posing risks to public safety, infrastructure, and the community at large. Under the new policy, all water storage tanks with a […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "EcoCash reports 80 percent revenue growth , launches innovative digital solutions",
            "url": "https://www.chronicle.co.zw/ecocash-reports-80-percent-revenue-growth-launches-innovative-digital-solutions/",
            "content": "Business Writer\n\nEcoCash, Zimbabwes leading financial technology platform, recorded an 80percent increase in revenue for the quarter ending 30 November 2024, compared to the previous quarter.This growth reflects the companys continued focus on leveraging technology to enhance operational efficiencies.\n\nIn a trading update for the third quarter, EcoCash confirmed compliance with Tier 1 Capital requirements as mandated by the Reserve Bank of Zimbabwe.\n\nThe company saidit remains committed to identifying and developing market opportunities aligned with its mission to provide convenient digital solutions that meet growing customer demands.\n\nThe organisation will continue to adapt to changes in the operating environment and implement strategies to create shareholder value and maximise returns, the company said in its statement.\n\nDuring the review period, EcoCash introduced an innovative Omni-Channel platform, a unified and secure digital system designed to enhance customer experience and improve security. The platform integrates essential banking services such as account and card management, bill payments, and fund transfers.\n\nThe company also launched a new ZIPIT Fund Transfers service, enabling customers to transfer funds from any Foreign Currency Account or mobile wallet directly to their Steward Bank VISA card via the ZIPIT platform.\n\nAdditionally, EcoCash implemented cardless withdrawal and deposit services through its ATMs, offering customers greater convenience and flexibility in conducting transactions.\n\nEcoCashs integration with all Zimbabwean banks now allows users with both an EcoCash wallet and a bank account to seamlessly transfer funds between the two platforms. This feature enables customers to manage their finances securely from their mobile devices, eliminating the need for physical cash or lengthy queues at ATMs and bank branches.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/ecocash.jpg",
            "description": "Business Writer EcoCash, Zimbabwe’s leading financial technology platform, recorded an 80percent increase in revenue for the quarter ending 30 November 2024, compared to the previous quarter. This growth reflects the company’s continued focus on leveraging technology to enhance operational efficiencies. In a trading update for the third quarter, EcoCash confirmed compliance with Tier 1 Capital […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Another Zimbabwe opposition party backs call to defer 2028 Harmonised Elections",
            "url": "https://www.chronicle.co.zw/another-zimbabwe-opposition-party-backs-call-to-defer-2028-harmonised-elections/",
            "content": "Online Reporter\n\nANOTHER opposition party has joined calls to defer the 2028 harmonised elections in Zimbabwe, allowing President Mnangagwas administration to remain in office until 2030 to complete transformative development projects.\n\nThe Zimbabwe African National Congress (ZANC) on Tuesday said the countrys developmental trajectory should be prioritised and that suspending the 2028 elections would enable ongoing progress to continue uninterrupted.\n\nZANC has aligned itself with the Citizens Coalition for Change (CCC), the countrys main opposition party, in advocating for the postponement of the 2028 harmonised polls.\n\nThe CCC previously announced plans to engage the ruling Zanu PF on the matter, following a resolution made during Zanu PFs 22nd National Peoples Conference in December to extend President Mnangagwas term by two years, until 2030.\n\nIn a statement, ZANC President Mr Timothy Mncube emphasised that President Mnangagwas administration has initiated several transformational development projects that should be sustained until 2030.\n\nConsidering the significant progress made by the Second Republic, we believe that extending President Mnangagwas term and shifting the elections from 2028 to 2030 would provide the necessary time to complete ongoing projects and ensure a smoother transition. ZANC remains steadfast in its mission to serve as a vigilant and constructive opposition party, said Mr Mncube.\n\nHe reaffirmed his partys commitment to holding the government accountable while supporting initiatives that promote Zimbabwes prosperity.\n\nOur commitment is to the nation and its citizens, ensuring that progress and development remain at the forefront of our agenda, he said.\n\nMr Mncube also clarified that ZANC is an independent party and not affiliated with the ruling Zanu PF.\n\nOur partys ethos is rooted in acknowledging and supporting initiatives that propel national development, irrespective of political affiliations. We firmly believe that opposition should be constructive, offering alternative solutions while recognising and applauding government achievements that benefit our nation, he said.\n\nHighlighting key projects under the Second Republic, Mr Mncube cited significant contributions to socio-economic growth:\n\nInfrastructure Development: Completion of over 7 000 high-impact projects, including dams, roads, airports, water pipelines, and border posts, which have significantly enhanced national infrastructure.\n\nEnergy Sector: Commissioning of the US$1.5 billion Hwange Power Station Units 7 and 8 expansion project, increasing national grid capacity and addressing power shortages.\n\nMining Industry: Launch of major mining operations, such as the US$1 billion steel plant by Chinas Tsingshan Holding Group, which began production in June 2024, positioning Zimbabwe as a key player in the global steel industry.\n\nMr Mncube also praised the recent introduction of 99-year leases on farms, describing it as a landmark development that will enable land to be used as collateral to secure funding from banks, thus boosting agricultural productivity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hj.jpg",
            "description": "Online Reporter ANOTHER opposition party has joined calls to defer the 2028 harmonised elections in Zimbabwe, allowing President Mnangagwa’s administration to remain in office until 2030 to complete transformative development projects. The Zimbabwe African National Congress (ZANC) on Tuesday said the country’s developmental trajectory should be prioritised and that suspending the 2028 elections would enable […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Mlonyeni Primary School Parents clash with headmistress over alleged misconduct",
            "url": "https://www.chronicle.co.zw/mlonyeni-primary-school-parents-clash-with-headmistress-over-alleged-misconduct/",
            "content": "By Leonard Ncube |[emailprotected]\n\nTENSIONS have escalated between parents of learners at Mlonyeni Primary School in Mbembesi, Lupane, and the schools headmistress, Ms Abigail Mpinga, over allegations of mismanagement, disrespect towards the community, and financial impropriety.\n\nLocated in the Phulula area near the Mbembesi River, the school serves over 300 learners. Ms Mpinga, who has been headmistress for nearly eight years, is accused of misusing funds and failing to cooperate with parents. Similar allegations reportedly forced her to leave four previous schools unceremoniously.\n\nOn 27 December and again last Wednesday, Ms Mpinga reportedly ignored scheduled meetings with parents. In response, parents locked the school, demanding her removal. She then reported to the police, claiming members of the Mthwakazi Republic Party (MRP) had invaded the premises and threatened her.\n\nHowever, an investigation revealed that the people she accused were actually parents and village heads sent on a fact-finding mission. This prompted a meeting on 8 January involving Ministry of Education officials, acting Chief Mabhikwa, local authorities, and other stakeholders. Ms Mpinga did not attend.\n\nParents claim Ms Mpinga misused school funds, including US$150 for personal purchases and US$800 claimed as an allowance for attending a conference. Community members are now calling for her immediate transfer and greater transparency in the schools administration.\n\nThe School Development Committee (SDC) chairperson, Mr Thabani Mavengele Sibanda, confirmed the parents grievances, saying:\n\nWe have a problem with the headmistress who doesnt respect parents and fails to cooperate. The school has seen no development during her tenure, and parents no longer want her to remain in charge.\n\nActing Chief Mabhikwa\n\nActing Chief Mabhikwa criticised Ms Mpinga for disrespecting the community and lying to authorities about being victimised on tribal grounds. He added that auditors had been sent to the school, and a report is expected shortly.\n\nParents locked the school, but we intervened to ensure lessons resume on time. We will convene a meeting on 14 January to address the issue and resolve it as stakeholders, said Acting Chief Mabhikwa.\n\nLupane District Schools Inspector, Mr Lovemore Ncube, confirmed the ongoing investigations and urged parents to allow Government procedures to take their course.\n\nI received a preliminary report from inspectors, and auditors are also preparing findings. A meeting is scheduled for Tuesday to determine the way forward, he said.As stakeholders prepare for todayss meeting, parents and authorities alike are hopeful for a resolution that prioritises the welfare of learners and the integrity of the school.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-14-at-12.02.06-PM-480x380.jpeg",
            "description": "By Leonard Ncube | leonard.ncube@chronicle.co.zw TENSIONS have escalated between parents of learners at Mlonyeni Primary School in Mbembesi, Lupane, and the school’s headmistress, Ms Abigail Mpinga, over allegations of mismanagement, disrespect towards the community, and financial impropriety. Located in the Phulula area near the Mbembesi River, the school serves over 300 learners. Ms Mpinga, who […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Beitbridge Municipality launches crackdown on unregistered schools",
            "url": "https://www.chronicle.co.zw/beitbridge-municipality-launches-crackdown-on-unregistered-schools/",
            "content": "By Thupeyo Muleya, Beitbridge Bureau\n\nBEITBRIDGE Municipality, in collaboration with the Ministry of Primary and Secondary Education, has commenced a blitz targeting unregistered private schools that have proliferated across the town.\n\nThe district officially has 71 primary schools and 18 secondary schools. However, education authorities are yet to determine the exact number of unregistered schools, which are estimated to exceed 20.\n\nIn a statement, the municipality expressed concern over the growing number of private schools operating without registration from either the local authority or the Ministry of Primary and Secondary Education.\n\nThe municipality, in conjunction with relevant stakeholders, will conduct a blitz to eliminate unregistered schools. We strongly urge parents and guardians to ensure their children are enrolled in schools that are fully registered and compliant with all regulations. Some individuals operate illegal schools, compromising the well-being, safety, and education of our children, said the Municipality.\n\nEnrolling in a properly registered school guarantees a standard of education that meets both local and national requirements, safeguarding your childs learning experience and future opportunities. Let us work together to provide safe and quality education for the children in our community.\n\nThere have been reports of pupils enrolled in unregistered schools facing challenges in registering for public examinations, resulting in wasted years of education.\n\nRecently, some parents had to approach the Ministry of Primary and Secondary Education after discovering that certain unregistered schools remained closed at the beginning of the term.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/10/BEITBRIDGE-Municipality-.jpg",
            "description": "By Thupeyo Muleya, Beitbridge Bureau BEITBRIDGE Municipality, in collaboration with the Ministry of Primary and Secondary Education, has commenced a blitz targeting unregistered private schools that have proliferated across the town. The district officially has 71 primary schools and 18 secondary schools. However, education authorities are yet to determine the exact number of unregistered schools, […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Quick-Thinking tip-off leads to arrest of Bulawayo theft-from-car suspect",
            "url": "https://www.chronicle.co.zw/quick-thinking-tip-off-leads-to-arrest-of-bulawayo-theft-from-car-suspect/",
            "content": "Online Writer\n\nPOLICE in Bulawayo have apprehended a 38-year-old man from Robert Sinyoka following a theft from a motor vehicle in the citys central business district.\n\nMafroza Moyo was caught red-handed on 13 January 2025, after police acted on a public tip-off. Moyo was reportedly attempting to sell a stolen silver Dell laptop. Upon seeing the authorities near his residence, he tried to flee but was swiftly apprehended.\n\nA subsequent search of Moyos residence revealed a haul of stolen items, including the laptop, a charger, a Samsung cellphone, and personal documents belonging to the victim. The stolen goods, valued at US$1,200, were traced to a Mazda KB250 parked on Herbert Chitepo Street earlier that day. The car had been forced open with an unknown tool while the owner was away.\n\nThe stolen property has since been returned to its rightful owner, who identified the items with the help of police.\n\nBulawayo police have praised the vigilance of the community, urging residents to continue reporting suspicious activities to aid in the fight against crime.\n\nBulawayo Police Spokesperson Assistant Inspector Nomalanga Msebele commended the collaboration, saying: Public cooperation remains critical in ensuring a safer Bulawayo for all.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Assistant-Inspector-Nomalanga-Msebele.jpg",
            "description": "Online Writer POLICE in Bulawayo have apprehended a 38-year-old man from Robert Sinyoka following a theft from a motor vehicle in the city’s central business district. Mafroza Moyo was caught red-handed on 13 January 2025, after police acted on a public tip-off. Moyo was reportedly attempting to sell a stolen silver Dell laptop. Upon seeing […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Woman kills two daughters and tries to take her own life",
            "url": "https://www.chronicle.co.zw/woman-kills-two-daughters-and-tries-to-take-her-own-life/",
            "content": "Sheronrose[emailprotected]\n\nA 25-YEAR-OLD woman from Triangle appeared before the Chiredzi Magistrates Court for throwing her two daughters aged 4 and 8 into a water canal where they drowned.\n\nBlessing Chiromonye tried to commit suicide by jumping into the canal but survived.In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said on 8 January Blessing Chiromonye threw her daughters into the main water canal in Triangle, resulting in their drowning and death.Chiromonye tried to commit suicide by jumping into the canal but was thrown out by the water. She went home and changed her wet clothes and tried to flee, said the NPAZ.\n\nThe driver of a commuter omnibus she boarded was tipped about what had transpired and drove Chiromonye back home.A police report was made, leading to her arrest, said the prosecuting authority .She was remanded in custody to the 23rd of January 2025.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Sheronrose Mugombi-mugombisheron@gmail.com A 25-YEAR-OLD woman from Triangle appeared before the Chiredzi Magistrates’ Court for throwing her two daughters aged 4 and 8 into a water canal where they drowned. Blessing Chiromonye tried to commit suicide by jumping into the canal but survived. In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        },
        {
            "title": "Mainline FC hosts 2025 opening party",
            "url": "https://www.chronicle.co.zw/mainline-fc-hosts-2025-opening-party/",
            "content": "Ronald Mpofu, Online Reporter\n\nMAINLINE Football Club director, Mkhulunyelwa Nkomo, welcomed the year 2025 with a celebratory dinner party for team members, held on Saturday evening.This year marks a significant milestone for Mainline FC as the club celebrates eight years since its inception. Registered with ZIFA, the team competes in the Southern Region Division 1 league. Based in Plumtree town, Mainline FC calls Dingumuzi Stadium its home ground and enjoys unwavering support from a passionate fan base across the region.\n\nMr Mkhulunyelwa Nkomo addressing at the Mainline FC 2025 opening party (Picture by Ronald Mpofu)\n\nClistone Bhazaya, the teams Secretary General, opened the event with a warm address before inviting Nkomo to share the evenings agenda.\n\nThere is nothing to worry about here. I have simply decided to bring everyone I work with together to enjoy this evening. We have nothing to discuss todaytonight is just our dinner as a team, celebrating that we have all made it into the new year, 2025, with Gods grace, said Nkomo.\n\nAmong the distinguished guests were Plumtree Town Secretary, Thembalami Nyoni, and Headman Somfula Sikhathini of Bulilima District Ward 1. The teams executive members in attendance included Reuben Zinyemba (Vice Chairman), Busani Qedicala Ndiweni (Organising Secretary), and Clistone Bhazaya (Secretary General). Representing the technical department were Paul J. Moyo, Danile Maphosa, and Onias Nyathi, alongside coaches Charlton Nomandla Gumede and Pelin Ndebele. Supporters executive members Anele Ndlovu and Nkosilathi Muswela also joined the festivities, along with Mainline Enterprises staff and players, all contributing to the vibrant and joyous atmosphere.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Mainline-FC-Members.jpg",
            "description": "Ronald Mpofu, Online Reporter MAINLINE Football Club director, Mkhulunyelwa Nkomo, welcomed the year 2025 with a celebratory dinner party for team members, held on Saturday evening. This year marks a significant milestone for Mainline FC as the club celebrates eight years since its inception. Registered with ZIFA, the team competes in the Southern Region Division […]",
            "time": "21:26",
            "date": "14 Jan 2025"
        }
    ]
}