{
    "news": [
        {
            "title": "DRC conflict: President, Ruto to detail facilitator’s tasks",
            "url": "https://www.chronicle.co.zw/drc-conflict-president-ruto-to-detail-facilitators-tasks/",
            "content": "Debra Matabvu, Harare Bureau\n\nSADC Chairperson President Mnangagwa and his East African Community (EAC) counterpart, Kenyan President William Ruto, are expected to hold a high-level meeting this week to formally appoint a panel of eminent African leaders and define their mandate in seeking a lasting solution to the conflict bedevilling eastern Democratic Republic of Congo (DRC).\n\nDuring a virtual SADC- EAC meeting on Monday last week, regional leaders appointed former Nigerian President Olusegun Obasanjo, former Kenyan President Uhuru Kenyatta, former South African President Kgalema Motlanthe, former Central African Republic President Catherine Samba Panza and former Ethiopian President Sahle-Work Zewde to spearhead efforts to end the conflict in DRC.\n\nPresident Mnangagwa and President Ruto were to convene the briefing within seven days to outline the panels mandate and tasks.\n\nKenyan President William Ruto\n\nIn an interview yesterday, Foreign Affairs and International Trade Minister Professor Amon Murwira said preparations are now at an advanced stage with the meeting set to be held within the stipulated framework.\n\nWe believe that the high-level briefing will be held anytime from now and will be held within the seven-day framework which was stipulated, Professor Murwira said.\n\nAs of Friday (last week), the preparations were at an advanced stage, the programme, and agenda were being finalised while letters have been signed.\n\nThe Excellencies had said they were going to hold the briefing in seven days, so we believe that it will be done in seven days. We now await to hear from the Excellencies.\n\nProffessor Amon Murwira\n\nIn a separate interview, Foreign Affairs Permanent Secretary, Ambassador Albert Chimbindi said efforts were being made to ensure the mediation process begins immediately.\n\nThe process has to be navigated delicately as it involves a number of issues such as sending formal requisitions to the nominated leaders, terms of references and coming up with dates for the meeting that are suitable for everyone, he said.\n\nThe meeting is set to be held very soon, although we do not have dates, we have to appreciate the effort which is being made to ensure the meeting takes place.\n\nThe panel of leaders is expected to facilitate dialogue between warring parties, including the Congolese government and the M23 rebels, to promote peaceful negotiations and address underlying grievances.\n\nM23 rebels\n\nThey are also expected to advocate for international support and assistance for the DRC, including humanitarian aid, funding for development initiatives, and resources for rebuilding affected communities.\n\nRecently the United Nations Security Council applauded efforts by the two regional blocs to resolve the DRC crisis and strongly condemned the ongoing offensive by M23 rebels in the eastern DRC.\n\nThe Security Council demanded that the M23 immediately cease hostilities, withdraw from all areas that it controls, and fully reverse the establishment of illegitimate parallel administrations in the DRC territory.It reiterated the urgent appeal for all parties to conclude an immediate and unconditional ceasefire, as called for by leaders from EAC and SADC.\n\nThe M23 rebels have been moving south towards Bukavu, the capital of South Kivu province, in what appears to be an attempt to expand their area of control in the countrys east after capturing the city of Goma.\n\nM23, which refers to March 23, 2009, is the latest group of ethnic Tutsi-led insurgents to take up arms against Congolese forces. It launched the current rebellion in 2022.\n\nThe group has accused the government of Congo of not living up to the peace deal and fully integrating Congolese Tutsis into the army and administration.\n\nThe latest advances are part of a major escalation of a decades-old conflict over power, identity and resources that has killed hundreds of thousands of people and displaced millions since its recent resurgence.\n\nAccording to reports, at least 7 000 people have died in the fighting since January this year with over 600 000 people having been displaced by the fighting since November 2024.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-56yy6-680x380.jpg",
            "description": "Debra Matabvu, Harare Bureau SADC Chairperson President Mnangagwa and his East African Community (EAC) counterpart, Kenyan President William Ruto, are expected to hold a high-level meeting this week to formally appoint a panel of eminent African leaders and define their mandate in seeking a lasting solution to the conflict bedevilling eastern Democratic Republic of Congo […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Residents, unions condemn protest calls",
            "url": "https://www.chronicle.co.zw/residents-unions-condemn-protest-calls/",
            "content": "Chronicle Writers\n\nBULAWAYO residents and labour unions yesterday joined the nation in denouncing calls for protests that are being made by cyber terrorists and fanned through social media, with security forces ready to handle any disturbances.\n\nThe Government said the call for protests was misplaced as it sought to create a false narrative of a non-existent political crisis.A cross-section of Bulawayo residents who spoke to the Chronicle said violent protests could disrupt business, threaten livelihoods, and destabilise the prevailing peace. They urged the Government to bring to book those caught on the wrong side of the law.\n\nMrs Khangelani Msimanga (75) raised concerns about the impact of potential demonstrations.History has taught us that violent protests are not good for the country and our livelihoods as citizens. In the past, we have witnessed shops being looted and destroyed, yet these businesses create employment for our children, she said.As a responsible resident, I dont condone such acts. Every right-thinking Zimbabwean should condemn these planned violent protests.\n\nMs Sithembiso Ndlovu, an informal trader in the centre, said previous protests had left her counting losses after looters took advantage of the chaos.\n\nI rely on my daily sales to feed my family. Every time there is a protest, businesses are forced to close, and we lose income. We dont want violence in our city and the country at large, she said.\n\nAnother vendor who declined to be named said: Why should we be used by people who have their own agendas? Thina siyazithengisela and that is where our bread comes from. For me, this demonstration is a big no.Zimbabwe Teachers Association (Zimta) chief executive officer Dr Sifiso Ndlovu said their organisation is not a political movement and urged teachers to stick to their sole responsibility of educating the nation.\n\nWe are just hearing calls for demonstrations, but as teachers, we have nothing to do with that because that is not what Zimta was formed for. Our organisation was not formed to topple the Government of the day, he said.\n\nOur organisations interest is to educate children and nothing else. If we have grievances, we know how to address them through proper and laid-down structures.\n\nDr Ndlovu urged teachers to continue with their normal duties today.Our roll call is to educate children, not to involve ourselves in politics; hence, teachers should be in class, he said.Zimbabwe Confederation of Public Sector Trade Unions (ZCPSTU) president and Apex Council president Mrs Cecilia Alexander said as civil servants, their job was to provide service to the nation.\n\nThe constitution is very clear, our job is to provide service to the nation, not to participate in any political engagement. Monday is a normal working day for any civil servant, she said.\n\nThe Government announced that it remains resolutely committed to national stability, with security forces ready to handle any disturbances.\n\nMinister of State for National Security Lovemore Matuke warned against potential disruptions by agitators. Protecting citizens safety remains the Governments top priority, with all necessary measures implemented to ensure communities are safe and daily activities uninterrupted.\n\nAt the same time, police confirmed comprehensive nationwide deployments to maintain public safety.Addressing citizens in Gutu South Constituency, Minister Matuke cautioned against any actions threatening public order.\n\nI want to assure every citizen that your security is our top priority. Comprehensive measures are in place to safeguard our society. Our security forces are well-prepared to handle any potential disruptions while ensuring that people going about their daily business are respected and protected, he said.\n\nWhile acknowledging citizens right to lawful protest, Minister Matuke firmly opposed any actions endangering public safety.In the spirit of promoting calm and resilience, I encourage all citizens to continue with their daily business as usual. There is no need for undue anxiety or panic, he said.\n\nWe must collectively focus on our national priorities that enhance welfare and progress, rather than be distracted by rogue elements.\n\nThe minister warned that security forces would respond decisively to any threats posed by malcontents.Our security apparatus is equipped to handle the situation, and anyone attempting to incite violence or chaos will be dealt with swiftly and decisively. We call upon every citizen to show restraint, he said. Minister Matuke stressed national unity as essential for Zimbabwes stability.\n\nLet us work together to uphold the values of peace, stability, and democratic engagement. We stand ready to protect our citizens and our sovereignty, ensuring that our nation remains a place of safety and prosperity for all, he said.\n\nWe are concerned about a concerted effort to undermine our stability and foster discord within our society. I urge all citizens to remain vigilant against such foreign-funded threats.\n\nPolice spokesperson Commissioner Paul Nyathi also assured the nation that today it will be business as usual, adding that law enforcement agents will closely monitor the situation and not tolerate any actions that endanger public safety.\n\nThe police have made adequate deployments throughout the country. Those using public transport or private vehicles should not fear. Businesses and schools should operate normally, he said.Commissioner Nyathi issued a stern warning against social media misuse.\n\nWe are aware of individuals spreading threats online, discouraging work attendance or public transport use. Once identified, they will face the full force of the law, he said.\n\nNationwide, normalcy prevailed yesterday with businesses operating, churches holding services, and social activities continuing undisturbed.In Harare and Bulawayo, among other cities, commercial centres remained busy while transport services operated smoothly.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/08/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Chronicle Writers BULAWAYO residents and labour unions yesterday joined the nation in denouncing calls for protests that are being made by “cyber terrorists” and fanned through social media, with security forces ready to handle any disturbances. The Government said the call for protests was misplaced as it sought to create a false narrative of a […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Last minute saver… Scottland survive Bosso strike",
            "url": "https://www.chronicle.co.zw/last-minute-saver-scottland-survive-bosso-strike/",
            "content": "Innocent Kurira At Barbourfields StadiumHighlanders 1-1 Scottland\n\nA dramatic last-minute header from Mthokozisi Msebe salvaged a point for Scottland in a thrilling 1-1 draw against Highlanders at Barbourfields Stadium on Sunday afternoon.\n\nMsebes header in the dying moments of the game silenced the Bosso faithful, who had been celebrating what they thought was a late winner from Andrew Mbeba just nine minutes earlier.\n\nThe game might not have been the most exciting, but the fans from both sides came out in their numbers, creating an electric atmosphere. It was a full house!\n\nHighlanders coach Kelvin Kaindu was not happy with the result.Im not quite sure if we can say we got a point. Looking at the time that we scored, we should have come out with maximum points. Once again, we conceded with the last kick in the added time. That is one area we need to work on. It was a tight game; it could have gone either way.\n\nWe are showing that we are building a good team with youngsters who can compete. Maybe, probably just our tactics towards the end of the game, when we thought we had managed it. But, with just a bit of mental fitness, one last ball into the box and they scored, said Kaindu.\n\nScottland coach Tonderayi Ndiraya said their belief kept them in the game.Football is played over 90 minutes. We kept believing that a goal would come, and finally, it came in the last minute. Overall, it was a good game of football, good competition from both teams. Highlanders have a good team, they gave us a good run, but of course, that was coupled with home advantage. Its always difficult to come here and leave with a point.\n\nBut, I think we competed very well. We are still new, we have a new team, were just four games into the league and our players are still getting to understand each other. Hopefully, with more game time, they will become a unit and start to understand one another, said Ndiraya.\n\nThe match, while not lacking in late drama, was largely uneventful for the most part. Highlanders enjoyed the better start but were unable to capitalise on their early dominance. They had the first opportunity in the second minute when Reason Sibandas long-range shot sailed over the bar.\n\nThe first 45 minutes saw both teams struggle to get the ball on target, with several attempts drifting above the crossbar.In the sixth minute, Mason Mushore made a clever run down the left and delivered a cross into the box, but Ronald Pfumbizai was alert to head the ball away for a corner, which came to nothing.\n\nFive minutes later, Michael Tapera weaved past the Bosso defence but, like many before him, saw his attempt fly over the bar.Former Highlanders striker Lynoth Chikuhwa, now playing for Scottland, had a golden opportunity in the 20th minute when he found himself unmarked in the box, but his header sailed wide of the target, much to the relief of the Bosso defence.\n\nAs the first-half progressed, the game remained tightly contested, with neither side able to break the deadlock. The first yellow card of the match was shown to Tichaona Chipunza for a foul on Brighton Ncube, and just before the break, McKinnon Mushore sent a long-range shot over the bar as Highlanders attacking efforts remained fruitless.\n\nEmotional players of Highlanders after Scottland equalizer\n\nThe second-half started with more intent from both sides.In the 46th minute, Never Rauzhi had a promising opportunity after receiving a well-weighted pass from Melikhaya Ncube. Rauzhi beat his marker on the edge of the box, but his effort flew high over the bar, missing the target.\n\nWith the game seemingly heading for a goalless draw, Highlanders finally broke the deadlock in the 81st minute.Mbeba stepped up to take a free-kick from the left wing and delivered a stunning shot that found the back of the net, giving Bosso the lead and sparking celebrations from the home supporters.\n\nHowever, just when it seemed as if Highlanders were on their way to a crucial three points, Scottland responded in dramatic fashion. In the dying seconds of the game, Msebe rose above the Bosso defence to meet a cross and nodded home the equaliser, much to the delight of the Scottland bench and travelling fans.\n\nThe late goal left Highlanders frustrated, as it was the second consecutive match where they had failed to hold onto a lead.Scottland, who had been coming off a defeat to Ngezi Platinum Stars in their previous match, will be relieved to have earned a draw despite not being at their best.\n\nPeter Muduhwa, captaining Scottland in the absence of Walter Musona, was solid at the back, and his leadership helped Scottland maintain composure, especially after going behind late in the game.Teams\n\nHighlanders: Raphael Pitisi (gk), Talent Dube (Archford Faira, 78mins), Arthur Ndlovu, Brian Mlotshwa, McKinnon Mushore (Nqobile Ndlovu, 66mins), Melikhaya Ncube, Reason Sibanda, Brighton Ncube (Tendai Muvuti, 78mins),Andrew Mbeba, Mason Mushore, Never Rauzhi.\n\nScottland: Nelson Chadya (gk), Tichaona Chipunza, Michael Tapera, Peter Muduhwa, Gareth Madhake, Kevin Moyo, Ronald Pfumbidzai (Kudzai Jason, 86mins),Panashe Mutimbanyoka (Walter Musona, 66mins), Lynoth Chikuhwa (Khama Billiat, 66mins), Vassili Kawe, (Nathan Mutasa, 86mins), Fredrick Botchway (Mthokozisi Msebe, 54 mins)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/45yy.jpg",
            "description": "Innocent Kurira At Barbourfields Stadium Highlanders 1-1 Scottland A dramatic last-minute header from Mthokozisi Msebe salvaged a point for Scottland in a thrilling 1-1 draw against Highlanders at Barbourfields Stadium on Sunday afternoon. Msebe’s header in the dying moments of the game silenced the Bosso faithful, who had been celebrating what they thought was a […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Neighbourhood watch member narrowly escapes death",
            "url": "https://www.chronicle.co.zw/neighbourhood-watch-member-narrowly-escapes-death/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nA NEIGHBOURHOOD Watch Committee (NWC) member in Bulawayos Nketa suburb narrowly escaped a bullet fired by one of three armed men they had confronted during a night patrol.\n\nThe latest incident, which occurred in the early hours of Saturday, comes as the city continues to grapple with escalating gun violence.\n\nA week ago, Sergeant Abel Masava, a police officer, was fatally shot while attending a crime scene in Tshabalala suburb.Sgt Masava was attending a scene with another officer and two complainants when he approached a group of five men. One of the suspects pulled out a firearm and shot him in the head, leading to his immediate death.\n\nThe Nketa incident involved Mr Yeki Ncube, a member of the Nketa 8 Neighbourhood Watch Committee, who was on patrol with two other members.\n\nThey encountered three men carrying bags and requested to search them. Mr Ncube said the suspect initially resisted the search request, claiming he and his accomplices were innocent.\n\nMoments later, another suspect brandished a knife while his accomplice drew a firearm and fired a shot aimed at Mr Ncube, who miraculously escaped injury and possible death. The attackers fled into the darkness after the shooting.\n\nI still cant believe how the bullet missed hitting me. The guy just pulled out a gun and fired a single shot aimed at me, Mr Ncube recounted. He suspected that the men might have just robbed a house in the area.\n\nThe community is now living in fear, with residents expressing concerns about their safety. Mr Golden Gadzirayi Nyambuya, a Nketa resident, said: We are no longer safe when armed men are roaming around in our streets at night. Neighbourhood Watch Committee members patrol the suburb voluntarily, and now their lives are in danger.Secretary of the Nketa 8 B2 Square Residents Association Mr Prince Manditerera called on the police to deploy armed officers to patrol alongside the neighbourhood watch members to enhance security.\n\nThe presence of an armed police officer would act as a deterrent to these thugs. Right now, our neighbourhood watch members are risking their lives patrolling the area without any means to defend themselves, he said.\n\nMr Manditerera called for tougher measures to curb the rising cases of gun-related crime, including tighter gun control regulations and increased police visibility in crime-prone areas.\n\nWe appreciate the work that the police are doing, but we need a stronger partnership to combat crime, he said.Bulawayo has been grappling with a disturbing rise in armed robbery cases, with criminals increasingly using firearms to terrorise residents.\n\nFuel service stations have also become prime targets, forcing business owners to alter their operating hours by closing early instead of remaining open 24 hours for security reasons.\n\nEarlier this month, six armed robbers were gunned down by police detectives at a tollgate along the Bulawayo-Victoria Falls Road. The gang had earlier in the night robbed a grocery store in Juba, Insuza, in Umguza District.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hnh.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw A NEIGHBOURHOOD Watch Committee (NWC) member in Bulawayo’s Nketa suburb narrowly escaped a bullet fired by one of three armed men they had confronted during a night patrol. The latest incident, which occurred in the early hours of Saturday, comes as the city continues to grapple with escalating gun violence. A week […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Inaugural Miss Ebony Zimbabwe 2025 crowned",
            "url": "https://www.chronicle.co.zw/inaugural-miss-ebony-zimbabwe-2025-crowned/",
            "content": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub\n\nREIGNING Miss University of Zimbabwe (UZ), Chengeto Kanyai, was crowned Miss Ebony Zimbabwe 2025 on Friday, edging out Bulawayos Samukele Dlamini (1st Princess) and Masvingos Lerato Masocha (2nd Princess) for the coveted title.\n\nThe pageant, held in Harare under the theme Empowering Through Diversity, adopted a virtual format, similar to Miss Worlds approach during the Covid-19 era. Organisers cited unforeseen circumstances as the reason for the shift. Originally scheduled to take place at Robbi Mupawose, Harare Agricultural Showgrounds, the event was relocated to Mudziyashe.\n\nFor her victory, Kanyai, a Business Management (Systems Design and Applications) student, will represent Zimbabwe on a Pan-African platform in Johannesburg, South Africa, where she will promote the message of decolonised beauty and empowerment across the continent.\n\nSpeaking to Zimpapers Arts & Entertainment Hub, Kanyai expressed her excitement about winning, especially considering this was only her second pageant.\n\nI ventured into modelling last year, and Miss UZ was my first trial. Im thrilled to have been crowned Miss Ebony Zimbabwe and look forward to representing the country in South Africa. Im grateful to the organisers for giving me this opportunity.\n\nShe said the pageant and the opportunity to represent Zimbabwe on a global stage will have a lasting impact.Its a platform that allows me to celebrate my heritage, culture and roots while also shedding light on the challenges and triumphs that Zimbabwean women face every day. As a model, I have the opportunity to redefine what it means to be a Zimbabwean woman  to challenge stereotypes and inspire a new generation of young girls and women to see themselves in a positive light.\n\nFor me, representing Zimbabwe is not just about wearing a crown or holding a title; its about being a symbol of hope, strength and inspiration for my fellow Zimbabweans.\n\nKanyai admitted she was initially hesitant about entering pageantry.Ive always loved modelling, but sometimes parents are sceptical about such things, so I never had the platform to try it out. However, when I enrolled at university, I decided to go for it. Now, my family are my biggest supporters and Im glad I followed my passion.\n\nMeanwhile, Samukele Dlamini, a Bulawayo Polytechnic student, had a remarkable debut, securing 1st Princess and winning the Peoples Choice Award in her first-ever pageant.I was eyeing the crown, but Gods will was done. Im just happy to have been part of it, and the lessons Im taking with me are invaluable. My passion for entrepreneurship was also reignited during boot camp, so I know Im on the right path, Dlamini said.\n\nLooking ahead, Dlamini is already considering other pageants.Ill be preparing and perfecting my walk before deciding which one to enter, but Im definitely eyeing Miss Earth and Miss Environment.\n\nWhile Miss Ebony Zimbabwe 2025 was crowning its queen, the Miss Teen of the Universe Zimbabwe pageant was also making headlines. At De Lux Villa and Conference Centre in Bulawayo, the competition narrowed down to its final 15 contestants, who will compete for the Miss Teen of the Universe Zimbabwe crown in Harare this July.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/65y.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub REIGNING Miss University of Zimbabwe (UZ), Chengeto Kanyai, was crowned Miss Ebony Zimbabwe 2025 on Friday, edging out Bulawayo’s Samukele Dlamini (1st Princess) and Masvingo’s Lerato Masocha (2nd Princess) for the coveted title. The pageant, held in Harare under the theme “Empowering Through Diversity”, adopted a virtual format, […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Economists hail tight monetary policy",
            "url": "https://www.chronicle.co.zw/economists-hail-tight-monetary-policy/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nECONOMISTS have applauded the Governments tight monetary policy stance, stating that it has subdued inflation and anchored exchange rate stability.\n\nTight monetary policy involves limiting the money supply and credit availability by raising interest rates, while tight fiscal policy entails reducing Government spending, thus limiting the liquidity available to chase goods and services.\n\nZimbabwes economy has previously suffered from excessive money creation through various channels, including the Governments access to the central bank window to fund key public programmes.\n\nAccording to the Zimbabwe National Statistics Agency (ZimStat), the March weighted month-on-month inflation rate was zero percent, shedding 0,3 percentage points from the February rate of 0,3.\n\nZimStat also reported that the US dollar inflation rate for March was 0,1 percent, down from last months rate of 0,2, while the ZigG rate stood at -0,1 percent, down from 0,5 percent in March.\n\nEconomist Mr George Nhepera said that, while the country may not want to raise expectations too much for now, the reality of the current inflation figures suggests that the country has, at last, managed to subdue and control inflation to lower levels.All this has been due to the implementation of a tight monetary policy by the central bank and fiscal prudence and discipline by the Government, said Mr Nhepera.\n\nGone are the days of lack of coordination with respect to the two legs of monetary policy and fiscal or national budget management.\n\nTight, or contractionary, monetary policy is a course of action undertaken by central banks to slow down overheated economic growth.\n\nAs such, the RBZs tight monetary policy stance has anchored price and exchange rate stability across the market.Inflation in Zimbabwe tracks the movement in the exchange rate, meaning that stability in the domestic currency, which is influenced by the level of money supply in the economy, is one of the most critical factors in maintaining stability.\n\nAccording to the World Bank, there was a significant surge in money supply at the beginning of 2024, but a hawkish monetary policy, following the introduction of ZWG in April last year, has restored price stability.\n\nZimbabwe experienced high inflation in the first quarter of 2024, amid significant expenditure on key infrastructure, rekindling fears that the country could plunge into hyperinflation, similar to what happened in 2008, which wiped out peoples hard-earned savings and pensions.\n\nThe country is charting a completely new course, with low inflation and a stable exchange rate, which businesses say, if sustained, could support long-term growth and allow greater predictability in the economy.\n\nDr Prosper Chitambara said there was a need for the Government to address the cost of doing business issues to promote competitiveness and improve livelihoods.\n\nThis comes at a time when the annual inflation rate on the US dollar continues to be high, with the March rate standing at 15 percent.\n\nThe increase in the US dollar annual inflation is a concern. This year the numbers have been on the high side. In February, it was 15,1 percent, and now it is at 15 percent, said Dr Chitambara.This makes Zimbabwe very uncompetitive, driven by a number of factors, including the issue of taxes.I think there is a lot that needs to be done, and Im happy that the Government is in the process of reviewing taxes, including the high cost of doing business.\n\nHe said taxes contribute to the high cost of doing business, affecting all sectors, with the fuel sector seeing prices higher than in other countries across the region.So, there is a need to quickly address the business environment, including reviewing some of our taxes, simplifying the doing business environment, and the tax administration process, making it easier for businesses. This will also have a bearing on inflation and the cost of living for households, said Dr Chitambara. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/trhh.jpg",
            "description": "Sikhulekelani Moyo, sikhu.moyo@chronicle.co.zw ECONOMISTS have applauded the Government’s tight monetary policy stance, stating that it has subdued inflation and anchored exchange rate stability. Tight monetary policy involves limiting the money supply and credit availability by raising interest rates, while tight fiscal policy entails reducing Government spending, thus limiting the liquidity available to chase goods and […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Prisoners at the centre of food production",
            "url": "https://www.chronicle.co.zw/prisoners-at-the-centre-of-food-production/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nWHEN Knowledge Mnkandla was sentenced to 30 months in prison for housebreaking and theft in July last year, he never imagined that his time behind bars would transform his life.\n\nNot only has he acquired a new skill, but he is now playing a role in feeding fellow inmates across Zimbabwe and contributing to the countrys food security.\n\nThe repeat offender had resigned himself to a life of hardship in prison after a Bulawayo magistrate convicted him. He was transferred to Anju Farm Prison, a correctional facility in Nyamandlovu, Matabeleland North, which houses inmates serving sentences of 36 months or less.\n\nExpecting to spend his time in confinement idly, Mnkandla was surprised to find that inmates at Anju Farm Prison were not merely serving time  they were required to engage in practical skills training. The facility offers various vocational courses designed to equip prisoners with useful skills for life after incarceration.\n\nI initially enrolled in a mechanics course and enjoyed it, but I was always drawn to what the other prisoners were doing in the garden and on the farm. Farming intrigued me, so I requested to switch courses, said Mnkandla.\n\nThe officers approved his request, and he joined an agriculture class, focusing on growing vegetable seedlings, and his decision paid off.\n\nLast week, he had the rare opportunity to showcase his newfound expertise to Zimbabwe Prisons and Correctional Services (ZPCS) Commissioner-General Moses Chihobvu and a delegation that included Agricultural and Rural Development Authority (Arda) board chairman Mr Ivan Craig. They were touring Anju Farm Prison to assess its agricultural activities.\n\nDuring the visit, Mnkandla impressed the delegation, particularly Mr Craig, with a detailed presentation on how inmates cultivate cabbage seedlings for sale to horticulture farmers in the region.\n\nWe dont plant the seeds in ordinary soil, which may contain diseases affecting growth. Instead, we use specially prepared soil placed in trays suspended a few inches above the ground, he explained.\n\nEach tray holds between 200 and 240 seedlings, and currently, we have 42000 seedlings ready for distribution.Anju Farm Prison has built two small greenhouses for the seedling project, with plans to expand and produce over 100 000 seedlings at any given time.\n\nAnju Farm\n\nFor Mnkandla, the project is more than just a prison activity. Its a stepping stone to a brighter future. When released, he plans to replicate the project on his familys land in Inyathi, Bubi District.\n\nThe land is available, but my biggest challenge will be water access. If I can secure funds to sink a well, buy seeds, and purchase trays, I believe I can make a living from this, he said.\n\nBeyond seedling production, Anju Farm Prison is heavily invested in crop cultivation, with 35 hectares under maize production. The field, nearly ready for harvesting, is a testament to the inmates dedication.One of the prisoners, Charles Machipisa, nicknamed Gokwe after his hometown, spoke passionately about the maize project.\n\nBack home, we grew maize, but since coming to Anju Farm Prison, Ive learnt so much more. Farming is a full-time job that requires patience and attention to detail. The support from prison authorities has been incredible, and Ill leave here as a better farmer and a better man, he said.\n\nAnju Farm Prison exemplifies how correctional facilities can go beyond rehabilitation to foster self-sufficiency and skill development. The prison produces maize, winter wheat, sugar beans, cabbages, and butternuts, contributing significantly to food security.\n\nThe farm thrives year-round, supported by a centre-pivot irrigation system, five electric boreholes, and a 4-million-litre reservoir.\n\nIn 2016, ZPCS signed a memorandum of understanding (MoU) with Arda to enhance agricultural activities in correctional facilities across the country.\n\nThe MoU that we signed with Arda some years ago means that ZPCS can leverage the labour that we have in the form of prisoners as part of the rehabilitation and reintegration process to venture into commercial farming with Arda supporting us with technical skills and expertise, said Comm-Gen Chihobvu.\n\nBeyond crop production, Anju Farm boasts projects in goat breeding, cattle rearing, poultry farming, and fisheries.These ventures further diversify income streams while providing inmates with practical skills applicable after their release.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/oiu.jpg",
            "description": "Raymond Jaravaza, raymond.jaravaza@chronicle.co.zw WHEN Knowledge Mnkandla was sentenced to 30 months in prison for housebreaking and theft in July last year, he never imagined that his time behind bars would transform his life. Not only has he acquired a new skill, but he is now playing a role in feeding fellow inmates across Zimbabwe and […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "SWAN Music Fest lights up Bulawayo",
            "url": "https://www.chronicle.co.zw/swan-music-fest-lights-up-bulawayo/",
            "content": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub\n\nChristmas seemed to have arrived early for thousands of live music enthusiasts who were treated to an unforgettable night at the SWAN Music Festival on Saturday evening. The event, held at White City Stadium in Bulawayo, saw local and regional artistes take to the stage, delivering electrifying performances to an audience of over 4 000 people.\n\nThe festival marked the official launch of the SWAN cigarette range. Entry to the event was affordably priced at $1, which included two packs of Swan cigarettes. The launch followed similar events in Beitbridge, Mutare, and Harare.\n\nInsimbi ZeZhwane\n\nA line-up of local music heavyweights graced the stage, including Madlela Sikhobokhobo, Sandra Ndebele, Awa Khiwe, Insimbi ZeZhwane, Iyasa, Ma9nine, and DJ Mzoe. The Harare contingent was led by legendary Sungura icon Alick Macheso, alongside Andy Muridzo, Shinsoman, Winky D, and King Shaddy. Their performances kept the massive crowd entertained well into the early hours of the morning.\n\nAdding a regional flair to the event were South African stars, including hip-hop sensation Kwesta, Umlando hit-maker Toss, and Murumba Pitchs Maeywon. Botswanas Vee Mampeezy also made an energetic appearance, much to the delight of fans.\n\nThe event kicked off at 5pm with Andy Muridzo, who delivered a solid performance before dashing off to another event in Gokwe. He was followed by Iyasa, who wowed the audience with their signature fusion of traditional dances, Amarabi, and Pantsula moves. Their high-energy routine set the stage for Sandra Ndebele and Ma9nine, both of whom delivered impressive sets.\n\nGerman-based Rap goddess Awa Khiwe displayed a polished performance at the SWAN music festival\n\nAt around 10pm, Germany-based rap queen Awa Khiwe took to the stage, commanding attention with her powerful performance of hits including Rap Gandaganda. Speaking after her set, Awa Khiwe expressed her excitement at performing in Zimbabwe.\n\nIt feels amazing to be home and to perform for such a massive crowd. I was thrilled to see people singing along to my music, she said.\n\nMzansi star Toss followed with an electrifying performance that had the crowd hyped, especially the ladies, as he showed off his signature dance moves and chiselled six-pack while performing Umlando. Murumba Pitchs Maeywon kept the energy levels high with his melodic set before South African hip-hop heavyweight Kwesta took over.Kwesta had the audience singing along as he performed some of his biggest hits, including Ngudu featuring Cassper Nyovest, Mayibabo, and Ngiyazifela Ngawe.\n\nCassper Nyovest and Winky D\n\nBotswanas Vee Mampeezy, one of the nights standout acts, made a dramatic entrance by walking through the crowd before taking the stage at midnight. His electrifying performance was one of the highlights of the event.\n\nIts truly an honour to be back in Zimbabwe, especially in Bulawayo. My first-ever performance outside Botswana was here 20 years ago. The energy from the crowd was insane  Ive performed in stadiums back home, but Ive never seen such an excited audience, said Vee Mampeezy, who closed his set with his hit song Selector.\n\nWinky D took to the stage at 1am, delivering a flawless two-hour performance packed with back-to-back hits, leaving fans in awe. At 3am, sungura legend Alick Macheso  affectionately known as Cheso Power  stepped on stage. With his signature bass guitar in hand, he treated fans to a spectacular three-hour performance, wrapping up the festival at sunrise at 6am.\n\nThe SWAN Music Festival was nothing short of a spectacular celebration of music, talent, and culture, leaving fans eagerly anticipating the next edition.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/867i.jpg",
            "description": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub Christmas seemed to have arrived early for thousands of live music enthusiasts who were treated to an unforgettable night at the SWAN Music Festival on Saturday evening. The event, held at White City Stadium in Bulawayo, saw local and regional artistes take to the stage, delivering electrifying performances […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Dynamos win at last",
            "url": "https://www.chronicle.co.zw/dynamos-win-at-last/",
            "content": "Eddie ChikamhiZimpapers Sports HubDynamos1-0 Simba Bhora\n\nFOR three long weeks, the goals refused to come.The frustration mounted. The pressure built. A proud football institution looked lost, toothless, but at Rufaro Stadium on Sunday, Dynamos finally remembered who they are. And they did it against the biggest possible scalp.\n\nMidfielder Shadreck Nyahwa was the unlikely hero as the Glamour Boys ended their winless run with a gritty 1-0 victory over reigning champions Simba Bhora, a result that could prove to be a turning point in their stuttering campaign.\n\nThe winning moment came in the 54th minute and was less a masterstroke and more a reward for persistence, and a slice of good fortune. A defensive howler by Simba Bhoras William Thole and Isheanesu Mauchi gifted Nyahwa the ball inside the box after a short corner was lofted back in by Nomore Chinyerere. The two defenders clashed in a moment of miscommunication, and Nyahwa pounced with precision, calmly rolling the ball into an empty net.\n\nThe relief was as loud as the goal celebration. For the first time in four matches, a Dynamos player had scored. The spell had been broken.\n\nIm grateful for the performance by my team. They stuck to instructions, said Dynamos coach Lloyd Chigowe, visibly relieved after the final whistle.\n\nWe knew pretty well that after beating Simba Bhora in the Castle Challenge Cup, they would come at us. But we also knew we had to absorb pressure and take our chances  and indeed, we got that one opportunity and made it count.Dynamos had started the season with three successive draws, scoring just once through an own goal. The criticism was growing louder with each match, and Chigowe knew another poor result would turn up the heat even more.\n\nThis time, though, his players delivered.Captain Emmanuel Jalai, often a silent workhorse, stepped up with a commanding display. The right-back was the heartbeat of the team, snuffing out threats, charging forward, and leading by example with a performance full of fight and conviction.\n\nWe suffered a little bit today, but in the end, a sweet three points, Chigowe said.When a team goes unbeaten, its a sign of strength. That we were not getting the three points, sometimes its due to circumstances beyond our control.\n\nThe coach still hasnt forgotten the 1-1 draw against TelOne last week, and he made sure to remind everyone about it.The second goal we scored against TelOne was a clear goal. Watching the replay, theres no way it should have been disallowed. That day, we scored two, but unfortunately, that was beyond a coachs control, he said.\n\nI still believe this team has a lot of talent. Going forward, well give a number of other youngsters a chance to showcase themselves. Its going to be a dog-eat-dog season  no game will be easy. For Simba Bhora, it was a painful lesson. After going three games unbeaten and not conceding a single goal, the champions were undone by a moment of carelessness and a lack of creativity up front.\n\nCoach Joel Luphahla had freshened things up with a triple substitution at the break, bringing on Blessed Ndereki, Trevor Mavhunga, and Tinotenda Meke. The intention was clear: inject pace and attacking urgency. But the changes didnt spark the desired response. By the time he introduced former Dynamos star Donald Mudadi and forward Malvin Hwata in the 70th minute, the damage had already been done.\n\nYeah, this thing was hanging over our shoulders, said Luphahla, reflecting on the pressure of being the only team yet to concede before this match.\n\nI only got to know yesterday that we were the only ones with a clean sheet. Maybe that built some pressure. Unfortunately, our goalkeeper also conceded, and it was a soft goal.\n\nLuphahla refused to throw his players under the bus.Mistakes happen. Somebody has to make a mistake for a game to be decided, and unfortunately, it was us. It was our goalkeeper, after three clean sheets.\n\nBut maybe now that the mark is off our backs, we can play our football without pressure. Sometimes, its harder when youre unbeaten because that streak starts weighing on you.\n\nIt wasnt a classic by any means. The first half was cagey, scrappy, and devoid of real quality. Simba Bhora looked sharper in possession but failed to create meaningful chances, while Dynamos seemed determined to keep things tight and grow into the contest.\n\nThe game only sparked to life after 39 minutes when Simba skipper Blessing Moyo forced Dynamos goalkeeper Prince Tafiremutsa into a full-stretch save from a curling free-kick destined for the top corner.\n\nMoments after the restart, Dynamos responded. Leeroy Mavhunga burst down the left and squared for Frank Agyemang, but Thole produced a sharp save. That move was a warning, and five minutes later, Simba Bhoras luck ran out.\n\nFrom a short corner on the right, Nomore Chinyerere swung in a teasing ball. The two defenders hesitated, and Nyahwa made them pay.\n\nThe Ghanaian Agyemang should have doubled the lead just after the hour, but he fluffed a golden chance, ballooning his shot over the bar after being teed up once again by the lively Mavhunga.\n\nDespite Simba Bhora throwing everything forward in the final 15 minutes, Dynamos held firm. Tafiremutsa remained composed, while Jalai and Chinyerere marshalled the backline with grit and discipline.\n\nThe win lifted Dynamos into sixth place in the standings with six points from four games, and crucially, it infused confidence into a team that had seemed short on belief.\n\nSimba Bhora, on the other hand, dropped to 12th, still on five points. They remain a dangerous side, but the spark that defined their championship-winning run last year seemed absent on this outing.\n\nLuphahlas final word summed up a frustrating day for the visitors:Its always difficult when you have not lost. Now weve lost and conceded  so the pressure is gone. But we have to correct\n\nwhat went wrong today and respond strongly in the next game.\n\nTeams:Dynamos: Prince Tafiremutsa, Emmanuel Jalai, Tendai Magwaza, Nomore Chinyerere, Clive Mandivei, Shadreck Nyahwa, Frank Agyemang (E. Chikona 72), Tellmore Pio, Vhusa Ngwenya, Leeroy Mavhunga (A. Gwatidzo 81), Valentine Kadonzvo (R. Chingwara 76)Simba Bhora: William Thole, Chris Makambira (T. Mavhunga 46), Webster Tafa, Isheanesu Mauchi, Blessing Moyo, Ishmael Nyanhi (T. Meke 46), Butholezwe Ncube, Junior Makunike (B. Ndereki 46), Emmanuel Ziocha (D. Mudadi 70), Isakar Gurirab, William Manondo (M. Hwata 70)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ju.jpg",
            "description": "Eddie Chikamhi Zimpapers Sports Hub Dynamos1-0 Simba Bhora FOR three long weeks, the goals refused to come. The frustration mounted. The pressure built. A proud football institution looked lost, toothless, but at Rufaro Stadium on Sunday, Dynamos finally remembered who they are. And they did it against the biggest possible scalp. Midfielder Shadreck Nyahwa was […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        },
        {
            "title": "Vice President Mohadi tours Uhuru Day celebrations venue",
            "url": "https://www.chronicle.co.zw/vice-president-mohadi-tours-uhuru-day-celebrations-venue/",
            "content": "Patrick Chitumba,[emailprotected]\n\nVICE-PRESIDENT Kembo Mohadi has expressed satisfaction with the progress of work at Mutora Business Centre in Nembudziya, which will host Zimbabwes 45th Independence Day celebrations.\n\nLeading an inter-ministerial delegation to Gokwe North District last Friday, VP Mohadi assessed infrastructure development, roadworks and funding allocations, commending the teams efforts. This years Independence Day celebrations will be held under the theme: Zim @45: Devolve and Develop Together Towards Vision 2030.\n\nThe main celebrations on April 18 will be preceded by a childrens party at Nyamuroro Primary School on April 17 at Mutora Business Centre.\n\nVP Mohadi expressed confidence that preparations would be completed in time.I have seen significant progress, and I am sure that by the time we hold the celebrations, everything will be in place. We need to maintain this momentum because where there are no roads, there is no development, he said.\n\nHe noted that hosting the Independence Day celebrations in Gokwe North was a major milestone for the local community, bringing much-needed socio-economic development.\n\nWe needVice-President Kembo Mohadi (left) addresses Government Ministers during tour of Independence Day celebrations venue in Nembudziya, Gokwe North to maintain our roads. Development is not just about cities. It is about rural areas where we get our votes. The team on the ground has done a commendable job. With experience, we are seeing progress, and that is very encouraging, he said.Deputy Chief Secretary to the President and Cabinet (Finance, Administration, and Human Resources), Mr Zvinechimwe Churu, said the necessary funds had been disbursed to facilitate various civil works.\n\nPreparations have gathered momentum. The release of over US$14 million has propelled development. Turf at the ground is now at 95 percent, changing rooms at 65 percent, and terraces at ground level. Local schools are also receiving attention, he said.\n\nChanging rooms and grand stands under construction at the Independence Day celebrations venue\n\nMidlands Minister of State for Provincial Affairs and Devolution, Owen Ncube, expressed satisfaction with the pace of the projects and assured that they would be completed on time.\n\nWe are now over 70 percent complete. We have started disbursing funds to contractors and introduced a 24-hour work schedule. We are confident that everything will be ready for the celebrations, he said.Minister of Local Government and Public Works, Daniel Garwe, noted that most of the required materials were already on site.\n\nI am informed that by April 10, all major works will be completed. The changing rooms are ready for roofing, and the enthusiasm shown by the teams on the ground is impressive. Key roads and feeder roads are also receiving the necessary attention, he said.\n\nLocal Government Minister Daniel Garwe\n\nThe Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, said a communication strategy was also being implemented to ensure that the celebrations are well attended.\n\nDr Jenfan Muswere\n\nWe have come up with a sound communication strategy to publicise the event. We have lined up some radio and television programmes to inform the people about the event.\n\nThis is a critical event on our national calendar. We need to do justice so that people can come and enjoy their independence from colonial rule, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/tgcv.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw VICE-PRESIDENT Kembo Mohadi has expressed satisfaction with the progress of work at Mutora Business Centre in Nembudziya, which will host Zimbabwe’s 45th Independence Day celebrations. Leading an inter-ministerial delegation to Gokwe North District last Friday, VP Mohadi assessed infrastructure development, roadworks and funding allocations, commending the team’s efforts. This year’s Independence Day […]",
            "time": "09:10",
            "date": "31 Mar 2025"
        }
    ]
}