{
    "news": [
        {
            "title": "Fugitive bogus estate who conned Bulawayo home seekers of US$153k, sentenced to 29 years in prison",
            "url": "https://www.chronicle.co.zw/fugitive-bogus-estate-who-conned-bulawayo-home-seekers-of-us153k-sentenced-to-29-years-in-prison/",
            "content": "Trish Mukwazo[emailprotected]\n\nMPUMELELO Mhlanga the fake estate agent from Bulawayo was today sentenced to 29 years and two months in jail for defrauding seven people of US$153 034 under the guise of selling houses and stands.Mhlanga (40) of Douglasdale suburb the sole proprietor of Ihawu Holdings who was yesterday convicted of defrauding four victims of a total of US$86 564 was also convicted of defrauding three victims of US$66 470In passing the sentence Bulawayo Regional magistrate Mrs Dambudzo Malunga said Mhlanga orchestrated an elaborate scheme to defraud unsuspecting buyers from 2017 to 2024.The police launched a manhunt for him in 2021 after he went on the run and he was incarcerated in May 2024.Mrs Malunga convicted Mhlanga of forgery, seven counts of fraud and operating as an unregistered estate agent.He will, however, serve an effective eight years and two months in jail after Mrs Malunga suspended 4 years on condition that he restitutes four victims of their money.Mrs Malunga further suspended 17 years on the condition that Mhlanga doesnt commit a similar offence within the next five years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/UKT-680x360.jpg",
            "description": "Trish Mukwazo trishmukwazo515@gmail.com MPUMELELO Mhlanga the fake estate agent from Bulawayo was today sentenced to 29 years and two months in jail for defrauding seven people of US$153 034 under the guise of selling houses and stands. Mhlanga (40) of Douglasdale suburb the sole proprietor of Ihawu Holdings who was yesterday convicted of defrauding four […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Bulawayo housing administration reports decline in cessions for November 2024",
            "url": "https://www.chronicle.co.zw/bulawayo-housing-administration-reports-decline-in-cessions-for-november-2024/",
            "content": "Online WriterTHE City of Bulawayo processed fewer housing cessions in November 2024 compared to the previous month, according to a report presented by the Director of Housing and Community Services on 5 December 2024.Cession refers to the formal giving up of rights, property, or territory.The report detailed activities across the citys 11 Housing Administration offices, which handle matters related to deceased estates, court orders, voluntary transfers, and home ownership conversions for properties under long-term leases or agreements of sale.It highlighted a total of 70 cessions processed in November, marking a decline from the 82 cessions recorded in October. The breakdown of Novembers statistics is as follows: Deceased Estates: 24 cessions processed, down from 33 in October. Court Orders: 3 cessions processed, compared to 4 in October. Voluntary Transfers/Resales: 42 transactions, slightly down from 45 in October. Conversion to Home Ownership: 1 cession recorded, up from none in October.The Pumula office recorded the highest number of voluntary transfers in November, with 12 transactions. Meanwhile, Cowdray Park handled the most deceased estate cessions, totalling 11.The report noted that the Housing Administration section is responsible for facilitating cessions for properties under various lease and sale agreements. However, the decline in cessions was not attributed to specific challenges or operational disruptions.Bulawayos Housing Administration offices play a vital role in regularising property ownership and ensuring smooth transitions in cases of inheritance, resales, and legal orders. The city operates 11 offices located in Nketa, Mpopoma, Mzilikazi, Lobengula, Entumbane, Tshabalala, Magwegwe, Pumula, Nkulumane, Luveve, and Cowdray Park.As the city continues to expand, these offices are essential in maintaining order in housing administration and addressing the growing demand for property regularisation services.The Housing and Community Services Department is expected to monitor the trends in cessions closely and address any factors contributing to fluctuations in the numbers. Residents are encouraged to approach their local Housing Administration offices for assistance with property-related matters.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/BCC-LOGO.jpg",
            "description": "Online Writer THE City of Bulawayo processed fewer housing cessions in November 2024 compared to the previous month, according to a report presented by the Director of Housing and Community Services on 5 December 2024. Cession refers to the formal giving up of rights, property, or territory. The report detailed activities across the city’s 11 […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Bulawayo City Council implements key resolutions for housing and infrastructure",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-implements-key-resolutions-for-housing-and-infrastructure/",
            "content": "Online WriterThe Bulawayo City Council has commenced the implementation of key resolutions aimed at addressing housing regularisation and infrastructure development, according to a report presented by the Director of Housing and Community Services on 5 December 2024.Approved during a council meeting on 4 December 2024, the resolutions, focus on critical urban development initiatives, including the repossession and regularisation of residential stands and the introduction of a social infrastructure levy.The Council approved the repossession and regularisation of 94 residential stands in Cowdray Park under the Hlalani Kuhle/Garikai programme. This initiative aims to ensure compliance with city planning regulations and improve living conditions in the area.Another significant resolution was the introduction of a social infrastructure levy on stand sales and subdivisions across Bulawayo. The levy is expected to generate revenue for the development of essential infrastructure, including schools, clinics, and roads. Implementation of this initiative is also ongoing.The report noted other items discussed during the meeting, primarily reports for information purposes, which were all approved by the Council.While the initiatives are underway, the report did not elaborate on specific timelines for completion or potential challenges. However, councillors have previously highlighted issues such as funding constraints and administrative bottlenecks as obstacles to efficient project implementation.The regularisation of stands in Cowdray Park comes as Bulawayo faces increasing pressure to address housing shortages and ensure orderly urban development. The social infrastructure levy, meanwhile, aligns with efforts to meet the growing demand for public amenities in the citys expanding suburbs.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/BCC-LOGO.jpg",
            "description": "Online Writer The Bulawayo City Council has commenced the implementation of key resolutions aimed at addressing housing regularisation and infrastructure development, according to a report presented by the Director of Housing and Community Services on 5 December 2024. Approved during a council meeting on 4 December 2024, the resolutions, focus on critical urban development initiatives, […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Bulawayo records 11 percent drop in outpatient attendance for November 2024",
            "url": "https://www.chronicle.co.zw/bulawayo-records-11-percent-drop-in-outpatient-attendance-for-november-2024/",
            "content": "Online writer\n\nBULAWAYOS healthcare facilities recorded an 11 percent decline in outpatient department (OPD) attendances in November 2024 compared to October, according to the latest data from the citys health department.\n\nThe total number of OPD visits dropped from 67 514 in October to 60 114 in November, with both new and repeat patients contributing to the decline. New patient visits decreased from 47 701 to 41 850, while repeat visits fell from 19 813 to 18 254 over the same period.\n\nAlthough the report does not explicitly state the reasons for the drop in outpatient attendance, health experts suggest several possible factors, including reduced seasonal illnesses, transport challenges, or financial constraints among patients. Novembers figures could also reflect improved health outcomes from Octobers surge, which may have included cases requiring follow-up visits that were no longer necessary in November.\n\nThe decline in OPD attendance comes against the backdrop of Bulawayos ongoing efforts to strengthen healthcare service delivery. Over the past months, the city has faced challenges ranging from disease outbreaks to operational constraints in various healthcare facilities.\n\nIn October, the city experienced heightened health activity, with a significant number of diarrhoea and influenza cases reported. This surge likely influenced the higher outpatient attendance figures in that month. The health department has since implemented targeted interventions, including community health education campaigns, which may have contributed to the reduced caseload in November.\n\nThe reduction in outpatient visits raises important questions about accessibility and the overall state of healthcare in the city. While a drop in attendance could indicate better public health outcomes, it may also signal underlying issues such as a lack of access to healthcare or public awareness of available services.\n\nBulawayos health department has consistently faced resource challenges, including staff shortages and equipment breakdowns, as highlighted in recent Council reports. These factors could also have indirectly impacted outpatient attendance, particularly in high-demand facilities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/08/Untitled-1-copy-6.jpg",
            "description": "Online writer BULAWAYO’S healthcare facilities recorded an 11 percent decline in outpatient department (OPD) attendances in November 2024 compared to October, according to the latest data from the city’s health department. The total number of OPD visits dropped from 67 514 in October to 60 114 in November, with both new and repeat patients contributing […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Grave digging crisis hits Bulawayo Cemeteries as equipment breakdown persists",
            "url": "https://www.chronicle.co.zw/grave-digging-crisis-hits-bulawayo-cemeteries-as-equipment-breakdown-persists/",
            "content": "Online Writer\n\nTHE Bulawayo City Council is facing a mounting crisis in cemetery operations as the continued breakdown of the JCB grave digger has forced cemetery staff to resort to manual grave production.\n\nThis situation, coupled with high demand during the festive season and soaring temperatures, has sparked concerns about staff welfare and operational efficiency.\n\nAccording to a report presented to the Council, a total of 118 tombstones were installed across Bulawayos cemeteries in November, generating $4 522 in revenue. West Park Cemetery recorded the highest number of installations at 49, followed by Athlone Cemetery with 28, Luveve Old Cemetery with 22, Luveve Extension with nine, Hyde Park with eight, and Umvutsha Cemetery with only two tombstones installed. However, a single case of non-compliance regarding headstone installation was noted at Athlone Cemetery.\n\nThe prolonged breakdown of the JCB grave digger, which has been out of service for nearly two months, has placed a significant strain on cemetery staff. Councillor K. Ndlovu commended the departments efforts in producing graves manually but highlighted the physical toll on workers.\n\nTemperatures are extremely high, and staff members are currently required to produce at least two graves per week manually. This condition needs to be reviewed, and more staff should be recruited to reduce the workload to one grave per week per staff member, she said.\n\nDeputy Chairperson Councillor S. Moyo expressed concern over the disparities in grave production between cemeteries. Luveve Cemetery had more graves produced compared to Umvutsha Cemetery, where residents have raised complaints about a lack of graves. She also pointed out that most cemetery staff have been working on contract since 2019/2020, and their permanent employment could improve motivation and productivity.\n\nThe Director of Health Services Dr Edwin Sibanda confirmed that hiring equipment was considered, but procurement challenges through the Procurement Regulatory Authority of Zimbabwe (PRAZ) had delayed progress.\n\nIf repairs are not completed by January 2025, the Council will review cemetery staffing levels. Currently, one cemetery labourer is required to produce two graves per week. This may be revised to one grave per week, the Director said.\n\nThe Chamber Secretary, Mrs Sikhangele Zhou, assured the Committee that the Council is engaging the Procurement Regulation Authority of Zimbabwe (PRAZ) to resolve procurement issues related to hiring plant equipment and purchasing spare parts. In the meantime, Councillors were encouraged to rally residents to assist Council staff with backfilling graves.\n\nCouncillors raised concerns about increased expectations from residents during the festive season, particularly regarding grave backfilling, which has traditionally been performed by Council staff.\n\nDespite the operational challenges, the installation of tombstones across cemeteries continued steadily, with West Park Cemetery leading in numbers. The $4 522 revenue generated reflects the ongoing demand for burial services in Bulawayo.\n\nCouncil has resolved to note the challenges highlighted in the report while continuing to explore solutions to the grave production crisis. Hiring additional staff, repairing the gravedigger, and improving procurement processes remain key priorities.\n\nThe festive season underscores the urgent need for a sustainable strategy to address the rising demand for burial services while ensuring the welfare of cemetery staff and adherence to community expectations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/01/The-three-graves-at-Umvutsha-Cemetery-in-Bulawayo.jpg",
            "description": "Online Writer THE Bulawayo City Council is facing a mounting crisis in cemetery operations as the continued breakdown of the JCB grave digger has forced cemetery staff to resort to manual grave production. This situation, coupled with high demand during the festive season and soaring temperatures, has sparked concerns about staff welfare and operational efficiency. […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Chief Dakamela Achievers Awards 2025 dates announced: returns bigger and better",
            "url": "https://www.chronicle.co.zw/chief-dakamela-achievers-awards-2025-dates-announced-returns-bigger-and-better/",
            "content": "By Mthabisi Tshuma[emailprotected]THE Chief Dakamela Achievers Awards 2025 edition is set to return this April with an even more exciting celebration of excellence, culture, and community development in Nkayi District, Matabeleland North Province.Building on the success of previous editions, the 2025 event promises to be bigger and better, featuring new experiences and expanded offerings.Scheduled for Friday, 4 April, and Saturday, 5 April 2025, the awards aim to honour individuals and organisations that have made significant contributions to human development and cultural preservation.This years event will enhance its cultural and tourism appeal with the debut of a Camping Village and the return of the flagship Chief Dakamela Bush Dinner.\n\nIn a statement, Special Advisor to the Chief, Ntando Ndlovu kaSibasa, said preparations for the prestigious event are already underway.The 2025 edition begins on Friday with a day of interactive cultural activities and community development workshops aimed at inspiring innovation and growth. In the evening, guests will be treated to live cultural music performances under the stars, providing a glimpse into the vibrant cultural heritage of Matabeleland North.On Saturday, the focus will shift to the main awards ceremony, where outstanding individuals and organisations will be celebrated for their contributions to community development and cultural preservation. The night will culminate in the much-anticipated Chief Dakamela Bush Dinner, an exquisite outdoor dining experience by the riverbank featuring traditional cuisine and live cultural performances, said Ndlovu.\n\nHe added that this years edition will feature intriguing new activities.This year, attendees will have the opportunity to immerse themselves fully in the rural cultural experience with the introduction of the Camping Village. Visitors can stay overnight in eco-friendly tents, participate in fireside storytelling sessions with community elders, and enjoy stargazing under the serene Nkayi skies.\n\nA platform for excellence and unity, Chief Dakamelas vision for the awards is rooted in the African philosophy of Ubuntu: Our Humanity is Our Culture  iSintu yiBuntu Bethu. The event not only recognises excellence but also fosters unity, cultural reintegration, and sustainable development from grassroots to urban centres.The Chief Dakamela Achievers Awards 2025 is open to all who wish to celebrate and honour the rich culture and achievements of Matabeleland North. Tickets for access to the Camping Village and Bush Dinner are available now. For ticket bookings and more information, please contact via email at[emailprotected]or call/WhatsApp +263774788370 | +263773110989, said Ndlovu.Launched in 2022, the Chief Dakamela Achievers Awards celebrate individuals and organisations advancing human development and cultural preservation in Zimbabwe and beyond.The event has become a cornerstone for fostering community pride and promoting cultural tourism in Matabeleland North, particularly in Nkayi.Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/5ty5.jpg",
            "description": "By Mthabisi Tshuma revmmthiretshuma@gmail.com THE Chief Dakamela Achievers Awards 2025 edition is set to return this April with an even more exciting celebration of excellence, culture, and community development in Nkayi District, Matabeleland North Province. Building on the success of previous editions, the 2025 event promises to be bigger and better, featuring new experiences and […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Bindura man found dead with missing private parts",
            "url": "https://www.chronicle.co.zw/bindura-man-found-dead-with-missing-private-parts/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nA 27-YEAR-OLD man has been found dead in a bush in Brockdale and Woodbrooke Suburbs, Bindura.\n\nOn 13 January 2025, the body of Garikayi Junior Kamwendo was found badly decomposed with the head and private parts removed.\n\nThe victims body was conveyed to Bindura Hospitals mortuary facility for a post-mortem analysis.\n\nIn a statement on X, the police said they are investigating the murder case. Anyone with information to report at any nearest Police Station, said the police\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A 27-YEAR-OLD man has been found dead in a bush in Brockdale and Woodbrooke Suburbs, Bindura. On 13 January 2025, the body of Garikayi Junior Kamwendo was found badly decomposed with the head and private parts removed. The victim’s body was conveyed to Bindura Hospital’s mortuary facility for a post-mortem analysis. In […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Burglar jailed for 12 months",
            "url": "https://www.chronicle.co.zw/burglar-jailed-for-12-months/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nA 26-YEAR-OLD man from Susumani Line, Tsholotsho was jailed for six years by the Tsholotsho Magistrates Court for theft.\n\nMengesi Sibanda broke into an unnamed complainants bedroom and stole R1 600.\n\nHe gave Zikhiye Ncube, a cross-border transporter, R1500 to give to his wife who is in South Africa.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said the theft occurred on 9 January.\n\nSibanda squandered R100 buying beer at local beer outlets. Sibanda was sentenced to 12 months imprisonment, of which six months were suspended on condition of restitution.\n\nHe will serve an effective six months in prison, said the NPAZ\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com A 26-YEAR-OLD man from Susumani Line, Tsholotsho was jailed for six years by the Tsholotsho Magistrates’ Court for theft. Mengesi Sibanda broke into an unnamed complainant’s bedroom and stole R1 600. He gave Zikhiye Ncube, a cross-border transporter, R1500 to give to his wife who is in South Africa. In a statement […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Minister Muswere highlights importance of information systems for National Security at Zimbabwe National Defence University",
            "url": "https://www.chronicle.co.zw/minister-muswere-highlights-importance-of-information-systems-for-national-security-at-zimbabwe-national-defence-university/",
            "content": "Online WriterTODAY, the Minister of Information, publicity and Broadcasting Services Dr Jenfan Muswere, delivered a significant lecture at the Zimbabwe National Defence University in Harare, titled The Evolution of Information Systems and its Impact on National Security.The event underscores the growing recognition of the role that information systems play in safeguarding national interests.\n\nDuring his address, Dr Muswere emphasised the need for African nations to take ownership and control of their information systems. He argued that a modern regulatory framework is essential for effectively managing these systems and ensuring national security in an increasingly digital landscape.\n\nThe Ministers remarks come at a time when many African countries are grappling with the challenges of cybersecurity threats, misinformation, and the need for robust data governance. His call for a unified approach to information management is aimed at empowering nations to protect themselves against external vulnerabilities and enhance their strategic capabilities.\n\nThe lecture was well-attended by military personnel, academics, and policy makers, reflecting the critical intersection of technology and security in contemporary governance. Dr Musweres insights are expected to influence ongoing discussions about national security strategies across the continent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dwdw.jpg",
            "description": "Online Writer TODAY, the Minister of Information, publicity and Broadcasting Services Dr Jenfan Muswere, delivered a significant lecture at the Zimbabwe National Defence University in Harare, titled “The Evolution of Information Systems and its Impact on National Security.” The event underscores the growing recognition of the role that information systems play in safeguarding national interests. […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        },
        {
            "title": "Bulawayo on alert: Disease surveillance and public health challenges in 2024",
            "url": "https://www.chronicle.co.zw/b1ulawayo-on-alert-disease-surveillance-and-public-health-challenges-in-2024/",
            "content": "Online writerTHE Bulawayo City Council has ramped up disease surveillance and emergency response mechanisms to tackle evolving public health challenges.This comes as the city grapples with a series of disease outbreaks and escalating concerns over sanitation and law enforcement.\n\nA council report for November 2024 revealed trends in disease conditions recorded across the city. The report highlighted: Diarrhoea: A staggering 30 cases, though down from 362 in October. Dog Bites: 24 cases, a significant drop from 50 the previous month. Alarmingly, 18% of the implicated dogs were unvaccinated, posing a serious health risk. Acute Malnutrition: 63 cases, reflecting a persistent public health concern. Influenza: 90 cases, a decline from 116 in October. Mumps: One case, following zero reports in October. COVID-19: A single case, down from three in October.The city reported no cases of cholera, measles, or typhoid alerts, though the region remains vulnerable to outbreaks of these diseases. Additionally, a single imported malaria case was recorded, underscoring the citys susceptibility to transboundary health threats.To address these concerns, intensified emergency response measures were rolled out, including: Early detection and timely containment of outbreaks within 14 days. Active case finding and contact tracing to prevent the spread of infectious diseases. Targeted multi-sectoral interventions in high-risk areas.The city also remains vigilant against emerging health threats such as the Mpox virus, wild poliovirus outbreaks in neighbouring Malawi and Mozambique, and regional cholera surges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/hjukl.jpg",
            "description": "Online writer THE Bulawayo City Council has ramped up disease surveillance and emergency response mechanisms to tackle evolving public health challenges. This comes as the city grapples with a series of disease outbreaks and escalating concerns over sanitation and law enforcement. A council report for November 2024 revealed trends in disease conditions recorded across the […]",
            "time": "18:08",
            "date": "15 Jan 2025"
        }
    ]
}