{
    "news": [
        {
            "title": "Passengers survive Inter Africa Bus accident in Tsholotsho",
            "url": "https://www.chronicle.co.zw/passengers-survive-inter-africa-bus-accident-in-tsholotsho/",
            "content": "Sikhumbuzo Moyo[emailprotected]\n\nPASSENGERS travelling on an Inter Africa bus from Bulawayo to the Mtshayeli area in Tsholotsho narrowly escaped death this afternoon when the driver lost control of the vehicle, causing it to overturn and land on its roof.\n\nNo fatalities were reported, and all passengers were promptly rushed to Tsholotsho District Hospital. Most were treated and discharged, with 12 passengers requiring further observation.\n\nAccording to Tsholotsho District Development Co-ordinator, Mr Aaron Gono, the accident occurred just after the Gwayi River Bridge in the Nhlangano area.\n\nFrom our discussions with the driver, it appears he lost control of the bus, which veered off the road and overturned. Fortunately, no lives were lost, although some passengers sustained injuries and were taken to the district hospital for treatment, said Mr Gono.\n\nHe confirmed that the 12 passengers still under observation were not in any immediate danger.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/e4gye4f.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw PASSENGERS travelling on an Inter Africa bus from Bulawayo to the Mtshayeli area in Tsholotsho narrowly escaped death this afternoon when the driver lost control of the vehicle, causing it to overturn and land on its roof. No fatalities were reported, and all passengers were promptly rushed to Tsholotsho District Hospital. Most […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "Driver missing after truck sinks into mine shaft in freak accident",
            "url": "https://www.chronicle.co.zw/driver-missing-after-truck-sinks-into-mine-shaft-in-freak-accident/",
            "content": "Midlands BureauA 24-YEAR-OLD driver employed by a Chinese company Hunan Xinyu Mine in Gweru is missing after the tipper truck he was driving allegedly sunk in a mine shaft filled with water.Midlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed the freak accident that occurred on Tuesday.A 24-year-old man went missing when a truck he was driving got trapped after a mine collapsed. The accident occurred at Hunan Xinyu Mine near Connemara, Gweru on December 17 at around 930 pm, he said.Insp Mahoko said the missing driver has been identified as Walter Murevachimwe a resident of Ngezi in Kadoma.He said Murevachimwe was employed by Hunan Xinyu Mining as a driver.On the fateful day, Murevachimwe was on duty driving a Tipper Truck. As he was reversing the truck, intending to load Gold ore the mine suddenly collapsed and the Tipper truck sunk into the mine shaft saturated with water, he said.Insp Mahoko said the police attended the scene together with a team from the Ministry of Mines and Mining Development from Gweru.They discovered that the truck had sunk in the mine shaft and was covered with muddy water,  he said.Insp Mahoko said the rescue team managed to pump out the water and recovered the truck using excavators. The driver was not located. Efforts are still underway searching for Murevachimwe, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/MAHOKO.jpg",
            "description": "Midlands Bureau A 24-YEAR-OLD driver employed by a Chinese company Hunan Xinyu Mine in Gweru is missing after the tipper truck he was driving allegedly sunk in a mine shaft filled with water. Midlands Provincial police spokesperson Inspector Emmanuel Mahoko confirmed the freak accident that occurred on Tuesday. “A 24-year-old man went missing when a […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mabhikwa High to host Matabeleland North’s first Multipurpose Sports Arena",
            "url": "https://www.chronicle.co.zw/mabhikwa-high-to-host-matabeleland-norths-first-multipurpose-sports-arena/",
            "content": "Leonard Ncube in Lupane\n\nTHE Ministry of Sport, Recreation, Arts, and Culture is today set to commission a multipurpose sports arena at Mabhikwa High School in Lupane, Matabeleland North.\n\nThe Mabhikwa Multipurpose Sports Facility, sponsored by the Lotteries and Gaming Board, will be the first and only community sports arena in Matabeleland North.\n\nThe new facility will host tennis, volleyball, and netball, aiming to boost the development of sport in the local community.\n\nThis initiative aligns with the Second Republics vision of promoting sport as a source of livelihood and a key driver of tourism.\n\nIn line with this vision, Cabinet recently directed all local authorities to allocate at least seven percent of their budgets to the rehabilitation of sporting facilities within their jurisdictions.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jh57y.jpg",
            "description": "Leonard Ncube in Lupane THE Ministry of Sport, Recreation, Arts, and Culture is today set to commission a multipurpose sports arena at Mabhikwa High School in Lupane, Matabeleland North. The Mabhikwa Multipurpose Sports Facility, sponsored by the Lotteries and Gaming Board, will be the first and only community sports arena in Matabeleland North. The new […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "President Mnangagwa showcases agricultural progress at Precabe Farm ahead of Land Tenure Implementation Programme Launch",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-showcases-agricultural-progress-at-precabe-farm-ahead-of-land-tenure-implementation-programme-launch/",
            "content": "Online writerKWEKWE  President Emmerson Mnangagwa is leading a tour of the First Familys Precabe Farm in Kwekwe today, showcasing the agricultural advancements made under the new Land Tenure Implementation Programme.\n\nThe visit includes Cabinet Ministers as they observe large-scale potato cultivation that has gained significant market share, illustrating the First Familys commitment to agricultural development.\n\nThe Land Tenure Implementation Programme, set to be officially launched today, comes with an indefinite moratorium on the issuance of new 99-year leases, offer letters, and permits for agricultural land.\n\nThis initiative aims to streamline the land reform process, with priority given to war veterans, women, and youth in the allocation of title deeds.Under this new framework, titles granted to farmers will only be transferable to indigenous Zimbabweans, reinforcing the Governments stance on the irreversibility of the land reform programme initiated at the turn of the millennium. This move marks a significant step in the governments efforts to bolster agricultural productivity and empower local communities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/rjr.jpg",
            "description": "Online writer KWEKWE – President Emmerson Mnangagwa is leading a tour of the First Family’s Precabe Farm in Kwekwe today, showcasing the agricultural advancements made under the new Land Tenure Implementation Programme. The visit includes Cabinet Ministers as they observe large-scale potato cultivation that has gained significant market share, illustrating the First Family’s commitment to […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mukuru Secures Deposit-Taking Microfinance Licence to Boost Financial Inclusion in Zimbabwe",
            "url": "https://www.chronicle.co.zw/mukuru-secures-deposit-taking-microfinance-licence-to-boost-financial-inclusion-in-zimbabwe/",
            "content": "Online WriterHARARE, Zimbabwe  19 December 2024Mukuru, a leading financial services provider in Southern Africa, has been granted a Deposit-Taking Microfinance Institution (DTMFI) licence in Zimbabwe.This milestone is expected to bolster the countrys financial inclusion efforts, particularly among underserved groups such as small and medium enterprises (SMEs), women, youth, rural populations, and people with disabilities.The DTMFI licence aligns Mukurus mission with Zimbabwes National Financial Inclusion Strategy, spearheaded by the Reserve Bank of Zimbabwe.Speaking on the achievement, Mukuru Group CEO Mr Andy Jury said, We are excited to leverage our extensive network and digital capabilities to empower underserved communities and drive financial inclusion across the country.With a trusted customer base exceeding three million and over 750 access points nationwide40percent of which are in rural areasMukuru is positioned to bridge the gap between formal and informal financial services. The company plans to introduce innovative products enabling users to send, store, spend, and borrow money more efficiently.Mr Doug Tait-Knight, CEO of Mukuru Zimbabwe Financial Services, highlighted the transformative impact of the licence: This development will enable us to deliver tailored digital solutions that address the specific needs of our customers, from supporting SMEs to making financial services accessible for people with disabilities. It represents a significant step towards uplifting communities and integrating them into the mainstream economy.The new licence is expected to reduce transaction costs and expand the adoption of digital financial solutions, aligning with Mukurus broader vision of driving economic empowerment and financial inclusion across Zimbabwe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Andy-Jury.jpg",
            "description": "Online Writer HARARE, Zimbabwe – 19 December 2024 Mukuru, a leading financial services provider in Southern Africa, has been granted a Deposit-Taking Microfinance Institution (DTMFI) licence in Zimbabwe. This milestone is expected to bolster the country’s financial inclusion efforts, particularly among underserved groups such as small and medium enterprises (SMEs), women, youth, rural populations, and […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "National Foods Limited Shareholders Approve VFEX Delisting and Share Buyback",
            "url": "https://www.chronicle.co.zw/national-foods-limited-shareholders-approve-vfex-delisting-and-share-buyback/",
            "content": "Senior Business WriterSHAREHOLDERS of National Foods Limited voted on Wednesday to voluntarily delist the company from the Victoria Falls Stock Exchange (VFEX).\n\nThe resolution was passed during an extraordinary general meeting, with the company citing the need for greater operational flexibility and a focus on long-term strategic objectives as the key drivers for the decision.\n\nNational Foods also stated that it does not anticipate requiring capital from public equity markets in the near term, diminishing the benefits of remaining listed on the VFEX.\n\nAnother resolution approved during the meeting was a share buyback programme. The company explained that the repurchase offer provides shareholders with an opportunity to realise the full value of their shares and addresses liquidity challenges associated with limited trading activity on the VFEX.\n\nA share repurchase typically signals that a companys management believes its shares are undervalued. The company may buy shares directly from the market or allow shareholders to tender their shares at a fixed price. By reducing the number of shares in circulation, share buybacks increase earnings per share and often enhance the market value of the remaining shares.\n\nNational Foods, an agro-processing giant and subsidiary of Innscor Africa, became the ninth company to list on the foreign currency-denominated VFEX when it migrated from the Zimbabwe Stock Exchange (ZSE) in January 2023.\n\nThe company operates manufacturing sites in Harare and Bulawayo, distributing its wide range of products across Zimbabwe. These include snacks, biscuits, pasta, sugar beans, baked beans, popcorn, soap, and a full range of animal feed.\n\nEnds\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/JHNJU.jpg",
            "description": "Senior Business Writer SHAREHOLDERS of National Foods Limited voted on Wednesday to voluntarily delist the company from the Victoria Falls Stock Exchange (VFEX). The resolution was passed during an extraordinary general meeting, with the company citing the need for greater operational flexibility and a focus on long-term strategic objectives as the key drivers for the […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "Land Tenure Implementation Programme launch at Kwekwe’s Precabe Farm",
            "url": "https://www.chronicle.co.zw/land-tenure-implementation-programme-launch-at-kwekwes-precabe-farm/",
            "content": "Online writerKWEKWE, Zimbabwe President Emmerson Mnangagwa has arrived at Precabe Farm in Kwekwe to officially launch the new Land Tenure Implementation Programme, a significant initiative aimed at reforming agricultural practices in Zimbabwe.\n\nThe programme is designed to enhance access to financing for farmers, enabling them to invest in and improve their agricultural productivity. By streamlining land tenure processes, the Government hopes to encourage more efficient use of land and resources, thereby bolstering the countrys agricultural output.\n\nThis initiative comes at a critical time for Zimbabwes agricultural sector.The Governments focus on improving land tenure is expected to provide a more secure framework for farmers, encouraging them to adopt modern farming techniques and invest in their land.\n\nAs part of the launch, President Mnangagwa is expected to address key stakeholders in the agricultural sector, outlining the benefits of the new system and the Governments commitment to revitalising the economy through agriculture.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/BGSWH.jpg",
            "description": "Online writer KWEKWE, Zimbabwe— President Emmerson Mnangagwa has arrived at Precabe Farm in Kwekwe to officially launch the new Land Tenure Implementation Programme, a significant initiative aimed at reforming agricultural practices in Zimbabwe. The programme is designed to enhance access to financing for farmers, enabling them to invest in and improve their agricultural productivity. By […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "Kavango Resources Secures £6.5 Million Strategic Financing for Gold Mining Projects",
            "url": "https://www.chronicle.co.zw/kavango-resources-secures-6-5-million-strategic-financing-for-gold-mining-projects/",
            "content": "Senior Business Writer\n\nKAVANGO Resources, a mining company with operations in Matabeleland, announced this week that it has raised 6.5 million in strategic financing to advance its gold mining projects in Zimbabwe.\n\nThe funds will also support local exploration initiatives, projects in Botswana, and general working capital needs.\n\nThe company stated that the financing is subject to the approval of a prospectus by the Financial Conduct Authority and shareholder approval at an upcoming general meeting.\n\nKavangos Chief Executive Officer, Mr Ben Turney, said:Weve recently announced Kavangos plans for Prospects 3 and 4 at the Hillside Gold Project in Zimbabwe. If the next phases of resource and exploration drilling meet our expectations, we aim to begin developing two projects, with mining operations expected to commence by the end of 2025.\n\nHe added that the company has been laying the groundwork for this growth phase in recent months.Through our subsidiary, Kavango Mining, we have recruited a dedicated mining team and implemented processes in preparation for operations. We have hired an experienced Australian mining engineer skilled in modern mechanised methods and lode gold systems, who is overseeing our strategy to move into mine development.\n\nAdditionally, we have engaged a South African gold processing plant manufacturer to conduct initial metallurgical test work on ore samples from our project areas.\n\nKavango Resources, which entered Zimbabwes mining sector last year, holds investments in various minerals, including copper in neighbouring Botswana.\n\nMeanwhile, the company plans to list on the United States dollar-denominated Victoria Falls Stock Exchange (VFEX). This move is expected to offer Zimbabwean investors the opportunity to participate in Kavangos exploration and mining initiatives.\n\nListing on the VFEX will also provide the company with access to a broader capital base and shareholder pool, aligning with its strategic objective of promoting strong local ownership of its projects.\n\nThe VFEX, established in 2020, is part of Zimbabwes efforts to develop an International Financial Services Centre. It operates within a Special Economic Zone in Victoria Falls.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Gold-Ore.jpg",
            "description": "Senior Business Writer KAVANGO Resources, a mining company with operations in Matabeleland, announced this week that it has raised £6.5 million in strategic financing to advance its gold mining projects in Zimbabwe. The funds will also support local exploration initiatives, projects in Botswana, and general working capital needs. The company stated that the financing is […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "No room for troublemakers in Zanu-PF — President",
            "url": "https://www.chronicle.co.zw/no-room-for-troublemakers-in-zanu-pf-president/",
            "content": "Joseph Madzimure, Harare Bureau\n\nPRESIDENT Mnangagwa yesterday read the riot act on senior party members who are abusing social media platforms to create divisions, causing discord and confusion among the membership base.\n\nThis comes as some senior ruling party members have been communicating opinionated views on social media. Addressing the 380th Session of the Politburo yesterday, President Mnangagwa emphasised the importance of unity and order within the party rank and file.\n\nAt this stage of our political development and with the maturity of our revolutionary party, it is disheartening to note the unbecoming levels of mud-slinging and other counter-revolutionary tendencies, including the broadcasting of party issues on social media platforms.\n\nThese acts continue to cause discord and confusion among the membership base. No one must put our party into disrepute. This is unacceptable. Such behaviour cannot be tolerated and must stop. Vari kuzviita cherai chikomba, emphasised President Mnangagwa.\n\nEvery member, President Mnangagwa said, must adhere to the provisions of the party constitution, founding principles, and procedural integrity, including wide consultation and formal ratification of issues that affect the party.\n\nPrudence must be exercised in the execution of our duties and rights as members, through the use of appropriate principal organs and structures of the party. Zanu-PF musangano unegwara, uye nematare.\n\nLet us do more to unite the party and entrench a positive culture of common purpose, harmony and love, as we advance our party Vision and Mission as articulated in Articles 6 and 7 of our party constitution, he said. On top of that, a social media policy is being crafted which will guide party members.\n\nThe President urged the party leadership to look forward to 2025 with optimism and confidence that the colossal party will sustain the development momentum realised so far.\n\nIn doing so, our primary concern at every leadership level should be to continue building a positive image of the party and expanding the membership base in our structures. The party must remain visible in the villages, and urban areas, always guiding misinformed cadres in our communities, and raising their political awareness. Mu Zanu-PF, iwe neni tine basa, he said.\n\nPresident Mnangagwa said despite the effects of the heinous illegal sanctions the country has witnessed numerous success milestones during the year.\n\nDespite the weighty and retarding effects of the heinous illegal sanctions on our country, we scored numerous success milestones during the year towards the modernisation, industrialisation and growth of our economy. Our national development philosophy, Nyika inovakwa, inotongwa, inonamatigwa nevene vayo/ ilizwe lakhiwa, libuswe, likhulekelwe ngabaninilo, is now embedded nationally, in the mind-sets of our people.\n\nAs such, through this rallying call as well as hard work, focus and determination, our country is realising growth across all sectors of the economy and also a higher quality of life for our people, said President Mnangagwa.\n\nIn the past few weeks alone, President Mnangagwa has officiated at various ceremonies for notable development projects and programmes being championed by the ruling party.\n\nThese included the commissioning of the Shurugwi-Mhandamabwe Road, the Varun Beverages Phase 6 and 7 expansion project, and the launch of the construction of a US$1 billion Titan New Energy Plant, among others.\n\nAs we continue to make efforts to position Zimbabwe as an infrastructure powerhouse, the central role of the iron and steel sector cannot be overemphasised. To this end, the convening of the Zimbabwe Iron and Steel Indaba was a welcome initiative.\n\nIt stands as a reminder to the party, Government and other stakeholders in the sector to quickly adapt and innovate as we revitalise this important industry of our nation, he said.\n\nFocus, he stated, must be towards guaranteeing that the natural endowments of the country benefit Zimbabweans and help accelerate the modernisation and industrialisation of the economy.\n\nHe commended party members for being instrumental in the success of programmes and activities that were held during the course of the year.\n\nYour individual and collective efforts were instrumental in the success of party programmes and activities held during the course of the year. The spirit of servant leadership and determination to wholeheartedly serve the party and people of our motherland, Zimbabwe, should remain our guiding beacon into the new year. Congratulations on a job well done, he said.\n\nHe also commended the party and Hebert Chitepo School of Ideology for facilitating training and capacity building for the members of the Youth League through the ongoing partnership with the Julius Nyerere School of Leadership.\n\nSuch leadership training programmes along with those conducted with various stakeholders within the country nurture our people to value and promote the ideals of patriotism and Pan-Africanism for the ongoing national development revolution.\n\nThe Chitepo School of Ideology, as a strategic Party and national institution, is directed to remain guided by the founding objectives, spirit and letter, that saw its establishment, he said.\n\nPresident Mnangagwa also wished Zimbabweans a prosperous Unity Day, Christmas and New Year holidays. He expressed his heartfelt empathy and solidarity with the people and Government of Mozambique and Malawi following the disruption, loss of life and damage to property by Tropical Cyclone Chido.\n\nDuring the Politburo session, a minute of silence was observed following the death of the gallant son of the soil and veteran of the liberation struggle, former Vice-President, Cde Phelekezela Report Mphoko.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Mnangagwa-observes-as-Zimbabwe-Prisons-and-Correctional-Services-Commission-Commissioner-Utoille-Slaigwana-signs-his-oath-of-office-at-State-House-in-Harare-yesterday-1-680x380.jpg",
            "description": "Joseph Madzimure, Harare Bureau PRESIDENT Mnangagwa yesterday read the riot act on senior party members who are abusing social media platforms to create divisions, causing discord and confusion among the membership base. This comes as some senior ruling party members have been communicating opinionated views on social media. Addressing the 380th Session of the Politburo […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        },
        {
            "title": "Zimpapers launches digital initiative",
            "url": "https://www.chronicle.co.zw/zimpapers-launches-digital-initiative/",
            "content": "Remember Deketeke, Harare Bureau\n\nZimbabwe Newspapers (1980) Limited, the largest media group in Zimbabwe, yesterday officially launched its ambitious digital transformation initiative aimed at modernising operations and enhancing reader engagement.\n\nZimpapers digital initiative\n\nThis initiative responds to the rapidly changing media landscape, where digital consumption is increasingly the norm.\n\nInformation Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, along with Deputy Minister Omphile Marupi and Permanent Secretary Nick Mangwana, also toured the groups new bookstore and coffee shops.\n\nMinister Muswere also participated in interviews with ZTN Prime and Capitalk, discussing the importance of embracing digital transformation for media entities.\n\nSpeaking at the launch, Minister Muswere emphasised the significance of digital transformation in achieving upper-middle-income status.\n\nZimpapers digital initiative\n\nWe are here to witness a groundbreaking digital initiative marking the beginning of Zimpapers journey toward total transformation as an institution, said Dr Muswere.\n\nZimpapers is undergoing a comprehensive digital transformation, with the Board, Management, and staff fully committed to this process. This initiative aims to ensure a total transformation of Zimpapers as an institution. This transformation is essential as we strive towards becoming an upper-middle-income society.\n\nZimpapers digital initiative\n\nDr Muswere outlined the key aspects of the transformative journey, including cultural, behavioural, digital, and business transformation.\n\nFor digital transformation to take place, the cultural transformation is to take the lead. The behavioural transformation is to take the lead as well, he said.\n\nThese four aspects in terms of the transformation of Zimpapers will ensure that the institution continues to grow.\n\nHe said that Zimpapers must adapt to the fourth industrial revolution.\n\nZimpapers digital initiative\n\nThe readership now focuses on traffic, content, and packaging. The old print media business model is declining, even though some segments still prefer physical copies, he said.\n\nThe board, management, and staff must strategically shift towards the complete digitalisation of Zimpapers. With approximately 8 million registered telecom subscribers and declining newspaper circulation, it is clear that we need to embrace the digital path.\n\nHowever, in this fourth industrial revolution, innovation is crucial, as necessity drives invention.\n\nDr Muswere added effective collaboration among the board, management, and staff is essential for the success of the digital transformation journey.\n\nZimpapers digital initiative\n\nTo drive Zimpapers a an institution, Dr Muswere emphasised the need to adapt to market trends by packaging content digitally.\n\nDrawing lessons from the successful Kenyan model, Zimpapers Group CEO Mr Pikirayi Deketeke said it can guide the entity towards full digital implementation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/a.jpg",
            "description": "Remember Deketeke, Harare Bureau Zimbabwe Newspapers (1980) Limited, the largest media group in Zimbabwe, yesterday officially launched its ambitious digital transformation initiative aimed at modernising operations and enhancing reader engagement. This initiative responds to the rapidly changing media landscape, where digital consumption is increasingly the norm. Information Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, […]",
            "time": "18:40",
            "date": "20 Dec 2024"
        }
    ]
}