{
    "news": [
        {
            "title": "Mayors, Town Clerks get diplomatic protocol training",
            "url": "https://www.chronicle.co.zw/mayors-town-clerks-get-diplomatic-protocol-training/",
            "content": "Sikhumbuzo Moyo\n\n[emailprotected]\n\nTHE Urban Councils Association of Zimbabwe (UCAZ) is conducting a three-day workshop on diplomatic protocol and etiquette for mayors and town clerks.\n\nThe workshop, which began yesterday at a hotel in Bulawayo, is being facilitated by the Zimbabwe Foreign Service Institute under the Ministry of Foreign Affairs and International Trade.\n\nLocal Government and Public Works Minister Daniel Garwe will officially open the workshop today.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/garwe.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw THE Urban Councils Association of Zimbabwe (UCAZ) is conducting a three-day workshop on diplomatic protocol and etiquette for mayors and town clerks. The workshop, which began yesterday at a hotel in Bulawayo, is being facilitated by the Zimbabwe Foreign Service Institute under the Ministry of Foreign Affairs and International Trade. Local Government […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "Africa’s treasure… President pays tribute to Kirsty",
            "url": "https://www.chronicle.co.zw/africas-treasure-president-pays-tribute-to-kirsty/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nTHE election of former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, to the helm of the International Olympic Committee (IOC), is testament that Africa is ready to lead at the highest level, President Mnangagwa has said.\n\nIn his address at a banquet he hosted for IOC president-elect Coventry at State House in Harare last night, the President said her victory was not only for Zimbabwe, but African people as a whole.\n\nCoventry becomes the 10th president of the IOC and the first woman, as well as the first person from outside Europe and the United States, to lead the worlds most powerful sporting body.\n\nThe victory of Honourable Coventry is, thus, not only a source of inspiration and pride for Zimbabwe, but for the SADC region and Africa as a whole.\n\nWith five world records to her name, breaking records is in her nature; she has done it again.In the true spirit of Africa tinoti: Makorokoto, Amhlophe and Hongera (as they say in Swahili), President Mnangagwa said.\n\nHe also paid tribute to Coventrys family for mentoring her to become a national treasure.Allow me to also pay tribute and gratitude to Mr Rob and Mrs Lyn Coventry, parents of our golden girl as well as to her husband, Mr Tyrone Seward.\n\nWe thank you for the mentorship, guidance and support as well as all the sacrifices you made along the way, for Honourable Coventry to realise her career success. Congratulations.\n\nYou are not only our national treasure, but a treasure to all young athletes across Africa and the developing world, President Mnangagwa said.\n\nHe challenged parents and guardians to nurture the younger generations to become champions.I challenge parents and guardians to nurture, support and encourage our talented young boys and girls as they compete in various sporting disciplines\n\nThe success milestone by Minister Kirsty Coventry signifies the enduring warrior spirit and unflinching resilience embedded in us, as a proud Zimbabwean and African people, said the President.He added that during Ms Coventrys tenure as Sports Minister, Zimbabwe had become more competitive in various sporting disciplines.\n\nSince her tenure, the Zimbabwe Senior Netball team, the Gems, qualified for the Netball World Cup on two occasions, the National Soccer Team, the Warriors qualified for Afcon, and the mens Rugby Team scooped the African Championship, among others.\n\nThe Zimbabwe Chevrons and the Lady Chevrons alike, have become more competitive following the improved administration of Cricket.\n\nWe now host both Test and One Day International Games on a more frequent basis, the highlight of which was the ICC T20 World Cup Qualifiers in 2023.\n\nThe leadership of Honourable Coventry has, therefore, been instrumental to Zimbabwe successfully hosting various regional and international sporting events, further elevating our countrys reputation as a favourable global sporting destination, said President Mnangagwa.\n\nHe said as a strong advocate of inclusion, good governance and professionalism in sports administration, Ms Coventry had constantly advocated for sports administrators in the country to occupy decision-making posts regionally, continentally and internationally.\n\nIn line with my Governments national development mantra of leaving no one and no place behind, the Honourable Minister and incoming president we are celebrating today, oversaw the construction of multi-purpose facilities in disadvantaged areas across the country.\n\nThese include Chambuta in Chiredzi; Rafamoyo in Gutu; Mabhikwa in Lupane and Karigamombe in Zvimba, among others, the President said.\n\nThese projects and other strategies spearheaded by my dear Minister have encouraged inclusivity in sports, and ensured that young boys and girls across the country access opportunities to develop and nurture their God-given talents.\n\nIn his remarks to introduce the President, Vice President Dr Constantino Chiwenga described the IOC president-elect as a record-breaker whom the country was proud of.\n\nThis is a moment of immense pride for our country, he said.On her part, former Minister Coventry chronicled how she had a dream to represent Zimbabwe at the Olympics while watching the 1992 Barcelona Olympics at home.\n\nShe went on to represent Zimbabwe and win the countrys first gold medal at the Athens Olympics in 2004.The IOC president-elect expressed gratitude to President Mnangagwa for giving her an opportunity to serve as the countrys Sports Minister.\n\nI am extremely grateful for that opportunity, she said.Ms Coventry said although she consequently had to step down as Sports Minister, she will always support the Second Republic as and when needed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-366-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau THE election of former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, to the helm of the International Olympic Committee (IOC), is testament that Africa is ready to lead at the highest level, President Mnangagwa has said. In his address at a banquet he hosted for IOC president-elect Coventry at […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "Zimbabwe powers ahead: 13 new energy projects completed in 100 days",
            "url": "https://www.chronicle.co.zw/zimbabwe-powers-ahead-13-new-energy-projects-completed-in-100-days/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nZIMBABWE has completed 13 new energy generation projects with a combined output of over 430 megawatts (MW) within the last 100-day cycle, marking significant progress towards achieving energy self-sufficiency.\n\nThe new projects, spanning across the country, comprise a diverse mix of solar and thermal power, with contributions from stock exchange-listed companies and educational institutions.\n\nThe investments reflect the positive impact of comprehensive energy sector reforms introduced by the Second Republic, led by President Mnangagwa.\n\nZimbabwe has huge potential for renewable energy. Given their market-leading role in manufacturing and supplying renewable energy equipment, companies from China, previously key financiers of coal projects in Zimbabwe, are among the top actors driving the accelerated transition away from fossil fuels in the country.\n\nDecades of underinvestment in electricity generation have resulted in persistent power shortages in Zimbabwe due to demand outstripping installed generation capacity.\n\nThis has prompted the countrys power utility, the Zimbabwe Electricity Supply Authority (ZESA), to continually cover the deficit through imports from neighbouring countries.\n\nThe Government is actively promoting private sector participation in energy production, particularly in renewable energy.\n\nSpeaking during a post-Cabinet media briefing yesterday, Information, Publicity, and Broadcasting Services Minister, Dr Jenfan Muswere, said the Minister of Energy and Power Development, July Moyo, presented details of several energy projects that have been completed in the past 100-day cycle to enhance energy security.\n\nInformation, Publicity, and Broadcasting Services Minister, Dr Jenfan Muswere\n\nThe 13 energy projects across the country have been fully implemented, while some are still under construction. For instance, in the Matabeleland region, three high-impact projects are on track.\n\nThese include a Thermal Power Plant in Beitbridge District, the 240-Megawatt Zhongzhing Heli Thermal Power Plant, which is coal-powered and currently generating 20 MW, and Makhaza Institution Grid Extension Project in Tsholotsho District, which is 100 percent complete.\n\nOther key projects include the implementation of the Zvarota Institutions Grid Extension Project in Shurugwi, which is 100 percent complete, and the 120MW Maximind Thermal Power Plant in Buhera District, Manicaland Province, which has been completed.\n\nProjects that are ongoing include the 2,5MW Guruve Solar Plant, the NewGlovers 10MW Solar Project in Kwekwe District, the 45MW Zimplants Solar Plant in Chegutu District, which is 40 percent complete, and the 20MW Manhize Thermal Power Plant in Mvuma.\n\nThe construction of the Gandavaroyi Community Mini Solar Grid in Gokwe North District is 83 percent complete, while the 160-kilowatt Soti Source Community Solar Mini Grid Project is 85 percent complete.\n\nThe construction of the Makhaza Institution Grid Extension Project in Tsholotsho District is 100 percent complete, while the implementation of the Zendele Primary School Solar Mini Grid Project is 70 percent complete.\n\nZimbabwe has made modest strides in attracting renewable energy investments, with a focus on solar power.The country aims to increase its renewable energy capacity to 1 100MW by 2025.\n\nSince 2010, the Zimbabwe Energy Regulatory Authority (ZERA) has licensed over 100 independent power producers (IPPs), though many have faced challenges, particularly funding constraints.\n\nTo address electricity shortages, an increasing number of companies and households are turning to solar energy for reliable power.\n\nThe Government is incentivising investments in renewables through duty and tax benefits, which play a crucial role in Zimbabwes National Development Strategy 1 (NDS1), which prioritises modernisation, industrialisation, and sustainable socio-economic growth.\n\nTo tackle power shortages, the Government is implementing several electricity generation projects, financed through extra-budgetary sources, loans, and private sector investment.\n\nAs part of its energy expansion goals, Zimbabwe aims to increase electricity supply from the current installed capacity of 2 317MW to 3 467MW by 2025, adding over 1 000MW in under four years.\n\nAccording to the latest Index of Electricity Generation (IEG) report from ZimStat, independent power producers (IPPs) are playing a vital role in diversifying Zimbabwes energy sources.\n\nIn the fourth quarter of 2024, IPPs contributed 4,9 percent of total electricity supply, signalling growth potential for private-sector involvement.\n\nElectricity imports have declined by 20.2 percent, dropping from 611.1 GWh (Q3 2024) to 487.8 GWh (Q4 2024).\n\nHowever, despite these gains, Zimbabwes current power generation of 1,400MW remains lower than demand.\n\nThe Government continues to implement public and private sector-driven initiatives to meet the countrys energy needs.\n\nNotably, the expansion and modernisation of the Hwange Thermal Power Plant underscores Zimbabwes commitment to ensuring a stable energy supply.\n\nHowever, recurring droughts have reduced water levels at Lake Kariba, significantly lowering hydroelectric output and worsening the energy deficit.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/rw-1.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw ZIMBABWE has completed 13 new energy generation projects with a combined output of over 430 megawatts (MW) within the last 100-day cycle, marking significant progress towards achieving energy self-sufficiency. The new projects, spanning across the country, comprise a diverse mix of solar and thermal power, with contributions from stock exchange-listed companies and […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "President reaffirms commitment to improving livelihoods",
            "url": "https://www.chronicle.co.zw/president-reaffirms-commitment-to-improving-livelihoods/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nThe Second Republic will continue implementing further reforms to improve the livelihoods of Zimbabweans, building on the countrys current economic growth momentum, President Mnangagwa has said.\n\nIn his remarks on Monday at the announcement of the 2024 Performance Evaluation Results and 2025 Performance Contracts Signing Ceremony held at State House in Harare, the President reaffirmed the Governments commitment to implementing sweeping reforms as the country moves closer to achieving upper-middle-income economic status by 2030.\n\nThe world over, Governments are no longer measured by the promises they make to the people and the credibility of their plans, but by high performance, efficient resource utilisation, and the delivery of quality services.\n\nIn our case, this (event) attests to the work culture being institutionalised to enhance performance and accountability across the public sector, for high-impact results, he said.\n\nPresident Mnangagwa stated that the Government was rolling out a range of initiatives that would allow ordinary Zimbabweans to assess the countrys forward momentum towards achieving national goals.\n\nUndoubtedly, Performance Contracting, introduced in 2021, has had a propelling effect and enabled stakeholders, including ordinary citizens, to assess progress made by Ministries, Departments and Agencies in achieving targets set out in the National Development Strategy and Vision 2030.\n\nIt is commendable that since the introduction of performance contracting, we have witnessed notable milestones across all sectors. The growing culture of accountability, integrity, efficiency, and effectiveness is also applauded, he said.\n\nThe President then renewed his pledge to instil a culture of discipline, transparency, and results-driven governance among public servants.\n\nMeanwhile, Performance Contracts and the internalisation of Integrated Result-Based Management principles are driving programming and a new work ethic within Government. Furthermore, the performance ratings, awards, and recommendations have also enhanced policy and structural responsiveness, while injecting positive competition among MDAs, he said.\n\nDigitalisation, President Mnangagwa added, was a critical aspect of the countrys modernisation and industrialisation drive, and clear deadlines would be set for digital adoption targets.\n\nThe Second Republic, under my leadership, will continue with its modernisation drive by digitalising services and improving efficiencies in all administrative processes. Clear deadlines must now be issued, requiring that relevant online services be deployed across the public sector to improve convenience for our citizenry.\n\nThe provision of online services should be a key result area of your performance evaluation, he said.In line with global standards, the President stated that the Government was working towards certifying MDAs to improve standardisation, quality, and risk management.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/qw1dew.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau The Second Republic will continue implementing further reforms to improve the livelihoods of Zimbabweans, building on the country’s current economic growth momentum, President Mnangagwa has said. In his remarks on Monday at the announcement of the 2024 Performance Evaluation Results and 2025 Performance Contracts Signing Ceremony held at State House in […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "Bulawayo set for epic music experience at Swan launch",
            "url": "https://www.chronicle.co.zw/bulawayo-set-for-epic-music-experience-at-swan-launch/",
            "content": "Langalakhe Mabena, Zimpapers Art and Entertainment Hub\n\nMusicians in Bulawayo set to perform at the highly-anticipated Swan cigarette launch event on Saturday at White City Stadium in the city have declared they are ready to set the stage alight, joining an exciting line-up of local and regional artistes.\n\nLocal stars, including Ma9ine, Insimbi ZeZhwane, Madlela Sikhobokhobo, DJ Mzoe, Iyasa, and Sandra Ndebele, have expressed their enthusiasm ahead of the musical cocktail.\n\nAwa Khiwe\n\nApart from these home-grown talents, music lovers will also be treated to live performances by Sungura legend Alick Macheso, Zimdancehall king Winky D, Chillspot Familys DJ Levels and Fantan, Calvin Mangena, and German-based rap queen, Awa Khiwe.\n\nAdding an international flavour to the line-up are South African stars such as hip-hop sensation Kwesta, Jerusalema hit-maker Master KG, Murumba Pitch and Toss of Senz Umlando fame. Botswanas music giant, Vee Mampeezy is also expected to grace the stage.\n\nThe event will be hosted by Star FM presenter Babongile Sikhonjwa and Ndumiso Skywalker, kicking off at 10am. To gain entry, attendees must purchase two packs of Swan cigarettes.\n\nMa9ine, a fan favourite, expressed excitement at being part of the line-up.Its a great honour to perform at such a massive event. Swan promises to be a huge brand in Zimbabwe, and being associated with them means a lot for my music career, said Ma9ine.\n\nSandra Ndebele\n\nMadlela Sikhobokhobo commended the event organisers for striking a balance between local and regional artistes.\n\nIts refreshing to see an event of this scale giving both local and regional artistes a platform. Fans will enjoy a diverse range of performances, making this a must-attend event, he said.Insimbi ZeZhwane, through their front-man, Meluleki Brema Moyo, assured fans of a stellar performance and called on their supporters to attend in large numbers.\n\nOne of the event organisers, Ushewokunze Mutemwa, said the Bulawayo edition follows successful Swan Cigarette activations in Beitbridge, Mutare, and Harare. He also revealed that before the musical showcase begins, attendees will be treated to a soccer match between Zim Musicians FC and Bulawayo Ambassadors.\n\nPreparations are going well, and we have plenty of surprises lined up for attendees. We encourage people to come early and enjoy the entire experience, said Mutemwa.\n\nWeve curated a diverse line-up to cater to Bulawayo and Matabelelands multicultural audience, ensuring a vibrant mix of talent. We expect all artistes to deliver their best performances.With an electrifying line-up and an exciting pre-show soccer match, the Swan cigarette launch promises to be an unforgettable celebration of music, culture and entertainment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/n.jpg",
            "description": "Langalakhe Mabena, Zimpapers Art and Entertainment Hub Musicians in Bulawayo set to perform at the highly-anticipated Swan cigarette launch event on Saturday at White City Stadium in the city have declared they are ready to set the stage alight, joining an exciting line-up of local and regional artistes. Local stars, including Ma9ine, Insimbi ZeZhwane, Madlela […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "Zimbabwe gold export earnings jump 9pc in two months",
            "url": "https://www.chronicle.co.zw/zimbabwe-gold-export-earnings-jump-9pc-in-two-months/",
            "content": "Martin Kadzere, Harare Bureau\n\nZIMBABWES gold export earnings increased by 8,64 percent in the first two months of 2025, reaching US$240,1 million, according to statistics from the Reserve Bank of Zimbabwe (RBZ).\n\nThis marks a notable rise from approximately US$221 million in exports during the same period in 2024, highlighting the sectors continued strong contribution to the national economy.\n\nGold exports for January 2024 amounted to US$123.1 million. However, February saw a slight decline, with exports totalling US$117 million. Despite this monthly fluctuation, the overall trend indicates a positive growth trajectory for the sector.\n\nGold remains Zimbabwes largest export commodity, playing a pivotal role in generating foreign currency. In 2024, the sector generated US$2,4 billion in export revenue for the country.\n\nA significant portion of Zimbabwes gold is produced by small-scale and artisanal miners, who collectively account for around 65 percent of the countrys total gold output, underscoring the importance of these miners in the national gold value chain and the broader economy.\n\nZimbabwes gold industry has experienced strong growth in recent years, largely driven by various Government interventions, supportive policies and industry initiatives.\n\nSignificant investments have led to the reopening of old mines and increased production at existing operations. Additionally, offering small-scale miners better prices and encouraging them to sell through official channels has resulted in increased deliveries.\n\nIn 2024, gold production exceeded the Governments target and even surpassed the previous record set in 2022, positioning Zimbabwe to become one of the major gold producers in Africa.\n\nLeading bullion producers on the continent include Ghana, South Africa, Mali, Burkina Faso and Tanzania.The gold mining sector has seen substantial growth since 2017, although there have been some fluctuations.Production totalled 21,1 tonnes in 2016, but after the Government refined its policies, production rose to 24,8 tonnes in 2017 and 33,2 tonnes in 2018.\n\nHowever, in 2019, gold production dropped by 16,8 percent to 27,6 tonnes. This decline followed the reintroduction of the Zimbabwean dollar, which caused issues for miners due to its volatility, as they were partly paid in the domestic currency.\n\nThe currency issues persisted into 2020, and small miners expressed dissatisfaction with how they were being paid by the countrys sole authorised gold buyer, Fidelity Gold Refinery (FGR). This led to a significant drop in deliveries, down to 19 tonnes.\n\nThe decline in gold deliveries was attributed to several factors, including high costs for miners, long payment delays from Fidelity, and a Government decision to pay only 75 percent of gold deliveries in US dollars.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/11/RBZ-2.jpg",
            "description": "Martin Kadzere, Harare Bureau ZIMBABWE’S gold export earnings increased by 8,64 percent in the first two months of 2025, reaching US$240,1 million, according to statistics from the Reserve Bank of Zimbabwe (RBZ). This marks a notable rise from approximately US$221 million in exports during the same period in 2024, highlighting the sector’s continued strong contribution […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "Warriors snatch a point",
            "url": "https://www.chronicle.co.zw/warriors-snatch-a-point/",
            "content": "Tadious Manyepo in Uyo, NigeriaNigeria 1-1 ZimbabweThe Warriors can no longer be bullied.Not in this day and age.They are no longer the easy-to-beat sort.\n\nYes, they are virtually out of the reckoning for a place at the 2026 World Cup.But even if they are unlikely to be in the United States, Mexico and Canada, they showed the world that they have heart after this draw at the Godswill Akpabio Stadium, last night.\n\nThe manner in which they fought back to strike the hearts of the more than 30 000 spectators who packed the venue, after falling behind with just 16 minutes still to play, was not only heroic but also a telling sign of a force in the making.\n\nSubstitute, Tawanda Chirewa stepped up to tap in the equaliser, right on the stroke of full-time.By that point, Nigerias scorer Victor Osimhen had been substituted for Victor Boniface, and the Nigerian supporters were eagerly awaiting to hoist him high as a saviour of a country whose qualification fate is no longer in their hands.\n\nIt was a match Zimbabwe had been tipped for a massacre.They were never given a chance, with bookmakers placing their odds of winning at 1/35 and 1/17 for a draw.But this is no longer a mickey-mouse team of amateurs.\n\nThey now boast top talent, with players spread across the top leagues worldwide.It could have been a win for the Warriors, with a bit of luck, perhaps.But still, the point, though not significant enough to brighten their qualification prospects, was as important as they come.\n\nThat is probably the biggest point they have earned in a campaign, where they have drawn four games, including the reverse fixture against Nigeria in November 2023.\n\nThe Warriors needed to be tactical, of course, coming up against a team with such attacking talent like Osimhen, Samuel Chukwueze, and Ademola Lookman.The trio, aided by their 12th man in the stands, were quite a menace in the opening stages of the game.\n\nThe first 20 minutes of sustained attack on Zimbabwes goal could have seen the Warriors collapse on any other day.\n\nBut their defensive tactics, coupled with goalkeeper Washington Arubis solidity, ensured the Zimbabweans survived that spell.\n\nThere was a moment when it was literally Arubi versus Osimhen, with the latter always coming off second best.\n\nWith just eight minutes on the clock, Arubi dived to his right to deny the lanky Nigerian from a point-blank header.\n\nTwo minutes later, Arubi thwarted the strikers turn-and-shoot attempt and also stopped Samuel Chukwuezes follow-up.\n\nAt the other end, Walter Musona should have opened the scoring when he outsprinted the Nigerian rearguard, only to shoot wide of Stanley Nwabalis goal.\n\nThe second half was largely the same, and at one point the hosts were so desperate they were trying to shoot from almost impossible positions.\n\nThe resoluteness of the Warriors was always going to pay dividends, but then everything went up in smoke when Osimhen was left unattended and nodded home the opener.\n\nWith just 15 minutes on the clock, Nigeria thought they had sealed the points, ensuring they kept Group C leaders South Africa, who are now on 13 points, in check.\n\nAnd if they needed a hint of what was to come, it should have come with three minutes left to full-time.A good exchange of passes on the left culminated in the ball falling to Knowledge Musona, who was unmarked.\n\nWith Nwabali sprawling on the grass, he only needed to guide it in.Shockingly, he was unable to measure it up properly and crashed the underside of the crossbar, much to the relief of the Nigerians, who by then had broken into party mode.\n\nBut Chirewa wouldnt let them off the hook when his quick feet allowed him to emerge smarter from an acute angle.\n\nCoach Michael Nees decided to congratulate Sports Minister, Kirsty Coventry first and foremost after the most successful female Olympian in Africa won the IOC presidency last week, before saluting his charges.\n\nWe came here with the intention to win. We played well, but we could only draw. Its a big point for us. My boys did very well, and with a bit of luck, we could have won, said Nees.\n\nIt is the second time Zimbabwe has managed to rescue a point within five days in the same competition, after staging another massive comeback, drawing 2-2 against Benin last Thursday in Durban, South Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/rttt.jpg",
            "description": "Tadious Manyepo in Uyo, Nigeria Nigeria 1-1 Zimbabwe The Warriors can no longer be bullied. Not in this day and age. They are no longer the easy-to-beat sort. Yes, they are virtually out of the reckoning for a place at the 2026 World Cup. But even if they are unlikely to be in the United […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "Crocodile Gang member reflects on struggles, sacrifices",
            "url": "https://www.chronicle.co.zw/crocodile-gang-member-reflects-on-struggles-sacrifices/",
            "content": "Patrick Chitumba,[emailprotected]\n\nZIMBABWES liberation struggle remains a defining chapter in the nations history, marked by the sacrifices and resilience of freedom fighters who endured immense challenges under colonial rule.\n\nAmong these veterans is 88-year-old Cde Thomas Ziki from Masvingo, a surviving member of the Crocodile Gang, whose contributions to the Second Chimurenga shaped the countrys path to independence.\n\nCde Zikis journey, which he recently recounted to President Mnangagwa, offers a vivid portrayal of the hardships faced during the struggle. He and President Mnangagwa share a unique bond that traces back to their military training in Egypt during the early 1960s.\n\nTheir paths converged again in Masvingo, where they joined forces to recruit resistance fighters and execute sabotage missions against Rhodesian infrastructure.\n\nThese daring operations led to widespread arrests, including Cde Zikis incarceration at Wha Wha Prison and later Sikombela Prison, where he met prominent leaders like the late former President Robert Mugabe and Cde Simon Muzenda.\n\nAs Zimbabwe prepares to celebrate 45 years of independence on April 18 in Gokwe North District under the theme Zim @ 45: Devolve and Develop Together Towards Vision 2030, the Government has undertaken significant infrastructure projects.\n\nThese include rehabilitating roads and drilling 110 boreholes to provide clean water, underscoring its commitment to development. The event is expected to attract over 100 000 attendees from across the country.\n\nThe Midlands province, hosting this years celebrations, has also declared key detention centres such as Mtapa Hall, Wha Wha, Connemara, and Sikombela as national historical monuments.\n\nThese sites symbolise the sacrifices made by freedom fighters like Cde Ziki and others who endured torture and imprisonment while fighting for independence.\n\nCde Zikis reflections highlight not only his personal sacrifices but also the collective resilience of liberation fighters. He recounted moments of triumph and betrayal, such as President Mnangagwas daring train bombing operation that led to his arrest after being sold out by an overzealous comrade.\n\nDespite enduring severe torture and injuries during his imprisonment, Cde Ziki, whose war name was Cde Mupetabere, continued his work post-release, creating safe passages for freedom fighters until independence was attained.\n\nWhen we finished training in Egypt, President Mnangagwa was to be sent to China for further training. We had to reunite in Masvingo, where we were carrying out several activities including recruiting people for resistance as well as bombing strategic infrastructure while using Cde Nolan Makombes residence as a sanctuary, Cde Ziki said.\n\nHe said when President Mnangagwa bombed the train, he had to leave Masvingo to Harare with a referral letter from Cde Makombe to get assistance in Highfield.\n\nHowever, one of the comrades got excited and sold him out unknowingly after bragging that the boys were now in town, and that is when he was incarcerated. Our gang of 11 was eventually arrested one by one, said Cde Ziki.\n\nHe was eventually arrested and tortured before being thrown into Whawha Prison.Cde Ziki said at Whawha, he found all the Crocodile Gang leaders except Cde Mnangagwa, who had been sent to Harare.\n\nFrom Wha Wha, we were then sent to Sikombela Prison in Gokwe where I later met the likes of the late Cde Robert Mugabe and the late Vice President Cde Simon Muzenda, he said.Cde Ziki said they were eventually released around 1966.\n\nIn the 1970s, they resumed their operations, creating problems for the Ian Smith regime.We were again arrested, and I managed to meet Cde Mnangagwa at Harare Central Prison where we were detained in a detention centre while he (President Mnangagwa) was in prison cells, he said.\n\nCde Ziki said when they saw Cde Mnangagwa doing some electrical work, the detention centre erupted into joy.\n\nPresident Mnangagwa was eventually released and went to Mozambique via Zambia. I was also released and continued with works of creating a passage for freedom fighters around the Chipinge area where I operated until independence, he said\n\nCde Ziki said they communicated through smuggling letters from detained leaders to freedom fighters outside prison walls, which were covert networks that sustained resistance efforts.Former Rhodesia Prison Services officer, Mr Solomon Zimuto, was one of the people who assisted the detained freedom fighters in smuggling letters.\n\nI joined the then Rhodesia Prison Services as a prison officer after training in 1975 before I was posted to Connemara Prison outside Gweru. I had the privilege of working with some of the veterans of the struggle, like Cde Leopold Takawira, he said.\n\nMr Zimuto narrated his role in relaying messages to the freedom fighters in a sophisticated way that prevented them from being caught.\n\nAt one time, I remember, the liberation fighters came and ambushed some prison officers and took them to the war, and they were never found. These were the hazards of the war, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-25-at-20.09.11-10.jpeg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw ZIMBABWE’S liberation struggle remains a defining chapter in the nation’s history, marked by the sacrifices and resilience of freedom fighters who endured immense challenges under colonial rule. Among these veterans is 88-year-old Cde Thomas Ziki from Masvingo, a surviving member of the Crocodile Gang, whose contributions to the Second Chimurenga shaped the […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "COMMENT: Investing in fodder ensures livestock sustainability in times of drought",
            "url": "https://www.chronicle.co.zw/comment-investing-in-fodder-ensures-livestock-sustainability-in-times-of-drought/",
            "content": "In recent months, livestock farmers in Matabeleland South have shown remarkable resilience and adaptability in response to the challenges posed by El Nio-induced droughts, which devastated the region last year.\n\nWith an estimated 19000 cattle lost across the province, the crisis served as a stark reminder of the fragility of the agricultural sector, particularly in relation to climate change. However, the adversity has sparked a renewed sense of determination among farmers, leading to the adoption of innovative strategies to ensure the growth and sustainability of the national herd.\n\nOne of the key strategies that has emerged is the scaling up of fodder production, which is seen as a more reliable and cost-effective alternative to purchasing expensive supplementary feed. Farmers, like Mr France Ndlovu, a stud breeder from Umzingwane District, have embraced silage production and fodder cultivation to improve the quality and quantity of feed available throughout the year.\n\nWith a herd of over 600 cattle, Mr Ndlovu has dedicated around 10 hectares of land to growing crops such as sorghum, millet and sugar graze. He has also set up a grinding machine to process these crops into silage, a practice he believes will help sustain his animals even in times of drought.\n\nMr Ndlovus experience underscores the financial burden that arises from relying on supplementary feed. As he notes, the cost of buying feed can easily exceed US$4000 per week, a figure that is unsustainable for most farmers. In contrast, producing fodder and silage on-site is not only cheaper but also more nutritious for the cattle. Silage production, therefore, offers a long-term solution to feed shortages while reducing dependency on external sources of feed.\n\nOther farmers in the region, particularly those involved in stud breeding, have followed suit. In Insiza District, some breeders have expanded their fodder production efforts and increased the hectares under cropping.\n\nThese measures are essential, especially in the face of changing rainfall patterns. As Mr Mahlangu, a stud breeder, points out, the weather in 2024 has been particularly challenging, with low rainfall leading to water and grazing shortages.\n\nFor stud breeders, ensuring the sustainability of their herds is critical, and they have a responsibility to lead by example in adopting practices that will benefit both their farms and the broader agricultural sector.The recovery of the livestock industry in Matabeleland South is not only a testament to the ingenuity of local farmers but also to the importance of drought mitigation measures.\n\nProvincial livestock specialist, Mr Hatityi Muchemwa, has highlighted that areas such as Beitbridge and Umzingwane experienced relatively fewer cattle deaths due to the proactive measures implemented by farmers in these districts.\n\nThis recovery, made possible by both strategic planning and a shift towards sustainable practices, shows that with determination and innovation, the region is on the path to rebuilding its livestock sector and securing the future of its national herd.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2017/08/Maize-crop.jpg",
            "description": "In recent months, livestock farmers in Matabeleland South have shown remarkable resilience and adaptability in response to the challenges posed by El Niño-induced droughts, which devastated the region last year. With an estimated 19 000 cattle lost across the province, the crisis served as a stark reminder of the fragility of the agricultural sector, particularly in […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        },
        {
            "title": "South Africa actors to grace Chief Dakamela Appreciation Awards",
            "url": "https://www.chronicle.co.zw/south-africa-actors-to-grace-chief-dakamela-appreciation-awards/",
            "content": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub\n\nA host of South African telenovela actors have confirmed their attendance at this years Chief Dakamela Appreciation Awards, endorsing the event and calling on cultural enthusiasts to attend in large numbers.\n\nThe third edition of the awards, also known as Imiklomelo kaDakamela, is set to take place on April 4 and 5 at koDakamela Hall in Nkayi, Matabeleland North. The awards are a ground-breaking initiative by Chief Dakamela, aimed at recognising and honouring individuals for their contributions while they are still alive.Chief Dakamela revealed that preparations for the much-anticipated awards are progressing well.\n\nHe promised a vibrant cultural showcase featuring traditional music, dance, poetry, fashion, and exhibitions promoting indigenous Ndebele foods and drinks.\n\nAmong the guests expected at the event are South African actors Prince Nkanyiso Michael Zulu, Luthuli Dlamini, Ernest Ndlovu and Crispen Nyathi, along with other notable figures.Prince Nkanyiso Zulu, known for his roles in Muvhango, Shaka iLembe and the award-winning The Wife, expressed his excitement about attending the awards.\n\nLina Abesilo (My beloved people), I am thrilled that Chief Dakamela has invited me to this years event in Nkayi. Ill be there in person, and I cant wait to meet those who have been following my career. I encourage everyone, near and far, to join us in celebrating our culture, because without it, we are nothing, said Zulu.\n\nVeteran actor, Ernest Ndlovu, best known for portraying King Jama in Shaka iLembe, also confirmed his participation.\n\nCrispen Nyathi\n\nI was invited to last years awards but couldnt attend due to other commitments. Despite my absence, I was honoured with a traditional rod and a certificate of appreciation. This year, I have cleared my schedule to attend and show my gratitude to Chief Dakamela, said Ndlovu.\n\nLuthuli Dlamini, whose roots trace back to Ntabazinduna koMatupula in Zimbabwe, said he is eager to reconnect with his ancestral heritage.\n\nIt has been a long time since I truly connected with my ancestors. This event is an opportunity for me to immerse myself in Ndebele culture and learn more about my heritage, said Dlamini.Past editions of the awards faced challenges due to poor road networks, discouraging some attendees.\n\nHowever, Chief Dakamela praised the government and rural district councils for rehabilitating the Bulawayo-Nkayi road, ensuring smoother travel for guests and tourists.\n\nWe encourage people to arrive early to experience both days of the extravaganza. Camping sites will be available for those who want to enjoy the outdoor atmosphere, he added.\n\nEstablished in 2022, Imiklomelo kaDakamela is a community-driven initiative that honours individuals and organisations making significant contributions to human development and the preservation of Ndebele culture.\n\nThe awards attract traditional leaders, government officials, African royalty, socialites and celebrities who appreciate Ndebele heritage. Past attendees include the late historian Pathisa Nyathi, poet Albert Nyathi, Sengezo Tshabangu, Bulelani Khumalo, Dr Solwayo Ngwenya, and Brilliant Ncube, the main sponsor through the Kingdom Blue flagship.\n\nWith a stellar line-up of guests and a commitment to cultural preservation, this years Chief Dakamela Awards promise to be a memorable celebration of Ndebele tradition.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/8o.jpg",
            "description": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub A host of South African telenovela actors have confirmed their attendance at this year’s Chief Dakamela Appreciation Awards, endorsing the event and calling on cultural enthusiasts to attend in large numbers. The third edition of the awards, also known as Imiklomelo kaDakamela, is set to take place on […]",
            "time": "08:37",
            "date": "26 Mar 2025"
        }
    ]
}