{
    "news": [
        {
            "title": "Raza Nominated for Top ICC Honour",
            "url": "https://www.chronicle.co.zw/raza-nominated-for-top-icc-honour/",
            "content": "Brandon[emailprotected]\n\nFOR the third consecutive year, Zimbabwes T20I captain, Sikandar Raza, has been recognised for his outstanding performances in the shortest format of the game, after being nominated once again for the International Cricket Council (ICC) T20I Player of the Year award.The nominations were revealed yesterday morning by the ICC.\n\nThe 39-year-old Chevrons stalwart is competing with Pakistans Babar Azam, Indias Arshdeep Singh, and Australias Travis Head for the prestigious honour.\n\nRaza, an all-rounder, continued to deliver for Zimbabwe in 2024, playing a key role in their unbeaten run in the ICC Mens T20 World Cup Sub-Regional Africa Qualifier Group B, where he scored 199 runs and took 10 wickets.\n\nUnder Razas leadership in 2024, Zimbabwe registered famous victories over Sri Lanka, Bangladesh, India, Pakistan, and Afghanistan.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gdfgdf.jpg",
            "description": "Brandon Moyo-brandonmalvin9@gmail.com FOR the third consecutive year, Zimbabwe’s T20I captain, Sikandar Raza, has been recognised for his outstanding performances in the shortest format of the game, after being nominated once again for the International Cricket Council (ICC) T20I Player of the Year award. The nominations were revealed yesterday morning by the ICC. The 39-year-old Chevrons […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "President Mnangagwa: SADC committed to Peace and Development",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-sadc-committed-to-peace-and-development/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nTHE Southern Africa Development Community is committed to peace and development, President Mnangagwa has declared.\n\nDelivering his keynote address at the National Thanksgiving and Dedication Service in Bulawayo today, President Mnangagwa who is also the SADC chairman said the regional bloc is for peace.\n\nMeanwhile, we thank Jehovah God that our SADC region is united in purpose to bring peace, development and prosperity to all our peoples.\n\nIn this spirit, I recognise and warmly welcome those who are in this service from across the SADC region.\n\nPlease feel at home, away from home.\n\nWith President Mnangagwa being the SADC chairperson, this years edition of the event assumed a regional dimension.\n\nRepresentatives from SADC member states are part of the worshipers.\n\nThis years National Thanksgiving and Dedication Service, hosted by Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nMore to follow . . .\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ed-at-prayers.jpg-2-680x380.jpg",
            "description": "Nqobile Bhebhe nqobile.bhebhe@chronicle.co.zw THE Southern Africa Development Community is committed to peace and development, President Mnangagwa has declared. Delivering his keynote address at the National Thanksgiving and Dedication Service in Bulawayo today, President Mnangagwa who is also the SADC chairman said the regional bloc is for peace. “Meanwhile, we thank Jehovah God that our SADC […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "Notify your local authority and police before using firecrackers, citizens urged",
            "url": "https://www.chronicle.co.zw/notify-your-local-authority-and-police-before-using-firecrackers-citizens-urged/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nCITIZENS who wish to use fireworks on New Years Eve must notify their local authority and the police, as failure to do so will result in a violation of the law, police have warned.\n\nNational police spokesperson, Commissioner Paul Nyathi, said the statement issued by Commissioner-General Godwin Matanga last week regarding the use of firecrackers must be taken seriously. The statement is intended to ensure the safety and security of the general public and pets.\n\nIn the statement, CG Matanga urged individuals, institutions, and businesses to comply with the provisions of the law regarding the use of fireworks, firecrackers, and other devices that may disturb public safety and the well-being of animals. Firecrackers cause confusion, anxiety, and fear in animals, often causing them to flee their homes and run into the streets.\n\nCG Matanga emphasised that, in accordance with the countrys laws,\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jjgjfg.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw CITIZENS who wish to use fireworks on New Year’s Eve must notify their local authority and the police, as failure to do so will result in a violation of the law, police have warned. National police spokesperson, Commissioner Paul Nyathi, said the statement issued by Commissioner-General Godwin Matanga last week regarding the […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "Bulawayo has demonstrated its commitment to unity – Bulawayo Minister of State Judith Ncube",
            "url": "https://www.chronicle.co.zw/bulawayo-has-demonstrated-its-commitment-to-unity-bulawayo-minister-of-state-judith-ncube/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nBulawayo Minister of State for Provincial Affairs and Devolution Judith Ncube has said Bulawayo demonstrated its commitment to unity in the country by hosting the prestigious thanksgiving prayer service.\n\nShe said the city is a symbol of untapped potential and exemplifies the rich opportunities that the country has.\n\nIn her welcome remarks at the 8th National Thanksgiving and Dedication Service in Bulawayo, Minister Ncube said Bulawayo remains steadfast to innovation and spirit of stewardship as the country forges ahead to be an upper middle-income society by 2030.\n\nShe also highlighted the spirit of forgiveness prevailing in the country.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches are being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fdhdfh.jpg",
            "description": "Nqobile Bhebhe -nqobile.bhebhe@chronicle.co.zw Bulawayo Minister of State for Provincial Affairs and Devolution Judith Ncube has said Bulawayo demonstrated its commitment to unity in the country by hosting the prestigious thanksgiving prayer service. She said the city is a symbol of untapped potential and exemplifies the rich opportunities that the country has. In her welcome remarks […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "Zimbabwe National Elders Forum Launches Initiative to Document Colonial Injustices and Seek Reparations",
            "url": "https://www.chronicle.co.zw/zimbabwe-national-elders-forum-launches-initiative-to-document-colonial-injustices-and-seek-reparations/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nZimbabwe National Elders Forum (ZNEF) has reassured President Mnangagwa that a true brutal century-long colonial rule account that dispossessed indigenous Zimbabweans of their land and livestock will be documented.\n\nThe idea is to have the British government pay restitutions to millions of people affected and restore dignity in the aftermath of the subjugation of indigenous Zimbabweans by the racist colonial regime.\n\nSpeaking at the ongoing 8th Thanksgiving and Dedication Service in Bulawayo, Zimbabwe National Elders Forum chairperson Bishop Felix Mukonowengwe said a thorough research on affected people is ongoing.\n\nHe said they are working with traditional chiefs and a team of experts.\n\nWe met with His Execellency and he told us to go and do a thorough research in all communities.\n\nWe are now talking to experts, talking to people gathering tangible information to go with it in the United Kingdom.\n\nLets unite as Zimbabweans and move this program ahead.\n\nHe added , Over the years, people lost livestock to the whites, we need that to be addressed, livestock should be returned in the form of money.\n\nThis will happen, President Mnangagwa.\n\nRev Mukonowengwe, said while the history of the country under colonialism had been documented, the trauma experienced by indigenous Zimbabweans has not been fully recorded, which is what they hoped to achieve in the study.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jghj.jpg",
            "description": "Nqobile Bhebhe -nqobile.bhebhe@chronicle.co.zw Zimbabwe National Elders Forum (ZNEF) has reassured President Mnangagwa that a true brutal century-long colonial rule account that dispossessed indigenous Zimbabweans of their land and livestock will be documented. The idea is to have the British government pay restitutions to millions of people affected and restore dignity in the aftermath of the […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "Raza nominated for T20I Player of the Year",
            "url": "https://www.chronicle.co.zw/raza-nominated-for-t20i-player-of-the-year/",
            "content": "Brandon Moyo\n\nZIMBABWE T20I captain Sikandar Raza has been nominated for the International Cricket Council (ICC) T20I Player of the Year for the third time running.\n\nThe 39-year-old all-rounder continued to deliver for the Chevrons in 2024, and was instrumental in their unbeaten run in the ICC Mens T20 World Cup sub-regional Africa Qualifier Group B, smashing 199 runs and picking up 10 wickets.He is nominated alongside Babar Azam (Pakistan), Travis Head (Australia) and Arshdeep Singh (India).\n\nHe led Zimbabwe to victories over Sri Lanka, Bangladesh, India, Pakistan, and Afghanistan.At the sub-regional qualifier, Raza secured his maiden T20I hundred and five-wicket haul, helping Zimbabwe break records at the tournament.\n\nIn 24 T20Is this year, the Chevrons stalwart scored 573 runs at an average of 28.56 with a high score of 133 not out.He also picked up 24 scalps at 22.25 with best figures of 5/18.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gdfgdf.jpg",
            "description": "Brandon Moyo ZIMBABWE T20I captain Sikandar Raza has been nominated for the International Cricket Council (ICC) T20I Player of the Year for the third time running. The 39-year-old all-rounder continued to deliver for the Chevrons in 2024, and was instrumental in their unbeaten run in the ICC Men’s T20 World Cup sub-regional Africa Qualifier Group […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "Reverend Wutawunashe Praises President Mnangagwa’s Commitment at National Thanksgiving Service",
            "url": "https://www.chronicle.co.zw/reverend-wutawunashe-praises-president-mnangagwas-commitment-at-national-thanksgiving-service/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nFaith for Nation Campaign founder and Chairperson Reverend Andrew Wutawunashe has congratulated President Mnangagwa for attending the National Thanksgiving and Dedication Service since its inception in 2017.\n\nIn his remarks at the ongoing annual event, Rev Wutawunashe told President Mnangagwa that delegates from the SADC region were eager to interact with him.\n\nI would like to tell you that your Excellency most delegates from SADC, in one accord, have been looking forward to hearing from you.\n\nWe are elated to have you here with us, said Rev Wutawunashe.\n\nPresident Mnangagwa assumed the regional bloc chairmanship in August this year.\n\nMost delegates from SADC have said when they return to their countries they will recommend this platform to their clergy. This shows how important this service is, he added.\n\nWith President Mnangagwa being the SADC chairperson, this years edition of the event assumed a regional dimension.\n\nRepresentatives from SADC member states are part of the worshiper.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches are being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nMore to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gjdh.jpg",
            "description": "Nqobile Bhebhe -nqobile.bhebhe@chronicle.co.zw Faith for Nation Campaign founder and Chairperson Reverend Andrew Wutawunashe has congratulated President Mnangagwa for attending the National Thanksgiving and Dedication Service since its inception in 2017. In his remarks at the ongoing annual event, Rev Wutawunashe told President Mnangagwa that delegates from the SADC region were eager to interact with him. […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "President Mnangagwa arrives at National Thanksgiving and Dedication Service",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-arrives-at-national-thanksgiving-and-dedication-service/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa has arrived for the 8th annual National Thanksgiving and Dedication Service in Bulawayo amid thunderous applause from thousands of congregants.\n\nThe annual event is held at the Zimbabwe International Exhibition Centre (ZIEC) Hall.\n\nPresident Mnangagwa was accompanied by Faith for Nation Campaign founder and Chairperson Reverend Andrew Wutawunashe, Vice President Cde Kembo Mohadi, Defence and Security Oppah Muchinguri-Kashiri, and several religious leaders and government officials.\n\nThis years National Thanksgiving and Dedication Service, hosted by the Inter-denominational churches is being held under the theme: Our Nation, Our Opportunity  Celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nAs the President and his entourage entered the auditorium, with the energetic youthful Family Voices on stage, and a traditional isiNdebele poet praising the Head of state, there were loud cheers as the procession was beamed on large screens.\n\nPresident Mnangagwa waved back at the worshipers.\n\nWith President Mnangagwa being the SADC chairperson, this years edition of the event assumed a regional dimension.\n\nRepresentatives from SADC member states are part of the worshipers.\n\nMusicians from the region such as Mrs Mothibedi (Botswana), Mrs Gwanyanya (Zambia), Mrs Zengeya who is based in the United Kingdom belted out their popular songs.\n\nWorshipers adorned in various colorful religious robessome designed from the national fabric sitting side by side, holding their Bibles and tambourines, exhibited a jubilant mood indicative of their eagerness to praise the Almighty.\n\nThe atmosphere is vibrant, characterised by ululation, singing, and dancing within the auditorium\n\nMore to follow . . .\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/WhatsApp-Image-2024-12-29-at-11.00.29-680x380.jpeg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa has arrived for the 8th annual National Thanksgiving and Dedication Service in Bulawayo amid thunderous applause from thousands of congregants. The annual event is held at the Zimbabwe International Exhibition Centre (ZIEC) Hall. President Mnangagwa was accompanied by Faith for Nation Campaign founder and Chairperson Reverend Andrew Wutawunashe, Vice President Cde […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "Gunshots as armed robbers hit Choppies Supermarket in New Luveve",
            "url": "https://www.chronicle.co.zw/gunshots-as-armed-robbers-hit-choppies-supermarket-in-new-luveve/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nCHOPPIES supermarket in New Luveve suburb Bulawayo was on Saturday night targeted by three armed robbers who fired three shots, injuring the manager and a security guard before fleeing on foot with an undisclosed amount of cash.\n\nVendors nearby told the Chronicle that when the shots were fired, they initially thought it was someone setting off firecrackers, only to realise in horror that a robbery was actually in progress.\n\nIt was quite dark just after 8PM when we heard the gun shots, which we thought were firecrackers. We even scolded the person, telling them not to do that near us. However, moments later, we realised in horror that it was actually gunfire and we ran for our lives, said a female vendor who wished to remain anonymous.\n\nOne of the employees who witnessed the robbery said the robbers fired three shots, with one grazing the managers forehead as they demanded the keys to the safe.\n\nThey stabbed one security guard twice in the leg. They continued demanding the safe keys before taking the days cash and walking out on foot towards Cowdray Park. We suspect they had left their getaway car somewhere, said the employee.\n\nThe supermarket opened for normal business this morning, and it was observed that senior management had also arrived at the shop.\n\nThis is a developing story\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/WhatsApp-Image-2024-12-29-at-09.22.25-680x380.jpeg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw CHOPPIES supermarket in New Luveve suburb Bulawayo was on Saturday night targeted by three armed robbers who fired three shots, injuring the manager and a security guard before fleeing on foot with an undisclosed amount of cash. Vendors nearby told the Chronicle that when the shots were fired, they initially thought it […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        },
        {
            "title": "President Mnangagwa to join thousands at the National Thanksgiving and Dedication Service",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-to-join-thousands-at-the-national-thanksgiving-and-dedication-service/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa is today expected to join thousands of congregants from various religious denominations at the 8th annual National Thanksgiving and Dedication Service in Bulawayo.\n\nHe arrived in Bulawayo yesterday afternoon.\n\nPresident Mnangagwa arrived yesterday at the Joshua Mqabuko Nkomo International airport in Bulawayo ahead of National Thanks Giving and Dedication Service. He was welcomed by the Minister of State for Bulawayo Provincial Affairs and Devolution Judith Ncube (left) and the Minister of Defence and war Veterans Affairs Oppah Muchinguri-Kashiri (right). Picture: Nkosizile Ndlovu)\n\nThe service is themed Our Country, Our Opportunity  Celebrating the Progress and Acknowledging the Potential of Our Country, Zimbabwe.\n\nAccording to the official program, Vice President Dr Chiwenga will also attend the event at the Zimbabwe International Exhibition Centre (ZIEC).\n\nBishop Nehemiah Mutendi, Patron of the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), is set to deliver an address before President Mnangagwa gives the keynote speech.\n\nDeputy Minister of Information, Publicity and Broadcasting Services Dr Omphile Marupi is part of the congregants at the National Thanksgiving and dedication service at ZITF\n\nThe first Zimbabwe National Thanksgiving and Dedication Service took place in December 2017, following the establishment of the Second Republic under President Mnangagwas leadership. He has attended the event annually since then.\n\nThe event is organised by the Faith for the Nation Campaign in partnership with the ZIICC. It serves as a vital platform for believers to connect with the countrys leadership in prayer for the nation, which is essential for the advancement and prosperity of any society.\n\nBishops from multiple denominations in the country, traditional leaders representatives, business sector leaders and several government officials are in attendance.\n\nAbout 30 buses have been organised to ferry people around Bulawayo to attend the service.\n\nMore to follow . . .\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/WhatsApp-Image-2024-12-29-at-09.30.13-680x380.jpeg",
            "description": "Nqobile Bhebhe, Nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa is today expected to join thousands of congregants from various religious denominations at the 8th annual National Thanksgiving and Dedication Service in Bulawayo. He arrived in Bulawayo yesterday afternoon.   The service is themed “Our Country, Our Opportunity – Celebrating the Progress and Acknowledging the Potential of Our Country, Zimbabwe.” According […]",
            "time": "18:38",
            "date": "29 Dec 2024"
        }
    ]
}