{
    "news": [
        {
            "title": "Retailers suffer, nightlife takes over shopping centres",
            "url": "https://www.chronicle.co.zw/retailers-suffer-nightlife-takes-over-shopping-centres/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nOVER the past decade, Northend Shopping Centre in Bulawayo has undergone a dramatic metamorphosis, transforming from a quiet neighbourhood hub into a vibrant nightlife district. Mrs Nomalanga Msimanga, a long-time resident, has witnessed this evolution first-hand. Gone are the days of leisurely grocery shopping, salon visits, and quick errands for children. The shopping centre now pulsates with the energy of late-night revellers, its once tranquil atmosphere replaced by the sounds of music, laughter, shouts, curses and brawls.\n\nThe elderly woman, who has been a vendor at the Northend Shopping Centre for over 25 years, still finds it hard to believe that the place now hosts six bars and nightclubs, excluding a liquor section in a major retailer.\n\nThis is a relatively small shopping centre, but the number of bars and nightclubs that have opened in the last few years is frightening. Its acceptable if such a place accommodates one bar and a single nightclub, but six in total is just too much, said Mrs Msimanga.\n\nShe believes the proliferation of nightclubs and bars in the area contributes to rising crime rates and the increase in alcohol and illegal substance abuse.\n\nIm not one to judge, but the presence of so many bars and nightclubs attracts people from all over Bulawayo, who end up committing alcohol-fuelled crimes because they have no attachment to North End suburb, unlike our children and grandchildren who grew up here and are part of the community, she said.\n\nThe emergence of bars and nightclubs in the citys suburbs, both in western and eastern areas, is a cause for concern for Bulawayo residents, who continuously witness the closure of other businesses, replaced by entertainment and leisure joints.\n\nIn recent days, the Chronicle conducted a survey in various suburbs of the city to assess the number of leisure joints sprouting around the City of Kings. The results are astounding. While the North End Shopping Centre has six bars and nightclubs, a few kilometres to the east in Queens Park suburb lies another haven for drinking spots.\n\nFor a small shopping centre that primarily serves residents of Queens Park East suburb and parts of Kingsdale, the area has three nightclubs that close their doors at 10PM or sometimes beyond the legally accepted closing times. In comparison, the shopping centre has four grocery shops and a butchery where a tshisanyama also operates.\n\nA lot of illegal gold panning takes place in Queens Park and Mahatshula suburbs, so those guys (gold panners) have a lot of money to spend, and they come here to drink. It doesnt matter whether its a Monday or Saturday, as long as they have money, they spend it, said a vendor who declined to be named.\n\nHe attributed the survival of the three nightclubs in one area to the free flow of cash by the gold panners and the booming commercial sex work business, which involves a lot of money changing hands.\n\nAcross town in Cowdray Park, the most populated suburb in the City of Kings, at the biggest terminus in the area, one can choose from numerous bars and nightclubs to get a cold beer or dance the night away.\n\nIts worrying when alcohol is easily accessible, sometimes to minors, as some bar owners are not strict about young people patronising their businesses. A lot of crime takes place here, and we appeal to the police to do more patrols, especially at night, said Hazvinei Mutoro, who sells airtime at the terminus.\n\nIn Emakhandeni, residents are concerned that the emergence of bars, which close late into the night, is contributing to moral decay among the youth. A bar and a nightclub operate in one section of the suburb.\n\nAt what is now known as the citadel of leisure and entertainment in Bulawayo, Chigumira Business Centre in Luveve arguably has the highest number of bars and nightclubs in the city. In addition to the numerous leisure centres in the area, individuals also sell alcohol from their cars.\n\nTshabalala suburb also boasts a vibrant nightlife, courtesy of several bars and nightclubs that have sprouted across the suburb.\n\nBulawayo United Residents Association (Bura) chairperson Mr Winos Dube said that while the city welcomes all forms of businesses for employment creation and boosting the local economy, the number of bars and nightclubs mushrooming in Bulawayo is worrying.\n\nBulawayo needs the business, but not at the rate at which every available space is being turned into a bar or nightclub. We need our businesspeople and investors to put their money into other sectors of the economy so that the youth can get employment and stay out of the streets, said Dube.\n\nLast year, the Liquor Licensing Board (LLB) embarked on a crackdown on non-compliant night spots and bottle stores to address the rise of illegal drinking outlets, many of which are associated with criminal activities and poor hygiene. The LLBs initiative aimed to curb unauthorised drinking spots and enhance public safety. It involved comprehensive physical inspections to ensure compliance with operational, health, and safety standards.\n\nThe law stipulates that night spots must be soundproofed, air-conditioned, hygienic, and free from police fines to be licensed. Bar counter-tops and shelves should have smooth, invulnerable surfaces, firefighting appliances, and fire escape facilities with visible notices. In a shocking development, it was revealed last year that there are only 12 licensed nightclubs in Bulawayo, and many establishments are operating illegally as nightclubs, violating both Government regulations and council by-laws.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-22-copy.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com  OVER the past decade, Northend Shopping Centre in Bulawayo has undergone a dramatic metamorphosis, transforming from a quiet neighbourhood hub into a vibrant nightlife district. Mrs Nomalanga Msimanga, a long-time resident, has witnessed this evolution first-hand. Gone are the days of leisurely grocery shopping, salon visits, and quick errands for children. The shopping […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "Nation needs robust opposition: President",
            "url": "https://www.chronicle.co.zw/nation-needs-robust-opposition-president/",
            "content": "Wallace Ruzvidzo in Kwekwe\n\nOpposition legislators must actively scrutinise and hold the ruling Zanu-PF partysMembers of Parliament to account so that they deliver for the general citizenry, President Mnangagwa has said.\n\nThe President said the opposition legislators should give their ruling party counterparts a hard time in Parliament to build and develop Zimbabwe.\n\nHe said this yesterday during a familiarisation tour of the First Familys Pricabe Farm by the countrys legislators drawn from both the ruling party Zanu-PF and the opposition CCC.\n\nDo not make the ruling party (MPs) sit, you should criticise them a lot and when you do they will work in Parliament.\n\nAs the opposition be serious with your opposition because where they (Zanu-PF MPs) have erred, they will fix it and that will help us remain in power and you will stay in the opposition, said the President with a chuckle.\n\nTurning to the business of the day, President Mnangagwa said it was critical that Zimbabwe maintains its food self-sufficiency.\n\nBecause we are aspiring for the best, to me, the first and best principle for a country is the ability to feed itself.A country must be able to feed itself. If a country can feed itself, it earns respect and I am happy that in Zimbabwe, we can feed ourselves. We must not lose that position, he said.\n\nTo this end, President Mnangagwa said Government would continue to capacitate the countrys farmers at all levels.\n\nTheir capacitation, he added, was far much better than spending foreign currency on imports.\n\nPresident Mnangagwa poses for a picture with legislators and senators including Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (right) and Skills Audit and Development Minister Paul Mavhima (left) during a tour of Pricabe Farm in Kwekwe yesterday\n\nGovernments role is to capacitate our farmers at every level . . . you may think it is expensive. No, it is cheaper for us to capacitate every single farmer to produce, than not to capacitate them and then import because when you import, you are sending your own resources outside.\n\nIt is particularly important that you capacitate your own people to have the capacity to produce at every level. We (Government) do our best to make sure we support our farming sector. That way, we remain a food-secure nation and I am happy that so far, we have managed to remain a fully secure country, he said.\n\nOn climate change, which has brought with it various phenomena such as droughts, the President said the Government was putting in place measures to increase the countrys irrigation capacity. We can always mitigate the impact of weather by creating water bodies and promoting irrigation countrywide.\n\nI believe that, I have discussed with my Minister of Agriculture and said to my minister, minister, suppose there was no rain in the country, but our people wanted to eat food, whether there is rain or there is no rain . . . now, work out how much hectares of land should be under irrigation, so that whether there is rain or there is no rain we guarantee food security in our country. And my minister has done that.\n\nThe President said although the set target is yet to be met, there is commendable progress towards that goal.\n\nIt is necessary to make sure we guarantee ourselves food security by making sure that when there is severe drought, we still have enough hectares in the country under irrigation, which guarantees us food, said the President.\n\nHe said the First Family, which has thriving maize, potatoes and soya bean crops, coupled with abundant livestock, was playing its part in contributing to the countrys food security.\n\nPresident Mnangagwa said the farms success was a result of a highly mechanised operations system and learning from other farmers.\n\nPresident Mnangagwa\n\nWe are a small farm, not very big, but I can assure you we are productive. I am satisfied that we are very productive on the piece of land which we were given. In the winter, in the summer, this place is kept productive. We are highly mechanised (and) we do our best to contribute to national food security as a family, he said.\n\nThe President said both himself and the First Lady were from agricultural backgrounds hence their passion for farming.\n\nBoth myself and my wife are from very humble beginnings, so to us, farming is in our blood so we keep our little farm highly productive, he said.\n\nIn her brief remarks, First Lady Amai Auxillia Mnangagwa applauded the legislators, especially those from the opposition, for visiting the farm to witness the works being done at the First Familys farm.\n\nThis, she said, was very productive and unifying. As the First Lady I am very happy and elated because this has never happened before, seeing both ruling party and opposition MPs here. We never used to see eye to eye . . . this is very brave, it was not something that would have ordinarily happened, she said.\n\nThe First Lady also gifted the legislators some of the farms agricultural produce.\n\nMidlands Province Minister of Provincial Affairs and Devolution Cde Owen Ncube said the President was leading from the front.\n\nSpeaker of Parliament Advocate Jacob Mudenda said President Mnangagwa had demonstrated that economic freedom was possible. The tour was attended by MPs, Senators, Chiefs, Ministers, Deputy Ministers and senior Government officials.\n\nAdvocate Jacob Mudenda\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-24-copy.jpg",
            "description": "Wallace Ruzvidzo in Kwekwe Opposition legislators must actively scrutinise and hold the ruling Zanu-PF party’s  Members of Parliament to account so that they deliver for the general citizenry, President Mnangagwa has said. The President said the opposition legislators should give their ruling party counterparts a hard time in Parliament to build and develop Zimbabwe. He […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "The end of cinema?",
            "url": "https://www.chronicle.co.zw/the-end-of-cinema/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nIs it dj vu for movie lovers in Bulawayo? Motion picture powerhouse Ster Kinekor Zimbabwe has closed, evoking memories of 2017 when Bulawayo Rainbow Cinemas shut its doors for good.\n\nLocated at the heart of Bulawayo Centre, Ster Kinekor Zimbabwe is now closed, with notices posted around the entrance stating:\n\nWe regret to inform you that our business is currently closed. We appreciate your understanding and apologise for any inconvenience this may cause. Thank you for your loyalty and support.\n\nThis sudden closure of an establishment that has hosted movie premires and events such as the European Film Festival Zimbabwe (EuroFilmFestZW) has left many questions unanswered.\n\nCinemas have faced significant challenges in recent years, particularly with the rise of streaming services like Netflix, Amazon Prime, and Showmax, which have drastically impacted movie theatre attendance.\n\nThe closure of Ster Kinekor Bulawayo is part of a broader trend, reflecting a shift in the global entertainment landscape. More audiences are opting for the convenience and affordability of watching films from the comfort of their homes, leading to a steep decline in ticket sales and revenue for traditional cinemas.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-1-copy-4.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Is it déjà vu for movie lovers in Bulawayo? Motion picture powerhouse Ster Kinekor Zimbabwe has “closed,” evoking memories of 2017 when Bulawayo Rainbow Cinemas shut its doors for good. Located at the heart of Bulawayo Centre, Ster Kinekor Zimbabwe is now closed, with notices posted around the entrance stating: “We regret to […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "Short-term insurance sector sees 56pc drop in registered entities",
            "url": "https://www.chronicle.co.zw/short-term-insurance-sector-sees-56pc-drop-in-registered-entities/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nThe Insurance and Pensions Commission (Ipec) licence verification exercise led to a 56 percent decrease in the number of registered entities or individuals in the short-term insurance industry, dropping from 1 281 to 561 as of September 30, 2024, according to a report.\n\nIpec is a statutory body tasked with regulating, supervising, and developing the insurance and pensions industry to protect policyholders and pension scheme members in Zimbabwe.\n\nIn its Short-Term Insurance Industry Report for the nine months ending September 30, 2024, Ipec stated that there were 561 registered entities/persons in the short-term insurance industry as of September 30, 2024, a 56 percent decline from the 1 281 registered players/persons recorded on September 30, 2023.\n\nThe decrease is attributed to a licence verification exercise undertaken by the Commission. All insurers were required to submit their list of agents in terms of Section 17(2) of the Insurance Regulations SI 49 of 1989, as amended.\n\nThis resulted in 720 agent licences being deemed invalid because the agents had either ceased representing the insurer or their licences had expired and were not renewed, reads part of the report.\n\nDuring the third quarter of 2024, the Commission registered one micro-insurer, eight corporate agents, two multiple agents, and eighteen individual agents. Additionally, Ipec renewed four individual agent licences and one multiple agent licence, bringing the total number of registrations to 34 during the third quarter and 56 for the first nine months of 2024.\n\nFor the period under review, short-term insurers reported insurance revenue amounting to ZWG2,53 billion. The motor, fire, and farming classes of business were the primary revenue drivers, collectively contributing 71 percent of the total revenue.\n\nForeign-currency-denominated insurance revenue was reported at US$153,97 million during the same period.\n\nOld Mutual Insurance, Nicoz Diamond Insurance Company, and Alliance Insurance dominated the market, holding a combined market share of 52 percent in terms of foreign currency-denominated insurance revenue.\n\nAs of September 30, 2024, direct insurers had underwritten 605 518 policies, an increase from the 419 818 policies recorded as of June 2024.\n\nIn the third quarter alone, 237 511 new policies were underwritten, while 51 811 policies were cancelled or expired. Most of the policies issued during the nine-month period were in the motor insurance sector, which accounted for 535 685 policies, constituting 88 percent of the total.\n\nAll 19 short-term insurers reported capital levels above the minimum capital requirement of ZWG15 008 as of September 30, 2024. Investments in prescribed assets by short-term insurers totalled ZWG320,82 million, reflecting an average compliance level of 11 percent, an increase from the ZWG160,12 million (8 percent compliance level) recorded as of June 30, 2024.\n\nTen out of the 19 insurers met the minimum prescribed asset ratio of 10 percent, with investments primarily composed of Treasury Bills, Corporate Bonds, and private equities.\n\nFor the nine months ending September 30, 2024, insurance brokers recorded gross premiums of ZWG1,9 billion and net brokerage commission of ZWG260 million. Regarding foreign currency-denominated business, insurance brokers reported gross premiums of US$105 million and net brokerage commission of US$14,8 million.\n\nReinsurance brokers reported gross premiums of ZWG1,1 billion and net brokerage commission of ZWG39,8 million. For foreign-currency-denominated business, reinsurance brokers recorded gross premiums of US$69 million and net brokerage commission of US$2,4 million during the same period.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/06/Insurance-and-Pension-Commission-IPEC.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  The Insurance and Pensions Commission (Ipec) licence verification exercise led to a 56 percent decrease in the number of registered entities or individuals in the short-term insurance industry, dropping from 1 281 to 561 as of September 30, 2024, according to a report. Ipec is a statutory body tasked with regulating, supervising, and […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "Bulilima loses vital link with collapse of Majazi Bridge",
            "url": "https://www.chronicle.co.zw/bulilima-loses-vital-link-with-collapse-of-majazi-bridge/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nTHE collapse of Majazi Bridge on the Plumtree-Bambadzi Road, which connects the border town to the Maitengwe Border Post in Bulilima district, Matabeleland South, has sparked widespread concern. The bridge, located in Hingwe ward, is now completely impassable and continues to deteriorate further with each passing storm in the region.\n\nOther affected bridges, according to the Bulilima Rural District Council update, are Makawule Bridge at Ndiweni ward and Gambu Bridge in Matjinge ward. The causeway across Makawule River along Plumtree-Bhagane main road is also damaged, making it challenging for vehicles to cross.\n\nMajazi Bridge is very critical to the countrys economy as it connects travellers from Zimbabwe heading to Botswana and South Africa and vice versa. During the festive season, foreign-based Zimbabweans visiting their homes had a torrid time travelling to places that include, but are not limited to, Bulilima, Mangwe, Plumtree, Tsholotsho, Lupane, Nkayi, Victoria Falls, and Gokwe.\n\nBulilima District Development Co-ordinator, Mr Onesimo Zogara, said there is an urgent need to address the dilapidated state of roads and bridges in the district.\n\nWe are quite concerned with the deplorable state of some of our roads in Bulilima. In essence, most of our trunk and feeder roads are gravel roads which have to be maintained periodically to make them trafficable. Our three Road Authorities, who are mandated to take good care of our roads, are facing challenges of having inadequate equipment to effectively execute their duties.\n\nThe Emergency Road Rehabilitation Programme (ERRP) by the Government has been very instrumental in ensuring that our roads are rehabilitated, but there is a great need to capacitate our Road Authorities with the much-needed yellow machines so that there is no over-reliance on outsourcing equipment and hiring, which is costly and time-consuming, said Mr Zogara.\n\nHe said plans are underway for the maintenance of some roads in the district.\n\nThe Government has so far awarded tenders to contractors who are coming in to do maintenance grading on Plumtree-Maitengwe and Plumtree-Ndolwane roads, with plans underway to tar Plumtree-Maitengwe Road.\n\nWe are so humbled by the Second Republics agility and dedication in fulfilling its promises of leaving no one and no place behind, said Mr Zogara.\n\nBulilima legislator and Information Communication Technology, Postal and Courier Services Deputy Minister, Dingumuzi Phuti, said relevant authorities should swiftly address the issue as it is derailing the growth of the countrys economy.\n\nThe issue of Majazi Bridge is not an issue of budget but an issue of commitment and resolve on the part of the Ministry of Transport at the provincial level. We have tried and communicated so they can come and do the simple work of repositioning the bridge, but nothing has happened to date. It has therefore now attracted a situation where there is no connection to a busy border like Maitengwe Border Post and the road that links Plumtree town, Tsholotsho district, Lupane, and many other places.\n\nIt is my clarion call that this bridge be repaired as it offers an alternative route of trade from Maitengwe Border Post that connects Botswana and South Africa. The cross-border trade has sustained Bulilima and the Matabeleland region in particular for many years, thus it is prudent that the cross-border activity be sustained because it offers a solution to some problems that our economy faces, said Cde Phuti.\n\nHe said the bridge collapse has also affected local villagers who are incurring unnecessary costs.\n\nMajazi Bridge repair or reconstruction is long overdue, and we are very worried. It also affects the locals as they cannot go directly to Hingwe and Bambadzi but have to take a longer route that takes them to Madlambudzi first, then to Khandamhlophe, Mbimba, and finally towards Bambadzi. This is really expensive and unnecessary in this day and age. Its not fair to have people suffer to access more services.\n\nI personally, however, put confidence in the Second Republic that all this infrastructure is going to be attended to and that our people will be given the kind of life that they deserve and desire, said the Deputy Minister.Follow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-4-copy-1.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com  THE collapse of Majazi Bridge on the Plumtree-Bambadzi Road, which connects the border town to the Maitengwe Border Post in Bulilima district, Matabeleland South, has sparked widespread concern. The bridge, located in Hingwe ward, is now completely impassable and continues to deteriorate further with each passing storm in the region. Other affected bridges, […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "COMMENT: Public servants must lead  from the front  for us to achieve Vision 2030",
            "url": "https://www.chronicle.co.zw/comment-public-servants-must-lead-from-the-front-for-us-to-achieve-vision-2030/",
            "content": "BULAWAYO Provincial Affairs Minister Judith Ncubes recent remarks about the lack of dedication among some public service heads in Bulawayo highlight a pressing issue that threatens Zimbabwes Vision 2030.\n\nHer forthright critique is not just a rebuke but a crucial wake-up call for those entrusted with driving progress.\n\nVision 2030, aimed at transforming Zimbabwe into a prosperous, upper-middle-income society, demands unwavering commitment at all levels of governance.\n\nHowever, the Ministers frustration with the apathy displayed by some officers is justified. Public service is not a job to be endured but a responsibility to be embraced with purpose and passion.\n\nAs Minister Ncube noted, individuals who are disinterested in working should reassess their roles and consider redeployment. Leadership must be proactive, and a lackadaisical approach only serves to sabotage collective progress.\n\nHer analogy comparing public officers to drivers of a vehicle heading towards Vision 2030 is both vivid and poignant. Each public servant has a part to play in propelling the nation forward. However, if individuals deflate the tyres or drain the fuel through negligence or inaction, progress halts. Such attitudes are not merely unproductive; they actively hinder the attainment of national goals.\n\nVision 2030 requires cohesive action, with all institutions moving in locksteps towards shared goals.\n\nPresident Mnangagwas demand for tangible results serves as a reminder that policies and frameworks like the National Development Strategy 1 (NDS1) must translate into real progress. Public servants must lead from the front, fostering accountability and delivering measurable outcomes that improve citizens lives.\n\nPresident Mnangagwa\n\nMinister Ncubes comments, therefore, are a clarion call for urgent reform. Vision 2030s success hinges on teamwork, dedication, and an unrelenting focus on results. Public officers must shed complacency and fully embrace their roles as custodians of national progress. Zimbabwe cannot afford to falter; the stakes are too high. The time for action is now.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/Minister-Judith-Ncube.jpg",
            "description": "BULAWAYO Provincial Affairs Minister Judith Ncube’s recent remarks about the lack of dedication among some public service heads in Bulawayo highlight a pressing issue that threatens Zimbabwe’s Vision 2030.  Her forthright critique is not just a rebuke but a crucial wake-up call for those entrusted with driving progress. Vision 2030, aimed at transforming Zimbabwe into […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "WATCH: Bulawayo hosts first Legal Year opening outside Harare",
            "url": "https://www.chronicle.co.zw/watch-bulawayo-hosts-first-legal-year-opening-outside-harare/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTODAY marks a historic occasion as Chief Justice Luke Malaba presides over the official opening of the 2025 legal year at the Bulawayo High Court. The landmark event, traditionally held at the Constitutional Court in Harare, signifies a significant shift in the Judiciarys approach, aligning with the Governments devolution agenda.\n\nBy hosting the main ceremony in Bulawayo, the Judiciary demonstrates its commitment to decentralising State functions and enhancing accessibility for citizens across the country. Replica ceremonies will be held concurrently in Harare, Mutare, Masvingo, and Chinhoyi.\n\nSpeaking to the Chronicle at the Bulawayo High Court, Judiciary Service Commission Secretary, Mr Walter Chikwana, highlighted the significance of the historic event. He stressed that the ceremony will provide a platform for Chief Justice Malaba to outline a clear and comprehensive roadmap for the Judiciary in the year ahead.\n\nAs part of the tradition, the Chief Justice delivers a keynote address as part of the judiciarys accountability to the public. The Chief Justice is supposed to report to the people on the performance and operations of the judiciary for the previous year, which is 2024. Thats what the Chief Justice is going to do by providing all the operations that took place during the year under review, including statistics on court performances, starting from the Magistrates Court, going right up to the Constitutional Court.\n\nThe Chief Justice will also share the direction and trajectory that the judiciary is going to take in 2025. The emphasis for this year is on stakeholder collaboration and participation in the administration of justice\n\nThis is because the JSC has taken the position that the administration of justice can never be done successfully without stakeholder involvement in collaborating and coming together to ensure that the administration of justice is effective and efficient. Therefore, that is the target which the Chief Justice will be taking, said Mr Chikwana, who was overseeing the preparations.\n\nHe said the shift to Bulawayo is consistent with the constitutional policy and the imperative on devolution, as well as the government policy and National Development Strategy (NDS1), which directs the decentralisation of Government institutions.\n\nHe said that Judge President of the High Court, Justice Mary Dube, will attend the Bulawayo ceremony.\n\nDeputy Chief Justice Mrs Elizabeth Gwaunza will preside over the event in Harare, while Mrs Marie-Anne Gowora, a judge of the Constitutional Court, will oversee the ceremony in Masvingo.\n\nIn Mutare, Justice Ben Hlatshwayo, also a judge of the Constitutional Court, will headline proceedings, while the Deputy Judge President, Justice Garainesu Mawadze, will preside over proceedings at Chinhoyi High Court.\n\nThe High Court of Zimbabwe\n\nMr Chikwana said Chief Justice Malaba will host a dinner for approximately 200 delegates, including key partners in the justice sector in Bulawayo.\n\nThe dinner has become a tradition and provides an opportunity for various players in the justice system to interact with the Chief Justice.\n\nExpected attendees include the President of the Chiefs Council, Chief Mtshane Khumalo, Prosecutor General Justice Loice Matanda-Moyo, Attorney-General Mrs Virginia Mabhiza, and several top judiciary officials in the region.\n\nThe Chronicle news crew observed judiciary staff making frantic preparations at the High Court.\n\nA tent to house some guests has been pitched at the venue.\n\nRoads leading to the Bulawayo High Court along Herbert Chitepo Street and Eighth Avenue are expected to be barricaded in anticipation of this significant day in the countrys legal calendar.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/06/Mr-Walter-Chikwana.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw  TODAY marks a historic occasion as Chief Justice Luke Malaba presides over the official opening of the 2025 legal year at the Bulawayo High Court. The landmark event, traditionally held at the Constitutional Court in Harare, signifies a significant shift in the Judiciary’s approach, aligning with the Government’s devolution agenda. By hosting the […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "Highlanders set for constitutional changes at AGM",
            "url": "https://www.chronicle.co.zw/highlanders-set-for-constitutional-changes-at-agm/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS is gearing up for significant changes, with proposed constitutional amendments set to be ratified at the Annual General Meeting (AGM) on January 26.\n\nThe amendments aim to modernise the clubs constitution, aligning it with contemporary standards and best practices in club management.\n\nDuring an Extraordinary General Meeting (EGM) at the teams clubhouse yesterday, members were given the opportunity to review and propose changes to the constitution.\n\nThe meeting was closed to the media and general public, and Highlanders secretary-general, Morgen Dube, refrained from disclosing details of the discussions, as the club opted to keep their cards close to their chest.\n\nThe meeting was a success, and were happy with the progress made. We have been working on these amendments for some time now, and its good to see that our members are engaged and willing to participate in shaping the future of our club.\n\nWere looking to strengthen our leadership and decision-making processes, and to ensure that our constitution is aligned with modern best practices. Were confident that our members will support these changes, and that they will help to take our club to the next level, he said.\n\nZimpapers Sports Hub, however, understands that the proposed amendments focus on updating various aspects of the clubs governance and management. One of the key changes proposed is a longer waiting period before new members can participate in club decisions, aiming to prevent individuals from joining and immediately influencing outcomes.\n\nAdditionally, changes to executive titles are also under consideration, with the objective of enhancing the clubs governance and management structure.\n\nThe amendments also address the issue of overlapping roles between the Chief Executive Officer and the secretary-general, which have, in the past, appeared to duplicate responsibilities.\n\nThis move is expected to strengthen the clubs leadership and decision-making processes.\n\nThe proposed amendments will be presented for ratification at the AGM on January 26, marking a significant milestone in Highlanders efforts to modernise and strengthen its foundation.\n\nMeanwhile, elections for the office bearers are scheduled to take place on February 2, 2025 at the Highlanders Sports Club, with aspiring candidates required to obtain nomination forms from the club office by January 18, 2025.\n\nOnly two positions  vice-chairman and treasurer  are up for election.\n\nA refundable fee of US$200 is payable, which will be refunded if the candidate secures more than 10 percent of the total votes cast. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-16-copy.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw  HIGHLANDERS is gearing up for significant changes, with proposed constitutional amendments set to be ratified at the Annual General Meeting (AGM) on January 26. The amendments aim to modernise the club’s constitution, aligning it with contemporary standards and best practices in club management. During an Extraordinary General Meeting (EGM) at the team’s clubhouse […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "WATCH: Uthando Luyingozi author Nkosana Hlabano Moyo laid to rest",
            "url": "https://www.chronicle.co.zw/watch-uthando-luyingozi-author-nkosana-hlabano-moyo-laid-to-rest/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nProminent author Nkosana Hlabano Moyo was buried in Gwatemba, Matabeleland South, on Friday, marking the end of an illustrious 35-year career.\n\nMoyo passed away last Monday after succumbing to cancer at the age of 85.\n\nHe is survived by his wife, Sithembile Moyo, six children, and 13 grandchildren, all of whom spoke highly of his legacy.\n\nThe late author, scriptwriter, linguist, editor, subsistence farmer, teacher, administrator, and Seventh-Day Adventist (SDA) Church elder was celebrated as a pioneer and visionary who consistently put others first.\n\nMoyo was widely recognised for his literary talents, having authored notable works such as Uthando Luyingozi, Ubukhosi Ngamazolo, Ngakutshela, Unpardonable Abomination, Enslaved in Freedom, and Emgwaqweni Wemathimbeni. His works became set books in the school curriculum, while his Focus Study Aids Ndebele O-level Study Guide helped students prepare for their Zimsec Ndebele examinations.\n\nHe collaborated with esteemed figures such as the late Pathisa Nyathi and Felix Slandulo Moyo.\n\nAs a thespian and actor, Moyo appeared in dramas, including the famous ZBC Radio 2 drama Sakhelene Zinini, in which he played the role of Chikwangwara, a Malawian native, during the 1980s.\n\nBorn in Msipane (then Shabani), Moyo displayed a passion for education from an early age. Over the years, he earned a carpentry qualification at Nyazura Mission, a Certificate in Education, a Diploma in Education, a Bachelor of Arts in Education, and a Graduate Certificate in Education. These qualifications paved the way for his career as an educator at various schools, including Balule Primary School, Sogwala Primary School, Mkoba Primary School, and Vungu Primary School, where he served as headmaster. He later held a headmaster role at Pelandaba Primary School.\n\nMoyo also worked as an editor at the Literature Bureau and taught IsiNdebele at Milton High School and Luveve High School.\n\nDuring his eulogy, Welcome Ndabambi highlighted Moyos exemplary life. We have lost a library. Moyo was a very astute man who prioritised the needs of others. He led an exemplary life and aspired to see those around him prosper.\n\nIn Kensington, he donated land to the SDA Church and was the pioneer of the churchs branch in the area. Such acts of kindness and philanthropy distinguished him from others, said Ndabambi.\n\nMoyos children, Mqhelewenkosi and Makhosiwonke, also paid heartfelt tributes.\n\nI was blessed to have him as my father. Beyond being a parent, he was a life mentor, teacher, guide, and counsellor  a wellspring of wisdom. Growing up, he was a disciplinarian who ensured we stayed on the straight and narrow, yet he also taught us the importance of individual willpower. He had a great sense of humour, which many of us inherited, said Makhosiwonke.\n\nFor Mqhelewenkosi, Moyo was more than just a parent.\n\nHe was my guide, protector, and greatest inspiration. A steadfast man, unwavering in his principles. A loving father, whose warmth and care made me feel safe and cherished. Above all, he was a godly man, living with faith, integrity, and humility, setting an example for all who knew him, said Mqhelewenkosi.\n\nSDA Church pastors Taddius Nkanyezi, Sindiso Mpofu, Dumisani Nxumalo, Bongani Ndlovu, Micah Choga, and Qedumusa Mathonsi also paid their respects to Moyo.- Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-2-copy-2.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Prominent author Nkosana Hlabano Moyo was buried in Gwatemba, Matabeleland South, on Friday, marking the end of an illustrious 35-year career. Moyo passed away last Monday after succumbing to cancer at the age of 85. He is survived by his wife, Sithembile Moyo, six children, and 13 grandchildren, all of whom spoke highly […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        },
        {
            "title": "Heritage-Based 5.0 Curriculum: A pathway to Zimbabwe’s economic growth and Vision 2030 goals",
            "url": "https://www.chronicle.co.zw/heritage-based-5-0-curriculum-a-pathway-to-zimbabwes-economic-growth-and-vision-2030-goals/",
            "content": "Kennedy Mandaza,[emailprotected]\n\nTHE beginning of the new school year in Zimbabwe will not just be about returning to the classroom but about embracing new opportunities, challenges, and changes. One of the changes is the rollout of the Heritage-Based Education 5.0 Curriculum, which aims to revolutionise the education system by emphasising a more localised, contextually relevant approach to learning.\n\nZimbabwe, like many other African countries, is battling with the challenge of transforming its education system to align with the demands of a rapidly changing global economy. The introduction of the Heritage-Based 5.0 Curriculum, which aims to address the nations unique cultural and economic needs while preparing students to thrive in the Fourth Industrial Revolution (4IR), is central to this transformation. This curriculum which blends traditional knowledge with modern science and technology, promises to be a catalyst for economic growth, the realisation of Vision 2030, and the creation of a workforce equipped to navigate and innovate in the digital age.\n\nThe Heritage-Based 5.0 Curriculum is viewed as an innovative educational framework that integrates Zimbabwes rich cultural heritage with cutting-edge technologies and interdisciplinary approaches. It focuses on five key pillars: culture, innovation, education, economy, and sustainability, which collectively aim to equip students with the necessary skills and values to contribute meaningfully to society. Unlike the traditional education systems that often prioritise rote learning, the Heritage-Based 5.0 Curriculum emphasises a holistic, learner-centred approach that merges academic knowledge with practical applications.\n\nAt the heart of the Heritage-Based 5.0 Curriculum is a fusion of STEM (Science, Technology, Engineering, and Mathematics) education with the nations heritage and socio-economic needs. The curriculum provides students with opportunities to engage in critical thinking, problem-solving, and innovation within a context that values Zimbabwes traditions, indigenous knowledge systems, and natural resources. The introduction of this curriculum by the Ministry of Primary and Secondary Education which enables a convergence of modern and indigenous elements, designed to create a well-rounded educational experience that responds to both global and local needs, is commendable and should be supported by all stakeholders.\n\nOne of the fundamental outcomes expected from the Heritage-Based 5.0 Curriculum is its ability to contribute significantly to Zimbabwes economic development. By focusing on practical skills that align with the nations key sectors such as agriculture, mining, manufacturing, and technology, the curriculum is indeed a masterstroke. Furthermore, by focusing on innovation and entrepreneurship, it encourages students to develop solutions for real-world challenges that can contribute to job creation, industrial growth, and sustainable economic development.\n\nZimbabwes economy has long been dependent on sectors such as agriculture and mining, and has faced significant challenges in terms of diversification, modernisation, and technological advancement, particularly due to the effects of illegal sanctions. The introduction of the Heritage-Based 5.0 Curriculum will address these challenges by equipping students with skills that will enable them to innovate within these traditional sectors. By integrating STEM with indigenous agricultural practices, students can develop more efficient farming techniques, improve food security, and create sustainable agricultural value chains.\n\nThis curriculum will also foster a culture of entrepreneurship, encouraging young people to think critically about starting and scaling businesses in diverse sectors, from technology and renewable energy to tourism and cultural industries. President Mnangagwa has been quoted saying, We want our children to dream. Engendering entrepreneurial spirit is essential for Zimbabwe to harness its potential and transition from a lower-middle-income country to an upper-middle-income economy by 2030, as envisioned in the National Development Strategy (NDS1) and Vision 2030.\n\nPresident Mnangagwa\n\nVision 2030 is Zimbabwes strategic framework to become a middle-income, industrialised nation with a high standard of living and sustainable economic growth. What is central to achieving this vision is the development of human capital, which requires an education system that is aligned with the demands of a rapidly evolving global economy. The Heritage-Based 5.0 Curriculum is the panacea in this regard because it equips students with the skills, knowledge, and mindset necessary to drive economic growth, which our country desperately needs.\n\nThis curriculum must be embraced by all because it fosters a robust combination of traditional knowledge, technological literacy, and interdisciplinary learning, thereby preparing students for the opportunities and challenges that lie ahead. As the global economy becomes more interconnected, the demand for skilled workers who can adapt to new technologies and industries grows. The Heritage-Based 5.0 Curriculum will ensure that Zimbabwean students are not only prepared for these opportunities but also uniquely positioned to leverage their cultural heritage to create innovative solutions for local and global markets.\n\nGiven that Zimbabwe has a rich history in the arts, crafts, and natural resources which offers unique opportunities for export markets, by teaching students how to blend these heritage resources with modern marketing and technological skills, the curriculum helps to create new industries and avenues for economic expansion. Another niche is in the tourism sector, which will benefit from students who understand both the cultural significance of Zimbabwes historical landmarks and the technological tools required to market them globally.\n\nZimbabwe is also alive to the Fourth Industrial Revolution, which is characterised by the integration of digital technologies, Artificial Intelligence, and automation into all aspects of life and business. This presents both opportunities and challenges for developing nations like Zimbabwe. While 4IR offers significant potential for economic growth, the Government is cognisant of the fact that it also demands a skilled workforce capable of navigating and contributing to this new technological landscape. Therefore, the Heritage-Based 5.0 Curriculum addresses this challenge by integrating STEM education to provide students with the skills needed to thrive in this digital age.\n\nBy incorporating cutting-edge fields such as robotics, Artificial Intelligence, data science, and block chain technology, in our schools, the curriculum offers opportunities for students to be creators and innovators rather than mere consumers of technology. This technological literacy, supported by the introduction of computers in schools, is vital in ensuring that Zimbabwe can participate in the global 4IR economy. Moreover, the curriculums focus on innovation encourages students to think critically about how technology can be applied to solve local problems and create new industries and economic opportunities.\n\nAlready students in some schools use coding and data analysis to develop agricultural technologies meant to increase efficiency and sustainability, and others are applying engineering principles to enhance Zimbabwes mining sector. By supporting and grounding these technological advancements in Zimbabwes unique context and cultural values, the Heritage-Based 5.0 Curriculum will ensure that technological progress does not come at the expense of the nations heritage and identity.\n\nThe introduction of the Heritage-Based 5.0 Curriculum should be commended for its multidisciplinary approach to education. The curriculum blends STEM with the arts, humanities, and indigenous knowledge, and encourages students to think beyond traditional academic boundaries and develop a wide range of competencies. This holistic approach will prepare students not only to excel in technical fields but also to understand the social, cultural, and ethical implications of their work.\n\nThis year will see the fostering of collaborative projects, in which students are encouraged to explore solutions that are both innovative and socially responsible. Schools should emphasise on sustainability by equipping students to contribute to economic growth and safeguard the environment and the well-being of future generations.\n\nThis multidisciplinary approach is the bedrock of the development of critical thinking, creativity, and problem-solving skills, attributes that are essential for success in the Fourth Industrial Revolution. In doing so students should be encouraged to approach challenges from multiple perspectives and work collaboratively to find solutions, fostering an environment of innovation and adaptability.\n\nThe introduction of the Heritage-Based 5.0 curriculum represents a bold and innovative step by the government towards transforming Zimbabwes education system to meet the challenges and opportunities of the 21st century. By integrating STEM education with Zimbabwes rich cultural heritage, the curriculum offers a holistic and multidisciplinary approach to learning that will equip students with the skills needed to contribute to the nations economic growth, Vision 2030 goals, and participation in the Fourth Industrial Revolution.\n\nAs Zimbabwe seeks to diversify its economy, create jobs, and enhance industrialisation, all stakeholders, parents, teachers, and students, should welcome the Heritage-Based 5.0 Curriculum and embrace it in shaping a workforce that is both technologically adept and deeply connected to the nations traditions. As we move towards the realisation of Vision 2030, the fusion of modern knowledge and heritage is poised to create new pathways for economic development and ensure that Zimbabwes future is one of innovation, sustainability, and prosperity.\n\nKennedy Mapesa Mandaza is an academic with vast experience in the education sector in Zimbabwe, South Africa and the United Kingdom. He holds an MSc. in Measurement, Assessment and Evaluation, BSc. Honours in Science Education and BSc. in Mathematics and Statistics. He can be contacted on +263777608618/ +447939434165 or via email[emailprotected]. He writes in his personal capacity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-13-copy.jpg",
            "description": "Kennedy Mandaza, kennedy@mapesafoundation.org THE beginning of the new school year in Zimbabwe will not just be about returning to the classroom but about embracing new opportunities, challenges, and changes. One of the changes is the rollout of the Heritage-Based Education 5.0 Curriculum, which aims to revolutionise the education system by emphasising a more localised, contextually relevant […]",
            "time": "08:28",
            "date": "13 Jan 2025"
        }
    ]
}