{
    "news": [
        {
            "title": "African Union commends peace initiatives for DRC",
            "url": "https://www.chronicle.co.zw/african-union-commends-peace-initiatives-for-drc/",
            "content": "Farirai Machivenyika, Harare Bureau\n\nTHE Chairperson of the African Union (AU) Commission, Dr Moussa Faki Mahamat, has welcomed the decisions by the Southern Africa Development Community and the East African Community to hold a joint Summit to find a lasting solution to the conflict in the eastern Democratic Republic of Congo (DRC) that has resulted in the deaths and displacement of millions of people.\n\nWriting on his X handle, Dr Mahamat said the positions taken by the two regional groupings were in sync with that of the AU.I welcome the conclusions of the East African Community and SADC leaders following their respective Summits regarding the security situation in Eastern Democratic Republic of Congo and their decision to hold a joint intra regional Summit to map the next practical steps.\n\nTheir recommendations echo the long-standing African Union call for a political solution through dialogue within the framework of the AU-led Luanda and Nairobi processes, he said.\n\nPresident Mnangagwa, who is also the SADC Chairperson, last Friday convened an Extraordinary Summit of the regional body in Harare to address the deteriorating security situation in eastern DRC.\n\nAnnouncing the agreed course of action in a communiqu, SADC executive secretary, Mr Elias Magosi, said the regional bloc was dedicated to peace efforts.\n\nSummit called for an immediate joint Summit of SADC and EAC to deliberate on the way forward regarding the security situation in the DRC as proposed by the 24th Extraordinary Summit of Heads of State of the EAC held on 29th January 2025, he said.\n\nAs part of its resolutions, the summit mandated the SADC Organ Troika on Politics, Defence and Security Co-operation to intensify diplomatic engagements with all State and non-State actors involved in the conflict.\n\nMr Magosi said ceasefire efforts were of paramount importance.Summit mandated the SADC Organ Troika on Politics, Defence and Security Co-operation to engage all State and non-State parties to the conflict on a ceasefire process to protect lives and facilitate a smooth flow of humanitarian support to people and communities affected by the armed conflict, he said.\n\nSADC chairman President Mnangagwa shares a lighter moment with President Cyril Ramaphosa of South Africa at the blocs Extraordinary Summit on DRC in Harare on Friday\n\nMr Magosi said the summit called for a co-ordinated approach and urged all political and diplomatic leaders involved in the conflict to engage meaningfully in dialogue.\n\nHe reaffirmed SADCs support for existing peace initiatives.Summit urged political and diplomatic leaders, who are parties to the conflict, to engage in a co-ordinated effort of dialogue, including supporting the Luanda Process, MONUSCO (UN Mission in the Congo) and others, to restore peace and security in Eastern DRC.\n\nSADC leaders also reaffirmed their commitment to the DRCs sovereignty, territorial integrity, and long-term stability, pledging ongoing support for its development and security.\n\nIn its communiqu after its Extraordinary Summit on Wednesday last week, the EAC also proposed a joint Summit.Noting that SADC has also been involved in eastern DRC. The Summit decided on a joint EAC-SADC Summit to deliberate on the way forward and mandated the Chairperson (Kenya President William Ruto) to consult with the Chairperson of SADC (President Mnangagwa) on the urgent convening of the same in the next few days, reads part of the EAC communiqu.\n\nPresident Mnangagwa\n\nIn his opening remarks during the Extraordinary Summit, President Mnangagwa noted with regret that since an Extraordinary Summit that was held in Harare in November last year, very little progress has been made in our search for lasting peace in the eastern DRC, which is now characterised by escalating hostilities and conflict.\n\nThis culminated in the unfortunate and atrocious attacks carried out on our Mission in Goma, that claimed the lives of several SAMIDRC and MONUSCO peacekeepers, while others sustained serious injuries.\n\nThe people of the eastern DRC have suffered for far too long. SADC condemns in the strongest terms the attacks by aggressor forces. While we pause to mourn our loss, our resolve to ensure collective security cannot be shaken, he said.President Mnangagwa said it was important that dialogue and peace building are boldly pursued to achieve the intended result of peace for the benefit of the people of the Eastern DRC.\n\nTo this end, our region stands ready to intensify efforts to protect SADC citizens from all forms of instability, in line with the SADC Mutual Defence Pact. The peace and security of our region is a shared obligation.\n\nOur political-will must be strengthened towards a concrete and actionable roadmap that will help accelerate the realisation of peace in the Eastern DRC, he said.\n\nMay we, as Member States, continue to do all we can to support our gallant men and women in the theatre of operations, and ensure that SAMIDRC achieves its important objective.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-61-680x380.jpg",
            "description": "Farirai Machivenyika, Harare Bureau THE Chairperson of the African Union (AU) Commission, Dr Moussa Faki Mahamat, has welcomed the decisions by the Southern Africa Development Community and the East African Community to hold a joint Summit to find a lasting solution to the conflict in the eastern Democratic Republic of Congo (DRC) that has resulted […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Residents stone armed robbers… Shop manager shot, mob steps in to help",
            "url": "https://www.chronicle.co.zw/residents-stone-armed-robbers-shop-manager-shot-mob-steps-in-to-help/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nBULAWAYOS New Lobengula residents showed extraordinary courage on Saturday evening when gunfire broke out during an attempted robbery at Sai Mart.\n\nAs bullets flew around 8PM, leaving one shop employee injured with a gunshot wound to the thigh, the community sprang into action. With remarkable bravery, they confronted the armed robbers, pelting them with stones and driving them to flee empty-handed into the night. Their swift and fearless response not only foiled the robbery but also sent a powerful message that such criminal acts will not be tolerated in their neighbourhood.\n\nOne resident, Mr Emmanuel Mutoko, described how he scaled a nearby precast wall and hid in a neighbours yard as bullets whizzed in different directions. The robbers fired indiscriminately at the growing crowd of residents determined to stop the robbery.\n\nThe shop closes at 8pm, and as staff were leaving, there was commotion as some men forced their way inside. One of them, who seemed to be watching the place from outside, started shooting randomly.\n\nResidents gathered around the shop and began throwing stones, and he fired a few more shots. I jumped over a perimeter wall and hid next door because I was scared of being hit by a stray bullet, Mr Mutoko said.\n\nArmed robbers\n\nHe said that the robbers took advantage of a malfunctioning tower light to escape into the darkness after realising the residents were determined to stop them.\n\nIt all happened within a few minutes, and then the robbers were gone. No one chased them. Thats when we heard that the manager had been shot inside the shop, he said.\n\nBulawayo provincial police acting spokesperson, Assistant Inspector Nomalanga Msebele, confirmed the incident.Police in Bulawayo are investigating a case of attempted robbery and attempted murder that occurred on February 1, 2025 in New Lobengula, Bulawayo. At approximately 8:10pm, a brazen attempted robbery and attempted murder occurred at Choppies (now Sai Mart), where a 59-year-old male complainant, a resident of Cowdray Park, sustained serious injuries, she said.\n\nShe said that the attempted armed robbery and shooting happened as staff members were closing up for the night.The complainant (the shop manager) was reconciling invoices in his office while the rest of the staff were clocking out. As the complainant was about to open the door for the staff to leave, three suspects emerged from their hiding place near the shop.\n\nThe first suspect fired a single shot, causing some workers to scatter and others to seek refuge at the back of the shop. The second suspect fired two shots from the exit door, attempting to intimidate the crowd of onlookers, Assistant Inspector Msebele said.\n\nOne of the suspects then forced the manager into the strong room and demanded he open the safe. When the manager said he didnt have the keys, he was shot in both thighs.\n\nAs more people joined the crowd outside the shop and began pelting the suspects with stones, the armed robbers panicked and abandoned their attempt to rob the store. They left the scene empty-handed, said Assistant Inspector Msebele.She urged anyone with information that could lead to the arrest of the suspects to contact their nearest police station.\n\nWe would like to urge business owners to hire security guards from reputable security companies to protect their employees and property from such criminal activity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/armed-robbery-at-Choppies.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com BULAWAYO’S New Lobengula residents showed extraordinary courage on Saturday evening when gunfire broke out during an attempted robbery at Sai Mart. As bullets flew around 8PM, leaving one shop employee injured with a gunshot wound to the thigh, the community sprang into action. With remarkable bravery, they confronted the armed robbers, pelting […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Foundry industry set for growth amid industrial revival",
            "url": "https://www.chronicle.co.zw/foundry-industry-set-for-growth-amid-industrial-revival/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWES foundry industry is poised to grow 2-3 percent this year.\n\nThe sector is crucial for the countrys industrialisation and economic turnaround, with iron and steel being one of the 10 priority value chains under the National Development Strategy 1 (NDS1).\n\nAccording to Mr Dosman Mangisi, chief operations officer of the Zimbabwe Institute of Foundries (ZIF), retooling is essential for the sectors growth and increased capacity utilisation.\n\nIn 2025, the foundry sector is looking to grow with a significant figure of about two to three percent, taking into account the Dinson Iron and Steel production, which brings the availability of raw material although there are some areas that need to be addressed, especially retooling, which is key and important to uphold the issue of innovation, said Mr Mangisi.\n\nWe have Zimbabweans who are doing wonders in the automotive industry and many of these are done outside the country. As a sector, we are looking forward to attracting these innovations into the country so that we see the re-industrialisation of the metal sector.\n\nMr Dosman Mangisi\n\nGovernment should come up with user-friendly policies that will also help financiers and other stakeholders to participate freely without fearing losses.\n\nThe US$1,5 billion Dinson Iron and Steel Company (Disco) plant in Manhize has commenced production, marking a significant milestone in Zimbabwes industrial revival drive.\n\nPig iron production started last year following the successful completion of test runs.\n\nThe milestone development has ignited a spark of hope for Zimbabwes industrial revival drive, confirmation of the Second Republics commitment to transforming the economy in line with the ambitious roadmap towards a prosperous upper middle-income status before 2030.\n\nPig iron, the initial product of the blast furnace, serves as the foundation for further steel production. The company commenced steel billet production in July, a vital raw material for various industrial applications.\n\nExperts believe that Disco will bring ease of doing business in the metal casting industry, making Zimbabwe a leading giant in foundry production.\n\nHowever, challenges persist, including the need for retooling and investment in modern technology. Mr Mangisi emphasised that what we want is enhanced quality in terms of material . . . but production will be enhanced when retooling takes place.\n\nMeanwhile, the Zimbabwe National Chamber of Commerce (ZNCC) has welcomed improvements in power supplies, which is expected to boost industry productivity.\n\nMr Louis Herbst, ZNCC southern region vice-president, noted that the recent improvements in electricity supply are nothing short of transformative.\n\nHe said in recent months, businesses had grappled with frequent outages and erratic power fluctuations, severely impeding production schedules and complicating the management of daily operations.\n\nThis unpredictability compelled companies to invest heavily in costly backup systems, such as generators, and solar, and often forced them to operate at reduced capacity, an approach that not only eroded profitability but also stifled growth, he said.\n\nThe relentless need to adapt to power shortages diverted vital resources away from innovation and expansion, reducing many firms to a state of reactive survival rather than proactive advancement.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/xgfhsy.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com ZIMBABWE’S foundry industry is poised to grow 2-3 percent this year. The sector is crucial for the country’s industrialisation and economic turnaround, with iron and steel being one of the 10 priority value chains under the National Development Strategy 1 (NDS1). According to Mr Dosman Mangisi, chief operations officer of the Zimbabwe […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Man charged with rape, indecent assault of nieces",
            "url": "https://www.chronicle.co.zw/man-charged-with-rape-indecent-assault-of-nieces/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 44-year-old Bulawayo man has appeared in court, charged with rape and indecent assault, after allegedly attacking his 14-year-old niece and indecently assaulting her 12-year-old sister.\n\nThe man, from Pumula North suburb, whose name is being withheld to protect the victims, appeared before Western Commonage magistrate, Ms Skhethile Moyo, on Saturday. He was remanded in custody until February 4.\n\nAccording to the prosecutions case, presented by Ms Catherine Kuzu, the first incident occurred in November 2024 at around 1pm. The accused, taking advantage of the absence of the complainants grandmother, allegedly dragged the 14-year-old girl into his bedroom.\n\nHe pushed her onto the bed and told her to lie face up, Ms Kuzu told the court.He then pulled a knife from his pocket and threatened to stab and kill her if she made a noise or resisted his advances. He then lifted her dress, forcibly removed her underwear, and raped her.\n\nMs Kuzu stated that the accused forcibly had unprotected sex with the complainant once and then threatened to stab her if she told anyone.\n\nOn another occasion, the court heard, the accused again took advantage of the grandmothers absence and followed the 12-year-old girl into her bedroom. He then allegedly touched her buttocks several times without her consent.The complainant screamed, but the accused threatened her with unspecified consequences if she told anyone what had happened, Ms Kuzu explained.\n\nSince then, the accused has regularly touched the complainants buttocks whenever he wanted, as her grandmother was away at her rural home in Zvishavane.\n\nThe court was told that in January 2025, the victims aunt, who was in South Africa, returned and spoke to the girls about their daily lives, particularly their interactions with the accused. The complainants then disclosed the assaults, leading to the mans arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/07/rape.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A 44-year-old Bulawayo man has appeared in court, charged with rape and indecent assault, after allegedly attacking his 14-year-old niece and indecently assaulting her 12-year-old sister. The man, from Pumula North suburb, whose name is being withheld to protect the victims, appeared before Western Commonage magistrate, Ms Skhethile Moyo, on Saturday. He […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "WATCH: Nkani Khoza bags Bosso treasurer post",
            "url": "https://www.chronicle.co.zw/watch-nkani-khoza-bags-bosso-treasurer-post/",
            "content": "Innocent Kurira,[emailprotected]\n\nNKANI Khoza has been elected as the new treasurer at Highlanders after securing 83 votes in an election held at the teams clubhouse yesterday morning.\n\nA total of 154 members participated in the election, with Khoza triumphing over Israel Moyo, who received 71 votes.\n\nDespite the importance of the election, voter turnout was relatively low, with no noticeable queue forming as the voting process began at 9am and closed at 11am.\n\nHowever, several people failed to cast their vote after they arrived after voting had been closed.\n\nThe position of vice-chairman, initially set to be contested, was uncontested, with Fiso Siziba the only candidate.\n\nIn his victory speech, Khoza outlined his commitment to adhering to the clubs laws and statutes, maintaining professionalism and ethical standards.\n\nHe promised to tackle the financial concerns raised by the clubs external auditors, assuring members that all necessary financial documents would be produced within three months.\n\nKhoza also vowed to establish a functional internal audit committee to enhance transparency and accountability.\n\nI promise to bring confidence and the desired results, which are craved by all the Highlanders fans. I will listen to the Highlanders family and the hierarchy of the club. As a treasurer, I understand what is expected of me, and I assure you that the issues raised by our external auditors will be swiftly addressed, said Khoza.\n\nThe clubs financial situation remains a major concern.\n\nThe audited financial statements presented at the annual general meeting (AGM) last week revealed significant discrepancies and concerns about the clubs financial health.\n\nThe statements, prepared by independent auditors Baker Tilly, highlighted issues regarding the completeness and valuation of the clubs property, plant, and equipment, which is valued at US$349 400.\n\nThere were also concerns over the US$198 495 in trade and other payables reported by management, with no reconciliation of the amounts owed to various individuals.\n\nThe auditors also expressed uncertainty about the accuracy of donations received by the club. Highlanders reported US$25 653 in donations, but supporting documentation was missing.\n\nSimilarly, US$71 084 of the clubs US$150 168 income was unsupported by proper schedules, and discrepancies were found in prize money figures, with a variance of US$21 611 in the reported US$43 621 prize fund.\n\nOperational and administrative expenditure for the year totalled US$883 781, but there were also discrepancies here, with US$10,956 in unaccounted expenditure.\n\nThe AGM was also informed that there were no financial records from the clubhouse operations, preventing the auditors from performing audit procedures on the facility.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-55.jpg",
            "description": "Innocent Kurira, Innocent.kurira@chronicle.co.zw NKANI Khoza has been elected as the new treasurer at Highlanders after securing 83 votes in an election held at the team’s clubhouse yesterday morning. A total of 154 members participated in the election, with Khoza triumphing over Israel Moyo, who received 71 votes. Despite the importance of the election, voter turnout […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "WATCH: Chiefs start outreach for Gukurahundi hearings",
            "url": "https://www.chronicle.co.zw/watch-chiefs-start-outreach-for-gukurahundi-hearings/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTRADITIONAL chiefs have been urged to prepare their communities for the start of the Gukurahundi public hearings, which are due to begin before the end of March. Further details of the programme are expected to be released within the next two weeks.\n\nOver the weekend, the Gukurahundi steering committee met in Bulawayo to finalise preparations for the hearings.Chief Mtshane Khumalo, the president of the National Council of Chiefs, chaired the meeting at which traditional leaders agreed to begin community outreach and awareness campaigns.\n\nPresident Mnangagwa has tasked traditional leaders with leading the process of addressing the post-independence conflict that affected the Matabeleland region and parts of the Midlands, as part of national healing efforts.\n\nThe President launched the Gukurahundi public hearings programme last July, empowering traditional leaders to conduct the hearings. However, the provision of adequate resources had previously stalled progress. The government has now committed further resources to ensure the process can begin.\n\nFollowing yesterdays meeting, Chief Mtshane Khumalo, in an interview, expressed satisfaction that preparations are progressing well and stressed the importance of chiefs educating their communities about the upcoming hearings.\n\nThe public hearings will be held in rural areas, meaning those wishing to contribute will need to travel to their rural homes to make submissions.\n\nThe message to the public is that all chiefs have been urged to make their people aware of this programme. Some have already done so, and those who havent should explain that the programme is imminent.\n\nWe believe this is important; the Gukurahundi issue has been with the people in the Matabeleland region for a long time. We dont know if we will fully close this chapter, but people should have the opportunity to share their experiences, he said.\n\nChief Mtshane Khumalo\n\nHe acknowledged the challenging task ahead but expressed confidence that the training received by traditional leaders over the past five years has equipped them to manage the process effectively.\n\nChief Mtshane Khumalo stressed that a victim-centred approach will be crucial for the success of the meetings.I believe its a mammoth task. Initially, when we were assigned, we thought we would complete it quickly. But, having gone through the processes, I can tell you it is a mammoth task. Going to the people will not be easy, but we have been trained on how to approach this process, how to conduct the meetings. We needed training on how to approach the victims. This is not like the normal cases we preside over in our courts.\n\nWhen we approach a Gukurahundi victim, you have to be very cautious. In most cases, these people are very emotional, and if you are not careful in your approach, you might cause more harm than good. So, we have to be careful how we approach them, and that requires training, he said.\n\nWhile some have suggested the Gukurahundi public hearings will be ineffective, Chief Mtshane Khumalo urged the public not to make assumptions and to allow the process to proceed smoothly.\n\nI dont think that assumption is correct, he said. Lets just wait and see what the victims will say because we are not all victims, and chiefs are merely facilitators in this programme. So, let us go and hear what the victims will say and await the Governments response and actions. I think its too early to pre-empt anything.\n\nHe confirmed that further details on the preparations for the programmes start will be provided in two weeks. Chief Mtshane Khumalo hopes to hold a final stakeholder meeting with all chiefs, rapporteurs, and panel members within the next two weeks, depending on resource availability.\n\nI dont foresee any other major meetings. We are most likely to have the last meeting with all chiefs, all rapporteurs, and panel members, depending on the availability of resources. We need to remind these people what they are expected to do.\n\nWe need some moot sessions so the chiefs can demonstrate what they have learned, if they still remember, how they will chair the meetings, and all that. They were trained over the past five years and have been in recess for a very long time. We will ask them to do some recapping; they have booklets on how the proceedings will be conducted, he said.\n\nHe said that the Public Works Department is expected to have completed renovations to the Command Centre in Bulawayo, which will be used to store witness testimonies.\n\nWhile hearings will be held in rural areas, all data will be transported to Bulawayo for storage at the Command Centre.Chief Mtshane Khumalo confirmed that the Government has assured traditional leaders that vehicles will be available when the hearings begin.\n\nWe have been told that there is enough transport that the Government has hired. The chiefs can also hire their own vehicles through the Central Mechanical and Equipment Department (CMED). All vehicles used will need CMED approval to ensure they are roadworthy. Chiefs will be using their own vehicles in addition to those hired for the programme, he said.The Government has already procured recorders and laptops for use during the programme. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Gukurahundi-meeting-2.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw TRADITIONAL chiefs have been urged to prepare their communities for the start of the Gukurahundi public hearings, which are due to begin before the end of March. Further details of the programme are expected to be released within the next two weeks. Over the weekend, the Gukurahundi steering committee met in Bulawayo […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Zacc calls scientists, researchers to action",
            "url": "https://www.chronicle.co.zw/zacc-calls-scientists-researchers-to-action/",
            "content": "Trust Freddy, Harare Bureau\n\nThe Zimbabwe Anti-Corruption Commission (Zacc) has urged the Scientific and Industrial Research and Development Centre (SIRDC) to develop and implement cutting-edge forensic tools to fight crime as technology is leveraged to prevent, detect and successfully prosecute corruption.\n\nZacc chairperson Mr Michael Reza made the call while presiding over the signing of corporate and individual integrity pledges by SIRDC board members and management.\n\nOne of the most critical measures in tackling corruption is strengthening public institutions like the Zimbabwe Anti-Corruption Commission\n\nThis collaborative effort, Mr Reza said, sought to bolster the fight against corruption by leveraging innovation and technology to prevent, detect, and prosecute corrupt activities.\n\nYour expertise in data analytics, process optimisation, and technological innovation can revolutionise how we detect, prevent, and combat corruption. We envision collaboration in developing advanced forensic tools, creating corruption risk assessment models, and establishing technology-driven transparency mechanisms.\n\nThe importance of integrity in scientific research cannot be overstated. False data, manipulated results, or compromised methodologies not only undermine scientific progress but can lead to catastrophic policy decisions.\n\nThe commission is available to work with you in establishing specific integrity action plans and conducting regular integrity action plan implementation audits.\n\nThe two institutions could create a model that other institutions can aspire to emulate.The Zimbabwe Anti-Corruption Commission also proposes collaboration in several key areas such as joint training programmes on development of anti-corruption compliance frameworks tailor-made for research institutions, and the establishment of a centre of excellence for integrity in scientific research.\n\nSIRDC chairman Mr Misheck Kachere said: I am delighted to be here to reaffirm our commitment in upholding the highest standards of integrity through the signing of this corporate pledge. Today marks an important milestone in SIRDCs journey towards fostering a culture of transparency, accountability and ethical standards.\n\nIn signing this integrity pledge, we are making a solemn promise to ourselves and our stakeholders that we will uphold the principles of honesty, fairness, and responsibility in all our activities. This pledge serves as a reminder that we are accountable for our actions. We must always act with integrity.\n\nTo date, over 140 institutions, including Government departments, parastatals and private entities, have established integrity committees to combat corruption in the country.\n\nAt least 12 000 individuals from these institutions have signed personal integrity pledges, committing to uphold ethical standards.\n\nAn integrity pledge is a key component of the National Anti-Corruption Strategy, designed to foster transparency, honesty and adherence to ethical principles across all sectors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/07/Untitled-21-1.jpg",
            "description": "Trust Freddy, Harare Bureau The Zimbabwe Anti-Corruption Commission (Zacc) has urged the Scientific and Industrial Research and Development Centre (SIRDC) to develop and implement cutting-edge forensic tools to fight crime as technology is leveraged to prevent, detect and successfully prosecute corruption. Zacc chairperson Mr Michael Reza made the call while presiding over the signing of […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "How to unlock US$400 billion annually for the global economy by closing women’s health gap",
            "url": "https://www.chronicle.co.zw/how-to-unlock-us400-billion-annually-for-the-global-economy-by-closing-womens-health-gap/",
            "content": "Lucy Perez, Correspondent\n\nHistorically, womens health has been chronically under-prioritised and under-invested. Glaring gaps in data availability, care delivery and efficacy of treatment have left millions suffering and many opportunities unrealised.\n\nA new report and the accompanying metrics dashboard from the Womens Health Impact Tracking Platform  a collaboration between the Global Alliance for Womens Health at the World Economic Forum and the McKinsey Health Institute (MHI)  shows that nine health conditions account for 35 percent of womens disease burden.\n\nAddressing these nine womens health conditions could yield profound benefits  not just for women but for the global economy, according to the research. In addition to reducing womens global disease burden by 27 million disability adjusted life years (DALYs) annually and adding the equivalent of 2,5 healthy days per woman each year worldwide, this approach could also boost the global economy by US$400 billion by 2040. The economic benefits would come from having a larger, healthier and more productive female labour force.\n\nThese conditions can be grouped according to their impact on lifespan, which is when treatment can extend life expectancy, and health span, which is when treatment improves the quality and vitality of day-to-day life. Addressing these nine conditions provides a blueprint for other conditions, accelerating the journey to close the womens health gap and build stronger economies.\n\nWomens health conditions that affect lifespanIschaemic heart disease (IHD) is the leading cause of death among women, claiming over four million lives annually. In fact, women are more likely than men to die from acute cardiovascular events, and there are stark disparities in treatment and outcomes between men and women. The research shows that closing this gap could prevent 1,6 million years of life lost in the United States alone and add US$43 billion annually to the global economy.\n\nCervical cancer disproportionately affects women in low and middle-income countries (LICs and LMICs), where 85 percent of deaths from this disease occur. Addressing this gap could generate US$10 billion annually in global Gross Domestic Product by reducing mortality and long-term health complications.\n\nWorld Economic Forum\n\nSimilarly, enhancing early detection, treatment access and equity in care for breast cancer within and between nations could prevent over a million DALYs annually and contribute US$8,7 billion to global GDP.\n\nMaternal hypertensive disorders are high blood pressure-related complications, which are a leading cause of maternal deaths. Reducing these risks could prevent 70 000 maternal deaths annually and yield US$1,4 billion in economic gains.Post-partum haemorrhage (PPH) is also a leading cause of maternal mortality that disproportionately affects women in LICs and LMICs. Addressing systemic barriers, including access to skilled healthcare, could prevent 70 000 deaths annually and contribute US$200 million to the global economy.\n\nWomens health conditions that affect health spanMenopause symptoms affect 450 million women globally, with long-term health implications including increased risk of cardiovascular disease, osteoporosis and neurological conditions. Improved diagnosis and treatment of symptoms could add an estimated US$120 billion annually to global GDP.\n\nPremenstrual syndrome (PMS) affects 20 to 40 percent of women of reproductive age, which can lead to productivity losses and educational disruptions. Addressing its effects could unlock an estimated US$115 billion annually in economic gains.\n\nMigraines affect 21 percent of women globally. They often have a hormonal component and can lead to significant disability. Reducing the burden of migraines could add an estimated US$80 billion annually to the global economy.\n\nFinally, endometriosis affects an estimated 190 million women, often causing chronic pain, infertility and depression. Effective treatments and earlier diagnosis could prevent 250 000 DALYs annually and contribute an estimated US$12 billion to global GDP. This number is likely to be significantly more because the research report uncovered a data gap due to the undercounting of endometriosis cases.\n\nAddressing these conditions will require transformative change across healthcare systems, research, investment and societal structures. This research offers a blueprint that could scale and be tailored to suit other countries and additional conditions impacting women and their health.\n\nThe ultimate goal would be to provide a comprehensive view of womens health worldwide and inspire governments, businesses, academic institutions and investors to act. Heres what these stakeholders can do:\n\n1. Count women: Improve data collectionAccurate data is critical to understanding the true burden of these conditions, but significant gaps exist, particularly in LICs and LMICs. For example, data discrepancies exist for the reporting of the number of women with endometriosis. Sources range between 24 million and 190 million women with endometriosis, and this number is likely higher when accounting for under-diagnosis.\n\nThese discrepancies are even greater in LICs and LMICs, where a lack of modern data infrastructures can lead to missed opportunities for data capture.\n\n2. Study women: Prioritise research on womens healthWomen are not just smaller men. Studying how medications affect men and women differently is crucial for effective treatment.\n\nYet, only around 10 percent of clinical trials for key womens health conditions such as IHD and migraine report sex-specific data, according to our research. This leaves critical gaps in understanding womens unique health needs.\n\nFurther, while 54 percent of the womens health burden is in LMICs, only 23 percent of clinical trials for these nine conditions focus on these regions, our research shows. Sex-disaggregated analysis and basic science research into hormone health and female biology could help reveal how conditions affect women disproportionately or differently, and inform improved solutions.\n\n3. Care for women: Deliver sex and gender-based healthcareHealthcare systems must be redesigned to meet womens unique needs. This includes updating clinical practice guidelines (CPGs) to offer standardised recommendations for healthcare professionals to acknowledge sex-based differences. CPGs could be enhanced to reflect women-specific evidence, particularly for conditions that affect womens health span.\n\nThis means creating CPGs for women-specific conditions such as endometriosis and menopause and accounting for sex-specific differences in the CPGs for conditions that affect both men and women, such as IHD.\n\n4. Invest in women: Fund womens healthcare researchWomens health priorities are severely under-funded in relation to their health burden. For example, PMS, menopause, maternal health conditions, cervical cancer and endometriosis make up 14 percent of womens health burden but received less than one percent of cumulative research funding between 2019 and 2023 for the 64 conditions driving the womens health gap, according to research.\n\nClosing the womens health gap will require governments, businesses, academic institutions and investors to facilitate sustained investment in public health education.\n\nThis should be channelled into raising awareness and reducing stigma, developing innovative diagnostics and treatments, and creating public-private partnerships to expand access to care and improve health outcomes. Employers also have a key role to play in ensuring workplace culture values flexibility and caretaking so women can join and advance in the global workforce.\n\n5. Include women: Tackle disparities in careHealth disparities based on race, ethnicity, geography and socioeconomic status exacerbate the womens health gap. Stakeholders should promote health equity through inclusive policies and programmes and by ensuring countries are on track to meet their targets on access to vaccines, screenings and treatments.\n\nDigital health can also help. For example, platforms could connect pregnant women to community drivers and local ambulances for emergency transport during labour.\n\nInvesting in womens health is not just a moral imperative  it is an economic one as well. Improved health outcomes for women lead to better health for them, their families and their communities, while also unlocking unprecedented economic potential and building stronger economies.  World Economic Forum\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/07/Untitled-24-10.jpg",
            "description": "Lucy Perez, Correspondent Historically, women’s health has been chronically under-prioritised and under-invested. Glaring gaps in data availability, care delivery and efficacy of treatment have left millions suffering and many opportunities unrealised. A new report and the accompanying metrics dashboard from the Women’s Health Impact Tracking Platform — a collaboration between the Global Alliance for Women’s […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Zimbabwe should align legislation to stop child labour and trafficking",
            "url": "https://www.chronicle.co.zw/zimbabwe-should-align-legislation-to-stop-child-labour-and-trafficking/",
            "content": "Joel Tsvakwi\n\nChild rights specialists and anti-human trafficking experts say Zimbabwe should align the 2014 Trafficking in Persons Act to curb the growing trend of child labour trafficking in the Southern African Region.\n\nAccording to the United Nations Office on Drugs and Crime (UNODC), human trafficking in general and child labour trafficking, in particular, are a lucrative billion dollar thriving industry with an estimated profit of over US$10 billion per annum.\n\nGlobally, it is estimated that over 12 million children are facing modern day slavery, with three million facing forced labour and nine million facing forced marriages and sexual exploitation.\n\nThe UNODC 2024 global report on human trafficking detected victims up 25 percent as more children are being exploited and forced labour cases spike.\n\nChild trafficking is also on the rise in high income countries, often involving girls trafficked for sexual exploitation.As conflicts, climate-induced disasters and global crises exacerbate vulnerabilities worldwide, we are seeing a resurgence of detected victims of human trafficking, particularly children who now account for 38 percent of detected victims, said UNODC Executive Director Ms Ghada Waly.\n\nCriminals are increasingly trafficking people into forced labour, including to coerce them into running sophisticated online scams and cyberfraud, while women and girls face the risk of sexual exploitation and gender-based violence.\n\nWe need to step up criminal justice responses to hold those at the top of the criminal chain accountable, work across borders to rescue victims and ensure survivors receive the support they need, she added.\n\nThe 2024 Global Report features a special chapter on Africa, a region that has often been neglected in trafficking studies due to the difficulties in obtaining data.\n\nAccording to the report, detected African victims account for the highest number of destinations reached. In total, at least 162 different nationalities were trafficked to 128 different countries of destination in 2022. Of the cross-border flows detected, 31 percent involve citizens of African countries.\n\nMost African victims are trafficked within the continent, where displacement, insecurity and climate change are exacerbating vulnerabilities. Children are more frequently detected than adult trafficking in most parts of the continent, particularly for forced labour, sexual exploitation and forced begging. A contributing factor to the global rise in child victims detected is the overall increase of the number of cases detected in Sub-Saharan Africa.\n\nChild trafficking for forced labour and forced criminality are rising as poverty, conflict and climate change leave more people vulnerable to exploitation, according to the 2024 Global Report on Trafficking in Persons.Child rights lawyer and human trafficking expert Mr Zororai Nkomo said although Zimbabwe ratified the United Nations (UN) protocol that aims to prevent, suppress, and punish human trafficking, especially of women and children, which is commonly known as the Palermo Protocol, there are still existing legal gaps which make it difficult for the country to combat child labour trafficking.\n\nThe main reason why Zimbabwe crafted the 2014 Trafficking in Persons Act was to deal with the growing problem of human trafficking.\n\nAlthough this was a great legal development in fighting modern-day slavery, the Act does not sufficiently protect children from trafficking, especially child labour trafficking, Mr Nkomo said.\n\nHe added: The Act does not define child trafficking unlike what is provided in the Palermo Protocol which the Act purports to domesticate. Failure to define child trafficking poses a challenge on the legal response to forms of trafficking such as child labour trafficking which are rampant in Southern Africa.\n\nMr Nkomo said the way the Trafficking in Persons Act was crafted failed to address acts of trafficking happening in communities because the current legislation conceptualises human trafficking as a movement-based crime.This is very worrisome in that it defines human trafficking as a movement-based offence, which is a bit problematic to prosecute perpetrators.\n\nChild trafficking can happen within our communities even if there is no movement. Trafficking is the use of force, threat or any form of misrepresentation or fraud to exploit another human being.\n\nIts a crime which can happen even in the absence of movement. In our agriculture and mining sectors, there are a lot of young people who are being exploited for cheap labour and sexual exploitation. Such situations are not only unique to Zimbabwe but to many African countries, Mr Nkomo said.\n\nHe said the legislature can draw inspiration from South Africa and Kenya on how to craft trafficking legislation to curb child labour trafficking.\n\nAs a nation, we can learn from South Africa on how to make laws which protect our children from human trafficking. Although they are grappling with trafficking, South Africa and Kenya crafted their legislation in a manner which protects children.\n\nFor example, both countries define child trafficking unlike our current Trafficking in Persons Act, and both jurisdictions do not only define trafficking as a movement-based crime but a crime which can happen even in the absence of movement, said Mr Nkomo.\n\nChild rights lawyer and human trafficking expert Mr Zororai Nkomo\n\nHe reiterated that Zimbabwe is a Sub-Saharan African country recording a high prevalence of internal unreported cases of child labour trafficking.\n\nChildren are exploited through labour trafficking in cattle herding, domestic work, the mining sector and agriculture. Child labour trafficking is rife in the tobacco industry, sugar cane industry, cotton farming sector, and the fishing sector.\n\nThere are several traditional practices which make Zimbabwean girls vulnerable to child labour trafficking through trading for food, money and coercion into forced marriages. Children in Zimbabwe are forced into selling illicit drugs.\n\nTraffickers target girls and force them into forced commercial sex trafficking as well as forcing them to assist in illegal mining activities, he said.\n\nHe added: Children are fraudulently promised good jobs in neighbouring countries such as South Africa where they find themselves in sex trafficking and forced labour. Human traffickers in South Africa recruit undocumented children promising them employment where they will find themselves exploited in mines, farms and forced prostitution.\n\nBy adopting the Sustainable Development Goals (SDGs), the international community has committed to ending child labour by 2025 and forced labour and human trafficking by 2030.\n\nAccording to the latest global estimates,152 million children are in child labour and 25 million adults and children are in forced labour including in global supply chains. To achieve SDG target 8.7, governments, businesses, social partners, the financial sector and civil society must take strong action to address the root causes and determinants of these human rights violations at work.\n\nSDG target 8.7 seeks to take immediate and effective measures to eradicate forced labour, end modern slavery and human trafficking and secure the prohibition and elimination of the worst forms of child labour, including recruitment and use of child soldiers and by 2025 end child labour in all its forms.\n\nAdvocate Shamiso Masokovere-Magoko, another trafficking in persons expert echoed Mr Nkomos sentiments, adding that legislation is a crucial step, but its just one piece of the puzzle in combating child labour trafficking.Invest in quality education, especially for children on trafficking, what to look out for and reporting mechanisms. Teach children their rights and how to stay safe.\n\nEducate communities about trafficking warning signs and how to report suspected communities. Support families economically, address poverty, which is a major driver of child labour trafficking, skills development programmes for communities, and social safety nets, reducing the need to send children to work, she said.\n\nAdvocate Masokovere-Magoko said there is need to invest in specialised units dedicated to investigating trafficking.Businesses should implement ethical sourcing practices and utilise technology for identification and tracking like use of hotlines for reporting suspected cases. Implement systems to track missing children and identify victims.Engage the media to create powerful campaigns that highlight the issue and inspire action, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-59.jpg",
            "description": "Joel Tsvakwi Child rights specialists and anti-human trafficking experts say Zimbabwe should align the 2014 Trafficking in Persons Act to curb the growing trend of child labour trafficking in the Southern African Region. According to the United Nations Office on Drugs and Crime (UNODC), human trafficking in general and child labour trafficking, in particular, are […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        },
        {
            "title": "Chevrons, Ireland build up",
            "url": "https://www.chronicle.co.zw/chevrons-ireland-build-up/",
            "content": "Brandon Moyo,[emailprotected]\n\nTHE Ireland Test team was expected to touch down at Joshua Mqabuko Nkomo International Airport last night ahead of their one-off Test match against Zimbabwe which is scheduled for Queens Sports Club starting on Thursday.\n\nThis marks Irelands first visit to the City of Kings and Queens since in July 2023 for the International Cricket Council (ICC) Mens Cricket World Cup Qualifiers.\n\nHowever, they were last in Zimbabwe in December 2023 were they played a white-ball series against the Chevrons in Harare.\n\nThe visitors are expected to host training sessions today, tomorrow and on Wednesday ahead of the series opener starting on Thursday.\n\nZimbabwe have already hit the ground running as they held their first training session at Queens Sports Club yesterday.\n\nZimbabwe and Ireland are set to face off in a series that comprises of one Test, three One Day Internationals (ODIs) and as many T20Is.\n\nThe solitary Test match will be played at Queens Sports Club with the white ball matches taking place in Harare.\n\nChevrons celebrate a wicket\n\nThe three one-dayers are pencilled in for February 14, 16 and 18 while the 20-over matches will be played on February 22, 23 and 25. Prior to their trip to Zimbabwe, the Ireland Test team  which has former Zimbabwe international Peter Joseph Moor  held a four-day training camp in Dubai and flew into Zimbabwe from the United Arab Emirates (UAE).\n\nIreland has a better record against the Chevrons across all three formats. The two sides have faced each other once in Tests. The first ever Test meeting between the two nations was in Belfast last year and Ireland won that match by four wickets.\n\nZimbabwes Test squad includes two new faces, the uncapped duo of 27-year-old leg-spinner Vincent Masekesa and 26-year-old top-order batter Nicholas Welch, who have both been rewarded for their impressive performances on the domestic front.\n\nMeanwhile, Dion Myers and Tadiwanashe Marumani have been left out of the red-ball set-up.\n\nVeteran all-rounder Sikandar Raza will also miss the Test match, as he had already committed to franchise cricket before the tour schedule was confirmed.\n\nA major boost for Zimbabwe comes with confirmation of the availability of seasoned all-rounder Sean Williams, who was struggling with a back injury during the recent Test series against Afghanistan.\n\nFor the visitors, Waringstown Cricket Club and Northern Knights Morgan Topping, 25, earned a debut call-up to the Test and ODI squads. The right-handed top-order batter, a prolific run-scorer at club level, has established himself in the top order of the Northern Knights in recent seasons.\n\nPembrokes Gavin Hoey, after making his international debut in October, retained his place in the ODI squad and is in line for a Test debut  Topping and Hoey the only non-capped players in the Test squad.\n\nIn one-day cricket, the two sides have met 22 times, with Ireland winning 10 matches compared to Zimbabwes eight, while one match was tied and three yielded no results.\n\nIn 15 T20Is, Ireland have registered eight wins compared to Zimbabwes seven.\n\nGate charges for the Test match are pegged at US$3 for the rest of the ground and US$5 for the grandstand.\n\nIreland Test Squad\n\nAndrew Balbirnie (c), Mark Adair, Curtis Campher, Gavin Hoey, Graham Hume, Matthew Humphreys, Andrew McBrine, Barry McCarthy, PJ Moor, Paul Stirling, Harry Tector, Morgan Topping, Lorcan Tucker, Craig Young.\n\nZimbabwe Test Squad\n\nCraig Ervine (Captain), Brian Bennett, Johnathan Campbell, Ben Curran, Joylord Gumbie, Trevor Gwandu, Takudzwanashe Kaitano, Vincent Masekesa, Nyasha Mayavo, Blessing Muzarabani, Richard Ngarava, Newman Nyamhuri, Victor Nyauchi, Nicholas Welch, Sean Williams.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/a1.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com THE Ireland Test team was expected to touch down at Joshua Mqabuko Nkomo International Airport last night ahead of their one-off Test match against Zimbabwe which is scheduled for Queens Sports Club starting on Thursday. This marks Ireland’s first visit to the City of Kings and Queens since in July 2023 for […]",
            "time": "06:38",
            "date": "03 Feb 2025"
        }
    ]
}