{
    "news": [
        {
            "title": "Bulawayo Piano Festival hosts exclusive pre-party",
            "url": "https://www.chronicle.co.zw/bulawayo-piano-festival-hosts-exclusive-pre-party/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nFollowing the success of the inaugural Bulawayo Piano Festival on December 31, 2024, organisers have announced that the second edition will take place on April 12, 2025.\n\nIt will feature notable South African artistes, including DJ Maphorisa, Scotts Maphuma and Leemckrazy.\n\nDJ Maphorisa\n\nAhead of the main event, a pre-party will set the stage for what is to come. Scheduled for tomorrow, the pre-party will be held at a private venue in Bulawayo, which will only be disclosed to ticket holders. The venue will feature both indoor and outdoor spaces, complete with a swimming pool.\n\nEvent organiser, Jordan Dube, shared that the pre-party aims to build excitement and provide a platform for Amapiano fans to share their preferences and for organisers to gather input on ways to enhance the festival.The pre-party will take place on Saturday and its designed to create hype for the main event. Its an exclusive gathering where fans can come together and engage with us. As organisers, were excited to mingle with the crowd and hear their thoughts on what they expect from the festival, Dube explained.\n\nHe revealed that attendees will be treated to DJ sets on rotation, alongside two surprise celebrity appearances.\n\nLooking ahead to the main event, Dube said that the festival will be bigger.The second edition of the Bulawayo Piano Festival will be bigger and better than the first. The music quality and the calibre of artists will be elevated, he said.\n\nWhile the DJs at the first edition were fantastic, this time we have the original pioneers of Amapiano music, and were providing a platform for local Amapiano artistes to meet and interact with their South African counterparts. The event will feature seven artistes who include four local DJs.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hfghdghf.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com Following the success of the inaugural Bulawayo Piano Festival on December 31, 2024, organisers have announced that the second edition will take place on April 12, 2025. It will feature notable South African artistes, including DJ Maphorisa, Scotts Maphuma and Leemckrazy. Ahead of the main event, a pre-party will set the stage […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mhlophe’s second act: Can he deliver where Sibanda fell short?",
            "url": "https://www.chronicle.co.zw/mhlophes-second-act-can-he-deliver-where-sibanda-fell-short/",
            "content": "VUSUMUZI DUBE,[emailprotected]\n\nHIGHLANDERS, Bulawayos iconic football giants, are a year away from their centenary. Hopes for a celebratory season were briefly dashed when FIFA slapped them with a transfer ban for unpaid wages to former coach Baltemar Brito and his assistant. Brito was owed US$14,778 plus interest, and Torres US$11,788 plus interest, both accruing further penalties.\n\nJust when it seemed Bosso faced a prolonged crisis, socialite Wicknell Chivayo stepped in, paying off the debts in full. While this saved the clubs blushes, it exposed worrying questions about financial management. The debt was notably absent from discussions at last months AGM, leaving fans in the dark.\n\nWicknell Chivayo\n\nClub chairman Kenneth Mhlophe said they were relying on sponsors to resolve the issue before FIFAs punishment, but the near miss has raised serious concerns about transparency as Bosso approaches its 100th year.\n\nWe engaged our sponsors over the issue. Going into the annual general meeting week, all appeared in place for the debt to have been paid, and we counted on their usual support, Mhlophe said.\n\nMhlophe deflected criticism by blaming his predecessor, Johnfat Sibanda, for the stalled Inyathi gold mining venture. The project, intended to generate club revenue, reportedly made no progress under Sibandas leadership.\n\nThere was no action at all on the mining venture. Things were still as I had left them, and we then began to chase paperwork. As we speak, the papers have been lodged with the Ministry of Mines. Once they respond, we will be fine, Mhlophe said.\n\nBossos crisis has sparked scrutiny of Mhlophe and Sibandas leadership. Fans and stakeholders are comparing their tenures, achievements, and failures. This week, Saturday Chronicle will analyse their impact on the club.\n\nJohnfat Sibanda\n\nSibanda took over the reins of Highlanders Football Club in March 2021, after defeating Kenneth Mhlophe in a closely contested election. His tenure was marked by high expectations, as he campaigned on a platform of change, accountability, and financial stability for the club.\n\nHits:\n\nSecured Sakunda sponsorship\n\nSibanda secured a lucrative Sakunda sponsorship, providing US$420,000 for player salaries, US$60,000 each for sign-on fees and operational expenses, a potential US$200,000 league-winning bonus, and Ford Everest and Ranger vehicles for the coach and captain.\n\nAvailed replica jerseys for fans\n\nThrough sponsorship from Sakunda, replica shirts were available in three colours for Bosso fans to purchase.\n\nBrought in Brito\n\nSibanda hired foreign coach Baltemar Jos de Oliveira Brito, who nearly won the league, and brought in Joel Luphahla as assistant, with a succession plan. Luphahla later left, finding success at Dynamos and now coaching Simba Bhora.\n\nRenovation of the Highlanders Clubhouse\n\nThe Highlanders Clubhouse had gone for years without any notable renovations; it was now an eyesore, with non-functioning toilets, broken furniture, and everything in a state of disrepair. However, Sibandas administration secured a partnership deal with local businessman Phathisani Nkomo to modernise the clubhouse. This has made it a popular venue for Bosso fans after matches.\n\nBrought some cup glory to Highlanders\n\nDuring his tenure, Sibanda saw the team win the Independence Cup in 2022 and 2023.\n\nRevenue generation through the selling of players\n\nHe sold Daniel Msendami and Nqobizitha Masuku to Jwaneng Galaxy, thereby generating much-needed revenue for the club.\n\nMisses\n\nFailure to strengthen the squad, despite interest from players like Kuda Mahachi and Bruce Kangwa, resulted in a goal drought (just 24 goals) and cost Highlanders the league title. The championship remained elusive.\n\nFailure to produce audited results\n\nHe failed to produce audited accounts for the 2023 AGM, something that had not happened at the club in years. This eroded the trust of potential sponsors.\n\nFailed to get the clubs mining project in Inyathi off the ground\n\nHighlanders Inyathi gold mine claim, awarded in 2020 by President Mnangagwa, saw little development under Sibanda, despite plans to use proceeds for facilities and junior teams. A designated mine manager made no progress.\n\nInternal Divisions\n\nSibandas leadership was also marred by internal divisions within the clubs structures. Reports of factionalism and disagreements with board members occasionally surfaced, undermining his ability to lead effectively.\n\nKenneth Mhlophe\n\nMhlophe, the current chairperson, is no stranger to the Highlanders community, having previously served as the clubs chair from 2018 to 2021 before losing to Sibanda. His return to the helm of the club was seen as an opportunity to build on his earlier tenure and address lingering issues.\n\nHits:\n\nSecured more sponsorship for Highlanders\n\nMhlophe continued the Sakunda deal and secured a Better Brands sponsorship from Pedzai Scott Sakupwanya. Sakunda remained the main sponsor, while Better Brands covered costs for the Highlanders Academy (including all junior teams and the womens team, Highlanders Royals), paying staff and players.\n\nInfrastructure Development\n\nDuring his earlier tenure, Mhlophe initiated plans to renovate the clubs facilities, including the training grounds and the clubhouse. These efforts have continued in his current term, reflecting his commitment to improving the clubs infrastructure.\n\nImproved relations with fans\n\nMhlophe has worked tirelessly to restore trust and goodwill between the club and its fan base. Through community outreach efforts and fan engagement programmes, he sought to re-establish Highlanders as the peoples team. Last year, they held a successful fundraising initiative that was well-supported by both local and international fans.\n\nMisses:\n\nLimited success on the field\n\nDespite the perceived financial stability and structural improvements, Highlanders have yet to translate these gains into major success on the pitch. The club has not won the league title since 2006, and fans are growing increasingly impatient as the wait for a championship continues. In 2024, Highlanders failed to retain the Independence Trophy, were knocked out of the Chibuku Super Cup via a boardroom decision, and finished sixth in the league.\n\nFIFA ban after failing to pay former coaches outstanding salaries\n\nThe biggest failure that has marred his leadership was the FIFA ban on registering new players after they failed to pay their former coaches. What makes this a greater stain on his tenure is the manner in which he hid this from the clubs membership during their AGM. A question on everyones mind is how many skeletons in their closet were not revealed to its membership; what else is Mhlophe and his executive hiding?\n\nFailure to negotiate meaningful contracts with players\n\nHighlanders continue to lose players on free transfers due to poor contract negotiations. Under Mhlophe, Marvelous Chigumira, Godfrey Makaruse, Peter Muduhwa, Lynoth Chikuhwa, and several juniors left for free after their contracts expired. This costly mismanagement, despite a prior AGM resolution against it, forces the team to rebuild without transfer revenue.\n\nLynoth Chikuhwa\n\nLack of a clear plan to help finance the club\n\nMhlophes corporate experience hasnt translated into success for Highlanders. The club remains financially unstable, reliant on handouts, and lacks a clear survival plan. Proactive leadership is absent; Mhlophe mainly reacts to problems. The long-promised mining venture offers little immediate hope.\n\nFailure to provide replica jerseys\n\nLast season, fans made do with purchasing replica jerseys from the streets. The club continuously promised that the replicas were coming in a few weeks right up to the last game. We are now in 2025, and no sign of the replicas. Mhlophe has no plan at all on how he will counter the sale of these replicas on the streets. All that the club provided were woollen hats and scarves, which ironically were released during the summer season.\n\nNo movement in the transfer market\n\nIt is clear to all that Highlanders need to boost its squad, but a few weeks before the season starts, there is little or no movement on the transfer market. Other teams are busy bolstering their squad, but Mhlophe and his team are just silent. We will just give them the benefit of the doubt; maybe they are preparing to unleash a secret weapon that will once again bring smiles to its legion of fans.\n\nLast word\n\nUltimately, Highlanders remain in a rebuilding phase, and the true measure of any chairpersons success will be the clubs ability to reclaim its status as a dominant force in Zimbabwean football. Both leaders have contributed to the clubs journey in different ways, and their legacies will hinge on whether the foundation they have laid can lead to sustained success in the future.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dvxcdgxcv.jpg",
            "description": "VUSUMUZI DUBE, vusumuzi.dube@sundaynews.co.zw HIGHLANDERS, Bulawayo’s iconic football giants, are a year away from their centenary.  Hopes for a celebratory season were briefly dashed when FIFA slapped them with a transfer ban for unpaid wages to former coach Baltemar Brito and his assistant.  Brito was owed US$14,778 plus interest, and Torres US$11,788 plus interest, both accruing further […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "NEW: Death toll rises to 26 in Beitbridge-Masvingo highway collision",
            "url": "https://www.chronicle.co.zw/new-death-toll-rises-to-26-in-beitbridge-masvingo-highway-collision/",
            "content": "Online Reporter\n\nThe death toll from the fatal head-on collision between a bus and a haulage truck on the Beitbridge-Masvingo Highway last week has risen to 26, police have said.\n\nThe accident occurred at the 262-kilometre peg along the Masvingo-Beitbridge Road, near Lutumba tollgate. Seventeen people died on the spot, while seven others died in hospital.\n\nAnother died the following day, and the Government accorded state-assisted funerals to the families, with a funeral service held for 25 victims.\n\nAccording to a statement by National Police spokesperson Commissioner Paul Nyathi, one more person has died, and they are asking people to come forward to identify two more bodies.\n\nThe death toll has risen to 26 after a female adult, who was admitted to Parirenyatwa Hospital, died on 19th February 2025. The Zimbabwe Republic Police is appealing to the public to assist in identifying two remaining victims who died in the fatal road traffic accident. The first unidentified victim is a male adult who was wearing a red t-shirt and black trousers at the time of the accident. The second victim is a female adult who was wearing a black jersey and black trousers, said Commissioner Nyathi.\n\nHe said anyone with information should report to the nearest police station or contact the National Complaints Desk at (0242) 703631 or WhatsApp 0712 800 197.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/GGGGGG.jpg",
            "description": "Online Reporter The death toll from the fatal head-on collision between a bus and a haulage truck on the Beitbridge-Masvingo Highway last week has risen to 26, police have said. The accident occurred at the 262-kilometre peg along the Masvingo-Beitbridge Road, near Lutumba tollgate. Seventeen people died on the spot, while seven others died in […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "Katsande gets Zifa nod",
            "url": "https://www.chronicle.co.zw/katsande-gets-zifa-nod/",
            "content": "Online ReporterFORMER Warriors captain Willard Katsande has been appointed to ZIFAs Diaspora Global and Interaction Committee.Marshall Gore (Chairperson)Modern Ngwenya (Vice Chairperson)Walter MusanhuWillard KatsandeTizirai Luphahla\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bbbbbb.jpg",
            "description": "Online Reporter FORMER Warriors captain Willard Katsande has been appointed to ZIFA’s Diaspora Global and Interaction Committee. Marshall Gore (Chairperson) Modern Ngwenya (Vice Chairperson) Walter Musanhu Willard Katsande Tizirai Luphahla",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "“Drug lords must be flushed out” – President Mnangagwa",
            "url": "https://www.chronicle.co.zw/drug-lords-must-be-flushed-out-president-mnangagwa/",
            "content": "Nqobile Bhebhe\n\n[emailprotected]\n\nPRESIDENT Mnangagwa has issued a stern warning that drug lords must be flushed out and supply chains dismantled.\n\nHe stressed that in the ongoing fight against drug and substance abuse, no one is above the law.\n\nThe drug crisis poses a severe threat to public health, national security, economic stability, and the social fabric of the country.\n\nSpeaking during the National Day celebrations in Bulawayo on Friday, under the theme Empower Youth: Secure the Future, President Mnangagwa urged communities, both urban and rural, to refrain from sheltering criminals.\n\nSome of our young people continue to fall victim to drug and substance abuse, among other societal vices. In the ongoing war effort against drug and substance abuse, there are no sacred cows. Drug Lords must be flushed out and supply chains destroyed.\n\nOn their part, communities, both in urban and rural areas, must desist from the tendency of harbouring criminals. I urge us all to collaborate and work hand in hand with the national security agencies and other stakeholders in the justice system.\n\nThis should see us deepening as well as strengthening community-led crime detecting as well as fighting networks. Together, let us endeavour to achieve a drug-free society. That is the Zimbabwe we all want.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/llllll.jpg",
            "description": "Nqobile Bhebhe nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa has issued a stern warning that drug lords must be flushed out and supply chains dismantled. He stressed that in the ongoing fight against drug and substance abuse, no one is above the law. The drug crisis poses a severe threat to public health, national security, economic stability, and the […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "Chicken Inn engage in a team bonding camp",
            "url": "https://www.chronicle.co.zw/chicken-inn-engage-in-a-team-bonding-camp/",
            "content": "Fungai Muderere[emailprotected]AHEAD of the start of the 2025 Castle Lager Premier Soccer League (PSL) season Chicken Inn on Friday engaged in a one day team bonding camp at Blue Hills Camp in Umzingwane.\n\nChicken Inn players going through their sessions at their bonding camp on Friday\n\nUnder the guidance of veteran gaffer Joey Antipas, Gamecocks are on a rebuilding exercise that saw them part ways with veteran players that include their ex captain Danny Deco Phiri and goalkeeper Pride Zendera who are both still club hunting.At the bonding camp, the Gamecocks players and coaches engaged in a structural psychosocial support program which offered players a holistic support system that ensures they are mentally, emotionally and socially equipped to excel.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hhhhh-1.jpg",
            "description": "Fungai Muderere fungai.muderere@bmetro.co.zw AHEAD of the start of the 2025 Castle Lager Premier Soccer League (PSL) season Chicken Inn on Friday engaged in a one day team bonding camp at Blue Hills Camp in Umzingwane. Under the guidance of veteran gaffer Joey Antipas, Gamecocks are on a rebuilding exercise that saw them part ways with […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "BLOODBATH AS MAN GOES ON A KILLING RAMPAGE, MURDERS WIFE, NIECE, VILLAGE HEAD…Dog drags head of the village head…Wife’s body was buried in a pit latrine",
            "url": "https://www.chronicle.co.zw/bloodbath-as-man-goes-on-a-killing-rampage-murders-wife-niece-village-head-dog-drags-head-of-the-village-head-wifes-body-was-buried-in-a-pit-latrine/",
            "content": "Harare Bureau\n\nA COUPLES row ended in a bloodbath in Hurungwe as the enraged husband went on a killing spree and murdered his wife, niece and the village head in a shocking crime which has left villagers in shock.\n\nThe decapitated head of the village head was found by some villagers as it was being dragged by a dog.\n\nThe three people were killed at a village just three kilometres from Kabiza Shopping Centre.\n\nThe triple murder has sparked outrage and shock in the usually quiet village.\n\nNational police spokesperson, Commissioner Paul Nyathi, confirmed the incident and said they have arrested a man identified as Trymore Tore in connection with the murder.\n\nThe Zimbabwe Republic Police confirms the arrest of Trymore Tore, 37, in connection with three cases of murder in which three victims were found dead on February, 17 at Mubairecheni Village, Chundu, Hurungwe.\n\nThe first victim, who is the suspects wife, Moline Chibayanzara (21), was found dead in a pit latrine with multiple injuries on the head.\n\nThe body was wrapped in a blue blanket.\n\nThe second victim, a 17-year-old female juvenile, who is the suspects niece, was discovered about 60 metres from the suspects homestead with a swollen head and a cut on the forehead.\n\nThe body was covered with tree branches and a knife was recovered beside the body.\n\nThe body of the third victim, Kuwesu Musawu (53), who was the village head, was buried in a shallow grave behind the suspects house with a decapitated head and a deep cut on the neck.\n\nCommissioner Nyathi said preliminary investigations by the police suggest that the suspect and his wife were having consistent domestic disputes, which may have led to the murders.\n\nThe suspect and his wife were allegedly heard by villagers quarreling at their homestead on February 15.\n\nThe third victim was last seen going to the suspects homestead to mediate in the dispute between the couple, while the second suspect was also last seen going to the suspects homestead.\n\nA villager from Mubairacheni, who spoke on condition of anonymity, told H- Metro, that Trymore, in a moment of madness, murdered his wife, niece, and the village head before dumping their bodies in three different locations.\n\nShe said Trymore had married a second wife and this did not go down well with his wife.\n\nTrymore is alleged to have married a second wife, which led to his wife going back to her parents homestead.\n\nHowever, Trymore followed his wife and managed to persuade her to come back home and she agreed.\n\nThe second wife, realising that Trymore had brought back his first wife, then went back to her parents, said the villager.\n\nHe added:\n\nIts very saddening and I am at a loss of words. There was a trail of blood everywhere. This is outrageous.\n\nAnother villager said:\n\nThe body of his wife was found in a pit latrine and it was covered by some leaves, he said.\n\nAnother villager said:\n\nThis is callous and an abomination on our land. I have never witnessed such gruesome murders,  said the villager.\n\nAnother villager said:\n\nThe juveniles body was covered with three branches and there were blood stains on the ground.\n\nShe said the headman, Kuwesu Masawu, (56), was caught in the web after trying to solve the fallout between h Trymore and his wife.\n\nIts very unfortunate that we lost our headman who went there to mediate.\n\nTore and his wife had an altercation about a day or so before the incident but we never thought the altercation was going to end in this way.\n\nA dog was found dragging a skull and it was found out that it was Masawus head.\n\nMeanwhile, police in Masvingo arrested Joseph Dimiti (38) in connection with a case of murder that occurred at Machakata Village, Soti-Source, Gutu, on Monday.\n\nThe suspect allegedly attacked his friend, Richard Takawira (35), with a hoe all over the body after accusing him of proposing love to his wife.\n\nThe victim died upon admission at a hospital in Gutu, said Commissioner Nyathi.\n\nPolice have also arrested Prisca Takaza (29) in connection with a murder case in which she allegedly stabbed her husband, Liberty Karikoga (40), with a knife on the collarbone after a domestic dispute in Borrowdale.\n\nMembers of the public are urged to respect the sanctity of life and resolve disputes amicably without resorting to violence, said Commissioner Nyathi.\n\nWhere possible, parties should seek counselling from traditional leaders, the church and elders from the community.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-166-300x180.jpg",
            "description": "Harare Bureau A COUPLE’S row ended in a bloodbath in Hurungwe as the enraged husband went on a killing spree and murdered his wife, niece and the village head in a shocking crime which has left villagers in shock. The decapitated head of the village head was found by some villagers as it was being […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "Embrace digital skills for global competitiveness: President",
            "url": "https://www.chronicle.co.zw/embrace-digital-skills-for-global-competitiveness-president/",
            "content": "Online Writer\n\nZimbabwean youths must embrace digital skills and technology to secure their future and drive national economic growth in a rapidly evolving global economy, President Mnangagwa has saidIn his keynote address at the National Youth Day commemorations at the ZITF Grounds in Bulawayo on Friday, the President urged young people to adapt, innovate and take charge in an increasingly digital world.In this digital age, you must be equipped with the necessary skills to navigate the complex global ecosystem, said the President.\n\nThe rapid application of Artificial Intelligence entails that we must adapt to the fast-changing world by capacitating ourselves, sector by sector, with the requisite digital proficiencies and capabilities.I, therefore, challenge you, our young people, to harness the transformative power of technology, innovate and unleash your enthusiasm as well as entrepreneurship skills towards creating wealth and job opportunities, while contributing to the growth of our economy.As your President, I am confident that you have the capacity to deliver, to be productive and to make our country a shining beacon.He said Zimbabwes future was in the hands of its young people.The commemorations coincided with the launch of the Zimbabwe Digital Skills Development Programme, a collaborative initiative between Zimbabwe and the United Arab Emirates (UAE).Under the programme, 1,5 million young people will receive training in software engineering and development, as well as computer programming.It is envisaged that the initiative will strengthening young peoples digital literacy while fostering technological innovation.This will enhance the employability of our young people, while empowering the youth and fostering economic growth, he added.Furthermore, the programme encourages innovation and creativity as well as entrepreneurship through the development of local tech solutions and start-ups.This must enhance the countrys competitiveness in the global market.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jjjk.jpg",
            "description": "Online Writer Zimbabwean youths must embrace digital skills and technology to secure their future and drive national economic growth in a rapidly evolving global economy, President Mnangagwa has said In his keynote address at the National Youth Day commemorations at the ZITF Grounds in Bulawayo on Friday, the President urged young people to adapt, innovate […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "Man sentenced to five years in prison for attempted murder",
            "url": "https://www.chronicle.co.zw/man-sentenced-to-five-years-in-prison-for-attempted-murder/",
            "content": "Ronald Mpofu [emailprotected]\n\nA 20-YEAR-OLD man from Pumula South, Bulawayo has been sentenced to five years imprisonment by the Bulawayo Magistrates Court for attempted murder.\n\nNathan Phiri (20) was found guilty for assaulting Mkhanyisi Ndlovu (23) with fists and open hands after striking him with an axe on the head.\n\nIn a statement on X, NPAZ said October 23, 2024, at House Number 21036, Pumula South, Bulawayo, Nathan Phiri attempted to cause the death of his friend Mkhanyisi Ndlovu (23).\n\nThe accused struck the complainant with an axe on the head and assaulted him with fists and open hands.\n\nThe altercation occurred after the complainant visited the accuseds residence to retrieve his cellphone, which the accused had borrowed earlier. Both parties had been drinking beer prior to the incident.\n\nThe complainant sustained severe injuries to the head and face and was hospitalized for treatment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Ronald Mpofu – itsronaldrox@gmail.com A 20-YEAR-OLD man from Pumula South, Bulawayo has been sentenced to five years imprisonment by the Bulawayo Magistrates Court for attempted murder. Nathan Phiri (20) was found guilty for assaulting Mkhanyisi Ndlovu (23) with fists and open hands after striking him with an axe on the head. In a statement on […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        },
        {
            "title": "Minister Muchinguri-Kashiri praises President Mnangagwa’s vision for youth development",
            "url": "https://www.chronicle.co.zw/minister-muchinguri-kashiri-praises-president-mnangagwas-vision-for-youth-development/",
            "content": "Online Reporter\n\nDEFENCE and War Veterans Affairs Minister, Oppah Muchinguri-Kashiri has expressed gratitude to President Mnangagwa for his astute leadership in ensuring the successful hosting of National Youth Day commemorations in Bulawayo.She was speaking while delivering the closing remarks at the event that was held at the Zimbabwe International Exhibition Centre.In her address, Minister Muchinguri-Kashiri commended President Mnangagwas unwavering commitment to the growth and empowerment of young people.President Mnangagwa remains committed to the growth and empowerment of young people. His presence at todays event proves that he has the youth at heart, she said.\n\nShe lauded both the days theme, Empower Youth, Secure the Future, and the Presidents speech, stressing their significance as a call to action for building a future inspired by digital innovation.Minister Muchinguri-Kashiri emphasized the importance of preparing for a world where Artificial Intelligence and technology are integral to modern societies.The theme and President Mnangagwas speech remind us of the need to plan for a digital-inspired future where Artificial Intelligence is part of modern societies, she said.The Minister also highlighted the ongoing fight against drug and substance abuse, describing it as a critical issue that must be tackled to protect the countrys youth and secure their future.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/wqsa1w.jpg",
            "description": "Online Reporter DEFENCE and War Veterans Affairs Minister, Oppah Muchinguri-Kashiri has expressed gratitude to President Mnangagwa for his astute leadership in ensuring the successful hosting of National Youth Day commemorations in Bulawayo. She was speaking while delivering the closing remarks at the event that was held at the Zimbabwe International Exhibition Centre. In her address, […]",
            "time": "21:46",
            "date": "21 Feb 2025"
        }
    ]
}