{
    "news": [
        {
            "title": "Triple national heroes’ burial  set for today",
            "url": "https://www.chronicle.co.zw/triple-national-heroes-burial-set-for-today/",
            "content": "Harare BureauTHREE national heroes  Major-General (Retired) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura  are set to be buried at once at the National Heroes Acre in Harare today, marking the third time this has happened since Independence in 1980.\n\nActing President Dr Constantino Chiwenga is set to preside over the triple burial. Home Affairs and Cultural Heritage Minister Kazembe Kazembe, confirmed the latest developments.\n\nAll the national heroes will be buried tomorrow (today); it will be a triple heroes burial, he said.The Acting President General (Rtd) Dr Chiwenga will preside over the burials of the three national heroes.\n\nThe first time that Zimbabwe buried three national heroes at once was on January 26, 2021, when three national heroes  Lieutenant General (Rtd) Dr Sibusiso Busi Moyo, Dr Joel Biggie Matiza and Major-General (Rtd) Paradzai Zimondi  were buried on the same day.\n\nThe second occasion was on April 29 last year when Cde Nash Nyasha Dzimiri, Brigadier General Shadreck Vezha and Cde Tsitsi Grace Jadagu, were buried at the National Shrine.\n\nCde Chenhamo Chen Chakezha Chimutengwende\n\nActing Home Affairs and Cultural Heritage Permanent Secretary Mike Masaka, appealed to Zimbabweans to turnout in their numbers to give the three national heroes a befitting send-off.\n\nThe Government has provided buses to the provinces where our national heroes hail from.\n\nWe have provided buses in Mashonaland Central, Manicaland, Bulawayo and Matabeleland South provinces, said Mr Masaka.\n\nGates to the National Heroes Acre are set to open at 6am and mourners are expected to be seated by 7am. Yesterday, a service was held in Mutare for Ambassador Mvundura, where speakers praised Governments decision to accord him national hero status. Zanu-PF Politburo member Cde Supa Mandiwanzira, said it is through people like Ambassador Mvundura that young leaders in the party are finding their feet on the political terrain.\n\nI am here to thank Ambassador Mvundura for the good works he carried out during his lifetime. I am also here to thank the President Dr Emmerson Mnangagwa for his decision to bestow Ambassador Mvundura with national hero status, he said.\n\nI would not be where I am today as a young party leader had it not been for people like Ambassador Mvundura and his fellow cadres.\n\nI read in The Sunday Mail at some point that when Ambassador Mvundura went to join the liberation struggle in Tembwe, he was tortured together with his colleagues back then because they were suspected to have been on a spying mission.\n\nHowever, together with his colleagues, he never looked back until they convinced the leadership of the armed struggle that they were genuine cadres who were out to liberate the country from the shackles of colonialism.\n\nMinister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza, said Ambassador Mvundura shaped his early political consciousness as a Zanu-PF cadre.\n\nWhen I speak of Ambassador Mvundura, I am speaking about a leader that I really know as he was my father, the late Kenneth Manyondas best friend.\n\nHe was one person who had great respect for lawyers and personally, he helped shape my early political career. I really want to thank our leader President Emmerson Mnangagwa for the national hero status. As the people of Manicaland, we feel honoured that our deserving leaders are getting the recognition they duly deserve, said Advocate Mugadza.\n\nWar Veterans representative, Cde Nyasha Manyanhaire and Zanu-PF Manicaland chairman Cde Tawanda Mkodza, among others, attended the service.\n\nAmbassador Mvunduras body was later airlifted to Harare, where it lay in state ahead of burial today.\n\nAmbassador John Shumba Mvundura\n\nSimilarly, Cde Chimutengwendes body was taken back to Harare yesterday afternoon from his rural home in Chiweshe where it was taken on Monday to allow family, friends and the entire province to bid him farewell.\n\nIn respect of Maj-Gen Siziba, the body was taken back to Harare on Monday after a full military funeral parade held in Bulawayo at Lookout Masuku Barracks, where Commander Defence Forces, General Philip Valerio Sibanda, was the chief mourner.\n\nThe bodies of the national heroes yesterday lay in state at Charles Gumbo Barracks ahead of burial today.\n\nYesterday, Maj-Gen Sizibas cousin, Mr Obert Siziba, said that during his upbringing, the late national hero was a role model, not only to his siblings but also other youngsters in the Nhwali community in Gwanda South.\n\nHe noted that Maj-Gen Siziba was among the few individuals who defied the odds by excelling in his education during the colonial Bantu Education System, which was designed to restrict black peoples progress.\n\nHe was one of the few young people who secured a place at Manama High School, which was reserved for the academically gifted.\n\nOur brother loved school very much, and he did well. He used to help us a lot with school and encouraged us to attend classes, said Mr Siziba.\n\nWe all aspired to be like him. He took many of us under his wing and assisted us with our studies. He attended Nhwali Primary School and did so well that he managed to secure a place at Manama High School, which was reserved for the academically gifted.\n\nDuring the school holidays, he would come home and teach us how to speak English. His ability to speak English made him popular among other children in the community, but he never let it go to his head, he added.\n\nHe remained kind and humble. The education system at the time was designed to disadvantage black people, but despite the obstacles, my brother soared high.Mr Bethuel Siziba said the national hero consistently made an effort to assist not only his immediate family but also the broader family and community whenever he could.\n\nHe recalled that last year, hundreds of people were able to obtain birth certificates and national identity cards after his late brother engaged the Registry Department to provide a three-day service at Nhwali High School.\n\nMs Angelina Dube, another cousin of the late liberation icon, said their family and community gained valuable recognition and status because of Maj-Gen Sizibas work.\n\nThe lives of many people in our community and family improved because of our late brothers influence. He encouraged people to pursue education or engage in livelihood projects that could improve their well-being, she said.\n\nWe are proud of him as a family, as we are now recognised and have been elevated because of his good and influential works.\n\nThe Nhwali community has also gained prominence and has experienced significant development due to his efforts. We will always remember him and remain grateful.\n\nMaj-Gen Siziba attended Nhwali Primary School before proceeding to Manama High School in 1976, where he began Form One.\n\nThe following year, he joined the armed struggle from school alongside the now-late national hero, Lt-Gen Sibusiso Moyo, Beitbridge East MP Albert Nguluvhe, former Commander Air Force Commander Air Chief Marshal (Rtd) Elson Moyo, and former Zimbabwe International Trade Fair (ZITF) public relations manager Mrs Cecilia Bhebhe, among other cadres.\n\nMaj-Gen Siziba underwent military training in Zambia and, during the ceasefire, was attested into the Zimbabwe National Army (ZNA).\n\nHe was stationed at the Zimbabwe Military Academy, where he rose to the rank of Captain. He was later transferred to ZNA Headquarters, where he worked until 2005, rising to the position of Lieutenant-Colonel.\n\nHe was posted to Botswana as Defence Attach from 2005 to 2013, based at the Zimbabwean Embassy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/The-late-Major-General-Retired-Solomon-Siziba.jpg",
            "description": "Harare Bureau THREE national heroes – Major-General (Retired) Solomon Siziba, Cde Chenhamo “Chen” Chakezha Chimutengwende and Ambassador John Shumba Mvundura – are set to be buried at once at the National Heroes Acre in Harare today, marking the third time this has happened since Independence in 1980. Acting President Dr Constantino Chiwenga is set to […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "Umzingwane Dam recommissioned…Inflows into dams jump 13 percent",
            "url": "https://www.chronicle.co.zw/umzingwane-dam-recommissionedinflows-into-dams-jump-13-percent/",
            "content": "Sikhumbuzo Moyo,[emailprotected]THE Bulawayo City Council has recommissioned Umzingwane Dam following significant inflows into the supply dam, which was decommissioned in November 2023 with just over four percent water while another decommissioned dam, Upper Ncema, is likely to be recommissioned soon.\n\nUpper Ncema was decommissioned in October last year with its water levels at 2,03 percent. The council, however, said it will maintain the 132 hour water shedding regime as it monitors the supply dams water levels. It said cumulatively the water levels have increased by 13,07 percent due to the incessant rains being received across the country.\n\nHopes are high that improved inflows into the citys supply dams will ease the water shortages that have forced council to ration water resulting in most suburbs receiving water once or twice a week.\n\nWe have started pumping water from Umzingwane dam, which was decommissioned in November last year. The water from the dam is pumped to Ncema water works said the councils principal water engineer, Kwanele Sibanda.\n\nHe said both Umzingwane and Upper Ncema dams have received significant inflows and as such council could soon start pumping water from Upper Ncema.\n\nA Chronicle news crew yesterday visited Umzingwane Dam and noted that the water levels are high now compared to when it was decommissioned.\n\nAccording to the latest dam levels report, Umzingwane Dam is 36,89 percent full, Insiza Mayfair is 42,28 percent full, Inyankuni is 19,27 percent full while Upper Ncema is 29,04 percent full with Lower Ncema at 14,74 percent full. Mtshabezi Dam tops at 64,26 percent full.\n\nEng Sibanda, however, said despite the significant inflows council will maintain the 132-hour water shedding regime until such a time that the supply dams have enough water to last the city the next 12 months.\n\nRecently, council announced that it needs about US$30 million to undertake various projects for immediate water augmentation with the rehabilitation of clear water pump stations at Ncema and Fernhill requiring a highest amount of US$6,2 million.\n\nAccording to the latest council minutes, US$2 million is needed for the completion of works on plants 1 and 2 at Aisleby Wastewater Works while US$2,1 million is needed to mitigate against non-revenue water (NRW) losses, which is as high as 46 percent of treated water.\n\nCouncil has said it cannot account for all the water that it pumps due to derelict pipes, theft of water supply equipment and poor water metering system. Non-Revenue Water (NRW) is defined as water that is pumped but is subsequently lost or unaccounted for in the system.\n\nEventually, costs associated with theft, evaporation, faulty metering, poor data gathering and leakage are passed on to the ratepayer.The citys Director of Water and Sanitation, Engineer Sikhumbuzo Ncube, is on record saying there are various proposed alternatives and ongoing initiatives reflecting the citys proactive approach to securing sustainable and long-term water resources.\n\nHe said several developmental partners had been approached with detailed project lists seeking urgent appeal for support.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ytghghghghghghghghghghghdf.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Bulawayo City Council has recommissioned Umzingwane Dam following significant inflows into the supply dam, which was decommissioned in November 2023 with just over four percent water while another decommissioned dam, Upper Ncema, is likely to be recommissioned soon. Upper Ncema was decommissioned in October last year with its water levels at […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "Former guard steals safe containing US$ 4 500",
            "url": "https://www.chronicle.co.zw/former-guard-steals-safe-containing-us-4-500/",
            "content": "Lesley Chikudo,[emailprotected]A BULAWAYO man who was previously employed as a security guard by Matabeleland Engineering Company appeared in court for allegedly breaking into his former employers premises and stealing a safe containing US$4 500.\n\nSolomon Mateta (52) appeared before Western Commonage magistrate, Mr Mehluli Moyo, facing charges of theft and unlawful entry. He was granted US$100 bail and remanded to January 27.The prosecutor, Mrs Ellen Matenga said the charges stem from two alleged incidents that occurred between August and September 2024. Mateta is accused of breaking into the companys premises and stealing a safe containing US$4 500.\n\nAdditionally, he is charged with unlawful entry, as he had been barred from entering the premises after being fired in 2022 and a restraining order had been issued against him.Mateta pleaded not guilty to the two charges, claiming that he was not in Bulawayo during the alleged incidents.\n\nHe stated that he had been moving between Harare and Filabusi for piece jobs and only returned to Bulawayo in September to collect his belongings as he was permanently relocating to Harare.I was moving between Harare and Filabusi doing piece jobs. I only came to Bulawayo in September to take my clothes as I was permanently moving to Harare, Mateta told the court. He also said he did not receive any restraining order when he was fired from the company, explaining that he still possessed the keys to the premises.\n\nA representative from the company testified in court, explaining the circumstances surrounding the break-in.A company official said he was notified by a security guard of a break-in at the Riverside North premises, where a safe containing money was stolen.\n\nThe doors to the managers office and the office housing the safe were found vandalised, and the company laptop was left untouched.The safe that contained money was missing while another safe containing company papers and keys was intact.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/12/theft.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A BULAWAYO man who was previously employed as a security guard by Matabeleland Engineering Company appeared in court for allegedly breaking into his former employer’s premises and stealing a safe containing US$4 500. Solomon Mateta (52) appeared before Western Commonage magistrate, Mr Mehluli Moyo, facing charges of theft and unlawful entry. He […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "‘Bosso owes me US$2 800’…Bosso secretary seeks compensation  for acting post",
            "url": "https://www.chronicle.co.zw/bosso-owes-me-us2-800-bosso-secretary-seeks-compensation-for-acting-post/",
            "content": "Zimpapers Sports Hub\n\nA leaked internal letter has revealed that Highlanders owe their executive secretary, Morgan Gazza Dube, $2 745 in compensation for his services as acting chief executive officer last November.\n\nDube took over as acting chief executive officer following the death of the clubs chief executive officer, Sihlangu Dlodlo and says he was promised an allowance by club chairman Kenneth Mhlophe, which was to be determined by the executive committee.\n\nHowever, in a surprise turn of events, Dube alleges that he was asked to return the money paid to him as allowance despite incurring expenses during his tenure as the acting chief executive officer as he had to relocate from Victoria Falls to Bulawayo.\n\nSihlangu Dlodlo\n\nAccording to the letter, Dubes expenses included accommodation ($1 200), meals ($1 500), communication data ($15) and transport ($30).\n\nDube expressed his willingness to return the allowance but said the club has to first reimburse him the expenses.\n\nThis serves as a reminder that I am still waiting for my compensation. This follows the Highlanders Exco resolution to appoint me as acting CEO for the month of November 2024. I availed myself for the whole duration of 26 working days as assigned.\n\nI even advised that I did not have the funds to meet my basic welfare while executing my duties of which you advised I was going to be compensated. You also tried to help secure cheaper accommodation through a club member and that failed. Thereafter, you then suggested that I could borrow around to sustain my temporary relocation of which I successfully did and reported back to you and later the Exco in a meeting, reads the letter.\n\nKenneth Mhlophe\n\nUpon appointment, you advised that I would be paid an allowance that was to be determined by the Exco. When it was time to claim salaries from our sponsor, I believed you had settled for the former Ceos salary to be paid to me as my acting allowance considering the payroll had been run past you by the treasury.\n\nFrom the recent numerous meetings that I have had with the Exco and later with both Exco and Board (Joint), it has become clear to me that I had been misled into that acting position and the promised allowance hence you have now asked me to return the money paid to me. Im happy to accept the abuse and return the allowance as soon as I get my reimbursement, Dube wrote.\n\nEfforts to comment from the club executive were not successful.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/adcvgrb.jpg",
            "description": "Zimpapers Sports Hub A leaked internal letter has revealed that Highlanders owe their executive secretary, Morgan “Gazza” Dube, $2 745 in compensation for his services as acting chief executive officer last November. Dube took over as acting chief executive officer following the death of the club’s chief executive officer, Sihlangu Dlodlo and says he was […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "ZNCC calls for lower electricity tariffs",
            "url": "https://www.chronicle.co.zw/zncc-calls-for-lower-electricity-tariffs/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Zimbabwe National Chamber of Commerce (ZNCC) has appealed to the Zimbabwe Electricity Supply Authority (Zesa) to reduce the electricity tariff for businesses and give the productive sector between six to 12 months grace period to clear their arrears saying this will support economic recovery.\n\nIn its recently issued 2024 State of the Industry Report, the business lobby group said the proposal was backed by a majority of industry leaders following Zesas call for all medium and large customers in the commercial, industrial, tourism, and mining sectors and institutions that are still on postpaid billing, to migrate to the prepaid billing platform.\n\nThe migration was supposed to be with effect from October 1, 2024. The power utility had said that industry, commerce, and mining sectors in the prepaid platform were expected to address the Zimbabwe Electricity Transmission and Distribution Companys significant debt of over ZWG5,7 billion.\n\nIndustry, commerce, and mining account for 74 percent of this debt, with each sector contributing 50 percent and 12 percent respectively\n\nDue to the debt, Zesa has been struggling to import electricity, and the supply challenges have been exacerbated by the low dam levels at Kariba Dam, which supplies water for electricity at Kariba Power Station.\n\nKariba Power Station\n\nZNCC has said the power challenge has been one of the factors that contributed to a decline in capacity utilisation at the same time increasing the cost of doing business for industries, as they tend to use other alternatives like generators that are expensive to operate.\n\nReasons for low-capacity utilisation levels varied with most respondents citing exchange rate distortions, low demand for goods and services, and power outages as the main reasons weighing down capacity utilisation, said ZNCC.\n\nOffer a grace period of 6-12 months for businesses to clear their Zesa debts to support economic recovery. This should include a postponement of the prepaid metering requirement to mid-year, said ZNCC.\n\nNotwithstanding the need for cost-reflectivity as an end goal and desirability to attract independent power producers (IPPs) into the energy sector, consider reducing the electricity tariff cost per kWh from US$0,142 to US$0,09 per kWh for commercial users, to support sectors such as manufacturing, ICTs, and mining sectors.\n\nZNCC further said there is a need to accelerate the revitalisation and expansion of the national electricity grid to increase its carrying capacity in anticipation of new energy projects expected to supply the grid by December 2025.\n\nThis includes ensuring the grid is upgraded to effectively transmit energy from emerging renewable sources, such as solar and wind while minimising transmission losses, said the business lobby group.\n\nMeanwhile, ZNCC said capacity utilisation in most sectors decreased when compared to the previous year, 2023, citing exchange rate distortions, low demand for goods and services, and power outages as the main reasons.\n\nThe lobby group said in most service sectors as well as agriculture, capacity utilisation declined while in the mining and quarrying sector it marginally increased, particularly, for enterprises in gold and ferrochrome production.\n\nA total of 672 (38,6 percent) respondents indicated that capacity utilisation decreased in 2024 when compared to 2023, while 125 (7,2 percent) indicated that it drastically, said ZNCC.\n\nAbout 461 (26,5 percent) reported that it increased while for 482 (27,7 percent) firms it remained unchanged.\n\nZimbabwe National Chamber of Commerce (ZNCC).\n\nAccording to ZimStat, the manufacturing sector experienced a 1,3 percent decline in capacity utilisation during the third quarter of 2024.\n\nThe statistics agency also attributed the decline to persistent challenges such as cash flow difficulties, electricity shortages, and uncertainty in the economic environment. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/9-2.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com THE Zimbabwe National Chamber of Commerce (ZNCC) has appealed to the Zimbabwe Electricity Supply Authority (Zesa) to reduce the electricity tariff for businesses and give the productive sector between six to 12 months grace period to clear their arrears saying this will support economic recovery. In its recently issued 2024 State of […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "llegal mining operations undercut supply to the dam",
            "url": "https://www.chronicle.co.zw/umzingwane-dam-recommissioned-as-illegal-mining-operations-undercut-supply-to-the-dam/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]WHILE incessant rains have resulted in a gradual increase in water levels at Bulawayos supply dams, Government has decried the adverse impact of rampant illegal gold mining operations in the Umzingwane Catchment Area, which continue to frustrate inflows to major water bodies.\n\nBulawayos major supply dams  Umzingwane, Mtshabezi, Inyankuni, Insiza-Mayfair, Upper and Lower Ncema  are situated in districts in Matabeleland South Province, which have in recent years been invaded by illegal gold miners who flout environmental regulations and cause siltation.\n\nYesterday, the Permanent Secretary for Presidential Affairs and Devolution in the Office of the President and Cabinet (OPC), Engineer Tafadzwa Muguti and his delegation came face to face with the sad reality of illegal gold mining operations, which damaged a bridge along the Umzingwane- Inyankuni River confluence and hamper inflows into Umzingwane Dam.\n\nAs the Office of the President and Cabinet, we are very concerned. There was a Cabinet directive where His Excellency ordered all provinces to intensify the anti-alluvial mining campaign, said Eng Muguti.\n\nMany people do not appreciate it, they think it is silver and gold but to be honest with you if you look at it, this is almost a 150m bridge (see picture), which was destroyed completely in the name of mining.\n\nThis is Umzingwane River, it supplies water to Bulawayo and the collapse of this bridge is causing water challenges as the water has stopped flowing.\n\nWe had a Chinese company here, Friends of the Environment who partnered with EMA (Environmental Management Agency) and the province later found out that by day they were closing the pits in the name of Friends of the Environment and by night they were mining.\n\nAs you can see, they destroyed the whole bridge while looking for gold.Eng Muguti said Government would not sit back and watch the rot as it was determined to curb the disruptive impact and would do more due diligence on the private voluntary organisations including NGOs that want to work with communities.\n\nQuite frankly not everyone is coming for the benefit of Zimbabwe. Our message to all Zimbabweans is that lets step up in terms of anti-alluvial mining, lets make sure we protect the environment, he said.\n\nAs it is, water is the big issue in terms of industrial water, water for animals, and now water for communities. As it is, the communities around Umzingwane River ended up not getting water for their animals, this is a big river and at its peak, it can flood, said Eng Muguti.\n\nWe have come through so that we can understand as part of our tour of Matabeleland South so that we can appreciate the damage done.\n\nI am glad that the ZRP, EMA, and the office of the Minister of State have been working together to make sure that this issue is addressed. This is one of the sad stories that Zimbabwe is faced with right now and unfortunately, all these illegal mining activities are not benefitting the communities.EMA Matabeleland South provincial manager Mr Decent Ndlovu said illegal mining activities have had severe impacts on the environment, among them the siltation of major dams.\n\nIllegal mining has been rampant across the province and the Umzingwane area is one of the areas where its prevalent.\n\nWe also have other illegal mining hotspots such as Nugget Mine in Matobo and Vhovha Mine in Gwanda, he said.\n\nMr Ndlovu said working with law enforcement agencies, they have been conducting raids to fight illegal mining activities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gijogfhgfhgfhifhi.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw WHILE incessant rains have resulted in a gradual increase in water levels at Bulawayo’s supply dams, Government has decried the adverse impact of rampant illegal gold mining operations in the Umzingwane Catchment Area, which continue to frustrate inflows to major water bodies. Bulawayo’s major supply dams – Umzingwane, Mtshabezi, Inyankuni, Insiza-Mayfair, Upper […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "Prophet releases book to help followers enhance spiritual journeys",
            "url": "https://www.chronicle.co.zw/prophet-releases-book-to-help-followers-enhance-spiritual-journeys/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nRenowned spiritual leader, Prophet Bruce Edwards, has launched a new book titled 40 Days of Prayer and Fasting, coinciding with his churchs ongoing prayer and fasting initiative.\n\nThe Kingdom Empowerment Centre (KEC), headquartered in Bulawayo, began its 40-day spiritual exercise on January 13, set to conclude on February 21.\n\nProphet Edwards, who has gained significant online popularity, hopes the book will inspire readers to renew their connection with God and realign their spiritual priorities.\n\nThe book, Prophet Edwards said, serves as a comprehensive guide for individuals seeking to enhance their spiritual journey through structured prayer and fasting. It includes daily devotionals, scripture readings and practical tips for effective fasting.\n\nPrayer\n\nThe book emphasises seeking Gods guidance, repentance and surrendering to His will. The goal is to cultivate a closer relationship with God, experience spiritual breakthroughs and seek His direction in various areas of life, said Prophet Edwards.\n\nHe highlighted the health benefits of fasting, calling it a system of detoxification in a world of fast foods that aids in rebooting the immune system.\n\nUnguarded appetites are the number one enemy of our progress. Every failure is traceable to unguarded passions  whether its sexual desires, cravings for food, resources, or acceptance. Fasting restores our focus and helps us prioritise what truly matters, he said.\n\nA transformational leader and sought-after minister, Prophet Edwards is dedicated to ushering an End Time Revival.\n\nAs the founder and president of KEC, he has earned a reputation as a revolutionary thinker and catalyst for change.\n\nHis work extends beyond the church, consulting with civic, non-profit and religious organisations globally. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/1111.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Renowned spiritual leader, Prophet Bruce Edwards, has launched a new book titled 40 Days of Prayer and Fasting, coinciding with his church’s ongoing prayer and fasting initiative. The Kingdom Empowerment Centre (KEC), headquartered in Bulawayo, began its 40-day spiritual exercise on January 13, set to conclude on February 21. Prophet Edwards, who […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "A new dawn for psychology in Zimbabwe : Dr Naeem empowering minds, transforming lives",
            "url": "https://www.chronicle.co.zw/a-new-dawn-for-psychology-in-zimbabwe-dr-naeem-empowering-minds-transforming-lives/",
            "content": "Blessing Karubwa,[emailprotected]IN a world where mental health is often overshadowed by physical health, Dr Naeem Farzana stands as a beacon of hope in Zimbabwe.\n\nA proud mother of two and a trailblazer in the field of psychology, she has dedicated her career to advancing mental health services in a country where the need is more critical than ever.\n\nHer journey from Pakistan to Zimbabwe is not just a testament to her resilience but also a call to aspiring psychologists to recognise the abundant opportunities within their homeland.\n\nIn an interview, Dr Farzana said her story began with a marriage that brought her to Zimbabwe, where she initially faced numerous challenges.\n\nHer passion for psychology ignited a desire to fill the gaps in mental health services, particularly in under-served communities.\n\nWhen I arrived, I didnt know anyone and the road was tough. But I worked hard and the fruits of my labour are now evident, she reflected.\n\nI always tell new psychologists  dont leave the country. There is so much work to be done here and you can make a significant impact.Since 2008, Dr Farzana has served as the Head of the Psychology Department at Parirenyatwa Group of Hospitals, where her leadership has transformed the mental health landscape.\n\nParirenyatwa Group of Hospitals\n\nShe founded Gateway Mental Health Rehabilitation, aiming to make therapy accessible and effective.\n\nPsychology is not a luxury; it is a necessity. Its about empowering individuals to lead healthier, more fulfilling lives, she said.\n\nDr Farzanas accolades for 2024, including Outstanding Contribution to Mental Health and Excellence in Clinical Psychology, reflect her unwavering commitment to the field.\n\nEach success story, no matter how small, reinforces the importance of this work, she said, highlighting the real-world impact of psychological support on families and communities.In Zimbabwe, misconceptions about mental health abound. Many view psychology as merely\n\nreading minds or believe that mental health issues should be resolved within families without external help.\n\nMental health is as important as physical health; it affects every aspect of our lives. Addressing these misconceptions requires continuous public education, said Dr Farzana.Key challenges remain, including limited access to services and a shortage of trained professionals.\n\nThe economic hardships and societal pressures we face exacerbate these challenges, she acknowledged. Yet, through culturally sensitive interventions and community engagement, Dr Farzana is paving the way for a brighter future.\n\nAt Gateway Mental Health Rehabilitation, Dr Farzana has introduced community programmes, awareness campaigns and training workshops to empower the next generation of psychologists.She encouraged aspiring psychologists to pursue their education and training in Zimbabwe.\n\nI envision a future where mental health services are fully integrated into the healthcare system, accessible to all, she said.\n\nFollow your passion and remain committed to learning. Seek mentorship, gain practical experience and never stop advocating for the importance of mental health.Zimbabweans can play an active role in transforming the mental health landscape by participating in awareness campaigns and supporting initiatives that advocate for mental health services.\n\nEvery effort counts. Whether its through volunteering, financial support, or simply spreading awareness, we can all contribute to this vital cause, said Dr Farzana.\n\nHer journey exemplifies the limitless potential within Zimbabwes psychological landscape. Her story is not just about personal success; it is about opening doors for future generations in a field that is often underestimated.\n\nThere is life in psychology in Zimbabwe and together we can build a future where mental health is prioritised and cherished, she said.\n\nMental health is not a sign of weakness but a step toward strength and well-being. Let us work together to make psychology a cornerstone of our society, she added.In a world yearning for mental health advocates, the message is clear: with dedication, resilience and a commitment to service, Zimbabwe can rise to meet its mental health challenges, creating a brighter future for all.  @TeamKarubwa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gddyu90hgfhdhigf.jpg",
            "description": "Blessing Karubwa, teamkarubwa@gmail.com IN a world where mental health is often overshadowed by physical health, Dr Naeem Farzana stands as a beacon of hope in Zimbabwe. A proud mother of two and a trailblazer in the field of psychology, she has dedicated her career to advancing mental health services in a country where the need […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "Mliswa concedes defeat, Zifa elections to proceed",
            "url": "https://www.chronicle.co.zw/mliswa-concedes-defeat-zifa-elections-to-proceed/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nZIFA lawyer, Lovemore Madhuku yesterday emerged a relieved man after one of the two court bids to stop this weeks watershed election ended in his clients favour, when aggrieved presidential aspirant Temba Mliswa withdrew his urgent court interdict.\n\nMadhuku, who was hired by Zifa last week to deal with the thorny court challenges raised by Mliswa and another disqualified candidate, Walter Magaya, successfully argued that the matter brought before Justice Chitapi yesterday was not urgent.\n\nMliswa and Magaya have been seeking a postponement of the elections set to be held at the Rainbow Towers in Harare this Saturday.\n\nWalter Magaya\n\nDespite yesterdays victory, Zifa will be back at the High Court again tomorrow where Justice Chitapi is expected to give a determination on the challenge by Magaya, who claims he was unfairly disqualified for not attaching his O-level certificate in his nomination papers.\n\nBut Madhuku, who was flanked by long-serving Zifa lawyer,Chenaimoyo Gumiro, during the three-hour marathon proceedings yesterday, was elated, one hurdle had been cleared. This was after Mliswa and his counsel conceded they had filed their review application out of time.\n\nMliswa was challenging the election process as well as the validity and legitimacy of the new Zifa statutes adopted by Congress last October. The urgent review application was supposed to be filed within eight weeks, according to the statutes but the applicant deposited their papers after 11 weeks.\n\nAfter some three hours of argument, we were able to reach a position where Mliswa through his legal counsel conceded that the review application was out of time, which then makes the urgent chamber application not founded on that, said Madhuku.\n\nProfessor Lovemore Madhuku\n\nFor us Zifa, we are happy that at least one challenge is out of the way and that the next one will happen in two days, he added, referring to the Magaya case, which is set to be finalised tomorrow.\n\nMliswa and his legal counsel had no choice but to withdraw the urgent application for review after it became clear it was filed outside of the stipulated time frame.\n\nHowever, Justice Chitapi said Mliswa could still pursue the case but as a normal application.\n\nThis application is withdrawn by consent and the applicant will pay the costs of the hearing, said Justice Chitapi.\n\nMliswas lawyer, Musindo Hungwe, conceded their application had missed the accepted time frames.\n\nThe outcome of the matter is that after argument and the issues raised in relation to the timeframe within which the main application for review was filed, it became clear that the application was filed a bit out of time, and we have made a confession to that effect, he said.\n\nGiven that concession and the need for condemnation in that aspect, we have considered that this present application be withdrawn. So, effectively, we have withdrawn the application, a decision, which has been accepted by the respondents. So that is the status of the case.\n\nMliswa, who is among the five candidates that were disqualified by the Zifa Electoral Committee after falling short of the associations eligibility criteria, conceded the urgent application had fallen away. To me, its fair. The facts are there. We were out of time, figures dont lie, said Mliswa.\n\nOne of the greatest things about life is that when you have been outdone, you must concede. My lawyer remains my lawyer, hes a great lawyer, but there were some technicalities, which came through, which we didnt expect.\n\nAs a result, I had to make a decision. The judge asked my lawyer and myself to go out and talk in terms of the way forward.\n\nHowever, the former Norton legislator vowed to continue pursuing the merits of the case in the courts.\n\nMliswa is arguing that the Zifa Congress that amended the constitution had no mandate to do that since their term of office had expired in 2022.\n\nAs a result, he is seeking the nullification of all the electoral processes as well as all resolutions passed at the October 18 Congress, including but not limited to the nullification of the resolution to adopt the current Amended Zifa Constitution. This fight is not about me, its not about you, its about football, Mliswa said yesterday.\n\nBut even if you know the elections are bigger, Ive entrusted whoever is coming in to be the (Zifa) president to ensure that they regularise (the constitution). That Ill repeat, they regularise. So, the main application remains. This was an urgent application for an interdict. The main application remains Football has won, no one has lost, said Mliswa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/HHHHHHHHHHHHHHHHHHHHHHHH.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub ZIFA lawyer, Lovemore Madhuku yesterday emerged a relieved man after one of the two court bids to stop this week’s watershed election ended in his clients’ favour, when aggrieved presidential aspirant Temba Mliswa withdrew his urgent court interdict. Madhuku, who was hired by Zifa last week to deal with the […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        },
        {
            "title": "Duo gets two years for border theft",
            "url": "https://www.chronicle.co.zw/duo-gets-two-years-for-border-theft/",
            "content": "Thupeyo Muleya,[emailprotected]TWO men suspected to be part of gangs that steal goods from vehicles at the Beitbridge Border Post have each been sentenced to two years in jail.\n\nMelusi Sibanda (25) and Tafadzwa Shara (44) were convicted on their own pleas of guilty to theft and violating the Protected Places and Areas Act, by Beitbridge magistrate, Mr Mbonisi Kaweni.On the theft charge, the two men were each sentenced to 12 months in jail. However, five months of the sentence were suspended for five years on condition that they do not during the period commit a similar offence.\n\nAn additional one month was suspended on condition of restitution, leaving them with six months to serve.\n\nFor violating the Protected Places and Areas Act, they were sentenced to another 12 months in jail, with five months conditionally suspended for five years. This left them with seven effective months.Mr Kaweni ordered the sentences to run concurrently, meaning the men will serve an effective seven months in jail.\n\nThe prosecutor, Mr Ronald Mugwagwa, told the court that last Friday, at around 6am, the complainant left her goods at the commercial freight veranda under the instruction of security guards while completing border formalities.\n\nDuring this time, Sibanda and Shara, along with an accomplice identified only as Doshto, who is still at large, stole two grey suitcases containing 80 satchels and 72 sunglasses worth ZWG8 695.Their luck ran out when private security guards apprehended them at the border, leading to the recovery of 65 satchels and 60 sunglasses valued at ZiG7 094.\n\nThe matter was reported to the police, leading to the pairs arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/08/court-gavel-2-680x380.jpg",
            "description": "Thupeyo Muleya, thupeyo.muleya@zimpapers.co.zw TWO men suspected to be part of gangs that steal goods from vehicles at the Beitbridge Border Post have each been sentenced to two years in jail. Melusi Sibanda (25) and Tafadzwa Shara (44) were convicted on their own pleas of guilty to theft and violating the Protected Places and Areas Act, […]",
            "time": "08:26",
            "date": "22 Jan 2025"
        }
    ]
}