{
    "news": [
        {
            "title": "President mourns  Namibia’s founding leader",
            "url": "https://www.chronicle.co.zw/president-mourns-namibias-founding-leader/",
            "content": "Mashudu Netsianda,[emailprotected]\n\nPRESIDENT Mnangagwa yesterday joined other regional leaders in mourning Namibias founding leader, Dr Sam Nujoma, who died on Saturday, describing him as a towering figure of liberation whose legacy will continue to inspire generations across the African continent.\n\nIn a statement, the President hailed Dr Nujomas unwavering dedication to the liberation of Namibia and his commitment to the unity of the Southern African Development Community (SADC).\n\nWe hurt and grieve deeply at the passing on of this gallant freedom fighter and visionary icon who led and delivered Independence and nationhood to the Namibian people, said President Mnangagwa.\n\nZimbabwe and Namibia share strong historical ties, dating back to the liberation struggles of both nations.\n\nPresident Mnangagwa acknowledged Dr Nujomas steadfast support for Zimbabwe, particularly during the Land Reform Programme, when he stood by Harare despite international pressure.\n\nZimbabwe will always remember and cherish Dr Nujomas principled and unconditional support as our nation faced concerted onslaught by vindictive countries of the West, he said.\n\nPresident Mnangagwa said Dr Nujomas legacy was that of a true Pan-Africanist, who championed the independence and sovereignty of African nations and that Africa must remain vigilant against new challenges of resource-induced encroachments.\n\nDr Nujomas demise comes after the death in office of former Namibia President Dr Hage Geingob on February 4 last year, compounding the nations grief.\n\nPresident Mnangagwa expressed solidarity with the Namibian people during this difficult period.\n\nI have no doubt that these repeated tragic losses do not just test your nation; rather, they spur all Namibians on, as they rally together in even greater and stronger unity to move your nation forward, he said.\n\nOn behalf of Government, the ruling Zanu-PF party and the people of Zimbabwe, President Mnangagwa extended his deepest, heartfelt condolences to Namibian President Dr Nangolo Mbumba, the SWAPO party, the Namibian Government and the Nujoma family.\n\nThe revolutionary leader, who guided Namibia to independence from apartheid South Africa in 1990 and served as its first president for 15 years, died at the age of 95.South Africas President Cyril Ramaphosa said the former Namibian president was an\n\nextraordinary freedom fighter who played a leading role in not only his countrys fight against colonialism, but also in the campaign that led to the end of white-minority rule in South Africa in 1994.\n\nPresident Nujomas leadership of a free Namibia laid the foundation for the solidarity and partnership our two countries share today  a partnership we will continue to deepen as neighbours and friends, he said.\n\nThe late former Namibian president Sam Nujoma.\n\nKenyas President William Ruto said Nujoma was a visionary leader who dedicated his life to the liberation and development of his country.\n\nWe stand in solidarity with the people of Namibia in mourning the passing of their founding President Dr Sam Nujoma. President Nujoma was a selfless, courageous and visionary leader who dedicated his life to the liberation and development of his country, he said.\n\nOur thoughts and love are with the family and the people of Namibia at this time of grief. Rest in peace, Africas hero!\n\nZambian President Hakainde Hichilema posted on his X page: Deeply saddened by the passing of Dr Sam Nujoma  freedom fighter, nationalist, Pan-Africanist, and founding President of Namibia. His legacy will live on forever.\n\nDr Nujoma was the founding leader of the South West Africa Peoples Organisation (SWAPO), which spearheaded Namibias fight for freedom. His leadership and vision played a pivotal role in shaping modern Namibia and advancing the cause of Pan-Africanism.\n\nDr Nujoma was born on 12 May 1929, in a village in northwestern Namibia when his country was under South African administration. South Africa had controlled Namibia since World War One after a brutal few decades of German colonial rule, remembered for the genocide of the Herero and Nama people.\n\nAs a boy, he looked after his familys cattle and attended a Finnish mission school, before moving to the coastal town of Walvis Bay and then the capital, Windhoek, where he worked for South African Railways, according to a biography posted on the website of Dr Nujomas charitable foundation.\n\nDr Nujoma left his job at the railways to focus his energies on bringing down the apartheid system. In the late 1950s, he became leader of the Owambo Peoples Organisation, a precursor to the liberation movement SWAPO, organising resistance to the forced relocation of Black people in Windhoek, which culminated in the police killing 12 unarmed people and wounding dozens more.\n\nDr Nujoma was charged with organising the resistance and arrested. In 1960, he went into exile. He travelled across Africa before reaching the United States, where he petitioned the United Nations for Namibias independence.\n\nMade SWAPO leader in absentia, Dr Nujoma established its armed wing and in 1966 launched a guerrilla war against the apartheid government.\n\nIt took more than a decade of pressure from Dr Nujoma and others before a UN Security Council resolution in 1978 proposed a ceasefire and elections, and another decade for the ceasefire deal to be signed and elections to be held in late 1989.\n\nDr Nujoma was the last of a generation of African leaders who brought their countries out of colonial or white minority rule, including the late former President Robert Mugabe, South Africas Nelson Mandela, Zambias Kenneth Kaunda, Tanzanias Julius Nyerere, and Mozambiques Samora Machel.\n\nDr Nujoma spent nearly 30 years in exile as the leader of Namibias independence movement before returning for Parliamentary elections in late 1989, the first democratic vote in the country.\n\nHe was elected president by lawmakers months later in 1990 as Namibias independence was confirmed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/President-Mnangagwa-right-shakes-hands-with-the-late-former-Namibian-president-Sam-Nujoma-in-this-file-photo-680x380.jpg",
            "description": "Mashudu Netsianda, mashudu.netsianda@chronicle.co.zw PRESIDENT Mnangagwa yesterday joined other regional leaders in mourning Namibia’s founding leader, Dr Sam Nujoma, who died on Saturday, describing him as a towering figure of liberation whose legacy will continue to inspire generations across the African continent. In a statement, the President hailed Dr Nujoma’s unwavering dedication to the liberation of […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "Schools shortage hits Cowdray Park",
            "url": "https://www.chronicle.co.zw/schools-shortage-hits-cowdray-park/",
            "content": "Raymond Jaravazam,[emailprotected]\n\nCOWDRAY Park, one of Bulawayos largest and fastest-growing suburbs, is grappling with a severe shortage of schools, clinics, and other essential amenities.\n\nWhile the suburbs population continues to expand rapidly, infrastructure development has failed to keep pace with the growing demand.\n\nAccording to the 2022 Population and Housing Census, Cowdray Park is home to 75 000 residents, spread across more than 27 000 stands, including residential, commercial, and industrial zones.\n\nYet, as the number of houses rises daily, residents are left facing major challenges in accessing basic services, including education.\n\nDespite being the citys largest suburb, Cowdray Park only boasts three secondary schools, comprising the Government-run Cowdray Park Secondary School and two privately owned institutions.\n\nThis scarcity of educational facilities forces many parents to send their children to schools in nearby areas like Luveve, Emakhandeni, or even the city centre  locations that are often miles away from their homes.\n\nIn the Hlalani Kuhle/Garikai area, a makeshift secondary school  Onxy Academy  has emerged to fill the gap. The school, constructed with walls made from metal sheets, currently enrols over 100 students.\n\nSince opening its doors in January 2024, Onxy Academy has become the only educational institution serving the western part of Cowdray Park, known as Esgodweni. The school offers a range of subjects but lacks practical classes like Agriculture, Woodwork, Metalwork, Food and Nutrition, and Fashion and Fabrics.\n\nWe are the only school in this part of the suburb, and our vision is to provide quality education and adequately prepare students for public exams. We opened in January 2024 with an enrolment of just over 100 learners, said Mr Elton Tofa, the school principal.\n\nOur long-term goal is to develop the school into a fully-fledged institution, complete with science blocks, workshops, and sports facilities.\n\nThe schools current infrastructure is modest, and it relies on a staff of just seven educators to manage the diverse needs of its students. Despite these limitations, Onxy Academy has become a lifeline for many families, especially for students like Sipho, a Form Four learner.\n\nSipho, who resides at the far end of Cowdray Park, shared his experience:\n\nIts not easy to get a place at Cowdray Park Secondary School because its always full, and my parents cannot afford to send me to a school in the city centre. Im grateful for Onxy Academy because its close to my home, and many of my friends are here.\n\nLocal resident Orlando Mlilo expressed concern over the lack of sufficient educational options in the area.\n\nCowdray Park is growing at an alarming rate, but the construction of schools is not keeping up. Two years ago, I tried to enrol my son at Luveve High, but they told me that the school only accepts children from the local area, he said.\n\nAccording to 2023 statistics from the Ministry of Primary and Secondary Education, Zimbabwe has 10 517 schools. Ideally, the ratio of schools to population in the country should be about one school for every 1 500 people, based on a 95 percent gross enrolment rate in primary education and a national population of 15 million.\n\nHowever, Cowdray Parks rapid expansion has left the suburb with a severe shortage of secondary schools.\n\nWard 28 Councillor Ntandoyenkosi Ndlovu highlighted the urgency of the situation, particularly during the rainy season when mud and poor road conditions make commuting to schools even more difficult.\n\nThe situation becomes even worse in the rainy season, when learners from the far end of the suburb must walk long distances to Cowdray Park Secondary.\n\nNot all parents can afford to send their children to private schools in the area, so its critical for the government to expedite the construction of additional secondary schools, said Clr Ndlovu.\n\nWith a population of 75 000, Cowdray Park is now the second most populous urban ward in Zimbabwe, after Harares Budiriro, which has over 89 000 residents.\n\nThe suburbs population is larger than that of towns like Gwanda (27 000 residents) and Hwange (40 000 residents). As the population continues to grow, the demand for essential services like education, healthcare, and shopping facilities becomes increasingly urgent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Onxy-Academy-in-Cowdray-Park.jpg",
            "description": "Raymond Jaravazam, raymondjaravaza@gmail.com COWDRAY Park, one of Bulawayo’s largest and fastest-growing suburbs, is grappling with a severe shortage of schools, clinics, and other essential amenities. While the suburb’s population continues to expand rapidly, infrastructure development has failed to keep pace with the growing demand. According to the 2022 Population and Housing Census, Cowdray Park is […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "SADC-EAC Defence chiefs roped in to end DRC conflict",
            "url": "https://www.chronicle.co.zw/sadc-eac-defence-chiefs-roped-in-to-end-drc-conflict/",
            "content": "Fungi Kwaramba recently in DAR ES SALAAM, Tanzania\n\nChiefs of Defence Forces (CDFs) from SADC and the East Africa Community (EAC) have been given five days to provide technical direction that will ensure immediate ceasefire enforcement in the Democratic Republic of Congo (DRC), facilitate humanitarian aid and develop a security plan for Goma and surrounding areas.\n\nAt the same time, African countries that were backing rebels in the DRC were also directed to immediately leave to give the people of the vast and resource-endowed nation a chance to live in sustainable peace.\n\nSpeaking to journalists upon his return from the joint SADC-EAC summit on Saturday night, President Mnangagwa said the meeting underscored the need for regional co-operation in addressing insecurity in the eastern parts of DRC.\n\nHe said the two blocs had resolved that no individual country should support armed groups responsible for conflict and displacement in the region.\n\nThe summit, co-chaired by President Mnangagwa in his capacity as SADC chairperson and Kenyan President William Ruto as EAC chairperson, focused on strategies to restore peace in the conflict-riddled region.\n\nWell, it was a joint summit of SADC and East African communities and the main issues were the issues of insecurity in the Eastern DRC, said the President.\n\nIt was an attempt by the two blocs  SADC and East African Community  to deal with that in security, trying to find ways where the two blocs can help create peace in that region and identify the parties that are involved in the military contestation in the Eastern DRC.\n\nDespite the complexity of the situation, President Mnangagwa said, consensus was reached that all member States must refrain from supporting or arming any militant groups operating in the region.\n\nOf course, it was very difficult but in the end, it was resolved that all member States should make sure that they do not support groups, armed groups in the region, to cause insecurity on the continent and in that particular area.\n\nOf course, no Member State came forward to say they were supporting an army, but it was very clear that these (rebel) groups were actually allowed to operate from a certain Member State.\n\nIt was agreed that everything must be done to silence the guns, and that they (armed groups) should not be rendered any support by any member State.\n\nIn its communiqu, the joint summit directed that modalities for the withdrawal of uninvited foreign armed forces from the territory of the DRC, be developed and implemented by the two regional bodies top military officials.\n\nThe joint summit reaffirmed solidarity and unwavering commitment to continue supporting the DRC in its pursuit of safeguarding its independence, sovereignty and territorial integrity, as well as sustainable peace, security and development, read the communiqu in part.\n\nThe summit decided that similar consultations shall be convened at least once every year and as and when the need arises to review matters of common interest to the two regions.\n\nApart from that, the summit directed that a joint meeting of ministers of EAC and SADC convenes within the next 30 days to deliberate on:\n\n(a) the report of the joint meeting of CDFs on the ceasefire and cessation of hostilities\n\n(b) establishment of a secretariat-level technical coordination mechanism to monitor implementation of the joint summit decisions\n\n(c) an elaborate road map detailing immediate, medium- and long-term implementation measures, including financing modalities, and address all other residual issues relating to the attainment of sustainable peace and security in the eastern DRC and make appropriate recommendations to the next joint meeting of the EAC-SADC Summit.\n\nThe regional leaders also directed the resumption of direct negotiations with all State and non-State actors, including M23, within the Luanda/Nairobi process framework, while calling for implementation of the Concept of Operations (CONOPS) to neutralise the FDLR and facilitating Rwandas disengagement from the DRC.\n\nSADC and the EAC convened Saturdays joint summit to try and find a lasting solution to the DRC crisis, which has seen rebel groups taking over towns in the eastern parts of the vast country.\n\nApart from SADC Chairman President Mnangagwa, his EAC Counterpart President Ruto, and the host Tanzanian President Samia Suluhu Hassan, there was a huge turnout of regional leaders.\n\nDRCs President Felix Tshisekedi, who accuses Rwanda of backing the rebels in his country, attended the joint summit virtually.\n\nRwandan President Paul Kagame, Ugandan President Yoweri Museveni, South African leader Cyril Ramaphosa, Somalian President Hassan Sheikh Mohamoud and Zambian President Hakainde Hichilema, attended the high-stakes joint summit.\n\nLeaders of Burundi, Angola, Malawi, South Sudan and Madagascar were represented by ministers.\n\nOn Saturday President Mnangagwa told his fellow leaders that Africa must draw from its shared historical solidarity and the unity it used to dismantle colonialism to free the people of the DRC from internecine wars and conflict that undermine development.\n\nAddressing the opening session of the joint summit, President Mnangagwa said Africa should not let the people of DRC down but must, through honest dialogue, find a solution to silence the guns and engender enduring peace in the Great Lakes region.\n\nThe unity, solidarity and unbreakable bonds of the peoples of the continent must stand the test of such trying times, he said.\n\nWe must remain as solidly united as we were during the struggle for the complete emancipation and independence of Africa from colonialism.\n\nWe, thus, have a duty and collective responsibility to comprehensively, frankly, tackle and address the various challenges that are impeding the realisation of peace and security for the people of Eastern DRC.\n\nDrawing from our rich African values and heritage, and further emboldened by the spirit and letter of the United Nations Charter; the Constitutive Act of the African Union as well as the treaties of both SADC and the EAC; let us seize this opportunity to ensure convergence and a coordinated response which is mutually reinforcing towards one common objective.\n\nTowards the ultimate objective of finding last peace in the DRC, President Mnangagwa said talks among regional leaders must always be carried with openness, honesty, flexibility and a commitment to building lasting peace.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/EAC-SADC-summit-on-the-security-situation-in-the-DRC.jpg",
            "description": "Fungi Kwaramba recently in DAR ES SALAAM, Tanzania Chiefs of Defence Forces (CDFs) from SADC and the East Africa Community (EAC) have been given five days to provide technical direction that will ensure immediate ceasefire enforcement in the Democratic Republic of Congo (DRC), facilitate humanitarian aid and develop a security plan for Goma and surrounding […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "The people of DRC deserve lasting peace and security",
            "url": "https://www.chronicle.co.zw/the-people-of-drc-deserve-lasting-peace-and-security/",
            "content": "THE ongoing conflict in the Democratic Republic of Congo (DRC) has cast a long shadow over the Great Lakes region, with devastating consequences for the country and its people.\n\nIn response to this dire situation, Southern African Development Community (SADC) chairperson, President Mnangagwa, called on African leaders to draw on the historical solidarity and unity that helped dismantle colonialism to bring peace to the DRC.\n\nHis remarks, made during the joint summit between SADC and the East African Community (EAC), highlighted the need for a co-ordinated African-led solution to end the violence and instability that have plagued the DRC for decades.\n\nThe DRCs conflict, particularly in the eastern provinces, has created a humanitarian crisis, with millions displaced, many innocent lives lost, and regional instability reaching new heights.\n\nWhile there has been numerous peace initiatives over the years, the violence continues, fuelled by armed groups and foreign involvement.\n\nIn this context, President Mnangagwas call for African unity is more than just rhetoric; it is a reminder of the continents collective power to overcome adversity when its leaders work together for a common cause.Africas history of unity and struggle against colonial rule demonstrates that when African nations come together, they can achieve meaningful change.\n\nSADC Chairperson President Mnangagwa\n\nPresident Mnangagwa underscored this point, urging the continents leaders to work with the same determination to resolve the DRC crisis.\n\nHe called for a joint effort through honest dialogue, focusing on the interests of the people of the DRC.This was the central theme of the summit, where SADC and EAC leaders, including President Flix Tshisekedi of the DRC, acknowledged the gravity of the situation and reaffirmed their commitment to ending the conflict.\n\nThe summit also marked a critical shift in the approach to peace-building in the DRC.The merging of the Luanda and Nairobi peace processes into a single framework for conflict resolution is a significant step forward.\n\nDRC President Felix Tshisekedi\n\nBy combining efforts and resources, the two regional blocs aim to create a more effective and coordinated response to the conflict.\n\nThe summit addressed the need for a collective stance against any external support for armed groups in the region.Leaders were firm in their resolve that no member state should back those responsible for the violence and displacement in the eastern DRC.\n\nThis united approach is crucial, as it sends a clear message to all parties involved that the international community, particularly African leaders, will no longer tolerate the perpetuation of conflict for political or economic gain.\n\nThe people of DRC deserve lasting peace and security,and African leaders must now act with the urgency and solidarity that characterised the liberation movements during the fight for self rule.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/12/Job-cuts-in-UN-mission-in-DRC-upset-local-workers.jpg",
            "description": "THE ongoing conflict in the Democratic Republic of Congo (DRC) has cast a long shadow over the Great Lakes region, with devastating consequences for the country and its people. In response to this dire situation, Southern African Development Community (SADC) chairperson, President Mnangagwa, called on African leaders to draw on the historical solidarity and unity […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "Derek Chisora dominates Otto Wallin, secures victory in final UK fight",
            "url": "https://www.chronicle.co.zw/derek-chisora-dominates-otto-wallin-secures-victory-in-final-uk-fight/",
            "content": "DERECK Chisora stunned Otto Wallin with two knockdowns on his way to a unanimous-decision victory on Saturday in his last fight in the UK.\n\nChisora is set to retire after his next fight, the 50th of his career, and delivered a remarkable performance despite having a cut eye for half of the fight, with the three judges scoring the bout 117-109, 114-112 and 116-110 to the British fighter.\n\nThe 41-year-old is now potentially in line for an eventual world title shot after his fight with Wallin was upgraded earlier this month to an eliminator for the IBF heavyweight title, which is held by Daniel Dubois, who takes on Joseph Parker on February 22, live on Sky Sports Box Office.\n\nWhen I arrived, I said to myself I wont cry but I started crying like a baby (before the fight), said Chisora after the fight.I was in tears because I love the sport and love the fans. I love everything about it, the ups and downs.\n\nIt was a very emotional day for me today. It was very hard. When I got the cut, then something happened in the third round which I didnt tell my trainers, my ears popped, and I said Im going to carry on.\n\nDerek Chisora\n\nWhatever he wants, we will make it happen. We will sit down and make it happen, said his promoter Frank Warren.Hes now won an eliminator for the IBF title and thats Daniel Dubois, so he has that in the bank.\n\nWhatever he wants to do, we will do. Tonight, what a performance. I cant tell you how proud I am of how he fought in there, Otto as well, because it takes two to make a fight.\n\nChisora produced one of his best wins of the 36 in his 18-year career to the delight of the crowd at the Co-op Live Arena in Manchester.\n\nFrom left to right: Dereck Chisora, promoter Frank Warren and Kevin Johnson.  Getty Images\n\nHe came flying out of the blocks, with big swinging shots to Wallins body in the opening rounds and landed a couple of big right hands to the head in the third.\n\nHowever, an apparent clash of heads in the fifth round saw Chisora cut his right eye. In the sixth, blood was continually dripping off the eye, so the referee was forced to momentarily halt the bout.\n\nAfter being checked by the doctors, Chisora did not let up the intensity and unleashed several shots on Wallin in the seventh, before an incredible attack in the eighth with around 30 consecutive swings rocked his opponent.\n\nHe glanced Wallin with a right hand in the ninth to send the Swede tumbling, then tactically drew him into the corner over the rest of the bout to land more blows to the body, including another knockdown in the final round before the bell went. SkysportsNews\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Derek-Chisora.jpg",
            "description": "DERECK Chisora stunned Otto Wallin with two knockdowns on his way to a unanimous-decision victory on Saturday in his last fight in the UK. Chisora is set to retire after his next fight, the 50th of his career, and delivered a remarkable performance despite having a cut eye for half of the fight, with the […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "Bulawayo to host inaugural Annual Competitiveness Summit",
            "url": "https://www.chronicle.co.zw/bulawayo-to-host-inaugural-annual-competitiveness-summit/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nBULAWAYO is set to host the inaugural National Competitiveness Commission (NCC) Annual Competitiveness Summit, scheduled for this month at the Zimbabwe International Exhibition Centre.\n\nAccording to the commission, the high-level gathering will be held from February 19 to 20 2025, with President Mnangagwa expected to officiate.\n\nThe platform is set to provide a dynamic convergence of Government ministries, departments and agencies, captains of industry, think tanks, development partners, NGOs, international partners, local authorities, academia, and State-owned enterprise leadership to engage in dialogue and develop sustainable reforms and resolutions that will improve productivity and competitiveness.\n\nIn a concept note shared with Chronicle, the commission stated that hosting the summit aligns with international best practices, such as the Global Federation of Competitiveness Councils Annual Summit, and supports one of the commissions functions: to provide a platform for dialogue between the public and private sectors, labour, academia, and non-state actors on the subject of competitiveness.\n\nPresident Mnangagwa is expected to officiate at the inaugural National Competitiveness Commission (NCC) Annual Competitiveness Summit\n\nThe event will serve as a powerful tool for building national consensus on enhancing the countrys global competitiveness, fostering collaboration, innovation, and adaptability among stakeholders.\n\nThe summit will provide a platform for robust deliberations on competitiveness gaps and possible areas of policy intervention, said the NCC.\n\nThis will result in the formulation of sustainable reforms to enhance competitiveness, which is critical for attracting both local and foreign investment and boosting industry productivity across all sectors of the economy, thereby increasing confidence in the economy.\n\nHis Excellency, President E.D\n\nThe NCC is a statutory body established by an Act of Parliament (Chapter 14:36) and falls under the purview of the Ministry of Industry and Commerce.\n\nIt is mandated to facilitate the creation of a competitive environment for Zimbabwean businesses through the development and coordination of key policy improvements required for domestic, regional, and global competitiveness, directly contributing to the achievement of Vision 2030.\n\nAccording to the commission, the summits objectives include identifying policy gaps that hinder national competitiveness from the private sectors perspective and developing resolutions and strategies to address these challenges.\n\nIt also aims to unpack the role of local authorities and develop strategies for enhancing competitiveness, raise awareness of the Regulatory Impact Assessment tool, benchmark Zimbabwes performance against other countries, draw lessons to improve competitiveness, and propose key areas of intervention for fostering a competitive business environment.\n\nThe summit resolutions are expected to anchor competitiveness policy interventions by the Government to transform our economy in response to global shocks, said the NCC.\n\nSuccessful implementation of the summit resolutions will contribute to improving the countrys competitiveness, ultimately leading to sustainable economic growth and better living standards for the general populace.\n\nThese aspirations of the summit align with the NDS1 objectives of improving productivity and competitiveness.Deliberations will also include presentations and interactive panel discussions on topics such as innovation, infrastructure, labour productivity, local authorities competitiveness, and standards.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fgrgerf.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com BULAWAYO is set to host the inaugural National Competitiveness Commission (NCC) Annual Competitiveness Summit, scheduled for this month at the Zimbabwe International Exhibition Centre. According to the commission, the high-level gathering will be held from February 19 to 20 2025, with President Mnangagwa expected to officiate. The platform is set to provide […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "Busi Mhlanga embraces calling in latest offering",
            "url": "https://www.chronicle.co.zw/busi-mhlanga-embraces-calling-in-latest-offering/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nUnited Kingdom-based musician Busi Mhlanga has released a new album titled Ubizo Lwami, a personal project reflecting her calling as a creative artiste.\n\nProduced by Trust Samende, DJ Ntu2Kay, and Pastor Sony Ncube, the 12-track album features songs Bhubesi, Nkonkoni, Banu Bakaloyiwa, Mzilikazi, Khuluma, Roma Nna, Isavunguzane, Ingqobe (featuring Obert Dube and Albert Nyathi, and My Circles.Hailing from Gwelutshena in Nkayi, the musician who blends traditional and gospel music said the album holds a special place in her heart, as it embodies her true essence.\n\nUbizo Lwami means my dynamic calling. Music and performing arts are more than just a passion for me  they are my calling. I cant live without them; Id go mad. Im grateful to do what God has called me to do and give Him all the honour, she said.\n\nAlbert Nyathi\n\nShe also acknowledged her ancestors, saying their guidance and presence fulfil her and give her purpose.\n\nIt pushes me to reach out to people, to entertain, spread joy, inspire, teach, and advocate through my music. I believe were all called for different purposes in life, and mine is through song, she added.Mhlanga also shared that the album is deeply connected to her personal and artistic circles.\n\nI always say, I am because of my circles. These include my family, the communities I grew up in, the churches I attended, the schools, my friends, my African heritage, and the world at large as I travel. At the centre of it all is God, my biggest circle.\n\nHer unique musical style is deeply rooted in her upbringing, influenced by her grandfather, who was a traditional healer. She grew up singing with her family during ceremonies and celebrations, where she would imitate the singing and dancing of her elders.\n\nShe described how each song carries a spiritual story, citing Isavunguzane as an example.That song is about the whirlwind. I had a mysterious and divine encounter with a whirlwind, which inspired the track.The musician, a former Black Umfolosi dancer and ex-Albert Nyathi lead vocalist is planning a live album launch in April, which will include a full video recording of the performance.\n\nIll also select a few songs for official music videos. Some exciting collaborations with other artistes are on the way, so people should keep an eye out!\n\nBusi Mhlanga\n\nShe praised the dedication of her production team, particularly Trust Samende.We worked tirelessly, with many sleepless nights and busy days. Trust is an incredibly talented, calm, and collected producer who understood the vision from the beginning. Since we live in different parts of the world, I would record song ideas on my phone, send them to him, and hed create the beats.\n\nI recorded the vocals in London with Ghanaian producer Kobby from Kingsbeat before sending them back to Trust for final production. We were on the phone every day for four months!\n\nOther contributions came from Pastor Sony Ncube in Birmingham, where Mhlanga travelled for recording sessions. His wife, Rue, provided backup vocals on four songs.\n\nDJ Ntu2Kay from Bulawayo also contributed beats to Bhubesi and Igidelamphakathi. Im grateful for his work, she said.A standout collaboration on the album is Ingqobe, featuring legendary poets Albert Nyathi and Obert Dube.\n\nAlbert Nyathi is someone I deeply respect. I was the lead vocalist of Albert Nyathi & Imbongi for five years and learnt so much from him. It was a marvel to work with these poetic gems, she said.\n\nMhlanga, the leader of the Shosholoza band, has performed at major festivals such as WOMAD in England and has been featured on BBC shows. She also performed in honour of the late South African leader Nelson Mandela in London at one point.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Busi-Mhlanga.jpg",
            "description": "Mthabisi Tshuma, revmthiretshuma@gmail.com United Kingdom-based musician Busi Mhlanga has released a new album titled Ubizo Lwami, a personal project reflecting her calling as a creative artiste. Produced by Trust Samende, DJ Ntu2Kay, and Pastor Sony Ncube, the 12-track album features songs Bhubesi, Nkonkoni, Banu Bakaloyiwa, Mzilikazi, Khuluma, Roma Nna, Isavunguzane, Ingqobe (featuring Obert Dube and […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "ZimTrade empowers SMEs, women for export growth",
            "url": "https://www.chronicle.co.zw/zimtrade-empowers-smes-women-for-export-growth/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nTHE trade promotion and development agency, ZimTrade, says there is vast potential to drive export growth through small to medium enterprises (SMEs) and has pledged to work closely with them to enhance their export readiness.\n\nZimTrade has already introduced initiatives to support SME exporters and women-led businesses through various training programmes.\n\nIn its latest monthly newsletter, the agency highlighted several initiatives aimed at promoting inclusivity and providing vital support to SMEs and women in order to boost Zimbabwes export sector.\n\nZimTrade acknowledges the pivotal role of SMEs in Zimbabwes economy and their vast, untapped potential to propel export growth. We are committed to empowering these businesses for global success, said ZimTrade.\n\nMr Alex Mutandi, ZimTrade export development officer\n\nThe provision of a tailored range of resources and programmes  equipping small businesses with the expertise, tools, and connections necessary to excel in international markets  is a key element in driving exports, the agency said.\n\nIt noted that the comprehensive programmes cover topics such as market research, export documentation, logistics, and international marketing strategies.\n\nAccording to ZimTrade, export training programmes form the cornerstone of its support system, providing Zimbabwean businesses with the skills needed to succeed in international markets.\n\nMoreover, to bridge the gap in market access, the agency stated that it has established a robust network of market linkage platforms.\n\nWhile training and funding are essential, ZimTrade recognises that access to key markets and partners is equally crucial, it said.\n\nZimTrade chief executive officer Allan Majuru\n\nThese platforms facilitate connections between businesses and potential buyers, suppliers, and partners through strategic initiatives aimed at empowering women and transforming trade.\n\nThrough its Next She Exporter programme, which targets women-led businesses, and the Eagles Nest Incubator programme, which focuses on youth-led businesses, ZimTrade has assisted many SMEs in recent years with marketing, branding, and packaging  enhancing their brand visibility in both local and regional markets.\n\nIt also offers SMEs opportunities to exhibit at various international trade shows, including the Zimbabwe International Trade Fair (ZITF) and the Global Expo Botswana, among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/zimtrade-647x380.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com THE trade promotion and development agency, ZimTrade, says there is vast potential to drive export growth through small to medium enterprises (SMEs) and has pledged to work closely with them to enhance their export readiness. ZimTrade has already introduced initiatives to support SME exporters and women-led businesses through various training programmes. […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "Keegan Shutt in Stunning Comeback. . . finishes second at Africa Amateur Championship",
            "url": "https://www.chronicle.co.zw/keegan-shutt-in-stunning-comeback-finishes-second-at-africa-amateur-championship/",
            "content": "Brandon Moyo,[emailprotected]\n\nKEEGAN Shutt produced a stunning comeback to finish second at the Africa Amateur Championship, which concluded at Leopard Creek in South Africa on Saturday.\n\nThe 18-year-old ended the tournament just two shots behind the winner, Bryan Newman of South Africa.Shutt, who finished on six-under-par 282, mounted a late charge towards the eventual winner, Newman, who posted eight-under-par 280.\n\nThe final round began with the Zimbabwean teenager in fifth place, following an impressive third-round performance in which he shot six-under-par 66. At that stage, he trailed Newman by four strokes.\n\nShutt carded a solid three-under-par 69 in the final round on Saturday.He birdied the par-three fifth hole and the par-four sixth hole on his front nine. However, a triple-bogey on the par-three seventh hole, where he took six strokes, briefly derailed his progress.\n\nOn the back nine, Shutt regained momentum with birdies at the par-four 10th hole, the par-five 13th hole, the par-five 15th hole, and the par-three 16th hole. His putting was sharp, and he finished the round with a strong showing on the greens.\n\nSpeaking after the tournament, Shutt admitted to feeling disappointed, particularly about the triple-bogey on the seventh hole, which he felt was where he lost the title.\n\nNevertheless, he expressed overall satisfaction with his performance in the final two rounds and congratulated Newman on his victory.\n\nKeegan Shutt\n\nA little bit of disappointment. I dont think Im going to forget that triple on the seventh for a while. I think thats where I lost it today. Im very happy with the way I fought back these last two days. I think I played very good golf.\n\nWell done to Bryan. I tried to make a late charge on him. I came in with some birdies, but he managed to hold it together and finished strong. Really well done to him, said Shutt.\n\nShutt began the tournament with a two-over-par 74, followed by a one-over-par 73 in the second round. In the third, he produced an excellent six-under-par 66 and then completed the event with a three-under-par 69 in the final round.\n\nDespite his impressive performance, Shutt missed out on an exemption into The 153rd Open at Royal Portrush, as well as spots in The Amateur Championship, the Alfred Dunhill Championship, The Investec South African Open, and the Waterfall City Tournament of Champions powered by Attacq.\n\nTanaka Chatora\n\nFellow Zimbabwean Tanaka Chatora finished tied for 16th on eight-over-par 296. Chatora began the competition with an outstanding seven-under-par 65 in the first round but followed it with a three-over-par 75 in the second.\n\nHe then shot five-over-par 77 in the third round and concluded with a seven-over-par 77 in the final round.Michael Wallace finished in 28th place with a score of 19-over-par 307, posting round scores of 75, 82, 70, and 80. He was one stroke ahead of Darlington Chikanyambidze, who tied for 29th with a gross of 20-over-par 308, with round scores of 75, 79, 80, and 74.\n\nIn the Africa Amateur Womens Invitational, which concluded on Friday, Danielle Bekker secured 9th place with a score of 23-over-par 239.\n\nHer round scores were 78, 80, and 81, finishing one stroke ahead of Miriam Masiya, who ended in 10th place with 24-over-par 240 (round scores of 80, 81, and 79).\n\nThe third Zimbabwean female player, Primrose, finished tied for 18th with a score of 49-over-par 265, carding rounds of 86, 85, and 94.\n\nSet against the breathtaking backdrop of Kruger National Park, the Africa Amateur Championship provides a world-class platform for emerging talent in the region to showcase their skills on the international stage.\n\nThe Africa Amateur Championship and Africa Amateur Womens Invitational, developed by The R&A, aim to nurture talent and offer a pathway for the continents top amateur golfers to progress onto the global scene.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Keegan-Shutt.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com KEEGAN Shutt produced a stunning comeback to finish second at the Africa Amateur Championship, which concluded at Leopard Creek in South Africa on Saturday. The 18-year-old ended the tournament just two shots behind the winner, Bryan Newman of South Africa. Shutt, who finished on six-under-par 282, mounted a late charge towards the […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        },
        {
            "title": "Veteran model shares industry insights in book",
            "url": "https://www.chronicle.co.zw/veteran-model-shares-industry-insights-in-book/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nLOCAL professional male model, Francis Kampira is set to launch a quartet of fashion-themed books in Bulawayo on February 21.\n\nOn that day, Kampira will unveil, How to become a professional model, How Beauty pageants work, How to become a child model, and How to answer pageants questions and answers session, a book he co-authored with beauty queen Ayanda C Sibanda.\n\nWith over a decade of modelling experience, Kampira, who is also the President and founder of Zimbabwe Professional Models Association told Chronicle Showbiz that being able to pull the launch off is akin to a labour of love.\n\nLaunching four books at once is surreal and exhilarating. Its a dream come true. Its the culmination of years of hard work, dedication and passion. Im thrilled to share my experiences and knowledge with the world, he said.\n\nFrancisco Kampiras How to become a child model book\n\nOn what the quartet of titles are about, Kampira said, The overall message behind these titles is giving models the message to believe in themselves, and their unique qualities. Also, the books articulate the idea of working hard, staying focused and persevering through challenges. They serve as a guide to being a professional, respectful, and kind model qualities essential in the industry. The books cater to various types of models and age groups.\n\nOver the years, Kampira shared that he has learnt valuable lessons, including the importance of resilience and perseverance in overcoming rejection and criticism, and the necessity of self-care and mental health for maintaining a positive mindset. He has also learnt the power of networking and building genuine relationships to unlock new opportunities, and the need for continuous learning and self-improvement to stay ahead in the industry.\n\nFrancisco Kampira book cover\n\nKampira highlighted that collaboration was an integral part of this project.\n\nWorking with Ayanda on How to answer pageants questions and answers session was an incredible experience. Ayandas experience and creative vision brought a new level of depth to the project. We worked seamlessly together, pushing each other to produce our best work.\n\nIn his modelling career, Kampira has held several titles including Mr Zimbabwe International 2022, Model of the year at the Roil Bulawayo Arts Award 2023, and the Model of the year Bulawayo Models Awards 2023. He is the Founder of modelling academy, Centre For Models Development.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Francisco-Kampira-1.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com LOCAL professional male model, Francis Kampira is set to launch a quartet of fashion-themed books in Bulawayo on February 21. On that day, Kampira will unveil, How to become a professional model, How Beauty pageants work, How to become a child model, and How to answer pageants questions and answers session, a […]",
            "time": "06:40",
            "date": "10 Feb 2025"
        }
    ]
}