{
    "news": [
        {
            "title": "Concern over year-old Burnside water leak l Residents decry Council inaction amid crippling water shedding",
            "url": "https://www.chronicle.co.zw/concern-over-year-old-burnside-water-leak-l-residents-decry-council-inaction-amid-crippling-water-shedding/",
            "content": "Raymond Jaravaza ,[emailprotected]\n\nAS Bulawayo residents endure a gruelling 170-hour water-shedding schedule due to dwindling dam levels amid an El Nio-induced drought, a suspected water leak at the Criterion Water Works in Burnside suburb has been wasting vast quantities of water for over a year.\n\nResidents of Burnside accuse Bulawayo City Council (BCC) of failing to address the persistent leak, which has turned into a lucrative opportunity for some individuals and companies.\n\nConstruction firms and residents from Burnside and Douglasdale are reportedly capitalising on the situation, with some selling the leaked water to farmers.\n\nChronicle crews observed private water bowsers collecting water from a stream formed by the leak yesterday.\n\nOne bowser, emblazoned with the name of a local bulk water supplier, had a capacity of 10 000 litres. Another belonged to a construction company that builds low-cost homes in suburbs such as Pelandaba West and Mbundane.\n\nA driver of one of the bowsers revealed that the collected water is sold to peri-urban farmers in areas like Kensington and Douglasdale, whose boreholes have dried up due to the drought.\n\nThe farmers use the water for their cattle and farming activities. As long as its not contaminated by sewage, its suitable for livestock, he said.\n\nHe also mentioned that chicken breeders, who manage thousands of birds, rely on this bulk water for their operations but declined to disclose the price for a 10000-litre tank.\n\nIn addition to commercial use, the leaked water is being utilised by residents.The news crew observed three young girls fetching water from the stream.\n\nOur home is far from here, but we come twice a day to collect water for drinking and cooking. Our mother boils it before storing it in 5-litre bottles, one of the girls explained.\n\nHowever, it was unclear whether the water was treated or raw, raising concerns about its safety.The BCCs communications department had not responded to inquiries by the time of publication.\n\nThe continued wastage of water comes at a time when residents are grappling with severe shortages, with many resorting to unsafe sources for their daily needs. The citys water supply has been under strain for years due to factors such as population growth, climate change, and poor resource management.\n\nIn September, the Upper Ncema Dam was decommissioned after reaching a critical level of 2,08 percent.It was the second dam to be shut down following the decommissioning of the Umzingwane Dam in November 2023.\n\nA recent survey revealed that residents in suburbs like Old Lobengula have been using water from leaking pipes for drinking and household chores.\n\nMs Mulape Mbela, a mother of two, expressed her frustration.\n\nWe havent had tap water for almost a month. We are forced to fetch water from a burst pipe, even though it poses health risks. Boiling water is difficult because of frequent power cuts, so most people use it without taking precautions, she said.\n\nMr Ricky Mafu voiced fears of a potential cholera outbreak, noting that residents often use unclean containers to fetch water from communal boreholes.\n\nMany people bring dirty buckets to collect water, and this compromises the safety of a shared resource, he said.Bulawayo Progressive Residents Association (BPRA) executive director, Mrs Permanent Ngoma, said some suburbs have gone for weeks without running water.\n\nThe decommissioning of dams further exacerbates the water availability challenge.The situation is really bad as some areas go up to three weeks without tap water. We have engaged the council to frequently provide water bowsers, she said.\n\nAccording to a recent council report, the decommissioning of Upper Ncema in September and Lower Ncema in November has reduced the daily water abstraction capacity to 93 megalitres, sourced from Insiza, Inyankuni, Mtshabezi, and Nyamandlovu dams.\n\nAs the rainy season approaches in December, stringent measures are required, including a 170-hour water-shedding schedule.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/xczzzzzzzzzzzzzzzz.jpg",
            "description": "Raymond Jaravaza , raymondjaravaza@gmail.com AS Bulawayo residents endure a gruelling 170-hour water-shedding schedule due to dwindling dam levels amid an El Niño-induced drought, a suspected water leak at the Criterion Water Works in Burnside suburb has been wasting vast quantities of water for over a year. Residents of Burnside accuse Bulawayo City Council (BCC) of […]",
            "time": "2024-12-12 01:29:44"
        },
        {
            "title": "President to commission Shurugwi- Mhandamabwe Road",
            "url": "https://www.chronicle.co.zw/president-to-commission-shurugwi-mhandamabwe-road/",
            "content": "Patrick Chitumba,[emailprotected]\n\nPRESIDENT Mnangagwa is today set to commission the US$41 million newly rehabilitated 43km Shurugwi-Mhandamabwe Road at the Mukandapi Business Centre in Shurugwi, Midlands Province.\n\nThis critical infrastructure project will boost connectivity, facilitate trade, and stimulate economic growth in the region, ultimately enhancing the living standards of the local community.\n\nThis initiative is part of the Governments broader plan to enhance key infrastructure in line with the Second Republics National Development Strategy One (NDS1).\n\nUnder the Second Republic, the Government is prioritising economic development and growth.The projects completion is expected to create jobs, stimulate business growth, and improve accessibility, making it a vital catalyst for increased transport movement along the southern corridor.\n\nThe Shurugwi-Mhandamabwe road is a vital infrastructure project that will significantly enhance connectivity, trade, and economic growth in Zimbabwe and the Southern African Development Community (Sadc) region.\n\nAs Sadc Chairman, President Mnangagwas commitment to regional development and cooperation is evident in this initiative, which will not only benefit Zimbabwe but also contribute to the regions economic integration and growth.\n\nThe road serves as a crucial link between Beitbridge Border Post and major towns like Gweru, Kwekwe, and Chinhoyi, facilitating trade and commerce.\n\nThe roads connection between the Midlands and Masvingo provinces demonstrates the Governments progress in developing its road infrastructure, benefiting motorists and downstream businesses along the highway.\n\nThe poor condition of the Shurugwi-Mhandamabwe road had led to motorists diverting through Zvishavane town, negatively impacting local businesses.\n\nHowever, the Government intervened by partnering with Road Trackers Construction (RTC) to rehabilitate the road.The project involved upgrading, widening, and constructing the road, which is a vital link between Beitbridge Border Post and major towns like Gweru, Kwekwe, Chegutu, Kadoma, Chinhoyi, Karoi, and Chirundu Border Post.\n\nThe Midlands community is equally excited about the business opportunities that will be unlocked by the rehabilitation of the highway.\n\nTransport and Infrastructural Development Minister Felix Mhona said President Mnangagwa is delivering on his promise of leaving no one and no place behind in the development agenda.\n\nI am extremely excited that our iconic leader His Excellency the President Cde Dr ED Mnangagwa is living the talk of leaving no one and no place behind. A good road is an economic enabler, and this road tremendously shortens the distance from Beitbridge to Chirundu and vice versa, he said.\n\nMinister Mhona said his ministry will continue with its mandate of ensuring that the countrys major roads are trafficable and navigable.\n\nWe are not only going to end on trunk roads but will also be revisiting other locations so that at the end of the day the road network across the country will be enhanced, he said.\n\nMidlands Provincial Affairs and Devolution Minister Owen Ncube said the rehabilitation of the road marked the commitment by the Second Republic to modernise and industrialise the country in pursuit of an upper-middle-income economy by 2030.\n\nShurugwi-Mhandamabwe Road had become a concern to the leadership, motorists, and Shurugwi residents, but because of a listening President we have, it has been rehabilitated. The reconstruction of the road confirms the New Dispensations development approach of leaving no one and no place behind, he said.\n\nMinister Ncube said the rehabilitation of the Shurugwi-Mhandamabwe Road will help accelerate economic development in the Midlands including contributing to the provincial GDP growth.\n\nAs the shortest and most cost-effective route to international markets via South Africa and Mozambique, the road is crucial for corporates and mining giants operating in the province, he said.Minister Ncube stressed the importance of modernising the countrys road network, saying it is critical in facilitating tourism, trade, and investment.\n\nTo achieve this, Minister Ncube urged local authorities to prioritise infrastructure repair and upgrade, acknowledging the roads strategic importance.\n\nWe are targeting the modernisation of our road network as it is a key economic enabler that facilitates the growth of tourism, trade, and investment. I urge local authorities, in particular, to move with speed to repair and upgrade their infrastructure, he said.\n\nUnder the Infrastructure, Utilities and Digital Economy cluster, Zimbabwes economic blueprint, the NDS 1 prioritises the completion of road rehabilitation projects.\n\nThe main aspirations of NDS1 include infrastructural development as a key enabler in attaining Vision 2030 of having an upper middle-income economy.\n\nNDS 1 notes that a road can become an economy and in this regard, the focus is on the development of feeder roads into communities as a way of developing underdeveloped remote areas.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-at-Varun-1.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw PRESIDENT Mnangagwa is today set to commission the US$41 million newly rehabilitated 43km Shurugwi-Mhandamabwe Road at the Mukandapi Business Centre in Shurugwi, Midlands Province. This critical infrastructure project will boost connectivity, facilitate trade, and stimulate economic growth in the region, ultimately enhancing the living standards of the local community. This initiative is […]",
            "time": "2024-12-12 01:29:44"
        },
        {
            "title": "CPC urges vigilance against deceptive festive promotions",
            "url": "https://www.chronicle.co.zw/cpc-urges-vigilance-against-deceptive-festive-promotions/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Consumer Protection Commission (CPC) has urged consumers to remain vigilant against misrepresentation and deceitful promotions during the festive season.\n\nThe commission also encouraged shoppers to exercise their rights, be cautious and make informed purchasing decisions to avoid falling victim to unscrupulous business practices.\n\nCPC, established under the Consumer Protection Act (Chapter 14:44), aims to safeguard consumers by promoting a transparent and fair marketplace.\n\nThe Act was enacted to protect the consumer of goods and services by ensuring a fair, efficient, sustainable and transparent marketplace for consumers and businesses.\n\nSpeaking to Business Chronicle, CPC chairman Dr Mthokozisi Nkosi emphasised the need for consumers to shop wisely.\n\nWe urge consumers to shop wisely as we go for the festive season. Dont be misled.\n\nBe alert to misrepresentation and deceitful promotions.\n\nAsk for information on prices, quality, warranty, and any pertinent information, he said.\n\nDr Nkosi further cautioned against overspending during the festive season, reminding consumers to prepare for January, which is traditionally a financially challenging month.\n\nCPCs main function is to protect consumers, regulate the accreditation of consumer protection advocacy groups, conduct alternative dispute resolution, and promote consumer awareness in collaboration with the relevant line ministries, Government departments, institutions, and advocacy groups.\n\nThe commission brings to book unscrupulous businesspeople who engage in unfair practices that include multi-tier pricing, fraudulent offers, failure to label products properly, and the disclosure of consumers personal information to third parties.\n\nUnder the new regulations, consumers are entitled to be fully refunded for defective or sub-standard goods and can individually approach the courts for redress or refer their complaints to the Commission.\n\nDr Nkosi said this year the commission went full throttle in carrying out its mandate.\n\nNotable milestones included the countrywide awareness campaigns on the rights of consumers, the arrest and prosecution of unscrupulous businesses selling counterfeits, underweight goods and measures, expired products among other things, said Dr Nkosi.\n\nWe have managed to move upward the Consumer Protection Index from below 20 in 2021 to 26 in 2023.\n\nSince last year, over 2 000 businesses have been prosecuted for consumer rights violations, including selling counterfeit and underweight goods.\n\nThese enforcement efforts reflect the Governments commitment to tightening regulations and promoting ethical business practices. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/effsdaaaaaaa.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  THE Consumer Protection Commission (CPC) has urged consumers to remain vigilant against misrepresentation and deceitful promotions during the festive season.  The commission also encouraged shoppers to exercise their rights, be cautious and make informed purchasing decisions to avoid falling  victim to unscrupulous business practices.  CPC, established under the Consumer Protection Act (Chapter 14:44), […]",
            "time": "2024-12-12 01:29:44"
        }
    ]
}