{
    "news": [
        {
            "title": "Late National Hero Mphoko to be buried in Bulawayo on Sunday- brother",
            "url": "https://www.chronicle.co.zw/late-national-hero-mphoko-to-be-buried-in-bulawayo-on-sunday-brother/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nNATIONAL hero, and former Vice President Phelekezela Mphoko will be buried at his Douglasdale farm on Sunday, his brother has said.\n\nIn an interview at Doves Funeral parlour, Mr Ndabenzinhle Mphoko, the younger brother to the late national hero told the Chronicle that burial will be on Sunday.\n\nCde Mphoko will be buried at his Douglasdale farm on Sunday. His body will be kept at the parlour overnight and then lie in state on Saturday at his Douglasdale farm, said Mr Mphoko.\n\nThere was a standstill at Doves Funeral Parlour as the hearse made its way.\n\nCde Mphokos body arrived at the Joshua Nkomo International Airport in Bulawayo aboard an Air Force of Zimbabwe plane.\n\nHis widow, Laurinda, a Mozambican, and his two daughters Sikhumbuzo and Siduduzo accompanied the body.\n\nThe plane touched down at 2:42pm.\n\nCde Mphokos, casket draped in the national flag was carried to the waiting Doves hearse.\n\nFlags draping coffins boldly symbolise a nations profound appreciation and respect for its fallen heroes.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube, Deputy Chief Secretary in the Office of the President and Cabinet, Politburo member Elifas Mashava, service chefs, Zanu PF Provincial chairman Cde Jabulani Sibanda and Cabinet, relatives, service chiefs, Zimbabwe Ambassador to India, Ms Stella Nkomo, Zanu PF members, politicians, military, and business spheres are present at the airport.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/d3f.jpg",
            "description": "Nqobile Bhebhe nqobile.bhebhe@chronicle.co.zw NATIONAL hero, and former Vice President Phelekezela Mphoko will be buried at his Douglasdale farm on Sunday, his brother has said. In an interview at Doves Funeral parlour, Mr Ndabenzinhle Mphoko, the younger brother to the late national hero told the Chronicle that burial will be on Sunday. “Cde Mphoko will be […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "Watch : Victoria Falls Bridge closed following traffic jam after motorist abandons fuel-empty vehicle",
            "url": "https://www.chronicle.co.zw/watch-victoria-falls-bridge-closed-following-traffic-jam-after-motorist-abandons-fuel-empty-vehicle/",
            "content": "Leonard Ncube[emailprotected]THE Victoria Falls Bridge was temporarily closed this afternoon when a motorist dumped his newly imported Honda Fit in the middle of the bridge on the no-mans land after it ran out of fuel.\n\nThe driver of the vehicle that blocked the Victoria Falls Bridge.\n\nThe man whose identity could not be established, was driving a hybrid Honda Fit with temporary foreign registration plates as it had just arrived from Tanzania via Zambia. Upon reaching the bridge, the vehicle ran out of fuel at around 1:30pm and he left it in the middle of the bridge as he rushed to get fuel from Victoria Falls town.He returned about 30 minutes later and there was a traffic jam on either side of the bridge as vehicles comprising taxis and haulage trucks were blocked.Drivers and vendors who operate around the two borders attempted to lift the vehicle and put it against the bridge rails but failed.The bridge has a single lane and only a single vehicle at a time is allowed in one direction.\n\nSome agitated men prepare to lift the Honda Fit off the drive lane on the bridge\n\nThe driver had gone with the keys but even though he had left the windows open, pushing the vehicle was not an option as the hybrid model of Honda Fit cannot move as long as its mechanical system is off.They tried to lift the vehicle and move it closer to the rails but failed.An attempt to tow it away also failed as the small two-tonne truck could not move it.\n\nRefueling the vehicles on the no mans land on the Victoria Falls Bridge\n\nThe driver then arrived with some fuel in a container.He was met with the anger of the crowd including the Emerged Railways Property manager Mr Logan Nyasulu who said the vehicle owner was going to be charged for blocking the bridge.How can you do this? Why would you leave your vehicle blocking the bridge? This car will not be cleared at the border before you pay for this, he said.In response, the man said: We tried to push it with the curio vendors but you know these hybrid vehicles have high security. The challenge is that the person who had gone to pick it up from Tanzania did not top up fuel and when I got it I think it had nothing. I have gone to Tanzania more than five times myself and this is what these people do, the moment they give you the car you cant even drive to the next fuel station before the fuel is finished, he said before being allowed to drive off towards the Zimbabwean side of the bridge to the border.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/RFGHRD.jpg",
            "description": "Leonard Ncube leonard.ncube@chronicle.co.zw THE Victoria Falls Bridge was temporarily closed this afternoon when a motorist dumped his newly imported Honda Fit in the middle of the bridge on the no-man’s land after it ran out of fuel. The man whose identity could not be established, was driving a hybrid Honda Fit with temporary foreign registration […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "Solomon Nyanhongo Clinches Banking Sector Top CEO Awards",
            "url": "https://www.chronicle.co.zw/solomon-nyanhongo-clinches-banking-sector-top-ceo-awards/",
            "content": "Online WriterHARARE, 12 December 2024  Stanbic Bank Zimbabwe Chief Executive Mr Solomon Nyanhongo has been named the overall Chief Executive Officer (CEO) of the Year and the Banking Sector CEO of the Year at the prestigious annual CEO Round Table Awards.The awards, determined by a five-member adjudication committee comprising experts in banking, law, accounting, media, and investment, assessed nominees across eight categories: business performance, corporate strategy, digital transformation, customer experience, risk management, product innovation, ethical leadership, and product mix.Chaired by lawyer and educationist Mr Canaan Dube, the committee recognised Mr Nyanhongo for steering Stanbic Bank to exceptional business performance, as evidenced by significant revenue growth and strategic foresight. Under his leadership, the bank prioritised three strategic goals: transforming client experience, executing with excellence, and driving sustainable growth and value.Mr Nyanhongos digital transformation efforts were a standout, with 48% of Stanbic Banks clients now fully digitized. This year alone, 94% of the banks 14.1 million transactions were conducted through digital channels, showcasing customer trust and the institutions commitment to efficiency and accessibility.Stanbic Bank has won the Best Customer Experience Award in the Banking Category from the Customer Experience Association of Zimbabwe for the past two years. Customer satisfaction across its segments averaged 8.5 out of 10, indicating high levels of client approval.The bank excelled in risk management, maintaining an impressively low 0.7 percent non-performing loan (NPL) ratio, which demonstrates robust financial health. Revenue diversification also played a significant role, with 36 percent of its total revenue as of October 2024 coming from transactional revenues.Innovation has been another hallmark of Mr Nyanhongos leadership. This year, Stanbic Bank launched several customer-focused products, including: A Loyalty Programme for Private Banking clients, featuring perks such as free travel insurance and airport lounge access. The low-cost Blue Ease account, designed for financial inclusion, with 743 accounts opened to date. Green Energy Financing for clients in renewable energy, as part of the banks sustainability drive.The adjudication committee, adhering to strict conflict-of-interest guidelines, used a predefined set of criteria to ensure a fair evaluation. Mr Nyanhongos recognition was based not only on sectoral leadership but also on Stanbic Banks impact at the national level.The awards process was thorough, and we are proud of the outcomes. Each nominee demonstrated excellence, but Nyanhongos achievements stood out, said Mr Dube.The awards spanned multiple sectors, including agribusiness, education, health, ICT, manufacturing, real estate, and tourism, making Nyanhongos selection as overall CEO of the Year particularly noteworthy.Despite Zimbabwes economic challenges, Stanbic Bank posted a historical cost profit of ZWG27.1 million for the six months ending June 30, 2024. Adjusted for technical losses related to investment property portfolio valuations, the banks headline earnings stood at ZWG346 million, reflecting its sustainable financial performance.Mr Nyanhongo noted that the banks financial adjustments followed the shift in its functional currency from the Zimbabwe Dollar (ZWL) on January 1, 2024. This change led to accounting recalibrations reflecting differences in property asset valuations.Stanbic Bank ended the first half of the year with a net interest income of ZWG374 million, largely driven by new foreign currency lending assets amid high demand for forex facilities.These accolades highlight Mr Nyanhongos visionary leadership and the transformative impact of Stanbic Bank on Zimbabwes financial landscape. His focus on innovation, sustainability, and customer experience sets a benchmark for the banking sector.EndsCAPTION: Stanbic Bank Chief Executive Solomon Nyanhongo (second from right) with (from left): CEO Africa Roundtable Board Chairman Oswell Binha, US Ambassador to Zimbabwe H.E. Ms. Pamela Tremon, and Dr. Thomas Utete Wushe, Permanent Secretary, Ministry of Industry and Commerce, shortly after receiving the two awards.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/asq.jpg",
            "description": "Online Writer HARARE, 12 December 2024 – Stanbic Bank Zimbabwe Chief Executive Mr Solomon Nyanhongo has been named the overall Chief Executive Officer (CEO) of the Year and the Banking Sector CEO of the Year at the prestigious annual CEO Round Table Awards. The awards, determined by a five-member adjudication committee comprising experts in banking, […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "Watch: The Body of former Vice President Mphoko arrives in Bulawayo",
            "url": "https://www.chronicle.co.zw/body-of-former-vice-president-mphoko-arrives-in-bulawayo/",
            "content": "Nqobile Bhebhe[emailprotected]\n\nTHE body of former Vice President Phelekezela Mphoko has arrived at the Joshua Nkomo International Airport in Bulawayo aboard an Air Force of Zimbabwe plane.\n\nThe plane touched down at 2:42pm.\n\nCde Mphokos, casket draped in the national flag was carried to the waiting Doves hearse.\n\nFlags draping coffins boldly symbolise a nations profound appreciation and respect for its fallen heroes.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube, Deputy Chief Secretary in the Office of the President and Cabinet,\n\nPolitburo member Elifas Mashava, service chefs, Zanu PF Provincial chairman Cde Jabulani Sibanda and Cabinet, relatives, service chiefs, Zimbabwe Ambassador to India, Ms Stella Nkomo, Zanu PF members, politicians, military, and business spheres are present at the airport.\n\nMore to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/tiy78ko.jpg",
            "description": "Nqobile Bhebhe nqobile.bhebhe@chronicle.co.zw THE body of former Vice President Phelekezela Mphoko has arrived at the Joshua Nkomo International Airport in Bulawayo aboard an Air Force of Zimbabwe plane. The plane touched down at 2:42pm. Cde Mphoko’s, casket draped in the national flag was carried to the waiting Doves hearse. Flags draping coffins boldly symbolise a […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "President Mnangagwa highlights strong Zimbabwe-Botswana relations at SADC Headquarters Opening",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-highlights-strong-zimbabwe-botswana-relations-at-sadc-headquarters-opening/",
            "content": "Online WriterGABORONE, Botswana  President Emmerson Mnangagwa, speaking at the official opening of the Southern African Development Community (SADC) Headquarters, lauded the deep and enduring bilateral ties between Zimbabwe and Botswana.He expressed heartfelt gratitude to President Duma Boko for the warm hospitality extended to him during his visit, calling Botswana a second home to Zimbabwe.In his address, President Mnangagwa congratulated President Boko on his recent election victory, emphasising the spirit of goodwill and partnership between their nations. He also praised SADC Executive Secretary Elias Magosi for creating an enabling environment for the Secretariat to execute its mandate effectively.The SADC House should stand as an embodiment of our regions history, culture, and heritage, President Mnangagwa remarked, highlighting the significance of collaboration in achieving regional goals. He commended the successful public-private partnership that brought the SADC Headquarters project to fruition, calling it a testament to the regions commitment to progress.President Mnangagwa officially received the SADC House, marking it as a pivotal moment in advancing unity and regional integration across Southern Africa. The event reflects the shared commitment of SADC member states to fostering development and cooperation throughout the region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/yyty.jpg",
            "description": "Online Writer GABORONE, Botswana – President Emmerson Mnangagwa, speaking at the official opening of the Southern African Development Community (SADC) Headquarters, lauded the deep and enduring bilateral ties between Zimbabwe and Botswana. He expressed heartfelt gratitude to President Duma Boko for the warm hospitality extended to him during his visit, calling Botswana a “second home” […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "Botswana President Boko addresses milestone event at SADC headquarters, emphasising regional unity",
            "url": "https://www.chronicle.co.zw/botswana-president-boko-addresses-milestone-event-at-sadc-headquarters-emphasising-regional-unity/",
            "content": "Online WriterGABORONE, Botswana  In a momentous address marking the official opening of the Southern African Development Community (SADC) Headquarters in Botswana, President Duma Gideon Boko highlighted the significance of this achievement as the culmination of over 20 years of collaborative efforts. The decision to establish the SADC HQ in Botswana was made in Luanda, and todays event symbolises the transformation of that vision into reality.Accompanied by SADC Chairperson and Zimbabwes President Emmerson Mnangagwa, President Boko acknowledged their shared witness to this historic milestone. We are here to reaffirm the bonds that hold us together, he said, emphasising Botswanas commitment to regional integration and its role within the broader African context.\n\nPictures: Presidential Photographer Tawanda Mudimu\n\nThe leaders will later participate in a ground-breaking ceremony for the SADC Regional Logistics Depot, further reinforcing the regions commitment to unity and development. President Boko concluded his remarks by underscoring SADCs role as a beacon of hope, strength, and resilience while expressing appreciation for President Mnangagwas leadership within the organisation.This event marks a significant step in enhancing SADCs capacity to promote social cohesion and foster collaborative development across Southern Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/erererererers.jpg",
            "description": "Online Writer GABORONE, Botswana – In a momentous address marking the official opening of the Southern African Development Community (SADC) Headquarters in Botswana, President Duma Gideon Boko highlighted the significance of this achievement as the culmination of over 20 years of collaborative efforts. The decision to establish the SADC HQ in Botswana was made in […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "Four Zimbabweans pass Fifa Football Agent Examinations",
            "url": "https://www.chronicle.co.zw/four-zimbabweans-pass-fifa-football-agent-examinations/",
            "content": "Leonard Ncube[emailprotected]FOUR Zimbabweans have passed the Fifa Football Agent examinations taking to 11, the number of approved professional agents in the country.Mandla Dingani, a Victoria Falls City Council employee in the Housing and Community Services Department is among the four new agents that include Tendai Mukungunurwa, Happymore Chayira, and Charles Chipembera.He becomes the second Fifa-approved agent in Matabeleland North after Lindela Tshuma and the only one in Victoria Falls.Dinganis presence will go a long way in empowering young footballers from the city after years of exploitation by fly-by-night agents who were taking chances and advantage of budding soccer players on the pretext of linking them to big clubs outside the resort city.Dingani, Mukungunurwa, and Chayira are the only ones who passed the November 2024 Fifa Football Agent Examinations out of the 12 who sat for the exams after demonstrating exceptional knowledge and expertise and meeting the stringent standards set by Fifa.Dingani has since received his Fifa licence and joins the ranks of professional agents who represent football talent globally.This brings to 11 the number of Fifa-licenced Football agents in Zimbabwe.The current list had Denford Mutashu, George Deda, Garikayi Gilbert Sengwe, Lindela Tshuma, Gibson Mahachi, Adonis Ndaimana Sithole and Kudakwashe Mashamba.With the others, Dingani will play a pivotal role in the football ecosystem bridging the gap between players and clubs while ensuring professional representation in contract negotiations and career management. He was born and grew up in a football family as his father Dingilizwe Dingani was a team medic for Hwange Football Club from 1993-2019.A staunch Liverpool fan, Dingani said he owed his success to not only his father but former Hwange players that he admired on and off the field.So basically I am a soccer fanatic whose love for the game was inculcated in me by my father. I used to escort him to camp as I wanted to watch the likes of Walter Chuma the 1997 Soccer STAR of the Year, Chenjerai Dube, Brian Njobvu, Method Mwanjale and Nation Dube, who were my heroes back then.I had aspirations of playing soccer at a professional level after having represented my secondary school Marist Brothers Dete but my father would have none of that as he had concerns with my physical fitness. My former schoolmate at Marist Brothers, Winston Mhango was one of the key advisers and influencers into taking this course as I always desired to represent him because of his amazing soccer exploits at school, said Dingani.He said his ambition is to contribute to the game hence a keen interest in becoming a Fifa licenced agent.Dingani said he will work hard to identify talent and open opportunities for soccer players in Zimbabwe.An advert was flighted on Zifas Facebook page and a friend alerted me as he knew I was keen to take up the challenge. I registered on the FIFA platform and went through their study materials until we wrote the exams on 20 November 2024.I sought guidance and advice from people in the field such as George Deda who continues to selflessly guide me, Adonis Sithole the first to pass exams at their inception last year and I highly regard him as my tutor, Gilbert Sengwe and Lindela Tshuma who is the only other agent from this region, said Dingani.He said he is from a soccer family as his maternal uncles Stanley Nkomo and Lovemore Mwetwa played for Hwange FC and Railstars FC respectively.He said football agency seeks to bring professional guidance in negotiating soccer players contracts and ensuring that players are educated about their contracts and also assist them exploit the future.Dingani was born and raised in Hwange and with his elder sister Rebecca, they grew up supporting Liverpool FC.He said he has turned down numerous pleas to join local soccer team executives as his goal was to become an agent.He wrote the final examination a day before his graduation with a Master of Arts in Strategic Communications at Midlands State University last month.@ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/6CD56U.jpg",
            "description": "Leonard Ncube leonard.ncube@chronicle.co.zw FOUR Zimbabweans have passed the Fifa Football Agent examinations taking to 11, the number of approved professional agents in the country. Mandla Dingani, a Victoria Falls City Council employee in the Housing and Community Services Department is among the four new agents that include Tendai Mukungunurwa, Happymore Chayira, and Charles Chipembera. He […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "President Mnangagwa engages with SADC Secretariat on inaugural visit as Chairperson",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-engages-with-sadc-secretariat-on-inaugural-visit-as-chairperson/",
            "content": "Online WriterGABORONE, Botswana  President Emmerson Mnangagwa has embarked on his first official visit to the Southern African Development Community (SADC) Secretariat Headquarters as the new Chairperson, accompanied by Botswanas President Duma Gideon Boko.This traditional visit allows SADC Chairpersons to interact with management, address staff, and gain insight into the Secretariats daily operations.Upon arrival at SADC House, President Mnangagwa was welcomed by the Executive Secretary, Mr Elias Magosi, alongside the SADC management team and ambassadors accredited to Botswana. The visit commenced with President Mnangagwa signing the guest book, followed by a tour of the Julius Nyerere SADC Library to explore the history collection of the regional bloc.\n\nPictures: Presidential Photographer Tawanda Mudimu\n\nThe itinerary included a photo session with SADC ambassadors and a ceremonial unveiling of a visiting placard at the Secretariat building. In further engagements, President Mnangagwa, alongside the Chairperson of the Council of Ministers, met with the management team to discuss the mandate, functions, and structure of the SADC Secretariat, as well as the organizations priorities and the current status of regional integration.\n\nPictures: Presidential Photographer Tawanda Mudimu\n\nDuring these discussions, the President is expected to provide guidance and feedback on SADCs initiatives, culminating in a meeting with all Secretariat staff to foster collaboration and motivate personnel as he sets the tone for his tenure.\n\nThis visit underscores the importance of leadership engagement within SADC, aiming to strengthen ties among member states and enhance the effectiveness of regional integration efforts.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/u46.jpg",
            "description": "Online Writer GABORONE, Botswana – President Emmerson Mnangagwa has embarked on his first official visit to the Southern African Development Community (SADC) Secretariat Headquarters as the new Chairperson, accompanied by Botswana’s President Duma Gideon Boko. This traditional visit allows SADC Chairpersons to interact with management, address staff, and gain insight into the Secretariat’s daily operations. […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "President Mnangagwa arrives in Botswana for first visit as SADC Chairman",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-arrives-in-botswana-for-first-visit-as-sadc-chairman/",
            "content": "Online WriterGABORONE, Botswana  President Emmerson Mnangagwa has arrived in Botswana for his inaugural visit to the Southern African Development Community (SADC) Secretariat Headquarters as the newly appointed Chairman of the regional bloc.He was warmly received by Botswanas Minister of Foreign Affairs, Phenyo Butale, alongside the Botswana Ambassador to Zimbabwe, Ms Sarah Molosiwa, and Zimbabwes Ambassador to Botswana, Henry Mukonoweshuro.\n\nPictures: Presidential Photographer Tawanda Mudimu\n\nThis visit marks a significant step in Mnangagwas leadership as he aims to advance the SADC Regional Indicative Strategic Development Plan (RISDP 2020-2030) and the SADC Vision 2050. These strategic frameworks are designed to enhance regional integration and development across Southern Africa.\n\nThe RISDP is built on three key pillars: Industrial Development and Market Integration, Infrastructure Development to support Regional Integration, and Social and Human Capital Development. These initiatives are crucial for fostering economic growth and collaboration among member states.\n\nPictures: Presidential Photographer Tawanda Mudimu\n\nUpon arrival, President Mnangagwa was honoured with a military guard of honour under a cloudy sky. He is expected to receive a briefing at a local hotel, followed by meetings with SADC Secretariat management and staff. During his tenure as Chair, he will also oversee the official handover of the newly acquired SADC Secretariat Headquarters building and preside over the ground-breaking ceremony for the SADC Regional Logistics Depot.\n\nThis visit underscores Zimbabwes commitment to its role in SADC and the importance of collective efforts in addressing regional challenges and fostering sustainable development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/k76.jpg",
            "description": "Online Writer GABORONE, Botswana – President Emmerson Mnangagwa has arrived in Botswana for his inaugural visit to the Southern African Development Community (SADC) Secretariat Headquarters as the newly appointed Chairman of the regional bloc. He was warmly received by Botswana’s Minister of Foreign Affairs, Phenyo Butale, alongside the Botswana Ambassador to Zimbabwe, Ms Sarah Molosiwa, […]",
            "time": "2024-12-13 20:39:53"
        },
        {
            "title": "High-Level bilateral meeting in Livingstone: Zimbabwe and Zambia Ministers gather for energy and finance discussions.",
            "url": "https://www.chronicle.co.zw/high-level-bilateral-meeting-in-livingstone-zimbabwe-and-zambia-ministers-gather-for-energy-and-finance-discussions/",
            "content": "Leonard Ncube in Livingstone, Zambia\n\nZIMBABWEs and Zambias Energy and Finance Ministers are set to meet in Livingstone, Zambia, this morning for the 44th Council of Ministers Ordinary Meeting.\n\nThe Zambezi River Authority (ZRA) is organising the high-level bilateral meeting which will be attended by key stakeholders to deliberate and receive updates on various issues.\n\nMain on the agenda is an update on the water levels in Lake Kariba for power generation and projected availability in the reservoir up to 31 December and progress on the development of the Batoka Gorge Hydro-Electric Scheme, the Devils Gorge Hydro-Electric Scheme and the Floating Photo Voltaic Project to be constructed on Kariba Dam.\n\nThe Council of Ministers like ZRA, is a bi-lateral cooperation arm for Zambia and Zimbabwe on the management of water activities on the Zambezi River.It is made up of Ministers of Finance and Energy as well as Attorney Generals from both countries.\n\nEnergy and Power Development Minister Edgar Moyo who is the current chair of the COM, his Ministrys Permanent Secretary Dr Gloria Magombo and their counterparts from Zambia have arrived for the meeting while Finance, Economic Development, Cooperation and Investment Promotion Minister Professor Mthuli Ncube will attend virtually while his counterpart sent a representative. @ncubeleon.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fdsdsdsf.jpg",
            "description": "Leonard Ncube in Livingstone, Zambia ZIMBABWE’s and Zambia’s Energy and Finance Ministers are set to meet in Livingstone, Zambia, this morning for the 44th Council of Ministers Ordinary Meeting. The Zambezi River Authority (ZRA) is organising the high-level bilateral meeting which will be attended by key stakeholders to deliberate and receive updates on various issues. […]",
            "time": "2024-12-13 20:39:53"
        }
    ]
}