{
    "news": [
        {
            "title": "‘Expect new way of doing business’",
            "url": "https://www.chronicle.co.zw/expect-new-way-of-doing-business/",
            "content": "Africa Moyo, Harare Bureau\n\nZIMBABWEANS should expect to see a marked change in the way the Second Republic conducts its business this year, as all systems are being improved to respond to the peoples needs, Acting President Kembo Mohadi said yesterday.\n\nIn an interview at his offices in Harare, the Acting President said 2025 promised to be exciting on the back of the current wet spell being experienced across the country, giving hope for a good cropping season and pastures for livestock.\n\nHigh impact projects such as dam and road construction, together with provision of decent and affordable housing, would be continued, he added.\n\nWe are all enthused about the prospects for the year. The Gods have smiled on us. We are receiving rain which is good for our crops and pastures, said Acting President Mohadi.\n\nActing President K. Mohadi\n\nI am happy to inform the nation that the Whole-of-Government remains steadfast on President Mnangagwas commitment to realise his Vision 2030 for Zimbabwe. Even as the President is on leave, we are busy fine-tuning the Whole-of-Government architecture, to be responsive to the needs of the people. It cannot be business as usual. You will see marked changes in the way we conduct business.\n\nThe good rains were expected to help the country save a lot of money that would ordinarily go towards making sure extra food reached a lot of people who would have lost their crops, as well as the cost of imports.\n\nWith prospects of a decent harvest, extra funds will now be channelled towards development, which has been the hallmark of the Second Republic led by President Mnangagwa since 2018. In the last summer cropping season, Zimbabwes yields were affected by the erratic rains due to the El Nino weather phenomenon, resulting in Government funds being used to provide grain for many rural families and cash allowances for the poorest of the urban families as a result Presidents call of ensuring that no one should starve. Acting President Mohadi said the Government needed the hunter spirit in its operations, adding that sufficient preparations for a successful year have been made, riding on the milestones achieved last year. Asked if last year was a success, he said: Depending on how you view it yourselves, I would describe 2024 as a year in which as Government, we took bold and decisive decisions to pursue and consolidate our development thrust towards the attainment of Vision 2030.\n\nPresident Mnangagwa\n\nLast year many achievements were recorded in terms of economic stabilisation, health sector improvement, commendable regional contributions and good performances in the agricultural sector, among other milestones.\n\nOn economic reforms, Acting President Mohadi said Government, through the Reserve Bank of Zimbabwe (RBZ), introduced the Zimbabwe Gold (ZiG) currency to replace the Zimbabwe dollar.\n\nThis move stabilised the economy, as it laid the foundation for sustained economic growth, he said, reiterating that no country in the world can develop without its own currency.\n\nTurning to infrastructure development, Acting President Mohadi said the impact of last years severe drought affected progress on many fronts, including infrastructure development as resources had to be diverted towards mitigating the effects of drought.\n\nHowever, Zimbabwe completed 520km of the Harare-Beitbridge Highway and 1 500km of road rehabilitation.\n\nZimbabwe Gold\n\nWe also saw the commissioning of the new Robert Gabriel Mugabe International Airport by His Excellency (President Mnangagwa), which increased the airports passenger capacity.\n\nOn digital transformation, the major development was the licensing of Starlink, a satellite internet service in the country.\n\nThe coming of Starlink, said Acting President Mohadi, was an acknowledgement of the information sector as a major contributor to the economy.\n\nFollowing the investments by other local companies and the coming of Starlink, overall internet penetration increased from 63 percent in 2023 to the present levels of 75 percent in 2024.\n\nIn the agricultural sector, Zimbabwe set a new wheat harvest record after attaining over 550 000 tonnes following heavy investments in irrigation while farmers were provided uninterrupted electricity supply.\n\nActing President Mohadi said another bold and decisive step of the Government last year was the issuing of new land title deeds that give indigenous farmers direct ownership of their land, allowing them to use the land as collateral for loans or sell it for investment.\n\nPresident Mnangagwa launched the new land title deeds programme at Precabe Farm on December 20, with the first beneficiaries receiving their title deeds.\n\nOn the political front, the country remained peaceful, despite unfounded reports of divisions in some sections of the media.\n\nAs a people we have remained united. The divisions we hear about, if any, are those we read from newspapers and social media.\n\nThe year 2024, saw the successful launch of the Gukurahundi Community Engagement Outreach by the President, His Excellency Dr Mnangagwa. This initiative seeks to address the historical grievances arising from the Gukurahundi disturbances.\n\nThis programme, spearheaded by our traditional leaders, identifies individuals and communities directly and indirectly affected, captures their views, and establishes community-led solutions to their grievances. Their involvement ensures that the process is inclusive, culturally sensitive, and reflective of the aspirations of affected communities, he said.\n\nZimbabwe also hosted a successful 44th SADC Summit in Harare in August, attracting a record number of delegates from the region.\n\nIn November, Zimbabwe also hosted an Extraordinary Sadc Summit to resolve some emerging issues in the region.\n\nActing President Mohadi said as Zimbabwe continued to assert its leadership role within SADC, several milestones were achieved including regional integration, peace and sustainable development.\n\nOn the health front, Government procured cancer machines for Parirenyatwa and Mpilo hospitals and also implemented a basic diagnostic tool for village health workers to screen and diagnose basic conditions.\n\nIn response to concerns from many football fans where the national football team, the Warriors, has been staging its home games in other countries, Acting President Mohadi said Government is now finalising the long-awaited installation of the bucket seats at the National Sports Stadium.\n\nOther sporting facilities such as Magamba, will be modernised.\n\nActing President Mohadi added that as a proud Zanu PF cadre, it would be amiss for him to discuss political developments in the country without acknowledging his partys role.\n\nThe revolutionary party, he said, held a successful 21st Zanu PF Annual National Peoples Conference in Bulawayo in October.\n\nZANU-PF\n\nThis is a pivotal event in our partys calendar and the highest expression of democracy within Zanu PF.\n\nThe conference allowed us to reflect on our achievements and identify areas where we need to improve as a Government.\n\nImportantly, the resolutions adopted were rooted in the aspirations and voices of the people, he said.\n\nTurning to his own health, Acting President Mohadi, who was said to be unwell on social media, dismissed the reports.\n\nArriving for the interview earlier, he asked photographers if they needed his pictures before letting them embark on a five minute photo shoot.\n\nThe Acting President then asked them, jokingly, if they needed more time, to which they said they were fine.\n\nLater in his address, he referred to the social media allegations of ill health, and scoffed at claims he was in India to seek medical attention.\n\nActing President Mohadi said by being at the media engagement, that should dispel reports he was battling for his life.\n\n",
            "image_url": null,
            "description": "Africa Moyo, Harare Bureau ZIMBABWEANS should expect to see a marked change in the way the Second Republic conducts its business this year, as all systems are being improved to respond to the people’s needs, Acting President Kembo Mohadi said yesterday. In an interview at his offices in Harare, the Acting President said 2025 promised […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "Kaufman: The sculptor who shaped Bulawayo’s artistic landscape",
            "url": "https://www.chronicle.co.zw/kaufman-the-sculptor-who-shaped-bulawayos-artistic-landscape/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nAS one strolls through the streets of Bulawayo, the citys artistic and cultural flair is undeniably evident, particularly in the striking sculptures that grace its urban fabric.\n\nFrom the iconic two-figure composition on the eastern facade of Pioneer House to the intricately detailed relief sculpture at Galen House, these masterpieces are a demonstration of the exceptional talent of Gillian Kaufman (ne Robotham), a renowned sculptor whose works have indelibly shaped the citys visual identity.\n\nWith a firm handshake and a contagious smile, Kaufman welcomed a Saturday Leisure crew to her Burnside home.\n\nBorn and bred in Britain, Kaufmans love affair with clay began at a tender age.\n\nMy journey to becoming a sculptor wasnt an extraordinary one, but I used to love playing in the garden with clay, like all children do, making all sorts of sculptures with clay. Thats how my love for clay products came about, she said.\n\nKaufmans passion for art led her to pursue a career in sculpture, which was further fuelled by her win of a gold medal for sculpture and a travelling scholarship in 1950. This accolade enabled her to further her studies in Greece, where she spent six months travelling and working at the British School of Archaeology in Athens.\n\nIn 1955, Kaufman visited Bulawayo (in then Southern Rhodesia) to see her sister, Jeane Hudlestone, and it was here that she met her husband, Basil Kaufman.\n\nMoving to Bulawayo was a blessing in disguise for me. I got a teaching post at Townsend High School and taught there for a short while before I went to sculpture full-time, she recalled.\n\nOne of Kaufmans most celebrated works is the Piet, a visual representation of the Virgin Mary mourning over the body of Jesus Christ after His crucifixion. Commissioned by St Marys Cathedral, the project took nearly two decades to complete due to funding constraints.\n\nJairos Jiris portrait bust made by Gillian Kaufman\n\nToday, the Piet, recast in bronze, is housed at the Talos Fine Arts Foundry in Quarley Hampshire.\n\nKaufmans creative process is deeply rooted in her love for clay, which she sources from the Gwayi River.\n\nHer iconic 18-foot sculpture depicting one European and one African figure working together with a pick and a shovel, hanging at the eastern facade of Pioneer House, required a staggering five tonnes of clay and an assistant to achieve.\n\nAs one explores Kaufmans studio, its evident that her artistic talent extends far beyond sculpture. The space is a treasure trove of yesteryear artefacts, including sculptures, paintings, and books. A life-size piece of the late Gary Burne, the famous Bulawayo male ballet dancer, and busts of her family members are just a few examples of her remarkable body of work.\n\nKaufmans connection to her adopted city and its people is deeply personal. She has a special affinity for the King Lobengula artwork, which represents Ndebele royalty and pride.\n\nI love my work, and its not easy to just pick only one artwork and say it is the best, but working on the King Lobengula piece with his spear and dog was special. Our region, Matabeleland, was full of Ndebele people at the time, and this was a visual representation of their royalty. King Lobengula was revered in these paths, she said, her voice filled with emotion.\n\nAs Kaufman reflected on her illustrious career, she was visibly moved by the mention of the fish fountain at the Reserve Bank of Zimbabwes front porch.\n\nThe Piet made by Gillian Kaufman\n\nI hate to see them (fish) without scales, and I dont know who and why they removed them, she said, her face cringing in dismay.\n\nWhen asked about her last piece before retiring from professional sculpting, Kaufmans eyes sparkled with a hint of mischief.\n\nIm sorry to be such a spoilsport, my memory is failing me, but I wanted to tell which one. I cant remember, she said, her laughter infectious.\n\nThroughout her long and distinguished career, Kaufman has completed numerous public commissions in Britain and Africa.\n\nGill working on the bust of her grandson, Sam Kaufman in her studio in Bulawayo\n\nHer work includes the Rhodesian Coat of Arms and the Signs of the Zodiac for the Magistrate Court in Harare, as well as a portrait bust in bronze for Jairos Jiri and trophies for the Zimbabwe Music Academy.\n\nAt 96, as she looks back on her remarkable journey, she attributed her long life to exercise and a passion for her craft. Her daughter, Vicky, has compiled a book chronicling her mothers extensive body of work, ensuring that Gillian Kaufmans legacy will continue to inspire future generations.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/a1.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com AS one strolls through the streets of Bulawayo, the city’s artistic and cultural flair is undeniably evident, particularly in the striking sculptures that grace its urban fabric. From the iconic two-figure composition on the eastern facade of Pioneer House to the intricately detailed relief sculpture at Galen House, these masterpieces are a […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "COMMENT: As rains pound, safe passage of school children must be prioritised",
            "url": "https://www.chronicle.co.zw/comment-as-rains-pound-safe-passage-of-school-children-must-be-prioritised/",
            "content": "As Zimbabwes schools prepare to reopen for the 2025 first term, the safety of schoolchildren during this rainy season demands urgent attention.\n\nThe Bulawayo Fire Brigade has identified rivers and streams that pose significant risks, with past tragedies serving as stark reminders of the dangers of flooded waterways.\n\nWith the Meteorological Services Department (MSD) forecasting normal to above-normal rainfall between now and March, proactive measures are essential to prevent further loss of life.\n\nAmong the most hazardous waterways is the Phekiwe River, which separates the suburbs of Emganwini, Nketa, and Nkulumane 12. This river has historically challenged rescue efforts, particularly for children crossing it to attend schools in neighbouring areas.\n\nThe shortage of schools in rapidly growing suburbs like Rangemore exacerbates the issue, forcing children to traverse dangerous streams such as the Phekiwe, often during heavy rains.\n\nOther perilous waterways include the Khami River near the Solusi turn-off, Ngwenya Ponds between Pumula South and Pelandaba West, and streams in Mthunzini and Pumula South suburbs.\n\nPhekiwe River\n\nThe Mazayi River, despite being underestimated by many, has also claimed lives in the past. Last year, the Sakhile Stream between Nketa and Nkulumane 9 tragically took the life of a Grade Four pupil.\n\nThese waterways, alongside others in Entumbane, Mahatshula North, and Trenance, represent a growing concern as the rains intensify.\n\nParents, guardians, and the broader community must act decisively to ensure childrens safety.\n\nChief Fire Officer Mr Mhlangano Moyo has urged parents to pick up their children from school during heavy rains, while teachers are encouraged to release pupils early to avoid hazardous conditions.\n\nThe Bulawayo Civil Protection Unit (CPU), in partnership with civic organisations, is conducting awareness campaigns to educate residents on flood safety. These initiatives, supported by groups such as the World Food Programme, Africa Ahead, and Danish Church Aid, aim to empower communities with practical knowledge to mitigate flood risks.\n\nAdditionally, simple preventive measures like ensuring perimeter walls have weep holes for water drainage can help minimise flooding in residential areas. Residents are also advised to avoid crossing flooded streams or driving through submerged bridges, which pose significant dangers.\n\nThe tragic incidents of past rainy seasons must galvanise collective action. By remaining vigilant and implementing the guidance provided by authorities, we can safeguard the lives of schoolchildren and other vulnerable members of the community. The rainy season, while a blessing for agriculture, need not become a period of mourning for avoidable losses. Together, let us prioritise safety and ensure a secure passage for our children as they embark on their educational journeys.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/09/Pupils-prepare-for-Zimsec-examination-Pic-Ministry-of-Priamry-and-Secondary-Education.jpg",
            "description": "As Zimbabwe’s schools prepare to reopen for the 2025 first term, the safety of schoolchildren during this rainy season demands urgent attention. The Bulawayo Fire Brigade has identified rivers and streams that pose significant risks, with past tragedies serving as stark reminders of the dangers of flooded waterways. With the Meteorological Services Department (MSD) forecasting […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "Raza’s last stand…Chevrons all-rounder moots retirement",
            "url": "https://www.chronicle.co.zw/razas-last-stand-chevrons-all-rounder-moots-retirement/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nIN a surprising turn of events, the recently concluded two-match Test series against Afghanistan at Queens Sports Club may have been Sikandar Razas final appearance in Test cricket for Zimbabwe.\n\nThe Saturday Chronicle has exclusively learned that the 38-year-old star all-rounder was poised to make a significant announcement regarding his Test future before the start of the New Years Day Test.\n\nAccording to sources close to the player and Zimbabwe Cricket (ZC) management, Raza was planning to call time on his Test career at the end of the New Years Day Test match, which Afghanistan won by 72 runs on the morning of the final day. This was intended to be his final Test for the Chevrons, meaning fans in Bulawayo would have seen the last of Raza in red-ball cricket.\n\nRaza, who missed out on the Boxing Day Test citing the need to manage his workload, is said to have already informed ZC of his decision. However, he was talked out of it at the 11th hour by ZC management, and the player agreed to continue playing red-ball cricket.\n\nSikandar Raza in action for Zimbabwe during the New Years Day Test match against Afghanistan at Queens Sports Club\n\nWith a packed 2025 Test schedule, Saki (Raza) felt it was the right time for the younger players to be integrated into the Test squad, but with no genuine all-rounders ready to take his place, ZC persuaded him to continue, said the source.\n\nPart of the reasons behind his retirement was to capitalise on franchise leagues as he nears the end of his career.\n\nTo say that Raza wants to maximise his earnings by playing in global T20 franchises might sound mercenary, but it is not. At the ripe age of 38, he felt he has served his country well and it is time to drop the Test format to remain fresh for Zimbabwes white-ball assignments and, more importantly, help the team qualify for the T20 World Cup in 2026, the source said.\n\nEven if Raza had retired from Test cricket, he would still need a no-objection certificate (NOC) to participate in T20 franchise leagues. Soon after the conclusion of the Afghanistan series, the Chevrons stalwart was on his way to the United Arab Emirates (UAE) for the International League T20 (ILT20), where he was named captain of his Dubai Capitals side. He was also retained by Pakistan Super League (PSL) side Lahore Qalandars ahead of the 2025 edition, scheduled for April.\n\nIn the New Years Day Test, Raza was one of the two changes made by Zimbabwe to the team that played in the run-fest Boxing Day match, which ended in a draw. He returned after nearly four years of Test absence, having last played in 2021 against Afghanistan in Abu Dhabi, replacing Brandon Mavuta.\n\nRazas performances in the second Test vindicated the ZC hierarchys decision to talk him out of retiring from Tests. With ball in hand, he took crucial wickets at important moments of the game. He came into bat at number four and in both innings had to play within himself after top-order collapses. With better shot selection, he could have scored a hundred in the first innings, shutting out Afghanistan from the game.\n\nAfter Ervine won the toss and elected to field first, Raza  on his return, which could have been his last  was the pick of the Zimbabwean bowlers, finishing with figures of 3/30 in his 12-over spell.\n\nCraig Ervine\n\nHis first victim was the danger-man Rahmat Shah, whom he clean bowled for 19 runs off 64 balls with the last ball of the 30th over. He then went on to bowl debutant Ismat Alam (who scored a century in the second innings) for a two-ball duck. His final wicket of the innings was Yamin Ahmadzai, whom he also bowled out.\n\nHe then scored a crucial 61 runs off 104 balls, which helped Zimbabwe enjoy an 86-run lead going into the second innings. In the second innings, he took one scalp for 79 runs in 30 overs, with his solitary wicket being the all-important one of Afghanistan skipper Hashmatullah Shahidi, whom he bowled for 13 runs off 26 balls. He was the Chevrons joint second leading run-getter in the second innings with 38 runs to his name alongside Ben Curran. Raza was caught after facing 83 deliveries as the Chevrons crumbled with the bat to lose the match a few minutes into the start of day five.\n\nWith Sean Williams an injury doubt for the Ireland series, having been nursing back pain throughout the New Years Day Test match, Zimbabwe needs Razas experience now more than ever to assist Ervine.\n\nThe Chevrons are scheduled to host Ireland for an all-format series starting with a one-off Test match at Queens Sports Club on 6 February.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/aba.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub IN a surprising turn of events, the recently concluded two-match Test series against Afghanistan at Queens Sports Club may have been Sikandar Raza’s final appearance in Test cricket for Zimbabwe. The Saturday Chronicle has exclusively learned that the 38-year-old star all-rounder was poised to make a significant announcement regarding his […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "New operational vehicles to ensure smooth schools opening",
            "url": "https://www.chronicle.co.zw/new-operational-vehicles-to-ensure-smooth-schools-opening/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Government has announced that all systems are in place for a smooth opening of schools on Tuesday, with the Treasury equipping the Ministry of Primary and Secondary Education with operational vehicles to monitor teaching and learning.\n\nThe Ministry of Primary and Secondary Education\n\nSchools open for the First Term of 2025 on January 14, and parents have been urged to pay fees on time to support the Governments efforts in delivering quality education.\n\nWhile parents and guardians have been busy buying uniforms and stationery for their children, the ministry handed over 15 operational vehicles to various District Schools Inspectors on Wednesday. In an interview, Primary and Secondary Education Permanent Secretary Moses Mhike said everything is set for the opening of schools.\n\nIm happy to say we are ready for the opening of schools. On Monday, I had a management meeting at the Harare International Conference Centre, which was attended by our senior management, including the Provincial Education Directors, District Schools Inspectors, and executive leaders from the National Association of Secondary Heads (Nash) and the National Association of Primary Heads (Naph), where we discussed the issue of schools opening. The message was emphatically clear that we are ready for the opening of schools for the first term of 2025, said Mhike.\n\nHe said that to enhance education delivery, the ministry is on a drive to procure operational vehicles for schools.\n\nOne of the concerns we raised in 2024 was that the majority of our schools do not have operational vehicles. Since we highlighted this, Treasury has been able to buy some vehicles for us. This is an ongoing process. Initially, we were provided with 30 vehicles, and we got another 15 during the last quarter of the year. This week, we have been able to deploy another 15 vehicles. Basically, 90 percent of the deployments are going to rural districts, and we will be using them for monitoring programmes, he said.\n\nMhike stressed the need for a robust monitoring programme for teaching and learning to deliver quality education. He noted that some teaching and learning have not been evaluated in some schools for more than a decade due to a shortage of operational vehicles.\n\nWe are not done; we will continue to lobby Treasury so that we get more vehicles to improve the monitoring of teaching and learning in schools, he said.\n\nAs schools heighten preparations for the opening, Mhike said a multi-pronged approach will be key in delivering quality education. He mentioned that while Treasury budgets for the provision of teaching and learning materials, the ministrys partners have also pledged to provide resources to help deliver quality education.\n\nEven parents, through the Schools Development Committees (SDCs), are coming on board to assist our schools to ensure they have adequate resources, he said.\n\nMhike reminded parents and guardians of their responsibility to pay fees. The law prohibits school authorities from sending away pupils over non-payment of fees.\n\nOur issue is very simple on payment of fees; that obligation must rest with parents. Schools must not chase away pupils whose parents have not paid fees. Parents should engage schools where they cannot pay fees in full and come up with payment plans. We dont want learners whose fees are not paid up when schools close, said Mhike.\n\nHe also urged stakeholders in the education sector to take caution as the schools reopening coincides with heavy rains being received in most parts of the country. In the past, education authorities in Gwanda, Matabeleland South, died after their vehicle was swept away as they attempted to cross a flooded river.\n\nWe are opening schools during the rainy season. We have said to our communities that let us be extra vigilant. We dont want pupils to be crossing flooded rivers. Also, school authorities should assess the infrastructure in our schools; we dont want any mishaps happening in our schools. All we are saying is let us be mindful and weather-conscious as we open schools, he said.\n\nMeanwhile, in a statement, the Ministry said that as schools reopen, the government will be rolling out the Heritage-Based Education Curriculum while schools have been cautioned against declining the ZiG.\n\nSchool authorities are reminded that the Zimbabwe Gold (ZiG) remains a legal tender of transaction in schools. It is a key basis of transaction in the payment of fees and levies and procurement of assets, among the basket of other currencies. Parents and guardians must pay fees and levies in the currency of their choice, and not exclusively in a certain currency, especially the US dollar, read the statement.\n\nZimbabwe Gold\n\nThe ministry said it will continue to work with other Government agencies to ensure compliance. It also stated that parents must not be forced to buy uniforms from schools.\n\nSchools are allowed to run uniform production units as commercial ventures without compelling parents and guardians to procure only in schools. Parents are free to purchase at competitive advantage without being coerced to get them only from the schools. Schools are duty-bound to specify school uniforms, appropriate colours, and shades to parents and guardians to facilitate their choice of service providers, reads the statement.\n\nThe ministry encouraged school authorities to continue enrolling school-aged children so that no pupil is left behind.\n\nAdult learners should also be assisted to access non-formal education. Furthermore, school authorities should give pupils their Grade 7, O, and A-level results as soon as they are released. Withholding of pupils results is not permissible. The contract of undertaking public examinations in Zimbabwe is between the Zimbabwe Schools Examination Council and the candidates, while the obligation to pay fees and levies remains with the parents and guardians, reads the statement.\n\n@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/tht.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  THE Government has announced that all systems are in place for a smooth opening of schools on Tuesday, with the Treasury equipping the Ministry of Primary and Secondary Education with operational vehicles to monitor teaching and learning. Schools open for the First Term of 2025 on January 14, and parents have been urged […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "Humiliating defeat highlights need for fair selection in Zimbabwe Cricket",
            "url": "https://www.chronicle.co.zw/humiliating-defeat-highlights-need-for-fair-selection-in-zimbabwe-cricket/",
            "content": "Brandon Moyo,[emailprotected]\n\nZIMBABWES humiliating defeat across all three formats against Afghanistan has cast a long shadow over the team and, more significantly, the selection panel. Critics have long accused selectors of bias and overlooking deserving players, and this series loss has only amplified these concerns.\n\nThe New Years Day Test at Queens Sports Club proved a particularly devastating blow. The Chevrons inexplicably squandered a winning position, ultimately succumbing to a 72-run defeat within the first 13 minutes of the final day. This crushing loss sealed a disastrous series, following 2-1 losses in both the ODI and T20I series played at Harare Sports Club.\n\nNyasha Mayavo\n\nPersistent batting woes plagued the team throughout the tour. Even on a flat wicket during the Boxing Day Test, most batters failed to capitalise on favourable conditions. However, there were some bright spots. Sean Williams, Craig Ervine, Brian Bennett, and debutant Ben Curran all impressed, with the former three scoring centuries and Curran contributing a valuable half-century.\n\nThe inclusion of Sikandar Raza in the second Test brought a slight improvement in Zimbabwes performance. Once again, it was the experienced players who shouldered the burden, with Ervine and Raza contributing half-centuries in the first innings. Williams, battling a back injury, valiantly scored 49 runs before being dismissed. In the second innings, Ervine again reached 50, while Curran and Raza provided valuable support with scores of 38 runs each. However, these contributions were largely overshadowed by the continued struggles of the other batters.\n\nThis series highlights the urgent need for the David Mutendera-led ZC selection panel to re-evaluate its approach. Its time to prioritise performance and merit, discarding players who consistently fail to deliver and giving opportunities to deserving domestic cricketers. While wholesale changes arent necessary, the team needs a fresh injection of talent.\n\nAinsley Ndlovu\n\nWith the Ireland Test on the horizon, the selection committee must prioritise performance and transparency. The upcoming match, scheduled for February 6th at Queens Sports Club, demands a selection process based purely on merit. This will not only strengthen the team but also rebuild trust and faith in Zimbabwean cricket.\n\nNick Welch, whose impressive domestic form has been undeniable, deserves serious consideration for the Ireland Test. Welch, the top run-scorer in the Logan Cup with a remarkable average of 68, has consistently delivered for his Mega Market Mountaineers side. He possesses the qualities to become a cornerstone of the Zimbabwean batting order. Jonathan Campbell, who was included in the Afghanistan series, also warrants selection based on his strong domestic performances. With Williams an injury doubt for the Ireland Test, Campbell has to be up for consideration to make his much-awaited red-ball cricket debut for the Chevrons. He has shown the right middle-order temperament and with other batters like Dion Myers misfiring, all things fair and equal, the 27-year-old has to be up for consideration.\n\nAnother strong contender for a Test debut is wicket-keeper/batter Nyasha Mayavo.\n\nErnest Masuku\n\nThe Rhinos keeper has enjoyed a successful Logan Cup campaign, currently ranked seventh among the run-scorers. He has also effected six dismissals behind the stumps. In seven innings, Mayavo has amassed 308 runs at an impressive average of 61.60, including three half-centuries. His strong performances make him a compelling candidate to replace Joylord Gumbie, whose recent performances have been underwhelming.\n\nZimbabwe recently handed Test debuts to the fast-bowling duo of Newman Nyamhuri and Trevor Gwandu against Afghanistan. While not detracting from the talents of these young bowlers, this decision has raised eyebrows. Experienced campaigner Victor Nyauchi, who claimed a five-wicket haul in the previous Test at Queens Sports Club, was inexplicably overlooked. Notably, Nyamhuri and Gwandu are both products of the Elton Chigumbura Academy, raising concerns about potential conflicts of interest given Chigumburas role as a national selector.\n\nIf hard work and consistent performances were the sole criteria, Ernest Masuku and Ainsley Ndlovu would undoubtedly be in contention for selection. These two players have been stalwarts of the Tuskers for several seasons and have consistently demonstrated their all-round abilities. It is disheartening to see some players receive multiple opportunities while others, despite excelling domestically, are continually overlooked. A merit-based selection process is crucial for the growth and development of Zimbabwean cricket.\n\n@brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jkghhkkh.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com  ZIMBABWE’S humiliating defeat across all three formats against Afghanistan has cast a long shadow over the team and, more significantly, the selection panel. Critics have long accused selectors of bias and overlooking deserving players, and this series loss has only amplified these concerns. The New Year’s Day Test at Queens Sports Club proved […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "Movie-style heists expose gaps in security training and preparedness…‘Rope in ex-soldiers  for cash-in-transit’",
            "url": "https://www.chronicle.co.zw/movie-style-heists-expose-gaps-in-security-training-and-preparedness-rope-in-ex-soldiers-for-cash-in-transit/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nINADEQUATE training and a lack of preparedness are leaving security personnel dangerously vulnerable to armed robberies, warns Ishmael Jassat, a security expert with over 40 years of experience in specialised forces. Jassat, whose company provides VIP protection and advanced security training, emphasises that effective security goes beyond mere presence. It demands rigorous training, heightened situational awareness, and the ability to respond decisively to threats.\n\nJassat expressed alarm at the trend of inaction during recent robberies. In over 90 percent of these incidents, he observed, security guards failed to return fire, and in many cases, were even disarmed.\n\nA prime example is the brazen daylight heist last October where six armed men executed a Hollywood-style robbery of an Ecobank branch in the city centre, making off with over US$4 million.\n\nThis alarming trend continued in early December when armed robbers stormed United Refineries in the Kelvin Industrial Area, escaping with over US$10 000 and a substantial amount of South African Rand. The meticulously planned heist saw the intruders breach the companys security, immobilize the guards, and methodically plunder the administration offices.\n\nJust recently, a chilling incident unfolded at Choppies Luveve Supermarket. When a gunshot rang out during a robbery, the security guard panicked and fled, leaving the store at the mercy of the robbers who escaped with US$1 000 cash before vanishing into the night.\n\nA crucial recommendation I would like to emphasise is the necessity of employing security personnel with experience in firearms for cash-in-transit duties. Specifically, individuals such as ex-army officers, former police officers, and members of specialised units like the support unit and Criminal Investigation Department (CID) are better equipped to handle the complexities of engagements with seasoned criminals. Their training and experience instil confidence in their ability to confront threats head-on, said Jassat.\n\nHe stressed that firearms proficiency, particularly in an urban environment, is a crucial factor when selecting security guards. This skill set must be honed and maintained at the highest level, with regular training sessions held at least every six weeks. Former Officer Commanding Bulawayo police, Commissioner Patton Mbangwa, highlighted in 2021, following a raid on a CIT vehicle at Choppies Parklands, that most security companies in the city were inadequately equipped to combat criminals.\n\nIn short, Jassat stated, if one does not possess an advanced firearms proficiency certificate, they should not be on the front lines. There is a well-known saying in the close protection industry, particularly among special forces, that goes: In most cases, for every nine deployed, four shouldnt be there; the other three are just running targets, and theres only one or two who know what theyre doing.\n\nHe said the statement underscores the paramount importance of professional training, emphasising that quality and proficiency cannot be compromised.\n\nIn addition to personnel training, I must highlight a critical observation regarding the quality of the main bullion vehicles used in cash-in-transit operations. The vehicles currently employed are not conducive for the task at hand. They should be upgraded to be bulletproof with run-flat tyres and other necessary enhancements to withstand potential threats effectively, said Mr Jassat.\n\nThe Government has urged security companies to embrace modern technologies to enhance the efficiency of services. As the nation strives to attain the goals set out in Vision 2030, the security industry must align its innovations with this vision. Zimbabwe has been experiencing a major economic boom, witnessed by an influx of both local and foreign investments, making security critical for the protection of businesses.\n\nSpeaking at the Zimbabwe Security Companies Summit in Harare last year, Vice-President Kembo Mohadi said the influx of businesses into the country was not just a trend but a clear sign that the country is positioning itself as a beacon of opportunity, security, and stability in the region as it moves forward to achieve Vision 2030 aspirations. VP Mohadi said in an era defined by globalisation and technological advancements, the stakeholders within the security industry play a critical role in creating an environment where businesses can thrive without fear, where investments can flourish, and where the confidence of foreign investors is secure.\n\nVP Mohadi said the growth of the security industry is integral to the protection of investments, both domestic and foreign. He said it is the security sector that guarantees President Mnangagwas clarion call that, Zimbabwe is open for business. The recently gazetted Statutory Instrument 58 of 2024: Private Investigators and Security Guards (General Amendment), is a testament to the Governments commitment to having a professional private security sector and responsiveness to the sectors calls.\n\nThe instrument serves to elevate operational standards, enhance accountability, and ensure that security companies operate within a robust legal framework. VP Mohadi said a well-functioning security industry is not a luxury but a necessity, as it reassures investors that their assets, both tangible and intangible, are safeguarded. It also fosters an atmosphere of trust and stability, where businesses can operate without a sense of insecurity. Hence, the Government acknowledges the vital role played by security companies in ensuring Zimbabwe remains an attractive destination for investment in a competitive global market.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/aq11.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw INADEQUATE training and a lack of preparedness are leaving security personnel dangerously vulnerable to armed robberies, warns Ishmael Jassat, a security expert with over 40 years of experience in specialised forces. Jassat, whose company provides VIP protection and advanced security training, emphasises that effective security goes beyond mere presence. It demands rigorous […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "Miss & Mr Rural Zimbabwe search shifts to Matebeleland North",
            "url": "https://www.chronicle.co.zw/miss-mr-rural-zimbabwe-search-shifts-to-matebeleland-north/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nTHE nationwide search for Mr and Miss Rural Zimbabwe continues its inclusive journey, ensuring every child and province has an equal opportunity to shine.\n\nFollowing the successful Matabeleland South provincial finals, the spotlight now shifts to Matabeleland North, where the provincial semi-finals are set to take place in Tsholotsho.\n\nIphithule Yonenhle Mpofu\n\nThe provincial finals will be held in Lupane at the end of February, promising an exciting display of talent, culture, and rural charm.\n\nThis development comes on the heels of Matabeleland Souths provincial finals, which crowned Yolanda Nkomo as Miss Rural and Privilege Sibanda as Mr Rural.\n\nAccording to Sipho Mazibuko, founder of the pageant, the auditions for Matabeleland North province have been successfully completed, paving the way for the next stage of the competition.\n\nWe are done auditioning those willing to participate in the pageant. The pageant is open to all aged between 18 and 25 who have been based in rural areas since birth. All participants must have at least five O-level subjects or more, have never been married, and have no children. We managed to get 46 models, three of whom are boys. We also realised that the number of models we have is overwhelming, so instead of having a final, we will first have a semi-final to ensure a fair contest.\n\nAwakhiwe Khanye\n\nWe are grateful to the provincial heads from the Ministry of Youth, Ministry of Sport, Recreation, Arts and Culture, Ministry of Women Affairs, Tourism, and all the DDAs who helped with the auditioning. We are, however, going to continue auditioning boys as we want to have a proportional number since we only have three who are all from Nkayi, said Mazibuko.\n\nShe said she is working with the Ministry of Sport, Recreation, Arts and Culture, the Ministry of Youth Empowerment and Vocational Training, and the Ministry of Womens Affairs, which are actively involved in searching for the right contestants.\n\nWe started our search last year and we are now ready to roll. The office of the Matabeleland North Provincial Affairs and Devolution Ministry will be assisting with coming up with the budget for the show by engaging miners and other sectors as we push the pageant.\n\nFreeman Moyo\n\nWe are also incorporating a designer who will make attires out of grass. We are going to showcase the rich culture of Matabeleland North and focus on the Tonga culture. We are also excited that the chief of the San people has agreed to see me so that we get representatives from that tribe too, she said.\n\nThe pageant will also serve as a platform to empower local artistes, as various artistes from Matabeleland North are set to perform during the finals and at the musical gala after-party. These include Sea Girl, Skhumz Moonwalker, and ZheZhington.\n\nThey will also be joined by some artists from Matabeleland South. Mazibuko is also considering inviting Harare artiste Killer T to perform on the day.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/vbbvbvbvbv.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com  THE nationwide search for Mr and Miss Rural Zimbabwe continues its inclusive journey, ensuring every child and province has an equal opportunity to shine.  Following the successful Matabeleland South provincial finals, the spotlight now shifts to Matabeleland North, where the provincial semi-finals are set to take place in Tsholotsho. The provincial finals will […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "Bribe seeking magistrate jailed 7 years",
            "url": "https://www.chronicle.co.zw/bribe-seeking-magistrate-jailed-7-years/",
            "content": "Trish Mukwazo,[emailprotected]\n\nAS a practising magistrate in Gwanda, Matabeleland South Province, Talent Phiri was no stranger to the judicial process. He routinely presided over cases, passing judgment on a wide range of offences. However, last year, Phiri found himself on the other side of the law, standing accused of soliciting and accepting a bribe from a Gwanda businessman in order to influence the outcome of a case.\n\nYesterday, the disgraced judicial officer was sentenced to seven years in prison by Harare Regional Magistrate, Farai Gwitima. Bulawayo magistrates had recused themselves from the case.This reporter briefly encountered Phiri before sentencing.\n\nIm aware that Ill be in the headlines tomorrow, Phiri said before adding, No, dont worry, just do your job.\n\nPhiri, aged 35, will serve five years in prison after two years of his sentence were suspended on the condition that he does not commit a similar offence involving dishonesty within the next five years.\n\nMagistrate Gwitima stressed that a lighter sentence would undermine public confidence in the justice system.\n\nThe offender abused his position as a provincial magistrate when he demanded a bribe in order to cancel a warrant of arrest. The degree of moral decadence is high, and the courts will not tolerate corruption. The aggravating factors in this case outweigh the mitigating ones. It is vital to point out the seriousness of this crime, said the magistrate.\n\nIn passing the sentence, Magistrate Gwitima said the courts were guided by previous convictions of prosecutors and high court judges who received penalties for soliciting bribes.\n\nA public prosecutor was sentenced to five years imprisonment with two years suspended for soliciting a bribe of US$100.\n\nPhiris lawyer, Prince Butshe Dube, pleaded for leniency.\n\nThe magistrate considered that a heavy sentence would severely impact Phiri, who had already lost his job, is young, and has a family dependent on him. The court hoped Phiri would reform and reintegrate into society, while also acknowledging the victims anxiety and financial loss of US$2 500.\n\nProsecutor Acumen Khupe explained that Phiri had granted an interim protection order to Qiniso Ncube against her ex-husband, Lungisani Two minutes Ncube, on August 27. Phiri then called Ncube on 4 September, falsely claiming high-level officials wanted him jailed, and demanded a US$3 000 bribe to prevent his imprisonment.\n\nThe complainant informed Phiri that he would try to raise the money, but Phiri persistently called to demand it, said Khupe.\n\nDuring a phone conversation, Ncube negotiated the bribe amount down to US$2 500. Phiri instructed him to deliver the money to his residence the next morning. Ncube reported the matter to the police, providing audio recordings. A sting operation was set up, and Phiri was arrested at his residence after accepting the trap money, which was recovered from his boxer shorts.\n\nIn his closing arguments, Khupe emphasised the seriousness of Phiris actions, stating that Phiri abused his position as a judicial officer to exploit court proceedings for personal gain.\n\nSuch conduct erodes public confidence in the justice system and warrants a fitting sentence, said Mr Khupe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jfgjy.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com AS a practising magistrate in Gwanda, Matabeleland South Province, Talent Phiri was no stranger to the judicial process. He routinely presided over cases, passing judgment on a wide range of offences. However, last year, Phiri found himself on the other side of the law, standing accused of soliciting and accepting a bribe […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        },
        {
            "title": "Zarah Esat unveils ambitious 2025 expansion plans",
            "url": "https://www.chronicle.co.zw/zarah-esat-unveils-ambitious-2025-expansion-plans/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nZARAH ESAT, the visionary force behind Thee Beauty Co (Lashd), is revolutionising the beauty industry with her expertise in single eyelashes.\n\nWith a client roster that boasts A-listers like Kimberly Richards, Kyla Blac, and rising star Ms Thandi, Esats services are in high demand.\n\nHaving entered the industry at just 18, Esat has honed her craft, mastering an array of lash styles, including doll eyes, wet look, classic cat eye, and volume cat eye. Her comprehensive services also include lash baths and removals.\n\nEsat is poised to take her business to new heights this year, introducing innovative techniques and styles that promise to elevate the lash game, cementing her status as a trailblazer in the beauty industry.\n\nFor 2025, I plan on introducing new techniques and styles of eyelashes to elevate my eyelash artistry and continue providing my clients with the best services, she said.\n\nAs part of her ambitions, Esat also plans to share her knowledge and expertise with others.\n\nIm eager to teach my craft to other people to help them achieve their goals, she said.\n\nZarah Esat\n\nShe revealed that she is currently working on releasing custom sets, which are lashes tailored specifically to suit certain eye shapes.\n\nI am currently working on releasing a custom set that will cater to my clients styles and preferences, she said.\n\nAdditionally, she plans to take her eyelash services to cities across the country to reach a wider clientele base, as she usually offers her services to people in and around Bulawayo and Harare.\n\nIn 2025, I will be travelling to all cities throughout Zimbabwe, offering my services and expanding my reach to build a wider clientele base, she said.\n\nShe took a moment to reflect on last years explosive growth, saying despite her high expectations, the demand for her services surpassed all projections, particularly during the festive season.\n\nBulawayos vibrant event scene, featuring high-profile events like the Piano Festival, Mega-Fest Awards Ceremony, Doek and Jeans, and numerous weddings, created a surge in demand for Esats expertise.\n\nLadies sought her out to ensure they looked stunning for these occasions, leading to a significant increase in her client base.\n\nTo manage the overwhelming demand, Esat relies on her clients cooperation and punctuality. Despite facing challenges like copycat competitors and difficult clients, her dedication and perseverance have cemented her position as a leading beauty expert.\n\nHer hard work paid off when she received her first award for Best Lash Tech at the 2024 Makakosha Business Network (MBN) Glam Awards in April.\n\nThis recognition solidified Esats reputation as a connoisseur in the beauty industry, and shes poised for continued success in the years to come.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dfgdhggyf-1.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com  ZARAH ESAT, the visionary force behind Thee Beauty Co (Lash’d), is revolutionising the beauty industry with her expertise in single eyelashes.  With a client roster that boasts A-listers like Kimberly Richards, Kyla Blac, and rising star Ms Thandi, Esat’s services are in high demand. Having entered the industry at just 18, Esat […]",
            "time": "08:38",
            "date": "11 Jan 2025"
        }
    ]
}