{
    "news": [
        {
            "title": "Azerbaijan Airlines plane crashes in Kazakhstan, 38 dead, 29 injured",
            "url": "https://www.chronicle.co.zw/azerbaijan-airlines-plane-crashes-in-kazakhstan-38-dead-29-injured/",
            "content": "Mariya Gordeyeva, Gleb Stolyarov and Nailia Bagirova\n\nSummary\n\nASTANA/TBILISI/BAKU, Dec 25 (Reuters)  An Embraer (EMBR3.SA), opens new tab passenger jet flying from Azerbaijan to Russia crashed near the city of Aktau in Kazakhstan on Wednesday, killing 38 people while 29 survivors received hospital treatment, Kazakh authorities said.\n\nAzerbaijan Airlines flight J2-8243 had flown hundreds of miles off its scheduled route to crash on the opposite shore of the Caspian Sea, after what Russias aviation watchdog said was an emergency that may have been caused by a bird strike. But an aviation expert suggested that cause seemed unlikely.\n\nOfficials did not immediately explain why it had crossed the sea, but the crash came shortly after drone strikes hit southern Russia. Drone activity has shut airports in the area in the past and the nearest Russian airport on the planes flight path was closed on Wednesday morning.\n\nAzerbaijan President Ilham Aliyev said according to information he had received, the plane changed course due to poor weather, but he added the cause of the crash was unknown and must be fully investigated.\n\nThis is a great tragedy that has become a tremendous sorrow for the Azerbaijani people, he said.\n\nVideo of the crash showed the plane descending rapidly before bursting into flames as it hit the seashore, and thick black smoke then rising. Bloodied and bruised passengers could be seen stumbling from a piece of the fuselage that had remained intact.\n\nA map showing the path a passengers jet took from Azerbaijan to Russia, including a length stretch where the exact path was unknown before it crashed.\n\nReuters was able to verify from visible landmarks that the video was filmed on the Caspian shore near Aktau.\n\nSixty-two passengers and five crew were aboard. The death toll was disclosed by Deputy Prime Minister Kanat Bozumbayev in a meeting with an Azerbaijani delegation in Aktau, Russian news agency Interfax reported.\n\nKazakhstans emergencies ministry said in a statement that fire services had put out the blaze and that the survivors, including two children, were being treated at a nearby hospital. The bodies of the dead were being recovered.\n\nAzerbaijan Airlines said the Embraer 190 jet was flying from Baku to Grozny, capital of the Chechnya region in southern Russia, but had been forced to make an emergency landing around 3 kilometers (1.8 miles) from Aktau in Kazakhstan.\n\nPreliminary: after a collision with birds, due to an emergency situation on board, its commander decided to go to an alternate airfield  Aktau was chosen, Russias aviation watchdog said on Telegram.\n\nBut a collision with birds typically results in the plane landing in the nearest available field, said Richard Aboulafia, analyst at consultancy AeroDynamic Advisory. You can lose control of the plane, but you dont fly wildly off course as a consequence.\n\nRUSSIAN AIRPORT ON FLIGHT PATH WAS SHUT\n\nAktau is on the opposite shore of the Caspian Sea from Azerbaijan and Russia. Commercial aviation-tracking websites tracked the flight flying north on its scheduled route along the west coast before its flight path was no longer recorded. It then reappeared on the east coast, circling near Aktau airport before crashing into the beach.\n\nAuthorities in two Russian regions adjacent to Chechnya, Ingushetia and North Ossetia, reported drone strikes on Wednesday morning.\n\nAn official at Makhachkala airport in Russia on the west coast of the Caspian, the airport closest to where the flight disappeared from tracking, told Reuters it had been closed to incoming traffic for several hours on Wednesday morning. Reuters could not immediately reach officials at the airport in Grozny.\n\nAuthorities in Kazakhstan said a government commission had been set up to investigate what had happened and its members ordered to fly to the site and ensure that the families of the dead and injured were getting the help they needed.\n\nKazakhstan would cooperate with Azerbaijan on the investigation, the government said. Azerbaijan Airlines suspended flights from Baku to Russias Chechnya region until the investigation is complete. Russias state TASS news agency reported, citing the company.\n\nPresident Vladimir Putin expressed his condolences. Aliyev, the president of Azerbaijan, had decided to return home from Russia where he had been due to attend a summit on Wednesday, his office said.\n\nRamzan Kadyrov, the Kremlin-backed leader of Chechnya, expressed his condolences in a statement and said some of those being treated in hospital were in an extremely serious condition and that he and others would pray for their rapid recovery.\n\nIn a statement, planemaker Embraer expressed its condolences and said it would support authorities efforts.\n\nThe Reuters Daily Briefing newsletter provides all the news you need to start your day. Sign up here.\n\nReporting by Mariya Gordeyeva and Tamara Vaal in Astana, Nailia Bagirova in Baku and Ksenia Orlova in Moscow Additional reporting by Nailia Bagirova, David Gaffen, Ronald Popeski and Alberto Alerigi Writing by Andrew Osborn, Peter Graff and Rod Nickel, Editing by Emelia Sithole-Matarise, Ed Osmond and Howard Goller.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/USPKCMPSXJILFMFRJTDIA6OTA4-680x380.jpg",
            "description": "Mariya Gordeyeva, Gleb Stolyarov and Nailia Bagirova   Summary Plane diverted due to poor weather, cause still unknown Bird strike may have caused emergency, says aviation watchdog Aviation expert questions bird strike theory Nearest Russian airport on flight path was shut Crash came after southern Russia hit by drone strikes. ASTANA/TBILISI/BAKU, Dec 25 (Reuters) – […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "President urges restraint over Christmas holiday",
            "url": "https://www.chronicle.co.zw/president-urges-restraint-over-x-mas-holiday/",
            "content": "Wallace Ruzvidzo,Harare Bureau\n\nAs Zimbabwe celebrates Christmas and prepares for a new year President Mnangagwa has called for responsible behaviour among the general citizenry.\n\nThe President spread some holiday cheer by wishing Zimbabweans a merry Christmas and a prosperous new year.\n\nIn his Christmas and new year message delivered at State House at the weekend, the President urged the general citizenry to celebrate responsibly and safely, especially when travelling.\n\nPresident Mnangagwa expressed optimism for the countrys future, stating that Zimbabwe will achieve greater prosperity in the coming year.\n\nAs we celebrate this important national holiday, let us do so responsibly and safely, especially for the travelling and commuting public.\n\non my own behalf, that of Government and indeed my family, I wish all fellow citizens, at home and abroad, a Merry Christmas and a prosperous 2025. May the New Year ahead bring hope and greater prosperity for our motherland, Zimbabwe, he said.\n\nIn Zimbabwe, Christmas is a time for family, unity, and spirituality.\n\nZimbabweans are embracing the holiday season with enthusiasm and optimism, reflecting the countrys rich cultural heritage and strong sense of community.\n\nThe President said Zimbabwe remained a composite and solid unitary state despite its diverse norms, customs, languages and culture.\n\nFrom Zambezi to Limpopo, from Plumtree to Mutare, and across the most remote villages in our country, we sing with pride one national anthem and fly one national flag. We are diverse but one.\n\nTo this end, this past week saw my administration concretise the Constitutionally enshrined obligation to give rights to every Zimbabwean citizen to hold and occupy agricultural land.\n\nHence, the bold decision to empower the beneficiaries of the Land Reform Programme through the issuance of Deeds of Transfer that will unlock the value of our land.\n\nThrough this historic act, these new tenure documents will be issued to the over 23 500 A2 and over 360 000 A1 farmers.\n\nThe celebration of this years Unity Day is, therefore, equally a jubilant occasion affirming that the land is now irreversibly with its people, and the people with their land, said President Mnangagwa.\n\nPresident Mnangagwa\n\nUnity, patriotism, peace, love and respect, he said, remained indispensable values in the countrys development matrix.\n\nI, therefore, call upon all citizens to commemorate this National Unity Day with sober reflections and recommit to the rich national heritage embodied in the historic Accord of 1987.\n\nNever, never, never again, should anything ever divide us.\n\nUnited we must stand, strong and solid as the walls of Great Zimbabwe, from which we derive our nations name.\n\nHand in hand, in unity, from village to the provincial level; sector by sector and industry by industry, Vision 2030 shall surely become a reality, said President Mnangagwa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jyukiyuiu-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau As Zimbabwe celebrates Christmas and prepares for a new year President Mnangagwa has called for responsible behaviour among the general citizenry. The President spread some holiday cheer by wishing Zimbabweans a merry Christmas and a prosperous new year. In his Christmas and new year message delivered at State House at the weekend, […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Traffic authorities call for zero carnage on roads",
            "url": "https://www.chronicle.co.zw/traffic-authorities-call-for-zero-carnage-on-roads/",
            "content": "Nqobile Tshili,[emailprotected]\n\nMOTORISTS have been urged to exercise caution on the roads during the festive season amid concerns that human error remains the leading cause of road accidents in Zimbabwe.\n\nStatistics reveal that a road accident occurs every 15 minutes, with an average of five fatalities daily.\n\nThe country loses approximately US$400 million annually due to road traffic accidents, with most victims being economically productive individuals.\n\nAs citizens travel for the Christmas and New year holidays, authorities have called for strict adherence to road rules and regulations to reduce carnage on the roads.\n\nTo raise awareness, the Zimbabwe Republic Police (ZRP) in collaboration with the Traffic Safety Council of Zimbabwe (TSC) and other stakeholders, yesterday conducted a road safety campaign along the Bulawayo-Gwanda Highway.\n\nMembers of the campaign team led by the officer commanding Bulawayo Province, Commissioner Wiklef Makamache, was stationed at Kensington police roadblock.\n\nDuring the event, motorists were cautioned about common road hazards, including stray animals and also warned against drinking and driving.\n\nToday, we are on the road meeting travellers. Some are heading to rural areas while others are travelling between cities. Our message is clear. We want safety on the roads and as such we should all observe road rules and regulations to avoid accidents. We should reduce the carnage on our roads cause mainly by reckless driving,said Comm Makamache.\n\nHe attributed most road accidents to human negligence and urged citizens to remain vigilant, especially during this festive season.\n\nComm Makamache also warned against criminal activities, noting that some individuals exploit the festive season to commit crimes like robbery and rape.\n\nTo the ordinary people, we say zero tolerance to crime. Criminals should watch out as we are in full force and our message is clearrespect human life, he said.\n\nTSC board member Mrs Tambudzai Madzivire emphasised the importance of driving to arrive safely.\n\nWe are here to promote road safety. Safety should always come first because there is no second chance if you fail to drive safely. We urge drivers to remain alert, avoid fatigue and be cautious of hazards like cattle on the roads, she said.\n\nMrs Madzivire said accidents cause economic losses and also strain the healthcare services.\n\nPublic service vehicle driver Mr Mengezi Ncube commended the campaign, stressing the need for adherence to road safety measures.\n\nThis campaign is crucial as it reminds us to drive safely by observing road rules and regulations. Potholes however remain a major concern, especially at night as drivers often try to avoid them resulting in them encroaching onto the lane of traffic coming from the opposite direction, he said.\n\nDuring the campaign motorists were given Ministry of Transport and Infrastructural Development fliers on the 10-point Decade of Action for Road Safety tips. The tips are: dont drink and drive, avoid using cellphones while driving, ensure your vehicle is roadworthy, obey road signs and markings, check tyre pressure regularly, carry a reflective triangle and vest, have a spare wheel, spanner and jack, take frequent rest breaks, invest in a fire extinguisher and obey the speed limit.\n\n-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/bngf.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw  MOTORISTS have been urged to exercise caution on the roads during the festive season amid concerns that human error remains the leading cause of road accidents in Zimbabwe. Statistics reveal that a road accident occurs every 15 minutes, with an average of five fatalities daily.  The country loses approximately US$400 million annually due […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Zimbabwean celebrities share Christmas Day plans",
            "url": "https://www.chronicle.co.zw/zimbabwean-celebrities-share-christmas-day-plans/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nAS people are out and about preparing for Christmas Day, some are travelling to be with their families, Zimbabwean celebrities are not left out in the rush as they too have plans for the day.\n\nBelow is a glimpse of what some of Zimbabwes celebrities have in store as the jingle bells ring.Jeys Marabini  Jazz Legend\n\nJeys Marabini\n\nFor Jeys Marabini, Christmas is a day to enjoy and celebrate with family. It is a time for thanksgiving and being grateful to be alive.\n\nChristmas is definitely a day for the family, he said.\n\nLaDee  Musician\n\nThe lady with the people at heart, LaDee said she will be spending Christmas with her family as the year has been so hectic that she could hardly spend time with them. She said she did not release any songs for December but has something fresh planned for her fans throughout 2025.\n\nLaDee\n\nLaDee also revealed that she has surprises for some of her fans, who will be recipients of some goodies. She said after the festive season she will be celebrating her birthday with family and friends.\n\nDJ Mzoe\n\nDJ Mzoe will be very busy on Christmas Day as he will be at work and at the same time trying to find time for the family. He said as a DJ, he will visit childrens carnivals around the city, playing music for them and giving out a few presents. He highlights that the first part of the day will be spent with family before he joins children around the city. In the evening, he will meet fans at KoSamuriwo Pub and Grill, where he will play fans favourite hits.\n\nMzoe7  MusicianOn Christmas Day, Zimbabwes Maradona will celebrate with families from all over Zimbabwe at Esigodini, Silver Diamond Sports Club, where there will be a family show. He will be joined by Ma9ine and Jaycee.\n\nMzoe 7\n\nSipho Mercent  Social Media InfluencerFor content creator Sipho, known to many for his signature chant Mina indaba zabantu ngyazizonda, Christmas will be spent with family and his fans. His morning will kick off with an appearance at Blessed Fashions followed by lunch with his family. In the evening, Sipho will mingle with his fans at KoSamuriwo Pub and Grill.\n\nSipho Mercent\n\nDJ Prince EskhosiniDJ Prince Eskhosini says he will be with his fans on Christmas Day. He has two bookings, one being a family function and the other a family fun day.\n\nDJ Prince Eskhosini\n\nI have a very supportive family that understands that I get to spend more time with my fans than with them, so I will definitely make up for that on Boxing Day and be with the family, he said.\n\nWelsh The Stylist  Fashion DesignerThe designer, famous for his vintage and unique designs, said Christmas Day will be a day he dedicates solely to his family.\n\nIyasa  Dance GroupPopular in Zimbabwe and beyond its borders, the group Iyasa will be doing what they know best  performing on Christmas Day. The group will head to Mberengwa where they will perform at the Tshuma family Christmas celebrations.\n\nWe will be working on Christmas Day, but we will definitely be with our families in January. Work comes first, said Mercy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/4ehj.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com AS people are out and about preparing for Christmas Day, some are travelling to be with their families, Zimbabwean celebrities are not left out in the rush as they too have plans for the day. Below is a glimpse of what some of Zimbabwe’s celebrities have in store as the jingle bells […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Communities must embrace correctional centres",
            "url": "https://www.chronicle.co.zw/communities-must-embrace-correctional-centres/",
            "content": "THE Ministry of Justice, Legal and Parliamentary Affairs and the Zimbabwe Prisons and Correctional Service (ZPCS), are working on establishing community correctional centres to facilitate the effective implementation of the parole system.\n\nZimbabwe has over the years spent resources on rehabilitation of prison inmates to prepare them for reintegration into society as opposed to punishing them.\n\nJustice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi said last week that his ministry in liaison with ZPCS was working on establishing community correction centres to enable ZPCS to effectively implement the parole system.\n\nThe Prisons and Correctional Service Act provides for the establishment of the State Parole Board and sets conditions for the releases of inmates from prison.\n\nAn inmate can be released through a decision by the President, the State Parole Board and the Commissioner-General of Prisons or Justice Minister.\n\nMinister Ziyambi Ziyambi\n\nMinister Ziyambi said effective implementation of the parole system will go a long way in decongesting Zimbabwes prisons.\n\nThe prisons have over the years been running programmes to equip inmates with different skills such as carpentry, welding, sewing, market gardening, livestock farming, building, spray painting and many other such skills to prepare the inmates for life after prison. This has drastically reduced cases of recidivism.\n\nThe establishment of community correctional centres will therefore speed up the inmates reintegration into society while at the same time reducing overcrowding in prisons.\n\nWe want to commend the Justice Ministry and ZPCS for their commitment to transform our prisons into rehabilitation centres for inmates as opposed to places to punish prisoners as was the case before independence.\n\nZimbabwe Prisons and Correctional Services (ZPCS)\n\nPrisoners under the present system are given another chance to contribute to the development of their communities using skills gained while in prison.\n\nPrisons across the country are running thriving farming projects and as such many of them are producing food not just for their own consumption but surplus, for sale.\n\nThe ZPCS is therefore saving Government a lot of money by producing food and other provisions for inmates such as uniforms.\n\nWe want at this juncture to implore communities to embrace the establishment of correctional centres in their areas to facilitate inmates quick reintegration into society.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/06/Untitled-1-copy-472.jpg",
            "description": "THE Ministry of Justice, Legal and Parliamentary Affairs and the Zimbabwe Prisons and Correctional Service (ZPCS), are working on establishing community correctional centres to facilitate the effective implementation of the parole system. Zimbabwe has over the years spent resources on rehabilitation of prison inmates to prepare them for reintegration into society as opposed to punishing […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Improve player quality, Bosso told",
            "url": "https://www.chronicle.co.zw/improve-player-quality-bosso-told/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS 18-year wait for the league title can only be ended by improving the quality of players in the squad, according to two-time league championship winner, Noah Muvindi.\n\nMuvindi had exciting moments in his career, especially with the Bulawayo giants, which saw him lifting two consecutive Premiership championships and many other trophies in 2001 and 2002.\n\nMuvindi is now a keen observer of the local football scene and attributes Bossos struggles to lack of quality players.\n\nTo be honest, Bosso have not had the quality players needed to compete for the league title. When you look at the starting 11 and then the bench, there is a clear lack of depth that can win you a league title. During our days you had two quality players battling for each position, which is not the case now. For example, I personally had Gift Lunga (Jnr) as my competition for the left-back position and sometimes the coach would have a headache on who should start and would ask us to agree on who was to start. I dont think the players the team has now are the quality which can win you a championship, said Muvindi.\n\nHe believes that a strong and balanced squad is essential for winning the league and unfortunately, Bosso have been lacking in that department.\n\nMuvindis comments come at a time when Bosso fans are eagerly waiting for the team to reclaim its former glory.\n\nWith the teams rich history and passionate fan base, there is no doubt that Bosso has the potential to dominate the local football scene once again.\n\nHowever, according to Muvindi, this will require significant investment to get quality players.\n\nBosso needs to attract and retain top talent if they want to compete with the best teams in the league, said Muvindi who started his career at Giants in Division One before moving to Buffaloes two years later.\n\nHe believes Bossos player exodus in 2003 disrupted their dominance in the league and Caf Champions League.\n\nThe team lost Adam Ndlovu (late) and Stewart Murisa, who both joined South African clubs. The following season, it was worse because the team lost Dazzy Kapenya, Thabani Masawi, Siza Khoza, Charles Chilufya, Blessing Gumiso and myself, he said.\n\nThe late Warriors striker Adam Ndlovu\n\nHighlanders quest for league glory is set to suffer a major setback before the start of the next campaign as they are set to lose key players to newly-promoted Scottland FC.\n\nPeter Muduhwa, Godfrey Makaruse, Lynoth Chikuhwa and Marvelous Chigumira are reportedly bound for Scottland FC, leaving Bosso with a daunting task of finding suitable replacements.\n\nThis development comes at a time when Highlanders were showing signs of improvement, particularly in their attacking play.\n\nIn the 2024 season, they scored 43 goals, the third-highest tally in the league.\n\nThe teams attacking prowess was further emphasised by their player, Chikuhwa, winning the Golden Boot award after scoring 17 goals.\n\nLynoth Chikuhwa\n\nHowever, defensive frailties remain a major concern, with Highlanders boasting the 11th-best defence in the league.\n\nThe loss of key players will undoubtedly exacerbate this problem, and Bosso will need to spend money on the transfer market or promote from their development sides to beef up their defence.\n\nThe club leadership is on record stating that they will be beefing up their squad ahead of next season. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hy.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS’ 18-year wait for the league title can only be ended by improving the quality of players in the squad, according to two-time league championship winner, Noah Muvindi. Muvindi had exciting moments in his career, especially with the Bulawayo giants, which saw him lifting two consecutive Premiership championships and many other trophies […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Bulawayo drenched in holiday spirit as last-minute shoppers throng CBD",
            "url": "https://www.chronicle.co.zw/byo-drenched-in-holiday-spirit-as-last-minute-shoppers-throng-cbd/",
            "content": "Chronicle Writers\n\nBULAWAYO was abuzz with activity yesterday as last-minute Christmas shoppers thronged the city, creating a lively and bustling atmosphere while banking halls, supermarkets and beauty salons were packed.\n\nVendors and businesses recorded brisk sales.\n\nIn the central business district (CBD), long queues formed outside banks as people withdrew money to cover festive season expenses. Popular money transfer agents such as Hello Paisa, Mukuru, Homelink, and Western Union were overwhelmed with customers collecting remittances from relatives abroad.\n\nAn elderly woman, Gogo Mpofu, expressed her joy after receiving money from her children overseas. Its heart-warming to receive something from our children abroad, especially during Christmas, she said.\n\nMs Sibongile Dube, who received money from her niece in Canada, said, This will help me cover expenses and enjoy Christmas like everyone else.\n\nMs Joyce Muleya, a 69-year-old pensioner from Ntabazinduna, praised her bank for its reliable service. CBZ has been consistent with pension deposits and the staff is always courteous, she said.\n\nThe city streets were heavily congested with vehicles and pedestrians while vendors at 4th Street marketplace enjoyed booming sales. Christmas shopping has kept me busy all day. The most sought-after items are butternuts, potatoes, tomatoes and cucumbers, said a vendor.\n\nMajor supermarkets like OK, Pick n Pay and Greens were bustling, with shoppers pushing trolleys laden with groceries. Pushcart operators competed for space with cars, ferrying goods to taxi ranks and bus termini.\n\nEdgars Stores chief executive officer, Mr Sevious Mushosho, noted mixed business performance.\n\nVolumes are slightly below expectations, possibly due to the drought and delayed salary payments for civil servants. We hope for better sales as the day progresses, he said.\n\nFast food outlets and shopping malls were similarly crowded while hiking spots were busy as travellers jostled for transport to different destinations.\n\nBeitbridge and Plumtree border posts were teeming with activity as Zimbabweans, popularly known as injiva, returned home to spend Christmas with their families.\n\nAt Beitbridge Border Post, authorities deployed additional staff to manage the influx. Statistics from the Department of Immigration revealed that between December 16 and December 21, a total of 85 846 people entered Zimbabwe, with 75 096 being returning residents. Vehicle traffic was also high, with 3 087 light vehicles, 2 403 buses and 3 525 trucks crossing into the country. Assistant Regional Immigration Officer, Mrs Canisia Magaya, said they were handling an average of 13 976 entries daily.\n\nAlthough traffic has surged, statistics show a slight decline compared to last year. Weve deployed adequate personnel to ensure travellers do not spend long hours at the border, she said.\n\nTravellers commended the introduction of the electronic Temporary Import Permit (eTIP) system, which streamlined vehicle clearance.\n\nThis is a game-changer and has significantly reduced waiting times, said a traveller.\n\nPermanent Secretary in the Ministry of Tourism and Hospitality Industry, Dr Takaruza Munyanyiwa, visited the border to assess operations.\n\nFeedback from travellers has been positive. The categorisation of traffic lanes into cargo, buses, pedestrians and light vehicles has greatly improved efficiency, he said.\n\nPlumtree Border Post saw similar activity as injiva crossed from Botswana. The Zimbabwe Revenue Authority (Zimra) extended operating hours to 24/7 during peak periods to expedite movement.\n\nThe Zimbabwe Revenue Authority (Zimra) advises members of the public who intend to use Plumtree/Ramokgwebana Border Post that operating hours have been extended to 24 hours on the dates listed below. The extension of operating hours is done to facilitate the movement of private travellers during the festive period between Zimbabwe and Botswana,reads a Zimra statement.\n\nThe 24-hour extension ended yesterday and will be operational again on the 4th and 5th of January 2025. Zimra also encouraged travellers to use the eTIP app for vehicle clearance, allowing for smoother border processes.\n\nThe e-TIP is a mobile or web-based application that allows for the application of a TIP for a\n\nforeign-registered private motor vehicle prior to arriving at the port of entry.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgfgfgfg.jpg",
            "description": "Chronicle Writers BULAWAYO was abuzz with activity yesterday as last-minute Christmas shoppers thronged the city, creating a lively and bustling atmosphere while banking halls, supermarkets and beauty salons were packed. Vendors and businesses recorded brisk sales. In the central business district (CBD), long queues formed outside banks as people withdrew money to cover festive season […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Nation assured of adequate grain supply",
            "url": "https://www.chronicle.co.zw/nation-assured-of-adequate-grain-supply/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Grain Millers Association of Zimbabwe (GMAZ) has assured the public of an adequate supply of grain-processed products during this festive season.\n\nIt says it has adequate stocks of essential grain-based commodities to meet demand this festive season unlike in the past.\n\nIn the past, retailers took advantage of shortages of commodities during the festive season to hike prices, thereby dampening the spirit of merry-making. In a statement, GMAZ national chairman, Dr Tafadzwa Musarara, attributed this years achievement to strategic planning and unwavering commitment.\n\nWe are proud to report that the local market is adequately stocked with maize meal, rice, flour, salt and other essentials. The surplus supply has stabilised prices, making these commodities accessible to all at both formal and informal retail outlets, he said.\n\nGMAZ chairman Mr Tafadzwa Musarara\n\nThe 2024 agricultural season posed significant challenges due to prolonged drought conditions, which forced the industry to rely heavily on imported grain.\n\nDespite these hurdles, Dr Musarara said the sector has ensured consistent supply and remains committed to supporting local agriculture through initiatives such as contract farming and exploring additional source markets to maintain affordability.\n\nDr Musarara also expressed gratitude to the Government for its private-led approach to achieving national food security.\n\nThe Governments policies align with international best practices and have enabled us to adapt effectively to these challenges, he said. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/tyt.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com THE Grain Millers Association of Zimbabwe (GMAZ) has assured the public of an adequate supply of grain-processed products during this festive season. It says it has adequate stocks of essential grain-based commodities to meet demand this festive season unlike in the past. In the past, retailers took advantage of shortages of commodities […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Iminyela sees end to shared toilets",
            "url": "https://www.chronicle.co.zw/iminyela-sees-end-to-shared-toilets/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nMISS Princess Jira of Iminyela suburb in Bulawayo eagerly anticipates using the familys individual toilet, constructed by the Bulawayo City Council two months ago. For years, dating back to the colonial era before Zimbabwe gained Independence in 1980, residents of Iminyela suburb relied on communal toilets shared by four families.\n\nIt was not an ideal situation. Sharing a toilet with four other families was a constant source of frustration and indignity for the residents of Iminyela. Long queues, especially during peak hours, were a daily occurrence.\n\nThe toilets were often dirty and unsanitary, leading to health concerns and a general sense of discomfort. The lack of privacy and the constant exposure to the waste of others created an environment that was both degrading and unhygienic.\n\nTo address the decades-long issue of shared toilets, the Bulawayo City Council (BCC) launched an ambitious project in 2017 to construct 1,331 individual toilet units in Iminyela and Mabuthweni suburbs. However, the project faced significant delays due to chronic underfunding. In June of this year, a glimmer of hope emerged when the council announced the allocation of US$187000 specifically for the elimination of the shared toilet system in these two suburbs.\n\nMiss Jira said BCC employees started constructing the toilet two months ago and were expected to install the toilet seat and shower after the festive holidays.\n\nFour families shared a toilet and shower for all these years. Slightly over two months ago, BCC workers came here and said they would start building a toilet for us, a toilet that only our family would use, Miss Jira told Chronicle.\n\nShe showed this publication a toilet and shower that her family and three neighbours have been sharing in Iminyela suburb for years.\n\nHygiene is always an issue when four families share a toilet and shower. The BCC workers just have to connect a toilet so that we can start using the unit, she said.\n\nShe applauded the city council for building the individual toilet units.Across the street from Miss Jiras house, Gogo Martha Siwela has been a resident of the decades-old suburb for over 50 years and had been using the shared household since the 60s.\n\nThe shared toilet system has been used since I was a girl growing up in Iminyela. We were now so used to it that we didnt see anything wrong about four families sharing a single toilet and shower. Im happy that my grandkids will grow up enjoying the use of a single-family toilet, something that we never had the privilege of enjoying, said Gogo Siwela.\n\nAs of this week, 217 units remain partially complete while 484 toilets have been done to date at Mabuthweni.\n\nA total of 1331 units were still outstanding from the two suburbs, Housing and Community Services director, Mr Dictor Khumalo, told the council in September.\n\nIn 2012, the local authority said it would build individual toilets before selling the houses to sitting tenants.\n\nResidents from the two suburbs have for years been using communal toilets. More than three households shared one toilet and residents used to complain about the state of the ablution facilities.\n\nCouncil, in partnership with Zimbabwe Homeless Peoples Federation (ZIHOPFE), Dialogue on Shelter (DOS) and the National University of Science and Technology (Nust), provided about 80 percent of the required money through loans advanced to residents.\n\nResidents had to raise the remaining 20 percent and pay back the loans over two years at US$15 per month.\n\nIn 2019, the Chronicle reported, based on the local authoritys report that it had diverted US$500000 earmarked for the construction of toilets in Mabuthweni and Iminyela suburbs, as well as the upgrading of Barbourfields and Luveve Stadiums to rehabilitate Burombo and Vundu Hostels.\n\nOn home ownership conversion, the council said a total of 410 houses had been converted to date from rented to home ownership. In Mzilikazi/Makokoba, a total of 1567 houses had so far been converted to home ownership out of a total of 2283 units and 716 units were yet to be converted.\n\nWard 9 councillor, Donaldson Mabutho said the city council, even with limited funds, was pushing to construct the remaining thousands of individual toilet units in both Iminyela and Mabuthweni suburbs.\n\nThe old toilet system where residents shared the toilets is an old colonial system that as a council we are trying to get rid of, said Clr Mabutho.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fbf.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com MISS Princess Jira of Iminyela suburb in Bulawayo eagerly anticipates using the family’s individual toilet, constructed by the Bulawayo City Council two months ago. For years, dating back to the colonial era before Zimbabwe gained Independence in 1980, residents of Iminyela suburb relied on communal toilets shared by four families. It was […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        },
        {
            "title": "Man up for smuggling US$3 400 exotic pigeons",
            "url": "https://www.chronicle.co.zw/man-up-for-smuggling-us3-400-exotic-pigeons/",
            "content": "Thupeyo Muleya,[emailprotected]\n\nA 37-YEAR-OLD man from Beitbridge has been arrested for smuggling 17 exotic pigeons worth US$3 400 into Zimbabwe through an illegal entry point along the Limpopo River.\n\nPeter Ncube, a resident of Dulivhadzimu suburb, was intercepted by security agents while crossing the river on a wooden raft near the ZimParks compound, which is located about four kilometres west of the Beitbridge Border Post.\n\nThe use of inflatable boats and wooden rafts is common at illegal crossing points along the Limpopo River, particularly during the rainy season. Security officials from both Zimbabwe and South Africa frequently intercept and destroy these makeshift vessels to curb smuggling or illegally crossing the border.\n\nNcube has been charged with contravening sections of the Parks and Wildlife Act and the Customs and Excise Act.\n\nHe denied the charges when he appeared before Beitbridge Magistrate, Ms Annia Chimweta yesterday.\n\nHe was remanded in custody to January 8. The court heard that Ncube was found in possession of six Homer pigeons, four Indian fantail pigeons, three Lahore pigeons and four Modena pigeons.\n\nThe prosecutor, Mr Tawanda Chigavazira told the court that on December 22, at around 11pm, detectives from the Minerals, Flora and Fauna Unit (MFFU), along with ZimParks rangers, were conducting a security patrol along the Limpopo River.\n\nThey received a tip-off that Ncube intended to smuggle the exotic birds from South Africa. Acting on this information, the team set up an ambush along the route he was expected to use.\n\nAt about 11.30 pm, Ncube was spotted crossing the river from South Africa.\n\nHe was apprehended uponreaching the Zimbabwean side and the pigeons were confiscated, said Mr Chigavazira.\n\nIn 2015, three South African nationals, Edwin Hewitt, Hedrick Blignaut and John Herbert Pretorius were arrested along the same river while attempting to smuggle 29 sables worth US$435 000 into the neighbouring country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Thupeyo Muleya, Thupeyo.muleya@zimpapers.co.zw  A 37-YEAR-OLD man from Beitbridge has been arrested for smuggling 17 exotic pigeons worth US$3 400 into Zimbabwe through an illegal entry point along the Limpopo River. Peter Ncube, a resident of Dulivhadzimu suburb, was intercepted by security agents while crossing the river on a wooden raft near the ZimParks compound, which is […]",
            "time": "21:26",
            "date": "25 Dec 2024"
        }
    ]
}