{
    "news": [
        {
            "title": "Makarawu, Charamba finish indoor season in style",
            "url": "https://www.chronicle.co.zw/makarawu-charamba-finish-indoor-season-in-style/",
            "content": "Zimpapers Sports HubZIMBABWE sprinters Tapiwanashe Makarawu and Makanakaishe Charamba shone once again on the world stage when they finished first and second in the NCAA Indoor Track and Field Championships in Virginia in the US on Saturday.The duo now hold the worlds fastest time over the 200m of 20.13 seconds.After the NCAA win, Makarawus feat is recorded as the seventh all-time best effort in the event.At the national finals that mark the end of the collegiate indoor season, Makarawu of Kentucky University, who holds the national outdoor record of 19.93 seconds set last year in a year he finished seventh in the Olympic final, was first in 20.13 seconds as Charamba running for Auburn finished second in 20.16.Charamba had, as of February 27, boasted of the worlds best 200m of 20.13 until his compatriot joined him at the apex of global recognition, right at the apex as the season ended.Barring injuries, the hot Zimbabweans are expected to excel in the outdoor season and book their places at the World Championships to be hosted by Tokyo this year.Vimbai Maisvoreva took part in the 400m final finishing sixth in 51.66 seconds.200m results1 Carli Makarawu, JR, Kentucky  20.13 (Champion)2 Makanakaishe Charamba, SR, Auburn  20.163 Cameron Miller, SR, Purdue  20.494 Garrett Kaalund, JR, USC  20.565 Jaiden Reid, SO, LSU  20.756 Johnnie Blockburger, SR, USC  20.847 Demar Francis, SR, Baylor  21.008 Jamarion Stubbs, JR, Alabama State  DNS\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/picc3.jpg",
            "description": "Zimpapers Sports Hub ZIMBABWE sprinters Tapiwanashe Makarawu and Makanakaishe Charamba shone once again on the world stage when they finished first and second in the NCAA Indoor Track and Field Championships in Virginia in the US on Saturday. The duo now hold the world’s fastest time over the 200m of 20.13 seconds. After the NCAA […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Veteran dancer MaBree sets sights on nurturing young talent",
            "url": "https://www.chronicle.co.zw/veteran-dancer-mabree-sets-sights-on-nurturing-young-talent/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nPerforming artist MaBree (Beauty Matshawila), who has worked with esteemed groups such as Ezimnyama Dance Ensemble, Bolamba Culture Birds, and Umkhathi Theatre Works, has set her sights on opening a school of dance  a move aimed at fostering growth in the countrys dance sector.\n\nFondly known as MaBree on the dance floor, she has showcased her talent on international platforms, earning recognition for her exceptional performances. In 2020, her dedication was honoured when she won the Bulawayo Arts Awards Outstanding Female Dancer accolade.\n\nSpeaking to Chronicle Showbiz Online, MaBree said her dream is to establish an arts centre, where she can nurture future dancers and preserve Zimbabwes rich cultural heritage through traditional dance.My goal is to open a dance school where I can pass on my knowledge and uphold our culture of Ubuntu, she said.\n\nReflecting on her journey, she said years of experience have shaped her into the dancer she is today.My breakthrough in the industry started around 2003, and from then until now, I have worked with groups such as Bolamba Culture Birds and Ezimnyama Dance Ensemble. One of my career highlights was a spiritual act during the official opening of Intwasa in 2019, she said.\n\nHer international exposure includes working with Umkhathi Theatre Works on the production Footprints, which saw her tour India and perform at the Surajkund International Crafts Mela. She has also showcased her skills at youth games, Independence Day celebrations, and other high-profile events, further refining her artistry.\n\nBeyond performing, Mabree has been actively mentoring the younger generation, imparting her skills in various schools.\n\nI have taught dance at several schools, including Nkanyezi Primary School, where I coached the Jikinya Dance team for four years, leading them to victory. Other schools I have worked with include Sontala Primary, Cowdray Park Primary, Matobo Primary, and Founders High School, she shared.\n\nBy opening a dance school, she aims to continue imparting her skills and nurturing the next generation of dancers. Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/pic1.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Performing artist MaBree (Beauty Matshawila), who has worked with esteemed groups such as Ezimnyama Dance Ensemble, Bolamba Culture Birds, and Umkhathi Theatre Works, has set her sights on opening a school of dance – a move aimed at fostering growth in the country’s dance sector. Fondly known as MaBree on the dance floor, […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Kwekwe police hunt three suspects in connection with Zhombe murder",
            "url": "https://www.chronicle.co.zw/kwekwe-police-hunt-three-suspects-in-connection-with-zhombe-murder/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nPOLICE in Kwekwe are seeking the publics assistance in locating three suspects wanted in connection with a murder that occurred on 13 March 2025, at Mushange Business Centre in Zhombe.\n\nOn a statement on X, the police said the suspects, identified as Kenias Mapfumo, Armstrong Marumahoko, and Mathias Tatenda Dhlamini, allegedly attacked Shepherd Mavhangira, 45, with bricks at a bar in Mushange Business Centre.\n\nMavhangira, who had attempted to intervene and stop the suspects from throwing bricks at patrons, died on the spot from his injuries.\n\nThe police are appealing to anyone with information regarding the whereabouts of the suspects to come forward and report to the nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Murder-investigation-.jpeg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com POLICE in Kwekwe are seeking the public’s assistance in locating three suspects wanted in connection with a murder that occurred on 13 March 2025, at Mushange Business Centre in Zhombe. On a statement on X, the police said the suspects, identified as Kenias Mapfumo, Armstrong Marumahoko, and Mathias Tatenda Dhlamini, allegedly attacked […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Chipinge man kills wife, hides body and goes partying",
            "url": "https://www.chronicle.co.zw/chipinge-man-kills-wife-hides-body-and-goes-partying/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA CHIPINGE man has been remanded in custody for allegedly killing his wife in a brutal assault that occurred on 22 February 2025.\n\nThe accused who had been away from home for 18 days met his wife at Siyachipo Car wash, where he accused her of infidelity.\n\nThe accusation led to a violent assault that continued all the way to their home, according to the National Prosecuting Authority of Zimbabwe (NPAZ).\n\nDespite attempts by their landlord to intervene, the accused continued to assault his wife and even attacked her friend.\n\nThe assault persisted as the accused took his wife to the maize fields where he ultimately assaulted her until she died.\n\nIn an attempt to cover up the crime the accused used a blanket and white cloth to cover his wifes body.\n\nHe then returned home, gathered some belongings and burned them near the crime scene.\n\nThe body was discovered on 1 March 2025 by a resident who was visiting her maize fields.\n\nThe accused was eventually arrested by detectives at Holland Business Centre in Chipinge on 12 March 2025.\n\nThe accused was remanded in custody to 28 March 2025.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/02/jail-1.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A CHIPINGE man has been remanded in custody for allegedly killing his wife in a brutal assault that occurred on 22 February 2025. The accused who had been away from home for 18 days met his wife at Siyachipo Car wash, where he accused her of infidelity. The accusation led to a […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Naked intruder sentenced to 18 months for unlawful entry and indecent assault",
            "url": "https://www.chronicle.co.zw/naked-intruder-sentenced-to-18-months-for-unlawful-entry-and-indecent-assault/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA 24-YEAR-OLD Hwange man has been sentenced to 18 months in prison for breaking into a womans bedroom naked and attempting to assault her.\n\nMarshal Comfort Nyathi from Lwendulu village, Hwange, was convicted by the Hwange Magistrates court of aggravated unlawful entry and indecent assault.\n\nOn 4 March 2025 Nyathi broke into the womans bedroom in the early hours of the morning.\n\nThe victim had retired to bed around 9 PM the previous night, ensuring all windows and doors were locked.\n\nAccording to the National Prosecuting Authority of Zimbabwe (NPAZ) on X, Nyathi gained entry to her bedroom at approximately 1:40 AM by opening a window, placing a brick underneath it, and climbing through. He entered the room naked.\n\nThe woman was awakened as Nyathi was attempting to pull down her shorts.\n\nNyathi apologized and identified himself, professing his love for her.\n\nThe victim, while pretending to be calm, turned on a light and took a picture of Nyathi.\n\nHe eventually fled through the window after she alerted her mother.\n\nThe victim made a police report, leading to Nyathis arrest and subsequent conviction.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Sidumisile Mabena, sidumisle77mabena@gmail.com A 24-YEAR-OLD Hwange man has been sentenced to 18 months in prison for breaking into a woman’s bedroom naked and attempting to assault her. Marshal Comfort Nyathi from Lwendulu village, Hwange, was convicted by the Hwange Magistrates’ court of aggravated unlawful entry and indecent assault. On 4 March 2025 Nyathi broke into […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Late equaliser denies GameCocks victory",
            "url": "https://www.chronicle.co.zw/late-equaliser-denies-gamecocks-victory/",
            "content": "Innocent Kurira At Luveve Stadium\n\nChicken Inn 1-1 FC Platinum\n\nCHICKEN Inn were left rueing missed opportunities as they conceded a late equaliser to FC Platinum in a 1-1 draw at home on Sarturday afternoon.\n\nThe GameCocks had looked set to secure their first three points of the season after Brian Muzas 66th-minute strike, but a goalkeeping error in the 85th minute allowed Thandolwenkosi Ngwenya to level the score and deny the hosts all three points.\n\nThe first half was a tense, cagey affair, with both sides struggling to break down each others defences. Chicken Inn had the first chance of note in the 17th minute when Xolani Ndlovu delivered a dangerous free kick into the box, but Mpumelelo Bhebhes header lacked the accuracy to test FC Platinum goalkeeper David Bizabani. Moments later, Godfrey Muchenje tried his luck from range, only to see his effort sail high and wide.\n\nFC Platinum had their own opportunities, with Ngwenya threatening in the 24th minute after a skilful turn saw him evade two defenders. However, Bernard Donovan was quick to close the space and made a crucial save to deny the forward.\n\nIn a blow to the visitors, FC Platinum were forced to make an early substitution when Shepherd Mhlanga was stretchered off after a knock, with Dylan Nchito replacing him in the 32nd minute. Chicken Inn had strong penalty claims in the 40th minute when Muza was seemingly fouled by Bizabani inside the box, but referee Mhaka Magare waved away the protests.\n\nA minute later, Elshamar Farasi came close to opening the scoring with a lobbed effort that sailed just over the bar as Bizabani was caught off his line.\n\nThe second half began with FC Platinum on the front foot, but Chicken Inn had their own chances. In the 49th minute, George Majika whipped in a dangerous cross, but Farasi could not direct his header on target. Oscar Bhebhe also came close with a powerful effort in the 62nd minute, but his shot was off target.\n\nJust when it seemed like Chicken Inn were heading for their first win of the season, disaster struck. In the 85th minute, FC Platinum equalised through Ngwenya after a mistake by goalkeeper Donovan. Brian Bandas weak shot was spilled by the keeper, and the rebound fell to Ngwenya, who calmly slotted home to make it 1-1.\n\nFC Platinum had another penalty appeal turned down in the 77th minute when Bhebhe was brought down inside the box by Lincoln Mangaira, but the referee remained unmoved.\n\nUltimately, the GameCocks were left to reflect on what could have been, as they failed to hold onto their slender lead and were forced to settle for a point. FC Platinum, on the other hand, will be satisfied with their resilience, snatching a share of the spoils.\n\nTeams\n\nChicken Inn:\n\nD Bernard, K Dzingwe, M Bhebhe, J Tulani, X Ndlovu, L Mangaira, E Farasi (G Mutungamiri 59), M Charamba (B Rendo 84), G Majika (W Vuwa 59), G Muchenje, B Muza (K Nyamutenga 81)\n\nFC Platinum:\n\nD Bizabani, B Nzori, N Nyasulu, M Ndlovu, B Banda, D Mhindirira (V Nyangulu 81), S Mhlanga (D Nchito 34), H Magaya, D Marowa (O Bhebhe 55), T Ngwenya (M Ngwenya 90), C Tshuma (J Selemani 55)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kmkmk.jpg",
            "description": "Innocent Kurira At Luveve Stadium Chicken Inn 1-1 FC Platinum CHICKEN Inn were left rueing missed opportunities as they conceded a late equaliser to FC Platinum in a 1-1 draw at home on Sarturday afternoon. The GameCocks had looked set to secure their first three points of the season after Brian Muza’s 66th-minute strike, but […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Zimbabwe hosts South African travel agents to boost tourism in Victoria Falls",
            "url": "https://www.chronicle.co.zw/zimbabwe-hosts-south-african-travel-agents-to-boost-tourism-in-victoria-falls/",
            "content": "Online Reporter\n\nTHE Ministry of Tourism and Hospitality Industry has partnered with key players in the sector to invite and host travel agents for familiarisation tours in the countrys prime tourism capital, Victoria Falls.\n\nA group of top South African tourism agents arrived in Victoria Falls on Thursday for a three-day familiarisation tour aimed at positioning Zimbabwe as a must-visit travel destination.\n\nThe Ministry partnered with Fastjet Zimbabwe, the Airports Company of Zimbabwe, the Zimbabwe Parks and Wildlife Management Authority, and other stakeholders.\n\nRepresenting a cross-section of leading travel consolidators in the industry, thetourism agents, include Tourvest, XL Nexus, and Stanley Safaris, among others.\n\nThe initiative seeks to promote Zimbabwes tourism to high-value travellers across key markets and ultimately attract increased arrivals. With the support of the Zimbabwe Tourism Authority, the agents are expected to experience various activities in Victoria Falls tourism portfolio.\n\nThey will enjoy a guided tour of the iconic Victoria Falls, a Zambezi River sunset cruise, a game drive, the breathtaking Flight of Angels helicopter tour, bungee jumping, and visits to some hotels.\n\nSouth Africa remains Zimbabwes largest regional tourist source market.\n\nThe familiarisation trip is designed to strengthen industry partnerships, enhance destination visibility, and drive visitor growth.By equipping top travel specialists with firsthand knowledge and authentic experiences, Zimbabwe is reinforcing its position as a premier adventure and wildlife destination on the global stage.\n\nThe visit by the agents comes just a week after the tourism resort hosted another group of travel agents from Asia, ensuring the destination remains active during off-peak seasons.\n\nNine travel agents from key Asian markets, particularly Singapore, Hong Kong, and the Philippines, recently completed a familiarisation tour of the country with the support of Qatar Airways, Thompsons Africa, and Gateway Singapore.\n\nTourism is a seasonal sector, with visitor arrivals typically reaching their lowest levels after the festive season and continuing until the end of March.\n\nTravel groups play a crucial role in bridging this gap, ensuring the industry remains vibrant throughout this period.\n\nThe Asian market is an increasingly important source of tourists, with many travellers from this region preferring to visit in groups.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-15-at-3.38.56-PM-680x380.jpeg",
            "description": "Online Reporter THE Ministry of Tourism and Hospitality Industry has partnered with key players in the sector to invite and host travel agents for familiarisation tours in the country’s prime tourism capital, Victoria Falls. A group of top South African tourism agents arrived in Victoria Falls on Thursday for a three-day familiarisation tour aimed at […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Stalemate at the break",
            "url": "https://www.chronicle.co.zw/stalemate-at-the-break/",
            "content": "Chicken Inn 0-0 FC Platinum\n\nInnocent Kurira At Luveve Stadium\n\nTHE first half between Chicken Inn and FC Platinum has unfolded as a cagey and closely contested affair, with neither side able to break the deadlock.\n\nIn the 17th minute, Xolani Ndlovu delivered a dangerous free kick into the box, which found Mpumelelo Bhebhe in space.\n\nHowever, Bhebhe was unable to direct his header on target. Moments later, Godfrey Muchenje fired from distance, but his effort sailed harmlessly over the bar.\n\nFC Platinum came close to taking the lead in the 24th minute when a clever turn by Thandolwenkosi Ngwenya one evaded two Chicken Inn defenders.\n\nHowever, goalkeeper Bernard Donovan was quick off his line to make a crucial save and deny what would have been a stunning opener.\n\nThe visitors were forced into an early change after 32 minutes when Shepherd Mhlanga was stretchered off with an injury, and Dylan Nchito came on in his place.\n\nWith five minutes remaining in the first half, Chicken Inn had strong claims for a penalty when Brian Muza appeared to be fouled inside the box by FC Platinum goalkeeper David Bizabani. However, referee Mhaka Magare waved away the appeals. Chicken Inn came close once more moments later, as Elshamar Farasi attempted to lob Bizabani, who had strayed off his line, but the effort sailed just over the bar.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kmkmk.jpg",
            "description": "Chicken Inn 0-0 FC Platinum Innocent Kurira At Luveve Stadium THE first half between Chicken Inn and FC Platinum has unfolded as a cagey and closely contested affair, with neither side able to break the deadlock. In the 17th minute, Xolani Ndlovu delivered a dangerous free kick into the box, which found Mpumelelo Bhebhe in […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Chicken Inn set to face FC Platinum at Luveve Stadium in Match Day Three",
            "url": "https://www.chronicle.co.zw/chicken-inn-set-to-face-fc-platinum-at-luveve-stadium-in-match-day-three/",
            "content": "Innocent Kurira\n\nCHICKEN Inn will be out seek some form of redemption as they face a challenging FC Platinum in what promises to be a thrilling encounter this Saturday afternoon at Luveve Stadium.\n\nThe Gamecocks have struggled to find the back of the net, drawing both of their opening matches 0-0.\n\nThey will be eager to rediscover their attacking rhythm against Norman Mapezas FC Platinum, who have started the season strongly with four points from a possible six.\n\nFC Platinum, who dominated the head-to-head record last season, will be aiming to build on their recent 1-0 victory over Manica Diamonds.\n\nFor Chicken Inn to secure a positive result, they will need to show more than just defensive resilience against the Platinum Miners, who look set to maintain their strong form.\n\nThe teams lineup as follows:\n\nChicken Inn\n\nDonovan Bernard, Kudzaishe Dzingwe, Mpumelelo Bhebhe, Joseph Tulani, Xolani Ndlovu, Lincoln Mangaira, Elshamar Farasi, Michael Charamba, George Majika, Godfrey Muchenje, Brian Muza\n\nFC Platinum\n\nDavid Bizabani, Bothwell Nzori, Nickson Nyasulu, Mbongeni Ndlovu, Brian Banda, Devine Mhindirira, Shepherd Mhlanga, Hagiazo Magaya, Davison Marowa, Thandolwenkosi Ngweya, Claivert Tshuma\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jhyy.jpg",
            "description": "Innocent Kurira CHICKEN Inn will be out seek some form of redemption as they face a challenging  FC Platinum in what promises to be a thrilling encounter this Saturday afternoon at Luveve Stadium. The Gamecocks have struggled to find the back of the net, drawing both of their opening matches 0-0. They will be eager […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        },
        {
            "title": "Watch: ZINA Bulawayo Province hosts preseason netball tournament at White City Stadium",
            "url": "https://www.chronicle.co.zw/watch-zina-bulawayo-province-hosts-preseason-netball-tournament-at-white-city-stadium/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHE Zimbabwe Netball Association (ZINA) Bulawayo province Division Two is hosting a one-day open tournament at White City Stadium, with 11 teams taking part.\n\nThe tournament serves as a precursor to the upcoming 2025 league matches, according to the Secretary General, Simiso Ndlovu.\n\nBy the end of the day, we will have witnessed 25 games, and from what we have seen so far, it promises to be an exciting day for the game of netball, she said.\n\nThe participating teams are Free Stars, Lethal, Swallows, Thandanani, NUST, Sovereign, Majoni, Mthombothemba, Sobukhazi, and Makopo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sport.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Zimbabwe Netball Association (ZINA) Bulawayo province Division Two is hosting a one-day open tournament at White City Stadium, with 11 teams taking part. The tournament serves as a precursor to the upcoming 2025 league matches, according to the Secretary General, Simiso Ndlovu. “By the end of the day, we will have […]",
            "time": "21:46",
            "date": "16 Mar 2025"
        }
    ]
}