{
    "news": [
        {
            "title": "Bosso edge CAPS United",
            "url": "https://www.chronicle.co.zw/bosso-edge-caps-united-2/",
            "content": "Brandon MoyoREASON Sibandas early strike was all that separated Highlanders and CAPS United in a Castle Lager Premier Soccer League match played at Barbourfields Stadium on Sunday.\n\nSibanda sent Bosso into the lead as early as the second minute and his strike made the difference in the first leg of the Battle of the Cities.\n\nThe Bosso striker, coolly slotted home from inside the box to beat Harmony Nare on the near post ensure that Highlanders collect maximum after three consecutive stalemates in their previous matches.\n\nThis was also Bossos second win at home in three matches, after recording only one draw against Scottland. They walloped Kwekwe United 4-0 in their first home game of the season.\n\nAfter Bosso drew first blood in the second minute, CAPS United would enjoy most of the possession throughout the first stanza but couldnt find the back of the net.\n\nThe second half, was an even contest.In the 20th minute, Bosso survived a scare with Talent Dube producing a crucial goal-line clearance, helping the hosts maintain their lead.\n\nIn the 35th minute, Highlanders shot stopper, Reward Muza produced a brilliant double save to deny CAPS United an equaliser.\n\nFour minutes later, Hastings Chapusha attempted a long range shot but his effort went over the bar.At the half-hour mark, CAPS United got a free kick on the edge of the box but their chance went to waste.\n\nAt the stroke of halftime, Bosso survived another scare as Arthur Ndlovu cleared Juan Mutudzas effort off the line for a corner kick.\n\nMakepekepe thought they had levelled matters but Love Mabialas headed effort was adjudged not to have crossed the line.\n\nAt the stroke of full-time, Bosso misses a golden opportunity to double their lead but Hubert Ncube, decided to go for glory instead of squaring to Nigel Banda on the other end.\n\nHis shot was saved by Nare.\n\nTeams:Highlanders:Reward Muza (gk), Talent Dube (Brian Mlotshwa, 63mins), Arthur Ndlovu, Melikhaya Ncube, Reason Sibanda (McKinnon Mushore, 78mins),Prince Ndlovu (Hubert Ncube, 63mins), Malvern Hativagoni, Brighton Ncube (Tendai Muvuti, 78mins),Mason Mushore, Never Rauzhi, Luckmore Mutumbi\n\nCAPS United:Harmony Nare (gk), Kelvin Mangiza, Kundai Benyu (Eric Manokore, 65mins), Bruce Kangwa, Hastings Chapusha, Brighton Manhire, Phineas Bhamusi, Love Mabiala (Junior Bunjira, 65mins),Tanaka Shandirwa, Juan Mutudza (Jayden Bakari, 75mins), Joseph Mbollo\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-13-at-5.21.12-PM.jpeg",
            "description": "Brandon Moyo REASON Sibanda’s early strike was all that separated Highlanders and CAPS United in a Castle Lager Premier Soccer League match played at Barbourfields Stadium on Sunday. Sibanda sent Bosso into the lead as early as the second minute and his strike made the difference in the first leg of the Battle of the […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Man drowns at Hillside Dams in Bulawayo shead of Easter holidays",
            "url": "https://www.chronicle.co.zw/man-drowns-at-hillside-dams-in-bulawayo-shead-of-easter-holidays/",
            "content": "Sikhumbuzo Moyo\n\nAhead of the Easter holidays, a parishioner has drowned at Hillside dams in Bulawayo and his body has been retrieved by the Bulawayo Fire and Ambulance Services.\n\nThe man is believed to have sneaked into the dams last night to pray.\n\nBulawayo Chief Fire Officer Mr Mhlangano Moyo has confirmed the incident\n\nPolice are yet to ferry the body from the site.\n\nMr Moyo said the man is Hopuleng Dube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/police-577x380.jpg",
            "description": "Sikhumbuzo Moyo Ahead of the Easter holidays, a parishioner has drowned at Hillside dams in Bulawayo and his body has been retrieved by the Bulawayo Fire and Ambulance Services. The man is believed to have sneaked into the dams last night to pray.   Bulawayo Chief Fire Officer Mr Mhlangano Moyo has confirmed the incident […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Highlanders hosts CAPS United at Barbourfields Stadium",
            "url": "https://www.chronicle.co.zw/highlanders-hosts-caps-united-at-barbourfields-stadium/",
            "content": "Fungai Muderere,Zimpapers Sports HubBULAWAYO football giants Highlanders, are this afternoon set to play host to CAPS United at Barbourfields Stadium.\n\nThe first leg encounter between the two sides is expected to attract a capacity crowd.As fans await the big match, there are some who will miss attending at Barbourfields Stadium.\n\nDonald Wadawu, a renowned Dynamos fan, is at pains that will not be there this time around.Wadawu is at the ongoing Queens International Pool Tournament at Queens Sports Club.\n\nHe shares his emotions on missing out on the match, placing a stalemate prediction.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Highlanders-1.jpg",
            "description": "Fungai Muderere,Zimpapers Sports Hub BULAWAYO football giants Highlanders, are this afternoon set to play host to CAPS United at Barbourfields Stadium. The first leg encounter between the two sides is expected to attract a capacity crowd. As fans await the big match, there are some who will miss attending at Barbourfields Stadium. Donald Wadawu, a […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "New truck stops to ease safety concerns on Bulawayo-Victoria Falls road",
            "url": "https://www.chronicle.co.zw/new-truck-stops-to-ease-safety-concerns-on-bulawayo-victoria-falls-road/",
            "content": "Sikhumbuzo Moyo\n\nKUSILE Rural District Council has identified three possible sites to set up truck stops following concerns of reckless parking on its jurisdiction by truck drivers along the Bulawayo-Victoria Falls road.\n\nThere has been concerns by motorists that the trucks that park along the highway at St Lukes, Cross Jotsholo and Gwayi are causing serious danger to life while also promoting social delinquents such as drug and substance abuse.\n\nIn an interview on Friday, Kusile Rural District Council chief executive officer Mr Sifiso Hadebe said they have identified land at Masinyane and Cross Jotsholo as well as St Lukes.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/sifiso-hadebe.jpg",
            "description": "  Sikhumbuzo Moyo KUSILE Rural District Council has identified three possible sites to set up truck stops following concerns of reckless parking on its jurisdiction by truck drivers along the Bulawayo-Victoria Falls road. There has been concerns by motorists that the trucks that park along the highway at St Luke’s, Cross Jotsholo and Gwayi are […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Watch: Bulawayo residents unite in joyful Palm Sunday march",
            "url": "https://www.chronicle.co.zw/bulawayo-residents-unite-in-joyful-palm-sunday-march/",
            "content": "Sikhulekelani Moyo,[emailprotected]RESIDENTS from all suburbs in Bulawayo woke up to an unusual atmosphere of cheer and joyful singing as a large crowd of congregants from different churches marched in unison for Palm Sunday.\n\nPalm Sunday is a Christian observance that commemorates the significant event of Jesus triumphant entry into Jerusalem, as described in the Bible.\n\nIt was the moment when he was warmly welcomed by enthusiastic crowds who waved palm branches and laid them on the ground along the path.\n\nAlternatively, referred to as Passion Sunday, Palm Sunday serves as the commencement of the Holy week, which holds great importance in the Christian calendar.\n\nThis sacred week encompasses various events, including the re-enactment of Jesuss crucifixion and death on Good Friday, as well as his resurrection on Easter.@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-13-at-12.37.45-PM.jpeg",
            "description": "Sikhulekelani Moyo,sikhu.moyo@chronicle.co.zw RESIDENTS from all suburbs in Bulawayo woke up to an unusual atmosphere of cheer and joyful singing as a large crowd of congregants from different churches marched in unison for Palm Sunday. Palm Sunday is a Christian observance that commemorates the significant event of Jesus’ triumphant entry into Jerusalem, as described in the […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Government awards seven Contractors for Bulawayo-Victoria Falls road rehabilitation",
            "url": "https://www.chronicle.co.zw/government-awards-seven-contractors-for-bulawayo-victoria-falls-road-rehabilitation/",
            "content": "Sikhumbuzo Moyo\n\nGOVERNMENT has awarded seven more contractors to work on the complete rehabilitation of the Bulawayo-Victoria Falls Road, with each of the contractor set to work on a 51km stretch.\n\nThe seven contractors join Bitumen World that was awarded the initial contract by Government to work on the 435km road that leads to the countrys premier resort city.\n\nSpeaking in an interview after commissioning the 230 metre long Somgolo Bridge in Lupanda Village, Lupane district on Friday, Matabeleland North North Minister of State for Provincial Affairs and Devolution Richard Moyo said the contractors were suppose to start work last week but had to delay a little bit due to some administrative issues that were still being addressed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Minister-Richard-Moyo.jpg",
            "description": "Sikhumbuzo Moyo GOVERNMENT has awarded seven more contractors to work on the complete rehabilitation of the Bulawayo-Victoria Falls Road, with each of the contractor set to work on a 51km stretch. The seven contractors join Bitumen World that was awarded the initial contract by Government to work on the 435km road that leads to the […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Sisa Nkomo’s poetry to shine light on mental health",
            "url": "https://www.chronicle.co.zw/sisa-nkomos-poetry-to-shine-light-on-mental-health/",
            "content": "Faith Ndlovu,Zimpapers Arts & Entertainment Hub\n\nPoet and performer Nomqhele Sisa Nkomo, 20, is set to captivate audiences with her soul-stirring words at Alliance Francaise de Bulawayo on April 25. Her performance, themed Shades of Blue, will delve into the complexities of mental health, addressing depression, anxiety, and the struggles of self-acceptance.\n\nThe upcoming performance promises to be an emotional journey as Sisa explores the realities of growing up with a creative mind.The audience can expect an intense and heartfelt experience, a journey through the good, the bad, and the ugly of mental health, she shared.\n\nI want to take them on a path of self-discovery, to help them see that they are not alone in their struggles.\n\nFor Sisa, poetry is not just about expression  its about connection.Performing never gets easier, no matter how many times you do it, she admitted.\n\nBut the challenge is something I embrace. Its a thrill that never gets old, and its what keeps me going.With Shades of Blue, Sisa aims to spark important conversations about mental health, self-acceptance, and the power of words to heal.\n\nHer poetry journey began at the age of 14 when she turned to writing as an emotional outlet.I started writing poetry as a way to express feelings I couldnt talk about. It was my escape, my sanctuary. Poetry allowed me to process my emotions and make sense of the world around me, she explained.\n\nOver the years, Sisa has refined her craft, competing in poetry slams and performing at various events. Her talent was recognised last year with the Outstanding Poet award at the Pumula Royal Arts and Community Awards (Praca).Winning the Praca was surreal. It validated all the hard work and dedication Ive put into my craft. It reminded me that my words have the power to impact others. Thats a responsibility I take seriously, and it drives me to keep creating poetry that is honest, raw, and relatable, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/poet.jpg",
            "description": "Faith Ndlovu,Zimpapers Arts & Entertainment Hub Poet and performer Nomqhele Sisa Nkomo, 20, is set to captivate audiences with her soul-stirring words at Alliance Francaise de Bulawayo on April 25. Her performance, themed “Shades of Blue”, will delve into the complexities of mental health, addressing depression, anxiety, and the struggles of self-acceptance. The upcoming performance […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Frustration at Rufaro: Scottland falter despite Billiat Brilliance",
            "url": "https://www.chronicle.co.zw/frustration-at-rufaro-scottland-falter-despite-billiat-brilliance/",
            "content": "Langton Nyakwenda at Rufaro\n\nSCOTTLANDS bright start to the season dimmed at Rufaro on Saturday, as coach Tonderai Ndiraya found himself under fire from a section of frustrated fans following a 1-1 draw against Yadah.\n\nA few visibly intoxicated Scottland supporters chanted songs denouncing Ndiraya after their team dropped two valuable points in a game many expected them to win.Star signing Khama Billiat gave the Mabvuku-based outfit an early lead with a trademark header in the 27th minute, converting a pinpoint cross from Panashe Mutimbanyoka. It was his first goal of the season, a moment of relief for the Warriors forward, who opted not to celebrate out of respect for his former side.\n\nBut Francis Mustafa struck back for Yadah before the break, ensuring the game ended with honours even.\n\nThe result leaves Scottland on 11 points from a possible 18  two behind early pacesetters Ngezi Platinum Stars, who stumbled to a 2-1 defeat away to TelOne.\n\nUnsurprisingly, the draw did not sit well with some of the clubs supporters, but Ndiraya called for calm, urging fans to give him time to build a cohesive unit.\n\nWe would have really wanted three points, but a point is still good for us. Out of a possible 18, we are on 11  for me, thats a good start, he said.\n\nThe championship-winning gaffer insists theres no need to panic.\n\nWe have a long way to go. Weve only played six games, so theres really nothing much to talk about. I think between now and Match Day 17, theres going to be a lot of movement in the top half of the log.\n\nNdiraya acknowledged the quality within his ranks, but emphasized that individual brilliance alone wont carry them far.\n\nOf course, weve got good players, but just having quality isnt enough if we dont play as a team. Were in the process of getting the group to gel. Probably after Match Day 10, well be talking about a different Scottland.\n\nYadah, despite facing a star-studded Scottland line-up that featured captain Walter Musona, Tichaona Chipunza, and the rock-solid Peter Muduhwa, held their own throughout the contest.\n\nThe Miracle Boys nearly snatched it at the death when Anotidaishe Gwatidzos corner kick was cleared off the line. Billiat had also missed a late headed opportunity just before that moment.\n\nIn the critical phase of the game, we conceded a goal we shouldve avoided. In the second half, we pushed for a winner but lacked sharpness. I felt we had two or three good chances that we didnt convert, reflected Ndiraya.\n\nHe admitted the substitutes didnt have the desired impact.\n\nIn the last 15 minutes, I thought we dominated midfield, but those who came on didnt give us what we were looking for.\n\nYadah coach Ikabort Masocha welcomed the point after a narrow 0-1 loss to Greenfuel in their previous fixture.\n\nIts a positive result for us, especially after the loss in Chisumbanje. We needed to add to our tally and try to move away from the relegation zone, he said.\n\nAs has become customary, the VIP enclosure at Rufaro was packed with celebrities and socialites. Among the crowd was Zimdancehall sensation Kevin Killer T Kusikwenyu, who added star power to a tense afternoon that ended in shared spoils.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/rfgrgv.jpg",
            "description": "Langton Nyakwenda at Rufaro SCOTTLAND’S bright start to the season dimmed at Rufaro on Saturday, as coach Tonderai Ndiraya found himself under fire from a section of frustrated fans following a 1-1 draw against Yadah. A few visibly intoxicated Scottland supporters chanted songs denouncing Ndiraya after their team dropped two valuable points in a game […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Andre Onana DROPPED for Man Utd’s trip to Newcastle after Lyon horror",
            "url": "https://www.chronicle.co.zw/andre-onana-dropped-for-man-utds-trip-to-newcastle-after-lyon-horror/",
            "content": "Andre Onana will not be in goal when Manchester United face Newcastle at St James Park on Sunday having not travelled with the team to Tyneside following his difficult spell\n\nAndre Onana has been axed forManchester UnitedsPremier League showdown atNewcastletoday. Onana will miss the encounter at St James Park after being taken out of the firing line by boss Ruben Amorim following his midweek blunders inUniteds 2-2 draw at Lyon.\n\nCameroon internationalOnanawas left at home when United made the trip to Newcastle yesterday, with deputy Altay Bayindir set to make hisPremier Leaguedebut against the Toon Army. Onana was at fault for both of Lyons goals when United were held in the first leg of theirEuropa Leaguequarter-final first leg tie, but is likely to be recalled for Thursdays return leg at Old Trafford  unless Bayindir does enough to keep his place.\n\nAlthoughAmorimgave Onana a vote of confidence in the immediate aftermath of the draw in Lyon, in which the 29-year-old conceded a 95th-minute equaliser, the United coach has decided to allow his troubled No.1 to clear his head today and miss the game.\n\nOnana has been dealing with off-field issues, with his wife the victim of a street robbery last week that left the family needing 24-hour protection.\n\nMelanie Kamayou was targeted by a thief who stole her 62,000 Hermes bag and Rolex watch as she got out of her car to meet a friend for dinner in Alderley Edge in Cheshire.\n\nWe use your sign-up to provide content in ways youve consented to and improve our understanding of you. This may include adverts from us and third parties based on our knowledge of you.More info\n\nDespite the off-field trauma, Onana continued to play for United, although his performances have drawn criticism this season.\n\nFormer United midfielder Nemanja Matic branded Onana one of the worst keepers in Uniteds history after the keeper said Amorims side were way better than Lyon in the build-up to the game.\n\nOnana hit back by saying that, unlike Matic, he had won a trophy at United, theFA Cuplast season, with victory overManchester Cityat Wembley.\n\nTurkey keeper Bayindir returned to the United squad atNottingham Forestearlier this month, after a nine-game absence through injury.\n\nAll seven of his seven previous appearances have come in domestic cup competitions and Europa League, but he will now make his Premier League debut.\n\nSource:mirror.co.uk\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/0_Manchester-United-FC-v-Tottenham-Hotspur-FC-Premier-League-615x380.jpg",
            "description": "Andre Onana will not be in goal when Manchester United face Newcastle at St James’ Park on Sunday having not travelled with the team to Tyneside following his difficult spell Onana has been dropped for United’s trip to Newcastle(Image: Getty Images) Andre Onana has been axed for Manchester United’s Premier League showdown at Newcastle today. […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        },
        {
            "title": "Bulawayo city centre turning into haven of criminality – Councillor",
            "url": "https://www.chronicle.co.zw/bulawayo-city-centre-turning-into-haven-of-criminality-councillor/",
            "content": "Raymond Jaravaza, Online ReporterTHE Bulawayo city centre is slowly turning into a haven of criminal activities such as illegal selling of alcohol from the boot of vehicles, public drinking and public urinating, Councillor Tavengwa Zidya has bemoaned.\n\nCllr Zidya is the Bulawayo City Council (BCC) local representive for Ward 24, which covers Nketa 7, portions of Nketa 8 and 9, and runs businesses in the city centre.Cllr Zidya says he has witnessed first-hand city by-laws being broken with impunity in broad day light.\n\nHe is of the view that if left unchecked the illegal activities will drive businesses out of the city centre, leaving it a white elephant.Legitimate businesses such as bottle stores are losing clients to individuals who sell alcohol from the boot of their cars right in front of their doorsteps. We see their clients urinating on trees and street corners in the middle of the city centre during the day. That kind of behavior is not good for the image of the City of Bulawayo.\n\nThe city centre is already losing businesses that are opting to rent premises in Suburbs and Khumalo and if the illegal activities continue the CBD will soon be deserted, said Cllr Zidya.Cllr Zidya has raised the issue with the Zimbabwe Republic Police (ZRP) who have showed their willingness to rid the city of the illegal activities.I applaud the police for conducting regular raids but more needs to be done, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/okok.jpg",
            "description": "Raymond Jaravaza, Online Reporter THE Bulawayo city centre is slowly turning into a haven of criminal activities such as illegal selling of alcohol from the boot of vehicles, public drinking and public urinating, Councillor Tavengwa Zidya has bemoaned. Cllr Zidya is the Bulawayo City Council (BCC) local representive for Ward 24, which covers Nketa 7, […]",
            "time": "18:07",
            "date": "13 Apr 2025"
        }
    ]
}