{
    "news": [
        {
            "title": "Zimbabwe ready to take Sadc to the next level",
            "url": "https://www.chronicle.co.zw/zimbabwe-ready-to-take-sadc-to-the-next-level/",
            "content": "Wallace Ruzvidzo in GABORONE, Botswana\n\nPRESIDENT Mnangagwa has assured the SADC Secretariat of his unwavering support during his tenure as Chairperson of the regional bloc.\n\nThe President also reaffirmed Zimbabwes commitment to working with all Heads of State in the regional bloc and the Secretariat towards the operationalisation of this years theme, Promoting Innovation to Unlock Opportunities for Sustainable Economic Growth and Development towards an Industrialised SADC.\n\nIn his address to the SADC Secretariat staff here yesterday, President Mnangagwa said the regions objective of deepening its integration agenda as well as accelerating the quest towards a middle to high income region remained a top priority.\n\nThe President was here for his maiden visit to the SADC Secretariat Headquarters after assuming Chairmanship of the regional bloc at the 44th SADC Summit of Heads of State and Government held in Harare in August.\n\nZimbabwe stands ready to work with fellow Heads of State and Government, the Secretariat, and other relevant stakeholders to operationalise this timely theme.\n\nI once again assure you that my door is open for continuous engagement as we promote deeper integration and sustainable development for the benefit of the peoples of the region.\n\nI count on your invaluable support as I execute the mandate bestowed upon me by the SADC Heads of State and Government, he said.\n\nSADCs approach, said President Mnangagwa, must always be driven by the regions collective desire to leave no one and no place behind.\n\nThis is something the SADC Chair has effectively instilled in his Government and is now moving to impart on the regional bloc.\n\nThe shared objectives of deepening our regional integration agenda and accelerating our quest towards a middle to high income industrialised and integrated region, for the benefit of all SADC citizens, remain our key focus.\n\nHence, as we implement the various action plans and programmes, our approach must always be driven by our collective desire to leave no one and no place behind.\n\nAll the citizens of SADC should feel that they are an integral part of the community as a result of the impacts of our programmes and activities, he said.\n\nPresident Mnangagwa charged the regions citizenry to take pride in their identity and become producers, not mere consumers of goods and services.\n\nThis, he said, would boost intra-SADC trade and ensure it leverages on the opportunities occasioned by regional value chains.Trade between member states currently stands at 23 percent.\n\nUndoubtedly, increased intra-regional trade is an economic imperative as well as an important step towards the full integration for a united and prosperous SADC. The current low levels of intra-regional trade, at only 23 percent, are worrisome.\n\nGreater efforts must be taken to remove all barriers to trade and take full advantage of the opportunities resulting from the various SADC Trade Protocols as well as our Industrialisation Strategy and Roadmap, among other framework.\n\nGoing forward, to boost intra-SADC trade and leverage on the opportunities occasioned by regional value chains, we must take pride in who we are and consume what we produce, said the SADC Chair.\n\nSADC Chairperson, President Mnangagwa is congratulated by his Botswana counterpart President Duma Gideon Boko at the handover of the SADC Headquarters from Bongwe Investments Proprietary Limited in Gaborone, Botswana, yesterday. Picture by Presidential Photographer Tawanda Mudimu\n\nHe said this years theme was a clarion call that enjoins the region to harness the power of innovation in driving its industrialisation agenda, leveraging on the abundant natural resources, rich heritage and world class human resources.\n\nAs you are aware, the theme of the 44h SADC Summit reads, Promoting Innovation to Unlock Opportunities for Sustained Economic Growth and Development Towards an Industrialised SADC.\n\nZimbabwe stands ready to work with fellow Heads of State and Government, the Secretariat, and other relevant stakeholders to operationalise this timely theme.\n\nAlthough there is still scope to scale up our industrialisation drive, I wish to commend the efforts deployed by SADC Member States to date and the promotion of innovation, science and technology in their respective jurisdictions, President Mnangagwa said.\n\nZimbabwe, he said, was playing its part in nurturing and sustaining momentum at the national level.\n\nIn that regard, the heritage-based Education 5.0 system is helping to drive innovation, modernisation and the industrialisation of our economy.\n\nUnity, support, and solidarity, said President Mnangagwa, remained the cornerstone of the regional bloc.\n\nHe expressed gratitude to member states for the solidarity they continue to render Zimbabwe every year in calling for the unequivocal removal of the illegal Western imposed sanctions.\n\nZimbabwe is grateful to our brothers and sisters in SADC who have consistently stood with us.The continuing recognition of the 25th of October as the day on which SADC Member States collectively raise their voices in disapproval of the sanctions imposed on the Republic of Zimbabwe, is always appreciated, the President said.\n\nPresident Mnangagwa appraised the gathering on Zimbabwes efforts in preserving the regions heritage saying, our story will not be accurate if we leave others to tell it on our behalf.\n\nWe remain committed to do our part towards the protection and preservation of the rich heritage, culture, and liberation history of our region.\n\nTo this end, the construction of the SADC Liberation Square in Harare, which houses the Museum of African Liberation, is progressing well.\n\nI am aware of similar efforts in other SADC countries. It is the duty of the respective countries of SADC and our peoples as a whole to promote and take pride in our heritage for both present and future generations, said the President.\n\nTurning to infrastructure development, President Mnangagwa stressed the critical role infrastructure plays in enabling regional integration efforts.\n\nVital sectors such as water, meteorology, energy, Information and Communication Technology, as well as transport require modern infrastructure. Cross border investments must be pursued with greater vigour.\n\nThere is particularly an urgent need to revamp, modernise, and diversify in the energy sector, which is the backbone of industrialisation.\n\nIt is commendable that trade in power has continued among Member States, enabling those with deficits to benefit from the SAPP Grid. On-going inter-connector projects will soon connect all the mainland Member States to the SAPP Grid.\n\nIt is gratifying that our SADC region is scaling up efforts to diversifying its power generation mix by exploring alternative energy sources such as natural gas, solar, wind, and bio-energy, he said.\n\nWith regards to transport connectivity, the SADC Chair said the enhanced efficiency in the transit of traffic and the adoption of the One Stop Border Post concept implemented by a number of member states had increased movement of people and goods within the region.\n\nHe lamented the effects of climate change across the region while imploring the region to increase coordination efforts.Regrettably, climate change continues to pose an existential threat to our people. The region is suffering from devastating climate change induced disasters that threaten to reverse the development gains we had made over the years.\n\nThis grim reality should inspire and compel us to enhance coordination efforts to effectively respond and build greater resilience.\n\nThe world has undoubtedly moved on, and SADC has appropriately adjusted and adapted to the ever-changing social, economic, political, technological and environmental dynamics, President Mnangagwa said.\n\nHe expressed gratitude to the SADC Secretariat for their dedication to duty and unwavering commitment to the regions Vision 2050.\n\nWe are confident that the Secretariat, with its pool of expertise and skills, will rise to the occasion at the service of SADC Member States.\n\nResearch, robust policy analysis and evidence-based recommendations should continue to be sharpened towards propelling our region to greater successes.\n\nGoing into the future, I urge you all to remain united and hardworking, taking full ownership of regional programmes as you wholeheartedly serve.\n\nI challenge you to remain true to the spirit of Pan-Africanism as well as the ethos and guiding principles that inspired our Founding Fathers to set up this august and strategic regional body, President Mnangagwa said.\n\nOn his part, SADC Executive Secretary Mr Elias Magosi urged the region to continue harnessing power from regional integration.\n\nThe meeting was attended by President Mnangagwas counterpart Botswana President Duma Boko, SADC Secretariat staff, diplomats, and other officials.\n\nThe President departed Gaborone for Harare last night.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/HE-IN-BOTS-1.jpg",
            "description": "Wallace Ruzvidzo in GABORONE, Botswana PRESIDENT Mnangagwa has assured the SADC Secretariat of his unwavering support during his tenure as Chairperson of the regional bloc. The President also reaffirmed Zimbabwe’s commitment to working with all Heads of State in the regional bloc and the Secretariat towards the operationalisation of this year’s theme, “Promoting Innovation to […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "Nation roasts: Zimbabwe faces intense heatwave",
            "url": "https://www.chronicle.co.zw/nation-roasts-zimbabwe-faces-intense-heatwave/",
            "content": "Chronicle Writers\n\nZIMBABWE is grappling with a severe heatwave, with temperatures soaring to record highs across the country.\n\nPlaces like Beitbridge, Lupane, Gwanda, and Chiredzi have been particularly affected, experiencing temperatures exceeding 40 degrees Celsius.\n\nThe scorching heat has taken a toll on both humans and animals. Residents are resorting to various strategies to cope, including frequent dips in dams, water consumption, and seeking shade under trees. Farmers are facing significant challenges, as their crops are struggling to survive the intense heat and the prolonged dry spell.\n\nIn the blistering heat of a Friday afternoon in Lupane, with temperatures soaring to around 39 degrees Celsius, Sibangani Ncube has only one thought  to dive headfirst into the Bubi/Lupane dam to cool off. Having spent all of his 44 years in Ward 17, Ncube is no stranger to high temperatures in Lupane.\n\nHowever, the past week has felt as if the sun itself has descended closer to the surface of Sibanye village, intent on roasting its inhabitants alive.\n\nNcube is not alone in seeking temporary reprieve from the scorching rays of the sun by dipping into the large dam and cooling off.\n\nHis livestock  three donkeys and a herd of six cattle  are also victims of a heatwave that is sweeping across Matabeleland North Province as temperatures soar near the 40-degree Celsius mark.\n\nHe has brought along his livestock to sip while he dips in the Bubi/Lupane dam.\n\nLupane is generally hot at this time of the year as we anticipate the rains, but these temperatures that we are witnessing are just abnormal. I brought my livestock to drink water in the dam and Ill also use this opportunity to take a swim and cool off, Ncube told Saturday Chronicle yesterday.\n\nThe Bubi/Lupane dam is known to have crocodiles, but that will not stop Ncube and his 12-year-old nephew Ntabiso Ncube from escaping the searing heat with a long swim in the afternoon, at the peak of the high temperatures.\n\nThe heat is affecting both people and animals, and we are lucky to have a dam nearby for our donkeys and cattle to drink water from and not die of dehydration, he said.\n\nIn Daluka village, just behind St Lukes Hospital in Lupane, Anele Ndlovu and his teenage friends are not fortunate enough to live near a dam. To escape the heatwave, they utilise a borehole in the village to quench their thirst.\n\nThe boys have brought along a metal dish that they constantly replenish with water for their cattle and livestock.He says the livestock roam the plains of Daluka village grazing in the morning and make their way to the borehole to drink water  a daily routine that the livestock have mastered.\n\nAs another means of escaping the high temperatures, animals can be seen lying or standing under tree shades.Today and tomorrow, temperatures in Lupane are expected to breach the 40 degree Celsius mark. It is expected to get a bit cooler from Monday as temperatures drop to 37 degrees Celsius.\n\nGwanda will be at its hottest today and tomorrow at 43 degrees Celsius and 41 degrees Celsius, respectively. The high temperatures in the area have seen residents turn to various strategies to cool themselves down, such as consuming cool beverages and flocking to swimming pools.\n\nAnother strategy the residents seem to have adopted is staying indoors. By midday yesterday, the temperatures had soared to 39 degrees in the mining town. The high temperatures experienced in the town over the past week have not spared animals either, which are now scavenging for water in peoples homes.\n\nProblematic baboons and monkeys that have always been a menace to residents open taps to access drinking water. Where there is water stored within their reach, they take advantage to quench their thirst.\n\nWhile temperatures are generally high in Victoria Falls, yesterday was different as the heat suddenly became unbearable. People could be seen carrying water bottles as they went about their business.\n\nA tourist from Australia said he had to put on a piece of cloth over his head to protect himself from the heat as he visited the Victoria Falls Bridge. A group of youths was also seen carrying water bottles as they toured the bridge.\n\nIn the Midlands Province, there has been unprecedented demand for watermelons, with residents and visitors buying the fruit to cool off from the heatwave. Along Kwekwe-Gweru Road, Mvuma-Chivhu Road, and Mvuma-Gweru Road, vendors are now selling more watermelons than any other fruit in the past week.\n\nTinashe Chikwata from Mkoba Village 6 said its easier to eat watermelon than to continuously drink water.\n\nA vendor, Rachel Takawira, said there has been a sharp demand for watermelons in the past week.The Deputy Minister of Health and Child Care, Sleiman Timios Kwidini, said staying hydrated by drinking lots of liquids such as water is one of the most effective ways of beating the heatwave.\n\nHe said people must avoid drinking alcohol excessively in high temperatures.\n\nIn Chiredzi and Gonarezhou National Park, the Meteorological Services Department (MSD) has forecast temperatures at 44 degrees Celsius today and 42 degrees Celsius tomorrow. This morning, mostly cloudy, mild, and windy conditions are expected in Manicaland, Masvingo, southern parts of Midlands, and Matabeleland South Provinces.\n\nPartly cloudy and hot conditions are expected across the country with a chance of isolated thunderstorms in areas such as Bulawayo, northern parts of Midlands, Harare, north of Manicaland, and all Mashonaland Provinces in the afternoon.\n\nWhen thunder roars, it is best to be indoors. Secure rooftops, especially in schools, as the rains may be accompanied by strong winds and hail in some areas, warned the MSD.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/heat-wave.jpg",
            "description": "Chronicle Writers ZIMBABWE is grappling with a severe heatwave, with temperatures soaring to record highs across the country. Places like Beitbridge, Lupane, Gwanda, and Chiredzi have been particularly affected, experiencing temperatures exceeding 40 degrees Celsius. The scorching heat has taken a toll on both humans and animals. Residents are resorting to various strategies to cope, […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "Zimbabwe Broadcasting Corporation recapitalisation to boost national identity: Minister Muswere",
            "url": "https://www.chronicle.co.zw/zimbabwe-broadcasting-corporation-recapitalisation-to-boost-national-identity-minister-muswere/",
            "content": "Harare Bureau\n\nTHE recapitalisation of the Zimbabwe Broadcasting Corporation (ZBC) is poised to revolutionise the media landscape, bolstering its role in shaping national identity and promoting local culture, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere said during the commissioning of 25 vehicles and equipment for radio and television transmission yesterday.\n\nEquipment worth US$2 million was sourced through the Ministry of Finance, Economic Development and Investment Promotion, with an additional donation of US$100,000 from a private donor and a further US$86,000 sourced through the Ministry of Information, Publicity and Broadcasting Services.\n\nThis recapitalisation effort is part of the Government of Zimbabwes commitment to ensure that ZBC takes its rightful place in building national consciousness, considering heritage-based broadcasting, which includes our values as a people, our ethics, and most importantly, the role, responsibility, and mandate of ZBC as an institution, he said.\n\nHe said that his Ministry had been tasked with ensuring that ZBC implements a turnaround strategy to catapult the institution to profitability. This would be achieved through interventions such as a debt restructuring programme and increased revenue generation through advertising, among other initiatives.\n\nAs directed by President Mnangagwa, Dr Muswere said the recapitalisation of strategic institutions such as ZBC was vital for the macroeconomic growth of the country.\n\nDr Muswere highlighted the crucial role of human resources in ZBCs turnaround, emphasising the need for a strong work ethic, honesty, and a collective effort to reduce costs and increase efficiency.\n\nThe turnaround strategy should include the importance of human resources management and organisational development. We need to bring back a culture of hard work, honesty, unity, and selflessness, and eliminate the culture of greed, cannibalisation, and destruction. It is the responsibility of every employee of the corporation to work together to achieve cost containment measures, he said.\n\nHe also stressed the importance of diversifying revenue streams and reducing reliance on government funding.\n\nYou cannot be running around with begging bowls everywhere. The Treasury has its own responsibilities. The purpose of the Treasury is not to allow people to mismanage their institutions. I believe with the expertise we have, a diversified board of directors, knowledge and experience, a good executive, and the collective responsibility of the workers committee, as part of an integral ecosystem, we should be able to turn around this institution, he said.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (second from right) cuts a ribbon to commission ZBCs new broadcasting equipment and vehicles with his deputy Dr Omphile Marupi (left), Permanent Secretary Nick Mangwana (right) and ZBC acting board chairman Advocate Lewis Uriri (centre) witnessing the occasion in Harare yesterday. -Picture: Memory Mangombe\n\nHe stated that the vehicles should all be channelled towards improved content creation and revenue collection.Acting ZBC board chairperson Advocate Lewis Uriri said the equipment would significantly enhance the operations, mobility, and technical capabilities of the broadcaster.\n\nThe addition of these motor vehicles will significantly improve our mobility, enabling us to manage our demanding travel schedules and meet the daily operational requirements of our broadcasting mandate. Likewise, the broadcasting equipment will elevate our technical capabilities, ensuring that ZBC continues to deliver quality content that informs, educates, and entertains the people of Zimbabwe, he said.\n\nAdvocate Uriri said the donations were not just investments in equipment and vehicles but in the nations ability to stay informed, inspired, and connected.\n\nWe must be the first and most reliable source of accurate, factual, and verifiable reportage and content in a context where the single most potent threat to our unitary statehood and national security is disinformation, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Minister-Muswere-1.jpg",
            "description": "Harare Bureau THE recapitalisation of the Zimbabwe Broadcasting Corporation (ZBC) is poised to revolutionise the media landscape, bolstering its role in shaping national identity and promoting local culture, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere said during the commissioning of 25 vehicles and equipment for radio and television transmission yesterday. Equipment worth US$2 […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "From Page to Screen: ‘Nyika, I Love You’ Set for Hollywood Adaptation",
            "url": "https://www.chronicle.co.zw/from-page-to-screen-nyika-i-love-you-set-for-hollywood-adaptation/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nIN a ground-breaking moment for Zimbabwean literature, Alice Vye Henningways emotionally charged novel, Nyika, I Love You, is set to captivate audiences worldwide with its upcoming Hollywood adaptation.\n\nThe project, led by acclaimed producer Stacy Ekstein and her company, Market Street Productions, marks a significant milestone, not only for Henningways literary career but also for the global recognition of Zimbabwean storytelling.\n\nHenningways novel tells the compelling tale of a relationship between a child and her Shona maid, set against the backdrop of Rhodesia/Zimbabwes tumultuous history. Through the eyes of the protagonist, Joanna, readers are invited into a world rich with cultural depth, personal struggles, and the stark realities of life in a nation grappling with profound change.\n\nIts a narrative that captures the duality of beauty and brutality, reflecting the complexities of love, motherhood, and survival in the majestic yet harsh environment of the Save Valley Conservancy.\n\nWhen asked about the adaptation, Henningway expressed her initial feelings of excitement and disbelief.\n\nIts a huge honour to have my work recognised in this way, she said, emphasising her thrill at the opportunity to share her story with a wider audience.\n\nThe thought of seeing her characters come to life on screen is both thrilling and surreal for the author, who has poured her heart into this narrative.\n\nThe journey towards adaptation began a year ago when Henningway met Ekstein in the United States, introduced through a mutual connection from Zimbabwe. Ekstein, after reading Nyika, I Love You, found the story deeply moving and reached out to discuss its potential for film.\n\nTheir collaboration quickly blossomed, grounded in a shared vision to honour the heart of the story while translating it into a captivating cinematic experience. Henningway described Ekstein as approachable and passionate, noting her commitment to preserving the essence of the narrative.\n\nThe themes of love, loss, identity, and resilience resonate deeply within the novel. For audiences in Zimbabwe, there is a profound connection to the characters and their experiences, while international readers are drawn to the universal emotions and rich cultural tapestry woven throughout the novel.\n\nHenningway believes this balance is what attracted Ekstein and Market Street Productions to the project. In the end, love can truly conquer all, she reflected, highlighting a core message of her work.\n\nAs a writer, Henningways path has been marked by both triumphs and challenges. Her debut novel has soared in popularity, ranking highly on Amazon and securing its place among bestsellers in various countries.\n\nRanking 22 behind Barack Obamas Ein amerikanischer Traum and Trevor Noahs Its Trevor Noah: Born a Crime: Stories from a South African Childhood (Adapted for Young Readers), Henningways novel has shown real potential.\n\nShe credits her success to the unwavering support of diverse bookstores, such as Kinokuniya, which has championed her work globally.\n\nTheir commitment to diverse voices made it possible for Nyika, I Love You to be discovered by readers who might not have come across it otherwise, she noted.\n\nHowever, Henningways journey has not been without obstacles. Her experience trying to showcase her African narrative at the Sharjah Book Fair exemplifies her determination to ensure that nuanced African stories find a platform on the global stage. Despite facing significant challenges, she persevered, motivated by the belief that every writers voice is valuable.\n\nMy advice to aspiring authors would be to trust in the authenticity of their voice and never be discouraged by obstacles, she encourages.\n\nHenningways literary achievements have allowed her to enchant audiences from Sydney to Berlin, gracing prestigious events like the Daughters of Africa gathering. These experiences have reinforced her understanding of storytelling as a powerful tool for building empathy and understanding across cultures.\n\nEvery audience Ive spoken to has shown me how deeply stories can connect us, regardless of where we come from, reflected the Spain-based author.\n\nAs the film adaptation of Nyika, I Love You takes shape, Henningway hopes it will stay true to the spirit of the book while finding its unique voice in cinema. She is particularly excited about seeing the vibrant landscapes of Zimbabwe captured on screen, as well as the emotional journeys of her characters.\n\nThe visual elements of the story will add a whole new layer to the experience, she said.\n\nThe acquisition of her literary work is not just a personal triumph for Henningway; it symbolises a broader recognition of Zimbabwean literature and storytelling. It serves as an invitation for audiences worldwide to explore the richness of Zimbabwean culture and the universal themes that connect the world.\n\nEksteins heartfelt admiration for Henningways work speaks volumes about the impact of Nyika, I Love You.\n\nAlice Vye Henningways book broke my heart and left me with the hope that love conquers all, she expressed, highlighting the profound emotional weight of the narrative.\n\nWith a portfolio that includes collaborations with major studios like Warner Brothers and The Jim Henson Company, Ekstein is well-equipped to bring Henningways vision to life.\n\nIn a heartfelt message to her readers and fans, Henningway expressed her gratitude for their support, which has been a constant source of inspiration. As she embarks on this new chapter with the film adaptation, she hopes it continues to inspire and move audiences.\n\nStories have the power to change lives, and Im grateful for the opportunity to share mine, she said.\n\nHenningway expresses her heartfelt gratitude to key supporters in her journey. She thanks Web Chiges for connecting her with opportunities in Los Angeles, Bulawayos Frankie Kay for her work as the photographer for her book cover, and Lynda Woodin for opening numerous doors. Highlighting the strong network among Zimbabweans, she emphasised their perseverance and courage in overcoming challenges. Additionally, she acknowledges her husband and daughter Kate, along with her four bonus daughters, for their unwavering support throughout her literary journey.\n\nThe forthcoming adaptation of Nyika, I Love You heralds a new chapter in the artistic history of Zimbabwe, where the voices of its people can echo through the halls of Hollywood and beyond.\n\nWith the support of Market Street Productions and Ekstein, Henningways story is set to inspire and captivate audiences far beyond the borders of Zimbabwe, celebrating the rich tapestry of human experience that transcends geography and culture.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Alice-and-Stacy-640x380.png",
            "description": "Mbulelo Mpofu,mbulelo.smpofu@gmail.com IN a ground-breaking moment for Zimbabwean literature, Alice Vye Henningway’s emotionally charged novel, Nyika, I Love You, is set to captivate audiences worldwide with its upcoming Hollywood adaptation. The project, led by acclaimed producer Stacy Ekstein and her company, Market Street Productions, marks a significant milestone, not only for Henningway’s literary career but […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "Raza in milestone",
            "url": "https://www.chronicle.co.zw/raza-in-milestone/",
            "content": "Brandon Moyo,[emailprotected]\n\nWEDNESDAY, December 11 will be a day that Zimbabwe T20I captain Sikandar Raza will always cherish, as he was presented with his 100th T20I cap by Craig Ervine during the opening match of their on-going series against Afghanistan at Harare Sports Club.\n\nEleven years after making his debut for the Chevrons against Bangladesh at Queens Sports Club in Bulawayo, Raza has been a cornerstone of Zimbabwes T20 side, setting numerous records in the games shortest format. Throughout his distinguished career, the 38-year-old all-rounder has broken several records in Zimbabwean colours.\n\nSome of these include the most Player of the Match awards in T20Is (17), the most runs in an innings by a captain (133 runs, only behind Aaron Finchs 172), the most 50s in consecutive innings (five), the most sixes in an innings (15 sixes, the fourth most), the third-best figures in an innings by a captain, and the third-highest partnership for the fifth wicket (141 runs not out with Clive Madande).\n\nZC managing director Givemore Makoni hands over to Sikandar Raza an appreciation accolade after the latter reached 100 T20I games for Zimbabwe\n\nRaza described reaching 100 T20I matches for Zimbabwe as a humbling experience and expressed his gratitude to all who had supported him on his journey.\n\nI just want to thank God. It has been a tough journey, I never thought I would reach 100 (T20I matches). To see myself standing here, if it wasnt for the love and support from the fans, the nation, the board, my teammates, and the support staff in the dressing room, I wouldnt be here, said Raza after the game.\n\nHe also took to social media to share his thanks. Making the occasion even more special was Zimbabwes first-ever T20I win over Afghanistan in five years.\n\nSikandar Raza\n\nFirstly, I thank ALLAH and all the prayers Ive had over the years. A milestone made even more special because of the win. Thank you Zimbabwe for accepting me. Thank you Zimbabwe Cricket for the opportunities, and lastly, thank you to my teammates and Zimbabweans for the love and support Ive received over the years. I am forever grateful, and In Sha Allah, we continue together as a team, he posted on social media.\n\nIn his 100 T20I appearances for Zimbabwe, Raza has scored 2 306 runs, including one century and 14 half-centuries, at an average of 26,20. He is Zimbabwes leading run-scorer in the format.\n\nWith the ball, he has claimed 77 wickets, with best figures of 5/18. He is also the Chevrons leading wicket-taker in T20Is. Raza was named captain of the T20I side in November last year.\n\nRaza and his Chevrons will be back in action today for the second match against Afghanistan at Harare Sports Club. Zimbabwe leads the three-match series 1-0 after winning the opener by four wickets. The third and final match is scheduled for tomorrow at the same venue. Both matches start at 1.30pm.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Sikandar-Raza.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com WEDNESDAY, December 11 will be a day that Zimbabwe T20I captain Sikandar Raza will always cherish, as he was presented with his 100th T20I cap by Craig Ervine during the opening match of their on-going series against Afghanistan at Harare Sports Club. Eleven years after making his debut for the Chevrons against […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "COMMENT: Exercise caution during festive season",
            "url": "https://www.chronicle.co.zw/comment-exercise-caution-during-festive-season/",
            "content": "The festive lights are already on in many places. The colours  red and white  are back, dazzling.\n\nThe Father of the time is back too in that outfit and with the bell in hand, entertaining the kids with chocolate, sweets and the opportunity for a snap.\n\nOver the next few days, the pay cheques will arrive for those in formal employment. For those who arent, but set something on the side since January for this time of the year, the time for them to empty their wallets is now.\n\nThe biggest party of the year will begin. People will spend on their best outfits, make-up, food, presents and travel. Those who will travel will do so from this weekend, peaking next weekend.\n\nBusinesses are preparing to deliver. Manufacturers, supermarkets, clothing and beer outlets, fuel suppliers, bus companies and the like. We hear that Victoria Falls is already fully booked until early next month. The same must apply for Nyanga, Kariba, Hwange, Matopos, Great Zimbabwe, Binga and Gonarezhou as well.\n\nBut not everyone celebrates Christmas in a resort. A number will do so at their rural homes. This will add numbers and colour to the countryside.\n\nThe team from South Africa and Botswana will next week pack Beitbridge and Plumtree border posts as they drive back home to celebrate and rest.We are grateful to the Almighty for His favour for us to witness this moment yet again.\n\nGreat Zimbabwe\n\nAs we celebrate, we urge our people not to get too excited as if tomorrow will not come.\n\nChristmas and New Years are two holidays only a week apart. The second week of January schools will open for everyone, those who overspent and those who spent within their means.\n\nSchool fees will have to be paid and school uniforms will have to be bought.\n\nThose who are driving over the next two weeks, must do so responsibly to minimise the risk of accidents so police dont have the trouble of adding up the death toll; so, our health centres deal with inevitable illnesses.\n\nThose who drink must do so responsibly as well. Just enough for them to enjoy themselves and relax, not to make fools of themselves.We are confident police are, as they always do, deploying enough details and resourcing them appropriately for them to ensure our people celebrate well, at the same time enforcing law and order in case some of us get carried away.\n\nOn the 31st, the Thanksgiving and Dedication Service should be hosted in Bulawayo with, as is always the case, President Mnangagwa headlining it.\n\nThis highlights the centrality of the Church in national governance, over this Christian holiday and the year to some.\n\nWe, thus expect a celebratory and prayerful two weeks, as we close another successful but challenging year and look forward to a better 2025.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2012/12/festive%20season%2017dec12.jpg",
            "description": "The festive lights are already on in many places. The colours — red and white — are back, dazzling. The Father of the time is back too in that outfit and with the bell in hand, entertaining the kids with chocolate, sweets and the opportunity for a snap. Over the next few days, the pay […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "Sunday burial in Bulawayo for Comrade Report",
            "url": "https://www.chronicle.co.zw/sunday-burial-in-bulawayo-for-comrade-report/",
            "content": "Nqobile Bhebhe and Joseph Madzimure\n\nTHE body of national hero and former Vice President Phelekezela Mphoko (84) arrived in Bulawayo yesterday afternoon, with his family disclosing that he will be buried at his Douglasdale farm tomorrow.\n\nHis widow, Laurinda, and his two daughters, Sikhumbuzo and Siduduzo, accompanied the body from India, where he died last Friday.\n\nAn Airforce of Zimbabwe aircraft carried the body from Harare, touching down at Joshua Nkomo International Airport at 2:42 pm.\n\nCde Mphokos casket, draped with the national flag, was carried to a waiting hearse by members of the Zimbabwe National Army.\n\nFlags draping coffins boldly symbolise a nations profound appreciation and respect for its fallen heroes.Bulawayo Provincial Affairs and Devolution Minister Judith Ncube, Deputy Chief Secretary in the Office of the President and Cabinet Reverend Paul Damasane, Politburo member Elifas Mashava, Zimbabwe Ambassador to India Ms Stella Nkomo, service chiefs, Zanu-PF Provincial chairman Cde Jabulani Sibanda, and other dignitaries received the body.\n\nFrom the airport, Cde Mphokos body was taken to Doves Funeral Parlour, where a brief service was held at the chapel. There was a standstill at Doves Funeral Parlour as the hearse made its way.\n\nEarlier in the day, at a funeral parade attended by service chiefs and senior Government officials at Charles Gumbo Barracks in Harare yesterday, Vice President Dr Constantino Chiwenga described Cde Mphoko as an illustrious national hero who contributed immensely to the nation during the liberation struggle and after independence.\n\nWe have lost one of the few surviving renowned commanders from the former Zimbabwe Peoples Liberation Army, Zipra; a resolute giant of the liberation struggle whose immense contribution to our Independence is a legacy too bold to be forgotten or erased.\n\nVice President Constantino Chiwenga pays his last respects to late former Vice President, Phelekezela Mphoko at Charles Gumbo Barracks in Harare yesterday. Picture by Joseph Manditswara\n\nTo the bereaved Mphoko family, his spouse, the children, and the nation at large, may we all derive solace in the knowledge that his selfless contribution to his country and people will continue to inspire us and future generations, he said.\n\nVice President Chiwenga said Cde Mphoko became actively involved in the countrys liberation movement at a tender age in the 1960s. He noted that Cde Mphoko was one of the first youths to be dispatched for military training in the Union of the Soviet Socialist Republics, alongside Cdes Akim Ndlovu, Ambrose Mutinhiri, and Charles Chikerema in 1964.\n\nVice President Chiwenga also said that Cde Mphoko was part of the delegation that played a pivotal role in securing Zimbabwes Independence during the 1979 Lancaster House Conference. At Independence, he was appointed to the demobilisation board of ex-combatants and later held various Government positions, including ambassadorial roles.\n\nIn his diplomatic career since 1987, he served with diligence as Zimbabwes ambassador to Mozambique, Austria, Botswana, Russia, and South Africa. Due to his diligence and acumen, he was appointed Vice President in 2014, a position he held until 2017. He was also in charge of the National Healing, Peace and Reconciliation portfolio, where he worked relentlessly to promote national peace, reconciliation, and equitable development in the country.\n\nOur late former Vice President was also a successful businessman and a farmer, majoring in cattle ranching, said the Vice President.\n\nMeanwhile, in an interview at Doves Funeral Parlour in Bulawayo, where the body was kept last night, the late national heros younger brother, Mr Ndabenzinhle Mphoko, expressed gratitude for the Government support. He disclosed that the national hero would be buried tomorrow at his Douglasdale farm.\n\nIn a condolence message, the John Landa Nkomo Memorial Trust said it was deeply saddened by the passing of Cde Mphoko, who took over the nations vice presidency from the late Vice President John Landa Nkomo.\n\nIt said the two national heroes closely worked together from the early days of the liberation struggle under Zapu, making huge sacrifices and exhibiting a deep passion to end colonialism.\n\nTheir passion to serve the country continued after attaining Independence as they fought for economic prosperity for the majority of Zimbabweans. The late VP Mphoko and the late VP Nkomo retained a close relationship throughout the struggle days, after Independence, and right up until the passing of the latter in 2013, it noted.\n\nStruggle stalwart, Senator Angeline Masuku, who is a trustee of the JL Nkomo Trust, said the late Vice President Nkomo and Cde Mphoko had a very close relationship from the days of the struggle, although few were aware of their bond.\n\nShe said it was befitting that President Mnangagwa bestowed the highest honour in the country of National Hero on Cde Mphoko, as he was deserving due to his commitment and sacrifices both before and after the liberation struggle.\n\nThe chairman of the trust, son to the late VP John Landa Nkomo, Jabulani Nkomo, said the late Cde Mphoko was one of the first people to honour the legacy of Cde Nkomo through donating a floating trophy earmarked for the Tsholotsho Inter Schools competition under the banner of the John Landa Nkomo Sports Tournament.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/geg.jpg",
            "description": "Nqobile Bhebhe and Joseph Madzimure THE body of national hero and former Vice President Phelekezela Mphoko (84) arrived in Bulawayo yesterday afternoon, with his family disclosing that he will be buried at his Douglasdale farm tomorrow. His widow, Laurinda, and his two daughters, Sikhumbuzo and Siduduzo, accompanied the body from India, where he died last […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "A night to remember: Fashion Couture’s impact on Bulawayo’s fashion scene",
            "url": "https://www.chronicle.co.zw/a-night-to-remember-fashion-coutures-impact-on-bulawayos-fashion-scene/",
            "content": "Trish Mukwazo,[emailprotected]\n\nLAST Friday night, Rite Chicken restaurant transformed into a glamorous runway as aspiring models showcased stunning fashion designs from Bulawayos emerging fashion houses, House of Lumire and Netties Boutique.\n\nThe event was the brainchild of 25-year-old Dumisani Nxumalo Mcijo, the founder of Fashion Couture, a foundation dedicated to empowering black designers, fashion businesses, models, and artists.\n\nBorn and bred in Bulawayos Cowdray Park suburb, Mcijo attributes his passion to his supportive parents who nurtured him throughout his journey in launching the foundation, alongside his mother who has an ache for fashion designing. With a mission to create opportunities for exposure and support, the foundation plans to provide financing options for local and international fashion businesses.\n\nMcijo is also the founder of Mogana Design & Tech and BOW Clothing Brand. Sponsored by Glitter Guard Security, Bonitas Events, Vivid Vinci Art, Negus Lighting, Rite Chicken Restaurant, and Mogana, the event was held under the banner of Fashion Couture.\n\nMcijo expressed excitement about the success of his first much-anticipated event. Inspired by the recent closure of a local fashion business, he identified the need for an organisation like Fashion Couture to provide support and resources to help businesses thrive.\n\nWe curated a unique experience, and our sponsors will be pleased with the content we created. Were looking forward to collaborating with prominent brands in South Africa and expanding our reach to other countries, he said.\n\nHe said that in the next two months, he will be partnering with a well-known South African brand to host a fashion week.\n\nAndrew Tembo, the event manager of Rite Chicken, expressed his thrill at attending a fashion show that showcased local designers, which is essential in promoting African designers and artisans. My message to the community is that we have the skills and abilities to excel, just like our international counterparts. By supporting local artists and designers, we can uplift our nation and foster growth. As the saying goes, charity begins at home, lets start by supporting our neighbours and local communities before looking elsewhere. Together, we can make a positive impact and celebrate African excellence, said Tembo.\n\nPrudence Mtabeni, Marketing Director of House of Lumire, expressed gratitude for the opportunity to showcase designs at the event and for connecting with like-minded individuals.\n\nLocated in Suburbs in Bulawayo at 22 Clark Road, House of Lumiere is a fashion house with a fusion of African heritage and Western spirit, founded by Kaisiwe Moyo, aiming to bridge the cultural gap between Africa and the West through fashion.\n\nResponsible for dressing and makeup of the models, Brunette Nyathi, the founder of Netties Boutique, expressed great enthusiasm about attending this African show, which marks success for the industry as they had the privilege of showcasing the brands design and makeup.\n\nOur brand is responsible for everything that makes an African woman, from hair, makeup, and dresses, she said.\n\nThe event saw the showcasing of various designs, including popular African designs with\n\na touch of Western style. The audience was captivated by the amazing designs that were showcased.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/33ty.jpg",
            "description": "Trish Mukwazo,trishmukwazo515@gmail.com LAST Friday night, Rite Chicken restaurant transformed into a glamorous runway as aspiring models showcased stunning fashion designs from Bulawayo’s emerging fashion houses, House of Lumière and Nettie’s Boutique. The event was the brainchild of 25-year-old Dumisani Nxumalo Mcijo, the founder of Fashion Couture, a foundation dedicated to empowering black designers, fashion businesses, […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "Zimbabwe’s good image under siege abroad?",
            "url": "https://www.chronicle.co.zw/zimbabwes-good-image-under-siege-abroad/",
            "content": "Stephen MpofuUnderhand activities by which Harare City Council employees are accused of enriching themselves with Bulawayo public transport operators blamed for malpractices, will no doubt have besmirched Zimbabwes good name locally and abroad, causing some who intended to do business with us to re-examine their minds.Harare, as the seat of this countrys government, with Bulawayo the seat of international trade, no doubt feature prominently in the minds of those eager to do business or to nurture political alliances with the government and the people of this country.\n\nA commission of inquiry now underway in our capital city has revealed through evidence given that some Harare council employees have been enriching themselves through various activities involving businesses  and that no doubt taints the image of a council directly under the eyes of this countrys Government.No doubt more evidence is likely to surface before the enquiry comes to an end.It is therefore the hope of this humble and law abiding communicologist that Zimbabweans eager to maintain the good name of our seat of governance will leave no stone unturned in providing the enquiry commission with full-proof evidence that will lead to a cleansing of a council that must project the good image of those that anchor a good status for our countrys seat of governance.\n\nIn the former City of Kings and Queens and now the seat of international trade, Bulawayo, a police blitz-krieg recently bagged 494 offenders of which 76 were mushikashika drivers, with 109 vehicles impounded.Bulawayo hosts an international trade fair every year and it is common sense that reasonable international traders wishing to participate at the trade fair each year are likely to develop second thoughts about coming to do business in a city where chaos reigns on the street.The safety of goods brought for exhibition will no doubt preoccupy the minds of traders who read about the chaos on Bulawayos streets and with that wonder if their exhibits will be safe.\n\nZimbabwes good image in the global village is of paramount importance so that, in the first instance, Harare City Council employees and businesses unaware of unorthodox business deals, or corruption, should not hesitate to spill the beans to the commission of enquiry, the objective of which is obviously to clean up the image of businesspeople, councillors and politicians who inhabit our countrys capital city.When enough, irrefutable evidence about corrupt activities is gathered by the commission, the Government will no doubt consider and implement far-reaching measures intended to cleanse and restore the image of our capitals city and the countrys seat of government.Of course, the possibility of those political opponents of our government taking advantage of the corrupt activities as well as of the malpractices of the transport operators to paint a bad image of the state, cannot be ruled out.\n\nBut be that as it may, ultimate power remains in the hands of the government to clean up our house of any malpractices that are wont to make Zimbabwe a no-go area by those intending to do business with us, or spending their hard-earned cash on holiday to a country that a few unruly characters render unhospitable through their Satanic activities.The governments motto that a country is built by its own people/ ilizwe lakhiwa ngabanikazi balo/nyika inovakwa nevene vayo, equally suggests that we, Zimbabweans, must cleanse our country of any deeds such as the ones suggested above in this discourse.Procrastination, which is the thief of time, should be banished from those with the power to cleanse up any mess which rears its ugly head in our midst.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/Untitled-2-11.jpg",
            "description": "Stephen Mpofu Underhand activities by which Harare City Council employees are accused of enriching themselves with Bulawayo public transport operators blamed for malpractices, will no doubt have besmirched Zimbabwe’s good name locally and abroad, causing some who intended to do business with us to re-examine their minds. Harare, as the seat of this country’s government, […]",
            "time": "2024-12-14 06:23:26"
        },
        {
            "title": "Child support ghost haunts Nsukuzonke, Peter accused of neglecting child responsibilities",
            "url": "https://www.chronicle.co.zw/child-support-ghost-haunts-nsukuzonke-peter-accused-of-neglecting-child-responsibilities/",
            "content": "Peter Matika,[emailprotected]FOOTBALL legend Peter Ndlovu, affectionately known as Nsukuzonke, has found himself at the mercy of a woman who recently took him to task on social media over allegations of refusing to pay maintenance for the upkeep of their child in South Africa.For those who might not be in the loop, Peter Ndlovu is not just any footballer. This man is a legend on the field, having dazzled fans across the globe with his footwork and finesse. He was the first African to play in the English Premiership top flight league.\n\nHowever, it appears that off the pitch, hes facing a challenge that no amount of dribbling can get him out of.Florence Dlamini, who recently crawled out of the woodwork, is quite miffed at Ndlovus alleged refusal to contribute financially to their childs upbringing. Dlamini recently lashed out on social media about Ndlovus alleged unbecoming behaviour and even sought the assistance of South African social media catfish Chris Excel to call him out over his actions.\n\nPeters new headache Florence Dlamini\n\nDlamini, who opened up to this publication, claimed that despite numerous attempts to resolve the issue, the football star has remained unyielding, leading to quite the standoff between the two parties. She also claimed that they underwent a paternity test that proved that Peter Ndlovu is the father.I am in so much pain, pain caused by someone who people look up to. Peter Ndlovu is the father of my daughter, a daughter that he is failing to take care of. I am facing a very difficult path after the passing of my mother. My mother had cancer and was in ICU until she passed on, and when I asked for help from this man, he called my child, his blood, a bastard, said Dlamini.\n\nShe alleged that Ndlovu told her that whether there was a bereavement in her family was not his concern.I did not even once ask for help with my mothers medical bills but only asked him to take the baby since schools were closed. I was sleeping at the hospital ensuring that my mother had someone next to her. Thats when he shouted at me and called my daughter a bastard while my mother was fighting for her life in ICU, narrated Dlamini.\n\nShe said after her mother passed away, she travelled to Zimbabwe, leaving their child in the care of a helper.I did not even have the money to pay the helper because I had spent a lot of money on my mothers medical bills and had even exhausted my savings. My friends and colleagues contributed towards my mothers funeral, and it is from the same money where I had to take money to pay the helper and ensure that they have food up until I returned.\n\nI have been pleading with this man to take care of his child and till today he is telling me he is in Tanzania. I dont want to be labelled a bitter mother, but I am sick and tired of this deadbeat man. Every week I see a new post on Facebook, Instagram, and many other social media platforms about what he has acquired. A new post from a father who isnt able to see his children, a new post from a man who wants nothing to do with his children, said Dlamini.She said Ndlovu only contributes 600 South African Rands, which is only enough to cater for food.\n\nIn this economy that we live in, R600 is equivalent to nothing. I have been very understanding, but I am so tired. I am so tired of someone who is selfish and only thinks of himself. I am pleading for help; maybe he can pull up his socks and start taking care of his daughter, said Dlamini.The situation has understandably caused quite a stir between both families, with some calling for the football legend to step up and fulfil his obligations. Its a delicate situation, no doubt.\n\nPeter Ndlovu\n\nOn one hand, theres the welfare of a child caught in the crossfire of adult disagreements. On the other, theres the reputation of a beloved sports figure at stake.How this will all unfold is anyones guess at this point, but its certainly a story thats capturing the attention of many. Ndlovu has yet to make an official statement regarding the allegations, despite this publication reaching out to him for a comment.\n\nPerhaps Nsukuzonke remains unabated, as he cruises the streets in his brand-new R2.6 million (US$144 000) 2024 BMW X6M Sport Competition, which he received as a gesture of appreciation from businessman Wicknell Chivayo for his monumental contributions to the countrys football legacy.This saga reminds us that even our heroes have their battles to fight, some of which are far removed from the glory and cheers of the stadium.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfsgrgdxcvbvxc.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw FOOTBALL legend Peter Ndlovu, affectionately known as Nsukuzonke, has found himself at the mercy of a woman who recently took him to task on social media over allegations of refusing to pay maintenance for the upkeep of their child in South Africa. For those who might not be in the loop, Peter […]",
            "time": "2024-12-14 06:23:26"
        }
    ]
}