{
    "news": [
        {
            "title": "Mposa continue on winning streak",
            "url": "https://www.chronicle.co.zw/mposa-continue-on-winning-streak/",
            "content": "Sikhumbuzo Moyo\n\nBlack Mambas Queens 0Mposa Academy 2\n\nNEWLY promoted Zimbabwe Womens Super League side, Mpopoma Sports Academy continued with their disrespect for seasoned teams in the league after shocking Black Mambas Queens at their own Mkushi Academy backyard this afternoon.\n\nSecond half goals, 11 minutes apart by Rutendo Madongorere (65mins) and Thando sibanda (76 mins), were enough to secure three back to back points for the Bulawayo based lasses after their opening 2,1 over Highlanders Royals in the debut and opening league match last week.\n\nMeanwhile, Highlanders Royals dropped their second set of three points after they were mangled 3,0 by FC Platinum Queens in Zvishavane\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/soccer.jpg",
            "description": "Sikhumbuzo Moyo Black Mambas Queens 0 Mposa Academy 2 NEWLY promoted Zimbabwe Women’s Super League side, Mpopoma Sports Academy continued with their disrespect for seasoned teams in the league after shocking Black Mambas Queens at their own Mkushi Academy backyard this afternoon. Second half goals, 11 minutes apart by Rutendo Madongorere (65mins) and Thando sibanda […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "HALLELUJAH! Pastor Barak finally bags first award at ZGMA",
            "url": "https://www.chronicle.co.zw/hallelujah-pastor-barak-finally-bags-first-award-at-zgma/",
            "content": "Mthabisi Tshuma ,Zimpapers Arts and Entertainment HubAFTER years of nominations but no wins, Bulawayos own Pastor Barak has finally struck gold!\n\nThe gospel crooner, whos long been a familiar name in awards circuits like the Bulawayo Arts Awards (BAA), National Arts Merit Awards (Nama), and Skyz Metro FM Awards, had never tasted victoryuntil now.\n\nApril 11, 2025 will go down as the night of breakthrough, as the inaugural Zimbabwe Gospel Music Awards (ZGMA) crowned Pastor Barak the Best Influential Pastor in the Gospel Industry. The glitzy event held at Longchen Plaza in Harare was packed with praise, power, and praise-worthy fashion, with Pastor Barak showing up dressed to killalongside his equally elegant wife.\n\nHe also scooped second place in the Peoples Choice Best Song of the Year, coming in just behind gospel giant Michael Mahendere, with Dorcas Moyo clinching third.\n\nI never saw it coming, said an emotional Pastor Barak. This is an achievement that I will so ever cherish and I have a feeling it marks more great things to come.Could this be the start of a divine winning streak for the pastor-musician?\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/bank.jpg",
            "description": "Mthabisi Tshuma ,Zimpapers Arts and Entertainment Hub AFTER years of nominations but no wins, Bulawayo’s own Pastor Barak has finally struck gold! The gospel crooner, who’s long been a familiar name in awards circuits like the Bulawayo Arts Awards (BAA), National Arts Merit Awards (Nama), and Skyz Metro FM Awards, had never tasted victory—until now. […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "Conquering couple arrives back in Bulawayo",
            "url": "https://www.chronicle.co.zw/conquering-couple-arrives-back-in-bulawayo/",
            "content": "Sipepisiwe Moyo,Zimpapers Arts and Entertainment Hub\n\nADVENTUROUS cycling couple Vusumuzi Mkandla and Thandolwenkosi Tshuma, who cycled and conquered 11 countries, arrived in Bulawayo today at 10 am to complete the second season of the cycling expedition.\n\nUpon arrival, the couple was welcomed at the Large City Hall by several people who included their family, city fathers and artists. The couple shared the highlights of their journey, which took them a year and some days to accomplish.\n\nWe started our journey on April 10 2024 in South Africa, and we headed to Lesotho, Eswatini Mozambique, Zimbabwe, Zambia, Malawi, Tanzania, Rwanda, Uganda and Kenya.\n\nWe had challenges with weather changes and also the change of water we also got sick with food poisoning, malaria and we could not get a place to camp in other countries which are overpopulated, the journey was hard, they said.\n\nAs a couple, they discovered that as much as they are in love, they both love travelling and they embarked on a journey which was something both of them enjoyed. That was their major inspiration.\n\nWe were so fortunate and blessed that we discovered that we love travelling and we then agreed to embark on this journey. We then chose to use a bike as this gives us an opportunity to meet people and have firsthand experiences and we could go to remote places which alone is a sense of freedom we get from cycling.\n\nAlong the way we learnt a lot, the languages were the first thing that we learnt. We learnt a lot, including culture just understanding the way people live beyond Zimbabwean border. It was a really fascinating experience for us, they shared.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cp.jpg",
            "description": "Sipepisiwe Moyo,Zimpapers Arts and Entertainment Hub ADVENTUROUS cycling couple Vusumuzi Mkandla and Thandolwenkosi Tshuma, who cycled and conquered 11 countries, arrived in Bulawayo today at 10 am to complete the second season of the cycling expedition. Upon arrival, the couple was welcomed at the Large City Hall by several people who included their family, city […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "Ministers visit Rovos-BBR train accident victims",
            "url": "https://www.chronicle.co.zw/ministers-visit-rovos-bbr-train-accident-victims/",
            "content": "Sikhumbuzo Moyo, Senior Reporter\n\nTHE Minister of Tourism and Hospitality Industry, Barbara Rwodzi and the Bulawayo Minister of State for Provincial Affairs Judith Ncube, on Saturday morning, visited eight Gwanda train accident victims at Mater Dei Hospital.\n\nThe accident came about when a Rovos Rail train collided with a Bulawayo-Beitbridge Railway goods train just outside Gwanda town in Matabeleland South province on Good Friday.\n\nSeven of the injured victims are crew members from both trains.\n\nThe victims include three Zimbabwean males and five foreign nationals: one South African male, three South African females and a female United States of America citizen.\n\nAll the victims are said to be in a stable condition, including one male South African national who underwent a grueling 12-hour operation after sustaining a spinal cord injury. The procedure started at 7pm on Friday and ended at 6am the following day.\n\nFollowing a briefing from the hospital staff, the two ministers took the time to visit the patients in their wards. They spoke with the patients, reassuring them that the government is prepared to provide any necessary assistance to aid in their speedy recovery.\n\nFrom Mater Dei Hospital, the Ministers visited the uninjured survivors at a local hotel who were in a jovial mood and ready to continue with their journey to Victoria Falls.\n\nRovos Rail guest services manager Mr Tshepo Letoaba told the two Ministers that his company had chartered a plane to fly the tourist to the resort town on Saturday morning.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-19-at-10.09.58_81749ffc-680x380.jpg",
            "description": "Sikhumbuzo Moyo, Senior Reporter THE Minister of Tourism and Hospitality Industry, Barbara Rwodzi and the Bulawayo Minister of State for Provincial Affairs Judith Ncube, on Saturday morning, visited eight Gwanda train accident victims at Mater Dei Hospital. The accident came about when a Rovos Rail train collided with a Bulawayo-Beitbridge Railway goods train just outside […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "WA-Certified Eswatini coach conducts coaching course at White City Stadium",
            "url": "https://www.chronicle.co.zw/wa-certified-eswatini-coach-conducts-coaching-course-at-white-city-stadium/",
            "content": "Innocent Kurira,Zimpapers Sports Hub\n\nWORLD Athletics (WA) certified coach Muzi Mabuza from Eswatini is in Bulawayo conducting a Level Two Sprints and Hurdles coaching course at White City Stadium.\n\nThe programme, organised by the National Athletics Association of Zimbabwe (Naaz), will run for six days.\n\nA total of 24 coaches have registered for the course.\n\nTwo of the coaches are from Botswana, while one is from Zambia.\n\nThe initiative is part of Naazs ongoing efforts to empower local coaches, a move expected to significantly elevate the standards of athletics in the country.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-19-at-08.51.45_32e05ac9-680x380.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub WORLD Athletics (WA) certified coach Muzi Mabuza from Eswatini is in Bulawayo conducting a Level Two Sprints and Hurdles coaching course at White City Stadium. The programme, organised by the National Athletics Association of Zimbabwe (Naaz), will run for six days. A total of 24 coaches have registered for the course. […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "Delayed start frustrates athletes at Baldmin Bulawayo Half Marathon",
            "url": "https://www.chronicle.co.zw/delayed-start-frustrates-athletes-at-baldmin-bulawayo-half-marathon/",
            "content": "Innocent Kurira,Zimpapers Sports Hub\n\nTHE start of the Baldmin Bulawayo Half Marathon was delayed by over an hour on Saturday at White City Stadium with organisers citing the late arrival of sponsors as the reason for the holdup.\n\nAs the delay dragged on, frustration grew among the athletes. Some participants, unwilling to wait any longer, took it upon themselves to begin the race without official sanction. Organiser Themba Mhlophe issued an apology, acknowledging the inconvenience caused to the runners.\n\nThe event, designed to be inclusive, features a variety of races, the flagship 21km half marathon, 10km and 5km races, and a wheelchair race.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-19-at-08.01.26_37aface9-678x380.jpg",
            "description": "Innocent Kurira, Zimpapers Sports Hub THE start of the Baldmin Bulawayo Half Marathon was delayed by over an hour on Saturday at White City Stadium with organisers citing the late arrival of sponsors as the reason for the holdup. As the delay dragged on, frustration grew among the athletes. Some participants, unwilling to wait any longer, […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "COMMENT: What a wonderful moment to celebrate Independence!",
            "url": "https://www.chronicle.co.zw/comment-what-a-wonderful-moment-to-celebrate-independence/",
            "content": "Gokwes Mutora Business Centre was the place to be yesterday as the country marked 45 years of Independence.\n\nMutora, at the heart of the Midlands Province, hosted this years national celebration that was presided over by President Mnangagwa.\n\nHe, on the previous day, had hosted the Childrens Party at Nyamuroro High School, also at Mutora. Thousands of jubilant kids from around the country attended the event. Indeed, this was a large party (and kids like them so much!), where food, drink, music and fun flowed; but it has a more profound meaning  it symbolises the continuity of Independence through the young.\n\nThe climax was yesterday when tens of thousands of citizens from all over the country gathered at the Mutora Open Ground to witness the main Independence Day celebration, again led by the President.\n\nA big downpour on Mutora blessed the event ahead of the beginning of proceedings, holding back later to allow the celebration to be staged.\n\nIndependence Day is a thoroughly important moment for us. That is the day when Zimbabwe was born 45 years ago after nine decades of struggle against British colonial misrule.\n\nThe first war of liberation in 1896 ended in defeat for the owners of the land. Spear, bow and arrow and the burning spirit to liberate the land were inadequate against the oppressors gun, dynamite and malevolent spirit.\n\nAlthough the masses fell, that uprising was a massive statement of what was to follow.\n\nSeventy more years of oppression ensued. Blacks were kicked out of their ancestral lands and left to wander and settle elsewhere.Whites soon zoned the fertile lands as theirs. They, too, grabbed gold workings and made much money out of them.They enacted multiple unjust laws to cement the misrule.\n\nThe injustice angered blacks more. Better trained and armed and with the spirit to liberate themselves now greater, the second war of liberation erupted in 1966 and ended in a crushing victory for the masses.\n\nThat is the long, difficult, sweaty and bloody road that the brave people of Zimbabwe walked to attain Independence on April 18, 1980, the 45th anniversary of which we marked yesterday.\n\nThe mood was celebratory all over the country yesterday as we reflected on the forgettable 90 years of colonialism, the peoples brave fight against it and the 45 years of post-Independence national development.\n\nWe are now governing ourselves in peace and unity. There is a growing consciousness among our people on the centrality of our nationhood, which is the basis for any people to thrive socially, politically and economically.\n\nZimbabweans own their land and are doing wonders on it. They are driving their economy, thanks to the indigenisation and economic empowerment policy championed by the Government most earnestly since 2000.\n\nInvestment in schools, colleges and universities since 1980 have made our people some of the most educated in Africa.There is massive investment in the health services sector as well, ensuring greater public access to health care.\n\nYesterday was certainly yet another moment for us as a nation to look back, celebrate the progress we have made over the past 45 years and look ahead with hope and commitment to overcome any challenges that come our way so we continue to progress.\n\nSynonyms for Presidentchairmanchairchairpersondirectorchief executiveCEOpresidingprincipalchairedmasterheadpresided\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gffd.jpg",
            "description": "Gokwe’s Mutora Business Centre was the place to be yesterday as the country marked 45 years of Independence. Mutora, at the heart of the Midlands Province, hosted this year’s national celebration that was presided over by President Mnangagwa. He, on the previous day, had hosted the Children’s Party at Nyamuroro High School, also at Mutora. […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "President reaffirms commitment to Zimbabwe prosperity",
            "url": "https://www.chronicle.co.zw/president-reaffirms-commitment-to-zimbabwe-prosperity/",
            "content": "Blessings Chidakwa in Gokwe\n\nPRESIDENT Mnangagwa yesterday reaffirmed the Governments commitment to building a future that honours the sacrifices of the liberation struggle, emphasising that true independence lies in securing prosperity for future generations.\n\nThe President stated that despite ongoing sanctions, climate change-induced setbacks, global economic shocks including attempts by detractors to divide the nation, Zimbabwes trajectory remains unshaken. He underscored that workers welfare remains a top priority, while also paying tribute to the security forces for the peace and stability prevailing across the country.\n\nAs the Commander-in-Chief of the Zimbabwe Defence Forces, the President urged the nation to embrace innovation, technology and skills development as the foundation of future success, with Vision 2030 now within reach.\n\nBefore addressing thousands gathered at Mutora Open Grounds in Gokwe for the main Independence Day celebrations, the President, accompanied by First Lady Dr Auxillia Mnangagwa, inspected the Independence Parade mounted by the ZDF. Vice-President Dr Constantino Chiwenga and his wife, Cabinet Ministers, and Service Chiefs were among the dignitaries present.\n\nVice-President Dr Constantino Chiwenga and his wife\n\nIn his keynote address, President Mnangagwa said Zimbabwes journey since independence has been one of inspiration, marked by significant progress across all sectors.\n\nAfter 45 years of independence, the Zanu-PF Government remains committed to building a future that honours the sacrifices of the past, while securing prosperity for generations to come. To ensure Zimbabwean products remain competitive both locally and globally, technical and vocational education, particularly in Science, Technology, and Innovation, is critical, he said.\n\nThe President said food security would always be prioritised, with the Agriculture Transformation Strategy deepening rural reforms to enhance grain production and efficiency.\n\nLand, which is our inalienable heritage, is being productively utilised, and we anticipate a bumper harvest from the 2024/25 summer cropping season. This will allow us to replenish the Strategic Grain Reserve, he said.\n\nPresident Mnangagwa noted that while last seasons El Nio-induced drought affected many districts, the nation managed to feed itself.\n\nPresident Mnangagwa accompanied by First Lady Dr Auxillia Mnangagwa\n\nThe Food Deficit Mitigation Programme, which included cash transfers to urban households, significantly reduced vulnerability, he said.\n\nWhile saluting the security forces, President Mnangagwa called on all citizens to protect the nation from both internal and external elements that threaten national development.\n\nHand-in-hand, with focus and discipline, let us defend and work harder for our motherland, Zimbabwe. We salute our security services for their loyalty and patriotism, and for steadfastly defending our sovereignty and hard-won independence, he said.\n\nPresident Mnangagwa said the Second Republic is entrenching the rule of law and protecting law-abiding citizens while decisively dealing with rogue elements.\n\nHe also wished the nation a happy Easter holiday.\n\nDivisive and alarmist elements will never triumph over a nation such as ours, born from a rich liberation history and the blood of brave sons and daughters. Law enforcement agencies will always act in accordance with the law and the best interests of our sovereign motherland, he said.\n\nPresident Mnangagwa delivers his remarks at the 45th Independence celebrations at Nembudziya Stadium in Gokwe yesterday.  Picture: Believe Nyakudjara\n\nZimbabwe being a unitary State, the President called for unity and development, encouraging every citizen to contribute positively.\n\nAs communities, let us uphold values of love, unity, compassion, empathy, discipline and hard, honest work  qualities for which Zimbabweans are known. These values must be passed on to all, young and old.\n\nRegardless of political affiliation, religion, race, gender or age, let us all put Zimbabwe first. It is the only country we call home, and so shall future generations, he said.\n\nPresident Mnangagwa said that just like culture and tradition, values such as love, trust and mutual support must be handed down through generations. He further highlighted how Zimbabweans, under the Second Republic, are defying odds and achieving remarkable development successes from household to provincial level.\n\nThe policies of the Second Republic are bearing fruit. The mining sector is leading in value-addition, with a projected 5,6 percent growth this year, spurred by new mines and favourable commodity prices, noted President Mnangagwa.\n\nPresident Mnangagwa inspects a parade at the Independence celebrations in Nembudziya, Gokwe\n\nThe accelerated implementation of the National Development Strategy has had a positive effect on the manufacturing sector. The pharmaceutical sector, for example, has seen capacity utilisation rise to 50 percent from 43 percent.\n\nPresident Mnangagwa said Governments efforts to achieve energy security are yielding results, with rural electrification of schools, clinics, and administrative centres improving service delivery.\n\nOn veterans of the liberation struggle, he said the Government continues to honour their contributions by creating inclusive opportunities for socio-economic participation.\n\nMany programmes are underway, including Presidential Borehole Drilling, Rural Solarisation, Housing Schemes, and Youth Empowerment Initiatives. Communities must be actively involved in these programmes championed by the ruling Zanu-PF. All Zimbabweans regardless of gender, tribe, age or political affiliation must benefit. Zanu-PF is a peoples party, said President Mnangagwa.\n\nHe also highlighted the ongoing rehabilitation and upgrading of infrastructure, particularly in disaster-prone areas like Gokwe. Issuing a stern warning against the misuse of social media, the President urged Zimbabweans to remain vigilant and united.\n\nI commend you, my fellow compatriots at home and abroad, for remaining patriotic and steadfast, never allowing yourselves to be misled by shadowy elements with dubious agendas, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-18-at-21.33.09-1-1-680x380.jpeg",
            "description": "Blessings Chidakwa in Gokwe PRESIDENT Mnangagwa yesterday reaffirmed the Government’s commitment to building a future that honours the sacrifices of the liberation struggle, emphasising that true independence lies in securing prosperity for future generations. The President stated that despite ongoing sanctions, climate change-induced setbacks, global economic shocks including attempts by detractors to divide the nation, […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "Unity, patriotism fill Gokwe celebrations",
            "url": "https://www.chronicle.co.zw/unity-patriotism-fill-gokwe-celebrations/",
            "content": "Kuda Bwititi in Gokwe\n\nGOKWE was alive with song, dance and a patriotic spirit yesterday as thousands of Zimbabweans gathered at the Mutora Open Grounds in Nembudziya to mark 45 years of independence.\n\nThe atmosphere was electric, flags waving proudly, traditional drums beating rhythmically and a deep sense of national pride filling the air. The day was chilly, and it rained in the morning, causing thick mud at the venue.\n\nHowever, this did little to dampen the lively spirit among the thousands of people from all walks of life who attended the Independence Day celebrations. The rural heartland transformed into a sea of celebration as people from all walks of life came together to honour the sacrifices of the past and look towards a brighter future.\n\nAt the centre of the days festivities was President Mnangagwa, who delivered a stirring address that captured both the historical weight of the occasion and the aspirations of the Second Republic.\n\nPart of the crowd that braved the rainy weather to attend the countrys 45th Independence celebrations at Nembudziya Stadium in Gokwe yesterday.  Picture: Believe Nyakudjara\n\nAfter 45 years of Independence, the Zanu-PF Government remains committed to building a future that honours the sacrifices of the past, but fundamentally secures prosperity for the generations ahead, he declared, amid cheers from the crowd.\n\nThe President emphasised the pivotal role of innovation, science and skills development in shaping Zimbabwes economic trajectory. With a call to embrace technical and vocational education  especially in science and technology  he outlined a vision of a self-sustaining, competitive economy rooted in home-grown expertise and resilience.\n\nTo guarantee that Zimbabwean products are competitive in both local and global markets, technical and vocational education, with biases in Science, Technology and Innovation, are of critical importance, he said.\n\nPresident Mnangagwas words struck a chord with the audience. Among the revellers were students, farmers, teachers and artisans  many of whom expressed hope that the Governments push for innovation and education would open doors for youth in previously marginalised communities like Gokwe.\n\nPresident Mnangagwa delivers his remarks at the 45th Independence celebrations at Nembudziya Stadium in Gokwe yesterday.  Picture: Believe Nyakudjara\n\nI felt proud wearing my school uniform and singing for the President. We did rehearsals for weeks and today, I saw hope in the eyes of my classmates, said Tinashe Mudzamiri, a learner at Nembudziya High School.\n\nIve seen many Independence Days, but this one felt different. I have lived in Gokwe for about 15 years and this is the biggest event to ever take place here. This day will never be forgotten by the people of Gokwe.\n\nThe Presidents speech was powerful. It feels like were being called to build something new  and I want my children to be part of that future, shared Mr Thabo Marurenza, who is an artisan at Zesa in Gokwe and is also a brand ambassador for Radio Zimbabwe.\n\nWar veteran Cde Eckem Moyo, whose Chimurenga name is Cde Robert Makiza, stood with pride as he reflected on the significance of Zimbabwes Independence Day celebrations. For him, the occasion was not just a national holiday  it was a deeply personal journey back in time.\n\nLearners from local schools perform displays at the 45th Independence commemorations at Nembudziya Stadium in Gokwe yesterday.  Picture: Believe Nyakudjara\n\nI fought in the Gokwe area, in the dense bushes along the road to Zhombe. Being here today, celebrating independence in the same soil where I fought is surreal. It brings back so many emotions, joy, pride, and a deep sorrow for the comrades we lost along the way, he recalled.\n\nDraped in the colours of the national flag, Cde Moyo watched the festivities unfold with a sense of fulfilment. The beating drums, childrens laughter and patriotic songs all served as a reminder of what they had fought for.\n\nAs war veterans, we are grateful to the President for bringing such a mammoth event to rural Gokwe. He truly is a visionary leader who is living true to his mantra of leaving no one and no place behind, said Cde Moyo.\n\nGokwe businessman Mr Stan Manyiwa could hardly contain his excitement as his enterprise experienced a surge in activity during the Independence Day celebrations.\n\nMembers of the Zimbabwe Prisons and Correctional Services perform mass displays at the 45th commemorations at Nembudziya Stadium in Gokwe yesterday.  Picture: Believe Nyakudjara\n\nBusiness has been very good. It has been so for the past three weeks. The Independence Day celebrations didnt just bring joy to the people, but they also brought life to our markets. Its a reminder that when we come together to celebrate, we all benefit, he said.\n\nAs traditional leaders and Government officials mingled with ordinary citizens, the celebrations echoed with a renewed sense of unity and determination. From traditional dance troupes to school choirs, the days performances reflected Zimbabwes cultural richness and enduring patriotism. President Mnangagwa also lit the Independence Flame, signifying that the legacy of independence is not just about the past, but also about striving for progress, peace, and prosperity.\n\nThe crowd was entertained by various activities, including displays by the Zimbabwe Defence Forces, musicians, and other performers. A musical gala was also scheduled to take place last night, featuring various top musicians.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/nhfgdf.jpg",
            "description": "Kuda Bwititi in Gokwe GOKWE was alive with song, dance and a patriotic spirit yesterday as thousands of Zimbabweans gathered at the Mutora Open Grounds in Nembudziya to mark 45 years of independence. The atmosphere was electric, flags waving proudly, traditional drums beating rhythmically and a deep sense of national pride filling the air. The […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        },
        {
            "title": "Thousands converge to mark Independence",
            "url": "https://www.chronicle.co.zw/thousands-converge-to-mark-independence/",
            "content": "Chronicle Writers\n\nTHOUSANDS of Zimbabweans from all walks of life yesterday thronged various venues across the country to commemorate the countrys 45th Independence Day, an occasion that this year coincided with Good Friday.\n\nThe national event ran under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030, highlighting the Second Republics continued thrust on inclusive development through decentralisation of key State events.\n\nThe main national celebrations were hosted at Mutora Business Centre in Nembudziya, Gokwe North District, in the Midlands Province.\n\nIn Bulawayo, residents braved the morning chill to fill White City Stadium, where the provincial commemorations were held. The festivities began with a colourful procession of drum majorettes from D Square along Nketa Drive, escorted by the police and an ambulance, setting a lively tone for the day.\n\nBulawayo independence celebrations\n\nThe stadium was adorned with 45 national flags, symbolising each year of independence, while banners boldly displayed the milestone figure 45. Bulawayo Provincial Affairs and Devolution Minister Judith Ncube led the provincial event, which kicked off with the singing of the National Anthem.\n\nMinister Ncube inspected a quarter guard mounted by members of the Zimbabwe National Armys 1 Infantry Brigade before delivering President Mnangagwas Independence Day speech to a cheering crowd.\n\nThe audience was thrilled by a joint military parade that showcased the marching and drilling prowess of members from the Zimbabwe Defence Forces (ZDF), Zimbabwe Republic Police (ZRP) and the Zimbabwe Prisons and Correctional Service (ZPCS).\n\nAmong the dignitaries present were Commander 1 Infantry Brigade, Brigadier General Cephas Gurira, ZRP Officer Commanding Bulawayo, Commissioner Jasper Chizemo, ZPCS Officer Commanding Bulawayo, Commissioner Mkhulunyelwa Ngwenya, Deputy Minister of Industry and Commerce Raj Modi, Bulawayo Provincial Affairs Permanent Secretary Mr Paul Nyoni and several Bulawayo City councillors.\n\nI just couldnt miss this moment. I even came along with my children who enjoyed the army drills, said Ms Tinashe Govheya from New Magwegwe suburb.\n\nFor 17-year-old Elton Mpofu of Entumbane, the day was more than a spectacle.\n\nHaving these celebrations means we are a free country. This freedom didnt come cheap as many died for it. Although I wasnt born then, I know it was a painful struggle, he said.\n\nAnother youth, Pardon Khanye, said Independence Day is both a celebration and a moment of reflection.\n\nWe celebrate youth empowerment under the Second Republic. We now have access to loans for projects to fend for ourselves and our families, he said.\n\nIn Matabeleland South, residents gathered at Plumtree High School, where Minister of State for Provincial Affairs and Devolution Albert Nguluvhe presided over the commemorations and read the Presidents speech.\n\nMinister Richard Moyo\n\nIn Matabeleland North, for the first time in history, provincial commemorations were held at Tsholotsho Business Centre, marking a milestone in decentralisation. Despite early morning showers that turned into a downpour later in the day, spirits remained high as thousands flooded the venue. Hundreds walked long distances to be part of the Uhuru provincial celebrations.\n\nMatabeleland North Provincial Affairs and Devolution Minister Richard Moyo, who was accompanied by service chiefs, inspected a military parade before he read the Presidents speech.\n\nMrs Ntombizodwa Ngwenya said she boarded a bus from Tshefunye at 7AM to witness for herself the historic day that Tsholotsho played host to a major national event.\n\nI never thought I will see the day that ministers and senior Government officials will come and celebrate such an important day with villagers right here in Tsholotsho. We are used to seeing such events on television, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gfg.jpg",
            "description": "Chronicle Writers THOUSANDS of Zimbabweans from all walks of life yesterday thronged various venues across the country to commemorate the country’s 45th Independence Day, an occasion that this year coincided with Good Friday. The national event ran under the theme: “Zim@45: Devolve and Develop Together Towards Vision 2030,” highlighting the Second Republic’s continued thrust on […]",
            "time": "18:07",
            "date": "19 Apr 2025"
        }
    ]
}