{
    "news": [
        {
            "title": "Concern over year-old Burnside water leak l Residents decry Council inaction amid crippling water shedding",
            "url": "https://www.chronicle.co.zw/concern-over-year-old-burnside-water-leak-l-residents-decry-council-inaction-amid-crippling-water-shedding/",
            "content": "Raymond Jaravaza ,[emailprotected]\n\nAS Bulawayo residents endure a gruelling 170-hour water-shedding schedule due to dwindling dam levels amid an El Nio-induced drought, a suspected water leak at the Criterion Water Works in Burnside suburb has been wasting vast quantities of water for over a year.\n\nResidents of Burnside accuse Bulawayo City Council (BCC) of failing to address the persistent leak, which has turned into a lucrative opportunity for some individuals and companies.\n\nConstruction firms and residents from Burnside and Douglasdale are reportedly capitalising on the situation, with some selling the leaked water to farmers.\n\nChronicle crews observed private water bowsers collecting water from a stream formed by the leak yesterday.\n\nOne bowser, emblazoned with the name of a local bulk water supplier, had a capacity of 10 000 litres. Another belonged to a construction company that builds low-cost homes in suburbs such as Pelandaba West and Mbundane.\n\nA driver of one of the bowsers revealed that the collected water is sold to peri-urban farmers in areas like Kensington and Douglasdale, whose boreholes have dried up due to the drought.\n\nThe farmers use the water for their cattle and farming activities. As long as its not contaminated by sewage, its suitable for livestock, he said.\n\nHe also mentioned that chicken breeders, who manage thousands of birds, rely on this bulk water for their operations but declined to disclose the price for a 10000-litre tank.\n\nIn addition to commercial use, the leaked water is being utilised by residents.The news crew observed three young girls fetching water from the stream.\n\nOur home is far from here, but we come twice a day to collect water for drinking and cooking. Our mother boils it before storing it in 5-litre bottles, one of the girls explained.\n\nHowever, it was unclear whether the water was treated or raw, raising concerns about its safety.The BCCs communications department had not responded to inquiries by the time of publication.\n\nThe continued wastage of water comes at a time when residents are grappling with severe shortages, with many resorting to unsafe sources for their daily needs. The citys water supply has been under strain for years due to factors such as population growth, climate change, and poor resource management.\n\nIn September, the Upper Ncema Dam was decommissioned after reaching a critical level of 2,08 percent.It was the second dam to be shut down following the decommissioning of the Umzingwane Dam in November 2023.\n\nA recent survey revealed that residents in suburbs like Old Lobengula have been using water from leaking pipes for drinking and household chores.\n\nMs Mulape Mbela, a mother of two, expressed her frustration.\n\nWe havent had tap water for almost a month. We are forced to fetch water from a burst pipe, even though it poses health risks. Boiling water is difficult because of frequent power cuts, so most people use it without taking precautions, she said.\n\nMr Ricky Mafu voiced fears of a potential cholera outbreak, noting that residents often use unclean containers to fetch water from communal boreholes.\n\nMany people bring dirty buckets to collect water, and this compromises the safety of a shared resource, he said.Bulawayo Progressive Residents Association (BPRA) executive director, Mrs Permanent Ngoma, said some suburbs have gone for weeks without running water.\n\nThe decommissioning of dams further exacerbates the water availability challenge.The situation is really bad as some areas go up to three weeks without tap water. We have engaged the council to frequently provide water bowsers, she said.\n\nAccording to a recent council report, the decommissioning of Upper Ncema in September and Lower Ncema in November has reduced the daily water abstraction capacity to 93 megalitres, sourced from Insiza, Inyankuni, Mtshabezi, and Nyamandlovu dams.\n\nAs the rainy season approaches in December, stringent measures are required, including a 170-hour water-shedding schedule.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/xczzzzzzzzzzzzzzzz.jpg",
            "description": "Raymond Jaravaza , raymondjaravaza@gmail.com AS Bulawayo residents endure a gruelling 170-hour water-shedding schedule due to dwindling dam levels amid an El Niño-induced drought, a suspected water leak at the Criterion Water Works in Burnside suburb has been wasting vast quantities of water for over a year. Residents of Burnside accuse Bulawayo City Council (BCC) of […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "President to commission Shurugwi- Mhandamabwe Road",
            "url": "https://www.chronicle.co.zw/president-to-commission-shurugwi-mhandamabwe-road/",
            "content": "Patrick Chitumba,[emailprotected]\n\nPRESIDENT Mnangagwa is today set to commission the US$41 million newly rehabilitated 43km Shurugwi-Mhandamabwe Road at the Mukandapi Business Centre in Shurugwi, Midlands Province.\n\nThis critical infrastructure project will boost connectivity, facilitate trade, and stimulate economic growth in the region, ultimately enhancing the living standards of the local community.\n\nThis initiative is part of the Governments broader plan to enhance key infrastructure in line with the Second Republics National Development Strategy One (NDS1).\n\nUnder the Second Republic, the Government is prioritising economic development and growth.The projects completion is expected to create jobs, stimulate business growth, and improve accessibility, making it a vital catalyst for increased transport movement along the southern corridor.\n\nThe Shurugwi-Mhandamabwe road is a vital infrastructure project that will significantly enhance connectivity, trade, and economic growth in Zimbabwe and the Southern African Development Community (Sadc) region.\n\nAs Sadc Chairman, President Mnangagwas commitment to regional development and cooperation is evident in this initiative, which will not only benefit Zimbabwe but also contribute to the regions economic integration and growth.\n\nThe road serves as a crucial link between Beitbridge Border Post and major towns like Gweru, Kwekwe, and Chinhoyi, facilitating trade and commerce.\n\nThe roads connection between the Midlands and Masvingo provinces demonstrates the Governments progress in developing its road infrastructure, benefiting motorists and downstream businesses along the highway.\n\nThe poor condition of the Shurugwi-Mhandamabwe road had led to motorists diverting through Zvishavane town, negatively impacting local businesses.\n\nHowever, the Government intervened by partnering with Road Trackers Construction (RTC) to rehabilitate the road.The project involved upgrading, widening, and constructing the road, which is a vital link between Beitbridge Border Post and major towns like Gweru, Kwekwe, Chegutu, Kadoma, Chinhoyi, Karoi, and Chirundu Border Post.\n\nThe Midlands community is equally excited about the business opportunities that will be unlocked by the rehabilitation of the highway.\n\nTransport and Infrastructural Development Minister Felix Mhona said President Mnangagwa is delivering on his promise of leaving no one and no place behind in the development agenda.\n\nI am extremely excited that our iconic leader His Excellency the President Cde Dr ED Mnangagwa is living the talk of leaving no one and no place behind. A good road is an economic enabler, and this road tremendously shortens the distance from Beitbridge to Chirundu and vice versa, he said.\n\nMinister Mhona said his ministry will continue with its mandate of ensuring that the countrys major roads are trafficable and navigable.\n\nWe are not only going to end on trunk roads but will also be revisiting other locations so that at the end of the day the road network across the country will be enhanced, he said.\n\nMidlands Provincial Affairs and Devolution Minister Owen Ncube said the rehabilitation of the road marked the commitment by the Second Republic to modernise and industrialise the country in pursuit of an upper-middle-income economy by 2030.\n\nShurugwi-Mhandamabwe Road had become a concern to the leadership, motorists, and Shurugwi residents, but because of a listening President we have, it has been rehabilitated. The reconstruction of the road confirms the New Dispensations development approach of leaving no one and no place behind, he said.\n\nMinister Ncube said the rehabilitation of the Shurugwi-Mhandamabwe Road will help accelerate economic development in the Midlands including contributing to the provincial GDP growth.\n\nAs the shortest and most cost-effective route to international markets via South Africa and Mozambique, the road is crucial for corporates and mining giants operating in the province, he said.Minister Ncube stressed the importance of modernising the countrys road network, saying it is critical in facilitating tourism, trade, and investment.\n\nTo achieve this, Minister Ncube urged local authorities to prioritise infrastructure repair and upgrade, acknowledging the roads strategic importance.\n\nWe are targeting the modernisation of our road network as it is a key economic enabler that facilitates the growth of tourism, trade, and investment. I urge local authorities, in particular, to move with speed to repair and upgrade their infrastructure, he said.\n\nUnder the Infrastructure, Utilities and Digital Economy cluster, Zimbabwes economic blueprint, the NDS 1 prioritises the completion of road rehabilitation projects.\n\nThe main aspirations of NDS1 include infrastructural development as a key enabler in attaining Vision 2030 of having an upper middle-income economy.\n\nNDS 1 notes that a road can become an economy and in this regard, the focus is on the development of feeder roads into communities as a way of developing underdeveloped remote areas.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-at-Varun-1.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw PRESIDENT Mnangagwa is today set to commission the US$41 million newly rehabilitated 43km Shurugwi-Mhandamabwe Road at the Mukandapi Business Centre in Shurugwi, Midlands Province. This critical infrastructure project will boost connectivity, facilitate trade, and stimulate economic growth in the region, ultimately enhancing the living standards of the local community. This initiative is […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "CPC urges vigilance against deceptive festive promotions",
            "url": "https://www.chronicle.co.zw/cpc-urges-vigilance-against-deceptive-festive-promotions/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Consumer Protection Commission (CPC) has urged consumers to remain vigilant against misrepresentation and deceitful promotions during the festive season.\n\nThe commission also encouraged shoppers to exercise their rights, be cautious and make informed purchasing decisions to avoid falling victim to unscrupulous business practices.\n\nCPC, established under the Consumer Protection Act (Chapter 14:44), aims to safeguard consumers by promoting a transparent and fair marketplace.\n\nThe Act was enacted to protect the consumer of goods and services by ensuring a fair, efficient, sustainable and transparent marketplace for consumers and businesses.\n\nSpeaking to Business Chronicle, CPC chairman Dr Mthokozisi Nkosi emphasised the need for consumers to shop wisely.\n\nWe urge consumers to shop wisely as we go for the festive season. Dont be misled.\n\nBe alert to misrepresentation and deceitful promotions.\n\nAsk for information on prices, quality, warranty, and any pertinent information, he said.\n\nDr Nkosi further cautioned against overspending during the festive season, reminding consumers to prepare for January, which is traditionally a financially challenging month.\n\nCPCs main function is to protect consumers, regulate the accreditation of consumer protection advocacy groups, conduct alternative dispute resolution, and promote consumer awareness in collaboration with the relevant line ministries, Government departments, institutions, and advocacy groups.\n\nThe commission brings to book unscrupulous businesspeople who engage in unfair practices that include multi-tier pricing, fraudulent offers, failure to label products properly, and the disclosure of consumers personal information to third parties.\n\nUnder the new regulations, consumers are entitled to be fully refunded for defective or sub-standard goods and can individually approach the courts for redress or refer their complaints to the Commission.\n\nDr Nkosi said this year the commission went full throttle in carrying out its mandate.\n\nNotable milestones included the countrywide awareness campaigns on the rights of consumers, the arrest and prosecution of unscrupulous businesses selling counterfeits, underweight goods and measures, expired products among other things, said Dr Nkosi.\n\nWe have managed to move upward the Consumer Protection Index from below 20 in 2021 to 26 in 2023.\n\nSince last year, over 2 000 businesses have been prosecuted for consumer rights violations, including selling counterfeit and underweight goods.\n\nThese enforcement efforts reflect the Governments commitment to tightening regulations and promoting ethical business practices. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/effsdaaaaaaa.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com  THE Consumer Protection Commission (CPC) has urged consumers to remain vigilant against misrepresentation and deceitful promotions during the festive season.  The commission also encouraged shoppers to exercise their rights, be cautious and make informed purchasing decisions to avoid falling  victim to unscrupulous business practices.  CPC, established under the Consumer Protection Act (Chapter 14:44), […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "Thabani “TJ” Maguranyanga up for National Football League programme",
            "url": "https://www.chronicle.co.zw/thabani-tj-maguranyanga-up-for-national-football-league-programme/",
            "content": "Zimpapers Sports Hub\n\nZIMBABWE rugby player, Thabani TJ Maguranyanga, has been selected for an exclusive group of renowned athletes to participate in the National Football League (NFL) International Player Pathway (IPP) programme in the United States.\n\nThe IPP programme, which was initiated in 2017, serves to identify exceptional talents worldwide and equip them with the opportunity to develop their American football skills. The ultimate goal is to earn a place in an NFL roster.\n\nMaguranyanga is only 21 years old and has been selected alongside 13 others to carry out a 10-week training programme, which involves on-field and classroom education at the elite IMG Academy in Bradenton, Florida.\n\nAfter their training, they will display their skills in front of NFL club scouts as part of the University of South Floridas Pro Day in March.\n\nThe IPP programme has historically welcomed athletes from a variety of sporting backgrounds, including rugby, basketball, Gaelic football, track and field, and other codes. It is reinforced by esteemed football coaching staff.\n\nThe Class of 2025 is an exciting one and we are delighted to welcome these talented athletes from around the world to the International Player Pathway programme. Focusing on our global football development efforts and fostering international talent is crucial to growing our game globally.\n\nThe IPP programme offers life-changing opportunities for international talent, and we look forward to following their progress in the weeks and months ahead, said NFL executive vice-president of international, events and club business, Peter OReilly.\n\nThabani TJ Maguranyanga\n\nMaguranyanga had been making waves in the world of rugby playing in France.After earning international recognition for his performances in rugby Sevens at the Africa Mens Sevens in Mauritius, he had been due to make his Sables debut in the Africa Cup in Uganda. However, an injury prevented him from doing so.\n\nDespite the setback, Maguranyanga refused to be deterred. Instead, he set his sights on a new challenge: securing a spot in the NFL. Should he make it, he would become only the second Zimbabwean to play in the competition, following in the footsteps of Nate Landman.\n\nLandman, whose father had played international rugby for Zimbabwe, was already making a name for himself in the NFL, having joined the Atlanta Falcons after a successful college career at Colorado. Now, Maguranyanga is hoping to follow in his footsteps.\n\nTo achieve this dream, Maguranyanga had to overcome several obstacles. Injuries had plagued his time at top French side ASM Clermont Auvergne. But he persevered and, despite a season out of action and a potentially career-ending injury, he had made a remarkable recovery.\n\nHis efforts paid off with his international debut earlier this year, paving the way for his selection for the NFLs IPP programme.\n\nIf he can continue to demonstrate the same determination and resilience that brought him this far, theres no telling where his career might take him next.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/zcccccccccc.jpg",
            "description": "Zimpapers Sports Hub ZIMBABWE rugby player, Thabani “TJ” Maguranyanga, has been selected for an exclusive group of renowned athletes to participate in the National Football League (NFL) International Player Pathway (IPP) programme in the United States. The IPP programme, which was initiated in 2017, serves to identify exceptional talents worldwide and equip them with the […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "494 nabbed in Bulawayo festive season traffic blitz",
            "url": "https://www.chronicle.co.zw/494-nabbed-in-bulawayo-festive-season-traffic-blitz/",
            "content": "Peter Matika,[emailprotected]\n\nPOLICE in Bulawayo have intensified efforts to restore law and order on city roads through an operation code-named: No to Mushikashika, Touting, Unruly Elements, and Lawlessness on the Roads.\n\nSince its launch on Monday, the operation has led to the arrest of 494 offenders, the impounding of over 100 vehicles, and a renewed focus on compliance with traffic laws.\n\nThe operation aims to address increasing chaos, particularly along 6th Avenue, where reckless driving and illegal commuter ranks have disrupted traffic flow. Streets such as 6th Avenue Extension and Herbert Chitepo Street from 5th to 11th Avenue have become no-go zones for ordinary motorists due to illegal activities by pirate taxi operators, commonly known as mushikashika.\n\nIn the ongoing operation, police are working in conjunction with the Bulawayo City Council (BCC) and the Vehicle Inspectorate Department (VID).\n\nBulawayo provincial acting police spokesperson Assistant Inspector Nomalanga Msebele said they are also targeting motorists not adhering to road traffic rules and vehicles without number plates and those with unsafe modifications such as bars and spotlights.\n\nShe said they capitalising on the recently installed CCTVs in the city centre to nab traffic offenders.We have since the launch of the blitz arrested 494 offenders of 76 are mushikashika drivers. We also impounded 109 vehicles, and 100 of them had no number plates, said Asst Insp Msebele.\n\nShe said the operation also targets non-passenger carrying vehicles being used to carry passengers and unroadworthy vehicles and touts.\n\nMost of the mushikashikas that we impounded had no number plates, and in most cases, we suspect these are the cars used in robberies and kidnappings.\n\nUnlicensed operators are undermining the regulated public transport system and posing safety risks to passengers, said the police spokesperson.\n\nAsst Insp Msebele said the operation forms a crucial part of the ongoing efforts to maintain road safety and order in the city during the festive season.\n\nThis operation involves comprehensive inspections of commuter omnibuses to ensure that they meet the necessary safety standards and regulatory requirements, she said.\n\nAsst Insp Msebele said public transport operators who violate the law will face appropriate penalties, including fines and possible operating licence suspensions.\n\nThe rampant proliferation of Mushikashika and touting poses a serious threat to public safety and order. We are committed to restoring law and order on our streets and ensuring the safety of all citizens, she said.\n\nWe are working with various stakeholders who include public transport providers and Government organs such as the Judicial Services Commission. We have noted that most of these people who are arrested are repeat offenders and therefore there is a need for them to face the full wrath of the law.\n\nAsst Insp Msebele warned that offenders would face stiff penalties, including court appearances and potential prison sentences for repeat offenders.\n\nThis time around there will not be an option to pay a fine but instead will be taken to court where upon conviction they will sentenced to prison, she said.\n\nAsst Insp Msebele urged members of the public not to interfere with operations as they would likely be arrested on charges of inciting public unrest and obstruction of justice.\n\nThis follows the arrest of dozens of onlookers who found themselves on the wrong side of the law this morning as police cracked down on illegal taxis and kombis operating in the city centre.\n\nThe operation aimed at ridding the CBD of unlicensed vehicles, as well as restoring sanity on the roads took an unexpected twist when members of the public began filming the police as they carried out their duties.\n\nAssistant Inspector Nomalanga Msebele\n\nWitnesses reported that the police were actively engaged in stopping and checking vehicles that were not adhering to designated pick-up and drop-off points.\n\nHowever, instead of just watching, many bystanders took their phones and started to capture the action as it unfolded.What started as a casual curiosity quickly escalated into a flurry of arrests as officers deemed the filming as interference with their operation.\n\nWe understand that people are curious, but when it starts to disrupt our work, we have to take action. These operations are crucial for maintaining safety in our city, and we cannot allow distractions, said Asst Insp Msebele.\n\nEarlier this year police launched a nationwide campaign code-named no to touts and mushikashika, where thousands of individuals were arrested and their vehicles impounded.\n\nThe operation sought to reclaim public spaces and enhance commuter safety by cracking down on unauthorised transport services and illegal touting practices.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/xczxzcsdfsdffdf.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw POLICE in Bulawayo have intensified efforts to restore law and order on city roads through an operation code-named: “No to Mushikashika, Touting, Unruly Elements, and Lawlessness on the Roads.” Since its launch on Monday, the operation has led to the arrest of 494 offenders, the impounding of over 100 vehicles, and a […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "COMMENT: Zimbabwe poised to make significant strides in the global cannabis market",
            "url": "https://www.chronicle.co.zw/comment-zimbabwe-poised-to-make-significant-strides-in-the-global-cannabis-market/",
            "content": "ZIMBABWE is emerging as a formidable player in the global cannabis farming industry, leveraging its favourable climate, strategic regulations, and robust marketing strategies.\n\nAlready renowned for its tobacco production, Zimbabwe is now setting its sights on becoming a leading exporter of high-quality medicinal cannabis and hemp fabric.\n\nTobacco\n\nThe strategic goal is to become globally recognised for cannabis, much like France is known for its wines and Ethiopia for its coffee.\n\nFarms like Thathokuhle Enterprises in Douglasdale on the outskirts of Bulawayo are leading the way, employing advanced farming techniques and providing significant employment opportunities, particularly for women.\n\nYesterday, we carried a story of a tour of Thathokuhle Enterprises by various stakeholders on Tuesday. The farm is owned by Mr Mike Querl, his wife Ms Kerrie Mitchell, and their business partner Mr Graeme Jansen van Vuuren.\n\nDuring the visit, Dr Kumbirai Mateva, a scientist at the Kutsaga Research Board, emphasised the significance of ongoing research in cannabis seed cross-breeding. This research aims to integrate foreign genetics with native seeds, ensuring that the resulting seeds can adapt and flourish in the local environment.\n\nZimbabwes climate is particularly well-suited for cannabis cultivation. The countrys optimal growing environment allows for the production of cannabis that meets international standards, which is crucial for both medicinal and recreational markets. The use of greenhouse conditions and advanced agricultural techniques, such as mechanised drip systems and specialised lighting, ensures that the cannabis produced is of the highest quality.\n\nIn 2018, Zimbabwe became one of the first African countries to legalise the production of medicinal cannabis. This regulatory foresight has positioned the country to tap into the burgeoning global cannabis market, which is projected to be worth US$272 billion by 2028.\n\nZimbabwe aims to capture at least US$1 billion of this market, with the potential to significantly boost its economy through job creation, increased revenue, and overall economic development.\n\nThe Zimbabwe Investment and Development Agency (Zida) has been instrumental in attracting investors to the cannabis sector. As of 2022, approximately 60 companies had been licensed to cultivate medicinal cannabis.\n\nZimbabwe Investment Development Authority (Zida)\n\nBy leveraging its natural advantages and regulatory framework, Zimbabwe is well on its way to becoming a key player in the global cannabis industry. The countrys commitment to quality and sustainability in cannabis production is expected to attract international buyers and investors, further solidifying its position in the market.\n\nStrategic planning, favourable conditions, and a commitment to quality mark the countrys journey toward becoming a global leader in cannabis farming. With continued investment and support, the country is poised to make significant strides in the global cannabis market, contributing to its economic growth and development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/07-08-cannabis2.jpg",
            "description": "ZIMBABWE is emerging as a formidable player in the global cannabis farming industry, leveraging its favourable climate, strategic regulations, and robust marketing strategies.  Already renowned for its tobacco production, Zimbabwe is now setting its sights on becoming a leading exporter of high-quality medicinal cannabis and hemp fabric. The strategic goal is to become globally recognised […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "Zimbabwe pushes for digital  transformation  across key sectors",
            "url": "https://www.chronicle.co.zw/zimbabwe-pushes-for-digital-transformation-across-key-sectors/",
            "content": "Leonard Ncube ,[emailprotected]\n\nTHE Government is tirelessly working on improving the Information Communication Technology (ICT) sector as a key enabler for socio-economic development and a vehicle for co-operation and regional integration, an official has said.\n\nOfficially opening the stakeholder Validation Workshop for the Framework of Co-operation in ICT Development, Sustainability, and Regional Action Plan held by the Common Market for Eastern and Southern Africa (Comesa) in Victoria Falls on Monday, ICT, Postal and Courier Services Permanent Secretary Dr Beullah Chirume said digital transformation has helped revolutionise the financial, farming, health, and mining sectors.\n\nShe stressed that collaboration and partnerships that bring value are important in line with SDG 17, which aims to strengthen global partnerships.\n\nThe validation workshop seeks to develop a regionally coordinated public and private sector ICT framework. All Comesa member states, joined by other countries such as Namibia, Mozambique, and East African Community, Intergovernmental Authority of Development, Indian Ocean Commission, SADC, and secretariats of different regional ICT associations, are attending the workshop, which ended yesterday.\n\nComesa states hired a consultant, Cerfodes, in February to review existing instruments related to regional ICT development and institutional co-operation.\n\nDr Chirume said Zimbabwe was pushing a capacity agenda to train and impart ICT skills to everyone to effectively use technology in their own areas.\n\nThe workshop aims to validate a framework of cooperation which can be used to foster synergy, address shared goals, and ensure accountability in implementing set strategies. Let me emphasise the importance of a sustainability strategy and framework for cooperation as it focuses on connectivity and infrastructure, policy and regulation, digital inclusion, and capacity building.\n\nThe plan aims to address critical challenges such as broadband connectivity in underserved areas, cross-border inter-connectivity, cybersecurity, digital literacy, and climate resilience. We must continue to work together as a continent to benefit from partnerships, said Dr Chirume.\n\nShe said having a regional digital plan will enhance integration.The pervasive nature of ICT means that it can work as an enabler of all sectors of the economy, be it in financial, smart education, or health.\n\nSo we are saying in all aspects of the economy, ICT is crucial and a backbone, and will enable efficient delivery of services. This is what we want to see Zimbabwe doing in line with Vision 2030, and that can only happen when we have fully embraced ICT, she said.\n\nShe said Zimbabwes economy will leapfrog and move faster in terms of regulating ICT, riding on sound policies and collaboration with other players and organisations locally and regionally.\n\nThe Permanent Secretary said Zimbabwe has made significant strides in terms of mobile penetration rate, which stands at 96,7 percent, 78,55 percent for internet penetration rate, and broadband penetration at 76,37 percent as of the second quarter.\n\nShe said this was crucial as it has capacitated ordinary citizens, especially in under-served areas.The Government also came up with the Universal Services Fund to improve ICT development and is enhancing the setting up of passive infrastructure for communities.\n\nChirume said: It is a very crucial initiative that promotes growth and development of ICT and telecommunications in our region and entire communities as we all move towards the digital economy. As partners in Comesa and Africa, we can work together to harmonise policies across our borderless ICT countries.\n\nICT, Postal and Courier Services Permanent Secretary Dr Beullar Chirume says ICT is a key enabler to development in Zimbabwe and the region as it enhances every economic sector and fosters regional integration\n\nThe Republic of Zimbabwe acknowledges the value of ICT, in particular their pervasive nature and contribution to economic growth and sustainable development across any sector. As Zimbabwe, through the Ministry of ICT, we are at the forefront of ensuring that all Zimbabweans have access to affordable and reliable internet connectivity through targeted digital access and infrastructure expansion.\n\nShe said the Government had put in place policies and regulations that enhance the sector.Comesa Director of Infrastructure, Dr Bernard Dzwanda, said the overall objective of the EGEE-ICT programme is to deepen regional integration and the growth of the ICT sector in the region.\n\nHe said the EGEE-ICT programme would benefit member states and help in the socio-economic and sustainable development of the region through digital development, poverty reduction, and infrastructure, among others.\n\nIt is vital that the enabling environment for ICT sector development is supported given the role it plays in economic development through a multi-stakeholder approach involving RECs and countries.\n\nICT plays a pivotal role in enabling socio-economic development by driving innovation, increasing efficiency, and improving accessibility to essential services.\n\nThe ICT sector, as we know it, is a key enabler that promotes the development of other sectors such as health, education, transport, among others. Comesa considers ICT as one of its priority sectors in enabling development and overall regional integration and therefore, ensures that initiatives such as the EGEE-ICT programme are given utmost attention to succeed, he said.  @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/xczxcczxzxcgdx.jpg",
            "description": "Leonard Ncube , leonard.ncube@chronicle.co.zw THE Government is tirelessly working on improving the Information Communication Technology (ICT) sector as a key enabler for socio-economic development and a vehicle for co-operation and regional integration, an official has said. Officially opening the stakeholder Validation Workshop for the Framework of Co-operation in ICT Development, Sustainability, and Regional Action Plan […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "All VIP, no general: SAs Morda, Simmy to headline  Bulawayo’s ultimate lifestyle event",
            "url": "https://www.chronicle.co.zw/all-vip-no-general-sas-morda-simmy-to-headline-bulawayos-ultimate-lifestyle-event/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nSOUTH African artistes Morda and Simmy are set to headline The VIP Experience, a premium event scheduled for Unity Day, December 22 in Bulawayo.\n\nThe extravaganza will begin with a daytime event at Kings Kraal, running until 10pm followed by an after-party at The Cotton Lounge. The day promises a blend of elegance and entertainment.\n\nEvent organiser, Mduduzi Mdu Mdlongwa, director of 3D Events, explained that the event aims to revive the exclusive partying culture reminiscent of their earlier premium gatherings at The Horizon, where they hosted renowned acts like Black Coffee and DJ Fresh.\n\nWere bringing back the vibe of premium events. This time, theres no general access  everyone will be either VIP or VVIP. We want people to dress to impress and enjoy an experience worthy of live cameras, said Mdu.\n\nMorda\n\nHighlighting the headliners, Mdu noted their international acclaim and the unique appeal they bring to the line-up.\n\nWeve carefully curated this event for those who enjoy the finer things in life. Morda, with his impeccable fashion sense and entertainer persona, was a natural choice. Simmy adds a touch of elegance, appealing especially to the ladies. Its going to be an unforgettable day and night, he said.\n\nTickets are already on sale, and Mdu urged attendees to purchase early as numbers are limited to maintain exclusivity.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/cxxsffvvxcvxcv.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com  SOUTH African artistes Morda and Simmy are set to headline The VIP Experience, a premium event scheduled for Unity Day, December 22 in Bulawayo. The extravaganza will begin with a daytime event at Kings Kraal, running until 10pm followed by an after-party at The Cotton Lounge. The day promises a blend of elegance […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "Matabeleland North leads the way in village business units",
            "url": "https://www.chronicle.co.zw/matabeleland-north-leads-the-way-in-village-business-units/",
            "content": "Leonard Ncube,[emailprotected]\n\nMATABELELAND North is poised to become a national model for Village Business Units (VBUs) under the Smallholder Agriculture Cluster Project (SACP) targeting to capacitate 100 nutritional gardens in five provinces.\n\nThe initiative aims to transform rural communities through modernisation and industrialisation in line with President Mnangagwas Vision 2030 and the National Development Strategy 1 (NDS1).\n\nThe VBUs concept, introduced by the Government, promotes self-sustaining rural industrialisation through income-generating projects, including horticultural production facilitated by irrigation systems and greenhouses.\n\nThe SACP, implemented by the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, is a collaborative effort with the International Fund for Agriculture Development (Ifad) and the Oil Producing and Exporting Countries (Opec) Fund for International Development (Ofid).\n\nVillage business units have shown huge potential to revolutionise rural communities and improve the quality of their lives consistent with the National Development Strategy 1.\n\nLinked to the VBUs are the school business units that are helping capacitate schools and reduce fees given that there will be other revenue-generating streams other than school fees from parents.\n\nVBUs are equipped with irrigation systems and greenhouses where households engage in horticultural production, among other income-generating projects.\n\nThis dovetails with the Presidential Rural Development Programme, which is part of the Governments Rural Development 8.0 initiative. Other components include the Accelerator Model, Pfumvudza/Intwasa, Presidential Poultry Scheme, Presidential Fisheries Scheme, Presidential Blitz Tick Grease Scheme and the Presidential Cotton Inputs Scheme, which feed into Vision 2030.\n\nSACP is being implemented in five provinces; Matabeleland North, Mashonaland Central, Mashonaland East, Mashonaland West, and parts of Midlands, which did not benefit from another project, the Small Holder Irrigation Revitalisation Programme( SIRP) that started in 2017.\n\nThe SIRP targeted Matabeleland South, Masvingo, Manicaland, and parts of the Midlands.SACPs scope is to promote market-led and climate-smart value chains and a small component of irrigation schemes. The idea is to cushion farmers against the effects of climate change through climate-smart initiatives as well as assist the value chains.\n\nSmart climate agriculture project being implemented through the SACP project in Lupane to boost food security and address climate change impact\n\nThe SACP targets to help 100 VBUs in the five provinces but starting with Matabeleland North as a pilot programme.SACP national project co-ordinator Dr Godfrey Nehanda said the project involves equipping nutrition gardens and VBUs in the five provinces. In Matabeleland North, it is being implemented in Lupane and Hwange.\n\nIn Lupane the projects will be in Lupanes Mabhikwa and Jabatshaba areas.The project focuses on developing and fencing 1,25-hectare gardens, polarised boreholes, drip irrigation, drinking troughs for livestock, taps for domestic water supply and laundry facilities.\n\nThe one hectare is for commercial purposes while the 0.25ha is for a nutritional garden.Dr Nehanda said SACP is a six-year project running from 2021-2027 to improve household incomes and nutrition through smallholder agriculture transformation as well as improve smallholder farmers participation in the agriculture market value chain.\n\nHe said the project is being implemented in 18 districts in the five provinces focusing on value chain development.\n\nThis project comes under the Ministry of Lands where we are complementing Government efforts. The target is to have 100 VBUs and this year we are supposed to accomplish 70 and to date, we are finalising 20 in Lupane and Hwange, said Dr Nehanda.\n\nThe project also involves water provision for domestic and irrigation use in partnership with the Zimbabwe National Water Authority and the Rural Infrastructure Development Agency.\n\nWe are trying to respond to drought issues in collaboration with the Government and we are at an advanced stage of implementing the VBUs, said Dr Nehanda.Matabeleland North Provincial Affairs and Devolution Minister Richard Moyo said the VBUs are part of President Mnangagwas vision to transform the socio-economic state of every community through the rural industrialisation agenda.\n\nThis is part of President Mnangagwas vision to have these village business units.These are the partners we want as Government to develop the country through empowering people, he said.Minister Moyo said capacitating the nutritional gardens will help improve food security and income.  @ncubeleon\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/vxcjiopsdfhsdfg78sdfgu.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw MATABELELAND North is poised to become a national model for Village Business Units (VBUs) under the Smallholder Agriculture Cluster Project (SACP) targeting to capacitate 100 nutritional gardens in five provinces. The initiative aims to transform rural communities through modernisation and industrialisation in line with President Mnangagwa’s Vision 2030 and the National Development […]",
            "time": "2024-12-12 08:42:19"
        },
        {
            "title": "Mawaka inspires hope with launch of Children’s Choir",
            "url": "https://www.chronicle.co.zw/mawaka-inspires-hope-with-launch-of-childrens-choir/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nA NEW beacon of hope for young artistic talent in the city has emerged in the form of the Bulawayo Childrens Choir.\n\nSpearheaded by music director and educator Trevor Mawaka, this 25-member ensemble aims to nurture childrens artistic skills while steering them away from delinquent behaviours and youth vices which have been touted to be their demise.\n\nThe young choir, comprising talented vocalists from Petra High School, Dominican Convent Primary School, Charleston Trust Primary School, and Hillside Primary School, recently recorded their debut single, Banolila (Mother Earth is Crying).\n\nThis poignant and heartfelt ballad addresses the pressing issue of climate change, highlighting its devastating effects on the planet and the need for humanity to take an active role in mitigating global warming.\n\nThe choir is also preparing to shoot a music video to accompany the single, promising to bring their message to a wider audience.\n\nIn an interview, Mawaka expressed his passion for guiding children through music.\n\nIm passionate about helping children hone their artistic skills, and what better way to do that than forming a choir for them? he remarked.\n\nHe emphasised the importance of addressing the challenges facing todays youth, stating, We now have a drug pandemic in our midst, and usually, problems start when children are young. We, as teachers, have an obligation to help parents and guardians raise these children. Climate change problems affect all of us hence the need to challenge young minds to join in the fight against global warming.\n\nMawakas approach has already garnered acclaim. His previous and continuous work with the Charleston Trust Primary School Choir and the MOSH All Abilities Choir has received rave reviews, showcasing his unique ability to inspire and engage young minds.\n\nHis reputation has even crossed borders, as he also helped form the Sawa Childrens Choir in Kenya last year.\n\nThe Bulawayo Childrens Choir is open to welcoming more members, encouraging children with a passion for music to join their ranks. Mawaka believes that music can be a transformative force in young lives, providing both an artistic outlet and a protective shield against the challenges they face.\n\nThrough music, the Bulawayo Childrens Choir aims not only to entertain but also to educate and inspire a new generation of compassionate and creative thinkers.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsafhisdnmjcvbcb.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com A NEW beacon of hope for young artistic talent in the city has emerged in the form of the “Bulawayo Children’s Choir”. Spearheaded by music director and educator Trevor Mawaka, this 25-member ensemble aims to nurture children’s artistic skills while steering them away from delinquent behaviours and youth vices which have been touted […]",
            "time": "2024-12-12 08:42:19"
        }
    ]
}