{
    "news": [
        {
            "title": "‘Aim for excellence’… President urges public sector officials",
            "url": "https://www.chronicle.co.zw/aim-for-excellence-president-urges-public-sector-officials/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nTHOSE serving in the countrys public sector must resist the temptation of complacency and comfort and never betray the sacred trust and confidence bestowed on Government and other departments by the general citizenry, President Mnangagwa has said.\n\nIn his address at the announcement of the 2024 Performance Evaluation Results and 2025 Performance Signing Ceremony held at State House in Harare yesterday, the President said the Second Republic was committed to achieving an agile, innovative, responsive and resilient governance system, pursuant to delivering what is needed by the general citizenry.\n\nRiding on the current momentum, more reforms will continue to be implemented, guided by global best practice, which takes into account the unique needs and challenges of our country.\n\nThe public sector must resist the temptation of complacency and comfort, he said.On that note, President Mnangagwa said it was disappointing that some Government officials were yet to adopt performance contracting, at a time Government continues to roll out results-based management initiatives across the public service spectrum.\n\nIt is disappointing that there are some officials who are yet to acquaint themselves and adopt performance contracting and the formulation of strategic plans. Public sector officials are directed to keep up with the ongoing reforms.\n\nOn its part, my Government will continue to roll out sensitisation and training in Results Based Management across the public sector, at all levels.Digitalisation of performance contracting will also see increased efficiencies within our systems, while benchmarking with best practices remains ongoing.\n\nThe Whole of Government and Society Approach is being strengthened through consultative engagements with grassroots communities and the private sector, as well as bilateral and development partners, he said.President Mnangagwa said officials should never betray the sacred trust and confidence bestowed on Government and other departments by the general citizenry.\n\nPresident Mnangagwa\n\nThe Second Republics foremost duty, he said, remained to uplift Zimbabweans livelihoods.\n\nWe derived our mandate from the people as they expressed their democratic right by voting our ruling, revolutionary Party, Zanu-PF into office.\n\nIn this regard, the various mandates that we are discharging as the public sector, should be reflective of the will of the people of Zimbabwe and undertaken in their interest.\n\nIndividually and collectively, we all have a duty to empower and uplift many more of our fellow country men and women, the young and the old alike, as well as our boys and girls, out of poverty into prosperity.\n\nLet us, never betray the sacred trust and confidence that the people have entrusted on us and our colossal mass Party.\n\nI urge us all to wholeheartedly serve our country with honest, unflinching patriotism, uttermost professionalism, humility and unquestionable integrity, he said.\n\nPresident Mnangagwa said Governments implementation of performance contracting was one of the reforms geared to ensure that the public sector is market and people-centred.Performance contracting, which was introduced in 2021, has had a propelling effect and enabled stakeholders, including ordinary citizens, to assess progress by Ministries, Departments and Agencies (MDAs).\n\nSince its introduction, the system, which has cascaded to Deputy Ministers, has registered notable milestones across all sectors including steady economic growth, introduction of the ZiG, launch of the Presidential Title Deeds Programme and establishment of Village Business Units, among other initiatives.\n\nUnder the Second Republic, we have committed ourselves to achieve an agile, innovative, responsive and resilient governance system.\n\nThis is underpinned by policy thrusts which include: Thinking Big: Policy entrepreneurship and innovation; Managing for Sustainable Development Results; and Accountability.\n\nMy Government is determined to re-purpose our institutions and systems to remain relevant to current and emerging trends, as we harness present opportunities and grapple with the associated challenges, said the President.\n\nPresident Mnangagwa presents the Second Best Performing Chief Executive Officer Rural Local Authorities Award for 2024 to Umguza Rural District Council CEO Mr Collen Moyo at State House in Harare yesterday during a signing ceremony for performance contracts and an awards ceremony for ministers and senior public sector officials.  Picture: Believe Nyakudjara\n\nHe said it was therefore critically important that in the final year of the National Development Strategy 1 (NDS1), the implementation of highly impactful programmes and projects is scaled up to leapfrog the countrys quest to attain high-income society status.\n\nI look forward to the overall Outcome Evaluation Report at the end of the 2025 fiscal year. This will allow us to comprehensively and factually ascertain the impact of Performance Contracting on the economy and citizenry as well as afford us insightful lessons for the implementation of National Development Strategy 2, President Mnangagwa said.\n\nThe enactment of the Government and Results Act, he said, was envisaged to consolidate the nexus between public sector performance and accountability for results.\n\nAlignment between planning and budgeting, and enhancing the rewards and sanctions mechanisms, remain priority areas of focus.\n\nIt is notable that this years Performance Contracts have been extended to Deputy Ministers, Deputy Chief Secretaries, Public Service Commissioners, the Clerk of Parliament and Secretary to the Judicial Service Commission, President Mnangagwa said.\n\nThe President also announced the introduction of Joint Performance Contracts for programmes and projects which will be implemented with effect from next year.\n\nThis should bring traction in the completion of projects, while improving resource allocation and utilisation.These interventions equally provide avenues for the incorporation of the private sector and development partners into public sector programming.\n\nI expect that Joint Performance Contracting will be mainstreamed as we formulate National Development Strategy 2, he said.\n\nIn terms of the performance ratings, awards and recommendations, President Mnangagwa said they had enhanced policy and structural responsiveness, while injecting positive competition among MDAs.Sector specific reforms are being instituted across the public sector so that Government is modernised and responsive to the needs of the people.\n\nThis includes reviewing and eliminating some of the overlapping permits and licences being charged by MDAs.\n\nThe streamlining of cumbersome bureaucratic procedures affecting the ease of doing business, is also being prioritised.\n\nWe are determined to comprehensively consolidate and improve on the gains we have realised towards Zimbabwe being an attractive and competitive investment destination, he said.\n\nPresident Mnangagwa shakes hands with Minister of Sports, Kirsty Coventry\n\nPresident Mnangagwa said the ongoing reforms within public entities were set to see a turnaround towards greater viability and profitability.\n\nKey to this strategic refocusing was the creation of the Zimbabwes Sovereign Wealth Fund, under the Mutapa Investment Fund, he said.\n\nWith regards to the Devolution and Decentralisation Agenda, the President reiterated that Provinces were expected to emerge as dynamic and competitive economic hubs, with marked growth across all sectors.Ministers of Provincial Affairs and Devolution are, thus, directed to champion the implementation of people-centred development projects.\n\nMay I emphasise that Ministries, Departments and Agencies and the public sector as a whole, are directed to adopt synchronised, co-ordinated, and results-driven governance frameworks.\n\nUnder my Administration, the public sector succeeds as one united team, chasing one common national vision, for the good of all our people, leaving no one and no place behind, he said.\n\nIn his remarks before introducing the President, Vice President Dr Constantino Chiwenga said the signing of performance contracts had resulted in improved performance.\n\nHe reiterated President Mnangagwas philosophy that nyika inovakwa nevene vayo/Ilizwe Lakhiwa Ngabanikazi Balo.\n\nOnly through collective effort can we achieve lasting success, VP Chiwenga said.In delivering the vote of thanks, Defence Minister Oppah Muchinguri-Kashiri congratulated the award winners and encouraged the rest.\n\nRemember that the performance contracts framework remains the cornerstone of Governments accountability, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/d2d-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau THOSE serving in the country’s public sector must resist the temptation of complacency and comfort and never betray the sacred trust and confidence bestowed on Government and other departments by the general citizenry, President Mnangagwa has said. In his address at the announcement of the 2024 Performance Evaluation Results and 2025 […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "Minister set to meet BCC over budget impasse",
            "url": "https://www.chronicle.co.zw/minister-set-to-meet-bcc-over-budget-impasse/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nLOCAL Government and Public Works Minister Daniel Garwe, is set to visit Bulawayo tomorrow where he is expected to meet council officials and other stakeholders to explore ways of addressing the ongoing impasse over the citys 2025 budget.\n\nBulawayo remains the only local authority among Zimbabwes 92 councils whose budget has not been approved by the Government, raising concerns about stalled development and service delivery in the countrys second-largest city.\n\nBulawayo City Council (BCC), initially proposed a US$309 million budget for 2025, a 17 percent increase from the previous year. However, Chief Secretary in the Office of the President and Cabinet Dr Martin Rushwaya, flagged anomalies in its formulation, prompting a directive for revisions based on audited 2017 figures.\n\nA special budget committee was subsequently established, comprising council representatives, business stakeholders, residents associations, tertiary institutions and tourism players. Despite these efforts, disagreements between council officials and stakeholders, particularly over the disclosure of salary details, led to a deadlock.\n\nThe local authority cited provisions in the Cyber and Data Protection Act to justify withholding senior management salary details. Stakeholders, however, argued that this lack of transparency undermined trust.\n\nThe business community also raised concerns over labour costs, which had increased by 104 percent since 2017, from US$53 million to US$108 million.\n\nActing Local Government director Mrs Fikile Marovatsanga, confirmed Minister Garwes scheduled meeting with council management and members of the special budget committee. While her comments did not reveal the ministers intended course of action, sources suggest that Minister Garwe may issue stern warnings to council officials. If no resolution is reached, there is speculation that a commission of inquiry could be appointed.\n\nThe Minister will be here on Wednesday, where he will meet council management and members of the special budget committee that was set up last year. The meeting is over the outstanding city budget, which remains unapproved to date, she said.\n\nEarlier this month, Bulawayo Provincial Affairs and Devolution Minister Judith Ncube, gave both parties a one-week ultimatum to resolve their differences. However, this deadline passed without progress, leaving the city without an approved budget as it enters the second quarter of 2025.\n\nThe lack of an approved budget has considerably hindered critical infrastructure projects in Bulawayo. Water shortages remain a pressing issue due to delays in upgrading water reticulation systems. Road maintenance, housing development and sanitation services have also been affected.\n\nBulawayo mayor Councillor David Coltart, expressed concern over the delays, saying it has exacerbated urban decay and deteriorating services.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/garwe.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw LOCAL Government and Public Works Minister Daniel Garwe, is set to visit Bulawayo tomorrow where he is expected to meet council officials and other stakeholders to explore ways of addressing the ongoing impasse over the city’s 2025 budget. Bulawayo remains the only local authority among Zimbabwe’s 92 councils whose budget has not […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "Search for lasting DRC peace continues",
            "url": "https://www.chronicle.co.zw/search-for-lasting-drc-peace-continues/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nHEADS of State and Government from SADC and the East African Community (EAC) held a virtual joint summit last night aimed at resolving the conflict in the eastern Democratic Republic of Congo.\n\nThe joint summit was co-chaired by SADC Chairperson President Mnangagwa and his EAC counterpart, Kenyan leader President, William Ruto.\n\nThe leaders deliberated on measures to end hostilities in the eastern DRC where government forces and an armed group, M23, are locked in a vicious war.\n\nIn his welcome remarks, President Mnangagwa commended his colleagues, President Ruto and Tanzanian President Dr Samir Hassan, the Council of Ministers and secretariat for providing leadership and support in promoting co-operation between both regions in the shared quest for durable peace in the Eastern DRC.\n\nDr Hassan is the SADC Chairperson of the Organ on Politics, Defence and Security Co-operation.President Mnangagwa said the efforts made in the past between the two blocs had laid a strong foundation for last nights discussions.\n\nSince our last joint summit of February 8, 2025, our technical experts and the Chiefs of Defence convened the meetings to implement the outcomes of our joint summit, he said.\n\nPresident Mnangagwa added that several engagements had yielded commendable success.We are, however, deeply concerned that the implementation of our decisions is not proceeding with the urgency they deserve. This is despite the fact that the security situation in the DRC remains fragile, with supply routes, including the Goma and the Bukavu airports, still closed, he said.\n\nThe humanitarian situation in the eastern DRC remains dire, while armed groups continue to pose a threat to the sovereignty of the country and the stability of our two regions.\n\nThere is, therefore, a need for us to accelerate the implementation of our joint interventions to arrest these\n\nworrisome developments. We continue to call for an immediate and unconditional ceasefire and cessation of hostilities.\n\nYour Excellencies, we have consistently acknowledged that military interventions on their own are not an absolute panacea to the security challenges besetting our sister country. Instead, it is important that we provide impetus to the peace process in line with our decisions.\n\nPresident Mnangagwa said the establishment of a political framework is a crucial enabler for the implementation of critical outstanding outcomes of the previous meetings.\n\nThere is, therefore, a need to initiate diplomatic and political engagement to facilitate the withdrawal of Sadc Mission in the DRC (SAMIDRC) troops.\n\nAs we continue to engage, let us remain aware that the successful implementation of our joint efforts is encouraged by our collective resolve and commitment. It is incumbent upon us all, given the weighty responsibilities bestowed upon us, to demonstrate unity of purpose and the political will to deliver tangible results for the people of the DRC, he said.\n\nPresident Ruto commended DRC President Felix Tshisekedi and Rwandan President Paul Kagame for having a direct engagement aimed at discussing the hostilities in eastern DRC. This followed a meeting held by the two in Qatar, facilitated by that countrys authorities.\n\nAllow me, Excellencies, also to commend and congratulate our two brothers, President Felix Tshisekedi and President Paul Kagame for the face-to-face engagement that they have had in the last few days.\n\nAgain, a clear demonstration on their part that they are equally committed to seeing to it that we resolve the matters in eastern DRC that affect our countries and our region, he said. President Ruto said the situation in eastern DRC continues to deteriorate.\n\nIt is, therefore, a source of concern, not just for DRC as a country, but all of us in the region, said President Ruto.\n\nHe noted that the conflict had resulted in the loss of life and displacement of people.And therefore, I want to thank all the Heads of State who have demonstrated their commitment by attending this virtual meeting. It is a confirmation that we are all concerned rightfully about the situation in our neighbourhood and all of us are taking steps to deal with that, he said.\n\nForeign Affairs and International Trade Minister Professor Amon Murwira, Defence Minister Oppah Muchinguri-Kashiri\n\nFrom the Zimbabwean side, last nights meeting was attended by Foreign Affairs and International Trade Minister Professor Amon Murwira, Defence Minister Oppah Muchinguri-Kashiri, Tourism and Hospitality Industry Minister Barbra Rwodzi, Zimbabwe Defence Forces Commander, General Phillip Valerio Sibanda, and Deputy Chief Secretary in the Office of the President and Cabinet responsible for Presidential Communications, Mr George Charamba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/5yhy5.jpg",
            "description": "Zvamaida Murwira, Harare Bureau HEADS of State and Government from SADC and the East African Community (EAC) held a virtual joint summit last night aimed at resolving the conflict in the eastern Democratic Republic of Congo. The joint summit was co-chaired by SADC Chairperson President Mnangagwa and his EAC counterpart, Kenyan leader President, William Ruto. […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "Innscor Africa reports 28pc drop in diesel use… amid improved electricity supply",
            "url": "https://www.chronicle.co.zw/innscor-africa-reports-28pc-drop-in-diesel-use-amid-improved-electricity-supply/",
            "content": "Nqobille Bhebhe, Senior Business Reporter\n\nDIVERSIFIED group, Innscor Africa Limited says electricity usage by its business units increased by 18,97 percent to 119 493 megawatt hours (MWh), leading to a 28 percent drop in diesel used to power generators as the availability of grid-fed electricity improved during the 2024 financial year.\n\nOn the other hand, the group used 3 365 709 cubic metres of water, with 3,18 percent sourced from municipal water and local authorities 45,77 percent from borehole water and the balance of 51,05 percent from dams.\n\nIn its financial report for 2024, the firm said efficiency in the use of various production materials was key to its objective of reducing negative environmental impact as well as a driver for profitability.\n\nBy setting objectives with corresponding targets, each business is working towards optimising the use of natural resources to improve the efficiency of production processes and systems.It said the efficient use of resources translated to reduced cost of production as well as less negative impact on the environment.\n\nAccording to the report, the group noted under the sustainability section that it used a total of 119 493 MWh.The Innscor Group of businesses recorded 3 043 912 litres of diesel used to run generators as a result of power outages experienced throughout the reporting year, a decrease of 28 percent compared to F2023\n\nA total of 8 133 568 litres of diesel was used by the group for production (5 089 656 litres) and generator usage (3 043 912 litres) compared to 9 584 511 litres in 2023, a drop of 15 percent.\n\nThis drop in diesel usage is as a result of a 28 percent drop in diesel to run generators usage, as the availability of grid-fed electricity improved during F2024, reads part of the report.\n\nIt added that the businesses were also starting to migrate from diesel-run to electric or (Liquid Petroleum Gas) LPG-run forklifts, reducing the amount of diesel for processing needed while improving air quality and efficiency\n\nOn water usage, the group used a total of 3 365 709 cubic metres of water.It noted that its free-range pasture, dairy Mafuro Farming, expanded in F2024 to include a new farm outside Kwekwe. As a result of this, the Groups dam water usage has increased significantly.\n\nMafuro Farming accounted for 44,74 percent of the groups total water usage.The group said it was working towards reducing its water usage rather than water consumption.One key approach to water conservation being implemented across the group is behavioural change, by making employees aware of the importance of conserving water and by businesses installing water-efficient faucets to reduce water usage.\n\nThe group has instigated a number of water conservation initiatives within its operating procedures to further reduce their water usage. AMP Meats, for example, has implemented a leak detection and repair system where, through regular monitoring, leaks can be identified on a daily basis.\n\nAt Profeeds condensate steam at the boilers points is reused as a water source while Irvines recycles 80cubic metres of water a day for cleaning crates. The Bakers Inns new plant in Bulawayo uses the latest technology for its cooling system and crate washing to minimise water usage.\n\nIt added that at The Buffalo Brewing Company (TBBC), through condensate recovery of over 70 percent and a reduced water consumption ratio by over 35 percent, TBBC strives to minimise its water usage.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sas.jpg",
            "description": "Nqobille Bhebhe, Senior Business Reporter DIVERSIFIED group, Innscor Africa Limited says electricity usage by its business units increased by 18,97 percent to 119 493 megawatt hours (MWh), leading to a 28 percent drop in diesel used to power generators as the availability of grid-fed electricity improved during the 2024 financial year. On the other hand, […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "Pauline Marere crowned Miss Supranational Zimbabwe",
            "url": "https://www.chronicle.co.zw/pauline-marere-crowned-miss-supranational-zimbabwe/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nMiss Environment Zimbabwe 2023, Pauline Marere was crowned Miss Supranational Zimbabwe on Sunday, at a pageant held in Polokwane, South Africa.\n\nMarere, who also serves as the Miss Teen of the Universe Zimbabwe (MTOUZ) Mashonaland Provincial director, described her win as a dream come true.\n\nWinning this prestigious title is a dream come true. Ive always aspired to compete in one of the worlds top five pageants to showcase my talent and modelling skills, so this is a significant milestone in my career, she said.\n\nAs the newly crowned queen, Marere now carries Zimbabwes hopes as she prepares to represent the nation at Miss Supranational 2025 pageant in Poland, on June 28.\n\nRepresenting Zimbabwe in Poland is both an immense responsibility and a career highlight. Im eager to showcase Zimbabwes rich culture, unique heritage and breath-taking tourist destinations on a global stage, she added.\n\nThe beauty is no stranger to success, with her most notable achievement being crowned Miss Africa in 2018.She is dedicated to advocating for cleft mothers, providing them with psychological support, something she vowed to continue doing.\n\nContinuing my advocacy during Womens Month is crucial. I work closely with cleft mothers, offering support as they navigate the challenges of raising children with clefts.\n\nThis month, I want to celebrate them and remind them of their strength and significance, she said.To aspiring pageant contestants, Marere had this to say: To all young models, stay resilient and never give up. Losing one or two pageants doesnt define you as a failure. Instead, use it as motivation to chase your dreams, she said.\n\nMTOUZ national director, Mthokozisi Masuku, lauded Mareres latest accomplishment, highlighting her resilience and leadership.\n\nOn behalf of the Miss Teen of the Universe Zimbabwe organisation, board of directors and advisory board, we extend our heartfelt congratulations to Pauline Marere. Her perseverance and determination make her a beacon of hope for young models looking up to her, he said.\n\nMeanwhile, Marere is set to receive a heroines welcome today, at Robert Gabriel Mugabe International Airport in Harare.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/egr.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Miss Environment Zimbabwe 2023, Pauline Marere was crowned Miss Supranational Zimbabwe on Sunday, at a pageant held in Polokwane, South Africa. Marere, who also serves as the Miss Teen of the Universe Zimbabwe (MTOUZ) Mashonaland Provincial director, described her win as a dream come true. “Winning this prestigious title is a dream […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "Chief Mabhikwa succession wrangle intensifies",
            "url": "https://www.chronicle.co.zw/chief-mabhikwa-succession-wrangle-intensifies/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nTHE dispute over the rightful heir to the Mabhikwa chieftainship has escalated, with divisions within the Khumalo family deepening.\n\nA faction of the family has rejected the appointment of Ms Zanele Khumalo (35) as regent chief, citing cultural traditions that allegedly exclude women from assuming such roles.\n\nThe chieftainship became vacant following the death of Chief Mabhikwa (Vusumuzi Khumalo) in a tragic road accident on May 22, 2022. Initially, his uncle, John Khumalo, was appointed acting chief. However, earlier this year, Zanele was named regent chief by the Government to serve for nine years until Vusumuzis son, Wayne Makhosemvelo Khumalo, reached adulthood and assumed the position of substantive chief.\n\nA section of the Khumalo family has challenged Zaneles appointment in the High Court. Family spokesperson Mr Donald Khumalo, argued that their culture does not allow women to become chiefs, during a press briefing yesterday.\n\nMabhikwa family spokesperson Mr Donald Khumalo addresses journalists from different media houses during a press conference in Bulawayo yesterday\n\nHe claimed that the appointment of a female is unprecedented in their clan, arguing that only men are recognised as chiefs in their culture.\n\nMr Khumalo said Zaneles appointment undermines their traditions and accused a committee led by Chief Nkalakatha of imposing her against the familys wishes.\n\nThere is no place for a female chief in our culture, its unheard of. This is the first time we are hearing of a female chief in the Khumalo clan and to us, its an indication that our culture is slowly being eroded, he said.\n\nMr Khumalo also claimed that Zaneles marital status disqualifies her from leadership by virtue of being married into another family and raising her own children.\n\nEven our daughters, like our princess here MaKhumalo (Sibonokuhle) sitting next to me, understand that their culture doesnt allow them to take up the role of a chief in the Khumalo clan, he said.When we meet as the Khumalo men to discuss important issues women know and understand that its not in their place to sit in those meetings.\n\nDespite opposition from some family members, Zanele was publicly installed as regent chief on March 14 at a ceremony attended by hundreds in Jotsholo.\n\nSpeaking at the unveiling event in Jotsholo, Matabeleland North Provincial Council of Chiefs chairperson, Chief Siansali, explained that Zaneles appointment aligns with Nguni customs. He clarified that while Wayne Makhosemvelo is the substantive chief, his minority necessitated appointing a regent.\n\nAs you take up this role, understand that this is not an easy role. As a chief, you have to know that you no longer have the luxury of making jokes. Whatever statement you make will be taken seriously and people may ignore whatever issue of substance you say and focus on the perceived joke, said Chief Siansali.\n\nZanele is no stranger to the community, having grown up in Jotsholo before pursuing studies and employment in South Africa. She acknowledged the challenges ahead but expressed confidence in fulfilling her duties.\n\nZaneles appointment marks a major milestone for gender representation in traditional leadership. She joins two other female chiefs in Matabeleland. In 2020, Ms Silibaziso Mlotshwa, the daughter of the late Chief\n\nMvuthu of Matabeleland North Province, was appointed a chief.In Filabusi, Chief Ndube  born Nonhlanhla Sibanda, was appointed chief in 2007 when she was aged 22 years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xz.jpg",
            "description": "Raymond Jaravaza, raymond.jaravaza@chronicle.co.zw THE dispute over the rightful heir to the Mabhikwa chieftainship has escalated, with divisions within the Khumalo family deepening. A faction of the family has rejected the appointment of Ms Zanele Khumalo (35) as regent chief, citing cultural traditions that allegedly exclude women from assuming such roles. The chieftainship became vacant following […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "COMMENT: Kalungwizi project to ignite hope for a brighter, more sustainable future",
            "url": "https://www.chronicle.co.zw/comment-kalungwizi-project-to-ignite-hope-for-a-brighter-more-sustainable-future/",
            "content": "A month after a ground-breaking ceremony for the $3.6bn Palm River Energy and Metallurgical Special Economic Zone, which will include a 1 200-megawatt coal-fired power plant in Beitbridge, another notable energy investment is coming up.\n\nA Chinese firm, Yuanlin Energy Investments (Yuanlin), we reported yesterday, has hired a consultant to undertake an environmental and social impact assessment (ESIA) for a 600MW Kalungwizi thermal power station in Binga.\n\nThis will be a huge coal project for a district, which has attracted a number of investments in that subsector, in recent years.\n\nWe welcome the proposed project as it will breathe life into one of the countrys least developed yet resource-rich areas. If, as we hope, the project materialises, it will mean scores of local jobs, growth in incomes and improved standards of living for the community.\n\nAs most investments of this scale often do, we look forward to the company investing in new roads and other amenities or working with the Government to do so. We also expect Yuanlin to undertake corporate social responsibility investments as well  building new clinics and schools, expanding or equipping existing ones, improving food and water security and so on.\n\nAt a macro level, we see the project contributing to the attainment of national energy security after decades of shortages that are frustrating household and commercial consumers. Coal-based power plants are generally stable come rain, come drought. They just provide electricity round the clock, all year round.\n\nFor these reasons and more, we expect the ESIA to be carried out expeditiously, finding the project as not harmful to the ecology around it. In addition, we are hopeful that the project will be complementary, not harmful to its social setting. If any possible future challenges are identified, Yuanlin, the Government and the Binga community must find ways to go round them.\n\nThat is the function of an ESIA anyway, to thoroughly study the context around a proposed project, spot its possible adverse implications and craft strategies to address them as the project is implemented.But we feel it is very important for us to note the continuing role of Chinese companies in our economy, specifically in coal-based electricity generation.\n\nChinese companies built Hwange Units 7 and 8, are involved at Manhize and, as we indicated earlier, are involved at the Palm River Energy and Metallurgical Project.China also, was instrumental in expanding Kariba South, a hydropower facility.\n\nWe, as a country, would not have mobilised enough financial resources to execute the projects on our own without this very invaluable Chinese support.\n\nThe Kalungwizi project is yet another indication of the success of the Look East policy.We, thus look forward to the completion of the ESIA for the project to enter construction and operation stages so the people of Binga and the nation a large enjoy the benefits of the investment and the energy security it will engender.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/fdsdfsaadfsdfsdfsdfs.jpg",
            "description": "A month after a ground-breaking ceremony for the $3.6bn Palm River Energy and Metallurgical Special Economic Zone, which will include a 1 200-megawatt coal-fired power plant in Beitbridge, another notable energy investment is coming up. A Chinese firm, Yuanlin Energy Investments (Yuanlin), we reported yesterday, has hired a consultant to undertake an environmental and social […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "2026 World Cup Qualifier: Now-or-never showdown for Warriors",
            "url": "https://www.chronicle.co.zw/2026-world-cup-qualifier-now-or-never-showdown-for-warriors/",
            "content": "Tadious Manyepo in Uyo, Nigeria\n\nTHE Warriors will roll the 2026 World Cup qualification dice one more time in a now-or-never showdown against Nigeria, at the Godswill Akpabio Stadium this evening.\n\nThe match kicks-off at 6pm.Zimbabwes chances of sealing a spot at the global showpiece, for the first time ever, are hanging by the thinnest of threads.\n\nSitting bottom of Group C with only three points, seven behind leaders South Africa with five games of the campaign remaining, Zimbabwe have to beat Nigeria in the punishing Akwa Ibom conditions to keep crawling around the mix.\n\nIt has proven to be a tough venture for the Warriors, who are winless in the campaign under three different coaches including the incumbent Michael Nees, whose only contribution was a come-from-behind 2-2 draw against Benin in South Africa, last Thursday.\n\nThe Warriors will have to bring their best in todays contest, especially after Nigeria decided to peg the entry fee at a measly US$0.65c to ensure their supporters fill the compact 30000-seater facility to the rafters.\n\nThey have also dangled 500 free replicas for the early birds all to ensure they have the maximum support as they quest to keep up the pace with Bafana Bafana who enjoy a four-point cushion over them.Nees knows the environment will be massive and Nigeria will be in no mood to drop any points.But the German gaffer is largely unfazed.\n\nWe are certainly looking forward to the game against Nigeria in this nice stadium.We are coming from a tough game against Benin. It was a really good contest. But now Nigeria, you see, its halfway through the campaign and Nigeria from the individual areas, from the names, its top class, absolutely top class, said Nees.\n\nAnd they messed their campaign at the beginning really up. Theres the third coach (Eric Chelle) now involved in this campaign. They have now won in Rwanda, which was for them. I think they are always a little bit difficult opponent, really.\n\nSo, they will come now with confidence and with all their power and all what they want to turn this campaign around. But so do we. It is going to be an exciting game. We have to perform to our maximum, for sure.\n\nWe can expect a real tough opponent giving everything. They must accept the challenge. But, we have to also give everything and we will.\n\nNees challenged the players to take up the challenge, the climate, the pace, the conditions.Nees said he has the quality in his ranks to help break the Nigerians.You mustnt be afraid of anything. Theres no reason for it. We can play football. We have analysed the opponent. We have analysed our game. The players give instructions and they can believe in themselves, added Nees.\n\nHe called on the boys to hold their nerves.They have showed it already many times that they are very good players, very good characters, and Im really looking forward to this game. That will be a real football match. I dont know how many spectators, but could be 30 000. I dont know, said Nees.\n\nNees could be making changes to the starting 11 from the previous encounter against Benin last Thursday.Walter Musona, an unused substitute in the tie against Benin, could finally get to line-up alongside his brother, Knowledge in an international match.\n\nKnowledge who has made a U-turn from a two-year retirement marked his comeback with a fine goal that ensured a share of the spoils against the Benin Cheetahs.\n\nBut he never got to be on the pitch with his younger brother Walter, a local football hero having won the Soccer Star of the Year prize twice inside the past three years.\n\nThe brothers might start the match as Walter looks very much in line to replace Khama Billiat who missed Sundays training session as he was down with a flu bout.\n\nTawanda Chirewa could also be drafted in for Prince Dube.\n\nProbable Line-UpWashington Arubi, Emmanuel Jalai, Divine Lunga, Munashe Garananga, Gerald Takwara, Marshal Munetsi, Andy Rinomhota, Jordan Zemura, Walter Musona, Tawanda Chirewa, Knowledge Musona\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/qw.jpg",
            "description": "Tadious Manyepo in Uyo, Nigeria THE Warriors will roll the 2026 World Cup qualification dice one more time in a now-or-never showdown against Nigeria, at the Godswill Akpabio Stadium this evening. The match kicks-off at 6pm. Zimbabwe’s chances of sealing a spot at the global showpiece, for the first time ever, are hanging by the […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "We learnt from the best: Stix M’tizwa",
            "url": "https://www.chronicle.co.zw/we-learnt-from-the-best-stix-mtizwa/",
            "content": "Lovemore Dube,[emailprotected]\n\nFORMER Black Rhinos, Caps United and Zimbabwe midfield general, Stix Mtizwa says their development was aided by having extremely talented players to emulate.\n\nMtizwa was for over a decade from 1979, among the best players in the local league. He won virtually everything that was there to play for and among his accomplishments were two league titles and on six occasions, he was on the Castle Lager calendar, among the countrys 11 best players at a time Zimbabwe was teeming with talent.\n\nTo have appeared so many times, is testament of his quality as a player at a time when Zimbabwe had dominant and exciting talents like Joel Shambo, Stanley Ndunduma, Madinda Ndlovu, David Mwanza, Moses Chunga, Boy Ndlovu, Mike Abrahams, Tito Paketh, Nkulumo Donga, Boyce Lunga, Kenneth Jere, Robert Godoka, Max Tshuma, Mercedes Sibanda, Willard Khumalo, Ephraim Chawanda, James Takavada, Gift Mpariwa, Oliver Kateya, Shaky Tauro and Charles Chirwa.\n\nHe was in the city on Saturday at the launch of the Jadel Football Academy Bulawayo Chapter.Mtizwa said he was inspired by a generation of great players. Growing up in Mbare, a stones throw from Rufaro Stadium and Zimbabwe grounds, all he could do when time allowed and there were three things available, a ball, a pitch of empty land and other boys was to play, among themselves.\n\nWe never got tired of playing football. We loved the game and passion drove us to spend hours on hours playing the game. We had several role models to emulate who had some special features that we valued a great deal, said Mtizwa.\n\nAmong his role models were George Shaya, Tymon Mabaleka and William Sibanda.Mabaleka and Sibanda were brilliant mid-fielders, very good on the ball and off it. Had good ball control, energy to run from box to box, dribbled very well and game intelligence of knowing when to exert their energies. George Shaya was a Mastermind a very good footballer, who we all envied and wished to scale his great heights. Several other good players around the country vowed audiences with their talents, said Mtizwa.\n\nHe said the youth club concept, which had him and his peers flock to Mai Musodzi Hall to try a hand at football with other sporting disciplines available, allowed peers to play informally, work on their skills before being identified for formal football activity with organised clubs like Black Aces and Dynamos.On the launch of the Jadel Academy, he said he came through junior development and that its essential in the development of talent.\n\nThe youth clubs that we grew up at, like Mai Musodzi in Mbare, were key in the development of talent. We came through this type of initiative (like Jadel Academy). At that time, we had Mai Musodzi and Stoddart Hall, here we have Mzilikazi (Thabiso Youth Centre) where Peter and the Ndlovu brothers came through.\n\nYouth clubs provided a number of disciplines, we would go there and spend the whole day, we did not have time to do something like drinking and drug abuse, said Mtizwa.\n\nCollin Nyambiya, who owns an academy that has been around for over a decade was also at the launch of the Jadel Academy, he said he had grown up in the same youth club concept where an unemployed volunteer assisted them.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ws1ws.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw FORMER Black Rhinos, Caps United and Zimbabwe midfield general, Stix M’tizwa says their development was aided by having extremely talented players to emulate. M’tizwa was for over a decade from 1979, among the best players in the local league. He won virtually everything that was there to play for and among his […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        },
        {
            "title": "Unstoppable Shutt makes it three-out-of-three",
            "url": "https://www.chronicle.co.zw/unstoppable-shutt-makes-it-three-out-of-three/",
            "content": "Brandon Moyo,[emailprotected]\n\nFOLLOWING his maiden Matabeleland Amateur title at Bulawayo Country Club on Sunday, in-form golfer Keegan Shutt has described the course in the City of Kings and Queens as one of his best in the country.\n\nShutt staged yet another comeback to register a two-shot victory over Shijie Li to make it three wins in a row on the local circuit having won the Julius Robinson and the Manicaland Amateur, all in March.Speaking after his win, Shutt, who is the highest-ranked Zimbabwean amateur golfer said he enjoys playing at Bulawayo Country Club, which always gives him a real test.\n\nThe course has been very nice. Its my favourite course in Bulawayo and I have always enjoyed playing here. Its a real test, especially the greens, especially when I dont have to fix the pitch-mark. Its so hard that I cant stop the ball quick enough. I really love this course, its one of my favourites, actually in Zimbabwe and every time I come here, I look forward to it. It feels quite good to win the Matabeleland Amateur. I know a couple of big names that have won this before, so to get my name on this trophy feels good, said Shutt.\n\nHe carded four-under-par-212 while second-placed Li shot two-under-par-214 after playing 54 holes.Once again, Shutt didnt have the best of starts as he shot three-over-par-75 in the first round. He then followed it up with a three-under-par-69 on round two on Saturday, which left him on level-par-144. In the third round, he carded a solid four-under-par-68 to leapfrog Li into the top of the leaderboard.\n\nLi, in his three rounds shot 69, 74 and 71. In third place there was Michael Wallace on a 217 gross with round scores of 74, 69 and 74.\n\nTanaka Chatora finished fourth with a 220 gross, following round scores of 72, 74 and 74.In the ladies championship, it was 15-year-old Miriam Masiya who once again claimed the top honours. She carded eight-over-par-224 with three-round scores of 80, 71 and 73 to secure a seven-shot victory over runner-up, Batsi Tilowakuti.\n\nSpeaking after accepting her winners trophy, Masiya said she also enjoyed her time out at Bulawayo Country Club.\n\nI want to thank God for the gift of life and my parents for supporting me. I enjoyed playing with you guys and I hope to see you next time, she said as she received loud applause and cheers.\n\nMasiya also won the Manicaland Amateur ladies championship.Tilowakuti had a gross of 231 after shooting 79, 78 and 74. In third place there was Tracy Humbira on a 243 gross with scores of 79, 85 and 79.\n\nThe Matabeleland Amateur was the most talented field in recent events with juniors set to represent the country in Tunisia for the All Africa Juniors as well as national teams going to Botswana for Region Five Games taking to the greens.\n\nNext up on the calendar is the Masvingo Amateur, set for Masvingo Golf Club on April 5 and 6.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/2wdd2.jpg",
            "description": "Brandon Moyo, brandonmalvin9@gmail.com FOLLOWING his maiden Matabeleland Amateur title at Bulawayo Country Club on Sunday, in-form golfer Keegan Shutt has described the course in the City of Kings and Queens as one of his best in the country. Shutt staged yet another comeback to register a two-shot victory over Shijie Li to make it three […]",
            "time": "06:36",
            "date": "25 Mar 2025"
        }
    ]
}