{
    "news": [
        {
            "title": "Watch: Plumtree thief caught red-handed in daylight heist",
            "url": "https://www.chronicle.co.zw/watch-plumtree-thief-caught-red-handed-in-daylight-heist/",
            "content": "Online Reporter\n\nA BOLD daylight theft was thwarted at Blackdays Liquors, located in Dingumuzi Shopping Centre, Plumtree, thanks to the quick actions of alert patrons and the assistance of CCTV footage.\n\nOn 12 March 2025, an unidentified adult male was caught on camera stealing a stash of cash from behind the counter while the bartender was briefly away. The thiefs narrow window of opportunity was quickly closed when a customer, who had been waiting for change, spotted the suspect and raised the alarm.\n\nThe thief was swiftly detained by the crowd, bringing his ill-fated crime spree to an abrupt end. A review of the CCTV footage provided irrefutable evidence, supporting the eyewitness testimonies.\n\nAuthorities confirmed that the stolen amount, totalling R200 and US$4, was recovered.\n\nThis incident highlights the effectiveness of community vigilance and the critical role of CCTV surveillance in deterring and solving crimes.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/k6uykm.jpg",
            "description": "Online Reporter A BOLD daylight theft was thwarted at Blackdays Liquors, located in Dingumuzi Shopping Centre, Plumtree, thanks to the quick actions of alert patrons and the assistance of CCTV footage. On 12 March 2025, an unidentified adult male was caught on camera stealing a stash of cash from behind the counter while the bartender […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "US$24K theft: Woman remanded in custody",
            "url": "https://www.chronicle.co.zw/us24k-theft-woman-remanded-in-custody/",
            "content": "Peter Matika,[emailprotected]\n\nNOTHANDO Banana (35), a resident of Bahram Green suburb in Bulawayo, who is facing allegations of stealing US$24 000 from a steel manufacturing company during an armed robbery incident, has been further remanded in custody.\n\nThe robbery incident occurred in October last year, where she allegedly took advantage of the situation and stole US$24 400.\n\nBanana has been out of custody since her initial appearance after posting US$100 bail.\n\nThe matter was on Wednesday remanded to March 24, after she appeared in court on routine remand.\n\nBanana, reportedly committed the crime on October 15, the same day robbers armed with pistols and a garden pick pounced and got away with US$32 500 in a violent armed robbery.\n\nBanana, who is being charged with theft of trust funds, allegedly tried to cover up her crime by blaming the robbers for the theft of the money.\n\nBanana is being represented by Mr Bob Siansole of Shenje and Company.\n\nNothando Banana outside the Bulawayo Magistrates Courts last year.\n\nAccording to court records, Banana took advantage of the robbery and stole US$24 400 from a safe she was in charge of depositing cash from salespersons before handing it over to her principals.\n\nIt was stated that the suspected robbers confronted the security guards and workers on night duty and ordered them to lie down before tying their hands and legs with shoelaces.\n\nThe gang proceeded to an office upstairs where they used a grinder to cut open two safes. They only stole from one safe and left the one Banana was entrusted with depositing money from salespersons before handing it to the company authorities, read the documents.\n\nIt was then discovered that company authorities found that the safe Banana was entrusted with, containing US$27 000, had not been tampered with while doing an inventory of the losses.\n\nThey then asked for keys from the accused person and unlocked the safe. Upon opening the safe, they discovered that out of US$27 000, only US$2 600 was left. Upon interviewing her, she admitted to having used the money, read the document.\n\nBanana was reportedly apprehended the following day.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Nothando-Banana.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw NOTHANDO Banana (35), a resident of Bahram Green suburb in Bulawayo, who is facing allegations of stealing US$24 000 from a steel manufacturing company during an armed robbery incident, has been further remanded in custody. The robbery incident occurred in October last year, where she allegedly took advantage of the situation and stole […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "SADC SUMMIT: President chairs SADC Summit amid rising tensions in DRC",
            "url": "https://www.chronicle.co.zw/sadc-summit-president-chairs-sadc-summit-amid-rising-tensions-in-drc/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nAS the SADC Heads of State and Government convene virtually for an urgent Extraordinary Summit today, the regional blocs commitment to the Democratic Republic of Congos (DRC) independence, peace, sovereignty and territorial integrity has been reaffirmed by its Executive Secretary Mr Elias Magosi.\n\nTodays crunch meeting will be chaired by SADC Chairman President Mnangagwa, who continues to rally member states defending the DRC Governments cause.\n\nIn his remarks yesterday at the SADC Council of Ministers meeting in Harare, Mr Magosi said the region remained resolute in its efforts to find lasting peace and security in the DRC.\n\nIn the spirit of solidarity and collective defence, we have been resolute in our efforts to find lasting peace and security in the Eastern part of the Democratic Republic of Congo (DRC).\n\nThe security and humanitarian situation in Eastern DRC remains precarious and worrisome to the region as a whole. We wish to reaffirm our commitment to the DRCs independence, sovereignty and territorial integrity, he said.\n\nPresident Mnangagwa\n\nThe Executive Secretary said peace and security remained critical to the regions integration and economic development efforts.He then extended the blocs condolences to those who have lost their loved ones in the ranging DRC conflict where peace has so far remained elusive.\n\nIn recent weeks, the M23 armed group has carried out attacks on Congolese security forces, SADC troops and civilians in the region resulting in scores of peacekeepers being killed along with thousands of civilians.\n\nWe also wish to extend our heartfelt condolences to the people of the DRC and Member States and families of the fallen heroes and heroines who lost their lives while serving in the SADC Mission in the DRC.May the souls of our departed troops rest in eternal peace, he said.\n\nTodays Extraordinary Summit is being convened following the virtual Extraordinary SADC Organ Troika Summit held last week.\n\nOn his part, Foreign Affairs and International Trade Minister Professor Amon Murwira, who was host of yesterdays Council of Ministers said SADC must continue to take ownership of its peace, stability and development.\n\nThe SADC we want, can only be built by its own people, lest we forget, SADC was formed to foster collective self-sufficiency of the region, and we shall vigorously pursue this goal.\n\nIn line with His Excellency the President of the Republic of Zimbabwe and SADC Chairperson, Dr ED Mnangagwas doctrine, and I quote, the SADC we want is built by its people, he said.\n\nProf Murwira said the operationalisation of the Regional Development Fund would go a long way in ushering in a developed SADC where the peoples basic needs are met.\n\nIn our efforts to ensure sustainable financing, our meeting will consider progress made towards the operationalisation of the Regional Development Fund.\n\nIt is paramount that we operationalise the Regional Development Fund as a matter of urgency, given its key role in supporting infrastructural projects and the industrialisation of our economies, both of which are vital in propelling our regional integration agenda, he said.\n\nGiven the increasingly unpredictable nature of donor funding amid shifting global geopolitics, Minister Murwira said the region needed to take ownership of its development agenda.\n\nSADC was formed exactly to achieve this, by leveraging our domestic resources, our human capital, our natural capital, and reducing reliance on external funding.\n\nThe marked reduction in donor support that we are witnessing should therefore serve as a wake-up call every day, that no one but ourselves will drive and build the SADC we want, he said.\n\nThe need for peace and security, and economic and social development through regional integration are the reasons that SADC was established in 1992.\n\nSADC region has for decades been developing and strengthening regional cooperation in the Defence Sector. It is this cooperation that underpinned the establishment of the Inter-State Defence and Security Committee (ISDSC) in 1977, which is a forum for defence, and security cooperation.\n\nThe Inter-State Defence and Security Committee played a crucial role in the liberation struggles against colonial and racist regimes and in the maintenance of the national sovereignty and territorial integrity of the Member States.\n\nThe Protocol on Politics, Defence and Security Cooperation states that it is desirous to ensure that close cooperation on matters of politics, defence and security shall at all times promote the peaceful settlement of disputes by negotiation, conciliation, mediation or arbitration. Protocol on Politics, Defence and Security Cooperation provides for regional intervention in the case of intrastate conflict, but only for purposes of mediation, and does not provide for military assistance.\n\nArticle 3 of the Mutual Defence Pact 2003 states that: State Parties shall, by the principles of the Charter of the United Nations, settle any international dispute in which they may be involved, by peaceful means, in such a manner that regional and international peace, security and justice are enhanced. Article 6 goes on to say that An armed attack against a State Party shall be considered a threat to regional peace and security and such an attack shall be met with immediate collective action.ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/FEFG-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau AS the SADC Heads of State and Government convene virtually for an urgent Extraordinary Summit today, the regional bloc’s commitment to the Democratic Republic of Congo’s (DRC) independence, peace, sovereignty and territorial integrity has been reaffirmed by its Executive Secretary Mr Elias Magosi. Today’s crunch meeting will be chaired by SADC […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "Major sponsors pledge support for Zimpapers Cancer Walk",
            "url": "https://www.chronicle.co.zw/major-sponsors-pledge-support-for-zimpapers-cancer-walk/",
            "content": "Fatima Bulla, Harare Bureau\n\nNedbank, FBC Holdings, and the City of Mutare have reaffirmed their support for the Zimpapers Cancer Powerwalk, pledging assistance for the 2025 edition.\n\nThe commitment was highlighted at the official handover of proceeds from the 2024 event to Island Hospice and Healthcare recently.\n\nA total of US$27 679 and ZWL43 043 was raised last year and officially handed over to Island Hospice, which provides essential palliative and bereavement care services, including support for cancer patients.\n\nThe funds raised reflect the communitys dedication to alleviating the struggles faced by those affected by cancer.Senior brand and marketing manager at Nedbank Zimbabwe Limited, Mr Joel Gombera, reiterated their commitment to supporting vulnerable community members.\n\nThe banks participation as platinum sponsors of the Zimpapers Cancer Powerwalk took due consideration of the objective of the walk, which over the past nine years has seen Zimpapers consistently deliver all proceeds to Island Hospice, who provide palliative to cancer patients as we carry out cancer awareness campaigns he said.\n\nThis commitment underlines the importance of raising awareness and providing necessary care for cancer patients.FBC Holdings head of group marketing, Mr Roy Nyakunuwa, also spoke passionately about their involvement.\n\nOur presence here today reflects our strong commitment to supporting the Zimpapers Group and the wider community in advancing this crucial societal cause. FBC Group is actively involved in promoting various initiatives within the health sector. We, however, consider the Zimpapers Cancer Powerwalk to be a key initiative that we have proudly supported over the years, he said.\n\nHe noted that their participation in the Cancer Powerwalk has significantly contributed to alleviating challenges faced by individuals and healthcare institutions in the fight against cancer.\n\nThe City of Mutares commitment was echoed by Mr Charles Sadondo, principal corporate communications and marketing officer.\n\nWe believe that access to quality healthcare is a fundamental right, and we will continue to work tirelessly to ensure that our hospitals have the resources they need to provide exceptional care, he said.Ambassador Getrude Takawira, board chair of Island Hospice and Healthcare, expressed gratitude for the initiative.\n\nWe are grateful for this great gesture. As Island Hospice and Healthcare, we will always be grateful to those helping us in combating cancer, she said.\n\nMr Gorden Mwerenga, representing Zimpapers Group acting chief executive Mr William Chikoto, said: As Zimpapers, we transitioned through this process from having a CSR (corporate social responsibility) board committee to a fully-fledged sustainability committee.\n\nThe Zimpapers Cancer Powerwalk remains a vital initiative, fostering collaboration between corporate sponsors and healthcare providers to support cancer patients and raise awareness.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/08/Nedbank-Zimbabwe-Limited-.jpg",
            "description": "Fatima Bulla, Harare Bureau Nedbank, FBC Holdings, and the City of Mutare have reaffirmed their support for the Zimpapers Cancer Powerwalk, pledging assistance for the 2025 edition. The commitment was highlighted at the official handover of proceeds from the 2024 event to Island Hospice and Healthcare recently. A total of US$27 679 and ZWL43 043 […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "48-hour notice for vendors… Government directs local authorities to clear illegal vending sites by Friday",
            "url": "https://www.chronicle.co.zw/48-hour-notice-for-vendors-government-directs-local-authorities-to-clear-illegal-vending-sites-by-friday/",
            "content": "Chronicle Reporters\n\nGOVERNMENT has directed all local authorities to clear illegal vending sites within 48 hours as part of a nationwide crackdown against unregulated trading activities citing serious public health, security and economic concerns.\n\nLocal Government and Public Works Minister, Daniel Garwe, announced the drastic move during a press briefing in Harare yesterday evening where he emphasised the need to restore order in cities and towns across the country.\n\nHe said Government was seriously concerned about the proliferation of illegal vendors, particularly the rise of night trading, which has created significant health and security challenges.\n\nTo address this, Government has directed local authorities to remove vendors from undesignated points within 48 hours.The operation will be supported by law enforcement agencies, including the Zimbabwe Republic Police (ZRP) and other security units, to ensure compliance and maintain order.\n\nLocal authorities must enforce regulations requiring all informal traders to hold valid licenses and operate only in designated areas equipped with adequate sanitary facilities, said Minister Garwe.\n\nHe said Government remains committed to fostering a safe, clean, and orderly environment for all citizens.Minister Garwe said the mushrooming of unregulated marketplaces disrupts the operations of legal, registered and law-abiding traders, leading to unfair competition and potential financial losses.\n\nHe said illegal vending has also been linked to unsanitary conditions as vendors often operate in areas without access to potable water or ablution facilities.\n\nThis has raised the risk of disease outbreaks, including typhoid, dysentery, and cholera. The accumulation of waste from these vendors has rendered some roads, sanitary lanes, and sidewalks impassable, exacerbating public health risks, said Minister Garwe.\n\nHe said the situation has been further complicated by vendors blocking drainage systems with their wares, leading to flooding during the rainy season.\n\nWhen it rains, our roads become flooded because the drains are blocked. This is creating serious problems for our infrastructure, said Minister Garwe.He said in addition to health concerns, illegal vending has become a haven for criminal activities such as theft, robbery and drug dealing.\n\nThe lack of regulation and oversight in these areas allow criminal elements to exploit the situation, destabilising communities and eroding public trust in law enforcement agencies, said Cde Garwe.\n\nIllegal night vending has become a headache for major cities including Bulawayo and Harare where some traders now sleep on pavements in the city centre for several days.\n\nIn Bulawayo, vendors, some travelling from as far as Manicaland, swarm the pavements at night to display an array of goods and products, creating challenges in managing traffic flow and maintaining order.Ward 1 councillor Cde Josiah Mutangi said BCC is working on addressing the situation as there are plans on containing the situation through conducting night operations.\n\nWe will soon launch night operations to cleanse the city. We are at an advanced stage and are completing negotiations with police to conduct arrests. As of now, we have launched a programme to clean the CBD during the night, said Cllr Mutangi.\n\nThe situation is worsened by the fact that municipal police officers do not work at night and vendors take advantage to engage in illegal activities such as selling in undesignated areas that include pavements and streets corners.\n\nIt gets chaotic and its hard to navigate through the pavements. Not only is this, but it is turning the city into a haven for crime. These vendors are making fires on pavements at night and some are even daring as they are taking open baths in the CBD.\n\nRecently we received complaints of people engaging in sexual activities in the street corners and which is unacceptable. Most of these people come from other provinces and are causing all this chaos and mayhem, Cllr Mutangi said.Residents have also voiced concerns that the CBD has effectively transformed into an intercity-vending and transit hub.\n\nI come here almost every month and spend at least three to four days in Bulawayo. It is hard work, because I have to make ends meet for my family. I have no place to stay when I am here, so I have to make sure that my wares are sold, sometimes I sleep on the pavement because I cannot afford to book myself into a lodge, said Mr Tatenda Murefu, who is from Harare.\n\nSome of the people travel to Victoria Falls via Bulawayo en route to Zambia to buy second hand clothes and banned beauty products.\n\nThe volume of travellers making their way to Binga and Victoria Falls has increased forcing long distance bus operators to double the number of buses plying the route.\n\nVendors come to Bulawayo strictly to connect to Binga to buy their staff for resale back in Harare. When they fail to get a bus that travels overnight to Binga they sleep on the pavements since the majority of them do not have relatives in Bulawayo, said a bus conductor who identified himself as Luke.\n\nA majority of vendors sleep on pavements in the market place and outside supermarkets such as the one along Jason Moyo between Sixth Avenue and Leopold Takawira Avenue.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/REG.jpg",
            "description": "Chronicle Reporters GOVERNMENT has directed all local authorities to clear illegal vending sites within 48 hours as part of a nationwide crackdown against unregulated trading activities citing serious public health, security and economic concerns. Local Government and Public Works Minister, Daniel Garwe, announced the drastic move during a press briefing in Harare yesterday evening where […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "Inspiring rise of Bulawayo’s queen of events",
            "url": "https://www.chronicle.co.zw/inspiring-rise-of-bulawayos-queen-of-events/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nWomen in Zimbabwe continue to prove that they are not only the pillars of their households but also visionaries capable of spearheading successful ventures.\n\nOne such trailblazer from Bulawayo is Eunice Dlamini, who has transformed every endeavour she touches into gold. Through sheer determination and limited prior knowledge, she has established an events company in Bulawayo, M and M Joyous Events that has evolved into a renowned events venue, securing a legacy for her family and future generations.\n\nHer journey in business has been marked by numerous accolades, including the Entrepreneur of the Year award just one year after launching her company. Over the years, she has earned multiple awards, including Megafest Northern Region Businesswoman of the Year, so many that she has lost count.\n\nM and M Joyous Events Managing Director Eunice Dlamini\n\nAs the driving force behind M & M Joyous Events, Dlamini, who one can refer to as the queen of events, has built a trusted name in the events management industry. Her company has provided services for high-profile corporate events and state functions dating back to the late former President Robert Mugabes era. She has also provided catering for the funerals of notable figures such as historian Pathisa Nyathi, politician Dumiso Dabengwas wife and John Nkomo.\n\nA qualified nurse by profession, Dlamini worked at Mpilo Central Hospital, United Bulawayo Hospitals, and with the non-governmental organisation SWV Netherlands. She transitioned into event management in 2007, a dream she had nurtured for years. She fully ventured into the catering industry in 2011, inspired by the elegant hospitality she experienced during her travels.\n\nThe road to success was paved with years of sacrifice, hard work and prayer. She recalls the challenges of starting with a group of church women in 2007, many of whom struggled with punctuality. Without formal training, she relied on books and online research to learn the intricacies of events management.\n\nEvents management came to me after extensive travel, both locally and internationally. I was captivated by the hospitality industry, the luxurious hotels and the quality of service. Owning a hotel became my ultimate goal and I knew that event management was a stepping stone toward that dream, Dlamini shared.\n\nTo prepare, she meticulously documented her observations and devised a step-by-step action plan. Starting in 2006, she slowly acquired catering equipment, secretly storing purchases even from her husband.\n\nRunning events was a path that I believed would eventually lead to my ultimate goal of owning a hotel. I started by carefully documenting everything I needed to do after my travels and outlining activities step by step  because I had learnt that achieving something requires a structured approach.\n\nHaving an activity plan kept me focused. I began collecting catering equipment gradually in 2006, spending an entire year building my inventory. In fact, my husband had no idea what was inside the boxes I purchased each time we returned from a trip, she said.\n\nEunice Dlamini and her staff.  Pictures by Allen D Ndebele\n\nBefore officially launching her business, she sought mentorship from her neighbour, Thoko Ndlovu, who managed Eunices nephews wedding. Ndlovu became her mentor and allowed her to gain practical experience.Her first independent venture was organising a memorial service with three women from church.\n\nAn idea came to me while I was in church, and I mobilised three women to join me, even though I wasnt entirely sure how to run an event. Our first event was a memorial service for my relative. We had no idea how to charge for our services and struggled with time management, which led to delays in service delivery.\n\nDespite this, we did well, even without formal training. However, I was always exhausted, and the ladies lacked the necessary exposure, which contributed to further time management challenges.\n\nTesting the waters further, Dlamini volunteered to cater for her nieces 21st birthday, an event for 100 guests, which proved to be a pivotal moment.\n\nThe success of that birthday party opened the door for my first major event  a wedding for 500 people in April. It was a daunting task, but I was determined to prove myself, Dlamini recalled.The wedding was a major challenge for her as she had only two months to plan the catering.\n\nThe wedding was for a friend from church who had attended the birthday party and later referred me to her friend.It was a nightmare as there was not much time. As Im a perfectionist, I was preparing non-stop until the function date.Fortunately, at that time, we had experienced ladies from the City Council Club in Makokoba, and I brought them on board to assist.\n\nThe wedding, attended by prominent guests, earned her instant recognition, with requests for her services pouring in. Her collaboration with the experienced women saw her learn large-scale catering techniques such as cooking rice and beef in three-legged pots.\n\nAs a woman in business, Dlamini then mastered the art of balancing work, studies and family life through meticulous planning.People often say they are too busy, but with proper planning, anything is possible. I would wake up early, handle business matters and ensure my children were cared for before they woke up, she said.Her husband played a significant role in her culinary growth.\n\nI was spoilt as a child and never really cooked, but my husband was very particular about food. He wanted a balanced diet and refused to eat the same meals repeatedly. That pushed me to explore new recipes and cooking techniques.Dlamini said that after her husband witnessed her performance at their nieces birthday, he joined in and has been supporting her with event planning ever since.\n\nMy husband has been very supportive. When it comes to technical tasks like welding and repairing our cars, he is always handy. On the cooking side, he taught us how to make the best beef that people enjoy at M and M, as he used to work at the Cold Storage Company and knows how to prepare meat properly.\n\nEven when it comes to gravies, he is very skilled and always offers guidance. If we make crunchy carrots, he reminds us that we are cooking for Africans and insists that they must be well-cooked. He is the one who instilled a culture of serving well-prepared food at M and M. He also ensures that I run the company properly, without debts, she said.Dlaminis resilience paid off when she purchased land to build her own events venue at 53 years old. It took her a decade to complete the venue, finally realising her dream at 63 last year  a testament that it is never too late to achieve ones goals.\n\nThe highlight of my career came on November 16, 2024 when we officially opened our venue. That was proof that persistence and vision can overcome any challenge, she said.\n\nHowever, her journey has not been without hardships. She has faced financial struggles, theft of business assets and periods of depression. I faced my lows as a woman in business, including financial challenges. Along the way, some of my equipment was stolen, which led me to invest in dogs for security at the venue.\n\nI put a lot of money into the business in the beginning and at some point, I became depressed. During that period, I secured a corporate tender without realising that payments from such clients come later. This left me in debt. I kept borrowing until I could no longer do so, she said.\n\nDespite these setbacks, prayer and perseverance saw her through.Today, Dlamini employs over 30 part-time staff members and 12 full-time workers. Many of the women she mentored have gone on to establish their own successful businesses.\n\nHer journey is far from over. She plans to pursue a PhD and has an ongoing ambition to own a boutique hotel, so as to leave a lasting legacy for her family.\n\nHer story is a beacon of hope for aspiring entrepreneurs, proving that with determination, faith and hard work, anything is possible.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/GJH-J.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com Women in Zimbabwe continue to prove that they are not only the pillars of their households but also visionaries capable of spearheading successful ventures. One such trailblazer from Bulawayo is Eunice Dlamini, who has transformed every endeavour she touches into gold. Through sheer determination and limited prior knowledge, she has established an […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "COMMENT: More private players should participate in road repair efforts",
            "url": "https://www.chronicle.co.zw/comment-more-private-players-should-participate-in-road-repair-efforts/",
            "content": "The Zimbabwe National Road Administration (Zinara) says it will disburse ZWG11,6 billion to road authorities which include councils, the Department of Roads and the Rural Infrastructure Development Authority (Rida) this year.\n\nThe countrys roads are in a very bad state as a result of the incessant rains received across the country this year hence the Governments decision to extend the Emergency Road Rehabilitation Programme (ERRP2).\n\nThe Zinara disbursement will therefore boost funding for roads rehabilitation programme in both urban and rural areas.Government resources are overwhelmed given the number of major highways that urgently need rehabilitation hence the support from stakeholders like Zinara is very welcome.\n\nWhat quickly comes to mind is the Beitbridge- Bulawayo-Victoria Falls Highway where some sections of the road urgently need rehabilitation.\n\nThis is a very important and busy highway leading to the countrys tourist capital, Victoria Falls City.What is encouraging is that work is already underway to repair the badly damaged sections of the highway through a collaborative effort between the Department of Roads and a private company, Bitumen World.\n\nLast October, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said Cabinet had considered and adopted a proposed Public-Private Partnership between the Government and Bitumen World for the immediate reconstruction of the Beitbridge-Bulawayo-Victoria Falls Highway.\n\nDr Jenfan Muswere\n\nThis means Bitumen World will rehabilitate the highway under the Build, Operate and Transfer (BOT) arrangement once the partnership deal is finalised.\n\nZwane Enterprises Private Limited is upgrading the 120km Old Gwanda Road under a similar arrangement and will recoup its costs from the tolling fees.\n\nWe have already stated that Government is overwhelmed by the number of major roads that need urgent attention hence the need for private companies to come on board and partner it under the BOT arrangement.A good road network is key to economic development as it enhances business logistics such as movement of goods or farm produce to the different markets.\n\nMining companies in Matabeleland North have already responded to calls for private companies to complement Government efforts to repair roads and are working on the Cross Dete- Binga Road.\n\nThis is as it should be hence we urge other companies to join in and speed up the road rehabilitation programme to improve the countrys road network which is in a very bad state because of the rains this season.\n\nIn urban areas such as Bulawayo, some commuters are now walking long distances to access public transport as kombis have suspended services in their areas because of bad roads.\n\nIt is these areas that councils should prioritise when they receive funding from Zinara.According to Zinara there was a great improvement in the implementation and acquittals for allocated funds last year and we hope the trend will continue this year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/Zinara.jpg",
            "description": "The Zimbabwe National Road Administration (Zinara) says it will disburse ZWG11,6 billion to road authorities which include councils, the Department of Roads and the Rural Infrastructure Development Authority (Rida) this year. The country’s roads are in a very bad state as a result of the incessant rains received across the country this year hence the […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "Musona bounces back",
            "url": "https://www.chronicle.co.zw/musona-bounces-back/",
            "content": "Tadious Manyepo, Zimpapers Sports Hub\n\nTHERE must be something very special about Warriors coach Michael Nees.He says he drives around even at night as he bids to watch all players around and has even acquired a Zimbabwe Defensive Driving certificate to be extra safe.\n\nJust six months ago, he plucked out talismanic forward Khama Billiat from international retirement.Billiat never disappointed as he helped Zimbabwe qualify for the 2025 Afcon with a game to spare.\n\nThe German gaffer also risked it out by calling to the squad, forgotten goalkeeper Washington Arubi as the Warriors had no reliable pair of hands between the posts.\n\nThe move, again proved to be a masterpiece as the Marumo Gallants man made key contributions in Zimbabwes successful quest for a sixth appearance at the biennial jamboree.\n\nHe has now scored yet another huge goal after convincing former captain Knowledge Musona to come back into the fold from retirement.\n\nNees kept the conversation with Musona to himself, and with the help of the players reserved personality, nothing ever leaked.Even Musonas brother Walter was totally in the dark.\n\nAnd when Nees read Musonas name aloud when announcing his squad for the upcoming 2026 World Cup qualifiers against Benin and Nigeria next week during a packed Press conference yesterday, attendees were left stunned.\n\nYet the former Kaizer Chiefs man was even supposed to pitch up for the national team, having already accepted to make a retirement U-turn, back in November when Zimbabwe played Kenya in a match they were supposed to avoid defeat to secure their Afcon ticket.\n\nNees exudes so much confidence, but he is never arrogant.He realised the journalists had been stunned. And he took full control of the proceedings.Sometimes less talk is more, he retorted.\n\nKnowledge (Musona) is a good player. He will add a lot of value to the team. He was supposed to come in November, yes November.\n\nWe even applied for his visa. He has a huge personality and he didnt want to steal the show since we had already won two games against Namibia.\n\nBut he was ready to come if we had then lost to Kenya or we had encountered a major problem like suspension or injury. It could be that two, three players are injured or suspended and you have to go to Cameroon and maybe get a win or a draw. So we applied for a visa.\n\nIt shows the positive character and thats what we need. Not put me first, put the team first, the country first. And that mentality we will have to set up more and more. That we have to put, everybody has to pull in the same direction.Everybody needs Musona to add value to the team.\n\nMusona will now be in line to become the first Zimbabwean to feature in four Afcon finals if he goes on to be in the plane to Morocco at the end of this year.\n\nBut before he can think of the record, he has to pitch up and help the Warriors turn their World Cup qualifiers around.Zimbabwe play host to Benin at the Moses Mabida Stadium in Durban, South Africa on Thursday next week before flying to Uyo, Nigeria for an away date with the Super Eagles five days later.\n\nThe Warriors need to pick up the points to stay in the reckoning for a place at the 2026 World Cup which will be jointly hosted by the United States of America, Canada and Mexico.\n\nThey anchor the six-team Group C with two points, five behind leaders Rwanda after four rounds of fixtures.Nees is inheriting the campaign which was kicked off by Baltemar Brito who oversaw two draws against Rwanda (0-0) and Nigeria (1-1) as well as Jairos Tapera who lost the two games he presided over against Lesotho (0-2) and South Africa (1-3).And Nees, who has lost just once in six games that he has taken charge of, is eager to revive the campaign after naming a strong squad yesterday.\n\nDespite his much-publicised injury, captain Marvelous Nakamba who plies his trade at English Championship side Luton Town, is in the team.\n\nNees said he would like to have the skipper assessed by the national team medical section before they make any decision.Arubi has also been named in the team although he was hospitalised last week due to an injury.\n\nThe domestic Premiership is only two weeks old but nine players have been called up with six from log leaders Scottland (Billiat, Walter Musona, Mthokozisi Msebe, Peter Muduhwa, Godknows Murwira and Tymon Machope), MWOS goalkeeper Martin Mapisa, Dynamos captain Emmanuel Jalai and Simba Bhoras Isheanesu Mauchi.\n\nWe have other players on stand-by who are ready to step in, in case something happens, said Nees.He explained that Tino Kadewere had been left out because he has not been getting game time at his French side Nantes while Belgium-based Bill Antonio has yet to regain his full fitness having recently returned from one of the most acute sports injuries  ACL.Warriors SquadGoalkeepers:Washington Arubi (Marumo Gallants), Marley Tavaziva (Brentford), Martin Mapisa (MWOS FC)Defenders:Jordan Zemura (Udinese), Divine Lunga (Sundowns), Gerald Takwara (Al Minaa SC), Munashe Garananga (FC Copenhagen, ISheanes Mauchi (Simba Bhora), Peter Muduhwa (Scottland), Godknows Murwira (Scottland), Emmanuel Jalai (Dynamos)Midfielders:Marshall Munetsi (Wolves), Andy Rinomhota (Cardiff City), Marvelous Nakamba (Luton Town), Tawanda Chirewa (Huddersfield), Khama Billiat (Scottland)Knowledge Musona (Al-Okhdood), Tawanda Chirewa (Huddersfield Town)Forwards:Prince Dube (Young Africans), Tawanda Maswanhise (Motherwell), Terrence Dzvukamanja (Supersport United), Tymon Machope (Scottland), Walter Musona (Scottland)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Knowledge-Musona.jpg",
            "description": "Tadious Manyepo, Zimpapers Sports Hub THERE must be something very special about Warriors coach Michael Nees. He says he drives around even at night as he bids to watch all players around and has even acquired a Zimbabwe Defensive Driving certificate to be extra safe. Just six months ago, he plucked out talismanic forward Khama […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "Government tackles trade deficit",
            "url": "https://www.chronicle.co.zw/government-tackles-trade-deficit/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nINDUSTRY and Commerce Minister Mangaliso Ndlovu has said the Government is working on measures to resolve the countrys unsustainable trade deficit, which he blamed on weak manufacturing sector performance.\n\nHe said this in a speech read on his behalf by the ministrys Bulawayo provincial director, Mrs Mary Chingonzoh, in Lupane to explain interventions under the Zimbabwe Industrial Reconstruction Growth Plan (ZIRGP).Minister Ndlovu said the plan focuses on the importance of supporting local production through initiatives to promote local content.\n\nHe said during the implementation period, the plan would address issues such as competitiveness, cost of doing business, availability and affordability of key enablers.\n\nThere shall be a strong focus on the manufacturing sector, particularly our ability to build a resilient and growing sector, said Minister Ndlovu.\n\nWe have to deliberately and internationally deal with the stubborn negative trade balance.In my view, the negative trade balance is the failure of the manufacturing sector.Last month, the Zimbabwe National Statistics Agency (ZimStat) reported that the countrys trade deficit for January 2025 was US$96,8 million, a 51 percent drop from US$197,3 million in December 2024.\n\nA trade deficit occurs when a countrys value of imports is greater than that of exports in a given period. When the value of exports exceeds the value of imports, it implies a trade surplus.\n\nThe ZIRGP is a transitional plan that takes the country forward following the expiry of the Zimbabwe National Industrial Development Policy, launched in December 2023, to the successor policy strategy.\n\nThe Zimbabwe National Industrial Development Policy 2 will be launched together with the National Development Strategy 2 (2026-2030).\n\nNDS1, the countrys five-year economic blueprint will run its course by the end of this year.Minister Ndlovu said ZIRGP provided a robust framework to address, capitalise on strengths, and build a prosperous industrial and commercial sector that contributes meaningfully to Zimbabwes socio-economic development.\n\nDuring the deliberations, stakeholders appealed to the Government to support rural industrialisation through initiatives that promote competitiveness, improve market accessibility, and reduce the cost of doing business.They said rural businesses faced more challenges than their urban counterparts due to the prohibitive cost of accessing raw materials, markets, and other resources.\n\nThe challenges required the Governments intervention, they said.Other issues raised during the meeting included the need to establish a one-stop shop and decentralisation of services to make it easy for rural businesses to register and access services at minimal or low cost.\n\nIn her remarks, regent Chief Mabhikwa (Zanele Khumalo) said there was also a need for skills development, especially in areas like timber value addition to promote start-up businesses and create employment opportunities.\n\nShe also called upon businesses to support each other, saying that the Government cannot create employment for everyone, stressing that if businesses work together, they can prosper and promote economic growth in Matabeleland North and the nation at large. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/wgrwf.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com INDUSTRY and Commerce Minister Mangaliso Ndlovu has said the Government is working on measures to resolve the country’s unsustainable trade deficit, which he blamed on weak manufacturing sector performance. He said this in a speech read on his behalf by the ministry’s Bulawayo provincial director, Mrs Mary Chingonzoh, in Lupane to explain […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        },
        {
            "title": "Era of unregulated liquor sales, public drinking over",
            "url": "https://www.chronicle.co.zw/era-of-unregulated-liquor-sales-public-drinking-over/",
            "content": "Bongani Ndlovu,[emailprotected]\n\nTHE era of unregulated alcohol sales and public drinking is over with Government declaring a crackdown against mobile bottle stores to curb illegal activities that pose health and security threats.\n\nSpeaking during a press briefing in Harare yesterday, Minister of Local Government and Public Works, Daniel Garwe, said the era of unregulated alcohol sales and public drinking is over.\n\nPeople are drinking all over the shore  that is now a thing of the past in terms of the mandate that has been given to us, he said.\n\nNo more mobile bottle stores. Let me repeat, no more mobile bottle stores anymore. These people moving with their small cars selling alcohol from boots  no! That must stop.\n\nMinister Garwe highlighted the numerous problems caused by such activities, including the lack of ablution facilities, health scares, security threat, and rising criminal activities such as theft, pickpocketing, and drug dealing.\n\nWe are happy that this crackdown addresses the lack of ablution facilities, which speaks to modernity and affects everyone here, he said.\n\nThe health scare affects everyone here. The threat to security affects everyone here. The level of theft and pick-pocketing affects everyone here.The level of drug dealing affects a relative of everyone here.So, the answer is to do the right thing  enforce the laws and stop that behaviour, said Minister Garwe.The Governments directive comes as part of a broader effort to restore order, ensure public safety, and promote a clean and healthy environment.\n\nMinister also reiterated that the enforcement of these regulations will be strict and unwavering, with support from law enforcement agencies.\n\nWe are committed to fostering a safe, clean, and orderly environment for all citizens. This is not just about enforcing laws; it is about protecting our communities and ensuring a better quality of life for everyone, he added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/garwe.jpg",
            "description": "Bongani Ndlovu, bongani.ndlovu@chronicle.co.zw THE era of unregulated alcohol sales and public drinking is over with Government declaring a crackdown against mobile bottle stores to curb illegal activities that pose health and security threats. Speaking during a press briefing in Harare yesterday, Minister of Local Government and Public Works, Daniel Garwe, said the era of unregulated […]",
            "time": "09:46",
            "date": "13 Mar 2025"
        }
    ]
}