{
    "news": [
        {
            "title": "‘One people, one Zimbabwe!’. . President’s call for national peace & unity",
            "url": "https://www.chronicle.co.zw/one-people-one-zimbabwe-presidents-call-for-national-peace-unity/",
            "content": "Blessings Chidakwa in MASVINGO\n\nPRESIDENT Mnangagwa has made an impassioned plea for Zimbabweans to stand together, declaring that no one should be allowed to sow seeds of division and disunity in a country that is enjoying prevailing peace and tranquillity.\n\nZimbabwe being a unitary State, the President said peace-loving Zimbabweans should always pursue unity that knows no boundary, with the role of the Church and State being to propel social development.\n\nPresident Mnangagwa said in a world facing many challenges such as climate change, illegal sanctions and geopolitical conflicts, the message of peace remains relevant and must always be upheld.\n\nIn a speech read on his behalf by Local Government and Public Works Minister Daniel Garwe at the 2025 Zion Christian Church (ZCC) Easter Conference at Mbungo Estate in Masvingo, the President said the country should remain united.\n\nWe are one people, one Zimbabwe. Nothing and no one must be allowed to sow seeds of division, disunity or confusion among us. In John 13 verse 34, Christ said, A new commandment I give unto you, that ye love one another; as I have loved you, that ye also love one another.\n\nLocal Government and Public Works Minister Daniel Garwe\n\nWe are instructed to love one another, even as Jesus loved us. The God of peace desires that we live in love, united, respecting one another, serving our country and worshipping Him, he said.\n\nThe Head of State and Government said the State and Church are one, and according to Ephesians 2 verses 19 and 20, We are no longer strangers and foreigners, but fellow citizens and members of the household of Almighty God, built on a solid foundation, with Jesus Christ as the chief cornerstone.\n\nPresident Mnangagwa said unity among Gods people, where individuals or groups come together with a shared purpose and common goals, is a powerful force.\n\nIt strengthens our collective will and transforms groups of individuals into engine rooms of greater successes and development within families, communities and the nation as a whole.\n\nLet us, therefore, pursue unity that knows no boundaries religion, tribe, race, colour, age or geography. When we are united at every level, Jesus, according to Matthew 18 verse 19, says: If two of you shall agree on earth as touching anything that they shall ask, it shall be done for them of my Father which is in Heaven, he said.\n\nPart of the multitude at the 2025 Zion Christian Church (ZCC) Easter Conference at Mbungo Estate in Masvingo\n\nThe President urged the nation and the Church in particular to recognise and harness both individual and collective capacities to propel the socio-economic development, modernisation and industrialisation of the country, through demonstrating unfailing love.\n\nMay we pray for our nation, according to Ephesians 3 verses 16 to 19, which in summary says: That out of His glorious riches Jesus Christ may strengthen us with power through the Holy Spirit, and that Christ may dwell in our nation through faith; and also pray that our motherland, Zimbabwe, may be filled with the love of Jesus, that exceeds all knowledge.\n\nThis will enable us to approach both our opportunities and challenges with love and unity of purpose transforming disputes through dialogue, turning hostilities into compassion and understanding, he said.\n\nThe President also called for the nation to pray for peace to prevail in the SADC region, across the continent, and throughout the world, where people are experiencing conflict, displacement, insecurity and instability.\n\nAs for the Easter holidays, President Mnangagwa said it is not only a celebration of Christs victory over death, but also a constant reminder of the call to be peacemakers.\n\nIn the Book of Matthew, Chapter 5 verse 9, the Bible says: Blessed are the peacemakers: for they shall be called the children of God.\n\nThis highlights that it is critically important for our lives to reflect Gods character, which is pleasing to Him.\n\nFurther, let us strive to create communities where peace and unity flourish, through love and forgiveness. This message must saturate our everyday interactions at all levels, he said.\n\nPresident Mnangagwa added: Through the victory of the Lord Jesus Christ on the cross at the household and family level, in our workplaces and communities let us practise kindness, mindful of the fact that every act of love and forgiveness is a step towards consolidating our national peace and unity.\n\nThe Head of State of Government said Zimbabweans can truly testify that Jesus Christ is peace.\n\nHe is Jehovah weRugare. Our nation testifies that indeed, He embraces our country with peace.Our nation is secure, built upon the word of Jesus Christ. In John 14 verse 27, He said: Peace I leave with you, my peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid.\n\nPresident Mnangagwa said the theme of the event, Christ: The Original Conveyor of Peace through Love and Forgiveness, is timely and urges continued practice of the love, harmony, peace and unity exemplified by our Lord and Saviour, Jesus Christ.\n\nAs a nation, communities, families and individuals, let us be encouraged by Hebrews 12 verses 1 and 2, which urges us to lay aside every weight and run with endurance the race set before us looking unto Jesus Christ, the author and finisher of our faith, who endured the cross despite the shame, and is now seated at the right hand of the throne of Almighty God, he said.\n\nToday, we celebrate His resurrection and the impact of His life and death on each of us. For us believers, this Resurrection Sunday also reassures us that death was defeated and that in Jesus we have life forever-more and are joint heirs of the Kingdom of God, he said.\n\nPresident Mnangagwa urged citizens to keep pressing on in the quest to emulate Christ in both word and deed.In doing so, we continue to rely on the incorruptible word of God, in the Holy Bible, which states in 2 Timothy 3 verse 16 that the word is sufficient and useful for teaching, rebuking, correcting, and training in uprightness, so that we, the followers of Christ, may be thoroughly equipped for every good work, he said.\n\nWe must depend on Jehovah God in building our nation brick by brick, in working for our communities and families stone upon stone; in modernising and industrialising our country step by step; and also in winning souls to our faith. It is He who causes our plans to succeed.\n\nTop officials present included Cabinet Ministers Anxious Masuka and Lovemore Matuke, the Minister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, Zanu-PF Politburo members, service chiefs and senior Government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dfedf.jpg",
            "description": "Blessings Chidakwa in MASVINGO PRESIDENT Mnangagwa has made an impassioned plea for Zimbabweans to stand together, declaring that no one should be allowed to sow seeds of division and disunity in a country that is enjoying prevailing peace and tranquillity. Zimbabwe being a unitary State, the President said peace-loving Zimbabweans should always pursue unity that […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "Residential title deeds issuance to be accelerated",
            "url": "https://www.chronicle.co.zw/residential-title-deeds-issuance-to-be-accelerated/",
            "content": "Debra Matabvu\n\nTHE issuance of title deeds will be accelerated in all residential areas to give security of tenure and ownership to citizens, President Mnangagwa has said.\n\nThis comes as over 7 000 title deeds are set to be issued this month to homeowners in Epworth, Chitungwiza, Southlea Park and Glenwood  under the Kwangu/Ngakwami Presidential Title Deeds Programme.\n\nSpeaking at the 45th Independence Day celebrations at Mutora Open grounds in Gokwe last Friday, the President said the issuance of title deeds in residential areas and to farmers complements the Land Reform Programme.\n\nIt is worth noting that this years Independence celebration is occurring after the consolidation of our land reform through the issuance of title deeds to both A1 and A2 farmers, including veterans of the liberation struggle, President Mnangagwa said.\n\nMy Government is also stepping up efforts to regularise both old and new settlements in cities and towns throughout the country. These programmes are set to assure citizens security of tenure, and ownership of their properties through title deeds.\n\nMinister Ziyambi Ziyambi\n\nIn an interview, Justice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi said the distribution of title deeds was set to begin this month.\n\nThe Presidential Title Deeds Programme is making steady progress, with prioritisation given to the efficient processing and distribution of title deeds, said Minister Ziyambi.\n\nCurrently, over 2 000 title deeds are being processed in Epworth, with distribution set to start soon. An additional 2 500 title deeds are scheduled for issuance in Glenwood and Glenwood Extension, where groundwork for service provision is expected to begin by the end of April. In Chitungwiza, 1 000 title deeds are being processed, primarily for beneficiaries from ZOPA, among the 55 000 long-term municipal tenants.\n\nIn Southlea Park, the initial phase has begun, with 1 800 applications being processed out of a target of 9 600 residents this April.\n\nAfter this phase, said Minister Ziyambi, the programme will expand to cover other suburbs, including Robert Mugabe, Zvidozvevanhu, Zinyengere and Overspill.\n\nLaunched by President Mnangagwa in April 2023, the title deeds programme seeks to regularise informal settlements and empower citizens through legal property ownership.\n\nThis programme marks a key milestone in our commitment to ensuring security of tenure for our citizens, especially those in informal settlements, he added.\n\nWe have successfully moved beyond the preparatory phase and are now processing title deeds in Epworth, Chitungwiza and Southlea Park.\n\nMinister Ziyambi said roll-out is also planned for Cowdray Park in Bulawayo and Gimboki in Mutare.\n\nThe Government remains committed to streamlining the process to ensure that eligible households receive their title deeds promptly, he said.\n\nEligible residents have been advised to cooperate with authorities and submit the necessary documentation to facilitate the process.\n\nMinister Ziyambi said the title deeds initiative is more than just legal ownership, but is also about empowerment and economic inclusion.\n\nBy providing secure tenure, we are enabling beneficiaries to leverage their properties for development and investment opportunities. We encourage all eligible residents to co-operate with the relevant authorities, submit the required documentation and exercise patience as we work diligently to deliver on this transformative programme.\n\nOur commitment is to ensure that every deserving household benefits from this initiative as we continue our drive toward national development and prosperity for all, he said.\n\nGovernment, he added, was collaborating with various stakeholders including local authorities and legal experts, to facilitate a transparent and efficient title deeds issuance process.\n\nThe rollout will continue across the nation as we systematically process and regularise settlements, ensuring more households receive their title deeds.\n\nThis programme is being conducted transparently and efficiently with a focus on the needs of the people, said Minister Ziyambi.\n\nThe Kwangu/Ngakwami Presidential Title Deeds Programme aims to empower homeowners by providing secure ownership of their homes.\n\nThe primary objectives of the programme include providing title deeds to residents of informal or unregulated settlements and long-standing tenants in local authority housing.\n\nIt is being implemented in distinct phases, with the first phase focusing on well-planned areas lacking title deeds, while the second aims to regularise informal settlements.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-18-at-21.33.09-4-680x380.jpeg",
            "description": "Debra Matabvu THE issuance of title deeds will be accelerated in all residential areas to give security of tenure and ownership to citizens, President Mnangagwa has said. This comes as over 7 000 title deeds are set to be issued this month to homeowners in Epworth, Chitungwiza, Southlea Park and Glenwood — under the Kwangu/Ngakwami […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "Dynamic week of trade, innovation, and engagement in Bulawayo",
            "url": "https://www.chronicle.co.zw/dynamic-week-of-trade-innovation-and-engagement-in-bulawayo/",
            "content": "Nqobile Bhebhe, Senior Business Reporter\n\nTHE prestigious Zimbabwe International Trade Fair (ZITF) 2025 roars to life today in Bulawayo, with the city abuzz with activity as final preparations were concluded yesterday ahead of the countrys flagship trade and investment showcase.\n\nRunning until Saturday, this years sapphire edition is themed: Industrialisation: Crafting an Integrated Economic Landscape, and has attracted exhibitors from across Zimbabwe, the region, and the globe.\n\nThe ZITF Company has confirmed that exhibition space is fully booked, with a spill-over section created to accommodate overwhelming interest from sectors including manufacturing, mining, energy, ICT, agriculture and services.\n\nThe Zimbabwe International Exhibition Centre was a hive of activity yesterday, as exhibitors applied the finishing touches to their pavilions in readiness for what promises to be a dynamic week of trade, innovation, and strategic engagement.\n\nIn line with tradition, President Mnangagwa is expected to tour various stands, interacting with exhibitors and witnessing first-hand the innovation that underpins Zimbabwes industrial ambitions. His visit remains a key highlight of the fair.\n\nA notable diplomatic event this year is the official opening ceremony on Friday, which will be presided over by Mozambiques President Daniel Chapo. His participation elevates the international profile of ZITF 2025 and underscores the strong economic ties between Zimbabwe and Mozambique. Both nations are advancing strategic regional projects, such as joint energy transmission lines and logistics corridors, particularly the vital Beira Corridor, which facilitates trade access to global markets.\n\nZITF Company board chairman, Mr Busisa Moyo, said President Chapos attendance signals a commitment to deepening regional integration and collaboration.\n\nZimbabwe International Trade Fair (ZITF)\n\nMozambique is a key gateway for Zimbabwean exports to global markets, particularly through the Beira Corridor, while Zimbabwe provides a crucial trade route for goods destined for southern Africa, he said.\n\nThe week-long showcase will feature a robust line-up of forums and business conferences. Tomorrows schedule includes the Rural Industrialisation Indaba, Buyers Speed Networking, Zimbabwe-India Business Session, and the ZITF Innovators Forum and Hackathon.\n\nOn Wednesday, the flagship ZITF International Business Conference will take place, to be presided over by Vice-President Constantino Chiwenga under the theme Revitalising Industrialisation for Zimbabwes Economic Resurgence. Concurrently, the Connect Africa Symposium, under the theme Industrialisation and Economic Integration: Strengthening Africas Resilience, will be officiated by Vice-President Kembo Mohadi.\n\nZITF continues to play a strategic role in Zimbabwes economic calendar, aligning with national priorities around re-industrialisation, economic diversification, and competitiveness. It offers a vital platform for investment promotion, policy dialogue, and business linkages.\n\nAn exhibitor commented yesterday:\n\nZITF 2025 is a vital avenue for Zimbabwe to engage with potential investors across various sectors, including manufacturing, agriculture, mining, ICT and energy. It provides an opportunity for government and private stakeholders to highlight the countrys investment climate, reforms, and opportunities.\n\nThis year, confirmed participating countries include Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, Egypt, Ethiopia, France, Germany, India, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, the Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, the UK, USA, UAE, Zambia, and the EU Delegation.\n\nThe presence of such a diverse array of international exhibitors opens new doors for SMEs, who benefit from exposure, partnerships, and access to global value chains. The fair also spurs job creation, with dozens of young people seen outside the exhibition park yesterday seeking employment opportunities.\n\nBulawayo Mayor, Senator David Coltart\n\nIn a welcome message, Bulawayo Mayor, Councillor David Coltart, described the trade showcase as a critical component of the citys business calendar.\n\nHe said the theme aligns with the citys development agenda of becoming a Smart and Transformative City by 2025.In line with the ZITF theme, the city has adopted its own: Industrialisation  the pathway to a Smart and Sustainable City, as it seeks to re-imagine and reinvent Bulawayo over the next 50 years. We speak of how our residents can navigate emerging governance issues to improve service delivery, said Clr Coltart.\n\nHe added that the local authority values strategic partnerships for inclusive economic development.The hosting of the ZITF in the City of Bulawayo presents Zimbabwe with another opportunity to forge new frontiers in building a viable economy for the next generation. As the citys custodians, we have been entrusted by the public to deliver the development aspirations of Bulawayo, driven by its motto Siye Phambili (forward in development), said Clr Coltart.\n\nWe seek to court investors in improving service delivery, ensuring its residents enjoy the benefits of its City of Kings status.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dgfdf.jpg",
            "description": "Nqobile Bhebhe, Senior Business Reporter THE prestigious Zimbabwe International Trade Fair (ZITF) 2025 roars to life today in Bulawayo, with the city abuzz with activity as final preparations were concluded yesterday ahead of the country’s flagship trade and investment showcase. Running until Saturday, this year’s sapphire edition is themed: “Industrialisation: Crafting an Integrated Economic Landscape”, […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "Short-term insurers to boost liquidity buffers",
            "url": "https://www.chronicle.co.zw/short-term-insurers-to-boost-liquidity-buffers/",
            "content": "Business Reporter\n\nThe Insurance and Pensions Commission (Ipec) has stated that the short-term insurance sector is maintaining seven percent cash and bank balances, which is below the 20 percent upper limit, creating a risk of failure to handle unexpected high-risk claims.\n\nThe regulator, in its fourth quarter 2024 short-term insurance report, said insurers must ensure sufficient liquidity buffers to handle unexpected claims or market downturns.\n\nOther liquid assets such as money market investments and other short-term investments were well below the 70 percent upper limit for money markets, indicating that the industry may face liquidity risk if high claim payouts or unexpected financial shocks are experienced by the industry, reads part of the report.\n\nDuring the period under review, short-term insurers reported total assets amounting to ZAR6,18 billion, equivalent to US$239,42 million, which is a six percent increase from US$225,43 million reported as at December 31, 2023.\n\nAccording to the report, the increase in assets is mainly attributable to short-term investments and reinsurance contract assets, which increased by 1 007 percent and 108 percent, respectively.\n\nThe report shows that insurance contract assets and reinsurance contract assets amounted to ZiG561,51 million (US$21,77 million) and ZiG1,66 billion (US$64,27 million), respectively.\n\nIpec said that during the period under review, reinsurance contract assets and investment property were the two major asset classes, accounting for a combined 43 percent of total assets.\n\nThe Commission said reinsurance contract assets constituted 27 percent of the total assets, which poses counter-party credit risk. The insurance industry relies on reinsurers to pay claims; if reinsurers default, delay payments, or face insolvency, the insurers may struggle to meet their obligations.\n\nInvestment property alone constituted 16 percent, against a limit of ten percent as stipulated in the Ipec Investment Guidelines issued in terms of Circular 2 of 2013.\n\nDuring the period under review, short-term insurers reported insurance revenue amounting to ZIG4,60 billion, equivalent to US$255,56 million at the average exchange rate for the period under review.\n\nThis represents an 18 percent increase from the US$216,81 million reported for the same period in 2023.\n\nIn the engineering and aviation classes of business, insurance revenue increased significantly by 105 percent and 90 percent, respectively, while the hail and fire classes of business insurance revenue decreased by 318 percent and eight percent, respectively.\n\nDuring the reporting period, the primary drivers of insurance revenue were the motor and fire classes of business, collectively contributing 59 percent of the total revenue, reads part of the report.\n\nOn foreign currency revenue, short-term insurers reported absolute foreign-currency-denominated insurance revenue amounting to US$218,89 million during the period under review, a 25 percent increase from US$174,80 million reported in December 2023.\n\nForeign currency-denominated business constituted 79 percent of the total insurance revenue reported for the year 2024, an increase of eight percent from the 2023 share of foreign currency-denominated business.\n\nIn the engineering and personal accident classes of business, insurance revenue increased significantly by 97 percent and 75 percent, respectively, while the miscellaneous accident class of business insurance revenue decreased by 68 percent.\n\nAccording to the report, as of December 31, 2024, direct insurers had 474 727 policies, down from the 605 518 policies underwritten as of September 30, 2024.\n\nDuring the fourth quarter of 2024, 89 159 new policies were underwritten, and 219 950 exits were reported, and these include cancellations and expired/matured risks.\n\nThe report highlighted that most of the policies reported during the year under review were under the motor line of business, totalling 379 636 and constituting 80 percent of the total policies.\n\nFor the period under review, short-term insurers reported an insurance service result of ZiG244,67 million (US$13,58 million).\n\nIncurred service expenses from insurance contracts issued were ZiG3,92 billion (US$217,73 million), while other expenditures not directly attributable to insurance contracts amounted to ZiG467,75 million (US$25,97 million).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/07/Untitled-9-5.jpg",
            "description": "Business Reporter The Insurance and Pensions Commission (Ipec) has stated that the short-term insurance sector is maintaining seven percent cash and bank balances, which is below the 20 percent upper limit, creating a risk of failure to handle unexpected high-risk claims. The regulator, in its fourth quarter 2024 short-term insurance report, said insurers must ensure […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "Gokwe reverberates as musicians deliver on Uhuru Day",
            "url": "https://www.chronicle.co.zw/gokwe-reverberates-as-musicians-deliver-on-uhuru-day/",
            "content": "Langton Nyakwenda, recently in Nembudziya, Gokwe\n\nZIMDANCEHALL proved why it has emerged as one of the most popular genres since the country got its independence from Britain in 1980.\n\nAlthough the genre was introduced mainly by ghetto youths from Mbare, after 2010, Zimdancehall now transcends across generations, races and even religious groups.\n\nThis was evident at the Independence Gala held at Nembudziya Growth Point on Friday night.The gala only ended well after 6am on Saturday, with music fans asking for more.\n\nGokwe Independence Gala\n\nJah Signal rocked the huge crowd with tune after tune, literally leaving the Gokwe music fans eating from his palm.His energetic moves left fans, who had braved the drizzly weather, asking for more.\n\nBut there was a huge line up and each artiste performed for less than 30 minutes.As expected, Chief Hwenje, was also a crowd favourite.\n\nFans could be heard chanting Mai Welly, one of Hwenjes famous tracks.Fans also resonated well with the hit song Kuma Cell, a tune that speaks of Zanu-PFs trong support base at grassroots level.\n\nBy the time Binga-based DT Bio Mudimba took to the stage at 4am, the crowd had already been mesmerised by performances from Sandra Ndebele, Sulumani Chimbetu, Peter Moyo, Chantelle Moyo and Simon Mutambi.\n\nOne music fan, Morgan Manyana, summed up the well subscribed Uhuru Gala.This was a perfect way of capping the Independence celebrations, he said.\n\nSome of us had never seen the likes of Jah Signal live on stage. The boy is so talented, we were used to listening to his music on radio, said one lady.\n\nBefitting to the event, Chimbetu belted some of his father Simons yesteryear war related tunes like Pane Asipo, prompting the crowd to go down memory lane.\n\nChimbetu was one of the headline acts on a bill that also had some powerful names like Mark Ngwazi.Dendera music is always reminding us of where we came from as a country.\n\nThis country was born out of a long liberation war, so we should always remember that, said Anastacia Gumbo, as she gyrated to the tunes.\n\nPeter Moyo also chose to play his fathers productions, with Zvinoita Murudo proving popular.The Independence celebrations began at Mutora Open Grounds where President Emmerson Mnangagwa addressed a strong crowd, before FC Platinum and Simba Bhora clashed in the Uhuru Cup.\n\nSoon after, the crowd switched to Uhuru Gala.\n\nFor the first time in history, Gokwe was the focal point, businesspeople cashed in and artistes also got the opportunity to showacse talent to a new audience.What a night it was, one that will forever remain etched in the minds of many Gokwe residents.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fgfgs.jpg",
            "description": "Langton Nyakwenda, recently in Nembudziya, Gokwe ZIMDANCEHALL proved why it has emerged as one of the most popular genres since the country got its independence from Britain in 1980. Although the genre was introduced mainly by ghetto youths from Mbare, after 2010, Zimdancehall now transcends across generations, races and even religious groups. This was evident […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "Brothers jailed for life in brutal double murder resentencing",
            "url": "https://www.chronicle.co.zw/brothers-jailed-for-life-in-brutal-double-murder-resentencing/",
            "content": "Danisa Masuku\n\nCONVICTED in 2019 for the brutal murders of a taxi driver and a flea-market vendor, brothers Thinkwell Moyo and Fred Dube initially received death sentences. Their heinous crimes involved butchering the taxi driver, whose life ended abruptly after his throat was cut, and discarding his body in a shallow grave in the Macdonald area of Bulawayo.\n\nThey then mercilessly stabbed the vendor to death with a sharp implement, before stealing his Honda Fit vehicle, mobile phone, and various items of clothing.\n\nHowever, following the abolition of the death penalty the previous year, a mandatory re-sentencing hearing was ordered. With a rekindled sense of hope, yearning for release from the harsh realities of prison life, the brothers sought the legal assistance of a pro-deo lawyer (a lawyer appointed by the court for those who cannot afford one), Bob Siansole. They appeared last Monday before Bulawayo High Court Judge Justice Nokuthula Moyo for the crucial hearing.\n\nIn their defence through Mr Siansole, he pleaded for mercy, stating: They have spent four years in jail, were in solitary confinement, and had only a Bible to read, which they could not do due to illiteracy. Non-governmental organisations from the United States of America trained them in peace-making. They were unable to apologise to the relatives of the deceased because they were not on speaking terms with their own families.\n\nRepresenting the State, the deputy prosecutor general for the Southern region, Tariro Rosa Takuva, argued that the accused had committed two premeditated murders under severely aggravating circumstances. The prosecution noted that while the accused cited their four years on death row and 23 hours daily in solitary confinement as mitigation, the two deceased individuals were confined to the perpetual solitary confinement of their graves.\n\nThe prosecution dismissed Moyo and Dubes claim that family estrangement prevented them from apologising to the bereaved, arguing that their awareness of three family deaths proved their contact with the outside world, and they should have made the effort to express remorse.\n\nThe court heard that relatives of Andile Ncube, in a victim impact statement, requested not to comment, stating the heartless murder of their son had left them heartbroken beyond measure and they did not wish to reopen old wounds.\n\nIn a victim impact statement read by their mother, Sipho Phiri, Dumenkosini Sibandas parents conveyed the profound weight of their sons callous murder.\n\nHis throat was cut open, and they killed him as if they were killing an animal. The whole family was left traumatised by the horrific murder, and we are still in pain. He was his mothers only child and financial support, and now his life has been plunged into hardship.\n\nHe left a young child needing his moral and financial support. As a family, we wish they should be sentenced to life imprisonment because after slitting his neck, his head was left hanging loosely. The death penalty was still befitting for their crime. We will never meet our son again while they are alive in prison.\n\nJustice Moyo then stated that the two accused individuals had been convicted on two counts of murder and initially sentenced to death in 2019, and that they were before the court for resentencing due to the abolition of capital punishment.\n\nThe two are brothers, both first-time offenders and family men at the time of conviction. There are no other significant mitigating features. They committed both murders on the same night, which is in itself an aggravating factor, as is the fact that the murders occurred during a robbery. In the first count, the deceased was hired by the two accused, who pretended to be customers, directing the taxi to a secluded location where they butchered Mr Sibanda, stabbing him in the neck and cutting his jugular vein, before robbing him of his vehicle and mobile phone.\n\nThey then used the stolen vehicle to embark on a robbery spree. These two murders were callous and barbaric. The deceased paid for the greed of the two accused with their lives. They failed even to send relatives or prison officers to convey their apologies, clearly having forgotten about the victims families until surprised by the abolition of the death penalty.\n\nClose relatives remain traumatised and unable to give a victim impact statement. This case is at the very top of murder cases, and the circumstances of the offences tilt the scales heavily towards a very lengthy prison term. The Supreme Court has confirmed that the death penalty committed in these circumstances deserves a high-end sentence.\n\nFor count one, Moyo and Dube were each sentenced to life imprisonment, and for count two, they each received a further life imprisonment sentence.\n\nThe circumstances of the crimes revealed that Fred and Thinkwell, both from Toro Village in Lower Gweru, fatally attacked Dumenkosini Sibanda (26), a Bulawayo pirate taxi driver, on April 16, 2018, robbing him of his Honda Fit and a mobile phone. They subsequently travelled to Inyathi, where they fatally stabbed Andile Ncube (21), a flea market trader, stealing his merchandise which they loaded into the stolen car.\n\nDube and Moyo, born to the same mother but different fathers, were convicted of two counts of murder with actual intent by Bulawayo High Court judge Justice Nokuthula Moyo, who ruled that the murders were committed in aggravating circumstances.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Danisa Masuku CONVICTED in 2019 for the brutal murders of a taxi driver and a flea-market vendor, brothers Thinkwell Moyo and Fred Dube initially received death sentences. Their heinous crimes involved butchering the taxi driver, whose life ended abruptly after his throat was cut, and discarding his body in a shallow grave in the Macdonald […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "Kaindu optimistic ahead of Ngezi tie. . . as Chicken Inn welcome Simba Bhora",
            "url": "https://www.chronicle.co.zw/kaindu-optimistic-ahead-of-ngezi-tie-as-chicken-inn-welcome-simba-bhora/",
            "content": "Fungai Muderere,Zimpapers Sports Hub\n\nSMARTING from a one-nil defeat, they suffered at the hands of Chicken Inn in a derby Independence Day Celebrations match on Good Friday, Highlanders gaffer Kelvin Kaindu is optimistic that his charges will rise to the occasion when they take on former champions Ngezi Platinum Stars at Baobab Stadium this afternoon.\n\nOn Independence Day, Bosso, just like Chicken Inn, gave a number of non-regular players a run in an exciting open match.\n\nI think our game against Chicken Inn was a big litmus test. We changed the entire team, and we did our team selection for the Ngezi Platinum game from that match. Most of the guys we fielded were wanting in terms of match fitness. Darlington Munkuli, Mvelo Khoza and Archford Faira, who has been injured, played well.\n\nWe were still working on some of the players match fitness. There were so many positives, and we are optimistic of a good result against Ngezi Platinum Stars, said Kaindu.\n\nIn their previous Castle Lager Premier Soccer fixture, Bosso edged CAPS United 1-0 courtesy of a Reason Sibanda quick first-half strike in the latest instalment of the Battle of the Cities.\n\nTakesure Chiragwi\n\nBosso are on nine points, but their away form remains a disaster  two draws and a defeat from three matches on the road speak to a side still searching for stability away from their favourite hunting ground, Barbourfields Stadium.\n\nTakesure Chiragwi-mentored Ngezi Platinum Stars will be without their pacey forward Obriel Chirinda due to suspension.\n\nBosso, who misses the services of, their dependable defender Andrew Mbeba, who is in the treatment room, will be looking to overcome the challenge.\n\nJoey Antipas\n\nThis will be the second consecutive league match that the Bulawayo football giants will play without Mbeba, who has not trained for two weeks following an injury he picked up in their one-all draw against Triangle United at Gibbo Stadium.\n\nThat result moved Bosso up to seventh with nine points, but their away form remains a concern: two draws and a defeat from three matches on the road speaks to a side still searching for balance away from Barbourfields Stadium.\n\n In another potentially exciting match that will be played today, Joey Antipas Chicken Inn will welcome Simba Bhora. Under the guidance of ex-Warriors and Highlanders player\n\nJoel Luphahla\n\n, Simba Bhora, who have managed to post three wins, two draws, and one defeat, are on eleven points.\n\nWe had a good match against Highlanders. The team that we used was made up of players who are all from the squad. All the players put their hands up to be selected for the Simba Bhora match.\n\nDefinitely, we will count them. We saw what our strength is like, but most of the players, if not those who started when we played against Dynamos in our last league match, will start, said Antipas.\n\nLast weekend, Chicken Inn edged Dynamos 1-0 in what was their first win of the season. Bruised DeMbare face a tricky assignment away to newbies MWOS at Ngoni Stadium, while Kwekwe United entertain Herentals College at Gwerus Bata.\n\nFlamboyant and star-studded Scottland FC take on Norman Mapezas FC Platinum in a potentially fiery clash at Rufaro Stadium.\n\n@FungaiMuderere.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-13-at-22.31.14-1.jpeg",
            "description": "Fungai Muderere, Zimpapers Sports Hub SMARTING from a one-nil defeat, they suffered at the hands of Chicken Inn in a derby Independence Day Celebrations match on Good Friday, Highlanders gaffer Kelvin Kaindu is optimistic that his charges will rise to the occasion when they take on former champions Ngezi Platinum Stars at Baobab Stadium this afternoon. […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "The glow-up: How Mai Tt turned her pain into power",
            "url": "https://www.chronicle.co.zw/the-glow-up-how-mai-tt-turned-her-pain-into-power/",
            "content": "Sipepisiwe Moyo, Zimpapers Arts & Entertainment Hub\n\nFrom mopping floors to opening doors of her own, Felistas Murata, better known as Mai Tt, has travelled a road paved with hardship, hope, and unshakable determination.\n\nHer journey is not just one of fame or reinvention, it is one of survival, faith, and the power of rising again.\n\nOnce known primarily for her outspoken presence on social media and roles on stage and screen, Mai Tt has now stepped into the world of beauty and wellness with the official launch of her Feli Glow Spa in Harare recently. And behind the glam, lies a story that humbles and inspires.\n\nAt the launch event, seasoned businesswoman Zodwa Mkandla, gave a heartfelt speech that traced their long, intertwined history.\n\nOur destinies are different, ladies. God has a purpose for each of us, she began, her voice full of pride and memory.\n\nMai Tt\n\nI met Feli in church, singing. Her voice moved me. Not long after, she asked for a job, not out of ambition, but necessity. She had just left her husband and was trying to care for her two little girls. She wanted just enough to feed them.\n\nMnkandla did not hesitate. She offered Felistas work in her office, where the tasks were humble, but the lessons would become life-shaping.\n\nShe swept the floors with such humility and dedication. I saw her pain, but I also saw her fight. And today, look at her. Shes turned her pain into power.\n\nZodwas words carried a message not only of praise, but of unity.\n\nAs women, we need to stop tearing each other down. This Pull Her Down (PHD) syndrome must end. We rise by lifting others. Uplift, support, pray, and never stop thanking God for every storm you survived.\n\nWhen Mai Tt took the stage, emotion cracked her voice. She laughed and cried in equal measure, opening her heart just as she opened the doors to her spa.\n\nAuntie Zodwa didnt want to say it, but I was once her maid. She taught me how to be clean, and how to carry myself. I used to scrub the toilet so well because shed say, I want to eat from that chamber!\n\nThe room erupted in laughter, but behind the humour was reverence.\n\nWhen Ginimbi (Zodwas late partner) was still alive, shed pull up in those luxurious cars. Id drop the mop and run to take pictures by them, dreaming that one day Id also shine. Shes not just my mentor, she helped shape me, Mai Tt said.\n\nThe Feli Glow Spa, true to its name, is a haven for those who believe in natural beauty and self-care. Importantly, Mai Tt said the spa is a safe, private space for both men and women.\n\nWe dont use bleaching products here. Everything is organic. Were here to enhance whats already beautiful, she said.\n\nAnd what happens in our spa, stays in our spa. Privacy is sacred.\n\nFor Mai Tt, this moment is more than just a business milestone, it is the manifestation of every silent prayer whispered during hard times, every tear turned into tenacity, every closed door turned into a future entrance.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/4tf4.jpg",
            "description": "Sipepisiwe Moyo, Zimpapers Arts & Entertainment Hub From mopping floors to opening doors of her own, Felistas Murata, better known as Mai Tt, has travelled a road paved with hardship, hope, and unshakable determination. Her journey is not just one of fame or reinvention, it is one of survival, faith, and the power of rising […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "Women-led climate resilience projects win big in Hwange",
            "url": "https://www.chronicle.co.zw/women-led-climate-resilience-projects-win-big-in-hwange/",
            "content": "Fairness Moyana recently in Dete\n\nFIVE community groups, including a school club in Hwange District, were last Monday awarded small grants of up to US$5 000 each to implement innovative projects aimed at empowering women and enhancing community resilience in the face of climate change.\n\nThis comes after a competitive call by the ISANGO Project for proposals focusing on sustainable natural resource use. The call invited submissions covering areas such as epidemiology, sociology, food systems, community-based wildlife conservation and environmental education.\n\nThe initiative emphasised collaboration between small-scale farmers, civil society, students, teachers, extension workers and researchers. Out of 175 applicants, the five successful groups impressed the selection panel with proposals ranging from fodder production and poultry incubation to fish and mushroom farming and rainwater harvesting.\n\nProjects were selected based on their collaborative approach, innovation, sustainability and replicability  key factors in addressing challenges faced by communities in Hwanges Wards 14 to 18. Sustainability criteria focused on low environmental impact and profitability, while scalability required that projects could spread best practices across the region and beyond.\n\nThe grant awards, ranging from US$2 000 to US$5 000, prioritised women and youth-led initiatives. Judges said the winning proposals stood out for their ingenuity in addressing climate-induced challenges such as drought.\n\nOne of the beneficiaries, Mrs Sipiwe Sibelo (59), from Mabale, whose group received US$5 000 for an oyster mushroom project, said the initiative would uplift the livelihoods of women in the area.\n\nAs a group of five women, we responded to the ISANGO call and were shortlisted among 25 groups before securing this opportunity. Our project is meant to financially empower women while improving nutrition through mushroom consumption. As a widow, this support helps me better care for my family, she said.\n\nMrs Sibelo said their main market includes local lodges, schools and the wider Mabale community.\n\nAnother recipient, Ms Tanyala Nyoni, who received US$4 599 for an artificial poultry incubator project, urged other women to embrace similar opportunities.\n\nThis has always been a dream to own an incubator and start a poultry business. Thanks to ISANGO, this is now a reality. This will benefit the broader Makwandara community as I will work with other women across the poultry value chain, she said.\n\nOther winning projects included permaculture, fisheries and poultry rearing. The French Embassy in Zimbabwe funded the ISANGO Project through its French Solidarity Fund for Innovative Projects (FSPI), allocating 600 000 euros for the initiative, which started in April 2023 and ending this month.\n\nThe project promotes inclusive and adaptive environmental governance in Hwange National Park and its periphery.\n\nIts main goal is to coordinate all stakeholders including local communities, institutions, authorities and researchers in a context of climate change and biodiversity loss. A key focus is the co-development of actionable solutions that include and empower women and youth, ensuring sustainability and habitability in Hwanges social-ecological systems.\n\nSpeaking at the cheque presentation ceremony, held during the inauguration of a community knowledge hub and launch of a mobile exhibition in Dete, French Ambassador Mr Paul Bertrand Barets said the project contributes significantly to sustainable development, inclusive governance and biodiversity protection.\n\nThe newly opened Community Knowledge Hub, equipped with digital tools, training spaces and a library, is set to empower locals, researchers, and policymakers with critical knowledge on wildlife and natural resource management. The hub will also foster adaptive governance to tackle climate change, water access and human-wildlife conflict.\n\nThe accompanying mobile exhibition, expected to reach over 8 000 learners across Hwange District, features interactive exhibits and educational media promoting biodiversity, climate resilience and protection of Hwange National Park, one of Zimbabwes most important ecosystems.\n\nThe ISANGO Project is being implemented by a consortium that includes French research institutions (CIRAD, CNRS and IRD) under the Zone Atelier Hwange, local NGO BIO-HUB Trust and community partners. Isango is a Ndebele word meaning gateway to knowledge.\n\nAmbassador Barets and the Minister of State for Provincial Affairs and Devolution in Matabeleland North, Cde Richard Moyo, also toured the Dirimwe permaculture project in Silewu Ward. Through ISANGO, other landscape regeneration efforts have been launched in Dirimwe, Ndangababi and Sobajimba wards, in collaboration with PORET Trust and Soft Foot Alliance.\n\nThese initiatives showcase the resilience of local communities and their critical role in conserving biodiversity near Hwange National Park.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/money-1.jpg",
            "description": "Fairness Moyana recently in Dete FIVE community groups, including a school club in Hwange District, were last Monday awarded small grants of up to US$5 000 each to implement innovative projects aimed at empowering women and enhancing community resilience in the face of climate change. This comes after a competitive call by the ISANGO Project […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        },
        {
            "title": "BCC to unveil innovative investment vision at ZITF",
            "url": "https://www.chronicle.co.zw/bcc-to-unveil-innovative-investment-vision-at-zitf/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nAS the 65th edition of the Zimbabwe International Trade Fair (ZITF) opens today in Bulawayo, the host city is stepping into the spotlight, not just as a venue, but as an ambitious investment destination reimagining its economic future.\n\nRiding on this years ZITF theme, Industrialisation: Crafting an Integrated Economic Landscape, Bulawayo is using the platform to position itself as a dynamic hub for industrial regeneration, innovation, and inclusive development.\n\nThe citys own exhibition theme, Industrialisation  The Pathway to a Smart and Sustainable City, reflects a forward-looking strategy to reinvent itself over the next 50 years.\n\nDelivering his welcome address, Bulawayo mayor Councillor David Coltart said Bulawayo is embracing the winds of change driven by technological advancement, the Internet of Things (IoT), and the Fourth Industrial Revolution (4IR).\n\nZimbabwe International Trade Fair (ZITF)\n\nIn line with the ZITF theme, the city has created its theme: Industrialisation  the pathway to a Smart and Sustainable City as it seeks to reimagine and reinvent Bulawayo in the next 50 years. We speak on how our habitants can navigate emerging governance issues to improve service delivery, he said.\n\nBulawayo is showcasing a diverse portfolio of investment opportunities cutting across key sectors such as public and private infrastructure, renewable energy, housing development, road networks and modernisation of public transport.\n\nA notable highlight is Bulawayo City Councils long-term plan to establish a municipality development bank, a strategic financial institution meant to drive infrastructure projects and unlock economic potential.\n\nThe City of Bulawayo presents a number of investment opportunities, which include investments in both public and private infrastructure, solar renewable energy projects, housing delivery, road infrastructure investments, public transport sector and a municipality development bank that will finance infrastructural development projects, he said.\n\nClr Coltart noted that the city values strategic partnerships for inclusive economic development.\n\nWe seek to court investors in improving service delivery ensuring its habitants enjoy its City of Kings status, he said.\n\nClr Coltart also unveiled plans to transform Bulawayo into a research and industrial hub for Zimbabwe, powered by a knowledge-based economy and skills development. The recently held Bulawayo Economic Development Conference (BEDCON) laid the groundwork for stronger collaboration between academia, industry and policy-makers.\n\nIn a bid to promote tourism and the creative economy, the city is courting investors to construct five new five-star hotels, while also developing infrastructure for sports and arts as part of building an inclusive urban economy.\n\nClr Coltart noted that these sectors are often overlooked yet they hold massive potential for job creation and youth engagement,\n\nAs Bulawayo we want you to be part of the citys smart vision as we innovate for the future. The city also seeks to enhance its presence in the sports and creative sectors in developing a vibrant economy that is inclusive and does not leave anyone behind, he said.\n\nThe city has opportunities in the tourism sector and requires the construction of five new five star hotels.\n\nThe mayor emphasised that Bulawayo is committed to sustainability, with a long-term goal of becoming a carbon-neutral city by 2050. The city is rolling out strategies that promote green innovation and environmentally conscious industries, in line with global climate targets.\n\nPositioning Bulawayo as a partner in national development, Clr Coltart said hosting the ZITF offers a chance to forge new frontiers and attract strategic partnerships for a viable future economy.\n\nHence, hosting of the ZITF in the City of Bulawayo presents Zimbabwe another opportunity to forge new frontiers in building a viable economy for the next generation. As the citys custodians we have been entrusted by the public to deliver the development aspirations of Bulawayo driven by its motto Siye Phambili (forward in development), he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bdfzbxcvzdxcv.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw AS the 65th edition of the Zimbabwe International Trade Fair (ZITF) opens today in Bulawayo, the host city is stepping into the spotlight, not just as a venue, but as an ambitious investment destination reimagining its economic future. Riding on this year’s ZITF theme, “Industrialisation: Crafting an Integrated Economic Landscape,” Bulawayo is […]",
            "time": "08:44",
            "date": "21 Apr 2025"
        }
    ]
}