{
    "news": [
        {
            "title": "Fire guts Mpilo Hospital Kiosk, destroying property worth ZiG130 000",
            "url": "https://www.chronicle.co.zw/fire-guts-mpilo-hospital-kiosk-destroying-property-worth-zig130-000/",
            "content": "Sikhumbuzo Moyo\n\nA SIX-ROOMED Red Cross structure used as a kiosk at Mpilo Central Hospital in Bulawayo was gutted by fire this afternoon due to an overheated fresh chips fryer, resulting in the destruction of property worth ZiG130 000.\n\nBulawayo Chief Fire Officer, Mr Mhlangano Moyo, said the damage was contained within one room where the chips were prepared.\n\nIt is a single-storey structure near the parking area with six rooms, but fortunately, only one roomthe one where they prepare fresh chipswas affected, said Mr Moyo.\n\nHe said the fryer and part of the ceiling were damaged, and the fire brigade used a single hose reel to contain the fire. No human injuries were reported.\n\nMr Moyo said the estimated value of the building is ZiG800 000, with property worth ZiG670 000 saved.He commended the hospital-based fire team for their swift response, attributing it to a deliberate training programme by the fire brigade.\n\nIn the past, when fires broke out, there were delays in reporting, and by the time we arrived at the scene, the damage was already extensive. I am pleased with the direction we are taking as a department, where we now have fire teams stationed at strategic points. This will go a long way in saving valuable property, investments, and, indeed, lives, said Mr Moyo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/urt.jpg",
            "description": "Sikhumbuzo Moyo A SIX-ROOMED Red Cross structure used as a kiosk at Mpilo Central Hospital in Bulawayo was gutted by fire this afternoon due to an overheated fresh chips fryer, resulting in the destruction of property worth ZiG130 000. Bulawayo Chief Fire Officer, Mr Mhlangano Moyo, said the damage was contained within one room where […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "ZimParks calls for a halt to mining activities in Hwange National Park",
            "url": "https://www.chronicle.co.zw/zimparks-calls-for-a-halt-to-mining-activities-in-hwange-national-park/",
            "content": "By Sikhumbuzo Moyo,[emailprotected]THE Ministry of Mines and Mining Development has been urged to cancel an application for mining activities in Hwange National Park, specifically targeting the Sinamatella Black Rhino Intensive Protection Zone, and to reject any such applications in the future.In a statement, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) said the area is a critical habitat for black rhinos, supporting a growing population of this endangered species, which is listed under Appendix I of the Convention on International Trade in Endangered Species of Wild Flora and Fauna (CITES).Needless to say, the proposed mining project will significantly increase the risk of species extinction and negatively impact population recovery prospects. Furthermore, it poses a serious threat by exacerbating land degradation, a key concern for ZimParks, which is mandated to ensure that at least 80 per cent of degraded terrestrial, inland water, and other ecosystems are restored by 2030, said ZimParks.While substantial progress has been made in reviving wildlife populations across the country, ZimParks warned that introducing mining activities in Hwange National Park would undermine the ecological conditions essential for wildlife survival and reproduction. This, they added, would hinder ongoing efforts to maintain and restore healthy wildlife populations.Approving mining in this zone would not only contradict ZimParks conservation mandate but also damage Zimbabwes reputation as a regional and international leader in sustainable conservation. It is important to note that tourism is a major revenue generator for the country, and our operations rely significantly on the revenue generated through leased concessions. The introduction of mining operations could therefore severely impact our ability to deliver quality experiences for tourists, ZimParks stated.The authority highlighted that mining activities are known to cause air, noise, and land pollution, which negatively affect visitor experiences and disrupt wildlife movements, potentially leading to an increase in poaching cases.ZimParks also emphasised that Sinamatella is home to the Bumbusi Ruins, which hold historical and cultural significance for the Nambya-speaking communities, dating back to the 18th century. Traditional leaders from the region visit the area annually to conduct cultural rituals and rainmaking ceremonies.Hwange National Park is home to Africas second-largest elephant population, and mining could interfere with groundwater flow, threatening vital water sources relied upon by wildlife. This disruption could exacerbate existing water shortages, leading to increased mortality rates among species and heightened human-wildlife conflict in surrounding communities, ZimParks added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hhhhwqew-2.jpg",
            "description": "By Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Ministry of Mines and Mining Development has been urged to cancel an application for mining activities in Hwange National Park, specifically targeting the Sinamatella Black Rhino Intensive Protection Zone, and to reject any such applications in the future. In a statement, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) said […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "‘Time for female IOC president’ – Coventry eyes historic role",
            "url": "https://www.chronicle.co.zw/time-for-female-ioc-president-coventry-eyes-historic-role/",
            "content": "International Olympic Committee (IOC) presidential candidate Kirsty Coventry says its time the organisation was led by a woman  but wants members to have confidence in me that Im the right person.\n\nThe 41-year-old former swimmer would also become the youngest  and the first from outside Europe or North America  to lead the organisation in its 130-year history if she beats her six male rivals in a vote later this month.\n\nI dont think its just about gender, the same way that I dont think its just about being the only African candidate, the Zimbabwean sports minister told BBC Sport.\n\nIt really is about, what does the movement need today?\n\nI think being a double Olympic champion and having the experiences that Ive had within our movement and outside, all bring a lot of value to ensuring I could lead this organisation.\n\nCoventry, who won the 200m backstroke at the 2004 and 2008 Olympics and is Africas most-decorated Olympian, is very positive about her chances of becoming sports most powerful figure when IOC members make their choice in Greece on 20 March.\n\nWhen asked how she felt about being seen as the preferred choice of outgoing president Thomas Bach after his 12-year tenure, Coventry added: Hes allowed the candidates to do what we need to do and talk to the members and its [their] decision. Hes been fair to all of the candidates.\n\nCoventry wants to try to challenge the status quo and to bring change.\n\nBeing able to showcase the biggest and most wonderful sports event in the world, where you have athletes from all different backgrounds coming togetherthat for me is what the world needs right now, she added.\n\nWe have to make very good decisions so that this movement can remain relevant for generations to come. And, for me, being a mum of two young girls, I feel the weight on my shoulders is maybe a little bit more than that of the other candidates because Im going have a constant reminder that I need to not mess this up.\n\nThe IOC currently allows each international federation (IF) to set its own gender eligibility rules, and in recent years a number have barred athletes who have undergone male puberty from competing in elite female competition, amid concerns inclusion may come at the expense of fairness and safety.\n\nCoventry has been an IOC executive board member since 2023, but confirmed that  as with rival presidential candidate Lord Coe  she is now backing a blanket ban of transgender women from competing in female Olympic sport.\n\nI believe with the work that has been done with the IFs, the rules they have put in place, you can see there has been research done where its showing a disadvantage to women, to the female category she said.\n\nFrom the conversations that Ive had now, a lot of the international federations want the IOC to take a more leadership role. We have more facts, theres more science and medical research being done.\n\nWe need to protect the female category and I think its time right now for the IOC to take that leading role.\n\nThe IOC wasengulfed in controversy at the Paris Gameslast summer when Algerias Imane Khelif won the womens welterweight boxing gold medal  a year after being disqualified from the World Championships for reportedly failing a gender eligibility test.\n\nThe IOC cleared the 25-year-old to compete  along with Taiwans Lin Yu-ting, who was also banned by the suspended International Boxing Association (IBA). Both fighters have insisted they are women, and there is no suggestion they are transgender.\n\nWhen asked if she and her IOC colleagues could have avoided the episode, Coventry added: There are always lessons we can learn. There are always going to be things we cant foresee, but we should do the best to ensure something like that doesnt play out again at an Olympic Games.\n\nCoventry has faced criticism in Zimbabwe in her capacity as sports minister since 2018, but defended her association with the government of controversial president Emmerson Mnangagwa.\n\nIn 2022Fifa banned Zimbabwe from international footballover governmental interference in the running of the game. Last year the United States also imposed sanctions on Mnangagwa and other senior officials for corruption and human rights abuses.Zimbabwes government condemned the decision.\n\nI dont believe you can really create change if you dont have a seat at the table said Coventry.\n\nIts not been the easiest thing but I have had incredible support and we are making a difference. Our sports are starting to do much better. With change it takes time, but I am someone that doesnt want to stand on the side.\n\nSometimes you win, sometimes you dont, but I want to be able to try. Im going to make my country better.\n\nHaving to navigate very sensitive issues has definitely given me extra armour if I can put it that way for what [the IOC] will face in in the future, and were going to have to navigate difficult leaders that have different opinions on things. But what will help us to navigate that is to not verge away from our Olympic charter, our values.\n\nThe other six candidates for the IOC presidency are Frances David Lappartient, Japans Morinari Watanabe, Prince Feisal al Hussein of Jordan, Spaniard Juan Antonio Samaranch Jr, Swede Johan Eliasch and the UKs Lord Sebastian Coe.\n\nBBC\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/dergtrg.jpg",
            "description": "International Olympic Committee (IOC) presidential candidate Kirsty Coventry says it’s time the organisation was led by a woman – but wants members “to have confidence in me that I’m the right person”. The 41-year-old former swimmer would also become the youngest – and the first from outside Europe or North America – to lead the […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Suspected Bulawayo suburban drug dealer appears in court",
            "url": "https://www.chronicle.co.zw/suspected-bulawayo-suburban-drug-dealer-appears-in-court/",
            "content": "Peter Matika,[emailprotected]SUSPECTED drug dealer Pigors Tyron Siegfried, who was arrested on Thursday following a raid at his home, is set to appear in court this afternoon.During the operation, police seized 1.2kg of crystal meth, with an estimated street value of US$6,000.Officers pounced on Siegfried at his home in Matsheumhlope after monitoring him since February. Acting on gathered intelligence, detectives raided his residence, discovering the drugs concealed in a Lobels biscuit box, a Puma sneaker box, a dictionary-shaped safe, and a large blue metal trunk in his bedroom.Police also confiscated measuring scales used for packaging the drugs.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/VJMJYHBVXC.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw SUSPECTED drug dealer Pigors Tyron Siegfried, who was arrested on Thursday following a raid at his home, is set to appear in court this afternoon. During the operation, police seized 1.2kg of crystal meth, with an estimated street value of US$6,000. Officers pounced on Siegfried at his home in Matsheumhlope after monitoring […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "The Headmaster’s sons to honour jazz icon tomorrow",
            "url": "https://www.chronicle.co.zw/the-headmasters-sons-to-honour-jazz-icon-tomorrow/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nTHE sons of the late veteran jazz icon Bob The Headmaster Nyabinde, Aggau and Albert Nyabinde, will honour their fathers legacy tomorrow with a commemoration show in Harare.The Headmaster passed away on 23 December 2023 and will be fondly remembered for producing chart-topping tracks such as Chabuda Hapana from his debut album Pane Nyaya, released in 2002.The tribute event will take place at Sherwood Golf Club in Mabelreign, starting at 7:30 pm.The lineup features renowned musicians, including Victor Kunonga and Prudence Mbofana.Aggau said the night promises to be an exciting one for jazz lovers.We wanted to commemorate him on his birthday on 10 March, but we decided to take advantage of the weekend. We want to honour his legacy, and his children, who have taken up the torch, will be performing on the night.\n\nAlbert and Aggau Nyabinde\n\nSir Albert Nyabinde will be playing the saxophone, while Agga Nyabinde, a singer and guitarist, will perform some of The Headmasters greatest hits alongside their own compositions. Its going to be a fantastic eveningone to look forward to, said Aggau.@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ikikiki.jpg",
            "description": "Mthabisi Tshuma,revmmthiretshuma@gmail.com THE sons of the late veteran jazz icon Bob “The Headmaster” Nyabinde, Aggau and Albert Nyabinde, will honour their father’s legacy tomorrow with a commemoration show in Harare. The Headmaster passed away on 23 December 2023 and will be fondly remembered for producing chart-topping tracks such as Chabuda Hapana from his debut album […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Rangers discover dead, skinned, and headless lion in Victoria Falls",
            "url": "https://www.chronicle.co.zw/rangers-discover-dead-skinned-and-headless-lion-in-victoria-falls/",
            "content": "Sikhumbuzo Moyo,[emailprotected]THE Zimbabwe Parks and Wildlife Management Authority (ZimParks) has raised serious concerns over rising cases of lion poaching in the country following the discovery of a dead lion in Victoria Falls.The animal had been skinned, with its claws and head missing.In a statement on Friday, ZimParks reported that a team from the Vic Falls Wildlife Trust was tracking a collared lion when they detected a stationary signal. Upon further investigation, they discovered the dead animal, along with another lion that had been caught in a snare but was still alive.With the assistance of veterinary doctors, the second lion, an adult male, was successfully treated and rescued from the snare, said ZimParks.Following the incident, a report has been filed with the Zimbabwe Republic Police, and ZimParks investigations team is working closely with law enforcement authorities.We are deeply concerned about the increasing cases of lion poaching, and we will continue collaborating with the police and conservation partners to combat this issue. Our rangers in Zambezi, along with anti-poaching units in Victoria Falls, are actively conducting snare-sweeping patrols in the surrounding areas to protect wildlife.We remain committed to addressing this critical problem and will provide updates as new developments arise, said ZimParks.In a report from October last year, Down to Earth cited wildlife conservation groups indicating that lion bones are in high demand in Asian countries such as China and Vietnam, where they are used in unscientific traditional medicine.In Vietnam, 89 per cent of people believe in the effects of products made from tigers and lions, despite research showing no real medicinal benefits, according to World Animal Protection.Of those who consume these products in Vietnam, almost nine out of 10 prefer big cat products from animals caught in the wild rather than farmed, the report states.The report also noted that in China, more than two out of five people surveyed had used drugs or health products containing big cat derivatives, while over half of Chinese consumers preferred their big cat products to be sourced from the wild.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/wrgnbv.jpg",
            "description": "Sikhumbuzo Moyo,smoyo@chronicle.co.zw THE Zimbabwe Parks and Wildlife Management Authority (ZimParks) has raised serious concerns over rising cases of lion poaching in the country following the discovery of a dead lion in Victoria Falls. The animal had been skinned, with its claws and head missing. In a statement on Friday, ZimParks reported that a team from […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "BSCL kicks off Saturday",
            "url": "https://www.chronicle.co.zw/bscl-kicks-off-saturday/",
            "content": "Fungai Muderere,[emailprotected]\n\nTHE Bulawayo Corporates Social League (BSCL) 2025 season kicks off on Saturday with six fixtures that have been lined up at different venues.\n\nZesa will take on Evergold at Sizinda Hall while Macdonald will seek to utilize their home ground when they take aim at Ostrich.\n\nZimtile will seek to quench their taste and beat Chibuku in an away fixture that will be played at Cement Primary School.\n\nWD will engage in a shift against Overnight FC AT Gifford High while Coca-Cola and Simbisa will fight it out at Iminyela ground.\n\nNust will seek to teach Millennium a football lesson at Gwabalanda.\n\nThe game between the leagues defending champions Speed Shipping and Proton has been postponed.\n\nShylock Ndlovu Speed Shipping player\n\nZRP Donnington are on bye.\n\nBCSL Week One Fixtures\n\nZesa v Evergold, (Sizinda Hall), MacDonald v Ostrich (Macdonald), Chibuku v Zimtile (Cement Primary School) WD v Overnight (Gifford), Coca-Cola v Simbisa (Minyela), NUST v Millennium (Gwabalanda), Speed Shipping Vs Proton (Postponed), ZRP Donnington (On bye)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/tu7uft.jpg",
            "description": "  Fungai Muderere, fungai.muderere@bmetro.co.zw THE Bulawayo Corporates Social League (BSCL) 2025 season kicks off on Saturday with six fixtures that have been lined up at different venues. Zesa will take on Evergold at Sizinda Hall while Macdonald will seek to utilize their home ground when they take aim at Ostrich. Zimtile will seek to quench their […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "Women challenged to take centre stage",
            "url": "https://www.chronicle.co.zw/women-challenged-to-take-centre-stage/",
            "content": "Solomon Bhumu,Post Reporter\n\nAS the world prepares to celebrate International Womens Day tomorrow, Senator Monica Mutsvangwa, the Minister of Women Affairs, Community, Small to Medium Entreprises Development has urged women in Manicaland to take charge of their lives and communities.Addressing the national IWD commemorations that are currently ongoing at Munyarari Primary School in Zimunya, Min Mutsvangwa stressed the importance of womens empowerment and gender equality, highlighting the need for women to break into male-dominated industries such as mining and transport logistics.We should heed the Presidents leaving no place and no one behind mantra as well as vision 2030 which prioritizes inclusive education, girl and prioritizing women rights. As the world strives to achieve the Sustainable Development Goals (SDGs), gender equality remains a critical component of building a more just and equitable society. said Min Mutsvangwa.The event saw different ministers and deputy ministers as well as development partners attending.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/qwqwq.jpg",
            "description": "Solomon Bhumu,Post Reporter AS the world prepares to celebrate International Women’s Day tomorrow, Senator Monica Mutsvangwa, the Minister of Women Affairs, Community, Small to Medium Entreprises Development has urged women in Manicaland to take charge of their lives and communities. Addressing the national IWD commemorations that are currently ongoing at Munyarari Primary School in Zimunya, […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "NEW: Man arrested for stock theft in Nyabira",
            "url": "https://www.chronicle.co.zw/new-man-arrested-for-stock-theft-in-nyabira/",
            "content": "Online ReporterPolice in Nyabira have arrested a 32-year-old man in connection with a stock theft incident that took place at Dryham Farm on Tuesday.The suspect, identified as Michael Gombe, was taken into custody after he and an accomplice, who remains at large, allegedly stole six goats from a local farmers pen.According to authorities, the suspects slaughtered the animals, packed the meat into plastic bags, and fled the scene.Gombe was later apprehended while attempting to get transport to take him to Harare along the Harare-Chirundu highway.Law enforcement officials are now pursuing Gombes accomplice and urging members of the public with information to come forward.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ghjjkghjfjf-1.jpg",
            "description": "Online Reporter Police in Nyabira have arrested a 32-year-old man in connection with a stock theft incident that took place at Dryham Farm on Tuesday. The suspect, identified as Michael Gombe, was taken into custody after he and an accomplice, who remains at large, allegedly stole six goats from a local farmer’s pen. According to […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        },
        {
            "title": "NEW: Police investigate fatal shooting of Detective in Bulawayo",
            "url": "https://www.chronicle.co.zw/new-police-investigate-fatal-shooting-of-detective-in-bulawayo/",
            "content": "Online Reporter\n\nTHE Zimbabwe Republic Police (ZRP) has launched an investigation into the tragic death of Detective Constable Cassandra Hove of CID Homicide Bulawayo, who was fatally shot on Thursday while pursuing armed robbery suspects.National police spokesperson Commissioner Paul Nyathi said the shooting occurred in the Harbek area of Pumula South, Bulawayo.The Zimbabwe Republic Police confirms that investigations are being conducted in connection with the tragic and unfortunate death of Detective Constable Cassandra Hove of CID Homicide Bulawayo on 6th March 2025 while pursuing armed robbery suspects, he said.The Commissioner-General of Police Stephen Mutamba expresses condolences to the Hove family and assures the public that comprehensive investigations are underway with a view of establishing what actually transpired.Meanwhile, the police reiterated their commitment to fighting violent crime.The Zimbabwe Republic Police reiterates that there is no going back in the fight against armed robberies and other violent crimes in the country, said Commissioner Nyathi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jmjm.jpg",
            "description": "Online Reporter THE Zimbabwe Republic Police (ZRP) has launched an investigation into the tragic death of Detective Constable Cassandra Hove of CID Homicide Bulawayo, who was fatally shot on Thursday while pursuing armed robbery suspects. National police spokesperson Commissioner Paul Nyathi said the shooting occurred in the Harbek area of Pumula South, Bulawayo. “The Zimbabwe […]",
            "time": "21:26",
            "date": "07 Mar 2025"
        }
    ]
}