{
    "news": [
        {
            "title": "Miss Ebony Zimbabwe winners to get their prizes",
            "url": "https://www.chronicle.co.zw/miss-ebony-zimbabwe-winners-to-get-their-prizes/",
            "content": "Mbulelo Mpofu\n\nZimpapers Arts and Entertainment Hub\n\nReigning Miss Ebony Zimbabwe 2025, Chengeto Kanyai, along with 1st Princess Samukele Dlamini and 2nd Princess Lerato Masocha are set to receive their prizes at a send-off and prize handover event, with the date and location yet to be announced.\n\nBridget Mawarire, director of Miss Ebony Zimbabwe 2025, explained that the event will honour the organisations commitment to its contestants, partners, and supporters.Despite transitioning Miss Ebony Zimbabwe 2025 to a virtual format, we remain dedicated to fulfilling our promises to the winners, Mawarire said.\n\nShe said fairness and transparency would remain central to the event, with sponsors and stakeholders present as the finalists receive their prizes.The Miss Ebony Zimbabwe 2025 queen will receive her car prize, and other winners will be awarded their cash prizes and awards, as originally promised. The invite-only event will feature VIP guests, sponsors, and partners, ensuring that we maintain the integrity, glamour, and appreciation this platform represents, she added.Mawarire expressed gratitude to the partners who supported the contestants boot camp, which focused on skills development and various programmes.\n\nTicket holders who were unable to attend the finals were reassured that their purchases would remain valid.Keep your tickets safe! Were planning a massive send-off event. Thank you for your support, said the organisers in a recent press statement.\n\nKanyai is set to represent Zimbabwe on a Pan-African platform in Johannesburg, where she will promote a message of decolonised beauty and empowerment across Africa.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ujijhjhj.jpg",
            "description": "Mbulelo Mpofu Zimpapers Arts and Entertainment Hub Reigning Miss Ebony Zimbabwe 2025, Chengeto Kanyai, along with 1st Princess Samukele Dlamini and 2nd Princess Lerato Masocha are set to receive their prizes at a send-off and prize handover event, with the date and location yet to be announced. Bridget Mawarire, director of Miss Ebony Zimbabwe 2025, […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Dr Solwayo bags second Chief Dakamela award",
            "url": "https://www.chronicle.co.zw/dr-solwayo-bags-second-chief-dakamela-award/",
            "content": "Raymond Jaravaza, Online Reporter\n\nMPILO Hospitals Clinical Director, Professor Solwayo Ngwenya, has been awarded a second Imiklomelo kaDakamela (Chief Dakamela Achievers Awards) award for his outstanding work as a distinguished medical doctor, researcher and academic with a passion for cultural heritage and community service.\n\nLast year, Prof Solwayo was awarded for his outstanding work during the COVID-19 pandemic.\n\nWe would like to thank uChief Dakamela weNkayi for honouring us for the second straight year. This honour is not only physically important, it is culturally and spiritually huge. Your work is immensely commendable where you fish out and recognise the usually unrecognisable.\n\nWe wish you well, may Mvelinqangi labadala look after you, and bless your work on a behemothic and biblical scale, said Prof Solwayo.\n\nAs Nkayi traditional leader, Chief Dakamela, continues to host his annual achievers awards ceremony, Imiklomelo ka Dakamela, the event increasingly earns praise for its celebration of excellence and culture.\n\nNow in its third year, the awards recognise individuals and institutions  both local and regional  for their outstanding contributions to community development. The ceremony also honours schoolchildren who have excelled academically, as well as exceptional teachers.\n\nThis years event attracted guests from South Africa, Tanzania and Zambia.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/tgjdfcghnj.jpg",
            "description": "Raymond Jaravaza, Online Reporter MPILO Hospital’s Clinical Director, Professor Solwayo Ngwenya, has been awarded a second Imiklomelo kaDakamela (Chief Dakamela Achievers Awards) award for his outstanding work as a distinguished medical doctor, researcher and academic with a passion for cultural heritage and community service. Last year, Prof Solwayo was awarded for his outstanding work during […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Nizhe DeSoul hospitalised",
            "url": "https://www.chronicle.co.zw/nizhe-desoul-hospitalised/",
            "content": "Mbulelo Mpofu\n\nZimpapers Arts and Entertainment Hub\n\nZIMBABWEAN Afro-tech and Amapiano artiste, Nizhe DeSoul, has been hospitalised and is undergoing treatment after being involved in a tragic motor vehicle accident in South Africa.\n\nAccording to his team, the accident which happened on March 15 caused severe, potentially life-threatening injuries that require extensive medical care.\n\nIn a statement, his management said his road to recovery will be long and arduous.We regret to inform you of the unfortunate event that Nizhe DeSoul was involved in a tragic motor vehicle accident. The accident caused severe, potentially life-threatening injuries that require extensive medical care and Nizhe DeSoul is currently undergoing medical treatment and will need substantial recovery time, read part of the press statement.\n\nAs the Minister of Monate, Nizhe DeSoul has been a prominent figure in the music industry, known for his Nizhe DeSoul and Friends outing, a platform that brings music lovers together for a fun-filled day and night.\n\nHis management has confirmed that due to the severity of his injuries, he wont be able to fulfil his bookings and events.\n\nThe press statement didnt, however specify how long Nizhe DeSoul may be hospitalised for, but it has cleared any doubts on why he has been leading a low profile lately.\n\nNizhe DeSouls contributions to the music industry have been significant, with a range of talented artists having performed at his Nizhe DeSoul and Friends events, including but not limited to Diliza, Kotwane Hikwa, and Bryce DJ Klasiq.\n\nHis dedication to his craft has earned him a reputation as a music lecturer, sound engineer, and producer.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/kijljk.jpg",
            "description": "Mbulelo Mpofu Zimpapers Arts and Entertainment Hub ZIMBABWEAN Afro-tech and Amapiano artiste, Nizhe DeSoul, has been hospitalised and is undergoing treatment after being involved in a tragic motor vehicle accident in South Africa. According to his team, the accident which happened on March 15 caused severe, potentially life-threatening injuries that require extensive medical care. In […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Gamecocks duck extends",
            "url": "https://www.chronicle.co.zw/gamecocks-dark-extends22/",
            "content": "Fungai Muderere at Luveve Stadium\n\nChicken Inn.0Herentals.0THE Chicken Inn 2025 Castle Lager Premier Soccer League (PSL) season dark countinued after they were held to a nil all draw by visitors Herentals on Saturday.\n\nIt was Gamecocks fourth draw in five outings.The Joey Antipas mentored side is yet to post a win.\n\nHaving found the target once, the Simbisa Brands sponsored outfit have played four draws and lost once.In their game against Herentals, Gamecocks failed to convert numerous chances that came their way with the Students, on the other hand, asking numerous questions from the hosts defence .\n\nBrian Muza, George Majika and Michael Charamba took turns not to convert for Gamecocks while Herentals had Tinotenda Benza was the chief culprit for Herentals.The introduction of Brighton Makopa for ineffective Tinashe Mushaireni in 46th minute and a double substitution that saw Brandon Rendo and Edward Musena come in for Muza and Charamba respectively could not yeild anything for Chicken Inn.\n\nIn the 68th minute,Benza, who was Herentals captain of the day watched in disbelief when his close range effort was saved by an alert Donovan Bernard before Mpumelelo Bhebhe came to clear the ball for a corner.In the 75th minute, Gamecocks skipper Xolani Ndlovu had his well taken free kick punched for a corner by Herentals goalminder Tinotendaishe Takarinda.A minute later, Ralph Kawondera came to the rescue of the Students after he cleared Muza header from the line with the visitors in sixes and sevens at the back.\n\nIn their next match, Chicken Inn will face Dynamos in Harare while Herentals entertain newboys MWOS at Wadzanayi Stadium.Teams\n\nChicken InnD Bernard , A Chinda, M Bhebhe, J Tulani, X Ndlovu, D Jaricha, I Mabhunu, M Charamba, (Musena 85 mins) G Majika, T Mushaireni, B Muza (Rendo 85 mins),HerentalsT Tinotendaishe, W Chimbetu T Mupumha, L Dreamer (Zhuwawu 69th min), R Kawondera, T Benza, B Majaririra, K Sangare, T Chisi, I Benza, Z Ruguchu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-05-at-17.20.33-680x380.jpeg",
            "description": "Fungai Muderere at Luveve Stadium Chicken Inn….0 Herentals…….0 THE Chicken Inn 2025 Castle Lager Premier Soccer League (PSL) season dark countinued after they were held to a nil all draw by visitors Herentals on Saturday. It was Gamecocks’ fourth draw in five outings. The Joey Antipas mentored side is yet to post a win. Having […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Bulawayo Shutdown Show to go ahead…As Queens Sports Club rebuffs ZC’s objections",
            "url": "https://www.chronicle.co.zw/bulawayo-shutdown-show-to-go-ahead-as-queens-sports-club-rebuffs-zcs-objections/",
            "content": "Vusumuzi Dube, Deputy Radar Editor\n\nTHE proprietors of Queens Sports Grounds- the Queens Sports Club- have revealed that the hosting of the Bulawayo Shutdown Show is above board and is as per the lease agreement with Zimbabwe Cricket.\n\nThis comes after a statement from ZC distancing itself from the upcoming 9th Annual Pacific Bulawayo Shutdown Show, set for Saturday, 26 April 2025.\n\nIn a press statement released on Saturday, the Queens Sports Club board of management said under the current lease agreement with ZC, the club retains the right to host social events and activities at the venue in addition to accommodating cricket matches.\n\nThey further revealed that the lease agreement with ZC is set to expire in December.\n\nWe note with concern that this public communication was released without prior formal engagement at the Board Level, as has been the case before about the issue between ZC- as our tenant- and the Club, as the landlord. This has unfortunately created unnecessary public confusion and tension.\n\nWe wish to reassure all stakeholders that longstanding issues relating to this event have been adequately addressed over the years. Robust safeguards have been put in place to ensure smooth and responsible hosting. Ironically, ZC itself has previously hosted similar entertainment events- without the Clubs prior consent and, in certain cases, without remitting payment, said the board.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Byoshutdown.jpg",
            "description": "Vusumuzi Dube, Deputy Radar Editor  THE proprietors of Queens Sports Grounds- the Queens Sports Club- have revealed that the hosting of the Bulawayo Shutdown Show is above board and is as per the lease agreement with Zimbabwe Cricket. This comes after a statement from ZC distancing itself from the upcoming 9th Annual Pacific Bulawayo Shutdown […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Chicken Inn, Herentals tied nil all at halftime",
            "url": "https://www.chronicle.co.zw/chicken-inn-herentals-tied-nil-all-at-halftime/",
            "content": "Fungai Muderere at Luveve Stadium\n\nCHICKEN Inn and Herentals are tied nil all at halftime in a Castle Lager Premier Soccer League match that is being played at Luveve Stadium in Bulawayo.Gamecocks have been dominating the exchanges in the first stanza.\n\nIn the 24th minute, Chicken Inns Brian Muzas close range effort missed the target by a whisker.Muza had got on the end of a George Majika feed.\n\nTwo minutes later, the Students watched in disbelief when Tinotenda Benzas long range effort went over the bar.In the 35th minute, Chicken Inn had a penalty appeal turned down after Muza appeared to have brought down by Herentals defender Tinanshe Mupumha.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-05-at-15.55.15-680x380.jpeg",
            "description": "Fungai Muderere at Luveve Stadium CHICKEN Inn and Herentals are tied nil all at halftime in a Castle Lager Premier Soccer League match that is being played at Luveve Stadium in Bulawayo. Gamecocks have been dominating the exchanges in the first stanza. In the 24th minute, Chicken Inn’s Brian Muza’s close range effort missed the […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Gamecocks date Herentals College",
            "url": "https://www.chronicle.co.zw/gamecocks-date-herentals-college/",
            "content": "Fungai MuderereCHICKEN Inn and Herentals College are this afternoon set square it off at Luveve Stadium in of the Castle Lager Premier Soccer League (PSL) Week Five matches.The Gamecocks have endured a torrid start to the 2025 Premier Soccer League (PSL) season, failing to secure a single victory in their opening four matches.Coming off a narrow 1-0 defeat to ZPC Kariba, Chicken Inn themselves on number 16 on the log with just three points. Their upcoming clash against the unpredictable Students marks their 11th meeting since 2019, with Herentals often proving to be a difficult opponent.\n\nPSL results between Chicken Inn and Herentals since 2019:23/11/24: Herentals 0  0 Chicken Inn30/06/24: Chicken Inn 0-0 Herentals04/10/23: Herentals 1-1 Chicken Inn06/05/23: Chicken Inn 2-1 Herentals21/10/22: Herentals 0-0 Chicken Inn07/05/22: Chicken Inn 0-0 Herentals11/12/19: Herentals 0-2 Chicken Inn\n\nWill Chicken Inn finally shake off their early-season struggles and register their first win, or will Herentals continue to haunt them?It all needs a tactical discipline from both ends.Team Line UpsChicken InnD Bernard , A Chinda, M Bhebhe, J Tulani, X Ndlovu, D Jaricha, I Mabhunu, M Charamba, G Majika, T Mushaireni, B MuzaHerentalsT Tinotendaishe, W Chimbetu T Mupumha, L Dreamer, R Kawondera, T Benza, B Majaririra, K Sangare, T Chisi, I Benza, Z Ruguchu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/poty.jpg",
            "description": "Fungai Muderere CHICKEN Inn and Herentals College are this afternoon set square it off at Luveve Stadium in of the Castle Lager Premier Soccer League (PSL) Week Five matches. The Gamecocks have endured a torrid start to the 2025 Premier Soccer League (PSL) season, failing to secure a single victory in their opening four matches. […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Catch them young: Entumbane ECD Centre celebrates World Theatre Day",
            "url": "https://www.chronicle.co.zw/catch-them-young-entumbane-ecd-centre-celebrates-world-theatre-day/",
            "content": "Faith Ndlovu-Youth Interactive Correspondent\n\nEntumbane Early Childhood Development (ECD) Centre in Bulawayo, recently joined the global community in celebrating World Theatre Day, commemorated on March 21.\n\nThe belated event, hosted by Shaba Arts and Assitej Zimbabwe  a national association promoting theatre for children and young people  aimed to instil a love for theatre and the performing arts in young learners under the theme Take a Child to the Theatre.\n\nWorld Theatre Day is a global event that highlights the importance of theatre in fostering cultural appreciation and bringing people together.\n\nThe day, celebrated annually on March 27th, is a global celebration initiated by the International Theatre Institute (ITI) to honor and promote the art of theatre, its importance, and its role in fostering cultural understanding and peace.\n\nThe event featured vibrant performances and cultural activities, all designed to encourage creativity and artistic expression. Renowned cultural expert Ellen Mlangeni, who is the director of Thandanani Womens Ensemble led engaging sessions, teaching children poetry, storytelling, and traditional dances.\n\nThe celebration was a resounding success, offering young learners a magical introduction to the world of theatre.\n\nTopasi Ndlovu, director of Shaba Arts, stressed the importance of nurturing young minds to preserve culture and heritage.\n\nWere happy to commemorate this day in schools, especially with youngsters, as it makes it easier for them to learn heritage studies, Ndlovu said.\n\nHe highlighted the significance of introducing theatre to young children, explaining that the approach was tailored to their level.\n\nWe decided to focus on basic activities rather than core theatre elements since theyre still young. This makes it easier for them to understand and relate, he noted.\n\nNdlovu also stressed the power of theatre in engaging young minds.\n\nTheatre has a unique way of captivating children.\n\nIts essential to tap into their creativity and imagination from an early age, he said.\n\nFollowing the success of the initiative, Ndlovu expressed a desire to expand it to more schools.\n\nThis was a success, and we hope to visit more schools, teaching both young and older children to help preserve our culture.\n\nChildren can pass it down to the next generation. Growing up, we had no television and relied on theatre, so it remains a vital tool for storytelling and cultural preservation.\n\nMiss Sibanda, the ECDs headmistress, thanked the city council for supporting the initiative.\n\nIt shows they havent neglected the younger generation.\n\nYou can see the joy on the childrens faces  thats what makes it all worthwhile. Through experiences like these, they are nurtured into theatre and grow with the values they learn, she said.\n\nAs the global community marked World Theatre Day, Entumbane ECDs children walked away inspired, their imaginations ignited by the power of storytelling and performance.\n\nThe initiative was also aligned with the new curriculum, specifically under Heritage Studies.\n\nSource: The Herald\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Thandanani-Women’s-Ensemble-680x380.jpg",
            "description": "Faith Ndlovu-Youth Interactive Correspondent Entumbane Early Childhood Development (ECD) Centre in Bulawayo, recently joined the global community in celebrating World Theatre Day, commemorated on March 21. The belated event, hosted by Shaba Arts and Assitej Zimbabwe — a national association promoting theatre for children and young people — aimed to instil a love for theatre […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Imiklomela kaDakamela 2nd day kicks off",
            "url": "https://www.chronicle.co.zw/imiklomela-kadakamela-2nd-day-kicks-off/",
            "content": "Zimpapers Reporter\n\nFestivities have kicked off on the second day of the Imiklomelo KaDakamela awards, with the arrival of Chief Dakamela alongside other traditional leaders and guests from outside the country.The second day will see high achievers from around the country and beyond honoured for their work and deeds with gongs.\n\nNotable royalties who are part of the event so far are Chiefs: Menyezwa, Bhidi, Fuyana, Matema, Ndebele Kingdoms Princess Agnes Nomngoma Mabhena, among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-05-at-11.26.26-680x380.jpeg",
            "description": "Zimpapers Reporter Festivities have kicked off on the second day of the Imiklomelo KaDakamela awards, with the arrival of Chief Dakamela alongside other traditional leaders and guests from outside the country. The second day will see high achievers from around the country and beyond honoured for their work and deeds with gongs.   Notable royalties […]",
            "time": "20:25",
            "date": "06 Apr 2025"
        },
        {
            "title": "Cop killers arrive in court",
            "url": "https://www.chronicle.co.zw/cop-killers-arrive-in-court22/",
            "content": "Peter Matika,[emailprotected]Three suspects arrested earlier this week in connection with the fatal shooting of a police officer in Tshabalala suburb, Bulawayo have arrived at the Western Commonage courts for remand.\n\nThe suspects are also linked to a series of armed robberies and were apprehended following police investigations.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/pololo.jpg",
            "description": "Peter Matika,Peter.matika@chronicle.co.zw Three suspects arrested earlier this week in connection with the fatal shooting of a police officer in Tshabalala suburb, Bulawayo have arrived at the Western Commonage courts for remand.     The suspects are also linked to a series of armed robberies and were apprehended following police investigations. More to follow…    ",
            "time": "20:25",
            "date": "06 Apr 2025"
        }
    ]
}