{
    "news": [
        {
            "title": "Mission 300 Energy Summit to Gather Africa’s leaders and partners to transform energy sector",
            "url": "https://www.chronicle.co.zw/mission-300-energy-summit-to-gather-africas-leaders-and-partners-to-transform-energy-sector/",
            "content": "AFRICAN heads of state, business leaders, and development partners will converge tomorrow in Dar es Salaam, Tanzania, for the Mission 300 Africa Energy Summit where they will commit to ambitious reforms and actions to expand access to reliable, affordable, and sustainable electricity to 300 million people in Africa by 2030.Mission 300 is an unprecedented collaboration between the African Development Bank, the World Bank Group, and global partners to address Africas electricity access gap using new technology and innovative financing. Nearly 600 million Africans lack electricity, which is crucial for development and job creation.Several heads of state and government from Africa will join more than 1,000 other participantswith strong representation from the private sectorat the January 27-28 summit. Together, they will chart Africas course toward universal access to energy.This weeks summit is expected to yield two significant outcomes: the Dar es Salaam Energy Declaration, outlining commitments and practical actions from African governments to reform the energy sector, and the first set of National Energy Compacts, which will serve as blueprints with country-specific targets and timelines for implementation of critical reforms.In the first phase, 12 countries will present their energy compacts: Chad, Cte dIvoire, the Democratic Republic of Congo, Liberia, Madagascar, Malawi, Mauritania, Niger, Nigeria, Senegal, Tanzania, and Zambia. Other African countries are expected to develop their compacts in subsequent phases.The partnerships forged and commitments made by the continents leaders and changemakers gathering in Dar es Salaam this week will shape the continents journey toward achieving universal energy access, transforming millions of lives, and driving sustainable development and job creation.-World Bank News\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/T6U73.jpg",
            "description": "AFRICAN heads of state, business leaders, and development partners will converge tomorrow in Dar es Salaam, Tanzania, for the Mission 300 Africa Energy Summit where they will commit to ambitious reforms and actions to expand access to reliable, affordable, and sustainable electricity to 300 million people in Africa by 2030. Mission 300 is an unprecedented […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Mhlophe announces Bosso 90 name change",
            "url": "https://www.chronicle.co.zw/mhlophe-announces-bosso-90-name-change/",
            "content": "Innocent Kurira,[emailprotected]HIGHLANDERS chairman Kenneth Mhlophe has informed club members that the development side, Bosso 90, will be rebranded as Bosso 99 in preparation for the clubs 100th anniversary celebrations next year.Mhlophe explained: Our club will celebrate 100 years of existence in 2026. This is a significant milestone, and we are all privileged to be part of both the club and the upcoming celebrations. Amhlophe to all. The celebrations will begin in earnest this year, with a series of events kicking off this very season. Bosso 90 will transition to Bosso 99, and as an institution, the club will engage with its members as various subcommittees for the celebrations are formed.Founded in 1926, Highlanders is the countrys oldest football club. Over the years, the club has evolved into one of Zimbabwes two biggest football institutions, boasting a massive following both domestically and internationally, particularly among the nations diaspora.On the field, the Bulawayo giants have enjoyed significant success, winning numerous league titles and cup competitions, while producing some of the countrys finest football talent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Kenneth-Mhlophe-1.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS chairman Kenneth Mhlophe has informed club members that the development side, Bosso 90, will be rebranded as Bosso 99 in preparation for the club’s 100th anniversary celebrations next year. Mhlophe explained: “Our club will celebrate 100 years of existence in 2026. This is a significant milestone, and we are all privileged […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Man crushed by truck while working under it",
            "url": "https://www.chronicle.co.zw/man-crushed-by-truck-while-working-under-it/",
            "content": "Sinokubonga Nkala[emailprotected]A Bulawayo man died after a hydraulic wheel jack slipped while he was working under a truck, which then fell and crushed him.The fatal accident occurred on 24 January at around 3:20 PM in Bulawayos Belmont West when the hydraulic jack slipped while Proud Mashava was working underneath the truck.Coworkers swiftly responded to the accident, using a 15-ton forklift to raise the truck and carefully remove the victims body from beneath.The police were notified, and upon arriving at the scene, they discovered the victims body lying on the ground with blood coming from his mouth and nose. In an official press statement, the Acting Police Spokesperson, Assistant Inspector Nomalanga Msebele, said: The body was then ferried to the hospital for a post-mortem.We advise members of the public, especially those who use heavy machinery at work, to be careful and ensure that the machines they are using are positioned properly and well serviced to avoid such incidents, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/POLICE-680x380.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com A Bulawayo man died after a hydraulic wheel jack slipped while he was working under a truck, which then fell and crushed him. The fatal accident occurred on 24 January at around 3:20 PM in Bulawayo’s Belmont West when the hydraulic jack slipped while Proud Mashava was working underneath the truck. Coworkers […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Bosso mining project far from taking off",
            "url": "https://www.chronicle.co.zw/bosso-mining-project-far-from-taking-off/",
            "content": "Innocent Kurira,[emailprotected]\n\nHighlanders chairman Kenneth Mhlophe has revealed that the clubs mining project is struggling to take off, despite the potential it has to transform the teams financial fortunes.\n\nAddressing club members at the clubs Annual General Meeting on Sunday, Mhlophe appealed to members to come up with ideas on how the mining project can get off the ground.\n\nIt has become very evident that the club does not have the financial resources to execute the mining project. This situation calls for a lot of deep thinking on the best way forward. In the absence of any windfall to the club, the only alternative is to partner with those who have the financial muscle and expertise to run the project. In this way, the club can gain something from the project rather than allow the current situation to continue. As I mentioned above, I exhort the generality of the Highlanders membership to come up with suggestions that can ensure this project kicks off, said Mhlophe.\n\nThe mining claim was awarded by President Mnangagwa in 2020 as part of an effort to empower the club to expand its revenue streams. This was when the club was approaching its 95th year of existence in 2021.\n\nShould the project take off and yield positive results, it is hoped that Highlanders will be able to compete on equal terms with wealthier clubs such as FC Platinum, Manica Diamonds, Chicken Inn, and Ngezi Platinum.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/images.png",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw Highlanders chairman Kenneth Mhlophe has revealed that the club’s mining project is struggling to take off, despite the potential it has to transform the team’s financial fortunes. Addressing club members at the club’s Annual General Meeting on Sunday, Mhlophe appealed to members to come up with ideas on how the mining project can […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Honda fit driver ploughs into 11 people, killing one",
            "url": "https://www.chronicle.co.zw/honda-fit-driver-ploughs-into-11-people-killing-one/",
            "content": "Sikhumbuzo Moyo[emailprotected]A Honda Fit driver lost control of his vehicle and ploughed into 11 members of the Johanne Masowe Church who were returning from night prayers in Nketa, Bulawayo this morning.One of the victims died on the spot after being trapped underneath the vehicle and had to be extricated by members of the Bulawayo Fire Brigade, who arrived at the scene shortly after the tragic incident near Chicken Corner leisure outlet, between Nketa Drive and Masiyephambili Drive.Upon arrival, the Brigade found 11 people lying on the ground, some with fractures, spine injuries, and lacerations. A Honda Fit was found in a ditch with one person trapped underneath, who was suspected to be dead on arrival. The Brigade extricated the trapped victim and conveyed the injured individuals to Mpilo Hospital, said Bulawayo Chief Fire Officer Mr Mhlangano Moyo.He said that preliminary details indicated that the driver had lost control of the vehicle.The information we gathered is that the Honda Fit driver lost control and ploughed into a group of Johanne Masowe Church members who were returning from night prayers. The deceased was handed over to ZRP details. The vehicle and the roadway were rendered safe by the Brigade, said Mr Moyo.Ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/y5yuh.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw A Honda Fit driver lost control of his vehicle and ploughed into 11 members of the Johanne Masowe Church who were returning from night prayers in Nketa, Bulawayo this morning. One of the victims died on the spot after being trapped underneath the vehicle and had to be extricated by members of […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Myles Lewis-Skelly red card: Mikel Arteta ‘fuming’ with Michael Oliver decision",
            "url": "https://www.chronicle.co.zw/myles-lewis-skelly-red-card-mikel-arteta-fuming-with-michael-oliver-decision/",
            "content": "The decision left Mikel Arteta fuming, pundits were baffled, while Arsenal fans were furious.\n\nThe Gunners may have beaten struggling Wolves 1-0 to maintain their Premier League title hopes  but it was Myles Lewis-Skellys controversial red card that stole the headlines.\n\nIn the 43rd minute Lewis-Skelly caught Wolves Matt Doherty above the ankle to break up a counter-attack on the edge of Wolves box  about 70 yards away from Arsenals goal.\n\nReferee Michael Oliver showed the 18-year-old a straight red card, a decision which was upheld by the video assistant referee (VAR).\n\nAfter the match, Arsenal manager Arteta told BBC Match of the Day the decision was so obvious that today you dont need my words.\n\nI am absolutely fuming but I leave it with you, he said to Sky Sports.\n\nBecause it is that obvious, I dont think my words are going to help.\n\nArsenal rallied against Wolves, who themselves went down to 10 after Joao Gomes second yellow, and the Gunners celebrated a 74th-minute Riccardo Calafiori winner to stay within six points of leaders Liverpool.\n\nAt an Arsenal corner, Wolves cleared their lines and looking to start a counter-attack, Doherty took the ball from the edge of the penalty area and drove forward.\n\nLewis-Skelly caught Dohertys shin and then foot, bringing the defender down, a challenge which the Premier League Match Centre described on X as serious foul play.\n\nOliver quickly showed a red card, and VAR checked the call, deciding against sending the referee to the pitchside monitor.\n\nOn the Premier Leagues website it says high, full and forceful contact on the ankle or above is considered dangerous and a red card.\n\nThe divisions record goalscorer, Alan Shearer, said the sending off was one of the worst decisions Ive seen in a long time.\n\nAs a referee you can get it wrong on the pitch, you might see something which is incorrect, he told BBC Radio 5 Live.\n\nHow on earth Darren England, the VAR, thinks that the referee has got that right and there is no need to send him to the screen.\n\nShearer added on BBC Match of the Day: It should have been a yellow card, it is a terrible decision. There was no speed, no intensity, it was not endangering an opponent and was 90 yards from goal, so never, ever a red card.\n\nWhat worries me is there is an assistant VAR and a VAR who have seen several replays and they think it is serious foul play.\n\nAsked if Arsenal will appeal against the decision, Arteta told Sky Sports: Thats for the club to decide what the best decision is. I think its that obvious, maybe we dont even need to.\n\nUnless overturned, the Arsenal academy graduate will face a three-match ban, missing his sides matches with Manchester City and Leicester City in the Premier League, and Newcastle United in the Carabao Cup semi-final.\n\nArsenal substitute Calafiori told Sky Sports that Lewis-Skelly was disappointed for the team and that from the bench, it was clearly not a red card.\n\nAt 18 years and 121 days, Lewis-Skelly became the third youngest player to be sent off in the Premier League, behind Wayne Rooney and Michael Owen.\n\nFormer Premier League referee Mike Dean on Sky Sports: When you see a still image you understand what he has done. He has put his studs down his leg for serious foul play. Scraped down the Achilles.\n\nFormer Chelsea and Scotland winger Pat Nevin: Myles Lewis-Skelly is only 10 yards outside the oppositions box. It must be for violent conduct, but that doesnt look like violent conduct. Its a cynical trip. I have never seen that in my life. I am stunned by a red card.\n\nFormer Manchester City centre-back Nedum Onuoha: Its not definitely a red card for me. I can see now with more replays why it is the right thing to do. Maybe the referee sees that Myles Lewis-Skelly has no intent to play the ball. Its a tough moment for Arsenal. For the youngster, I think he needs to understand there are different ways to do that.\n\nThats not a red, that will get overturned very quickly. He tries to stop the counter-attack and it doesnt look very bad to me.\n\nBBC Radio 5 Live presenter Mark Chapman: Baffling and nonsensical\n\nFormer Blackburn and Tottenham midfielder Tim Sherwood on Sky Sports: I am still reeling from that. I cant believe he has sent him off.\n\nJim: Its not controversial sending Myles Lewis-Skelly off, he didnt even try to play the ball.\n\nPaul: Good decision. Absolutely fed up with players getting away with deliberately hacking players down with no attempt to get the ball.\n\nTim: Fans and managers need to come together and strike in terms of voicing all our frustrations on the quality of referees. Im not an Arsenal fan but thats NEVER a red card. If thats a foul every tackle is a red!\n\nTocowa: Seen worse tackles not even yellow-carded.\n\nSimon, Colchester: The narrative that it was above the ankle so its a red is utter, utter nonsense. There are multiple fouls EVERY game above the ankle that arent even given as yellows, let alone a red.\n\nFor Arsenal, Lewis-Skellys dismissal was their fourth in the Premier League this season, one more than any other side.\n\nIt is not the first time the Gunners have been left aggrieved following a red card.\n\nWhen Leandro Trossardwas given a second yellow for time-wastingagainst Manchester City in September, Arteta again said the decision was so obvious he would leave it up to the media to decide.\n\nThis season Arteta has also criticised decisions to send off Declan Rice at home to Brighton and a penalty call against William Salibaaway to the Seagulls.\n\nSource: BBC\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/LOY78.jpg",
            "description": "The decision left Mikel Arteta “fuming”, pundits were baffled, while Arsenal fans were furious. The Gunners may have beaten struggling Wolves 1-0 to maintain their Premier League title hopes – but it was Myles Lewis-Skelly’s controversial red card that stole the headlines. In the 43rd minute Lewis-Skelly caught Wolves’ Matt Doherty above the ankle to […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Keys stuns Sabalenka in thriller to win Australian Open",
            "url": "https://www.chronicle.co.zw/keys-stuns-sabalenka-in-thriller-to-win-australian-open/",
            "content": "UNDERDOG Madison Keys upset Aryna Sabalenka 6-3, 2-6, 7-5 in the Australian Open final on Saturday to win her first Grand Slam crown at the age of 29.The American ended world number one Sabalenkas dream of becoming the first woman for 26 years to win a third successive Melbourne Park singles title.For 19th-seeded Keys it was the culmination of a 15-year journey from teenage prodigy to major winner.I have wanted this for so long and I have been in one other Grand Slam final and it did not go my way, said an emotional Keys, whose coach Bjorn Fratangelo is also her husband.I didnt know if I was ever going to get back to this position to try to win a trophy again.The American had been tipped as a future world number one after winning her maiden WTA Tour match at the age of 14.She made her first major semi-final at Melbourne Park 10 years ago as a 19-year-old, but a decade on she can finally call herself a Grand Slam champion.I made my very first Grand Slam semi-final here in Melbourne, said Keys, the runner-up at the US Open in 2017.So to now have won my first Grand Slam in the same place means the absolute world to me.My team believed in me every step of the way. So thank you so much, added Keys, who will now equal her career-high seventh in the world ranking she attained nine years ago.They believed in me when I didnt believe in myself, and helped me every step of the way. Last year was so tough, with some really bad injuries, I didnt know if I was gonna be able to do it again.What a tournamentKeys becomes the fourth oldest first-time winner of a major since the Open Era began in 1968.Sabalenka was gracious after a first Melbourne defeat since 2022.First of all, Madison, what a tournament. You have been fighting really hard to get this trophy, Sabalenka said.I really feel like its home when Im here and Ill come back stronger and do my best next year.It was Keys who came out of the blocks playing exemplary tennis to put Sabalenka under pressure and race to the first set in 35 minutes on Rod Laver Arena.The Belarusian began to flip the script in the second set, breaking in the third game and moving ominously ahead 3-1.Another break followed on a brilliant Sabalenka cross-court pass and she levelled the match after an hour and 20 minutes on court.The 26-year-old Sabalenka by now was timing the ball much better and a younger Keys might have buckled.But this mature version of Keys, who battled all the way to beat Iga Swiatek in a 10-point final-set tiebreak in the semi-finals, is made of sterner stuff.At 5-6 when Sabalenka served to take it to another final-set tiebreak, Keys brought up two match points.She held her nerve to secure the long-awaited title on the second with her 29th winner after 2 hours and 2 minutes. Bangkok Post\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/45t3.jpg",
            "description": "UNDERDOG Madison Keys upset Aryna Sabalenka 6-3, 2-6, 7-5 in the Australian Open final on Saturday to win her first Grand Slam crown at the age of 29. The American ended world number one Sabalenka’s dream of becoming the first woman for 26 years to win a third successive Melbourne Park singles title. For 19th-seeded […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "City recover after Khusanov blunder",
            "url": "https://www.chronicle.co.zw/city-recover-after-khusanov-blunder/",
            "content": "ERLING Haaland was on target in the second half as Manchester City turned things around against Chelsea at the Etihad Stadium.Haaland and Phil Foden spared the blushes of new team-mate Abdukodir Khusanov as Manchester City came from behind to beat Chelsea 3-1 at the Etihad Stadium.Uzbekistan defender Khusanov had been brought in this week from Lens on a 33.6million deal  but made a nightmare start in the Premier League with an error which led to an early Chelsea goal and then also a booking inside the opening four minutes.Noni Madueke took full advantage of the mistake to put the visitors ahead, after Khusanov had missed a bouncing ball and then completely fluffed an attempted back-header to Ederson.Josko Gvardiol equalised before the break and Haaland then swept City ahead after lobbing Chelsea goalkeeper Robert Sanchez before Foden put the result beyond doubt with a late third.The win sees Pep Guardiolas side move back above Chelsea into the top four  and raised spirits after their midweek capitulation at Paris St Germain.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/T6W.jpg",
            "description": "ERLING Haaland was on target in the second half as Manchester City turned things around against Chelsea at the Etihad Stadium. Haaland and Phil Foden spared the blushes of new team-mate Abdukodir Khusanov as Manchester City came from behind to beat Chelsea 3-1 at the Etihad Stadium. Uzbekistan defender Khusanov had been brought in this […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Watch:Gwanda South and Gwanda Tshitaudze clash in KCD Mohadi soccer and netball finals",
            "url": "https://www.chronicle.co.zw/watchgwanda-south-and-gwanda-tshitaudze-clash-in-kcd-mohadi-soccer-and-netball-finals/",
            "content": "Sukukwenkosi Dube-Matutu,[emailprotected]\n\nGWANDA South and Gwanda Tshitaudze Constituencies are set to battle it out in the KCD Mohadi soccer and netball finals, which are scheduled for today.\n\nThe tournament, which began yesterday, saw teams from all 12 constituencies in Matabeleland South compete in both netball and soccer disciplines.\n\nThe finals, being held at Pelandaba Stadium in Gwanda, will be graced by Vice President Mohadi.\n\nA brainchild of the Zanu PF Matabeleland South Provincial Youth League, the tournament celebrates the revolutionary who has dedicated his life to defending the sovereignty of his country.\n\nSome of the trophies that will be presented to winners\n\nThe third-place play-offs were held this morning, with Beitbridge Wests soccer team defeating Mangwe Constituency to secure third place.\n\nIn the netball competition, Umzingwane District triumphed over Insiza South to claim third place.\n\nThe tournament, which will become an annual event, aims to play a crucial role in combating the scourge of drug and substance abuse.\n\nThe tournament also seeks to honour Vice President Mohadi for his early involvement in the liberation struggle, during which he lost part of his youth while incarcerated for taking a stand against the colonial regime. It also recognises his post-independence contributions, where he held various influential positions before eventually becoming the Vice President of the country.\n\nVP Mohadi arrives at Phelandaba Stadium for the KCD Mohadi netball and soccer tournament finals. Gwanda South and Gwanda Tshitaudze Constituency netball and soccer teams are set to battle it out for the finals\n\nThe tournament will mark the beginning of sporting activities that the youth will engage in throughout the year, in preparation for the next tournament. Legislators in the province will be expected to organise inter-district competitions to ensure the tournaments sustainability.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/EGT.jpg",
            "description": "Sukukwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw GWANDA South and Gwanda Tshitaudze Constituencies are set to battle it out in the KCD Mohadi soccer and netball finals, which are scheduled for today. The tournament, which began yesterday, saw teams from all 12 constituencies in Matabeleland South compete in both netball and soccer disciplines. The finals, being held at Pelandaba […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Tsholotsho duo up for murder",
            "url": "https://www.chronicle.co.zw/tsholotsho-duo-up-for-murder/",
            "content": "Leonard Ncube[emailprotected]TWO men from Tsholotsho have been arrested for murder after they allegedly fatally assaulted a stranger they suspected to be a thief.Police spokesperson for Matabeleland North Inspector Glory Banda confirmed the arrest of Anele Sibanda (28) and Josphat Ncube (26), both of Jahe Line in Chief Magama area, Tsholotsho.They are accused of causing the death of Meluleki Ziga (38) from Seafield Village in Nyamndlovu.Ziga died on Friday morning after the assault with switches and logs a few hours earlier.Circumstances are that on Thursday around 2am Sibanda and Ncube met Ziga at Jahe Business Centre and asked him to identify himself which he did.Sibanda offered Ziga a place to sleep saying it was late for him to go and asked him to go with him to his place of residence.However, along the way the two accused allegedly started assaulting him with switches and logs accusing him of being a thief.Ziga fell on the ground and became unconscious after which the two fled from the scene leaving him lying for dead.The now deceased sustained a deep cut on the back of the head, a cut on the right cheek, swollen mouth and eyes.He was seen in the morning by a passerby who alerted other villagers and a report was to police.Ziga was rushed to Tsholotsho District Hospital where he was admitted before his condition deteriorated.He eventually died due to the injuries.Sibanda and Ncube were then arrested and Insp Banda said they are assisting police with investigations pending appearance in court for murder.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Arrested-3.jpg",
            "description": "Leonard Ncube leonard.ncube@chronicle.co.zw TWO men from Tsholotsho have been arrested for murder after they allegedly fatally assaulted a stranger they suspected to be a thief. Police spokesperson for Matabeleland North Inspector Glory Banda confirmed the arrest of Anele Sibanda (28) and Josphat Ncube (26), both of Jahe Line in Chief Magama area, Tsholotsho. They are […]",
            "time": "20:36",
            "date": "26 Jan 2025"
        }
    ]
}