{
    "news": [
        {
            "title": "Magaya breaks silence, backs Magwizi",
            "url": "https://www.chronicle.co.zw/magaya-breaks-silence-backs-magwizi/",
            "content": "Online ReporterYADAH Stars president Prophet Walter Magaya has broken his silence on the ZIFA elections scheduled for Rainbow Towers in Harare on Saturday and also threw his weight behind Nqobile Magwizis candidature.Speaking for the first time since losing his High Court bid to stop the Magaya, also pledged to continue supporting the development of football, when he addressed 73 of the 78 ZIFA councillors at his Yadah Complex on Friday night.Magaya invited members of the ZIFA Assembly at his complex and during his address he backed Magwizi for the ZIFA presidency.He revealed that he has been assessing the candidates who are left on the ballot paper and also met several high-profile personalities since Thursday when he lost the High Court case.Candidates approached me, telling me their plans and narratives and out of them there was no one better than Magwizi, Magaya said.The clergyman also revealed that he had withdrawn his appeal with the Court of Arbitration for Sport (CAS).I have been receiving calls and meeting a number of people.They have been asking me now that you have been disqualified who would you back from the remaining contestants.I was honest and told them none qualified.But after a thorough assessment of the candidates there is one candidate who stood out, Magaya said.Magaya also said he had sought clarity on the future of the councillors amid unsubstantiated rumours that the ZIFA Congress was to be dissolved after the elections.\n\nWalter Magaya\n\nI told some of the people whom I met that they should promise me that the councillors who are not PSL board of governors will not be removed and they promised me.I also asked them not to forget womens football and they promised me.So, I am standing in front of you today to alert you that I am endorsing that candidate, Magaya said.He emphasized his passion for football saying no amount of money would take away his passion for the game.I will not stop my drive towards football developmentWe had plans for all sectors, we had plans for womens football,We will continue building stadiums, if you give Gwanzura I will do it, if you give me Chibuku, I will do it, said Magaya.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fxgxxx.jpg",
            "description": "Online Reporter YADAH Stars president Prophet Walter Magaya has broken his silence on the ZIFA elections scheduled for Rainbow Towers in Harare on Saturday and also threw his weight behind Nqobile Magwizi’s candidature. Speaking for the first time since losing his High Court bid to stop the Magaya, also pledged to continue supporting the development […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Kombi driver arrested for evading police arrest",
            "url": "https://www.chronicle.co.zw/kombi-driver-arrested-for-evading-police-arrest/",
            "content": "Online Reporter\n\nA 29-year-old commuter omnibus driver has been arrested after fleeing from the police manning a roadblock along Seke Road.\n\nThe roadblock had been mounted to arrest the driver after a video of him driving his commuter omnibus on a pavement along Julius Nyerere Way, opposite OK Zimbabwe Supermarket in Harares central business district, circulated on social media.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the development.\n\nThe Zimbabwe Republic Police confirms the arrest of Nikisi Kudzanai Peter aged 29, the driver of a Toyota Hiace kombi, registration number AGL 1316, who was recently captured on a video driving on the pavement along Julius Nyerere Way.\n\nOn January 18, police in Harare set up a roadblock along Seke Road after receiving a tip off that the kombi was leaving Harares CBD enroute to Chitungwiza, he said.\n\nAs the driver approached the roadblock near ABC Auctions, he attempted to flee by reversing the kombi but was blocked by oncoming vehicles.\n\nHe later switched off the kombi and fled. The kombi was subsequently impounded. The driver was arrested on January 22 after the police received information on his whereabouts.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Arrested-3.jpg",
            "description": "Online Reporter A 29-year-old commuter omnibus driver has been arrested after fleeing from the police manning a roadblock along Seke Road. The roadblock had been mounted to arrest the driver after a video of him driving his commuter omnibus on a pavement along Julius Nyerere Way, opposite OK Zimbabwe Supermarket in Harare’s central business district, […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Over 1,6 million people in need of potable water",
            "url": "https://www.chronicle.co.zw/over-16-million-people-in-need-of-potable-water/",
            "content": "CLOSE to two million people in rural areas currently do not have access to clean water due to the failure of thousands of water points, including nearly 3 000 that are completely dry, according to recent Government statistics.\n\nThe figures were released at the 2025 National Stakeholder Dialogue on Wednesday.\n\nA total of 1 613 100 people in rural areas are failing to access safe and clean water due to the failure of 6 398 water points, with 2 929 of them completely dry.\n\nDepartment of Water Resources and Irrigation Development Engineer Tinayeshe Mutazu\n\nChief director in the Department of Water Resources and Irrigation Development Engineer Tinayeshe Mutazu  who was representing Permanent Secretary of the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development Professor Obert Jiri  attributed the crisis to a combination of receding groundwater levels and mechanical breakdowns at some water points.\n\nThe El Nio-induced drought of 2023-2024 has significantly reduced groundwater recharge and levels, thereby increasing demand for groundwater in urban areas and threatening its quality, he said.\n\nGroundwater is not merely a basic necessity but an economic enabler and a constitutional right.\n\nThe Government has implemented strategies under the Rural Development 8.0 initiative to address water access challenges and uplift rural communities.\n\nAs part of this initiative, 3 528 boreholes have been drilled and 432 business units established across all provinces.\n\nProf Jiri also indicated plans to improve governance in the water sector.\n\nWe are reviewing the Water Act, ZINWA Act and related statutory instruments, with the major highlight being the establishment of an independent water and wastewater regulator, he noted.\n\nThese reforms aim to address challenges such as over-abstraction, unregistered drilling and pollution of groundwater resources.\n\nZimbabwe is actively participating in regional and international water management initiatives. The country shares six transboundary aquifers with neighbouring countries, including South Africa and Mozambique.\n\nWe applaud efforts by the SADC Groundwater Management Institute in initiating regional cooperation and management of these transboundary aquifers through research, capacity building and joint monitoring initiatives, Prof Jiri added.\n\nHe further emphasised the importance of leveraging technology to sustainably manage groundwater resources.\n\nUnlike surface water, groundwater is a hidden resource that, when not sustainably managed, is almost impossible to restore. Investing in technologies that monitor groundwater in real-time will aid in better understanding and managing this finite resource, he explained.\n\nEfforts are also underway to establish a National Groundwater Database.\n\nThe Zimbabwe National Water Authority has already taken the lead by digitising what was once a paper-based groundwater database, Prof Jiri said, noting that fragmented groundwater data remains a challenge.\n\nHe concluded by urging stakeholders to work towards a sustainable future.\n\nLet us all strive for universal access to safe drinking water and encourage each other to sustainably manage our groundwater as we transform Zimbabwe into an upper middle-income economy by 2030, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Department-of-Water-Resources-and-Irrigation-Development-Engineer-Tinayeshe-Mutazu-680x380.jpg",
            "description": "Harare Bureau CLOSE to two million people in rural areas currently do not have access to clean water due to the failure of thousands of water points, including nearly 3 000 that are completely dry, according to recent Government statistics. The figures were released at the 2025 National Stakeholder Dialogue on Wednesday. A total of […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Chinhoyi man convicted of unlawful entry and theft",
            "url": "https://www.chronicle.co.zw/chinhoyi-man-convicted-of-unlawful-entry-and-theft/",
            "content": "Online Reporter\n\nBULWELL Mbiri, a 40-year-old resident of Raffingora in Mashonaland West, was sentenced to 9 months in prison after being convicted of unlawful entry and theft by the Chinhoyi Magistrates Court.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe said that on December 30, 2024, Mbiri broke into a storeroom at Plot 1, Mvurachena Farm in Raffingora, which is owned by Shaibo Njebera.\n\nThe accused stole a variety of agricultural items, including chemicals, tools, fuel, and other inputs. Authorities determined that Mbiri intended to permanently deprive Njebera of these items, which are crucial to his farming operations, read the statement.\n\nThe NPAZ emphasized its commitment to combating crime and corruption, urging the public to remain vigilant in the fight against criminal activity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Online Reporter  BULWELL Mbiri, a 40-year-old resident of Raffingora in Mashonaland West, was sentenced to 9 months in prison after being convicted of unlawful entry and theft by the Chinhoyi Magistrates’ Court. In a statement, the National Prosecuting Authority of Zimbabwe said that on December 30, 2024, Mbiri broke into a storeroom at Plot 1, […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Zimbabwe to host another United Nations Tourism event",
            "url": "https://www.chronicle.co.zw/zimbabwe-to-host-another-united-nations-tourism-event/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nIn yet another significant development for Zimbabwes tourism trajectory, the country is set to host the prestigious UN Tourism Committee on Tourism and Sustainability (CTS) meeting in September this year.\n\nThe decision was reached on Wednesday at the UN Tourism Headquarters in Madrid, Spain.\n\nThe 21st CTS meeting will bring together UN Tourism Committee members, policymakers, experts from international organisations, Regional Economic Communities such as the African Union, SADC, COMESA, and national and international media.\n\nThe global tourism event offers Zimbabwe a unique opportunity to showcase its rich cultural and natural heritage, which supports the UN Agenda 2030 Sustainable Development Goals (SDGs).\n\nTourism and Hospitality Industry Minister Barbara Rwodzi\n\nA statement released on Friday noted that the decision aligns with the countrys ongoing efforts to promote responsible and inclusive travel experiences.\n\nA key outcome of the meeting was the decision for Zimbabwe to host the 21st CTS meeting in September 2025.\n\nThis decision underscores Zimbabwes commitment to sustainable tourism development, aligning with the countrys ongoing efforts to promote responsible and inclusive travel experiences.\n\nIt is also in line with Zimbabwes 2025-26 growth strategy, focusing on MICE Tourism as a key initiative to strengthen its position in the sector, reads part of the statement.\n\nThe statement added that the Minister of Tourism and Hospitality Industry, Barbara Rwodzi, conveyed Zimbabwes readiness to host the event, stressing the countrys dedication to shaping the future of sustainable tourism development in partnership with other Member States.\n\nZimbabwe aims to implement policies and strategies in line with the triple bottom linepeople, planet, and profit.\n\nAdditionally, the Chair of the Committee, Hon. William Rodriguez Lopez, Minister of Tourism of Costa Rica, along with UN Tourism Executive Director Ms Zoritsa Urosevic and other CTS members, commended Zimbabwe for its leadership in global tourism promotion, particularly in Africa.\n\nAs a key point of reference, Dr Dirk Glaesser, Director for Sustainable Development of Tourism at UN Tourism, noted the successful hosting of the first UN Tourism Regional Forum on Gastronomy Tourism for Africa by Zimbabwe in July last year as a prime example of the countrys commitment to advancing tourism in Africa.\n\nHe expressed confidence that Zimbabwes strong institutional and policy infrastructure would ensure the success of future tourism events.\n\nMinister Rwodzi expressed gratitude for the support given to Zimbabwe by the Chair and Members of the Committee, noting that this confidence is a testament to the people and Government of Zimbabwes capability to host international events.\n\nShe emphasised that the hosting of this event exemplifies inclusive tourism development, a vision championed by Her Excellency, the First Lady of the Republic of Zimbabwe, Dr Auxillia Mnangagwa, who serves as the Zimbabwe Patron of Tourism, reads part of the statement.\n\nIt added, As the Patron of Tourism, the First Lady introduced key programmes such as Gastronomy Tourism, Agric4She, and Farm-to-Market, which the Ministry intends to extend to every province this year, promoting inclusivity and sustainability in the tourism sector.\n\nThese initiatives led to her recognition by UN Tourism for her efforts to empower local communities, women, youth, and people with disabilities.\n\nThe initiatives aim to integrate the community into the Tourism Value Chain for Sustainable Development, a vision she continues to advocate for across Zimbabwe.\n\nMinister Rwodzi also indicated that Zimbabwe intends to position itself as one of the leading countries in promoting sustainable tourism.\n\nThe ambitious goal encompasses various aspects of sustainability, including environmental conservation, community inclusion, and the economic empowerment of marginalised groups.\n\nBy focusing on these areas, Zimbabwe aims to set an example on the global stage. The decision to host the event aligns with the outcomes of the recently concluded COP29 meeting in Baku, Azerbaijan, where tourism received significant attention for the first time in the history of COP Summits.\n\nZimbabwe is eager to contribute to the global discourse on sustainable tourism and share its best practices with the international community, as UN Member States prepare for the UN General Assembly in the United States in September and the COP30 Summit in Brazil in November 2025.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-24-at-18.47.56-1-680x380.jpeg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw In yet another significant development for Zimbabwe’s tourism trajectory, the country is set to host the prestigious UN Tourism Committee on Tourism and Sustainability (CTS) meeting in September this year. The decision was reached on Wednesday at the UN Tourism Headquarters in Madrid, Spain. The 21st CTS meeting will bring together UN […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Mutare man fined and banned after fatal crash",
            "url": "https://www.chronicle.co.zw/mutare-man-fined-and-banned-after-fatal-crash/",
            "content": "Online Reporter\n\nA man from Mutare has been convicted for causing the death of another during a road accident in the city nearly two years ago.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said Peter Marezu (50) caused the accident that claimed the life of George Howahowa in November 2023.\n\nThe NPAZ said Marezu was made to pay a fine and has been banned from driving for two years by the Mutare Magistrates Court.\n\nMarezu, who failed to stop at an intersection and collided with a Honda Fit, was fined US$300, with a default sentence of 30 days imprisonment. Additionally, he received a 2-month prison sentence wholly suspended on condition of good behaviour. As part of the penalties, Marezu is prohibited from driving class 2 vehicles for 2 years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-58.jpg",
            "description": "Online Reporter A man from Mutare has been convicted for causing the death of another during a road accident in the city nearly two years ago. In a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said Peter Marezu (50) caused the accident that claimed the life of George Howahowa in November 2023. The NPAZ […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Victoria falls man jailed for threatening ex-wife with knife",
            "url": "https://www.chronicle.co.zw/victoria-falls-man-jailed-for-threatening-ex-wife-with-knife/",
            "content": "Online Reporter\n\nA 36-year-old man from Victoria Falls appeared at the Victoria Falls Magistrates Court charged with violating section 10 (7) of the Domestic Violence Act.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said on November 10, 2024, the accused person breached a protection order prohibiting him from visiting or abusing his ex-wife.\n\nHe went to her home, threatened her with a knife and hurled vulgar insults. For this misdemeanor the accused person will serve 10 months imprisonment, said NPAZ.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/10/jail-brreak.jpg",
            "description": "Online Reporter  A 36-year-old man from Victoria Falls appeared at the Victoria Falls Magistrates Court charged with violating section 10 (7) of the Domestic Violence Act. In a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said on November 10, 2024, the accused person breached a protection order prohibiting him from visiting or abusing his […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Bulawayo City Council responds to criticism with inclusive Bulawayo Arts Festival line-up",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-responds-to-criticism-with-inclusive-bulawayo-arts-festival-line-up/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE Bulawayo City Council (BCC) has made a move to signal a commitment to inclusivity, extending the scope of participation for this years Bulawayo Arts Festival (BAF), addressing concerns raised by local artistes who felt side-lined in last years festivities.\n\nLast years festival, which focused predominantly on music and poetry, left many visual artists and other creatives feeling neglected. This oversight increased scrutiny of the councils curation of the event and sparked a call for broader representation in the arts.\n\nResponding to these concerns, Town Clerk Christopher Dube announced via social media that this years festival will welcome not only musicians, dancers, and poets but also visual artists, sculptors, culinary artists, and craftspeople. This expanded focus aims to create a more diverse and vibrant artistic representation, allowing all forms of creativity to shine.\n\nThe invitation is to artists in visual arts, music, dance, poetry, theatre, culinary arts, crafts, sculpture, Dube stated.\n\nArtistes interested in participating are encouraged to submit their proposals to the City Councils Arts, Culture and Heritage Office, headed by the multi-talented Nomashawekazi Lady Tshawe Damasane.\n\nProposals can also be sent via email to[emailprotected]. The submission deadline is February 28, with the festival scheduled to take place from June 2 to June 5.\n\nThe BAF has a significant place in the cultural calendar of Bulawayo, especially since the City officially declared June 2 as Bulawayo Day in 2019, marking the beginning of an annual Arts Festival week.\n\nLast years theme, #RESTART, aimed to rejuvenate the arts scene post-pandemic, and this years event is expected to build on that momentum.\n\nThis call will surely leave local creatives hopeful that this years inclusive approach will foster a vibrant artistic community, showcasing the full spectrum of talent that Bulawayo has to offer.\n\n Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ijk.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE Bulawayo City Council (BCC) has made a move to signal a commitment to inclusivity, extending the scope of participation for this year’s Bulawayo Arts Festival (BAF), addressing concerns raised by local artistes who felt side-lined in last year’s festivities. Last year’s festival, which focused predominantly on music and poetry, left many […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Shurugwi duo get 20 years for murder",
            "url": "https://www.chronicle.co.zw/shurugwi-duo-get-20-years-for-murder/",
            "content": "Online Reporter\n\nTwo men, who were part of a gang of three that beat up another man and poured boiling water over him, leading to his death, have been sentenced to 20 years in prison.\n\nThey accused him of theft.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said Jeremiah Donhora and Kudakwashe Ncube, both from Shurugwi, have been sentenced to 20 years in prison by the High Court sitting in Gweru for the brutal murder of Bernard Canaan Ngulube in 2017.\n\nThe pair, along with an accomplice still at large, accused Ngulube of theft and violently assaulted him with fists, booted feet, logs, and scalded him with boiling water. Ngulube succumbed to his injuries five days later while hospitalised, read the statement.\n\nThe NPAZ said the court found the actions of the accused persons to be callous and premeditated, committing them to 20 years in prison.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/2303-1-1-MURDER-CHARGE-680x380.jpg",
            "description": "Online Reporter Two men, who were part of a gang of three that beat up another man and poured boiling water over him, leading to his death, have been sentenced to 20 years in prison. They accused him of theft. In a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said Jeremiah Donhora and Kudakwashe […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        },
        {
            "title": "Five men, including four brothers, sentenced to life for murder",
            "url": "https://www.chronicle.co.zw/five-men-including-four-brothers-sentenced-to-life-for-murder/",
            "content": "Online Reporter\n\nFive men, four of whom were brothers, have been convicted of murder and sentenced to life imprisonment by the High Court sitting in Gweru.\n\nThe five, Mkhululi Ncube (26), Qhubekani Ncube (23), Cabangani Ncube (30), Thulani Ncube (27), and their neighbour Mexen Moyo (28), brutally attacked Isabel Ndlovu (28) at Linda Business Centre, Silobela, on 30 November 2022.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) stated that the men stabbed and assaulted Ndlovu with knives, logs, and an empty beer bottle.\n\nNdlovu, according to the NPAZ, succumbed to his injuries en route to Kwekwe District Hospital.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gavel.jpg",
            "description": "Online Reporter Five men, four of whom were brothers, have been convicted of murder and sentenced to life imprisonment by the High Court sitting in Gweru. The five, Mkhululi Ncube (26), Qhubekani Ncube (23), Cabangani Ncube (30), Thulani Ncube (27), and their neighbour Mexen Moyo (28), brutally attacked Isabel Ndlovu (28) at Linda Business Centre, […]",
            "time": "21:26",
            "date": "24 Jan 2025"
        }
    ]
}