{
    "news": [
        {
            "title": "SADC tackles DRC conflict",
            "url": "https://www.chronicle.co.zw/sadc-tackles-drc-conflict/",
            "content": "Rumbidzayi Zinyuke, Harare Bureau\n\nSADC Heads of State and Government are set to meet in Harare today for an Extraordinary Summit to deliberate on the escalating security situation in the eastern part of the Democratic Republic of Congo (DRC).\n\nSADC Executive Secretary, Mr Elias Magosi, yesterday met President Mnangagwa at State House to brief him on the agenda of todays Summit.\n\nAddressing journalists after the meeting, Mr Magosi expressed concern over the ongoing conflict in the DRC.Were paying a courtesy call on His Excellency as the chairperson of SADC. He will be chairing the Extraordinary SADC meeting tomorrow (today) to discuss matters of Eastern DRC, which is a worrying situation. So, I was just briefing him on the preparations for the meeting tomorrow and the agenda that will be covered, he said.\n\nAt this point, I can say its concerning (the conflict) because we have lost lives, certainly, and we feel that our troops should be protected. The Excellences will discuss the details and provide guidance at the end of the summit.\n\nSADC Chairperson President Mnangagwa meets the regional blocs Executive Secretary, Mr Elias Magosi\n\nThe SADC Mission in the Democratic Republic of Congo (SAMIDRC) was deployed on December 15, 2023 to support the Government of the DRC to restore peace and security in eastern DRC, which has witnessed an increase in conflicts and instability caused by the resurgence of armed groups.\n\nThe Summit comes after the Extraordinary Summit of the SADC Organ Troika plus the DRC and Troop Contributing Countries (TCCs) to the SADC Mission in the DRC (SAMIDRC), which was held on January 28, chaired by Her Excellency Dr Samia Suluhu Hassan, the President of the United Republic of Tanzania and Chairperson of the SADC Organ on Politics Defence and Security Co-operation.\n\nIt will be preceded by meetings of the SADC Standing Committee of Senior Officials and the Sadc Council of Ministers.The death toll from the combat between peacekeeping soldiers and M23 rebels in eastern Congo had reached 17 as of Tuesday.\n\nThis included 13 South African National Defence Force (SANDF) soldiers and others from Malawi and Uruguay deployed as part of the SADC regional force or under the UN mission in Congo (MONUSCO).\n\nM23 has rapidly advanced towards Goma, a city of over one million people, in the past few weeks.To date, more than 400 000 people have been displaced in North and South Kivu, near the Rwandan border.\n\nKenyan President William Ruto\n\nThe East African Community (EAC) on Wednesday held an Extraordinary Summit to discuss the situation in the DRC following which the EAC Chairperson, President William Ruto of Kenya, said he would consult with the SADC Chairperson (President Mnangagwa) on the urgency of a joint Summit.\n\nMr Magosi, however, said no formal communication had been made by the EAC for the joint Summit to be considered.Until a formal communication comes our way, then we will consider that, and I believe, our leaders will make a determination on whether its something that can take root or not. At this point we dont have anything that is formal from the EAC, he said.\n\nThe Extraordinary SADC Summit of Heads of State and Government will be preceded by the Extraordinary SADC Organ Troika Summit, which will be Chaired by HE Dr Hussein Ali Mwinyi, President of Zanzibar and Chairman of the Revolutionary Council representing Her Excellency Dr Samia Suluhu Hassan, the President of the United Republic of Tanzania and Chairperson of the SADC Organ on Politics Defence and Security Co-operation.\n\nThe Summit will be preceded by meetings of SADC Senior Officials, the Ministerial Committee of the Organ on Politics Defence and Security Co-operation and the SADC Council and Council of Ministers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-38-680x380.jpg",
            "description": "Rumbidzayi Zinyuke, Harare Bureau SADC Heads of State and Government are set to meet in Harare today for an Extraordinary Summit to deliberate on the escalating security situation in the eastern part of the Democratic Republic of Congo (DRC). SADC Executive Secretary, Mr Elias Magosi, yesterday met President Mnangagwa at State House to brief him […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "Midlands leads charge towards economic transformation",
            "url": "https://www.chronicle.co.zw/midlands-leads-charge-towards-economic-transformation/",
            "content": "Patrick Chitumba,[emailprotected]\n\nMidlands Province is experiencing profound transformation driven by innovative initiatives in mineral value-addition and beneficiation, as well as flagship projects in line with human capital development championed by President Mnangagwa.\n\nSeveral high-impact projects have been rolled out in the province to revitalise the local economy and are significantly enhancing the quality of peoples lives in line with Vision 2030.\n\nThe province is witnessing a surge in socio-economic development, with a focus on promoting broad support programmes that contribute more to national economic transformation.\n\nMinister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, revealed this in Kwekwe yesterday where he led a media tour of the life-changing projects that came to light following the coming in of the Second Republic.\n\nDr Jenfan Muswere\n\nDr Muswere, who was accompanied by the Minister of State for Midlands Provincial Affairs and Devolution, Owen Ncube, toured Amaveni Drug Rehabilitation Centre in Amaveni suburb. The institution highlights the Governments focus on addressing social issues, such as drug rehabilitation. The centre plays a vital role in supporting individuals struggling with addiction.\n\nThe delegation also toured the Grain Marketing Board (GMB) silos to check on the progress of the construction of seven new storage facilities, which are crucial for the countrys food security.\n\nDr Muswere later toured the US$10 million Zhong Jin International Hotel, a notable landmark development in the mining town.\n\nIn his remarks, he said the hotel has immense potential for driving the promotion of tourism and economic growth across the region.\n\nThe minister also toured the Midlands State Universitys Emmerson Dambudzo Mnangagwa Law School project, another milestone in human capital development.\n\nThe construction and resourcing of the Law School in Kwekwe District is part of the decentralisation and devolution of human capital development, said Dr Muswere.\n\nHe said the province has a number of smelters, mining, and processing companies, including the giant Dinson Iron and Steel factory in Manhize, Chirumanzu District.\n\nThis is part of an ecosystem, an ecosystem that had been destroyed by the illegal sanctions imposed on the country and are still put in place by the same imperialist forces, said Dr Muswere.\n\nThe Western capitals had targeted the engine of our economy because Zimbabwe took a strategic decision to redistribute land in order to correct the land imbalances brought about by the former colonisers.\n\nBecause of that, a lot of pieces of legislation were put in place and some still exist. Extending targeted sanctions on the Head of State is a direct attack on the people of Zimbabwe, he said.\n\nAs a demonstration of resilience, Dr Muswere said the coming of the Second Republic came with immense gains as evidenced by investors flocking in to invest in the economy.\n\nAll the value chains are undergoing great transformation under the leadership of President Mnangagwa. Farmers in Gokwe and Sanyathi are being capacitated to be cotton ginners and weavers until there is a finished product; that is the cloth for making garments, he said.\n\nDr Muswere said the tour of Amaveni Drug Rehabilitation Centre is part of the health strategy to curb the abuse of drugs by the people, especially the youths.\n\nPart of the tour included several hotels and industrial sites that have been put in place under the New Dispensation. The New Dispensation did not only raise the standards in terms of the gross domestic product but brought a sustainable acceleration in terms of economic empowerment, he said.\n\nEconomic empowerment also includes the land tenure, which has now been securitised so that we grow our wealth.Dr Muswere said the GMB silos under construction were part of ensuring food security and nutrition agenda that is being spearheaded by the Second Republic.\n\nAll this great work is towards an upper-middle-income society by 2030. The current revolution is about human capital growth, he said.\n\nGMB Kwekwe Silos\n\nHe said the multimillion-dollar Zhong Jin International Hotel is part of the success stories of engagement and re-engagement strategy undertaken by the New Dispensation to attract foreign direct investment.\n\nThe facility will support the various value chains that will be feeding into this hotel facility and is part of Vision 2030. Image building is also part of this vision, he added.\n\nThe minister reiterated that the Governments tourism recovery strategy remains anchored in unlocking the US$5 billion tourism economy and that such facilities speak to that vision.\n\nThere has also been a surge in the number of tourists visiting the country. The flora and fauna we enjoy has ensured that the tourism industry becomes a success, he said.\n\nThe most significant programme we have is hosted by the First Lady Amai Mnangagwa focusing on gastronomy.In his remarks, Minister Ncube said the exquisite US$10 million Zhong Jin International Hotel in RedCliff showcases the Second Republics impactful and transformational engagement and re-engagement initiatives under the able and visionary leadership of President Mnangagwa.\n\nSince the inception of the New Dispensation on November 24, 2017 Zimbabwe has realised unprecedented economic recovery and growth confirmed by international finance institutions like the World Bank and research institutions as evidenced through massive modern roads, airports, border posts, electricity infrastructure and private sector-led investments in mining, manufacturing, construction and tourism that underpin Midlands provincial GDP growth,  he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-40.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw Midlands Province is experiencing profound transformation driven by innovative initiatives in mineral value-addition and beneficiation, as well as flagship projects in line with human capital development championed by President Mnangagwa. Several high-impact projects have been rolled out in the province to revitalise the local economy and are significantly enhancing the quality of […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "Bosso to review business deals",
            "url": "https://www.chronicle.co.zw/bosso-to-review-business-deals/",
            "content": "Fungai Muderere,[emailprotected]\n\nHIGHLANDERS chairman Kenneth Mhlophe yesterday revealed the mysterious departure of the original investor in the clubs car wash business.\n\nThe venture, located at the Highlanders clubhouse, was meant to be a significant revenue stream for the Bulawayo football giants.\n\nAccording to Mhlophe, the investor left without notifying the club, and his employees continued to run the business.\n\nAfter investigating, the Bosso executive decided to take over the business, but due to the clubs unpreparedness, they allowed the employees to temporarily manage the car wash, paying US$200 per month.\n\nHowever, financial statements presented by club treasurer Israel Moyo at the annual general meeting (AGM) last year showed that the car wash generated a mere US$50 in revenue for the entire year.\n\nThis revelation stunned Bosso members, considering that the business operates daily.Car wash charges vary per vehicle for body wash, interior and exterior wipe down, interior vacuum, tyre shine, dashboard polish, engine wash and body waxing, among others.\n\nMhlophe attributed the low revenue to the absence of a formal agreement with the car wash operator, Clifford Ncube.\n\nHe assured that the club is now taking steps to rectify the situation. In other developments, Mhlophe disclosed that the Highlanders Sports Club, run under a consultancy arrangement since early 2023, is subject to review by the end of March. He said the clubhouses kitchen arrangement is also subject to review.\n\nThis agreement includes a profit-sharing model which is expected to benefit Bosso significantly, especially given the clubs large membership and fan base.\n\nMhlophe expressed his hope that the clubs diaspora membership would soon be able to connect and participate in gatherings virtually. He noted that members have been organising themselves into various chapters, united by their loyalty to Highlanders.\n\nOur members continue to organise themselves into various chapters that are influential largely by geographical settlements, be it in cities, towns or countries. In all the situations, the common denominator is simply Highlanders. I hope that in the not-so-distant future, our membership in the diaspora will connect and be a part of such gatherings via virtual means, said Mhlophe.  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Kenneth-Mhlophe.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw HIGHLANDERS chairman Kenneth Mhlophe yesterday revealed the mysterious departure of the original investor in the club’s car wash business. The venture, located at the Highlanders clubhouse, was meant to be a significant revenue stream for the Bulawayo football giants. According to Mhlophe, the investor left without notifying the club, and his employees […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "COMMENT: African leaders must not allow Eastern DRC  crisis to continue",
            "url": "https://www.chronicle.co.zw/comment-african-leaders-must-not-allow-eastern-drc-crisis-to-continue/",
            "content": "THE recent exchange of belligerent messages between Rwandan President Paul Kagame and South African President Cyril Ramaphosa on social media platform X (formerly Twitter) over the crisis in the eastern Democratic Republic of Congo is a worrying trend that could further undermine Africas quest for unity.\n\nAfrican leaders should prioritise finding diplomatic solutions instead of calling each other out on social media platforms. They should work towards African unity instead of adopting confrontational stances and issuing veiled threats against each other.\n\nOur continent has suffered numerous wars that have resulted in millions of deaths, with non-African countries funding and sponsoring these wars. It is vital that African leaders resist being used by Western countries to destabilise the continent, allowing them to pillage Africas natural resources and minerals.\n\nThe crisis in the Eastern DRC is a matter of concern, as M23 rebels have wrestled control of Goma, a city located close to the border of Rwanda and the DRC.\n\nSouth Africa deployed soldiers in Goma as part of the Sadc Mission in the Democratic Republic of Congo (SAMIDRC) peacekeepers. However, President Kagame seems unhappy with their presence, accusing South Africa of supporting the DRC army in the conflict. The situation requires immediate attention to avoid further destabilisation of the region.\n\nIt is essential that African leaders come together in unity to find a solution to the Eastern DRC crisis. They should prioritise dialogue instead of resorting to social media trading accusations and veiled threats. Such actions set a dangerous precedent and could cause more harm than good. The DRC has suffered from conflict for far too long, and Africas leaders should not add to its woes.\n\nOur continent is rich in natural resources and minerals, and this has made it a prime target for pillagers and non-African countries that capitalise on instability to loot resources. The looting of African minerals and natural resources has been happening for far too long, and it is time African leaders put a stop to it.\n\nAfrican leaders must come together in unity and put their differences aside to end the conflict in the Eastern DRC. African unity is crucial, and it is only through uniting that the continent can overcome the challenges it faces.\n\nWe call upon all our leaders to prioritise finding solutions to the challenges affecting our continent through peaceful and diplomatic means.\n\nAfrican leaders must not allow themselves to be set up against each other by imperial forces bent on looting the continents mineral and natural resources.\n\nThey must work towards African unity and prioritise diplomatic channels to resolve conflicts, instead of trading accusations and threats on social media.\n\nIts time for Africa to speak with one voice and prioritise the interests of its people. We urge our leaders to come together and end the Eastern DRC crisis.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/DRC.jpg",
            "description": "THE recent exchange of belligerent messages between Rwandan President Paul Kagame and South African President Cyril Ramaphosa on social media platform X (formerly Twitter) over the crisis in the eastern Democratic Republic of Congo is a worrying trend that could further undermine Africa’s quest for unity. African leaders should prioritise finding diplomatic solutions instead of […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "LPG dealers slammed over high prices despite VAT removal",
            "url": "https://www.chronicle.co.zw/lpg-dealers-slammed-over-high-prices-despite-vat-removal/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nFINANCE, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, has condemned liquefied petroleum gas (LPG) dealers for continuing to charge exorbitant prices despite the removal of value added tax (VAT) on the commodity.\n\nProf Ncube emphasised in his 2025 national budget statement the growing importance of LPG as an alternative energy source in the wake of the regions electricity supply challenges.\n\nProlonged load shedding has increased reliance on LPG for cooking and heating, offering a cleaner and more sustainable option compared to traditional fuels like firewood and charcoal, which contribute to deforestation and indoor air pollution.\n\nIn a statement yesterday, Prof Ncube said the removal of VAT was meant to give relief to citizens who are using LPG gas as a source of energy.\n\nThe Government removed VAT on LPG gas in the 2025 Budget with effect from 1 January 2025, through Statutory Instrument 195 of 2024, Prof Ncube explained.\n\nThe intention was to lower the prices of LPG gas by the extent of the VAT that was being charged previously.\n\nHowever, the Government has noted with concern that some of the LPG operators have not reduced their prices, thus profiteering from the VAT relief, which was aimed at citizens. This is unethical.\n\nEarly this month, the Zimbabwe Energy Regulatory Authority (Zera) announced that the removal of VAT resulted in LPG prices dropping by approximately 13 percent.\n\nThe new prices are US$1,61 per kilogramme, down from US$1,86 per kilogramme in December. In local currency, the adjustment is ZWG41,63 per kilogramme, down from ZWG47,51 per kilogramme. These new prices have, however, not been adhered to.\n\nI, therefore, urge LPG operators to reduce their prices by the extent of the VAT relief as intended. This will go a long way in giving relief to our consumers and citizens and is also consistent with the Governments efforts towards greening the economy, said Prof Ncube.\n\nThe demand for LPG continues to grow in Zimbabwe, with the country consuming nearly 400 million kilogrammes of LPG between 2015 and March 2024, primarily imported from regional producers. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/mthuli.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com FINANCE, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, has condemned liquefied petroleum gas (LPG) dealers for continuing to charge exorbitant prices despite the removal of value added tax (VAT) on the commodity. Prof Ncube emphasised in his 2025 national budget statement the growing importance of LPG as an alternative energy […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "Mazibuko’s sweet gesture for Ingutsheni patients",
            "url": "https://www.chronicle.co.zw/mazibukos-sweet-gesture-for-ingutsheni-patients/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nThis morning, Ingutsheni Central Hospital in Bulawayo will come alive as it hosts its annual Cake Day for the St Mary wards, which accommodate female patients. Activities are scheduled to take place from 10am to 12pm.\n\nThe event will feature performances from local artistes who will spend time with the patients, bringing entertainment and joy.\n\nThe initiative is spearheaded by Sipho Mazibuko, the founder of Mental Voices Zimbabwe Organisation and a former Ingutsheni patient.\n\nIn an interview, Mazibuko said the idea of the event is to show patients at Ingutsheni that they are loved and not forgotten.\n\nSome have never had a visitor and others, whom I was admitted with 15 years ago, are still here because their families abandoned them  giving false contact details and leaving them to live here until they pass away.\n\nI love them because I am one of them. I want them to have a joyful day, dance with me and enjoy plenty of cake, Mazibuko said.\n\nMazibuko who was admitted at the facility over a decade ago added: Well use this time to tour the wards where I was once admitted  from my isolation ward to the general ward for those able to interact with others. Well also have artistes performing, as music was a crucial part of my healing process.\n\nThe line-up of performers includes Khaya Arts, Amaqaqa Music Imbube Ensemble, Mzoe7, and Skhumz the Moonwalker.\n\nIn addition to musical performances, the event will also address gender-based violence issues.\n\nMazibuko shared the events role in educating young people about the harsh realities of drug and substance abuse.\n\nShe has invited some of the Miss Rural Zimbabwe models to witness the conditions and understand the psychological impact such an environment can have.\n\nThe guest of honour for the event will be Sandra Ndebele. Other notable attendees will include Chief Dakamela.\n\nContributions for the event have been made by various individuals and organisations.\n\nSomething Sweet Caf, run by Gugu Dube, has donated 10 cakes, while additional cakes have been provided by Madame Cakes and Cupcakes by Silenhlanhla from Gwanda.\n\nConfirming his participation, musician Mzoe7 expressed his support for mental health awareness initiatives.\n\nAs someone involved in projects like Majita Lets Talk, this is a great initiative. I love working with people and understanding their struggles. Shout out to Sipho Mazibuko for her compassion. Well be there to uplift spirits and ensure that patients leave with a positive mindset, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Sipho-Mazibuko-poses-with-one-of-the-cakes-that-has-been-donated-for-Ingutsheni-Cake-day-with-Samantha-a-former-patient-at-Ingutsheni.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com This morning, Ingutsheni Central Hospital in Bulawayo will come alive as it hosts its annual Cake Day for the St Mary wards, which accommodate female patients. Activities are scheduled to take place from 10am to 12pm. The event will feature performances from local artistes who will spend time with the patients, bringing […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "Night of horror: Cowdray Park reels from triple murder",
            "url": "https://www.chronicle.co.zw/night-of-horror-cowdray-park-reels-from-triple-murder/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nA BULAWAYO family had barely settled into their new home in Cowdray Park suburb when tragedy struck in the form of a brutal triple murder that left the community in shock.\n\nA 34-year-old woman, Happiness Chimbangu, allegedly stabbed her husband and two young children to death in the early hours of Thursday morning.\n\nNeighbours described the family as reclusive, keeping mostly to themselves since moving into their rented house in mid-November last year. They also described the suspect, Happiness, as a polite and sociable woman who exchanged morning greetings while sweeping her yard but spent most of her time indoors with her children.\n\nHowever, little was known about her husband, Edwin Chimbangu (35) and whether he was formally employed or self-employed.\n\nThe couples two children  four-year-old Promise Chimbangu and seven-month-old Prudence Chimbangu  were also found dead inside the house, their bodies bearing multiple stab wounds.\n\nA resident, Mrs Anna Muchinjo, said the young family had not been in the suburb long enough for neighbours to form close bonds with them.\n\nWe used to see each other in the mornings while sweeping our yards. She was always polite, but the family kept to itself. The little boy rarely played outside like other children his age. It is devastating to think that such an unassuming woman could do something so horrific, she said.\n\nAnother neighbour, who only identified herself as NaThabo, recalled the eerie silence on the night of the murders.We heard nothing, no screams or disturbances. When we saw police in the yard the following morning, we assumed thieves had broken in. But when officers began carrying out three coffins, we were in total disbelief, she said.\n\nHours later, detectives from the Zimbabwe Republic Polices Criminal Investigations Department (CID) returned to the scene, this time with Happiness in handcuffs.\n\nBulawayo provincial police acting spokesperson, Assistant Inspector Nomalanga Msebele, confirmed the tragic incident.When police arrived at the scene, they found the bodies of Edwin Chimbangu and his two children lying on the bed with multiple stab wounds. Edwin had deep cuts on his right ear, neck, right cheek, and near his right eye, she said.\n\nAsst Insp Msebele said Promise, the couples four-year-old son, had a deep wound on his back shoulder and multiple cuts on the right side of his head. Prudence, the seven-month-old daughter, was found with severe cuts on her right cheek and head.A blood-stained metal digger, the suspected murder weapon, was recovered near the door.\n\nPolice also noted that Happiness was wearing a blue dress soaked in blood at the time of her arrest.The bodies were taken to the United Bulawayo Hospitals (UBH) for post-mortem examinations.Asst Insp Msebele said the tragedy was preceded by signs of deep distress.\n\nShe said Happiness had visited her mother earlier on Wednesday, complaining that her husband was failing to provide for the family and that they were living in extreme poverty. She also expressed suicidal thoughts.\n\nLater that day, the suspect returned to her mothers house, appearing highly distressed and again speaking about ending her life.\n\nAt around 3pm, she made a chilling request, asking her mother to take care of her children because she intended to kill herself, said Asst Insp Msebele.\n\nWorried, Edwin later called Happinesss mother around 10pm, requesting her to come over because his wife was talking about suicide.\n\nIn response, Happinesss mother, accompanied by two family churchmates, rushed to the couples home.They spent time counselling her, trying to dissuade her from harming herself. Eventually, they left around midnight, believing they had helped her calm down, said Asst Insp Msebele.\n\nDepression  Image taken from Shutterstock\n\nJust two hours later, at around 2am, a church member who lived nearby phoned Happinesss mother with horrifying newsher daughter had arrived at his house and confessed to killing her husband and children.\n\nAsst Insp Msebele urged the public to take mental health issues seriously and to intervene when a loved one exhibits suicidal tendencies.\n\nIt is heartbreaking that such a young family has been lost in such a violent manner. We urge the community to be more vigilant and offer support to those struggling with mental health challenges.\n\nTragedies like this can be prevented if we come together as a society, she said.Asst Insp Msebele said they have launched a full investigation into the incident, and the suspect is expected to appear in court today on murder charges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ggggg-1.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com A BULAWAYO family had barely settled into their new home in Cowdray Park suburb when tragedy struck in the form of a brutal triple murder that left the community in shock. A 34-year-old woman, Happiness Chimbangu, allegedly stabbed her husband and two young children to death in the early hours of Thursday […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "Wolves in sheep’s clothing have infiltrated the Church",
            "url": "https://www.chronicle.co.zw/wolves-in-sheeps-clothing-have-infiltrated-the-church/",
            "content": "Cuthbert Mavheko,[emailprotected]\n\nThe Governments efforts to obliterate the scourge of corruption are quite commendable.\n\nIt is very important to stress that corruption is, by its very nature, an aberration and harms, not only public and private institutions, but terribly taints the image of the country.\n\nOn the same breath, it is essential to understand that corruption is one of the strongest impediments to sustainable development.\n\nI remember when music legend Thomas Mapfumo released his hit song Corruption in the late 1980s, the song made little or no sense at all back then as most people only enjoyed it for entertainment.\n\nHowever, Mapfumos prophecy has turned into a frightening reality as corruption has now assumed alarming levels in Zimbabwe, leaving the country hanging precariously on the precipice of a moral and ethical Armageddon.\n\nLet it be seriously noted that corruption has permeated many public institutions in the country.\n\nCorruption has also reared its ugly head in the private sector. Apart from wreaking havoc in public and private institutions, the scourge of corruption has now spread its hideous tentacles into the Church.\n\nWhile church leaders are supposed to be custodians of a nations moral and ethical values, the sad reality on the ground is that this is no longer the case nowadays.\n\nThe quest for materialism has caused many church leaders to abandon their core job of turning sinners to God and are engaging in sickening acts of corruption.\n\nIndeed, it presents a perplexing paradox to note that today, some church leaders are more concerned with feathering their nests than with worshipping God in spirit and in truth.\n\nThese corrupt church leaders are leading profligate lifestyles. They are embezzling church funds and buying luxurious cars, funding their businesses and building flamboyant mansions for themselves in exclusive suburbs.\n\nIf indeed the truth be told without prejudice, the quest for material success has become an all-consuming goal for many church leaders nowadays.\n\nThe burning desire for more possessions, more money, luxurious cars, flamboyant mansions and glamorous lifestyles has seen many church leaders engaging in corrupt activities.\n\nSpeaking to H-Metro on the sidelines of his graduation celebration held at his church in Harare last year, Bishop Roger Jeffrey, leader and founder of Tabernacle of Worship Family Ministries, said many church leaders were taking the Christian Ministry as a business.\n\nThe main problem with todays church is that most of the leaders are in it for prosperity. To some, the church is now a business venture . . . Instead of exploiting members, the church should empower people spiritually and economically, said the Bishop.\n\nIt is pertinent to point out that one of the commandments that the Creator God thundered from the top of Mount Sinai  the eighth commandment  says: You shall not steal (Exodus 20 verse 15). Because many church leaders no longer fear disobeying Gods laws, corrupt activities are growing at an alarming level in some churches.\n\nOne insightful observation that I have personally made since pitching my tent in the Christian camp many years ago is that a significant number of churches in the country have been infiltrated by wolves in sheeps clothing. These are criminal elements, who masquerade as followers of Jesus Christ.\n\nTheir modus operandi is simple: they elevate their friends and proxies to positions of authority as pastors, deacons, bishops, finance officers etc in their respective churches so as to facilitate the embezzlement of church funds and other corrupt activities.\n\nChurch leaders are supposed to be guided by the teachings of Jesus Christ as revealed in the Holy Bible. However, what is happening today is that some church leaders pay mere lip service to the teachings of Jesus Christ as their lifestyles are anti-Christ. By good words and eloquent speeches they deceive their church members, said Father Alex Mukaro, a Masvingo-based Roman Catholic priest.He said church leaders can make a positive impact on society by being exemplary.\n\nChurch leaders have a moral and spiritual obligation to set good examples to ordinary congregants by avoiding getting involved in corrupt activities such as the embezzlement of church funds, which is rampant in many churches today, said Father Mukaro.\n\nThe embezzlement of church funds is prevalent in many churches, not only in Zimbabwe, but all over the world. An article titled Embezzlement in the Church by Robert Lemon, published in the magazine Adventist World, says the Seventh Day Adventist Church (SDA) has, over the years, faced a number of significant financial losses, some in excess of US $1 million through embezzlement.\n\nSome years ago, a Bishop of the Church of Jesus Christ of Latter-Day Saints in Luveve embezzled thousands of US dollars from the church and relocated to Tanzania, where he is reportedly now running a restaurant business.\n\nLast year, a 51-year-old Harare man and his two wives appeared in court for embezzling US$29 963 from the St James Anglican Church in Warren Park.\n\nThe above cases are just a tip of the proverbial iceberg. The embezzlement of church funds is flourishing like flowers in bloom in many churches.\n\nHowever, oftentimes these cases are kept a closely-guarded secret. Church authorities shy away from exposing these shenanigans for fear of damaging the reputation of their churches.\n\nIf truth be told without prejudice, corruption rules the roost at some churches, which has resulted in many congregants leaving church.\n\nOne striking observation that I personally made during my tenure of office as a Ward history consultant at a church I attended was that the church had been infiltrated by criminal elements. The following illustrations buttress this pertinent observation.\n\nThe church had a programme where congregants, who faced economic difficulties and could not afford to buy food for their families were provided with basic foodstuffs like mealie-meal, rice, cooking oil, sugar, flour and so forth.\n\nBut some church leaders were taking all this food and giving it to their families, relatives and friends.\n\nThis reminds me of an incident that happened during the Covid-19 era. As we were facing economic difficulties during that period, Brian (not his real name), a church elder and several other church members, including this scribe, approached the Ward Bishop and requested foodstuffs from the church.\n\nThe Bishop gave us some forms to fill in. After filling in the forms, we were told that the church would provide us with the foodstuffs within a week. But this turned out to be mere amusement talk.\n\nAfter we had waited for almost two months without getting the foodstuffs, Elder Brian confronted the Bishop and had an altercation with him. After this altercation with the Bishop, Elder Brian was clandestinely given his portion of the foodstuffs and told (by the Bishop) not to reveal to anyone that he had received the foodstuffs.\n\nIndeed, it was grossly unfair and supremely scandalous that some of us never got the foodstuffs despite the fact that we had filled in the necessary forms sanctioning us to receive the foodstuffs.\n\nThe church also funded an education programme and, according to my research and theoretical analysis, it was mostly church leaders, their families, friends and relatives who were benefitting from this education programme.\n\nSome church leaders were even using funds from this education programme to advance their own academic qualifications and educate their children, relatives and friends.\n\nA former member of a prominent church who spoke on condition of anonymity, had this to say:\n\nThe church is being run by corrupt people. After my daughter completed her Ordinary Levels a few years ago, she enrolled at United College of Education to train as a teacher.\n\nAs we were short of funds to pay her fees, my wife and I asked the Bishop of our church to sanction the provision of church funds for our daughters education through the churchs education programme.\n\nBut the Bishop flatly turned down our request. What really pained us is that at the time some church members related to the leadership of the church, were being educated through the churchs education programme.\n\nIt is equally important to mention that during the Covid-19 era, church authorities gave our bishopric cellphones to distribute to church congregants to facilitate communication among church members as the Covid-19 pandemic had disrupted church services. However, members of the bishopric sold these phones and pocketed the money. The problem with our church is that such cases of corruption are never reported to relevant authorities.\n\nA few years back, President Mnangagwas administration launched Operation Mari Wakaiwanepi (where did you get all that money from) to investigate public prosecutors and other Government officials living lavishly. It is the considered opinion of this scribe that the Government should also investigate church leaders who are living in the lap of luxury.\n\nAs mentioned earlier, some of these corrupt church leaders have built flamboyant mansions in exclusive suburbs and cavort about the country in luxurious cars while ordinary church members watch as if a circus is in session.\n\nIt is a matter of public record that corruption has become a cancerous scourge in many churches.\n\nGiven the foregoing as a backdrop, I humbly opine that a thorough cleansing exercise is urgently needed in all local churches to weed out church leaders suspected of engaging in acts of corruption.\n\nCorrupt church leaders are tarnishing the image of the church and should be dragged before the courts to face the full wrath of the law.\n\nThis will not only free the church of the evil spirit of corruption, but will also serve as a deterrent to anyone else disposed to corruption as a way of getting rich quickly. It is said a fish rots from the head.\n\nThis is an incontestable truth as church leaders set examples which ordinary congregants are likely to follow.\n\nIt cannot be over-emphasised that the church needs corruption  free and God-fearing leaders in order to improve the moral and spiritual lives of congregants.\n\nIn signing off, it is crucially important to remind church leaders that they have been entrusted with a great responsibility as stewards of Gods assets.\n\nWhen caring for the Lords church, they must ensure that they follow the highest standards because one day they will be held accountable for what they do with the resources God has placed in their hands. I rest my pen.\n\nCuthbert Mavheko is a freelance writer and theologian. He can be contacted on 0773963448/0775522095 or via Email[emailprotected]\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Wolves-in-sheep’s-clothing.jpg",
            "description": "Cuthbert Mavheko, mavhekoc@gmail.com The Government’s efforts to obliterate the scourge of corruption are quite commendable. It is very important to stress that corruption is, by it’s very nature, an aberration and harms, not only public and private institutions, but terribly taints the image of the country. On the same breath, it is essential to understand […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "Local authorities urged to prioritise road, infrastructure maintenance",
            "url": "https://www.chronicle.co.zw/local-authorities-urged-to-prioritise-road-infrastructure-maintenance/",
            "content": "Sukulwenkosi Dube- Matutu,[emailprotected]\n\nLOCAL authorities should prioritise maintenance of roads and key infrastructure such as bridges leading to major economic projects in their areas to boost economic development.\n\nPresidential Affairs and Devolution permanent secretary, Engineer Tafadzwa Muguti, said this in an interview during his recent visit to Matabeleland South, where he stressed the importance of vibrant service delivery by councils.\n\nHe noted that basic public service delivery such as accessibility to schools and clinics, water and roads, must be given top allocations on council budgets.\n\nOn its part, Eng Muguti said the Government will ensure the timeous disbursement of devolution funds.Im impressed by the development projects, which I have seen being implemented by the Gwanda Municipality using devolution. We have seen here that the council has constructed a primary school, which has brought huge relief to children who had to walk long distances to school.\n\nI have also noted that there is no road connecting this school to the community. There is also a need for a bridge to make this school accessible because at the moment learners face a challenge in accessing the school during the rainy season.\n\nThis defeats the purpose of having this school if its not accessible to learners. I would like to urge the council to prioritise developing a road and bridge in this area under the ERRP programme. We need to have these institutions that we are building being connected to the rest of the community, said Eng Muguti.\n\nPermanent Secretary for Presidential Affairs and Devolution, Engineer Tafadzwa Muguti\n\nHe said public infrastructure such as roads and bridges can enhance economic development activities within provinces and expressed concern that emerging economic powerhouses such as Blanket Mine were operating without a proper road.\n\nEng Muguti said a proper road will ensure improved accessibility to the mine thereby boosting economic activity. He said investment in such infrastructure will also help boost production and challenged councils to identify such major economic players and prioritise their accessibility.\n\nThe road infrastructure here isnt very good and for a company like Blanket Mine, which is really contributing to the national economy, these are some of the priorities in infrastructure development plans that the province has to take on board, said Eng Muguti.\n\nThe same applies to companies and areas that are the major contributors to economic development.Meanwhile, the permanent secretary called upon local authorities to formalise their economies in to generate more revenue, which will then increase devolution funds. He said Government was losing money to unregistered businesses that were not paying taxes.\n\nEng Muguti said some local authorities were not bringing much revenue but were expecting devolution funds and urged them to put in place measures to increase their revenue collection.\n\nHe said the more revenue local authorities bring, the more devolution funds they will receive.Devolution funding is five percent of all the consolidated revenue that we would have collected. Unfortunately there are other districts and provinces that dont understand that the more formalised the provincial economy is the more revenue they are likely to generate, which means more devolution fund, said Eng Muguti.\n\nIf we operate at 70-30 percent case where only 30 percent are paying tax and the 70 percent are informal then its going to affect Government coffers.\n\nWhat we would like the community to understand is that this is money coming from tax payers money and Government is being prudent enough to collect but at the same time if we have not collected then it will be difficult to collect money, which isnt there.\n\nWith social amenities and infrastructure development being some of the major pillars of the National Development Strategy (NDS1), local authorities have used devolution funds to augment efforts by communities and other stakeholders through ensuring that projects are completed timeously.\n\nDevolution funds are assisting local authorities fulfil their obligation across the country through development of key infrastructure such as clinics, classroom blocks, roads, bridges among other facilities. @DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/Muguti.jpg",
            "description": "Sukulwenkosi Dube- Matutu, sukulwenkosi.dube@chronicle.co.zw LOCAL authorities should prioritise maintenance of roads and key infrastructure such as bridges leading to major economic projects in their areas to boost economic development. Presidential Affairs and Devolution permanent secretary, Engineer Tafadzwa Muguti, said this in an interview during his recent visit to Matabeleland South, where he stressed the importance […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        },
        {
            "title": "Fuel dealer gets 18 yrs jail for fatal assault",
            "url": "https://www.chronicle.co.zw/fuel-dealer-gets-18-yrs-jail-for-fatal-assault/",
            "content": "Midlands Bureau\n\nA Kwekwe fuel dealer, Unganai Zvoushe (39) of Alarm 2 Mine, has been sentenced to 18 years in prison for fatally assaulting his colleague, Mr Albert Saita, in January 2022.\n\nMr Saita had reprimanded Zvoushe for giving clients fake US dollars.According to prosecutor Ms Florence Mashandure, the incident occurred at Truckers Inn in Kwekwe, where both men sold fuel.\n\nA truck driver had returned to Mr Saita, complaining that Zvoushe had given him a fake US$20 note. Mr Saita then warned other fuel dealers against giving clients fake notes, without mentioning Zvoushes name.\n\nHowever, Zvoushe became enraged, shouting at Mr Saita before leaving the area. He returned at around 2pm and assaulted Mr Saita, kicking and slapping him repeatedly.\n\nMr Saitas brother, Alous, tried to intervene, but Zvoushe continued the attack. Mr Saita suffered severe injuries, including a swollen right eye, and was taken to Kwekwe District Hospital where he died on February 6, 2022.\n\nBulawayo High Court judge, Justice Lucy Mugwari, sitting in circuit in Gokwe, convicted Zvoushe of murder and handed down the 18-year sentence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Midlands Bureau A Kwekwe fuel dealer, Unganai Zvoushe (39) of Alarm 2 Mine, has been sentenced to 18 years in prison for fatally assaulting his colleague, Mr Albert Saita, in January 2022. Mr Saita had reprimanded Zvoushe for giving clients fake US dollars. According to prosecutor Ms Florence Mashandure, the incident occurred at Truckers Inn […]",
            "time": "06:08",
            "date": "31 Jan 2025"
        }
    ]
}