{
    "news": [
        {
            "title": "Teen commits suicide following a disagreement with her mother over laptop",
            "url": "https://www.chronicle.co.zw/teen-commits-suicide-following-a-disagreement-with-her-mother-over-laptop/",
            "content": "Ronald Mpofu [emailprotected]\n\nA 15-YEAR-OLD girl from Bulawayos Riverside Suburb allegedly committed suicide by drinking poison following a fallout with her mother over a laptop.\n\nOn 16 December 2024 at around 5:30pm, the now deceased had an argument after the mother decided to sell her Acer laptop. This got the girl upset and she verbally threatened to kill herself. At around 6pm, her cousin (6) approached the deceaseds mother informing her that she saw the now deceased drinking some substance.\n\nThe mother followed the now-deceased and found her having seizures. She gave her charcoal to chew as first aid but the situation never changed. She rushed the girl to Mater Dei hospital where she was admitted upon arrival and later died. A police report was made.\n\nWe encourage parents to be cautious when dealing with their children, to detect issues early and take action if there are any problems to avoid such incidences. Children of nowadays have a tendency to make a hasty decision when angry without bearing in mind the consequences of their actions, said Assistant Inspector Nomalanga Msebele, deputy police spokesperson for Bulawayo Province.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Police-wanted-edit-by-Ronald-Mpofu-copy-2.jpg",
            "description": "Ronald Mpofu – itsronaldrox@gmail.com A 15-YEAR-OLD girl from Bulawayo’s Riverside Suburb allegedly committed suicide by drinking poison following a fallout with her mother over a laptop. On 16 December 2024 at around 5:30pm, the now deceased had an argument after the mother decided to sell her Acer laptop. This got the girl upset and she […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "Bulawayo Fire Brigade ropes in CPU assistance as fire guts house in Lobengula suburb",
            "url": "https://www.chronicle.co.zw/bulawayo-fire-brigade-ropes-in-cpu-assistance-as-fire-guts-house-in-lobengula-suburb/",
            "content": "Sikhumbuzo[emailprotected]\n\nTHE Bulawayo Fire brigade has engaged the Civil Protection Unit (CPU) for possible assistance on a New Lobengula suburb family after it lost property worth ZiG100 000 following a fire that gutted their house on Monday night.\n\nHousehold property was reduced to ashes including the roofing sheets while all four individuals who were inside the house were taken to Mpilo Central Hospital by an ambulance after suffering burns and smoke inhalation, according to the Bulawayo City chief fire officer Mr Mhlangano Moyo.He said the fire brigade received a distress call on a house property fire at\n\n10:45 pm and on arrival it was found that a two-roomed semi detached private residential house measuring 10m x 4m built of bricks under asbestos sheets was well alight with flames and smoke issuing from shattered asbestos roof and burnt wooden doors.A 14-year-old male juvenile who was sleeping in the house sustained burns on the back and upper arms. He also sustained cuts from broken window panes. A female adult and two minors sleeping in a separate room suffered smoke inhalation. Brigade used two high-pressure hose reels with breathing apparatus stage one to extinguish the fire with water supplies augmented from Emergency Tender 3, said Mr Moyo.\n\nHe said the Brigade carried out investigations to ascertain the probable cause of the fire and indications are leading to a candle left on and unattended.The mother of the 14-year-old left around 8:20 pm to town, leaving the candle on with his son. Unfortunately, the boy got asleep without putting it off, said Mr Moyo.\n\nHe said the department has since engaged the CPU as the situation was dire for the family.We have since roped in CPU and other partners we work with for assistance as the situation is just touching. The estimated value of the property is ZiG400 000, the estimated value of property lost is ZiG100 000 and the value of the property saved is ZiG300 000, said Mr Moyo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/02/Bulawayo-Fire-Brigade-.jpg",
            "description": "Sikhumbuzo Moyo-smoyo@chronicle.co.zw THE Bulawayo Fire brigade has engaged the Civil Protection Unit (CPU) for possible assistance on a New Lobengula suburb family after it lost property worth ZiG100 000 following a fire that gutted their house on Monday night. Household property was reduced to ashes including the roofing sheets while all four individuals who were […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "Cyclone Chido kills 34 in Mozambique after battering Mayotte",
            "url": "https://www.chronicle.co.zw/cyclone-chido-kills-34-in-mozambique-after-battering-mayotte/",
            "content": "At least 34 people have been killed in Mozambique by Cyclone Chido, authorities said on Tuesday, after the storm tore through the French island of Mayotte days earlier.\n\nMozambiques National Institute of Risk and Disaster Management said more than 300 others had been injured by Chido while nearly 23,600 homes and 170 fishing boats had been destroyed.\n\nOverall, more than 175,000 people in Mozambique were affected by the storm, it said.\n\nChido made landfall on Cabo Delgado province on Sunday, where it claimed 28 lives, before claiming six more in Nampula province and Niassa, further inland.\n\nRescue crews are still working through the heavily damaged areas.\n\nPic: UNICEF Mozambique\n\nMayotte imposes curfewAt the same time, authorities on the French Indian Ocean territory of Mayotte imposed a curfew on Tuesday.\n\nEarlier, officials had compared Chidos impact on the island to that of a nuclear war.\n\nThus far, the official death toll in Mayotte is 21, but authorities and rescue services have warned that the final count could be in the hundreds or even thousands. The curfew begins at 10 pm local time, and has been put in place to prevent looting, the Interior Ministry said.\n\nMayotte is one of several islands around the world that are part of France and ruled from Paris.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-2-Rbbecovered.jpg",
            "description": "At least 34 people have been killed in Mozambique by Cyclone Chido, authorities said on Tuesday, after the storm tore through the French island of Mayotte days earlier. Mozambique’s National Institute of Risk and Disaster Management said more than 300 others had been injured by Chido while nearly 23,600 homes and 170 fishing boats had […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "The dangers of selective abortion laws and the case for legal reform",
            "url": "https://www.chronicle.co.zw/the-dangers-of-selective-abortion-laws-and-the-case-for-legal-reform/",
            "content": "Obey[emailprotected]\n\nBUHLE, a 20-year-old university student, finds herself in a desperate situation when she discovers she is pregnant. Fearing the consequences of her parents and friends finding out, she turns to a friend of a friend who claims to know how to perform an abortion.\n\nThe procedure is carried out in a cramped and unsanitary backyard shed. Buhle is given a concoction of unknown substances, and the practitioner attempts to perform a dilation and curettage (D&C) without proper equipment or anaesthesia. As soon as the procedure is over, Buhle begins to experience severe abdominal pain, heavy bleeding, and dizziness. She realises something has gone horribly wrong.\n\nPanicked, Buhles friend rushes her to the hospital, but they arrive late, and the hospital is ill-equipped to handle emergency abortion complications. The hospital staff are overwhelmed, and Buhle is left waiting for hours as her condition deteriorates.\n\nFinally, after what seems like an eternity, Buhle is seen by a doctor. She is diagnosed with severe haemorrhaging, uterine perforation, and sepsis. The medical team fights to stabilise her, but the damage is extensive. Buhle spends several days in hospital, undergoing multiple surgeries and treatments. She is eventually discharged, but the physical and emotional trauma lingers.\n\nThe backyard abortion leaves Buhle with irreparable damage. She is told she will never be able to conceive again due to the extent of the uterine damage.Unfortunately, Buhles story is not unique. Her experience serves as a stark reminder of the dangers of unsafe abortions and the importance of access to safe, legal, and medical abortion care.\n\nUnsafe abortion is defined by the World Health Organization (WHO) as a procedure for terminating an unintended pregnancy carried out either by persons lacking the necessary skills, in an environment that does not conform to minimal medical standards, or both.\n\nThis form of abortion is a neglected public health issue, contributing to 13 percent of maternal deaths worldwide. Researchers suggest as many as one in four African women have experienced abortion, with 99 percent of these abortions deemed unsafe, resulting in one maternal death per 150 cases.Research has shown that the prevalence of unsafe abortion is, to some extent, associated with restrictive abortion laws.\n\nIn Zimbabwe, as in most other African countries, the discourse on the legality of abortion remains complex, leaving a substantial number of women unable to access safe abortion care. This has significantly contributed to the proliferation of backyard abortions.\n\nIn the streets, a silent struggle unfolds. Behind closed doors, in secret clinics and on the black market, women and young girls are forced to seek illegal abortions. The restrictive law, which only allows abortions under limited circumstances, has driven this underground industry.Alarmingly, some medical practitioners, including doctors and nurses, are secretly involved in these illicit activities. They sell abortion pills to women and perform illegal abortions, often in unsanitary conditions.\n\nThe abortion law in Zimbabwe, the Termination of Pregnancy Act (TOP Act) of 1977, only allows abortions under limited circumstances, such as when the pregnancy endangers the mothers life, poses a risk to the childs physical or mental health, or results from rape or incest.\n\nAs a result of this law, law enforcement agencies struggle to keep up with the proliferation of backyard clinics, often run by unqualified practitioners in unsanitary conditions. Raids and arrests are common, but the demand for these services ensures that new operators quickly fill the void.Recently, the Zimbabwe Republic Police arrested a registered nurse after a young woman developed severe complications following an illegal termination procedure.\n\nThe young woman revealed to police that she had purchased abortion pills from the nurse, sparking a wider investigation.According to the police spokesperson for Bulawayo, Assistant Inspector Nomalanga Msebele, the nurse was accused of selling abortion pills. This is not an isolated incident, as numerous reports suggest that some medical practitioners are secretly involved in the illicit trade of abortion pills.We warn medical practitioners, including nurses and doctors, who assist in the illegal termination of pregnancy. Some have been arrested, and their licences can be revoked, said Asst Insp Msebele.\n\nBesides the unnecessary loss of precious lives, the restrictive abortion law in Zimbabwe has far-reaching consequences for girls and young women, shattering their dreams and aspirations.Unplanned pregnancies resulting from a lack of access to safe abortion services force girls and young women to drop out of school. This disrupts their education, hindering their future career prospects and socio-economic mobility.\n\nGirls and young women who become pregnant are often forced to abandon their career goals. The stigma surrounding teenage pregnancy and abortion can lead to social ostracism, making it difficult for them to pursue their aspirations.Recently, the police in Zimbabwe arrested a 20-year-old student and her boyfriend for illegal termination of pregnancy. The girl told the police that she committed the crime because keeping the baby would derail her academic and career goals, forcing her to drop out of school.\n\nHer scenario highlights the complexities and challenges surrounding unplanned pregnancies, particularly for young women in academic environments.The experience of an unplanned pregnancy, followed by the trauma of a backyard abortion or forced motherhood, can have long-lasting psychological effects.Girls and young women may struggle with anxiety, depression, and PTSD, further hindering their ability to pursue their dreams.Without access to education and career opportunities, girls and young women may become economically dependent on their families or partners. This perpetuates cycles of poverty and limits their ability to make independent decisions about their lives.Psychologist Mrs Chenjerai Mbure, who provides counselling to teenage girls and young mothers, highlighted that the societal stigma surrounding abortion and teenage pregnancy can lead to social isolation. As a result, girls and young women may be shunned by their communities, making it difficult for them to access support networks and resources.\n\nSome girls who become pregnant may be forced into child marriage as a way to solve the problem. This further limits their education and career opportunities, perpetuating cycles of poverty and dependence, she said.Access to safe abortion care depends on both the legal and health system context within which abortion is provided, as well as the social and economic context surrounding unintended pregnancies.\n\nThere are growing concerns about reforming Zimbabwes abortion law, the Termination of Pregnancy Act of 1977. Advocates argue that the legislation drives women to desperate measures, putting their lives at risk. They urge policymakers to reconsider the law and provide women with access to safe, legal, and regulated abortion services.Health sector stakeholders have also called for amending the legislation, arguing that it is outdated and fails to address the contemporary needs of women and their health rights.\n\nExecutive Director of Womens Action Group, Mrs Edinah Masiyiwa, said the Act now needs to be amended to address issues faced in contemporary times.When we look at the Termination of Pregnancy Act of 1977, this law has been in place for over 40 years. What we are seeing is that sometimes it is difficult to implement. Firstly, because communities are not aware of the law. Generally, people in Zimbabwe think that abortion or termination of pregnancy is illegal, yet it is legal under various circumstances, said Mrs Masiyiwa.\n\nHealth experts argue that the restrictive nature of this law has led to a significant number of unsafe abortions, resulting in maternal deaths, injuries, and long-term health consequences. In fact, 16 percent of maternal deaths in Zimbabwe are attributed to unsafe abortions.There is a growing need to amend the abortion law in Zimbabwe. The law is outdated and does not align with the countrys constitutional provisions, which guarantee the right to life, health, and dignity.\n\nAmending the law would help to reduce maternal mortality. By allowing access to safe and legal abortions, the number of maternal deaths due to unsafe abortions would decrease.\n\nAmending the law would recognise womens autonomy over their bodies and their right to make informed choices about their reproductive health.By providing access to safe abortion services, the law would help reduce the number of women suffering from abortion-related complications.Overall, there is a pressing need to re-examine and amend the abortion law in Zimbabwe to ensure that it prioritises womens health, well-being, and human rights.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/06/Untitled-1-copy-160.jpg",
            "description": "Obey Sibanda-sacwebezela@gmail.com BUHLE, a 20-year-old university student, finds herself in a desperate situation when she discovers she is pregnant. Fearing the consequences of her parents and friends finding out, she turns to a “friend of a friend” who claims to know how to perform an abortion. The procedure is carried out in a cramped and […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "Illegal miner dies, four escape as mine shaft caves in",
            "url": "https://www.chronicle.co.zw/illegal-miner-dies-four-escape-as-mine-shaft-caves-in/",
            "content": "Raymond[emailprotected]\n\nONE illegal miner died while four of his colleagues escaped unhurt when a mine shaft they were digging for gold caved in at Sunace Mine in Umguza District last Thursday.\n\nThe 17-year-old illegal miner, identified by his colleagues to Sunace Mine authorities as Luckymore Sibanda, was unlucky after a large rock fell on him while the four other omakorokoza dashed to safety.\n\nOn Tuesday morning, the Chronicle visited the mine, a registered entity run by a company known as DG One, where illegal miners have been causing havoc for years by engaging in illegal mining activities at night.They come in groups at night and sneak into disused mine shafts where they dig for gold. In the morning they drag bags of gold ore for processing at milling sites in the area.Last Thursday, four of the omakorokoza came to report that their friend had been trapped in a shaft and that they feared he had been crushed to death by a falling rock, said Sunace Mine security supervisor Mr Muzikababa Makwelo.\n\nThe mine shaft where the accident occurred has not been operational for over 30 years, according to Mr Makwelo.The shaft is one of the several disused mine shafts that were left behind by a German company over 30 years ago, he said.The family of the trapped miner was notified and they visited Sunace Mine on Sunday.The police were also notified.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/tdfgrty-680x380.jpg",
            "description": "Raymond Jaravaza-raymondjaravaza@gmail.com ONE illegal miner died while four of his colleagues escaped unhurt when a mine shaft they were digging for gold caved in at Sunace Mine in Umguza District last Thursday. The 17-year-old illegal miner, identified by his colleagues to Sunace Mine authorities as Luckymore Sibanda, was unlucky after a large rock fell on […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "Holiday Inn hosts lunch for children at Percy Ibbotson Home in Bulawayo",
            "url": "https://www.chronicle.co.zw/holiday-inn-hosts-lunch-for-children-at-percy-ibbotson-home-in-bulawayo/",
            "content": "Trish[emailprotected]\n\nHOLIDAY Inn is today hosting a Christmas lunch at Percy Ibbotson Home in Luveve, as part of the Mayors Christmas cheer fund.\n\nThe event will cater to inmates of Percy Ibbotson Reformatory Home for juvenile offenders and the Luveve Training School for Girls.\n\nBulawayo Mayor, David Coltart is expected to attend.\n\nIn addition to the lunch, Holiday Inn will also donate goods to the home.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2014/08/HOLIDAY-INN-BYO.jpg",
            "description": "Trish Mukwazo-trishmukwazo515@gmail.com HOLIDAY Inn is today hosting a Christmas lunch at Percy Ibbotson Home in Luveve, as part of the Mayor’s Christmas cheer fund. The event will cater to inmates of Percy Ibbotson Reformatory Home for juvenile offenders and the Luveve Training School for Girls. Bulawayo Mayor, David Coltart is expected to attend. In addition […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "FBC Bank launches 24/7 deposit-taking ATMs across major cities",
            "url": "https://www.chronicle.co.zw/fbc-bank-launches-24-7-deposit-taking-atms-across-major-cities/",
            "content": "Online writer\n\nFBC Bank in Zimbabwe has announced the launch of its new Deposit Taking ATMs, allowing customers to deposit cash into their individual accounts or FBC Mastercard Prepaid cards around the clock.This innovative service aims to enhance customer convenience by providing a secure and efficient way to manage finances.Customers can now access these ATMs at several key locations:\n\n *Bulawayo:* Jason Moyo ATM (Stand 108, Corner 11th and Jason Moyo) *Harare:* Borrowdale Branch (Unit 122-125, Sam Levys Village) FBC Centre (45 Nelson Mandela Ave) FBC Forex Centre (76 Samora Machel Ave) *Hwange:* FBC Service Centre (6 Coronation Drive)\n\nThis initiative comes as part of FBC Banks ongoing commitment to improving banking accessibility and customer service. With the new ATMs operational 24/7, customers can deposit cash at their convenience, eliminating the need to visit branches during business hours.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/09/FBC.jpg",
            "description": "Online writer FBC Bank in Zimbabwe has announced the launch of its new Deposit Taking ATMs, allowing customers to deposit cash into their individual accounts or FBC Mastercard Prepaid cards around the clock. This innovative service aims to enhance customer convenience by providing a secure and efficient way to manage finances. Customers can now access […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "Neighbours drag ‘intoxicated teen’ from burning house in Bulawayo",
            "url": "https://www.chronicle.co.zw/neighbours-drag-intoxicated-teen-from-burning-house-in-bulawayo/",
            "content": "Melusi Ncube\n\nNEW Lobengula residents in Bulawayo woke up to the bright light of flames that had engulfed one of the houses in the area in the late hours of yesterday.\n\nA teenager identified only as Sbu who resides in the engulfed house escaped the flames by a whisker and was rushed to Mpilo Central Hospital after being rescued by one of the neighbours. It is suspected he may have been affected by smoke inhalation.\n\nWitnesses said Sbu was last seen heavily intoxicated, which may have resulted in him delaying to react to the fire inside the house.\n\nThe fire brigade said a candle could have caused the inferno.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fbgdfbdfgdf.jpg",
            "description": "Melusi Ncube NEW Lobengula residents in Bulawayo woke up to the bright light of flames that had engulfed one of the houses in the area in the late hours of yesterday. A teenager identified only as ‘Sbu’ who resides in the engulfed house escaped the flames by a whisker and was rushed to Mpilo Central […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "IN PICTURES: 1 620 ZPCS recruits graduate in colourful Ntabazinduna Pass-Out Parade",
            "url": "https://www.chronicle.co.zw/in-pictures-1-620-zpcs-recruits-graduate-in-colourful-ntabazinduna-pass-out-parade/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nA total of 1,620 Zimbabwe Prisons and Correctional Service (ZPCS) recruits graduated on Monday at a colourful pass-out parade at Ntabazinduna Training School in Umguza District, Matabeleland North.\n\nThe graduating cohort consisted of 1,107 males and 512 females from courses 154 and 155.\n\nPresident Mnangagwa, who presided over the ceremony, urged the recruits to shun corruption and abstain from drugs and substance abuse.\n\nPresident Mnangagwa and Zimbabwe Prisons and Correctional Service (ZPCS) Commissioner General Moses Chihobvu(left) and Commandant of ZPCS Ntabazinduna Prison Training School Commissioner Sithokozile Shoko watch recruits drills at the pass out parade of correctional recruits at Ntabazinduna Training School in Matabeleland North Province yesterday. Picture Eliah Saushoma\n\nPresident Mnangagwa stated that drugs and substance abuse threaten national security in various ways and hinder economic development, adding that anyone caught engaging in such unethical behaviour will face the full wrath of the law.\n\nAny form of indiscipline that could taint the reputation of the Service, Government, and nation at large will not be tolerated, he said.\n\nAs new ambassadors of the ZPCS, I challenge you to adhere to high ethical standards and uprightness in your duties.\n\nThe Head of State also emphasised that the integrity of recruits must remain untarnished by selfish interests.I further urge you to work wholeheartedly and diligently, while upholding constitutionalism and professionalism. Your integrity must remain untarnished by selfish interests, said President Mnangagwa.\n\nZPCS Commissioner-General Moses Chihobvu told the recruits that the core values of the prison service should serve as guiding principles in their new roles as Correctional Officers.\n\nIt is crucial that you apply everything imparted to you during your training, and in so doing, you must not fail in effectively carrying out your respective responsibilities, said Commissioner Chihobvu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ed-passout1-680x380.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw A total of 1,620 Zimbabwe Prisons and Correctional Service (ZPCS) recruits graduated on Monday at a colourful pass-out parade at Ntabazinduna Training School in Umguza District, Matabeleland North. The graduating cohort consisted of 1,107 males and 512 females from courses 154 and 155. President Mnangagwa, who presided over the ceremony, urged the […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        },
        {
            "title": "Dreadlocked man found dead in Bulawayo- police appeal for identification of body",
            "url": "https://www.chronicle.co.zw/dreadlocked-man-found-dead-in-bulawayo-police-appeal-for-identification-of-body/",
            "content": "Tarisiro[emailprotected]\n\nTHE unidentified body of a man was recently found by the roadside behind Mckeurtan Primary School in Bulawayo.\n\nOn December 15, 2024, at around 6PM, a 34-year-old man finished his shift at work and noticed an unknown person sleeping in the same spot. Assuming the person was drunk and would wake up later, he left. However, when he returned the following morning at around 7 AM, he discovered that the individual was still in the same position and showed no signs of life. A police report was subsequently made.In a statement, Deputy Bulawayo Police Spokesperson Nomalanga Msebele said the deceased had natural dreadlocks and was wearing a woollen hat with yellow, red, white, and black stripes, a navy blue jacket featuring a white logo of Great Zimbabwe on the back, black and greyish track bottoms, a white shirt, green socks, and white tennis shoes. Upon inspection, no visible injuries were noted. A search of the body revealed a small packet of unprocessed tobacco in his trouser pocket. The body has since been taken to Mpilo Mortuary.\n\nAsst Insp Msebele urged the public to always carry some form of identification.This practice aids in police investigations and facilitates quicker closure for relatives. We appeal to anyone who may be missing a male adult matching the above description to contact ZRP Mzilikazi at (02922) 77619 or 74439, or visit the nearest police station, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/02/ggghj.jpg",
            "description": "Tarisiro Tafirenyika-tarisirotafirenyika@gmail.com THE unidentified body of a man was recently found by the roadside behind Mckeurtan Primary School in Bulawayo. On December 15, 2024, at around 6PM, a 34-year-old man finished his shift at work and noticed an unknown person sleeping in the same spot. Assuming the person was drunk and would wake up later, […]",
            "time": "20:43",
            "date": "17 Dec 2024"
        }
    ]
}