{
    "news": [
        {
            "title": "Stable ZwG defies  the odds",
            "url": "https://www.chronicle.co.zw/stable-zwg-defies-the-odds/",
            "content": "Prosper Ndlovu, National News EditorZIMBABWE has clocked a full year since the adoption of the Zimbabwe Gold Currency (ZWG), which has achieved commendable stability evidenced by low inflation and exchange rate predictability, anchored by prudent monetary policy management and other supportive Government measures.\n\nReserve Bank of Zimbabwe (RBZ) introduced the ZWG in the market on April 5 last year, and since then the local unit has defied the odds, amid growing market confidence with positive impact on the entire economy.\n\nDespite scepticism and resistance to transact using the local currency by some speculators, major monetary policy indicators have shown that the ZWG is gaining higher economic momentum.\n\nPrudent monetary policy formulation and implementation pursued by the apex bank since April 2024, has been credited for creating relative price, currency and financial stability in the economy, RBZ Governor, Dr John Mushayavhanu, has said.\n\nThe stability is evidenced mainly by the lower monthly ZWG inflation, which stabilised to 0,5 percent in February this year and -0,1 percent last month.\n\nSignificant decline in money supply growth is also consistent with the tight monetary policy stance of the apex bank. As a result of this stance, the RBZ has succeeded in curtailing the pass-through effects of money supply to the exchange rate and inflation.\n\nThe RBZ has committed to sustaining this momentum with higher stakeholder support, building a path to long-term de-dollarisation, and has vowed to do whatever it takes to ensure that prices remain stable, notwithstanding external pressures and headwinds from the global economy.\n\nThere has also been greater exchange rate stability with foreign exchange parallel market premiums crumpling below 20 percent from about 100 percent.\n\nThe exchange rate has been relatively stable since October 2024 with the premium narrowing in September of the same year to levels around 20 percent in March 2025 in line with the stabilisation of the parallel market rate to around ZWG33-34 per US-dollar.\n\nHopes are high that the additional measures to deepen the foreign exchange market announced in the Monetary Policy Statement on February 6, 2024 would further reinforce the prevailing stability on the exchange rate front.\n\nForeign currency inflows on the hand have risen from US$11 billion in 2023 to US$13,3 billion in 2024, resulting in continuation of current account surpluses since 2019. The increased availability of foreign currency to cater for all bona fide foreign payments and the sustained financial sector stability and soundness tells the whole story, said Dr Mushayavhanu.\n\nThese are contained in a comprehensive report issued by the RBZ over the weekend, which gives a snapshot of the recent monetary, currency, price and financial developments in the country  one year since the adoption of the ZWG.\n\nThe Reserve Bank re-affirms its commitment to walk the talk of consistent and prudent monetary policy management to sustain price, currency and financial stability, said the Governor.\n\nAs such, the reserve bank will remain vigilant to any emerging domestic and external risk to inflation while simultaneously putting in place appropriate measures to strike the delicate balance between stability and economic growth, he added.\n\nThe obtaining low inflation and exchange rate stability anchored by prudent monetary policy management and other supportive measures will continue to be the guiding monetary policy frame work of the reserve bank.\n\nWithin this context, inflation expectations are expected to remain well-anchored with month-on-month inflation projected to average below three percent in 2025 consistent with exchange rate stability.\n\nGive the base effects largely caused by the spike in monthly inflation in October 2024, annual inflation is expected to start at relatively higher levels between April 2025 to September 2025, said Dr Mushayavhanu. Going forward inflation is expected to significantly moderate to end the year 2025 at less than 30 percent, thus supporting the envisaged economic growth of six percent in 2025.\n\nSimilarly, ZWG loans have grown at an average of one percent per week since October 2024 compared to 6,9 percent during the period before September 27, 2024.\n\nIn that regard, Dr Mushayavhanu said the proportion of the local currency deposits now sits at 15,95 percent while total loans amounted to ZWG50,70 billion as at March 2025, with the proportion of the local currency denominated loans being 12,04 percent.\n\nThe RBZ Governor said the banks foreign reserves accumulation strategy has continued to bear positive fruit as attested by the significant build-up of foreign currency reserves, from US$276 million at the end of April 2024 to US$629 million as of last month.\n\nThe foreign reserves have been adequate to cover reserve money as per Reserve Banks commitment and are also currently sufficient to cover the entire ZWG deposits in the banking sector, pointing to the sustained ZWG stability, he said.\n\nAnchored on these measures, Dr Mushayavhanu said Zimbabwe has continued to receive foreign currency inflows enough to cover its external obligations and leaving a sizeable surplus.\n\nThe surplus, which averaged US$400 million per month for the 14 months from January 2024 to February 2025 has been crucial in supporting domestic transactions, he said.\n\nDr Mushayavhanu said foreign currency receipts averaged US$1,1 billion per month during the period January 2024 to February 2025 while the countrys external obligations averaged US$784 million per month during the same period.\n\nMeanwhile, the RBZ has said concerted efforts are being made to ensure delivery of new higher value ZWG bank notes in the shortest possible time for enhances convenience by the transacting public.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ndfgnvcxz.jpg",
            "description": "Prosper Ndlovu, National News Editor ZIMBABWE has clocked a full year since the adoption of the Zimbabwe Gold Currency (ZWG), which has achieved commendable stability evidenced by low inflation and exchange rate predictability, anchored by prudent monetary policy management and other supportive Government measures. Reserve Bank of Zimbabwe (RBZ) introduced the ZWG in the market […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "7 out of 30 ambulances working, Residents exposed to  expensive private sector charges",
            "url": "https://www.chronicle.co.zw/7-out-of-30-ambulances-working-residents-exposed-to-expensive-private-sector-charges/",
            "content": "Andile Tshuma and Raymond Jaravaza, Chronicle WritersONLY seven ambulances are operational in Bulawayo out of an estimated fleet of 30 required to render efficient emergency services, forcing residents to turn to private operators whose service cost is often beyond the reach of many.\n\nCouncil ambulances charge US$11 or the equivalent of the local currency while private ambulance services cost upwards of US$30.\n\nBulawayo needs 30 ambulances for efficient and timely emergency services that covers all the 28 wards in the city.\n\nAn efficient public ambulance service plays a crucial role in providing pre-hospital care, rapid patient transport and emergency medical response for all the citys residents.\n\nHowever, Bulawayo City Council (BCC) Chamber Secretary, Mrs Sikhangele Zhou, has revealed that the citys ambulance services is heavily stretched as it is operating with a depleted fleet.\n\nOur ambulance section has inadequate ambulances. We have resuscitated two old ambulances to bring the number of operational ambulances in the city to only seven, she said.\n\nFive of the ambulances have state-of-the-art equipment with life support systems but the two old ambulances that were resuscitated are not that well equipped.\n\nThe two ambulances only have the bare minimal equipment and are only used to transport stable patients to hospital. The city needs 30 ambulances against the seven that we have at the moment, said Mrs Zhou.\n\nShe was speaking during a recent passout parade for fire fighters at the Bulawayo Fire Brigade where she stated that council is sometimes forced to refer residents to private ambulance services when they are overwhelmed, an alternative that residents resist.\n\nWe urge residents to accept that sometimes we may refer them to private ambulance services when we are overwhelmed but they sometimes object to that, said Mrs Zhou.\n\nResidents must understand that the decision to refer them to private ambulance services is not because we dont want to assist them but all our ambulances will be out on duty and it would take longer to attend to new cases.\n\nShe said last year council made a provision to acquire four ambulances but the procurement process failed after the bidder who won the tender failed to deliver.\n\nCouncil will continue to budget for more ambulances in the future, said Mrs Zhou.\n\nMinister of State for Bulawayo Provincial Affairs and Devolution, Judith Ncube, said Government was exploring ways to chip in and boost the citys emergency service capabilities by acquiring more ambulances to add onto the existing fleet.\n\nMinister Judith Ncube\n\nLast year I led a delegation to Belarus with the City Director of Health Services, Dr Edwin Mzingwane, and he identified areas where Bulawayo needs assistance such as ambulances and fire tenders, she said.\n\nUpon our arrival back in Bulawayo, we submitted our report to Central Government and we are waiting for a response. Its a cause for concern that Bulawayo is operating with just seven ambulances, said Minister Ncube.\n\nShe noted that private ambulance services are expensive and beyond the reach of many residents hence the need to revive council ambulances as they provide a vital service.\n\nBulawayo United Residents Association (Bura) chairman Mr Winos Dube said residents have resorted to hiring private vehicles to ferry loved ones to hospital.\n\nIts sad that in times of emergency residents now resort to asking neighbours to rush their relatives to the nearest hospital because council ambulances take too long to attend to calls or they never come.\n\nSome emergencies require an ambulance. For example, serious injuries or in the case of victims of crimes like stabbings. Hiring a vehicle from a neighbour or friend in those situations is an option, said Mr Dube.\n\nTurning to the costs of private ambulance services, Mr Dube said vulnerable members of society such as pensioners, the elderly and child headed families rely heavily on council ambulances that are not only cheap but also offer reasonable payment plans.\n\nPrivate ambulance services demand hard cash up front and a majority of residents cannot afford those charges, he said.\n\nResidents dont always have cash lying around for emergencies but council ambulances can rush a loved one to hospital and payments can be made later, he said.\n\nCivic society leader, Mr Thembelani Dube, a former administrator with the Bulawayo Progressive Residents Association (BPRA), urged council to improve financial discipline to set aside funds for the procurement of essential service vehicles such as ambulances.\n\nSticking to budget allocations, especially in the health sector, could help council procure essential equipment and ambulances. The health of residents should be prioritised. Not all residents can afford private ambulance services, said Mr Dube.\n\nHe noted that council has a provision that allows ambulance service charges to be billed on monthly utility rates.\n\nLast September, a Belarusian delegation visited major referral hospitals in the city to explore avenues for collaboration in health care.\n\nThe visiting delegation was led by Mr Dzmitry Serhamasau, a representative of the Belarus Ministry of Health, and they toured Ingutsheni Central Hospital, Mpilo Central Hospital, United Bulawayo Hospitals (UBH), Joshua Mqabuko Nkomo Ekusileni Medical Centre and Mzilikazi Clinic.\n\nZimbabwe and Belarus signed a Memorandum of Understanding (MoU) covering key sectors, including health, education, agriculture and trade.\n\nThe tour of the referral hospitals was meant to deepen the collaboration between the two countries in the area of health, positioning the citys public health sector for significant transformation through medical personnel exchange programmes and health care investments.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vcxbxcvbc.jpg",
            "description": "Andile Tshuma and Raymond Jaravaza, Chronicle Writers ONLY seven ambulances are operational in Bulawayo out of an estimated fleet of 30 required to render efficient emergency services, forcing residents to turn to private operators whose service cost is often beyond the reach of many. Council ambulances charge US$11 or the equivalent of the local currency […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Listed companies bullish about growth prospects",
            "url": "https://www.chronicle.co.zw/listed-companies-bullish-about-growth-prospects/",
            "content": "Business ReporterSEVERAL listed companies are confident about prospects for growth, profitability, and consolidation of operations this year, taking advantage of the solid economic growth forecast.\n\nZimbabwes listed companies trade on the Zimbabwe Stock Exchange (ZSE) and the Victoria Falls Stock Exchange (VFEX), which trade exclusively in United States dollars.\n\nIn their financials for the year ending December 31, 2024, the companies said they will prioritise cost containment and operational efficiencies while pursuing revenue growth initiatives.\n\nConstruction firm Masimba Holdings said the Governments economic stabilisation efforts may lead to improved investor confidence, facilitating public and private sector projects.\n\nThe company said infrastructure development remains a priority, supported by both governmental initiatives and foreign investment.\n\nOverall, while opportunities for growth exist, careful navigation of risks will be essential for the sustainability and success of the construction sector.\n\nThe group projects growth in turnover and profitability in 2025, supported by a strong order book and diversification strategies in the infrastructure development space, said group chairman Mr Gregory Sebborn in the statement of the financials.\n\nHe noted that the contracting order book remained robust, particularly in the roads sub-sector. Mr Sebborn said limited liquidity availability in the market hampered effective execution, leading to cash flow challenges and an increasing debtors book.\n\nThe Government projected a six percent economic growth for 2025, a significant rebound from the two percent achieved in 2024, driven by anticipated improvements in agricultural output and power generation.\n\nFinance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, is also optimistic about the countrys economic prospects, saying the country can capitalise on emerging energy minerals to sustain economic momentum.\n\nProf Ncube also highlighted the economys positive trajectory will ride on the local currency, Zimbabwe Gold (ZWG), as a key stabilising factor while emphasising the importance of maintaining a tight monetary stance, which has yielded positive results in supporting the value of ZWG and ensuring fiscal discipline with controlled budget deficits.\n\nDiversified group Innscor Africa said attainment of critical volume mass is central to the groups ability to unlock operating efficiencies and economies of scale.\n\nThe group said another critical aspect of overall business performance is the ability to efficiently manage both the bill of materials and operating expenditure lines.\n\nImprovements have been made in both these areas, but increased emphasis will be directed towards further optimising these lines in the period ahead.\n\nAt group level, revenue increased by 11,5 percent from US$480,41 million to US$535,79 million. The group ended the interim period on December 31, 2024, with a profit of US$33,44 million, and remained in a healthy cash position for the period.\n\nStock broking firm IH Securities said, despite expectations of constrained bottom-of-the-period liquidity from the drought, Innscor volumes remained strong in the\n\nfirst-half with a focus largely on protecting and optimising critical consumer price points in response to VAT regulations.\n\nFrom the improvements in rainfall, the expectation is of a mild uptick in consumer liquidity in the 4Q25, giving room for further growth of volumes, IH said.\n\nIt said the raw material pipeline, post the summer crop harvest, is expected to be more localised, with the group having planted 6 700 hectares of cereals in the summer cropping season and a further 6 700 hectares planned for winter wheat.\n\nWhile the widespread capital programme has largely wound down, outstanding projects currently underway include a new fully automated bakery production line in Harare as well as upgrades to the Aspindale Stockfeed plant.Forward-looking, the group expects upside from efficiencies from the recently installed factory capacity with a focus on ensuring the requisite returns on investment are reached, IH said.\n\nDairibord Holdings achieved a consolidated volume growth of 10 percent in the year under review, driven by strong performance in the liquid milks and foods categories, though constrained by a marginal one percent growth in beverages.\n\nThe company said the liquid milks 20 percent year-over-year growth was due to an increased raw milk supply, with notable market share gains across Chimombe, Steri and Lacto.\n\nFood sales volume rose 47 percent, led by Yummy yoghurt and ice cream, while improved product availability bolstered Rabroy Tomato Sauce sales.\n\nBeverages realised only one percent growth, impacted by subdued Pfuko Maheu performance due to pricing challenges from the sugar tax and VAT adjustments.\n\nUSD sales volume rose to 83 percent of total volume, up from 79 percent in the corresponding prior-year period, while exports grew by 13 per cent year over year, contributing eight percent to total sales revenue.\n\nGroup chairman Mr Jonathan Sachikonye said community development remains a priority, with a particular focus on empowering small-scale farmers who are integral to the groups supply chain.\n\nHe said the group had placed strong emphasis on regional expansion through export growth and the toll manufacturing model in South Africa to diversify revenue streams and increase foreign currency earnings.\n\nMr Sachikonye said to improve liquidity, the group was implementing measures to accelerate inventory turnover, shortening the cash operating cycle and tightening its credit risk management practices to reduce the risk of customer default.\n\nCBZ Holdings said Zimbabwes economic growth will be supported by a strong recovery in agriculture, bolstered by improved rainfall during the 2024/25 season, as well as expansion in mining and power generation.\n\nIt said these factors are expected to enhance productivity and stimulate broader economic activity.\n\nIn that regard, the group remains well-positioned to capitalise on both local and regional emerging opportunities through driving financial innovation to create sustainable long-term value, it said.\n\nThe group said it continues to trade positively, delivering a strong financial performance for the year-ended December 31, 2024, achieving a profit after tax of ZiG168,05 million for the year.\n\nCBZ said its subsidiaries diversity was critical to ensure clients are well catered for in meeting their financial services needs, allowing it to play a key financial intermediation role in the economy.\n\nThe Zimbabwe National Chamber of Commerce (ZNCC), earlier in the year, expressed optimism regarding medium-to-long-term macro-economic stability and business prospects in 2025.\n\nHowever, the chamber said it continued to press for a reduction in electricity tariffs, which have become a major cost burden for businesses across various sectors.\n\nIn addition, the chamber is calling for a comprehensive review of the Intermediated Money Transfer Tax (IMTT), arguing that the current rate is excessive and hinders business transactions.\n\nFurthermore, ZNCC is advocating a downward review of corporate taxes to enhance business competitiveness, encourage investment, and establish a market-determined exchange rate regime.\n\nThe measures are crucial for alleviating the financial pressures faced by businesses and fostering a more conducive environment for economic growth and development, said ZNCC president Mr Tapiwa Karoro.\n\nFinancial economist Mr Malone Gwadu said cost containment, innovation, and adaptability to current market and economic realities remained critical cornerstones for any companys resilience and medium to long-term growth and sustainability.\n\nTraditional business models may not be watertight enough to withstand modern-day market trends of cut-throat competition. Revenue-enhancing strategies such as diversifying and backward integration to capture previous costs as revenue are also another survival strategy for companies to look into, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/trhdfgdghdf.jpg",
            "description": "Business Reporter SEVERAL listed companies are confident about prospects for growth, profitability, and consolidation of operations this year, taking advantage of the solid economic growth forecast. Zimbabwe’s listed companies trade on the Zimbabwe Stock Exchange (ZSE) and the Victoria Falls Stock Exchange (VFEX), which trade exclusively in United States dollars. In their financials for the […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "COMMENT: ZWG holds its own in formal market",
            "url": "https://www.chronicle.co.zw/comment-zwg-holds-its-own-in-formal-market/",
            "content": "The Zimbabwe Gold (ZWG) marked its first anniversary on Saturday.\n\nSave for the turbulence the gold-backed tender hit late August last year that led to the central bank devaluing it on September 27 by 43 percent and a month or two that followed for it to find its footing again, the ZWG has generally been stable over the past 12 months.\n\nLocal currency inflation has been stable again in recent months as it was in the currencys first four months last year. Prices rose by an average 0,5 percent in ZWG terms in February and -0,1 percent in March. This has helped moderate weighted inflation.\n\nThe currency has held its own at around 27 to the dollar on the formal market.On the street, it is trading at between 33 and 36 to the greenback.\n\nConfidence in the local tender is increasing too especially in the formal market but the informal side is still trading in foreign currency.\n\nWe are encouraged by the performance of the ZWG since its launch and remain hopeful that the reason why it has performed that well  a tight monetary policy stance by the Reserve Bank of Zimbabwe  will be maintained well into the future.\n\nThe Reserve Bank re-affirms its commitment to walk the talk of consistent and prudent monetary policy management to sustain price, currency and financial stability, said central bank Governor, Dr John Mushayavanhu in a release at the weekend.\n\nDr John Mushayavanhu\n\nAs such, the reserve bank will remain vigilant to any emerging domestic and external risk to inflation while simultaneously putting in place appropriate measures to strike the delicate balance between stability and economic growth. The obtaining low inflation and exchange rate stability anchored by prudent monetary policy management and other supportive measures will continue to be the guiding monetary policy frame work of the reserve bank.\n\nWe look forward to the ZWGs share of all transactions concluded in the economy growing and growing.That will be a strong indication of the transacting public gaining confidence in the note, ensuring that the Government achieves its de-dollarisation roadmap as initially scheduled.\n\nDr Mushayavanhu said that the central bank will issue new ZWG bank notes in the shortest possible time.\n\nThis is very good news for the transacting public, especially that segment which is unbanked that wants to have the physical ZWG in their hand instead of the US$ or the rand.Yes, digital money is convenient and is future-facing but there is a need for authorities to achieve a balance to embrace those of us who do not have a bank account, a mobile phone or computer.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/zig.jpg",
            "description": "The Zimbabwe Gold (ZWG) marked its first anniversary on Saturday. Save for the turbulence the gold-backed tender hit late August last year that led to the central bank devaluing it on September 27 by 43 percent and a month or two that followed for it to find its footing again, the ZWG has generally been […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Artistes rejoice as Justice Ministry suspends Zimura’s $150 fee",
            "url": "https://www.chronicle.co.zw/artistes-rejoice-as-justice-ministry-suspends-zimuras-150-fee/",
            "content": "Mbulelo Mpofu,Zimpapers Arts and Entertainment Hub\n\nThe Ministry of Justice, Legal and Parliamentary Affairs has suspended the controversial $150 cover band licence fee imposed by the Zimbabwe Music Rights Association (Zimura), offering a sigh of relief to musicians and industry stakeholders.\n\nThis follows a week of heated back-and-forth between arts governing body, the National Arts Council of Zimbabwe (NACZ) and Zimura, after the former directed the collecting society to cancel the fee  a directive Zimura initially resisted.\n\nNational-Arts-Council-of-Zimbabwe\n\nZimura, a collective management organisation responsible for the licensing and collection of royalties on behalf of musicians, proposed early this year, demanding that cover bands pay $150 per show for the right to perform copyrighted music. This move was met with strong opposition from artistes, unions like the Zimbabwe Musicians Union (ZiMU), and music commentators, who deemed the fees exorbitant and harmful to the industry. Critics argued that the tariff could cripple live performances, burden musicians and event organisers, and stifle the growth of the music sector.\n\nIn a letter dated April 4, the ministry, which regulates collective management organisations under the Copyright and Neighbouring Rights Act (Chapter 26:05), directed Zimura to halt the tariff immediately.\n\nIt has come to our attention that you are requiring cover bands and third parties to pay a licence fee of US$150 and 30 percent of total sponsorship to your organisation, reads the letter.\n\nPlease note that the Copyright Office is still seized with the approval of all Collective Management Organisations (CMOs) tariffs for the year 2025, and the 30 percent remittance to Zimura is unprecedented.\n\nTherefore, in terms of Section 111 of the Act, you are hereby directed to suspend the levying of the cited tariffs until a determination has been made by the regulator in consultation with all relevant stakeholders.\n\nThe ministrys directive followed a letter from Zimuras head of licensing, Servious Matiza, addressed to the managing director of Ecobank. In the letter, Zimura requested that 30 percent of the banks sponsorship budget be allocated to music licensing and copyright royalties.\n\nThe intervention has been welcomed with many describing it as a critical moment for Zimbabwes creative sector. ZiMU hailed the decision, stating that Zimuras actions were exploitative and detrimental to the music industry.\n\nZimuras predatory scheme has inflicted significant damage on our industry, said ZiMU president Edith WeUtonga Katiji.\n\nZiMU president, Edith WeUtonga Katiji\n\nThis intervention is a crucial step toward dismantling Zimuras 43 years of destructive practices. We commend the Ministry of Justice, NACZ, fellow artistes, supporting organisations, media, and the public for standing with us.\n\nMusic analyst Plot Mhako welcomed the suspension, stating, Zimura was fast becoming a law unto themselves. The ministrys directive brings much-needed clarity and accountability. The arts sector thrives on structure, not unilateral decisions. This intervention protects event organisers and the integrity of the entire industry.\n\nFlorence Nyamazana, founder of the Chivavarira National Mbira Arts and Culture Association, echoed similar sentiments.\n\nWe are relieved. This tariff only served to stifle artistic growth. It was counterproductive and didnt support the industry because the fee was simply exorbitant, she said.\n\nZiMU went further, calling for a complete overhaul of Zimuras leadership. In a scathing statement, the union accused the board of gross negligence and allowing executives to run the organisation like a mafia, allegedly extorting money from struggling artistes. The unions demands include, immediate dismissal of the current Zimura board, a forensic audit of Zimura finances dating back to 2010, and termination of the current management team led by executive director Polisile Ncube-Chimhini and Henry Makombe as well as the establishment of a transparent, artiste-led collective management organisation.\n\nContacted for comment, Ncube-Chimhini said, The board is deliberating at the moment.  Follow on X: @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vvdcxcvxcvx.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub The Ministry of Justice, Legal and Parliamentary Affairs has suspended the controversial $150 cover band licence fee imposed by the Zimbabwe Music Rights Association (Zimura), offering a sigh of relief to musicians and industry stakeholders. This follows a week of heated back-and-forth between arts governing body, the National Arts […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Laundry maids, water barons cash in on Bulawayo water crisis",
            "url": "https://www.chronicle.co.zw/laundry-maids-water-barons-cash-in-on-bulawayo-water-crisis/",
            "content": "Peter Matika,[emailprotected]WATER challenges in Bulawayo have led to the emergence of water barons who have taken control of water sources in most western residential areas.\n\nAdditionally, water and laundry maids have also capitalised on the situation by offering laundry services at these sources for a fixed rate.\n\nThe city is facing an acute water shortage that has seen city suburbs going for weeks without running water.\n\nResidents are now forced to buy bottled water for consumption while relying on borehole water for laundry and ablution.\n\nThe lack of functional bowsers has also left residents in dire situations, with many forced to rely on unsafe water sources or expensive private suppliers.\n\nA survey yesterday by Chronicle established that water barons have emerged and charge a minimum of US$2 for 100 litres of water.\n\nI never thought I would have to pay for water. We have had no running water for weeks, and its heartbreaking to see my children going without.\n\nWe are forced to pay for free water at our water sources. Its a serious predicament; we are now buying bottled water for drinking every day and using borehole water for laundry and bathing, said a resident in a water queue in Lobengula Extension suburb.\n\nAnother resident in New Magwegwe suburb said given the scarcity of water, a new group of individuals has found a way to thrive.\n\nThese individuals have stepped in, offering laundry services at water sources for a fixed fee, capitalising on the growing need for reliable access to water, said Mr David Dube.\n\nA young woman who offers laundry services at one of the boreholes in the neighbourhood said:\n\nI charge a flat rate for laundry. People need clean clothes, and with the water situation, I am just trying to help while making a living.\n\nWhile the emergence of water barons and service providers like water and laundry maids speaks to the ingenuity of the community, it also highlights the desperation many are facing.\n\nThe citys enduring water crisis has sparked conversations about the need for sustainable solutions, infrastructure improvements, and accountability from local authorities.\n\nIt is high time Government takes action and walk the talk. This is a dire situation. There are long-term plans that are being implemented, but we need short-term plans to address the situation immediately. The issue of long queues at boreholes will surely give us headaches. There are vulnerable girl children. Drugs are soon to flow without effort, and this all needs to be considered, said Gogo Nyathi.\n\nBCC recently announced that residents are set to endure severe water shortages for the next two to three weeks as the local authority awaits procurement of crucial spare parts for damaged pumps that are being sourced outside the country.\n\nWith the main pumping stations operating at only 50 percent capacity, daily water supply has dropped from 90 million litres to 45 million litres, severely impacting reservoirs and high-lying suburbs.\n\nThe Criterion reservoir, which is the primary source that supplies Magwegwe, 6J, and Hillside reservoir, is receiving half its usual volume due to pump failures.\n\nBulawayo Town Clerk, Mr Christopher Dube, said as a result of the operational challenges, areas such as Emganwini, Nkulumane, and Pumula are particularly affected as they rely on off-takes from the struggling Magwegwe reservoir.\n\nHe said when Magwegwes levels dropped below 50-70 percent, households in elevated areas faced prolonged dry taps.\n\nMr Dube said restoring water supply under the circumstances is extremely difficult due to several factors including filling main reservoirs.\n\nHe said the reduced flow from Criterion will take much longer to fill up the main reservoirs  Magwegwe, 6J, and Hillside.\n\nA woman carries a bucket of water on her head in Lobengula, Bulawayo yesterday\n\nRecharging pipelines is also another factor as the pipelines are empty for extended periods, they need to be completely refilled before water can reach residential properties. This process takes time.\n\nThe situation is compounded by low water levels in the citys supply dams, with Bulawayo mayor, Councillor David Coltart, having advised that the water-shedding programme will stay, as the citys dams did not get substantial amounts of water from the rainfall season.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/vcxhbhstcvx.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw WATER challenges in Bulawayo have led to the emergence of water barons who have taken control of water sources in most western residential areas. Additionally, water and laundry maids have also capitalised on the situation by offering laundry services at these sources for a fixed rate. The city is facing an acute […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Bosso stumble again . . . settle for third straight draw in Triangle",
            "url": "https://www.chronicle.co.zw/bosso-stumble-again-settle-for-third-straight-draw-in-triangle/",
            "content": "Oscar Rusenga in Triangle, Zimpapers Sports HubTriangle 1-1Highlanders\n\nHIGHLANDERS patchy form continued in the Lowveld heat yesterday as they were held to a 1-1 draw by Triangle United in a Castle Lager Premier Soccer League encounter played at the newly homologated Gibbo Stadium.\n\nWhile Bosso showed flashes of improvement in their overall play, especially in the second half, the result marked their third consecutive draw, a growing concern for coach Kelvin Kaindu as the Bulawayo giants early-season momentum stutters.\n\nFor Triangle United, the match was not just a game, but a lifeline.\n\nKelvin Kaindu\n\nWinless in their opening four fixtures, the Sugar Sugar Boys were desperate to avoid another loss, and they rose to the occasion in their first home outing of the season. Coach Luke Vahombe Masomere, under pressure following a string of poor results, will see this gritty performance as a possible turning point.\n\nI think we played very well, said Masomere.\n\nWe were under immense pressure to get a result, we had gone for four games without a single point. At least we have somewhere to start from.\n\nThat one point is very important. We are now just a point away from Bikita Minerals and not far off from the rest of the teams. Highlanders is a well-organised team and a draw is not bad for us.\n\nThere was added significance to the occasion as Gibbo Stadium hosted top-flight football for the first time this season after receiving the greenlight from Zifa just a week ago. The stadium will serve as home ground for both Triangle United and league debutants Bikita Minerals, who have relocated from Sakubva in Mutare.\n\nZifa president Nqobile Magwizi toured the venue ahead of kick-off and expressed satisfaction with the upgrades made to meet league standards.\n\nTriangle, clearly buoyed by the home support and the return to familiar surroundings, started with purpose and took a surprise lead in the 13th minute  albeit through a sequence of events Highlanders will be eager to forget.\n\nBosso veteran and captain Ariel Sibanda, recalled to the starting line-up ahead of under-fire Raphael Pitisi, misjudged a long-range attempt from Joel Munsaka. In a moment of panic, Sibanda realised he was sliding outside his area with the ball still in his hands. He released it mid-slide but could not recover quickly enough as\n\nTawanda Chatuluka reacted first to slot home from close range  his first-ever topflight goal.\n\nIt was another blow for a Highlanders goalkeeping department that has already come under scrutiny this season. Pitisi was responsible for several errors in previous matches, forcing Kaindu to reshuffle the pecking order, but this decision also backfired.\n\nAnd Triangle werent done. In the 21st minute, Munsaka came close to doubling their lead with a thunderous shot that beat Sibanda but ricocheted off the underside of the bar and back into play.\n\nHighlanders took time to find their rhythm but gradually gained control of the midfield through the intelligent distribution of Ali Sadiki and the energy of Mason Mushore. Despite increasing possession, their first-half attacking efforts were largely toothless and they trailed 1-0 at the break.\n\nThe second-half, however, began with a noticeable change in tempo.\n\nBossos equaliser came in the 52nd minute and was a well-executed team goal. Never Rauzhi made a darting run down the right flank, combining neatly with Melikhaya Ncube in a flowing one-two move. Rauzhi then delivered a pin-point cross into the area, which Mushore met with a firm finish to level the match at 1-1.\n\nIt was no less than Highlanders deserved after their positive spell either side of half-time, but despite applying more pressure in the final quarter, they couldnt find a winner.\n\nKaindu, though pleased with his sides comeback, remains concerned by the avoidable nature of the goals his side are conceding.\n\nThe only consolation that we have is that we managed to pick a point in a game that we were trailing, he said.\n\nIn the rest of the games, we have been the ones in command but failed to hold on to the lead.\n\nOnce again today we made a mistake that I feel we could have avoided. But we came up strong in the second-half and got the equaliser. Still, there is a lot of work that needs to be done, especially in terms of the way we defend, because we gifted them with the goal they scored.\n\nHighlanders have now drawn three matches on the trot, including previous stalemates against GreenFuel and newcomers Scottland. While they remain unbeaten in five games, the inability to turn dominance into three points is becoming a trend that Kaindu must urgently address.\n\nWith tricky fixtures ahead, including a return to Barbourfields next week, Bossos title ambitions could hinge on how quickly they fix the minor issues that are denying them maximum points.\n\nTriangle, on the other hand, will take heart from their spirited performance and look to build momentum in their upcoming match against fellow strugglers Bikita Minerals.\n\nI am happy with the way we have improved in terms of performance, added Masomere.\n\nWe havent improved in terms of results yet, but going into the next game, we are aiming for nothing but maximum points.\n\nAs things stand, both teams walk away from this contest with positives  but for different reasons. For Triangle, the point offers hope; for Bosso, it adds to the growing sense of missed opportunity.\n\nTeams\n\nTriangle United: Hamilton Makainganwa, Kelvin Damalakunda, Carlos Musimwa, Jordan Pedra, Arnold Mawadza, Reginalt Ngazima, Tyler Mugoniwa, Tawanda Chatuluka, Menford Mudzimu, Joel Munsaka, Ali Sadiki\n\nHighlanders: Ariel Sibanda, Talent Dube, Arthur Ndlovu, McKinnon Mushore, Melikhaya Ncube, Reason Sibanda, Malvern Hativagoni, Brighton Ncube, Andrew Mbeba, Mason Mushore, Never Rauzhi\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/cxvcxcvxcvx.jpg",
            "description": "Oscar Rusenga in Triangle, Zimpapers Sports Hub Triangle 1-1Highlanders HIGHLANDERS’ patchy form continued in the Lowveld heat yesterday as they were held to a 1-1 draw by Triangle United in a Castle Lager Premier Soccer League encounter played at the newly homologated Gibbo Stadium. While Bosso showed flashes of improvement in their overall play, especially […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Cricket vs concerts: Queens Sports Club justifies Bulawayo Shutdown show",
            "url": "https://www.chronicle.co.zw/cricket-vs-concerts-queens-sports-club-justifies-bulawayo-shutdown-show/",
            "content": "Vusumuzi Dube and Brandon Moyo\n\nTHE proprietors of Queens Sports grounds  the Queens Sports Club have revealed that the hosting of the Bulawayo Shutdown Show at their venue is above board and is as per the lease agreement with Zimbabwe Cricket (ZC).\n\nThis comes after a statement from ZC last week distancing itself from the upcoming 9th annual Pacific Bulawayo Shutdown Show, set for Saturday, April 26, 2025. In their statement, ZC asserted that, as custodians of the citys ceremonial home of cricket, they had not sanctioned the event and opposed the use of the venue for non-cricket purposes  a stance that sparked a dispute with the organisers, who maintain that they paid the required fee to secure the grounds.\n\nIn a press release issued on Saturday, the Queens Sports Club Board of Management clarified that, under the terms of their current lease with ZC, the club retains the right to host social events and other activities at the venue, alongside cricket matches.\n\nThe board further noted that the lease agreement with ZC is set to expire in December.\n\nWe note with concern that this public communication (ZC statement) was released without prior formal engagement at the board level, as has been the case before about the issue between ZC  as our tenant  and the Club, as the landlord. This has unfortunately created unnecessary public confusion and tension.\n\nWe wish to reassure all stakeholders that long-standing issues relating to this event have been adequately addressed over the years. Robust safeguards have been put in place to ensure smooth and responsible hosting. Ironically, ZC itself has previously hosted similar entertainment events  without the Clubs prior consent and, in certain cases, without remitting payment, said the board.\n\nThey further noted that while ZCs consent is required, it can only be denied when a cricket fixture is scheduled on the same day.\n\nAccording to the official fixtures calendar provided to us before the event was advertised, there is no scheduled cricket match on April 26, 2025. The next Test Series and other games are only slated for June 2025, posing no scheduling conflict. This is according to information availed to us and which is in the public domain.\n\nFor the avoidance of doubt, Harris Entertainment (organisers of the Bulawayo Shutdown) is our duly approved and authorised partner to host social events at the Sports Ground, in line with the Club Constitution and our lease agreement with ZC.\n\nThey have consistently acted in good faith, and notably, organised this very event in partnership with Zimbabwe Cricket for over seven years. We are left to ask: What has changed now? they noted.\n\nThey further revealed that as a non-profit club, they rely on such events to sustain their financial responsibilities, including utilities, city council rates, and other operational costs.\n\nCurrently, ZC pays a nominal rental of US$800 per month while occupying 75 percent of the Club grounds  a figure that does not cover their proportional share of city council rates. It is regrettable when senior public officials choose to make disparaging remarks on social media without full knowledge of the facts or the lease terms.\n\nWe seek that we all exercise restraint and work together as Bulawayo. Despite these challenges, the board remains committed to fostering a co-operative and respectful relationship with Zimbabwe Cricket. We are currently engaging with ZC in good faith to resolve the matter amicably, reads the statement.\n\nZimbabwe will host South Africa and New Zealand for two Tests each between June and August at Queens Sports Club.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/tyutyrtdy.jpg",
            "description": "Vusumuzi Dube and Brandon Moyo  THE proprietors of Queens Sports grounds — the Queens Sports Club have revealed that the hosting of the Bulawayo Shutdown Show at their venue is above board and is as per the lease agreement with Zimbabwe Cricket (ZC). This comes after a statement from ZC last week distancing itself from […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Upswing of activity in Gokwe",
            "url": "https://www.chronicle.co.zw/upswing-of-activity-in-gokwe/",
            "content": "Blessings Chidakwa, Zimpapers Political HubWITH just 12 days to go before the April 18 Independence Day celebrations, the spotlight is on the sprawling district of Gokwe, nestled in the heart of the Midlands province.\n\nAs Gokwe prepares to host the grand national fete, preparations for the massive gathering have sparked major developmental strides across the district.\n\nRoads, once bumpy and difficult to navigate, are being rehabilitated, making transportation easier for locals and visitors alike. Schools and clinics are receiving much-needed facelifts, and the regions water and sanitation systems are being revitalised.\n\nFor a community that had long felt neglected, the hosting of the independence celebrations has proven to be a game-changer. In the Gokwe North district, educational institutions are experiencing revival. Schools like Nembudziya Secondary and Nyamuroro Primary are among the biggest beneficiaries, receiving massive infrastructure upgrades.\n\nNyamuroro High School will host the Childrens Party on April 17, while Nembudziya Government High School will host the Independence Day Gala.\n\nThe main celebrations will be held at Nembudziya Growth Point.\n\nService providers have accelerated works at the main venue, the Gokwe North Open Grounds, and impressive progress has been achieved in lawn-planting, terracing, construction of changing rooms, floodlight installation and construction of ablution blocks.\n\nNyamuroro High School is undergoing a vast makeover through the building of two ablution blocks and two learners hostels, both of which are almost complete.\n\nAt Nembudziya Government High School, the gala site, construction of one ablution block and two classroom blocks, a domestic science laboratory and a senior science laboratory have reached wall plate level, with roof fitting being the next phase.\n\nAccording to Engineer Trevor Magwaza, the chief director in the Ministry of Local Government and Public Works, the Government is funding the construction of several new buildings at Nembudziya High School.\n\nThese include an administration block and several classrooms, which are rapidly nearing completion. The new dormitories are well on their way to completion, and the existing buildings are being spruced up for the occasion.\n\nThe roofing materials arrived last week, signalling that the project is on track for completion ahead of time, said Eng Magwaza.Nembudziya High School deputy head Mrs Estheri Mbavha said for years, the community has been yearning for such improvements.\n\nWe have always dreamed of having a state-of-the-art administration block at our school. We have waited for a long time for the dream to come true. We are grateful that Gokwe has been given the honour to host these Independence Day celebrations.\n\nThe changes are not limited to education and infrastructure, as the business community in Gokwe has also felt the ripple effect of the celebrations.\n\nMutora Business Centre, a key commercial hub in the district, is buzzing with activity as businesses prepare to cater for the influx of visitors for the national event.\n\nThe palpable anticipation for April 18 is already manifesting in a tangible upswing of activity throughout local shops and markets in Gokwe district, a clear indicator of the economic vitality this event has unleashed.\n\nA Gokwe resident, Mr Thabo Marurenza, said: We are witnessing an encouraging influx of visitors to our area, breathing new energy into our community. More and more people are coming into our area as we get closer to April 18. The very thought of the atmosphere that will envelop Gokwe on April 18 sends shivers of excitement down my spine. It is truly going to be a momentous occasion that will leave everlasting memories.\n\nI feel that Gokwe has been divinely blessed and this blessing will leave a trail of prosperity and a positive impact for our beloved home.\n\nZanu-PF Midlands province chairperson Cde Edison Chiherenge echoed the optimism, highlighting how the region is being transformed. We are seeing roads being rehabilitated, schools installing solar-powered boreholes and other infrastructural projects. Gokwe will never be the same again, he said.\n\nThe theme for this years independence celebrations, Zim @45: Devolve and Develop Together Towards Vision 2030, reflects this commitment to inclusive development.\n\nPresenting the Post-Cabinet Briefing on Tuesday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said the Independence Day celebrations will leave legacy projects that will have short-term and long-term impacts.\n\nRegarding legacy projects, Government has adopted short and long-term plans for the Midlands province in general, and Gokwe districts in particular. Long-term interventions include the ongoing rehabilitation of roads and related infrastructure under the Emergency Road Rehabilitation Programme.\n\nThe short-term interventions include the regravelling and surfacing of major feeder roads to and from Nembudziya Growth Point for completion prior to 17th April, 2025. A cumulative total of 129 boreholes have been drilled in Gokwe districts, with seven boreholes having been drilled at the venue site.\n\nHe said to ensure efficient health delivery during and after the celebrations, multiple services have been mobilised.\n\n. . . 10 emergency health management teams; 10 ambulances; an air ambulance, and emergency kits. A VIP ward, isolation centre and 16 telemedicine centres . . . have been established. Construction of a mortuary and extension of a ward are already underway at Nembudziya Hospital, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/xcvbvbfxvbx.jpg",
            "description": "Blessings Chidakwa, Zimpapers Political Hub WITH just 12 days to go before the April 18 Independence Day celebrations, the spotlight is on the sprawling district of Gokwe, nestled in the heart of the Midlands province. As Gokwe prepares to host the grand national fete, preparations for the massive gathering have sparked major developmental strides across […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        },
        {
            "title": "Chitembwe takes blame as CAPS crash again",
            "url": "https://www.chronicle.co.zw/chitembwe-takes-blame-as-caps-crash-again/",
            "content": "Eddie Chikamhi, Zimpapers Sports HubCAPS United 1-2 Ngezi Platinum\n\nCAPS United coach Lloyd Chitembwe took full responsibility for his teams latest defeat yesterday, as the Harare giants struggles continued with a 2-1 home loss to Ngezi Platinum Stars at Rufaro Stadium  a result that sparked fan protests and police intervention.\n\nChitembwe, a man known for his measured words and loyalty to the CAPS cause, faced the media visibly dejected. His side had just suffered their third loss in five Castle Lager Premiership matches, and a section of furious Makepekepe fans had vented their frustrations by barricading the main exit, temporarily trapping the team bus and the coachs car inside the stadium.\n\nIt is a natural reaction, said Chitembwe, taking a calm but resolute stance in the aftermath.\n\nTo me, I find it very, very logical. There is this expectation about the team, and CAPS United is CAPS United. I have been here long enough to understand what this football club is all about. Results are what matter at the end of the day.\n\nIf the results are not coming, naturally people will react. This is very, very normal. There is nothing abnormal with that kind of reaction. That is expected. As a club, I think the club needs to find a way to manage that kind of situation.\n\nChitembwe made no excuses. He didnt shield himself with clichs or vague explanations. Instead, he laid bare his position with rare frankness.\n\nLloyd Chitembwe\n\nIt is the sole responsibility of the coach to make sure the team wins matches. It is my responsibility, and that responsibility does not lie with anyone else.\n\nI am that kind of a person who does not shy away from that kind of responsibility. I am responsible big time because at the end of the day, the decisions that I make are a reflection on the team.\n\nIt has not gone well, not only with the supporters, but it has also not gone down well with the players. They are also not happy. It has not gone down well with even myself. I am not happy.\n\nThe defeat was another hard pill to swallow for CAPS United fans, who watched their side slip into the relegation zone, 16th on the table with just four points from five games. The result also extended their miserable record against Ngezi Platinum Stars  a team they last beat in 2017. Since Ngezis promotion in 2016, theyve now won eight of the sides head-to-heads, while CAPS have only managed two.\n\nCAPS United started brightly in front of a sparse but expectant crowd, and nearly took the lead 19 minutes in when Jayden Bakaris glancing header was superbly tipped over the crossbar by Ngezi goalkeeper Darlington Murasiranwa.\n\nBut it was the visitors who broke the deadlock in the 41st minute. CAPS defenders failed to clear their lines following a save by Harmony Nare, and Obriel Chirinda pounced on the loose ball to put Ngezi in front.\n\nThe Green Machines response was spirited at first. Chitembwe made early adjustments in the second-half, bringing on Nyasha Chintuli to add urgency. Their equaliser came in the 68th minute, albeit through a stroke of fortune. Defender Gomezani Chirwa, under pressure from a well-delivered Erick Manokore freekick, headed past his own goalkeeper to gift the hosts a lifeline.\n\nFor a brief moment, the stadium found its voice. But it didnt last long.\n\nJust four minutes later, Ngezi Platinum Stars restored their lead with a goal that will be remembered long after the dust of this game settles. Ashwin Karengesha, who had been a lively presence throughout, received the ball on the edge of the area, beat his marker with a quick feint, and curled a sublime shot past Nare and into the top corner. It was a moment of brilliance that summed up the difference between the two sides on the day.\n\nCAPS tried to claw their way back into the match but lacked the composure and cutting edge required in the final third.\n\nThey came close twice in the dying minutes. First, Tanaka Shandirwa failed to properly connect with a loose ball inside the box following a fumble by Murasiranwa.\n\nThen, defender Brighton Manhires header from a corner smacked against the upright with the keeper beaten.\n\nDespite their late flurry, Makepekepe were left empty-handed once again. And as the final whistle blew, frustration boiled over.\n\nSecurity had to be tightened at the stadium gates as a group of CAPS supporters  some of whom chanted slogans and demanded change  blocked the stadium exit. Police and private security eventually dispersed the crowd, allowing the players and technical team to leave the venue.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/NVCNXFBV.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub CAPS United 1-2 Ngezi Platinum CAPS United coach Lloyd Chitembwe took full responsibility for his team’s latest defeat yesterday, as the Harare giants’ struggles continued with a 2-1 home loss to Ngezi Platinum Stars at Rufaro Stadium — a result that sparked fan protests and police intervention. Chitembwe, a man […]",
            "time": "06:34",
            "date": "07 Apr 2025"
        }
    ]
}