{
    "news": [
        {
            "title": "Man stabs wife with screwdriver",
            "url": "https://www.chronicle.co.zw/man-stabs-wife-with-screwdriver/",
            "content": "Trish Mukwazo[emailprotected]A BULAWAYO man was fined US$120 or two months in jail for stabbing his wife with a screwdriver following a domestic feud.The victim sustained lacerations on the chest as a result of the attack and had to be rushed to hospital.Tushonupane Mwembe (28) of Cowdray Park was convicted of physical abuse by Western commonage magistrate Mr Archie Wochihunga.In passing the sentence Mr Wochihunga noted that cases of physical abuse are on the rise.The courts should frown upon such offenders so that the community will see that the courts do not condone such behaviour, he said.The prosecutor Ms Audrey Kufandikamwe told the court that the incident occurred on 13 December last year around 9 pm when Mwembe stabbed his wife Ms Anna Mleya with a screwdriver on her back after the two had a misunderstanding.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Trish Mukwazo trishmukwazo515@gmail.com A BULAWAYO man was fined US$120 or two months in jail for stabbing his wife with a screwdriver following a domestic feud. The victim sustained lacerations on the chest as a result of the attack and had to be rushed to hospital. Tushonupane Mwembe (28) of Cowdray Park was convicted of physical […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "Mbuyiseni Ndlozi resigns from EFF",
            "url": "https://www.chronicle.co.zw/mbuyiseni-ndlozi-resigns-from-eff/",
            "content": "Mbuyiseni Ndlozihas become the latest member of theEconomic Freedom Fighters(EFF) to resign from the party following his suspension.\n\nNdlozi confirmed his resignation in an interview with the SABC on Sunday night, saying he had decided to leave party politics and make contributions outside that arena.\n\nI have handed over my resignation. I have left the EFF, I have left party politics. EFF is a political party. I have handed in my resignation as a member, and it is because where I want to go and contribute, I cant hold a single-party membership, he said.\n\nBut overall, I think that Ive made my contribution, and I think that there are brilliant young men and women, old men and women in the space who will continue in that category, as it were, of party politics.\n\nNdlozis move comes after months of speculation about his future in the Red Berets.\n\nHis departure follows those of other high-profile EFF members this year, including former deputy leader Floyd Shivambu, former national chairperson Dali Mpofu, former public protector Busisiwe Mkhwebane and former government spokesperson Mzwanele Manyi, all of whom defected to Jacob ZumasuMkhonto weSizwe (MK) party.\n\nIn January, Ndlozi resigned as an MP after losing his position in the EFFs central command team during the partys national elective conference in December. The rift between Ndlozi and the Red Berets came after thedeparture of his close ally Shivambu, which saw the former being sidelined from EFF discussions.\n\nEFF leader Julius Malema criticised party members for not pledging allegiance to the party after alleging that Ndlozi was aware of Shivambus plans to defect to the MK party but did not say anything.\n\nIn one instance, Malema indirectly criticised Ndlozis wife, actress Mmabatho Montsho, after she liked an Instagram post by Shivambu announcing his defection.\n\nIn his interview, Ndlozi confirmed that he was barred from attending the EFF national peoples assembly in December and had been suspended six weeks before it. He said this was because of reports that he was among the EFF leaders waiting for the right moment to defect to the MK party. Ndlozi said it was not his responsibility to inform the EFF leadership of Shivambus plans to leave the party.\n\nHe described the suspension as irregular, arguing that it did not align with the partys constitution.\n\nI was told to stay at home and not participate in parliament and the rest of the activities of the EFF. It was very important for me because they said that the investigation is still ongoing; when it is finished, Ill then be given an opportunity to respond. I think we can agree that these are very serious allegations, he said.\n\nNdlozi said his decision to speak out was aimed at clearing his name.\n\nThe EFF has not issued a formal response to his resignation, but party spokesperson Sinawo Thambo said his public pronouncements constituted a resignation and that the party wished him well.\n\nNdlozi was a founding member of the party and previously served as its national spokesperson and an MP.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Mbuyiseni-Ndlozi-1_1200x675-1000x563-680x380.jpg",
            "description": "Mbuyiseni Ndlozi has become the latest member of the Economic Freedom Fighters (EFF) to resign from the party following his suspension. Ndlozi confirmed his resignation in an interview with the SABC on Sunday night, saying he had decided to leave party politics and make contributions outside that arena. “I have handed over my resignation. I have left the […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "Soulful vibes: Mzoe 7 readies ‘Ungamthanda’ single, visuals release",
            "url": "https://www.chronicle.co.zw/soulful-vibes-mzoe-7-readies-ungamthanda-single-visuals-release/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nMusician Mzoe 7 is set to release his latest track, Ungamthanda, on Wednesday, accompanied by visuals.\n\nThe song features fast-rising artistes Smashmaker and Macala, while the music video was shot by Brooklyn Films at Lavinia Gardens, Tshabalala, and Chiefs Village. The visuals will also feature model and fitness trainer Klate alongside dancer Siya.\n\nSpeaking to Chronicle Showbiz Online, Mzoe 7 said this release is part of his promise to fans to drop new projects every month.\n\nI had the honour of working with Smashmaker on the song Tshilamoya, and I realised how talented he is  he brought out the soulful side of my music. After that, he sent me another beat just as I was returning from a seminar, where a speaker emphasised the importance of loving without expecting anything in return.Inspired by that, I crafted the lyrics for Ungamthanda, flipping the message to highlight the pain of loving someone who doesnt love you back.\n\nI also featured the incredibly talented Macala. Nurturing young talent is crucial because we wont be here forever. Its important to leave behind a solid legacy, and I believe these two artistes represent the future of our music industry. Their talent is out of this world.\n\nMzoe 7 further explained that the song tells the story of a young man who has given up on love, only for his friend to encourage him to remain hopeful but not to expect the same level of affection in return.\n\nOn the choice of locations for the video shoot, Mzoe 7 said it was important to showcase local landmarks and tell authentic stories.This soulful song speaks to the inner person, and Im confident that people will love it. As promised, I will be releasing a music video every month, as fans have been asking for more content.\n\n@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/llmmk.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Musician Mzoe 7 is set to release his latest track, Ungamthanda, on Wednesday, accompanied by visuals. The song features fast-rising artistes Smashmaker and Macala, while the music video was shot by Brooklyn Films at Lavinia Gardens, Tshabalala, and Chiefs Village. The visuals will also feature model and fitness trainer Klate alongside dancer […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "SA-based author Kudakwashe Muganu nominated for Emerge Africa Awards",
            "url": "https://www.chronicle.co.zw/sa-based-author-kudakwashe-muganu-nominated-for-emerge-africa-awards/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nZimbabwean-born author Kudakwashe Muganu, who is based in South Africa, has been nominated for the 2025 edition of the Emerge Africa Awards.\n\nNow in its fourth edition, the Emerge Africa Awards celebrates and honours some of the most influential individuals, brands, and organisations across the continent.\n\nMuganu, a writer, transformation speaker, certified life coach, philanthropist, and entrepreneur is vying for the Best Motivational Speaker of the Year award, competing against fellow author Mohammed Talks. He is calling on Zimbabweans to rally behind him and cast their votes to help secure the accolade.\n\nExpressing his excitement about the nomination, he told Chronicle Showbiz Online: Im very excited to be nominated and recognised  it truly shows that hard work pays off. I strongly believe I can bring the award home as I represent my beloved country, Zimbabwe.\n\nMuganu has authored two books: The Power of Wisdom and Who Does Not Want to Quit School?These books opened doors for me, leading to invitations to speak at high-profile platforms. City of Ekurhuleni and the Gauteng Province Department invited me as a guest speaker. I have also addressed several local schools and appeared on Soweto TV and radio stations such as Radio Pulpit, Jozi FM, Alex FM, Kasie FM, Vumani FM, and Nzhelele FM for motivational sessions, he said.\n\nMuganu is proud that his message has reached audiences beyond Zimbabwe, inspiring communities across Southern Africa. He urged his fellow Zimbabweans to support his bid for the award.I cannot do this alone  your votes matter. Lets bring this award home and put Zimbabwe on the map!\n\nTo vote for Muganu, South African-based supporters can send an SMS to 37587 with the text AFRICA 230.\n\nFollow Mthabisi Tshuma on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ugb.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Zimbabwean-born author Kudakwashe Muganu, who is based in South Africa, has been nominated for the 2025 edition of the Emerge Africa Awards. Now in its fourth edition, the Emerge Africa Awards celebrates and honours some of the most influential individuals, brands, and organisations across the continent. Muganu, a writer, transformation speaker, certified […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "Mlue Jay collaborates with Flash Ikumkani for “Lotto” song",
            "url": "https://www.chronicle.co.zw/mlue-jay-collaborates-with-flash-ikumkani-for-lotto-song/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nSometimes, dreams feel just out of reach, and lotteries have become a beacon of hope for millions, offering the promise of unimaginable wealth and transforming lives overnight.\n\nNow, stepping into this narrative is Johannesburg-based rapper Mlue Jay, who seeks to capture the essence of this phenomenon in his new song, Lotto which features South African hip-hop sensation Flash Ikumkani.\n\nThe YeahWeLit Entertainment studios boss explosive collaboration titled, Lotto is set to drop on February 21 accompanied by visuals.\n\nMlue Jay told Chronicle Showbiz that the song, is an anthemic trap song that delves into the universal desire to succeed and rise above the struggles of everyday life. The tracks themes of perseverance and determination are reflected in our artistes gritty verses, which explore the notion of working tirelessly to achieve success  even if it means winning the lottery.\n\nProduced by US-based producer N1, who previously collaborated with Mlue Jay on the Impumelelo Intro featuring Vusa Mkhaya, Lotto boasts an infectious beat and masterful production. The song was mixed and mastered by Mlue Jay at YeahWeLit Entertainment Studios.\n\nThe Izono hit-maker said Flash Ikumkani, a prominent figure in South African hip-hop, brings his signature style to the track and boasts over a million streams across platforms and a stint at Emtee Records.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/zxaxsq.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Sometimes, dreams feel just out of reach, and lotteries have become a beacon of hope for millions, offering the promise of unimaginable wealth and transforming lives overnight. Now, stepping into this narrative is Johannesburg-based rapper Mlue Jay, who seeks to capture the essence of this phenomenon in his new song, “Lotto” which […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "All set for Cde Chigudu’s burial",
            "url": "https://www.chronicle.co.zw/all-set-for-cde-chigudus-burial/",
            "content": "Thousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu.\n\nBuses ferrying mourners from the provinces are still arriving, setting the stage for a huge send-off.\n\nThe former Zanu PF Manicaland provincial chairperson and a distinguished civil servant, Cde Chigudu, died last Wednesday and was declared a national hero by the President on Friday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tre.jpg",
            "description": "Thousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu. Buses ferrying mourners from the provinces are still arriving, setting the stage for a huge send-off. The former Zanu PF Manicaland provincial chairperson and a distinguished civil servant, Cde Chigudu, […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "Live coverage: Zimbabwe bids farewell to national hero Cde Chigudu",
            "url": "https://www.chronicle.co.zw/live-coverage-zimbabwe-bids-farewell-to-national-hero-cde-chigudu/",
            "content": "February 10, 2025\n\nLive coverage: Zimbabwe bids farewell to national hero Cde Chigudu\n\nLive coverage: Zimbabwe bids farewell to national hero Cde Chigudu\n\nAll set for Cde Chigudus burial\n\nThousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu.\n\nBuses ferrying mourners from the provinces are still arriving, setting the stage for a huge send-off.\n\nThe former Zanu PF Manicaland provincial chairperson and a distinguished civil servant, Cde Chigudu, died last Wednesday and was declared a national hero by the President on Friday.\n\nChigudu a stern disciplinarian\n\nNational Hero, Cde Tinaye Elisha Nzirasha Chigudu, has been described as a stern no-nonsense disciplinarian.\n\nZanu PF Council of Elders member Cde David Parirenyatwa whose late father and national hero Tichafa Samuel Parirenyatwa worked with Cde Chigudu during the liberation struggle, said he was a straight forward man.\n\nYes, my father, as you know, was the vice president of ZAPU, before the formation of ZANU PF. They worked very closely with my father.\n\nThe type of person who was, what I can tell you, he was a stern disciplinarian, that I know, that he really loved discipline, he said.\n\nCde Parirenyatwa added: I think he has been well-recognized by his Excellency, the President, Dr Mnangagwa and I think its a well-deserved national national hero\n\nVice Presidents, Cde Kembo Mohadi and Dr Constantino Chiwenga have arrived at the National Heroes Acre for the burial of Cde Chigudu.\n\nThe body of national hero Cde Chigudu has arrived at the National Heroes Acre.\n\nPresident Mnangagwa and First Lady Amai Dr Auxillia Mnangagwa have arrived at the National Shrine for the burial of Cde Tinaye Elisha Nzirasha Chigudu.\n\nCde Chigudu remembered\n\nIn an interview on the sidelines, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere expressed gratitude to President Mnangagwa for bestowing national hero status on Cde Chigudu.\n\nMinister Muswere chronicled his personal relationship with the late national hero.\n\nPresidential Advisor Dr Paul Tungwarara said he learnt a lot from Cde Chigudu.\n\nVeterans of the Liberation Struggle Affairs Deputy Minister Headman Moyo said he worked with the national hero Cde Chigudu.\n\nCde Chigudu was among the first cadres to go to the liberation struggle under ZIPRA and he was a very principled cadre, he said.\n\nWe know him very well. He worked with us well before his demise.\n\nActing Minister of Home Affairs and Cultural Heritage Ziyambi Ziyambi is now on the podium to direct the ceremony.\n\nThe Chigudu family representative, Mr Edgar Chigudu says Cde Chigudu is also an icon in the family.\n\nHe thanks President Mnangagwa and the Government for bestowing national hero status on Cde Chigudu.\n\nCde Chigudu was a man of protocol, who always said mukuru mukuru hanga haigare pfunde.\n\nYes he was a political animal but never rigid as you could have an open and frank discussion with him, says Mr Chigudu.\n\nHe says the late national hero lives a legacy in the family as he loved his wife and family.\n\nMinister Ziyambi Ziyambi is back on the podium and chronicles briefly, Cde Chigudus pre and post-independence history.\n\nHe invites President Mnangagwa to give his keynote address.\n\nCde Chigudu was a loyal cadre: President Mnangagwa\n\nPresident Mnangagwa says Cde Chigudus passing is a huge blow to the nation and expresses his deepest condolences to the Chigudu family.\n\nHe plays Cde Chigudu played a pivotal role in the liberation of the country from colonial rule.\n\nThe President says that Cde Chigudu was among many brave, selfless sons and daughters of the soil who took a stand and fought for our Independence.\n\nHe is honoured as one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZIPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU).\n\nHe was deployed as an intelligence operative in the then Salisbury.\n\nAfter the attainment of independence in 1980, the late National Hero, Cde Chigudu, joined the Government as an Assistant Secretary in the Ministry of Transport.\n\nDue to his hard work ethic and dedication to national service, he was promoted to Deputy Secretary in the Ministry of Home Affairs before his elevation to the position of Permanent Secretary in the same Ministry.\n\nCde Chigudu also served as Permanent Secretary in the Ministry of Mines, thereafter as Governor for Manicaland Province.\n\nHis Excellency says Cde Chigudu was a principled and ideologically rooted cadre who actively participated within the ruling ZANU PF Party and Government, with unflinching allegiance, loyalty and commitment.\n\nHe was a fountain of wisdom who offered sound counsel and advice in conducting both Party and Government business, drawing from his vast experience and institutional memory.\n\nHe always exuded the virtues of straight-forwardness and frankness in every aspect of life.\n\nHis integrity, sense of excellence, adherence to truth and honesty left an indelible mark on our body politic.\n\nPRESIDENT MNANGAGWAS ADDRESS AT THE BURIAL OF THE LATE NATIONAL HERO TINAYE CHIGUDU\n\nSpeech National Hero Cde Chigudu FINAL FINAL csd (_250210_103930\n\nSpeech National Hero Cde Chigudu FINAL FINAL csd (_250210_103930\n\nThe body of national hero Cde Chigudu is now being taken to its final resting place.\n\nPresident Mnangagwa hands over the national flag to Mai Chigudu\n\nThe programme has ended at the National Heroes Acre.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/live1-680x380.jpg",
            "description": "February 10, 2025 Live coverage: Zimbabwe bids farewell to national hero Cde Chigudu   Live coverage: Zimbabwe bids farewell to national hero Cde Chigudu All set for Cde Chigudu’s burial Thousands of people from across the country are gathered at the National Heroes Acre for the burial of National Hero, Cde Tinaye Elisha Nzirasha Chigudu. […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "President mourns  Namibia’s founding leader",
            "url": "https://www.chronicle.co.zw/president-mourns-namibias-founding-leader/",
            "content": "Mashudu Netsianda,[emailprotected]\n\nPRESIDENT Mnangagwa yesterday joined other regional leaders in mourning Namibias founding leader, Dr Sam Nujoma, who died on Saturday, describing him as a towering figure of liberation whose legacy will continue to inspire generations across the African continent.\n\nIn a statement, the President hailed Dr Nujomas unwavering dedication to the liberation of Namibia and his commitment to the unity of the Southern African Development Community (SADC).\n\nWe hurt and grieve deeply at the passing on of this gallant freedom fighter and visionary icon who led and delivered Independence and nationhood to the Namibian people, said President Mnangagwa.\n\nZimbabwe and Namibia share strong historical ties, dating back to the liberation struggles of both nations.\n\nPresident Mnangagwa acknowledged Dr Nujomas steadfast support for Zimbabwe, particularly during the Land Reform Programme, when he stood by Harare despite international pressure.\n\nZimbabwe will always remember and cherish Dr Nujomas principled and unconditional support as our nation faced concerted onslaught by vindictive countries of the West, he said.\n\nPresident Mnangagwa said Dr Nujomas legacy was that of a true Pan-Africanist, who championed the independence and sovereignty of African nations and that Africa must remain vigilant against new challenges of resource-induced encroachments.\n\nDr Nujomas demise comes after the death in office of former Namibia President Dr Hage Geingob on February 4 last year, compounding the nations grief.\n\nPresident Mnangagwa expressed solidarity with the Namibian people during this difficult period.\n\nI have no doubt that these repeated tragic losses do not just test your nation; rather, they spur all Namibians on, as they rally together in even greater and stronger unity to move your nation forward, he said.\n\nOn behalf of Government, the ruling Zanu-PF party and the people of Zimbabwe, President Mnangagwa extended his deepest, heartfelt condolences to Namibian President Dr Nangolo Mbumba, the SWAPO party, the Namibian Government and the Nujoma family.\n\nThe revolutionary leader, who guided Namibia to independence from apartheid South Africa in 1990 and served as its first president for 15 years, died at the age of 95.South Africas President Cyril Ramaphosa said the former Namibian president was an\n\nextraordinary freedom fighter who played a leading role in not only his countrys fight against colonialism, but also in the campaign that led to the end of white-minority rule in South Africa in 1994.\n\nPresident Nujomas leadership of a free Namibia laid the foundation for the solidarity and partnership our two countries share today  a partnership we will continue to deepen as neighbours and friends, he said.\n\nThe late former Namibian president Sam Nujoma.\n\nKenyas President William Ruto said Nujoma was a visionary leader who dedicated his life to the liberation and development of his country.\n\nWe stand in solidarity with the people of Namibia in mourning the passing of their founding President Dr Sam Nujoma. President Nujoma was a selfless, courageous and visionary leader who dedicated his life to the liberation and development of his country, he said.\n\nOur thoughts and love are with the family and the people of Namibia at this time of grief. Rest in peace, Africas hero!\n\nZambian President Hakainde Hichilema posted on his X page: Deeply saddened by the passing of Dr Sam Nujoma  freedom fighter, nationalist, Pan-Africanist, and founding President of Namibia. His legacy will live on forever.\n\nDr Nujoma was the founding leader of the South West Africa Peoples Organisation (SWAPO), which spearheaded Namibias fight for freedom. His leadership and vision played a pivotal role in shaping modern Namibia and advancing the cause of Pan-Africanism.\n\nDr Nujoma was born on 12 May 1929, in a village in northwestern Namibia when his country was under South African administration. South Africa had controlled Namibia since World War One after a brutal few decades of German colonial rule, remembered for the genocide of the Herero and Nama people.\n\nAs a boy, he looked after his familys cattle and attended a Finnish mission school, before moving to the coastal town of Walvis Bay and then the capital, Windhoek, where he worked for South African Railways, according to a biography posted on the website of Dr Nujomas charitable foundation.\n\nDr Nujoma left his job at the railways to focus his energies on bringing down the apartheid system. In the late 1950s, he became leader of the Owambo Peoples Organisation, a precursor to the liberation movement SWAPO, organising resistance to the forced relocation of Black people in Windhoek, which culminated in the police killing 12 unarmed people and wounding dozens more.\n\nDr Nujoma was charged with organising the resistance and arrested. In 1960, he went into exile. He travelled across Africa before reaching the United States, where he petitioned the United Nations for Namibias independence.\n\nMade SWAPO leader in absentia, Dr Nujoma established its armed wing and in 1966 launched a guerrilla war against the apartheid government.\n\nIt took more than a decade of pressure from Dr Nujoma and others before a UN Security Council resolution in 1978 proposed a ceasefire and elections, and another decade for the ceasefire deal to be signed and elections to be held in late 1989.\n\nDr Nujoma was the last of a generation of African leaders who brought their countries out of colonial or white minority rule, including the late former President Robert Mugabe, South Africas Nelson Mandela, Zambias Kenneth Kaunda, Tanzanias Julius Nyerere, and Mozambiques Samora Machel.\n\nDr Nujoma spent nearly 30 years in exile as the leader of Namibias independence movement before returning for Parliamentary elections in late 1989, the first democratic vote in the country.\n\nHe was elected president by lawmakers months later in 1990 as Namibias independence was confirmed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/President-Mnangagwa-right-shakes-hands-with-the-late-former-Namibian-president-Sam-Nujoma-in-this-file-photo-680x380.jpg",
            "description": "Mashudu Netsianda, mashudu.netsianda@chronicle.co.zw PRESIDENT Mnangagwa yesterday joined other regional leaders in mourning Namibia’s founding leader, Dr Sam Nujoma, who died on Saturday, describing him as a towering figure of liberation whose legacy will continue to inspire generations across the African continent. In a statement, the President hailed Dr Nujoma’s unwavering dedication to the liberation of […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "Schools shortage hits Cowdray Park",
            "url": "https://www.chronicle.co.zw/schools-shortage-hits-cowdray-park/",
            "content": "Raymond Jaravazam,[emailprotected]\n\nCOWDRAY Park, one of Bulawayos largest and fastest-growing suburbs, is grappling with a severe shortage of schools, clinics, and other essential amenities.\n\nWhile the suburbs population continues to expand rapidly, infrastructure development has failed to keep pace with the growing demand.\n\nAccording to the 2022 Population and Housing Census, Cowdray Park is home to 75 000 residents, spread across more than 27 000 stands, including residential, commercial, and industrial zones.\n\nYet, as the number of houses rises daily, residents are left facing major challenges in accessing basic services, including education.\n\nDespite being the citys largest suburb, Cowdray Park only boasts three secondary schools, comprising the Government-run Cowdray Park Secondary School and two privately owned institutions.\n\nThis scarcity of educational facilities forces many parents to send their children to schools in nearby areas like Luveve, Emakhandeni, or even the city centre  locations that are often miles away from their homes.\n\nIn the Hlalani Kuhle/Garikai area, a makeshift secondary school  Onxy Academy  has emerged to fill the gap. The school, constructed with walls made from metal sheets, currently enrols over 100 students.\n\nSince opening its doors in January 2024, Onxy Academy has become the only educational institution serving the western part of Cowdray Park, known as Esgodweni. The school offers a range of subjects but lacks practical classes like Agriculture, Woodwork, Metalwork, Food and Nutrition, and Fashion and Fabrics.\n\nWe are the only school in this part of the suburb, and our vision is to provide quality education and adequately prepare students for public exams. We opened in January 2024 with an enrolment of just over 100 learners, said Mr Elton Tofa, the school principal.\n\nOur long-term goal is to develop the school into a fully-fledged institution, complete with science blocks, workshops, and sports facilities.\n\nThe schools current infrastructure is modest, and it relies on a staff of just seven educators to manage the diverse needs of its students. Despite these limitations, Onxy Academy has become a lifeline for many families, especially for students like Sipho, a Form Four learner.\n\nSipho, who resides at the far end of Cowdray Park, shared his experience:\n\nIts not easy to get a place at Cowdray Park Secondary School because its always full, and my parents cannot afford to send me to a school in the city centre. Im grateful for Onxy Academy because its close to my home, and many of my friends are here.\n\nLocal resident Orlando Mlilo expressed concern over the lack of sufficient educational options in the area.\n\nCowdray Park is growing at an alarming rate, but the construction of schools is not keeping up. Two years ago, I tried to enrol my son at Luveve High, but they told me that the school only accepts children from the local area, he said.\n\nAccording to 2023 statistics from the Ministry of Primary and Secondary Education, Zimbabwe has 10 517 schools. Ideally, the ratio of schools to population in the country should be about one school for every 1 500 people, based on a 95 percent gross enrolment rate in primary education and a national population of 15 million.\n\nHowever, Cowdray Parks rapid expansion has left the suburb with a severe shortage of secondary schools.\n\nWard 28 Councillor Ntandoyenkosi Ndlovu highlighted the urgency of the situation, particularly during the rainy season when mud and poor road conditions make commuting to schools even more difficult.\n\nThe situation becomes even worse in the rainy season, when learners from the far end of the suburb must walk long distances to Cowdray Park Secondary.\n\nNot all parents can afford to send their children to private schools in the area, so its critical for the government to expedite the construction of additional secondary schools, said Clr Ndlovu.\n\nWith a population of 75 000, Cowdray Park is now the second most populous urban ward in Zimbabwe, after Harares Budiriro, which has over 89 000 residents.\n\nThe suburbs population is larger than that of towns like Gwanda (27 000 residents) and Hwange (40 000 residents). As the population continues to grow, the demand for essential services like education, healthcare, and shopping facilities becomes increasingly urgent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Onxy-Academy-in-Cowdray-Park.jpg",
            "description": "Raymond Jaravazam, raymondjaravaza@gmail.com COWDRAY Park, one of Bulawayo’s largest and fastest-growing suburbs, is grappling with a severe shortage of schools, clinics, and other essential amenities. While the suburb’s population continues to expand rapidly, infrastructure development has failed to keep pace with the growing demand. According to the 2022 Population and Housing Census, Cowdray Park is […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        },
        {
            "title": "SADC-EAC Defence chiefs roped in to end DRC conflict",
            "url": "https://www.chronicle.co.zw/sadc-eac-defence-chiefs-roped-in-to-end-drc-conflict/",
            "content": "Fungi Kwaramba recently in DAR ES SALAAM, Tanzania\n\nChiefs of Defence Forces (CDFs) from SADC and the East Africa Community (EAC) have been given five days to provide technical direction that will ensure immediate ceasefire enforcement in the Democratic Republic of Congo (DRC), facilitate humanitarian aid and develop a security plan for Goma and surrounding areas.\n\nAt the same time, African countries that were backing rebels in the DRC were also directed to immediately leave to give the people of the vast and resource-endowed nation a chance to live in sustainable peace.\n\nSpeaking to journalists upon his return from the joint SADC-EAC summit on Saturday night, President Mnangagwa said the meeting underscored the need for regional co-operation in addressing insecurity in the eastern parts of DRC.\n\nHe said the two blocs had resolved that no individual country should support armed groups responsible for conflict and displacement in the region.\n\nThe summit, co-chaired by President Mnangagwa in his capacity as SADC chairperson and Kenyan President William Ruto as EAC chairperson, focused on strategies to restore peace in the conflict-riddled region.\n\nWell, it was a joint summit of SADC and East African communities and the main issues were the issues of insecurity in the Eastern DRC, said the President.\n\nIt was an attempt by the two blocs  SADC and East African Community  to deal with that in security, trying to find ways where the two blocs can help create peace in that region and identify the parties that are involved in the military contestation in the Eastern DRC.\n\nDespite the complexity of the situation, President Mnangagwa said, consensus was reached that all member States must refrain from supporting or arming any militant groups operating in the region.\n\nOf course, it was very difficult but in the end, it was resolved that all member States should make sure that they do not support groups, armed groups in the region, to cause insecurity on the continent and in that particular area.\n\nOf course, no Member State came forward to say they were supporting an army, but it was very clear that these (rebel) groups were actually allowed to operate from a certain Member State.\n\nIt was agreed that everything must be done to silence the guns, and that they (armed groups) should not be rendered any support by any member State.\n\nIn its communiqu, the joint summit directed that modalities for the withdrawal of uninvited foreign armed forces from the territory of the DRC, be developed and implemented by the two regional bodies top military officials.\n\nThe joint summit reaffirmed solidarity and unwavering commitment to continue supporting the DRC in its pursuit of safeguarding its independence, sovereignty and territorial integrity, as well as sustainable peace, security and development, read the communiqu in part.\n\nThe summit decided that similar consultations shall be convened at least once every year and as and when the need arises to review matters of common interest to the two regions.\n\nApart from that, the summit directed that a joint meeting of ministers of EAC and SADC convenes within the next 30 days to deliberate on:\n\n(a) the report of the joint meeting of CDFs on the ceasefire and cessation of hostilities\n\n(b) establishment of a secretariat-level technical coordination mechanism to monitor implementation of the joint summit decisions\n\n(c) an elaborate road map detailing immediate, medium- and long-term implementation measures, including financing modalities, and address all other residual issues relating to the attainment of sustainable peace and security in the eastern DRC and make appropriate recommendations to the next joint meeting of the EAC-SADC Summit.\n\nThe regional leaders also directed the resumption of direct negotiations with all State and non-State actors, including M23, within the Luanda/Nairobi process framework, while calling for implementation of the Concept of Operations (CONOPS) to neutralise the FDLR and facilitating Rwandas disengagement from the DRC.\n\nSADC and the EAC convened Saturdays joint summit to try and find a lasting solution to the DRC crisis, which has seen rebel groups taking over towns in the eastern parts of the vast country.\n\nApart from SADC Chairman President Mnangagwa, his EAC Counterpart President Ruto, and the host Tanzanian President Samia Suluhu Hassan, there was a huge turnout of regional leaders.\n\nDRCs President Felix Tshisekedi, who accuses Rwanda of backing the rebels in his country, attended the joint summit virtually.\n\nRwandan President Paul Kagame, Ugandan President Yoweri Museveni, South African leader Cyril Ramaphosa, Somalian President Hassan Sheikh Mohamoud and Zambian President Hakainde Hichilema, attended the high-stakes joint summit.\n\nLeaders of Burundi, Angola, Malawi, South Sudan and Madagascar were represented by ministers.\n\nOn Saturday President Mnangagwa told his fellow leaders that Africa must draw from its shared historical solidarity and the unity it used to dismantle colonialism to free the people of the DRC from internecine wars and conflict that undermine development.\n\nAddressing the opening session of the joint summit, President Mnangagwa said Africa should not let the people of DRC down but must, through honest dialogue, find a solution to silence the guns and engender enduring peace in the Great Lakes region.\n\nThe unity, solidarity and unbreakable bonds of the peoples of the continent must stand the test of such trying times, he said.\n\nWe must remain as solidly united as we were during the struggle for the complete emancipation and independence of Africa from colonialism.\n\nWe, thus, have a duty and collective responsibility to comprehensively, frankly, tackle and address the various challenges that are impeding the realisation of peace and security for the people of Eastern DRC.\n\nDrawing from our rich African values and heritage, and further emboldened by the spirit and letter of the United Nations Charter; the Constitutive Act of the African Union as well as the treaties of both SADC and the EAC; let us seize this opportunity to ensure convergence and a coordinated response which is mutually reinforcing towards one common objective.\n\nTowards the ultimate objective of finding last peace in the DRC, President Mnangagwa said talks among regional leaders must always be carried with openness, honesty, flexibility and a commitment to building lasting peace.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/EAC-SADC-summit-on-the-security-situation-in-the-DRC.jpg",
            "description": "Fungi Kwaramba recently in DAR ES SALAAM, Tanzania Chiefs of Defence Forces (CDFs) from SADC and the East Africa Community (EAC) have been given five days to provide technical direction that will ensure immediate ceasefire enforcement in the Democratic Republic of Congo (DRC), facilitate humanitarian aid and develop a security plan for Goma and surrounding […]",
            "time": "18:08",
            "date": "10 Feb 2025"
        }
    ]
}