{
    "news": [
        {
            "title": "Bronze Medal Superiority Separates Bubi and Umguza Going into Lunch",
            "url": "https://www.chronicle.co.zw/bronze-medal-superiority-separates-bubi-and-umguza-going-into-lunch/",
            "content": "Sikhumbuzo Moyo at Manjolo High School in Binga\n\nSUPERIORITY in bronze medals separated Bubi and Umguza districts as they went into the lunch break at the National Association of Secondary School Heads Matabeleland North track and field athletics competition, which roared into action today.\n\nAs athletes and officials broke for lunch, the two districts had seven gold and five silver medals each, but the defending champions Bubi took the top spot with five bronze medals, compared to Umguzas none.\n\nIn third position is Lupane, who went into the break with six gold, four silver, and five bronze medals, while Hwange lies fourth with four gold, an equal number of silver, and six bronze medals.\n\nFifth place went to Tsholotsho, with three gold, four silver, and six bronze medals, while the host district has had a disappointing start to the competition, with just a single gold, six silver, and three bronze medals.\n\nOccupying the last position is Nkayi, with one gold and one silver medal, alongside four bronze medals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/VCXBNFGNXCGBCVN.jpg",
            "description": "Sikhumbuzo Moyo at Manjolo High School in Binga SUPERIORITY in bronze medals separated Bubi and Umguza districts as they went into the lunch break at the National Association of Secondary School Heads Matabeleland North track and field athletics competition, which roared into action today. As athletes and officials broke for lunch, the two districts had […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "Bubi District Leads Day One of Matabeleland North Athletics with Dominant Gold Medal Haul",
            "url": "https://www.chronicle.co.zw/bubi-district-leads-day-one-of-matabeleland-north-athletics-with-dominant-gold-medal-haul/",
            "content": "Sikhumbuzo Moyo at Manjolo High School in Binga\n\nDEFENDING champions Bubi district finished day one of the National Association of Secondary School Heads Matabeleland North track and field athletics competition six gold medals ahead of second-placed Umguza.\n\nBubi secured 16 gold, nine silver, and seven bronze medals, while Umguza ended the day with 10 gold, nine silver, and four bronze medals, pushing Hwange into third place with nine gold, six silver, and eight bronze medals.\n\nEarly pacesetters Lupane are in fourth position with eight gold, the same number of silver medals, and nine bronze.\n\nTsholotsho are in fifth with four gold, eight silver, and nine bronze medals. Nkayi and hosts Binga ended the day in sixth and last positions, having accumulated three gold, the same number of silver, and eight bronze, as well as two gold, nine silver, and seven bronze medals, respectively.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/mbtfcxxcvzbzbzbzbzbzbzbv.jpg",
            "description": "Sikhumbuzo Moyo at Manjolo High School in Binga DEFENDING champions Bubi district finished day one of the National Association of Secondary School Heads Matabeleland North track and field athletics competition six gold medals ahead of second-placed Umguza. Bubi secured 16 gold, nine silver, and seven bronze medals, while Umguza ended the day with 10 gold, […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "Armed robbers gunned down",
            "url": "https://www.chronicle.co.zw/armed-robbers-gunned-down/",
            "content": "Raymond Jaravaza,[emailprotected]THE six-member armed robbery gang who were shot at a tollgate along Bulawayo-Victoria Falls highway early Tuesday morning unleashed terror on two shop attendants in Insuza area, Umguza District before ransacking and getting away with an undisclosed amount of cash, cell phones and other valuables.\n\nThey were adamant that there was gold in the shop and kept demanding access to the mineral during the attack.\n\nThe gang was later fatally shot during a confrontation with police detectives at the tollgate on the outskirts of Bulawayo on their way to the city aboard a Honda Fit vehicle.\n\nThis was after alert detectives had ordered the suspects to stop but instead they hit the boom gate and fired shots towards the police officers, leading to a shoot-out, police said.\n\nOne of the terrified shop attendants, Ms Sibonokuhle Nxumalo, narrated the ordeal to Chronicle yesterday. She said the gang was armed with pistols, knives and axes when they pounced at Young Money General Dealer Shop, one of two grocery shops situated deep in Insuza at Jiba village.\n\nMs Nxumalo said she was attending to customers at the grocery shop at around 8PM, shortly before closing, when two of the suspects came and bought cigarettes. The shop was closed and the gang later attacked around 11PM, demanding gold reportedly kept in safe.\n\nThey were convinced there was gold in the shop, which was not the case. Gold mining activities take place in Nkosikazi area, which is far from here and our employer is not into gold buying or gold mining, said Ms Nxumalo.\n\nShe said the armed robbers spent the day drinking alcohol in the modest rural shop.\n\nThey just seemed like ordinary customers at the time. Little did we know that they were planning something sinister, said Ms Nxumalo.\n\nShe said long after the shop attendants had retired for the night, the gang broke into the shop, tied the employees with an electric cable and ransacked the place.\n\nThey were armed with pistols, knives and axes. They demanded gold and cash but were convinced that there was gold somewhere in the shop, said Ms Nxumalo.\n\nThe stolen items included an unknown amount of cash, groceries, a 48-volt lithium battery, an inverter and an amplifier, a nine-kilogramme gas tank and cellphones.\n\nIt was only after the robbers had left that one of the terrified shop employees frantically sought help at a grocery shop next door and asked for a cellphone to call her employer, who was at another business she owns in Nyamandlovu.\n\nThe call to my boss (Mrs Kholiwe Danisa Dube) was made around 01:30AM on Tuesday morning and she told us to seek refuge at a nearby homestead in case the robbers decided to come back while she called the police, Ms Nxumalo said.\n\nNational police spokesperson Commissioner Paul Nyathi could not be drawn to divulge more information last night saying his office will provide a further update today (Thursday) saying investigations were ongoing.\n\nCommissioner Paul Nyathi\n\nHowever, in an earlier statement, police had said the shooting occurred early Tuesday morning between 2AM and 4AM after the suspects loaded their loot into their getaway silver Honda Fit vehicle, registration number, AEY 4843 and fled.\n\nComm Nyathi said after a report was made to the police, the getaway vehicle was spotted moving towards the tollgate.\n\nDetectives ordered the suspects to stop but instead the suspects fired shots towards the police officers, leading to a shoot-out, he said.\n\nThe suspects went on to hit the boom gate at the toll gate. They were arrested and taken to United Bulawayo Hospitals where they all unfortunately passed on.\n\nComm Nyathi said two pistols with four live rounds were recovered at the scene.\n\nThe Zimbabwe Republic Police reiterates that there is no going back in the fight against armed robbery syndicates in the country. Any form of confrontation by criminals will be responded to through appropriate measures, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/CVXGDCVXCVC.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com THE six-member armed robbery gang who were shot at a tollgate along Bulawayo-Victoria Falls highway early Tuesday morning unleashed terror on two shop attendants in Insuza area, Umguza District before ransacking and getting away with an undisclosed amount of cash, cell phones and other valuables. They were adamant that there was gold […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "Uhuru brings economic growth to Gokwe",
            "url": "https://www.chronicle.co.zw/uhuru-brings-economic-growth-to-gokwe/",
            "content": "Patrick Chitumba,[emailprotected]MORE than 300 youths and women from Gokwe District have been employed in various development projects being rolled out by the Government ahead of the hosting of the 45th Independence Day national celebrations on April 18 in Nembudziya.\n\nThe benefits to locals demonstrate that the decentralisation of independence celebrations has become more than just a change of venue, but also promotes local community participation in development programmes.\n\nPresident Mnangagwa will lead the national Independence Day celebrations under the theme: Zim@45: Devolve and Develop Together Towards Vision 2030.\n\nThe convergence of national celebrations and infrastructural advancement is set to leave a lasting mark, with over 100,000 people expected to attend.\n\nLeading up to the main celebrations, the Childrens Party, hosted by the First Family, is scheduled for April 17 at Nyamuroro High School, with the Independence Gala taking place at Nembudziya Government High School the same evening.\n\nOver 3 000 child delegates will be accommodated at Nyamuroro High School from April 15 to 19.\n\nMajor infrastructure projects are progressing well at the principal event arena, the gala site, and the Childrens Party venue. The Government has so far drilled over 120 boreholes across Gokwe North and South, including at the event sites. The celebrations will feature the lighting of the Independence Flame, the traditional Torch Relay, and a variety of cultural performances by dance troupes and artists from Kwekwe, Gokwe, and other districts.\n\nFootball enthusiasts can look forward to matches between Simba Bhora and FC Platinum during the main celebrations, while Herentals Queens and Black Rhinos will play at the Childrens Party.\n\nIn previous years, Harare hosted the national festivities, but under the Second Republic, President Mnangagwa has directed that the commemorations be rotated across the different provinces, aligning with his administrations vision of leaving no one and no place behind.\n\nRotating the celebrations ensures that all regions of the country benefit from the legacy projects associated with hosting the main event.\n\nZanu PF Midlands Provincial party chairperson Cde Edson Chiherenge said the momentous occasion is ushering in massive developmental projects for Gokwe Nembudziya and other areas.\n\nCde Edson Chiherenge\n\nThere is massive development in Gokwe North District, which has resulted in the employment of over 300 youths and women. Remember, the Government is constructing two state-of-the-art boys and girls hostels at Nyamuroro Secondary School, the venue for the childrens party, he said.\n\nGovernment is rehabilitating Nembudziya High School through erecting a new fence, a borehole, and other developments.\n\nCde Chiherenge said new structures were being put in place at Nembudziya District Hospital, including a new mortuary and a new building for the nursing school.\n\nAll these projects have brought about employment for the people of Gokwe, and we commend the Government for decentralising Independence Day celebrations as a lasting legacy for the local community, he said.\n\nMinister of Primary and Secondary Education, Torerayi Moyo, who toured Nyamuroro Primary School, which will host the childrens party over the weekend, said the decentralisation of independence celebrations has brought economic benefits to the local community, with youths and women being employed in various roles ahead of the event.\n\nAfter the disbursement of funds, we are seeing a lot of work being done at both venues. The school where the childrens party is being hosted is going to benefit a lot, as more hostels and ablution facilities are being built, he said.\n\nWe are happy for this development, and we have witnessed many people being employed.Minister Moyo said that through the decentralisation of national programmes, the Government is fostering economic and social development at the grassroots level.\n\nGovernments decentralisation policy of national programmes is not only bringing the national narrative to the doorstep of its diverse populace but has also become an empowerment tool benefiting youths and women. We commend the Second Republic for bringing this development to us, he said.\n\nMidlands Province construction officer, Mr Jemitious Vhovha, said preparations for the Childrens Party are on course, with officials pleased with the progress recorded to date.\n\nWe are on course with the works here as we have a target to be finished by April 10, ahead of the Childrens Party on April 17. We have all the material we need, and the manpower is also available, he said.\n\nMeanwhile, locals have welcomed the move, praising the Second Republic for its inclusive development agenda.\n\nWe have been given an opportunity to serve our country while getting money to look after our families, said Ms Lorraine Ncube.\n\nAnother villager, Mr Andrew Machaya, expressed excitement over the transformation of Gokwe, saying they never thought it was possible to have such direct opportunities.\n\nOur area is being developed, and most importantly, we got employed, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/Tonderayi-Moyo-630x380.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw MORE than 300 youths and women from Gokwe District have been employed in various development projects being rolled out by the Government ahead of the hosting of the 45th Independence Day national celebrations on April 18 in Nembudziya. The benefits to locals demonstrate that the decentralisation of independence celebrations has become more […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "‘Expo 2025 to create new opportunities for Zim, Japan’",
            "url": "https://www.chronicle.co.zw/expo-2025-to-create-new-opportunities-for-zim-japan/",
            "content": "Business Writer\n\nJAPANESE Ambassador to Zimbabwe, Yamanaka Shinichi, has said Expo 2025 Osaka to be held in his country from April 13 to October 13 this year presents a valuable opportunity for Zimbabwean and Japanese businesses to discover new opportunities for business and collaborations.\n\nAccording to ZimTrade, the countrys premier trade promotion and development body, the value and volume of trade between Zimbabwe and Japan, Asias second-biggest economy after China, remains low despite the long-standing cordial relations between the two countries.\n\nCollaborations between Zimbabwean companies and Japanese information technology (IT) firms, particularly small-scale enterprises, could be highly beneficial.\n\nZimbabwes young and talented human resources hold significant potential for collaborations in the IT sector, including the software industry, Amb Shinichi said.\n\nThe Japanese diplomat was speaking in an interview with Star FM earlier this week to give an update on preparations for the global exhibition, where Zimbabwe will be among several participatingcountries.\n\nJapan holds a strong position in global IT rankings, particularly in innovation and technology, with notable universities and institutions excelling in computer science and engineering.\n\nJapan ranks 13th among 133 economies, according to the Global Innovation Index (GII), which assesses innovation capabilities.\n\nIn terms of technological expertise, Japan consistently ranks among the top countries globally, often appearing in the top 5-10 and is recognised for its advancements in areas like robotics, electronics and automotive engineering.\n\nThat expo will be a good platform for both Zimbabwean and Japanese companies to realise new opportunities for businesses and to find suitable partners for collaboration.\n\nI find good potential in the software business here, by using the young, talented human resources.\n\nAlso, I think it may be useful to collaborate with Japanese IT companies or small-scale companies. They have a very unique and good technology and their decision-making is quite quick and flexible, said Amb Shinichi.\n\nZimbabwe intends to use the global exhibition to grow its investment and trade deals as well as tourist arrivals by 10 and 15 percent, respectively.\n\nThis comes after Zimbabwe successfully participated in Expo 2020 Dubai where it secured trade partnerships and investments from the Asian continent.\n\nFollowing its participation in Expo 2020 Dubai, Zimbabwe achieved several milestones, including the US$250 million joint venture agreement between the Agriculture and Rural Development Authority (Arda) and NV Group of India, to establish a brewery in Masvingo.\n\nThe Zimbabwe Tourism Authority (ZTA) struck a partnership with the Dubai National Air Travel Agency (Dnata) to market local tourism offerings.\n\nThrough its participation in Expo 2025 Osaka, Zimbabwe will showcase its economic potential, and the many investment opportunities in the country, to potential investors from around the world.\n\nThe country will also be able to project its culture and heritage to a global audience, which could help drive interest in the countrys tourism sector and increase visitors to the country.\n\nExpos provide an opportunity for Zimbabwean enterprises to meet and connect with potential investors, new business opportunities and collaborations.\n\nZimbabwe aims to showcase its diverse offerings through exhibitions, B2B meetings, commercial activities, cultural exchanges and demonstrations.\n\nIt will also conduct side events such as trade and investment seminars and business forums, among other activities, to amplify the countrys presence in Japan.\n\nZimbabwe aims to welcome at least three million visitors to its pavilion, showcasing the countrys vast trade and investment opportunities, natural beauty and rich cultural heritage.\n\nThe platform will also raise global awareness of Zimbabwe as a premier destination to live, work, study, visit and conduct business.\n\nAs one of the oldest and largest international events, the expo has been held every five years since 1851, providing a prestigious global platform for showcasing achievements, innovation, collaboration and co-operation.\n\nAmb Yamanaka Shinichi\n\nOver 28 million visitors from across the world are expected to attend the event while over 150 countries have confirmed their participation in this six-month-long exhibition.\n\nZimbabwes participation in the global event presents a unique and invaluable opportunity to strengthen its trade relations with Japan, Asia and the global community.\n\nBy leveraging this platform, Zimbabwe can effectively promote its trade and investment potential, foster new partnerships and enhance its visibility on the international stage.\n\nZimbabwe has over the years been engaging with Japan to establish a trade protocol and pave the way for the export of high-demand products such as avocados and citrus fruits.\n\nThis development is particularly timely, as the growing global population has become increasingly aware of healthier lifestyles, creating a surge in demand for nutritious products.\n\nAs a result, Zimbabwe is well-positioned to capitalise on this trend by expanding its exports of healthy goods, including blueberries, to cater to the rising demand for healthier living options.\n\nZimbabwe also holds significant potential for exporting various oils, with several companies already exploring opportunities in this sector. Avocado oil and citrus oil are just a few examples of the value-added products being developed.\n\nAdditionally, there is a growing interest in heritage-based products, such as amarula and baobab oils, which not only showcase the countrys rich cultural heritage but also offer a unique selling proposition in the global market.\n\nThe Expo, which will run under the theme Designing Future Society for Our Lives supported by three sub-themes Connecting lives, Saving lives and Empowering lives is expected to enhance Zimbabwes visibility, networking opportunities, learning opportunities and competitive analysis.\n\nThe participation of local players at the occasion intends to benchmark Zimbabwes product offering whilst tapping from international best practices.\n\nIt will create a platform for the government to engage with international investors and promote policies that encourage Foreign Direct Investment (FDI).\n\nWe have a commercial space where we will display some of our artefacts and also leather and other related products that we feel will be beneficial in terms of them being exhibited at that Expo.\n\nWe are getting content from the countrys 10 provinces. I think so far, we have got content from Matabeleland South, Matabeleland North, Bulawayo and Midlands and we should be moving to Manicaland, Masvingo and Mashonaland West, where we really want to showcase what Zimbabwe has to offer both on the trade, tourism and the investment side of things.\n\nPeople are now looking to live healthier, so we should also be showcasing products like blueberries, avocado and citrus and oils, which are more for people to live healthier, said ZimTrade chief operations officer, Mr Similo Nkala, in the interview with Star FM.\n\nThe six-month event offers a platform to attract international investors and businesses who are interested in exploring new markets and expanding their operations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hjmgh.jpg",
            "description": "Business Writer JAPANESE Ambassador to Zimbabwe, Yamanaka Shinichi, has said Expo 2025 Osaka to be held in his country from April 13 to October 13 this year presents a valuable opportunity for Zimbabwean and Japanese businesses to discover new opportunities for business and collaborations. According to ZimTrade, the country’s premier trade promotion and development body, […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "All-female art exhibition amplifies women’s stories",
            "url": "https://www.chronicle.co.zw/all-female-art-exhibition-amplifies-womens-stories/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nLast week, visual art lovers converged at the National Gallery of Zimbabwe (NGZ) in Bulawayo for the Vital Voices: Accelerate Action all-female exhibition.\n\nTo celebrate feminine excellence in the visual art space, the NGZ in Bulawayo hosted this event, showcasing numerous art pieces echoing voices for change.\n\nIn her curatorial statement, Doris Kamupira, assistant curator of the NGZ in Bulawayo, articulated the essence of the exhibition.\n\nThe Vital Voices: Accelerate Action is a substantial exhibition commemorating International Womens Day, featuring 26 visionary female artists from diverse career stages and artistic disciplines. This dynamic exhibition comprises paintings, drawings, design motifs, mixed media, and three-dimensional art, culminating in a powerful exploration of womens empowerment.\n\nThrough their works, these artists serve as catalysts for social change, amplifying the voices of the marginalised and challenging the systemic barriers that perpetuate gender inequality, read part of the statement.\n\nAccording to Kamupira, the exhibition is a call to action, urging swift and decisive steps toward achieving gender parity.\n\nThe artists works serve as a powerful call to action. Alison Bakers pieces inspire women to find the courage and strength to break free from societal constraints, Kamupira said.\n\nShe highlighted that Kafiya Eyvazovas work, particularly her thought-provoking piece, I Want Seven Sons and One Daughter, challenges societal values and sheds light on the struggles faced by women in patriarchal societies, where the inability to bear a male child can lead to devastating consequences.\n\nSimilarly, Sidanisile Dubes Dlala Mama celebrates the importance of self-care and living in the present, highlighting the need for women to prioritise their well-being and happiness.\n\nVisual artist, Nomathemba Dube posing for a photo with her artwork\n\nChronicle Showbiz observed as art lovers admired the various artworks on display on Friday.\n\nIn separate interviews, visual artists shared their thoughts on the exhibition and Womens History Month. Mavies Ndhlovu, a ceramicist from Gwanda, said her work was inspired by the artistry of Matobo women, who elevated hut painting into a broader form of artistic expression. One of her pieces, Sesilapha, depicts how Matobo women started by painting their huts in rural areas, but now their work is seen in urban spaces and even on fabrics. They inspire me a lot.\n\nNomathemba Dube, who drew a piece titled Free to Be, said the exhibition provided her with a platform to step out of her shell and embrace her true self.\n\nLuzibo Luchi Shiki Moyo, daughter of Bulawayo-based imbube ensemble Black Umfolosis founding member Sotja Moyo, said her journey into visual arts was inspired by a woman who painted portraits at Meikles store back in the day.\n\nLuzibo Moyos artwork\n\nGrowing up, I was surrounded by musicians, which is why Im also a musician and dancer. However, my journey into visual art was sparked by a woman  I dont know her name  who painted portraits at Meikles. I would watch and admire her work. Then, when I attended Founders High School, I chose art as one of my practical subjects, and I have never looked back.\n\nTo me, Womens History Month should celebrate humanity as a whole, not just women. Of course, women play a huge role in peoples lives from birth and beyond, so they should be celebrated daily, she said.\n\nOther participating artists included Lauryn Arnott, Abigail N Hunda, Arzu Jabrailova, Langelihle B Moyo, Gloria JC Schonegeuel, Thokozile Dube, Andiswa Matobo, Nomvuyiso M Mpofu, Alison Baker, Portia Ndlovu, Valiyeva Yasemen, Clementine VT Nyati, Kafiya Eyvazova, Zandile V Masuku, Fidan Nazim Qizi, Lethiwe Ndebele, Kimberley Bumhira, Florence Nyathi, Nubar Rafiyeva, Tendai Mandira, Portia Ndlovu, Nomathemba Ndlovu, Lakhina Zulu, and Sidanisile Dube.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-1-copy-6.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com Last week, visual art lovers converged at the National Gallery of Zimbabwe (NGZ) in Bulawayo for the “Vital Voices: Accelerate Action” all-female exhibition. To celebrate feminine excellence in the visual art space, the NGZ in Bulawayo hosted this event, showcasing numerous art pieces echoing voices for change. In her curatorial statement, Doris Kamupira, […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "COMMENT: Police will deal decisively with criminals",
            "url": "https://www.chronicle.co.zw/comment-police-will-deal-decisively-with-criminals/",
            "content": "THE tragic events of March 18, 2025 along the Bulawayo-Victoria Falls Highway should serve as a stark warning to all criminals that the police are out in full force, and any attempts to engage in criminal activity will be met with swift and decisive action.\n\nIn the early hours of that morning, a gang of six armed robbers carried out a violent heist at Young Money General Dealer Shop in Insuza.\n\nArmed with pistols, knives, and axes, the suspects stormed the shop, overpowered the victims, and tied them up with electric cables.\n\nThey ransacked the premises; stealing money, groceries, electronics, and other valuable items before fleeing in a silver Honda Fit. But their crime spree didnt last long.\n\nThanks to a quick-thinking victim who managed to alert their employer, the police were immediately informed of the robbery.\n\nActing with precision, law enforcement positioned themselves along the Bulawayo-Victoria Falls Road, ready for action.\n\nWhen the suspects vehicle was spotted approaching the tollgate, police attempted to stop the car. Instead of surrendering, the criminals opened fire, sparking a fierce gunfight.\n\nIn a desperate attempt to escape, the suspects rammed their vehicle into the tollgates boom barrier. But the outcome was inevitable.\n\nThe officers quickly subdued the gang, and the suspects were transported to the United Bulawayo Hospitals, where they were later pronounced dead.\n\nThis dramatic conclusion to the robbery is a testament to the ZRPs unwavering commitment to fighting crime.\n\nThe police successfully recovered a cache of weapons from the suspects, including pistols, knives, and an axe.\n\nSome of the stolen goods were also found in the vehicle. But perhaps the most important take away from this incident is the message it sends to criminals across the country: if you choose a life of crime, you will face the full force of the law.\n\nThe police are sending a clear and firm message: there is no room for leniency when it comes to armed robbery and violent crime.\n\nThe ZRPs statement couldnt be clearer: Any form of confrontation by criminals will be met with appropriate measures.\n\nThe law enforcement officers are ready, and they will stop at nothing to ensure the safety of law-abiding citizens.\n\nThose who think they can outsmart or overpower the police will quickly learn that their actions have consequences  consequences that could very well lead to their own downfall.\n\nTo all criminals operating in Zimbabwe, take heed: the police are more determined than ever to rid the country of dangerous crime syndicates. The law is watching, and it will not hesitate to act.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/02/robbery-pic-680x368.jpg",
            "description": "THE tragic events of March 18, 2025 along the Bulawayo-Victoria Falls Highway should serve as a stark warning to all criminals that the police are out in full force, and any attempts to engage in criminal activity will be met with swift and decisive action. In the early hours of that morning, a gang of […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "Vendors defy Council relocation directive",
            "url": "https://www.chronicle.co.zw/vendors-defy-council-relocation-directive/",
            "content": "Peter Matika,[emailprotected]\n\nIT was business as usual for vendors operating in Bulawayos central business district (CBD) yesterday, as they defied the local authoritys directive to relocate to the newly designated vending areas.\n\nCouncil officials were also in no show to implement the relocation process, prompting vendors to go about their business unfazed.\n\nBulawayo Town Clerk, Mr Christopher Dube, in a statement on Wednesday, said all traders operating along 5th Avenue will immediately be relocated to the Bhaktas 2 Site, located along Lobengula Street and 2nd Avenue.\n\nBulawayo Town Clerk, Mr Christopher Dube\n\nHowever, as early as 6AM vendors had begun going about their business, laying out their wares on city pavements and along 5th Avenue, keeping a watchful eye for municipal police in the event the relocation process was to take effect. Pushcart operators also went about their business ferrying wares from various points around the city.\n\nWhile some vendors expressed a willingness to move if the process is organised, others raised concerns about the expenses involved in relocating and establishing themselves in a new location. Others vowed not to move arguing that they have invested a lot in their business.\n\nThe city councils announcement on Tuesday had sparked worries among vendors about their future, with many fearing the move could jeopardise their customer base.\n\nI can understand the councils intentions but they need to consider the people who rely on this space. We are not just numbers, we are families. We rely on this street to make ends meet.\n\nSome, if not most of us, are widows and care for our families and extended families. The little we make here goes a long way in sustaining our well-being, said Miss Nomalanga Maphosa.\n\nAnother vendor who preferred anonymity said Bulawayo City Council had lost its conscience saying forcing people to move without making prior arrangements is inhuman.\n\nBulawayo City Council (BCC)\n\nWe have been tossed around for far too long over this issue. We have lost far too much money to some of these so-called representatives from the council guaranteeing us a safe space to operate. What then happens to that? It is not like BCC is not aware of these arrangements since most of these monies were being paid to their employees, alleged the vendor.\n\nMr Tendai Charuka, a vendors representative, said the move to relocate vendors will be welcome if the council meets its obligations to build standard bays, with sheds and ablution facilities.\n\nVendors will be willing to move if no corners are being cut or favour individuals and groups. They have invested a lot in the avenue and this decision by the council will set them back a long way, he said.\n\nHowever, if it is to be the fate then let it be as long as all vendors are moved in a peaceful and civilised manner, said Mr Charuka.\n\nHe accused the local authority of taking advantage of Local Government and Public Works Minister Daniel Garwes directive to evict vendors from their places of operation.\n\nHe (Minister Garwe) only spoke of night vendors. He said the move is meant to address the growing incidence of night vending across the country.\n\nThe minister in his statement said the surge in unregulated informal trading in the countrys CBDs has resulted in increased pedestrian traffic, widespread littering and disturbances to established businesses within the CBD, making the cities unattractive to investors. So, what BCC is trying to do is not fair, said Mr Charuka.\n\nThe council also banned pushcarts from the CBD in line with the recent Government directive to restore sanity and clear city centres of illegal informal trading activity.\n\nThe decision follows widespread concerns over rampant illegal vending operations in towns and cities including night vending and pushcarts, which have been blamed for frustrating formal business operations, harbouring criminality, indiscriminate littering and violations of public health and safety regulations.\n\nComment could not be drawn from BCC, as the local authoritys corporate communications manager, Mrs Nesisa Mpofus cellphone continuously went unanswered.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-17-at-15.45.41-2.jpeg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw IT was business as usual for vendors operating in Bulawayo’s central business district (CBD) yesterday, as they defied the local authority’s directive to relocate to the newly designated vending areas. Council officials were also in no show to implement the relocation process, prompting vendors to go about their business unfazed. Bulawayo Town Clerk, […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "Olympic post, three-way race",
            "url": "https://www.chronicle.co.zw/olympic-post-three-way-race/",
            "content": "Zimpapers Sports Hub\n\nTHE race for the highest position in global sport is almost over and it appears set to come down to a photo finish between two Olympic gold medallists and the son of a former head honcho.\n\nThe next president of the International Olympic Committee will be voted for in Greece today as German Thomas Bach relinquishes the position after reaching the mandated maximum 12-year stint in charge.\n\nThe election is an extremely rare event as since the IOC was formed in 1894, two years before the first modern Olympic Games in Athens, there have been only nine presidents.\n\nThere are seven candidates to become the tenth but reports have circulated far and wide that Bach has one preferred candidate in mind as roughly 100 IOC members made up of princes, princesses, dukes, politicians, business people, an Oscar winner, sports officials as well as past and present athletes decide on who will lead the Olympic movement into an uncertain future.\n\nKirsty Coventry, who won seven Olympic medals in swimming including gold in the 200m backstroke at the 2004 Athens and 2008 Beijing Games, is rumoured to be Bachs choice.\n\nKirsty Coventry\n\nThe Zimbabwean is the only female candidate and she will be a history maker if elected as not only the first African to be appointed to the presidency, but also the first woman in the IOCs 131-year history.\n\nThe 41-year-old would also become the youngest leader in the organisations history, as well as the first from outside Europe or North America.\n\nFemale leaders do bring different attributes, lessons learned and soft skills to the table  but I dont want it to be the only thing that people focus on, Coventry said in an interview with The Athletic.\n\nI want to be the best person that people and members see leading our organisation, not a choice just based on gender.\n\nA key focus of Coventrys is supporting athletes financially on their journey to the Olympics, rather than simply waiting for endorsement deals once they have returned home with a medal, or medals, around their neck.\n\nBased off reports from conversations with IOC insiders, British two-time Olympic gold medallist in track cycling Lord Sebastian Coe and Juan Antonio Samaranch, a Spanish investment banker, sports administrator and son of former IOC president who shares the same name, shape up as Coventrys biggest threats.\n\nSamarach served as IOC vice-president for seven years, while Coe organised the 2012 London Olympic Games and is currently head of World Athletics.\n\nHis platform is based upon engaging young people, increasing transparency, strengthening the anti-doping system and prioritising athletes physical, financial and mental welfare.\n\nCoe is viewed as the most experienced option and is one of four candidates who is the head of an Olympic sports body with Johan Eliasch from skiing, David Lappartient from cycling and Morinari Watanabe from gymnastics all in the race.\n\nMeanwhile, the three other candidates  Coventry, Samaranch and Prince Feisal al Hussein of Jordan  are all members of the IOCs executive board.\n\nThe vote is going to come down the belief among the IOC members of who will navigate the pressing issues facing the Olympic Games in the coming years.\n\nBach had to navigate the Covid-19 pandemic, Russian doping and Russian invasions of Ukraine in 2014, the same year they held the Winter Games in Sochi and 2022, while the next leader is going to have to deal with the turbulent political landscape around the globe.\n\nLos Angeles is the next host of the Summer Games in 2028, and Donald Trumps presidency is a challenge to the IOCs Olympic values including gender equality and universal inclusion.\n\nThe Trump regimes hard line border stance may create problems with athletes, officials and fans obtaining visas into the United States, while tense relationships between the US and its long-time allies over tariffs and the Russo-Ukrainian War will need to be carefully managed.\n\nTrump has also threatened to strong arm the IOC into a universal ban on transgender athletes, after signing an executive order in January to impose the ban in the US.\n\nAt least, the IOC will be able to observe next years mens Fifa World Cup as a test case.\n\nThe new IOC president, whoever comes in, will need to say: Just a reminder, this was in the host contract, this is what we expect, these are our values, this is why we awarded the Games to you and were not going to compromise on x, y and z, Coventry said of Trump during her interview in The Athletic.\n\nWhile its not ideal, youre always going to have politicians looking at sports events as a platform to get different messages across. We, the IOC, need to ensure we remain neutral, which is easier said than done, but the only way that we can remain neutral is by ensuring our integrity  and our values  are upheld.\n\nRussias standing in the Olympic movement bubbles away in the background after Russian athletes who were known to have supported the war were banned from last years Paris Games.\n\nEligible athletes competed as neutrals after taking part in Tokyo, under the Russian Olympic Committee moniker, following years of state-backed systematic doping.\n\nCoventry believes the approach in Paris was the ideal way to navigate the situation.\n\nI think we need a dedicated task force that looks at how best to support athletes in conflict areas. Ultimately, the IOCs solidarity model is that we try to get every qualified athlete to the Games, she said.\n\nBut, we have to look after athletes at an Olympic Games, too. We have to make sure theyre safe, so we need to come up with clear guidelines that will protect athletes from all countries.\n\nI know, when I was winning my medals, Zimbabwe was going through a very bad power struggle and it could have been very easy for the international sports community to say were not going to recognise your athletes. I had no say. Do I think athletes should be able to remain neutral? Yes.\n\nWhat we saw in Paris was, I believe, very fair. We said athletes from Belarus and Russia who had openly supported the war would not be invited. That comes back to the principle of trying to keep everyone at the Games safe, particularly as the environment is so high-stress.\n\nThe decision on a 2036 host will also need to be made with the likes of India and Qatar lobbying to be the successor to the Brisbane Games.\n\nThe voting process will be a test of Bachs changes that allow the IOC to recommend a host without extensive bidding, in order to cut costs for potential hosts and to crack down on vote-buying in an attempt to avoid the kind of scandals that have plagued Fifa.\n\nThe threat of climate change, with the traditional timeslot for the Summer Games of July and August, during the northern hemisphere summer, providing more extreme conditions and windows for the Winter Games shrinking too, is also front of mind with the decision on hosts.\n\nCoventry called for greater flexibility, like how the marathon at the Tokyo Games was held in the cooler conditions of northern Japanese city Sapporo.\n\nWe have an incredible amount of interest in the Games for 2036 and 2040 from new regions, which is exciting. It opens up the question of the timing of the Games and I think we need to be proactive about that, both summer and winter, she said.\n\nOne less thing the next president will have to worry about is a US media rights deal with the IOC locking in a US$3 billion contract with NBC through to the 2036 Winter Olympics in Salt Lake City.\n\nUS Dollars\n\nBut speaking at Olympia, the birthplace of the Olympics, on Tuesday, Bach left with a warning for his successor.\n\nThe Olympic Games and the values they represent have endured for millennia, he said.\n\nAnd yet, the course of human history reminds us of their fragility.  Fox Sports/Sports Reporter\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jkn-hj.jpg",
            "description": "Zimpapers Sports Hub THE race for the highest position in global sport is almost over and it appears set to come down to a photo finish between two Olympic gold medallists and the son of a former head honcho. The next president of the International Olympic Committee will be voted for in Greece today as […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        },
        {
            "title": "RBZ widens net to consolidate ZIG",
            "url": "https://www.chronicle.co.zw/rbz-widens-net-to-consolidate-zig/",
            "content": "Richard Muponde and Sikhulekelani Moyo, Zimpapers Politics HubTHE Reserve Bank of Zimbabwes (RBZ) Financial Intelligence Unit (FIU) is expanding its operations outside Harare in a decisive move to bolster the stability of the local currency (ZWG) and ensure nationwide compliance with currency exchange regulations.\n\nThe interventions will be backed by the issuance of high-quality and durable banknotes to be distributed to remote areas where electronic money platforms are not available.\n\nDue to network limitations, most rural areas across the country do not use the ZWG, which is mostly circulating on electronic platforms. Small businesses that do not have point of sale (POS) machines, including those in cities, also rely on hard cash and sometimes deliberately close out more customers with ZWG.\n\nRBZ Governor, Dr John Mushayavanhu, has stated that these challenges are being addressed in line with the Monetary Policy Statement issued early last month, which emphasised the need for widespread public awareness on the use of the local currency.\n\nThis will be complemented by the issuance of higher-quality and durable ZWG banknotes, which will be strategically distributed to the most remote areas of the country where there are scarce brick-and-mortar financial services, said Dr Mushayavanhu.\n\nIn addition, the Reserve Bank, along with the rest of the world, will be celebrating Global Money Week from Monday, March 17 to March 21 2025.\n\nAs part of the celebrations, the Reserve Bank will carry out financial literacy programmes, which will also target rural areas in providing information on the ZWG currency.\n\nDespite the Government calling for businesses to accept all recognised currencies, some continue to refuse ZWG, hiding behind network issues and sometimes pretending they do not have POS machines.\n\nDr Mushayavanhu said RBZ remains committed to ensuring that all Zimbabweans, particularly those in rural, marginalised, and outlying areas, have access to financial services as outlined in the National Financial Inclusion Strategy.\n\nAs part of widening access to electronic payments, the Reserve Bank announced the roll-out of the POS machines programme, which is designed to reach all parts of the country under the mantra of leaving no one and no place behind, he said.\n\nIn this regard, the Reserve Bank will continue to undertake its financial literacy and consumer protection campaigns throughout the country in 2025 to support the uptake of financial services.\n\nReserve Bank of Zimbabwe Governor John Mushayavanhu shows the new gold-backed currency  the ZiG\n\nA massive recruitment drive for more FIU inspectors has already been launched, and plans to establish offices in Bulawayo by May are at an advanced stage, while other provinces will follow, targeting areas with lower compliance levels. In previous years, Zimbabwe has experienced currency volatility caused by economic saboteurs through currency manipulation.\n\nHowever, over the past five months, the ZWG has remained stable, with parallel market rates now almost converging with the official rates.\n\nThis stability came after the FIU launched blitzes targeting businesses, banks, and the informal sector to restore stability to the economy.\n\nFIU Director-General, Mr Oliver Chiperesa, emphasised the need for the FIUs expanded presence to consolidate the current economic stability and tackle pockets of resistance to compliance, particularly in areas outside the capital city.\n\nThe FIU currently has offices only in Harare, and this year we are starting to move to other centres, beginning with Bulawayo. At the moment, we are recruiting inspectors to strengthen the current numbers, he said.\n\nMr Chiperesa attributed the currency stability of the ZWG to heightened compliance among businesses, bolstered by efforts from the FIU, the security sector, and the Government to crack down on currency manipulators and economic saboteurs.\n\nThe FIU Director-General acknowledged that compliance levels remain inconsistent in areas where the FIU does not have a permanent presence.\n\nWe have been receiving reports from other centres that businesses there have lower compliance levels. We have been sending some teams on an ad hoc basis to those centres, and we found that, indeed, in areas where the FIU does not have a presence, compliance levels among traders tend to be lower, he said.\n\nMr Chiperesa said that to address this gap, the FIUs expansion will ensure that traders in all provinces adhere to currency regulations.\n\nHe said the establishment of permanent offices in Bulawayo is a first step, with plans to review and expand to other towns and cities in the future.\n\nWe want to make sure we have a presence in all major centres of the country. Starting with Bulawayo, we will review where else we need to deploy permanent FIU offices, he said.\n\nMr Chiperesa reiterated the FIUs commitment to enforcing regulations and ensuring that the stability being enjoyed remains constant for economic development.\n\nWhat we want to make sure of is that we consolidate that stability and ensure that businesses in all provinces are complying with the requirements, Mr Chiperesa said.\n\nMeanwhile, Dr Mushayavanhu has said the RBZ has instituted measures to allow for greater flexibility on the exchange rate and for further deepening of the foreign exchange market under the willing-buyer willing-seller (WBWS) arrangement, where the ZWG/USD exchange rate is determined under a floating exchange rate system by authorised dealers.\n\nBusinesses, including those in tourism, can include a margin for additional charges related to transaction costs in line with normal business practices in converting the local currency to foreign currency with their bankers, said Dr Mushayavanhu.\n\nSpeculative attacks on the currency will always remain a risk. This risk is acknowledged by the practices of central banks across the globe and their readiness to intervene in the foreign exchange market to protect the value of their currency.\n\nIn the same vein, the RBZ will strategically intervene in the foreign exchange market to smooth out any intermittent exchange rate volatility.\n\nOther speculative practices, which may take place in the goods and services market, will be addressed through measures to protect consumers in conjunction with inter-agency collaborations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cxvsdxcvsdxc.jpg",
            "description": "Richard Muponde and Sikhulekelani Moyo, Zimpapers Politics Hub THE Reserve Bank of Zimbabwe’s (RBZ) Financial Intelligence Unit (FIU) is expanding its operations outside Harare in a decisive move to bolster the stability of the local currency (ZWG) and ensure nationwide compliance with currency exchange regulations. The interventions will be backed by the issuance of high-quality […]",
            "time": "08:36",
            "date": "20 Mar 2025"
        }
    ]
}