{
    "news": [
        {
            "title": "‘Mozambique is sovereign’",
            "url": "https://www.chronicle.co.zw/mozambique-is-sovereign/",
            "content": "Fungi Kwaramba, Harare Bureau\n\nThe international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, President Mnangagwa, who is also the chairperson of SADC, has said.\n\nThis follows the Mozambican Constitutional Councils Monday ruling that upheld the results of the October elections, re-affirming the governing Frelimo partys decades-long hold on power.\n\nIn a ruling on Monday, judges of the Constitutional Council named Cde Daniel Chapo as the next president, confirming that the Frelimo candidate won 65 percent of the vote while his main challenger Venancio Mondlane got a 24 percent share of the vote.\n\nSADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law and order which the country and people sorely need and deserve, the President said.\n\nThis year the SADC region, and Africa at large, have witnessed elections in several countries with the plebiscites largely peaceful save for a few exceptions.\n\nCde Daniel Chapo\n\nThe President said this is a loud testimony that democracy continues to find deeper roots and to flourish in our SADC Region.\n\nIn his statement, President Mnangagwa said the Constitutional Councils Monday ruling exhausted all lawful processes for determining election results, both under Mozambican laws and SADC Election Guidelines and expectations, and thus all parties need to abide by the countrys apex courts ruling.\n\nThe Southern Africa Development Community (SADC) notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election Results held in the Republic Mozambique on 9th October this year.\n\nThe ruling by that countrys top electoral court, which upheld Frelimo Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with SADCs Election Guidelines and expectations.\n\nSADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nFurther, the President said, the rule of law is sacrosanct and SADC, as the regional mother body, stands ready to assist the people of Mozambique in deepening and consolidating democracy.\n\nSADC stands ready to assist the incoming Government, and People of Mozambique, in consolidating their electoral democracy on the basis of the aforesaid Court decision which should be held sacrosanct by all. Indeed, this is what the rule of law is all about, the President said.\n\nIn the October elections, Cde Chapo won by a massive landslide; his party, Frelimo, also improved its parliamentary majority in the 250-seat legislature.\n\nHowever, the opposition led by Mr Modlane has refused to accept defeat, leading to sporadic protests in the gas-rich southern African country, concentrated mainly in the urban centres.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jhgj-680x380.jpg",
            "description": "Fungi Kwaramba, Harare Bureau The international community should respect the sovereign will of the people of Mozambique and support all processes towards peace, law and order, President Mnangagwa, who is also the chairperson of SADC, has said. This follows the Mozambican Constitutional Council’s Monday ruling that upheld the results of the October elections, re-affirming the […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "All set for Bulawayo Shutdown Show . . . Artistes ready to deliver",
            "url": "https://www.chronicle.co.zw/all-set-for-bulawayo-shutdown-show-artistes-ready-to-deliver/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nIts all systems go for the Bulawayo Shutdown show, slated for today at the Zimbabwe International Exhibition Centre, Hall 1.\n\nThe stage is set, the programme is out and Bulawayo artistes are more than ready to showcase their talent to the people.\n\nThe event will kick off at 2 p.m.\n\nAttendees will also have the luxury of witnessing performances from Jah Prayzah, Winky D, Killer T, Boy Nino, Jaycee, Ma9ine, Silent Killer, Enzo Ishall, Freeman, Master H, Saint Floew and Nisha T.\n\nThe show, which is mainly aimed at empowering local artistes, will see 22 local artistes taking to the stage.\n\nDJ Kotwane\n\nUpcoming artistes will also not be left behind, as they will be given slots to perform as curtain-raisers for the main acts.\n\nIn interviews, some of the artistes said they are more than ready to give the people their best.\n\nDJ Kotwane Hikwa shared that he is eager to show the nation his expertise on the decks.\n\nIts an honour to grace the stage with artistes from all around Zimbabwe at this years Bulawayo Shutdown. My fans should expect a high-energy DJ set, as Ill be doing a back-to-back with DJ Ash T.\n\nI will definitely dish out the best music, which will stay in the memories of everyone who will be in attendance, said Kotwane.\n\nWinky D\n\nMusician Mzoe7, who will be one of the masters of ceremony at the event, also expressed his enthusiasm in ensuring that the mood is kept at a high level throughout the event:\n\nShutdown has always been a challenging stage for me, so I am very much prepared for it with every creative element I have.\n\nI am ready to ensure that everyone is enjoying the show, as I will be on stage for more hours than all the acts. I am staying fit and hydrated.\n\nEveryone should come ready to meet the ever-energetic creative Mzoe7, he said.\n\nThe Shutdown show is the talk of the town, with taxi drivers and other business people eager to make a killing on the day of the event.\n\nJah Prayzah\n\nThe event has been successfully running for seven years and has become a tradition during the April and December holidays.\n\nIt provides an entertainment space not only for Bulawayo but also for the nation and beyond, as the April edition attracts exhibitors who participate in the Zimbabwe International Trade Fair.\n\nThe April edition saw organisers bring in artistes from across the border, which gave local artistes a chance to network with their fellow South African artistes, serving as a cultural exchange space for all.\n\nThere is definitely something special for everyone at the Bulawayo Shutdown Show, as the organisers have ensured all genres are covered.\n\nSandra Ndebele\n\nThe DJs on rotation will dish out Amapiano and House music, among other genres. These include DJ Stout, DJ Sfiso, DJ Kotwane, Ash T, Zulu Da Maniac, Vito Bravo, Sancia and Feel G.\n\nRhumba fans will enjoy a performance from their favourite group, Insimbi Zezhwane.\n\nHosting the event will be Sandra Ndebele and taking turns as the masters of ceremony will be musician Mzoe7, DJ Nospa and content creator, Metty IntombiEmfitshane.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/swyhj.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com It’s all systems go for the Bulawayo Shutdown show, slated for today at the Zimbabwe International Exhibition Centre, Hall 1. The stage is set, the programme is out and Bulawayo artistes are more than ready to showcase their talent to the people. The event will kick off at 2 p.m. Attendees will […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "‘Support local products this festive season’",
            "url": "https://www.chronicle.co.zw/support-local-products-this-festive-season/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nTHE Ministry of Industry and Commerce has urged Zimbabweans to support local initiatives through the Buy Zimbabwe Campaign and Local Content Strategy during the festive season, promoting the procurement of locally produced goods to drive economic growth.\n\nIn his festive season message shared on the ministrys official X account, Industry and Commerce Minister Nqobizitha Mangaliso Ndlovu, commended the business community for its contributions to Zimbabwes economic progress. He encouraged consumers to prioritise local products, emphasising their role in achieving the nations Vision 2030 of becoming an upper-middle-income economy.\n\nAs you celebrate this festive season, please support local initiatives through the Buy Zimbabwe and Local Content Strategy, said Minister Ndlovu.\n\nThe minister also called on business membership organisations, development partners, the private sector, and Government agencies to collectively support the inter-ministerial taskforce on business malpractice.\n\nMinister Mangaliso Ndlovu\n\nI equally encourage your support for the inter-ministerial taskforce on business malpractice in combating counterfeiting and smuggling, which enables us to bring sanity to our business environment while enhancing consumer protection, he said.\n\nMinister Ndlovu highlighted the ministrys commitment to collaboration with the private sector and announced the launch of the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP) 2024-2025, which serves as a transitional framework aligning industrial policy with the National Development Strategy 2 (2026-2030).\n\nThe new year presents an opportunity to address challenges in industrial growth while optimising the strong macro-economic stability the sector has experienced to drive industrial growth going forward, he said.\n\nSince its inception, the Buy Zimbabwe Campaign has sought to correct market imbalances that favour foreign products over locally produced goods. The campaign has been central to the Governments development agenda, promoting local procurement and consumption as a key driver of economic self-sufficiency.\n\nThe Local Content Strategy, another vital intervention, aims to manage Zimbabwes import bill by reducing dependency on foreign goods and conserving foreign currency for critical imports such as raw materials, fuel, medicines, and equipment. Key sectors identified under the strategy include pharmaceuticals, oil seeds, dairy, horticulture, clothing and textiles, leather and leather products, fertilisers and chemicals, soaps and detergents.\n\nMinister Ndlovu reiterated that local initiatives are at the core of the National Development Strategy, urging stakeholders to actively engage in fostering industrial growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/FGTR.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com THE Ministry of Industry and Commerce has urged Zimbabweans to support local initiatives through the Buy Zimbabwe Campaign and Local Content Strategy during the festive season, promoting the procurement of locally produced goods to drive economic growth. In his festive season message shared on the ministry’s official X account, Industry and […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "Bulawayo’s  tourist spots  buzz with  festive cheer",
            "url": "https://www.chronicle.co.zw/bulawayos-tourist-spots-buzz-with-festive-cheer/",
            "content": "Families and friends visited various tourists destinations including the Matopos National Park on Christmas Day\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsd.jpg",
            "description": "Mashudu Netsianda, mashudu.netsianda@chronicle.co.zw  TOURIST attractions in and around Bulawayo were teeming with activity on Christmas Day as hordes of local and international visitors flocked to iconic destinations to celebrate the holiday in unique and memorable ways. From the serene granite hills of Matopos National Park to the ancient stone walls of Khami Ruins, the festive […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "Sibekiwe Ndlovu bids for Zifa board post",
            "url": "https://www.chronicle.co.zw/sibekiwe-ndlovu-bids-for-zifa-board-post/",
            "content": "Zimpapers Sports Hub\n\nSEASONED football administrator Sibekiwe Ndlovu, is running for a post on the Zimbabwe Football Association (Zifa) board, promising to champion the improvement of womens football in the country.\n\nNdlovu, a well-respected figure in local football circles, boasts a wealth of experience in football administration having served in various capacities within Zifa and other football organisations.\n\nSpeaking to Zimpapers Sports Hub, Ndlovu outlined her vision for the development of womens football in Zimbabwe, citing the need for increased investment, better infrastructure and more competitive leagues.\n\nAs a passionate advocate for womens football, I believe its time for us to take our game to the next level, Ndlovu said.\n\nWe need to create more opportunities for our female players, coaches and administrators to grow and succeed. This includes investing in better facilities, providing more resources for our national teams and promoting womens football through effective marketing and branding.\n\nNdlovus campaign is built around three core pillars, development, empowerment and excellence.She promises to work tirelessly to promote womens football, engage with stakeholders and drive positive change within Zifa.\n\nWomens football is not just a niche area; its a vital part of our sports ecosystem, Ndlovu emphasised.\n\nBy supporting and developing womens football, we can unlock new talent, inspire a new generation of players and grow the game as a whole.\n\nNdlovus journey in football spans over two decades, marked by her unwavering passion, dedication and leadership.\n\nAs a life member of Highlanders Football Club, Ndlovu has been an integral part of the clubs growth and development. Her commitment to the sport has earned her recognition and respect within the football fraternity.\n\nHighlanders bus\n\nNdlovus administrative acumen and expertise have been demonstrated through her various roles within football.\n\nShe has served as the chairperson of Highlanders Royals, a position that allowed her to play a pivotal role in the revival of the team.\n\nUnder her leadership, Highlanders Royals regained its status as a force to be reckoned with in womens football. Her success in this role is a testament to her ability to drive growth and development in football.\n\nAs the present director of Lobengula Queens, Ndlovu continues to be a driving force in womens football.\n\nHer experience in managing and administering womens football teams has equipped her with a deep understanding of the challenges and opportunities that exist within the sport.\n\nShe has been a vocal advocate for the development of womens football, working tirelessly to promote the sport and create opportunities for female players, coaches and administrators.\n\nHer commitment to gender equality and womens empowerment in football aligns with Zifas strategic objectives, making her an ideal candidate for the board.\n\nWith her extensive experience, leadership skills and passion for football, Ndlovu is an exceptional candidate for the Zifa board.\n\nNdlovu has been instrumental in promoting girls soccer in rural areas, identifying and nurturing talent that would otherwise go unnoticed. Her vision is to take girls soccer to the grassroots level, ensuring that every region is represented and every girl has access to equal opportunities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/etyj.jpg",
            "description": "Zimpapers Sports Hub SEASONED football administrator Sibekiwe Ndlovu, is running for a post on the Zimbabwe Football Association (Zifa) board, promising to champion the improvement of women’s football in the country. Ndlovu, a well-respected figure in local football circles, boasts a wealth of experience in football administration having served in various capacities within Zifa and […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "We hope the Mozambique poll suspense is settled",
            "url": "https://www.chronicle.co.zw/we-hope-the-mozambique-poll-suspense-is-settled/",
            "content": "For 75 long days Mozambicans, Sadc and watchers of that countrys politics had been in suspense.\n\nThe country staged a general election on October 9 and two weeks later, the election management body announced preliminary results which showed the Frelimo party retaining power with a crushing majority.\n\nBut Maputos electoral law requires the Constitutional Council to validate the results and formally declare the winner. As the supreme electoral body undertook its arduous task, the opposition in that country was staging violent protests, alleging without providing any evidence, that the election was flawed. A number of people have died in the disorder while business has suffered too.\n\nThe suspense ended on Monday when the council finally pronounced itself on the poll. It declared Frelimo candidate, Cde Daniel Chapo the victor with a 65 percent mandate. In second place is Mr Venancio Mondlane, a pastor-turned-politician who contested as an independent candidate and got 25 percent of the vote.\n\nCde Daniel Chapo\n\nIn parliament, Frelimo, in power since 1975, secured 195 seats versus Podemos, an opposition party which backed Mr Mondlane, which got 31. Renamo, a former rebel movement, came third with 20 constituencies, a 40-seat decline on its 2019 performance.\n\nGiven the suspense, and the disorder that accompanied that period, we hope that the Monday statement by the council has closed Mozambiques 2024 electoral contest. All the energies will now be channelled towards Cde Chapos inauguration and his formation of a new government to govern our sister republic for the next five years.\n\nMozambique, like Zambia and Tanzania, occupies a special place in the hearts of every Zimbabwean. Without Mozambique and Zambias support, our liberation war would most likely have struggled, even failed. The two countries served as trusted rear bases for our freedom fighters. They provided material and moral support as well. For that magnanimity towards our liberation movement, they actually suffered military retribution from the Rhodesian army.\n\nBecause of this formidable shared history and the fact that communities along our border with Mozambique have blood relatives on either side, we urge our brothers and sisters to find each other, shun violence, talk and practise peace for greater national development.\n\nMozambique is a massive country with abundant natural resources. From rubies to natural gas; from wildlife to a high-potential blue economy. She has ports that serve as vital links for her landlocked neighbours such as our country, Malawi and Zambia to global export markets.\n\nThese resources and geographical advantage will only bring tangibles to our sister republic if it enjoys peace.We are optimistic that, indeed, with the Constitutional Council having spoken, our brothers and sisters in Mozambique will listen and unite to build their great country.\n\nPresident Mnangagwa\n\nWe cite Sadc Chairperson, President Mnangagwa elsewhere on these pages noting the same.\n\nThe ruling by that countrys top electoral court, which upheld Frelimo Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with Sadcs Election Guidelines and expectations, he said.\n\nSadc thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Cde-Daniel-Chapo-portrait.jpg",
            "description": "For 75 long days Mozambicans, Sadc and watchers of that country’s politics had been in suspense. The country staged a general election on October 9 and two weeks later, the election management body announced preliminary results which showed the Frelimo party retaining power with a crushing majority. But Maputo’s electoral law requires the Constitutional Council […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "Bulawayo cancer organisation  lessens patients worries with donation",
            "url": "https://www.chronicle.co.zw/bulawayo-cancer-organisation-lessens-patients-worries-with-donation/",
            "content": "Chronicle Writer\n\nA Bulawayo-based organisation which raises awareness on various cancers has donated 600 packets of sanitary pads and cotton wool to cervical cancer patients at Mpilo Central Hospital (Mpilo).\n\nDr Tatenda Chingonzoh, chairperson of the Leading Initiatives Fighting Cancer Together (LIFT) Trust and head of Mpilos radiotherapy centre said cancer treatment is very expensive thus members of her organisation used own resources to buy the pads for use by women who seek treatment at the facility.\n\nIn addition, LIFT conducted a pad drive through which it sought and collected donations through some schools, pharmacies and other businesses in the city.\n\nOne of the commonest symptoms of cervical cancer, which is cancer of the mouth of the uterus, is bleeding and a foul-smelling discharge, so what we noticed in the Government sector is that many of these women would come, they have many costs like to buy the drugs that are needed for treatment, antibiotics, the tests needed to stage the cancer, the X-rays, ultrasound scan and blood tests so it becomes, I think, even to the family and so forth, of less importance to be able to make sure that whilst the woman is doing all this, that she has adequate sanitary wear and you see this bleeding or this discharge is not just occurring for a few days in the month, said Dr Chingonzoh, who is also a consultant oncologist.\n\nIts something that can be happening continuously, so we realised that many of these women would not be able to afford sanitary wear so LIFT gave towards the purchase of pads and they managed to purchase 600 packets of pads, maternity pads and ordinary pads as well as cotton wool to support these cervical cancer patients.\n\nLIFT mobilised the pads as part of its activities during this years Gynaecological Cancer Awareness Month, which falls in September yearly. It handed over the donation on December 5.\n\nThis donation was made at Mpilo Central Hospitals radiotherapy centre and the aim is that every time a woman with cervical cancer comes through, she is given a packet of pads so that even though a packet of pads is just a dollar this time she doesnt have to worry, on top of her bills, about buying these pads, she said.\n\nFrom right: Dr Tatenda Chingonzoh, Mr Phineas Sithole who is Mpilo Central Hospital Principal Nursing Officer, Mrs Cheryln Young, Mrs Soneni Dube, Ms Precious Mpofu and Sister Buyiswa Sithole at the sanitary pads handover event\n\nShe urged the public to assist cervical cancer patients.\n\nNobody chooses to have cancer, so it can happen to anybody, anyones mother, anyones sister, anyones child, daughter can be affected by cancer. Whatever we give can impact, be it for this campaign was pads so a dollar would actually help a woman with pads but there is a lot more that can be done to support these women.\n\nLIFT hopes to mobilise more support for cervical cancer patients by providing them with regular food hampers and supportive medication.\n\nThe public can also assist by paying private laboratories so patients can undergo relevant tests at subsidised cost.\n\nWe hope to do more, not only for cervical cancer, said Dr Chingonzoh.\n\nEach month of the year has a cancer that is dedicated to it, so we hope for 2025, every month we can do something for whichever cancer is covered that month and we hope also, we are not just focusing on the women, its just this particular pad drive was for gynaecological cancers, but we hope to do more for all cancers, cancers in men, cancers in women, cancers in children however much we can.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ihl-1.jpg",
            "description": "Chronicle Writer A Bulawayo-based organisation which raises awareness on various cancers has donated 600 packets of sanitary pads and cotton wool to cervical cancer patients at Mpilo Central Hospital (Mpilo). Dr Tatenda Chingonzoh, chairperson of the Leading Initiatives Fighting Cancer Together (LIFT) Trust and head of Mpilo’s radiotherapy centre said cancer treatment is very expensive […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "The transformative power of parole",
            "url": "https://www.chronicle.co.zw/the-transformative-power-of-parole/",
            "content": "Innocent Mujeri, Correspondent\n\nThe intended introduction of a comprehensive parole system in Zimbabwe marks a pivotal moment in the countrys approach to justice and correction.\n\nUnderpinned by the Prisons and Correctional Service Act, this initiative reflects a shift from a punitive model of incarceration to one focused on rehabilitation and reintegration. As Zimbabwe takes these critical steps, it joins a growing list of nations that recognise the transformative potential of parole in fostering personal growth, reducing recidivism, and enhancing public safety.\n\nParole, fundamentally, is about second chances. It allows individuals to re-enter society before completing their prison sentences, provided they demonstrate good conduct and readiness to reintegrate. This conditional release is not granted lightly. Parole is tied to strict eligibility criteria, such as meritorious behaviour, self-discipline, and a demonstrable commitment to becoming law-abiding citizens. The process in\n\nZimbabwe will be overseen by the newly established State Parole Board, which ensures that societal safety remains paramount.\n\nFile picture: Khami Maximum Prison School external students headmaster Shadreck Katsholo (raised hand) with members of staff and Form Two student, 36-year-old Zandile Ndou (far right)\n\nThe Zimbabwean Governments commitment to this initiative, as highlighted by President Mnangagwa and Justice Minister Ziyambi Ziyambi, underscores its belief in rehabilitation over retribution. By shifting the narrative around incarceration, the country aims to reduce the stigma associated with imprisonment, while addressing systemic challenges such as overcrowding in correctional facilities.\n\nOvercrowding has long been a pressing issue, not only straining resources, but also undermining the effectiveness of rehabilitation programmes. Through parole and the establishment of community correctional centres, Zimbabwe seeks to create a more humane and sustainable correctional system.\n\nThis move aligns with global best practices. In countries such as Norway, parole plays a central role in their correctional philosophy, which prioritises rehabilitation and reintegration. Norwegian inmates nearing the end of their sentences transition to halfway houses or supervised release, where they gain the skills and confidence needed for a successful re-entry into society. This approach has contributed to Norways remarkably low recidivism rate  around 20 percent compared to the global average of 50 to 60 percent.\n\nSimilarly, Canada employs a phased parole system that allows inmates to engage in community-based activities, while remaining under supervision. Such gradual reintegration builds trust and fosters a sense of responsibility among parolees.\n\nSouth Africa, too, offers valuable lessons for Zimbabwe. As a neighbouring country with shared socio-economic challenges, South Africa has used parole effectively to combat prison overcrowding. Their system is supported by halfway houses and community service programmes, ensuring that parolees contribute positively to society, while being held accountable. This blend of compassion and accountability is key to the success of any parole system, including Zimbabwes.\n\nHowever, the introduction of parole is not without challenges. Public perception often poses a significant hurdle. Many people view parole as a lenient option that compromises public safety. This misconception needs to be addressed through transparent communication about the rigorous conditions and oversight involved in granting parole.\n\nMinister Ziyambi Ziyambi\n\nEducating the public about the societal benefits of parole  such as reduced recidivism, economic savings, and the successful reintegration of former inmates  can help shift attitudes.\n\nEqually important is the need for robust post-release support. Reintegration is a complex process that extends beyond the prison gates. Former inmates often face significant barriers, including social stigma, limited job opportunities, and mental health challenges. Providing access to counselling, vocational training, and employment programmes is crucial to ensuring that parolees do not revert to criminal behaviour.\n\nZimbabwes plan to establish a foundation aimed at supporting reintegration initiatives is a commendable step in the right direction. By involving stakeholders from various sectors, the government can mobilise resources and create a support network that addresses the multifaceted needs of parolees.\n\nRegional collaboration also holds promise. Minister Ziyambis call for African correctional services to work together through the African Correctional Services Association highlights the potential for shared learning and resource optimisation. Neighbouring countries can exchange expertise, develop standardised policies, and strengthen reintegration programmes, creating a unified approach to parole across the continent.\n\nThe economic benefits of parole cannot be overlooked. Incarcerating an individual is costly, placing a significant burden on State resources. Parole offers a cost-effective alternative, allowing governments to redirect funds towards other pressing needs, such as education and healthcare.\n\nMoreover, reintegrated individuals contribute to the economy through employment and entrepreneurship, breaking the cycle of dependency and crime. This dual impact  reducing State expenditures, while enhancing economic productivity  makes parole a pragmatic solution for addressing the challenges facing correctional systems.\n\nThe planned Zimbabwes parole system is not just about alleviating overcrowding or saving costs; it is about recognising the potential for redemption and growth in every individual. By focusing on rehabilitation, the country is building a justice system that upholds human dignity and prioritises public safety.\n\nThe establishment of community correctional centres further reinforces this vision, offering low-risk offenders an opportunity to serve their sentences in environments that promote learning and personal development.\n\nAs Zimbabwe embarks on this journey, it has the opportunity to tailor its approach to its unique socio-economic context, while drawing inspiration from successful models worldwide.\n\nThe commitment of the Government, as evidenced by the support of President Mnangagwa and the active involvement of the Zimbabwe Prisons and Correctional Service, is a promising start. However, the success of the parole system will ultimately depend on its implementation. Clear guidelines, effective oversight, and the active participation of communities are essential to ensuring that the system achieves its intended goals.\n\nIn the broader context, Zimbabwes embrace of parole reflects a growing global consensus that punitive justice alone is insufficient. Societies are increasingly recognising that meaningful rehabilitation and reintegration are the keys to reducing crime and building safer communities. By giving individuals a second chance, parole embodies the belief that people can change, grow, and contribute positively to society.\n\nZimbabwes parole system represents a forward-thinking approach to justice. It is a testament to the countrys commitment to balancing accountability with compassion, punishment with rehabilitation, and societal safety with individual redemption.\n\nAs the system takes root, it has the potential to transform not only the lives of parolees, but also the broader community, creating a justice system that is fair, effective, and humane.\n\nBy learning from countries such as Norway, Canada, and South Africa, and addressing its unique challenges, Zimbabwe can build a model parole system that serves as an inspiration to other nations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jty-1.jpg",
            "description": "Innocent Mujeri, Correspondent The intended introduction of a comprehensive parole system in Zimbabwe marks a pivotal moment in the country’s approach to justice and correction. Underpinned by the Prisons and Correctional Service Act, this initiative reflects a shift from a punitive model of incarceration to one focused on rehabilitation and reintegration. As Zimbabwe takes these […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "Heritage-based curriculum revolutionising education sector",
            "url": "https://www.chronicle.co.zw/heritage-based-curriculum-revolutionising-education-sector/",
            "content": "Patrick Chitumba,[emailprotected]\n\nZIMBABWES new Heritage-Based Curriculum has been hailed as a transformative step in providing inclusive, high-quality primary and secondary education.\n\nThe curriculum, designed to foster critical thinking, problem-solving, and teamwork among learners, is set to equip students with essential skills to navigate the challenges of a rapidly evolving world.\n\nSpeaking about the achievements in Zimbabwes education sector this year, Primary and Secondary Education Minister, Torerai Moyo, emphasised the significance of the curriculum.\n\nAnother milestone that we have achieved as a ministry is to review the competence-based curriculum and introduce the Heritage-Based Curriculum. We want learners to have a deep understanding of their heritage, and their surroundings so that they can identify challenges they face at home, schools, and communities, he said.\n\nThey can then do research based on the problem and try to proffer solutions through the power of digital tools.\n\nMinister Moyo highlighted that the Government is committed to enhancing educational experiences through the establishment of innovation hubs in schools. These hubs are aimed at equipping students with 21st-century skills necessary for innovation and technological advancement.\n\nMinister Moyo said the Heritage-based curriculum, coupled with the establishment of innovation hubs, is expected to redefine Zimbabwes educational landscape, nurturing a generation of learners equipped to thrive in an increasingly complex and interconnected world.\n\nWe have established innovation hubs in several schools across the provinces. In Victoria Falls, for instance, three schools now have innovation hubs, and more are in Harare and other areas, he said.\n\nWe want our students to dream big, discover new knowledge, and address real-world challenges. The goal is to inculcate critical thinking and problem-solving skills, enabling learners to invent new technologies and solutions pivotal for development, he said.\n\nMinister Torerayi Moyo\n\nThe Heritage-Based Curriculum integrates local culture and history with modern educational practices, encouraging students to research community-specific challenges and develop solutions.\n\nThis approach aligns with Zimbabwes broader National Development Goals and Vision 2030, which prioritise innovation and sustainable development.\n\nThese initiatives are part of a larger national strategy to promote innovation in education. By preparing our students to think critically and solve problems creatively, we are positioning Zimbabwe to achieve its developmental aspirations, said Minister Moyo.\n\nThe Government is also keen to overhaul vocational training programmes so that students have the skills needed for their future careers.\n\nThe Ministry of Primary and Secondary Education has pointed to schools like St Columbas High School in Bulawayo as an example of the practical benefits of this educational model.\n\nLearners at St Columbas are not only acquiring valuable skills but also learning to monetise these abilities even before completing Form 4.\n\nThe objective is to equip students with the skills and knowledge necessary to embark on their careers immediately upon completing their education, thereby transforming them from job seekers to job creators.\n\nMinister Moyo said several schools have already begun producing learners who possess problem-solving skills, which is proof to the effectiveness of this new educational approach.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-34-8.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw ZIMBABWE’S new Heritage-Based Curriculum has been hailed as a transformative step in providing inclusive, high-quality primary and secondary education. The curriculum, designed to foster critical thinking, problem-solving, and teamwork among learners, is set to equip students with essential skills to navigate the challenges of a rapidly evolving world. Speaking about the achievements […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        },
        {
            "title": "The biggest celebrity controversies of 2024",
            "url": "https://www.chronicle.co.zw/the-biggest-celebrity-controversies-of-2024/",
            "content": "2024 has been a year of high-profile celebrity scandals, each of which sparked intense conversations across media platforms and left fans reeling.\n\nFrom explosive legal battles to public feuds, these controversies have dominated headlines, with figures from the music industry, entertainment and business making waves.\n\nCassper Nyovest and Thobeka Majozi: A Heartbreaking Betrayal\n\nThe drama between rapper Cassper Nyovest and his partner, Thobeka Majozi, was one of the most emotional scandals of 2024.\n\nMajozi publicly revealed that their son was diagnosed with cancer at just eight months old. Amidst the emotional toll of caring for a sick child, she discovered that Nyovest had been unfaithful. The affair involved Pulane Mojaki, who is now married to Nyovest.\n\nIn a public apology, Nyovest acknowledged his wrongdoing, expressing regret for his actions. He admitted that the infidelity was part of his past he wasnt proud of and that he had kept their sons illness private until now.\n\nMihlali Ndamase and Leeroy Sidambe: Assault Allegations and a Bitter Dispute\n\nInfluencer, Mihlali Ndamase found herself embroiled in a controversial situation with her ex-partner, Leeroy Sidambe, after allegations of abuse surfaced.\n\nNdamase shared images of her bruised face on Instagram, tagging Sidambe with a caption that read, Thank you, my angel.\n\nIn response, Sidambe accused her of being the aggressor, claiming he acted in self-defence when she allegedly threatened him with a knife. He stated that her injuries were caused when she made contact with a wall during the altercation.\n\nNdamase later published a heartfelt open letter detailing her own experiences of emotional and physical abuse in the relationship. She requested privacy as she began her healing journey.\n\nLetoya Makhene and Lebo Keswa: A Toxic Public Fallout\n\nAnother scandal that captured attention in 2024 was the bitter fallout between Letoya Makhene and her ex-wife, Lebo Keswa.\n\nKeswa accused Makhene of mistreating her during their marriage, including allegations of involvement in inappropriate relationships for drugs. Makhene, on the other hand, accused Keswa of manipulation and emotional abuse, with both sides airing their grievances publicly on social media.\n\nThe public nature of their drama divided opinions, with critics labelling the situation as toxic. While some sided with Keswa, others felt Makhene was unfairly vilified.\n\nKabza De Small: A Cheating Scandal Rocks the DJs Reputation\n\nKabza De Small at the Symphonic concert\n\nAmapiano star, Kabza De Small found himself at the centre of a cheating scandal after private photographs surfaced online, allegedly showing him with another woman.\n\nThe images went viral, sparking intense discussions on social media. Fans were left questioning the DJs personal life, and while Kabza has not directly addressed the matter, the scandal raised questions about his relationships and the impact of social media on celebrity privacy.\n\nNkosazana Daughter vs MacG: defamation lawsuit over personal life\n\nHost of Podcast and Chill show, MacG made controversial remarks, claiming that Master KG, not Sir Trill, was the biological father of Nkosazanas child.\n\nNKOSAZANA DAUGHTER\n\nThis statement led to intense backlash from fans, who accused MacG of disrespecting women in the industry and gossiping about private matters.\n\nNkosazana Daughter responded publicly, denying the allegations and expressing her disappointment at how women are often disrespected in the media.\n\nShe filed a R13 million defamation lawsuit against MacG, demanding accountability for the false claims. MacG acknowledged his mistake and apologised to her.IOL\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ergb.jpg",
            "description": "2024 has been a year of high-profile celebrity scandals, each of which sparked intense conversations across media platforms and left fans reeling. From explosive legal battles to public feuds, these controversies have dominated headlines, with figures from the music industry, entertainment and business making waves. Cassper Nyovest and Thobeka Majozi: A Heartbreaking Betrayal The drama […]",
            "time": "06:09",
            "date": "27 Dec 2024"
        }
    ]
}