{
    "news": [
        {
            "title": "WATCH: Awa Khiwe stages a splendid performance at the SWAN music festival",
            "url": "https://www.chronicle.co.zw/watch-awa-khiwe-stages-a-splendid-performance-at-the-swan-music-festival/",
            "content": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub\n\nGerman-based Rap goddess Awa Khiwe displayed a polished performance at the SWAN music festival, currently taking place at White City Stadium in Bulawayo.\n\nThe event is the official launch of the Swan range of cigarettes.\n\nThe organisers staged similar gigs in Beitbridge, Mutare and Harare.\n\nOn the side-lines of the show, Awa Khiwe said its an honour to be part of performers at the event.\n\nIt feels good to be home and performing to such a massive crown is great to me. I really enjoyed my set on stage, said Awa Khiwe.\n\nSo far, artistes who have performed are Sandra Ndebele, DJ Mzoe, Madlela Sikhobokhobo, Ma9nine and Iyasa.\n\nSouth African artistes Kwesta, Toss Murumba Pitchs Maeywon, Master KG, Botswanas Vee Mampeezy, Alick Macheso, Insimbi ZeZhwane and Winky D are yet to perform.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/7UU.jpg",
            "description": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub German-based Rap goddess Awa Khiwe displayed a polished performance at the SWAN music festival, currently taking place at White City Stadium in Bulawayo. The event is the official launch of the Swan range of cigarettes. The organisers staged similar gigs in Beitbridge, Mutare and Harare. On the side-lines […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "15 die in separate accidents on Friday",
            "url": "https://www.chronicle.co.zw/15-die-in-separate-accidents-on-friday/",
            "content": "Langelihle Nyathi, langae2001@2001\n\n15 people lost their lives in various road traffic accidents that occurred in Norton, Chegutu, and Mutare on Friday.In a statement the Zimbabwe Republic Police revealed that in one of the accidents, a Nissan Caravan kombi, carrying 20 passengers, veered off the road and overturned, landing on its left side at the 30-kilometre peg along the Harare-Bulawayo Road at approximately 4PM.\n\nFour people, including three adults and an infant, died at the scene of the accident, while three others, later succumbed from their injuries after being admitted to Norton Hospital, and 12 others sustained injuries.In another accident that occurred at around 5.32 PM at the 85-kilometre peg along Harare-Bulawayo Road, a Chevrolet TrailBlazer vehicle, carrying five passengers, collided with a Toyota Hilux vehicle, which was carrying seven passengers.\n\nThe Chevrolet Trail Blazer had allegedly attempted to overtake the Toyota Hilux, which was turning right.The collision caused the Toyota Hilux to overturn and land on its left side.Three people are reported to have been killed, while two others were injured. The injured victims were transported to Chegutu General Hospital for medical treatment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/09/road-accident-680x364.png",
            "description": "Langelihle Nyathi, langae2001@2001 15 people lost their lives in various road traffic accidents that occurred in Norton, Chegutu, and Mutare on Friday. In a statement the Zimbabwe Republic Police revealed that in one of the accidents, a Nissan Caravan kombi, carrying 20 passengers, veered off the road and overturned, landing on its left side at […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "Ignore calls for protests: Minister Muswere",
            "url": "https://www.chronicle.co.zw/ignore-calls-for-protests-minister-muswere/",
            "content": "Harare Bureau\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has urged Zimbabweans to ignore calls for protests by misguided elements, assuring the nation that the countrys security sector is well-prepared to maintain law and order.\n\nDr Muswere said this while addressing the media in Harare on Saturday morning.\n\nAs official Government spokesman, I would like to assure the nation that peace and stability continue to prevail in our country in terms of the Constitution and all Zimbabweans should disregard misinformation and disinformation being peddled on social media platforms by cyber terrorists about the 31st of March, 2025, said Dr Muswere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dfghgfhfgf.jpg",
            "description": "Harare Bureau Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has urged Zimbabweans to ignore calls for protests by misguided elements, assuring the nation that the country’s security sector is well-prepared to maintain law and order. Dr Muswere said this while addressing the media in Harare on Saturday morning. “As official Government spokesman, I […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "Mzansi acts arrive ahead of SWAN music festival",
            "url": "https://www.chronicle.co.zw/mzansi-acts-arrive-ahead-of-swan-music-festival/",
            "content": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub\n\nSouth African artistes Kwesta, Toss and Murumba Pitchs Maeywon have arrived at the Joshua Mqabuko International Airport ahead of their performances at the SWAN cigarette launch currently taking place at the White City stadium.\n\nLocal creatives who will take to the stage are Ma9ine, Insimbi ZeZhwane, Madlela Sikhobokhobo,DJ Mzoe, Iyasa and Sandra Ndebele.Sungura legend Alick Macheso, Zim Dancehall gaffer Winky D, Chillspot Familys DJ Levels and Fantan, Calvin Mangena as well as German-based Rap queen Awakhiwe are apso expected to perform at the event hosted bt Star FMs Babongile Sikhonjwa and Ndumiso Skywalker.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/swane.jpg",
            "description": "Langalakhe Mabena, Zimpapers Arts and Entertainment Hub South African artistes Kwesta, Toss and Murumba Pitch’s Maeywon have arrived at the Joshua Mqabuko International Airport ahead of their performances at the SWAN cigarette launch currently taking place at the White City stadium. Local creatives who will take to the stage are Ma9ine, Insimbi ZeZhwane, Madlela Sikhobokhobo,DJ […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "Zifa Bulawayo Junior League kicks off",
            "url": "https://www.chronicle.co.zw/zifa-bulawayo-junior-league-kicks-off/",
            "content": "Zimpapers Sports HubTHE Bulawayo Junior Soccer League has kicked off.\n\nSeveral matches have been lined up at various venues in the city with kids taking part in the Under-13, 15 and 17 age groups.\n\nNorman Manjengwa watches the match through the fence something he has done from the 1970s when he used to follow Mashonaland United and Bulawayo Wanderers.\n\nIt is the same League that produced Madinda Ndlovu Tito Paketh, Alexander Maseko, Mercedes Sibanda, Ephraim Chawanda, Agent Sawu, Willard Khumalo, Zenzo Moyo, Boy Ndlovu and Lawrence Phiri.\n\nSynonyms for matchescomparisonmatchingmatchmakingcomparesimilaritycontrastalignmentcorrelationconflictconfrontation\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/2-1.jpg",
            "description": "Zimpapers Sports Hub THE Bulawayo Junior Soccer League has kicked off. Several matches have been lined up at various venues in the city with kids taking part in the Under-13, 15 and 17 age groups. It is the same League that produced Madinda Ndlovu Tito Paketh, Alexander Maseko, Mercedes Sibanda, Ephraim Chawanda, Agent Sawu, Willard […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "Plumtree Seventh Day Adventist celebrates “Active Ladies Health” Milestone",
            "url": "https://www.chronicle.co.zw/plumtree-seventh-day-adventist-celebrates-active-ladies-health-milestone/",
            "content": "Ronald Mpofu in Plumtree\n\nTHE Plumtree Seventh Day Adventist Churchs Active Ladies Health initiative celebrated its first anniversary in style, attracting members from Bulawayo to the border town.\n\nFounded by Mrs Sithatshisiwe Gumpo (52) on March 19, 2024, the project aims to improve the health of women from local SDA churches.Our project targets women aged 40 to 75 years, and membership is free. We engage in exercises to keep our bodies strong, fit, and healthy, said Mrs Gumpo, the founder and director of the project.\n\nThe initiative has grown from 10 members to over 21, with 10km walkerthon exercises taking place every Tuesdays and Thursdays and Aerobics every Sundays.\n\nSenior members have reported significant improvements in their health, including reduced body weight and normalized blood pressure.I had no interest in exercising at first, but now Im a daily fan. I can sleep well at night without facing any challenges like before, said Sihlangusomusa Dube (46), a senior member.\n\nMrs Portia Gwenzi, a club member, encouraged women to join the initiative, highlighting its benefits in maintaining a strong body and relieving stress.\n\nMrs Gumpo expressed gratitude to Pastor Thabolwethu Ndlovu, Liberty Mkhosana, Mainline Butchery, Nto Lupanhla, Dj Yugoe, Lethukuthula Mabuza and the Bulawayo team (Rudo Sibanda, Fatima Hassin, Nokuthula Mufadze and Imaan Ismail) for making the celebration a success.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/e.jpg",
            "description": "Ronald Mpofu in Plumtree THE Plumtree Seventh Day Adventist Church’s “Active Ladies Health” initiative celebrated its first anniversary in style, attracting members from Bulawayo to the border town. Founded by Mrs Sithatshisiwe Gumpo (52) on March 19, 2024, the project aims to improve the health of women from local SDA churches. “Our project targets women […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "Parly Sports Committee meets BCC",
            "url": "https://www.chronicle.co.zw/parly-sports-committee-meets-bcc/",
            "content": "Zimpapers Sports HubTHE Parliamentary Portfolio Committee on Sport is meeting Bulawayo City Councillors this morning to get an appreciation of the local authoritys thrust in providing facilities.Isaiah Mpofu, the Ministry of Sport deputy director general confirmed on Saturday morning.\n\nThe councillors and parliamentarians will visit Barbourfields Stadium.Committee chairman Farai Jere and his Committee have been to Harare, Mutare, Masvingo, Zvishavane, Hwange and Victoria Falls getting an appreciation of the situation on the ground.\n\nWhile enroute to Victoria Falls on Wednesday they toured Khumalo Hockey Stadium and Queens Sports Club.Of wary is the dilapidation of facilities countrywide and promotion of bars at the expense of sport and recreation according to Jere.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/qwe.jpg",
            "description": "Zimpapers Sports Hub THE Parliamentary Portfolio Committee on Sport is meeting Bulawayo City Councillors this morning to get an appreciation of the local authority’s thrust in providing facilities. Isaiah Mpofu, the Ministry of Sport deputy director general confirmed on Saturday morning. The councillors and parliamentarians will visit Barbourfields Stadium. Committee chairman Farai Jere and his […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "Trump moves to officially close USAID and tells remaining employees their jobs will be eliminated",
            "url": "https://www.chronicle.co.zw/trump-moves-to-officially-close-usaid-and-tells-remaining-employees-their-jobs-will-be-eliminated/",
            "content": "Donald Trumps administration is moving toformally shut down the U.S. Agency for International Development,and has notified the remaining employees that their positions could soon be eliminated.\n\nAfter weeks of bashing the foreign aid agency, attempting to freeze its funding and initiating mass layoffs, the administration notified Congress around noon Friday that it intends to move all of the agencys remaining responsibilities,effectively shutting it down.The remaining functions would be transferred to the Department of State.\n\nForeign assistance done right can advance our national interests, protect our borders, and strengthen our partnerships with key allies, Secretary of State Marc Rubiosaid in a statement.Unfortunately,USAIDstrayed from its original mission long ago. As a result, the gains were too few and the costs were too high.\n\nLater that afternoon, a federal appeals court cleared the way forElon Muskand his so-called Department of Government Efficiency team to resume their efforts to gut the agency.\n\nThe Washington, D.C. appeals court blockeda lower-court ruling, which had stopped Musk andDOGEfrom any work as it likely violated the Constitution in multiple ways.\n\nBut a three-judge appellate panel argued that the government is likely to show that DOGEs involvement doesnt violate the Constitution because most of the cuts at USAID were approved by administration officials.\n\nBeginning July 1, theState Departmentwill be responsible for administering whats left ofUSAIDs programs, though it remains unclear which ones. Any of the agencys functions that do not align with Administration priorities would be discontinued, according to Rubio.\n\nUSAID cannot be dissolved without congressional approval, teeing up yet another battlebetween the Trump administration and the judiciaryas he faces an avalanche of lawsuits alleging unconstitutional and illegal maneuvers.\n\nEarlier this month, a federal judge determined that his administration likely violated the Constitutions appointments clause and the separation of powers by effectively granting Musk unprecedented authority even though he holds no official role, without Senate confirmation or appointment to an existing office, to be able to make such sweeping decisions.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/09/usaid.jpg",
            "description": "Donald Trump’s administration is moving to formally shut down the U.S. Agency for International Development, and has notified the remaining employees that their positions could soon be eliminated. After weeks of bashing the foreign aid agency, attempting to freeze its funding and initiating mass layoffs, the administration notified Congress around noon Friday that it intends to move […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "President urges global dialogue",
            "url": "https://www.chronicle.co.zw/president-urges-global-dialogue/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nZIMBABWE stands firm in its commitment to peaceful international relations, President Mnangagwa declared yesterday, urging a culture of constructive dialogue to resolve global conflicts.\n\nAddressing diplomats at State House, he emphasised Zimbabwes friend to all, enemy to none approach and its readiness for progressive engagement.\n\nMy Governments Foreign Policy thrust of Engagement and Re-engagement has yielded responsive policies that harness opportunities and manage divergence.\n\nUndoubtedly, the ongoing engagements have opened new frontiers of co-operation and partnerships. I commend you all for your role in advancing this focus area.\n\nTogether, let us do more as we entrench a culture of dialogue within our international relations cooperation frameworks, he said.\n\nOn the subject of dialogue, President Mnangagwa further stated, Zimbabwe remains open for dialogue aimed at the total removal of illegal sanctions.\n\nThe illegal economic sanctions, coupled with the prevalence of climate change-induced natural disasters and weather phenomena, are negatively impacting our economy.\n\nHowever, domestic resource mobilisation, diaspora remittances, and inflows of Foreign Direct Investments are augmenting the national fiscus.\n\nOur people and the economy are demonstrating extraordinary resilience, unity of purpose, innovation, and resourcefulness, he said.\n\nPresident Mnangagwa\n\nThe President then expressed gratitude to SADC and other partners for their continued support in advocating for the unequivocal removal of the illegal embargo.\n\nI extend gratitude to our SADC family and African brothers and sisters for their principled support and solidarity, as they amplify calls for the lifting of sanctions. We also acknowledge the support we are receiving from the Group of Friends in Defence of the United Nations Charter, the Like-Minded Group, and the Non-Aligned Movement, he said.\n\nPresident Mnangagwa said the Government was committed to inclusive growth, democracy, constitutionalism and ensuring peace and stability for economic prosperity.\n\nThrough our multifaceted and people-centred development strategies, we are lifting more of our people out of poverty into prosperity. We look forward to journeying along this exciting path with you and the countries as well as organisations you represent. Together, let us navigate the complex challenges affecting our world and the immense opportunities presented before us, he stated.\n\nYesterdays gathering of ambassadors and international organisations fostered closer interaction between mission heads and the Government. The President encouraged them to submit objective and factual reports about Zimbabwe to their countries.\n\nMay you find satisfaction and pride in taking our relations to a new level. Our doors remain open and arms outstretched as we dialogue and work in harmony towards a shared prosperity and brighter future for our peoples, President Mnangagwa said.Zimbabwe, he stressed, maintains its stance as a friend to all and an enemy to none, reiterating that the country is very much open for business.\n\nZimbabwe is a friend to all and an enemy to none. We are open for business, and your nationals are welcome to pursue investments in our mining sector. Further, leveraging our strategic central location in the southern region, we are determined to work with our neighbours and investors to expand and modernise the North-South Corridor, to enhance global supply chains and logistics, he said.\n\nPresident Mnangagwa said Zimbabwe is committed to multilateralism and the principles of the United Nations Charter, while seeking support for a non-permanent United Nations Security Council seat.\n\nThe principles of equality and respect for each others interests should always guide us in our interactions. There are no big or small nations. Zimbabwes candidature for a non-permanent seat on the United Nations Security Council for the term 2027 to 2028 has been endorsed by SADC and the African Union. Our candidacy is deeply rooted in our commitment to global peace and security, an inclusive, fair, and equitable international rule-based system, he said.\n\nPresident Mnangagwa said the Second Republic is implementing comprehensive reforms to achieve an upper-middle-class economic status by 2030.\n\nThis has resulted in various political, economic and legislative reforms, as well as the implementation of a broad array of people-centred projects to guarantee household food security, improve incomes, and develop critical enablers to propel the modernisation and industrialisation of our economy.\n\nThe projected recovery in agricultural output is expected to drive economic growth to six percent, buoyed by the expected bumper harvest, following a successful summer season, he said.\n\nPresident Mnangagwa informed the diplomats about the Governments initiatives to achieve national goals.Government introduced the concept of Village Business Units and Nutrition Gardens. Under the Presidential Drilling Programme, we are drilling boreholes in all our 35 000 villages. We, thus, invite your Missions to partner these initiatives from the perspective of training and capacity building as well as value addition and sourcing of export markets as we promote market-driven productivity.\n\nUnder our Agriculture Transformation Strategy and the Village Business Unit Concept, Zimbabwe envisions improved incomes and higher standards of living for our grassroots communities and to also contribute to global food security and nutrition.\n\nIn mitigating climate change, we are expanding dam construction, water conveyance, and resuscitating irrigation schemes. These initiatives provide scope for further partnerships, co-operation, and investments. The growth of the agriculture sector, as the bedrock of our agriculture-based industry, entails the need for retooling, expansion, and diversification of our manufacturing sector. I challenge you, Your Excellences, in your respective missions, to promote investments along related value chains.\n\nPresident Mnangagwa praised ambassadors for promoting Zimbabwe as a tourist destination. He noted that Africa, the SADC region, and Zimbabwe are focusing on modernisation, value addition, and industrialisation of their economies.Riding on our abundant natural resources, Science, Technology, and Innovation solutions, I exhort your Missions to deliberately promote co-operation from your capitals around these aspects, as we create stronger synergies for the Africa we all want.\n\nMeanwhile, my Government looks forward to positive outcomes of engagements with the international community under the Arrears Clearance and Debt Resolution Process, he said.\n\nMaize crop affected by intense El Nio-induced dryness\n\nRegarding last years El Nio-induced drought, the President expressed gratitude for the timely humanitarian aid, technical expertise, and moral support received from different countries and organisations.President Mnangagwa who is the chairman of SADC, said Zimbabwe will continue promoting innovation to unlock opportunities for sustainable economic growth and development towards an industrialised SADC.\n\nOn the peace and security challenges in the region, particularly in the Eastern Democratic Republic of Congo, he said Zimbabwe is playing its part through SADC and East African Community initiatives to find lasting peace.\n\nOn his part, Dean of the diplomatic corps, Rwandan Ambassador James Musoni, said they will continue rallying behind President Mnangagwas leadership.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-3-5-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau ZIMBABWE stands firm in its commitment to peaceful international relations, President Mnangagwa declared yesterday, urging a culture of constructive dialogue to resolve global conflicts. Addressing diplomats at State House, he emphasised Zimbabwe’s “friend to all, enemy to none” approach and its readiness for progressive engagement. “My Government’s Foreign Policy thrust of […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        },
        {
            "title": "From die-hard to disloyal: Shifting sands of football support",
            "url": "https://www.chronicle.co.zw/from-die-hard-to-disloyal-shifting-sands-of-football-support/",
            "content": "Innocent Kurira,[emailprotected]\n\nFOOTBALL has always been more than just a game; its a culture, a way of life, and a form of expression. But as the sport evolves, so does the relationship between fans and the teams they support. The loyalty, passion, and deep connections that have defined football fandom are now being tested like never before. Fans who once followed their teams through thick and thin are beginning to question their allegiance. Do they remain loyal when times are tough, or do they jump ship at the first sign of trouble?\n\nHistorically, the bond between fans and their clubs was built on unwavering loyalty. But as expectations rise and clubs struggle financially or face performance challenges, that bond starts to crack. In Zimbabwes local league, a surge in fan defections from traditional powerhouses to newly-formed clubs is a clear sign of changing loyalties.\n\nBoban, a long-time Dynamos supporter, recently made headlines when he publicly declared his split from the club in favour of Scottland FC, a newly promoted team. In a viral video, he explained his decision:\n\nThe traditional teams are abusing players by not paying them. That is why they hate Scottland FC. I have left Dynamos.The defections didnt stop there. Ogege, another die-hard Dynamos fan, was spotted attending matches for MWOS FC, a rival club. When confronted, he admitted to supporting both teams, sparking a debate about what loyalty truly means. Then came Richard Sande, known as CheMhofela, who made a dramatic switch to Scottland FC during a match at Rufaro Stadium.\n\nI am sorry, I no longer support CAPS United. I have a family to feed. I was the second-best supporter in the land last season, and I didnt get any recognition from CAPS United. What else do you expect from me?\n\nBoban and CheMhofela\n\nFor their moves to Scottland the duo of Boban and CheMhofela received cars from Scottland.The defections are not limited to local football. In 2021, South African fan favourite Mama Joy shocked fans when she left Orlando Pirates to join Royal AM, an unexpected move that highlighted the growing trend of supporters shifting their allegiances for personal or financial reasons. This shift in loyalty poses a challenge for traditional clubs such as Dynamos, CAPS United and Highlanders, which have long boasted large numbers of fans. But as financial struggles and a lack of recognition from these clubs take their toll, their once-steadfast supporters are increasingly drawn to newer, more ambitious clubs.\n\nThe trend reflects a broader, global shift in football fandom. Clubs that fail to offer what fans need  whether its financial incentives, recognition, or a sense of community  are seeing their support base dwindle. Newer clubs like Scottland FC, with their attractive fan packages, are gaining traction as they make a case for the shifting nature of loyalty.\n\nProsper Ndebele, a Bulawayo-based football fan, weighed in on the trend:Theres always a benefit to supporting a football club, whether its excitement, community, or even financial incentives. But for many fans, loyalty is becoming increasingly transactional. If the team cant offer what fans need, theyll look elsewhere.\n\nThe growing trend of fan defections raises important questions about the future of football. As financial pressures and changing expectations reshape the relationship between fans and clubs, the question remains: will loyalty survive, or will the sport evolve into something more transactional? Only time will tell.@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/iuoyi.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw FOOTBALL has always been more than just a game; it’s a culture, a way of life, and a form of expression. But as the sport evolves, so does the relationship between fans and the teams they support. The loyalty, passion, and deep connections that have defined football fandom are now being tested […]",
            "time": "06:41",
            "date": "30 Mar 2025"
        }
    ]
}