{
    "news": [
        {
            "title": "What is a Cyclone? the Meteorological Services Department explains…",
            "url": "https://www.chronicle.co.zw/what-is-a-cyclone-the-meteorological-services-department-explains/",
            "content": "RAYMOND JARAVAZA[emailprotected]IN light of the imminent arrival of Cyclone Chido in the country on Thursday, the Meteorological Services Department (MSD) has released an explainer on what is a cyclone and its effects in areas where it hits.Cyclone Chido, which made landfall in the Mozambican channel on Sunday, is expected to affect Bulawayo, Matabeleland South, Midlands, Masvingo, Mashonaland East and Manicaland provinces.The storm was named by a Zimbabwean.According to MSD, the word cyclone likely comes from the Greek words kklos (circle, wheel) or kukl (go around in a circle, form a circle, encircle).The term cyclone was adopted around 1840. Tropical cyclones are also known as typhoons or hurricanes, depending on where they originate.The Bad: Tropical cyclones are intense circular storms with heavy rains and sustained cyclonic (circulating) wind speeds over 119 kilometres per hour. They can cause significant damage to property and infrastructure, and multiple casualties and deaths on land and sea.The Good: Once they get out of the oceans, they lose strength rapidly [land is like their kryptonite], but as they lose cyclonic (circulating wind strength) they lose water as well. This becomes torrents in areas close to where they enter, and less as they go inland.The World Meteorological Systems explains how cyclones are named.The process of determining names for tropical cyclones is conducted by the relevant tropical cyclone regional body at its annual/biennial session. There are five tropical cyclone regional bodies, i.e. ESCAP/WMO Typhoon Committee, WMO/ESCAP Panel on Tropical Cyclones, RA I Tropical Cyclone Committee, RA IV Hurricane Committee, and RA V Tropical Cyclone Committee. These bodies establish pre-designated lists of names which are proposed by WMO Members National Meteorological and Hydrological Services. The selection of names is based on their familiarity with the people in each region, aiming to aid in the understanding and remembrance of cyclones. The naming procedures can vary, with some regions using alphabetical order and others using the alphabetical order of country names. It is important to note that tropical cyclones are not named after individuals.When selecting a new name, consideration is given to certain factors: Short in character length for ease of use in communication Easy to pronounce Appropriate significance in different languages Uniqueness  same names cannot be used in other regions.\n\nENDS/\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2017/02/Cyclone_Leon-Eline_22_feb_2000_0411Z.jpg",
            "description": "RAYMOND JARAVAZA raymondjaravaza@gmail.com IN light of the imminent arrival of Cyclone Chido in the country on Thursday, the Meteorological Services Department (MSD) has released an explainer on what is a cyclone and its effects in areas where it hits. Cyclone Chido, which made landfall in the Mozambican channel on Sunday, is expected to affect Bulawayo, […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Zimbabwe penalised for slow over-rate against Afghanistan",
            "url": "https://www.chronicle.co.zw/zimbabwe-penalised-for-slow-over-rate-against-afghanistan/",
            "content": "Online writer\n\nTHE International Cricket Council (ICC) has penalised Zimbabwe for slow over-rate during the third T20I against Afghanistan which was played at Harare Sports Club.\n\nSkipper Sikandar Raza pleaded guilty to the offence and accepted the sanctions raised from the Emirates ICC Elite Panel Match Referee Andy Pycroft.\n\nThe charges were levelled in accordance with Article 2.22 of the ICC Code of Conduct for Players and Player Support Personnel, which relates to minimum over-rate offences, players are fined five per cent of their match fee for every over their side fails to bowl in the allotted time.\n\nZimbabwe are currently hosting Afghanistan for an all-format tour, which started with a three-T20I series between the two sides.\n\nWhile the hosts had emerged victorious in the first match, the visitors bounced back and clinched the series with two successive wins.\n\nThe two teams will now contest in three ODIs starting on Tuesday that will be followed by two Test matches.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/rgte.jpg",
            "description": "Online writer THE International Cricket Council (ICC) has penalised Zimbabwe for slow over-rate during the third T20I against Afghanistan which was played at Harare Sports Club. Skipper Sikandar Raza pleaded guilty to the offence and accepted the sanctions raised from the Emirates ICC Elite Panel Match Referee Andy Pycroft. The charges were levelled in accordance […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Ladysmith Black Mambazo set to spread festive cheer with annual Christmas Concert",
            "url": "https://www.chronicle.co.zw/ladysmith-black-mambazo-set-to-spread-festive-cheer-with-annual-christmas-concert/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE globally celebrated all-male Isicathamiya singing group, Ladysmith Black Mambazo, is gearing up for its second annual Christmas with Ladysmith Black Mambazo concert, promising an evening of heart-warming music and community spirit.\n\nThis enchanting event is set to unfold on December 23, at the renowned CFCI Theatre in Berea, Johannesburg.\n\nProudly supported by Durban Tourism, the concert will feature a diverse line-up of talented artistes, including gospel music, Ayanda Ntanzi, the Soweto Central Chorus, and Prophet Nomusa Dlomo, alongside the mesmerising CFCI Choir.\n\nThe evening aims to blend stirring rhythms with soulful harmonies, creating a unique gospel flavour that encapsulates the true essence of Christmas.\n\nLadysmith Black Mambazo, known for their rich musical heritage and harmonious sound, has a significant following not just in South Africa but also across borders, particularly in Zimbabwe.\n\nTheir collaborative history includes a memorable partnership with the late legendary Oliver Mtukudzi, showcasing their ability to connect with diverse audiences through their music.\n\nThis concert is more than just a musical showcase; it is an invitation to share in a bit united spirit of togetherness, said Ladysmith Black Mambazo communications manager Xolani Majozi.\n\nWe aim to create an environment that fosters unity and strengthens bonds within our communities, families, and friends.\n\nThe concert offers an ideal platform for holiday makers visiting Durban during the festive season, providing an unforgettable experience filled with uplifting gospel tunes and joyous performances.\n\nIn these challenging times, Ladysmith Black Mambazo believes that music can serve as a beacon of hope and unity.\n\nWe invite everyone to gather their loved ones and join us for an evening that promises to be filled with unforgettable musical performances and heartfelt community spirit, added Majozi.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/tgyghj.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE globally celebrated all-male Isicathamiya singing group, “Ladysmith Black Mambazo”, is gearing up for its second annual “Christmas with Ladysmith Black Mambazo” concert, promising an evening of heart-warming music and community spirit. This enchanting event is set to unfold on December 23, at the renowned CFCI Theatre in Berea, Johannesburg. Proudly supported […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Two men sentenced to 9 years for possession of dagga",
            "url": "https://www.chronicle.co.zw/two-men-sentenced-to-9-years-for-possession-of-dagga/",
            "content": "Tarisiro Tafirenyika [emailprotected]\n\nTWO men, one from Beitbridge and one from Buhera were each sentenced to 9 years in prison for possession of dangerous drugs.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) in a statement on X said, that on 10 December Never Ndambakuwa of Duibadzimu, drove a truck into a company premises where he was found with three sacks containing dagga during a police search. Following the discovery, a police report was made, leading to his arrest. He subsequently implicated Tapson Madyise of Buhera. The recovered dagga weighed 78.54 kilograms and was valued at US$ 7,854.\n\nBoth accused were sentenced to 10 years imprisonment, with 1 year suspended for 5 years on the condition of good behaviour. They will each serve an effective 9 years in prison for their offences.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2014/09/mbanje.jpg",
            "description": "Tarisiro Tafirenyika – tarisirotafirenyika@gmail.com TWO men, one from Beitbridge and one from Buhera were each sentenced to 9 years in prison for possession of dangerous drugs. The National Prosecuting Authority of Zimbabwe (NPAZ) in a statement on X said, that on 10 December Never Ndambakuwa of Duibadzimu, drove a truck into a company premises where […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Duo jailed for robbery",
            "url": "https://www.chronicle.co.zw/duo-jailed-for-robbery/",
            "content": "Tarisiro Tafirenyika [emailprotected]\n\nTWO men from Chipinge were each sentenced to 2 years in prison after being convicted of robbery.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe said On 4 December at around 8 PM, the complainant was on his way home when he encountered Liberty Mabhanga (26) and Tobias Hofisi (20). Hofisi asked the complainant for a cigarette and he gave him R5, he continued to demand beer. When the complainant attempted to walk away, Hofisi grabbed him from behind, and they took turns beating the complainant before robbing him of his belongings.\n\nMabhanga and Hofisi were each sentenced to 3 years imprisonment, with 1 year suspended for 5 years, resulting in an effective 2 years in prison\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Tarisiro Tafirenyika – tarisirotafirenyika@gmail.com TWO men from Chipinge were each sentenced to 2 years in prison after being convicted of robbery. In a statement on X, the National Prosecuting Authority of Zimbabwe said On 4 December at around 8 PM, the complainant was on his way home when he encountered Liberty Mabhanga (26) and Tobias […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Rescuers seek survivors, count dead in cyclone-hit Mayotte",
            "url": "https://www.chronicle.co.zw/rescuers-seek-survivors-count-dead-in-cyclone-hit-mayotte/",
            "content": "Emergency workers sought survivors on Monday and struggled to restore services in Mayotte, Frances poorest overseas territory, where hundreds or even thousands are feared dead from the worst cyclone to hit the Indian Ocean islands in nearly a century.Cyclone Chido devastated large parts of the archipelago off east Africa over the weekend with winds of more than 200 kph (124 mph), strewing homes over hillsides, and cutting phones, power and drinking water.\n\nWith areas still inaccessible, Frances acting Interior Minister Bruno Retailleau said on arrival in the disaster zone that it would take days to find the full extent of damage and deaths.The images are apocalyptic. Its a disaster, theres nothing left, an intensive care nurse named Oceane at the main hospital in the capital Mamoudzou told BFM TV.Teacher Hamada Ali told Reuters that streets were covered in mud and trees, people were sheltering in schools and bottled water was being used for cooking.\n\nI saw someone injured by a sheet of metal  Houses with sheet metal roofs were swept away by the cyclone. There are precarious dwellings of which we cannot see the slightest trace, he added.Residents queued outside grocery stores in search of water and other basics.Communications were down in large parts of the territory, leaving relatives outside desperately enquiring on social media. I need an update from Chiconi please, my brother, my sister-in-law and my niece are there and Im without any news since Saturday, said one.\n\nFrench President Emmanuel Macron was to hold an emergency meeting about Mayotte later on Monday. Acting health minister Genevieve Darrieussecq said Mamoudzous main hospital was maintaining operations after floodwaters had been cleared while a field clinic would be set up and 100 additional medics deployed.More than three-quarters of Mayottes 321,000 people live in relative poverty. According to 2021 figures from statistics agency INSEE, Mayotte has an annual median disposable income of just over 3,000 euros ($3,150) per inhabitant, roughly eight times less than the Ile-de-France region around Paris.\n\nBIGGEST STORM IN 90 YEARSThe islands, close to the Comoros archipelago, first came under Frances control in 1841. Mayotte is made up of two main islands over an area about twice the size of Washington DC.It has been grappling with unrest in recent years, with many residents angry at undocumented immigration and inflation.The territory has become a stronghold for the far-right National Rally with 60% voting for Marine Le Pen in the 2022 presidential election runoff.\n\nChido was the strongest storm to strike Mayotte in more than 90 years, French weather service Meteo France said.Extreme weather events have become more common around the globe, in keeping with global warming. Poorer nations often say they are bearing the brunt of the environmental crisis despite historically emitting far less CO2 than richer countries.It was evident that  when a cyclone hit  we would find ourselves in a situation, leftwing lawmaker Eric Coquerel told French broadcaster LCI, saying the destruction in Mayotte laid bare a failure to prepare for the impact of climate change.\n\nAround the territory, hundreds of makeshift houses were smashed and scattered, according to images from local media and the French gendarmerie. Coconut trees crashed through building roofs, boats were upended, rubble covered cars and people cowered under tables when the cyclone hit.I was screaming because I could see the end coming for me, John Balloz, who lives in the capital Mamoudzou, told Reuters.\n\nAfter Mayotte, Chido made landfall in north Mozambique where it quickly weakened and was reclassified as a tropical storm on Sunday but still destroyed several houses, authorities said.The prefect of Mayotte, Francois-Xavier Bieuville, said at the weekend that deaths would definitely be in the hundreds and possibly several thousand.Maritime and aerial operations were underway to transport relief supplies and equipment, including from Reunion Island, another French overseas territory, French authorities said.Mayottes main airport, however, remained closed to civilian flights on Monday morning, said Jean-Paul Bosland, the president of Frances national firefighters federation. Reuters\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gdfgdfgd.jpg",
            "description": "Emergency workers sought survivors on Monday and struggled to restore services in Mayotte, France’s poorest overseas territory, where hundreds or even thousands are feared dead from the worst cyclone to hit the Indian Ocean islands in nearly a century. Cyclone Chido devastated large parts of the archipelago off east Africa over the weekend with winds […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Chipinge man jailed for stock theft",
            "url": "https://www.chronicle.co.zw/chipinge-man-jailed-for-stock-theft/",
            "content": "Tarisiro Tafirenyika-[emailprotected]\n\nA 37-YEAR-OLD man from Zibuke village, Chipinge, was sentenced to 12 months in prison for stock theft.\n\nIn a Statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said the incident occurred on 30 November, when the complainant secured her goats for the night at her home in Sithole homestead. On 1 December at around 1:00 AM, Robert Myambo visited the complainants homestead, asking for tobacco. The following morning, the complainant grew suspicious of Myambos late-night visit and checked on her goats, only to discover that three had gone missing.\n\nAlarmed, she alerted other villagers, who then went to Myambos residence. They were able to recover a black and white hide as well as a carcass weighing approximately 10 kg. The total value of the stolen goats was assessed at US$ 120.\n\nMyambo was sentenced to 12 months in prison, with 3 months suspended on the condition that he pay US$120 restitution\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Tarisiro Tafirenyika- tarisirotafirenyika@gmail.com A 37-YEAR-OLD man from Zibuke village, Chipinge, was sentenced to 12 months in prison for stock theft. In a Statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said the incident occurred on 30 November, when the complainant secured her goats for the night at her home in Sithole homestead. On […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Fatal head-butt- Man kills neighbour",
            "url": "https://www.chronicle.co.zw/fatal-head-butt-man-kills-neighbour/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nA 54-YEAR-OLD Gwanda man had appeared in court for fatally beating up his neighbour during a dispute.Chance Ngulube from Tshoboyi area head butted Fundani Ncube on the head several times leaving him injured. Ncube was rushed to Mpilo Central Hospital where he died the following day.Ngulube was remanded out of custody after he was granted US$100 bail by Gwanda magistrate, Mr Progress Murandu.\n\nDistrict public prosecutor, Mr Shepherd Moyo said Ngulube attacked Ncube on November 30.On November the accused person arrived at Malapala Business Centre where he started talking to one Ms Leonorah Ncube who informed him of a misunderstanding she had earlier had with the now deceased Ncube.\n\nDuring the process Ncube over heard the conversation and confronted Ngulube and also insulted him leading to a misunderstanding. Ngulube head butted the now deceased several times on the head. People who were in the business centre intervened and Ngulube from attacking Ncube further, he said.\n\nMr Moyo said Ncube was ferried to Mpilo Central Hospital where he was admitted. His condition continued to deteriorate and he was pronounced dead on the following day.Ngulube was represented by Mr Vezokuhle Ndlovu of Bukhosi Ncube Attorneys. In his submissions for application for bail Ndlovu said his client was not a flight risk and had so far cooperated with the police as they were conducting their investigations.\n\nHe said it was also a legal right of his client to be granted bail.Representing the State, Mr Shepherd Moyo said the accused person was facing a serious offence and could therefore be a flight risk.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw A 54-YEAR-OLD Gwanda man had appeared in court for fatally beating up his neighbour during a dispute. Chance Ngulube from Tshoboyi area head butted Fundani Ncube on the head several times leaving him injured. Ncube was rushed to Mpilo Central Hospital where he died the following day. Ngulube was remanded out of […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "Twelve dead from carbon monoxide poisoning at Georgia ski resort",
            "url": "https://www.chronicle.co.zw/twelve-dead-from-carbon-monoxide-poisoning-at-georgia-ski-resort/",
            "content": "Twelve people have died from carbon monoxide poisoning at a ski resort in Georgia, police have said.\n\nThe bodies of 11 foreigners and one Georgian national were found in a sleeping area above a restaurant in Gudauri, the largest and highest ski resort in the former Soviet state, according to officials.\n\nPolice said preliminary tests do not indicate any trace of violence on the bodies and it appeared to be an accident, the AFP news agency reported.\n\nAn oil-powered generator had been turned on after the building lost electricity on Friday, officers added.\n\nThe bodies were discovered on Saturday on the second floor of a building housing an Indian restaurant.\n\nAuthorities have opened an investigation into the incident and the identities of the victims have not yet been released.\n\nGudauri is a popular tourist destination for skiing and snowboarding enthusiasts, with a range of winter sports activities for visitors of all levels.\n\nIts history dates back to the 19th Century when it was known as a trading post on the ancientGeorgian Military Roadconnecting Russia with Georgia.\n\nGudauri is located in the Caucasus mountains in the Mtskheta-Mtianeti region at around 2,200m (7,200ft) above sea level and is about 120km (75 miles) north of Georgias capital Tbilisi.BBC\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/FGHFJ.jpg",
            "description": "Twelve people have died from carbon monoxide poisoning at a ski resort in Georgia, police have said. The bodies of 11 foreigners and one Georgian national were found in a sleeping area above a restaurant in Gudauri, the largest and highest ski resort in the former Soviet state, according to officials. Police said “preliminary tests […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        },
        {
            "title": "December Border traffic: Zimbabwe, South Africa authorities get down to business.",
            "url": "https://www.chronicle.co.zw/december-border-traffic-zimbabwe-south-africa-authorities-get-down-to-business/",
            "content": "Thupeyo Muleya , Beitbridge Bureau\n\nZIMBABWE and South Africa border authorities have started implementing integrated plans to clear a surge in traffic during the festive season, which has already started building up on both sides of the border.\n\nTraffic is separated into cargo, buses, pedestrians and light vehicles (terminals) on the Zimbabwe side, while the South Africans are opening more service points to cater for customised traffic.\n\nThe Regional Immigration officer in charge of Southern Regional (Beitbridge, Masvingo and Sango), Mr Joshua Chibundu said although there is a notable surge in traffic, they were ready for the peak period.\n\nDuring the off-peak period, they clear a cumulative 13 000 travellers, 1000 commercial trucks, 120 buses, and 2000 light cars daily and the number increases threefold during major holidays.\n\nWe have realised an increase in volumes of travellers and we applaud the Government for installing the online border management system which has enabled us to timeously facilitate entries and exits of our valued travellers, said Mr Chibundu.\n\nHowever, we appeal to our clients to avoid any deals with touts who usually try to take advantage of the increased traffic to dupe travellers of their hard-earned money. The Department of Immigration does not require the services of agents, hence our usual call that every traveller presents him or herself for clearances.\n\nIf there are challenges, please request to see the supervisors who are readily available for assistance. We also urge parents to ensure children are accompanied by reliable relatives as opposed to giving them to bus crews.\n\nSouth Africas Commissioner of the Border Management Authority (BMA), Dr Michael Masiapato said in a statement that they had noted the significant increase in traveller movements across all Ports of Entry as the peak holiday season progresses.\n\nHe said the surge has resulted in long queues across the ports of entry and that the BMA extends sincere apologies for any inconvenience caused by the delays.\n\nWe are aware of the increased traveller volumes, which are normally experienced around this time. We are working closely with all stakeholders to manage operations efficiently and reduce waiting times, he said.\n\nThe BMA urges all travellers to plan their journeys carefully and arrive at the airport earlier than usual to allow sufficient time for processing. Arriving early will help ensure a smoother experience amidst the increased demand.\n\nOur teams on the ground are working tirelessly to manage the flow of people and to ensure that everyone is assisted as quickly as possible.\n\nThe official urged travellers to adhere to Ports of Entry requirements and ensure that all necessary documentation is ready to expedite processing.\n\nThe BMA appreciates the publics understanding and cooperation during this busy period. Updates will be provided as necessary to keep travellers informed of any changes on the ground, added the Commissioner.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghhg.jpg",
            "description": "Thupeyo Muleya , Beitbridge Bureau ZIMBABWE and South Africa border authorities have started implementing integrated plans to clear a surge in traffic during the festive season, which has already started building up on both sides of the border. Traffic is separated into cargo, buses, pedestrians and light vehicles (terminals) on the Zimbabwe side, while the […]",
            "time": "20:43",
            "date": "16 Dec 2024"
        }
    ]
}