{
    "news": [
        {
            "title": "Mudhuwa joins Scottland",
            "url": "https://www.chronicle.co.zw/mudhuwa-joins-scottland/",
            "content": "Innocent KuriraOnline ReporterHIGHLANDERS vice captain Peter Muduhwa has officially been unveiled as a Scottland player.He becomes the second Highlanders player to join the recently promoted side after Lynoth Chikuhwa.Two other players from Bosso, Godfrey Makaruse and Marvellous Chigumira who has already said his goodbyes are also set to be unveiled by the club.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/EFGR4.jpg",
            "description": "Innocent Kurira Online Reporter HIGHLANDERS vice captain Peter Muduhwa has officially been unveiled as a Scottland player. He becomes the second Highlanders player to join the recently promoted side after Lynoth Chikuhwa. Two other players from Bosso, Godfrey Makaruse and Marvellous Chigumira who has already said his goodbyes are also set to be unveiled by […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "19 hippos found dead in Zimbabwe",
            "url": "https://www.chronicle.co.zw/19-hippos-found-dead-in-zimbabwe/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nNINETEEN hippos have died in the Mid Zambezi Region over 3 months, with 18 from the Sapi Safari Area and one in Chirundu Mashonaland West Province.\n\nIn a Press Statement, the Zimbabwe Parks & Wildlife Management Authority (ZimParks) Spokesperson Tinashe Farawo said: The Authority is carrying out investigations with various partners to ascertain the cause of deaths. Samples have been taken and sent for lab testing and we are waiting for the results.\n\nThe health and safety of wildlife in Zimbabwe remain our top priority, and we are committed to providing thorough updates as new information becomes available.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/01/1-hippo-ancestry.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com NINETEEN hippos have died in the Mid Zambezi Region over 3 months, with 18 from the Sapi Safari Area and one in Chirundu Mashonaland West Province. In a Press Statement, the Zimbabwe Parks & Wildlife Management Authority (ZimParks) Spokesperson Tinashe Farawo said: “The Authority is carrying out investigations with various partners to […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Bulawayo thieves grab safe with US$10,5k and dump it intact along streambank",
            "url": "https://www.chronicle.co.zw/bulawayo-thieves-grab-safe-with-us105k-and-dump-it-intact-along-streambank/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nIN a comical heist that has stunned authorities, thieves struck a Bulawayo shop under the cover of darkness, making off with a safe containing US$10 569.A bizarre series of events that culminated in the unknown suspects dumping the safe, intact with all the cash along a streambank after apparently failing to open it, unfolded.\n\nOn 6 January 2025, the thieves smashed a window pane, folded back the burglar bars, and gained unfettered access to the premises.They grabbed a Chubb safe, hauling it out on a Jack trolley, leaving a trail of clues that would later prove crucial in police investigations.\n\nIn a Press Statement, Assistant Inspector Nomalanga Msebele said: then tracked the trolley marks towards Tshabalala and managed to recover the safe which had US$10 569 still intact and cash still in the safe along stream bank near a Beer Garden in Tshabalala, Bulawayo. The Jack Trolley was not recovered. The total value stolen isUS$11 869 and total value recovered US$11 269.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2013/11/money_4776560_lrg.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com IN a comical heist that has stunned authorities, thieves struck a Bulawayo shop under the cover of darkness, making off with a safe containing US$10 569. A bizarre series of events that culminated in the unknown suspects dumping the safe, intact with all the cash along a streambank after apparently failing to […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Chikuhwa officially joins Scottland",
            "url": "https://www.chronicle.co.zw/chikuhwa-officially-joins-scottland/",
            "content": "Innocent Kurira, Online Reporter\n\nScottland FC has completed the signing of the three best players in the land from last season including top goal scorer Lynoth Chikuhwa.\n\nIn their latest squad announcement, Scottland have officially unveiled Soccer of the year Walter Musona, second runner-up Khama Billiat and first runner up Chikuhwa.\n\nThis follows the announcement of 12 other new signings on Tuesday, namely, Godknows Murwira, Mthokozisi Msebe, Tymon Machope, Michael Tapera, Kevin Moyo, Talbert Shumba, Nelson Chadya, Panashe Mutimbanyoka, Gareth Madhake, Tichaona Chipunza, Vasssili Kawe and Kingsley Mureremba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fghgjb.jpg",
            "description": "Innocent Kurira, Online Reporter Scottland FC has completed the signing of  the three best players in the land from last season including top goal scorer Lynoth Chikuhwa. In their latest squad announcement, Scottland have officially unveiled Soccer of the year Walter Musona, second runner-up Khama Billiat and first runner up Chikuhwa. This follows the announcement […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Maswanhise wins another player of the month award",
            "url": "https://www.chronicle.co.zw/maswanhise-wins-another-player-of-the-month-award/",
            "content": "Online Reporter\n\nWARRIORS international Tawanda Maswanhise has been voted as the G4 Claims December player of the month for his club Motherwell.\n\nHe won the same award last month.\n\nDecember kicked off with a substitute appearance against Dundee, before being an unused sub against St Mirren.\n\nMaswanhise was then brought into the starting lineup against Dundee United, where he placed the ball perfectly onto Apostolos Stamatelopoulos head, where the Aussie made it 3-1 in the game.\n\nHe was back amongst the goals against Rangers at Fir Park, bringing the ball down perfectly before performing a stunning piece of trickery to evade the Rangers defenders before flashing the ball into the bottom corner.\n\nThis came after his excellent through ball for Stamatelopoulos to open the scoring.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gty.jpg",
            "description": "Online Reporter WARRIORS international Tawanda Maswanhise has been voted as the G4 Claims December player of the month for his club Motherwell. He won the same award last month. December kicked off with a substitute appearance against Dundee, before being an unused sub against St Mirren. Maswanhise was then brought into the starting lineup against […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "It’s all lies! Police react after group storms Chitungwiza heist in search of US$4 million bank heist loot",
            "url": "https://www.chronicle.co.zw/its-all-lies-police-react-after-group-storms-chitungwiza-heist-in-search-of-us4-million-bank-heist-loot/",
            "content": "Diana Baloyi Moyo,[emailprotected]\n\nA GROUP of people broke into a house in Chitungwiza, stole US$13 500 and damaged property in search of cash, following a social media rumour that part of US$4 million that was taken from a bank in Bulawayo last year was at the house.\n\nNational police spokesperson Commissioner Paul Nyathi dismissed the viral social media post on the alleged discovery of part of the US$4 million at the house.\n\nOn 3 October last year, armed robbers got away with US$4 million from Ecobank during a heist and are still at large.\n\nSocial media was abuzz with a story that part of the loot had been discovered in Chitungwiza.\n\nFollowing the rumour members of the public last week forced entry into the alleged house while the owner was away and took US$13 500, damaging property in search of the money. The house in Unit F, Seke, Chitungwiza belongs to a businessman who runs a hardware shop in Harare.\n\nThe Zimbabwe Republic Police dismisses viral social media posts on the alleged discovery of part of USD 4 million Bulawayo bank robbery heist at a certain house in Unit F, Seke, Chitungwiza. The allegations are false and should be dismissed with the contempt they deserve.\n\nThe public did not find part of the USD 4 million heist as alleged on the social media platforms. The public is urged to be cautious and avoid being reactionary to false social media messages. Meanwhile, the Zimbabwe Republic Police is conducting investigations into the unlawful entry and theft of US$ 13 500, said Comm Nyathi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/fake-news-2.jpg",
            "description": "Diana Baloyi Moyo, moyodiana@gmmail.com A GROUP of people broke into a house in Chitungwiza, stole US$13 500 and damaged property in search of cash, following a social media rumour that part of US$4 million that was taken from a bank in Bulawayo last year was at the house. National police spokesperson Commissioner Paul Nyathi dismissed […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Bulawayo farmer fatally runs over sleeping baby",
            "url": "https://www.chronicle.co.zw/bulawayo-farmer-fatally-runs-over-sleeping-baby/",
            "content": "Diana Baloyi Moyo,[emailprotected]A FARMER in Bulawayo fatally ran over an eight-month-old baby who was sleeping on a grassy patch at his plot as he was reversing his car.The baby belonged to a woman who had come to do a piece job, harvesting tomatoes, at the plot situated in Glengarry.\n\nPolice said the tragedy occurred on 7 January and the unnamed farmer has been arrested and charged with culpable homicide.In a statement on X police said baby Amathe Shumba sustained serious head injuries and stomach bruises and was taken to the United Bulawayo Hospitals (UBH) where she died upon admission.\n\nThe driver was charged with Culpable Homicide as he had failed to keep a proper lookout before driving.Police have warned drivers to be always alert and drive with due care, checking their surroundings especially when reversing in the residential areas.Members of the public were also warned to be extra careful when there are children aroun\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/12/hit-and-run-incident.jpg",
            "description": "Diana Baloyi Moyo,moyodiana@gmail.com A FARMER in Bulawayo fatally ran over an eight-month-old baby who was sleeping on a grassy patch at his plot as he was reversing his car. The baby belonged to a woman who had come to do a piece job, harvesting tomatoes, at the plot situated in Glengarry. Police said the tragedy […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "‘Put some respect on my name’: Kelly Khumalo outraged by eNCA’s mistaken death report",
            "url": "https://www.chronicle.co.zw/put-some-respect-on-my-name-kelly-khumalo-outraged-by-encas-mistaken-death-report/",
            "content": "Singer Kelly Khumalo has expressed outrage after a slip of the tongue by a news reader announced her death, and not that of Winnie Khumalo.\n\nSouth African news broadcaster eNCA found itself in hot water after news presenter Shahan Ramkissoon mistakenly reported the death of singerKelly Khumaloinstead of musicianWinnie Khumalo, who passed away on Tuesday.\n\nThe error caused an uproar, with Kelly Khumalo herself expressing her outrage on social media.\n\nIn a strongly worded Instagram post, the singer called out the broadcaster for its carelessness.\n\n@encanews, you may dislike me or hold me in low regard, but this is incredibly reckless, ignorant, and disrespectful  not just to me but to those who love and care about me, especially my children. PUT SOME RESPECT ON MY NAME, Kelly wrote.\n\nRamkissoon took to X issued an apology admitting the gravity of his error.\n\nI made an honest mistake, which I corrected shortly afterwards on air. It was a slip of the tongue as I ad-libbed the story. I take full responsibility for the error. To those seeking to amplify this for attention: do what you must trend and stay blessed, he wrote.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Singer-Kelly-Khumalo-has-expressed-outrage-after-a-slip-of-the-tongue-by-a-news-reader-announced-her-death-and-not-that-of-Winnie-Khumalo-680x380.png",
            "description": "Singer Kelly Khumalo has expressed outrage after a slip of the tongue by a news reader announced her death, and not that of Winnie Khumalo. South African news broadcaster eNCA found itself in hot water after news presenter Shahan Ramkissoon mistakenly reported the death of singer Kelly Khumalo instead of musician Winnie Khumalo, who passed […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Urgency mounts in search for survivors of powerful Tibet earthquake",
            "url": "https://www.chronicle.co.zw/urgency-mounts-in-search-for-survivors-of-powerful-tibet-earthquake/",
            "content": "Make sense of the latest ESG trends affecting companies and governments with the Reuters Sustainable Switch newsletter.Sign uphere.\n\nReporting by Joe Cash in Beijing; Additional reporting by Ryan Woo in Beijing, Gopal Sharma in Kathmandu, Monica Naime in Mexico City; Editing by Lincoln Feast, Raju Gopalakrishnan and Alex Richardson\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/uki76i8.jpg",
            "description": "BEIJING, Jan 8 (Reuters) – More than 400 people trapped by rubble in earthquake-stricken Tibet have been rescued, Chinese officials said on Wednesday, with an unknown number still unaccounted for in freezing weather a day after a strong tremor rocked the Himalayan foothills. The epicentre of Tuesday’s magnitude 6.8 quake, one of the region’s most powerful tremors in recent […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        },
        {
            "title": "Wildfires rage in Los Angeles, forcing tens of thousands to flee",
            "url": "https://www.chronicle.co.zw/wildfires-rage-in-los-angeles-forcing-tens-of-thousands-to-flee/",
            "content": "\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Burning-Fire.jpg",
            "description": "LOS ANGELES, Jan 7 (Reuters) – A rapidly growing wildfire raged across an upscale section of Los Angeles on Tuesday, destroying numerous buildings and creating traffic jams as more than 30,000 people evacuated, while a second blaze doubled in size some 30 miles inland. At least 2,921 acres (1,182 hectares) of the Pacific Palisades area […]",
            "time": "21:06",
            "date": "08 Jan 2025"
        }
    ]
}