{
    "news": [
        {
            "title": "Filabusi man in court for “raping” neighbour’s 10-year-old daughter",
            "url": "https://www.chronicle.co.zw/filabusi-man-in-court-for-raping-neighbours-10-year-old-daughter/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nA 34-YEAR-OLD man from Filabusi in Insiza District has appeared in court facing allegations of raping his neighbours 10-year-old daughter and offering her sweets in an attempt to silence her.\n\nDumisani Ncube appeared before Gwanda regional magistrate, Ms Sithembiso Ndebele and he pleaded not guilty to a charge of rape. He was remanded in custody to April 17 for trial.\n\nProsecuting, Mr Ngonidzashe Shumba told the court that in February this year, Ncube lured the young girl into his house under the pretext of giving her sweets, before allegedly raping her.\n\nOn the day in question, the complainant was playing outside her home with other children when the accused called her into his house, claiming he wanted to give her sweets to share with her friends, said Mr Shumba.\n\nOnce inside, the court heard, Ncube directed the girl to his bedroom where he allegedly raped her. He then gave her sweets and instructed her to return outside and continue playing.\n\nThe following day, the girl began complaining of pain in her private parts, prompting her to confide in her mother. A police report was made, leading to Ncubes arrest.\n\nIn his defence, Ncube denied the allegations, claiming they were fabricated by the complainants mother due to a personal grudge.\n\nYour Worship, I didnt rape the complainant, and I have never summoned her into my bedroom. The complainant is young enough to be my daughter. I am a principled person and would never do such a thing.\n\nHe further told the court that he had previously had a dispute with the complainants mother, which he believes led her to make false accusations against him.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/gavel-rape.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw A 34-YEAR-OLD man from Filabusi in Insiza District has appeared in court facing allegations of raping his neighbour’s 10-year-old daughter and offering her sweets in an attempt to silence her. Dumisani Ncube appeared before Gwanda regional magistrate, Ms Sithembiso Ndebele and he pleaded not guilty to a charge of rape. He was remanded […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Man in court for threatening to kill police officer, children",
            "url": "https://www.chronicle.co.zw/man-in-court-for-threatening-to-kill-police-officer-children/",
            "content": "Peter Matika\n\n[emailprotected]\n\nA BULAWAYO man who allegedly threatened to kill his police officer wife and their children has appeared in court facing domestic violence charges.\n\nTavakada Mbondiah (41) of Sauerstown suburb appeared before Bulawayo magistrate Mrs Eva Matura on Wednesday. The matter was postponed to Friday for continuation.\n\nThe case surfaced after his wife, 39-year-old Anna Sibanda, reported persistent abuse that she said has severely affected her mental health, leading to depression.\n\nThe prosecutor, Mr Samuel Mpofu, told the court that the most recent incident occurred on April 6, following a dispute about a broken window.\n\nOn Sunday, the accused returned home and was served food by their daughter. He then summoned one of their sons to question him over the broken window, said Mr Mpofu.\n\nAfter receiving an explanation, Mbondiah allegedly became violent, accusing the boy of being a troublemaker and a burden to the family. He then began assaulting him.\n\nWhen Ms Sibanda intervened to protect their son, the court heard, Mbondiah turned his anger towards her.\n\nHe threatened to kill both his wife and their son, saying he would squash their heads, said Mr Mpofu.\n\nMbondiah is also accused of emotionally abusing his wife, including forcing her to call a relative and falsely confess to mismanaging his money. Ms Sibanda told the court this was not the first time she had received threats from her husband.\n\nShe added that the toxic relationship has left her battling severe depression and that she fears the situation will continue to deteriorate if left unaddressed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Peter Matika peter.matika@chronicle.co.zw A BULAWAYO man who allegedly threatened to kill his police officer wife and their children has appeared in court facing domestic violence charges. Tavakada Mbondiah (41) of Sauerstown suburb appeared before Bulawayo magistrate Mrs Eva Matura on Wednesday. The matter was postponed to Friday for continuation. The case surfaced after his wife, […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "National Energy Efficiency Policy launched to drive sustainable growth",
            "url": "https://www.chronicle.co.zw/national-energy-efficiency-policy-launched-to-drive-sustainable-growth/",
            "content": "Nqobile Bhebhe in Victoria Falls\n\nTHE National Energy Efficiency Policy, launched on Wednesday, aims among other strategies to optimise the use of existing energy resources, reduce waste and promote sustainable practices across Zimbabwes economy.\n\nThe policy was officially launched on Wednesday here in Victoria Falls by Vice President Constantino Chiwenga during the ongoing International Renewable Energy Conference.\n\nAccording to the document, the policy is grounded in principles of development, sustainability, affordability, accessibility, social inclusion, gender equity, and employment creation.\n\nIt promotes strategies that address the energy needs of women, youths and other vulnerable groups, while strengthening their participation in energy efficiency initiatives.\n\nThe policy outlines plans to boost energy efficiency in the industrial sector through the creation of an Industrial Energy Efficiency Programme (IEEP), implemented in collaboration with partners and stakeholders.\n\nThe IEEP programme shall also leverage resources and synergies under the regional SADC Industrial Energy Efficiency Programme (SIEEP), which is intended to support the implementation of the SADC Industrialization Strategy and the 20162030 Roadmap. This will contribute to the competitiveness of the industrial sectors by building their capacity to adopt, invest in and utilise energy-efficiency.\n\nUnder the mining sector which is strategic in the national economy, the policy says that the sector is a massive consumer of electricity accounting for more than 20 percent of the utility generated power.\n\nThe implementation of the energy efficiency in mining will not only improve their international competitiveness but can also deliver significant benefits to other energy consumers, it says.\n\nThe Government shall encourage the mining sector to improve on their energy intensities. This will be enhanced by establishing institutional energy efficiency policies and energy management programmes.\n\nTurning to the artisanal and small-scale miners energy efficiency improvement, the policy encourages the establishment of an energy consumption baseline for small-scale and artisanal miners.\n\nThis data shall be a reference point in the continuous improvement of their energy intensities.\n\nOn agriculture Government undertakes to promote energy-smart Argo-chain systems that will take full advantage of available renewable energy and waste-to-energy technologies.\n\nThe Government undertakes to explore, integrate, and apply various energy efficiency technologies in specified value chains as enshrined in the Agriculture Food Systems and Transformation Strategy (AFSTS), reads part of the document.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-11.58.00_9a92150b-678x380.jpg",
            "description": "Nqobile Bhebhe in Victoria Falls THE National Energy Efficiency Policy, launched on Wednesday, aims among other strategies to optimise the use of existing energy resources, reduce waste and promote sustainable practices across Zimbabwe’s economy. The policy was officially launched on Wednesday here in Victoria Falls by Vice President Constantino Chiwenga during the ongoing International Renewable […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Watch: “Ranganai henyu”: Teary Dorcas Moyo collects brand new car, US$20k",
            "url": "https://www.chronicle.co.zw/watch-ranganai-henyu-teary-dorcas-moyo-collects-brand-new-car-us20k/",
            "content": "Zimpapers Arts & Entertainment Hub\n\nGospel musician Dorcas Moyo has officially collected the brand-new Toyota Fortuner 2.4 GD6 and US$20 000 gifted to her by Wicknell Chivayo earlier this week. The handover took place at a car dealership in Harare.\n\nAn emotional Moyo expressed deep gratitude for the generous gesture.Blessed is the hand that gives more than the one that receives. I pen this message with utmost disbelief and heartfelt appreciation. This level of generosity should never go unnoticed, she wrote.\n\nhttps://youtube.com/shorts/-gL25pdnLPo\n\nIm truly short of words to express my sincerest thanks to you, my brother Sir Wicknell, for this unmatched divine deed. May God the Almighty continue to bless you beyond human comprehension. Please accept this message from the depths of my heart.\n\nMoyo was presented with the vehicle as a way of cheering her up after she recently made headlines for a statement she posted on March 31: Ranganai henyu asi zvichakona (You might plot, but it wont succeed).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Dorcas-1.jpg",
            "description": "Zimpapers Arts & Entertainment Hub Gospel musician Dorcas Moyo has officially collected the brand-new Toyota Fortuner 2.4 GD6 and US$20 000 gifted to her by Wicknell Chivayo earlier this week. The handover took place at a car dealership in Harare.   An emotional Moyo expressed deep gratitude for the generous gesture. “Blessed is the hand […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Bulawayo South legislator sends 22,000 litres of water to Sizinda",
            "url": "https://www.chronicle.co.zw/bulawayo-south-legislator-sends-22000-litres-of-water-to-sizinda/",
            "content": "Sikhumbuzo Moyo\n\n[emailprotected]\n\nBULAWAYO South legislator, Raj Modi on Wednesday dispatched a bowser carrying 22 000 litres of water to Sizinda residents who had gone for three weeks without the precious liquid.\n\nCde Modi is also the Deputy Minister of Industry and Commerce.\n\nDeputy Minister of Industry and Commerce, Raj Modi.\n\nThe bowser delivered water to excited residents in three different areas in the suburb with residents, both young and old, even ignoring the brief rain showers to queue for water.\n\nThe City has been battling water challenges since last year due to low water levels at its supply dams coupled with obsolete pumping equipment that has resulted in losses of nearly 50 percent of non-revenue water (NRW).\n\nNRW is defined as water that is pumped or produced but is subsequently lost or otherwise unaccounted for in the system.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-09-at-14.36.43_ec22bfb3.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw BULAWAYO South legislator, Raj Modi on Wednesday dispatched a bowser carrying 22 000 litres of water to Sizinda residents who had gone for three weeks without the precious liquid. Cde Modi is also the Deputy Minister of Industry and Commerce. The bowser delivered water to excited residents in three different areas in […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Madlela Skhobokhobo’s contributions to local arts scene recognised at Imiklomelo KaDakamela",
            "url": "https://www.chronicle.co.zw/madlela-skhobokhobos-contributions-to-local-arts-scene-recognised-at-imiklomelo-kadakamela/",
            "content": "Zimpapers Arts & Entertainment Hub\n\nMusician, comedian, and actor Madlela Skhobokhobo, born Mothusi Bashimane Ndlovu, has been honoured with an Imiklomelo KaDakamela award for his exceptional contributions to the entertainment industry.\n\nBest known for his hit song Ngamnanka, Madlela has earned widespread recognition for his multifaceted talents as an MC, actor, musician, comedian, and storyteller, winning fans across the region. His career boasts multiple accolades, including five Bulawayo Arts Awards, affirming his position as a leading figure in the arts and entertainment scene.\n\nThe Imiklomelo KaDakamela awards, in their third year, were held last weekend in Nkayi to celebrate excellence in various fields, including community development, education, and entertainment.\n\nExpressing his joy, Madlela said, Im extremely happy and feel very honoured. This award is special because it comes from a traditional chief; it means a lot to me.\n\nMadlela believes the recognition will further elevate his profile, adding, This is a huge platform. The fact that my name is now among the winners means people who didnt know me, from Zambia, South Africa, and Tanzania, now know my potential.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/uu.jpg",
            "description": "Zimpapers Arts & Entertainment Hub Musician, comedian, and actor Madlela Skhobokhobo, born Mothusi Bashimane Ndlovu, has been honoured with an Imiklomelo KaDakamela award for his exceptional contributions to the entertainment industry.   Best known for his hit song “Ngamnanka”, Madlela has earned widespread recognition for his multifaceted talents as an MC, actor, musician, comedian, and […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Law Society exposes bogus lawyer",
            "url": "https://www.chronicle.co.zw/law-society-exposes-bogus-lawyer/",
            "content": "Trish Mukwazo\n\nTHE Law Society of Zimbabwe (LSZ) has distanced themselves from a Bulawayo-based individual, Mr Martin Chirwa who they say has been masquerading as a legal practitioner.\n\nIn a statement, LSZ revealed that Mr Chirwa was a bogus lawyer as he is not their member nor is he a registered legal practitioner.\n\nThe Law Society of Zimbabwe has noted with grave concern a story in the Chronicle newspapers Monday, 7 April 2025 edition identifying an individual going by the name Martin Chirwa as a legal practitioner. The said Mr Chirwa is accused of defrauding a beneficiary of a divorce settlement of US$15 000,\n\nThe Law Society of Zimbabwe would like to put it on record that Mr Chirwa is neither a member of the Law Society of Zimbabwe nor a registered legal practitioner. He, therefore, cannot be identified or hold himself out to be a legal practitioner, the statement reads.\n\nThe Law Society said it is a criminal offense for anyone other than a duly-registered legal practitioner to hold themselves out as one.\n\nThe Council of the Law Society of Zimbabwe has since encouraged the public and stakeholders to demand proof of registration in the form of a current Practicing Certificate before engaging and or entertaining a lawyer.\n\nThe Law Society of Zimbabwe is available to assist with confirmation of anyone holding themselves out to be a legal practitioner. The public and stakeholders can contact our offices in Harare at No. 46 Kwame Nkrumah. Tel 242 751000/779207-9 or 3 Barbour Avenue in Bulawayo. Tel 292 260843, the Law Society said.\n\nThe 36-year-old bogus agent appeared in court last week for allegedly converting a clients over US$15 000 for personal use.\n\nMr Chirwa was reportedly given the money by Mr Denford Gwizis ex-wifes lawyers as a divorce settlement of 50 percent share of a house in Emganwini suburb.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/law-society.jpg-zim.jpg",
            "description": "Trish Mukwazo THE Law Society of Zimbabwe (LSZ) has distanced themselves from a Bulawayo-based individual, Mr Martin Chirwa who they say has been masquerading as a legal practitioner. In a statement, LSZ revealed that Mr Chirwa was a bogus lawyer as he is not their member nor is he a registered legal practitioner. “The Law […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Elvis Moyo gears up for EFC 122 title clash with Antony Morel",
            "url": "https://www.chronicle.co.zw/elvis-moyo-gears-up-for-efc-122-title-clash-with-antony-morel/",
            "content": "Innocent Kurira,Zimpapers Sports Hub\n\nAHEAD of his fight with Antony Morel on Thursday, Elvis Moyo is weighing in at 118kg, compared to Morels 115kg. The weigh-in took place on Wednesday, with both fighters having passed their medicals and cleared to compete.\n\nZimbabwean heavyweight boxing and mixed martial arts exponent, Elvis Bulawayo Bomber Moyo, is set to face Antony Morel at Extreme Fighting Championships (EFC) 122 on April 10 in South Africa.\n\nThis highly anticipated contest follows the cancellation of Moyos bare-knuckle fight against Matunga Djikisa, which was scheduled for October 10 last year.\n\nMoyo is eager to step into the cage after several previous fight cancellations. Returning to the hexagon after a seven-year absence, Moyo will face Morel for the title at EFC 122.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-08-at-21.03.53-19.jpeg",
            "description": "Innocent Kurira, Zimpapers Sports Hub AHEAD of his fight with Antony Morel on Thursday, Elvis Moyo is weighing in at 118kg, compared to Morel’s 115kg. The weigh-in took place on Wednesday, with both fighters having passed their medicals and cleared to compete. Zimbabwean heavyweight boxing and mixed martial arts exponent, Elvis “Bulawayo Bomber” Moyo, is set […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Chiredzi man gets nine-year sentence after being found in possession of unmarked ivory",
            "url": "https://www.chronicle.co.zw/chiredzi-man-gets-nine-year-sentence-after-being-found-in-possession-of-unmarked-ivory/",
            "content": "Langelihle S Nyathi,[emailprotected]\n\nRobert Lithlathla, a 58-year-old man, from Chief Sengwe, Chiredzi appeared before the Chiredzi Magestrates Court after violating the Parks and Wildlife Act\n\nAccording to a statement by the National Prosecuting Authority of Zimbabwe on Lithlathla, on March 25, 2025, game rangers from Gonarezhou National Park received a tip-off that the accused was in possession of ivory.\n\nActing on this information, the rangers, along with police officers, proceeded to Davata Market, where they found the accused with a sack tied to the carrier of his motorcycle.\n\nA search revealed an unmarked elephant tusk weighing 3.5 kg and an eland horn, valued at a total of USD 55,000 which the accused could not produce a permit for possessing.\n\nThe accused was arrested and found guilty, and was sentenced to 9 years in prison.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/04/IVORY.jpg",
            "description": "Langelihle S Nyathi, langae2001@gmail.com Robert Lithlathla, a 58-year-old man, from Chief Sengwe, Chiredzi appeared before the Chiredzi Magestrates’ Court after violating the Parks and Wildlife Act According to a statement by the National Prosecuting Authority of Zimbabwe on Lithlathla, on March 25, 2025, game rangers from Gonarezhou National Park received a tip-off that the accused […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        },
        {
            "title": "Chiredzi teen in court for car theft",
            "url": "https://www.chronicle.co.zw/chiredzi-teen-in-court-for-car-theft/",
            "content": "Langelihle S Nyathi,[emailprotected]\n\nA 17-year-old teenager from Mkwasine, Chiredzi, appeared before the Chiredzi Magistrates Court facing car theft charges.\n\nThe teen was sentenced to a suspended three-year prison.\n\nIt is reported that on March 28, 2025, the complainants driver parked a Nissan Caravan at Mzie garage and handed the keys to the informant, who works as a security guard at the garage.\n\nThe informant then gave the keys to the accused, who was working a temporary job at the garage, for safekeeping but the accused kept the keys in his pocket.\n\nThe convicted teen and the informant went out to drink beer together, but the accused left the informant and returned to the garage, where he stole the vehicle.\n\nWhen the informant returned to the garage, he found the vehicle missing and reported the theft to the police, leading to an investigation and the subsequent arrest of the accused.\n\nThe stolen vehicle was recovered the next day following the arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Langelihle S Nyathi, langae2001@gmail.com A 17-year-old teenager from Mkwasine, Chiredzi, appeared before the Chiredzi Magistrates Court facing car theft charges. The teen was sentenced to a suspended three-year prison. It is reported that on March 28, 2025, the complainant’s driver parked a Nissan Caravan at Mzie garage and handed the keys to the informant, who […]",
            "time": "18:41",
            "date": "09 Apr 2025"
        }
    ]
}