{
    "news": [
        {
            "title": "6-million young mums in Africa are not in school, they can be",
            "url": "https://www.chronicle.co.zw/6-million-young-mums-in-africa-are-not-in-school-they-can-be/",
            "content": "For the past five years, about130 000 adolescent girlshave given birth in South Africa each year  it meansone in every seven babiesare born to teenagers.\n\nThis challenge crosses South Africas borders.\n\nIn East and Southern Africa, a quarter of young womengive birth before theyre 18, with the teen pregnancy rate in the region at92 per 1 000 girls, twice the global average. Moreover,six in ten girlsare not in school.\n\nOther social issues add to this: close to80-million girls experience sexual violence before they turn 18, and about3 100 in the age group 1524 acquire HIV every week.\n\nResearch shows one of the best ways to help adolescent moms build a life for them and their babies is to keep them in school  and most importantly, help them to finish secondary school.\n\nBecause when young moms finish school, they tend to havemore job opportunities, and better health  forthemselvesand their children.\n\nBut restrictive policies, stigma and discrimination, and financial hardships can stop mothering learners from going back to school. In fact, in sub-Saharan Africaover 6-millionpregnant and parenting girls are out of school  with many not going back after giving birth.\n\nThe African Union (AU) declared 2024 theyear of education in Africa, with the continents leaders vowing to make girls and womens schooling a priority.\n\nAdolescent moms  an often overlooked group  need specific support, say thesignatories to an AU-backed set of recommendations, declared at the1st African Union Pan-African Conference on Girls and Womens Education.\n\nHaving a baby before 18 can put both young mothers and their children at risk. Such moms aretwo to five times more likely to die during labourthan women in their 20s, maydrop out of schoolandfall pregnant again soon, andcan facemental health challenges. Their babies may alsodie at a young ageorstrugglewith physical and cognitive development and haveworse educational outcomes.\n\nWhat can help fulfil adolescent moms right to education  and unlock their potential for a continent with a brighter future?\n\nSet policies to help girls go back to school\n\nAccording to a 2022 Human Rights Watch report, at least 38 African countries have adopted laws or policies that ensure pregnant girls can stay in school and go back after giving birth.\n\nKnowing about these rights might be protective. For instance,in Zambia, young moms who knew about their countrys re-entry policy were almost 90% less likely to leave school because of teasing or bullying and said they felt less stigmatised when they came back after giving birth.\n\nBut just knowing that girls should be able to go back to school without shame is not enough  especially among school administrators responsible for implementing these policies.A 2015 study from Kenyafound that while teachers were aware of the countrys re-entry policy, they chose not to implement it, to preserve the image of the school.\n\nHaving support from their school could influence how easy  or difficult  it is for adolescent mothers to return to school,studies show. Teachers can make or break this, especially with evidence from several countries showing that these moms report being treated badly by their educators.\n\nHowever, properly trained and empowered teachers can create an inclusive and welcoming environment through, for example,being more empathicand introducing more flexible teaching methods, such as helping withcatch-up plansfor missed schoolwork. Anevidence-informed training toolkitplanned to be field tested in South Africa to help educators meet the needs of mothering learners was co-developed in South Africa with teachers and school managers, governing bodies, community organisations, government stakeholders, and young moms themselves.\n\nMake it easier for girls to keep on learning  and be moms at the same time\n\nMalawis Zomba Programme, which paid tuition fees for school-going girls in the rural Zomba district in an effort to combat HIV, not only lowered HIV rates (by 64%) but also delayed early marriage and pregnancy and encouraged girls who dropped out of school to go back to their classes. Barriers such as long commutes to school or money worries are more pronounced in the case of school-going mothers, because they need to organise  and sometimes pay for  someone to look after their babies.\n\nWhen childcare services are available, young moms report experiencing greater autonomy in theirdecisions about continuing with school. In South Africa, research has shown that making use of childcare is linked withhigher oddsof moms being in school or having a job, passing to the next grade, having positive plans for the future and showing a healthy parenting style. Their children also tend to score better on thinking, language and motor tasks as they get older than when they were not in childcare.\n\nBut schools alone cant meet all the needs of adolescent mothers; other sectors need to provide support too.\n\nFor example, an analysis of child welfare outcomes in Ethiopia (20022013)showed thatthe health extension programme, which addressed health education, child vaccination and family planning, helped to reduce child marriage and adolescent pregnancy, increased school enrolment, and improved childrens skills in reading and working with numbers.\n\nFindingsfrom a study with adolescent girls in the Eastern Cape, including those whove had a baby, show that having enough to eat is linked with fewer of them engaging in transactional sex, sex while on substances and sex with an older partner  and at the same time supports school enrolment.\n\nHelp girls tap into peer support\n\nHavingsupport from friends(including other young moms), parents or teachers can help girls continue their schooling. For example, in a2022 studyin Malawi, young mothers reported that all-women groups from the community worked with school staff and parents to encourage them to come back to class after giving birth.\n\nAcrossseveral eastern and southern African countries, peer providers  other young moms from the same community  offer mental health and social support, such as for accessing cash grants and findingalternative routes to keep learning(like vocational training) and other ways to earn their own money.\n\nSello Matsoso, programme director ofHelp Lesotho, a non-profit organisation that runs life skills and social support projects in the country, says theyve seen many positive outcomes when such support is in place, such as young mothers feeling markedly more hopeful and confident in seeking health services, more using condoms during sex, and intimate partner violence dropping by almost half.\n\nThe intersecting challenges that adolescent girls and mothers may face  such as HIV and violence  highlight the need for interventions that address a combination of issues, rather than just one.\n\nFor example, in South Africa,findings showthat this approach is linked to positive educationandhealth outcomes among these young women: staying in school during pregnancy, feeling self-confident, getting friendly and respectful health services and the use of formal childcare services are linked with more condom use (5566%)  thus lowering the chance of getting HIV and falling pregnant again quickly  more mothering girls progressing to the next grade (3779%) as well as more going back to school after giving birth (4090%).\n\nInvesting in girls education  also for those whove had a baby  and helping them stay in school can unlock their potential, help them break out of poverty and build healthier and better educated future generations.\n\nBut for this to happen, harmful social and gender norms that infringe on these girls rights need to be broken down so that they can be part of shaping their own future.\n\nThe AUs commitment to inclusive education is an important step towards giving young women a brighter future, but only swift, accountable action will ensure that every girl can learn, thrive and contribute to a healthier, more equitable society.\n\nAuthors: Shanice Kasura, Itumeleng Senetla, Chiedza Chinakwetu, Alice Armstrong and Jane Kelly\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/Untitled-58-6.jpg",
            "description": "For the past five years, about 130 000 adolescent girls have given birth in South Africa each year — it means one in every seven babies are born to teenagers. This challenge crosses South Africa’s borders. In East and Southern Africa, a quarter of young women give birth before they’re 18, with the teen pregnancy […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Man City’s Etihad Stadium evacuated as FIRE breaks out before Champions League match",
            "url": "https://www.chronicle.co.zw/man-citys-etihad-stadium-evacuated-as-fire-breaks-out-before-champions-league-match/",
            "content": "Manchester City take on Club Brugge in their final Champions League group game on Wednesday night but the build up to the game has been blighted by a fire outside of the Etihad Stadium\n\nA fire broke out at the Etihad Stadium just hours beforeManchester Citys crucial Champions League clash with aClub Brugge.\n\nThe blaze took place at a merchandise stall just yards from the Colin Bell Stand of the arena. A gas canister is understood to have caught fire, with the fire brigade called to douse the flames, while the Etihad itself was evacuated.\n\nThe safety of all attending the match tonight is our top priority, and as such all events planned for West Stand reception have been cancelled, including the welcome event for new players, and the first team arrival.\n\nNone of the trio were eligible to play against Club Brugge due toChampions Leagueregistration rules  a blow considering the importance of the game.\n\nThe pre-match event was suspended as flames took hold of the stand and stewards moved fans away before fire services arrived on the scene. At the time of writing, it is unknown at this stage whether the incident will affect the scheduled kick-off time of 8pm.\n\nThe area was quickly evacuated by stewards and security staff and a fire engine was on the scene within minutes. The fire soon appeared to be brought under control.\n\nThe fire brigade was called to deal with the fire(Image:PA)\n\nIt was announced at 6.22pm that the stadium was open and fans could enter but three entrance gates inside the cordoned-off area close to the scene of the fire were still closed. The remainder of the pre-match show was cancelled.\n\nCity face a pivotal evening on Wednesday as they come up against the Belgian side. They must win to guarantee themselves a playoff place, anything else would result in the 2023 champions being knocked out of the tournament.\n\nSpeaking ahead of the clash, City bossPep Guardiolasaid: The situation that we have is that we have to win the game and if not we will not continue in this competition.\n\nWe want to have another chance to play another two games, to have the chance of the next stages. Its not a problem, its an opportunity.\n\nStewards were forced to move supporters away from the scene(Image:AFP via Getty Images)\n\nHe added: These type of games Ive played many times. Sooner or later you have to play them where if you win you go through and if you dont you go out.\n\nWe are here for the reasons we know, that we have not been good enough, and this is a situation we have lived many times.\n\nCity have not failed to get out of a Champions League group since 2012, when the tournament was in its previous guise. Following their showdown with Brugge, City are back in action this weekend as they take onArsenal.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-29-at-21.00.30-680x380.jpeg",
            "description": "Manchester City take on Club Brugge in their final Champions League group game on Wednesday night but the build up to the game has been blighted by a fire outside of the Etihad Stadium A fire broke out at the Etihad Stadium just hours before Manchester City‘s crucial Champions League clash with a Club Brugge. The blaze […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Plumtree Town Council to commission new primary school",
            "url": "https://www.chronicle.co.zw/plumtree-town-council-to-commission-new-primary-school/",
            "content": "Ronald Mpofu [emailprotected]\n\nPLUMTREE Town Council in Matabeleland South province will on Friday commission its fourth school in the border town, Mathendele Primary School.\n\nThe Minister of State for Matabeleland South Provincial Affairs and Devolution, Dr Evelyn Ndlovu is expected to commission Mathendele Primary School.\n\nThe Plumtree Town Council has extended an invitation to residents to attend the launch of its latest development initiative, with details shared on its social media platforms.\n\nResidents and stakeholders are advised that Mathendele Primary School will be commissioned on Friday, 31 January 2025. Time: 14:00-16:00. Venue: Mathendele. An invitation is extended to grace the event with your presence, including the Councils appreciation for your continued support in service provision, read the statement.\n\nLocated in the Mathendele suburb on the eastern side of Plumtree town, the school boasts two finished classroom blocks and a third block that is 75 percent complete, with roofing installed. Initially, the school will cater to infant learners, offering classes from ECD A to Grade 2, with an anticipated enrolment of 160 learners.\n\nHowever, the construction of teacher cottages is still pending.\n\nMathendele Primary School will fall under Mangwe District and construction is still ongoing. Plumtree Town Council oversees several educational facilities, including three schools with a total of 3,509 learners.\n\nThe schools are Dingumuzi Primary, Matiwaza Primary, and Phakamani High. Construction of Mathendele Primary School began in 2023 and was completed in December 2024 to alleviate overcrowding at Dingumuzi Primary School.\n\nThe construction process was divided into four quarters, with significant milestones achieved in each quarter, including the completion of classroom blocks and an ablution facility, said Mr Thembalami Nyoni, Plumtree Town Secretary.\n\nThe school is in its early stages, but plans are underway for it to reach full operational capacity around mid-2025.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Mathendele.jpg",
            "description": "Ronald Mpofu – itsronaldrox@gmail.com PLUMTREE Town Council in Matabeleland South province will on Friday commission its fourth school in the border town, Mathendele Primary School. The Minister of State for Matabeleland South Provincial Affairs and Devolution, Dr Evelyn Ndlovu is expected to commission Mathendele Primary School. The Plumtree Town Council has extended an invitation to […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Nine Schools damaged by heavy rains in Gwanda District",
            "url": "https://www.chronicle.co.zw/nine-schools-damaged-by-heavy-rains-in-gwanda-district/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nNINE schools in Gwanda District have sustained damage due to heavy rains experienced since December last year.\n\nThe affected schools include Colleen Bawn Primary, Lushongwe Secondary, Bengo Secondary, Ngoma Secondary, Dambashoko Primary, Halisupi High, Sibona High, Mandihongola Secondary, and Shake Primary.\n\nThe damages encompass the destruction of classroom blocks, teachers cottages, and administration blocks.\n\nMs Nomathemba Ndlovu, chairperson of the Gwanda District Civil Protection Committee and District Development Coordinator, stated that the district also suffered significant damage to its roads, bridges, and other infrastructure.\n\nShe noted that efforts are underway to mobilise resources for the repair of damaged infrastructure and indicated that some partners may come on board to assist.\n\nGwanda has received a massive amount of rainfall from December 2024 to date. The district has recorded damages to key infrastructure such as schools, homesteads, roads, and bridges due to the heavy rains. The majority of the roads in the district are unpaved, making them prone to disaster during periods of excessive rainfall.\n\nOur roads have been severely damaged in both urban and rural areas, causing travel difficulties. Nine schools in the district have also been affected. Losses include damage to rooftops of classroom blocks, toilets, teachers cottages, and administration blocks. Some roads and bridges that sustained damage also require rehabilitation, she said.\n\n@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/floods-680x380.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw NINE schools in Gwanda District have sustained damage due to heavy rains experienced since December last year. The affected schools include Colleen Bawn Primary, Lushongwe Secondary, Bengo Secondary, Ngoma Secondary, Dambashoko Primary, Halisupi High, Sibona High, Mandihongola Secondary, and Shake Primary. The damages encompass the destruction of classroom blocks, teachers’ cottages, and […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Former Chiredzi housing director gets Community Service for abuse of office",
            "url": "https://www.chronicle.co.zw/former-chiredzi-housing-director-gets-community-service-for-abuse-of-office/",
            "content": "Thupeyo Muleya,Beitbridge Bureau\n\nFormer Chiredzi Housing Director, Emily Paradzai, has been ordered to complete 280 hours of community service in Harare after being convicted of criminal abuse of office as a public officer for illegally allocating a residential stand belonging to another council employee as part of his gratuity package.\n\nThe accused was found guilty and sentenced to 24 months imprisonment by Chiredzi Regional Magistrate, Mrs Judith Zvuyu.\n\nTwelve months of the sentence were suspended on the condition that the accused does not commit a similar offence within five years, and a further four months were suspended on the condition of good behaviour.\n\nThe remaining eight months were suspended on the condition that the accused performs 280 hours of community service at Cold Comfort School in Harare, where she is now residing.\n\nIn addition to legal action, in November last year, the accused also appeared before the Chiredzi Council disciplinary hearing committee, where she was suspended. The committee recommended to the Local Government Board that she be discharged from duty.\n\nParadzai was taken to court by Lazarus Dhuku for illegally allocating his gratuity stand to another person.\n\nDhuku had been allocated stand 1057 in Melbourne Park in 2018 under resolution 41/2c (ii) 2018, as passed by the Council, as a gratuity for having served the council for 30 years.\n\nHowever, the accused later allocated the stand to another person, forcing Dhuku to approach the High Court, which has since ordered the council to offer him another stand within seven days.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Former-Chiredzi-Housing-Director-Emily-Paradzai.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Former Chiredzi Housing Director, Emily Paradzai, has been ordered to complete 280 hours of community service in Harare after being convicted of criminal abuse of office as a public officer for illegally allocating a residential stand belonging to another council employee as part of his gratuity package. The accused was found guilty […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Toyota Aqua used as getaway car by copper cable thieves",
            "url": "https://www.chronicle.co.zw/toyota-aqua-used-as-getaway-car-by-copper-cable-thieves/",
            "content": "Online Reporter\n\nFOUR men were arrested with their loot, including a transformer, copper cables, transformer oil and their getaway car, a Toyota Aqua, at a roadblock.\n\nIn a post on X, police stated that details in Mutoko acted on received information and arrested Anderson Takawira, alias Tatenda Vambe (30), Isaac Vheremu (38), Trymore Bona (30), and Archford Chiyangwa (25) at a roadblock along the Harare-Nyamapanda Road on Monday.\n\nThis was in connection with the vandalism of a ZETDC transformer and the theft of armoured cables. The arrest led to the recovery of the suspects getaway car, a Toyota Aqua, registration number AGF 9536, as well as bolts, nuts, two scales, spanners, a knife, and armoured cables.\n\nThe suspects are being linked to a case of vandalism of a ZETDC transformer at Mushimbo Business Centre, where transformer oil was stolen on 27/01/25, and a case of theft of ZETDC copper cables at Rukau Business Centre, Mutoko, on 27/01/25, where a transformer was vandalised before armoured cables were stolen.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/cable-thieves.jpg",
            "description": "Online Reporter FOUR men were arrested with their loot, including a transformer, copper cables, transformer oil and their getaway car, a Toyota Aqua, at a roadblock. In a post on X, police stated that details in Mutoko acted on received information and arrested Anderson Takawira, alias Tatenda Vambe (30), Isaac Vheremu (38), Trymore Bona (30), […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "24 killed in floods, property worth US$150 000 destroyed",
            "url": "https://www.chronicle.co.zw/24-killed-in-floods-property-worth-us150-000-destroyed/",
            "content": "Nokuthula Dube, Online Reporter\n\nADVERSE weather conditions have claimed 24 lives and damaged property and infrastructure valued at over US$150 000 since the beginning of the rainy season.\n\nAmong the victims was a 12-year-old girl from Mutasa district who was swept away while attempting to cross a flooded river on her way home from school.\n\nA three-year-old boy from the same area drowned in a four-metre-deep pool.\n\nAccording to the Department of Civil Protections latest situation report, six people sustained injuries while 893 households have been damaged.\n\nIn addition, 129 schools and 13 clinics across the country also suffered varying degrees of damage.\n\nIn response, the Government has activated all civil protection structures to promptly address these incidents.\n\nIn the Midlands province, property worth US$6 475 was damaged at Masase High School as strong winds ripped off roofs of classrooms and teachers houses.\n\nIn Kwekwe, six houses and three schools were affected, while two miners were trapped underground.\n\nOne escaped with injuries while the other lost his life.\n\nIn Masvingo province, a lightning-induced fire destroyed a home in Ruhanya village, Bikita district, leaving the family with nothing, including identity documents for seven family members.\n\nMeanwhile, in Mashonaland Easts Mudzi district, artisanal miners were stranded between Mutawatawa and Nyamapanda along the Mazowe River.\n\nThe Department of Civil Protection called in the Sub Aqua Unit for rescue operations.\n\nHeavy rainfall in Matabeleland North, particularly around the Makomo Mine within Hwange National Park, triggered flash floods, affecting eight homesteads.\n\nThe report also highlighted significant infrastructure damage in the area, including an overflowing bridge linking Ward 12 Nekabandama and Change near the Diki Irrigation Scheme, which has hindered access for motorists and pedestrians.\n\nThe Kalope Dam is also overflowing, posing a severe risk to downstream communities.\n\nFurthermore, a tarred road in the area is showing signs of damage, with continued rainfall threatening to worsen the situation.\n\nFields in the village remain waterlogged, adding to the challenges faced by local communities.\n\nThe Hwange District Civil Protection Committee had previously recommended relocating the affected communities in 2016, offering support such as tents and non-food items.\n\nHowever, the communities chose to remain in the area.\n\nMeanwhile, national dam storage levels increased from 61,4 percent to 69,3 percent between January 13 and January 20, 2025, surpassing the expected 63,7 percent for this time of year.\n\nThe report further noted variations in provincial water levels, with significant differences observed in the north-eastern region.\n\nRiver flows, including the Zambezi River, have improved due to recent rainfall and inflows from upper catchments.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/floods-680x380.jpg",
            "description": "Nokuthula Dube, Online Reporter ADVERSE weather conditions have claimed 24 lives and damaged property and infrastructure valued at over US$150 000 since the beginning of the rainy season. Among the victims was a 12-year-old girl from Mutasa district who was swept away while attempting to cross a flooded river on her way home from school. […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Unisa rejects Prophet Walter Magaya’s claims of graduation and honorary doctorate",
            "url": "https://www.chronicle.co.zw/unisa-rejects-prophet-walter-magayas-claims-of-graduation-and-honorary-doctorate/",
            "content": "University of South Africa (Unisa) has firmly rejected recent claims made by clergy and businessman Walter Magaya that he is a graduate and an honorary doctorate recipient from the institution.\n\nIn a statement, the university expressed concern over the spread of the false claims which have gained significant attention, particularly through a video circulating on social media.\n\nMagaya, who has been at the centre of various controversies, was seen in the video alleging that he had graduated from Unisa and received an honorary doctorate from the university.\n\nUnisas media affairs office said they had thoroughly checked their records and found no evidence to support Magayas claims.\n\nBased on the information provided, the system of the university could not find any record showing that Mr Magaya was ever registered or graduated with Unisa, reads the statement.\n\nThis means that Unisa does not have Mr Magaya as a student or a graduate. Any certificate he may present claiming to be from Unisa is fraudulent.\n\nThe university also categorically denied Magayas claim of receiving an honorary doctorate.\n\nUnisa has never conferred any honorary doctorate upon Mr Magaya. We strongly condemn this false assertion.\n\nUnisa expressed alarm at the damage such misinformation could cause to its reputation and emphasised that it would take the necessary legal steps to address the situation.\n\nWe believe that conduct of this nature damages and brings our brand into disrepute, and we reserve the right to take appropriate corrective action, reads the statement.\n\nThe university further confirmed that relevant authorities have been instructed to initiate legal proceedings against those spreading false claims about the institutions affiliation with Magaya.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Leader-of-PHD-Ministries-church-in-Zimbabwe-self-proclaimed-prophet-Walter-Magaya-insists-he-was-given-a-PhD-by-Unisa-but-the-university-has-rubbished-the-claims-680x380.jpeg",
            "description": "Harare Bureau University of South Africa (Unisa) has firmly rejected recent claims made by clergy and businessman Walter Magaya that he is a graduate and an honorary doctorate recipient from the institution. In a statement, the university expressed concern over the spread of the false claims which have gained significant attention, particularly through a video […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Eight men, including teen, up for US$283,000 copper cable theft",
            "url": "https://www.chronicle.co.zw/eight-men-including-teen-up-for-us283000-copper-cable-theft/",
            "content": "[emailprotected]\n\nEIGHT men, including a teenager, appeared in court today for stealing 60 metres of armoured copper cables valued at US$283,000 from the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) Richmond substation in Bulawayo.\n\nRonald Moyo (32), Qhubekani Nyathi (28), Kudakwashe Ndlovu, Eddie Mishiri Dube (20), Tafadzwa Ncube (18), Sydney Moyo (22), Prince Ntonga (35), and Simon Chamhudze (36) devised a plan to steal the cables from the ZETDC Glenview substation in Richmond suburb.\n\nThey were apprehended after Ntonga and Chamhudze were caught with 92 kilograms of copper, which they could not account for by producing a licence. The two are facing a separate charge of possessing the copper cables without a licence.\n\nThe apprehension of Ntonga and Chamhudze led to the discovery of the theft they committed with the other accused persons at the Richmond substation.\n\nThe eight briefly appeared before Bulawayo Regional Magistrate Mr Joseph Mabeza, charged with violating The Electricity Act. They were remanded in custody until tomorrow.\n\nFor the State, Mr Dominic Moyo stated that on 25 January, the eight accused hatched a plan to steal the copper cables from the ZETDC Glenville substation in Richmond.\n\nAt around 8 PM, they proceeded there and, upon arrival, used a ladder to break into the station. While inside, they used a hacksaw and a bolt cutter to cut the 60 metres of 185 mm three-core armoured copper cable that was installed to distribute electricity from the substation to Richmond suburb, said Mr Moyo.\n\nThe eight dragged the cables out of the substation and made off with them.\n\nOn the morning of 27 January, Ntonga and Chamhudze were caught with burnt armoured copper cables after police requested to search their Toyota Hilux at Ages Industrial Solutions near Kelvin West.\n\nThe cables weighed 198 kilograms at Zimpost. An engineer from ZETDC discovered that the cables were the companys property used in the distribution of electricity.\n\nThe total cut and burnt armoured copper cables are valued at US$283,000, said Mr Moyo.\n\nThe police recovered the overhead cables, the car, a makeshift ladder, and a bolt cutter, which will be presented in court as evidence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/COPPER.jpg",
            "description": "Trish Mukwazo trishmukwazo515@gmail.com EIGHT men, including a teenager, appeared in court today for stealing 60 metres of armoured copper cables valued at US$283,000 from the Zimbabwe Electricity Transmission and Distribution Company (ZETDC) Richmond substation in Bulawayo. Ronald Moyo (32), Qhubekani Nyathi (28), Kudakwashe Ndlovu, Eddie Mishiri Dube (20), Tafadzwa Ncube (18), Sydney Moyo (22), Prince […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        },
        {
            "title": "Prosecutor in court for extortion",
            "url": "https://www.chronicle.co.zw/prosecutor-in-court-for-extortion/",
            "content": "Online Reporter\n\nA public prosecutor stationed at Guruve Magistrates Court has appeared before the same court for extorting an accused persons relative.\n\nYolanda Alufasi (32) was facing extortion charges when she appeared in court. She was released on US$150 bail and was ordered to surrender her passport, reside at her given address, and report weekly to the Zimbabwe Republic Police Chiwaridzo.\n\nThe court heard that between January 19 and 27, 2025, Alufasi allegedly demanded US$200 from Chiedza Mutunami saying she could fast track the release of Innocent Mutunamis docket from the police and facilitate his bail application.\n\nInnocent was in remand prison on charges of motor vehicle theft and Chiedza is his sister.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gavel.jpg",
            "description": "Online Reporter A public prosecutor stationed at Guruve Magistrates’ Court has appeared before the same court for extorting an accused person’s relative. Yolanda Alufasi (32) was facing extortion charges when she appeared in court. She was released on US$150 bail and was ordered to surrender her passport, reside at her given address, and report weekly […]",
            "time": "21:26",
            "date": "29 Jan 2025"
        }
    ]
}