{
    "news": [
        {
            "title": "Bulawayo teacher leaves for kidney transplant surgery in India",
            "url": "https://www.chronicle.co.zw/bulawayo-teacher-leaves-for-kidney-transplant-surgery-in-india/",
            "content": "Trish Mukwazo,[emailprotected]\n\nMRS Isabel Mavengano, a 52-year-old teacher from Bulawayo who has been battling a chronic kidney ailment for several years, has secured a matching organ donor and on Thursday left the country for a life-saving kidney transplant in India.\n\nAccompanied by her husband, Mr Richard Mavengano, she departed for the surgery at Joshua Mqabuko International Airport. They will be travelling with the donor, a family member who is based overseas.\n\nFamily and friends, who have supported Mrs Mavengano throughout her challenging journey, gathered at the airport to bid her farewell, offering their well-wishes and prayers for the upcoming procedure.\n\nThe surgery, which is not readily available in Zimbabwe, will be performed in India at an estimated cost of US$40,000. Through fundraising efforts, including a GoFundMe campaign, individuals, and companies came together to help raise US$29,300 of the required amount to cover the surgery, post-operative care, and travel and accommodation expenses.\n\nMrs Mavenganos initial kidney donor had to withdraw due to health complications, but she was fortunate enough to secure another donor, a family member, who will be travelling with her for the procedure.\n\nSpeaking at the airport, Mrs Mavenganos friend, Mrs Nomathuli Makwenzi, who played an active role in the fundraising efforts, expressed gratitude for the overwhelming support from the community and people from around the world.\n\nThis was possible because of the support from people worldwide. Its a testimony of what unity can bring. We are all looking forward to Mrs Mavengano being back on her feet after the procedure, she said.\n\nShe also mentioned the success of a fundraising walk that had been held to promote awareness and raise additional funds for the cause.\n\nMrs Charity Kwangwadzai, another family friend who contributed to the fundraising, shared her excitement about Mrs Mavenganos trip and the potential success of the transplant.\n\nIts such an exciting day for us to see them travel to India for the transplant. We are hoping and praying that the procedure will be a success. We trust that both Mrs Mavengano and the donor will be well, said Mrs Kwangwadzai.\n\nMr Tulani Makwenzi, a committee member involved in the fundraising, also expressed his gratitude to all who had contributed.\n\nWe are hopeful that the funds will see Mrs Mavengano through her treatment in India, and we appreciate everyones support. Please continue to keep her and the donor in your prayers, he said in a statement.\n\nMrs Mavengano, who teaches children with learning difficulties, has been on peritoneal dialysis for the past three years, a treatment that has helped maintain her condition but is not a long-term solution. Her doctors have recommended a kidney transplant as the best course of action for her health and survival.\n\nShe has been managing her health condition since the age of 16, when she was diagnosed with diabetes, and has been on insulin treatment ever since. However, her kidney condition has limited her ability to perform everyday tasks, and she has been forced to avoid certain foods due to her health requirements.\n\nThis condition has taken a toll on me. I can no longer take as much fluid as I want. It has also made me prone to anaemia, and Ive lost a lot of energy, Mrs Mavengano explained.\n\nThe dialysis requires a lot of planning and has restricted my diet. I can no longer enjoy foods high in phosphorus and iodine, like choumoellier and sweet potatoes, she added.\n\nMrs Mavengano is expected to be in India for at least two months as she undergoes treatment and recovery. Her family and friends remain hopeful for her full recovery and look forward to her return with a new kidney, ready to regain her health and quality of life.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Mrs-Isabel-Mavengano.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com MRS Isabel Mavengano, a 52-year-old teacher from Bulawayo who has been battling a chronic kidney ailment for several years, has secured a matching organ donor and on Thursday left the country for a life-saving kidney transplant in India. Accompanied by her husband, Mr Richard Mavengano, she departed for the surgery at Joshua […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Two men gang up and rape girl (15)",
            "url": "https://www.chronicle.co.zw/two-men-gang-up-and-rape-girl-15/",
            "content": "Lesley Chikudo,[emailprotected]\n\nTWO Bulawayo friends who ganged up and took turns to rape their neighbours 14-year-old daughter at knifepoint were on Thursday each sentenced to an effective 15 years in jail.\n\nBrian Mvere (19) and Shepherd Msipa (24) both from Emganwini suburb in Bulawayo, pleaded not guilty but were convicted by Western Commonage regional magistrate Mrs Sibongile Marondedze.\n\nThe incident occurred sometime in September last year when the complainant was on her way home from school.\n\nIn her ruling, Mrs Marondedze condemned the offenders conduct, saying their actions left the victim traumatised.\n\nThe accused persons are a danger to the community and themselves, due to their predatory behaviour hence the need for deterrence to avoid future offenders. There is a need to protect the girl child through passing harsh sentences to such offenders, and accordingly, they are sentenced to an effective 15 years, said Mrs Marondedze.\n\nThe prosecutor, Ms Manyika said sometime in September last year, the complainant was coming from school when she passed through where Mvere and Msipa were seated.\n\nThe two men called the girl but she did not respond and continued with her journey.\n\nThe court heard that Mvere and Msipa pursued the girl and caught up with her.\n\nMvere produced a kitchen knife and threatened to stab her if she screamed.\n\nAfter that, they dragged her to Msipas house where they took turns to rape the complainant.\n\nThe matter came to light when the complainant was asked by her father why she arrived home late and she narrated her ordeal. A report was made to the police leading to the arrest of the two men.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/gavel-1.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com TWO Bulawayo friends who ganged up and took turns to rape their neighbour’s 14-year-old daughter at knifepoint were on Thursday each sentenced to an effective 15 years in jail. Brian Mvere (19) and Shepherd Msipa (24) both from Emganwini suburb in Bulawayo, pleaded not guilty but were convicted by Western Commonage regional magistrate […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Nampak Zimbabwe reports static packaging demand and focus on cost efficiency",
            "url": "https://www.chronicle.co.zw/nampak-zimbabwe-reports-static-packaging-demand-and-focus-on-cost-efficiency/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nNampak Zimbabwe Limited, a listed paper and packaging group, has reported that overall demand for packaging remained largely static during the year, compared to the previous period.\n\nThe company, which manufactures paper, printing and packaging products, leases biological assets, and operates a timber processing plant, continues to operate through various segments, including printing and converting, plastics and metals, and services.\n\nIn its consolidated results for the year ended 30 September 2024, Nampaks group managing director, Mr John van Gend, stated that while overall packaging demand remained stable, tobacco-related packaging experienced a decline due to the adverse effects of an El Nio-induced drought.\n\nManagement has continued with its focus on cost containment and operational efficiencies, whilst exploring new opportunities to improve both product offerings and quality, Mr van Gend said.\n\nThe company reported capital expenditure amounting to US$3.5 million, primarily focused on projects aimed at increasing capacity and improving plant services.\n\nManagement also highlighted that several significant capital projects are under review, and should conditions allow, the company intends to implement these initiatives.\n\nIn the printing and converting segment, Hunyani Paper and Packaging sales volumes dropped by 8.4 percent compared to the previous period, largely attributed to reduced demand for tobacco cartons.\n\nIn contrast, the Cartons and Labels Division saw a decline of 1.1 percent in demand, a decrease caused by the reduced tobacco crop. However, the segment was partially offset by gains in the commercial categories.\n\nThe plastics and metals segment saw a 10.2 percent increase in volume, driven by higher demand for PET preforms and HDPE closures.\n\nHowever, the company noted that production volumes were somewhat constrained by severe power outages throughout the year in Ruwa, which limited their ability to operate at full capacity.\n\nSales volumes for CaraudMetalBox decreased by 0.57 percent compared to the previous year, though there was growth in both closures and HDPE categories.\n\nThe group noted that metal volumes had also declined compared to the prior year.\n\nOverall, Nampak Zimbabwe is navigating a challenging environment, with external factors such as power shortages and adverse weather conditions impacting performance.\n\nThe company remains focused on maintaining operational efficiency and exploring new opportunities to adapt to market demands.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Nampak.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com Nampak Zimbabwe Limited, a listed paper and packaging group, has reported that overall demand for packaging remained largely static during the year, compared to the previous period. The company, which manufactures paper, printing and packaging products, leases biological assets, and operates a timber processing plant, continues to operate through various segments, including […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Mother-in-law, beats up son’s wife with knobkerrie over gossip",
            "url": "https://www.chronicle.co.zw/mother-in-law-beats-up-sons-wife-with-knobkerrie-over-gossip/",
            "content": "Online Reporter\n\nA WOMAN from Tsholotsho in Matabeleland North province, beat up her daughter in law with a switch and knobkerrie accusing of spreading gossip about her.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said the woman from Sipepa area beat up her daughter in law until she was swollen all over the body.\n\nShe was sentenced to 350 hours of community service.\n\nA 37 year old Tsholotsho woman has been sentenced to 350 hours of community service for assaulting her daughter in law over gossip allegations.\n\nOn the 9th of November 2024, the accused person confronted the complainant at her homestead in Sipepa accusing her of spreading rumors. She then beat her with a switch and a knobkerrie, leaving her with a swollen body, read the statement.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/03/dec_arch_antiques_zulu-knobkerrie-2.jpg",
            "description": "Online Reporter  A WOMAN from Tsholotsho in Matabeleland North province, beat up her daughter in law with a switch and knobkerrie accusing of spreading gossip about her. In a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said the woman from Sipepa area beat up her daughter in law until she was swollen all over […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "20 agriculture engineers graduate in drone and unmanned aerial vehicle licenses",
            "url": "https://www.chronicle.co.zw/20-agriculture-engineers-graduate-in-drone-and-unmanned-aerial-vehicle-licenses/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nIN a milestone advancement toward the Governments digitalisation and modernisation of agriculture, 20 engineers from the Department of Engineering, Mechanisation, and Farm Infrastructure Development have graduated with Drone and Unmanned Aerial Vehicle licenses from the Civil Aviation Authority of Zimbabwe.\n\nThe departments chief director, Engineer Samuel Edwin Zimhunga, said the achievement aligns with the Governments agricultural transformation agenda, which integrates aero mechanization to enhance production and productivity.\n\nHe noted that drones are set to revolutionise farming practices by facilitating precision agriculture with capabilities such as feed surveillance, mapping, and chemigation.\n\nBy replacing traditional tractors for certain operations, Eng Zimhunga drones can drastically reduce the time required for tasks like spraying fields, broadcasting seeds, enabling precision farming through various applications such as feed surveillance, mapping, and even broadcasting small grains like sorghum and millet.\n\nThis initiative marks a pioneering move into the digital era for agriculture, aiming to enhance efficiency, production, and competitiveness within the sector.\n\nWe have just witnessed in this third week of January 2025 the graduation of 20 engineers in the ministry with drone and unmanned aerial vehicle licenses.\n\nWhy we are doing this is because it is one of our key pillars that we are driving in the transformation of agriculture where we are adopting aerial mechanisation as a strategy to improve production and productivity within the agricultural space, said Eng Zimhunga.\n\nDrones are the future of agriculture where we are using them for precision agriculture and other activities like fee surveillance and mapping.\n\nRecently, we have seen drones used to broadcast seeds for those crops like sorghum, and millet in the planting era.\n\nHe said the ministry was working on the automation of agriculture space and that drones have come in handy to replace traditional mechanised tractors to do certain farm operations.\n\nOne of the graduates, Eng Arnold Mahonde, said drones are a game changer.\n\nThis training was done to make sure that we get full understanding and knowledge on the technology before we roll it out to our farmers, he said.\n\nAgriculture is an ever-evolving landscape so it is not surprising that a remarkable technological advancement has taken root  the use of drones.\n\nThe unmanned aerial wonders have ushered in a new era of possibilities, propelling the agricultural sector to greater heights with their versatile applications.\n\nFrom farm pegging to pest control, drones have swiftly become an indispensable tool in the hands of farmers nationwide.\n\nWith the ability to access once-inaccessible areas, they have dramatically improved efficiency and productivity on farms, revolutionising traditional farming practices.\n\n@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/drone.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com IN a milestone advancement toward the Government’s digitalisation and modernisation of agriculture, 20 engineers from the Department of Engineering, Mechanisation, and Farm Infrastructure Development have graduated with Drone and Unmanned Aerial Vehicle licenses from the Civil Aviation Authority of Zimbabwe. The department’s chief director, Engineer Samuel Edwin Zimhunga, said the achievement aligns […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Health Ministry calls for increased investment in maternal health services",
            "url": "https://www.chronicle.co.zw/health-ministry-calls-for-increased-investment-in-maternal-health-services/",
            "content": "Harare Bureau\n\nThe Ministry of Health and Child Care is pushing for increased investment in health workforce retention, procurement of essential medical supplies, and improved infrastructure for maternal health services, an official has said.\n\nSpeaking during a policy briefing on maternal mortality, Dr Chipo Chimamise, national maternal health officer in the Ministry of Healths Family Health Department said there is need to improve maternal care across all levels of healthcare to stop all preventable deaths during childbirth.\n\nThe programme was organised by the Zimbabwe National Statistics Agency (ZimStat), Vital Strategies, Bloomberg Philanthropies, and Data for Health Initiative.\n\nShe said maternal deaths remain high despite ongoing efforts to strengthen emergency obstetric care.\n\nDr Chimamise said the national maternal and peri-natal death surveillance and response committee regularly reviews cases and provides recommendations.\n\nWe have trained healthcare workers under programmes like the Emergency Obstetric and Newborn Care (EmONC) initiative, but high staff turnover means facilities are constantly losing skilled personnel.\n\nWith increased investment in health workforce retention, we should see a change as a country, said Dr Chimamise.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2015/12/pregoz.jpg",
            "description": "Harare Bureau  The Ministry of Health and Child Care is pushing for increased investment in health workforce retention, procurement of essential medical supplies, and improved infrastructure for maternal health services, an official has said. Speaking during a policy briefing on maternal mortality, Dr Chipo Chimamise, national maternal health officer in the Ministry of Health’s Family […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Meikles Limited declares dividend of US$0.70 per share",
            "url": "https://www.chronicle.co.zw/1meikles-limited-declares-dividend-of-us0-70-per-share/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nMeikles Limited has declared a dividend of US$0.70 per share, which will be payable from the profits for the financial year ending 28 February 2025.\n\nIn a notice to shareholders, Meikles Limited company secretary Mr Thabani Mpofu stated that disbursements to foreign shareholders are subject to Exchange Control approval and payment guidelines for foreign payments.\n\nNotice is hereby given that the board of directors has declared an interim dividend, Number 95, of US$0.70 per share, payable from the profits for the financial year ending 28 February 2025, said Mr Mpofu in a statement. The dividend will be payable on or about 20 February 2025.\n\nHe also noted that, due to the suspension of trading of Meikles Limited shares on the Zimbabwe Stock Exchange, there are no entitlement dates (Cum-Dividend and Ex-Dividend Dates).\n\nIt is deemed that there are no open positions, he added.\n\n@SikhulekelaniM\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-2-15.jpg",
            "description": "  Sikhulekelani Moyo, mskhulekelani16@gmail.com Meikles Limited has declared a dividend of US$0.70 per share, which will be payable from the profits for the financial year ending 28 February 2025. In a notice to shareholders, Meikles Limited company secretary Mr Thabani Mpofu stated that disbursements to foreign shareholders are subject to Exchange Control approval and payment […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Water meter thief caught and caged",
            "url": "https://www.chronicle.co.zw/water-meter-thief-caught-and-caged/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA 20-YEAR-OLD man from Karoi, Mashonaland West Province has been handed a 12 months prison sentence for stealing water meters.Cornlius Chiwaya stole two water meters, valued at US$65 each, on 24 January 2025.In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, The water meters were positively identified by the complainants.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A 20-YEAR-OLD man from Karoi, Mashonaland West Province has been handed a 12 months prison sentence for stealing water meters. Cornlius Chiwaya stole two water meters, valued at US$65 each, on 24 January 2025. In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, “The water meters were positively […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "Man steals mother’s clothes, caught wearing them",
            "url": "https://www.chronicle.co.zw/man-steals-mothers-clothes-caught-wearing-them/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA 24-year-old man from Nyanga in Manicaland Province was sentenced to pay a US$80 fine after he stole his mothers clothes and was caught wearing them.\n\nHis mother, Theresa Nyamuda (60), dragged him to court for stealing her blouse, T-shirt, and two pairs of trousers for personal use.\n\nAccording to the National Prosecuting Authority of Zimbabwe (NPAZ), Simbarashe Chinjikupi stole his mothers clothes on 26 April 2019.\n\nHe was later seen wearing the stolen clothes, and when confronted by his mother, he became violent, forcing her to flee to a neighbours homestead, the NPAZ said.\n\nChinjikupi was instructed to pay a fine of US$80 or serve 15 days in prison.\n\nHe was ordered to pay US$20 restitution to the complainant as part of the stolen property was not recovered, said the NPAZ\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A 24-year-old man from Nyanga in Manicaland Province was sentenced to pay a US$80 fine after he stole his mother’s clothes and was caught wearing them. His mother, Theresa Nyamuda (60), dragged him to court for stealing her blouse, T-shirt, and two pairs of trousers for personal use. According to the National […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        },
        {
            "title": "From survivors to solutions: Teal Brunch aims to eliminate cervical cancer",
            "url": "https://www.chronicle.co.zw/from-survivors-to-solutions-teal-brunch-aims-to-eliminate-cervical-cancer/",
            "content": "Flora Fadzai Sibanda,[emailprotected]\n\nIN a bid to raise awareness about cervical cancer and the challenges women face after receiving a diagnosis, a local woman from Bulawayo is hosting a teal brunch where everything related to cervical cancer will be discussed.\n\nThe brunch, which will be held early next month at a local hotel, will run under the theme Uniting for the Elimination of Cervical Cancer.\n\nCervical cancer is a growth of cells that starts in the cervix. The cervix is the lower part of the uterus that connects to the vagina.\n\nVarious strains of the human papillomavirus, also called HPV, play a role in causing most cervical cancers. HPV is a common infection that is passed through sexual contact. When exposed to HPV, the bodys immune system typically prevents the virus from causing harm. However, in a small percentage of people, the virus survives for years. This contributes to the process that causes some cervical cells to become cancer cells.\n\nMs Barbara Kembo-Nyathi, the founder of Bold Dialogue, an organisation that raises awareness about cervical cancer, said the event is open to everyone, including men.\n\nShe said people do not often talk about cervical cancer because society still believes the only way a woman can get it is by being promiscuous.\n\nCervical cancer is such a scary topic in our societies, and people still believe the only way a woman can get it is because they have been sleeping around, which is not true. That is why we are hosting this teal brunch. Its going to be a space for everyone to talk about everything related to cervical cancer and look for possible solutions on how best we can eliminate it. This brunch is not meant for women only but is also going to be a great space to teach men about cervical cancer and how they are also potential carriers of the virus that causes cervical cancer, said Ms Kembo-Nyathi.\n\nShe said the event will feature a number of panellists, including medical professionals and cervical cancer survivors, who will all share insightful information.\n\n@flora_sibanda\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Ms-Barbara-Kamba-Nyathi.jpg",
            "description": "Flora Fadzai Sibanda, florafadzaisibz@gmail.com IN a bid to raise awareness about cervical cancer and the challenges women face after receiving a diagnosis, a local woman from Bulawayo is hosting a teal brunch where everything related to cervical cancer will be discussed.   The brunch, which will be held early next month at a local hotel, […]",
            "time": "21:06",
            "date": "30 Jan 2025"
        }
    ]
}