{
    "news": [
        {
            "title": "WATCH: Bribe-taking police officers arrested",
            "url": "https://www.chronicle.co.zw/watch-bribe-taking-police-officers-arrested/",
            "content": "Sikhumbuzo Moyo, Senior Reporter\n\nTWO Harare-based bribe-taking police officers, whose moment of criminality was recorded with the footage going viral on various social media platforms, have been arrested and are facing disciplinary and criminal charges.\n\nIn a statement on Monday, police spokesperson Commissioner Paul Nyathi said the Commissioner-General Stephen Mutamba, does not condone corruption by any police officer and will ensure that the law takes its course without fear or favour.\n\nReference is made to a video which went viral on social media in which a female police officer is clearly seen accepting bribes from suspects while sitting on a plastic chair at Parkade Rank at the corner of Nelson Mandela Street and Rezende Street in Harare Central Business District, said Comm Nyathi, before confirming the arrests of Constables Mupandira nd Chirengendure.\n\nThe Zimbabwe Republic Police informs the public that Constable Mupandira and Constable Chirengendure have been arrested. They are facing both disciplinary and criminal charges.\n\nThe Commissioner-General of Police does not condone corruption by any police officer and will ensure that the law takes its course without fear or favour, said Comm Nyathi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/koliopi.jpg",
            "description": "Sikhumbuzo Moyo, Senior Reporter  TWO Harare-based bribe-taking police officers, whose moment of criminality was recorded with the footage going viral on various social media platforms, have been arrested and are facing disciplinary and criminal charges. In a statement on Monday, police spokesperson Commissioner Paul Nyathi said the Commissioner-General Stephen Mutamba, does not condone corruption by […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "President Mnangagwa mourns Pope Francis",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-mourns-pope-francis/",
            "content": "Sikhumbuzo Moyo\n\nPRESIDENT Mnangagwa has joined other world leaders in mourning the death of the Roman Catholic leader, Pope Francis who died at the Vatican City in Rome, Italy, on Easter Mondy, aged 88.\n\nIn his condolence message today, President Mnangagwa described the late pontiff as a man of profound humility who stood for peace compassion and justice.\n\nI join the world in mourning the passing of His Holiness Pope Francis, a man of profound humility who stood for peace, compassion, and justice. We extend our heartfelt condolences to the Catholic Church and Catholics around the world. May his soul rest in eternal peace, President Mnangagwa wrote on his X (formerly twitter) account.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ERYRFGDFGLG.jpg",
            "description": "Sikhumbuzo Moyo PRESIDENT Mnangagwa has joined other world leaders in mourning the death of the Roman Catholic leader, Pope Francis who died at the Vatican City in Rome, Italy, on Easter Mondy, aged 88. In his condolence message today, President Mnangagwa described the late pontiff as a man of profound humility who stood for peace […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "Simba Bhora break Luveve jinx",
            "url": "https://www.chronicle.co.zw/simba-bhora-break-luveve-jinx/",
            "content": "Brandon Moyo at Luveve Stadium\n\nChicken Inn 0-1 Simba Bhora\n\nCASTLE Lager Premier Soccer League defending champions Simba Bhora won their first match at Luveve Stadium since their promotion into the top flight, edging Chicken Inn 1-0 on Monday afternoon.\n\nThe solitary goal of the match came soon after the start of the second half with Isakar Guribab calmly slotting home from inside the box to give the visitors their first maximum points at Luveve Stadium since 2023.\n\nSimba Bhora controlled most of the proceedings with Chicken Inn failing to register a shot on target throughout the entire match.\n\nThe two sides went into the break deadlocked at nil-all.\n\nThe first shot on target of the first half came in the 25th minute when Emmanuel Ziocha came close to putting Simba Bhora in front with long range shot but the Gamecocks goalkeeper, Donovan Bernard was equal to the task, punching the effort away to safety.\n\nSimba Bhora came close again in the 33rd minute with Carlos Mavhurume attempting a long range shot but his effort went wide.\n\nMoments later, Joseph Tulani of Gamecocks had his effort from inside the box miss the target by a whisker.\n\nAt the stroke of half time, Simba Bhora got a free kick in a promising position on the edge of the box but Blessing Moyos effort went over the bar.\n\nIn the 46th minute, Guribab capitalised on lack of concentration from the Gamecocks defenders to punish them.\n\nTen minutes into the second half, Brighton Makopa wasted a good chance after receiving a brilliant cross from Xolani Ndlovu. Makopas flick from inside the box went over the bar.\n\nMoments later, Ziocha put in a defense splitting pass to find Guribab who, however, failed to beat Donovan Bernard on a one versus one situation.\n\nChicken Inn would continue their quest for the equaliser but couldnt find the back of the net with their efforts going either wide or over the bar.\n\nThis was the Gamecocks second defeat of the season.Teams:Chicken Inn:Donovan Bernard (gk), Arthur Chinda, Mpumelelo Bhebhe, Joseph Tulani, Xolani Ndlovu, Dominic Jaricha (Kumbirai Mutenha, 60mins), Itai Mabhunu, Michael Charamba (Elshamar Farasi, 73mins), Brighton Makopa (Nelson Ketala, 73mins), Brian Muza (Brendon Rendo, 46mins)Simba Bhora:William Thole (gk), Webster Tafa, Ishaenesu Mauchi, Tinotenda Meke (Carlos Makambira, 73mins), Blessing Moyo, Roland Kangadzi, Blessed Ndereki (Never Tigere, 85mins), Junior Makunike (Trevor Mavhunga, 73mins), Emmanuel Ziocha (Donald Mudadi, 85mins), Isakar Gurirab (William Manondo, 85mins), Carlos Mavhurume.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/09/Football.jpg",
            "description": "Brandon Moyo at Luveve Stadium Chicken Inn 0-1 Simba Bhora CASTLE Lager Premier Soccer League defending champions Simba Bhora won their first match at Luveve Stadium since their promotion into the top flight, edging Chicken Inn 1-0 on Monday afternoon. The solitary goal of the match came soon after the start of the second half […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "Condolence book for Pope Francis opened in Harare",
            "url": "https://www.chronicle.co.zw/condolence-book-for-pope-francis-opened-in-harare/",
            "content": "Sikhumbuzo Moyo, Senior Reporter\n\nTHE Apostolic Nunciature in Zimbabwe has announced that it will be opening a condolence book at its Chancery (offices) in Mount Pleasant, Harare, from tomorrow until Thursday, following the death of Pope Francis this morning.\n\nAn apostolic nunciature is the official diplomatic mission of the Holy See (the Vatican), equivalent to an embassy, but without the function of issuing visas or having consulates. The head of an apostolic nunciature is called a nuncio, an ecclesiastical diplomat with the rank of an ambassador.\n\nIn a statement, Apostolic Nuncio, Janusz Urbanczyk said the book will be open from 10am to 1pm and 3pm to 5pm.\n\nThe Apostolic Nunciature will open a book of condolences for Bishops and religious Superiors in its Chancery at 5 St. Kilda Road, Mount Pleasant, Harare (from 10am to 1pm and from 3pm to 5 pm).Let us remain united in prayers while inviting the catholic faithful in Zimbabwe to raise theirs prayers to the\n\nAlmighty God for the Eternal Rest of Pope Francis.\n\nWith sentiments of the highest esteem, I remain, said Apostolic Nuncio Urbanczyk.\n\nMeanwhile, the Symposium of Episcopal Conferences of Africa and Madagascar (SECAM) and the entire Church, Family of God in Africa and its Islands has said the late Pope Francis was more than a shepherd to the universal church.\n\nIn its condolence message, SECAM said Pope Francis has been a profound source of inspiration, particularly for the church in Africa.\n\nHis unwavering commitment to social justice, peace, and the dignity of every human being resonated deeply with our continents struggles and aspirations. Throughout his papacy, he visited Africa, taking the time to understand our realities, listen to our stories, and amplify our voices on the global stage, reads the condolence message.\n\nThey said the visits to various countries on the continent brought hope and love to countless people and reaffirmed the Churchs commitment to being a family.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/344erfer5w3453-680x380.jpg",
            "description": "Sikhumbuzo Moyo, Senior Reporter THE Apostolic Nunciature in Zimbabwe has announced that it will be opening a condolence book at its Chancery (offices) in Mount Pleasant, Harare, from tomorrow until Thursday, following the death of Pope Francis this morning. An apostolic nunciature is the official diplomatic mission of the Holy See (the Vatican), equivalent to […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "WATCH: ZITF Company Expresses Excitement as 65th Edition Kicks Off",
            "url": "https://www.chronicle.co.zw/1watch-zitf-company-expresses-excitement-as-65th-edition-kicks-off/",
            "content": "Judith Phiri, Business Reporter\n\nTHE Zimbabwe International Trade Fair (ZITF) Company has expressed excitement about the commencement of this years 65th edition, which promises to be a resounding success.\n\nIn an interview, ZITF Company Board chairman Mr Busisa Moyo said:\n\nZITF 2025 commences today. We have all our exhibitors and guests here who have started exhibiting, despite the day being a holiday. Some are putting final touches to their exhibition stands, he said.\n\nHe noted that exhibitors have come in large numbers, with over 600 participants, most aligning with this years trade showcase theme: Industrialisation: Crafting an Integrated Economic Landscape.\n\nThis years theme highlights the critical role of economic growth, innovation, and strategic trade partnerships in creating an integrated economy.\n\nIt also emphasises the importance of industry leaders and entrepreneurs in driving industrialisation and advancing global economic development.\n\nZITF 2025 serves as a platform that facilitates connections and collaborations among local and international delegates and exhibitors, focusing on sectors such as manufacturing, agriculture, construction, education, financial services, ICT, infrastructure, printing, publishing, renovation, and tourism. Together, these industries can uncover new opportunities and foster sustainable economic advancement.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fds.jpg",
            "description": "Judith Phiri, Business Reporter THE Zimbabwe International Trade Fair (ZITF) Company has expressed excitement about the commencement of this year’s 65th edition, which promises to be a resounding success. In an interview, ZITF Company Board chairman Mr Busisa Moyo said: “ZITF 2025 commences today. We have all our exhibitors and guests here who have started […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "ZITF 2025 opens with strong focus on industrialisation and trade growth",
            "url": "https://www.chronicle.co.zw/zitf-2025-opens-with-strong-focus-on-industrialisation-and-trade-growth/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Zimbabwe International Trade Fair (ZITF) has started on a high note with exhibitors having high expectations to take industrialisation to another level.\n\nSpeaking to Zimpapers Business Hub, KG Mobiles founder Mr Patrick Kagoro said they have brought in many accessories that can be used by companies as they move towards digitisation.\n\nHe said they expect to improve their businesses with the expo improving each year.\n\nCOMESA trade officer Ms Bonakele Ndzinisa said Zimbabwe, being one of the founding members, has been doing well in contributing to different COMESA initiatives. She said COMESA is here to provide trade information to increase trade between member states.\n\nShe said they want to take into consideration the private sector as many dont have much information about the trading bloc.\n\nZimbabwe is doing well and is actively participating in COMESA trade activities, said Ms Ndzinisa.\n\nBelarus also brought in different companies to exhibit under the Belarus Pavilion, with Belarus State University looking forward to welcoming Zimbabwean students willing to study at their institution.\n\neSolutions representative Mr Gibson Mukarakate said their company expects to interact more with small businesses as they look to improve their compliance with tax regulations.\n\nUganda Investment Authority representative Mr Simon Ngabo said they are looking forward to interacting with different companies and exchanging business ideas.\n\nWe are also looking forward to interacting with ZIDA. We expect this to benefit both countries, said Mr Ngabo.\n\nRunning from Monday to Saturday, the annual exhibition is one of the countrys premier trade and investment platforms, attracting local, regional, and international players across various sectors.\n\nThis years Sapphire Edition, held under the theme Industrialisation: Crafting an Integrated Economic Landscape,\n\nZimtrade Southern Region manager Mrs Jackie Nyathi said this years theme is particularly important with the expo bringing together stakeholders to boost both industrialisation and trade.\n\nShe said Zimtrade brought heritage-based products to give a national outlook as they have companies from across the country.\n\nZimtrade brought women, youths and small businesses as they look to help them showcase their products and grow.\n\nThe Kenya Embassy also brought different products from various companies.\n\nShe said this trade show is a meeting point for different companies and this will help to improve trade.\n\nThe embassy brought different products from SMEs as they also seek to grow their contribution to their economy.\n\n@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/tyjtj.jpg",
            "description": "Sikhulekelani Moyo, sikhu.moyo@chronicle.co.zw THE Zimbabwe International Trade Fair (ZITF) has started on a high note with exhibitors having high expectations to take industrialisation to another level. Speaking to Zimpapers Business Hub, KG Mobiles founder Mr Patrick Kagoro said they have brought in many accessories that can be used by companies as they move towards digitisation. […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "Private sector can play a leading role in investing in sustainable sources of energy",
            "url": "https://www.chronicle.co.zw/private-sector-can-play-a-leading-role-in-investing-in-sustainable-sources-of-energy/",
            "content": "By Sam Matsekete\n\nOLD Mutuals interest in renewable energy has been established over a period now, and we continue that commitment. Firstly, within the Old Mutual operations themselves, we seek to uphold responsible business practices, and we are looking at how we can ensure that we are climate-friendly in the ways that we conduct business. One way is transitioning our sources of energy to renewable and clean energy.\n\nSo, we have invested in sources of renewable energy within the group, solar plants at our head office and other major offices. We can count up to 1.4 megawatts of power that is deployed within our buildings and our offices for the benefit of ourselves as the operators in those premises, or our clients who also occupy that space. And this is really what we are doing to demonstrate that commitment internally.\n\nThis is in addition to other initiatives to ensure that we will pursue the sustainability agenda strongly.\n\nThe second level is in terms of how we have supported investments in renewable energy. We have invested in hydro plants, in a hydro plant for example, in Manicaland.\n\nWe have invested in a solar plant in Hwange. We have invested in solar plants in Masvingo, in Matabeleland in the south, and some close to Harare.\n\nWe are counting now up to 43 megawatts over the recent past that we have delivered onto the grid or into microgrids as well. And we continue that agenda. We have a pipeline of projects.\n\nJust recently we have added another two to the pipeline of continuing work that we are embarking on.\n\nThe other level that I would like to talk about is the role that we seek to play as Old Mutual to assist in the gathering of funds or pooling of resources to deploy into infrastructure related to renewable energy. So, an example of that was the launch of the Renewable Energy Fund that we did last year.\n\nAnd in this fund, we have partnered with the government, and we have got private sector players, private investors, also coming on board.\n\nThis is a US$100 million fund, and we are also partnering with United Nations agencies in it.\n\nCurrently committed to the fund is about US$21 million, and we continue to mobilize more. We have got about US$10 million of that already allocated, and we are now seeking to make sure that we deploy the balance of whats been committed, even as we are growing the fund.\n\nIt is a blended financing structure if you like to call it that. Blended in the sense that we have got participants who are primarily looking for social impacts. And the nature of the funding in terms of returns, they are also placing a lot of emphasis on the social impacts.\n\nWe have got the Government coming in, and they are also seeking outcomes within the social impacts space as well as in terms of how they will support private sector investors to also come in and enjoy the blended rates that we get out of the fund.\n\nThen we have private sector players seeking economic returns, even as they are also conscious about the sustainability impacts r from this fund.\n\nIt is a fund that we are prioritizing very highly as one of the efforts we are undertaking over the next few years. And if we can get this one right, we believe it will catalyze the scaling up of the funds that will be channeled into renewable energy.You will also see us intervening in terms of how we promote startups in the renewable energy value chain.\n\nWe do have at Eight2Five Innovation Hub participants who come from the renewable energy value chain. And they are showcasing their ideas.\n\nWe profile their projects and we get them to start to access support in financial resources as well.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dsvfre.jpg",
            "description": "By Sam Matsekete OLD Mutual’s interest in renewable energy has been established over a period now, and we continue that commitment. Firstly, within the Old Mutual operations themselves, we seek to uphold responsible business practices, and we are looking at how we can ensure that we are climate-friendly in the ways that we conduct business. […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "Watch: Cycling couple’s 11-country adventure ends with warm homecoming in Bulawayo",
            "url": "https://www.chronicle.co.zw/watch-cycling-couples-11-country-adventure-ends-with-warm-homecoming-in-bulawayo/",
            "content": "Sipepisiwe Moyo, Zimpapers Arts and Entertainment Hub\n\nAfter pedalling through 11 African countries over the course of a year and a few days, Zimbabwean lovebirds Vusumuzi Mkandla and Thandolwenkosi Tshuma rolled triumphantly back into Bulawayo on Saturday, greeted by cheers, tears, and soulful saxophone serenades.\n\nThe couple received a heartfelt welcome at the Large City Hall, where family, city officials, artistes, and well-wishers gathered to celebrate their remarkable journey, one marked by endurance, adventure, and a shared love for both cycling and each other.\n\nTheir emotional arrival was marked by poetry from Dr Gasolo at the City Hall and a soulful saxophone performance by Vuyi Sax at the KaMandazi Restaurant welcome party. The moment became overwhelming for Tshuma, who broke into tears, embracing her husband as music filled the air.\n\nMkandla and Tshuma began their journey on April 10, 2024, in South Africa. From there, they cycled through Lesotho, Eswatini, Mozambique, Zimbabwe, Zambia, Malawi, Tanzania, Rwanda, Uganda, and Kenya, facing harsh weather, language barriers, and health scares along the way.We were discouraged by many who said cycling was for white people. But we stayed committed, said the couple.\n\nWe faced food poisoning, malaria, and even struggled to find camping spaces in highly populated areas, but we pressed on.Their love for travel was their biggest motivation.We discovered that we both love exploring, and that was the major inspiration behind this journey. We chose bicycles because they allowed us to interact with locals, explore remote areas, and truly experience each country.\n\nThroughout the journey, the couple immersed themselves in new languages, cultures, and currencies. They shared how this broadened their view of the continent.We learnt how Zambias currency works and appreciated the different lifestyles. While we share many similarities across Africa, each country also has its unique identity.\n\nThey also challenged misconceptions perpetuated by online sources.Malawi is often labelled one of the poorest countries, but we found it to be one of the most affordable places to live. The people are resourceful and navigate life with admirable strength.\n\nOne of their most memorable experiences was meeting the Maasai people in Tanzania.Tanzania was the highlight. We visited Lake Kosi, a volcanic lake shaped like the African map. Its a sacred place, no living creatures are found in it. The beauty of Tanzania and the warmth of its people left a lasting impression.\n\nThis journey was not just about travel, it was a celebration of love, resilience, and the unbreakable spirit of unity. Mkandla and Tshuma have proven that with passion and partnership, no dream is too far to chase, even by bicycle.\n\nThe couple has already hit the ground running, and those attending the Zimbabwe International Trade Fair will have a chance to meet them, as they are participating in this years exhibition.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/45y4.jpg",
            "description": "Sipepisiwe Moyo, Zimpapers Arts and Entertainment Hub After pedalling through 11 African countries over the course of a year and a few days, Zimbabwean lovebirds Vusumuzi Mkandla and Thandolwenkosi Tshuma rolled triumphantly back into Bulawayo on Saturday, greeted by cheers, tears, and soulful saxophone serenades. The couple received a heartfelt welcome at the Large City […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "Car Dealer Jailed for 60 Months",
            "url": "https://www.chronicle.co.zw/car-dealer-jailed-for-60-months-2/",
            "content": "Peter Matika,[emailprotected]\n\nA 29-year-old car dealer who sold two vehicles on behalf of his clients but failed to remit the proceeds has been sentenced to an effective five years imprisonment.\n\nPatson Khumalo, who in one incident drove off at high speed with a clients vehicle during a test drive, was initially handed a 97-month custodial sentence. However, the term was reduced on condition he does not commit a similar offence within the next five years.\n\nBulawayo magistrate Mrs Eva Matura delivered the ruling on Wednesday, after Khumalo, of Pumula South suburb, was convicted on two counts of theft of trust property.\n\nProsecutor Mr Samuel Mpofu outlined the offences, which took place in 2024.\n\nThe first incident occurred on 26 April 2024, when Khumalo was entrusted with a Ford Ranger by his client, Mr Alec Chayukebawa. He was asked to sell the car for US$5 400 which he did but he did not give Mr Chayukebawa the money.\n\nThe second offence involved a Toyota Allion, valued at US$6 400, which he received from Mr Thadeous Ndlovu under similar terms. Once again, he sold the vehicle but did not surrender the money to Mr Ndlovu.\n\nMrs Matura said Khumalos conduct was a serious breach of trust, which soiled the reputation of car dealers in Bulawayo.\n\nShe said there was a need to pass a sentence that served as a warning to those who did notvalue integrity in business.\n\nTrust is the foundation of any transaction. When that trust is broken, the consequences can be severe, said Mrs Matura.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jail-1.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw A 29-year-old car dealer who sold two vehicles on behalf of his clients but failed to remit the proceeds has been sentenced to an effective five years imprisonment. Patson Khumalo, who in one incident drove off at high speed with a client’s vehicle during a test drive, was initially handed a 97-month […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        },
        {
            "title": "BREAKING: BCC Fire and Ambulance Dept rescue Air Force of Zimbabwe paratrooper following an airborne mishap",
            "url": "https://www.chronicle.co.zw/breaking-bcc-fire-and-ambulance-dept-rescue-air-force-of-zimbabwe-paratrooper-following-an-airborne-mishap/",
            "content": "Sikhumbuzo Moyo, Check Point Desk\n\nTHE Bulawayo Fire and Ambulance Department has rescued a member of the Air Force of Zimbabwe whose parachute got hooked on pine trees during a rehearsal exercise behind the Zimbabwe International Exhibition Centre (ZIEC).\n\nThe officer has since been ferried to the United Bulawayo Hospitals for further medical attention.\n\nBulawayo Chief Fire Officer, Mr Mhlangano Moyo, confirmed the mishap today.\n\nWe have rescued a member of the Air Force of Zimbabwe behind ZIEC. The parachute got hooked on the pine trees. We have since rescued him safely using our aerial appliance about 25 metres high, and he was conveyed to hospital by ambulance. It was a smooth and swift rescue operation, said Mr Moyo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/rehtgr.jpg",
            "description": "Sikhumbuzo Moyo, Check Point Desk THE Bulawayo Fire and Ambulance Department has rescued a member of the Air Force of Zimbabwe whose parachute got hooked on pine trees during a rehearsal exercise behind the Zimbabwe International Exhibition Centre (ZIEC). The officer has since been ferried to the United Bulawayo Hospitals for further medical attention. Bulawayo […]",
            "time": "20:43",
            "date": "21 Apr 2025"
        }
    ]
}