{
    "news": [
        {
            "title": "Police arrest Mberengwa man for possession of copper cables",
            "url": "https://www.chronicle.co.zw/police-arrest-mberengwa-man-for-possession-of-copper-cables/",
            "content": "Sikhumbuzo Moyo[emailprotected]POLICE in Zvishavane have arrested `a suspected copper cable thief.Albert Moyo (51), of Njini Village in Chief Mahlebadza, Mberengwa, was arrested for contravening Section 60(A)(3)(B) of the Electricity Act, Chapter 13:19. Moyo was charged with possession of materials used for transmitting electricity without a permit.Detective Inspector Rachel Muteweri of the Minerals, Flora and Fauna Unit (MFFU) confirmed the arrest, saying:Moyo was arrested on 12 January after detectives acted on a tip-off that he was in possession of copper cables at his homestead. The cables were subsequently recovered and positively identified as ZESA cables.Det Insp Muteweri reiterated the polices warning to the public against the vandalism of public utilities and infrastructure, including communication facilities, electricity supply equipment, and road and railway infrastructure.Such acts negatively impact the countrys development, constitute economic sabotage, and attract a mandatory 10-year jail term, said Det Insp Muteweri.This case highlights the ongoing challenges faced by authorities in curbing the theft and illegal trade of critical infrastructure materials, which have far-reaching economic and social consequences.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/10/Untitled-7-9.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw POLICE in Zvishavane have arrested `a suspected copper cable thief. Albert Moyo (51), of Njini Village in Chief Mahlebadza, Mberengwa, was arrested for contravening Section 60(A)(3)(B) of the Electricity Act, Chapter 13:19. Moyo was charged with “possession of materials used for transmitting electricity without a permit.” Detective Inspector Rachel Muteweri of the […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "Police arrest five copper cable thieves in Bulawayo and Kwekwe",
            "url": "https://www.chronicle.co.zw/police-arrest-five-copper-cable-thieves-in-bulawayo-and-kwekwe/",
            "content": "Sikhumbuzo Moyo[emailprotected]DETECTIVES from the Minerals, Flora and Fauna Unit (MFFU) in Bulawayo and Kwekwe this week arrested five suspects involved in copper cable theft after they failed to provide satisfactory explanations for having the material.Onias Mherekumombe (33), Coster Mahlahla (24), Felix Tachiona (24), and Mandhlenkosi Nyati (26), all from Bulawayo, were apprehended by the Bulawayo MFFU for contravening Section 10 of the Copper Control Act, Chapter 14:06, for failing to give a satisfactory account of the possession of copper.Following receipt of information that the accused persons were trading in copper, detectives from CID MFFU Bulawayo, who were on patrol, intercepted the suspects travelling in a Nissan March vehicle, registration number ADW 7119. Upon searching the vehicle, a sack containing copper cables was recovered. Further investigations led to the recovery of two additional sacks loaded with copper cables, said Detective Inspector Rachel Muteweri, the CID Harare spokesperson.In Kwekwe, Shadreck Gerald Mbirimi (28), of Tongogara Newtown, was arrested by CID MFFU Kwekwe for contravening Section 6A(3)(A) of the Electricity Act, Chapter 13:19, for cutting, damaging, tampering with, or interfering with apparatus used for generating, transmitting, or supplying electricity.The suspect, together with three accomplices who are still at large, vandalised a ZESA transformer at Zororo Business Centre in Zhombe, cutting some PVC armoured cables. Following the arrest, the motor vehicle used in the crime and three sacks of copper cables were recovered. Police are appealing for information that may lead to the arrest of the outstanding suspects, identified only as Brendon, Nathan Kangundu, and another individual yet to be identified, said Det Insp Muteweri.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/07/copper-theft1.jpg",
            "description": "Sikhumbuzo Moyo smoyo@chronicle.co.zw DETECTIVES from the Minerals, Flora and Fauna Unit (MFFU) in Bulawayo and Kwekwe this week arrested five suspects involved in copper cable theft after they failed to provide satisfactory explanations for having the material. Onias Mherekumombe (33), Coster Mahlahla (24), Felix Tachiona (24), and Mandhlenkosi Nyati (26), all from Bulawayo, were apprehended […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "Senator Mohadi donates to Beitbridge’s elderly and disabled",
            "url": "https://www.chronicle.co.zw/senator-mohadi-donates-to-beitbridges-elderly-and-disabled/",
            "content": "Thupeyo Muleya Beitbridge BureauBEITBRIDGE Senator Cde Tambudzani Mohadi has begun donating food hampers and chickens to schoolchildren with disabilities and elderly individuals over the age of 70 in the district as part of her annual charity programme.\n\nCde Mohadi announced that she is set to distribute 4 tonnes of rice, which were sourced by President Mnangagwa and allocated to all parliamentarians for sharing with people in their constituencies. Each parliamentarian was allocated 4 tonnes of rice to distribute.\n\nThe senator, accompanied by Zanu PF Central Committee member Cde Metrine Mudau and the partys provincial commissar for the womens league in Matabeleland South, Cde Sarudzai Moyo, kicked off the programme at Tshamunanga Primary School in Beitbridge West on Wednesday.At Tshamunanga, they handed over food hampers to 110 elderly people, some of whom are disabled, as well as 150 kg of rice to disabled children from Tshamunanga Primary and Tshidixwa Secondary Schools.\n\nThe senator also mentioned that she had sourced hundreds of free-range chickens to distribute across all wards, primarily at schools.Each school is receiving an average of 50 chickens to boost their income-generating projects, enabling them to cater to the needs of children with disabilities and those regarded as extremely vulnerable, who may struggle to pay school fees or buy uniforms. Proceeds from the chicken project will help support the ongoing Government school feeding scheme, said Cde Mohadi.\n\nI am pleased to inform you that our President (Mnangagwa) has provided each parliamentarian with 4 tonnes of rice to share with people in their communities. For Beitbridge, I have decided to focus on the elderly over 70 years old and those members of our community living with disabilities.\n\nShe emphasised that the elderly and disabled are among the most vulnerable members of society, highlighting the need for continuous assistance.\n\nSenator Mohadi added that the donated chickens could, in some instances, enhance practical lessons for agriculture-related studies in the benefiting schools.\n\nShe said resource mobilisation is underway to ensure the donations are evenly distributed across the district.\n\nThis is an annual programme to remember the elderly and disabled in our community, and I am working on increasing the number of beneficiaries. We are grateful to our President for providing us with the rice to share with you, said Cde Mohadi.\n\nCde Mohadi stressed the importance of collaboration between businesses, community members, and the Government to address the challenges facing the people.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/2qe32.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau BEITBRIDGE Senator Cde Tambudzani Mohadi has begun donating food hampers and chickens to schoolchildren with disabilities and elderly individuals over the age of 70 in the district as part of her annual charity programme. Cde Mohadi announced that she is set to distribute 4 tonnes of rice, which were sourced by […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "Duo jailed nine years for stealing cattle and attempting to sell them in South Africa",
            "url": "https://www.chronicle.co.zw/duo-jailed-nine-years-for-stealing-cattle-and-attempting-to-sell-them-in-south-africa/",
            "content": "Thupeyo Muleya Beitbridge Bureau\n\nTWO men from the Shashe area in Beitbridge have each been sentenced to an effective nine years in prison for stealing three cattle from the same area, which they smuggled across the Limpopo River and attempted to sell in South Africa.\n\nRespect Moyo (25) and Prince Tlou (27) were arrested after their potential buyer in South Africa shared images in an anti-stock theft chat group to verify the ownership of the cattle.\n\nMoyo and Tlou were convicted on their own plea of guilty to a charge of stock theft when they appeared before Beitbridge Resident Magistrate Mr Takudzwa Gwazemba on Thursday.\n\nProsecutor Mr Ronald Mugwagwa said on January 10, the accused stole three cattle from the Shashe Number 15 grazing lands in Beitbridge. They then smuggled the cattle across the Limpopo River to South Africa and moved to the Samaria grazing lands in that country.\n\nWhile in South Africa, they approached a potential buyer intending to sell each cow for R5 000. The buyer then informed some contacts in Zimbabwe, who shared images of the cows in a chat group to verify whether the accused were indeed the rightful owners.\n\nThe original owner of the three cattle identified them and reported the matter to the police, who tracked down the accused, finding them in possession of the stolen livestock in South Africa.\n\nMoyo and Tlou were swiftly arrested, and the three cattle were subsequently recovered.\n\nThe theft of livestock between South Africa and Zimbabwe, especially goats, sheep, and cattle, has become a perennial issue, leading to collaboration between communities in both countries to combat stock theft.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/12/Jailed.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau TWO men from the Shashe area in Beitbridge have each been sentenced to an effective nine years in prison for stealing three cattle from the same area, which they smuggled across the Limpopo River and attempted to sell in South Africa. Respect Moyo (25) and Prince Tlou (27) were arrested after […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "Minister Mthuli Ncube to lead Zimbabwean delegation at World Economic Forum in Davos",
            "url": "https://www.chronicle.co.zw/minister-mthuli-ncube-to-lead-zimbabwean-delegation-at-world-economic-forum-in-davos/",
            "content": "Nqobile Bhebhe[emailprotected]Finance, Economic Development, and Investment Promotion Minister Professor Mthuli Ncube will lead a Zimbabwean delegation to the World Economic Forum Annual Meeting in Davos-Klosters, Switzerland, from January 20 to 24.This years theme is Collaboration for the Intelligent Age.Speaking on X on Thursday, Prof Ncube said he is attending the meeting also as chairman of African Finance ministers.Being Minister of Finance, this year I am also the chairman of the committee of Finance ministers for the whole of Africa, so I also carry that continental mandate.We are also the chair of SADC, we are also the voice of SADC, and we carry the burden of the whole continent.The Annual Meeting 2025 convenes global leaders to address key global and regional challenges.These include responding to geopolitical shocks, stimulating growth to improve living standards, and stewarding a just and inclusive energy transition.Prof Ncube said he will be presiding over a session a ceremony on investment into a three start-ups noting that the national venture fund is now in full operational.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Professor-Mthuli-Ncube-1.jpg",
            "description": "Nqobile Bhebhe nqobile.bhebhe@chronicle.co.zw Finance, Economic Development, and Investment Promotion Minister Professor Mthuli Ncube will lead a Zimbabwean delegation to the World Economic Forum Annual Meeting in Davos-Klosters, Switzerland, from January 20 to 24. This year’s theme is ‘Collaboration for the Intelligent Age.’ Speaking on X on Thursday, Prof Ncube said he is attending the meeting […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "Prince Adrie encourages hustling in latest single",
            "url": "https://www.chronicle.co.zw/prince-adrie-encourages-hustling-in-latest-single/",
            "content": "Mthabisi Tshuma[emailprotected]TSHIVENDA hip-hop star Prince Adrie has kicked off the year on a high note with the release of a single titled Nwana Wamkalaha.The track features fellow artist Singer_Bopha, also from the border town of Beitbridge. It was recorded in Musina, a border town in South Africa, and produced by South African producer HDK The Godfather, with the beat crafted by another South African producer, CVK Instrumentals.The music video was filmed in Beitbridge by Bulawayo-based videographer Keaitse Films.Prince Adrie said the song aims to motivate the public to adopt a strong work ethic and hustle harder to achieve success.\n\nTshivenda hip hop artistes Singer_Bopha and Prince Adrie\n\nThe track is titled Nwana Wamkalaha, which means Nwana Wamdhara, or simply my blood. Its a motivational song encouraging Nwana Wamkalaha to work hard and break the chains of poverty.Nwana Wamkalaha is also a street lingo that bridges generational gaps, allowing people of different age groups to greet each other warmly.In Beitbridge, it has become part of the culture, a friendly term people use in the streets regardless of gender. Everyone is Nwana Wamkalaha. It unites languages like Venda, Shona, Ndebele, and Sotho, among others, said Prince Adrie.Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/9o6r0.jpg",
            "description": "Mthabisi Tshuma  revmmthiretshuma@gmail.com TSHIVENDA hip-hop star Prince Adrie has kicked off the year on a high note with the release of a single titled Nwana Wamkalaha. The track features fellow artist Singer_Bopha, also from the border town of Beitbridge. It was recorded in Musina, a border town in South Africa, and produced by South African […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "Cuban President Hails President Mnangagwa and Zimbabwe for support",
            "url": "https://www.chronicle.co.zw/cuban-president-hails-president-mnangagwa-and-zimbabwe-for-support/",
            "content": "Online writerPRESIDENT Miguel Daz-Canel Bermdez of Cuba has hailed President Emmerson Mnangagwas support in Cubas quest to be removed from the United States list of State Sponsors of Terrorism.President Daz-Canel Bermdez made the remarks during a meeting with President Mnangagwas Special Envoy on the Museum of African Liberation, Ambassador Simbarashe Mumbengegwi, at the Palace of the Revolution in Havana on Wednesday.\n\nAmbassador Mumbengegwi is in Havana to deliver a special message from President Mnangagwa to President Daz-Canel Bermdez and to receive a donation of historical artefacts from Cuba for the Museum of African Liberation.\n\nPresident Daz-Canel Bermdez expressed Cubas appreciation for Zimbabwes support on the international stage, highlighting how both nations have endured the effects of illegal sanctions imposed by the United States.This week, outgoing United States President Joe Biden announced Cubas removal from the list of countries and organisations it claims sponsor terrorism.President Daz-Canel Bermdez told Ambassador Mumbengegwi, This is a victory for the Cuban people, but we also share it with friends like you, who have supported us internationally.He reaffirmed his commitment to strengthening and expanding the historically strong ties between Cuba and Zimbabwe, broadening collaboration in various areas, and also handed over a gift for President Mnangagwa.Amb Mumbengegwi described the meeting as a great honour, adding, You have always been available to us when we have requested it, which underlines the nature and character of our relations since the early days of our liberation struggle.\n\nHe further noted, Cuba was the smallest country from a geographical perspective, yet it contributed the most to our liberation struggle.President Daz-Canel Bermdez was joined by Mr Emilio Lozada Garca, head of the Department of International Relations of the Central Committee of the Communist Party, and Deputy Foreign Minister Elio Rodrguez Perdomo, among other officials.Amb Mumbengegwis delegation included Deputy Chief Secretary (Finance, Administration and Human Resources) in the Office of the President and Cabinet, Mr Zvinechimwe Churu; Brigadier-General Million Ndlovu of the Zimbabwe Defence Forces; and the Chief Executive Officer of the Institute of African Knowledge (INSTAK), Amb Kwame Muzawazi.Earlier in the day, Amb Mumbengegwi received a consignment of artefacts and paraphernalia donated by Cuba, which will be transported to Harare for display at the Museum of African Liberation.Among the donated items were two military tanks used in the famous Battle of Cuito Cuanavale in Angola, a military personnel carrier, four boxes of military regalia, historic documents, books, pictures, and films.Amb Mumbengegwi said a befitting ceremony would be organised in Zimbabwe to officially receive this priceless donation once the consignment arrives.The Museum of African Liberation, a project spearheaded by INSTAK with full support from the Government of Zimbabwe, serves as a monument to the African continents epic struggle against European colonialism and apartheid.Cuba is one of three non-African countries whose flags have been raised at the Museum of African Liberation, alongside China and Russia. The museum includes a designated space to document Cubas extensive contributions to African liberation.Zimbabwe and Cuba share strong ties forged during Zimbabwes Second Chimurenga. Post-independence, Cuba has played a significant role in the development of Zimbabwes human capital and health sector.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/vger.jpg",
            "description": "Online writer PRESIDENT Miguel Díaz-Canel Bermúdez of Cuba has hailed President Emmerson Mnangagwa’s support in Cuba’s quest to be removed from the United States’ list of State Sponsors of Terrorism. President Díaz-Canel Bermúdez made the remarks during a meeting with President Mnangagwa’s Special Envoy on the Museum of African Liberation, Ambassador Simbarashe Mumbengegwi, at the […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "2025 Mutupo-Isibongo calendar out",
            "url": "https://www.chronicle.co.zw/2025-mutupo-isibongo-calendar-out/",
            "content": "Brandon Moyo\n\nORGANISERS of the countrys most unique golf event, the Mutupo-Isibongo golf tournament have released the calendar of events for 2025.\n\nThe 2024 edition of the tournament came to an end in December last year with the Shumba clan clinching the top accolade at Royal Harare Golf Club. The 2025 season opener is also scheduled to take place at the iconic venue, Royal Harare.\n\nThe opener is scheduled for February 7 and will be followed by the Mashonaland Central edition which will be hosted at Bindura Golf Club on March 16. The third edition of the season will be hosted by Bulawayo Country Club on behalf of Bulawayo province on April 26.\n\nThere is also the schools golf tournament which will take place at Police Golf Club on June 28 before the event goes international. The next edition on the calendar will be held in the United Kingdom at Stratford Park Golf Club on July 19 before Gweru Golf Club hosts on behalf of Midlands on July 26.\n\nAction will then move to Marondera Golf Club on behalf of Mashonaland East on August 24 before it returns to Harare at Police Golf Club on October 11. Hillside Golf Club will host the Manicaland edition on November 1. The following week action will move to Norton Golf Club on behalf of Mashonaland West.\n\nThe season finale is scheduled for Royal Harare on December 13. Traditional sponsors, Lake Harvest, Proton and Surrey Group continue sponsoring the event.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/GOLF.jpg",
            "description": "Brandon Moyo ORGANISERS of the country’s most unique golf event, the Mutupo-Isibongo golf tournament have released the calendar of events for 2025. The 2024 edition of the tournament came to an end in December last year with the Shumba clan clinching the top accolade at Royal Harare Golf Club. The 2025 season opener is also […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "ZIFA brings football joy to Matabeleland South",
            "url": "https://www.chronicle.co.zw/zifa-brings-football-joy-to-matabeleland-south/",
            "content": "Innocent Kurira[emailprotected]\n\nTHE Zimbabwe Football Association (Zifa) has taken its ball distribution exercise to Matabeleland South Province, benefiting over 100 schools in the region.\n\nAs part of the Fifa Football for Schools programme, Zifa aims to nurture grassroots football and empower young learners across the country.\n\nThe programme has already covered seven of the countrys ten provinces, with Matabeleland North and Midlands being the only remaining provinces.\n\nBy the end of the week, a total of 8,180 footballs will have been distributed nationwide since the programme began last year.\n\nThe initiative also includes online safeguarding training for teachers and educators, equipping them with vital knowledge to protect and nurture young talent responsibly.\n\nZifas efforts are part of a broader commitment to developing football at the grassroots level and promoting education and safety for young players. The programme is also contributing to the holistic development of young people, instilling values of teamwork, discipline, and safety.\n\nThe areas being reached in Matabeleland South Province include Beitbridge, Gwanda, Insiza, Umzingwane, Mangwe, Bulilima, and Matopo. With Fifas support, Zifa is creating a brighter future for football and education in Zimbabwe.\n\nFifa forward and projects manager for Zimbabwe, Kudzai Chitima said: This initiative embodies our commitment to developing football at the grassroots level while instilling values of teamwork, discipline, and safety. We are proud to see the joy and opportunities it brings to schools across Zimbabwe. With Fifas support, we are creating a brighter future for football and education in our country.\n\nThe Fifa Football for Schools programme continues to reinforce the importance of sport in education, contributing to the holistic development of young people. Zifa remains committed to ensuring every corner of the country benefits from this initiative, leaving a lasting legacy for the next generation of footballers.\n\n@innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/5y635.jpg",
            "description": "Innocent Kurira innocent.kurira@chronicle.co.zw THE Zimbabwe Football Association (Zifa) has taken its ball distribution exercise to Matabeleland South Province, benefiting over 100 schools in the region. As part of the Fifa Football for Schools programme, Zifa aims to nurture grassroots football and empower young learners across the country. The programme has already covered seven of the […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        },
        {
            "title": "Cosmopolitan hosts Scotts Maphuma gig pre-party",
            "url": "https://www.chronicle.co.zw/cosmopolitan-hosts-scotts-maphuma-gig-pre-party/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nAs the much-anticipated Amapiano musician Scotts Maphumas show nears, a pre-party celebration has been set for the evening of January 17, with the main event slated for Saturday, January 18, at the Cosmopolitan VIP Lounge.\n\nThe pre-party will feature various DJs taking turns on the decks, building up the mood in preparation for the main event. On the decks will be DJ Mufali, DY Melow, DJ Briz, DJ Keezy Am, DJ Teflow, and DJ Cozy.\n\nScotts Maphuma is expected to jet into Zimbabwe on Saturday morning.\n\nCosmopolitan marketing manager Sky Nkabinde said everyone should come ready to dance.\n\nEveryone should come prepared to be thrilled by the young and dynamic artiste, Scotts Maphuma, known for chart-topping hits like Shayi Moto, Madlamini, and Beke le Beke. This is set to be an unforgettable night, and tickets are selling out fast, so dont miss your chance.\n\nWith a top-tier venue, an incredible line-up of local talent including DJ Liz, DJ Crazy Dee, Mzistozz, Wellyonz, DJ Liz, Chuck, Blaze, and cold drinks flowing all night, its the perfect recipe for an epic experience. Put on your dancing shoes, bring your best vibes, and prepare to go over budget for memories that will last a lifetime. Bathini Bona? Ziyakhala! Mark your calendars, January 18 is the date, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/scotts-maphuma.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com As the much-anticipated Amapiano musician Scotts Maphuma’s show nears, a pre-party celebration has been set for the evening of January 17, with the main event slated for Saturday, January 18, at the Cosmopolitan VIP Lounge. The pre-party will feature various DJs taking turns on the decks, building up the mood in preparation for […]",
            "time": "18:29",
            "date": "16 Jan 2025"
        }
    ]
}