{
    "news": [
        {
            "title": "‘No room for hesitation  in Government’",
            "url": "https://www.chronicle.co.zw/no-room-for-hesitation-in-government/",
            "content": "Blessings Chidakwa,Harare Bureau\n\nPRESIDENT Mnangagwa yesterday cracked the whip on under-performing Ministers of State for Provincial Affairs and Devolution who are creating unnecessary glitches in Government operations by failing to submit reports and attending vital Cabinet Committee meetings.\n\nKeepinghis hand on the pulse of national development, President Mnangagwa had a lively session with 10 Ministers of State for Provincial Affairs and Devolution who are in charge of the countrys 10 administrative provinces.\n\nThe meeting was held at State House in Harare.\n\nThe President said for Government to have an effective National Devolution Agenda, Provincial Ministers must submit comprehensive and timely reports.\n\nHe said these include both ad-hoc as well as routine reports on the state of provinces, highlighting all aspects including those on economic affairs.\n\nPresident Mnangagwa said it is unfortunate that some provinces are failing to make these submissions.\n\nThis is unacceptable and tantamount to dereliction of duty. Similarly, the non-attendance to Cabinet Committee meetings by some Ministers of State for Provincial Affairs and Devolution in 2024 was glaring.\n\nAs a result, Cabinet committee submissions missed vital input from Provinces. This anomaly must be adequately addressed. I expect provinces to emerge stronger, dynamic and competitive economic hubs, with marked growth across all sectors, he said.\n\nPresident Mnangagwa said the primary task of Ministers of State for Provincial Affairs and Devolution was to improve the peoples living standards and achieve shared prosperity, as is envisaged in his development philosophy of leaving no one and no place behind.\n\nAs such, the President said the ministers should be unrelenting in attending to challenges, taking necessary risks to overcome obstacles by implementing solutions that benefit the people.\n\nHesitation, the dragging of feet and fence-sitting are not acceptable dispositions under my administration. Additionally, increased momentum to achieve our national development aspirations requires leaders who are bold, focused, hardworking and prepared to make the requisite personal sacrifices for unprecedented results.\n\nIndividually and collectively decide to be counted as those possessing these traits. This is the spirit that saw us realise our independence, freedom and peace to become masters of our own destiny, he said.\n\nPresident Mnangagwa said Zanu-PF under his leadership always has people at heart with Devolution a critical pillar for national unity, social cohesion and safeguarding the indivisibility of Zimbabwe as a sovereign-unitary State.\n\nZANU-PF\n\nAs Provincial Ministers, you are directed to demonstrate the leadership capability, integrity and humility that rallies all our communities, across all districts, within provinces, around the common national vision, and the indivisibility of our country, he said.\n\nYou have a duty at the grassroots level to ensure that our society has vitality and hope, living in unity, peace and harmony. It is under such environments that we can realise sustainable development and prosperity for our motherland for both present and future generations.\n\nPresident Mnangagwa said he is now shifting paradigms, transforming Ministries of Provincial Affairs and Devolution from being merely administrative or ceremonial to championing economic development programmes at sub-national level.\n\nThe President said the consistent implementation of a provincial fiscal performance analysis dashboard and monitoring of the socio-economic performance of provinces must be prioritised in the co-ordination of the offices of Ministers of State for Provincial Affairs.\n\nIt is commendable that Provincial Economic Development Plans have since been validated for alignment with our National Development Strategy.\n\nNational Development Strategy 1 (NDS1)\n\nThe implementation of the National Development Strategy 2 must give impetus and greater focus on building modern, sustainable and resilient Provincial economies, he said.\n\nPresident Mnangagwa said all the 10 provinces are blessed with God-given natural resources and the communities must remain good custodians of such endowments and be active players in their transformation into bankable, life changing investment opportunities and projects.\n\nIn the face of natural disasters including the El-Nino induced drought last year, President Mnangagwa urged the Ministers of State for Provincial Affairs to continue ensuring the timely delivery of assistance across districts and wards within provinces.\n\nThe President also took a swipe at some private voluntary organisations that tend to advance clandestine agendas.\n\nI call upon provincial structures to shun and expose any machinations and underhand activities that seek to reverse the progress we have achieved as the Second Republic, he said.\n\nPresident Mnangagwa said the supremacy of the ruling party, Zanu PF, over the Government remains an enduring and integral principle to their work.\n\nProvinces should continue to work with traditional leaders and party structures, so that our people participate in decision-making and also take ownership in the implementation of Government projects and programmes.\n\nJoint meetings and seamless co-ordination with the party and development committees at appropriate levels, should be improved. Programmes and projects being undertaken within the provinces must be clearly articulated, including their overall impact on the livelihoods of our people.\n\nI urge ministries, departments and agencies at provincial level, including councils, to remain duty bound and committed to the realisation and protection of our national interests and development aspirations, he said.\n\nThe President said as the nation builds resilience and adaptive capacity for sustained economic transformation, the business-as usual approach and narrow turf wars should be decisively dismantled.\n\nUnity of purpose, dedication, and innovation coupled with efficient co-ordination in the implementation of Government policies, programmes and projects, the President added, are critical building blocks for the realisation of Vision 2030 and must be key priorities.\n\nMinister of State for Masvingo Provincial Affairs and Devolution, Ezra Chadzamira, said the meeting was vital as it pushes them to work harder in achieving vision 2030.\n\nDuring the meeting with the President we talked about vast achievements gained under the Second Republic. We also talked about some challenges faced, he said.\n\nWe are happy that the President emphasised that we should prioritise all the uncompleted projects so that they add value to citizens while Devolution funds will continue to be disbursed on time. We are grateful to the President for the meeting.\n\nMinister of State for Provincial Affairs and Devolution for Mashonaland East Dr Apollonia Munzverengwi said infrastructural development was now the new norm in her province courtesy of the Presidents guidance.\n\nWe are happy that we have been given the opportunity to meet His Excellency, updating him on what is happening in our respective provinces. l am glad to say Mash East is working together with other provinces.\n\nWe have benefitted from construction of a number of projects including dams. We are the custodians of Muchekeranwa Dam where 75 households are directly benefitting through irrigation, she said.\n\nMinister Munzverengi also said her province has Chivhu Dam which is now moving to ease water shortages for Chivhu town.\n\nThe benefits of the water are going towards the people so we are happy for the ongoing developments, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/8d8d8d78d.jpg",
            "description": "Blessings Chidakwa, Harare Bureau PRESIDENT Mnangagwa yesterday cracked the whip on under-performing Ministers of State for Provincial Affairs and Devolution who are creating unnecessary glitches in Government operations by failing to submit reports and attending vital Cabinet Committee meetings. Keeping  his hand on the pulse of national development, President Mnangagwa had a lively session with 10 […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "Modern homes for old Gwanda Road displaced families",
            "url": "https://www.chronicle.co.zw/modern-homes-for-old-gwanda-road-displaced-families/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE reconstruction of the 120km Old Gwanda Road in Matabeleland South has prompted the relocation of 42 families, who will be compensated with modern, solar-powered homes.\n\nThe project, valued at US$150 million, includes road furniture such as fuel service stations, toll gates, and a rural shopping mall.\n\nThe Government and Zwane Enterprise signed a Concession Agreement last week, marking the beginning of the project.\n\nThe redesigned road will add impetus to the tourism sector in the area.\n\nMatopo High School headmaster Mr Gardson Sibanda speaks on how the school will benefit on road construction, as it will reduce damages on their vehicles.\n\nUnder Chief Masuku in Matobo District, 15 homesteads, eight graves and one community borehole will be relocated to pave way for the project.\n\nUnder Chief Mathe (Umzingwane District) 15 homesteads, two graves and a kraal will be moved while under Chief Mathema (Gwanda District) 12 homesteads, 14 graves, a shop and a bar will be relocated to accommodate construction.\n\nZwane Enterprise chief executive officer, Engineer Bekithemba Mbambo, released designs for the new homes, featuring four to eight rooms, solar energy, and a solar-powered borehole with a 5 000-litre water tank.\n\nEachrelocated family will have a farm garage, storeroom, a fowl run with solar lights, a grass-thatched hut for kitchen utensils, and a grass-thatched gazebo for cooking and relaxing, a blair toilet, bathroom, and septic tank.\n\nCattle kraals will be updated, and homes will have security fences, gates, and street tower lights.\n\nVillagers preparing the land where one of the villagers homestead will be relocated to for the Old Gwanda Road Construction .\n\nThe relocated families will receive orchards and additional three-acre crop fields if they lose part of their farms. Saturday will see the ground-breaking ceremony, marking the start of the construction of the 42 homesteads for the affected families.\n\nBesides building them better homes, we dont want to promise too much, said Eng Mbambo.\n\nWe will team up with an institution of higher learning along the corridor to assist in training and giving certificates to local builders who will be engaged in the construction of homes.\n\nMost homesteads should be complete by the end of June.\n\nMatabeleland South Provincial Affairs and Devolution Minister, Dr Evelyn Ndlovu, will preside over the ground-breaking ceremony.\n\nCommunity leaders expressed excitement over the projects transformative impact.\n\nNtunjambili village head Mr Nkosana Moyo welcomed the redesign, stating how farmers needed to have reliable road access.\n\nThe existing road is in an untraffickable state due to lack of grading, hindering local business.\n\nMr Moyo praised Zwane Enterprises transparency and communication with the community.\n\nThe community has been informed of the new models that will be constructed, and we are satisfied with how the project will be implemented, said Mr Moyo.\n\nIn 2022 they came to tell us about the project but they disappeared for some time. But last year they came again to tell us that the project was on track and earlier this year they called for a meeting where they informed us that some of the homesteads in the community will be moved to pave way for the construction.\n\nWhile the gravel road passes through Matopo High School, the new road will pass behind the school. Thats how some homesteads will be affected, he said.\n\nVillage development committee member, Mr Micah Moyo, stressed the need for a reliable road network to access markets and facilitate business growth.\n\nMrsTendaiMoyo one of the villagers whose homestead will be relocated for the construction of the Old Gwanda Road\n\nWith a better road network, we expect more development as more people use the road, which is good for business, said Mr Moyo.\n\nMatopo High School head Mr Gardson Sibanda welcomed the road construction project, citing the challenges posed by the current gravel road.\n\nWe are very excited that the Government is putting a tarred road passing through our school. The road we are using is very bad. When it rains, it is usually severely damaged, and its a mammoth task to drive on. We are incurring serious expenses repairing our vehicles, he said.\n\nWith the new road, it will be quicker to have access to the resources that we need for our boarding here. We have now diverted the route as we believe that it is a better one.\n\nInstead of connecting the school through Old Gwanda Road, Mr Sibanda said they now use Matopos Road, turning at the Matopos National Park road and reconnecting on Old Gwanda Road at Fort Usher turn, which increases the distance travelled to the school.\n\nHe said the school is sometimes forced to buy fuel for the Rural Infrastructure Development Agency (RIDA), formerly the District Development Fund, to grade the road leading to the school.\n\nWe are using our own resources meant for buying textbooks and boarding food, and sending it to another department. This shows that we really need the road. Because it is very difficult to get to Bulawayo using this road, he said.\n\nThe new road is also expected to significantly enhance the cellphone network coverage.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bczsdfzXxz.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE reconstruction of the 120km Old Gwanda Road in Matabeleland South has prompted the relocation of 42 families, who will be compensated with modern, solar-powered homes.  The project, valued at US$150 million, includes road furniture such as fuel service stations, toll gates, and a rural shopping mall. The Government and Zwane Enterprise signed […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "SADC, EAC must address involvement of European mercenaries in DRC",
            "url": "https://www.chronicle.co.zw/sadc-eac-must-address-involvement-of-european-mercenaries-in-drc/",
            "content": "THE situation in the Democratic Republic of Congo (DRC) remains a great concern, not only for the countrys people but also for the entire regions stability.\n\nThe ongoing conflict in the Eastern DRC has led to the loss of countless lives, widespread displacement, and untold damage to the economy and infrastructure of the region. The Eastern DRC has been in a state of war for over two decades, with well-armed militias causing untold suffering to the local population through rape, displacement, and murder with no end in sight.\n\nWhile the Kinshasa government has consistently claimed to be working towards a lasting peace, its efforts have not yielded significant results. The DRC governments lack of control over the mineral-rich eastern region has only made things worse, as armed groups continue to operate largely unchallenged.\n\nHowever, with the recent rise of the M23 rebels, who overran Goma and established their own administration, the situation has become even more complex. The M23 threat to march on the capital, Kinshasa, represents a clear and present danger to the entire country, and indeed, the entire region.\n\nTherefore, it is urgent and essential that SADC and the East African Community (EAC) address the ongoing conflict and the underlying issues behind its formation at their joint summit to be co-chaired by President Mnangagwa and Kenyan President William Ruto in Tanzania tomorrow and Saturday. The joint summit presents an opportunity to discuss a wide range of solutions that would help bring lasting peace and stability to the DRC and the region.\n\nOne of the root causes of the conflict in the DRC has been the exploitation of its rich natural resources by multinational companies and countries that sponsor wars to secure these resources. The SADC and EAC must work together to stop this exploitation and hold companies and countries that fuel the war in the Eastern DRC accountable.\n\nKenyan President William Ruto\n\nIt is time to make it clear that the natural resources of the DRC belong to the Congolese people and must be managed in their best interests.\n\nAdditionally, the summit must address the involvement of European mercenaries in the conflict, resulting in the killing of Africans on African soil. It is unacceptable for Europeans to be fuelling conflicts and killing Africans on African soil, no matter the circumstances. Every effort must be made to put an immediate end to this practice.\n\nSADC Chairperson President Mnangagwa\n\nThe solution to the conflict in the DRC must also take into account the human rights violations that have been committed by all sides in the conflict. It is crucial that SADC and EAC prioritise the protection of civilians and address the issue of impunity for those responsible for crimes against humanity.\n\nThe summit must address the issue of governance in the DRC. Corruption, lack of state capacity, and weak institutions have long been contributing factors to the conflict. The SADC and EAC must work together to promote good governance in the DRC, which includes fighting corruption, strengthening institutions, and promoting accountability.\n\nWe urge the SADC and EAC summit to seize this opportunity and address the ongoing crisis. The people of the DRC have suffered enough and deserve peace, stability, and security so that they can live their lives without fear of violence and displacement.\n\nThe instability in the region has led to the influx of refugees into neighbouring countries, destabilising those countries economies and creating a humanitarian crisis. The SADC and the EAC summit should emerge with a firm comprehensive stance that will ensure that all parties involved in the conflict are brought to the negotiating table to find a lasting solution.\n\nFailure to find a lasting solution will only prolong the conflict and cause more suffering to the Congolese people which will continue to have devastating consequences for the entire region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/06/Congo.jpg",
            "description": "THE situation in the Democratic Republic of Congo (DRC) remains a great concern, not only for the country’s people but also for the entire region’s stability. The ongoing conflict in the Eastern DRC has led to the loss of countless lives, widespread displacement, and untold damage to the economy and infrastructure of the region. The […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "Three witnesses as Chipunza trial starts",
            "url": "https://www.chronicle.co.zw/three-witnesses-as-chipunza-trial-starts/",
            "content": "Peter Matika,[emailprotected]\n\nTHE trial of Bulawayo socialite, Brighton Chipunza, for allegedly stealing a South African-registered Toyota Fortuner from a car wash in the city centre last year has finally kicked off.\n\nThe trial, presided over by Bulawayo magistrate Mr Joseph Mabeza, heard testimonies from three key witnesses linking Chipunza to the crime.\n\nMiss Silibaziso Ncube, the complainant and first witness, told the court that she had assigned Mr Jonathan Ngando Thuli to take the vehicle to Tunnel Car Wash for cleaning on November 18 last year.\n\nMr Thuli left the vehicle with Mr Panashe Dube, who works at the car wash, and Mr Dube cleaned and parked it outside.\n\nHowever, when Ms Ncube went to collect the vehicle at 4pm, she found it missing.\n\nAfter inquiring with the staff and learning that her car had been stolen, she reported the matter to the police.\n\nThe second witness, Mr Thuli, corroborated Ms Ncubes account, confirming that he had left the vehicle with Mr Dube.\n\nThe third witness, Mr Nkosi Moyo, alleged that Chipunza hired him to drive the stolen vehicle from Bulawayo to Harare.\n\nMr Moyo recounted how Chipunza collected him at midnight from his residence in Emakhandeni and drove to Montrose, where the vehicle was stashed.\n\nHe was given the keys and instructed to deliver the vehicle to Chipunzas co-accused, Julius Chitubhu, in Harare.\n\nI was in the company of my younger brother, who on that particular day was not feeling well, he said.\n\nWe were supposed to travel together but he couldnt due to his condition. After I was given the keys to the car I asked to be escorted to town as I am not familiar with the neighbourhood.\n\nWe then passed through Bradfield and poured fuel in the vehicle at a certain garage. Thereafter, I was escorted to Harare Road and given instructions as to what to do when I arrived in Harare, said Mr Moyo.\n\nThe prosecutions case relies on WhatsApp chats between Chipunza and the supposed buyer, as well as his accomplice in Harare.\n\nThe vehicle was recovered from Chitubhus yard in Harare with the help of a vehicle tracking company and police detectives. Its front and rear number plates were missing and the engine chassis number ground off.\n\nA grinder, stencils, acid, and spray paints were found in the vehicle, linking Chitubhu to the crime.\n\nMembers of the Vehicle Theft Squad (VTS) checked the car wash and found that the CCTV at the facility had been deactivated.\n\nThe trial is expected to continue on February 11.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hdfshggh.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw THE trial of Bulawayo socialite, Brighton Chipunza, for allegedly stealing a South African-registered Toyota Fortuner from a car wash in the city centre last year has finally kicked off. The trial, presided over by Bulawayo magistrate Mr Joseph Mabeza, heard testimonies from three key witnesses linking Chipunza to the crime. Miss Silibaziso Ncube, […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "Art and craft exports surge to $10,1 million",
            "url": "https://www.chronicle.co.zw/art-and-craft-exports-surge-to-101-million/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nZIMBABWES art and craft exports clocked US$10,1 million in 2023 from US$5,4 million in 2020 as the sector continues to increase its contribution to the economy while empowering ordinary people, a report shows.\n\nAccording to ZimTrade, several surveys have indicated that different global markets have a huge appetite for art and craft products and this could significantly boost Zimbabwes export earnings.\n\nRealising this potential, ZimTrade has in recent years been visiting provinces that are into art and craft, including Matabeleland North, where clusters were established and training held to capacitate producers with information that will enhance product quality to meet international standards.\n\nNotably, exports of art, collectors pieces and antiques grew from US$5,4 million in 2020 to US$10,1 million in 2023, marking an impressive growth of approximately 100 percent, said ZimTrade.\n\nJikweni Craft Centre chairman Artwell Ndlovu shows some of the crafts they sell\n\nThe agency highlighted that whilst the sector has recorded growth, here are still untapped opportunities, hence its aim is to increase the sectors contribution to Zimbabwes total export earnings through technical interventions and capacity building.\n\nOn-site technical interventions and assistance programmes are highly effective, particularly when providing specific and relevant recommendations, said the agency.\n\nZimbabwe is home to exceptionally talented artisans and with the right support, there is room to increase foreign currency revenue leading to improved living standards and a more developed society.\n\nWith the assistance of ZimTrade, there has been an increase in the number of Zimbabwean artisans who are growing their exports to diverse markets, including South Africa, the United States, Ethiopia, the United Kingdom, Spain, Namibia, China, Denmark and Germany.\n\nZimTrade chief executive officer Allan Majuru\n\nOfficial reports show that the global art and craft market clocked approximately US$42,88 billion in 2023 and is projected to reach around US$70,33 billion by 2032, with a compound annual growth rate of 5,6 percent.\n\nThis market growth necessitates careful consideration and strategic adjustments to our production procedures to maintain and expand our international market share, said ZimTrade.\n\nThe strong demand for the countrys arts and crafts is a testament to the exceptional artistic talent within Zimbabwe, with artisans leveraging a wide range of skills to create diverse products that meet the needs of various markets.\n\nThe agency said while the sector has achieved remarkable success, feedback from international markets indicates a growing demand for enhanced quality.\n\nArt and craft exports clocked US$10,1 million in 2023 from US$5,4 million in 2020. File picture of Jikweni Craft Centre\n\nZimTrade, in partnership with the Germany-based Senior Expert Service (SES), has said it is stepping up efforts to empower artisans in Masvingo and Manicaland through targeted technical support aimed at further elevating their capacity and competitiveness in the global marketplace.\n\nThe intervention by experienced experts from Germany is set to play a pivotal role in boosting exports from Zimbabwes arts and crafts sector. Government on one hand has also made a commitment to ensure creatives are supported so that they can grow in national importance and economic value.\n\nFor instance, the Cultural and Creative Industries Strategy (2020-2030) is targeted at strengthening and transforming the creative industry at all levels.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tgyyk.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com ZIMBABWE’S art and craft exports clocked US$10,1 million in 2023 from US$5,4 million in 2020 as the sector continues to increase its contribution to the economy while empowering ordinary people, a report shows. According to ZimTrade, several surveys have indicated that different global markets have a huge appetite for art and […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "Police seek relatives of man killed by haulage truck in Hwange",
            "url": "https://www.chronicle.co.zw/police-seek-relatives-of-man-killed-by-haulage-truck-in-hwange/",
            "content": "Caroline Mutsawu in Hwange\n\nPOLICE in Hwange, Matabeleland North province are appealing for assistance in identifying the relatives of a man who was fatally struck by a haulage truck belonging to Freightliner Companyalong the Bulawayo-Victoria Falls Highway in November last year.\n\nMatabeleland North provincial police spokesperson, Inspector Glory Banda, confirmed the incident, which occurred at the 335km peg on November 30.\n\nI can confirm that we recorded an accident in which a pedestrian died after being hit by a truck along the Bulawayo-Victoria Falls Highway, said Inspector Banda.\n\nBulawayo-Victoria Falls Highway\n\nAccording to the police, the driver, Tavonga Ticharwa (43), was operating a white Freightliner truck towing a single trailer. He was traveling eastward with no passengers when he pulled into Glow Petroleum garage around 10pm to refuel.\n\nAn hour later, Ticharwa moved his vehicle approximately 15 meters from the garage, parked, and went to sleep. The following morning, at around 6:30 AM, he woke up to find a crowd gathered behind his truck.\n\nUpon inspection, he discovered the body of the deceased with severe injuries, including a dislodged right leg and multiple fractures on the right hand, said Insp Banda.\n\nTraffic police and the Criminal Investigation Department (CID) conducted investigations and found blood stains on the left wheels of the trucks trailer, which was parked about 15 meters from the scene.\n\nThe body was initially taken to Hwange Colliery Hospital mortuary before being transferred to the United Bulawayo Hospital (UBH) for a post-mortem examination.\n\nAs police, we are appealing to the public to help identify the deceased. He was wearing a blue T-shirt, grey trousers with a brown belt, and black North Star sports shoes with white borders, said Insp Banda.\n\nThe body is currently at Victoria Falls General Hospital, awaiting identification by family members.\n\nInsp Banda said investigations into the circumstances surrounding the accident are ongoing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/10/Truck7.jpg",
            "description": "Caroline Mutsawu in Hwange POLICE in Hwange, Matabeleland North province are appealing for assistance in identifying the relatives of a man who was fatally struck by a haulage truck belonging to Freightliner Company  along the Bulawayo-Victoria Falls Highway in November last year. Matabeleland North provincial police spokesperson, Inspector Glory Banda, confirmed the incident, which occurred […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zimbabwe referee for ICC Men’s Champions Trophy",
            "url": "https://www.chronicle.co.zw/zimbabwe-referee-for-icc-mens-champions-trophy/",
            "content": "Zimpapers Sports Hub\n\nFORMER Zimbabwe cricketer, Andrew Pycroft, has been selected as match referee at the International Cricket Council (ICC) Mens Champions Trophy to be co-hosted by Pakistan and the United Arab Emirates.\n\nThe tournament will be held from February 19 to March 9, and Pycroft will serve alongside David Boon and Ranjan Madugalle.Pycroft, born on June 6, 1956, had a distinguished cricketing career, playing three Tests and 20 one-day internationals for Zimbabwe between 1983 and 1992.\n\nHe was a competitive batsman who retired early to focus on his family. Pycroft also captained the national team and later managed the Zimbabwe Under-19 team, becoming a national selector and coach.\n\nAfter resigning as coach during the 2003 World Cup finals, Pycroft has continued to contribute to the sport as a match referee.He joins a team of 12 umpires selected for the Champions Trophy, including Richard Kettleborough, Chris Gaffaney, Kumar Dharmasena, Richard Illingworth, Paul Reiffel and Rod Tucker, all members of the Emirates ICC Elite Panel of Umpires.\n\nSean Easey, ICC Senior Manager  Umpires and Referees, expressed his confidence in the selected officials.We are pleased to announce our panel of match officials for the upcoming Mens Champions Trophy. This is a credentialled officiating team whose expertise will be valuable in this high-profile tournament, said Easey.\n\nWe always try to name the most suitable and deserving officials for any event, and we are confident this group will do a fine job across the matches in Pakistan and the UAE. I wish them all the best and hope they have a memorable tournament.\n\nUmpiresKumar Dharmasena, Chris Gaffaney, Michael Gough, Adrian Holdstock, Richard Illingworth, Richard Kettleborough, Ahsan Raza, Paul Reiffel, Sharfuddoula Ibne Shahid, Rodney Tucker, Alex Wharf, Joel Wilson.Match RefereesDavid Boon, Ranjan Madugalle, Andrew Pycroft. Sports Reporter/icc-cricket.com\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dfdfjgh.jpg",
            "description": "Zimpapers Sports Hub FORMER Zimbabwe cricketer, Andrew Pycroft, has been selected as match referee at the International Cricket Council (ICC) Men’s Champions Trophy to be co-hosted by Pakistan and the United Arab Emirates. The tournament will be held from February 19 to March 9, and Pycroft will serve alongside David Boon and Ranjan Madugalle. Pycroft, […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "Young model appeals for sponsorship to represent Zimbabwe in Egypt",
            "url": "https://www.chronicle.co.zw/young-model-appeals-for-sponsorship-to-represent-zimbabwe-in-egypt/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nBulawayo-based 10-year-old model, Nomqhele Nikita Mdlauzo is seeking financial assistance to travel to Egypt, where she is set to represent Zimbabwe and Africa at the Miss Little World pageant.\n\nNomqhele, a learner at Robert Tredgold Primary School, earned the honour after being crowned Miss Little Africa Zimbabwe at a competition held in Harare last year. She also emerged as a Top Model, securing her place on the international stage.\n\nHer mother, Nomagugu Mdlauzo, is now appealing for help with air tickets, visas and attire to ensure her daughter can compete.\n\nIm appealing to the people of Zimbabwe to assist us with air tickets, a visa and the necessary outfits. As a minor, Nomqhele must be accompanied, and Id be grateful for any assistance to help her represent our country, she said.\n\nNomqhele expressed excitement about the opportunity and called for sponsorship to cover her travel and competition needs.\n\nIm grateful for this chance to represent Zimbabwe on a global platform. Im excited and kindly ask for sponsorship to help cover my travel costs and modelling attire, she said.\n\nThe Miss Little World pageant taking place from April 12-19 serves as a platform for children from diverse backgrounds to come together, promoting cultural appreciation, understanding and respect.\n\nBeyond modelling, Nomqhele is dedicated to environmental conservation. She leads a tree-planting initiative in Sauerstown, where she has planted over 5 000 indigenous trees.\n\nHer efforts extend to schools and hospitals, where she continues to plant trees to promote sustainability.\n\nThose willing to assist can reach out to Mdlauzo for more details.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ffghghhj-ghi0gu9.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com Bulawayo-based 10-year-old model, Nomqhele Nikita Mdlauzo is seeking financial assistance to travel to Egypt, where she is set to represent Zimbabwe and Africa at the Miss Little World pageant.  Nomqhele, a learner at Robert Tredgold Primary School, earned the honour after being crowned Miss Little Africa Zimbabwe at a competition held in Harare […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "BCC pulls plug on US$60m Egodini deal",
            "url": "https://www.chronicle.co.zw/bcc-pulls-plug-on-us60m-egodini-deal/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Bulawayo City Council (BCC) has resolved to terminate Terracotta Trading Private Limiteds US$60 million Egodini Redevelopment Project citing prolonged implementation failure as only 11 percent of works have been done since the signing of the deal in 2015.\n\nThe South African contractor won the tender to redevelop Egodini 10 years ago culminating in the closure of the Basch Street Bus Rank and the relocation of vendors in 2016.\n\nThe closure of Egodini has been blamed for the congestion in the citys central business district and chaos caused by illegal taxi operators and unregistered traders.\n\nWhile a section of Egodini was re-opened last year, this has failed to arrest the situation as more public transporters resist using the facility citing business viability concerns, amid stiff competition with illegal operators who intercept passengers from undesignated points in the city centre.\n\nCouncil and key stakeholders have expressed frustration over the lack of substantial progress in the development of the project.\n\nThis has prompted the local authority to seek to cancel the lease agreement with the contractor, which was signed on October 5, 2015, forthe upgrading of the Egodini into a modern transport hub and shopping mall.\n\nThe tenant, Terracotta, was expected to develop properties on the basis proposed in their tender submission at a cost of sixty (60) million United States dollars sometime in 2023.\n\nCouncil issued a warning for notice to terminate the contract due to the non-performance of the contractor, Terracotta, who had been on site for a period spanning nine years, said the council in its latest minutes issued yesterday.\n\nThere was no development by then besides advance preparatory works and demolishing.\n\nThe council said after issuing the warning Terracotta moved in towork on the taxi rank portion of the redevelopment, termed Phase 1A leading to BCC cancelling the notice to terminate. It said this led to the rank being commissioned last year in January, with the contractor committing to proceed with the works and move to phase 1B.\n\nThe developer, however, abandoned the site in February 2024 with works reaching an abrupt stop. There were still development adjustments to be undertaken by the contractor to efficiently operationalise phase 1A, and these had remained unattended to by the contractor, which was primarily the public transport taxi rank and 400 vending bays, said the local authority.\n\nThe project remained at 11 percent as there had been no work at all.\n\nDespite efforts made to communicate with Terracotta on the non-activity at the site and adherence to contractual obligations, council said the contractor has not responded.\n\nThe local authority said it was then forced to issue a second termination of notice, which still stands to date.\n\nThese issues had been deemed as operational issues, which would not warrant the contractor to abandon the site. The contractor was still adamant to return to the site leaving council with no option but to re-issue the Notice of Termination to Terracotta Trading (Pvt) Ltd, said the local authority.\n\nDuring the month of December 2024, the department proceeded to request the legal office to start processes for the issuance of the termination notice.\n\nAccording to council, the contractor had submitted drawings for Phase 1B, which include the bus rank, fuel station, extension of the taxi rank and some anchor shops, and the department reviewed these and issued comments for Terracotta to attend to.\n\nThe notice to cancel the Lease Agreement had since been issued to the developer, Terracotta Trading (Pvt) Ltd, said the city council.\n\nMeanwhile, during the discussion councillors requested that information be shared pertaining to the project in order for them to be able to respond to residents accordingly. One of the councillors further suggested that a meeting should be held between councillors and Terracotta.\n\nIn response, the Town Clerk Mr Christopher Dube advised that a notice to cancel the lease agreement had been issued according to the conditions of the agreement.\n\nTerracotta is part of the 14 companies that had tendered to redevelop Egodini but has failed to get the project rolling leaving the city congested.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dfavdscccxz.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE Bulawayo City Council (BCC) has resolved to terminate Terracotta Trading Private Limited’s US$60 million Egodini Redevelopment Project citing prolonged implementation failure as only 11 percent of works have been done since the signing of the deal in 2015. The South African contractor won the tender to redevelop Egodini 10 years ago culminating […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        },
        {
            "title": "Miss Teen Zimbabwe announces casting dates",
            "url": "https://www.chronicle.co.zw/miss-teen-zimbabwe-announces-casting-dates/",
            "content": "Mbulelo Mpofu,m[emailprotected]\n\nThe Miss Teen of the Universe Zimbabwe (MTOUZ) pageant has announced provincial casting dates ahead of the crowning of this years beauty queen, who will represent Zimbabwe in India. Last year, the reigning queen, Victoria Ncube, shone on the international stage.\n\nDuring a press conference held at its Bulawayo offices on Monday, MTOUZ national director Mthokozisi Philip Masuku outlined the organisations vision for 2025, promising an enhanced and more competitive pageant.\n\nThis year, we aim to elevate the pageant to new heights, which is reflected in our theme: Empowering the Girl Child  Promoting Culture and Heritage Towards Vision 2030, said Masuku.\n\nOur goal is to empower young girls in alignment with the Governments vision for the youth.\n\nMasuku also announced the provincial casting dates, which will be overseen by the respective provincial heads.\n\nThe schedule is as follows:\n\nMidlands February 8, Bulawayo February 15, Matabeleland South March 2, Mashonaland March 1 (virtual castings), Masvingo March 8, Harare March 15, Matabeleland North March 15 and Manicaland March 8.\n\nThe MTOUZ director said that each province will be represented by four contestants of which the top 20 will go to boot camp with their parents or guardians.\n\nMasuku also made a heartfelt appeal for financial assistance.\n\nFor this pageant, we need financial support, and we appeal to well-wishers and corporate sponsors to lend a hand in making young models dreams come true, he said.\n\nThe pageants Bulawayo provincial head, Zanele Moyo, expressed confidence in the citys strong representation in this years competition.\n\nAs the provincial head, I can confidently say that Bulawayo is buzzing with anticipation. Were ready to showcase the best of our raw, grassroots talent on a platform that gives young people the chance to shine, take centre stage, and show the world what theyre made of.\n\nOur city has always been a hub of creativity, innovation, and passion. This year, were ready to take up space, make our mark on the national stage and prove that Bulawayo is more than just a city  its a movement, a force to be reckoned with, and a hotbed of talent just waiting to be unleashed. So, getready, Zimbabwe  Bulawayo is coming for you!, she declared.\n\nLast year, Victoria Ncube made history when she was crowned Miss Teen of the Universe Africa and awarded Miss Photogenic at the Miss Teen of the Universe pageant in Rajasthan, India.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dsadfszxccsaxzc.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com  The Miss Teen of the Universe Zimbabwe (MTOUZ) pageant has announced provincial casting dates ahead of the crowning of this year’s beauty queen, who will represent Zimbabwe in India. Last year, the reigning queen, Victoria Ncube, shone on the international stage. During a press conference held at its Bulawayo offices on Monday, MTOUZ […]",
            "time": "06:09",
            "date": "06 Feb 2025"
        }
    ]
}