{
    "news": [
        {
            "title": "7 more firms for Victoria Falls Road rehab",
            "url": "https://www.chronicle.co.zw/7-more-firms-for-victoria-falls-road-rehab/",
            "content": "Sikhumbuzo Moyo\n\nGOVERNMENT has engaged seven more companies to work on the rehabilitation of the Bulawayo-Victoria Falls Road.\n\nThe seven companies join Bitumen World, which was initially awarded the tender to work on the 435km road that leads to the countrys premier tourism destination.\n\nUnder the new arrangement, which is similar to what is happening on the Harare-Beitbridge Road where different companies were engaged to rehabilitate the road, each company will work on a 51km stretch.Speaking in an interview after commissioning the 230-metre long Somgolo Bridge in Lupanda Village, Lupane District on Friday, Minister of State for Matabeleland North Provincial Affairs and Devolution, Richard Moyo, said the companies engaged to work on the Bulawayo-Victoria Falls Road were supposed to start work last week but were delayed by administrative issues that were still being addressed.\n\nCabinet agreed to engage seven more contractors to join Bitumen World and each company will rehabilitate a 51km stretch, said Minister Moyo.\n\nMinister Richard Moyo\n\nHe said the contractors will not be doing pothole patching but will completely overhaul the badly damaged road. Motorists who previously took about five hours to travel from Bulawayo to Victoria Falls are now taking eight hours or more.\n\nThis busy highway is now in a very bad state partly because of the increased number of haulage trucks and the incessant rains.\n\nWork was supposed to start on April 3 but administrative issues delayed the programme, said Minister Moyo.\n\nDeveloping a sound transport infrastructure is key to achieving the nations vision of an upper middle-income economy by 2030.\n\nPresident Mnangagwa has already outlined the key infrastructural projects that his Government will undertake this year, which include the construction of roads and dams.\n\nThe Beitbridge-Bulawayo-Victoria Falls Road is one of the key priority projects given its economic impact as it connects local businesses with Southern African countries such as Zambia, DRC and South Africa.\n\nThe route is also a strategic access point to the countrys tourist destinations such as the Hwange National Park and Victoria Falls.\n\nSome sections of the highway are now littered with potholes, making it difficult for motorists to navigate.The Government has said the permanent solution to fixing the Beitbridge-Bulawayo-Victoria Falls Highway is to do a complete reconstruction like what is being done on the Harare- Beitbridge Road.\n\nInformation, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere\n\nLast October, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said Cabinet had considered and adopted the proposed Public-Private Partnership between Government and Bitumen World for the immediate rebuilding of the Beitbridge-Bulawayo-Victoria Falls Road.\n\nThe Second Republic, under President Mnangagwa, has continued to prioritise infrastructure development countrywide under the Emergency Road Rehabilitation Programme (ERRP2) and various other initiatives, which have transformed the economy as well as creating employment.\n\nThe Second Republic has invested significantly in infrastructure development as a key enabler to economic transformation despite limited access to external lines of credit.\n\nSo far, more than 50 000km of roads have been rehabilitated, while 2 000 structures have been attended to since the start of the ERRP2 in 2021.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-13-at-21.25.11-2.jpeg",
            "description": "Sikhumbuzo Moyo GOVERNMENT has engaged seven more companies to work on the rehabilitation of the Bulawayo-Victoria Falls Road. The seven companies join Bitumen World, which was initially awarded the tender to work on the 435km road that leads to the country’s premier tourism destination. Under the new arrangement, which is similar to what is happening […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "Hundreds commemorate Palm Sunday",
            "url": "https://www.chronicle.co.zw/hundreds-commemorate-palm-sunday/",
            "content": "Peter Matika/Faith Ndlovu/Sikhulekelani Moyo, Chronicle Writers\n\nHUNDREDS of Christian congregates yesterday conducted street marches in Bulawayo and other parts of the country to commemorate Palm Sunday, marking the commencement of the Holy week ahead of this weeks Easter Holidays, which begin on Friday.\n\nThe event holds great importance on the Christian calendar and signifies Jesus historic triumphal entry into Jerusalem ahead of his crucifixion on Friday.\n\nPalm Sunday, which falls on the last Sunday before Easter, is recognised by Christians as the mark of the beginning of the painful journey to the cross where Jesus Christ was crucified.\n\nIt is characterised by long processions in which believers wave palm branches singing victory songs as they mark the beginning of the sacred week, which culminates into the Easter holiday.\n\nSt Marys Cathedral Basilica members march during a Palm Sunday procession in Bulawayo yesterday\n\nArchbishop Alex Thomas of the Roman Catholic Archdiocese of Bulawayo, who led the march for his congregation in the city centre, said Palm Sunday was part of the holy week, which is being commemorated until Good Friday.\n\nHe said Palm Sunday was the day when Christians recall the triumphal entry of Jesus into Jerusalem before He suffered death and resurrection. Several similar processions were conducted across the city led by respective church leaders.\n\nWhen Jesus entered the city of Jerusalem, people went out voluntarily to welcome him as their King, paving the way with the holy branches welcoming the King and the Lord. So, we are doing this in commemoration of that, said Archbishop Thomas.\n\nFollowing this, we have so many other days we celebrate. On Tuesday we have what we call the Chrism Mass, where the bishop blesses the holy oils. There are three oils that we use in the Church, the oils of the sick, the oil of the catechumens, and the holy chrism oil. These are blessed once a year together with all the people. On Holy Thursday, we celebrate the Passover meal, the last supper of Jesus with his disciples and washing of the feet by Jesus.\n\nArchbishop Thomas said Jesus washed the feet of his disciples as a demonstration of humility.On Good Friday, he said they commemorate the passion, crucifixion, and death of Jesus, which is called the Passion Service or the veneration of the cross.\n\nOn Holy Saturday, there is the commemoration of the vigil Easter where people will be waiting for the resurrection of Jesus, and on Easter Sunday people celebrate the resurrection of Jesus, he said.In preparation for this holy week and Easter, in Catholic, there is what we call 40 days of Lent, that we begin with Ash Wednesday. During those 40 days, we have three main pillars, that is, prayer, fasting, and alms-giving, so we have been preparing ourselves for this.\n\nProphetess Penlop Zulu of the Royal Priesthood Solution Ministries said Palm Sunday was a Christian feast that falls on the Sunday before Easter.\n\nAs Royal Priesthood Solution Ministries, we have celebrated Palm Sunday today with a march from 4th Avenue and Joshua Nkomo Street until 23rd Avenue where our church is located with an escort of police, she said.\n\nOur crowd was above 500 as we were singing and waving palm leaves in honour of Jesus Christ.This brings reflection on the lent, which is a week when Jesus was crucified. It was like a Jericho march, as the crowd said whatever land you will step you shall possess.\n\nA Catholic congregant, Ms Bridgt Mhare, said: Palm Sunday marks the beginning of holy week and commemorates Jesus Christs triumphant entry into Jerusalem.\n\nCrowds welcomed him by laying palm branches in his path symbolising victory and honour. As we hold our blessed palms, we remember the joy of welcoming Christ into our lives, she said.\n\nSeveral churches are also finalising preparations for Easter Holidays where large gatherings, spiritual reflections and commemorative services are expected to draw thousands of worshippers across the country.\n\nUnited Congregational Church of Southern Africa (UCCSA), through its Zimbabwe Synod, has also lined up a series of spiritual and cultural observances.\n\nOur Easter preparation includes Lent fasting, Holy Week services and commemorations on Palm Sunday, Maundy Thursday, Good Friday and Easter Sunday, said the church leader, Reverend Sikhalo Cele.\n\nWe welcome all who will join us at various locations nationwide, including our Synod headquarters in Bulawayo.\n\nBishop Michael Dube of the Evangelical Lutheran Church in Zimbabwe (ELCZ) said Easter celebrations in the Western Diocese will take place across several suburbs in Bulawayo, including Njube, Mzilikazi, Tshabalala and Emganwini.\n\nOur Southern Deanery, covering 16 parishes in Matabeleland South, will congregate at Zezani Mission. The programme starts on Maundy Thursday with the washing of disciples feet and continues with Holy Communion until Sunday, he said.\n\nThis years Easter has added significance for the Apostolic Faith Church of Southern and Central Africa, which is celebrating its 70th anniversary.\n\nEaster is a time of reflection, prayer and unity. Our preparations include revival services, fasting and organising regional camp meetings, said Reverend Philisani Maphosa, pastor in charge of the Bulawayo branch.\n\nThe churchs Easter camp meeting will coincide with its 70th anniversary celebrations at its headquarters in Nhlozamandla Mabindisa Village, Esiphezini, Umguza District\n\nOur Easter tradition includes large gatherings, evangelistic services, choir presentations, and fellowship. This year is significant as we celebrate 70 years since the founding of our church in April 1955 by the late Reverend Morgan Sengwayo, said Rev Maphosa.\n\nWe expect a spirit-filled atmosphere of worship and gratitude, not just here in Zimbabwe but also in Zambia, Malawi, South Africa and Mozambique as we commemorate this remarkable milestone.Harvest House International Church leader, Bishop Collin Nyathi, said while they do not hold special conferences over Easter, the focal point is Resurrection Sunday.\n\nThats where we preach about the death, burial and resurrection of Jesus Christ. All other celebrations are appreciated, but the core is the remembrance of Christ, he said.\n\nAlthough not linked directly to Easter, the church will host a mens and womens conference this Sunday, which is part of their annual calendar. Bishop Nyathi said each of their churches will hold their services in the auditoriums.\n\nPresident of the Council of Churches in Africa (CCA), Bishop Dr Rocky Moyo, called for discipline among congregants travelling for Easter retreats.\n\nMeanwhile, national police spokesperson Commissioner Paul Nyathi has called on religious leaders and congregants to work closely with law enforcement to ensure peaceful and secure gatherings.\n\nThe public is urged to cooperate with police during the Independence and Easter holidays. We will be conducting crime and road safety awareness campaigns across the country, he said.\n\nComm Nyathi said roadblocks will be set up, unroadworthy vehicles will be impounded while drivers are urged to observe traffic rules and regulations.\n\nHe said drivers should avoid speeding and refrain from driving under the influence.\n\nPublic service vehicle operators must not carry excess passengers and must ensure their vehicles are roadworthy. We are appealing to the public not to leave their homes unattended, and those travelling for extended periods are encouraged to use our house under supervision scheme, he said.\n\nComm Nyathi urged members of the public to plan their journeys on time and avoid boarding vehicles, which are not registered to carry passengers.\n\nThe public is also advised to be alert on boarding public service vehicles and avoid boarding private vehicles as some have been attacked and robbed of their valuables by armed gangs. We encourage the public to be security conscious as they walk through maize fields, grassy and bushy areas, he said.If possible, they should avoid these dangerous spots as some criminals are taking advantage to hide and then pounce on unsuspecting passers-by.\n\nComm Nyathi said police patrols would be intensified in all major cities, farming areas and growth points.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-13-at-21.25.11-6.jpeg",
            "description": "Peter Matika/Faith Ndlovu/Sikhulekelani Moyo, Chronicle Writers HUNDREDS of Christian congregates yesterday conducted street marches in Bulawayo and other parts of the country to commemorate Palm Sunday, marking the commencement of the “Holy week” ahead of this week’s Easter Holidays, which begin on Friday. The event holds great importance on the Christian calendar and signifies Jesus’ […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "400+ village, school business units set up under rural development programme",
            "url": "https://www.chronicle.co.zw/400-village-school-business-units-set-up-under-rural-development-programme/",
            "content": "Patrick Chitumba, Midlands Bureau\n\nMore than 400 village and school business units have been established nationwide under the Presidential Rural Development Programme.\n\nLaunched in 2021, the initiative aims to stimulate economic growth and improve livelihoods in rural areas across the country.\n\nCentral to the programme is the creation of agricultural value chains by promoting horticulture, aquaculture and livestock farming, all meant to boost rural industrialisation.\n\nEach of the countrys 35 000 villages is set to receive a solar-powered borehole, ensuring year-round access to water.\n\nAdditionally, every village is expected to establish a fully registered company, providing members with the opportunity to earn a monthly income.\n\nThe Zimbabwe National Water Authority (Zinwa) is the lead implementing agency for this transformative programme. Zinwa is also responsible for spearheading the establishment of business units at schools and vocational training centres.\n\nZimbabwe National Water Authority (Zinwa)\n\nAccording to Zinwa Corporate Communications Manager, Mrs Marjorie Munyonga, the programme encompasses the facilitation of sustainable development projects in line with the Governments vision for rural transformation.\n\nSince the launch of the programme in 2021, over 400 village, school and youth business units have been established across the country while over 100 000 households now have access to clean and safe drinking water, she said.\n\nThe village business units are now supplying agricultural produce to supermarkets, boarding schools, and business centres.\n\nUnder the Presidential Rural Development Programme, the Government intends to drill a borehole for each of the countrys 35 000 villages, a borehole for each of the countrys 9600 schools and a borehole for each of the 4 500 vocational training and youth centres, Mrs Munyonga said.\n\nThe solar-powered boreholes will each have 10 000-litre water storage tank and each village will have 1-hectare under drip irrigation, two fishponds and a communal water point.\n\nZinwa is responsible for infrastructure development while the Agricultural Rural Development Authority manages the day-to-day operations of the business units.\n\nThe Agricultural Marketing Authority secures markets for the farmers produce and the Agricultural Finance Corporation provides funding with beneficiaries serving as both employees and shareholders.Some communities that have benefitted from the programme are already realising earnings as high as US$3000 in dividends per year and as much as US$50 in monthly payouts.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Zinwa-spokesperson-Mrs-Marjorie-Munyonga.jpg",
            "description": "Patrick Chitumba, Midlands Bureau More than 400 village and school business units have been established nationwide under the Presidential Rural Development Programme. Launched in 2021, the initiative aims to stimulate economic growth and improve livelihoods in rural areas across the country. Central to the programme is the creation of agricultural value chains by promoting horticulture, […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "Goat Pass-on Scheme to boost livestock genetics in Matabeleland South",
            "url": "https://www.chronicle.co.zw/goat-pass-on-scheme-to-boost-livestock-genetics-in-matabeleland-south/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTWENTY-one farmer field schools from Matabeleland South Province will benefit from the Goat Pass-on Scheme, which was officially launched by Government on Friday in Esigodini to help boost small stock genetics and improve incomes.\n\nSix farmer field schools goat breeders received cross Red Kalahari and Matabele breed bucks during the launch event at Esigodini Agricultural College innovation centre. The facility was established last year under the Green Climate Fund (GCF) project. Other farmer field schools will receive breed bucks soon.\n\nThe innovation centre has a feed analysis laboratory and a goat housing station aimed at improving animal health and nutrition through advanced nutritional content analysis of farm-produced fodder.The Matabele breed is known for its adaptive ability to low plain nutrition, harsh weather conditions and medium to large body frame, low maintenance costs and good mothering ability.\n\nThe Kalahari Red goats are characterised by a large body frame, adaptive to dry environments, large carcass weight, quality carcass and twinning ability.\n\nDeputy Minister Davis Marapira hands over bucks to farmers during the launch of a goat pass on scheme at Esigodini Agricultural College\n\nFarmers who spoke to the Zimpapers news crew on site said the development marks a shift in their goat breeding projects.\n\nOne of the lead farmers, Ms Sikhumbulile Dube, from Umzingwane District said the project was expected to transform their lives.\n\nThis buck will go a long way in improving our breed and growing our herd. The ratio for each buck is 1:25 for each breeding season meaning that we dont expect less than 25 kids from females that will mate with this buck, she said.\n\nThe number can go up because some females can have twins. This means more money coming into our pockets because we will have an improved breed of goats. Instead of selling a goat at US$50, a Kalahari- Matabele cross can be sold at US$150.\n\nMr Ndabezinhle Moyo from Thuthuka Godlwayo Farmer Field School in Insiza said the project has come in handy.\n\nDeputy Minister Davis Marapira hands over bucks to farmers during the launch of a goat pass on scheme at Esigodini Agricultural College\n\nMs Sarah Nyoni from Asiqhubekeni Farmer Field School in Gwanda said they have already prepared proper housing for their goats in preparation for the bucks.\n\nDeputy Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Davis Marapira, said the pass on scheme will help uplift rural livelihoods, promote climate resilience and empower communities through sustainable livestock production.\n\nThe innovation platform here at Esigodini Agricultural College plays a vital role in connecting research, policy and practice, he said.\n\nIt brings together farmers, scientists, extension officers, financial institutions and other stakeholders to co-create solutions that address real challenges in the agricultural sector.\n\nThe goat pass-on scheme is one such innovation, rooted in local knowledge and supported by evidence-based strategies to ensure sustainability, said Deputy Minister Marapira.\n\nGoats are more than just livestock as they are a lifeline for many rural households  providing meat, milk, income, and organic manure for soil fertility. They are also an entry point for empowering women and youth, who are often the primary caregivers and managers of small livestock.\n\nThrough this pass-on scheme, he said Government was not just giving goats but passing on dignity, resilience and opportunity.\n\nDeputy Minister Marapira commended the institution for making a significant progress under the project and urged farmers that have benefited to implement all the skills they have acquired in goat breeding.\n\nEsigodini Agricultural College focal person for the Green Climate Fund programme, who is also animal science lecturer, Mr Zibusiso Nxumalo, said the college has also established a fodder and forage garden to address goat nutrition.\n\nForage crops under production include maize, sorghum, legumes, fodder trees, bush meal and palatable grass.\n\nThe college has also conducted an outreach programme where farmers have been trained on management of goats such as health, housing and handling facilities, feeds and feed management.The institution is working with 21 farmer field schools in Umzingwane, Insiza and Gwanda.\n\nThrough training, mentorship, and scientific feed analysis, the initiative is set to improve livestock farming practices, ultimately contributing to food security and economic growth.\n\nThe innovation platform was established under the Building Climate Resilience of Vulnerable Agricultural Livelihoods in Southern Zimbabwe and funded by Green Climate Fund.\n\nIt seeks to empower communities by providing resources, training and support to mitigate climate change effects.\n\nThe programme is being implemented by Government with technical and management support from the United Nations Development Programme (UNDP).  @DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gt4y67u.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw TWENTY-one farmer field schools from Matabeleland South Province will benefit from the Goat Pass-on Scheme, which was officially launched by Government on Friday in Esigodini to help boost small stock genetics and improve incomes. Six farmer field schools goat breeders received cross Red Kalahari and Matabele breed bucks during the launch event […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "TSL concludes US$25million Nampak takeover deal",
            "url": "https://www.chronicle.co.zw/tsl-concludes-us25million-nampak-takeover-deal/",
            "content": "Business Writer\n\nNampak Zimbabwe Limited last week announced the completion of the sale of a 51,43 percent stake, in the company, to TSL Limited in a landmark transaction valued at US$25 million, marking a significant shift in the countrys packaging industry.\n\nThe announcement follows a cautionary statement issued earlier last week by Nampak Zimbabwes Company Secretary, Mrs Sheila Lorimer, advising shareholders and the investing public about the conclusion of a sale and purchase agreement between Nampak Southern Africa Holdings Limited and TSL Limited.\n\nMrs Lorimer wrote to shareholders, Further to the cautionary announcement dated March 17, 2025, regarding the proposed disposal of a 51,43 percent shareholding in the Company by Nampak Southern Africa Holdings Limited (the Seller), shareholders and the investing public are advised that the Seller and TSL Limited (the Purchaser) have concluded a sale and purchase agreement in respect of the sale, which agreement remains subject to various suspensive conditions.\n\nHowever, since the deal is subject to various suspensive conditions, Nampak urged stakeholders to exercise caution until a full announcement is made regarding the implementation of the disposal.Accordingly, shareholders and the investing public are urged to continue to exercise caution when dealing in the companys securities until a full announcement is made regarding the implementation of the disposal, she concluded.\n\nNampak Zimbabwe, a leading manufacturer of packaging materials serving diverse industries in Zimbabwe and Southern Africa, aims to enhance operational efficiency and accelerate growth through this strategic sale.\n\nTSL Limited, a diversified holding company with interests spanning tobacco auctioning, agricultural inputs, and now packaging, sees the acquisition as an opportunity to consolidate its market position and streamline production processes.\n\nThis acquisition represents a strategic alignment of resources, explained Tinashe Haparari, an equities analyst. It underscores their commitment to enhancing operational efficiency and accelerating growth within the packaging industry.\n\nAnalysts have expressed optimism about the acquisitions potential impact on TSL Limiteds market strategy.\n\nThrough integrating Nampak Zimbabwes packaging capabilities, TSL aims to streamline production processes and achieve significant cost savings, remarked Justin Fusire, an analyst at Eagle Investments. This move could potentially strengthen TSLs competitive edge in the market.\n\nThe US$25 million acquisition price is earmarked for expanding Nampak Zimbabwes local operations and completing stalled projects, including the acquisition of an eight-colour printer for self-opening paper bags from Bullpak.\n\nThis investment is expected to modernise production facilities and enhance Nampak Zimbabwes market competitiveness in the packaging industry.\n\nThis strategic acquisition by TSL Limited is expected to inject fresh momentum into Nampak Zimbabwes growth trajectory, noted Grace Mukoko, a senior analyst at Capital Insight Partners.The capital infusion will support modernisation efforts and enable Nampak Zimbabwe to capitalise on emerging market opportunities.\n\nThe acquisition process remains contingent upon regulatory approvals and the fulfilment of suspensive conditions. Both Nampak Zimbabwe and TSL Limited have urged shareholders and stakeholders to exercise caution until the transaction is formally completed.\n\nOnce finalised, TSL Limited will extend a mandatory offer to the remaining shareholders of Nampak Zimbabwe in compliance with regulatory requirements.\n\nWith the local economic landscape continuing to evolve, the acquisition of Nampak Zimbabwe by TSL Limited marks a significant milestone for both companies and the packaging industry.\n\nIndustry observers anticipate a transformative impact, expecting the merger to reshape Zimbabwes packaging manufacturing sector and bolster economic prospects.\n\nFor stakeholders, the impending union between Nampak Zimbabwe and TSL Limited represents not just a strategic acquisition but a pivotal moment in shaping the future of packaging manufacturing in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/Nampak.jpg",
            "description": "Business Writer Nampak Zimbabwe Limited last week announced the completion of the sale of a 51,43 percent stake, in the company, to TSL Limited in a landmark transaction valued at US$25 million, marking a significant shift in the country’s packaging industry. The announcement follows a cautionary statement issued earlier last week by Nampak Zimbabwe’s Company […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "Bosso dig deep to down CAPS",
            "url": "https://www.chronicle.co.zw/bosso-dig-deep-to-down-caps/",
            "content": "Innocent Kurira at Barbourfields Stadium\n\nHighlanders 1-0 CAPS United\n\nHIGHLANDERS brought back the smiles to their faithful at Barbourfields yesterday, holding off a determined but blunt CAPS United to record a tense 1-0 victory  and with it, ease growing pressure after a patchy run of form.\n\nIt wasnt a polished performance from Bosso. It didnt need to be. What mattered was the result  and after a frustrating goalless draw in their last outing and rumblings of concern among the fans, this gritty win brought a much-needed sense of direction and relief.\n\nAn early goal from Reason Sibanda proved the difference on an afternoon where Highlanders had to dig deep, defend with purpose, and trust their structure to see out a tense contest in the Battle of the Cities.Sibanda struck just two minutes in, finishing off a well-weighted through ball from Brighton Ncube with precision to beat CAPS goalkeeper Harmony Nare at the near post. The move was swift, the execution calm  and crucially, it gave Bosso control before the game could settle into a rhythm.\n\nIt wasnt just the three points that mattered  it was the timing. Bosso had gone into the match under pressure to prove that their promising flashes this season could translate into consistency. And against a CAPS United side desperate to revive their own season, Highlanders stood tall.\n\nIt was not an easy game. CAPS havent been winning, and they were fighting hard to change that, said Highlanders head coach Kelvin Kaindu.\n\nBosso coach, Kelvin Kaindu\n\nWe had to match that energy. We got the early goal, which gave us the platform, and from there, it was about character. These are the wins that build a team.\n\nIndeed, it was a victory that spoke more of resilience than rhythm.\n\nHighlanders had their moments in the first-half to widen the margin. Prince Ndlovu wasted a golden opportunity just minutes after the opener when he chose to shoot instead of passing to the unmarked Ncube. In the second-half, Hubert Ncube went for glory in stoppage time instead of squaring the ball to Nigel Banda  another missed chance to close the door early.\n\nBut this time, Bosso were not punished for profligacy.\n\nInstead, their defence stood firm. Melikhaya Ncube, wearing the armband in Andrew Mbebas absence, led by example at the back. New man between the posts, Reward Muza, marked his first start with a composed display and a brilliant double save midway through the second-half.\n\nThe defensive line, featuring Arthur Ndlovu, Luckmore Mutumbi and Talent Dube, had to weather heavy pressure from CAPS United, especially after the break. The visitors threw everything forward and even thought they had equalised when Love Mabialas header appeared to cross the line  but the officials waved play on.\n\nThose are the moments that test your mental strength, Kaindu added. But we stayed organised, we didnt panic. Weve been working on our defensive structure and Im proud of how the boys applied themselves today.\n\nThis win marked Highlanders second home victory of the season, adding to the 4-0 demolition of Kwekwe United a fortnight ago. But unlike that rout, this was a contest that demanded grit and steel  qualities Kaindu believes are just as vital in the long run.\n\nIt also reinforced Bossos ability to get results even when not at their best in possession. Brighton Ncube, though not as sharp as usual, still produced the telling pass for the opener. Malvern Hativagoni and Mason Mushore were industrious in midfield, while Prince Ndlovus energy on the flank kept CAPS on their toes.\n\nWhile the win might not silence all the questions about Highlanders attacking rhythm, it will calm nerves  especially in light of the clubs ambitions to remain in the upper tier of the standings and mount a meaningful campaign.\n\nThe only downside for Highlanders was the smaller crowd, a noticeable drop from the 13 000 that turned up for the Scottland derby two weeks ago. But those who came made their presence felt  especially in the final tense minutes, when CAPS United pushed for an equaliser and Bossos defence had to summon every ounce of focus to see the game through.\n\nThese fans are everything to us, Kaindu said. We feel it when the stadium is full, and even today, the voices helped carry the boys through. Its for them that we fight.\n\nAs the full-time whistle blew and the team huddled near the Soweto Stand in celebration, there was a sense  not of triumph  but of turning a corner. Bosso had passed a tough test, and now, perhaps, they can begin building something more sustained.\n\nTeamsHighlanders: Reward Muza (gk), Talent Dube (Brian Mlotshwa 63), Arthur Ndlovu, Melikhaya Ncube, Reason Sibanda (McKinnon Mushore 78), Prince Ndlovu (Hubert Ncube 63), Malvern Hativagoni, Brighton Ncube (Tendai Muvuti 78), Mason Mushore, Never Rauzhi, Luckmore Mutumbi.CAPS United: Harmony Nare (gk), Kelvin Mangiza, Kundai Benyu (Eric Manokore 65), Bruce Kangwa, Hastings Chapusha, Brighton Manhire, Phineas Bhamusi, Love Mabiala (Junior Bunjira 65), Tanaka Shandirwa, Juan Mutudza (Jayden Bakari 75), Joseph Mbollo.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-13-at-22.31.15-1.jpeg",
            "description": "Innocent Kurira at Barbourfields Stadium Highlanders 1-0 CAPS United HIGHLANDERS brought back the smiles to their faithful at Barbourfields yesterday, holding off a determined but blunt CAPS United to record a tense 1-0 victory — and with it, ease growing pressure after a patchy run of form. It wasn’t a polished performance from Bosso. It […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "COMMENT: Urgently avail funds for radiotherapy machines repair",
            "url": "https://www.chronicle.co.zw/comment-urgently-avail-funds-for-radiotherapy-machines-repair/",
            "content": "Government should urgently avail funds to repair radiotherapy machines at Mpilo Central Hospital in Bulawayo. All the radiotherapy machines at the this hospital which is not only the referral hospital for Bulawayo but also for Matabeleland North, Matabeleland South, Midlands and Masvingo provinces, are down.\n\nVice-President Kembo Mohadi was told this on Friday by Mpilo Central Hospital authorities who said the hospital was now referring cancer patients requiring radiotherapy to Parirenyatwa Group of Hospitals in Harare.\n\nAccording to the hospitals head of Radiotherapy Department, Dr Tatenda Chingonzoh, those referred to Parirenyatwa hospital have to wait for up to five months to be treated.\n\nMpilo Central Hospital\n\nVice-President Mohadi who said the obtaining situation at the hospital was unacceptable, directed Treasury to urgently address the problem.\n\nThis hospital is not offering radiotherapy and we cannot allow this as Government. People are dying every day because as a Government we cannot avail US$100000 required to repair these machines, said VP Mohadi.\n\nHe said cancer patients were spending a lot of money to seek treatment in countries such as South Africa, India and other countries. Dr Chingonzoh said 50 percent of the cancer patients the hospital was attending to require radiotherapy which the hospital was not offering because the machines are down.There is therefore an urgent need for Government to prioritise the repair of the machines as the lives of cancer patients are in danger. The worst affected are those already on treatment as interrupted treatment is more detrimental than not starting at all.\n\nAccording to health experts, when radiotherapy is used to attack cancer cells they tend to come back more aggressively once treatment is interrupted. Four women die of cervical cancer in Zimbabwe daily and the disease burden has been worsened by high HIV prevalence.\n\nThis is a very alarming figure and something must be done to bring the figure down.\n\nWhat this means is that about 120 women die of cervical cancer every month and more than 1400 every year. The failure by Mpilo Hospital to repair radiotherapy machines is a major stumbling block to fighting cancers. Many cancer patients from the southern region are probably dying at home because their referral hospital, Mpilo, cannot offer radiotherapy.\n\nWe want at this juncture to appeal to our health partners to assist Government to avail more radiotherapy machines. The radiotherapy treatment should be decentralised to district level so that many patients can access the services at reduced cost.\n\nAt present radiotherapy machines are only in Bulawayo and Harare and obviously the machines are overwhelmed by the numbers seeking treatment. Cancer is said to be overtaking HIV as the top killer so there is need to provide more resources to fight cancer compared to what the country is availing to fight HIV/Aids.\n\nFirst Lady Dr Auxillia Mnangagwa\n\nThe First Lady Dr Auxillia Mnangagwa has been on a crusade to educate women on cervical cancer and many women now appreciate the importance of being screened for cancer. What is disappointing is that those diagnosed with cancer are now failing to access treatment because the radiotherapy machines are too few.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Vice-President-Kembo-Mohadi.jpg",
            "description": "Government should urgently avail funds to repair radiotherapy machines at Mpilo Central Hospital in Bulawayo. All the radiotherapy machines at the this hospital which is not only the referral hospital for Bulawayo but also for Matabeleland North, Matabeleland South, Midlands and Masvingo provinces, are down. Vice-President Kembo Mohadi was told this on Friday by Mpilo […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "Meet S’kha Ngwenya, Zimbabwe’s youngest Nama winner",
            "url": "https://www.chronicle.co.zw/meet-skha-ngwenya-zimbabwes-youngest-nama-winner/",
            "content": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub\n\nTHE 23rd edition of the National Arts Merit Awards (Nama), held in Harare last month, will be remembered as a night where the youth took centre stage. From the captivating rendition of the national anthem by the Choice Childrens Choir to the triumph of preteen actor Sikhanyiso Skha Ngwenya, the event showcased the incredible talent of Zimbabwes younger generation.\n\nHailing from Victoria Falls, Skha made history by becoming arguably the youngest recipient of the Outstanding Actor award, thanks to his stellar performance in Rise, a film directed by Jessica Jessie Rowlands.\n\nYoung actor, Sikhanyiso Ngwenya at the NAMA event\n\nZimpapers arts tracked down the youngster, a Grade Five pupil at Chinotimba Primary School, nestled in Chinotimba suburb in the resort city.\n\nIn an interview, under the guidance of his mother, Rumbidzai Chikamhi, Skha said his acting career is motivated by his love for comedy, particularly Leon Schusters Mr Bones 2: Back from the Past, which features Zimbabwes film royalty, Tongayi Chirisa.\n\nYoung actor, Sikhanyiso Ngwenya with Jessica Rowlands\n\nI started acting in 2023, and I was inspired by Tongayi Chirisas role as Hekule the king of Kuvukiland in Leon Schusters movie, Mr Bones 2: Back from the Past. Rise was my first significant role and I was trained by Jessie who I learnt a lot from, he said.\n\nSkhas mother said his favourite subject at school is Mathematics because he likes numbers.As his parents, were very impressed and excited. Well give him all the support he needs to benefit from opportunities presented to him, she said.\n\nOn his Nama win, the youngster said: Im very happy to have won this accolade.Rise director Jessie praised Skha for his Nama win, saying he was a joy to work with when they were shooting the film despite having no prior acting experience.\n\nActor Sikhanyiso Ngwenya (centre) with Rise director, Jessica Rowlands (right)\n\nWhen I met him at Chinotimba Primary School during our first day of auditions in Victoria Falls, he had never acted before, Jessie said.\n\nBut the moment I saw him, I knew he was Rise, even before he auditioned. His demeanour, size and look were exactly how I had envisioned the character.\n\nShe said Skha proved to be a fast learner who took direction exceptionally well.\n\nMost importantly, he was truly acting. After one scene, when I said cut, I noticed his expression drop and his body language shift to relief. That told me he understood he was stepping in and out of a character  that he knew he was pretending to be someone else.\n\nActor Sikhanyiso Ngwenya (centre) with Rise director, Jessica Rowlands (right)\n\nJessie added that during conversations, Skha showed a deep understanding of the role.\n\nWe spoke about character development, and he was able to express who Rise was and how he might be feeling in different scenes. That level of awareness in someone so young was truly special.Skhas achievement at the Namas marked a significant milestone not only for his budding career but also for youth representation in Zimbabwean film.\n\nRecently, Victoria Falls has been the gift that keeps on giving, churning out young talent to the world. This comes after Mkhosana-based teenage singer, Andrea the Vocalist, captured the hearts of many, eventually landing collaborations with Aubrey Qwana and Dorcas Moyo from having his video going viral on social media singing at church.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/U76J7YU.jpg",
            "description": "Mbulelo Mpofu, Zimpapers Arts and Entertainment Hub THE 23rd edition of the National Arts Merit Awards (Nama), held in Harare last month, will be remembered as a night where the youth took centre stage. From the captivating rendition of the national anthem by the Choice Children’s Choir to the triumph of preteen actor Sikhanyiso “S’kha” […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "Peri-urban elderly struggle to access healthcare",
            "url": "https://www.chronicle.co.zw/peri-urban-elderly-struggle-to-access-healthcare/",
            "content": "Ashley Phiri,[emailprotected]\n\nFOR 83-year-old Christian Nyathi, from Robert Sinyoka Village on the outskirts of Bulawayo, accessing basic health services is a serious challenge.\n\nHe relies on a mobile clinic that visits the village once a month.\n\nThe nearest clinics are at Khami Maximum Prison and in Pumula East suburb.\n\nThis issue is not unique to him alone but affects over 300 other senior citizens residing in the peri-urban area, including Robert Sinyoka, Methodist Village and St Peters. Receiving timely medical care is difficult.\n\nWith painful joints and limited mobility due to age, Mr Nyathi and his peers endure in silence, further discouraged by the unavailability of required medications at the two nearby clinics.\n\nAs senior citizens in a peri-urban area, receiving timely medical assistance is very difficult. We cannot walk to a clinic at either Khami Maximum Prison or Pumula East suburb because many of us have painful legs now. Additionally, even if we manage to find money for transport and make it to the clinics, the medication we need is often not available, and we cannot afford to buy it on our own, said Mr Nyathi.\n\nFor many years, the mobile clinic primarily served children and adolescents, leaving elderly residents with little support for chronic non-communicable diseases such as hypertension, diabetes, arthritis, and dementia. However, two years ago, Island Hospice and Healthcare began providing essential medications to senior citizens from Methodist Village, Robert Sinyoka, and St Peters Village, marking a significant improvement in healthcare access.\n\nIsland Hospice and Healthcare not only supplied medications but also empowered the elderly economically by training them in Internal Savings and Lending Groups (ISALS) and educating them about their rights. This initiative is meant to help them build capital for small projects to improve their livelihoods. Their motto, Old enough to retire, young enough to enjoy, inspired many seniors to stay active and engaged.\n\nHowever, despair has spread among the senior citizens as Island Hospice announced the termination of its project, leaving many wondering how they will manage without these vital services.\n\nIsland Hospice had given us a lifeline; they were providing us with free medication in addition to various training that empowered us economically and socially. Now, we are wondering how we will survive going forward. Personally, I dont know where I will find the US$42 required for my medication every month, and I know Im not the only one, said 70-year-old Ms Margaret Moyo from Methodist Village.\n\nThe senior citizens voiced their concerns during the belated World Health Day commemorations, where they gathered to discuss the announcement.\n\nWith only two months worth of medication remaining, they are calling on other organisations to step in and continue the health programme.\n\nMany seniors who had not yet formed ISALS groups fear they will not have money to buy necessary medications.\n\nThe senior citizens also highlighted how the lack of other essential services such as access to water, negatively affects their health.\n\nWhen we commemorate World Health Day, we are not only focusing on diseases but also on the quality of life. Here, we face issues that affect our quality of life. We have a problem accessing water; there is water rationing, and as old people, we cant carry buckets to the community boreholes. Queuing for hours is exhausting for us; some of us cant even carry a gallon of water. We also struggle to access the right kind of food for a healthy diet due to droughts and unemployment, said Ms Julliet Bethule from St Peters Village.\n\nIsland Hospice Programmes Manager, Mr Nkosiphile Moyo, stated that the organisation has engaged the Ministry of Women Affairs, Community, Small and Medium Enterprises Development to ensure the continuity of the programme while encouraging more older persons to form ISALS groups to improve their livelihoods.\n\nOur programme had been ongoing for three years. We started this project to improve the quality of life for 5 000 older persons in Marondera and Bulawayo, specifically targeting those with life-threatening and life-limiting illnesses.\n\nWe also aimed to increase the income levels of 360 vulnerable older persons and their households to promote the development of age-friendly policies and practices at the community, provincial, and national levels, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/6yu6yu67u7.jpg",
            "description": "Ashley Phiri, ashleyphiri66@gmail.com FOR 83-year-old Christian Nyathi, from Robert Sinyoka Village on the outskirts of Bulawayo, accessing basic health services is a serious challenge. He relies on a mobile clinic that visits the village once a month. The nearest clinics are at Khami Maximum Prison and in Pumula East suburb. This issue is not unique […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        },
        {
            "title": "Stanbic Bank empowers SMEs with tailored solutions",
            "url": "https://www.chronicle.co.zw/stanbic-bank-empowers-smes-with-tailored-solutions/",
            "content": "Business Writer\n\nSTANBIC Bank Zimbabwe has strategically positioned itself to support Small to Medium Enterprises (SMEs) through purpose-built solutions, including its Africa-China Trade Agent Proposition, which connects local businesses with key suppliers in China while reducing trade-related risks.\n\nThe banks dedication to empowering Zimbabwean entrepreneurs was recently recognised when it was named Best Pan-African Bank for SMEs at the EMEA Finance African Banking Awards 2024.\n\nIn addition, Stanbic Bank won several accolades last year, including the ZNCC Financial Institution Supporting MSMEs Award  National Winner, and the Overall Winner SME Financial Services Award from the SME Service Excellence Awards Zimbabwe 2024.\n\nWere committed to supporting and leveraging the power of Zimbabwes SME sector. We understand that entrepreneurs dont just need a bank  they need a financial partner that evolves with them, said Head of Business and Commercial Banking at Stanbic Bank Mr Patson Mahatchi.\n\nMr Patson Mahatchi\n\nWe share our clients ambition to fuel growth across the continent by unlocking opportunities and providing solutions that reflect the real challenges SMEs face daily.\n\nThe EMEA Finance Awards recognise institutions that demonstrate excellence in a challenging macro-economic environment, with a strong emphasis on digital innovation and commitment to economic development.\n\nEarlier this year, Stanbic Bank partnered with The European Investment Bank (EIB Global) to launch a 20 million Euro credit facility, aimed at providing longer-term loans under favourable conditions to SMEs in Zimbabwe.\n\nLooking ahead, the bank has reaffirmed its commitment to expanding financial inclusion for under-served entrepreneurs and developing AI-powered business insights to support better decision-making in an increasingly competitive environment.\n\nSMEs across Africa remain key drivers of economic growth and innovation, despite facing notable challenges. These realities call for financial institutions to design bespoke solutions that cater to the evolving needs of entrepreneurs  from affordable banking services for start-ups to integrated payment systems for growing enterprises.\n\nAs part of its broader SME support strategy, Stanbic Bank has established an Incubator Hub, offering a collaborative space and structured programmes to foster entrepreneurial development. In addition, services such as Employee Value Banking, Digital Banking, Insurance, and Financial Planning provide personalised support to both individuals and businesses seeking to thrive in Zimbabwes dynamic economic landscape.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/05/pvvl.jpg",
            "description": "Business Writer STANBIC Bank Zimbabwe has strategically positioned itself to support Small to Medium Enterprises (SMEs) through purpose-built solutions, including its Africa-China Trade Agent Proposition, which connects local businesses with key suppliers in China while reducing trade-related risks. The bank’s dedication to empowering Zimbabwean entrepreneurs was recently recognised when it was named “Best Pan-African Bank […]",
            "time": "08:31",
            "date": "14 Apr 2025"
        }
    ]
}