{
    "news": [
        {
            "title": "Danica Studios unveils Kasongo Riddim to spotlight emerging talent",
            "url": "https://www.chronicle.co.zw/danica-studios-unveils-kasongo-riddim-to-spotlight-emerging-talent/",
            "content": "Mthabisi Tshuma [emailprotected]\n\nIn a move aimed at uncovering fresh talent, Victoria Falls-based Danica Studios has launched a new beat titled Kasongo Riddim.\n\nThe name Kasongo originates from a Zambian language, meaning warthog, an animal symbolising bravery. True to its name, the riddim invites artistes from Zimbabwe, Botswana, and Zambia to showcase their courage and creativity.\n\nLast year, Danica Studios released the Creative Actions2 Riddim, which celebrated and thanked Culture Fund Zimbabwe and the European Union Delegation to Zimbabwe for their support of local artistes through the Creative Actions2 funding initiative. This riddim was launched on Africa Day at Mfelandawonye Grounds in Victoria Falls and drew a crowd of over 3 000 people, supporting local artistes featured on the project.\n\nMuffia King, the director of Danica Studios, said the Kasongo Riddim aims to inspire artistes to persevere despite challenges.As Danica Studios, were encouraging artistes to be brave like the warthog, Kasongo, and to never give up on their dreams, regardless of the economic challenges or other hurdles they face in their musical journey, said Muffia King.\n\nThe Kasongo Riddim was composed by DJ Bruno and Tony Witness at Danica Studios. Recording has already begun, not only in Victoria Falls but also at various locations, including Hwange (Danica Studios branch), Bulawayo (T Flow Da Producer), Masvingo (Savil Music), Muruwa (Elevate 1 Studio), Harare (Lavaz of Oskid Productions), Zambia (Plush International), and Botswana (TK Swizz).\n\nMuffia King revealed plans to record over 100 artistes on the riddim, with a live launch event scheduled for next month in Victoria Falls.By February, Danica Studios aims to have recorded close to 100 artistes for the Kasongo Riddim in preparation for its official launch at Mfelandawonye Grounds in Victoria Falls.Over the years, we have built a reputation for discovering and nurturing talent while helping artistes and producers make a name for themselves, even before the Covid-19 pandemic. Weve organised shows for emerging artistes, giving them a platform to showcase their skills.Danica Studios has established strong relationships with other studios, promoters, radio stations, and influencers. As a label, weve consistently placed our province on the map and continue to raise the bar, added Muffia King.  Follow Mthabisi Tshuma on X:@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Da-Grooveman-hty678.jpg",
            "description": "Mthabisi Tshuma – revmmthiretshuma@gmail.com In a move aimed at uncovering fresh talent, Victoria Falls-based Danica Studios has launched a new beat titled Kasongo Riddim. The name Kasongo originates from a Zambian language, meaning “warthog”, an animal symbolising bravery. True to its name, the riddim invites artistes from Zimbabwe, Botswana, and Zambia to showcase their courage […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "DJ Jabs, Da Grooveman to drop 12-track album",
            "url": "https://www.chronicle.co.zw/dj-jabs-da-grooveman-to-drop-12-track-album/",
            "content": "Mthabisi Tshuma [emailprotected]\n\nSOUTH Africa-based producer DJ Jabs and Da Grooveman are set to release their 12-track album, House Always Wins, on Friday. The album features a diverse collection of tracks, including Sofa Silahlane featuring Bara, Konke Kuzolunga, Pfugama Unamate, Amany featuring Ntu2kay and Vuyo Brown, Mota featuring MJ Sings, Batidzai Mwenje, U Dokotela featuring Butholezwe, Uyu Ndiye  DJ Jabs & Da Grooveman and Ndikaita Mari\n\nSpeaking about the project, DJ Jabs described it as a collaborative effort brewed in the City of Kings and Queens (Bulawayo).Tomorrow is the big day when the album will be available for streaming, downloads, and on radio. Were also working on visuals, which will follow around February, said DJ Jabs.\n\nHe shared the albums broad appeal.This album is tailored for everyone. It features gospel songs, inspirational tracks, love songs, and club anthems, with clean lyrics to accommodate all audiences.\n\nOriginally intended to be a shorter EP, the project evolved into a full-length album to reach a broader audience.This is an Afro-house/Afro-tech dance album. Initially, it was set to be an EP for release in December 2024, but we decided to expand it into an album, which delayed the release. The inspiration came from the fast-growing house music culture in Bulawayo, Harare, and internationally. Events like Garden of House, House in CBD, and BYO Shutdown have shown that house music has a vibrant following, despite challenges in the local music scene, DJ Jabs explained.\n\nHe added that their aim was to address the scarcity of locally produced house music in indigenous languages.House music is loved globally, but quality house music in our local dialects, like IsiNdebele and Shona, is limited. Many songs played at events are foreign. This album bridges that gap.\n\nThe duo also hopes the album will reach international audiences.When we made this album, we had Zimbabwe and the international market in mind. The IsiNdebele and Shona lyrics, paired with Afro-house and Afro-tech beats, create a unique sound that appeals both locally and globally. Despite challenges like power cuts and tight schedules, we pushed through, thanks to our determination and support from our sponsor, IBM (Ideal Black Man), said DJ Jabs.\n\nDa Grooveman echoed these sentiments, highlighting the seamless creative process.In my 15-year career, Ive never been part of such a swift and collaborative process. Initially, I was skeptical about extending the EP into an album within the given timeframe, but we exceeded expectations. The quality speaks for itself, said Da Grooveman.\n\nThe duo plans to embark on a promotional tour, with dates to be announced soon. Follow Mthabisi Tshuma on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Dj-Jabs-ht565.jpg",
            "description": "Mthabisi Tshuma – revmmthiretshuma@gmail.com SOUTH Africa-based producer DJ Jabs and Da Grooveman are set to release their 12-track album, House Always Wins, on Friday. The album features a diverse collection of tracks, including Sofa Silahlane featuring Bara, Konke Kuzolunga, Pfugama Unamate, Amany featuring Ntu2kay and Vuyo Brown, Mota featuring MJ Sings, Batidzai Mwenje, U Dokotela […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "Charlton Gumede, coach of Mainline FC, signs with Jordan Sinot",
            "url": "https://www.chronicle.co.zw/charlton-gumede-coach-of-mainline-fc-signs-with-jordan-sinot/",
            "content": "Ronald Mpofu[emailprotected]\n\nCHARLTON Gumede, senior coach of Mainline Football Club, has announced his departure from the club after eight years to join Jordan Sinot Football Club in Filabusi.\n\nCharlton Gumede, the visionary founder of Mainline FC, established in 2017 after presenting his concept to Director Mkhulunyelwa Nkomo.Gumede is seeking new opportunities, marking a bittersweet exit from the team he nurtured from its inception in his hometown of Plumtree.In 2023, Gumede led his team to a commendable top 8 finish in the Southern Region Division 1 League. Building on this success, he improved the teams standing to an impressive top 4 position by the end of the 2024 season.\n\nCharlton Gumede (In green) at White City stadium in Bulawayo during the Defence Forces Day celebrations.\n\nNotably, Gumede achieved a remarkable feat by becoming the only coach to defeat ZPC Hwange 2-1 in the league. This impressive accomplishment earned him a prestigious selection as the coach of the Southern Region select team, which competed against the ZNA select team during the Defence Forces Day celebrations. Under his guidance, the team emerged victorious, claiming a trophy in the process.\n\nCharlton Gumede\n\nI just thought about changing a team and focusing on a new challenge. In my whole career of coaching I have been to Plumtree but now I decided to get a new challenge away from home. Said Gumede\n\nHe extended his warm appreciation to Director Nkomo for entrusting him with the opportunity to lead Mainline FC and for his unwavering support over the years.Additionally, Gumede expressed his gratitude to Paul Moyo, the clubs technical director, whose expert guidance and coaching expertise he deeply admired and valued during his tenure. He also thanked the supporters for the strength they gave him at Mainline FC.@itsronaldrox on X\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Charlton-Gumede-HTTRE556.jpg",
            "description": "Ronald Mpofu -itsronaldrox@gmail.com CHARLTON Gumede, senior coach of Mainline Football Club, has announced his departure from the club after eight years to join Jordan Sinot Football Club in Filabusi. Charlton Gumede, the visionary founder of Mainline FC, established in 2017 after presenting his concept to Director Mkhulunyelwa Nkomo. Gumede is seeking new opportunities, marking a […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "Gwanda targets to build more schools",
            "url": "https://www.chronicle.co.zw/gwanda-targets-to-build-more-schools/",
            "content": "Sukulwenkosi Dube- Matutu [emailprotected]\n\nGWANDA Municipality is targeting to build four more primary schools and a secondary school in the mining town to ease congestion in existing schools.\n\nGwanda mayor Alderman Thulani Moyo said the target is to increase the number of council run schools in the town.\n\nThe local authority is in the process of building Phakama Primary School which is operating as an annexure of Jahunda Primary School. The school which has one block is housing ECD B learners. It was constructed using devolution funds. A second block is under construction. Alderman Moyo said the target for council is to build three classroom blocks and then hand over the school to the SDC to further develop the school.\n\nAlderman Moyo said devolution funds have gone a long way in assisting council to meet its obligations.\n\nThis town is rapidly growing and the population at schools is too high with Jahunda Primary School sitting at 2 300 pupils while Senondo is at 1 700 and St Christophers is at 900. We need about four more primary schools and we have identified a site for a secondary school. The distance walked by some children is very long hence the need for these schools.\n\nWe needed to construct a new school in Garikai/ Hlalani Kuhle and devolution came in the handy is seeing us build Phakama Primary School. Once we have constructed three classroom blocks we will hand over the project to the SDC to continue developing the school and we will move on to Spitzkop Primary School. We look forward to receiving devolution funds for this year which will help up to make progress with these projects, he said.\n\nIn 2020, residents decided to spearhead the construction of Phakama Primary school by mobilising resources. The residents from the ward contributed US$1 each towards buying building material which was used to construct a slab for the classroom block.\n\nGwanda Municipality later came in and used devolution funds towards constructing the classroom block and purchasing furniture.\n\nWith social amenities and infrastructure development being some of the major pillars of the National Development Strategy (NDS1), local authorities have used devolution funds to augment efforts by communities and other stakeholders through ensuring that projects are completed timeously.\n\nDevolution funds are assisting local authorities fulfil their obligation across the country through development of key infrastructure such as clinics, classroom blocks, roads, bridges among other facilities. Devolution funds have transformed several districts in the Matabeleland region as the Second Republic steps up the inclusive developmental philosophy of leaving no one and no place behind.\n\nThe devolution programme is one of the key pillars under the NDS1. The overarching goal of the NDS1 is to ensure high, accelerated, inclusive and sustainable economic growth as well as socio-economic transformation and development as the country moves towards an upper middle-income society by 2030.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/CLASSROOM-HHT657.jpg",
            "description": "Sukulwenkosi Dube- Matutu – sukulwenkosi.dube@chronicle.co.zw GWANDA Municipality is targeting to build four more primary schools and a secondary school in the mining town to ease congestion in existing schools. Gwanda mayor Alderman Thulani Moyo said the target is to increase the number of council run schools in the town. The local authority is in the […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "Nepal hits Everest climbers with higher permit fees",
            "url": "https://www.chronicle.co.zw/nepal-hits-everest-climbers-with-higher-permit-fees/",
            "content": "The price to climb Mount Everest will soon increase for the first time in nearly a decade, as Nepal announces a sharp mark-up in permit fees.\n\nFrom September, those seeking to summit the worlds tallest mountain during peak season will have to pay $15,000 (12,180), a 36% rise on the longstanding fee of $11,000, officials said on Wednesday.\n\nFees for those wanting to climb outside the peak April to May period will also increase by the same percentage  meaning it will cost $7,500 during September to November, and $3,750 during December to February.\n\nIncome from permit fees is a key source of revenue for Nepal, with mountain climbing and trekking contributing more than 4% to the countrys economy.\n\nMountaineering experts often criticise Nepals government for allowing too many climbers on Everest, however, with about 300 permits to the mountain issued per year.\n\nIt is unclear if the price increase, which was under discussion since last year, will slow demand.\n\nThe royalty (permit fees) had not been reviewed for a long time, Narayan Prasad Regmi, director general of the Department of Tourism, told Reuters. We have updated them now.\n\nRegmi did not specify how the extra revenue would be used.\n\nThe rise in permit fees came as no surprise, said British mountaineer Kenton Cool, who has reached the summit of Everest 18 times.\n\nIn the grand scheme of the cost to climb Everest it wont impact most foreign climbers, he told the BBC.\n\nHopefully, the extra revenue will be put to good use.\n\nIn April 2024, Nepals Supreme Court ordered the government to limit the number of mountaineering permits issued for Everest and other peaks, saying that the mountains capacity must be respected.\n\nThe preliminary order did not set a maximum number, though.\n\nAmid concerns about overcrowding on Everest and climbers queuing in dangerous conditions to reach the summit, the Nepalese army in 2019 began conducting an annual clean-up of the mountain, which is often described as the worlds highest garbage dump.\n\nIn that time at least five clean-ups have collected 119 tonnes of rubbish, 14 human corpses and some skeletons, according to the army  but it is estimated that a further 200 bodies remain on the mountain.\n\nNepal is home to eight of the worlds 14 highest mountains, including Everest.BBC\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/GEEUUYED.jpg",
            "description": "The price to climb Mount Everest will soon increase for the first time in nearly a decade, as Nepal announces a sharp mark-up in permit fees. From September, those seeking to summit the world’s tallest mountain during peak season will have to pay $15,000 (£12,180), a 36% rise on the longstanding fee of $11,000, officials […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "Full list of Oscar nominations 2025: Cynthia Erivo and Ariana Grande land nods while Emilia Perez leads Academy Awards list",
            "url": "https://www.chronicle.co.zw/full-list-of-oscar-nominations-2025-cynthia-erivo-and-ariana-grande-land-nods-while-emilia-perez-leads-academy-awards-list/",
            "content": "Wicked stars Cynthia Erivo and Ariana Grande are among the big names who landed coveted Oscar nods at Thursdays Academy Award nominations event.\n\nTheir smash hit musical landed 10 nominations in total, marking a significant milestone for the Broadway adaptation.\n\nHowever, it was Emilia Perez that dominated nominations with 13 nods including Best Picture, International Feature Film, Original Score, Adapted Screenplay, and Actress in a supporting role.\n\nThe final category will see Zoe Saldana battle for the win against Ariana Grande, A Complete Unknowns Monica Barbaro, The Brutalists Felicity Jones and Conclaves Isabella Rossellini.\n\nThe annual ceremony will see Wicked, Dune: Part Two, Emilia Perez, Anora, The Brutalist, A Complete Unknown, Conclave, Im Still Here, Nickel Boys and The Substance battle it out for Best Picture.\n\nForeign-language film Im Still Here received a surprising nomination while other popular films, such as Sing Sing and A Real Pain were left out of the race.\n\nFormer Succession co-stars Kieran Culkin and Jeremy Strong were the first stars to receive nominations in the Actor in a supporting role category for their parts in A Real Pain and The Apprentice.\n\nThe category also saw Anoras Yura Borisov, A Complete Unknowns Edward Norton and The Brutalists Guy Pearce.\n\nElsewhere, major snubs this year included lead actresses Angelina Jolie for Maria and Nicole Kidman for Babygirl.\n\nIndeed, the Golden Globe winner in the same category Marianne Jean-Baptiste failed to get a nod for her part in Hard Truths.\n\nFilms fans were shocked to see Sing Sing and September 5 fail to land a Best Picture nomination while Daniel Craig was also snubbed for his leading role in Queer.\n\nSurprisingly, Margaret Qualleys stellar turn in The Substance failed to get her a Supporting Actress nomination, while Conclave was left out of the Best Director nominees despite being nominated in other categories.\n\nEmilia Prezs sweep of nominations set a new record for a non-English language film, while the films star Karla Sofa Gascn made Oscars history as the first openly trans woman to land a nod.\n\nMeanwhile, The Brutalist faired as well as expected after receiving a total of 10 nominations  making it tied second place with Wicked.\n\nThe nominations for the upcoming Oscars were finally revealed after being postponed amid the devastating Los Angeles wildfires.\n\nComedian and actors Rachel Sennott and Bowen Yang announced the nominations during a live presentation from the Academys Samuel Goldwyn Theater in Los Angeles.\n\nThe upcoming 97th Academy Awards are still set to take place on March 2  and will be hosted by comedian and TV personality, Conan OBrien.\n\nIt will mark OBriens Oscar hosting debut after fellow comedian Jimmy Kimmel revealed that he had turned down the opportunity to return after four consecutive years.\n\nIt comes after a number of celebrities have lost their homes in the Pacific Palisades area  including Miles Teller, Anthony Hopkins, Adam Brody and wife Leighton Meester, as well as Anna Faris.\n\nThe fire in the upscale L.A. neighborhood has currently burned more than 14,000 homes and other structures since January 7.\n\nAdditional wildfires have also ignited, such as the Eaton Fire in Pasadena and another called the Hurst Fire located in the San Fernando Valley.\n\nIn the wake of the horrific events, the Academy of Motion Pictures Arts and Sciences initially delayed the announcement of the 2025 Oscar nominations from January 17 to January 19  before being moved to January 23.\n\nThe voting period  which began on Wednesday  was also been extended through Tuesday, January 14. Voting had initially been set to end on Sunday, January 12.\n\nA letter from the Academy, per The Hollywood Reporter, read: We want to offer our deepest condolences to those who have been impacted by the devastating fires across Southern California.\n\nSo many of our members and industry colleagues live and work in the Los Angeles area, and we are thinking of you.\n\nEarlier this year, Zoe Saldana led the film Emilia Perez to top honors at the Golden Globe Awards.\n\nThe night also saw period film The Brutalist win big, while Demi Moore became a first time winner at 62 for her role in The Substance.\n\nMeanwhile, Wicked only managed to secure a win in the Cinematic And Box Office Achievement category.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/FGG.jpg",
            "description": "Wicked stars Cynthia Erivo and Ariana Grande are among the big names who landed coveted Oscar nods at Thursday’s Academy Award nominations event. Their smash hit musical landed 10 nominations in total, marking a significant milestone for the Broadway adaptation. However, it was Emilia Perez that dominated nominations with 13 nods including Best Picture, International […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "Ramaphosa signs contentious Expropriation Bill into law",
            "url": "https://www.chronicle.co.zw/ramaphosa-signs-contentious-expropriation-bill-into-law/",
            "content": "President Cyril Ramaphosa has signed the Expropriation Bill into law, which provides for the expropriation of land with nil compensation.\n\nThe law also seeks to provide for certain instances where expropriation with nil compensation may be appropriate in the public interest.\n\nPushing for the adoption of the law during a sitting of the National Assembly in September 2022, then-public works minister Patricia de Lille said expropriation was only one acquisition mechanism that, in appropriate cases, for the public interest, would enable land reform and redress.\n\nIt was opposed by, among others, the DA,IFP and FF Plus, which are now part of the government of national unity.\n\nAnnouncing the signing of the bill, Presidency spokesperson Vincent Magwenya said: The bill, which has undergone a five-year process of public consultation and parliamentary deliberation, aligns legislation on expropriation with the Constitution.\n\nSection 25 of the Constitution recognises expropriation as an essential mechanism for the state to acquire someones property for a public purpose or in the public interest, subject to just and equitable compensation being paid.\n\nMagwenya added up to now, expropriation of property had been governed in terms of the Expropriation Act of 1975, which predated the expropriation mechanism provided for in the new law that repealed the pre-democratic Expropriation Act of 1975.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jjhgj.jpg",
            "description": "President Cyril Ramaphosa has signed the Expropriation Bill into law, which provides for the expropriation of land with nil compensation. The law also seeks to provide for certain instances where expropriation with nil compensation may be appropriate in the public interest. Pushing for the adoption of the law during a sitting of the National Assembly […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "Passengers fled a train over fears of a fire. Then another train hit them.",
            "url": "https://www.chronicle.co.zw/passengers-fled-a-train-over-fears-of-a-fire-then-another-train-hit-them/",
            "content": "Twelve people were killed in India after they disembarked a train bound for Mumbai, only to be struck by another train, the authorities said.\n\nIndia has launched a program to modernize its railways in recent years, but its system has been marred by several accidents.\n\nAt least 12 people were killed and 11 people injured in India on Wednesday evening after they stepped off a train and were hit by another one while on the tracks, the local authorities said.\n\nThe passengers had disembarked after rumors of a fire on their train spread panic among those onboard, the authorities said.\n\nThe accident happened around 5 p.m. in Maharashtra State, about 170 miles northeast of Mumbai, said Ashok Pawar, a police inspector at the Pachora police station. The passengers were aboard the Pushpak Express, a train traveling from Lucknow, in northern India, to Mumbai in the west, when word spread onboard of a fire, he said.\n\nPanic ensued, and people began to leave the train when it eventually came to a stop, Mr. Pawar said. They were hit by another train, the Karnataka Express, passing by on an adjoining track.\n\nIt was unclear how many passengers had been on the Pushpak Express. Mr. Pawar said the train had been packed with people, many of them migrant workers traveling for work. The accident, he said, left victims with severe injuries.\n\nThe authorities said that they were looking into the episode.\n\nWe will investigate exactly what was the reason, whether there was an actual fire or whether it is just a rumor spread by any mischievous person, Maheswar Reddy, the superintendent of police in Jalgaon District, where the accident happened, said to reporters.\n\nMr. Pawar, the inspector, said seven people who had died were from Nepal and four were from the northern Indian state of Uttar Pradesh, where Lucknow is. One body remained unidentified, and families of the victims were now in Jalgaon, he said.\n\nDevendra Fadnavis, the top government official in Maharashtra, said late Wednesday that eight ambulances had been dispatched to the scene. The state government would offer financial assistance to the families of the victims, he said on social media, and would cover expenses for people who were injured.\n\nThe accident raised more questions around the safety of train travel in India, where millions of people depend on a vast but accident-prone railway network for transport, especially in rural areas.\n\nThe government has invested heavily in rail safety and launched a series of high-tech initiatives, although accidents continue.\n\nOne of the deadliest rail crashes in the countrys history, in the eastern state of Odisha in 2023, killed 290 people after two passenger trains collided. Another train crash last June killed at least eight people, after a freight train rammed a passenger train that had derailed in the eastern state of Tripura.\n\n New York Times\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yujyj.jpg",
            "description": "Twelve people were killed in India after they disembarked a train bound for Mumbai, only to be struck by another train, the authorities said. India has launched a program to modernize its railways in recent years, but its system has been marred by several accidents. At least 12 people were killed and 11 people injured […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "Sweswe leaves Sheasham",
            "url": "https://www.chronicle.co.zw/sweswe-leaves-sheasham/",
            "content": "Innocent Kurira,[emailprotected]\n\nCENTRAL Region Division One outfit Sheasham have parted ways with head coach Lizwe Sweswe who will be replaced by Asan Nhongo on an interim basis.\n\nThe club announced the latest development via a statement on Thursday afternoon.\n\nThe club wishes to inform all stakeholders that it has parted ways with the mens head coach Lizwe Sweswe on mutual grounds. We than the coach for his contributions to the club during his tenure and wish him all the best in his future endeavors.\n\nIn the interim, Asan Nhongo will take over the coaching responsibilities as the club begins the process of appointing a substantive head coach. We are committed ensuring a smooth transition and maintain the teams competitive spirit, read the statement from Sheasham.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/sweswe.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw CENTRAL Region Division One outfit Sheasham have parted ways with head coach  Lizwe Sweswe who will be replaced by Asan Nhongo on an interim basis. The club announced the latest development via a statement on Thursday afternoon. “The club wishes to inform all stakeholders that it has parted ways with the men’s […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        },
        {
            "title": "ICT, Postal and Courier Services Ministry meets stakeholders",
            "url": "https://www.chronicle.co.zw/ict-postal-and-courier-services-ministry-meets-stakeholders/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nTHE Ministry of Information Communication Technology, Postal and Courier Services on Thursday met with its stakeholders in Harare at an event dubbed the Ministerial Interface between ICT Ministry and stakeholders in Zimbabwe.\n\nThe engagements were held at the Potraz headquarters here and come on the premise of last years same engagement.\n\nICT Minister, Dr Tatenda Mavetera, accompanied by her deputy, Cde Dingumuzi Phuti and ICT permanent secretary Dr Beulah Chirume took part in the discussions, which are aimed at creating a digitised Zimbabwe.\n\nAlso present at the event was Potraz director general Dr Gift Machengete, Potraz deputy director Mr Alfred Marisa, Netone CEO Enginner Raphael Mushanawani, Telone CEO Mr Nkala, Telecel CEO Mrs Vere and Postmaster General of Zimpost Mr Maxwell Chitendeni. Other stakeholders respesented were from Econet, DFA, Telco, Liquid, Powertel, Compulink, Dandemutande, ICT Ministry directors among other ICT players.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/hghbjbn.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com THE Ministry of Information Communication Technology, Postal and Courier Services on Thursday met with its stakeholders in Harare at an event dubbed the “Ministerial Interface between ICT Ministry and stakeholders in Zimbabwe”. The engagements were held at the Potraz headquarters here and come on the premise of last year’s same engagement. ICT […]",
            "time": "18:30",
            "date": "23 Jan 2025"
        }
    ]
}