{
    "news": [
        {
            "url": "https://www.chronicle.co.zw/south-africa-zimbabwe-authorities-tighten-measures-to-minimise-child-smuggling-at-the-border/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nZimbabwean and South African border authorities have started tightening measures at the Beitbridge border post to minimise cases of child smuggling during the festive season.\n\nActivity at the border is gradually increasing with schools having closed in Zimbabwe.\n\nIn Zimbabwe, the Department of Immigration and security agents have already deployed additional manpower to reduce and prevent illegal activities at the border.\n\nThe festive season is synonymous with increased traffic and irregular migration through the border post and its surrounding areas.\n\nThe Assistant Immigration Officer in charge of Beitbridge Station (Zimbabwe), Mrs Canisia Magaya, said they were conducting a number of operations on the ground to enforce immigration laws.\n\nWe are working hard to ensure there is efficiency at the border this festive season, as well as to prevent illegal migration through our border. We encourage people to travel safely and ensure they have valid travel documents, she said.\n\nIn a statement, South Africas Border Management Authority(BMA) said on Monday afternoon it intercepted a South African taxi driver who was attempting to smuggle 25 undocumented foreign nationals into the neighbouring country.\n\nAmong them were 20 children, aged between five and 14, being unlawfully transported under dangerous and inhumane conditions.\n\nThe vehicle used in the operation was immediately impounded, the driver has been charged and is in police custody, and a conveyance fine of R375,000 has been issued in accordance with the Immigration Act.\n\nThe BMA stated that, following standard protocols, the children were handed over to the Zimbabwean child welfare authorities to ensure their safety and care while investigations continue.\n\nActing Commissioner of the BMA, Ms Jane Thupana, said: This operation highlights the BMAs resolve to disrupt criminal networks that exploit vulnerable individuals, particularly children. The trafficking and smuggling of people undermine human dignity and border security, and the BMA remains vigilant in its efforts to safeguard South Africas ports of entry and protect those at risk.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/tu7.jpg"
        },
        {
            "url": "https://www.chronicle.co.zw/armed-robbers-hit-liquor-warehouse-in-bulawayo-assault-workers-and-steal-cash/",
            "content": "Online WriterSEVEN unidentified men, armed with a rifle, carried out a violent robbery at a liquor wholesale warehouse on Khami Road, Kelvin North, on 10 December, leaving multiple workers injured.The robbers got away with US$521, R200, and loaded bottles of whiskey into a satchel before fleeing through the dispatch entrance. No arrests have been made so far.According to police reports, the robbers jumped over the perimeter wall at approximately 8:30 PM and confronted the security guard at the main gate. Intimidated, the guard fled but was struck by an unknown object, causing a head injury. The gang proceeded to the warehouse, encountering and assaulting a general employee before storming inside.Once inside, the robbers fired several gunshots and ordered all workers to lie on the ground.Police are urging businesses not to store large sums of money on their premises and to deposit earnings at banks promptly. They also appeal to the public for information that may assist in apprehending the suspects.Bulawayo deputy police spokesperson Assistant Inspector Msebele Nomalanga confirmed the incident and reassured the public that investigations are ongoing.Anyone with relevant information is encouraged to report to their nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/armed-robbers-used-gun-robbery-600nw-1495712093-600x380.jpg"
        },
        {
            "url": "https://www.chronicle.co.zw/massive-windfall-for-sables-players/",
            "content": "Online ReporterPresident Emmerson Mnangagwa on Wednesday hosted the Zimbabwe senior mens rugby team at State House where he distributed cash rewards of US$6,500 per player for winning this years Rugby Africa Cup.In his congratulatory address, President Mnangagwa described the Sables feat is a testament to the dedication and perseverance of all involved and serves as shining symbol of the nations pride and unity.I am honoured today as we gather to celebrate an extraordinary victory and pay tribute to the remarkable spirit, resilience and teamwork that have propelled our team to this pinnacle of success at the Rugby Africa Cup in Uganda, said President Mnangagwa.This achievement is a testament to the dedication and perseverance of our players, coaches and support staff, serving as a shining symbol of our nations pride and unity, he said.The Zimbabwe Sables are coming off quite the impressive year, during which they finished unbeaten in Test rugby and clinched the Africa Cup title in Kampala, Uganda back in July.The Africa Cup conquest was their first victory 12 years, a run that also included a first and, more importantly, victory over regional powerhouses Namibia in 23 years.The win now puts them in good stead for next years Africa Cup competition which will double as qualification for the 2027 Rugby World Cup in Australia.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/yufhy.jpg"
        }
    ]
}