{
    "news": [
        {
            "title": "Wife stabs husband, flees",
            "url": "https://www.chronicle.co.zw/wife-stabs-husband-flees2/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nPolice are searching for a Beitbridge woman, Shorai Dube, after she allegedly stabbed her husband multiple times, causing near-fatal injuries, on Saturday morning. The attack reportedly occurred while the man was asleep.\n\nThe motive remains unclear. Beitbridge District Police Commander, Chief Superintendent Melusi Ncube, confirmed the incident, stating, She allegedly stabbed him several times on the throat and abdomen. He is seriously injured and hospitalised. Investigations are ongoing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/01/knife-robbery-680x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Police are searching for a Beitbridge woman, Shorai Dube, after she allegedly stabbed her husband multiple times, causing near-fatal injuries, on Saturday morning. The attack reportedly occurred while the man was asleep. The motive remains unclear. Beitbridge District Police Commander, Chief Superintendent Melusi Ncube, confirmed the incident, stating, “She allegedly stabbed […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "President officially gazettes Zimbabwe, Belarus tax agreement",
            "url": "https://www.chronicle.co.zw/president-officially-gazettes-zimbabwe-belarus-tax-agreement/",
            "content": "Farirai Machivenyika,Harare Bureau\n\nPRESIDENT Mnangagwa has officially gazetted the tax agreement between Zimbabwe and the Republic of Belarus, which was concluded in January 2023.\n\nThis announcement appears in Proclamation 2 of 2025, included in Statutory Instrument 18 of 2025, published in an Extraordinary Government Gazette last week.\n\nThe agreement aims to avoid double taxation and prevent tax evasion concerning income and property taxes. It seeks to regulate tax relations between the two nations and promote trade and economic co-operation on mutually beneficial terms.\n\nThe proclamation states: Whereas, it is provided for by section 91 of the Income Tax Act that the President may enter into agreements with the government of any other country or territory to prevent, mitigate, or discontinue the levying of taxes on the same income . . . \n\nThe agreement was finalised with the Belarusian Government on January 31, 2023, and has now been officially proclaimed.\n\nIn the previous year, Zimbabwe hosted the inaugural session of the Zimbabwe-Belarus Joint Permanent Commission on Cooperation (JPCC) in Harare, leading to several memoranda of understanding, agreements, and commercial contracts between the two countries.\n\nCo-operation spans various sectors, including mining, infrastructure development, science and innovation, agriculture, and industry. Belarus has supplied Zimbabwe with tractors, earth-moving trucks, and fire-fighting equipment.\n\nPresident Mnangagwa and his Belarusian counterpart, Aleksandr Lukashenko, have engaged in State visits and met at various international forums, further strengthening their diplomatic and economic ties.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/y8rg79rg789frg789f4.jpg",
            "description": "Farirai Machivenyika, Harare Bureau PRESIDENT Mnangagwa has officially gazetted the tax agreement between Zimbabwe and the Republic of Belarus, which was concluded in January 2023.  This announcement appears in Proclamation 2 of 2025, included in Statutory Instrument 18 of 2025, published in an Extraordinary Government Gazette last week. The agreement aims to avoid double taxation and […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "WATCH: Family demands…High emotion, confrontation and tensions at slain detective’s funeral",
            "url": "https://www.chronicle.co.zw/watch-family-demands-high-emotion-confrontation-and-tensions-at-slain-detectives-funeral/",
            "content": "Peter Matika,[emailprotected]\n\nTHERE was drama at Nyaradzo Funeral Parlour in Bulawayo yesterday as the family of the late female detective, Constable Cassandra Hove, who died during a shooting incident with armed robbers in Pumula South last Thursday, demanded more answers and justice.\n\nA funeral service scheduled for 10AM at Nyaradzo was abruptly postponed due to heightened emotions among mourners and close family members, who confronted police officers present.\n\nTension escalated as some close family members insulted the officers, accusing them of withholding the truth regarding their relatives death.\n\nThey claimed that Hove was not killed by the robbers but by one of her colleagues and demanded to know whether this was an accident or deliberate.\n\nAccording to the police, Hove sustained gunshot wounds to her upper limbs during the exchange of fire with robbers at around 8:40PM and was rushed to a nearby private clinic, where she was pronounced dead upon arrival.\n\nThe family also demanded to know the identities of the officers deployed in the Pumula South raid and the individual who authorised Hoves post-mortem, saying they were not involved in the process and were shocked to learn that someone else had signed documents at the hospital as Hoves next of kin.\n\nThere is something suspicious about all this. Why did the police rush to conduct a post-mortem without our consent or knowledge?fumed one female family member.\n\nWhy were they collecting bereavement monies without our knowledge? Where did that money go?\n\nAlso, why did the police notify us about her death hours after she had been killed? They also demanded her mobile phones and title deeds to the house for reasons best known to them, she blasted\n\nThe family stated that they were not satisfied with the version of events given by the police and vowed to pursue the matter until the culprits were brought to justice.\n\nIf our concerns are not addressed, then they might as well bury her themselvesafter all, she belonged to the State. The police must be held accountable, and we will not stop questioning them until we are satisfied, they said.\n\nA family spokesperson, Mr Ryan Gambinga, said they were deeply shocked and troubled by the tragic circumstances surrounding Hoves death.\n\nWhile we initially received conflicting reports, our recent meeting with ZRP Bulawayo has confirmed that a fellow police officer, and not armed robbers, was involved in this devastating incident, he said.\n\nMr Gambinga said the family would only find peace if a thorough investigation was conducted and the full truth was revealed to bring the matter to finality.\n\nThis revelation raises profound questions and intensifies our grief. We are committed to uncovering the complete truth and ensuring that justice is served, he said.\n\nAs we mourn the loss of our beloved daughter, we demand a thorough and transparent investigation, added Mr Gambinga.\n\nRelatives and mourners at a funeral service for the late female detective, Constable Cassandra Hove in Bulawayo yesterday\n\nThe family wrangled with the officers present until around 3PM, when tensions cooled following a closed-door meeting with some unidentified police bosses.\n\nWe decided to proceed with the service after meeting with the police. They assured us that they would launch a full investigation into the matter. They gave us their highest assurance, and as a family, we decided to go ahead with the proceedings, said Mr Gambinga.\n\nIt is now up to them as the police to uphold their end of the bargain.\n\nMr Gambinga said the family was disappointed that the individuals at the centre of the matter failed to present themselves to the family as they sought closure.\n\nIt would have been prudent for them to come and speak with us. After all, it is customary in many traditions to do so. We have questions that need to be answered, he said.\n\nMr Gambinga revealed that the late Hove had recently secured a scholarship to Russia to pursue a degree in forensic investigations.\n\nWe had sorted all her paperwork and were in the process of securing funds. This is truly a tragedy, he said.\n\nThe emotional send-off saw many of her colleagues in attendance, but none from the Criminal Investigations Departments crack Homicide Unit, named Lozikeyi, were present.\n\nBulawayo province acting police spokesperson, Assistant Inspector Nomalanga Msebele, referred all questions to national police spokesperson Commissioner Paul Nyathi, who was unavailable for comment.\n\nHove is survived by four children. She will be buried at her rural home in Mberengwa today.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/eawr.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw THERE was drama at Nyaradzo Funeral Parlour in Bulawayo yesterday as the family of the late female detective, Constable Cassandra Hove, who died during a shooting incident with armed robbers in Pumula South last Thursday, demanded more answers and justice. A funeral service scheduled for 10AM at Nyaradzo was abruptly postponed due to […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "Hawks thwart R7m drugs smuggling",
            "url": "https://www.chronicle.co.zw/hawks-thwart-r7m-drugs-smuggling/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nSOUTH Africas police unit, the Hawks, have arrested a 55-year-old Zimbabwean truck driver with a contraband of drugs worth an estimated R7 million, which he was transporting through the Beitbridge Border Post.\n\nHawks spokesperson, Warrant Officer Lethunya Mmuroa identified the suspect as Anymore Nyambawa.He said the man who was arrested on Tuesday last week and appeared in the Musina Magistrates Court on Friday facing a charge of dealing in drugs where he was remanded in custody to March 14.\n\nSouth Africa police intercept smuggled cigarettes from Zimbabwe\n\nIt is alleged that on March 4, 2025, the police officials attached to Beitbridge Port of Entry and the South African Revenue Service (Sars) officials stopped a truck that was driven from Zimbabwe to South Africa at weigh-bridge, said Warrant Officer Mmuroa.\n\nThe recovered cigarettes\n\nDuring search, police found 23 bags that contained unknown substances suspected to be drugs. The Musina-based Hawks Serious Organised Crime Investigation, Polokwane-based Hawks Serious Organised Crime Investigation and Musina-based Local Criminal Record Centre were summoned to the scene for assistance.\n\nThe samples of the recovered substance were taken to the Forensic Science Laboratory (FSL) for tests. The FSL was confirmed that substances contain a precursor chemical called Methacolone used to produce drugs.\n\nHe said the substances weighed at over 1173 kilograms estimated to the street value of over R7 million.Nyambawa was put under arrest for dealing in drugs.\n\nMembers of the South African Police Service count the smuggled cigarette packets and (below) the cigarettes in the vehicle that was used to smuggle them\n\nThe incident comes a few weeks after another Zimbabwean truck driver, Jiant Janos Bimha (44) was arrested for smuggling a load of cigarettes worth R14 million.\n\nBimha was arrested on January 18, 2025, after he was allegedly found in possession of illicit cigarettes at the Beitbridge Border Post soon after entering the neighbouring country.\n\nSome of the recovered cigarettes\n\nCharges against Bimha are that he was driving a white truck with a tanker trailer when he was stopped by the police at the port of entry.\n\nUpon being asked about his load, Bimha claimed the tanker was empty but the police suspected that it was loaded. They then directed him to the ramp zone at the commercial side and searched the vehicle leading to the discovery of 710 boxes of Remington Gold brand cigarettes worth R14, 449, 363-00.\n\nThe police have since confiscated the 710 boxes of Remington Gold illicit cigarettes and a truck tanker valued at R2 500 000.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/WhatsApp-Image-2024-01-03-at-14.03.30-680x380.jpeg",
            "description": "Thupeyo Muleya, Beitbridge Bureau SOUTH Africa’s police unit, the Hawks, have arrested a 55-year-old Zimbabwean truck driver with a contraband of drugs worth an estimated R7 million, which he was transporting through the Beitbridge Border Post. Hawks spokesperson, Warrant Officer Lethunya Mmuroa identified the suspect as Anymore Nyambawa. He said the man who was arrested […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "No to drugs!. . . Mr and Miss Rural contestants take stand against drug abuse",
            "url": "https://www.chronicle.co.zw/no-to-drugs-mr-and-miss-rural-contestants-take-stand-against-drug-abuse/",
            "content": "Sipepisiwe Moyo,[emailprotected]AS Zimbabwe intensifies its fight against drug and substance abuse, Mr and Miss Rural Zimbabwe contestants have been actively campaigning against the scourge since last years provincial finals in Avoca, Filabusi, Matabeleland South.\n\nThe country is facing a growing crisis of drug and substance abuse, particularly among young people. The widespread use of illicit substances such as crystal meth (commonly known as mutoriro or guka), marijuana, broncleer (a cough syrup with codeine) and other synthetic drugs has raised concerns among authorities, communities and health experts.\n\nAs part of the campaign, which uses creative arts to spread awareness, the models are speaking out against this vice and incorporating costume designs featuring imitations of various drugs to symbolise the dangers of substance abuse at the events and platforms they attend.\n\nMiss Rural Zimbabwe founder Sipho Mazibuko, stressed the importance of using engaging mediums to connect with young people.\n\nWere using fashion to raise awareness about drug and substance abuse. Were also incorporating comedy, modelling and entertainment because young people are drawn to these platforms. By using a medium they relate to, the message is received faster and more effectively.\n\nThats why we selected a model who can act as both a drug addict and a drunkard to illustrate the dangers vividly, she said.\n\nOne of the contestants, Margaret Mangowe from Masvingo, said the initiative is aimed at educating their peers on the consequences of drug abuse.\n\nMiss Rural Zimbabwe contestant, Margaret Mangowe from Masvingo Bikita.\n\nThrough acting, Im teaching the young generation to stay away from drugs and alcohol. Many young people turn to these substances to escape their problems, not realising theyre ruining their lives.\n\nDrug abuse has become common in schools, leading to embarrassment and even crime, Mangowe said.\n\nPeggy Ngwendu, a contestant from Mbembesi, Matabeleland North, echoed similar sentiments, stating that drug abuse is a major threat to the future of the youth.\n\nDrugs have destroyed many young lives, but I believe theres a solution. One of the biggest challenges facing youth today is unemployment. When young people are idle, they often turn to drugs. If we create opportunities that keep them busy and engaged, we can reduce substance abuse cases, Ngwendu said.\n\nThe models believe their campaign, which will continue until the pageant hosts its national finals later this year, will empower the youth and contribute to efforts to curb drug abuse.\n\nSo far, they have taken their message to Matabeleland North and Masvingo provinces and had the opportunity to reach a broader audience during the National Youth Day celebrations in Bulawayo last month.\n\nUnemployment and peer pressure have contributed to the rise in substance abuse, affecting both urban and rural areas. The government has intensified efforts to tackle drug and substance abuse through various policies, initiatives and collaborations and initiatives like Mazibukos certainly go a long way.\n\nAuthorities have also strengthened laws against drug trafficking and distribution, leading to increased arrests of drug dealers and suppliers, with more and more being arrested almost daily.\n\nThis fight requires a collective effort, and with these ongoing initiatives and strengthened policies, there is hope that the country will reduce drug abuse and protect future generations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/vbhgfbbf-cvvb.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com AS Zimbabwe intensifies its fight against drug and substance abuse, Mr and Miss Rural Zimbabwe contestants have been actively campaigning against the scourge since last year’s provincial finals in Avoca, Filabusi, Matabeleland South. The country is facing a growing crisis of drug and substance abuse, particularly among young people. The widespread use […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "Modi takes over Choppies outlets. . . retains all 1 100 workers",
            "url": "https://www.chronicle.co.zw/modi-takes-over-choppies-outlets-retains-all-1-100-workers/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nRETAIL chain operator Sai Mart, owned by Bulawayo businessman and legislator Raj Modi, has successfully acquired all former Choppies Zimbabwe outlets across the country and is now undertaking a rebranding exercise.\n\nThe Botswana-headquartered Choppies chain recently exited the Zimbabwean market, citing a strategic decision to focus on sustainable growth and profitability across its regional operations.\n\nChoppies entered the Zimbabwean market in 2013, when it acquired several Spar shops, and expanded its footprint in 2014 with a distribution centre in the country.\n\nThe retailer operated 30 grocery stores nationwide under its subsidiary, Nanavac (Pty) Ltd, trading as Choppies Zimbabwe.\n\nHowever, in recent years, Choppies faced increasing challenges in adapting to Zimbabwes evolving retail landscape and a significant shift in consumer behaviour led more shoppers to migrate to the informal retail sector, resulting in a 30 percent decline in foot traffic at formal retail outlets.\n\nIn a recent interview, Modi, who is also Deputy Minister of Industry and Commerce, said that all the former Choppies outlets across the country have been restocked. He also stated that they have successfully retained all the workers  estimated to be around 1,100  who were employed by Choppies.\n\nWe acquired all the Choppies outlets, not only in Bulawayo but nationwide. We bought everything from Choppies and retained all the workers, about 1100 and something, said Modi.\n\nWe have already started rebranding; we began with the ones in downtown and those in the suburbs. As soon as we finish here in Bulawayo, we will move on to Gweru, then Gokwe, Mutare and finally Harare.\n\nAs a well-known local brand, Modi stated that Sai Mart would blend seamlessly into the market and pledged to continue offering high value to customers.\n\nChoppies Supermarket in Bulawayos Pumula South suburb\n\nBy the end of last year, Choppies had cleared its stock and now, according to Deputy Minister Modi, all the outlets have been restocked.\n\nBefore acquiring the former Choppies outlets, Sai Mart owned six locations in Bulawayo and two in Plumtree. The retail chain aims to leverage this acquisition to expand its footprint and strengthen its position in Zimbabwes competitive retail sector, Modi added.\n\nThe rebranding of Choppies outlets under Sai Mart is expected to usher in a new era for the supermarket chain while maintaining its commitment to quality and affordability for Zimbabwean shoppers, he concluded.  @SikhulekelaniM1.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hrrht.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com RETAIL chain operator Sai Mart, owned by Bulawayo businessman and legislator Raj Modi, has successfully acquired all former Choppies Zimbabwe outlets across the country and is now undertaking a rebranding exercise. The Botswana-headquartered Choppies chain recently exited the Zimbabwean market, citing a strategic decision to focus on sustainable growth and profitability across […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "Sure and steady progress in  Bulawayo-Nkayi Road rehab",
            "url": "https://www.chronicle.co.zw/sure-and-steady-progress-in-bulawayo-nkayi-road-rehab/",
            "content": "Raymond Jaravaza and Mkhululi Ncube,Chronicle Writers\n\nTHE rehabilitation of the Bulawayo-Nkayi Road has gained momentum, with the contractor working on a 23km stretch from Inyathi Business Centre, affirming the Second Republics commitment to infrastructure development in Matabeleland North Province.\n\nThis initiative is part of a wider national road rehabilitation programme aimed at improving transport networks and boosting economic growth in line with Vision 2030.\n\nAChroniclenews crew recently went to the ground and observed the contractor, Difflock Construction, busy on site, working on a stretch just after the Ingwingwizi River Bridge in Bubi District.\n\nThe road is part of the 33 roads designated by the Government as priority projects for 2025 across the country, including the Bulawayo-Tsholotsho Road.\n\nFor both the Bulawayo-Nkayi and Bulawayo-Tsholotsho roads, the target is 50km, according to the Minister of Finance, Economic Development, and Investment Promotion, Professor Mthuli Ncube, in his 2025 budget presentation.\n\nThe contractor is capitalising on the recent halt in rainfall and is utilising water from the Ingwingwizi River for the roadworks.\n\nPart of the road they were working on had already been primed, and motorists who frequently use the road welcomed the progress. Mr Njabulo Dube, who travels the Siganda-Nyathi route, expressed optimism about the improvements.\n\nFor small car owners like myself, some sections of the road had become almost impassable. However, we are pleased with the progress, he said. The contractors seem to be working efficiently, and we hope the Government will continue monitoring the project to ensure quality work.\n\nBubi Rural District Council Ward 8 Councillor Ignatius Khabo said the Second Republic has shown commitment to rehabilitating the road.\n\nWe are pleased with the work being done. This road has been in a poor state for years, making travel difficult for both motorists and businesses. We urge the Government to extend rehabilitation efforts to other sections of the road as well, he said.\n\nThe rehabilitation of the Bulawayo-Nkayi Road is expected to boost economic activities, as the route serves as a crucial link between Bulawayo, Matabeleland North, and parts of the Midlands.\n\nMatabeleland North Provincial Affairs and Devolution Minister, Richard Moyo, said the Government will no longer tolerate shoddy work as it moves ahead with the rehabilitation of major roads in the region.\n\nMinister Richard Moyo\n\nIn addition to the Bulawayo-Nkayi Road rehabilitation, which has once more gained momentum with work being done on a 10km section just after Ingwingwizi Bridge in Bubi District towards Nkayi, more funds will be released soon for two major roads, he said.\n\nThe rehabilitation of the Bulawayo-Tsholotsho and Bulawayo-Victoria Falls roads are priority projects that the Government is keen to resume.\n\nThe Bulawayo-Nkayi Road had been in disrepair for years, causing significant inconveniences for motorists and impacting the local economy.\n\nWork by the contractor, who is rehabilitating a 23km stretch of road along the Bulawayo-Nkayi Road, will be assessed by engineers from the Ministry of Transport and Infrastructural Development to determine if it is quality work, said Minister Moyo.\n\nIf the engineers are satisfied, then the Government will release more funds for another 23km to be rehabilitated. The rehabilitation of the Bulawayo-Nkayi Road will continue in this manner until it is completed, as the Government will no longer tolerate substandard work.\n\nMinister Moyo reaffirmed President Mnangagwas vision of accelerating infrastructure development in line with the National Development Strategy 1 (NDS1), the Governments 2021-2025 economic blueprint, which prioritises infrastructure as a catalyst for investment and business growth.\n\nPresident Mnangagwa\n\nThe rehabilitation of the Bulawayo-Nkayi Road will not only improve mobility for local communities but also create opportunities for businesses and investors. Well-maintained road infrastructure is essential for economic expansion in the region, he said.\n\nThe Bulawayo-Nkayi and Bulawayo-Tsholotsho roads fall under the Department of Roads and the Road Fund, while RIDA is mainly responsible for feeder roads within rural district councils. Feeder roads are a critical component of the Governments rural industrialisation and development strategy.\n\nThe capacitation of RIDA through a US$75 million loan facility will enable the aggressive rehabilitation and upgrading of rural road infrastructure, including opening up new arteries in underserved areas.\n\nUnder the Second Republic, the Government is scaling up the rehabilitation of major roads across the country as a key enabler of business viability and investment attraction.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jfgvgh.jpg",
            "description": "Raymond Jaravaza and Mkhululi Ncube, Chronicle Writers THE rehabilitation of the Bulawayo-Nkayi Road has gained momentum, with the contractor working on a 23km stretch from Inyathi Business Centre, affirming the Second Republic’s commitment to infrastructure development in Matabeleland North Province. This initiative is part of a wider national road rehabilitation programme aimed at improving transport networks […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "WATCH| ‘It’s my time! PSL Week Two Results at a glance Highlanders 4-0 Kwekwe United",
            "url": "https://www.chronicle.co.zw/its-my-time-psl-week-two-results-at-a-glance-highlanders-4-0-kwekwe-united/",
            "content": "Innocent Kurira at Barbourfields Stadium\n\nHighlanders 4-0 Kwekwe United\n\nBRIGHTON MaNinja Ncubes sensational hat-trick was the highlight of the game as Highlanders dismissed Kwekwe United 4-0 in their first home match of the 2025 Castle Lager Premier Soccer League season.\n\nThe strikers goals played a pivotal role in the comfortable victory, making him the first player to score a hat-trick this season. It was also his first hat-trick in Bosso colours.\n\nThe game got off to a fast start.In the second minute, a brilliant cross from Mason Mushore found Melikhaya Ncube inside the box and the midfielder made no mistake, heading the ball past Kwekwe goalkeeper Elton Nechirwe, to give the hosts the lead.\n\nHighlanders were relentless in their pursuit of a second goal, and it came in the 15th minute. After a dazzling solo run into the box, MaNinja was brought down by a Kwekwe United defender, earning a penalty for the home side.\n\nMason Mushore\n\nThe Bosso forward stepped up to take the spot-kick and sent Nechirwe the wrong way, doubling his sides lead.The match took a significant turn in the 26th minute when Kwekwe Uniteds goalkeeper, Nechirwe, was sent off for handling the ball outside the penalty area to deny Reason Sibanda a clear goal-scoring opportunity.\n\nThe visitors were reduced to 10 men and Highlanders capitalised on that, continuing to dominate possession and pressing for more goals.\n\nOn the stroke of half-time, MaNinja completed his brace.McKinnon Mushore played a perfectly timed pass through to Brighton, who finished with composure into the bottom right corner, extending Highlanders lead to 3-0.\n\nIt was a fitting end to a dominant first-half performance from Bosso.In the second half, Highlanders showed no signs of letting up.\n\nIn the 68th minute, Brighton completed his hat-trick, converting his second penalty of the day. The referee awarded the penalty after Sibanda was brought down inside the box.\n\nBrighton stepped up once again, keeping his cool and sending the goalkeeper the wrong way to seal a 4-0 victory for Highlanders.\n\nKelvin Kaindu\n\nBosso coach Kelvin Kaindu was delighted with the victory.Looking at how difficult it was in terms of preparation, I think it was a positive response. We managed to score four and keep a clean sheet. We looked a bit stable, we didnt allow the opponents to create those chances. We relaxed a bit when they were a man down; we allowed them to play in midfield, but what is positive is we had a bit of flair, and we are seeing signs of improvement from the first game.\n\nHaving a player score three goals is a positive for us. Even last year, MaNinja played an important role in producing a top goal scorer. He has started positively, and for him to score three goals when he is not yet 100 percent fit is a positive development. He only started training last week, said Kaindu.\n\nKwekwe United coach Saul Chaminuka, felt his team had a slow start to the game.We started the game slowly. We could have conceded more, said Chaminuka.With a numerical disadvantage, Kwekwe United struggled to mount a serious challenge. Highlanders created a few more chances, including a miss from Sibanda in the 50th minute, but the game was already well beyond reach by then.\n\nBrighton also had a great run in the 60th minute, but his cross into the box was intercepted by substitute goalkeeper, Lenon Gonese.\n\nAt full-time, the Highlanders supporters celebrated a resounding victory, with Brighton Ncube receiving the plaudits for his stunning hat-trick.\n\nTeamsHighlanders: Raphael Pitisi (gk), Talent Dube, Arthur Ndlovu, Brian Mlotshwa, McKinnon Mushore (Gillian Nyathi, 74mins), Melikhaya Ncube, Reason Sibanda (Nqobile Ndlovu, 82mins), Prince Ndlovu (Marvin Sibanda, 56mins), Brighton Ncube (Nigel Banda, 74mins), Andrew Mbeba, Mason Mushore (Darlington Munkuli, 82mins)\n\nKwekwe United: Elton Nechirwe (gk), Andile Taruvinga, Leeroy Saungweme, Denis Dauda (Lenon Gonese, 31 mins), Saul Chaminuka, Emmanuel Mutimbanyoka (Simbarashe Musukutwa, 31mins), Muzenda Tafadzwa (Washington Ncube, 46mins), Hillary Bakacheza (Trevor Chikede, 54mins), Allen Gahadzikwa, Masimba Mambare, Agrippa Murimba (Timothy January, 46mins).  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/feW.jpg",
            "description": "Innocent Kurira at Barbourfields Stadium Highlanders 4-0 Kwekwe United BRIGHTON “MaNinja” Ncube’s sensational hat-trick was the highlight of the game as Highlanders dismissed Kwekwe United 4-0 in their first home match of the 2025 Castle Lager Premier Soccer League season. The striker’s goals played a pivotal role in the comfortable victory, making him the first […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "IWD: No woman or girl should be left behind",
            "url": "https://www.chronicle.co.zw/iwd-no-woman-or-girl-should-be-left-behind/",
            "content": "THE country has long been at the forefront of efforts to empower women, particularly in rural areas, where gender-based challenges often go unnoticed.\n\nThe Minister of Women Affairs, Community, Small and Medium Enterprises Development, Monica Mutsvangwa, reaffirmed this commitment to the launch of the International Womens Day (IWD) 2025 celebrations in Mutare last Friday, stressing the Governments efforts to uplift women and girls across the country.\n\nIWD, celebrated annually on March 8, honours the achievements of women across all aspects of life  social, economic, cultural, and political while also advocating for gender equality.\n\nThe theme for this years IWD, All Women and Girls: Rights. Equality. Empowerment, serves as a powerful reminder of the work that remains to be done.\n\nMinister Monica Mutsvangwa\n\nDespite significant progress, women and girls in Zimbabwe still face considerable barriers to their full potential  ranging from discriminatory laws and societal norms to limited access to essential resources such as education, healthcare and economic opportunities.\n\nHowever, Minister Mutsvangwa highlighted the achievements made so far, noting how the Government has implemented various policies aimed at promoting gender equality, including constitutional guarantees of equal rights for women and men.Empowering women, especially in rural communities, is not just a moral obligation but a strategic necessity.\n\nThe Government recognises that the key to addressing issues like poverty, hunger, and illiteracy lies in the economic and social inclusion of women.\n\nMinister Monica Mutsvangwa tours stands at the 16 Days of Activism Against Gender- Based Violence\n\nInitiatives that have already made a profound impact include training rural women on climate change mitigation and adaptation, as well as providing them with access to renewable energy sources such as solar power.These efforts have been transformative, reducing the health risks associated with traditional cooking methods and improving access to clean water and sustainable agriculture.\n\nAdditionally, womens financial empowerment is a cornerstone of Zimbabwes development strategy.Through microfinance institutions and funds such as the Zimbabwe Women Development Fund and Womens Microfinance Bank, women are gaining access to affordable loans that enable them to become successful entrepreneurs.This, in turn, drives local economic growth and strengthens communities.\n\nUnited Nations Development Fund\n\nThe international community, including the United Nations and the European Union, has also praised Zimbabwes progress, while emphasising the need for continued effort.\n\nSwedish Ambassador to Zimbabwe Per Lindgrde, highlighted that despite advancements, gender-based violence remains a significant challenge, urging a united effort to eradicate it.\n\nAs Zimbabwe celebrated International Womens Day, it is clear that the countrys progress in empowering rural women is not only a moral victory but a vital step towards achieving sustainable, inclusive development.\n\nHowever, this momentum must continue, ensuring that no woman or girl is left behind.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Minister-Monica-Mutsvangwa.jpg",
            "description": "THE country has long been at the forefront of efforts to empower women, particularly in rural areas, where gender-based challenges often go unnoticed. The Minister of Women Affairs, Community, Small and Medium Enterprises Development, Monica Mutsvangwa, reaffirmed this commitment to the launch of the International Women’s Day (IWD) 2025 celebrations in Mutare last Friday, stressing […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        },
        {
            "title": "Murumba Pitch commits to fulfilling booked shows despite split",
            "url": "https://www.chronicle.co.zw/murumba-pitch-commits-to-fulfilling-booked-shows-despite-split/",
            "content": "Showbiz ReporterMURUMBA Pitch, the acclaimed South African Amapiano duo consisting of Thabang Innocent Mangolo and Emmanuel Nanga Mathye, has officially split.\n\nThe duo announced their separation last week, stating in a joint statement that they had mutually agreed to end their partnership and contractual relationship, effective immediately.\n\nKnown for their soulful melodies and collaborations, Murumba Pitch made a significant impact on the Amapiano scene with hits such as Wena Dali, Hamba Juba and Uyeke. Their music resonated across the continent, with Zimbabweans among those who enjoyed their electrifying performances.\n\nFounded in Limpopo, South Africa, Murumba Pitch was originally established in 2012 by Venda music producer and rapper Chifo Charge, who later handed over leadership to Emmanuel Mathye in 2013.\n\nWhile the duo did not disclose specific reasons for their split, they said that the decision was mutual and aimed at allowing each member to pursue solo careers and new opportunities in the music industry.\n\nIt is with great sadness that we announce, following a meeting held on 6 March, Innocent and Emmanuel have reached a mutual decision to terminate their partnership and contractual relationship with immediate effect.\n\nThis decision marks a new chapter, and both parties are committed to moving forward independently, focusing on new opportunities and future endeavours. Both parties have agreed that a formal media statement would be released to inform the public of this development.\n\nAdditionally, the parties will be working together to ensure a fair and amicable settlement regarding the division of business interests in the Murumba Pitch brand. We thank you for your understanding and appreciate your support during this transition, it was communicated in a statement.\n\nThe announcement has been met with sadness on social media, as fans had high hopes for the duos future.\n\nOver the weekend, Mangolo reassured fans and promoters that upcoming performances would still go ahead as planned.\n\nIm no longer working with my former partner, Emmanuel Nanga Mathye, at Murumba Pitch, but were still active and making waves in the streets. I want to assure those who have booked us for future performances not to worry  well still be there and were bringing new music soon.\n\nWell also be launching new handles on Facebook and Instagram, though our YouTube and TikTok accounts will retain the same name, so dont worry, were here.Murumba Pitch joins a list of celebrated African musical duos that have split due to personal differences, creative conflicts, financial disputes, or individual ambitions.\n\nOne of Zimbabwes most beloved duos, Afrika Revenge, featuring Willis Wataffi and Mehluli Taz Moyo, gained prominence in the early 2000s with hits like Wanga, Anochengeta and Usazondisiya, before splitting in 2007. Though they never publicly disclosed the reasons for their breakup, speculation pointed to creative differences and individual ambitions. Both artistes pursued solo careers, but their chemistry as Afrika Revenge was difficult to replicate.\n\nThey briefly reunited for performances, including one in 2014, but the magic of their early days never fully returned. Many believe they could have reached greater heights had they stayed together.\n\nThe Nigerian twin duo, Peter and Paul Okoye, split in 2017 due to family disputes and business disagreements. Their solo efforts never matched their collective success. They later reconciled and reunited in 2021, but it was never the same.\n\nThe hip-hop/R&B group, once considered Kenyas future in music, disbanded around 2013 as members pursued individual careers. Despite attempts at solo ventures, none matched the groups initial impact.\n\nSouth Africas most beloved Afro-pop band, Mafikizolo, consisting of Nhlanhla Nciza and Theo Kgosinkwe, temporarily split in the early 2000s after the passing of third member Tebogo Madingoane. They later reunited and produced hits like Khona, proving that some duos work best together.\n\nAnother South African group, Malaika, featuring Bongani Nchang, Jabulani Ndaba (late), and Matshediso Tshedi Mholo, dominated the Afro-pop scene in the early 2000s with hits like Destiny, Mhla Uphel Amandla and Sebakanyana. Internal conflicts emerged in 2008 and Ndabas passing in 2013 further led to their decline. The remaining members never achieved the same success as a duo.\n\nThe split of Murumba Pitch marks a major moment in the Amapiano scene. As both members embark on solo careers, fans and the music industry will watch closely to see if they can replicate their past success. Whether they will follow in the footsteps of P-Square and reunite, or remain apart like Afrika Revenge, remains to be seen.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cxvzvdrvxcxcv.jpg",
            "description": "Showbiz Reporter MURUMBA Pitch, the acclaimed South African Amapiano duo consisting of Thabang Innocent Mangolo and Emmanuel Nanga Mathye, has officially split. The duo announced their separation last week, stating in a joint statement that they had mutually agreed to end their partnership and contractual relationship, effective immediately. Known for their soulful melodies and collaborations, […]",
            "time": "09:46",
            "date": "10 Mar 2025"
        }
    ]
}