{
    "news": [
        {
            "title": "Mother-in-law, beats up son’s wife with knobkerrie over gossip",
            "url": "https://www.chronicle.co.zw/mother-in-law-beats-up-sons-wife-with-knobkerrie-over-gossip/",
            "content": "Online Reporter\n\nA WOMAN from Tsholotsho in Matabeleland North province, beat up her daughter in law with a switch and knobkerrie accusing of spreading gossip about her.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said the woman from Sipepa area beat up her daughter in law until she was swollen all over the body.\n\nShe was sentenced to 350 hours of community service.\n\nA 37 year old Tsholotsho woman has been sentenced to 350 hours of community service for assaulting her daughter in law over gossip allegations.\n\nOn the 9th of November 2024, the accused person confronted the complainant at her homestead in Sipepa accusing her of spreading rumors. She then beat her with a switch and a knobkerrie, leaving her with a swollen body, read the statement.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/03/dec_arch_antiques_zulu-knobkerrie-2.jpg",
            "description": "Online Reporter  A WOMAN from Tsholotsho in Matabeleland North province, beat up her daughter in law with a switch and knobkerrie accusing of spreading gossip about her. In a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said the woman from Sipepa area beat up her daughter in law until she was swollen all over […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "20 agriculture engineers graduate in drone and unmanned aerial vehicle licenses",
            "url": "https://www.chronicle.co.zw/20-agriculture-engineers-graduate-in-drone-and-unmanned-aerial-vehicle-licenses/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nIN a milestone advancement toward the Governments digitalisation and modernisation of agriculture, 20 engineers from the Department of Engineering, Mechanisation, and Farm Infrastructure Development have graduated with Drone and Unmanned Aerial Vehicle licenses from the Civil Aviation Authority of Zimbabwe.\n\nThe departments chief director, Engineer Samuel Edwin Zimhunga, said the achievement aligns with the Governments agricultural transformation agenda, which integrates aero mechanization to enhance production and productivity.\n\nHe noted that drones are set to revolutionise farming practices by facilitating precision agriculture with capabilities such as feed surveillance, mapping, and chemigation.\n\nBy replacing traditional tractors for certain operations, Eng Zimhunga drones can drastically reduce the time required for tasks like spraying fields, broadcasting seeds, enabling precision farming through various applications such as feed surveillance, mapping, and even broadcasting small grains like sorghum and millet.\n\nThis initiative marks a pioneering move into the digital era for agriculture, aiming to enhance efficiency, production, and competitiveness within the sector.\n\nWe have just witnessed in this third week of January 2025 the graduation of 20 engineers in the ministry with drone and unmanned aerial vehicle licenses.\n\nWhy we are doing this is because it is one of our key pillars that we are driving in the transformation of agriculture where we are adopting aerial mechanisation as a strategy to improve production and productivity within the agricultural space, said Eng Zimhunga.\n\nDrones are the future of agriculture where we are using them for precision agriculture and other activities like fee surveillance and mapping.\n\nRecently, we have seen drones used to broadcast seeds for those crops like sorghum, and millet in the planting era.\n\nHe said the ministry was working on the automation of agriculture space and that drones have come in handy to replace traditional mechanised tractors to do certain farm operations.\n\nOne of the graduates, Eng Arnold Mahonde, said drones are a game changer.\n\nThis training was done to make sure that we get full understanding and knowledge on the technology before we roll it out to our farmers, he said.\n\nAgriculture is an ever-evolving landscape so it is not surprising that a remarkable technological advancement has taken root  the use of drones.\n\nThe unmanned aerial wonders have ushered in a new era of possibilities, propelling the agricultural sector to greater heights with their versatile applications.\n\nFrom farm pegging to pest control, drones have swiftly become an indispensable tool in the hands of farmers nationwide.\n\nWith the ability to access once-inaccessible areas, they have dramatically improved efficiency and productivity on farms, revolutionising traditional farming practices.\n\n@SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/drone.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com IN a milestone advancement toward the Government’s digitalisation and modernisation of agriculture, 20 engineers from the Department of Engineering, Mechanisation, and Farm Infrastructure Development have graduated with Drone and Unmanned Aerial Vehicle licenses from the Civil Aviation Authority of Zimbabwe. The department’s chief director, Engineer Samuel Edwin Zimhunga, said the achievement aligns […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "Health Ministry calls for increased investment in maternal health services",
            "url": "https://www.chronicle.co.zw/health-ministry-calls-for-increased-investment-in-maternal-health-services/",
            "content": "Harare Bureau\n\nThe Ministry of Health and Child Care is pushing for increased investment in health workforce retention, procurement of essential medical supplies, and improved infrastructure for maternal health services, an official has said.\n\nSpeaking during a policy briefing on maternal mortality, Dr Chipo Chimamise, national maternal health officer in the Ministry of Healths Family Health Department said there is need to improve maternal care across all levels of healthcare to stop all preventable deaths during childbirth.\n\nThe programme was organised by the Zimbabwe National Statistics Agency (ZimStat), Vital Strategies, Bloomberg Philanthropies, and Data for Health Initiative.\n\nShe said maternal deaths remain high despite ongoing efforts to strengthen emergency obstetric care.\n\nDr Chimamise said the national maternal and peri-natal death surveillance and response committee regularly reviews cases and provides recommendations.\n\nWe have trained healthcare workers under programmes like the Emergency Obstetric and Newborn Care (EmONC) initiative, but high staff turnover means facilities are constantly losing skilled personnel.\n\nWith increased investment in health workforce retention, we should see a change as a country, said Dr Chimamise.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2015/12/pregoz.jpg",
            "description": "Harare Bureau  The Ministry of Health and Child Care is pushing for increased investment in health workforce retention, procurement of essential medical supplies, and improved infrastructure for maternal health services, an official has said. Speaking during a policy briefing on maternal mortality, Dr Chipo Chimamise, national maternal health officer in the Ministry of Health’s Family […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "Meikles Limited declares dividend of US$0.70 per share",
            "url": "https://www.chronicle.co.zw/1meikles-limited-declares-dividend-of-us0-70-per-share/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nMeikles Limited has declared a dividend of US$0.70 per share, which will be payable from the profits for the financial year ending 28 February 2025.\n\nIn a notice to shareholders, Meikles Limited company secretary Mr Thabani Mpofu stated that disbursements to foreign shareholders are subject to Exchange Control approval and payment guidelines for foreign payments.\n\nNotice is hereby given that the board of directors has declared an interim dividend, Number 95, of US$0.70 per share, payable from the profits for the financial year ending 28 February 2025, said Mr Mpofu in a statement. The dividend will be payable on or about 20 February 2025.\n\nHe also noted that, due to the suspension of trading of Meikles Limited shares on the Zimbabwe Stock Exchange, there are no entitlement dates (Cum-Dividend and Ex-Dividend Dates).\n\nIt is deemed that there are no open positions, he added.\n\n@SikhulekelaniM\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-2-15.jpg",
            "description": "  Sikhulekelani Moyo, mskhulekelani16@gmail.com Meikles Limited has declared a dividend of US$0.70 per share, which will be payable from the profits for the financial year ending 28 February 2025. In a notice to shareholders, Meikles Limited company secretary Mr Thabani Mpofu stated that disbursements to foreign shareholders are subject to Exchange Control approval and payment […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "Water meter thief caught and caged",
            "url": "https://www.chronicle.co.zw/water-meter-thief-caught-and-caged/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA 20-YEAR-OLD man from Karoi, Mashonaland West Province has been handed a 12 months prison sentence for stealing water meters.Cornlius Chiwaya stole two water meters, valued at US$65 each, on 24 January 2025.In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, The water meters were positively identified by the complainants.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A 20-YEAR-OLD man from Karoi, Mashonaland West Province has been handed a 12 months prison sentence for stealing water meters. Cornlius Chiwaya stole two water meters, valued at US$65 each, on 24 January 2025. In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, “The water meters were positively […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "Man steals mother’s clothes, caught wearing them",
            "url": "https://www.chronicle.co.zw/man-steals-mothers-clothes-caught-wearing-them/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA 24-year-old man from Nyanga in Manicaland Province was sentenced to pay a US$80 fine after he stole his mothers clothes and was caught wearing them.\n\nHis mother, Theresa Nyamuda (60), dragged him to court for stealing her blouse, T-shirt, and two pairs of trousers for personal use.\n\nAccording to the National Prosecuting Authority of Zimbabwe (NPAZ), Simbarashe Chinjikupi stole his mothers clothes on 26 April 2019.\n\nHe was later seen wearing the stolen clothes, and when confronted by his mother, he became violent, forcing her to flee to a neighbours homestead, the NPAZ said.\n\nChinjikupi was instructed to pay a fine of US$80 or serve 15 days in prison.\n\nHe was ordered to pay US$20 restitution to the complainant as part of the stolen property was not recovered, said the NPAZ\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/arrested-handcuffed.jpeg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A 24-year-old man from Nyanga in Manicaland Province was sentenced to pay a US$80 fine after he stole his mother’s clothes and was caught wearing them. His mother, Theresa Nyamuda (60), dragged him to court for stealing her blouse, T-shirt, and two pairs of trousers for personal use. According to the National […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "From survivors to solutions: Teal Brunch aims to eliminate cervical cancer",
            "url": "https://www.chronicle.co.zw/from-survivors-to-solutions-teal-brunch-aims-to-eliminate-cervical-cancer/",
            "content": "Flora Fadzai Sibanda,[emailprotected]\n\nIN a bid to raise awareness about cervical cancer and the challenges women face after receiving a diagnosis, a local woman from Bulawayo is hosting a teal brunch where everything related to cervical cancer will be discussed.\n\nThe brunch, which will be held early next month at a local hotel, will run under the theme Uniting for the Elimination of Cervical Cancer.\n\nCervical cancer is a growth of cells that starts in the cervix. The cervix is the lower part of the uterus that connects to the vagina.\n\nVarious strains of the human papillomavirus, also called HPV, play a role in causing most cervical cancers. HPV is a common infection that is passed through sexual contact. When exposed to HPV, the bodys immune system typically prevents the virus from causing harm. However, in a small percentage of people, the virus survives for years. This contributes to the process that causes some cervical cells to become cancer cells.\n\nMs Barbara Kembo-Nyathi, the founder of Bold Dialogue, an organisation that raises awareness about cervical cancer, said the event is open to everyone, including men.\n\nShe said people do not often talk about cervical cancer because society still believes the only way a woman can get it is by being promiscuous.\n\nCervical cancer is such a scary topic in our societies, and people still believe the only way a woman can get it is because they have been sleeping around, which is not true. That is why we are hosting this teal brunch. Its going to be a space for everyone to talk about everything related to cervical cancer and look for possible solutions on how best we can eliminate it. This brunch is not meant for women only but is also going to be a great space to teach men about cervical cancer and how they are also potential carriers of the virus that causes cervical cancer, said Ms Kembo-Nyathi.\n\nShe said the event will feature a number of panellists, including medical professionals and cervical cancer survivors, who will all share insightful information.\n\n@flora_sibanda\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Ms-Barbara-Kamba-Nyathi.jpg",
            "description": "Flora Fadzai Sibanda, florafadzaisibz@gmail.com IN a bid to raise awareness about cervical cancer and the challenges women face after receiving a diagnosis, a local woman from Bulawayo is hosting a teal brunch where everything related to cervical cancer will be discussed.   The brunch, which will be held early next month at a local hotel, […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "Civil Registry deploys mobile teams to boost death registration in rural communities",
            "url": "https://www.chronicle.co.zw/civil-registry-deploys-mobile-teams-to-boost-death-registration-in-rural-communities/",
            "content": "Online Reporter\n\nTHE Civil Registry Department has deployed mobile teams to improve death registration in rural communities.\n\nSpeaking at a data-to-policy meeting organised by the Zimbabwe Policy Forum in Harare on Thursday, assistant Registrar-General (births and deaths) Mrs Letticia Zinengeya said the move aims to raise the death registration rate from 57 percent to 87 percent.\n\nExpanding active notification for community deaths and conducting targeted mobile registration exercises is the most cost-effective and practical approach to strengthening death registration in rural Zimbabwe, she said.\n\nImplementation of this will increase the death registration rate in rural communities from 57 percent to 87 percent.\n\nThe strategy will also enable collation of accurate and comprehensive vital statistics, which are critical for improved public health planning, informed development planning and enhanced mortality analysis.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/WhatsApp-Image-2025-01-30-at-16.11.31-680x380.jpeg",
            "description": "Online Reporter  THE Civil Registry Department has deployed mobile teams to improve death registration in rural communities.  Speaking at a data-to-policy meeting organised by the Zimbabwe Policy Forum in Harare on Thursday, assistant Registrar-General (births and deaths) Mrs Letticia Zinengeya said the move aims to raise the death registration rate from 57 percent to 87 […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "WATCH: I&DBZ on staff disability sensitization workshop",
            "url": "https://www.chronicle.co.zw/watch-idbz-on-staff-disability-sensitization-workshop/",
            "content": "Senior Business Writer\n\nTHE Infrastructure and Development Bank of Zimbabwe (I&DBZ) in partnership with the Federation of Disabled People in Zimbabwe held a disability inclusion sensitisation sessions for all its staff as part of IDBZ Disability and Accessibility Policy.\n\nSpeaking on the programme, one of the participants said : Upon the adoption of a national policy on disability in 2021, the IDBZ took it upon itself to also adopt the policy provisions from this national policy.\n\nAnd they have worked with organisations of persons with disabilities, which reviewed this policy to make sure that it is inclusive of different types of disabilities.\n\nAnd by just agreeing to be trained, to be sensitised on disability, I am quite positive that this is a positive step, a reasonable step, a progressive step to be inclusive, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tyhtr.jpg",
            "description": "Senior Business Writer THE Infrastructure and Development Bank of Zimbabwe (I&DBZ) in partnership with the Federation of Disabled People in Zimbabwe held a disability inclusion sensitisation sessions for all its staff as part of IDBZ Disability and Accessibility Policy. Speaking on the programme, one of the participants said : “Upon the adoption of a national […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        },
        {
            "title": "Media personality Zvikomborero Sibanda dies",
            "url": "https://www.chronicle.co.zw/media-personality-zvikomborero-sibanda-dies/",
            "content": "Showbiz Reporter\n\nMedia personality Zvikomborero Sibanda, a former ZBCtv news anchor, has died.\n\nAccording to family members, Sibanda, who began her career with an attachment at The Chronicle in 1999, had been battling an illness for some time and died in Bulawayo on Thursday morning.\n\nKnown for her vibrant personality, Sibanda is fondly remembered for her exceptional news-presenting skills, especially during her time on ZBCtvs breakfast news.\n\nFurther details will be provided as they become available.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ghnmjyujngh.jpg",
            "description": "Showbiz Reporter Media personality Zvikomborero Sibanda, a former ZBCtv news anchor, has died. According to family members, Sibanda, who began her career with an attachment at The Chronicle in 1999, had been battling an illness for some time and died in Bulawayo on Thursday morning. Known for her vibrant personality, Sibanda is fondly remembered for […]",
            "time": "18:30",
            "date": "30 Jan 2025"
        }
    ]
}