{
    "news": [
        {
            "title": "Cassper Nyovest rapture grips Gweru music fans",
            "url": "https://www.chronicle.co.zw/cassper-nyovest-rapture-grips-gweru-music-fans/",
            "content": "Johnsias Mutonhori,Midlands Bureau\n\nGweru music lovers are in a state of euphoria as they eagerly anticipate Cassper Nyovests highly anticipated performance this Saturday.\n\nThe South African hip-hop giant is set to perform in Gweru for the first time, sharing the stage with top local hip-hop stars. The upcoming show has ignited excitement among fans, with anticipation reaching fever pitch as the day draws closer.\n\nMusic promoter Wayne Dungeni of Glammy Events confirmed that preparations are complete, with all featured artistes ready to deliver electrifying performances.\n\nEverything is set for the big day. All the artistes we booked have confirmed their participation, and theyve promised stellar performances, he said.\n\nThe show will be a fusion of hip-hop and other genres, bringing together music lovers from different backgrounds for a dynamic experience.\n\nI believe this will be the biggest show in Gweru this year. Fans from as far as Bulawayo, Kwekwe, and Shurugwi have been purchasing tickets in anticipation of this event.\n\nDungeni added that bringing Cassper Nyovest to Gweru is a direct response to fans long-standing demand for international acts.\n\nSupporting acts for the night include Saintfloew, Holy Ten, Nisha Ts, Bagga, Ba Shupi, Kay Flow, and MC Jah Soshea, among others.\n\nAs the show approaches, it has become the talk of the town, particularly among young and middle-aged music fans eager to witness a live performance from an African hip-hop icon.\n\nThis is a once-in-a-lifetime show, and I cant miss the chance to see an international artist perform live in our city, said one excited fan, Godwin Ngungunyani.\n\nAnother fan, identified as Tatsman, added: Weve always envied Harare for hosting international acts, so Im grateful to Glammy Events for organising such a massive show for us.\n\nCassper Nyovest, known for chart-topping hits like Kusho Bani, Phuma Kim, Tito Mboweni, and Doc Shebeleza, has dominated the African hip-hop scene for years. He is a multiple award-winning artiste, with accolades including the MTV Africa Music Awards for Best Hip Hop and Best Artist in Southern Africa, the AFRIMMA Award for Best Male Artiste (Southern Africa), the Kora Award for Best Southern African Artist, the Metro FM Award for Best Hip Hop Artiste, and the South African Music Award for Best Live Audio Visual Recording.\n\nWith such a powerhouse line-up and Nyovests star power, this show promises to be a landmark event in Gwerus music scene.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-28-at-08.56.31_48bbb0c5-673x380.jpg",
            "description": "Johnsias Mutonhori, Midlands Bureau Gweru music lovers are in a state of euphoria as they eagerly anticipate Cassper Nyovest’s highly anticipated performance this Saturday. The South African hip-hop giant is set to perform in Gweru for the first time, sharing the stage with top local hip-hop stars. The upcoming show has ignited excitement among fans, with […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "ZITF Company rolls out Exhibitors Training session",
            "url": "https://www.chronicle.co.zw/zitf-company-rolls-out-exhibitors-training-session/",
            "content": "Judith Phiri,Business Reporter\n\nTHE Zimbabwe International Trade Fair (ZITF) has rolled out an Exhibitors Training session designed to prepare all participants for this years trade showcase.\n\nThe 65th edition of one of Africas premier trade showcases is set to take place from 21 to 26 April at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo running under the theme: Industrialisation: Crafting an Integrated Economic Landscape.\n\nParticipants at Exhibitors Training session\n\nThe ZITF Company has challenged exhibitors to push boundaries with fresh concepts, cutting-edge technology, and bold colour schemes that create immersive experiences and tell a compelling brand story.\n\nThis years also commemorates ZITFs Blue Sapphire anniversary (65 years), celebrating decades of excellence in promoting innovation and fostering regional business growth.\n\nZITF 2025s number of days has been extended from five to six to provide more opportunities for business and networking among exhibitors, stakeholders and visitors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-28-at-08.44.03_291b2b31-680x380.jpg",
            "description": "Judith Phiri, Business Reporter THE Zimbabwe International Trade Fair (ZITF) has rolled out an Exhibitors Training session designed to prepare all participants for this year’s trade showcase. The 65th edition of one of Africa’s premier trade showcases is set to take place from 21 to 26 April at the Zimbabwe International Conference and Exhibition Smart City […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "Regent Chief Mabhikwa stands firm despite court challenge",
            "url": "https://www.chronicle.co.zw/regent-chief-mabhikwa-stands-firm-despite-court-challenge/",
            "content": "Sikhumbuzo Moyo\n\nREGENT Chief Mabhikwa of Lupane says while she is aware that some of the Khumalo clan members have filed a High Court application challenging her appointment to the leadership throne, she will not stop executing her duties.\n\nThe chieftainship became vacant following the death of Chief Mabhikwa (Vusumuzi Khumalo) in a tragic road accident on May 22, 2022.\n\nInitially, his uncle, John Khumalo, was appointed acting chief. However, earlier this year, Ms Zanele Khumalo (35) was named regent chief by the Government to serve for nine years until Vusumuzis son, Wayne Makhosemvelo Khumalo, reached adulthood and assumed the position of substantive chief.\n\nA faction of the family has rejected the appointment of Ms Khumalo as regent chief, citing cultural traditions that allegedly exclude women from assuming such roles.\n\nHowever, during a brief interview during the commissioning of two classroom blocks at Gobakhulu Primary School in Jotsholo on Tuesday, Regent Chief Mabhikwa said she will stand guided by the High Court judgment at whatever time it will be delivered but for now, she was executing her duties.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/r3.jpg",
            "description": "Sikhumbuzo Moyo REGENT Chief Mabhikwa of Lupane says while she is aware that some of the Khumalo clan members have filed a High Court application challenging her appointment to the leadership throne, she will not stop executing her duties. The chieftainship became vacant following the death of Chief Mabhikwa (Vusumuzi Khumalo) in a tragic road […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "President warns chaos mongers",
            "url": "https://www.chronicle.co.zw/president-warns-chaos-mongers/",
            "content": "Zvamaida Murwira and Joseph Madzimure,Harare Bureau\n\nZIMBABWEANS should continue to carry out their duties and ignore calls by some chameleon-like persons threatening to cause chaos in the country as that will be thwarted by the State security that will be deployed to protect property and citizens, President Mnangagwa has said.\n\nHe described those calling for protests as retrogressive individuals who were pursuing delusional ambitions.President Mnangagwa, who is also Zanu-PFs First Secretary, said this yesterday while addressing the 125th Central Committee meeting held at the party headquarters in Harare.\n\nThe Central Committee meeting is held every three months in line with the party constitution.To be a leader in our revolutionary mass Party, Zanu-PF is never an entitlement or a right. We must remain anchored on the commitment to wholeheartedly serve the people of our great motherland, Zimbabwe. It is most unfortunate that a retrogressive trend has emerged, with some members of our Party, showing their chameleon-like characters as willing accessories to our detractors for the purpose of desecrating our rich revolutionary heritage. Pasi navo, said President Mnangagwa to a rousing applause.\n\nForty-five years after we defeated the retrogressive spirit of individualism and the Rhodesian settler regime, it is a shame that a small clique of individuals, are pursuing delusional ambitions and selfish interests. Their actions are an affront to the Partys principles and grossly taint our countrys image, as well as the gains of our liberation struggle. These rogue opportunists will soon meet their fate. The Party and our peace-loving nation, are commended for bravely standing firm against such treasonous acts of indiscipline. People are called upon to go about their business as usual. Our state security infrastructure is in place to protect property and the safety of all Zimbabweans, from Plumtree to Mutare, Chirundu to Beitbridge, said President Mnangagwa.\n\nHe congratulated the party for winning in local authority by-elections held in Mashonaland West province and urged members to redouble their efforts in the forthcoming by-elections in Gutu East and Glen View South polls.Gutu East constituency became vacant after Zanu-PF recalled the incumbent Benjamin Ganyiwa for indiscipline while Glen View South constituency was declared vacant following the death of CCC legislator, Mr Gradmore Hakata.\n\nOur focus now shifts to winning Gutu East Constituency and Glen View South Constituency, here in Harare Province, where the youthful Comrade Tsitsi Tawomhera is our candidate, said President Mnangagwa.He commended Zimbabweans for taking it upon themselves to engage in nation-building activities.\n\nThrough increased production and productivity, the people of Zimbabwe, in every sector of the economy are applauded for dismantling the spectator mentality. To date, it is pleasing that all Zimbabweans here at home and those abroad are all working hard, demonstrating resilience, and focus towards the attainment of our vision to become an empowered and prosperous upper middle-income society. Congratulations Zimbabweans, said President Mnangagwa.\n\nThe evidence is all around us that our national development philosophy Nyika inovakwa, inotongwa, inonamatigwa nevene vayo/ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi balo is taking root across communities and the citizenry as a whole. Under the Agriculture and Food Security Pillar of our development strategy, we are poised to realise yet another bumper harvest, which was occasioned by the good rains received across the country.\n\nThe country is on track with regard to accelerating the establishment of new irrigation schemes and the rehabilitation of existing projects. The Village Business Units and Presidential Borehole Drilling Scheme will have a profound impact on growing our countrys food security as well as household incomes.\n\nPresident Mnangagwa said these milestones were reflective of the concerted efforts by Government in implementing Zanu-PF resolutions as directed by the partys annual conference.\n\nIn the mining sector, the commissioning of the Palm River, a US$3,6 billion investment project in Beitbridge, Matabeleland South Province and the expansion of other mining projects across the country, is a clear testimony of our conducive business operating environment. To achieve energy security and self-sufficiency, the construction of an array of projects by Independent Power Producers is on course. These are augmenting our green-energy integrated power generation initiatives, he said.\n\nPresident Mnangagwa outlined several projects the Government is undertaking aimed at improving peoples livelihoods.They include the Presidential Youth Empowerment Facility, the War Veterans Fund and the Borehole Drilling Scheme.\n\nAs the Party, it is our expectation that beneficiaries of these programmes, take up productive, profitable and viable economic enterprises. This should not only bring about the transformation of livelihoods at the household level but have a positive ripple effect to the local economies, at the village and ward levels, he said.\n\nTurning to the partys Central Committee meeting, President Mnangagwa said the session will provide members an opportunity to collectively reflect on the impact of the international and continental geopolitical dynamics.It is critically important, therefore, that we stand ready to craft responsive strategies for the good of both our Party and the nation as a whole.\n\nThe Central Committee being the principal decision-making body of our colossal revolutionary mass Party, is called upon to proffer the requisite recommendations and decisions to propel our peoples revolution, Party Vision as well as the national aspirations and goals, he said.\n\nWe are, as the Central Committee, vested with an array of functions and powers, including co-ordination of Party activities across all organs. This meeting will accordingly receive comprehensive reports, covering the intervening period. These include an outlook at the state of our Party, economy and the progress on the various people-centred projects and programmes, which our Government is implementing throughout the country.\n\nPresident Mnangagwa invited all citizens to attend the 34th Independence Day national celebrations to be held in Nembudziya, Gokwe North district in Midlands province under the theme, Devolve and Develop Together towards Vision 2030.He commended members for their ideological aptitude and national consciousness shown in executing the work of the party.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dgg-680x380.jpg",
            "description": "Zvamaida Murwira and Joseph Madzimure, Harare Bureau ZIMBABWEANS should continue to carry out their duties and ignore calls by some “chameleon-like” persons threatening to cause chaos in the country as that will be thwarted by the State security that will be deployed to protect property and citizens, President Mnangagwa has said. He described those calling for […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "Zimbabwe turns leaf in agrarian revolution",
            "url": "https://www.chronicle.co.zw/zimbabwe-turns-leaf-in-agrarian-revolution/",
            "content": "Chronicle Writer\n\nZIMBABWE has gazzetted close to 50 agricultural commodities eligible for export trading riding on the establishment of the Zimbabwe Mercantile Exchange (ZMX)s Warehouse Receipt System a few years ago.\n\nOfficiating at the Association of Commodities Exchanges Annual Conference which ended in Victoria Falls yesterday, Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Dr Anxious Masuka, said the country was angling for huge spoils under the African Continental Free Trade Area (AfCFTA), which introduced a structured liberalised commodity-marketing framework, a departure from the centralised-government-controlled marketing system of the past.\n\nDr Masuka said the AfCFTA presents a unique continent-wide opportunity to deepen trade, enhance collaboration, and accelerate transformation of our economies.\n\nHe said the Agriculture, Food Systems and Rural Transformation Strategy (AFSRTS) launched in August 2020 by President Mnangagwa was meant to ensure national food security and sovereignty, contribute to nutrition security, improve livelihoods, contribute to economic development and contribute to peace and security through affirmation and re-affirmation of boundaries, which has set the tone for liberalising trade.\n\nIn this context, the Warehouse Receipt System Act (Chapter 18:25) was launched in 2020 with the Zimbabwe Commodity Exchange (ZMX), in which Government has a shareholding, but operating independently under the Companies and Other Entities Act (Chapter 24:3), being operationalised in 2022 to provide an additional marketing platform for farmers to act as a platform to mobilise resources to finance agriculture and to act as a price discovery platform, said Dr Masuka.\n\nTo date, I have gazetted 48 commodities for trade eligibility on the Warehouse Receipt System that anchors the ZMXs operations.\n\nThese commodities range from maize, cotton to livestock, wheat, soya beans, red and white sorghum, sugar beans, white rice, and rice bran, he added. Minister Masuka said ZMX has established a network of 33 warehouses providing 642,000 metric tonnes of storage space in seven of the countrys 10 provinces.\n\nDr Masuka said ZMX is increasingly becoming an active trading platform, as farmers and traders become more aware of its utility as an exchange mechanism that guarantees more timeous payments. He said ZMX is also exploring a robust forward and future contracts platform, which dovetails with intra-continental trade, by providing a structured and transparent market mechanism that enhances price discovery, mitigates risks, and ensures supply chain predictability.\n\nThe establishment of the AfCFTA Association of Commodity Exchanges (A-ACX) is a testament to Africas collective desire and commitment to achieve economic integration through efficient and transparent commodity markets.\n\nBy facilitating secure and reliable forward and futures contracts, the ZMX can empower farmers with guaranteed off-take agreements, reducing post-harvest losses and improved financial planning, said Dr Masuka. He said Zimbabwe is building capacity to export key commodities. The country boasts of surplus yield in a number of products in the past few years. Zimbabwe now has an annual surplus of wheat of about 250 000 metric tonnes, 290 million kilograms of tobacco, as well as surplus sugar and many horticultural products.\n\nHe said warehouse receipts totalling 437,000 metric tonnes across nine commodities (maize, wheat, soya beans, red and white sorghum, ginned cotton seed, sugar beans, white rice, and rice bran) have been cumulatively issued by ZMX, which is now operating weekly auctions.\n\nAs Africa still imports US$80 million to US$100 billion worth of food annually, Zimbabwe is actively exploring the export opportunities brought about by the AfCFTA and A-CX, said Dr Masuka.\n\nWith enhanced value-addition and beneficiation, coupled with the creation of competitive production and pricing models, establishment of risk mitigation through appropriate insurance models, the increasing use of innovative payment platforms and use of more efficient logistics and transportation networks, Zimbabwe can indeed contribute to stable, affordable, and friendly intra-Africa trade. Dr Masuka said the conference, which ended yesterday, under the theme: Scaling Intra-African Trade: Leveraging Commodity Exchanges for Economic Resilience and Growth, has created a platform for driving the continent towards Agenda 2063: The Africa We Want targets.\n\nSpeaking on the same platform, Matabeleland North Provincial Affairs and Devolution Minister Richard Moyo called for strengthening of commodity exchanges and enhancing intra-African trade for sustainable economic growth.Lets embrace the spirit of unity and collaboration to build stronger trade networks and market systems that will benefit the entire African continent, he said.\n\nZMX chief executive, Mr Collen Tapfumaneyi, said there is a need to address the paradox of abundance and scarcity where the continent has immense wealth of natural resources and human capital yet millions grapple with poverty and hunger.He said the AfCFTA is a key driver in implementation of Sustainable Development Goals (SDGs) by creating a single market for goods and services.\n\nZMX is excited to have embarked on the journey to achieve this, and through its membership in the AfCFTA, it aims to improve access to markets, and ensure access to markets, said Mr Tapfumaneyi.At continental level, Africa is also leading its own initiatives to tackle the pressing issues of hunger, post-harvest losses, enhance intra-continental trade, promoting value addition, investment in storage and logistics, and market linkages that ensure farmers and producers get fair returns for their goods.\n\nBy unlocking trade barriers and fostering industrialisation, AfCFTA is not only a tool for economic growth but a vital instrument in the fight against hunger and poverty.\n\nZMX is a founding member of the AfCFTA Association of Commodities Exchanges and together it is keen to build a more interconnected and resilient African economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/4gg.jpg",
            "description": "Chronicle Writer ZIMBABWE has gazzetted close to 50 agricultural commodities eligible for export trading riding on the establishment of the Zimbabwe Mercantile Exchange (ZMX)’s Warehouse Receipt System a few years ago. Officiating at the Association of Commodities Exchanges Annual Conference which ended in Victoria Falls yesterday, Minister of Lands, Agriculture, Fisheries, Water and Rural Development, […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "Kaindu unfazed… amid Sakupwanya’s 4-0 prediction",
            "url": "https://www.chronicle.co.zw/kaindu-unfazed-amid-sakupwanyas-4-0-prediction/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS coach Kelvin Kaindu is unfazed by the bold prediction from Scottland FC owner Scott Sakupwanya, who has confidently forecasted a 4-0 victory for his side when the two teams meet at Barbourfields Stadium this Sunday.\n\nKaindu insists that football is decided on the field of play, and his focus remains on his teams preparation and performance rather than external comments.\n\nI have been hearing about the prediction, but its difficult for me to comment on something I have not seen. As Ive said, we respect them, and football is played on the field. If they feel they can beat us 4-0, its their own feeling because it is what they believe they are capable of doing, said Kaindu.\n\nThe match promises to be a spectacle brimming with emotion and competitiveness. For Highlanders, the game is more than just a league fixture; it is a crucial test of their resilience and ability to rise above challenges.\n\nAfter a difficult start to the season, with an under-strength squad due to injuries and a transfer ban, Kaindus side is hoping for a more complete squad as they welcome Scottland FC.\n\nWe are back, the league resumes, and we are playing Scottland on Sunday. There are high expectations from everybody, but we are happy that in terms of our medical situation, most of our players are almost back to 100 percent in terms of their match fitness. Weve had challenges with registering a full-strength squad, but we are hopeful that this week we may have a full squad and also have more options, said Kaindu.\n\nThis game is not just about team tactics and injuries; its also about pride. Scottland FC, who have already made waves since their promotion to the top-flight league, arrive in Bulawayo with an air of confidence as they rank among the better-resourced teams.\n\nKnown for their high-profile players and innovative approach to fan engagement, the new boys will surely bring the noise to Barbourfields, where anticipation for the game is high.\n\nScottland FCs star-studded squad, featuring former Highlanders players Peter Muduhwa and Lynoth Chikuhwa, adds an extra layer of intrigue to the encounter. Both players will return to face their old club, a storyline that will no doubt stir up emotions. Muduhwa, once the vice-captain of Bosso, and Chikuhwa, who claimed the PSL Boot Award last season, will face off against their former teammates in a highly charged atmosphere.\n\nWe have so much respect for them. They have players who have been with us for some time, and that will bring some emotions. But we just want to respect them because football is played on the field, and we hope the best team wins, said Kaindu.\n\nThe contest between Highlanders and Scottland will see a clash of different football philosophies. Highlanders, despite their recent struggles, have an experienced team featuring captain Andrew Mbeba, Mason Mushore, Mckinnon Mushore, Melikhaya Ncube and striker, Brighton MaNinja Ncube.\n\nScottland will rely on the experience of players like Khama Billiat, Walter Musona, and goalkeeper Talbert Shumba, who bring a wealth of PSL experience to their youthful side.\n\nScottlands exciting debut season has not gone unnoticed. Their sharp marketing strategies, highlighted by the success of their replica jerseys and innovative social media presence, have set the stage for a packed Barbourfields Stadium. This game will not only mark their first visit to Bulawayo but will also be a major statement of intent to the rest of the league.\n\nWe respect them; they are above all the other promoted teams. Its not going to be an easy game. We have to be at our best, said Kaindu.\n\nFor Highlanders, this is more than just a three-point chase. Its about restoring their pride in front of a passionate home crowd.As Kaindu rightly said, Football is played on the field, and come Sunday, all eyes will be on Barbourfields to see, which team can leave with three points and bragging rights.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Kelvin-Kaindu-1.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS coach Kelvin Kaindu is unfazed by the bold prediction from Scottland FC owner Scott Sakupwanya, who has confidently forecasted a 4-0 victory for his side when the two teams meet at Barbourfields Stadium this Sunday. Kaindu insists that football is decided on the field of play, and his focus remains on […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "World Theatre Day: More needs to be done to make theatre great again",
            "url": "https://www.chronicle.co.zw/world-theatre-day-more-needs-to-be-done-to-make-theatre-great-again/",
            "content": "Langalakhe Mabena/Trust KhosaZimpapers Arts and Entertainment Hub\n\nFor many years, theatre has been used as a pivotal space for social commentary, cultural exploration, entertainment and profoundly educating members of the society.\n\nTheatre has not just been for entertainment as it has been used as a tool for community engagement, education and raising awareness about societal issues.\n\nBulawayo has long been a hub for vibrant theatre and performing arts, as the city boasts a rich cultural heritage. Its theatre scene has played a vital role in preserving and promoting the nations history, traditions and stories. The Bulawayo Theatre and Intwasa Arts Festival have been providing platforms for various forms of performing arts, including theatre. However, the theatre scene in the city has faced challenges, including limited funding, inadequate spaces for performances and struggles to attract younger audiences.\n\nAs the universe celebrated World Theatre Day yesterday, likely due to these factors, Bulawayo had no activity or rather a play that was portrayed in the citys theatre spaces in commemoration of the day.\n\nWith the city known to be a cultural hub in the Zimbabwean artistic space, it was a shame for local theatre practitioners to not fully celebrate such an important date on the calendar, especially considering how talented the city is when it comes to curating plays.\n\nDaniel Maposa\n\nOne of the arts doyens, Raisedon Baya, who is regarded as the cornerstone of theatre, was a disappointed man. He said theatre practitioners have let down theatre lovers as they robbed them of not consuming anything stage-related in commemorating World Theatre Day.\n\nToday (yesterday) marked World Theatre Day, and I was filled with a mixture of sadness and guilt. I had hoped to celebrate by attending a live performance, but unfortunately, I was not aware of any shows happening in my city.\n\nLast year, I vowed to do something to commemorate this day, but time slipped away and I did nothing. Now, Ill likely hear speeches about the importance of theatre, but honestly, theatre doesnt need words  it needs action. It needs to be seen, to be experienced, said Baya.\n\nDespite having talent in the city, Baya said there are many reasons why theatre is low in Bulawayo, including cutting corners, lack of resources, personnel, venues, lack of good material to produce as well as lack of producers and directors.There are a lot of things were not doing right. First, we are all busy training actors, but theatre makers are not actors. Actors are mostly performers. We are not producing playwrights to create or write plays.\n\nWe arent producing directors to direct the actors we are producing as well. We arent producing producers to put together productions. Our biggest mistake is we are cutting corners  creating this belief that an actor will write, direct and produce their own plays. Its a totally wrong approach, said Baya.\n\nThabani Hillary Moyo\n\nCelebrated theatre playwright and teacher Thabani Hillary TH Moyo, who is the visionary behind Centre for Talent Development (CTD)  a theatre organisation specialising in using live theatre acts to advance inclusive and exciting academic packages, said a lot needs to be done to make theatre great again in Zimbabwe.\n\nTheatre used to be cherished in Bulawayo and Zimbabwe as a whole and it seems people are slowly losing interest in the craft. To make theatre great again, I believe there is a need to have increased funding and infrastructure support.We also need more structured mentorship for young artistes and enhanced collaboration between schools, theatre companies and the corporate sector.\n\nPolicies that promote local productions, better marketing strategies, and the revival of dedicated performance spaces would also help grow audiences.\n\nAdditionally, we need to integrate theatre more deeply into the education system and foster community engagement to ensure its sustainability and wider appreciation, said Moyo.\n\nAnother thespian, Zenzo Nyathi, shared his disappointment about the current state of the sector.Im not happy with how the theatre sector has been. I havent been happy for a long time, he expressed.Memory Kumbota said World Theatre Day is a time to acknowledge the profound impact of theatre on our lives and to promote its continued growth and development.\n\nAs a sector, Im confident that were making progress. For me, its not just about performances on this day; its a moment to reflect on what more we can do to expand the sector, create more performances and establish new spaces and audiences throughout the year, he said.\n\nLocal theatre gurus in Harare, led by Daniel Maposa, agreed that World Theatre Day should not go unnoticed.World Theatre Day is an important occasion for the theatre sector both globally and in Zimbabwe. It provides an opportunity for theatre practitioners to reflect on the progress made and the challenges still facing the industry, said Maposa.\n\nIn Zimbabwe, the sector grapples with numerous challenges, including inadequate financial, institutional and policy support. We also mark this day at a time when theatre is no longer a fully-fledged degree programme, particularly at the University of Zimbabwe. This could lead to future skills gaps and intellectual deficiencies, ultimately hindering the growth of the industry.\n\nHowever, this day is also about celebrating achievements. Despite these challenges, the resilience of the theatre sector is commendable. We hope to use this moment to strategise and implement robust plans for its growth, he added.Jasen Mphepo, of Jasen Mphepo Theatre in Harare, also shared the significance of the day.\n\nWorld Theatre Day showcases the incredible diversity of theatre practices, traditions and styles from around the world. By celebrating this day, we recognise the role of theatre in our lives, foster a sense of community, and promote deeper appreciation for this ancient yet vibrant art form, he explained.\n\nMphepo, who owns one of Harares prominent arts business spaces, said they hosted over 90 students, mostly juniors from Heritage High School. They showcased three short, thought-provoking plays and complemented them with poetry performances.\n\nMeanwhile, renowned filmmaker Daves Guzha, who is on an international tour, has promised theatre lovers in the capital city exciting projects upon his return. Guzha runs regular plays and mentorship programmes at Harares Theatre in the Park.It is hoped that the challenges faced by the theatre industry will be addressed so that local thespians can continue to create and perform with passion, revitalising the sector and bringing greater recognition to local talent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/gjfmj.jpg",
            "description": "Langalakhe Mabena/Trust Khosa Zimpapers Arts and Entertainment Hub For many years, theatre has been used as a pivotal space for social commentary, cultural exploration, entertainment and profoundly educating members of the society. Theatre has not just been for entertainment as it has been used as a tool for community engagement, education and raising awareness about […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "Watch: Ingwebu Breweries launches $1,7 million PET packaging plant",
            "url": "https://www.chronicle.co.zw/ingwebu-breweries-launches-17-million-pet-packaging-plant/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nBULAWAYO-BASED Ingwebu Breweries is making significant strides in modernising its production processes after completing the installation of a state-of-the-art US$1,7 million Beer PET (Polyethylene Terephthalate) packaging plant.\n\nThe ambitious project aims to enhance product distribution, extend shelf life and position the company competitively in the fast-changing beverage industry.\n\nThe investment aligns with Ingwebu Breweries broader strategy to diversify its packaging solutions, ensuring convenience and accessibility for consumers.\n\nKnown for its opaque sorghum beer packaged in traditional containers, the company is expanding into PET packaging, which is expected to improve product preservation while catering for modern consumer preferences.\n\nAccording to Ingwebu Breweries management, the PET packaging project is expected to revolutionise the companys production process.\n\nBy shifting to plastic bottle packaging, the brewery will enhance its ability to distribute products to wider markets, particularly in areas where traditional containers pose logistical challenges.\n\nFor instance, with just two weeks in operation, the new plant has enabled the firm to distribute to the Beitbridge market due to extended product shelf life.\n\nSpeaking to Business Hub yesterday, the companys managing director, Mr Dumisani Mhlanga, highlighted the importance of the investment.\n\nWe have been operating the new plant for the past two weeks. This project is a game-changer for Ingwebu Breweries. The PET packaging plant will allow us to modernise our operations, increase production efficiency, and meet growing consumer demand for convenient and durable packaging, said Mr Mhlanga.\n\nIts been very exciting because our consumers are happy. We have not penetrated the market fully in places such as Beitbridge which are new market areas.\n\nI have no doubt we are going to grow volumes there. We have also gone to Kwekwe and the target is to go as far as Chegutu and Kadoma.\n\nThe installation of the Beer PET plant comes at a time when Zimbabwes beverage industry is experiencing increased competition from international players.\n\nWith its deep-rooted heritage in Bulawayo, Ingwebu Breweries is looking to leverage innovation to maintain its market share and remain a dominant force in the industry.\n\nThe PET packaging is becoming increasingly popular due to its weight, cost-effectiveness and environmental benefits when properly managed through recycling initiatives.\n\nThe investment also signals Ingwebu Breweries commitment to sustainability and modern business practices.Beyond its impact on production and distribution, the Beer PET project is expected to create employment opportunities in Bulawayo and surrounding areas in the process providing much-needed economic benefits to local communities.\n\nFor now, we want to grow the product and in the next few years, we will be talking about having a new plant to increase capacity, said Mhlanga.\n\nWe have about 400 workers and the new project has employed an additional 21. Some of the workers running the plant were moved from other sections.\n\nMr Mhlanga added that the new plant will further boost support to local farmers.We have sorghum contract farmers in Chikombedzi and Binga. This model has existed for a long time. Last year we could, however, not get much from them due to drought. We are hopeful of better fortunes this year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yr-2.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw BULAWAYO-BASED Ingwebu Breweries is making significant strides in modernising its production processes after completing the installation of a state-of-the-art US$1,7 million Beer PET (Polyethylene Terephthalate) packaging plant. The ambitious project aims to enhance product distribution, extend shelf life and position the company competitively in the fast-changing beverage industry. The investment aligns with […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "Municipal police to get arresting powers",
            "url": "https://www.chronicle.co.zw/municipal-police-to-get-arresting-powers/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nMUNICIPAL police across the country will soon be granted arresting powers once amendments to the Urban Councils Act are finalised.\n\nThe move is aimed at strengthening local governance and addressing by-laws violations, including illegal street vending.The announcement was made by Local Government and Public Works Minister Daniel Garwe during a press conference at the Bulawayo City Council (BCC) chambers yesterday.\n\nHe also reiterated President Mnangagwas directive for municipal police to treat vendors with dignity and refrain from harassing them.\n\nAs we speak, we are amending the Urban Councils Act to grant municipal police arresting powers.However, for now, they will continue working closely with the Zimbabwe Republic Police (ZRP), who are mandated to enforce law and order, said Minister Garwe.\n\nLocal Government Minister Daniel Garwe\n\nHe added that President Mnangagwa had directed his ministry to work with councils to build market stalls and decent vending spaces as a matter of urgency.\n\nOur role is to provide suitable locations for vendors to operate from. His Excellency, President Mnangagwa yesterday (Wednesday) directed us to expedite the process of identifying and developing infrastructure that ensures a dignified working environment for vendors, said Minister Garwe. He however, stressed that night vending is illegal and should not be permitted by councils. Addressing mayors and town clerks at a diplomatic protocol and etiquette training workshop, he ordered an immediate stop to night vending activities.\n\nOur Constitution does not have provisions for night vending. As Government we have noted many ills that come with night vending which include drug and substance abuse as the drugs are sold at night and as such councils should stop forthwith night vending, said Minister Garwe.\n\nHe said councils do not have sanitary facilities for night vending resulting in vendors relieving themselves in alleys and other dark corners thereby increasing the risk of diseases outbreak.Earlier in the day, Minister Garwe visited the Bulawayo Fire Station, where he commended the partnership between BCCs fire department and the UK-based fire and rescue team, Operation Florian.\n\nHe lauded the Florian team for providing firefighting equipment, time and expertise to train local firefighters.Zimbabwe is building its firefighting capacity to global standards and to have a team from the UK coming to assist us in training our firemen is something we treasure as a country, said Minister Garwe.\n\nAccompanied by his deputy, Albert Mavhunga, Minister Garwe highlighted that the Civil Protection Department under his ministry is responsible for managing all disasters, including fires.\n\nBCC chamber secretary, Mrs Sikhangele Zhou, informed Minister Garwe that the station is training firefighters from 21 other local authorities.\n\nMinister Garwe was also shown four Red Lions fire tenders acquired from Belarus through devolution funds, three of which are earmarked for Tsholotsho, Binga, and Matobo rural district councils.\n\nThese tenders will be delivered once training is completed next month.Minister Garwe also held three meetings at the BCC chambers, engaging separately with the business community, city councillors and management, before meeting both groups together to address the budget impasse.\n\nHe stressed that no council can function without an approved budget as it negatively impacts service delivery.Minister Garwe urged BCC to cultivate a culture of extensive stakeholder consultations to ensure the citys prosperity.\n\nThe business community raised several concerns affecting budget approval, and the local authority also outlined its challenges. We facilitated discussions to address these issues and aim to approve the budget today, he said.\n\nMinister Garwe further announced the formation of a team of financial specialists, including representatives from the business community, residents, Bulawayo City Councils finance director, and finance experts from his ministry, to ensure a collaborative approach in resolving budgetary matters.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Municipality-Police-680x380.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw MUNICIPAL police across the country will soon be granted arresting powers once amendments to the Urban Councils Act are finalised. The move is aimed at strengthening local governance and addressing by-laws violations, including illegal street vending. The announcement was made by Local Government and Public Works Minister Daniel Garwe during a press […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        },
        {
            "title": "COMMENT: Vendors should complement Government efforts",
            "url": "https://www.chronicle.co.zw/comment-vendors-should-complement-government-efforts/",
            "content": "President Mnangagwa on Wednesday met representatives of vendors at State House and discussed issues affecting the sector. Cde Mnangagwa emphasised during the meeting that Governments attempt to formalise the informal sector should not be perceived as a threat as it is meant to bring order and sanity to the sector.\n\nHe said Governments doors remain open to vendors and others in the informal sector as Government appreciates that the sector plays a vital role in the countrys economic development.As we are all aware, the informal sector plays a crucial role in Zimbabwes economy, providing livelihoods for millions of citizens.\n\nHowever, there have been some worrisome trends affecting the sector which if left unchecked will have dire ripple effects on the country and overshadow the important role of this critical sector, said President Mnangagwa.\n\nHe said the attempt by the Government to formalise the informal sector is meant to create decent work spaces and as such was not a threat to the survival of vendors and others in the informal sector. President Mnangagwa said Government is always ready to hear vendors concerns hence its doors are always open.\n\nHe urged vendors and others in the informal sector to complement Government efforts to bring order and sanity to the sector as it moves to formalise and modernise the sector which he described as very crucial to economic development. President Mnangagwa said all sectors of the economy have an obligation to contribute to the countrys development for the benefit of not only the present generation but the future generations as well. He called for free and frank dialogue between Government and those in the informal sector towards realisation of national goals. Let our dialogue be guided by the true spirit of nation-building and the national interest, said President Mnangagwa.\n\nHe said Government on its part was committed to facilitate the establishment of convenient and accessible decent work spaces for vendors.\n\nPresident Mnangagwa who said maintenance of order was non-negotiable, said the Ministry of Local Government and Public Works was directed to work with councils and the private sector to build market stalls and decent work spaces for vendors.\n\nThe obtaining chaos in many cities and towns cannot be allowed to continue and we hope vendors and others in the informal sector appreciate the Governments concerns. It is the responsibility of councils to ensure there is orderliness especially in the Central Business Districts.\n\nThis law of the jungle is a recipe for disaster hence councils should act fast to address the issue of providing decent work spaces\n\nfor vendors and others in the informal sector. A few years ago Zimbabwe witnessed an outbreak of cholera in most cities and towns that claimed thousands of lives and we do not want a repeat of this.\n\nPavements should be cleared of vendors and no vendors should be allowed to operate in front of shops. Agreed, the informal sector contributes significantly to the economic growth of a developing country like ours but this should not be a licence to operate in undesignated places.\n\nThe Government is cognisant of the fact that the informal sector is a source of livelihood for many families hence President Mnangagwa on Wednesday met the representatives of the vendors to hear their concerns.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xcdfsxczxcz.jpg",
            "description": "President Mnangagwa on Wednesday met representatives of vendors at State House and discussed issues affecting the sector. Cde Mnangagwa emphasised during the meeting that Government’s attempt to formalise the informal sector should not be perceived as a threat as it is meant to bring order and sanity to the sector. He said Government’s doors remain […]",
            "time": "09:46",
            "date": "28 Mar 2025"
        }
    ]
}