{
    "news": [
        {
            "title": "Beitbridge Border Post records major Easter Holiday traffic increase",
            "url": "https://www.chronicle.co.zw/beitbridge-border-post-records-major-easter-holiday-traffic-increase/",
            "content": "Thupeyo Muleya[emailprotected]\n\nBEITBRIDGE Border Post saw a significant surge in traffic this Easter, with approximately 70 000 travelers passing through compared to 47 000 during the same holiday last year.\n\nAn average of 8 000 travellers use Zimbabwes busiest inland port of entry each day during off-peak periods. However, during peak periods like public holidays, the figures rise to between 15 000 and 20 000 people per day.\n\nAccording to statistics from the Department of Immigration, there has been a steady increase in cross-border movement across the freight, bus, private vehicle, and pedestrian terminals, a trend largely attributed to improved efficiencies introduced at the border.\n\nAuthorities report that automation has played a pivotal role in streamlining operations and eliminating bottlenecks. The Department of Immigration is now operating with an online border management system and automated gates, significantly expediting the clearance process.\n\nOn the customs side, the Zimbabwe Revenue Authority (ZIMRA) is implementing a pre-clearance system along with the electronic Temporary Import Permit (eTIP) platform, which has reduced cargo processing times to under three hours.\n\nThe Zimborders Consortium, which is managing the border infrastructure under a US$300 million public-private partnership with the Government, is also leveraging technology to monitor and improve traffic turnaround times. Authorities are now able to clear at least 60 percent of traffic, both commercial and private, within three hours.\n\nRegional Immigration Officer in charge of Beitbridge, Mr Joshua Chibundu, said that adequate manpower was deployed across the freight, bus, and light vehicle terminals during the Easter period.\n\nBetween 17 and 21 April, we processed a total of 32 901 entries and 34 915 exits, bringing the total number of travellers to 67 816, said Mr Chibundu.\n\nHe advised travellers to use official clearance channels to avoid delays and complications.\n\nAs a department, we do not work with intermediaries. We urge travellers to ensure that their passports are cleared directly by immigration officers and in their presence, he said.\n\nTo maintain order and ensure lawful movement, Mr Chibundu noted that immigration authorities had deployed sufficient security personnel to monitor known crime hotspots at the border.\n\nDuring the Easter period, a total of 456 people were arrested for violating immigration laws. This included touts and illegal vendors, who were handed over to the police.\n\nThree migrants were denied entry into Zimbabwe, while 598 people were prevented from exiting into South Africa due to improper documentationeither lacking permits or travelling on expired documents.\n\nMr Chibundu also reminded travellers with minors to ensure they carry the correct documentation.\n\nGuardians or parents travelling with children under 18 must carry valid passports for themselves and the children, as well as the childrens birth certificates. If only one parent is travelling, they must have an affidavit from the non-travelling parent, and copies of that parents ID or passport, he said.\n\nEnds CKD\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/bvncvndtybv.jpg",
            "description": "Thupeyo Muleya thupeyo.muleya@zimpapers.co.zw BEITBRIDGE Border Post saw a significant surge in traffic this Easter, with approximately 70 000 travelers passing through compared to 47 000 during the same holiday last year. An average of 8 000 travellers use Zimbabwe’s busiest inland port of entry each day during off-peak periods. However, during peak periods like public […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "VPs Mohadi, Chiwenga commend top-notch ZITF exhibition stands",
            "url": "https://www.chronicle.co.zw/vps-mohadi-chiwenga-commend-top-notch-zitf-exhibition-stands/",
            "content": "Sikhumbuzo Moyo and Rutendo Nyeve\n\nVICE-PRESIDENTS Constantino Chiwenga and Kembo Mohadi yesterday toured exhibition stands at the ongoing Zimbabwe International Trade Fair (ZITF), commending both local and international exhibitors for their innovation and contributions to the countrys economic growth agenda.\n\nAccompanied by Cabinet Ministers, senior Government officials, and ZITF Company board members, the Vice-Presidents toured several key exhibition halls at the Zimbabwe International Exhibition Centre, engaging with participants across diverse sectors including mining, agriculture, manufacturing, health, and information and communication technologies (ICT).\n\nThey also interacted with youth innovators and small-to-medium enterprises (SMEs), encouraging them to scale up production, commercialise their innovations, and tap into regional and continental markets.\n\nSpeaking after the tour, Vice-President Chiwenga called on industry players to embrace innovation from local universities and technical colleges, urging stronger partnerships between academia and business.\n\nWhat I have seen is what we are advocating. We want our institutions to get involved with students who are in these universities across the country and use their talents, he said.\n\nWe have seen quite a lot of innovative ideas, some which are at the initial stage, but others which are already at the final stage and almost ready for commercialisation.\n\nVice-President Chiwenga emphasised that the private sector should actively support research and development, rather than leaving the responsibility solely to the Government.\n\nAs I said at the business forum on Wednesday, its time for the private sector to come on board. The Government cannot do it alone. Industry must invest in innovation in order to benefit from the resulting products and solutions, he said.\n\nVice-President Chiwenga toured several exhibition stands including those of the Zimbabwe National Road Administration (ZINARA), the Industrial Development Corporation, and the Ministry of Health and Child Care, which showcased its air ambulance services operated by Helidrive.\n\nHe also visited the Scientific and Industrial Research and Development Centre (SIRDC), which recently introduced the cluster-based approach to research and development, a strategic initiative that brings together scientists and engineers to jointly tackle R&D projects and play a pivotal role in promoting new research and innovation.\n\nAt Hall 3, where most tertiary institutions, including the Zimbabwe National Defence University, are exhibiting, the Vice-President was impressed by a range of technology-driven projects.\n\nVice-President Mohadi toured exhibition stands from selected countries, including Japan, China, the European Union, the United States of America, Botswana, and the United Kingdom.\n\nHe concluded his visit at the ruling ZANUPF stand in Hall 5, where the party and several aligned SMEs are showcasing their contributions to the national development agenda.\n\nHe later proceeded to the agriculture exhibition section, before wrapping up his tour at the Office of the President and Cabinet stand, where Chief Director for Presidential Communications, Dr Sadiki Maeresera, demonstrated a range of technology-driven innovations aimed at enhancing Government efficiency.\n\nThis years ZITF runs under the theme: Industrialisation: Crafting an Integrated Economic Landscape. It has attracted exhibitors from across Zimbabwe, the region, and the globe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-24-at-13.05.43_07730e5c-677x380.jpg",
            "description": "Sikhumbuzo Moyo and Rutendo Nyeve VICE-PRESIDENTS Constantino Chiwenga and Kembo Mohadi yesterday toured exhibition stands at the ongoing Zimbabwe International Trade Fair (ZITF), commending both local and international exhibitors for their innovation and contributions to the country’s economic growth agenda. Accompanied by Cabinet Ministers, senior Government officials, and ZITF Company board members, the Vice-Presidents toured […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "Presidents jet in for ZITF opening",
            "url": "https://www.chronicle.co.zw/presidents-jet-in-for-zitf-opening/",
            "content": "Rutendo Nyeve\n\nPRESIDENT Mnangagwa and his Mozambican counterpart, Daniel Chapo, arrived in Bulawayo yesterday ahead of todays official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF).\n\nPresident Chapo is the guest of honour at this years oversubscribed global expo and is scheduled to conduct a tour of stands at the Zimbabwe International Conference and Exhibition Smart City this morning before the official opening session in the afternoon.\n\nPresident Mnangagwa arrived earlier just after 3pm at the Joshua Mqabuko Nkomo International Airport and was received by his two deputies, Cde Kembo Mohadi and Dr Constantino Chiwenga, Defence Minister Oppah Muchiguri-Kashiri, Bulawayo Minister of State for Provincial Affairs and Devolution, Judith Ncube, several other ministers, service chiefs and hundreds of people. President Chapos plane touched down four hours later just after 7pm and he was welcomed by a high-profile delegation led by Zimbabwes Minister of Foreign Affairs and International Trade, Professor Amon Murwira, several other ministers, service chiefs, and senior Government officials.\n\nSpeaking to the media soon after arrival, President Chapo said Zimbabwe and Mozambique share a lot common interests and will utilise the visit to strengthen bilateral relations and address various challenges affecting the two nations.\n\nWe are very happy to be here. You know that Zimbabwe is Mozambique and Mozambique is Zimbabwe. That is why we are here, to be together, he said.\n\nThis is very important to be together, in unity in order to be closer and stronger together. We have the same culture, we have the same challenges, be it political, economic or trading challenges.\n\nWe want to be together to talk about business, to talk about trading, to talk about the political challenges and to talk about our economic challenges, said President Chapo.\n\nHe emphasised the need to strengthen trade riding on the already existing infrastructural networks.\n\nGuests at the State banquet held in honour of the Mozambican President at State House in Bulawayo last night\n\nWe are here to talk about trading, about commercial relations, political and economic relations between our people and between our countries. I think its very important to be here, said President Chapo.\n\nYou know that we have a Maputo-South Africa Corridor and we also have a Beira Corridor and the Beira Port, which are critical to our trade.\n\nPresident Chapo was escorted to the State House where President Mnangagwa hosted a State Banquet in his honour. The event which was attended by Cabinet ministers, diplomats, and business leaders, served as a platform for discussions on enhancing bilateral co-operation in trade, investment, and regional security.\n\nThe two Heads of States will have a hectic schedule today at the ZITF where they are scheduled to interact with scores of local and foreign exhibitors whose increased participation has seen the hosts extend space with 29 countries participating.\n\nAmong the foreign countries is; Afghanistan, Angola, Austria, Belarus, Botswana, Brazil, Canada, China, the European Union delegation, Egypt, Ethiopia, France, German, Indonesia, Italy, Japan, Kenya, Malawi, Mozambique, Netherlands, Pakistan, Rwanda, South Africa, Sweden, Tanzania, theUnited Kingdom, the United States of America, United Arab Emirates and Zambia.\n\nZimbabwe and Mozambique enjoy cordial bilateral relations dating back to pre-independence times and have blossomed over the years on the socio-economic and political front.\n\nAs described by Zimbabwes Ambassador to Mozambique, Victor Matemadanda, the new Mozambican President is a development-oriented leader who has had some educational training in Zimbabwe, making him multilingual as he is conversant in English, Portuguese, Shona, and his native language.\n\nHe is a pan-Africanist because we talked a lot about the region. He is very clear on where Africa should be.\n\nWhen we were talking, I couldsense that he is a regional leader interms of operation and his appreciation of issues affecting the SADC region, said Ambassador Matemadanda.\n\nMeanwhile, the exhibition centre has been a hive of activity since commencement of the expo on Monday with intense sideline conferences and business to business engagements. Yesterday morning the two Vice-Presidents, Dr Chiwenga and Cde Mohadi separately conducted a tour of stands and expressed their enthusiasm and excitement particularly on innovative exhibits.\n\nThe two VPs earlier led engagements with delegates at the ZITF International Business Conference and the ZITF Africa Connect Symposium where they challenged industry players and stakeholders to embrace innovation and technology to accelerate economic development.\n\nThe increased participation at the ZITF confirms the Second Republics positive impact in transforming the economy and leading industrialization in line with the National Development Strategy (NDS1), which builds the momentum towards Vision 2030.\n\nAccording to the ZITF Company, over 600 exhibitors are participating at the expo, which runs under the theme: Industrialisation: Crafting An Integrated Economic Landscape.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-12-copy-680x380.jpg",
            "description": "Rutendo Nyeve  PRESIDENT Mnangagwa and his Mozambican counterpart, Daniel Chapo, arrived in Bulawayo yesterday ahead of today’s official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF). President Chapo is the guest of honour at this year’s oversubscribed global expo and is scheduled to conduct a tour of stands at the Zimbabwe […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "Africa must stop exporting its potential, start exporting value — VP Mohadi",
            "url": "https://www.chronicle.co.zw/africa-must-stop-exporting-its-potential-start-exporting-value-vp-mohadi/",
            "content": "Sikhumbuzo Moyo\n\nAFRICA must break away from its historic role as a raw material supplier and boldly step into the future as an industrial powerhouse that produces high-value products and is able to sustain itself economically, Vice-President Kembo Mohadi has said.\n\nAddressing delegates at the 2025 Connect Africa Symposium held on the sidelines of the 65th Zimbabwe International Trade Fair (ZITF) in Bulawayo yesterday, VP Mohadi urged African nations to champion industrialisation anchored on value-addition, innovation and intra-continental collaboration.\n\nThe time has come for Africa to stop exporting its potential and start exporting value. We must transition from a resource-dependent model to one driven by high-value manufacturing, technology and robust regional supply chains, he said.\n\nThe symposium, which ran under the theme Industrialisation and Economic Integration: Strengthening Africas Resilience, was attended by senior Government officials, regional policy experts and industry leaders.\n\nFor decades, African economies have been heavily reliant on the export of raw materials such as minerals, tobacco and agricultural products, often at the expense of domestic value addition and job creation.According to the African Union, the continent contributes only two percent of global manufacturing output, despite being home to about 17 percent of the worlds population and vast reserves of natural resources.\n\nEfforts to change this trajectory have gained momentum in recent years, with initiatives like the African Unions Agenda 2063, which prioritises industrialisation as a key driver of sustainable economic growth.\n\nThe establishment of the African Continental Free Trade Area (AfCFTA) in 2021 marked a positive step towards dismantling internal trade barriers and creating a single African market of over 1,4 billion people.\n\nVP Mohadi said Africas continued reliance on exporting unprocessed raw materials has left it vulnerable to global market shocks and external dependency.\n\nHe said a transformative shift lies in embracing beneficiation, agro-processing, renewable energy and digital innovation.\n\nVP Mohadi said industrialisation is not just about expanding factories, but economic complexity, diversifying economies, creating employment and unlocking Africas full potential.\n\nIndustrialisation fuels economic complexity, allowing nations to expand production capacity, create employment, reduce dependency on volatile global export markets and increase export revenue or returns, he said.\n\nCiting Ethiopia and Rwanda as examples, the Vice-President pointed out how strategic investment in textiles and technology has transformed their economic profiles.\n\nFor instance, Ethiopias commitment to textiles and garment manufacturing has generated over 200 000 jobs, showing how targeted investments in specific sectors yield significant outcomes. Similarly, Rwanda has emerged as a technological hub, demonstrating that investment in innovation can redefine a nations global stature, he noted.\n\nVP Mohadi said Africas fragmented trade systems, regulatory bottlenecks and tariff barriers continue to undermine its collective potential.\n\nA fragmented Africa, constrained by regulatory barriers, tariffs and logistical inefficiencies, weakens its ability to assert its position in global commerce and negotiate favourable trade terms, he said.\n\nHe hailed the AfCFTA as a turning point, offering a blueprint for eliminating tariff walls and boosting intra-Africa trade.\n\nBeyond the African Continental Free Trade Area, regional industrialisation policies also play a critical role in building Africas industrial architecture and resilience through networks such as SADCs industrialisation strategy which provides a roadmap for expanding manufacturing sectors, developing beneficiation industries and modernising infrastructure across Southern Africa, said VP Mohadi.\n\nHe also commended regional policies such as SADCs Industrialisation Strategy and Comesas integration frameworks, which support shared industrial growth and cross-border investments. These initiatives, VP Mohadi said, lay the foundation for a competitive African manufacturing ecosystem.\n\nHe called on African governments and private sector players to align efforts and turn industrialisation into a continental movement with deeper economic integration to fortify resilience against external shocks.\n\nHistorically, African nations have exported raw materials while importing finished goods at disproportionate costs, leaving economies dependent on external value chains and vulnerable to price fluctuations. This cycle must end, said VP Mohadi.\n\nLet us foster unity, celebrate our diversity, and build a continent that rises above its challenges. Through industrialisation, integration, and resilience, Africa can become a global powerhouse, self-reliant, innovative, and prosperous, with our people enjoying happy lives, he said.\n\nVP Mohadi said the symposium serves as a launchpad for Africas industrial and trade revitalisation.\n\nThrough collaboration, investment and policy alignment, we will secure economic resilience, strengthen Africas competitiveness and build an integrated market capable of thriving amid global uncertainties, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-13-copy.jpg",
            "description": "Sikhumbuzo Moyo  AFRICA must break away from its historic role as a raw material supplier and boldly step into the future as an industrial powerhouse that produces high-value products and is able to sustain itself economically, Vice-President Kembo Mohadi has said. Addressing delegates at the 2025 Connect Africa Symposium held on the sidelines of the […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "Bureau Veritas strengthens Zim’s border protection against substandard imports",
            "url": "https://www.chronicle.co.zw/bureau-veritas-strengthens-zims-border-protection-against-substandard-imports/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nGLOBAL quality assurance and certification firm, BureauVeritas, has reiterated its commitment to supporting Zimbabwes efforts in curbing the influx of substandard imports through the continued implementation of the Consignment-Based Conformity Assessment (CBCA) programme.\n\nThe firm, which has been operational in the country since 2015, was appointed by the Ministry of Industry and Commerce to execute the CBCA programme. This initiative ensures that imports comply with both national and international standards relating to quality, safety, health and the environment before they enter the local market.\n\nIn an interview during the ongoing preparations for the 2025 edition of the Zimbabwe International Trade Fair (ZITF), Bureau Veritas contracts manager for Zimbabwe and Botswana, Mr Tendai Malunga, said the company is committed to safeguarding local industries.\n\nOur presence at ZITF is not only to showcase our capabilities, but also to engage with stakeholders, hear their concerns, and identify opportunities for improvement. Together with the Government of Zimbabwe, we are committed to continually refining the CBCA programme to make cross-border trade smoother and safer, he said.\n\nMr Malunga emphasised that the programme is designed to protect consumers from hazardous or substandard goods while also shielding local producers from unfair competition.\n\nThrough the CBCA programme, a wide range of products are subjected to pre-export verification and are required to meet strict conformity standards before importation into Zimbabwe. These include food and agricultural products, building materials, petroleum items such as LP gas containers, electrical and electronic devices, body care products, motor vehicle parts, clothing and textiles, as well as packaging materials.\n\nMr Malunga said Bureau Veritas operates in over 140 countries worldwide, and this global presence enables the organisation to effectively implement Zimbabwes conformity assessment programme and promote trade compliance.\n\nThe firm also works closely with the Zimbabwe Revenue Authority (Zimra), whose customs officials enforce compliance at border posts by ensuring shipments are accompanied by the requisite Certificates of Conformity (CoCs).\n\nThey do the enforcement at the border posts, check that shipments that are coming through accompanied by a certificate of conformity, a document that attests that the consignment has been verified according to the standards and it meets the requirements, said Mr Malunga.\n\nHe said platforms such as ZITF offer a valuable opportunity to assess the effectiveness of the CBCA programme, identify gaps and collaboratively chart a path forward in improving trade facilitation and regulatory compliance.\n\nIn February last year, the Ministry of Industry and Commerce revealed that since the inception of the CBCA programme in 2015, over 155 million units of substandard products had been intercepted and rejected from entering Zimbabwe. This has significantly reduced the risk of hazardous goods flooding the market, thereby protecting consumers and promoting industry standards.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/A-Bureau-Veritas-team-at-the-company’s-stand-at-the-2025-edition-of-the-Zimbabwe-International-Trade-Fair-in-Bulawayo.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com  GLOBAL quality assurance and certification firm, Bureau  Veritas, has reiterated its commitment to supporting Zimbabwe’s efforts in curbing the influx of substandard imports through the continued implementation of the Consignment-Based Conformity Assessment (CBCA) programme. The firm, which has been operational in the country since 2015, was appointed by the Ministry of Industry […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "‘No room for cyber terrorists as journalists’",
            "url": "https://www.chronicle.co.zw/no-room-for-cyber-terrorists-a-as-journalists/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nGOVERNMENT is open to contributions from the public that assist in developing an inclusive policy framework that respects the freedom of the media but does not harbour cyber terrorists masquerading as journalists, Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, has said.\n\nIn his remarks at the third edition of the Zimbabwe International Trade Fair (ZITF) Media Indaba held at the National Art Gallery in Bulawayo yesterday, Dr Muswere said the proposed amendments to the Zimbabwe Media Commission (ZMC) Act were not meant to muzzle the media industry.\n\nAmendments to the ZMC Act are ongoing, and as Government we have said that we dont have a monopoly of knowledge and experience in terms of policy formulation and development, he said.\n\nWe want each and every Zimbabwean, each and every sector in the media industry to be able to contribute with ideas so that we enrich and develop an all-inclusive policy framework and legislative amendments that respect the media industry, said Dr Muswere.\n\nWe need to be able to work together with the Zimbabwe Media Commission and the rest of the industry for us to be able to differentiate between who is a journalist and who is not a journalist.\n\nWho is a media practitioner and who is not a media practitioner? How do we define a cyber-terrorist from a media practitioner? How do we generate content that does not violate other peoples rights?\n\nDr Muswere said freedom of expression is enshrined in the Constitution but that right cannot be used to violate people rights to dignity and privacy.\n\nSection 61 and section 62 of the Constitution reflect on the freedom of expression and the freedom of the media but the same sections relate to the exclusion, in terms of Subsection 5 when they violate other peoples rights in terms of dignity, values, integrity and privacy, he said.\n\nDr Muswere emphasised the importance of a media industry that tells positive stories about Zimbabwe and foster progressive nation building.\n\nThe New Dispensation is transparent, we have nothing to hide. We are open. We want a future that allows the media industry to be able to flourish and a future that allows all media practitioners to be free to protect their sources, he said. We want a media industry that reports on facts but not on mirages and shadows.\n\nDr Muswere said Zimbabwe will not support cyber terrorism hence authorities have taken a stand to protect unsuspecting citizens.\n\nThe Government will not support cyber-terrorism as it incites violence. We have a nation to build, one that has a media industry whose role is to raise awareness about terrorism, he said.\n\nWe want a media industry that raises awareness about the growth of the economy, inform and educate the nation.\n\nSpeaking at the same occasion, Deputy Minister of Information, Publicity and Broadcasting Services, Dr Omphile Marupi, said the media must not be used as proxies for external political machinations and a vehicle for sponsored narratives, which undermine Zimbabwes national values.\n\nHe said with the well-known sponsors of fake news in Africa withdrawing their funding, an opportunity had risen for the Africa story to be told and protected.\n\nThe media resides at the centre of producing ideas and impressions, which enhance or may have the capacity to dismantle a nations reputation, said Dr Marupi.\n\nThe media and Government must be able to find points of mutual convergence in the positive image construction of the nation.\n\nThe ZITF Media Indaba was held under the theme: Growing the Media Sector for Zimbabwe Industrial Development and attended by diverse stakeholders.\n\nLast year, the Zimbabwe Media Commission announced that the process of amending the ZMC Act, which is the main law that governs the commission and its functions, had begun.\n\nThe amendment is aimed at providing for media governance, registration and accreditation provisions that will remove impediments that affect the media industry.\n\nZMC is one of the five Chapter 12 Independent Commissions, whose purpose is to foster a democratic society driven by respect for the Constitution, rule of law, democracy and human rights, among other objectives.\n\nIts main focus is on the promotion and protection of freedom of expression and the media and the promotion of accountable governance, through facilitating public access to information held by public entities for transparency, accountability and protection of human rights.\n\nLike other independent commissions, ZMC is expected to monitor compliance with constitutional provisions across the public and private sectors, to receive complaints from thepublic and to take appropriate action where necessary.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Information-Publicity-and-Broadcasting-Services-Minister-Dr-Jenfan-Muswere-addresses-stakeholders-at-the-Media-Indaba-held-at-the-National-Art-Gallery-in-Bulawayo-yesterday-.jpg",
            "description": "Raymond Jaravaza, ray.jaravaza@chronicle.co.zw GOVERNMENT is open to contributions from the public that assist in developing an inclusive policy framework that respects the freedom of the media but does not harbour cyber terrorists masquerading as journalists, Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, has said. In his remarks at the third edition of the […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "Manhize steel plant window  for Byo industries",
            "url": "https://www.chronicle.co.zw/manhize-steel-plant-window-for-byo-industries/",
            "content": "Nqobile Bhebhe,Zimpapers Business Hub\n\nBULAWAYO industries must fully leverage the opportunities presented by the Dinson Iron and Steel Company (Disco) plant in Manhize to drive the revival of Zimbabwes manufacturing sector, former Cabinet minister, Ambassador Christopher Mutsvangwa, has said.\n\nDisco is a flagship investment under the Second Republics pro-industrialisation and import substitution agenda.\n\nIt is owned by Tsingshan Holdings Group Limited, a global stainless steel giant, through its local subsidiary, Dinson Iron and Steel Company.\n\nThe plant forms part of a larger investment portfolio that includes Dinson Colliery in Hwange and the Afrochine Smelting ferrochrome operation in Selous.\n\nAs one of Africas largest integrated steel facilities, the Disco plant is now producing finished steel products such as deformed bars in 16mm, 20mm, and 25mm sizes, specifically catering to the local construction industry.\n\nWith a current daily production capacity of 300 tonnes and an annual target of 600 000 tonnes, the facility is set to drastically reduce Zimbabwes dependency on steel imports previously costing the nation nearly US$1 billion annually.\n\nSpeaking on Wednesday at the International Business Conference in Bulawayo, Amb Mutsvangwa underscored the critical role Disco could play in revitalising Bulawayo, once the nations industrial hub.\n\nThe history of this town is that it is the home of the heavy industry of Zimbabwe, which collapsed when Ziscosteel went under, he said.\n\nNow the Vice-President (Dr Chiwenga) has mentioned that we now have a steel plant, which is 20 times bigger than Zisco, and the investor is a top company in the world Fortune 500 number 259.\n\nAnd it is already producing steel, including rolling steel for construction and all the attendant aspects of steel production.\n\nAmb Mutsvangwa expressed concern over local scepticism about the projects relevance to Bulawayos economy.\n\nI had the misfortune of hearing one of the top leaders of the town a few days ago saying that we cannot revive Bulawayo because the steel, which is being produced is produced by a company from a certain country, and they are exporting that steel to that country, so it is not relevant to Bulawayo, he said.\n\nThe former Cabinet minister, who is also Zanu-PF spokesperson, urged the local industrial community to embrace the fact that the Disco plant is a Zimbabwean-registered company, regardless of the origin of its investors.\n\nI am appealing to industrialists in Bulawayo, particularly in the heavy industrial sector, to start identifying with the fact that the company, which is registered in Zimbabwe, is a Zimbabwean company regardless of the country of origin, he said.\n\nAmb Mutsvangwa also pointed to the strong regional demand for Zimbabwean steel, which should inspire local manufacturers to act swiftly.\n\nI would like the industrialists in Bulawayo to take advantage of what is going on in Zambia and in South Africa, where more than 200 trucks leave every week to those countries carrying steel from Zimbabwe to go and manufacture and beneficiate so that the products end up back in Zimbabwe.\n\nBulawayo needs a new lease of life, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/A-section-of-Dinson-Iron-and-Steel-Company-plant-in-Manhize.jpg",
            "description": "Nqobile Bhebhe, Zimpapers Business Hub BULAWAYO industries must fully leverage the opportunities presented by the Dinson Iron and Steel Company (Disco) plant in Manhize to drive the revival of Zimbabwe’s manufacturing sector, former Cabinet minister, Ambassador Christopher Mutsvangwa, has said. Disco is a flagship investment under the Second Republic’s pro-industrialisation and import substitution agenda. It is […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "COMMENT: Investment crucial in  diamond value chain",
            "url": "https://www.chronicle.co.zw/comment-investment-crucial-in-diamond-value-chain/",
            "content": "Zimbabwe is the worlds seventh biggest diamond producer by carat weight behind Russia, Botswana, Angola, Canada, South Africa and Namibia.\n\nThe bulk of the countrys output is produced by the Zimbabwe Consolidated Mining Company (ZCDC) which sold about 4,9 million carats of the stone in 2023.The firms output for 2024 was projected at 5,7 million carats and is expected to grow to 10 million carats this year.\n\nWith the contribution of two other miners  Anjin and Murowa  the national output will obviously be higher.\n\nHowever, we feel that our country is one of the most under-explored mining jurisdictions on the globe mainly due to an internal lack of resources as well as the general international reticence towards investing here due to Western sanctions.\n\nThat potential can only be achieved if Zimbabwe collaborates with partners who have the necessary financial and technical resources.One such partnership is that between the ZCDC, the countrys number one producer and Alrosa, the worlds number one.\n\nAlrosa Zimbabwe, the 70 percent-30 percent joint venture between Alrosa and ZCDC, has been exploring for the precious stone at various sites across the country since July 2020.\n\nAlrosa said at the time that it planned to invest about $12 million by 2022 in the exploration programme.\n\nAs the partnership advances its investment, top Alrosa officials met President Mnangagwa on Wednesday after which they announced a plan to scale up the giants investment in the country.\n\nWe are ready to work in the Republic of Zimbabwe and we are ready to move forward. Yes, and having said that, we have to admit that the planned investments between our companies were doubled.And so, by the end of 2025, the total investments will be doubled compared to the previous agreements, said Alrosa Joint Stock Company chief executive officer, Mr Pavel Marynichev.\n\nWe acknowledge that mining exploration is a meticulous and time-consuming undertaking which also needs significant financial and technical resources.We are encouraged that this elaborate exercise is underway and urge Alrosa Zimbabwe to quicken things up so it declares commercially viable finds, secure funding to develop mines and begin producing so that the economy can derive maximum benefit from its mineral wealth.\n\nWe see massive potential in the Alrosa Zimbabwe joint venture contributing to a jump in national output.\n\nWe call on other companies to invest in the diamond sector as well. In calling for more investment in that industry, we dont mean just extraction and selling of roughs but, more critically, investment to move the economy up the value chain to processing as well as jewellery making.That is where the cash is.\n\nTo get to the top, however, we need greater commitment and resources at every stage of the diamond pipeline  from miners, educational institutions, processors, to Government among other stakeholders.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Untitled-13-copy-1.jpg",
            "description": "Zimbabwe is the world’s seventh biggest diamond producer by carat weight behind Russia, Botswana, Angola, Canada, South Africa and Namibia. The bulk of the country’s output is produced by the Zimbabwe Consolidated Mining Company (ZCDC) which sold about 4,9 million carats of the stone in 2023.  The firm’s output for 2024 was projected at 5,7 […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "ZITF nightlife: Bulawayo lights up  as business meets entertainment",
            "url": "https://www.chronicle.co.zw/zitf-nightlife-bulawayo-lights-up-as-business-meets-entertainment/",
            "content": "Sipepisiwe Moyo,Zimpapers Arts & Entertainment Hub\n\nAS the Zimbabwe International Trade Fair (ZITF) swings into full gear, Bulawayo is not only abuzz with business deals and exhibitions but also with vibrant nightlife events, turning the city into a hub of entertainment and cultural celebration.\n\nWith gates now open to the public, the ZITF weekend promises a fusion of commerce and revelry, as event organisers and local nightspots have curated a thrilling line-up of after-hours entertainment to cap off each days business engagements.\n\nZee Nxumalo\n\nLeading the weekend festivities is the much-anticipated Bulawayo Shutdown, set for Saturday night. Organised by Harris Entertainment, this event has long earned its reputation as the unofficial ZITF closing party and this year is no exception.\n\nThe Shutdown boasts a star-studded line-up, featuring some of South Africas top performers, including Emtee, Nasty C, DJ Tira and Zee Nxumalo. Local powerhouses Oriyano, Killer T, Enzo Ishall, Mzoe7 and Asaph, alongside top DJs Tamuka and Prince Eskhosini, are set to ignite the stage, ensuring an electrifying atmosphere for both locals and international visitors.\n\nFor those seeking a nostalgic escape, BAC Leisure will host an Old School Party tonight, headlined by none other than the kings of retro sound, Tony Friday and Kimble Rogers. They will be joined by celebrated DJs Offswag, Etherton B, DJ Masaccre and DJ Smith, spinning timeless anthems from R&B to 90s hip-hop and early 2000s dancehall. This will be the perfect retreat for mature revellers and lovers of vintage vibes.\n\nMzoe 7\n\nBowling enthusiasts, there is good news as a new bowling venue has opened in the host citys CBD, promising to bring fresh excitement to the citys leisure scene. The new spot offers not only the thrill of the game but also a relaxed and inviting environment, perfect for unwinding with friends or family. Just a short walk away is Marvericks, a long-time favourite among lovers of snooker and pool. The venue has become a hub for cue sports in the city and during the ZITF period, it is welcoming a diverse crowd of locals and visitors alike.\n\nInside the ZIEC and private venues, corporate cocktail events are in full swing, with companies hosting clients and partners in relaxed settings designed to nurture post-expo discussions and deepen business relations.\n\nMeanwhile, students and the young at heart can look forward to the Miss Nust pageant on Sunday, a vibrant showcase of youth talent, confidence and campus culture. A dynamic DJ line-up will keep the energy high throughout the event, cementing its place as a highlight of the ZITF weekend for the student community.\n\nThe ZITF has also emerged as a vital platform for local artistes to perform, connect and grow their brands. Artistes such as Ma9ine, Asaph Afrika, Mzoe7 and Skhumz the Moonwalker have made appearances throughout the week, blending entertainment with enterprise.\n\nMzoe7, who was spotted networking at the fair, shared the importance of the ZITF in fostering artiste-corporate collaboration.\n\nEnzo Ishall\n\nThis is one of the biggest ZITF events, and its great to host people from all over the world in our beautiful country and city. Im busy making links with corporates and institutions, creating business relationships,and letting them know more about the brand Mzoe7, he said.\n\nThe presence of artistes and entertainment acts at ZITF, highlights its role not only as an economic catalyst but also as a cultural melting pot. The event brings together businesses, creatives and individuals from across the globe, offering a unique blend of networking, branding and artistic expression.\n\nAs the sun sets on each busy day of trade and industry, Bulawayos nightlife ensures that the spirit of the ZITF continues well into the evening. With its compelling mix of business and pleasure, the 2025 ZITF is proving once again that economic activity and cultural celebration can thrive side by side, leaving visitors with not just deals, but unforgettable memories.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Uncle-Waffles.jpg",
            "description": "Sipepisiwe Moyo, Zimpapers Arts & Entertainment Hub AS the Zimbabwe International Trade Fair (ZITF) swings into full gear, Bulawayo is not only abuzz with business deals and exhibitions but also with vibrant nightlife events, turning the city into a hub of entertainment and cultural celebration. With gates now open to the public, the ZITF weekend promises […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        },
        {
            "title": "Bosso plot to halt TelOne juggernaut",
            "url": "https://www.chronicle.co.zw/bosso-plot-to-halt-telone-juggernaut/",
            "content": "Fungai Muderere,Zimpapers Sports Hub\n\nAS the Castle Lager Premier League moves into its next phase, Highlanders are preparing for a high-octane clash against TelOne at Bata Stadium this Saturday  a fixture brimming with intrigue, high stakes, and suspense.\n\nThe Gweru ground will be the centre of attention, as Bosso aim to clip the wings of a confident TelOne side who are riding high on the form of league top scorer Washington Navaya  a player who once graced their own ranks.\n\nAhead of the match, a raft of suspensions will disrupt the leagues line-up. Seven players from various clubs, including TelOnes own Tapiwa Chilenga, will be sidelined due to an accumulation of yellow cards. Others missing out include Mpumelelo Bhebhe (Chicken Inn), Lawrence Mhlanga (Manica Diamonds), Tanaka Shandirwa (CAPS United), Ansa Botchway (Scottland FC), and Matthew Murambiwa (MWOS).\n\nBosso, on the other hand, will be without only captain Andrew Mbeba, who continues his recovery. Head coach Kelvin Kaindu provided a positive update at the clubs weekly press briefing.\n\nWere away again after our Ngezi draw. Save for Mbeba, everyone trained well. His injury isnt serious, but hell sit out another week, said Kaindu.\n\nBossos attacking hopes lie with Brighton MaNinja Ncube, Melikhaya Ncube, Mason Mushore, the relentless Never Rauzhi, Reason Sibanda, and Archford Faira, who is back to full fitness.\n\nBut the looming figure of Washington Navaya casts a long shadow. With seven goals in seven matches, the former Bosso man is the WiFi Boys ace. And with the Player of the Month award in his pocket, hes coming in hot.\n\nHis coach Herbert Maruwa is urging calm.\n\nNavayas doing great. But he mustnt let the emotion of facing Highlanders get to him. He should focus on the teams goals, said Maruwa.\n\nIts a crucial encounter. TelOne (11 points) are just one ahead of Bosso (10 points), making this a six-pointer in the race for early supremacy.\n\nTelOne, who finished 10th last season, are targeting a top-eight berth. With new recruits like Frank Makarati, Bruno Mtigo, Gerald Bero, and Tawanda Macheke, they are a more mature and ambitious outfit.\n\nBossos backline will be sternly tested, and fans from both Bulawayo and Gweru are expected to flock to Bata for what could be a cracker.\n\nAlso this week, Herentals take on GreenFuel today at Rufaro. MWOS travel to Wadzanayi to meet Simba Bhora, while Chicken Inn go to Mutare for a date with Manica Diamonds. Scottland FC head north to take on ZPC Kariba.\n\nDynamos, limping after a slow start, will meet Kwekwe United on Sunday at Rufaro in a must-win.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/1121.jpg",
            "description": "Fungai Muderere, Zimpapers Sports Hub AS the Castle Lager Premier League moves into its next phase, Highlanders are preparing for a high-octane clash against TelOne at Bata Stadium this Saturday — a fixture brimming with intrigue, high stakes, and suspense. The Gweru ground will be the centre of attention, as Bosso aim to clip the wings […]",
            "time": "09:31",
            "date": "25 Apr 2025"
        }
    ]
}