{
    "news": [
        {
            "title": "Massive ‘space object’ fragment crashes into remote village in Kenya",
            "url": "https://www.chronicle.co.zw/massive-space-object-fragment-crashes-into-remote-village-in-kenya/",
            "content": "Kenya A huge, red-hot object fell from the sky into a Kenyan village on Monday afternoon according to local residents cited by the countrys national broadcaster, prompting an immediate investigation by the national space agency.\n\nThe object has since been identified as a fragment of a space object, the Kenya Space Agency said in a statement Wednesday.\n\nThe KSA said it has taken custody of the object that landed in the remote village of Mukuku, in the southern county of Makueni, describing it as apparent space junk measuring 2.5 meters (about 8 feet) wide and weighing 500 kg (about 1,100 pounds).\n\nThe Agency wishes to clarify that the object, a metallic ring measuring approximately 2.5 meters in diameter and weighing about 500 kg is a fragment of a space object, the KSA said.\n\nPreliminary assessments suggest it is a separation ring from a rocket, the agency said, noting that space debris more typically falls into the ocean or burns up before entering the earths atmosphere.\n\nThe fallen object is likely an isolated case and is still under investigation, it added.\n\nJulius Rotich, Mbooni Sub County Police Commander, told the Kenya Broadcasting Corporation that the object was still hot when officers arrived Monday, and that residents had to be cordoned off from the area until it cooled down.\n\nThe broadcaster showed images of police tape wrapped around the ring, which had fallen into some trees and brush, as residents gathered around.\n\nThe KSA is analyzing the object and working to confirm where exactly it came from, it said.\n\nCNN\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/screen-shot-2025-01-02-at-6-54-45-pm-680x380.png",
            "description": "Kenya – A huge, red-hot object fell from the sky into a Kenyan village on Monday afternoon according to local residents cited by the country’s national broadcaster, prompting an immediate investigation by the national space agency. The object has since been identified as a “fragment of a space object,” the Kenya Space Agency said in […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "2025 Budget operational",
            "url": "https://www.chronicle.co.zw/2025-budget-operational/",
            "content": "Farirai Machivenyika, Harare Bureau\n\nPRESIDENT Mnangagwa has signed into law two Acts operationalising the ZiG276,4 billion 2025 national budget presented by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube on November 28 last year.\n\nThe Appropriation Act, which authorises the bulk of Government spending for this year, the rest being set as permanent spending in other Acts, and Finance Act, which enacted the changes in taxation announced in the Budget, were published in an Extraordinary Government Gazette on Monday after President Mnangagwa assented to them.\n\nThis means that the Government can now spend the money allocated by Parliament and collect taxes at the changed rates and any new taxes imposed with new taxpayers, such as the swathe of the informal sector, now legally obliged to pay taxes that others were already paying.\n\nThe budget comprises ZiG234 688 015 000 in expected revenues charged to the Consolidated Revenue Fund and ZiG6 248 797 000 in retention funds that are meant for specific purposes as provided for by the Public Finance Management Act.\n\nParliament passed the budget last month after lengthy debates that lasted five days with legislators across the political divide interested to know how the budget builds resilience for different groups of people and grows the economy.\n\nIn response, Prof Ncube said support for agriculture, for example, through investment in dam construction which in turn supports irrigation, is one way the budget is building resilience for farmers against climate shocks ad food insecurity.\n\nThere was also a lot of interest in terms of how the budget is building resilience for women and female entrepreneurs.\n\nIn that respect, the budget will support the capitalisation of the Empowerbank as well as Womens Bank, he said.Prof Ncube said provision of sanitary wear to young girls, generally through the public schools system, was a topic for debate and ZiG211 million was set aside for that.\n\nThe budget builds resilience against currency and other shocks by maintaining fiscal discipline where the deficit will be kept within 0,4 percent of Gross Domestic Product, or at least below one percent of GDP.\n\nIn terms of allocations, the Ministry of Primary and Secondary Education got the highest vote of ZiG46,7 billion while the Ministry of Health and Child Care was allocated ZiG28,8 billion.\n\nLands, Agriculture, Fisheries, Water and Rural Development was allocated ZiG22,9 billion while the Finance, Economic Development and Investment Promotion Ministry got ZiG28,7 billion. The Ministry of Defence was allocated ZiG18,05 billion.\n\nThe Ministry of Public Service, Labour and Social Welfare was allocated ZiG10,7 billion while that of Transport and Infrastructure Development got ZiG5,4 billion. Parliament got ZiG2,7 billion.\n\nZimbabwe Gold\n\nThe Finance Act, while maintaining tax bands in US dollars, converted these to ZiG at current exchange rates so incomes from zero up to ZiG33 600 a year will not be taxed, from ZiG33 601 to ZiG100 800 will be taxed at 20 percent, from ZiG100 801 to ZiG336 000 at 25 percent, between ZiG336 000 and ZiG672 000 at 30 percent, between ZiG672 001 and ZiG1 008 000 at 35 percent and anything above ZiG1 008 001 a year at 40 percent tax.\n\nThose into sport betting will now pay a 10 percent tax of their winnings deducted when they are paid out and sent to Zimra by the betting house, while the betting houses will pay three percent of their gross monthly income.\n\nA half percent surcharge is now being charged on the sale value of less healthy fast foods that include burgers, pizza, chips, chicken and doughnuts among others that will be announced in regulations to be published later.\n\nA 20 percent surcharge will now apply on the sale value of non-renewable plastic carrier bags whether manufactured locally or imported.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Mnangagwa-2-680x380.jpg",
            "description": "Farirai Machivenyika, Harare Bureau PRESIDENT Mnangagwa has signed into law two Acts operationalising the ZiG276,4 billion 2025 national budget presented by Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube on November 28 last year. The Appropriation Act, which authorises the bulk of Government spending for this year, the rest being set as permanent […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "New child disciplining  guidelines out",
            "url": "https://www.chronicle.co.zw/new-child-disciplining-guidelines-out/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTEACHERS have been prohibited from administering corporal punishment while parents and guardians are being encouraged to explore innovative and lawful methods of disciplining children as outlined in the Ministry of Primary and Secondary Educations latest guidelines.\n\nThis comes against the backdrop of recent cases when two parents were jailed for using physical punishment on their children, sparking a nationwide debate on the limits and legality of disciplining minors.\n\nThe issue of child discipline has become a big concern, particularly as schools are also banned from administering corporal punishment.\n\nThe ministrys guidelines emphasise fostering a culture of self-discipline and respect among students, moving away from fear-based methods.\n\nThe Amended Section 68A of the Education Act (Chapter 25:04) mandates all schools to establish a disciplinary framework that upholds the dignity of pupils.\n\nThe Act explicitly prohibits any treatment amounting to physical or psychological torture, or cruel, inhuman, or degrading punishment.\n\nAccording to the Ministry of Primary and Secondary Education guidelines, no teacher under any circumstance should beat a pupil.\n\nSchools must cultivate an environment where pupils develop internal discipline, supported by positive and proactive measures.\n\nThe regulations and disciplinary policy does not permit any treatment which (i) does not respect human dignity of a pupil or (ii) amount to physical or psychological torture, or cruel, inhuman or degrading treatment or punishment, reads the statement.\n\nThe guidelines outline a clear process for disciplining pupils, including suspension, exclusion and expulsion. Any exclusion must have prior approval from the provincial education director (PED) and must be supported by detailed documentation of the pupils misconduct. Expulsions are reserved for serious offences such as drug abuse, theft, fighting, or vandalism.\n\nIn view of the above, every school head should therefore strive to cultivate a school climate where pupils will/ can develop internal discipline which is not initiated by fear of punishment.\n\nAt the school level, leadership should strive to promote a positive ethos which promotes self-discipline among pupils supported by positive remedial disciplinary and proactive measures so that the priority focus on teaching and learning is maintained, reads the guidelines.\n\nThe document stated that a pupil expelled from a school would not be re-admitted into the education system without the approval of the Permanent Secretary of Primary and Secondary Education. The ministry said no school should exclude a learner without the knowledge of the PED.\n\nExclusion is the removal of a pupil from a particular school by the head for reasons in the best interests of either the pupil, parent or the school. Comprehensive documentation of the pupils misdemeanour or deviant behaviour and circumstances surrounding the incidence must accompany the heads request for exclusion.\n\nAll the administrative functions, tasks and ultimate exclusion should be done within 14 days, reads the guidelines.\n\nIt further states that an excluded pupil can e-apply for admission into any other registered school without reference to the PED. The document stated that where communication challenges are encountered with any parents/guardians, the social welfare system should be approached.\n\nExpulsion may be considered, depending on the seriousness of the evidence of a pupils involvement in any acts of serious misconduct.\n\nThese include taking drugs and intoxicating substances, theft, fraud, robbery, fighting, assault, using dangerous weapons, sexual misconduct, continued disobedience, striking, insubordination, destruction or vandalism of property and protracted absenteeism or truancy without a valid reason.\n\nOther reasons for expulsion include fraudulent practices in public examinations and criminal cases. Child discipline remains a contentious issue, with experts urging parents to embrace the evolving societal norms.\n\nArchbishop Alex Thomas, the head of the Roman Catholic Churchs Archdiocese of Bulawayo called for balanced discipline strategies, saying there is a need to address the societal challenges of drug abuse, teenage pregnancies and violence.\n\nChildren have rights, but these come with responsibilities. Parents must exercise their duties in non-violent ways. Those rights should not result in harming others in the society but it seems the children are taking their rights out of context, he said.\n\nAt the moment, there are a lot of challenges with drug and substance abuse, alcoholism and teenage pregnancies. We seem to be in a society that is destroying itself.\n\nPsychologist, Ms Mellisa Ncube emphasised the importance of communication between parents and children, noting that todays children may respond differently to discipline compared to the past.\n\nCorporal punishment is no longer applicable but this does not mean indiscipline is acceptable. Parents should implement effective strategies such as withdrawing privileges or assigning additional responsibilities, she explained.\n\nWe need to understand that todays generation is different from past generations. While we grew up accepting that beating up children was a way of disciplining them, it is not the case anymore.\n\nMs Ncube said parents should outline what is expected from the children and also communicate what they want.\n\nIn psychology, we have rewards and punishments. This means that parents can discipline their children through increasing probably workload or even removing some of the privileges that the children enjoy, she said.\n\nChief Siansali of Binga, who is also a Senator under the National Council of Chiefs, expressed concerns about the adoption of Western values, arguing that traditional African disciplinary methods, including corporal punishment, have been undermined.\n\nWe are at a crossroads. As Africans, we were raised knowing the value of discipline, including physical punishment. Even the Bible says, Spare the rod and spoil the child. Children today abuse their rights, knowing they are protected by the law, he said.\n\nChief Siansali said there is a need to revisit the law to strike a balance between modern legal frameworks and traditional African values to address the issue of childrens discipline. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/corporal-punishment.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw TEACHERS have been prohibited from administering corporal punishment while parents and guardians are being encouraged to explore innovative and lawful methods of disciplining children as outlined in the Ministry of Primary and Secondary Education’s latest guidelines. This comes against the backdrop of recent cases when two parents were jailed for using physical […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "COMMENT: It takes all of us to build the  country we want",
            "url": "https://www.chronicle.co.zw/comment-it-takes-all-of-us-to-build-the-country-we-want/",
            "content": "The year 2024 had its own challenges but Zimbabwe managed to record many positives as far as development is concerned. The challenge this year is therefore to maintain the momentum while striving to improve the countrys economic performance in the different sectors.\n\nA lot of ground was covered in implementing infrastructural development projects such as road and bridge construction, upgrading and expansion of hospitals and clinics, construction of dams which include the multi-million dollar Lake Gwayi-Tshangani, establishment of new companies across the country and many other such projects that have transformed the livelihoods of citizens.\n\nThe country is now an investment destination of choice in the region and beyond as evidenced by the many new companies that are investing millions of dollars in the different sectors of the economy such as mining. Many Lithium mines across the country are already producing and Zimbabwe is now among the leading producers of lithium which is the mineral of the moment due to production of electric cars.\n\nLithium is used to manufacture rechargeable batteries for electric vehicles, mobile phones, laptops and digital cameras. Many foreign companies have responded to the Zimbabwe is Open for Business mantra hence the many investment projects taking shape across the country. The foreign direct investments (FDI) being witnessed across the country confirm the success of Zimbabwes engagement and re-engagement policy which should be consolidated this year.\n\nWe want to see more companies investing in the country this year hence the need for Government to continue creating a conducive business environment. We have said in the past that Zimbabweans including those in the diaspora should take a leading role in exploiting the countrys abundant natural resources such as minerals. Ilizwe lakhiwa ngabaninilo (Nyika inovakwa nevene vayo).\n\nA section of the refurbished RGM International Airport\n\nLast year President Mnangagwa commissioned a number of signature projects that include the new-look RGM International Airport which has increased the airports passenger capacity from 2,5 million per year to over six million. More airlines are expected to fly direct to Harare thereby boosting the countrys tourism.\n\nThe other big projects commissioned are the New Parliament Building which has been completed at a cost of US$100 million and the US$1,4 billion Hwange Thermal Power Station Unit 7 and 8 expansion project. The Hwange Unit 7 and 8 are already feeding 600MW into the national grid hence the improved power generation being witnessed.\n\nZimbabwe, which is still under illegal Western sanctions, has resolved to use its own resources to implement its industrialisation and modernisation programme. What is comforting is that most of the companies working on the infrastructural projects such as roads, bridges and dams are local companies.\n\nGovernment has demonstrated that it is unstoppable in its quest to ensure the country becomes an upper middle income economy by 2030. Let each and every citizen again put shoulder to the wheel this year as we continue to build the Zimbabwe we all want.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Untitled-8-copy-5.jpg",
            "description": "The year 2024 had its own challenges but Zimbabwe managed to record many positives as far as development is concerned. The challenge this year is therefore to maintain the momentum while striving to improve the country’s economic performance in the different sectors. A lot of ground was covered in implementing infrastructural development projects such as […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "Zera cuts LPG price by 13pc",
            "url": "https://www.chronicle.co.zw/zera-cuts-lpg-price-by-13pc/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Zimbabwe Energy Regulatory Authority (Zera) has announced a reduction in liquefied petroleum gas (LPG) prices following the exemption of Value Added Tax (VAT) on the product, a measure introduced in the 2025 National Budget.\n\nThe Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, emphasised the growing importance of LPG as an alternative energy source in light of the regions electricity supply challenges.\n\nProlonged load shedding has increased reliance on LPG for cooking and heating, offering a cleaner and more sustainable option compared to traditional fuels like firewood and charcoal, which contribute to deforestation and indoor air pollution.\n\nZimbabwe Gold\n\nTo make LPG more affordable, VAT on the product has been scrapped, effective January 1, 2025.\n\nIn a notice dated December 31, 2024, Zera announced that the removal of VAT has resulted in LPG prices dropping by approximately 13 percent.\n\nThe new prices are US$1,61 per kilogramme down from US$1,86 per kilogramme in December. In local currency, the adjustment is ZWG41,63 per kilogramme down from ZWG47,51 per kilogramme.\n\nStakeholders are advised that the LPG prices for December 2024 were calculated in accordance with the Petroleum (Liquid Petroleum Gas Pricing) Regulations, 2021 (Statutory Instrument 90).\n\nHowever, following the removal of Value-Added Tax (VAT), the prices have been reduced, effective 1 January 2025, as follows: US$1,61/kg or ZWG41,63/kg, reads an update from Zera.\n\nRetailers are required to prominently display the updated prices at their outlets, although they are permitted to sell LPG at lower prices depending on their trading advantages.\n\nOperators are advised to display the prices at their retail outlets at a prominent place in clearly legible letters. Please note that it is permissible to sell LPG at prices below the prescribed prices depending on ones trading advantages, said Zera.\n\nThe demand for LPG continues to grow in Zimbabwe as more households and businesses adopt it as an alternative to traditional energy sources. Between 2015 and March 2024, the country consumed nearly 400 million kilogrammes of LPG, primarily imported from regional producers.\n\nZera has been at the forefront of promoting modern energy solutions, including renewable energy projects such as net metering, mini-grids, and independent power producers (IPPs).\n\nThese initiatives aim to enhance access to sustainable energy by 2030, in line with global energy goals. By exempting LPG from VAT, the Government seeks to make the cleaner energy source more accessible to households, while reducing environmental degradation caused by the use of firewood and charcoal.\n\nThis move aligns with Zimbabwes broader energy strategy, which prioritises renewable and sustainable energy solutions to address the countrys energy challenges. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/SDFSFSD.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com THE Zimbabwe Energy Regulatory Authority (Zera) has announced a reduction in liquefied petroleum gas (LPG) prices following the exemption of Value Added Tax (VAT) on the product, a measure introduced in the 2025 National Budget. The Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube, emphasised the growing importance of LPG […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "Billiat off  to Scottland: Transfer frenzy hits local football",
            "url": "https://www.chronicle.co.zw/billiat-off-to-scottland-transfer-frenzy-hits-local-football/",
            "content": "Innocent Kurira,[emailprotected]\n\nCASTLE Lager Premier Soccer League newcomers, Scottland FC, have pulled off a major coup, signing Zimbabwe international Khama Billiat on a free transfer.\n\nThe 34-year-old winger, who was unveiled by the club yesterday, joins Scottland FC after his contract with Yadah Stars expired on December 31. Billiat had a remarkable season with Yadah, scoring 13 goals.\n\nHe was named the second runner-up for the 2024 Soccer Star of the Year award and finished as the clubs top scorer.\n\nThe former Mamelodi Sundowns and Kaizer Chiefs star brings a wealth of experience to Scottland FC, having played in South Africa for over a decade. His signing is a major boost for the club, which is bankrolled by Member of Parliament, Pedzisayi Scott Sakupwanya.\n\nScottland FC have been making waves in the off-season, having already signed 2024 Soccer Star of the Year, Walter Musona, from reigning Zimbabwe champions, Simba Bhora.\n\nBilliats move to Scottland FC marks his second successive season in the Castle Lager Premier Soccer League since his return to Zimbabwe.\n\nMeanwhile, Simba Bhora are poised to lose star striker, Tymon Machope, who has reportedly signed with Premier Soccer League newcomers, Scottland FC.\n\nMachope played a vital role in the teams historic league title win last season, scoring 12 goals, which earned him a spot in the 2024 Soccer Stars of the Year.His consistent performances also landed him several call-ups for the national team.\n\nSources confirmed that Machope will be making the move to Scottland FC, marking a significant transfer for the Premiership newcomers.\n\nThey have already secured the signatures of Lynoth Chikuhwa, Peter Muduhwa, Godfrey Makaruse and Marvellous Chigumira from Highlanders as well as Soccer Star of the Year second runner-up, Khama Billiat.\n\nCharles Nyatsine, the Simba Bhora spokesperson, was unavailable for comment, but insiders have confirmed that Machope will not be part of the team for the upcoming season.\n\nMachopes departure from the team follows a series of high-profile exits, including Walter Musona, who announced his departure on social media.\n\nMusona, the reigning Soccer Star of the Year, expressed his gratitude to the club, its owner and fans and stated that leading the team to its maiden league championship was the highlight of his career.\n\nI would like to thank the Simba Bhora FC family for taking my career to another level last season. Captaining the team to its maiden championship is now the biggest highlight of my career, and Im also grateful for the clubs role in helping me become a two-time Soccer Star of the Year.\n\nI also want to thank the owner of the team, Simba Ndoro, the fans, my teammates, the technical team and our sponsors, particularly Brighton Panjap Ushendibaba. As I open the next page of my career, Simba Bhora will always be in my heart. We achieved a lot in a short period and I wish you all the best in 2025, said Musona.\n\nOther notable transfers include Tonderayi Mateyaunga, who bid farewell to CAPS United after six years and Claude Makopa, who left Ngezi Platinum Stars after a two-year stint.\n\nDonald Mudadi has also said his goodbyes to Dynamos and is said to be heading to Simba Bhora. Lot Chiwunga has left CAPS United to join Herentals.\n\nDynamos midfielder, Authur Musiyiwa is believed to be returning to Bulawayo Chiefs with Malvin Mkolo who struggled for game time at Simba Bhora.Chiefs, however, will be playing Division One football next season.\n\nIt remains to be seen if the duo will be willing to play Division One football this year.\n\nChicken Inn, who are likely to lose goalkeeper Bernard Donovan to foreign teams, have already found a replacement after getting the signature of Aron Ngwenya from Arenel.\n\nThe transfer window is expected to remain active until the season kicks off with several top players linked with moves to new clubs.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/tyhtuyu.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw CASTLE Lager Premier Soccer League newcomers, Scottland FC, have pulled off a major coup, signing Zimbabwe international Khama Billiat on a free transfer. The 34-year-old winger, who was unveiled by the club yesterday, joins Scottland FC after his contract with Yadah Stars expired on December 31. Billiat had a remarkable season with […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "The evolution of Zimbabwean theatre:  Insights from renowned playwright Raisedon Baya",
            "url": "https://www.chronicle.co.zw/the-evolution-of-zimbabwean-theatre-insights-from-renowned-playwright-raisedon-baya/",
            "content": "Showbiz Writer\n\nZimbabwean theatre has long been a vibrant tapestry woven with diverse styles and influences, but what truly defines its essence?\n\nIn a post on social media, renowned playwright Raisedon Baya addressed this question, shedding light on the complexities and nuances of theatre in Zimbabwe.Reflecting on his years in theatre, Baya noted that the inquiry into a distinct Zimbabwean theatre style is not straightforward.\n\nNot because there is no Zimbabwean theatre, he said, but because there are so many forms and styles that make it so difficult to pick one and say this is distinctly and authentically Zimbabwean theatre.\n\nBaya stated that this diversity is what makes Zimbabwean theatre both fluid and colourful, characterised by a hybrid nature that borrows from various traditions and philosophies.\n\nA Melting Pot of Influences\n\nBaya highlighted the significant influence of South African township theatre, particularly in Matabeleland and surrounding areas.\n\nThis influence manifests in productions that are brave, non-apologetic, and rich in music and dance.\n\nIt is rare to find a theatre piece in the region that has no music and a bit of dance, he said, emphasising the energetic and absorbing nature of these performances.For example, Siyaya Arts Zambezi Express, a dance production and musical that toured internationally, is one of the many plays that have emerged from this city, epitomising Bayas sentiments.\n\nConversely, in other parts of Zimbabwe, theatre often leans towards comedy and satire, tackling serious social issues in a more digestible manner. Baya cited prominent figures like Ben Sibenke and Kapfupi, who have paved the way for this comedic approach.\n\nYet, he also recognised a more serious strand of theatre that borrows heavily from Western structures, creating a contrast within the artistic landscape.\n\nThe Question of Identity\n\nAs Baya pondered the need for a distinctly Zimbabwean theatre, he posed a philosophical question:\n\nIs it important that there should be a theatre that is distinctly called Zimbabwean theatre? Or is theatre just theatre, like soccer is just soccer or horse racing is just horse racing?\n\nThis inquiry invites audiences to contemplate not just the identity of Zimbabwean theatre but also its purpose and impact.\n\nBaya suggested that perhaps Zimbabwean theatre should reflect the opposite of what people experience every day. Perhaps our theatre venues should be places of hopeplaces of healing, he said.\n\nA Call for Resilience and Innovation\n\nDespite the challenges faced by the theatre community, Baya expressed optimism. It is a miracle that our theatre has survived the darkest of times, he said, highlighting its resilience amid a backdrop of societal struggles, chief among them, funding.\n\nIn Zimbabwe, theatre like other so called sub genres receive little or no funding from corporates as many businesses are hesitant to invest in theatre due to perceived risks and the prioritisation of more immediate business needs over cultural sponsorship.\n\nMany theatre groups rely on foreign grants or aid, which can be inconsistent and subject to the priorities of international donors and eventually lost its mojo when art practitioners started catering to the taste of donors at the dawn of the 21st century.\n\nBaya called for a move away from merely dark themes, advocating for a theatre that is outspoken and critical, artistic and experimental.\n\nOur theatre must have audiences holding their breath in anticipation, Baya said, underscoring the need for innovation and creativity.\n\nThe challenge lies not only in reflecting the realities of life in Zimbabwe but also in crafting experiences that inspire hope and imagination.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/TRGYRR.jpg",
            "description": "Showbiz Writer Zimbabwean theatre has long been a vibrant tapestry woven with diverse styles and influences, but what truly defines its essence? In a post on social media, renowned playwright Raisedon Baya addressed this question, shedding light on the complexities and nuances of theatre in Zimbabwe. Reflecting on his years in theatre, Baya noted that […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "Rains expose poor drainage",
            "url": "https://www.chronicle.co.zw/rains-expose-poor-drainage/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE onset of the rainy season has once again exposed the poor drainage systems in Bulawayo and other urban areas across the country hence the calls from residents for councils to address the problem.\n\nDuring the past few days Bulawayo received significant rainfall, which has led to waterlogged streets, raising concerns about the adequacy of urban planning and maintenance.\n\nThe city centre is susceptible to flash flooding due to blocked drainage systems, which endanger motorists and pedestrians, contributing to the destruction of road infrastructure and creating health hazards.\n\nSeveral tonnes of garbage are left uncollected on the streets clogging drains and creating a myriad of related health and infrastructural problems.\n\nChronicle news crew yesterday observed that clogged drains in the city exacerbated flooding as water pooled in front of shops.Urban planners and residents have attributed the problem to a combination of outdated drainage systems, poor waste management and rapid urban expansion.\n\nA woman crosses a street strewn with decaying vegetables washed out by water from clogged drains along 5th Avenue yesterday\n\nBulawayo City Council (BCC) says it is clearing more than 160 km of drainage system annually through its internal teams and collaboration with community groups in various neighbourhoods.\n\nThe local authority said the situation has also been worsened by littering, with plastic waste clogging drainage systems.BCCs corporate communications officer, Ms Bongiwe Ngwenya said: More than 160km of drainage is cleared annually through the councils internal teams and the engagement of community groups in various residential areas. This is inclusive of the culvert systems in the CBD.\n\nShe said while drains are cleared periodically towards the rainy season, the biggest challenge is the maintenance of storm drains in the city centre due to the dumping of waste and litter into the catch-pits and side pits.\n\nThe food takeaway containers, soft drinks bottles and restaurant packaging always accumulate inside the culvert system thereby blocking the pipe system.\n\nIt is also important that residents fully utilise rubbish bins as littering will result in the blockage of these underground drains, said Ms Ngwenya.\n\nBulawayo Vendors and Traders Association (BVTA) Mr Michael Ndiweni said most blockages are caused by activities of unregistered vendors.\n\nThis is a serious concern. Its a fact that there are informal traders who are trading at undesignated areas. Those are the groups that are giving the city problems and contributing to littering, he said.\n\nMr Ndiweni said those with allocated or designated trading spaces clean their areas because they are held accountable by the Bulawayo City Council.\n\nHe said some of the illegal traders are from other towns and cities who most of the time operate at night.\n\nThey do trading at night and in the wee hours of the morning, they get into buses and leave the city. Some bring vegetables into the city and leave heaps of plastic and bio-degradable waste, which contributes to clogging of the citys drainage system, he said.\n\nMr Ndiweni said his organisation has been conducting anti-litter awareness campaigns to encourage members to clean their areas.\n\nAs Bulawayo Vendors and Traders Association, we educate our members on the importance of keeping the environment clean. Most of them now understand that they can only attract customers when they keep the environment clean, he said.\n\nDr Nicholas Muleya, an expert in urban planning, attributed the problem to a combination of outdated drainage systems, poor waste management and rapid urban expansion. Many of our drainage systems were designed decades ago for much smaller populations, he said.\n\nA Bulawayo-based architect, Mr Adams Mapingire urged local authorities to redraft their urban designs to prevent future disasters.\n\nA car splashes water as it navigates a puddle along Samuel Parirenyatwa Street in Bulawayo yesterday\n\nHe noted that most cities still use outdated infrastructure that can no longer cope with the growing urban population.\n\nThere is an urgent need to redesign urban centres drainage systems as the existing infrastructure is outdated and struggles to accommodate the growing population. Local authorities should invest in human capital and enhance their staffs skills to enable them to redesign infrastructure that meets modern requirements, he said.\n\nMr Mapingire said most local authorities were missing opportunities to harness water for other uses.\n\nCities are losing water, which could be used for other purposes because they have no systems to harvest the water when it rains, he said.\n\nThe Meteorological Services Department (MSD) has warned of more heavy rains in the coming weeks, urging cities to prepare for potential flooding. As the rainy season progresses, the need for sustainable urban planning and proactive measures to address drainage issues becomes increasingly urgent.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/continous-Rains-expose-BCC5-4.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw THE onset of the rainy season has once again exposed the poor drainage systems in Bulawayo and other urban areas across the country hence the calls from residents for councils to address the problem. During the past few days Bulawayo received significant rainfall, which has led to waterlogged streets, raising concerns about […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "Contango Holdings receives first $200k royalty payment",
            "url": "https://www.chronicle.co.zw/contango-holdings-receives-first-200k-royalty-payment/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nCONTANGO Holdings Plc, a London-listed natural resource development firm, has received its first royalty payment of US$200 000 from its Muchesu coal project, marking a significant milestone for the company.\n\nThe payment is part of a Mineral Royalty Agreement (MRA) with its new investor, Huo Investments (Pvt) Limited, and signals growing confidence in the projects potential.\n\nAn additional US$800 000 royalty payment is expected this month, bringing the total to US$1 million. In 2024, Contango sold a 51 percent stake in the Muchesu colliery project to Zimbabwe-based Chinese investor Mr Wencai Huo.\n\nThe agreement includes a commitment by Mr Wencai to invest US$20 million into the 2,6 billion-tonne coal project. Contango retains a 24 percent stake in the colliery, with plans to increase its shareholding in Monaf Investments (Pvt) Limited, the projects controlling entity, to 74,75 percent.\n\nUnder the MRA, Contango is guaranteed a minimum royalty payment of US$2 million annually, with additional payments tied to coal production levels. Another US$1 million payment is anticipated by the end of Q1 2025.\n\nCommenting on the milestone, Contangos chief executive officer, Mr Carl Esprey, expressed optimism about the projects future.\n\nThis milestone marks a significant step forward in unlocking the immense value of the Muchesu coal project. The receipt of our first royalty payment not only underscores the confidence our partners have in the projects potential but also reinforces our commitment to delivering consistent value for our shareholders, he said.\n\nHe added that the operational foundations are now firmly in place, paving the way for continued progress and growth opportunities.The Muchesu coal project is initially focused on the production and sale of coking coal, which attracts a royalty of US$8 per tonne.\n\nThe projects 3 000-tonne-per-day Dense Media Separation Plant is now operational, having undergone testing and calibration. Coal remains Zimbabwes dominant energy mineral, with vast reserves concentrated in the north-west and southern regions.\n\nThe Muchesu project is poised to play a pivotal role in harnessing this resource for economic growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/DFDFDFD.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw CONTANGO Holdings Plc, a London-listed natural resource development firm, has received its first royalty payment of US$200  000 from its Muchesu coal project, marking a significant milestone for the company. The payment is part of a Mineral Royalty Agreement (MRA) with its new investor, Huo Investments (Pvt) Limited, and signals growing confidence […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        },
        {
            "title": "T-man Xpress ushers Bulawayo into 2025",
            "url": "https://www.chronicle.co.zw/t-man-xpress-ushers-bulawayo-into-2025/",
            "content": "Nqobile Tshili,[emailprotected]\n\nSouth Africas amapiano vocalist T-man Xpress wowed revellers at Ko-Samuriwo Pub and Grill on New Years Day and promised to return to the country saying he was charmed by his first Zimbabwean act.\n\nThe rain did not deter T-man Xpress from delivering a sterling, flawless performance, with the crowd singing along to most of his tracks. Despite patrons paying a cover charge to enter the popular venue, it was packed to the brim as hundreds came to welcome the New Year.\n\nT-man Xpress wows the crowd\n\nT-man Xpress came on stage at 1 AM and performed some of his hit songs such as Imnandi Lento, Imali Ikhona and Amasango, among others. The crowd had already been energised as DJ Mzoe and other local artistes had set the stage for the party.\n\nIn an interview after his performance, T-man Xpress said he was charmed by the reception of his music.\n\nI didnt know that so many people know my music in Zimbabwe. There are a lot of people that know my music and that was the highlight for me. When I check my Spotify top areas, Bulawayo is always there, so I see the connection better when Im here, said T-man Xpress.\n\nMy take-home is that people are singing along to my music. I dont want to lie. I will speak about this the whole night, even to my family; I would say I went to Zimbabwe and people are singing my songs.\n\nHe described Zimbabweans as highly hospitable and expressed a desire to have more shows in the country. T-man Xpress said he was even surprised by the environment, saying it is very different from what is portrayed by media.\n\nThis is my first time in Zimbabwe. People are amazing; the things that we see in the news and what I have seen here are totally different. I was expecting something else, said T-man Xpress.\n\nIn 2025, expect more music and more visits to Zimbabwe. I dont want to lie. Im surprised, I had a different perspective from what is obtaining.\n\nDespite Ko-Samuriwo Pub and Grill being in Luveve suburb, T-man Xpress said was impressed by its modern architectural designs. The venue has a VIP lounge and a general site for members of the public.\n\nThis place is in the ghetto but its a dope place. I have never seen so many people in an establishment like this. Everything is interconnected, whether you are in the VIP or upstairs or in the general area; it was one thing. When I was on stage, I wanted to see whether people would vibe like people out there. It was one thing; I could not see the difference, he said.\n\nT-man Xpress was also impressed with the turnout for the New Years celebrations.\n\nYou guys turn up! What I saw outside there, were guys on top of cars. I have never seen that in South Africa. Yes, we turn up; we are wild but you guys appreciate it. In South Africa, its different; people are minding their own business, but here, people are united, he said.\n\nBrian Samuriwo, the proprietor of the venue, said the popularity of Ko-Samuriwo Pub and Grill is due to the fact that they have made the place a community project.\n\nWith what we are doing in the community, many people are supporting our initiatives. Also, this is a new vibe and people always like a new vibe. Our services and our prices could also be attracting the numbers. We have to continue giving people what they want and that is how we aim to continue running this business, said Samuriwo.\n\nHe said he deliberately brought T-man Xpress to Luveve as Bulawayo residents have a connection with South African music.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/rfgtryty.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw South Africa’s amapiano vocalist T-man Xpress wowed revellers at Ko-Samuriwo Pub and Grill on New Year’s Day and promised to return to the country saying he was charmed by his first Zimbabwean act. The rain did not deter T-man Xpress from delivering a sterling, flawless performance, with the crowd singing along to […]",
            "time": "08:40",
            "date": "03 Jan 2025"
        }
    ]
}