{
    "news": [
        {
            "title": "Zimbabwean inventor unveils world’s first self-powering vehicles",
            "url": "https://www.chronicle.co.zw/zimbabwean-inventor-unveils-worlds-first-self-powering-vehicles/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nZIMBABWEANS are capable of spearheading game-changing first-of-a-kind innovations that challenge the worlds traditional ways of doing things, President Mnangagwa has said.\n\nThe President said this yesterday when Zimbabwean innovator and inventor Mr Maxwell Chikumbutso paid a courtesy call on him at State House in Harare to showcase his latest invention of the worlds first self-powering vehicles and bikes that run on radio waves.\n\nSuch inventions, said President Mnangagwa, were testament that Zimbabweans were skilled enough to usher leading inventions that defy logic.\n\nThis is the only vehicle (of its kind) that exists in the world, there is no other.This is the only vehicle in the world and it is here in Zimbabwe.\n\nHe (Mr Chikumbutso) is so gifted that you will not believe itwhen he first came to talk to me I thought he was not properly wired in his head, but I now know that he is well connected, he said with a laugh.\n\nPresident Mnangagwa said he was personally supporting Mr Chikumbutso in his endeavours.Americans had initially offered the 44-year-old High School dropout millions of dollars to stay and continue his work in the United States, an offer he refused.\n\nThey offered him US$3 million to stay there and I told him to let them have their US$3 million.Yes (he never went far with school) but he is more educated than engineers with his FormTwo.\n\nAll thisfrom the time he began doing these things, I have been supporting him throughout, President Mnangagwa said.\n\nThe President had nothing but praises for Mr Chikumbutsos innovations, which include a wireless self-powering unmanned aerial vehicle (UAVs), commonly known as a drone and television sets, among other inventions.\n\nPresident Mnangagwa said he actually had the television set at home and had watched it.\n\nHe brought the television to my housethe television has no wiring (for connection), you can watch the television, all the stations you want on a tarmac.\n\nHe has been doing that at my house. But you will not believe it until you see it. About two years ago he said he would make a drone and he made one, he said.\n\nMr Chikumbutso narrated the modalities of his latest invention.\n\nAs you know, radio frequencies are measured in nanovolts, meaning to say they are less than a voltbut we find a way of harnessing it through the creation of 70 percent of the components in the microsonic energy, which I have tailor-made.\n\nSo, those are the components that enable the radiofrequency to be transferred into pure, useful energy and this is the first of its kind in the world, he said.\n\nThe inventor chronicled how he and his colleague were poisoned in the United States of America because their idea was deemed unconventional.\n\nMr Chikumbutsos colleague succumbed to the poisoning incident.\n\nWith that technology, it violates the laws of energy in thermodynamics and also the first law of energy as well he said, before President Mnangagwa interjected saying, So they wanted to arrest him for changing physics.\n\nMr Chikumbutso continued recounting his ordeal of persecution.\n\nEven when we tried to file a patent, they (Americans) said we were violating the natural laws of physics, so it is not industrially applicable.\n\nWe decided to take the trade secret route after that, he said.\n\nMr Chikumbutso said his latest vehicle invention could even be used to power houses, terming it a moving generator.\n\nSo ,with this car, you can also use it to power your house, it is a moving generatorit gives you 15 kilowatts to power your house, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/111-1-680x380.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau ZIMBABWEANS are capable of spearheading game-changing first-of-a-kind innovations that challenge the world’s traditional ways of doing things, President Mnangagwa has said. The President said this yesterday when Zimbabwean innovator and inventor Mr Maxwell Chikumbutso paid a courtesy call on him at State House in Harare to showcase his latest invention of […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "Government looks inward after US pullout",
            "url": "https://www.chronicle.co.zw/government-looks-inward-after-us-pullout/",
            "content": "Chronicle Writers\n\nGOVERNMENT has acknowledged the potential impact of the United States of Americas withdrawal from the World Health Organisation (WHO) on Zimbabwes health sector and has assured the nation that domestic resource mobilisation efforts will be intensified to bridge the gap.\n\nThe US, a key global funder of health initiatives, has historically supported Zimbabwe through programmes like the Presidents Emergency Plan for AIDS Relief (Pepfar). However, President Donald Trumps decision to withdraw US funding from WHO, citing alleged mismanagement of the Covid-19 pandemic and failure to implement reforms, has raised concerns about the continuity of critical health services.\n\nThe move, which also includes a freeze on new spending for foreign aid projects, threatens to disrupt the supply of antiretroviral drugs (ARVs) and other essential resources for Zimbabwes HIV, tuberculosis (TB) and malaria programmes.\n\nPresident Trump withdrew his country from the WHO last week, a move that public health experts say will undermine the nations standing as a global health leader and make it harder to fight the next pandemic.\n\nThis follows his signing of an executive order that banned any new US spending on foreign aid projects, followed by the stop-work order issued on January 24, which means that funding to Pepfar, even for existing grants and contracts, is frozen.\n\nThe US has long been a driving force in the global fight against HIV, tuberculosis (TB) and malaria through its bilateral programmes and robust support of the Global Fund and other multilateral organisations. The Global Fund worked hand-in-hand with the US Presidents Emergency Plan for Aids Relief, the US Presidents Malaria Initiative, and the US Agency for International Developments TB programme.\n\nBy working with several African countries to help prevent, diagnose and treat HIV, TB and malaria, the Global Fund strengthened local health systems. The UNDP-Global Fund partnership has been a cornerstone of Zimbabwes remarkable progress in the fight against HIV and Aids.\n\nIn an interview yesterday, Health and Child Care Deputy Minister Sleiman Timios Kwidini, assured the nation that the Government is exploring alternative funding mechanisms.\n\nThe withdrawal of the United States from the WHO will undoubtedly have an impact on our health programmes, particularly those supported by Pepfar and the Global Fund, he said.\n\nAlthough this was unexpected, we are committed to strengthening domestic resource mobilisation to bridge the funding gap.\n\nEarlier, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, speaking during the recent World Economic Forum in Davos, Switzerland, proposed earmarking specific taxes, such as a sugar content tax and a proposed levy on fast foods, to bolster health funding.\n\nHe emphasised the urgency of preparing for reduced external support, particularly for critical programmes like Pepfar, which has yet to issue an official update on its funding status.\n\nAccording to UNAIDS, Zimbabwe has made remarkable strides in combating HIV, achieving the UNAIDS 95-95-95 targets alongside Botswana, Eswatini, Rwanda, and Tanzania. These targets ensure that 95 percent of people living with HIV know their status, 95 percent of those diagnosed are on treatment, and 95 percent of those on treatment have suppressed viral loads. However, the country remains heavily reliant on donor funding.\n\nThere is anxiety that more than one million Zimbabweans who are into antiretroviral therapy (ART) treatment for HIV could face a medical dilemma following the USs decision to stop funding all international aid organisations.\n\nThe US is the largest single donor of aid globally with reports that in fiscal year 2023, it disbursed $72 billion in assistance.\n\nNational Aids Council (NAC) chief executive officer Dr Bernard Madzima highlighted the critical role of US-supported initiatives.\n\nWe are aware of developments as far as US funding is concerned and the impact that it might have on our health programmes because USAID, PEPFAR and Global Fund are all important partners in funding our health programmes, he said.\n\nThe support is in the form of ARVs, commodities for laboratories, vehicles, and human resources and if we are to lose this funding the impact will be huge.\n\nDr Madzima said there is also the issue of NGOs in the country who are supported by USAID and any withdrawal of that support has an impact on the countrys health programmes.\n\nOf the 1,3 million people who are HIV positive in Zimbabwe, 1,1 million are on ARVs and a huge chunk of ARVs in the country are supported by partners, including USAID and Global Fund, he said.\n\nAs it is we have not received any official communication to that effect, only hearing of this news through the media space but there is a need to see how as a country we can respond to it.\n\nDr Madzima stressed the need for Zimbabwe to urgently implement a sustainability roadmap to fund its health programmes, saying it is now imperative for African governments to take ownership of their health systems.\n\nAs a country, we really need to come up with ways of mobilising domestic resources to ensure continuity by funding our own health, he said.\n\nMedical expert and academic Dr Solwayo Ngwenya said as Zimbabwe navigates the potential fallout from reduced US funding, the Governments commitment to domestic resource mobilisation will be critical.\n\nHe urged the Government to act swiftly.\n\nThis is a matter of life and death. Innovative measures are needed to secure funding for HIV, TB, and malaria programmes. Introducing sustainable taxes, such as allocating a percentage of VAT to the health sector, could be a viable solution, said Dr Ngwenya.\n\nHe said strengthening local health systems and reducing dependency on external aid are key to ensuring the sustainability of health programmes and safeguarding the lives of millions of Zimbabweans.\n\nThe International Aids Society (IAS) has also raised alarms over the US decision.\n\nIn a statement, IAS president Ms Beatriz Grinsztejn said the US decision threatens millions of lives worldwide.\n\nThis is a matter of life or death. PEPFAR provides lifesaving antiretroviral for more than 20 million people and stopping its funding essentially stops their HIV treatment. If that happens, people are going to die and HIV will resurge, she said.\n\nSince its inception in 2003, PEPFAR has invested over US$110 billion in the global HIV response, saving 26 million lives and preventing millions of infections in over 50 countries.\n\nIts said that a voice once spoke from the Njelele rocks, and even today, many come for spiritual connection, solidifying its place as a cornerstone of cultural tourism in Matabeleland South, he said.\n\nWe want to create a road that serves as a corridor to communicate the culture of our people. Matobo Hills are a World Heritage Site, and this must be incorporated into the roads construction. The world should come to know about Matobo Hills through this road.\n\nThat is why we will have fuel service stations that reflect some of the natural tourist features found within Matobo National Park. For instance, we will have a Zebra service station, said Eng Mbambo.\n\nSuch animals are found in Matopo National Park. Eco-tourism will be at the centre of the roads construction. We want to be pathfinders, and in doing so, we must produce a unique product.In a break from tradition, Zwane Enterprise is forgoing the standard concrete slab rest stops.\n\nInstead, it will design layovers inspired by traditional Nguni huts, complete with piped water and ablution facilities. This approach will enhance the cultural experience for travellers while providing essential amenities.\n\nIm shocked that to this day we are still creating concrete slab lay-bys and bus stops where people just stop, leave their vehicles and use the bush to relieve themselves.\n\nWe will create lay-bys or bus stops with running water and ablution facilities every 10km. We will design lay-bys with structures that highlight Ndebele culture and traditional circular huts, similar to the type of huts brought from Zululand, said Eng Mbambo.\n\nHe hinted at extending the cultural theme to the tollgates, ensuring their design reflects the unique heritage of the surrounding areas.\n\nThe two planned tollgates, one at the Gwanda end and the other near Bulawayo, will serve as gateways to this cultural journey.\n\nThe tollgates will also be themed to reflect the heritage of the area. The one at Ntunjambili will be themed along the Matobo Hills, depicting the mountains in the Matobo area, and will be situated 33km from the Bulawayo end, said Eng Mbambo.\n\nIt will be situated where the Matobo Hills start, while the Vumbachikwe tollgate will be themed around the mining areas of Gwanda. This tollgate will showcase mining equipment and the large mining areas in that region.\n\nYou will see, as we move towards the inauguration of the road, that we want to have an inscription stating, If you have not driven along Old Gwanda Road, you have not experienced Zimbabwe. This is a road where we do not expect people to drive fast, but rather a road where they will learn about our unique heritage and perhaps stop along the way to explore tourism products.\n\nEng Mbambo firmly believes that cultural heritage is a powerful economic driver. While others showcase their heritage through canvas paintings, Zwane Enterprise is taking an innovative approach by weaving it into the very fabric of the road.\n\nHe acknowledged Zimbabwes abundance of natural and cultural heritage sites and stressed the need to unlock their full potential.\n\nThe project aspires to be a model for monetising these treasures, ensuring they become sustainable economic engines for the region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-17-1.jpg",
            "description": "Chronicle Writers GOVERNMENT has acknowledged the potential impact of the United States of America’s withdrawal from the World Health Organisation (WHO) on Zimbabwe’s health sector and has assured the nation that domestic resource mobilisation efforts will be intensified to bridge the gap. The US, a key global funder of health initiatives, has historically supported Zimbabwe […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "COMMENT: When settling disputes let’s always remember that life is sacrosanct",
            "url": "https://www.chronicle.co.zw/comment-when-settling-disputes-lets-always-remember-that-life-is-sacrosanct/",
            "content": "THE spate of violent crimes culminating in multiple high-profile murder cases, paints a grim picture of a society plagued by senseless violence and a disregard for human life.\n\nSeveral individuals have this month been handed down lengthy prison sentences or life imprisonment for committing heinous acts, highlighting the growing severity of crimes that often arise from trivial disputes.\n\nOne such case is that of Trenias Shumba and his 17-year-old son, Tinevimbo, who were sentenced to 45 years in prison for the murder of 89-year-old, Mr Siriyoti Taruvinga.\n\nThe pair, along with an accomplice still at large, robbed the elderly man at a bus stop, kicking him repeatedly before taking his knife and torch.\n\nAlthough Mr Taruvinga initially survived the attack, he succumbed to brain injuries weeks later. This senseless attack on an elderly man, driven by the most basic of desires  robbery  raises alarm about the level of violence now prevalent in our communities.\n\nSimilarly, the tragic death of Tinashe Siziba, fatally stabbed by his friend Solomon Ndlovu following a disagreement over a cigarette, underscores the escalating danger of seemingly minor disputes turning deadly.\n\nNdlovu, enraged by Sizibas refusal to buy him a cigarette, used a homemade knife to stab his friend 14 times, an act of brutal violence that ended in Sizibas death. This case speaks to a larger issue: the deepening culture of violence where even the smallest of grievances lead to irreversible consequences.\n\nIn yet another horrific instance, five men, including four brothers, were sentenced to life imprisonment for the brutal murder of Mr Isabel Ndlovu in Silobela.\n\nThe gang ambushed Ndlovu, stabbing him with knives, hitting him with logs and stomping on him until he succumbed to his injuries. The cruelty and lack of remorse displayed during the attack were chilling, as evidenced by the callous comments made to Ndlovus mother after the murder. The murder was not only violent but also public, with witnesses recounting the gruesome assault.\n\nThese cases, though varied in circumstances, share a common thread, a disturbing disregard for human life.Whether driven by theft, a petty argument, or a perceived slight, these actions highlight a society where violence is increasingly seen as an acceptable way to resolve conflicts.\n\nThe justice system may provide retribution, but it is only through collective action to rebuild communities and promote respect for life that we can hope to stem this tide of violence.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/06/domestic-violence-1-1.jpg",
            "description": "THE spate of violent crimes culminating in multiple high-profile murder cases, paints a grim picture of a society plagued by senseless violence and a disregard for human life. Several individuals have this month been handed down lengthy prison sentences or life imprisonment for committing heinous acts, highlighting the growing severity of crimes that often arise […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "Government, investor sign deal to kick-start work on Gwanda Road",
            "url": "https://www.chronicle.co.zw/government-investor-sign-deal-to-kick-start-work-on-gwanda-road/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE government yesterday signed a concession agreement with a local investor, Zwane Enterprise, granting approval for the contractor to resume the upgrading of the Bulawayo-Old Gwanda Road at an estimated cost of approximately US$150 million.\n\nThe contractor has pledged to move onsite starting next Monday. Cabinet approved the construction of Old Gwanda Road under the Public-Private Partnership (PPP) last May.\n\nWhile the initial cost was pegged at US$110 million, Zwane Enterprise has indicated that the total cost of the project will be US$150 million, factoring in additional funds required for the construction of road furniture, including toll gates, service stations and a rural shopping mall.\n\nThe Ministry of Transport and Infrastructure Development and Zwane Enterprise signed the concession agreement in Harare yesterday.\n\nThe Permanent Secretary of the Ministry of Transport and Infrastructure Development, Engineer Joy Makumbe, represented the Government, while Zwane Enterprises chief executive officer, Engineer Bekithemba Mbambo, represented the company.\n\nEng Mbambo described the signing of the concession as a milestone development, stating that it marks the beginning of the project, with responsibility now resting solely on Zwane Enterprise to deliver.\n\nThe signing of the concession agreement for Old Gwanda Road is a major milestone in this projects journey. It has been a long three-plus years, he said.\n\nThe road will bring significant development and jobs to the corridor, Matabeleland South province, and Zimbabwe as a whole in various sectors such as construction, hospitality, tourism and agriculture, among others, said Eng Mbambo.\n\nNow, the ball is squarely in Zwanes court to deliver a quality road on time.He added that the only potential delay to the commencement of road construction would be the rainy season.\n\nHowever, we will use this time for preparatory work, which includes, among other things: financial closure, homestead relocations, the ground-breaking ceremony, land acquisitions and the construction of road furniture, said Eng Mbambo.\n\nSo, there is a lot of preparatory work to do. We plan to start the construction of the first homestead by Monday, February 3.\n\nZwane Enterprise released an innovative architectural design for the project last year, which aims to celebrate the cultural and tourism ecosystem of Matabeleland South.Eng Mbambo, a self-proclaimed culturalist, views the project as more than just road construction.\n\nThere is no other road packed with cultural and heritage sites like the Old Gwanda Road. It has the Kings Kraal at Mhlahlandlela, King Mzilikazis grave at Entumbane and Cecil John Rhodes grave along the way, he said.\n\nAs we go further towards Ntunjambili, it is embedded with the folklore of the people which is part of our heritage.\n\nThe whole of Matobo Hills is also represented along the road. Alongside the roadside, there are Bushman paintings at sites like the Gulabahwa Carve Heritage Site, with unique paintings.\n\nUnderlining the cultural significance of the route, Eng Mbambo pointed to landmarks like the Njelele Shrine.\n\nThe revered spiritual site attracts visitors from across the region seeking guidance from their ancestors through traditional African practices.\n\nIts said that a voice once spoke from the Njelele rocks, and even today, many come for spiritual connection, solidifying its place as a cornerstone of cultural tourism in Matabeleland South, he said.\n\nWe want to create a road that serves as a corridor to communicate the culture of our people. Matobo Hills are a World Heritage Site, and this must be incorporated into the roads construction. The world should come to know about Matobo Hills through this road.\n\nThat is why we will have fuel service stations that reflect some of the natural tourist features found within Matobo National Park. For instance, we will have a Zebra service station, said Eng Mbambo.\n\nSuch animals are found in Matopo National Park. Eco-tourism will be at the centre of the roads construction. We want to be pathfinders, and in doing so, we must produce a unique product.In a break from tradition, Zwane Enterprise is forgoing the standard concrete slab rest stops.\n\nInstead, it will design layovers inspired by traditional Nguni huts, complete with piped water and ablution facilities. This approach will enhance the cultural experience for travellers while providing essential amenities.\n\nIm shocked that to this day we are still creating concrete slab lay-bys and bus stops where people just stop, leave their vehicles, and use the bush to relieve themselves.\n\nWe will create lay-bys or bus stops with running water and ablution facilities every 10km. We will design lay-bys with structures that highlight Ndebele culture and traditional circular huts, similar to the type of huts brought from Zululand, said Eng Mbambo.\n\nHe hinted at extending the cultural theme to the tollgates, ensuring their design reflects the unique heritage of the surrounding areas.\n\nThe two planned tollgates, one at the Gwanda end and the other near Bulawayo, will serve as gateways to this cultural journey.\n\nThe tollgates will also be themed to reflect the heritage of the area. The one at Ntunjambili will be themed along the Matobo Hills, depicting the mountains in the Matobo area, and will be situated 33km from the Bulawayo end, said Eng Mbambo.\n\nIt will be situated where the Matobo Hills start, while the Vumbachikwe tollgate will be themed around the mining areas of Gwanda. This tollgate will showcase mining equipment and the large mining areas in that region.\n\nYou will see, as we move towards the inauguration of the road, that we want to have an inscription stating, If you have not driven along Old Gwanda Road, you have not experienced Zimbabwe. This is a road where we do not expect people to drive fast, but rather a road where they will learn about our unique heritage and perhaps stop along the way to explore tourism products.\n\nEng Mbambo firmly believes that cultural heritage is a powerful economic driver. While others showcase their heritage through canvas paintings, Zwane Enterprise is taking an innovative approach by weaving it into the very fabric of the road.\n\nHe acknowledged Zimbabwes abundance of natural and cultural heritage sites and stressed the need to unlock their full potential. The project aspires to be a model for monetising these treasures, ensuring they become sustainable economic engines for the region.\n\nDenmark is a country without natural heritage features, but they have created tourism around their culture. They have cultural villages, and people travel from all over the world to visit and experience those villages, said Eng Mbambo.\n\nSo, as we develop, let us be proud of who we are and use our heritage as a tourism product.\n\n-@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-21-1.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE government yesterday signed a concession agreement with a local investor, Zwane Enterprise, granting approval for the contractor to resume the upgrading of the Bulawayo-Old Gwanda Road at an estimated cost of approximately US$150 million. The contractor has pledged to move onsite starting next Monday. Cabinet approved the construction of Old Gwanda […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "Sandy’s Denim and Pearls… Event showcases power of women’s financial clubs, mentorship, solidarity",
            "url": "https://www.chronicle.co.zw/sandys-denim-and-pearls-event-showcases-power-of-womens-financial-clubs-mentorship-solidarity/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nThe successful Denim and Pearls event held this past weekend in Bulawayo was more than just a belated birthday celebration for musician and businesswoman, Sandra Sandy Ndebele  it served as a vibrant platform for womens empowerment.\n\nOrganised by Sandy, who is not only a musician but also a councillor, pig farmer and accomplished entrepreneur, the event brought together women from diverse backgrounds to share their stories.\n\nEarlier in the day, guests reflected on the beginnings of their ventures, the hurdles they have faced and how they have triumphed, inspiring each other with tales of success.\n\nThe event also featured a variety of educational games.Sandy explained that the event was more than just a birthday celebration as it was also a gathering for women involved in money clubs. On the day, it was her turn to receive her share of the collective savings, so she decided to host this special event where she invited South African musicians, DJ Tira and the Qwabe Twins.\n\nSandra Ndebele (second from right) poses for a picture with DJ Tira (second from left) and the Qwabe Twins at the Denim on Pearls event\n\nMoney clubs, popularly known as stokvels, are informal saving schemes where members contribute to a central fund on a weekly, fortnightly, or monthly basis. Typically consisting of 10 to 20 people, these clubs operate by rotating the pooled funds, empowering members and encouraging a culture of saving.\n\nSandys event was attended by club members operating at various financial levels, with contributions ranging from as little as $10 to as much as $10 000.\n\nSandy said, This event was all about doing a club within a club, a form of financial empowerment for women. Instead of simply giving someone their portion of the money, we further boost them by supporting an event that they host. For example, members can buy drinks or pay entrance fees to contribute. We only allowed men into the event after 7pm, as we were focused on this initiative. She stressed the impact of these clubs in transforming lives.\n\nThese clubs allow us to empower each other by pooling our resources and purchasing something meaningful for each member every month. By the end of the year, were an empowered group  whether its through acquiring stands, cars, or houses, depending on the amount weve agreed upon per round.\n\nSharing some of the challenges she has faced, Sandy, who began by participating in smaller clubs before rising to greater heights, revealed that there was a time when she was robbed of her hard-earned money by some women. But, despite the setback, she did not let it deter her and later started a small money-lending business.\n\nWe now have Sandras Financial Grant, a venture born after I was robbed by some ladies, she said.Through this journey, I have met amazing women who have inspired me, and I want to encourage us, as women, to always be there for one another.\n\nSandy also shared her aspirations for Sandras Financial Grant, expressing her dream of transforming it into a fully-fledged bank in the coming years. She encouraged women to take bold steps in entrepreneurship, starting businesses with the little they have.\n\nSandra Ndebele addresses attendees at the Denim and Pearls event\n\nNow an established musician, Sandy shared her inspiring journey as an artiste, gratefully acknowledging the pivotal role award-winning businesswoman, Sipho Mazibuko played in her rise in the music industry.When I began in the music industry, I was young and had no one to guide me. Then, I met the amazing Sipho Mazibuko, who showed me the way. I wouldnt be where I am today if it wasnt for this woman, Mazibuko, said a grateful Sandy.\n\nShe also reflected on her humble beginnings growing up in Nkulumane township in Bulawayo, where she lacked knowledge about makeup and fashion. It was Mazibuko who mentored her and taught her the essentials.\n\nI grew up in the township, and there were only a limited number of things a girl from the hood was exposed to. Sipho took me in, mentoring me and advising me on so many things  even personal hygiene, Sandy said.\n\nShe taught me about the importance of appearance, teaching me that a lady must always be presentable and clean, as it boosts confidence. I would like to thank her for the exposure she gave me. Even the outfit I wore during the shooting of the Malaika video was from her.\n\nSandy credited Mazibuko, who is the chief executive officer of Strides Models and Miss Rural Africa, for opening significant doors in her career.\n\nI remember after an event, she encouraged me to let ministers listen to my music, and that advice helped me immensely, she said.\n\nTaking turns, speakers shared their stories, equipping one another with valuable financial strategies. Leading by example, Sandy, who holds a First Class Bachelor of Science Music Business, Musicology and Technology Honours Degree, revealed that she is now working toward attaining her masters degree.\n\nWithout a doubt, Sandys determination has made her an inspiration to many, including her mentor, Sipho Mazibuko, who shared her own personal journey of growth during the event.\n\nIm grateful to Sandra, who has been a source of inspiration to me as a daughter. She has challenged me, and I have now enrolled at a university to pursue a degree at the age of 50, said Mazibuko.\n\nIts never too late, ladies. You cannot run a business without education.Mazibuko also expressed her appreciation for Sandys loyalty and support over the years.Sandra showed up for me because she was grateful that I opened Zimbabwe for her. I am glad she did. Most of the girls I groomed forgot about me, but Sandra never did.\n\nShe was there for me when I had a nervous breakdown. Heavily pregnant, she would visit me almost every day at Ingutsheni Hospital. She would sing all my favourite songs, and I would dance. That alone was therapy for me, and she contributed immensely to my healing, shared Mazibuko.\n\nDJ Tira\n\nBesides Mazibuko, Sandy also highlighted other remarkable women she has encountered on her journey. Among them are Lwazi, a miner and Bongi, a lawyer, who have inspired and empowered her in various ways.\n\nAlso in attendance at the event were Sandys mother, various artistes, fashion designers, numerous businesswomen from the city and members of Sandra Ndebeles ward in Nkulumane, where she serves as a councillor. Team Harare was also present, including influencer Lorraine Guyo, who was warmly welcomed and instantly given a new Ndebele name, Nomathemba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Denim-and-Pearls-1.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com The successful Denim and Pearls event held this past weekend in Bulawayo was more than just a belated birthday celebration for musician and businesswoman, Sandra “Sandy” Ndebele — it served as a vibrant platform for women’s empowerment. Organised by Sandy, who is not only a musician but also a councillor, pig farmer […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zimbabwe launches export drive amid rising trade deficit",
            "url": "https://www.chronicle.co.zw/zimbabwe-launches-export-drive-amid-rising-trade-deficit/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWE is focused on growing its exports to reverse trade deficit, which widened to US$196,9 million in December 2024 from US$47,1 million last November representing a 318 percent increase as exports eased by 23,5 percent to US$692,4 million from US$905,2 million, official figures show.\n\nTrade deficit occurs when a countrys value of imports is greater than that of exports in a given period. When the value of exports exceeds the value of imports, it implies a trade surplus.\n\nAccording to latest data from the Zimbabwe National Statistics Agency (ZimStat), the countrys imports decreased by 6,6 percent from US$952,3 million in November 2024 to US$889,3 million in December.\n\nThe December 2024 trade deficit for goods was US$196,9 million, translating to a 318,2 percent increase from a deficit of US$47,1 million recorded in November 2024, said Zimstats.\n\nAmong the top 10 products exported in December 2024 were semi-manufactured gold constituting 42,2 percent, tobacco (22,7 percent) and nickel mattes (8,8 percent).\n\nMineral fuels (20,8 percent), cereals (12,4 percent), machinery and mechanical appliances (9,9 percent) and vehicles (8,1 percent) were among the top 10 products imported in the same month.\n\nThe agency said 33,1 percent of the goods imported in December 2024, comprised industrial supplies, followed by the fuels and lubricants category, which accounted for 19,8 percent.\n\nAmong the countrys major export destinations in December 2024 were the United Arab Emirates constituting 41,9 percent, South Africa 25,9 percent and China at 19,6 percent.\n\nThe three countries accounted for around 87 percent of the total export value of US$692,4 million as industrial supplies comprised 94,6 percent of the goods exported in December 2024. Among the major source countries for imports in December 2024 were South Africa (39,3 percent), China (10,4 percent), Bahamas (8,6 percent) and United Arab Emirates (4,6 percent), said Zimstat.\n\nThe four countries accounted for around 70 percent of the total import value of US$889,3 million, said the agency.Zimbabwe remains focused on growing its exports base to reverse reliance on imports, with ZimTrade carrying the mandate to lead the export drive as the country becomes more integrated into global supply routes, with new markets presenting export opportunities for local products and services.\n\nAccording to ZimTrade, buyers across the world are now looking at Zimbabwe as a source market, with Zimbabwean products gaining mileage due to their high quality.\n\nThe growing appetite for Zimbabwean goods follows a robust campaign by President Mnangagwa to increase the visibility of local products in regional and international markets.\n\nAs part of programmes to energise exports, ZimTrade, recently facilitated the participation of 18 women-led enterprises that are into essential oil production at the Market Access Information, Peer to Peer Learning Programme, to equip them with key technical skills for their businesses.\n\nThe event, held in Cape Town, South Africa, was organised in partnership with the She Trades Initiative of the International Trade Centre, the Small Enterprises Development Agency of South Africa and the United Kingdom International Development.\n\nThe programme focused on 18 women-led SMEs from Zimbabwe and 20 from South Africa to exchange ideas and explore opportunities to boost the sectors performance in Southern Africa.\n\nCommenting on the programme, ZimTrade client advisor Ms Tatenda Machirori, said training on standards and regulations governing commercial activities around essential oils and technical interventions on branding and labelling were critical.\n\nPeer-to-peer review sessions were also part of the programme, allowing women-led enterprises to learn from each other, and establish sustainable business relationships with like-minded businesses in South Africa, she said.\n\nThe programme equipped the women-led businesses with requisite technical skills for the production, packaging and marketing of essential oils.\n\nThe past few years have seen an increase in global demand for essential oils, which are compounds extracted from plant sources such as flowers and fruits, herbs, resins, wood oils, which capture the plants scent and/or flavour, or essence.\n\nThe global market for essential oils, is estimated to have been at US$18,6 billion in 2020, with a Compounded Annual Growth Rate (CAGR) estimated at 7,4 percent between 2020 and 2028.\n\nThe major producers of essential oils across the world are China and India with major essential oil-producing countries in Africa including Morocco, Tunisia, Egypt and Algeria.\n\nThe global demand for natural products has created a thriving market for essential oils, presenting Zimbabwe with an opportunity to harness its abundant biodiversity and untapped resources.Ms Machirori said in Zimbabwe, production of essential oils has grown significantly in the past few years, with most of the production focusing on indigenous products such as mangongo, marula, baobab and ximenia oils.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/zimstat.jpg",
            "description": "Sikhulekelani Moyo, mskulekelani16@gmail.com ZIMBABWE is focused on growing its exports to reverse trade deficit, which widened to US$196,9 million in December 2024 from US$47,1 million last November representing a 318 percent increase as exports eased by 23,5 percent to US$692,4 million from US$905,2 million, official figures show. Trade deficit occurs when a country’s value of […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "Sibanda extends Highlanders stay… Aims for long-awaited league title",
            "url": "https://www.chronicle.co.zw/sibanda-extends-highlanders-stay-aims-for-long-awaited-league-title/",
            "content": "Innocent Kurira,[emailprotected]\n\nAriel Sibanda says his decision to extend his contract with Highlanders is driven by his ambition to help the club secure the long-awaited league title.\n\nYesterday, Bosso honoured Sibanda with a Ford Ranger in recognition of his 16 years of service to the club. The vehicle, previously reserved for the club captain courtesy of sponsors Sakunda Holdings, is now solely his.\n\nAriel Sibanda was honoured with a Ford Ranger in recognition of his 16 years of service to Highlanders FC\n\nHighlanders have not claimed the championship since 2006, and Sibanda believes his experience will be crucial in guiding the younger players towards achieving that goal. He has renewed his contract with the club for a further two years.\n\nI am happy to be extending my stay here. This is home. The club will be turning 100 years next year, and there will be no greater gift to the fans and everyone else than winning the league title. I believe I still have a lot to offer to the club using my experience. I am looking forward to helping the youngsters in the team, Sibanda said.\n\nAriel Sibanda was honoured with a Ford Ranger in recognition of his 16 years of service to Highlanders FC\n\nSibandas previous contract expired on December 31st, and negotiations for a new deal have now been successfully concluded. He has also been returned the captains vehicle, which he had handed back to the club after his contract ended.There had been discussions about Sibanda transitioning into a role as a junior team goalkeeper coach, but he has opted to continue his playing career. At 34 years old, Sibanda remains a key figure for Highlanders, having earned numerous accolades, including a record four Goalkeeper of the Year awards.\n\nHighlanders chairman, Kenneth Mhlophe, expressed gratitude for Sibandas dedication and service.It is with great pleasure that we, Highlanders Football Club, in close partnership with our sponsors Sakunda, salute the long and dedicated service of Ariel Sibanda to football and to Highlanders FC, Mhlophe said.\n\nAriel has served the club for 16 years, won trophies and received individual awards, including a club-record four Goalkeeper of the Year titles. He exemplifies dedication, professionalism, competitiveness, loyalty and leadership.\n\nIt is my pleasure and that of the club, to hand over the vehicle to him as a token of our appreciation for his service during his final year as a club player, Mhlophe added. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-22-2.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw Ariel Sibanda says his decision to extend his contract with Highlanders is driven by his ambition to help the club secure the long-awaited league title. Yesterday, Bosso honoured Sibanda with a Ford Ranger in recognition of his 16 years of service to the club. The vehicle, previously reserved for the club captain […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "SADC Chair’s decisive action brings hope to troubled Eastern DRC",
            "url": "https://www.chronicle.co.zw/sadc-chairs-decisive-action-brings-hope-to-troubled-eastern-drc/",
            "content": "Gibson Mhaka, Zimpapers Politics Hub\n\nTHE late former Secretary-General of the United Nations and Nobel Peace Prize laureate, Kofi Annan, told us that enmity between people does not and cannot last forever, but that making peace requires extraordinary courage from all sides.\n\nTime and time again, he reminded us that conflict is rarely resolved through the force of arms alone, and that political dialogue is crucial for building lasting peace.\n\nPresident Mnangagwa\n\nWith that in mind, the exemplary and unequivocal message by President Mnangagwa who is also the Sadc Chairman, that the regional bloc will take full responsibility for the situation in the Democratic Republic of Congo (DRC) and take decisive action to address the deteriorating security issues in the eastern parts of the vast and resource-rich country must be applauded by all peace loving people.\n\nPresident Mnangagwa has recognised that at this critical juncture, with the lives of countless vulnerable civilians being lost, there is an urgent need to maintain Sadcs mandate of preserving peace.\n\nThis commitment stems from the fundamental principles upon which the organisation was founded: to foster peace, security and stability within the Southern African region.\n\nRecognising the devastating impact of conflict on human lives, economic development and regional stability, Sadc has consistently prioritised the peaceful resolution of disputes and the prevention of conflict.\n\nIn a statement on Monday, President Mnangagwa expressed grave concern over the security situation in Eastern DRC, where rebels have reportedly seized the city of Goma, leaving a bloody trail and displacing hundreds.He stressed that urgent action is needed to address the rapidly deteriorating situation, characterised by escalating violence, widespread displacement and a growing humanitarian crisis.\n\nThe Chairman of Sadc, His Excellency President Emmerson Dambudzo Mnangagwa expresses grave concern on the deteriorating security and humanitarian situation in the Eastern DRC occasioned by the offensive operations of the M23 rebels.\n\nThe Chairman condemns, unreservedly, the cowardly attacks on the UN and Sadc peacekeepers that have resulted in some of them paying the ultimate sacrifice for the cause of peace in the Eastern DRC, read the statement issued by the Sadc Secretariat.\n\nThe death toll from fighting between peacekeeping soldiers and M23 rebels in eastern Congo has reached 13.The number includes nine South African National Defence Force (SANDF) soldiers and others from Malawi and Uruguay deployed as part of the Southern African Development Community (SADC) regional force or under the UN mission in Congo (Monusco).\n\nThe Chairman of SADC presents his condolences to the families of the deceased peacekeepers and wishes those injured a quick recovery. The Chairman of SADC points out that SADC will assume its full responsibility and take action to deal with the deteriorating security and humanitarian situation in Eastern DRC. Those responsible for the situation should be held accountable, read the statement.\n\nHe stressed that, for its part, Sadc recognises the sacrifices made by the peacekeepers who laid down their lives in pursuit of this noble goal.\n\nThe bloc sends a clear and unequivocal message to the M23 and its backers that actions endangering the lives of civilians and UN peacekeepers will not be tolerated.\n\nThe loss of innocent lives and the displacement of countless civilians demand a decisive and collective response from the regional bloc, requiring a concerted effort from all member states to address the root causes of the conflict, support humanitarian efforts and engage in meaningful dialogue with all stakeholders to find a lasting solution.\n\nThere is a strong need to express sincere appreciation to President Mnangagwa, in his capacity as Chairman of the bloc, for his decisive leadership in addressing this critical humanitarian crisis.\n\nThis proactive stance demonstrates a commitment to upholding the core principles of Sadc and provides renewed hope for a peaceful and prosperous future for the people of the Democratic Republic of Congo. His commitment to upholding peace and security in the region is commendable and provides hope for a brighter future for the people of the Democratic Republic of Congo.\n\nPresident Mnangagwa has also, on numerous international and regional forums, called for collective action in building an inclusive, just and sustainable world anchored on peace, solidarity and mutual respect.This consistent advocacy reflects the Presidents commitment to a global order based on co-operation and shared responsibility.\n\nPresident Joo Manuel Gonalves Loureno\n\nIn an earlier statement, the Sadc Secretariat also noted that the M23 aggression was in violation of the peace agreement that was struck by Angolan leader, President Joase Manuel Goncalves Lourenco, between the DRC Government and the rebels.\n\nThe actions of the M23 armed group contravenes the Nairobi Peace Process and is a clear violation of the agreed ceasefire brokered through the Luanda Process led by His Excellency Joo Manuel Gonalves Loureno, President of the Republic of Angola in his capacity as the African Union Champion for Peace and Reconciliation in Africa.\n\nWe, therefore, call on all parties in the conflict to adhere to their obligations in the ceasefire, calling for immediate cessation of hostilities and atrocities perpetrated by M23 as well as unconditional withdrawal from all occupied positions, reads the statement.\n\nSadc further encourages all parties to the conflict in Eastern DRC to comply with the terms and conditions of the existing peace agreements and engage through dialogue for everlasting peace, security and stability in the DRC and the Region.\n\nThis commitment by the bloc, led by President Mnangagwa as Chairman, to the defence of its mandate reflects Sadcs unwavering belief in the principles of dialogue, diplomacy and peaceful conflict resolution.By upholding these principles, Sadc strives to create a more stable, prosperous and secure future for all people in the DRC and the Region.\n\nThis commitment is further strengthened by the recognition that regional stability and prosperity are inextricably linked to the resolution of conflicts within the region.\n\nSadcs unwavering support for peaceful and diplomatic solutions to regional challenges demonstrates its commitment to a future where all member states can thrive and contribute to the overall development of the Southern African region.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ERYRFGDFGLG.jpg",
            "description": "Gibson Mhaka, Zimpapers Politics Hub THE late former Secretary-General of the United Nations and Nobel Peace Prize laureate, Kofi Annan, told us that enmity between people does not and cannot last forever, but that making peace requires extraordinary courage from all sides. Time and time again, he reminded us that conflict is rarely resolved through […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "Afcon 2025: We need to rise to the challenge, says Nees",
            "url": "https://www.chronicle.co.zw/afcon-2025-we-need-to-rise-to-the-challenge-says-nees/",
            "content": "Innocent Kurira,[emailprotected]\n\nWarriors coach, Michael Nees, says Zimbabwe has been placed in a well-balanced and competitive group for the 2025 Africa Cup of Nations (Afcon), set to take place later this year in Morocco.\n\nThe tournament will run from December 21, 2025 to January 18, 2026.The Warriors, now under the guidance of German coach Nees, are set to make their return to the grand stage after missing the previous edition, held in Cte dIvoire, due to a Fifa suspension.\n\nIn the draw conducted in Rabat, Morocco, the Warriors were placed in a competitive group alongside South Africa, Angola and Egypt. Despite Zimbabwe being ranked in Pot Four, Nees considers the draw to be fair.\n\nThe Warriors avoided the host nation, Morocco, who were drawn in a group alongside Mali, Zambia and Comoros.Nees noted the familiarity among the teams, with Zimbabwe set to face two rivals from the Cosafa region.\n\nWarriors coach, Michael Nees\n\nThree teams from Cosafa. No secrets here  the teams know each other very well. A derby against rivals Bafana Bafana again, and a clash with a skilful Angola side, who have a different playing style. Not to mention North African powerhouses Egypt, record champions and one of the tournament favourites, who will definitely come to Morocco with all their stars and their best team.\n\nIn my opinion, its a very balanced, strong and competitive group, said Nees.Nees hopes the Warriors will progress beyond the group stages.\n\nOur first match will be against Egypt in Agadir, followed by our second game against Angola, and the final group match against Bafana Bafana, with both of those matches in Marrakesh, where we will be based for the tournament. We need to rise to the challenge right from the start, but with good preparation, we can meet the challenge.\n\nAs with any other team, we aim to reach the second round. We respect our opponents, but we have strong self-belief in our own abilities to achieve this objective. This tournament will set new standards for Afcon, I am sure, and the conditions and facilities will be fair and equal for all teams, said Nees.\n\nMohamed Salah\n\nMeanwhile, Egypts coach, Hossan Hassan, told a press gathering at the draw that the Pharaohs would be determined to extend their record, with the support of world-class players such as Mohamed Salah and Manchester Citys new signing, Omar Marmoush.\n\nI would like to wish all the teams the best of luck in this big competition. As the Egyptian team, we are proud because we have won the title seven times. Mohamed Salah  I am lucky as a coach to have him. He is one of the best players in the world.\n\nEgypt has always produced great talent, like Omar Marmoush. I am very happy, as a coach, to have such gifted players. Salah and Marmoush will be key positive elements for the Egypt team, said Hassan. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Untitled-23-1.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw Warriors coach, Michael Nees, says Zimbabwe has been placed in a well-balanced and competitive group for the 2025 Africa Cup of Nations (Afcon), set to take place later this year in Morocco. The tournament will run from December 21, 2025 to January 18, 2026. The Warriors, now under the guidance of German […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        },
        {
            "title": "Pamire, Mwaruwari throw weight behind Magwizi",
            "url": "https://www.chronicle.co.zw/pamire-mwaruwari-throw-weight-behind-magwizi/",
            "content": "Lovemore[emailprotected]>\n\nFORMER Zifa president Vincent Pamire and Benjani Mwaruwari, who once captained the Warriors, have expressed their support for Nqobile Magwizi and his executive, wishing them success.\n\nMagwizi was thrust into the Zimbabwe football hot seat on Friday, ending a two-year leadership vacuum when he decisively beat his challengers, including Marshall Gore, Makwinji Soma-Phiri, and Twine Phiri.Pamire urged all football-loving Zimbabweans to rally behind Magwizi.\n\nVincent Pamire\n\nThe people have spoken; his victory was convincing and demonstrates that the Assembly, representing all corners, was impressed by his impressive resume. Therefore, he is the peoples favourite, and now all focus must turn to positive energy.\n\nLet us all embrace him and the presidium of Loveness Mukura and the tried and tested Kennedy Ndebele. They must hit the ground running and revitalise our football structures for the better. For any Zifa board to succeed, there must be unity of purpose across the nation.\n\nIt is an impressive line-up with people from the corporate sector; they will elevate our football and link us with industry. The time for bickering is over; 20 years have been lost to unnecessary ego clashes, said Pamire.\n\nThe former Zimbabwe Saints boss, who was head of Zifa when Zimbabwe qualified for the Afcon finals for the first time in 2003, stated it was time for those who had long held the belief that Zimbabwean football cannot thrive without them to step aside.\n\nThere are those who have been holding Zimbabwean football to ransom, creating the impression that if they are not involved, nothing will move. Please, give Nqobile (Magwizi) space to run Zifa the best way he deems. Stand aside and allow a new era in the game, said Pamire.\n\nMagwizi takes charge at a time when the nation is desperate to see international football return.Zimbabwe has been using stadia in Botswana, South Africa, Uganda, and Zambia for its club and Warriors assignments, as no stadium in the country meets Caf standards.\n\nMwaruwari, speaking over the phone from his base in England on Monday morning, congratulated Magwizi and his board.Hearty congratulations to Magwizi, Mukura, and Ndebele. Its refreshing to see new people take up association administration, and I have no doubt they will do well.\n\nBenjani Mwaruwari\n\nHowever, they need all our support, and we are prepared to offer assistance wherever possible. Our football has potential, and its time for unity and hard work from all of us, said Mwaruwari, who was also a presidential candidate.\n\nHe expressed no ill feelings, as Magwizi, being a Zimbabwean, shares the same ideals of wanting to elevate Zimbabwean football to the next level.The line-up of candidates was incredible, with very good CVs, and he won. Let us all rally behind him and get Zimbabwean football kicking, said Mwaruwari.\n\nMwaruwari also spoke about the Warriors chances in this years Afcon finals, which will be hosted by Morocco in December, finishing in January next year.\n\nHe challenged the Warriors to mature and qualify for the knockout stages of the Afcon finals.Morocco will host the event, which will feature the top 24 countries in Africa.\n\nThe Warriors qualified for the December finals after finishing second to Cameroon in Group J.Mwaruwari stated that the Warriors must rise to the challenge and defeat Egypt, the former champions.\n\nThe Warriors were drawn alongside Angola, Egypt, and South Africa.If we are to be counted among the best in Africa, we must fight to progress to the later stages of such competitions.\n\nI challenge the boys to beat Egypt, who are the favourites. Once we beat them, a draw or even outright wins will see us through to the next round, and then we will have arrived at the big stage. From there, it becomes anyones game, said the former Warriors captain.\n\nMwaruwari was part of the Warriors team, coached by Charles Mhlauri, that was knocked out in the first round in Egypt in 2006.\n\nNewly elected Zifa president Nqobile Magwizi and Warriors coach Michael Nees\n\nHe noted that there are 11 months until the finals, which provides ample time for preparation.We have up to a year to prepare. The coaches can cast their net wide, see teams involved in friendlies and other tournaments, then narrow down selections to the best candidates for Morocco, said Mwaruwari.\n\nHe also mentioned that he was impressed with the emerging young talent both at home and abroad.We have good talent coming up, and they need exposure to the national team level. Then the coach can choose those who fit into his football philosophy, said Mwaruwari, whose Plymouth Argyle reserves have reached the semi-finals of the FA Cup.There is the Cosafa Cup and World Cup qualifiers for the Warriors to gel before the Morocco tournament in December.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fxgxxx.jpg",
            "description": "Lovemore Dubelovemore.dube@chronicle.co.zw> FORMER Zifa president Vincent Pamire and Benjani Mwaruwari, who once captained the Warriors, have expressed their support for Nqobile Magwizi and his executive, wishing them success. Magwizi was thrust into the Zimbabwe football hot seat on Friday, ending a two-year leadership vacuum when he decisively beat his challengers, including Marshall Gore, Makwinji Soma-Phiri, […]",
            "time": "08:39",
            "date": "29 Jan 2025"
        }
    ]
}