{
    "news": [
        {
            "title": "Sheasham FC tournament Day 2 kicks off",
            "url": "https://www.chronicle.co.zw/sheasham-fc-tournament-day-2-kicks-off/",
            "content": "Patrick Chitumba,[emailprotected]\n\nIT is the second day of the Sheasham Football Club Social Soccer Tournament at Chaplin High School grounds where enthusiasts have gathered in numbers to enjoy some amateur football.\n\nThe tournament started with 36 teams taking part in the preliminary round yesterday and continues today.\n\nWinners from the preliminary round will qualify for the knockout stage with the final set for March 2.\n\nSheasham FC board chair Reginald Chidawanyika has expressed great satisfaction with the manner in which the tournament kicked off yesterday.\n\nWe are very happy with the support we got from the club and partners taking part in this tournament. Part of the intended goals for this initiative is taking the football club back to the community, he said.\n\nSheasham FC chief executive officer Clever Mandaza emphasized on the importance of social cohesion that is being brought about by this initiative.\n\nYesterday was a good day and today the tournament continues. I am happy with the huge turnout by soccer lovers, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tyhrs.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw IT is the second day of the Sheasham Football Club Social Soccer Tournament at Chaplin High School grounds where enthusiasts have gathered in numbers to enjoy some amateur football. The tournament started with 36 teams taking part in the preliminary round yesterday and continues today. Winners from the preliminary round will qualify […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Watch: President Mnangagwa returns from African Union Summit in Ethiopia",
            "url": "https://www.chronicle.co.zw/watch-president-mnangagwa-returns-from-african-union-summit-in-ethiopia/",
            "content": "Garikai Fadzi, Online Reporter\n\nSouthern African Development Community (SADC) chairperson, President Emmerson Mnangagwa, has returned home from Addis Ababa, Ethiopia, where he joined other African leaders for the 38th Ordinary Session of the African Union Summit.\n\nThis years summit was held under the theme, Justice for Africans and People of African Descent through Reparations.\n\nOn the sidelines of the summit, President Mnangagwa formally introduced SADC and COMESAs candidate for the African Development Bank (AfDB) presidency, Dr. Samuel Maimbo, a Zambian national.\n\nThe President also engaged in several bilateral meetings with other African heads of state during the summit.\n\nUpon his return, President Mnangagwa was welcomed by Vice Presidents Constantino Chiwenga and Kembo Mohadi, service chiefs, and senior government officials.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/u7jjh.jpg",
            "description": "Garikai Fadzi, Online Reporter Southern African Development Community (SADC) chairperson, President Emmerson Mnangagwa, has returned home from Addis Ababa, Ethiopia, where he joined other African leaders for the 38th Ordinary Session of the African Union Summit. This year’s summit was held under the theme, “Justice for Africans and People of African Descent through Reparations.” On […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Artisanal miner killed in Shurugwi after refusing to buy drinks for strangers",
            "url": "https://www.chronicle.co.zw/artisanal-miner-killed-in-shurugwi-after-refusing-to-buy-drinks-for-strangers/",
            "content": "Midlands BureauA 38-year-old suspected artisanal miner from Shurugwi lost his life after being stabbed with a Colombian knife by three strangers he had refused to buy drinks for.Midlands Provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the incident, which took place on Thursday at around 5 pm at Peak Mine Compound in Shurugwi.\n\nIt is alleged that the now deceased, Bright Miti, was walking from Bonza Mine in the company of a friend, Tapfuma Ncube (35), of Railway Block, Shurugwi, he said.\n\nAccording to Insp Mahoko, Miti and Ncube reportedly encountered three men who requested that they purchase drinks for them.He said when Miti and Ncube declined, a heated argument ensued.\n\nOne of the three strangers went on to stab Miti with a Colombian knife once behind his left knee, whilst Tapfuma managed to free himself and escaped.Miti was taken to Shurugwi Police Station, where a report was made, en route to Shurugwi District Hospital, where he was pronounced dead on arrival, he said.\n\nInsp Mahoko said the police are appealing to members of the public with information that might lead to the arrest of the three suspects to contact any police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2013/12/knife.jpg",
            "description": "Midlands Bureau A 38-year-old suspected artisanal miner from Shurugwi lost his life after being stabbed with a Colombian knife by three strangers he had refused to buy drinks for. Midlands Provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the incident, which took place on Thursday at around 5 pm at Peak Mine Compound in Shurugwi. “It […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Lock fails in final hurdle in India",
            "url": "https://www.chronicle.co.zw/lock-fails-in-final-hurdle-in-india/",
            "content": "Online Reporter\n\nZIMBABWE tennis star Courtney Lock and his Indian partner were beaten 6-4, 6-3 in the final of the Delhi Open in India on Saturday.\n\nThey lost to the Japanese duo of Mamichi Imamura and Rio Naguchi in the final.\n\nCourtney and Poonacha were playing together for the first time.\n\nThey to the last four in a three-set thriller 6-3, 2-6 and 10-5 after beating Japans Shintaro Mochizuki and Kaito Uesugi in the quarter-finals at the DLTA Complex, in Delhi on Thursday.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ugyt.jpg",
            "description": "Online Reporter ZIMBABWE tennis star Courtney Lock and his Indian partner were beaten 6-4, 6-3 in the final of the Delhi Open in India on Saturday. They lost to the Japanese duo of Mamichi Imamura and Rio Naguchi in the final. Courtney and Poonacha were playing together for the first time. They to the last […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Man kills wife after catching her with a secret lover",
            "url": "https://www.chronicle.co.zw/man-kills-wife-after-catching-her-with-a-secret-lover/",
            "content": "Sinokubonga Nkala,[emailprotected]\n\nA 34-year-old man has been arrested for allegedly murdering his wife in a fit of rage after catching her in the arms of another man.\n\nJustice Pondani allegedly unleashed a vicious attack on his wife, Grace Chareka, slamming her head against the wall after discovering her secret meeting with a boyfriend on 12 February 2025.\n\nIn an official statement, the police said Grace Chareka died on the spot.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/2303-1-1-MURDER-CHARGE-680x380.jpg",
            "description": "Sinokubonga Nkala, sinokubongankala@gmail.com A 34-year-old man has been arrested for allegedly murdering his wife in a fit of rage after catching her in the arms of another man. Justice Pondani allegedly unleashed a vicious attack on his wife, Grace Chareka, slamming her head against the wall after discovering her secret meeting with a boyfriend on […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Form four pupil axes father to death",
            "url": "https://www.chronicle.co.zw/form-four-pupil-axes-father-to-death/",
            "content": "Sinokubonga Nkala,[emailprotected]\n\nA Form Four student was apprehended for allegedly unleashing a fatal axe attack on his own father following a heated argument.\n\nA 47-year-old father met his untimely demise at the hands of his son on 13 February 2025, after a heated argument spiralled out of control.\n\nThe suspect had spent two days away from home without the victims knowledge of his whereabouts, said the police in a statement on X.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/11/axes.jpg",
            "description": "Sinokubonga Nkala, sinokubongankala@gmail.com A Form Four student was apprehended for allegedly unleashing a fatal axe attack on his own father following a heated argument. A 47-year-old father met his untimely demise at the hands of his son on 13 February 2025, after a heated argument spiralled out of control. “The suspect had spent two days […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Stampede-like situation at New Delhi railway station, 4 fire tenders rushed to spot",
            "url": "https://www.chronicle.co.zw/stampede-like-situation-at-new-delhi-railway-station-4-fire-tenders-rushed-to-spot/",
            "content": "A stampede-like situation occurred at New Delhi railway station on Saturday night, resulting in chaos on platforms 14 and 15. Authorities dispatched rescue teams and fire tenders, with three women hospitalized for treatment. Overcrowding due to train services for the Maha Kumbh in Prayagraj is being considered the primary cause.\n\nA stampede-like situation broke out at the New Delhi railway station late on Saturday evening, triggering a chaos on platform number 14 and 15, aDelhi Fire Services(DFS) official said. Sources said three women were rushed to a nearby hospital for treatment.\n\nThe incident occurred around 9:55 pm, prompting an emergency response.\n\nAuthorities immediately dispatched rescue teams and four fire tenders were rushed to the site to assist in the relief efforts, DFS chief Atul Garg said.\n\nThe exact cause of the stampede remains unclear, but initial reports suggest overcrowding due to train services for the Maha Kumbh in Prayagraj.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/gbtrasyh.jpg",
            "description": "A stampede-like situation occurred at New Delhi railway station on Saturday night, resulting in chaos on platforms 14 and 15. Authorities dispatched rescue teams and fire tenders, with three women hospitalized for treatment. Overcrowding due to train services for the Maha Kumbh in Prayagraj is being considered the primary cause. A stampede-like situation broke out […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Syrian asylum seeker was ‘laughing’ as he stabbed 14-year-old boy to death and knifed several others…",
            "url": "https://www.chronicle.co.zw/syrian-asylum-seeker-was-laughing-as-he-stabbed-14-year-old-boy-to-death-and-knifed-several-others/",
            "content": "A Syrian asylum seeker who viciously stabbed a 14-year-old boy to death and knifed several others was seen laughing as he went on a rampage through an Austrian city.\n\nThe 23-year-old man, named locally as Ahmad G., allegedly shouted Allahu Akbar before launching into a vicious attack just before 4pm on Saturday afternoon.\n\nSpine-chilling images captured the suspect was seen grinning at police officers while they surrounded him with weapons during his arrest in Villach, near the borders withItalyand Slovenia.\n\nThe assault, which is believed to have lasted less than 10 minutes, saw five other people wounded and two of these rushed to hospital with serious injuries.\n\nThe horror was only brought to a close when a food delivery driver, who is also from Syria, witnessed the attacks and bravely intervened.\n\nHeroic Alaaeddin Alhalabi, 42, aimed his car at the knifeman, hitting him with his vehicle in a desperate attempt to end the bloodshed before police closed in.\n\nAustrian authorities have said they are investigating whether the suspect was aided by an accomplice and whether there was an Islamist motive behind the attack, which came just days after an Afghan bodybuilder fatally ploughed into a crowd of people in Munich.\n\nPoliticians in Austria have condemned the violence, with right wing parties laying the blame on the countrys disastrous asylum policy, while billionaire Elon Musk blasted European leaders over immigration following the latest incident.\n\nA 23-year-old man stabbed 5 people in Austria, killing 1 in what police described as a random attack. Spine-chilling images of the arrest show a grinning man\n\nA food delivery driver, Alaaeddin Alhalabi, 42, also from Syria , witnessed the knife rampage today from his car, and stopped the attacker\n\nThe attack in Austria comes after Farhad N., 24, injured at least 30 people, including a two-year-old child, when he ploughed his Mini Cooper through a demonstration in Munich on Thursday\n\nThe man believed to be behind Saturdays attack, Ahmad G., is a Syrian national with legal residence in Austria, according to police. It is thought had been living in a centre for asylum seekers and was not known to authorities.\n\nA police spokesperson said it wasnt clear whether the suspect acted on his own, while amotive was not immediately known.\n\nThe spokesperson could also not confirm whether the incident was a terrorist attack, but said police were investigating the attackers personal background. We have to wait until we get secure information.\n\nWitnesses claimed that the suspect was heard shouting Allahu Akbar, according to local media.\n\nAn Islamist motive is being investigated, Austrian news outlet Kronen Zeitung reported.\n\nA food delivery driver,Alaaeddin Alhalabi, 42, also fromSyria, witnessed the stabbing from his car and bravely stopped the attacker from slashing more people.\n\nSpeaking to local press about the attack,Alhalabi said: I was just about to pick up an order in Lederergasse when I saw all the blood and two injured people lying on the ground.\n\nHe wanted to go towards the city centre, there were children on the street  I couldnt let that happen.\n\nPolice are seen after a knife attack near the main square in the city centre of Villach, southern Austria on February 15, 2025\n\nA motive for the attack was not immediately known, police said\n\nOfficers of the Austrian State Criminal Police are seen near a cordoned off area after a knife attack near the main square\n\nPolice speak from scene where grinning Syrian migrant killed boy\n\nThe attack took place in the Austrian city of Villach near the city centre\n\nIn the chaos of the situation, passers-by beat Alhalabis delivery car because they thought I was the bad guy!, he said.\n\nThe Austrian knife attack comes at a time of political upheaval in Austria as the far-right Freedom Party, which came first in Septembers parliamentary election, said on Wednesday it had failed to form a coalition government. The president is now considering whether an alternative to a snap election is available.\n\nRailing against illegal immigration and pledging to increase deportations to countries likeSyriaandAfghanistan, which it is currently illegal to deport people to, are central to the Freedom Partys platform and appeal, and the party quickly seized on the Villach attack.\n\nWe need a rigorous crackdown on asylum and cannot continue to import conditions like those in Villach, Freedom Party leader Herbert Kickl said in a statement.\n\nAccording to the Austrian Ministry of Interior, 24,941 foreigners applied for asylum in Austria in 2024. The largest group of applicants comes from Syria, followed by Afghanistan.\n\nOver the past two years, the number of asylum seekers has decreased significantly. In 2022, applications peaked at over 100,000, while approximately 59,000 individuals sought asylum in 2023.\n\nSeveral European countries, among them Austria, said in December they are suspending decisions on asylum claims by Syrian nationals because of the unclear political situation in their homeland following the fall of BasharAssad.\n\nPeter Kaiser, the governor of the Austrian province of Carinthia, spoke of Saturdays horrific attack in an X post this evening.\n\nThe unbelievable atrocity in Villach must have the harshest consequences! Anyone who lives in Carinthia, in Austria, must respect the law. Anyone who violates this must face the harshest consequences, he wrote.\n\nErwin Angerer, a lawmaker for the far-right Freedom Party, said his party had been warning about the situation in Austria as a result of the countrys disastrous asylum policy.\n\nAustrias Interior Minister Gerhard Karner was expected in Villach on Sunday morning.\n\nThe rampage comes just days after an Afghan refugee rammed a car into a crowd in Munich on Thursday and injured 39 people.On Saturday, police confirmed a woman and her two-year-old daughter had died from their injuries.\n\nFootage from the scene captured the moment the driver was arrested, as cops swarmed the vehicle and pinned him to the ground.\n\nElon Musk has blasted European immigration policies after the continent was hit with a second deadly attack by an asylum seeker this week\n\nMusk made his stance on migration in Europe known after he re-shared a post from Dutch right-wing political commentator Eva Vlaardingerbroek on social platform X\n\nIn a separate post, Musk retweeted an image of the grinning suspect and captioned it Terrible\n\nMusk also retweeted a post from AfD leader Alice Weibel\n\nHorror videos circulating online also saw several wounded victims lying in the streets being treated for injuries after the white car crashed through the crowd.\n\nOn social media, one witness, a German journalist, said the incident left people crying and shaking on the ground.\n\nA person was lying on the street and a young man was taken away by the police, Sandra Demmelhuber said.\n\nPeople were sitting on the ground, crying and shaking. Details still unclear, the reporter added.\n\nOn Saturday, police confirmed a 37-year-old mother and her two-year-old daughter died from their injuries.\n\nAuthorities have said they are treating the incident as a religiously motivated attack.\n\nThe suspect has been named asFarhad N., a 24-year-old Afghan asylum seeker.\n\nGabriele Tilmann, the senior public prosecutor, said that Farhad N. had confessed during an interrogation to deliberately driving into the demonstration.\n\nGerman Chancellor at site of Afghan asylum seeker car ramming attack\n\nElon Muskon Saturday blastedEuropean immigration policies after the continent was hit with its second deadly attack by an asylum seeker this week.\n\nWithin hours of the rampage, theTeslafounder and billionaire made his stance on migration in Europe known after he re-shared a post fromDutchright-wing political commentatorEva Vlaardingerbroek on social platform X.\n\nIt happened again. This Syrian migrant stabbed a 14 y/o Austrian boy to death and injured 5 others today in Villach, Austria,Vlaardingerbroeks tweet said.\n\nHe proudly smiles after the fact. I wasnt exaggerating when I said this happens daily in Europe: A one-sided civil war is waged on us Europeans, she added.\n\nIn a separate post, Musk retweeted an image of the grinning suspect and captioned it Terrible.\n\nSeparately on Saturday, Musk also backed far-right Alternative forGermanyparty, also known as AfD, after he retweeted a post from the political groups leader Alice Weidel.\n\nUS Vice President @JDVance calls for an end to the firewall! The Trump administration has also recognized that a migration turnaround can only be achieved with the AfD. Merz must now show whether he really wants an end to the deadly migration crisis. Therefore AfD!, Weidel tweeted.\n\nSharing her post, Musk commented: AfD!.\n\nWeidels remarks, which were reiterated by Musk, referred to US Vice PresidentJD Vance, who spoke at the Munich Security Conference on Friday.\n\nIn the lengthy anti-immigration speech, Vance attacked European leaders for their approach to migration.\n\nNo voter on this continent went to the ballot box to open the floodgates to millions of unvetted immigrants, he said.\n\nTurning to the UK, he added: You know what they did vote for in England? They voted forBrexitand, agree or disagree, they voted for it.\n\nThe knife attack comes just days after a 39 people were injured in Munich when a car rammed into a crowd of protestors\n\nObjects lying on the street at the scene in Munich, including a baby carriage\n\nAccording to Munich police, at least 39 people were injured when a car drove into a crowd of demonstrators during a rally by the Verdi trade union in Munichs city center on 13 February\n\nMany tributes left after Munich car attack kills mother and toddler\n\nAnd more and more all over Europe, theyre voting for political leaders who promised to put an end to out-of-control migration.\n\nNow, I happen to agree with a lot of these concerns, but you dont have to agree with me.\n\nThis is not the first time that Musk has expressed his feelings towards Europes migration policies.\n\nBack in December, he infuriated Germany by claiming that the far-right AfD party is the only party that can save the country.\n\nThere have also been concerns in Britain that Musk is taking a close interest in the countrys political scene, appearing to cosy up to ReformsNigel Farage.\n\nMusk is reported to be considering a donation of as much as $100million (80million) to help build up Reform into a political machine capable of overthrowingLabourat ageneral election.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fdethgfbh.jpg",
            "description": "A Syrian asylum seeker who viciously stabbed a 14-year-old boy to death and knifed several others was seen ‘laughing’ as he went on a rampage through an Austrian city. The 23-year-old man, named locally as Ahmad G., allegedly shouted ‘Allahu Akbar’ before launching into a vicious attack just before 4pm on Saturday afternoon. Spine-chilling images […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "SA family reunited with boy who vanished in Zimbabwe",
            "url": "https://www.chronicle.co.zw/sa-family-reunited-with-boy-who-vanished-in-zimbabwe/",
            "content": "An 11-year-old South African boy who vanished from his home in May 2023 and took a bus to Zimbabwe has been reunited with his family.\n\nThe Department of Social Development said the child was brought back to South Africa from Zimbabwe after being separated from his family for almost two years.\n\nAccording to the department, the boy provided various justifications for his arrival in Zimbabwe, which complicated the countrywide search for him.\n\nThis set off a complex cross-border child protection case, with his disappearance becoming a matter of national concern, prompting the department to work alongside its Zimbabwean counterparts to locate and return him home.\n\nWhile in Zimbabwe, he was diagnosed with autism. However, further assessments will be conducted to determine the full extent of his health condition.\n\nHis condition may explain why he wandered off and why repatriation efforts faced such obstacles, a social worker from the department said.\n\nAccording to the social workers report, he consistently eluded law enforcement, leading to multiple failed attempts at repatriation.\n\nHe was recently taken to the border at Beitbridge after being discovered on the streets of Harare.\n\nThe boy made the trip to Johannesburg the next day, where he was reunited with his family, escorted by his mother, maternal aunt, and a Gauteng social worker.\n\nHe started crying when he saw me and was saying a lot that I couldnt understand because it was in Shona; hes lost his Zulu [mother tongue] and now speaks Shona fluently, the boys 33-year-old mother said.\n\nThe mother described him as an independent child who often wandered off.\n\nWhen he started primary school, his disappearances became more frequent, sometimes leading to police involvement or kind strangers returning him home.\n\nWe thought he was just a seriously naughty child, and we would punish him and ground him from playing outside, said the mother.\n\nWhen asked about this behaviour, she admitted that it had been a confusing and painful journey.\n\nIt will empower me. I will know what medication he needs and what school I need to send him to. I also want to get him a tracking bracelet, the mother said.\n\nSeated on the concrete veranda of his home in Alexandra, Gauteng, the small-framed, shy-looking boy plays quietly with his cousin and a two-year-old brother he has just met for the first time.\n\nOne of the departments officials who accompanied the boys mother to Limpopo, Lamlani Mthembele, said the moment of reunion was deeply emotional.\n\nWhen they saw each other, he cried, his mom was crying, and even though we couldnt understand what he was saying in Shona, it felt like he was saying he was happy to be back home and that he would never leave his mothers side again, said Mthembele.\n\nAdditionally, the department has committed to getting social workers from the Gauteng region to support the boys mother in securing medical assessments and the necessary interventions for his well-being.\n\nThe department has assured ongoing psychosocial support for the boy and his family to ensure his smooth reintegration and emotional healing.\n\nSource: Sunday world\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/nhjin.jpg",
            "description": "An 11-year-old South African boy who vanished from his home in May 2023 and took a bus to Zimbabwe has been reunited with his family. The Department of Social Development said the child was brought back to South Africa from Zimbabwe after being separated from his family for almost two years. According to the department, […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Highlanders striker off to the States",
            "url": "https://www.chronicle.co.zw/highlanders-striker-off-to-the-states-2/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS junior striker Mayibongwe Ndlovu has earned a college placement at Coker University in South Carolina.\n\nNdlovu (20) is the first player from the tryouts held in Zimbabwe and Zambia last year to secure this life-changing opportunity.\n\nNdlovu is a product of Mpopoma High School where he has also served as a deputy headboy.\n\nThe forward could not hide his excitement following the confirmation of the move.\n\nIt still feels as if I am dreaming, as if someone is going to say wake up. My happiness is on another level and I cannot even find words that can describe how happy I am. At the same time Im grateful for the opportunity which l hope to utilise fully, said Ndlovu.\n\nNdlovu was selected to be part of the 2020 African Union Sports Council Region 5 Youth Games Zimbabwe team, but unfortunately, the Covid-19 pandemic put a halt to all sporting activities. Despite this setback, Ndlovus determination never wavered.\n\nHe was part of the Mpopoma High School team where his talent did not go unnoticed, and he was given the opportunity to travel with the Bosso90 team to the GM Festival in Botswana in 2022.\n\nNdlovu also had a productive loan stint with Bulawayo City, where he worked under legendary coaches such as Alibaba Dube, Innocent Mapuranga, and the late Barry Daka.\n\nMeanwhile, Highlanders will today play host to a Family Fun Day at the Highlanders Sports Club.\n\nThe event will include various activities for children and a legends match, where former players will face the present Bosso team.\n\nThe day promises a family-friendly atmosphere, with gates opening at 10:00 am. Vendors are invited to sell their products, with prior registration required.\n\nEntry fees are pegged at US$3 for adults and US$1 for children. The Family Fun Day is expected to draw fans, families and vendors, creating a vibrant and welcoming environment at the Highlanders Sports Club.\n\n-Ends///\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-1-Recovered-Recovered.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS junior striker Mayibongwe Ndlovu has earned a college placement at Coker University in South Carolina. Ndlovu (20) is the first player from the tryouts held in Zimbabwe and Zambia last year to secure this life-changing opportunity. Ndlovu is a product of Mpopoma High School where he has also served as a […]",
            "time": "21:26",
            "date": "16 Feb 2025"
        }
    ]
}