{
    "news": [
        {
            "title": "Veteran reggae singer Cocoa Tea dies",
            "url": "https://www.chronicle.co.zw/veteran-reggae-singer-cocoa-tea-dies/",
            "content": "Reggae legend Colvin Cocoa Tea Scott has died. His wife, Malvia Scott, confirmed to The Gleaner that the veteran singer passed away at a hospital in Broward, Ft Lauderdale, Florida, following a cardiac arrest this morning. He was 65.I got a call early this morning to say that he had been transferred from the facility to the hospital . . . which is like five minutes away . . . because he was vomiting. He was initially diagnosed with lymphoma in 2019, but for the last six months he was also struggling with pneumonia, Malvia told The Gleaner.\n\nFollowing the diagnosis six years ago, the Nah Give Up singer kept a positive outlook, even to the very end.He was definitely very brave, shared Malvia, who is the mother of three of Cocoa Teas children. He was positive throughout it all. About three weeks ago, when he was admitted to the hospital, he asked if I was worried and I said I am always worried. He told me not to worry because everything was going to be all right. He was always very hopeful.\n\nJamaica Minister of Culture, Gender, Entertainment and Sport, Olivia Grange, told The Gleaner that she was very saddened by the passing of Sweet Sweet Coco Tea.He has been a staple in the industry for so long. He is one of the greatest reggae singers who has ever lived and his work will stand the test of time. We salute him at this time  condolences to his family. It has been a pleasure working with him over these years and we are glad that we had the opportunity to give him some of flowers while he was here with us. May his soul rest in peace, Minister Grange stated.\n\nKnown for his sweet, melodic voice, as well as his powerful chanting, Cocoa Teas last performance was three years ago on the Welcome to Jamrock Cruise. In 2019, the I am the Toughest singer performed at Buju Bantons historic Long Walk to Freedom concert at the National Stadium in Kingston.\n\nBorn in Rocky Point, in Clarendon on September 3, 1959, Cocoa Tea started making his name in Jamaica from 1985 with hits such I Lost my Sonia, and Sweet Sweet Cocoa Tea.\n\nHe became successful worldwide since the 1990s and expanded his fan base, thrilling with songs such as Israels King, Weh Dem A Go DoCant Stop Cocoa Tea, Holy Mount Zion, Rocking Dolly. His Wikipedia bio states that one of his most famous songs, Rikers Island, was later turned into a dancehall version by Nardo Ranks titled Me No Like Rikers Island (featured on the 1991 Columbia/SME Records compilation Dancehall Reggaespaol).In 2003, Coco Tea started the annual New Years Eve event Dancehall Jam Jam. It ran until 2009, with plans to resurrect it in 2015.\n\nAfter recording for many of the top reggae labels including VP Records, Greensleeves Records and Ras Records, he started his own Roaring Lion label around 2000.\n\nIn March 2008, the name Cocoa Tea was on the lips of many people after he released a song titled Barack Obama, in support of the then US presidential candidate, who subsequently won the elections.\n\nCoco Tea is survived by his wife, Malvia, and eight children.  Gleaner\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Untitled-1-4.jpg",
            "description": "Reggae legend Colvin ‘Cocoa Tea’ Scott has died. His wife, Malvia Scott, confirmed to The Gleaner that the veteran singer passed away at a hospital in Broward, Ft Lauderdale, Florida, following a cardiac arrest this morning. He was 65. “I got a call early this morning to say that he had been transferred from the […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Relief for Bosso as Fifa lifts transfer ban",
            "url": "https://www.chronicle.co.zw/relief-for-bosso-as-fifa-lifts-transfer-ban/",
            "content": "Innocent Kurira,[emailprotected]\n\nHIGHLANDERS has announced that Fifa has lifted their transfer ban, meaning the club can now register new players for the season.\n\nThe club shared the news via a statement on Tuesday evening.\n\nWe are delighted to announce that the FIFA ban has been lifted, thanks to the efforts of a dedicated FIFA team as everything has been resolved. Once again, a special thank you to Sir Wicknell Chivayo for facilitating the payment. With this hurdle cleared, we can now register our new signings. They could be part of our squad for the upcoming match against Green Fuel, read the statement.\n\nThe ban resulted from money owed to former coaches Baltemar Brito and Antonio Torres, which was paid by businessman Wicknell Chivayo.\n\nCoach Kelvin Kaindu has already identified potential reinforcements, including defender Malvern Hativagoni, striker Never Rauzhi, winger Tendai Muvuti, and midfielders Hubert Ncube and Mafious Chiweta.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/Untitled-17-1.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw HIGHLANDERS has announced that Fifa has lifted their transfer ban, meaning the club can now register new players for the season. The club shared the news via a statement on Tuesday evening. “We are delighted to announce that the FIFA ban has been lifted, thanks to the efforts of a dedicated FIFA […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Residents nab suspected conman in Entumbane job scam",
            "url": "https://www.chronicle.co.zw/residents-nab-suspected-conman-in-entumbane-job-scam/",
            "content": "Online Reporter\n\nRESIDENTS of Entumbane in the Zothile area of Bulawayo have apprehended a man believed to be part of a group that has been targeting the suburb with a fake job scheme, leading to the theft of phones and money from unsuspecting victims.\n\nThe suspect was caught after two of his accomplices fled the scene, abandoning their vehicle, which had reportedly run out of fuel. The trio had been moving around the area, offering jobs to residents, only to rob them of their belongings.\n\nAccording to reports, the group had successfully employed several individuals before their scheme was uncovered. A number of residents have since come forward, reporting losses of phones and cash to the scam.\n\nThe arrest was made by vigilant locals who grew suspicious of the suspects activities. The vehicle left behind by the fleeing accomplices has been impounded as part of the ongoing investigation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Entumbane-scammer-680x380.jpg",
            "description": "Online Reporter RESIDENTS of Entumbane in the Zothile area of Bulawayo have apprehended a man believed to be part of a group that has been targeting the suburb with a fake job scheme, leading to the theft of phones and money from unsuspecting victims. The suspect was caught after two of his accomplices fled the […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Another Zimbabwean explosives smuggler arrested at South Africa border",
            "url": "https://www.chronicle.co.zw/another-zimbabwean-explosives-smuggler-arrested-at-south-africa-border/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nSouth African border authorities have arrested another immigrant (48) for smuggling from Zimbabwe, a contraband of explosives worth at least R600, 000 through the Beitbridge Port of Entry (PoE) on Monday.\n\nThe nationality of the suspect is yet to be revealed.\n\nThe Beitbridge border post provides a link to South Africa by road to Malawi, Tanzania, Zambia, Mozambique, DRC, Angola, Botswana and Zimbabwe.\n\nIn a statement, the specialised police, the Hawks, said the man was stopped by the police while driving a horse and trailers truck that was travelling from Zimbabwe to South Africa at the PoE weigh bridge.\n\nThey asked a driver to open a trailer so that the search can be conducted. The driver informed the police that he did not have keys for the trailers. Police forcibly opened the trailer. The search was conducted and they found bags containing items suspected to be explosives, said the Hawks.\n\nPolice then summoned the Musina based Bomb Technicians, Hawks Serious Organised Crime Investigation and Local Criminal Record Central to the scene for assistance. Upon the arrival of the above-mentioned units, the truck was thoroughly searched.\n\nAs a result, the team found 16 reels of detonating fuse explosives and 2182 Superpower 90 blasting cartridge explosives. The suspect was arrested. He is expected to make his first court appearance in the Musina Magistrate soon.\n\nLast Thursday, the Hawks arrested a 55-year-old Zimbabwean truck driver with a contraband of drugs worth an estimated R7 million, which he was transporting through the same border.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-11-at-17.18.07.jpeg",
            "description": "Thupeyo Muleya, Beitbridge Bureau South African border authorities have arrested another immigrant (48) for smuggling from Zimbabwe, a contraband of explosives worth at least R600, 000 through the Beitbridge Port of Entry (PoE) on Monday. The nationality of the suspect is yet to be revealed. The Beitbridge border post provides a link to South Africa […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Victoria Falls gears up for Ramsar COP15 with stakeholder awareness meetings",
            "url": "https://www.chronicle.co.zw/victoria-falls-gears-up-for-ramsar-cop15-with-stakeholder-awareness-meetings/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nTHE City of Victoria Falls is today hosting a series of awareness meetings with stakeholders in preparation for the upcoming Ramsar COP15, scheduled to take place from 23 to 31 July 2025.\n\nThe resort city recently received Wetland City Accreditation from the Conference of Contracting Parties (COP), further cementing its status as a key player in global wetland conservation efforts.\n\nThe Ramsar Convention, an international treaty adopted in 1971, promotes the conservation and sustainable use of wetlands. With over 170 contracting parties, the convention underscores the critical role of wetlands in supporting biodiversity, human livelihoods, and ecosystem sustainability.\n\nIn a public notice, Victoria Falls Town Clerk, Mr Ronnie Dube, announced a series of stakeholder engagement meetings.\n\nThe awareness meetings will ensure that all stakeholders are well-informed and engaged in preserving the citys natural heritage ahead of this prestigious event.\n\nThe City of Victoria Falls is pleased to announce that the City recently received Wetland City Accreditation from the Conference of Contracting Parties (COP). This comes as the City will host the Ramsar COP15 from 23 to 31 July 2025.\n\nIn that regard, the City has lined up awareness meetings with its stakeholders and therefore invites everyone, including residents, the business community, cooperating partners, groups, associations, and others, to all-stakeholders meetings to raise awareness about Wetland City Accreditation and the upcoming COP15.\n\nThe proposed agenda include overview of RAMSAR Convention, Wetland City Accreditation, importance of wetland conservation, Collaborative initiatives and stakeholder roles and benefits to the public.\n\nAs a UNESCO World Heritage Site and a Ramsar-listed wetland of international importance, Victoria Falls is an ideal location for COP15. Its selection highlights Zimbabwes commitment to balancing environmental conservation and sustainable tourism.\n\nVictoria Falls\n\nThe conference is expected to attract environmentalists, policymakers, scientists, and international delegates, all coming together to discuss wetland conservation strategies in the face of climate change and human impact.\n\nZimbabwes selection as the host country for COP15 signifies its growing role as a leader in wetland conservation.\n\nThe country is home to seven Ramsar-designated wetlands, including Victoria Falls, Driefontein Grasslands, and Lake Chivero, which are internationally recognised for their ecological significance.\n\nThese wetlands play a crucial role in biodiversity conservation, water purification, and climate change mitigation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/rsgr.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw THE City of Victoria Falls is today hosting a series of awareness meetings with stakeholders in preparation for the upcoming Ramsar COP15, scheduled to take place from 23 to 31 July 2025. The resort city recently received Wetland City Accreditation from the Conference of Contracting Parties (COP), further cementing its status as […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "“She Will Not Fail”: Upcoming event aims to uplift young women",
            "url": "https://www.chronicle.co.zw/she-will-not-fail-upcoming-event-aims-to-uplift-young-women/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nMARCH belongs to women and is known as the Womens History Month a time to celebrate feminine excellence and in tandem with that, a young Harare-based woman, Uratile Nare, is making waves in her community through her spiritual leadership and community development initiatives.\n\nBorn and raised in Bulawayo, Nare is the founder of, Rooted in Grace, a spirit-led Christian community that aims to empower young women to become spiritual leaders and change their communities.\n\nUratile is set to host the Bibles and Picnic event, slated for May 10 in Bulawayo, which will be a follow-up from the A table of Grace event in Harare on 12 April.\n\nUratile Nare (second from right) with other members of the Rooted in Grace Christian Community\n\nIn an interview with Chronicle Showbiz, Uratile narrated how eager she is to be a vehicle of civic change.\n\nIm a young lady with a big dream. Over the years, Ive always gone above and beyond to make an impact in my community.\n\nIm on an assignment to empower many women, and with Gods grace, and Im confident that Ill not fail in all I do, she said.\n\nNares latest initiative aims to bring together young women to fellowship, pray, and support one another.\n\nMany young people are trying to figure out life, some are confused, some are broken, and some need guidance. Hence the theme of this event is, She will not fail. So, were gathering with a purpose to make young women rise, she explained.\n\nAs Rooted in Grace celebrates its first anniversary, Uratile reflected on the challenges and triumphs she has faced.Oh, not many challenges, she said with a smile.\n\nVery few challenges actually. God has my back! We are growing, we are conquering.\n\nOne of the highlights of the past year was a successful pad drive, where the organisation donated over 500 sanitary pads to Chikurubi Maximum Prison.\n\nUratiles connection to Bulawayo is deep, and she is excited to take her events to the city.\n\nBulawayo is home. Bulawayo is where the heart is. Ill always come back to where it all started. My roots, she said.\n\nAs a spiritually-filled woman, Uratile believes that putting God first is key to success in all areas of life.\n\nAll I can say is, In life, put God first and you will flourish in all aspects. Your career, your marriage, your education, your children. If there is a God in-between everything, nothing will come to fail.\n\nHer message to fellow young women is one of empowerment and encouragement.\n\nI encourage every woman to serve the Lord in some kind of way. Love God first and everything in your life will be blessed.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/hjabka.jpg",
            "description": "Mbulelo Mpofu,mbulelo.smpofu@gmail.com MARCH belongs to women and is known as the “Women’s History Month” a time to celebrate feminine excellence and in tandem with that, a young Harare-based woman, Uratile Nare, is making waves in her community through her spiritual leadership and community development initiatives. Born and raised in Bulawayo, Nare is the founder of, […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Counterfeit goods under the spotlight",
            "url": "https://www.chronicle.co.zw/counterfeit-goods-under-the-spotlight/",
            "content": "Senior Business Writer\n\nStrengthening customs regulations, policy frameworks, law enforcement and addressing the proliferation of counterfeit products will take center stage at an upcoming National Economic Consultative Forum (NECF) indaba in Harare on Wednesday.\n\nBringing together government ministers, industry leaders, and civil society representatives, the event will revolve around the theme: Combating Counterfeit Products in Zimbabwe and Fostering Economic Growth.\n\nThis forum follows the governments intensified countrywide crackdown on counterfeit and smuggled goods, resulting in the seizure of over US$2.4 million worth of illegal imports and substandard products.\n\nAs part of this initiative, the Zimbabwe Revenue Authority (ZIMRA) on Monday closed Unity Village Flea Market in Bulawayo, a significant trading hub known for selling various goods.\n\nThis bustling market, located in the city center, features numerous traders offering clothing, footwear, cell phones, accessories, and kitchenware, among other items.\n\nAccording to the draft programme, Minister of Industry and Commerce Nqobizitha Mangaliso Ndlovu is set to deliver the keynote address.\n\nSeveral Government ministers expected to participate, include Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube, Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi, Minister of Home Affairs and Cultural Heritage Kazembe Kazembe, and Minister Douglas Mombeshora, Health and Child Care.Women Affairs, Community, Small and Medium Enterprise Development Minister Monica Mutsvangwa and Local Government and Public Works Minister Daniel Garwe\n\nThe business sector will also be well-represented, with key industry leaders expected to attend, including Confederation of Zimbabwe Industries (CZI) President, Mr Mucha Mkanganwe ,Zimbabwe Revenue Authority (ZIMRA) Commissioner General, Ms Regina Chinamasa, Confederation of Zimbabwe Retailers President, Mr. Denford Mutashu, Delta Corporation CEO, Mr. Matlhogonolo Valela, new OK Zimbabwe CEO, Mr Willard Zireva and Small Enterprises Association of Zimbabwe CEO, Mr Farai Mutambanengwe.\n\nThe NECF indaba provides an opportunity for stakeholders to address the serious threats posed by counterfeit products to economic growth, consumer safety, and fair trade.\n\nThe event is anticipated to yield policy recommendations, enforcement strategies, and enhanced partnerships among government, the private sector, and civil society in combating counterfeits.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WTHNHNH.jpg",
            "description": "Senior Business Writer Strengthening customs regulations, policy frameworks, law enforcement and addressing the proliferation of counterfeit products will take center stage at an upcoming National Economic Consultative Forum (NECF) indaba in Harare on Wednesday. Bringing together government ministers, industry leaders, and civil society representatives, the event will revolve around the theme: “Combating Counterfeit Products in […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "21-year-old missing in Bulawayo",
            "url": "https://www.chronicle.co.zw/21-year-old-missing-in-bulawayo/",
            "content": "Sidumisile Mabena,[emailprotected]\n\nA search is underway for a 21-year-old man, Anodiwa Yope Marenguka, who has gone missing in the Nkulumane suburb of Bulawayo. Marenguka was last seen on 6 January 2025 when he went to bed, and the following day, he was nowhere to be found.\n\nAccording to a press statement from the Zimbabwe Republic Police (ZRP), Marenguka is approximately 1.61 metres tall, with a slim build and a light complexion. The police are appealing to the public for any information that could aid in locating him.\n\nAnyone with information is urged to contact ZRP Nkulumane at 0292481145 or visit their nearest police station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ano.jpg",
            "description": "Sidumisile Mabena, sidumisile77mabena@gmail.com A search is underway for a 21-year-old man, Anodiwa Yope Marenguka, who has gone missing in the Nkulumane suburb of Bulawayo. Marenguka was last seen on 6 January 2025 when he went to bed, and the following day, he was nowhere to be found. According to a press statement from the Zimbabwe […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Prince Dube honoured in Tanzania",
            "url": "https://www.chronicle.co.zw/prince-dube-honoured-in-tanzania/",
            "content": "Online Reporter\n\nWARRIORS striker Prince Dube received his first major award at Young Africans SC after being named the clubs Player of the Month for February.\n\nDube netted 11 goals and became the top scorer in the Tanzanian Premier League during the month.\n\nThis is Dubes first major recognition since moving to Young Africans at the start of the season.\n\nThe Warriors International joined the Tanzanian giants after leaving Azam.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/o0990.jpg",
            "description": "Online Reporter WARRIORS striker Prince Dube received his first major award at Young Africans SC after being named the club’s Player of the Month for February. Dube netted 11 goals and became the top scorer in the Tanzanian Premier League during the month. This is Dube’s first major recognition since moving to Young Africans at […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        },
        {
            "title": "Zifa wants to hire coaching and technical staff for junior teams",
            "url": "https://www.chronicle.co.zw/zifa-wants-to-hire-coaching-and-technical-staff-for-junior-teams/",
            "content": "Online Reporter\n\nZIFA on Tuesday announced that it is seeking to hire passionate, experienced, and dedicated individuals to fill key coaching and technical staff positions for the countrys youth football teams.\n\nThe association said it wants to hire both head and assistant coaches for Under 15, 17 and 20 ages groups.\n\nThe seeked coaches will take charge of both genders.\n\nGoalkeeping coaches, fitness and conditioning coaches, physiotherapists, team doctors, and analysts are also being sought.\n\nThose willing to assume the positions of head coaches should be holders of CAF A or CAF B coaching certificates while assistant coaches should have CAF B or CAF C coaching badges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/ZIFA-2.jpg",
            "description": "Online Reporter ZIFA on Tuesday announced that it is seeking to hire passionate, experienced, and dedicated individuals to fill key coaching and technical staff positions for the country’s youth football teams. The association said it wants to hire both head and assistant coaches for Under 15, 17 and 20 ages groups. The seeked coaches will […]",
            "time": "21:46",
            "date": "11 Mar 2025"
        }
    ]
}