{
    "news": [
        {
            "title": "Africa mourns Nujoma. . .Africa must deepen unity, honor legacy of  Dr Nujoma- President",
            "url": "https://www.chronicle.co.zw/africa-mourns-nujoma-africa-must-deepen-unity-honor-legacy-of-dr-nujoma-president/",
            "content": "NDUDUZO TSHUMA in Windhoek, Namibia\n\nSADC Chairperson, President Mnangagwa, yesterday stated that African nations, in honour of the legacy bequeathed by their founding fathers, have a responsibility to deepen collaboration and synergies for a brighter and more prosperous future, especially for young people.\n\nSpeaking at a memorial service for Namibias founding father and liberation icon, Dr Sam Nujoma, at the Independence Stadium, President Mnangagwa said the liberation icon understood that true liberation extends beyond mere political independence to encompass social equity and sustainable development.\n\nDr Nujoma, who led Namibia from independence in 1990 to 2005, passed away at the age of 95 in a Windhoek hospital on February 8, 2025.\n\nSpeaker after speaker praised Dr Nujoma for his fearless fight to dismantle colonialism, not only in his own country but in other African nations as well.\n\nSam Nujoma\n\nPresident Mnangagwa said that throughout his tenure, Dr Nujoma championed policies that promoted social justice, economic development, and regional co-operation.\n\nAs we reflect on his legacy and continue our pursuit to realise the SADC Vision 2050 and the AU Agenda 2063, let us be emboldened by his words of recollection, and I quote, When the founding fathers were calling for African unity, they were calling for economic emancipation, cooperation, and integration of the entire African continent.\n\nThey fully understood that political freedom would remain insufficient and meaningless unless it was accompanied by genuine economic independence.\n\nWe must continue to work together as nations within SADC and the larger African continent to uphold the values he and many others fought hard to entrench in the psyche of our peoples, said the President.In mourning Dr Nujoma, President Mnangagwa said Africa must transform its sorrow into purposeful action.\n\nThe late Dr Nujomas vision must live on through our collective efforts towards sustainable peace and prosperity in Southern Africa, the African continent as a whole and the Global South.\n\nIn honour of the legacy bequeathed to us by our founding fathers, including the late Cde Nujoma, we all have the responsibility to deepen collaboration and synergies among Member States for a brighter and more prosperous future, especially for our young people.\n\nI exhort us, therefore, to continue the fight for justice, equality, and a peaceful region. This is the fight that our late African icon and founding father, Dr Sam Nujoma, so passionately led throughout his lifea life well lived in service of his people and all of us, said President Mnangagwa.\n\nPresident Mnangagwa addresses mourners in Namibia yesterday\n\nDescribing the death of Dr Nujoma as a huge loss to Africa and beyond, President Mnangagwa said the liberation icons selfless efforts and unwavering commitment to justice, equality, and freedom for his people and all of humanity would remain etched in our collective memory for posterity.\n\nIn the late Dr Nujoma, we had more than just a political figure, he was a larger-than-life revolutionary icon and a shining beacon of hope for the peoples of Africa. His astute, exemplary, and consistent leadership during our struggles for independence laid critical building blocks for the democratic culture that not only Namibia but the whole of SADC cherishes so dearly to this day.\n\nAs the leader of SWAPO, he inspired countless individuals to rise against colonial oppression and to fight for their birth right, freedom, independence, and dignity. His vision for a truly independent and liberated African people transcended borders, uniting people from across Southern Africa, said the President\n\nAfrican Union Chairperson and Angolan President Joo Loureno said that the works of Dr Nujoma would be recorded in the annals of history and serve as a beacon for future generations.\n\nNamibias President and chief mourner, Dr Nangolo Mbumba, noted that while the month of February is associated with purity and love, Namibia had endured the pain of losing its third President, Hage Geingob, last year and Dr Nujoma this year.\n\nHis indomitable revolutionary spirit will always be with us. We do not bid him farewell, but we mourn and celebrate his life, history, and achievements, he said.\n\nNamibias Vice President and President-elect, Dr Netumbo Nandi-Ndaitwah, emphasised the importance of staying true to the ideals of Namibias liberation, a cause to which Dr Nujoma dedicated his life.\n\nDr Nujomas successor and Namibias second President, Dr Hifikepunye Pohamba, said he was privileged to have worked closely with the liberation icon for 63 years, both in exile and after independence.\n\nDr Nujoma held the people together, and indeed history was achieved, Namibia was free, he said.The late Dr Sam Nujomas eldest child, Unoti Nujoma, who is Namibias Minister of Labour, Industrial Relations and Employment Creation, described his fathers legacy as one of unity, not just within Namibia but across the African continent.\n\nNamibian Member of Parliament and leader of the Official Opposition McHenry Venaani praised Dr Nujomas unparalleled leadership, describing him as not just a leader but a master tactician in the field.\n\nThe memorial service was attended by former Mozambican President Joaquim Chissano, former DRC President Joseph Kabila, former first lady Grace Mugabe and dignitaries from various countries, including Cuba, the Netherlands and the European Union among others.The late Dr Nujomas body lay in state at the Independence Stadium ahead of his burial at Namibias National Heroes Acre today.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-3-7-680x380.jpg",
            "description": "NDUDUZO TSHUMA in Windhoek, Namibia SADC Chairperson, President Mnangagwa, yesterday stated that African nations, in honour of the legacy bequeathed by their founding fathers, have a responsibility to deepen collaboration and synergies for a brighter and more prosperous future, especially for young people. Speaking at a memorial service for Namibia’s founding father and liberation icon, […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "Media must not agitate for illegal regime change- Minister Muswere",
            "url": "https://www.chronicle.co.zw/media-must-not-agitate-for-illegal-regime-change-minister-muswere/",
            "content": "Harare Bureau\n\nADVOCATING for the overthrow of a democratically elected Government falls outside the bounds of media freedom, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday.\n\nSpeaking at the third-anniversary celebration of 3K Television at their Harare offices, Dr Muswere underscored the importance of comprehending the constitutional framework governing media operations as the nation progresses towards Vision 2030.Section 61 of the Constitution guarantees freedom of expression and the media, and Section 62 pertains to access to information, yet neither confers the right to agitate for the overthrow of the lawful Government.\n\nWe should also be unequivocally clear regarding the supreme law of the country; the right to broadcast the overthrow of a legitimate and democratic Government does not exist within our Constitution. The media freedom and freedom of expression we enjoy should be guarded jealously, and we should consistently protect our journalists, he said.\n\nDr Muswere affirmed that the Zimbabwe Media Commission and his ministry would continue to collaborate with journalists and the media to provide guidance to all media houses and facilitate their growth.\n\nHowever, while we uphold our Constitutional obligation regarding freedom of expression, we must also recognise that the growth of the media industry is predicated on ethics, ethos and factual accuracy.\n\nWe are the architects of our destiny, which is why the President has consistently emphasised nyika inovakwa nevene vayo (a nation is built by its own people). Every member of the fourth estate bears this responsibility, he said.Dr Muswere said that media ethics remain the bedrock of journalism.\n\nIt is an opportunity to verify and ensure that the sources of information we generate and utilise are credible. This will ensure that the robustness and growth of the media industry continue on a positive trajectory.\n\nAs a Government, we have implemented a range of legislative, policy and infrastructure initiatives to support media plurality and diversity in our country, as we endeavour to inform, educate, and entertain the nation.\n\nCelebration of 3K Television at their Harare offices.\n\nDr Muswere acknowledged that, as the Government works towards amendments to the Broadcasting Services Act, it is cognisant of the challenges that have impeded the growth of the media industry.\n\nHowever, what is an adversary? What is success? It is the capacity and determination to overcome adversity, to possess the leadership that will direct, manage, plan, organise, and control the resources of institutions.\n\nI have had the opportunity to familiarise myself extensively with 3K TV studios. This is where technology converges with human capital development, in terms of miniaturising and modernising our studios, as we progress towards an upper middle-income society with a knowledgeable and informed populace.\n\nDr Muswere also commended the role 3K TV plays in promoting Government projects and amplifying voices within marginalised communities. The minister said that 3K TV exemplifies the liberalisation of airwaves under President Mnangagwas leadership.\n\nThis is one of the achievements in terms of the 8 000 projects we frequently cite, regarding the deliverables achieved under the Second Republic. The more our nation imports content from other countries, the more we export jobs to those jurisdictions.\n\nWe must support our local artists.We must support the various disciplines that require a platform to voice issues affecting micro and macroeconomic growth, as well as social, political, and economic spheres within our country, he said.\n\nJester Media Services Group chief executive Mr Pilate Machadu affirmed the companys cordial relationship with the Government.\n\nWe applaud the Government and the Broadcasting Authority of Zimbabwe for opening up the airwaves and introducing diversity in the sector, he said.\n\n3KTV station manager, Ms Abigail Mvududu, expressed pride in the stations significant contribution to the growth of the film industry in Zimbabwe through collaborations with local producers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-4-9.jpg",
            "description": "Harare Bureau ADVOCATING for the overthrow of a democratically elected Government falls outside the bounds of media freedom, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday. Speaking at the third-anniversary celebration of 3K Television at their Harare offices, Dr Muswere underscored the importance of comprehending the constitutional framework governing media operations as […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "President Mnangagwa to unveil new Mbare Market",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-to-unveil-new-mbare-market/",
            "content": "Farirai Machivenyika, Harare Bureau\n\nPRESIDENT Mnangagwa is expected to officially re-open Mbare Market in a fortnight after its reconstruction following a devastating fire last November. The event will also mark the commencement of a national programme aimed at constructing similar markets, providing vendors and small to medium enterprises with safe and hygienic trading environments.\n\nThis was said by Local Government and Public Works Minister Daniel Garwe in the Senate on Thursday in response to questions from senators.\n\nMinister Garwe said following the Mbare fire, which destroyed property and goods valued at millions of US dollars, his ministry was tasked by President Mnangagwa to develop a national programme for the construction of such markets.\n\nWe are not solely focused on Harare; we formulated a concept note, which was presented to Cabinet and subsequently approved. They decided that, given the destruction of Mbare Market, it would be treated as an emergency and serve as a pilot project, a ground-breaking initiative for this programme to be rolled out to all other areas.\n\nThe immediate target following Mbare is Glen View Area 8, where carpentry activities are prevalent and that market was also destroyed by fire. From there, we will proceed to Sakubva in Mutare, Kwekwe, and all other regions. We will also be targeting our rural district councils to ensure that those selling their wares by the roadside or in public spaces are provided with proper market facilities. We are advancing this programme in line with the Presidents mantra of regularisation and building back better, Minister Garwe said.\n\nLocal Government and Public Works Minister Daniel Garwe (fourth from left), Women Affairs, Community, Small and Medium Enterprises Development Minister Senator Monica Mutsvangwa (fourth from right), Minister of State for Provincial Affairs and Devolution for Harare Metropolitan Province Senator Charles Tavengwa (centre), Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (second from right), Masimba Holdings CEO Engineer Fungai Matahwa (third from left) and other delegates pose for a photo at the new Mbare Musika temporary market complex.\n\nHe further said that Mbare Market will include several amenities for both traders and their customers.This august House may wish to know when Mbare Market will be reopened. It will be opened in two weeks time. This is the first phase of the market, which is expected to benefit approximately 1 600 people. The market will feature a bank, a police post, management offices and state-of-the-art ablution facilities.\n\nWe are also providing bathrooms where people can wash before selling their goods. We are constructing markets that align with Vision 2030, which, as His Excellency has stated, requires us to be a well-developed nation by 2030, meeting world-class standards. That is what we are endeavouring to achieve as a country, he said.\n\nMinister Garwe said that, in addition to those who lost their goods in the fire, stalls will be allocated to women, young people and individuals living with disabilities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/34A.jpg",
            "description": "Farirai Machivenyika, Harare Bureau PRESIDENT Mnangagwa is expected to officially re-open Mbare Market in a fortnight after its reconstruction following a devastating fire last November. The event will also mark the commencement of a national programme aimed at constructing similar markets, providing vendors and small to medium enterprises with safe and hygienic trading environments. This […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "The film degree that’s saving endangered species in Matabeleland North",
            "url": "https://www.chronicle.co.zw/the-film-degree-thats-saving-endangered-species-in-matabeleland-north/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nCAMERA in hand, a young man treads the soil of Dete in Matabeleland North, a lone figure against the vast, untamed canvas of the African bush. Survivor Nyasulu, driven by an unwavering passion, has dedicated his life to a creature on the brink  the endangered painted dog.\n\nArmed with a first-class degree in Film, TV and Media Studies from Lupane State University, he has transformed his lens into a powerful tool for conservation, using the art of storytelling and photography to amplify the desperate plight of this iconic species. Nyasulus mission is clear  to ensure the painted dogs survival, one frame, one narrative, at a time.\n\nMy work on the painted dogs was initially a university project but I wanted to raise awareness because they are an endangered species, with only 7 000 left worldwide, Nyasulu said to the Saturday Chronicle.\n\nHis project, Wild Harmony: A Pictorial Odyssey into the Lives and Conservation of Painted Dogs in and Around Hwange National Park, not only earned him a distinction but also ignited a passion that would drive his future endeavours.Nyasulus academic background has equipped him with the skills to navigate the multifaceted world of marketing, communications, photography and conservation.\n\nMy educational background from Marist Brothers and Fatima High School has provided me with strong skills in storytelling, critical thinking and visual communication, which are essential in marketing, communications and photography.\n\nAs a marketing and communications assistant at Painted Dog Conservation, Nyasulu plays a crucial role in amplifying the organisations mission through visual storytelling.\n\nShoots by Survivor Nyasulu\n\nHis nature radio show on Skyz Metro FM, Nature is Life is an innovative way to engage with the community and promote conservation awareness.\n\nI receive calls from listeners asking me questions. I once had a caller from Solusi reporting a pangolin sighting and these interactions are part of my measure of success.\n\nNyasulus commitment to conservation extends beyond his photography and storytelling. As a safari guide, he has a unique perspective on the intersection of tourism and conservation.\n\nI believe responsible tourism plays a vital role in supporting conservation efforts by generating awareness and funding for wildlife protection.\n\nThe importance of owning our stories and telling them from a local perspective is a theme that resonates deeply with Nyasulu.\n\nAs a wildlife photographer and photojournalist, I believe in the importance of capturing local perspectives to tell authentic conservation stories.\n\nHis work challenges mainstream narratives and promotes more inclusive, culturally relevant representation. Nyasulus passion for conservation and storytelling is driven by the incredible beauty of animals like painted dogs in their natural environment.\n\nWitnessing their grace and the delicate balance of nature fuels my dedication to their protection.He draws inspiration from photographers like Nick Dyer and Marlon du Toit.\n\nShoots by Survivor Nyasulu\n\nLooking ahead, Nyasulu plans to continue using his skills to advocate for the protection of painted dogs and their habitats.Im planning on shooting documentaries, collaborating with international photographers, and hosting photo exhibitions.His relentless pursuit of conservation and storytelling serves as a beacon of hope for the preservation of this endangered species.In Nyasulus words, My wish is for my work to be out there, raise awareness about the species, support the work done by painted dog conservationists and raise funds.Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/4e66r.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com CAMERA in hand, a young man treads the soil of Dete in Matabeleland North, a lone figure against the vast, untamed canvas of the African bush. Survivor Nyasulu, driven by an unwavering passion, has dedicated his life to a creature on the brink — the endangered painted dog. Armed with a first-class […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "COMMENT: Time to curb road carnage before more lives are lost",
            "url": "https://www.chronicle.co.zw/comment-time-to-curb-road-carnage-before-more-lives-are-lost/",
            "content": "A total of 4 069 people were killed in road traffic accidents last year alone which was a 93 percent increase from the 2 104 killed in 2023. These are very frightening figures and something should be done urgently to reduce the carnage on our roads.\n\nTwo weeks ago, 25 people were killed when a bus and a haulage truck collided near Luthumba Tollgate, 25km from Beitbridge Town. Seventeen people died on the spot while eight others died on admission to Beitbridge District Hospital.\n\nPresident Mnangagwa\n\nPresident Mnangagwa has said there is urgent need for the Zimbabwe Republic Police (ZRP) to implement the Electronic Management System to curb the road carnage which has been on the increase over the years. Addressing police officers and guests during a police recruit graduation ceremony at Mkushi Academy in Harare on Thursday, President Mnangagwa said the ZRP must tame the traffic jungle by speedily implementing the Electronic Traffic Management System.\n\nThe high rate of indiscipline on our roads, which has resulted in the loss of countless lives due to road carnage, is disturbing. I call upon all Zimbabwean citizens to respect the countrys traffic laws and cooperate with the law enforcement agencies, said President Mnangagwa.\n\nPolice recruits march during the ceremony yesterday\n\nHe said most urban roads have seen heavy presence of pirate vehicles, commonly known as mushikashika and have been a menace for their notoriety in flouting traffic laws thereby contributing to the increased road accidents. President Mnangagwa said Government was fully aware of the need for adequate manpower and material resources to enable the ZRP to fulfil its constitutional mandate hence the recent handover of 500 vehicles for its operations.\n\nIt is my sincere hope that the vehicles distributed across the country have enhanced the operational capacity of the ZRP, said President Mnangagwa.\n\nAccording to statistics, 80 percent of road traffic accidents in Zimbabwe are as a result of human error which means they can be avoided. In a bid to tame the traffic jungle, Government at one time suspended the operators licences for two bus companies after their bus drivers who were racing and blocking each other caused an accident.\n\nGovernment has repeatedly warned public transport operators violating traffic rules and regulations that they risk having their licences withdrawn but it seems bus drivers are not taking heed. There is therefore a need for bus companies to introduce tracking systems to monitor the behaviour of their bus crews as part of efforts to tame the traffic jungle. The bus racing being witnessed on our highways cannot be allowed to continue as it is putting the lives of travellers at risk.\n\nWe have said it before that passengers should not hesitate to report reckless bus drivers at the next roadblock or police station as this is the only way to control the behaviour of these bus drivers.\n\nThe ZRP, as President Mnangagwa said, should speedily implement the Electronic Traffic Management System so that these errant drivers can be weeded out.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-58.jpg",
            "description": "A total of 4 069 people were killed in road traffic accidents last year alone which was a 93 percent increase from the 2 104 killed in 2023. These are very frightening figures and something should be done urgently to reduce the carnage on our roads. Two weeks ago, 25 people were killed when a […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "A PSL season of high stakes, fierce rivalries, and unpredictable outcomes",
            "url": "https://www.chronicle.co.zw/a-psl-season-of-high-stakes-fierce-rivalries-and-unpredictable-outcomes/",
            "content": "Innocent Kurira,[emailprotected]\n\nTHE 2025 Zimbabwe Premier Soccer League kicks off, promising a season of high drama. With opening weekend upon us, fans are buzzing for the battles ahead. Champions Simba Bhora face stiff competition as traditional powerhouses Dynamos, Highlanders and CAPS United want to reclaim glory.\n\nMeanwhile, rising stars Scottland and MWOS aim to disrupt the established order, setting the stage for a thrilling title race and a fierce fight for survival.\n\nHighlanders fans\n\nA new era of competitionFC Platinum and Ngezi Platinum, once league dominators, face a fierce challenge to retain their top-tier status.Despite off-season signings, they must now contend with rising rivals. FC Platinum, though losing key players, remain confident with Coach Norman Mapeza strategically blending local and international talent to bolster their title ambitions.\n\nWe are playing a very good team, Simba Bhora is well-organised and solid at the back. This will be a tough season, but we are ready, said Mapeza.\n\nNewcomers look to make a statementNewly promoted MWOS are set to be the seasons dark horses. With a squad bolstered by experienced signings like Martin Mapisa and Innocent Zambezi under the guidance of seasoned coach Lloyd Mutasa, they exude confidence and are ready to make their mark on the Premiership.\n\nWe are well-prepared, and we aim to survive the rigours of top-flight football. We are a team that wants to make an impact this season, said Mutasa.Opening weekend fixtures: a glimpse of the thrills ahead:\n\nThe season explodes with thrilling opening fixtures.Today, champions Simba Bhora seek revenge against FC Platinum in a clash of titans.Tomorrow, Highlanders ignite fireworks against rising MWOS. Caps United, Chicken Inn, and Herentals also battle for early points.\n\nSunday sees Dynamos launch their campaign against a revamped ZPC Kariba, promising a spectacle for fans.A season full of drama and uncertainty:\n\nBeyond the title race, a fierce relegation battle brews. Kwekwe United and Triangle United aim to defy the odds while Manica Diamonds led by Jairos Tapera, face a revamped Yadah FC. Taperas strategic signings, including Lawrence Mhlanga and Rainsome Pavari, signal a robust defensive approach.\n\nWe are ready, and we want to start the season on a high note, Tapera said ahead of the match.The road to glory:The 2025 PSL season promises a thrilling narrative, with seasoned giants and ambitious newcomers vying for glory. High stakes and fierce rivalries guarantee an unpredictable campaign. For Dynamos, Highlanders, and Caps United, the quest to end their title droughts adds extra intensity to this eagerly awaited season.\n\nWeek 1 Fixtures:TodayHerentals College vs TelOne FC (Rufaro Stadium); Simba Bhora vs FC Platinum (Wadzanayi Stadium); Manica Diamonds vs Yadah FC (Sakubva Stadium); Chicken Inn vs Bikita Minerals (Luveve Stadium); Kwekwe United vs Ngezi Platinum (Bata Stadium); Green Fuel vs Caps United (Green Fuel Arena)SundayDynamos vs ZPC Kariba (Rufaro Stadium); MWOS FC vs Highlanders FC (Baobab Stadium)  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/qrer.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw THE 2025 Zimbabwe Premier Soccer League kicks off, promising a season of high drama. With opening weekend upon us, fans are buzzing for the battles ahead. Champions Simba Bhora face stiff competition as traditional powerhouses Dynamos, Highlanders and CAPS United want to reclaim glory. Meanwhile, rising stars Scottland and MWOS aim to […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "Vice President Mohadi assures Government support for Old Gwanda Road project",
            "url": "https://www.chronicle.co.zw/vice-president-mohadi-assures-government-support-for-old-gwanda-road-project/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTHE Government has guaranteed its full support for the Old Gwanda Road construction, a move officials say will spur rural industrialisation and economic growth in Matabeleland South. Speaking at a traditional ceremony in Umzingwane District yesterday to signal the commencement of works, Vice-President Kembo Mohadi said Government fully supports such initiatives meant to improve the countrys road network.\n\nThe Old Gwanda Road project is being spearheaded by Zwane Enterprises Pvt Ltd on a Build, Operate and Transfer (BOT) arrangement and work is expected to start soon. The traditional thanksgiving ritual, concluding a three-day ancestral observance conducted privately by spirit mediums, saw the symbolic pouring of traditional brew onto the ground from a calabash, signifying the ancestors blessing for the project.\n\nConstruction will start soon after a ground-breaking ceremony expected to be presided over by President Mnangagwa next month.\n\nThe Old Gwanda Road project exemplifies the Governments commitment and capability to work in partnership with the private sector to improve infrastructure such as roads. This project, a testament to Government/private sector collaboration, follows a series of transformative infrastructure projects being implemented by the Second Republic across the country.\n\nThe construction of a modern Old Gwanda Road represents a significant milestone for Matabeleland South Province, promising socio-economic development for its people and the country as a whole, said Vice-President Mohadi.\n\nOld Gwanda Road\n\nVice-President Mohadi stressed the Second Republics expectation for companies and agencies operating within communities to actively engage with those communities, understanding their needs, expectations, and concerns. He said that the Old Gwanda Road project should prioritise community involvement in the construction process while also creating opportunities for downstream industries.\n\nCde Mohadi highlighted the significance of the traditional ceremony as a reminder of the importance of preserving the countrys cultural heritage.\n\nWe are here to express our gratitude to the ancestors who have paved the way for the construction of the Old Gwanda Road. The cultural rite that preceded this ceremony serves as a powerful reminder of our connection to our roots, honouring our past and paying homage to those who came before us.\n\nThis rite is a testament to our steadfast commitment to preserving our traditions and honouring our ancestors. It is through these traditions and customs that we demonstrate our respect and appreciation for their sacrifices and wisdom, he said.\n\nVice-President Mohadi commended the various stakeholders who have supported the project.Minister of State for Matabeleland South Provincial Affairs and Devolution, Dr Evelyn Ndlovu, stated that the project aligns with Vision 2030 and will bring much-needed development to the province. She highlighted the crucial role of the Old Gwanda\n\nRoad in connecting Bulawayo, a major market for Matabeleland region.Today, we gather not only to conduct a traditional ceremony but also to lay the foundation for progress, unity, and prosperity for our province and nation. This project aligns perfectly with President Dr ED Mnangagwas Vision 2030, which ensures that no one and no place is left behind.\n\nIt is a shining example of what we can achieve when the Government, private sector, and communities work together. To the team at Zwane Enterprises, your investment of time, resources and faith in this province has not gone unnoticed, said Dr Ndlovu.\n\nShe said that the road will generate new opportunities for communities, including jobs, improved access to markets and enhanced services delivery marking a significant step towards achieving an upper-middle-income society by 2030.\n\nZwane Enterprises Chief Executive Officer, Engineer Bekithemba Mbambo, expressed his gratitude to the community and traditional leadership for their acceptance of the project. He acknowledged the significance of the traditional ceremony in providing the project with the necessary blessing and approval. Engineer Mbambo also thanked the various stakeholders and the Government for supporting the initiative.\n\nChief Mathe, in a speech read on his behalf by his constituency aide, Mr Cephas Moyo, commended Zwane Enterprises for respecting traditional processes, which are an integral part of the communitys cultural beliefs. Umzingwane Constituency Member of Parliament, Brigadier-General (Rtd) Levi Mayihlome, said six constituencies will directly benefit from the road whose completion will bring development to the area.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Mohadi-Gwanda-visit.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw THE Government has guaranteed its full support for the Old Gwanda Road construction, a move officials say will spur rural industrialisation and economic growth in Matabeleland South. Speaking at a traditional ceremony in Umzingwane District yesterday to signal the commencement of works, Vice-President Kembo Mohadi said Government fully supports such initiatives meant […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "Stability at last: Bennett and Curran anchor Zimbabwe’s top order",
            "url": "https://www.chronicle.co.zw/stability-at-last-bennett-and-curran-anchor-zimbabwes-top-order/",
            "content": "Brandon Moyo,[emailprotected]\n\nFOR what seems an age, Zimbabwes cricketing fraternity has been on a quest: to unearth a dependable opening partnership, one capable of seeing off the new balls venom and crafting a solid platform for the middle order, regardless of the format. The Chevrons, in their pursuit, have tirelessly shuffled personnel, trying countless combinations, yet, frustratingly, the elusive answer has remained out of reach.\n\nFrequent early wicket losses have become the norm at the top, placing undue pressure on the middle order. These opening struggles have been a persistent concern for the Chevrons. In One Day Internationals (ODIs), since the beginning of 2021, Zimbabwe has deployed a staggering 25 different opening combinations. However, the outcome has consistently remained the same  a lack of a substantial first-wicket stand.\n\nNevertheless, the Chevrons recent international assignment against Ireland, encompassing a one-off Test, three ODIs, and three T20Is, may have provided the solution to their opening woes in 50-over cricket.\n\nChevrons\n\nThe duo of Brian Bennett and Ben Curran, the 25th opening combination trialled, appear to have found the right formula. The two talented players batted exceptionally well at the top, providing the stability Zimbabwe had been craving and seeing off the new ball with aplomb.\n\nSince Hamilton Masakadza and Sikandar Razas 224-run first-wicket partnership against Afghanistan in 2014, Zimbabwe had not witnessed an opening partnership achieve a hundred-run stand.\n\nHowever, Bennett and Curran defied expectations, forging a record-breaking 124-run opening stand in the third ODI before Bennett was dismissed just two runs shy of a half-century. They propelled the Chevrons to a commanding nine-wicket victory, equalling their largest margin of victory by wickets, matching their nine-wicket win over Kenya in Bulawayo in 2002.\n\nAcross their three outings against Ireland, the pair boasted an impressive first-wicket partnership average of 85.66. In the series opener, they posted a 95-run stand before Curran was dismissed for 28 runs in the 19th over. Bennett proceeded to score a career-best 169 runs, securing a 49-run win for Zimbabwe.\n\nThe second ODI proved less successful, with the partnership broken in the seventh over with only 38 runs on the board. Bennett fell for 30 off 34 balls. The Chevrons lost that match by four wickets.\n\nHowever, in the third and final ODI, Bennett and Curran cemented their status as the opening pair Zimbabwe had long sought in 50-over cricket. Their 124-run partnership now stands as the joint seventh-highest first-wicket stand for Zimbabwe in ODIs, equalling Grant and Andy Flowers efforts against New Zealand in 1992 and Kenya in 1997.In the 10th over, Curran unleashed 15 runs off Josh Little, including three boundaries, establishing Zimbabwes best powerplay score in ODIs at 77/0, surpassing the previous record of 75.\n\nZimbabwe appears to have discovered the right batsmen to capitalise on the fielding restrictions early in the game. The record-breaking stand was eventually broken by Graham Hume, who trapped Bennett in front for 48 runs in the 20th over.Bennett and Curran garnered praise from Captain Craig Ervine, who stressed that the duo has facilitated the flourishing of other batsmen.\n\nCertainly, I think it just shows that when you get that initial platform at the top, it allows other guys to come in and play freely, like myself, Sikandar (Raza), Wessly (Madhevere), and the guys in the middle order. Its exciting to see the consistency, especially over this series. A lot of credit to Benny and Ben, they have worked extremely hard and stuck to the processes, so its nice to see them get the reward for that, said Ervine.\n\nHead coach Justin Sammons also commended the opening partnership, highlighting that a solid start sets the right tone for the game.\n\nIts an important part of the game. Its extremely pleasing to see Ben and Brian put up 95 in the first game, and 38 in the second ODI. Thats still momentum, still a start. They are forming a strong partnership, which is brilliant to see. I also like the fact that its a left/right combination, which is effective in unsettling the opposition. They have been brilliant, and for me, finding that opening pair in all three formats is crucial, said Sammons.\n\nBased on their recent performances, Bennett and Curran appear to be the opening partnership that the Chevrons have been seeking for nearly half a decade in 50-over cricket.\n\nZimbabwe Cricket must therefore continue to support them going forward.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/4ffr.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com FOR what seems an age, Zimbabwe’s cricketing fraternity has been on a quest: to unearth a dependable opening partnership, one capable of seeing off the new ball’s venom and crafting a solid platform for the middle order, regardless of the format. The Chevrons, in their pursuit, have tirelessly shuffled personnel, trying countless […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "Oh how demonic, how satanic!",
            "url": "https://www.chronicle.co.zw/oh-how-demonic-how-satanic/",
            "content": "Stephen Mpofu, Perspective\n\nTODAYS Saturday column is a resolute call for an intensified campaign, a veritable blitzkrieg, designed to leave peddlers and consumers of illicit and dangerous drugs forever regretting their actions.\n\nThe fact that mental health institutions across the country are overwhelmed by victims of ongoing drug and substance abuse, as reported recently by a local radio station, compels every Zimbabwean citizen to rise and participate in cleansing our otherwise Christian society from the scourge of drug addiction, a menace that has our country virtually reeling.\n\nMutoriro appears to dominate as a favourite among consumers while other drugs such as mbanje, bronco, chlorpromazine and guka, wreak havoc in a more insidious manner.\n\nSome of these health-destroying drugs are smuggled into the country from neighbouring nations to the east, south, and north of Zimbabwe by unscrupulous merchants, determined to profit regardless of the devastating toll their merchandise exacts.\n\nillicit drugs\n\nThese peddlers can rightly be described as the devils messengers.Tragically, and unbeknownst to its avid consumers, mutoriro is known to cause impotence in men and infertility in women.\n\nTherefore, mutoriro enthusiasts should not expect to have children, with divorce a near certainty when couples fail to demonstrate their procreative abilities.\n\nThe police have apprehended numerous culprits in their efforts to rid our society of this drug scourge, but much more needs to be done. Intensified searches at our border posts and airports are essential to curb the inflow of drugs by smugglers.\n\nThis calls, as we have previously stated in this column, for closer cooperation and co-ordination between the police and the general public to root out purveyors and consumers of these dangerous drugs and substances, which are inflicting greater damage on the health of our people than the impact of illegal western economic sanctions on the economy.\n\nAs suggested by this communicator in previous discussions, there is a clear need for urban communities to establish anti-drug patrols to intercept smugglers and users of these dangerous substances, to which unemployed youths without occupational skills easily fall victim, consuming the drugs in the misguided belief that they alleviate their anxieties about their poverty.\n\nFurthermore, the police, in collaboration with rural communities, should establish roadblocks or human barriers around businesses at growth points to prevent infiltration by drug traffickers in those areas, thereby protecting the local population.Naturally, lengthy prison sentences for smugglers and peddlers of illicit drugs should instil a fear of the law in offenders, deterring them from their destructive trade.\n\nIf well-co-ordinated, the anti-drug activities outlined above will be enshrined in historical records for future generations to\n\nreference, should they also face the dangers of drug abuse.To reiterate, unemployed youths out of school should strive to acquire skills for a better future, rather than simply complaining about their joblessness and blaming employers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/02/Illicit-drugs.jpg",
            "description": "Stephen Mpofu, Perspective TODAY’S Saturday column is a resolute call for an intensified campaign, a veritable blitzkrieg, designed to leave peddlers and consumers of illicit and dangerous drugs forever regretting their actions. The fact that mental health institutions across the country are overwhelmed by victims of ongoing drug and substance abuse, as reported recently by […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        },
        {
            "title": "Lady truck driver defies odds… Meet Zimbabwe’s fearless female truck driver",
            "url": "https://www.chronicle.co.zw/lady-truck-driver-defies-odds-meet-zimbabwes-fearless-female-truck-driver/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nSHES always been one to buck the trend. A passionate Dynamos supporter, for instance, despite living practically next door to Barbourfields Stadium in Mzilikazi  a suburb where Highlanders is more than just a football club; its a way of life.\n\nHighlanders, with its regal roots  founded by King Mzilikazis grandsons, Rhodes and Albert Khumalo back in 1926  holds a unique place in the communitys heart. Living so close to Emagumeni, youd expect most Mzilikazi residents to be Bosso fans, or at least have some connection to the club. If not, theyd probably be Zimbabwe Saints supporters, or simply not interested in football, given that other local teams are relatively recent additions.\n\nSupporting a team is a matter of personal choice but some choices are just unique. A black and white flag in Mbare, Harare, for instance, would be unusual, just as a Barcelona kit in Madrid or a Real Madrid flag in Catalonia would raise eyebrows. Its more of a cultural taboo, though not impossible.\n\nSindiso Ndlovu, however, took a far more unconventional path. She left her career as a cartographer with the Zimbabwe Statistics Agency (ZimStat)  a profession involving drawing and producing maps  to become a cross-border haulage truck driver.\n\nMy initial inspiration was a woman driving a ShuShine bus when I was in Grade Five in Hwange. She drove us on a school trip to Masvingo and I was just fascinated that a woman could drive something so huge. I told myself that if she could do it, so why not.\n\nNdlovus grandfather was also a cross-border truck driver and she fondly remembers him bringing his truck horse home. She would climb inside and admire it, further fuelling her love for haulage trucks.\n\nTruck driving wasnt my first career. I started as a cartographer at ZimStat but the desire to do something extraordinary pushed me to leave that profession and pursue my childhood dream, she said.\n\nHer first experience of driving a truck was at age 22, in 2005.\n\nAlthough she didnt have a licence at the time, it was just for fun. She obtained her drivers licence in Zambia in 2011 where her family originally comes from, although she grew up in Zimbabwe. Even after getting her licence, she continued working as a cartographer until 2015, when she became a full-time haulage truck driver.\n\nI would drive from the Democratic Republic of Congo (DRC), through Zambia and Botswana, or sometimes Zimbabwe, to South Africa. The trucks I drove were the big ones, super link haulage trucks, the ones with two trailers, said Ndlovu.Slimly built, Ndlovu said she always encountered curious looks on the road, from other motorists, police officers and Zimbabwe Revenue Authority (Zimra) officials at roadblocks and toll gates.\n\nId get a lot of curious stares, even at toll gates. At one time at a toll gate, I was asked to pull over because the officers didnt believe I was the driver. I also remember at a roadblock near Mbokodo on the Bulawayo-Plumtree Road, police officers ordered me to park. One of them said, quite clearly, that there was no way someone as slim as me could drive such a huge vehicle. After checking my documents, I told them I wasnt carrying the load on my shoulders; my job was to control the vehicle carrying the load. They were in stitches, she said with a chuckle.\n\nNdlovu was fortunate to work for a company that transported copper and had a policy of travelling in convoy. If one driver had a breakdown or needed to check something, everyone stopped; no one was left behind.\n\nSindiso Ndlovu\n\nHaulage truck drivers often take breaks at truck stops, sometimes overnight. Its well known that these stops can be places where drivers indulge in alcohol and other illicit activities, and where some male drivers are alleged to bring in sex workers. Ndlovu didnt deny this.\n\nIt depends how you present yourself. If you present yourself as someone whos interested in those things, youll be treated accordingly. But if you are dignified, you will be treated with respect.\n\nNdlovu praised the increasing number of gender-sensitive facilities at truck stops, particularly the provision of separate male and female bathrooms.\n\nMost truck stops now have facilities for both male and female drivers such as bathrooms. As for the company I worked for, it was company policy that we didnt just stop at any truck stop; we had specific ones, so it wasnt really an issue for me when I needed to use the bathroom or have a wash in the morning.\n\nNdlovu believes that driving haulage trucks is a calling and urges other women to follow their hearts and not be deterred by anything or anyone.\n\nTo the ladies out there, dont let anyone look down on you. Do what you feel like doing. The sky is the limit. Yes, men will always be men, and as women, we are sometimes submissive, but that must not put you down or make you change what your heart tells you.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Woman-Truck-Driver-1.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw SHE’S always been one to buck the trend. A passionate Dynamos supporter, for instance, despite living practically next door to Barbourfields Stadium in Mzilikazi — a suburb where Highlanders is more than just a football club; it’s a way of life. Highlanders, with its regal roots — founded by King Mzilikazi’s grandsons, […]",
            "time": "06:08",
            "date": "01 Mar 2025"
        }
    ]
}