{
    "news": [
        {
            "title": "Era of unregulated liquor sales, public drinking is over – Government",
            "url": "https://www.chronicle.co.zw/era-of-unregulated-liquor-sales-public-drinking-is-over-government/",
            "content": "Bongani Ndlovu,[emailprotected]\n\nTHE era of unregulated alcohol sales and public drinking is over with Government declaring a crackdown against mobile bottle stores to curb illegal activities that pose health and security threats.\n\nSpeaking during a press briefing on Wednesday in Harare, Minister of Local Government and Public Works, Daniel Garwe, said the era of unregulated alcohol sales and public drinking is over.\n\nPeople are drinking all over the shore  that is now a thing of the past in terms of the mandate that has been given to us, he said.No more mobile bottle stores. Let me repeat, no more mobile bottle stores anymore. These people moving with their small cars, selling alcohol from their boot  no! That must stop.\n\nMinister Garwe highlighted the numerous problems caused by such activities, including the lack of ablution facilities, health scares, security threats, and rising criminal activities such as theft, pickpocketing, and drug dealing.\n\nWe are happy that this crackdown addresses the lack of ablution facilities, which speaks to modernity and affects everyone here, he said.The health scare affects everyone here. The threat to security affects everyone here. The level of theft and pick-pocketing affects everyone here. The level of drug dealing affects a relative of everyone here. So, the answer is to do the right thing  enforce the laws and stop that behaviour, said Minister Garwe.\n\nThe Governments directive comes as part of a broader effort to restore order, ensure public safety, and promote a clean and healthy environment.\n\nMinister also reiterated that the enforcement of these regulations will be strict and unwavering, with support from law enforcement agencies.We are committed to fostering a safe, clean, and orderly environment for all citizens. This is not just about enforcing laws; it is about protecting our communities and ensuring a better quality of life for everyone, he added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/01/Untitled-43-2.jpg",
            "description": "Bongani Ndlovu, bongani.ndlovu@chronicle.co.zw THE era of unregulated alcohol sales and public drinking is over with Government declaring a crackdown against mobile bottle stores to curb illegal activities that pose health and security threats. Speaking during a press briefing on Wednesday in Harare, Minister of Local Government and Public Works, Daniel Garwe, said the era of unregulated […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "BREAKING: Councils directed to clear illegal vending sites within 48 hours",
            "url": "https://www.chronicle.co.zw/breaking-councils-directed-to-clear-illegal-vending-sites-within-48-hours/",
            "content": "Bongani Ndlovu,[emailprotected]\n\nGOVERNMENT has directed all local authorities to clear illegal vending sites within 48 hours as part of a nationwide crackdown against unregulated trading activities citing serious public health, security, and economic concerns.\n\nLocal Government and Public Works Minister Daniel Garwe, announced the drastic move during a press briefing in Harare on Wednesday evening where he emphasized the need to restore order in cities and towns across the country.\n\nHe said Government was seriously concerned about the proliferation of illegal vendors, particularly the rise of night trading, which has created significant health and security challenges.\n\nTo address this, Government has directed local authorities to remove vendors from undesignated points within 48 hours.\n\nThe operation will be supported by law enforcement agencies, including the Zimbabwe Republic Police (ZRP) and other security units, to ensure compliance and maintain order.\n\nLocal authorities must enforce regulations requiring all informal traders to hold valid licenses and operate only in designated areas equipped with adequate sanitary facilities, said the Minister.Government remains committed to fostering a safe, clean, and orderly environment for all citizens.\n\nHe stated that the mushrooming of unregulated marketplaces disrupts the operations of legal, registered, and law-abiding traders, leading to unfair competition and potential financial losses.\n\nMoreover, illegal vending has also been linked to unsanitary conditions, as vendors often operate in areas without access to potable water or ablution facilities.\n\nThis has raised the risk of disease outbreaks, including typhoid, dysentery, and cholera. The accumulation of waste from these vendors has rendered some roads, sanitary lanes, and sidewalks impassable, exacerbating public health risks,Minister Garwe said.\n\nHe said the situation has been further complicated by vendors blocking drainage systems with their wares, leading to flooding during the rainy season.\n\nWhen it rains, our roads become flooded because the drains are blocked. This is creating serious problems for our infrastructure, said Minister Garwe.\n\nHe said in addition to health concerns, illegal vending has become a haven for criminal activities such as theft, robbery, and drug dealing.The lack of regulation and oversight in these areas allow criminal elements to exploit the situation, destabilizing communities and eroding public trust in law enforcement agencies, said Minister Garwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/New-measures-to-combat-vending-2-630x380.jpg",
            "description": "Bongani Ndlovu, Bongani.ndlovu@chronicle.co.zw GOVERNMENT has directed all local authorities to clear illegal vending sites within 48 hours as part of a nationwide crackdown against unregulated trading activities citing serious public health, security, and economic concerns. Local Government and Public Works Minister Daniel Garwe, announced the drastic move during a press briefing in Harare on Wednesday evening […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "Hadebe opts out of Warriors",
            "url": "https://www.chronicle.co.zw/hadebe-opts-out-of-warriors/",
            "content": "Langton NyakwendaWARRIORS coach, Michael Nees, still believes USA based defender Teenage Hadebe has the qualities to play in the national team and has described the Cincinnati player as a very good player who cares about his family.The 29-year-old Hadebe is not part of the Warriors squad that will face Benin and Nigeria in the World Cup qualifiers.He has excused himself as he wants to focus on completing his US citizenship process.Teenage Hadebe has an appointment with the authorities in USA, he wants to get a green card.He is a very good player who cares about his family, Nees told the press, soon after announcing a 23-man squad at ZIFA Offices yesterday.Zimbabwe resume their World Cup qualifying campaign with a date against Benin in Durban on March 20.They will then face Nigeria in Uyo on March 25.The Warriors anchor Group C with two points from four matches.Rwanda, South Africa and Benin are tied at the top with seven points, Lesotho have five while Nigeria are on three points.Hadebe featured in Zimbabwes three opening qualifiers against Rwanda, Nigeria and South Africa but played cameo roles in the Africa Cup of Nations qualifiers as he was recovering from an ankle injury.The gangly defender has fully recovered and is one of the most experienced players Nees can rely on.But, the former Chicken Inn defender has excused himself for duty this time around as he wants to fix his documents in USA.The absence of Hadebe has created a gap for newcomers like Simba Bhora defender Isheanesu Mauchi and Scottlands Peter Muduhwa who has made a return to the Warriors setup.Scottland have six players in the squad and have the highest representation from local clubs.Apart from Muduhwa, Scottland also have Khama Billiat, Godknows Murwira, Mthokozisi Msebe, Tymon Machope and Walter Musona in the national team.Nees explained his decision.They (Scottland) had a good preseason in Zambia, two or three weeks, Simba Bhora they were also in South Africa, said the gaffer.The German still thinks Zimbabwe can claw their way back into contention for a place at the 2026 World Cup finals.They are still 18 points to play for.But realistically we are in a difficult situation, said Nees\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Teenage-Hadebe.jpg",
            "description": "Langton Nyakwenda WARRIORS coach, Michael Nees, still believes USA based defender Teenage Hadebe has the qualities to play in the national team and has described the Cincinnati player as a “very good player who cares about his family.” The 29-year-old Hadebe is not part of the Warriors squad that will face Benin and Nigeria in […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "Nine dead , 11 injured in 2 months of croc attacks",
            "url": "https://www.chronicle.co.zw/nine-dead-11-injured-in-2-months-of-croc-attacks/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nNINE people have been killed while 11 were injured in crocodile attacks in the last two months, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has said.\n\nAt least 44 cattle and 60 goats were also killed during the same period in 49 human-crocodile conflict cases received.\n\n19 cases were recorded in the Central region which covers Kwekwe River Sebakwe River and Munyati River areas.\n\nIn the Mid-Zambezi region that encompasses Lake Kariba, Angwa River and Hunyani River, 14 cases were recorded.\n\n16 cases were recorded in the Matopo, Harare, North-West Matabeleland and South-East Low-veld regions collectively.\n\nWe urge communities to remain cautious, especially around water bodies during this rain season.\n\nCommunities must ensure that children and livestock are not left unattended near rivers or lakes to prevent them from becoming easy targets to the reptiles, said ZimParks spokesperson Mr Tinashe Farawo.\n\nAdditionally, when engaging in activities such as fishing, swimming and any other domestic chores in water bodies, it is essential to barricade around the places to ensure safety,\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/A-Crocodile-rests-under-the-shade-on-the-sandy-Zambezi-River-River-bank.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com NINE people have been killed while 11 were injured in crocodile attacks in the last two months, the Zimbabwe Parks and Wildlife Management Authority (ZimParks) has said. At least 44 cattle and 60 goats were also killed during the same period in 49 human-crocodile conflict cases received. 19 cases were recorded in […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "Police Commissioner General Mutamba orders full scale investigation into CID detective shooting",
            "url": "https://www.chronicle.co.zw/police-commissioner-general-mutamba-orders-full-scale-investigation-into-cid-detective-shooting/",
            "content": "Peter Matika,[emailprotected]\n\nPOLICE Commissioner General Stephen Mutamba has ordered a comprehensive investigation into the circumstances surrounding the death of detective Constable Cassandra Hove while assuring the family that no stone will be left unturned.Comm-Gen Mutamba, through the police national spokesperson Commissioner Paul Nyathi, said all concerns raised by the late Hoves family and the public have been noted.He has since ordered full-scale investigations into the case. The Zimbabwe Republic Police once again assures the public that no stone will be left unturned to establish what transpired on the day, said Comm Nyathi.He said police would release a statement once investigations are complete.The police will certainly update the family and public in due course once the current comprehensive investigations are complete. The investigations cover all the aspects raised by The Chronicle, said Comm Nyathi.Hoves death has become a matter of public interest, as it recently emerged that she was allegedly shot by a colleague in a shootout with armed robbers during a raid in Pumula South suburb last week.Earlier on it had been reported that she was shot by armed robbers in the suburb during a covert operation.It was only after Hoves family raised concerns as to how she was killed that the matter raised eyebrows. She was 37.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2015/12/STEPHEN-MUTAMBA-POLICE.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw POLICE Commissioner General Stephen Mutamba has ordered a comprehensive investigation into the circumstances surrounding the death of detective Constable Cassandra Hove while assuring the family that no stone will be left unturned. Comm-Gen Mutamba, through the police national spokesperson Commissioner Paul Nyathi, said all concerns raised by the late Hove’s family and […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "Parliamentary committee embarks on outreach to small and large mining operations",
            "url": "https://www.chronicle.co.zw/parliamentary-committee-embarks-on-outreach-to-small-and-large-mining-operations/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nTHE Parliamentary Portfolio Committee on Mines and Mining Development is set to embark on an outreach programme from 13 to 17 March 2025 to engage with both small and large mining operations.\n\nIn a statement, Zimbabwe Miners Federation (ZMF) Chief Executive Officer Mr Wellington Takavarasha explained that this initiative aims to foster collaboration, identify opportunities and challenges, and promote sustainable mining practices throughout the gold value chain production.\n\nBy engaging directly with miners, the Committee seeks to gain valuable insights and facilitate informed decision-making on policy formulation that is suitable for ASM operations, the notice reads.\n\nZMF further encouraged miners within the regions of the proposed sites to participate in the familiarisation programme, as outlined in the itinerary.\n\nThe outreach will begin in Bindura, followed by Mazowe and Inyathi on the 14th, Mutoko and Gwanda on the 15th, Masvingo and Kwekwe on the 16th, and will conclude in Kadoma and Mutare on the 17th.Zimbabwes mining industry is endowed with vast mineral deposits, including gold, platinum, diamonds, lithium, chrome, coal, and semi-precious stones such as amethyst, agate, antimony, and amazonite.\n\nSmall-scale mining operations are predominantly focused on gold, chrome, and semi-precious stones along the Great Dyke belt.\n\nIn the gold sub-sector, small-scale miners are the major contributors, accounting for approximately 60 percent of the nations gold output.\n\nThe mining industry remains one of Zimbabwes economic cornerstones.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Wellington-Takavarasha.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com THE Parliamentary Portfolio Committee on Mines and Mining Development is set to embark on an outreach programme from 13 to 17 March 2025 to engage with both small and large mining operations. In a statement, Zimbabwe Miners Federation (ZMF) Chief Executive Officer Mr Wellington Takavarasha explained that this initiative aims to foster […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "“Friends of Intwasa” initiative gaining momentum as festival prepares for September return",
            "url": "https://www.chronicle.co.zw/friends-of-intwasa-initiative-gaining-momentum-as-festival-prepares-for-september-return/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nThe annual Intwasa Arts Festival KoBulawayo is set to return to its traditional September dates, after being held in November last year. The festival, which celebrates the citys vibrant cultural heritage, will take place from September 24 to 27 this year.\n\nRaisedon Baya, the festivals director, explained the importance of the events return to its original month.Intwasa is tied to a specific time of the year  the Spring season. Its named after that season, and the festival must take place during that period. Our hope is that every edition happens in September. Thats our time, Baya explained.\n\nBaya is optimistic of the events success, citing the success of the Become a Friend of Intwasa fundraising initiative launched earlier this year. The initiative aims to raise US$20 from 50 supporters to empower young talents in poetry, hip-hop, dance, writing, and music. The funds will support innovative performances and provide emerging artists with exposure, confidence, and the opportunity to develop their craft.The Friends of Intwasa initiative is gaining momentum. People are coming forward, some supporting immediately, others asking for more information. Our community loves to support good causes, and they want to invest in something that benefits the less privileged, Baya shared.\n\nBaya shared the critical role of public support for the festival, especially given the economic challenges.Public support is vital. Supporting the festival will bring the community closer. Supporters can influence programming and other aspects because they will be investing in the brand. We want people to be part of the festival, not just as consumers but as investors in the event, he said.\n\nAs the festival continues to gain traction, Baya remains hopeful about its success.We are optimistic. We keep praying. Things are tough, but anything can happen. But we always say, Ithendele elihle ngelikhala ligijima. While we run and organise, we stay hopeful. We are a miracle that happens every year. So, fingers crossed as always.\n\nWith its return to September, the Intwasa Arts Festival KoBulawayo is set to reclaim its position as one of the citys most anticipated events and Zimbabwes oldest festival.\n\nSynonyms for KoBulawayo\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/yhjugjuy.jpg",
            "description": "Mbulelo Mpofu,mbulelo.smpofu@gmail.com The annual Intwasa Arts Festival KoBulawayo is set to return to its traditional September dates, after being held in November last year. The festival, which celebrates the city’s vibrant cultural heritage, will take place from September 24 to 27 this year. Raisedon Baya, the festival’s director, explained the importance of the event’s return […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "Anthony Pierce: Former bishop jailed for historical child abuse",
            "url": "https://www.chronicle.co.zw/anthony-pierce-former-bishop-jailed-for-historical-child-abuse/",
            "content": "Tomos Evans\n\nA former bishop has been jailed for historical child abuse.\n\nAnthony Pierce, the former bishop of Swansea and Brecon, was jailed for four years and one month on Wednesday.\n\nHe will serve half the sentence behind bars, before he is released on licence.\n\nThe 84-year-old had previously pleaded guilty to five counts of indecent assault on a male child under the age of 16.\n\nSwansea Crown Court heard the abuse took place when Pierce was working as a vicar in the city, several years before he became the bishop of the Swansea and Brecon diocese in 1999.\n\nThe victim, who cannot be named for legal reasons, was 14 years old at the time.\n\nProsecuting, Dean Pulling said the defendant was trusted to look after and care for the victim.\n\nHe said the victim felt acute embarrassment and sense of shame.\n\nHe was also worried about what his parents would think if it would ever get out, and how they would react, Mr Pulling added.\n\nThe court heard the defendant denied any responsibility during his police interview and claimed that he had no sexual attraction towards children.\n\nIn mitigation, Heath Edwards said the defendant deeply regrets the behaviour in which he became involved.\n\nIn a statement he read in court, the victim said he had felt an overwhelming sense of embarrassment and shame that [he] allowed it to happen.\n\nI have very low self-esteem and self-worth. I do not have friends, and I know people only on a superficial level. All my adult relationships have been dysfunctional, he added.\n\nThe victim said he became alcohol dependent after the abuse, which destroyed his post-school education, career and some personal relationships.\n\nHe also outlined the impact the abuse had had on his family, saying he felt trapped in the age of 13 or 14.\n\nI struggle to relate to my parents as I still feel the emotional age of when the abuse happened, he added.\n\nI have lived my life not once believing that I would ever disclose the abuse to anybody.\n\nBut after he disclosed it, the victim said he felt an overwhelming sense of relief and felt empowered.\n\nLet down and betrayed\n\nSentencing, Judge Catherine Richards told the court the defendant began to groom [the victim] in a manner that is sadly familiar to this court.\n\nYou progressed to sexual abuse in the ways described by the prosecution, she said.\n\nThe judge went on to say that there would be people in the wider community who felt let down and betrayed that a man in your position could behave in such a hypocritical way.\n\nShe said the defendant had outlined the impact of the abuse upon him eloquently and realistically in his victim personal statement and that he had gone on to have to deal with the devastating impact of your abuse.\n\nThere is only one person who should have shame for what took place, and that is you, she added.\n\nSource: news skys.com\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/piop.jpg",
            "description": "Tomos Evans A former bishop has been jailed for historical child abuse. Anthony Pierce, the former bishop of Swansea and Brecon, was jailed for four years and one month on Wednesday. He will serve half the sentence behind bars, before he is released on licence. The 84-year-old had previously pleaded guilty to five counts of […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "Matabeleland South adopts rotational system for Independence Day Celebrations",
            "url": "https://www.chronicle.co.zw/matabeleland-south-adopts-rotational-system-for-independence-day-celebrations/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nMATABELELAND South Province will hold its 45th provincial Independence Day celebrations in Plumtree this year, marking a shift from its traditional venue in Gwanda, the provincial capital. This change follows the adoption of a rotational system in line with President Mnangagwas decentralisation policy.\n\nStakeholders during a Matabeleland South independence preparatory meeting\n\nStakeholders from the province, including Zanu-PF leaders, heads of Government departments, and service chiefs, convened in Plumtree on Monday for an independence preparatory meeting. During the meeting, it was agreed that the celebrations would rotate among different districts to promote inclusivity and decentralisation.\n\nMatabeleland South Permanent Secretary for Provincial Affairs and Devolution, Mrs Lathiso Dlamini-Maseko, said stakeholders visited Plumtree High School to assess the venue following the meeting.\n\nWe held a meeting as stakeholders from the province, and it was resolved that this years Independence Day celebrations will be held in Plumtree Town. We have always held the celebrations in Gwanda, which is the provincial capital, but we have now adopted the rotational system, said Mrs Dlamini-Maseko.\n\nWe are trying to follow the example of His Excellency President Mnangagwa, who has been moving around provinces for the Independence Day celebrations. Next year, we will move to another district. Stakeholders welcomed this move, and preparations are already underway for the event, she added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/Mrs-Lathiso-Dlamini-Maseko.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw MATABELELAND South Province will hold its 45th provincial Independence Day celebrations in Plumtree this year, marking a shift from its traditional venue in Gwanda, the provincial capital. This change follows the adoption of a rotational system in line with President Mnangagwa’s decentralisation policy. Stakeholders from the province, including Zanu-PF leaders, heads of […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        },
        {
            "title": "Cop to rot in jail for raping daughter",
            "url": "https://www.chronicle.co.zw/cop-to-rot-in-jail-for-raping-daughter/",
            "content": "Sinokubonga Nkala[emailprotected]\n\nIN a shocking abuse of authority and familial trust, a 47-year-old police officer has been sentenced to 21 years in prison for the unspeakable crime of raping his grade 7 daughter.\n\nThe horrific abuse started in August 2024 when the officer returned home drunk and brutally assaulted the minor daughter within the supposed safety of their family home.His name has been withheld to protect the identity of the victim.The officer coerced his daughter into silence, warning her against disclosing or reporting the abuse.In an official statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said, The abuse continued into the new year, with another incident in January 2025 where he fondled her and expressed further desires to have sex with her.The assault was halted by the arrival of the girls stepmother, but the officer once again exerted control over his daughter, using intimidation to ensure her continued silence.The girl found the strength to share her traumatic experience with trusted friends and a teacher at school, who provided support and guidance to help her formally report the abuse.\n\nA medical examination confirmed what had happened, leading to the arrest and conviction of her father, said the NPAZ.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/statutory-rape-defense-lawyer.jpg",
            "description": "Sinokubonga Nkala sinokubongapnkala@gmail.com IN a shocking abuse of authority and familial trust, a 47-year-old police officer has been sentenced to 21 years in prison for the unspeakable crime of raping his grade 7 daughter. The horrific abuse started in August 2024 when the officer returned home drunk and brutally assaulted the minor daughter within the […]",
            "time": "20:42",
            "date": "12 Mar 2025"
        }
    ]
}