{
    "news": [
        {
            "title": "President Chapo Jets into Zimbabwe for 65th ZITF Opening",
            "url": "https://www.chronicle.co.zw/president-chapo-jets-into-zimbabwe-for-65th-zitf-opening/",
            "content": "Rutendo Nyeve, Online Reporter\n\nMOZAMBICAN President Daniel Chapo arrived in Bulawayo on Thursday evening ahead of presiding over the official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF) on Friday.\n\nHis aircraft touched down at the Joshua Mqabuko Nkomo International Airport shortly after 7pm and was welcomed by a high-level delegation led by Zimbabwes Minister of Foreign Affairs and International Trade, Professor Amon Murwira.\n\nAlso in attendance was the Minister of State for Bulawayo Provincial Affairs and Devolution, Judith Ncube, several Cabinet ministers, service chiefs, senior government officials, and representatives from the ruling ZANU-PF party.\n\nPresident Daniel Chapo arrives at the Joshua Mqabuko Nkomo International Airport in Bulawayo\n\nUpon disembarking, President Chapo was warmly embraced by Professor Murwira in a gesture symbolising diplomatic goodwill.Speaking to the media shortly after his arrival, President Chapo highlighted the deep historical ties between Mozambique and Zimbabwe, emphasising the importance of unity and cooperation between the two nations.\n\nWe are very happy to be here. You know that Zimbabwe is Mozambique and Mozambique is Zimbabwe. That is why we are here, to be together. It is very important for us to stand in unity, to grow stronger together. We share the same culture and face similar challenges, whether political, economic or trade-related. This visit is an opportunity to discuss business, trade, political issues, and our economic challenges, said President Chapo.\n\nFollowing his arrival, President Chapo was escorted to State House, where President Mnangagwa is hosting a state banquet in his honour.\n\nThe exclusive event is being attended by Cabinet ministers, diplomats, and business leaders, and is expected to provide a platform for dialogue on enhancing bilateral cooperation in trade, investment, and regional security.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/President-Daniel-Chapo-arrives-at-the-Joshua-Mqabuko-Nkomo-International-Airport-in-Bulawayo-2.jpg",
            "description": "Rutendo Nyeve, Online Reporter MOZAMBICAN President Daniel Chapo arrived in Bulawayo on Thursday evening ahead of presiding over the official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF) on Friday. His aircraft touched down at the Joshua Mqabuko Nkomo International Airport shortly after 7pm and was welcomed by a high-level delegation […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Zimbabwe Independent Complaints Commission makes debut at ZITF",
            "url": "https://www.chronicle.co.zw/zimbabwe-independent-complaints-commission-makes-debut-at-zitf/",
            "content": "Mthabisi Tshuma,Online Writer\n\nTHE Zimbabwe Independent Complaints Commission (ZICC) is among the first-time exhibitors at the 65th edition of the Zimbabwe International Trade Fair.\n\nWith commissioners sworn in on September 19, 2024, the organisation was fostered by the Second Republic to ensure a culture of transparency and accountability among security services.\n\nZICC is chaired by former High Court judge, Justice Webster Nicholas Chinamora, with other members of the Commission being Ms Elizabeth Rutsate, Mr Andrew Mataruse and Mr Oliver Mandipaka.\n\nThe commissions mandate is to receive from the public complaints of misconduct against members of the security services encompassing the Zimbabwe Republic Police (ZRP), Zimbabwe Defence Forces (ZDF), the Central Intelligence Organisation (CIO) and the Zimbabwe Prisons and Correctional Service (ZPCS).\n\nAfter receiving the complaints, the commission is expected to conduct investigations and make recommendations on the individual complaints.\n\nIn an interview, Mr Mandipaka said:The Zimbabwe IndependentComplaints Commission came into existence in compliance with Section 210 of the Supreme law of the country and the Commission derives its mandate from the enabling Zimbabwe Independent Complaints Commission Act .\n\nIn the exercise of our Constitutional mandate, the Commission will thrive to be as impartial, fair and Independent as guided by our values so that both the general public and our security services derive confidence in the manner in which we investigate and manage Complaints.\n\nWe have taken steps as a Commission to develop instruments and tools of the trade that will guide our investigating officers to gather evidence and carry out proper Investigations. Some of the investigators have wide experience and skill in the Investigations domain having served in the Police Service diligently for many years.\n\nThe Commission is barely eight months old and has already hit the ground running and as we participate for the first time at the ZITF, our primary objective is to market our services to the nation and create awareness about our existence, said Mr Mandipaka.\n\nFollow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-24-at-17.08.23_67333903-677x380.jpg",
            "description": "Mthabisi Tshuma, Online Writer THE Zimbabwe Independent Complaints Commission (ZICC) is among the first-time exhibitors at the 65th edition of the Zimbabwe International Trade Fair. With commissioners sworn in on September 19, 2024, the organisation was fostered by the Second Republic to ensure a culture of transparency and accountability among security services. ZICC is chaired by […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Zimbabwe to host 10th edition of the Africa and Indian Ocean Aviation Week",
            "url": "https://www.chronicle.co.zw/zimbabwe-to-host-10th-edition-of-the-africa-and-indian-ocean-aviation-week/",
            "content": "Judith Phiri,Business Reporter\n\nZIMBABWE is set to host the 10th edition of the Africa and Indian Ocean Aviation Week (AFI Week), an extensive annual aviation event organised by the International Civil Aviation Organisation (ICAO).\n\nThe event to be held from 26 to 30 May in Victoria Falls, serves as a vital platform for key aviation stakeholders across Africa to convoke, deliberate on strategies, review developments and address challenges.\n\nThe aviation sector also capitalise on the same platform to structure priorities that foster growth and sustainable development of the aviation industry in the entire region.\n\nIn an interview at the ongoing Zimbabwe International Trade Fair (ZITF) 2025, Airports Company of Zimbabwe (ACZ) ACZ public relations and communications manager Mr Tonderai Mangombe said preparations were well on course for AFI Week.\n\nWe are expecting more than 300 foreign delegates and 200 local delegates to bring the total to plus or minus 500 delegates all in all. 54 member country states are expected to be attending this event which will talk about challenges which are peculiar to Africa how we can grow our aviation industry in Africa and how we can tackle the challenges we have, he said.\n\nHe said the course of the AFI Week involves meetings, symposiums and workshops.\n\nACZ is a state-owned company responsible for acquiring, developing, maintaining, managing, controlling and operating airports in Zimbabwe, namely Robert Gabriel Mugabe International Airport, Joshua Mqabuko Nkomo International Airport and Victoria Falls International Airport.\n\nThese also include Buffalo Range Airport, Kariba Airport, Masvingo Airport, Hwange National Park Airport, Charles Prince Airport.\n\nACZ provides facilities and services for passengers, aircraft, baggage, and cargo, ensuring safety and security, and focusing on business development and commercial activities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/ACZ-680x380.jpg",
            "description": "Judith Phiri, Business Reporter  ZIMBABWE is set to host the 10th edition of the Africa and Indian Ocean Aviation Week (AFI Week), an extensive annual aviation event organised by the International Civil Aviation Organisation (ICAO). The event to be held from 26 to 30 May in Victoria Falls, serves as a vital platform for key aviation […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "WATCH: President Mnangagwa arrives in Bulawayo for the 65th edition of the ZITF",
            "url": "https://www.chronicle.co.zw/watch-president-mnangagwa-arrives-in-bulawayo-for-the-65th-edition-of-the-zitf/",
            "content": "Rutendo Nyeve,Online Reporter\n\nPRESIDENT Mnangagwa has touched down at Joshua Mqabuko Nkomo International Airport on Thursday ahead of the highly anticipated official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF).\n\nPresident Mnangagwa touched down shortly before 3pm.\n\nHe was welcomed by the countrys two Vice Presidents Chiwenga and Mohadi, the Minister of State for Provincial Affairs and Devolution Judith Ncube, the Minister of Defence and Security Cde Oppah Muchinguri-Kashiri, the Zimbabwean Ambassador to Mozambique Victor Matemadanda, several Ministers, Service Chiefs and senior party and Government officials.\n\nUpon arrival scores of enthusiastic party supporters waved banners and chanting slogans underscoring the significance of the President at the ZITF, a cornerstone event in Zimbabwes economic calendar.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-24-at-15.19.26.jpeg",
            "description": "Rutendo Nyeve, Online Reporter PRESIDENT Mnangagwa has touched down at Joshua Mqabuko Nkomo International Airport on Thursday ahead of the highly anticipated official opening of the 65th edition of the Zimbabwe International Trade Fair (ZITF). President Mnangagwa touched down shortly before 3pm. He was welcomed by the country’s two Vice Presidents Chiwenga and Mohadi, the Minister […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "WATCH: Media must not be proxies for external political interference",
            "url": "https://www.chronicle.co.zw/watch-media-must-not-be-proxies-for-external-political-interference/",
            "content": "Raymond Jaravaza, Online Reporter\n\nTHE media must not be used as proxies for external political machinations and a vehicle for sponsored narratives that undermine Zimbabwes national values.\n\nThis was said by the Deputy Minister of Information, Publicity and Broadcasting Services Dr Omphile Marupi while officially opening the ZITF Media Indaba at the National Gallery of Zimbabwe in Bulawayo on Thursday.\n\nDeputy Minister Marupi said that with the well-known sponsors of fake news in Africa withdrawing their funding, an opportunity had risen for the Africa story to be told and protected.\n\nThe media resides at the centre of producing ideas and impressions which enhance or may have the capacity to dismantle a nations reputation. The media and Government must be able to find points of mutual convergence in the positive image construction of the nation, said Deputy Minister Marupi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gfvdg-1-680x360.jpg",
            "description": "Raymond Jaravaza, Online Reporter THE media must not be used as proxies for external political machinations and a vehicle for sponsored narratives that undermine Zimbabwe’s national values. This was said by the Deputy Minister of Information, Publicity and Broadcasting Services Dr Omphile Marupi while officially opening the ZITF Media Indaba at the National Gallery of […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "WATCH: ZITF Media Indaba kicks off in Bulawayo",
            "url": "https://www.chronicle.co.zw/watch-zitf-media-indaba-kicks-off-in-bulawayo/",
            "content": "Online Reporter\n\nScenes from the ZITF Media Indaba that has kicked off at the National Gallery of Zimbabwe in Bulawayo on Thursday.\n\nThe Indaba is running under the theme: Growing the Media Sector for Zimbabwe Industrial Development.\n\nMinister of Information, Publicity and Broadcasting Services Dr Jenfan Muswere is expected to officially open this years ZITF Media Indaba.\n\nDeputy Minister Honourable Omphile Marupi and Permanent Secretary Mr Nick Mangwana are part of the high-level officials at the Indaba.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/jhbgCFD-680x360.jpg",
            "description": "Online Reporter Scenes from the ZITF Media Indaba that has kicked off at the National Gallery of Zimbabwe in Bulawayo on Thursday. The Indaba is running under the theme: Growing the Media Sector for Zimbabwe Industrial Development. Minister of Information, Publicity and Broadcasting Services Dr Jenfan Muswere is expected to officially open this year’s ZITF […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "VP Chiwenga calls for industry-university collaboration to drive innovation",
            "url": "https://www.chronicle.co.zw/vp-chiwenga-calls-for-industry-university-collaboration-to-drive-innovation/",
            "content": "Sikhumbuzo Moyo\n\nVICE President Constantino Chiwenga has called on the industry to utilize the innovative talent at the countrys universities and technical colleges in order to solve whatever operational problem them may be facing in their operations.\n\nThe Vice President said this in an interview after touring various stands, many of them exhibiting innovative displays, at the Zimbabwe International Exhibition Centre today.\n\nVice President Chiwenga said what was now required is a collaboration and proper integration between industry and institutions of higher education.What I have seen is what we are advocating. We want our institutions to get involved with students who are in these universities across the country, use their talents. And we have seen quite a lot of innovative ideas, some which are in the initial stage, but some which are already at the finishing stage, almost ready to go for commercialization, Vice President Chiwenga said.\n\nHe said Government wants to see the industry going to the universities and technical colleges, with their problems, be it manufacturing or be it an industrial setup and present to the tertiary institutions.Industry must be able to say to these institutions, this is what I would want to achieve. And then give it to the students, rather than the students just to dream and have something on their own which maybe not fit in the current industrial setup and this is what we have been promoting, said VP Chiwenga.\n\nThe Vice President also challenged the private sector to be proactive and fund the innovations since they will be the major beneficiaries of the finished products.When I opened the business forum yesterday and went to the research council in Zimbabwe I said the private sector, the industry itself, must now come on board because they are the beneficiaries and they must sponsor, not for Government alone to carry the burden because it is them who are going to benefit, they must sponsor the talented students and then the students do what they are supposed to do, said VP Chiwenga.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-24-at-13.06.11-680x380.jpeg",
            "description": "Sikhumbuzo Moyo VICE President Constantino Chiwenga has called on the industry to utilize the innovative talent at the country’s universities and technical colleges in order to solve whatever operational problem them may be facing in their operations. The Vice President said this in an interview after touring various stands, many of them exhibiting innovative displays, […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "WATCH: Zimbabwe airports see surge in passengers during Trade Fair in Bulawayo",
            "url": "https://www.chronicle.co.zw/watch-zimbabwe-airports-see-surge-in-passengers-during-trade-fair-in-bulawayo2/",
            "content": "Judith Phiri, Business Reporter\n\nTHE Airports Company of Zimbabwe (ACZ) has commended traffic at airports around the country during the Zimbabwe International Trade Fair (ZITF) 2025 week.\n\nThe 65th edition of the premier trade showcase kicked off on Monday and ends on Saturday at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo.\n\nIn an interview with Zimpapers Business Hub, ACZ public relations and communications manager Mr Tonderai Mangombe said they were excited about the traffic witnessed this week.\n\nZITF is one of the important events on the countrys calendar and that of Bulawayo. As ACZ we are direct beneficiaries of ZITF. People use our airports and with the number of foreign exhibitors participating this year, the traffic was quite high, he said.\n\nHe said locals travelling from different parts of the country such as Harare and Victoria Falls were also flying into Bulawayo for ZITF.\n\nMr Mangombe said they were well prepared for the increased traffic and ensured that they provided world-class standards.\n\nACZ has expressed confidence in the business opportunities presented by this years edition of ZITF.\n\nRunning under the theme Industrialisation: Crafting an Integrated Economic Landscape, this years trade fair will generate significant economic activity, benefiting businesses across various sectors, including aviation.\n\nZITF 2025 brings a surge of economic activity to Bulawayo, and the influx of visitors during the trade fair significantly boosts local businesses, with some operators depending on ZITF-generated revenue to sustain operations throughout the year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hbjk.jpg",
            "description": "Judith Phiri, Business Reporter THE Airports Company of Zimbabwe (ACZ) has commended traffic at airports around the country during the Zimbabwe International Trade Fair (ZITF) 2025 week. The 65th edition of the premier trade showcase kicked off on Monday and ends on Saturday at the Zimbabwe International Conference and Exhibition Smart City (ZICES) in Bulawayo. […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Two more Beitbridge border officials arrested in corruption sting during Easter period",
            "url": "https://www.chronicle.co.zw/two-bore-beitbridge-border-officials-arrested-in-corruption-sting-during-easter-period/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nSouth Africas Border Management Authority (BMA), working with other security agents, has arrested two more staff members at the Beitbridge Port of Entry (PoE) on corruption-related charges.\n\nThe duo was arrested during a recent sting operation after taking a bribe from a human smuggler transporting five illegal migrants in an overloaded vehicle during the just-ended Easter period.\n\nIn a statement, BMA spokesperson Deputy Assistant Commissioner Mmemme Mogotsi said the suspects were aged 61 and 44, respectively.\n\nIn a concerted effort to root out corruption and strengthen the integrity of South Africas ports of entry operations, the Border Management Authority (BMA) conducted a successful, intelligence-driven operation at the Beitbridge Port of Entry during the Easter period, she said.\n\nThe operation led to the arrest of two BMA Immigration officials, five undocumented foreign nationals, and two suspected facilitators involved in the alleged unlawful entry of persons into the Republic and contravention of the Immigration Act.\n\nThe operation, executed on Tuesday, 22 April 2025 at approximately 09:00, was led by two Executive members of the BMA following extensive movement monitoring and the deployment of advanced technological surveillance at the port. After confirming suspicious behaviour, the Executives immediately contacted the South African Police Service (SAPS) Detectives in Musina, the Limpopo Provincial Anti-Corruption Unit, and the Local Criminal Record Centre (LCRC) to process the case further.\n\nThe official said during the operation, the Executives observed a white Mercedes-Benz taxi parked near a shop at the port, where the two BMA Immigration officials were seen engaging with the facilitator and subsequently allowing it to pass through, allegedly after receiving a bribe.\n\nShe said the vehicle was intercepted shortly thereafter and was found transporting 18 passengers, 13 of whom held valid travel documents, while five were undocumented foreign nationals.\n\nA female passenger and the taxi driver, believed to have facilitated the illegal entry, were also arrested.\n\nAll nine suspects were charged with corruption and appeared before the Musina Magistrates Court on Wednesday, 23 April 2025. The five undocumented individuals face additional charges under the Immigration Act. The case has been postponed to Thursday, 24 April 2025 for a formal bail application, said Deputy Asst Comm Mogotsi.\n\nShe said the BMA has since suspended the two implicated officials, pending the outcome of both internal disciplinary processes and the criminal investigation.\n\nActing Commissioner of the BMA, Ms Jane Thupana, has commended the proactive involvement of the BMA Executive team on the ground and reaffirmed the Authoritys commitment to cleaning up the system.\n\nThis operation reflects the BMAs firm stance against corruption within its ranks. I applaud the Executive members for leading from the front and taking decisive action to restore integrity at one of our busiest ports. We are resolute in disrupting illegal facilitation networks and holding every official accountable to the highest standards of conduct, she said.\n\nThe operation strengthens the BMAs resolve to roll out Body-Worn Cameras (BWCs) across all ports of entry. This Easter period, 40 body cameras were deployed across various sites, enhancing monitoring capabilities and supporting real-time accountability.\n\nThe implementation of body cameras is not just about oversight  its about protecting both the official and the public and ensuring that every interaction at our ports is transparent, lawful, and traceable.\n\nThe Acting Commissioner said with increased movements expected during the return leg of the Easter travel period, the BMA continues to intensify its operational presence at ports and along the borderline, with a strong focus on intercepting illegal movement and dismantling facilitation syndicates.\n\nCases of corruption at South Africas borders have become rife, with that countrys Home Affairs Minister Leon Schreiber announcing recently that his ministry had, between July last year and February this year, fired 27 officials on corruption and fraud-related charges committed inland and at ports of entry as the fight against corruption gathers momentum.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-24-at-11.58.57-680x380.jpeg",
            "description": "Thupeyo Muleya, Beitbridge Bureau South Africa’s Border Management Authority (BMA), working with other security agents, has arrested two more staff members at the Beitbridge Port of Entry (PoE) on corruption-related charges. The duo was arrested during a recent sting operation after taking a bribe from a human smuggler transporting five illegal migrants in an overloaded […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "UK firm secures US$5m to fund gold mines in Zimbabwe",
            "url": "https://www.chronicle.co.zw/uk-firm-secures-us5m-to-fund-gold-mines-in-zimbabwe/",
            "content": "Business Reporter\n\nUNITED Kingdom (UK)-headquartered Kavango Resources, which operates gold mines in Zimbabwe, has secured a US$5 million interest-free facility from the Comarton Managed Pension Funds Investments Consortium for mine development, including building a gold processing facility.\n\nThe funding provides a stepping stone to listing on the US dollar-denominated Victoria Falls Stock Exchange.Importantly, investment will help develop new gold production capacity in a country largely dependent on bullion exports, the countrys single largest export earner.\n\nIn 2025, Zimbabwe has set an ambitious goal of producing 40 tonnes of gold. This follows a record 36,48 tonnes produced in 2024.\n\nMr Ben Turney, the groups chief executive, said central to its strategy in Zimbabwe was to promote local shareholder ownership that allows citizens to participate in their future success through long-term equity investment.\n\nThe transaction sends a strong message that Zimbabwe is open for business. We look forward to this investment acting as a cornerstone for our introduction to the Victoria Falls Stock Exchange a little later this summer, he said in a joint statement.\n\nMr Turney said the consortium was an influential group of individual pension funds in Zimbabwe that collaborate on investments.\n\nHe said the 28 consortium members had made the decision to invest in equities and indicated their intention to participate in the Kavango investment facility.\n\nAs part of a rigorous due diligence, several consortium members and members of the investment The committee conducted site visits to review Kavangos gold projects. It reflects the strong progress our team has made in less than two years of operations in Zimbabwe, that we successfully passed this process.\n\nWe now intend to use the Comarton funds for mine development and construction of our first gold processing plant, he said.\n\nMr Turney said Kavango planned to bring Prospects 1, 3 and 4 phases at the Hillside Project into production over the next 12 months, using modern mechanised mining.\n\nOperating through its Zimbabwean subsidiary, Kavango Zimbabwe, established in July 2023, the company is targeting several historically high-grade gold mines in the Matabeleland region, focusing on economic bulk mining.\n\nMr Richard Muirimi, the group managing director of Comarton Consultants (Private) Limited (Comarton), said the consortium was excited after securing a partner for its fourth investment, the mining sector, having already successfully executed on the targeted property sector, tourism and agriculture sectors.\n\nHe said the partnership with Kavango answered the key consortium investment focus of bedding the actual asset in hard currency, benefiting from potential capital growth and generation of long-term hard currency free cash flows, and contributing to the development of sustainable businesses that create employment and other benefits for Zimbabwean citizens.\n\nWith a firm focus on ensuring all four quadrants generate hard currency cash flows, this partnership will contribute to the enhancement of the payment of hard currency quarterly in USD pensions on the Comarton portfolio being implemented from 1 January 2025, he said.\n\nAccording to the convertible loan note structure, the convertible facility can be drawn down by the company over a twelve-month period in three tranches.\n\nTranche 1 entails at least US$500 000 payable in US dollars and to be drawn down immediately for mine development in Zimbabwe.\n\nOn Tranche 2, US$1,5 million equivalent was paid through conversion of Zimbabwe Gold, the official currency of Zimbabwe, into US dollars at the Bank of Englands exchange rate via the Reserve Bank of Zimbabwe to be drawn down over the next 12 months for the import of mining equipment for Kavango into Zimbabwe.\n\nFinally, tranche 3: US$3 million paid in US dollars will be drawn down over the next 12 months for mine development in Zimbabwe.\n\nAll the funds raised through the convertible will be used for mine development in Zimbabwe and the importation of mining equipment into the country.\n\nKavango is exploring for gold deposits in Zimbabwe that have the potential to be brought into production, and the company is targeting both open-pit and underground opportunities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-24-at-11.04.29.jpeg",
            "description": "Business Reporter UNITED Kingdom (UK)-headquartered Kavango Resources, which operates gold mines in Zimbabwe, has secured a US$5 million interest-free facility from the Comarton Managed Pension Funds’ Investments Consortium for mine development, including building a gold processing facility. The funding provides a stepping stone to listing on the US dollar-denominated Victoria Falls Stock Exchange. Importantly, investment […]",
            "time": "21:46",
            "date": "24 Apr 2025"
        }
    ]
}