{
    "news": [
        {
            "title": "Direct local resources towards fighting outbreaks: President",
            "url": "https://www.chronicle.co.zw/direct-local-resources-towards-fighting-outbreaks-president/",
            "content": "Garikai Fadzi in ADDIS ABABA, Ethiopia\n\nTHE African continent should direct more local resources towards fighting outbreaks of diseases such as cholera, mpox and marburg, President Mnangagwa has said.\n\nAddressing the High-Level Meeting on Domestic Health Financing here yesterday, the President highlighted that on its part, Zimbabwe was working on ensuring at least 13 percent of its annual budget is directed towards the health sector in line with the Abuja Declaration.\n\nThe High-Level Meeting on Domestic Health Financing encourages domestic investment in the sector appropriately so that each country can pursue its path to achieving and sustaining universal health coverage.\n\nI am pleased my Governments allocation towards health has increased significantly, from 9,8 percent of the national budget in 2024 to 13,01 percent in 2025, as we move towards the 15 percent Abuja target, he said.\n\nThe President unpacked some of the innovative ways Zimbabwe has adopted in raising revenue for the health sector.\n\nHe said Zimbabwe has successfully introduced innovation tax regimes towards the health sector, including the Health Levy, which is a mobile airtime tax, and the sugar tax for beverages, to combat the increasing burden of non-communicable diseases.\n\nMost recently, we have introduced a fast-food tax to further support our health initiatives and act as a negative incentive for the consumption of fast foods, said President Mnangagwa.\n\nRwanda President Paul Kagame is the African Union Domestic Health Financing champion.\n\nThe meeting came at a time when most African countries say their health sectors are at risk of challenges following an Executive Order signed by United States President Donald Trump, withdrawing from the World Health Organisation (WHO) and immediately stopping foreign assistance for 90 days.\n\nUS President, Donald Trump\n\nHealth budgets on the continent were cushioned by aid, especially from US agencies, and its suspension is expected to bring challenges to many countries, hence the call for nations to focus on domestic resource mobilisation.\n\nOn its part, Zimbabwe has indicated that it will use taxes on alcohol, cigarettes, fast food, and sugary beverages, commonly known as sin taxes, to cover health sector needs.\n\nHealth and Child Care Deputy Minister, Sleiman Kwidini, recently told legislators in Parliament that the situation of health funding following the suspension of donations from the US was under control.\n\nEarlier in the day, President Mnangagwas hectic schedule had seen him receiving Sheik Shakhboot Al Nayan, Minister of State of the United Arab Emirates.\n\nThe Emirati visited President Mnangagwa at his hotel.\n\nZimbabwean President Emmerson Mnangagwa.\n\nUAE is presently Zimbabwes second largest trading partner behind South Africa.\n\nSpeaking after the meeting, Foreign Affairs and International Trade Minister, Professor Amon Murwira, described relations between Zimbabwe and the UAE as solid, ever since the two countries opened embassies in each others capitals in 2018 and 2019.\n\nOur number one trading partner is South Africa and now our number two trading partner is UAE, he said.\n\nZimbabwe exports precious minerals and agricultural products while importing manufactured goods and essential commodities from the UAE.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/1a1ssd.jpg",
            "description": "Garikai Fadzi in ADDIS ABABA, Ethiopia THE African continent should direct more local resources towards fighting outbreaks of diseases such as cholera, mpox and marburg, President Mnangagwa has said. Addressing the High-Level Meeting on Domestic Health Financing here yesterday, the President highlighted that on its part, Zimbabwe was working on ensuring at least 13 percent […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Mass send-off for 25 crash victims in Beitbridge",
            "url": "https://www.chronicle.co.zw/mass-send-off-for-25-crash-victims-in-beitbridge/",
            "content": "Thupeyo muleya, Beitbridge Bureau\n\nTHREE Government ministers yesterday joined mourners at a mass send-off for the 25 people who tragically lost their lives in a head-on collision between a bus and a lorry on the Beitbridge-Masvingo road last Thursday.\n\nLocal Government and Public Works Minister, Daniel Garwe, his Transport and Infrastructural Development counterpart, Felix Mhona, and Matabeleland South Provincial Affairs and Devolution Minister, Dr Evelyn Ndlovu, also visited the site of the bus accident and survivors receiving treatment at Beitbridge District Hospital.\n\nThe memorial services were held at Doves Funeral Services parlour, where scores of relatives and residents gathered. A sombre atmosphere enveloped the parlour as the community mourned the horrific crash.\n\nHearses from Doves wait to ferry the remains of the 25 bus accident victims in Beitbridge\n\nMinister Garwe, who also oversees civil protection matters, said the Government was deeply saddened by the crash and pledged support for the bereaved families.\n\nWe express our condolences and we will do everything necessary to assist the bereaved families so that they may bury their departed relatives. We are here with a message from President Mnangagwa about his deepest sorrow over the loss of lives by fellow Zimbabweans.\n\nSo far, as the ministry in charge of civil protection matters, we have written to the President requesting that he declares this accident a state of disaster. Feedback will come in due course, he said.\n\nHe said families had been assisted with coffins, burial documentation, food, and transportation of the deceased from Beitbridge to various burial sites. The minister said it was saddening that most families had lost breadwinners and young people.\n\nThe eldest among the deceased was around 56 years old and many were below 30. This is quite sad for us as a nation, he said.\n\nMinister Mhona said he had directed all enforcement departments under his ministry to conduct a full investigation into the accident and take appropriate action.\n\nWe are investigating the circumstances surrounding this tragedy, and necessary measures will be taken to prevent such incidents in the future. We are grieving and we want to thank our great leader President, Cde Dr Emmerson Dambudzo Mnangagwa, who is also grieved and has stated in his statement that as authorities we must take action.\n\nSo together with other enforcers, we dont take this lightly and we cant continue to tolerate lawlessness on our roads. I have tasked the road motor transportation department to take charge and make sure that we get to the bottom of this accident and we will not focus on this incident alone.\n\nLocal Government and Public Works Minister, Cde Daniel Garwe addressing mourners during a mass send-off yesterday. Looking on is Transport and Infrastructure Development Minister, cde Felix Mhona\n\nHe said that through various government agencies, the Ministry of Transport would continue to educate motorists and road users on the importance of adhering to road rules and regulations. The minister also commended the Beitbridge community for their assistance during the accident, ferrying victims to the hospital and offering support to survivors and medical staff at Beitbridge District Hospital.\n\nDr Ndlovu said Matabeleland South was in deep mourning. She wished the injured a speedy recovery and assured them that her office would visit those receiving treatment at Gwanda and United Bulawayo Hospitals.\n\nPresident Mnangagwa expressed his condolences and announced that the deceased would receive State-assisted funerals.\n\nZimbabwe Passengers Transport Organisation (ZPTO) chairman, Dr Samson Nhanhanga, offered condolences and called on public transport operators to address speeding. He also donated US$11 000 to the Government to assist with burials.\n\nSpeed has become our worst enemy. We continue urging our drivers to adhere to good road driving ethics, he said.\n\nSome of the relatives and mourners who attended the send-off\n\nThe Insurance Council of Zimbabwe said it would cover medical and funeral expenses for all passengers, while the Traffic Safety Council has provided hampers to those hospitalised.\n\nThe local business community, including the mayor of Beitbridge, Councillor Peter Pirato Mafuta, have donated fuel, ambulances, and other consumables.\n\nBeitbridge district medical officer, Dr Lenos Samhere, said they currently had 29 patients at the hospital.\n\nWe have 15 in the female ward and 14 in the male ward. Those who were in critical condition were transferred to Gwanda Provincial Hospital and United Bulawayo Hospitals, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/aaa.jpg",
            "description": "Thupeyo muleya, Beitbridge Bureau THREE Government ministers yesterday joined mourners at a mass send-off for the 25 people who tragically lost their lives in a head-on collision between a bus and a lorry on the Beitbridge-Masvingo road last Thursday. Local Government and Public Works Minister, Daniel Garwe, his Transport and Infrastructural Development counterpart, Felix Mhona, […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Bennet Ton fires Zimbabwe",
            "url": "https://www.chronicle.co.zw/bennet-ton-fires-zimbabwe/",
            "content": "Brandon Moyo,[emailprotected]\n\nBRIAN Bennett announced himself as a star of the future with a record-breaking maiden One Day International (ODI) century, propelling Zimbabwe to a 49-run victory over Ireland at Harare Sports Club yesterday.\n\nThe 21-year-old, promoted to open the batting for the series opener, scored a scintillating 169 off 163 balls. This feat made him the second youngest Zimbabwean centurion in ODI cricket after Sean Ervine against India in 2004. He joins an elite group of Zimbabwean batsmen including Dion Ebrahim, Alistair Campbell and Vusi Sibanda.\n\nHis 169 runs is now the fifth highest individual score for Zimbabwe in this format, trailing only Charles Coventry (194 vs Bangladesh in 2009), Hamilton Masakadza (178 vs Kenya in 2009), Sean Williams (174 vs USA in 2023) and Craig Wishart (172 vs Namibia in 2003).\n\nBrian Bennett\n\nBennett also featured in the fourth highest second-wicket partnership for Zimbabwe in ODIs, alongside skipper Craig Ervine (136 runs). This partnership is surpassed only by Williams and Joylord Gumbie (160 vs USA in 2023), Gavin Rennie and Grant Flower (150 vs Kenya in 1997), and Travis Friend and Campbell (146 vs Kenya in 2002).\n\nIn just his seventh ODI for Zimbabwe, the youngster came within four runs of becoming only the second Zimbabwean batsman to carry his bat, a feat first achieved by Flower against England in 1994.\n\nZimbabwe, put in to bat, were restricted to 299/5 in their 50 overs. They then bowled out Ireland for 250 in 46 overs. Johnathan Campbell made his ODI debut for Zimbabwe.\n\nBennett and Ben Curran opened the batting, with Curran falling in the 19th over for 28 runs, after a 95-run opening partnership. The record-breaking second-wicket stand was broken by Graham Hume, who had Craig Ervine caught for 66 off 61 balls. It was the skippers 22nd ODI half-century. Sikandar Raza and Wessly Madhevere both fell for eight runs.\n\nBennetts brilliant innings ended with four balls remaining in the innings. Mark Adair, who took Bennetts wicket, finished with figures of 2/55 from 10 overs. Josh Little, Hume and Andy McBrine each took one wicket for Ireland.\n\nDefending the 300-run target, Zimbabwe made a dream start, with Richard Ngarava striking with the first ball, dismissing Andy Balbirnie for a golden duck. Zimbabwe continued to take wickets at regular intervals, preventing Ireland from building momentum.\n\nBlessing Muzarabani was the pick of the Zimbabwean bowlers, with impressive figures of 4/51 from nine overs. His pace-bowling partner, Richard Ngarava, took 3/56 from nine overs. Madhevere also bowled well, taking two wickets for 12 runs from two overs. Raza claimed the other wicket.\n\nCurtis Campher top-scored for Ireland with 44 off 57 balls, while Harry Tector made 39 off 78 balls. George Dockrell scored 34 off 35 balls, and Paul Stirling contributed 32 off 28 balls.Zimbabwe now lead the three-match series 1-0.The second match is scheduled for tomorrow at the same venue.  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Brian-Bennett-and-Clive-Madande-in-celebrate-a-wicket-against-Bangladesh.jpg",
            "description": "Brandon Moyo, Brandonmalvin9@gmail.com BRIAN Bennett announced himself as a star of the future with a record-breaking maiden One Day International (ODI) century, propelling Zimbabwe to a 49-run victory over Ireland at Harare Sports Club yesterday. The 21-year-old, promoted to open the batting for the series opener, scored a scintillating 169 off 163 balls. This feat made […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Abseiling adventure unveils hidden beauty… Victoria Falls from below",
            "url": "https://www.chronicle.co.zw/abseiling-adventure-unveils-hidden-beauty-victoria-falls-from-below/",
            "content": "Leonard Ncube,[emailprotected]\n\nVICTORIA FALLS, famed worldwide for its majestic curtain of water cascading into the Zambezi River gorge, offers a breathtaking panorama from above. But for those craving a more intimate encounter with this natural wonder, theres abseiling  an adventure that brings you face-to-face with its raw power from a completely different perspective, at the bottom of the gorge.\n\nThe thrilling activity offers tourists the unique opportunity to descend into the depths below the falls, where the roar of the water and the misty spray envelop them in the heart of the landscape. While the view from the top is undoubtedly awe-inspiring, abseiling allows adventurers to explore the falls beauty from a vantage point few ever experience, fostering a deeper appreciation of their scale and grandeur. Its an experience that blends adrenaline with nature, revealing the hidden beauty of this iconic landmark from below.\n\nSince its introduction in 2019, before a sudden closure due to the global Covid-19 pandemic, abseiling has rapidly become synonymous with Victoria Falls, attracting visitors from across the globe.James Chinotimba, who operates an abseiling company in the resort city, explains that abseiling offers the ultimate Victoria Falls experience.\n\nAbseiling is an adrenaline activity, a complete package where people descend into the gorge to enjoy the view of the Victoria Falls from their base, he says.\n\nChinotimba, an experienced operations and retail manager who spent years in South Africa before returning to Victoria Falls to venture into the hospitality industry, draws on his diplomas in education and business studies to run his businesses.Abseiling in Victoria Falls brings visitors up close and personal with nature, enjoying the view from the gorge floor.\n\nPeople descend with confidence. Theyre harnessed with equipment strong enough to hold an elephant. Safety is paramount, and clients receive a thorough safety briefing before deciding to descend. There are two dedicated lines, and if someone is willing but nervous, they are accompanied by a jump master.\n\nAt the bottom, a guide will detach the harness, allowing clients to freely enjoy the breathtaking views of the Zambezi River, the Falls, rapids, Victoria Falls Bridge, the Boiling Pot, and jet boats. People visit the Rainforest, but they dont realise the beauty that lies at the bottom of the gorges, Chinotimba said.\n\nEmmanuel Akot\n\nAbseiling began in 2019 but was interrupted by the pandemic. The activity reopened last year, and Chinotimba reports an overwhelming response, with clients travelling from all corners of the world to experience this rare activity. Its also popular with the local market, especially from Bulawayo and Harare.\n\nAbseiling has made a significant contribution to tourism, said Chinotimba.During his recent visit to Victoria Falls, 11-year-old Ugandan Pan-Africanist Emmanuel Akot, who aspires to be the future President of a United Africa, tried abseiling during a tour of the Rainforest with Tourism and Hospitality Industry Deputy Minister Tongai Mnangagwa.\n\nBrighton Munaku, an abseiling marketer for a company in Victoria Falls highlights the positive influence of social media on making abseiling popular.\n\nMost people were unaware of the product, and now they are beginning to understand that there is an activity that allows them to see the Victoria Falls from the bottom of the gorge.\n\nThe media has played a significant role, and we are doing everything to market Victoria Falls to the world. Whenever we take pictures, we showcase the backdrop of Victoria Falls  the armchair, the gorge, the rapids, Knife Edge Island, and everything that can be seen from inside the gorge  so people can appreciate the beauty.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/eee.jpg",
            "description": "Leonard Ncube, leonard.ncube@chronicle.co.zw VICTORIA FALLS, famed worldwide for its majestic curtain of water cascading into the Zambezi River gorge, offers a breathtaking panorama from above. But for those craving a more intimate encounter with this natural wonder, there’s abseiling — an adventure that brings you face-to-face with its raw power from a completely different perspective, […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Brothers get life for taxi driver murder",
            "url": "https://www.chronicle.co.zw/brothers-get-life-for-taxi-driver-murder/",
            "content": "Peter Matika,[emailprotected]\n\nTWO brothers have been sentenced to life imprisonment for the brutal murder of an Entumbane taxi driver last June. Justice Namato Mutevedzi handed down the sentence after the pair were found guilty of killing Christopher Dama before stealing his Honda Fit. They received an additional 20 years for the robbery.\n\nDama was a prominent figure in Entumbane suburb, where he used to have regular shifts at a local sports bar.\n\nThe court ruled that the crime was premeditated and committed during the course of a robbery.\n\nThe two accused, Ketai Nhanha and Jenfat Manamike, both from Gokwe, were arrested last year for the gruesome murder of Dama, which shocked the Entumbane community.\n\nThe two were convicted of murder and robbery after a full trial.\n\nNhanha denied the charge of murder but admitted to the charge of robbery while Manamike pleaded not guilty to both charges.\n\nThe accused murdered Dama along Emcwazini Road in the Figtree area, Bulilima district in Matabeleland South on the night of June 19. The pair axed Dama several times on the head and neck before driving away in his car, leaving his body in the bush.\n\nDamas body was discovered by a villager who alerted the police.\n\nNhanha was arrested by Gwanda CID officers on 25 June following a tip-off after he was seen driving the stolen Honda Fit.\n\nProsecuting, Thobekani Nyathi told the court that Dama was 34 years old at the time he was gruesomely murdered. He said the late Dama was approached by the pair under the pretext of hiring his taxi for a trip from Bulawayo to Mncwazi Village.\n\nMr Nyathi said that during the journey, just before the tollgate along the Bulawayo-Plumtree Highway, the pair directed Dama to a bushy area off the road. There, they axed him in the back of the head.\n\nAfter the gruesome murder, the suspects drove the deceaseds car back to his home in Entumbane, where they collected a bag containing some clothes before driving off.\n\nMr Tinashe Tashaya of Sengweni Legal Service represented Nhanha, while Miss Kathleen Mpofu of Webb Law and Barry represented Manamike.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw TWO brothers have been sentenced to life imprisonment for the brutal murder of an Entumbane taxi driver last June. Justice Namato Mutevedzi handed down the sentence after the pair were found guilty of killing Christopher Dama before stealing his Honda Fit. They received an additional 20 years for the robbery. Dama was […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Empty stands, empty pockets: Can ticket price hikes save Zimbabwe football?",
            "url": "https://www.chronicle.co.zw/empty-stands-empty-pockets-can-ticket-price-hikes-save-zimbabwe-football/",
            "content": "Innocent Kurira,[emailprotected]\n\nFOR years, gate receipts have been the lifeblood of Zimbabwes top football clubs. However, rising costs and dwindling attendances due to poor performances and uninspiring football has seen big clubs such as Highlanders, Dynamos and Caps United struggling to attract crowds.\n\nThe big clubs financial troubles are well-known. Just this past week, Highlanders needed businessman Wicknell Chivhayos assistance to settle a debt while Dynamos players went on strike over unpaid salaries. Highlanders has however, fared slightly better in terms of attracting fans compared to Dynamos and Caps United but the numbers are nowhere near what they were in the past.\n\nDynamos, with their loyal supporters in Harare and Highlanders representing the vibrant Bulawayo community, have long been a source of pride for their respective fans. The clubs must however, innovate if they are to survive the challenging landscape.\n\nCan these clubs once again attract huge crowds to their games such that they can sustain themselves from gate takings? The other alternative is to increase gate charges. While this might seem controversial, several reasons suggest it could be a viable option for the three clubs with the largest followings.\n\nFirstly, ticket prices in Zimbabwean football have remained relatively low compared to the costs of running a professional club. It is US$3 for regular entry and US$5 for selected games. With rising costs of transport, equipment and player salaries, the gate charges are simply not enough to cover these increasing expenses.\n\nFootball is a product and like any other product as prices rise in the market, the cost of watching a game should also increase. A modest increase in ticket prices could help bridge the financial gap and ensure clubs have the required resources to survive.\n\nAn increase in the prices of tickets could enable authorities to improve facilities at stadia.Improved seating facilities, enhanced security and other modern stadium facilities could result in large crowds attending games. Clubs could also explore introducing VIP packages or premium seating for those seeking a more exclusive experience.\n\nHowever, increasing gate charges must be approached carefully to avoid alienating fans, particularly those already struggling to raise money to attend matches. A gradual increase and fans engagement could help mitigate any potential backlash. Clubs could also consider offering discounted tickets for students, children and pensioners to ensure as many people attend matches.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/11/Empty-stadium.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw FOR years, gate receipts have been the lifeblood of Zimbabwe’s top football clubs. However, rising costs and dwindling attendances due to poor performances and uninspiring football has seen big clubs such as Highlanders, Dynamos and Caps United struggling to attract crowds. The big clubs’ financial troubles are well-known. Just this past week, […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Midlands hails decentralisation of Independence Day celebrations",
            "url": "https://www.chronicle.co.zw/midlands-hails-decentralisation-of-independence-day-celebrations/",
            "content": "Patrick Chitumba,[emailprotected]\n\nTHE Midlands Province has thanked President Mnangagwa for his forward-thinking decision to decentralise Independence Day celebrations, enabling provinces to host the main event. This initiative reflects the Second Republics Devolution and Decentralisation Policy, designed to boost local development and growth.\n\nThis was stated by the Minister of State for Midlands Provincial Affairs and Devolution, Owen Ncube, after touring WhaWha Medium Prison in Gweru yesterday. He said that by hosting national events, provinces like Midlands can tap into opportunities for infrastructure development, such as road rehabilitation and construction, as well as enterprise development in key sectors like transport, retail, tourism, and hospitality. This, in turn, can drive provincial gross domestic product (GDP) growth and stimulate local economies.\n\nThe decision to host the 2025 Independence Day celebrations in Nembudziya, Midlands Province, is evidence of this vision, as the event is expected to bring substantial infrastructural development to the region, promoting inclusive development and growth. WhaWha Prison is one of the heritage sites in the Midlands Province targeted for rehabilitation in preparation for the National Independence Day celebrations to be held in Gokwe North at Nembudziya.\n\nThe Midlands Province appreciates President Mnangagwas profound and bold decision to decentralise Independence Day celebrations to provinces in line with the Second Republics Devolution and Decentralisation Policy. Hosting national events avails opportunities for infrastructure development, as well as enterprise development in the areas of transport, retail, tourism, and hospitality industry, among other GDP growth anchors in our province, said Minister Ncube.\n\nPresident Mnangagwa\n\nHe said the visit to the indelible historical site, which provides insight into the brutality of colonialists and the painful fight for freedom and independence, follows his similar tour of Mtapa Hall and Connemara Open Prison to assess and monitor progress on the implementation of the planned scope of works spearheaded by the National Museums and Monuments of Zimbabwe and Public Works, with support from other Government departments and the private sector.\n\nDuring the liberation struggle, WhaWha Prison was a major detention centre for political activists, nationalists, and all people suspected by the white minority regime of supporting the liberation struggle, he said.\n\nOther equally brutal detention centres established by the colonial regime, Minister Ncube said, include Gonakudzingwa in Gonarezhou National Park in Chiredzi and Sikombela in Gokwe South, here in the Midlands Province, where prisoners were tortured and treated in a dehumanising manner.\n\nThe minister noted that WhaWha was the largest and most infamous detention camp, which saw many nationalists being detained, incarcerated, and brutally tortured at the hands of the white racist minority regime.\n\nMinister Ncube said the province has a huge task of gathering over 100 000 people.\n\nAs you may be aware, the colossal celebrations will be graced by President Mnangagwa, whose mandate to guide the nation towards the attainment of our National Vision 2030 was overwhelmingly endorsed by all 10 provinces in Bulawayo last year through Resolution Number 1, which recognises the tangible and impactful development programmes and projects rolled out across all sectors under the stewardship of our iconic, visionary, and transformational leader, he said.\n\nMinister Ncube commended President Mnangagwas impactful legacy during his tenure as Minister of Justice, Legal and Parliamentary Affairs.\n\nNotably, he said, President Mnangagwa shifted the focus from punitive incarceration to rehabilitation and reintegration of offenders. Furthermore, President Mnangagwa advocated for the abolition of capital punishment, which has been successfully implemented through the Death Penalty Abolishment Act, recently signed into law.\n\nPresident Mnangagwa left far-reaching footprints, which include migration from punitive incarceration to focus on rehabilitation and reintegration of offenders through education, skills development, and entrepreneurship, now guided by the Heritage-Based Education 5.0 Model, which emphasises the production of goods and services that address community needs and challenges, and advocating for the abolition of capital punishment, which has since come to pass under the Death Penalty Abolishment Act, which he recently signed into law, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/aaacw.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw THE Midlands Province has thanked President Mnangagwa for his forward-thinking decision to decentralise Independence Day celebrations, enabling provinces to host the main event. This initiative reflects the Second Republic’s Devolution and Decentralisation Policy, designed to boost local development and growth. This was stated by the Minister of State for Midlands Provincial Affairs […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Gwanda designer’s Matobo collection steals show at Nama nominee reveal",
            "url": "https://www.chronicle.co.zw/gwanda-designers-matobo-collection-steals-show-at-nama-nominee-reveal/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE creative industries are buzzing with anticipation as the glitz and glamour of awards season approaches, and the recent announcement of the National Arts Merit Awards (Nama) nominees has only heightened the excitement. The 23rd Nama ceremony, a highlight of Zimbabwes cultural calendar, will take place on March 1 at the iconic Hippodrome in Harare. The prestigious event promises to be another showcase of exceptional artistic talent and a vibrant celebration of the nations rich cultural landscape.\n\nWith the spotlight now on the nominees, artists, musicians and performers are on a mission to look their best, donning their finest attire and preparing for a night that honours their hard work and creativity. The spotlight will be on who will steal the show with their threads.\n\nThe Matobo Collection suit worn by NAMA co-host, Charlene Mangweni-Furusa\n\nOne woman who has set the tone for an exciting award event is Dintle Threads creative director and founder, Margaret Matambo-Mdlongwa, aka Maggie Bones, whos from Gwanda. Her passion for fashion led her to pursue a Bachelor of Arts Honours Degree in Fashion and Textile Studies at the University of Namibia.\n\nThis year, Maggies talent was showcased at the National Arts Merit Awards (Nama), where she designed the suit worn by host Charlene Mangweni-Furusa during the nominees revelation on Wednesday.\n\nThe suit, part of the Matobo Collection, drew inspiration from traditional motifs, beautifully bridging the gap between the past and the future. The result of that was a print designed by Rosina Ndebele from Ward 17 in Matobo district, while the suit itself was designed by Bulawayo-based Maggie.\n\nI unfortunately did not get the chance to meet Rosina Ndebele, but Im sure I would have enjoyed picking her brain a little on the beautiful print that she created. Its bold, loud and captivating, Maggie said.She expressed her delight in working with Mangweni-Furusa.\n\nWorking with Charlene Mangweni-Furusa was so lovely. We bounced ideas off each other, the design process flowed and we always had new ideas. It was a really fun experience. Our visions came together beautifully.The theme for this years Nama, Afrofuturism, holds a special significance for Maggie.\n\nThe Nama theme Afrofuturism in regard to fabric to me is reimagining African culture and style. It is a blend of traditional African motifs with modern and futuristic designs/elements working together. To me, its about envisioning what our cultural wear will look like in the future and how were incorporating our culture into the changing times. Its a fun experiment of sorts. Definitely bold and innovative.\n\nMaggie Bones\n\nMaggie shared the emotional journey of creating the Matobo Collection suit.There were definitely a lot of mixed emotions when it came to creating this suit. We have this beautiful one-of-a-kind print and thoughts of how to use it to its fullest potential, but also telling a story would come into mind. This is the first suit that weve made with contrasting materials, which was fun. We incorporated a beaded headpiece into the suit, celebrating our culture.\n\nThe recognition of her work extends beyond the Nama nominees revelation as Dintle Threads has dressed notable figures, including Ausha Abrahams, who wore a piece for her Gender-Based Violence campaign and participated in the I Wear My Culture fashion project.\n\nShe also participated in the recent Matobo Goes Fashion and Beyond event where models wore some of her designs.Yet, as with many creative endeavours, Maggie faces challenges.\n\nBeing a fashion designer in Bulawayo is a bit hard because if you need good quality materials and variety, you have to source from outside of Bulawayo, which then becomes more expensive. I hope there will be a change in our textile industry so that we dont have to go far for the little things.\n\nCharlene Mangweni-Furusa praised the collaboration.The print jumped out at me when I met Margaret in January to document her work for the Matobo collection. I had seen it on the huts when we toured Matobo. Growing up, I remember seeing ogogo begudula and always thought it was so beautiful. Fast forward to today, and this art form is now being recognised and printed on fabric. With Nama running under the theme Afrofuturism, the Matobo collection was a no-brainer. I loved the geometric patterns and the colours. Margaret is a genius at putting patterns together.\n\nThe Matobo Collection, a brainchild of the German Embassy in Zimbabwe, represents a fusion of heritage and innovation, showcasing the potential of African design on a global stage. As Maggie Bones continues to break barriers and redefine fashion, her story resonates with how Matobo women are leading the charge in cultural preservation and pride.\n\nTheir work has even reached mayoral spaces, as evidenced by the Mayor of Bulawayos recent announcement that Matobo women artists will design his gown, as the council aims to replace the traditional mayoral gown, which he describes as a colonial relic.\n\nNAMA co-host Charlene Mangweni-Furusa wearing a chevron suit made by Maggie Bones and inspired by designs from Matobo hut paintings\n\nSpeaking at the official opening ceremony of the recently-held Matobo Goes Fashion and Beyond exhibition meant to showcase the designs of Matobo women in art, Bulawayo Mayor David Coltart said that the new gown will be ready by April. He noted that collaborating with Matobo fashion designers will ensure it reflects the regions rich cultural heritage and Zimbabwean traditions.\n\nThe Bulawayo City Council agreed unanimously that we are going to change the Mayoral gown. We are going to change this colonial relic and Miss Nkanyezi Malunga has been contracted by us to redesign the Mayoral gown using the fashion designs of the Matobo designers.\n\nWe are working towards finalising this project. The local authority has approved a resolution to make it happen, and we anticipate that the gown will be ready by April. It will be 100 percent Zimbabwean, crafted entirely from locally sourced fabrics, said Coltart.  Follow on X @MbuleloMpofu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/vbdxfd.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE creative industries are buzzing with anticipation as the glitz and glamour of awards season approaches, and the recent announcement of the National Arts Merit Awards (Nama) nominees has only heightened the excitement. The 23rd Nama ceremony, a highlight of Zimbabwe’s cultural calendar, will take place on March 1 at the iconic […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Education & language hub plan for Montrose Studios",
            "url": "https://www.chronicle.co.zw/education-language-hub-plan-for-montrose-studios/",
            "content": "Nqobile Tshili,[emailprotected]\n\nZBCs Montrose Studios in Bulawayo are being transformed into a centre for educational broadcasting and indigenous language development. The Government-funded project, led by the Ministry of Information, Publicity and Broadcasting Services, includes installing two advanced television studios and ten radio studios.\n\nMontrose will also house dedicated education studios, a national first, where teachers will deliver curriculum-based content. This is a joint initiative between ZBC and the Ministry of Primary and Secondary Education, which has provided radio equipment.\n\nZBC acting chief executive officer, Charles Munganasa, yesterday said that while Montrose Studios has been neglected in the past, the Second Republic has prioritised its transformation. He made the remarks following an assessment of the installation progress by the Deputy Minister of Information, Publicity and Broadcasting Services, Dr Omphile Marupi.\n\nWe are upgrading the television and radio infrastructure at our Montrose Studios. We are modernising the studios. Under the Second Republic, we have seen a tremendous improvement in support for the development of critical infrastructure such as studios and transmission networks. For some time, Montrose Studios had not been prioritised in terms of capital investment. But thanks to the Second Republic, we are receiving the support needed to revamp the systems, Munganasa said.\n\nHe said once the installations are complete, Montrose Studios will become a centre for the development of Zimbabwes indigenous languages. Zimbabwe has 14 indigenous languages out of its 16 official languages, which also include English and Sign Language.\n\nDr Omphile Marupi\n\nWe envisage that after the upgrades, we will have enough facilities for heritage-based broadcasting, in line with the national vision of leaving no one and no place behind. We want to amplify the voices of indigenous languages. Montrose is the hub for content production in the southern region.\n\nMunganasa confirmed that one television studio has been successfully installed and equipment for the second is expected by the end of the month. With the new television studio, ZBC operations at Montrose will be equivalent to those at their Pockets Hill Studio. Four of the ten new radio studios have also been installed.\n\nMunganasa said that ZBC will now house the education studios, providing teachers with access to disseminate heritage-based education content.\n\nAs a public broadcaster, our mandate is to inform, educate and entertain the nation. So, we are partnering with the Ministry of Primary and Secondary Education, which has provided technical resources to make this possible. We are going to have heritage-based programming, leveraging the infrastructure we are building at Montrose Studios.\n\nThe Ministry of Primary and Secondary Education will provide skilled and experienced resources in the form of teachers, who will deliver lessons in all the national languages.\n\nDeputy Minister Marupi said the transformation of ZBC Montrose Studios reflects President Mnangagwas policy of inclusive development.\n\nWe are here in fulfilment of His Excellencys mantra that no community, no place and no one should be left behind. This shows that places like Montrose, which were somewhat neglected, are now being attended to. This area is developing rapidly because His Excellency wants to see infrastructure across the country being improved and spruced up.\n\nDeputy Minister Marupi said that the development of Montrose Studios is expected to bring social, financial, political, regional, linguistic, and cultural benefits. He challenged ZBC to strengthen broadcasting in languages such as Nambya, Xhosa and Kalanga, among other indigenous languages, which he said were being overshadowed by isiNdebele on Khulumani FM.\n\nThe reason we started Khulumani FM was to amplify those languages. But at the moment, we have presenters who join the station promising to present in Xhosa, Kalanga, or Nambya, but then they switch to Ndebele. We dont want a replica of National FM.\n\nWe need you to strengthen this because communities out there are sensitive to their languages, and when they express their anger, it is directed at politicians, rather than those who are failing them, Dr Marupi said.@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/axcdv.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw ZBC’s Montrose Studios in Bulawayo are being transformed into a centre for educational broadcasting and indigenous language development. The Government-funded project, led by the Ministry of Information, Publicity and Broadcasting Services, includes installing two advanced television studios and ten radio studios. Montrose will also house dedicated education studios, a national first, where […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "COMMENT: Urgent action required to prevent loss of life on roads",
            "url": "https://www.chronicle.co.zw/comment-urgent-action-required-to-prevent-loss-of-life-on-roads/",
            "content": "Zimbabwe was on Thursday morning plunged into mourning following the death of 24 people who were killed when a bus and a haulage truck collided near Luthumba Tollgate, 25km from Beitbridge Town.\n\nSeventeen people died on the spot while seven others died on admission to Beitbridge District Hospital The Beitbridge-bound Urban Connect bus crashed into an Auro Transport haulage truck which had just pulled out of the tollgate.\n\nA total of 56 passengers were injured and 10 of them are in a critical condition. Government has since declared the accident a state of disaster which means each of those killed in the horrendous accident will be accorded State-assisted burial. Preliminary investigations indicate that the bus was overtaking when it collided with the haulage truck.\n\nPresident Mnangagwa who sent his condolences to the bereaved families, said the accident left him horrified and heartbroken.\n\nPresident Mnangagwa\n\nAs I express my deepest heartfelt condolences to the families and relatives who have lost their loves ones in this horrific crash, I also heartily and prayerfully reach out to all those injured and hospitalised, wishing them a speedy recovery, he said.\n\nPresident Mnangagwa called for urgent measures to improve road safety, urging motorists to exercise extreme caution. He also urged the police and other law enforcement agencies to step up efforts to curb road carnage.\n\nAccording to statistics 80 percent of road traffic accidents in Zimbabwe are as a result of human error which means they can be avoided. An average of 1 700 people are killed on Zimbabwean roads annually while 30000 others are injured. The statistics are very frightening and something should be done urgently to reduce the carnage on our roads.\n\nIn a bid to tame the traffic jungle, Government at one time suspended the operators licences for two bus companies after their bus drivers who were racing and blocking each other caused an accident.\n\nGovernment has repeatedly warned public transport operators violating traffic rules and regulations that they risk having their licences withdrawn but it seems bus drivers are not taking heed.\n\nThere is, therefore, a need for bus companies to introduce tracking systems to monitor the behaviour of their bus crews as part of efforts to tame the traffic jungle.\n\nThe bus racing being witnessed on our highways cannot be allowed to continue as it is putting the lives of travellers at risk.\n\nWe have said it before that passengers should not hesitate to report reckless bus drivers at the next roadblock or police station as this is the only way to control the behaviour of these bus drivers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-2-1.jpg",
            "description": "Zimbabwe was on Thursday morning plunged into mourning following the death of 24 people who were killed when a bus and a haulage truck collided near Luthumba Tollgate, 25km from Beitbridge Town. Seventeen people died on the spot while seven others died on admission to Beitbridge District Hospital The Beitbridge-bound Urban Connect bus crashed into […]",
            "time": "08:25",
            "date": "15 Feb 2025"
        }
    ]
}