{
    "news": [
        {
            "title": "ZANC praises Zimbabwe Government for setting up US$1.5 million to support freedom fighters",
            "url": "https://www.chronicle.co.zw/zanc-praises-zimbabwe-government-for-setting-up-us1-5-million-to-support-freedom-fighters2/",
            "content": "Online ReporterTHE Zimbabwe African National Congress (ZANC) has commended the Government for establishing a presidential fund aimed at addressing the welfare needs of the countrys former freedom fighters.A US$1.5 million Presidential War Veterans Fund has been set up to support the nations freedom fighters.In a statement, ZANC said the fund is a testament to the Governments commitment to supporting the countrys liberators.ZANC wishes to extend its heartfelt appreciation to the Government for its efforts in recognizing and honouring our esteemed war veterans. The establishment of the Presidential War Veterans Fund is a commendable initiative that demonstrates the Governments dedication to supporting our freedom fighters, reads the statement.We acknowledge the Governments efforts in implementing various initiatives aimed at improving the welfare of war veterans. These initiatives reaffirm the Governments commitment to ensuring that our heroes are not forgotten.ZANC emphasized that honouring and supporting war veterans is a collective responsibility and commended the State for taking proactive steps in this regard.We urge all Zimbabweans to join us in expressing our deepest gratitude to our war veterans for their selfless sacrifices and unwavering dedication to our nations liberation, said ZANC.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/aaaaaaaaa.jpg",
            "description": "Online Reporter THE Zimbabwe African National Congress (ZANC) has commended the Government for establishing a presidential fund aimed at addressing the welfare needs of the country’s former freedom fighters. A US$1.5 million Presidential War Veterans Fund has been set up to support the nation’s freedom fighters. In a statement, ZANC said the fund is a […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Kay ‘G’ host: The roaring lion of hip-hop releases “Shumba”",
            "url": "https://www.chronicle.co.zw/kay-g-host-the-roaring-lion-of-hip-hop-releases-shumba/",
            "content": "Mbulelo Mpofu\n\nIN Australia, Zimbabwean-born rap sensation Kay G Host has released his electrifying new single, Shumba, a track that not only embodies power, resilience, and dominance but also cements his status as a formidable force in the hip-hop world.\n\nBorn Kudzai Ivan Makawa 36 years ago, Kay G Hosts life is a compelling story of creativity, perseverance, and cultural pride. Raised between Zimbabwe and the UK, his upbringing was a melting pot of rich cultural influences that shaped his unique artistry.\n\nAs the youngest of 10 siblings, he embraced his individuality early, channelling his energy into martial arts and music  disciplines he has passionately pursued for over 25 years.I grew up in a household filled with different languages and cultures, and that has had a huge impact on how I create and express myself, Kay said.\n\nBeing multilingual allows me to think in different ways. Sometimes, the emotions I experience are best expressed in Shona. The translation just doesnt do it justice.\n\nHis quest for knowledge led him to explore various fields, including psychology, fitness, nursing, landscaping, and agriculture. Yet, it was music that ultimately called to him, capturing his heart and soul.\n\nIn 2008, Kay took a transformative leap by moving Down Under to further his education in media, film, television, audio production, and radio. This pivotal step not only broadened his horizons but also set the stage for his emergence as an influential figure in the entertainment industry.I wanted to learn the ins and outs of the media world, he explains. Its crucial to understand the landscape youre navigating, especially in the music business, which can be quite daunting. The education I received allowed me to approach my career with a strategic mindset, he told Chronicle Showbiz.\n\nUpon settling in Australia, Kay founded UWGY Entertainment, a platform committed to nurturing artistic talent and innovation. As CEO, he has played a vital role in shaping emerging artistes, managing multiple rosters over the past six years. His collaboration with Galactix Studio led to the creation of Concrete Block Records, which flourished under his leadership for five years. Not one to rest on his laurels, he continued to expand his influence by launching 1010 Studios and Coded Link Records, solidifying his footprint in the global music landscape.\n\nThe goal has always been to create a safe space for artists to thrive and express themselves freely. I want to build a legacy of friendship and togetherness in this industry, where everyone can feel comfortable pursuing their dreams.\n\nThe release of Shumba marks a significant milestone in Kays career. The title, which translates to lion in Shona, is not just a name; its a powerful statement of fearlessness and unyielding determination.\n\nThe track packs an electrifying punch in just two minutes and 28 seconds, serving as a battle cry for those who refuse to be caged.\n\nShumba encapsulates the hustle and grind that define my journey. Its about getting in tune with yourself  knowing and loving who you are, he said.\n\nWith hard-hitting beats and razor-sharp lyricism, the song resonates deeply, evoking a sense of empowerment and strength.\n\nWhen discussing his creative process, Kay revealed that he writes in bursts of inspiration.Once a feeling hits, I jot down my thoughts and later work on the rhythm.\n\nThis spontaneous approach, combined with his background in martial arts, informs both his music and performance style.Everything I do is influenced by martial arts. It teaches you disciplinetrain your speech, your breath, your vocabulary. Its all interconnected.\n\nAs a Rastafarian, Kay embraces a holistic lifestyle that profoundly shapes both his music and daily life.Over the years, you can see how my vocabulary has evolved. My content grows deeper, and as I grow, so does my art, he reflected.\n\nWith the anticipation of his upcoming Nyamuzihwa EP, Kay is excited about what lies ahead.This project is a consolidation of everything Ive learnt so far, marking the beginning of my next phase, he shared, hinting at new artistic dimensions he plans to explore.\n\nFor young artistes aspiring to break into the music industry, Kay offers invaluable advice: Understanding yourself is key. Before you embark on this journey, make sure you know who you are. The music industry can be filled with obstacles, and self-knowledge will be your greatest ally.\n\nKays career has also been marked by fruitful collaborations that have enriched his artistry. He cited Afroking as one of the most rewarding partnerships, which evolved from a client relationship into mentorship and friendship.\n\nIn a world where challenges abound, Kay G Host has promised to be a roaring lion, ready to inspire and uplift through his music, reminding us all that the most powerful voice comes from within. Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ghtgrhfhtr.jpg",
            "description": "Mbulelo Mpofu IN Australia, Zimbabwean-born rap sensation Kay ‘G’ Host has released his electrifying new single, “Shumba”, a track that not only embodies power, resilience, and dominance but also cements his status as a formidable force in the hip-hop world. Born Kudzai Ivan Makawa 36 years ago, Kay ‘G’ Host’s life is a compelling story […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "BICC launches devotional book to inspire daily prayer, Bible reading",
            "url": "https://www.chronicle.co.zw/bicc-launches-devotional-book-to-inspire-daily-prayer-bible-reading/",
            "content": "Lubelihle Mathe [emailprotected]\n\nBrethren In Christ Church (BICC) is breaking the cycle of procrastination in prayer with the launch of a devotional book on March 1, 2025. This initiative, aimed at motivating members to engage in daily prayer and Bible reading, will be unveiled at the churchs central hall in Bulawayo.\n\nPublished under the churchs Media subunit, Amagugu Evangeli, this devotional book is packed with insightful and inspiring content designed for Christians seeking to deepen their relationship with God.\n\nThe book contains 365 daily prayer points, each supported by scripture and reflection. It aims to help readers discover life-changing principles for positive and progressive living, while also cultivating a deeper understanding of Gods requirements and desires.\n\nOne of the key features of this devotional is its collaborative authorship, featuring contributions from a diverse range of esteemed pastors and theological scholars within Brethren in Christ Church, Zimbabwe. Two major contributors to the book are Reverend Tamuka T Marumure and Reverend Johane Ncube. Their combined efforts have resulted in a comprehensive prayer guide that will benefit the church community. Each author brings their unique perspective and expertise, enriching the content and making it more relevant to Christians worldwide.\n\nThe books diversity in authorship ensures a well-rounded exploration of themes that are significant to believers around the world.\n\nIn an interview, project manager Jonah Nyoni, a prolific writer shared the books main objectives.This goes beyond just being a prayer book. It allows readers to delve into the Bible and learn what God requires of us, Nyoni said.\n\nThe devotional book covers a range of themes, including Faith, Family Life, and Peace, among others. These daily themes are crafted to help readers deepen their relationship with God, nurture healthy relationships with those around them, and find peace in a busy world. The themes we cover are designed to guide Christians towards successful living every day, Nyoni added.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Bible.jpg",
            "description": "Lubelihle Mathe – Lubelihlel79@gmail.com Brethren In Christ Church (BICC) is breaking the cycle of procrastination in prayer with the launch of a devotional book on March 1, 2025. This initiative, aimed at motivating members to engage in daily prayer and Bible reading, will be unveiled at the church’s central hall in Bulawayo. Published under the […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Hawks, BMA nab two corrupt immigration officers at Beitbridge",
            "url": "https://www.chronicle.co.zw/hawks-bma-nab-two-corrupt-immigration-officers-at-beitbridge/",
            "content": "Thupeyo Muleya, Beitbridge BureauSOUTH Africas Border Management Authority (BMA), working together with the specialised police unit, the Hawks, has arrested two immigration officers at the countrys border with Zimbabwe on allegations of corruption and fraud involving the illegal processing of six Malawian passports.The duo was arrested on Monday at the ever-busy Beitbridge Port of Entry (South Africa).In a statement, the BMAs Deputy Assistant Commissioner for Communications and Marketing, Ms. Mmeme Mogosi, said the accused persons had been charged with fraud and corruption.The Commissioner of the Border Management Authority (BMA), Dr Michael Masiapato, applauds the arrest of two Immigration Specialists at Beitbridge Port of Entry by the Directorate for Priority Crime Investigation (Hawks) on the evening of Monday, 24 February 2025, she said.Their arrest follows an ongoing investigation linked to the case of Immigration Specialist Ms. Dorah Ncube, who was arrested last year for fraud and corruption related to the illegal processing of six Malawian nationals at Beitbridge. Ms Ncube remains in police custody.The arrested officials appeared before the Musina Magistrates Court this morning. The BMA has continuously reiterated its zero-tolerance stance on corruption and remains committed to upholding the integrity of South Africas border management systems.BMA Commissioner Dr Michael Masiapato said the organisation will continue to fully cooperate with law enforcement agencies in their investigations to ensure that those involved in corrupt activities are held accountable.He emphasised that the authority will not tolerate any misconduct that undermines the rule of law and the security of the country.We assure the public that decisive action will be taken against any official found to be involved in unethical practices, said Commissioner Masiapato.He noted that the BMA was recently featured in an expos by Carte Blanche, which highlighted suspicious activities related to the illegal processing of travellers.Although the two arrests are not related to the expos, the BMA continues to curb corruption within its systems. Currently, the BMA is processing 45 cases yet to be concluded, involving transgressions such as aiding and abetting, as well as the illegal processing of travellers and goods. About 27 officials have been dismissed since the BMAs inception on 1 April 2023, said the Commissioner.Cases of corruption are common at most ports of entry, where migrants pay officials to illegally pass through the border, obtain fraudulent visas, or extend their stay in selected countries.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/xxxxxxxxxx.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau SOUTH Africa’s Border Management Authority (BMA), working together with the specialised police unit, the Hawks, has arrested two immigration officers at the country’s border with Zimbabwe on allegations of corruption and fraud involving the illegal processing of six Malawian passports. The duo was arrested on Monday at the ever-busy Beitbridge Port […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "New talent alert: Sdakwa Shine preparing to drop “Injabulo” Remix",
            "url": "https://www.chronicle.co.zw/new-talent-alert-sdakwa-shine-preparing-to-drop-injabulo-remix/",
            "content": "Sipepisiwe Moyo [emailprotected]\n\nNqobani Nelson Dube, better known as Sdakwa Shine, a multi-talented artiste from Bulawayo who specialises in rap music, Kwaito, and Afro-Pop is set to release a remix of his song titled Injabulo on Friday. The track was originally released in December 2024.\n\nIn an interview, the musician shared insights into his upcoming remix, which addresses the challenges people face in life.The song Im releasing is titled Injabulo Remix. Its a reworked version of the track I dropped in December. This song talks about freedom and happiness, reflecting on the struggles we face in life. The message is aimed at advising people not to judge others who are striving for success and happiness, Sdakwa Shine said.\n\nSdakwa Shine\n\nHe also mentioned collaborations with musicians Lamas Ellz, Ellbe, 808, Don Chimzy, and Natho on the remix.\n\nHe reflected on his journey in music, which began in 2015.I started music in 2015 and recorded my first song while I was in Form 1. That same year, I joined a music group called Yung Hustlers, and we began recording songs. My first music video with the group was in 2017, but it didnt perform well, which led to the group splitting up, he explained.\n\nHis collaboration with Poison Kid in 2018 marked a turning point, as it resulted in his first successful video shoot. From there, he began shooting more videos and performing at shows.I have a lot of songs and music videos, some of which are on social media, while others were lost or are still ready for release, he added.\n\nIve worked with producers like MannexMusic, Tflow, Smash Maker, Txg (Toxi Gyn), Frost De Most, and Ryzon.\n\nSdakwa Shine has collaborated with numerous artistes within the music industry, including the late Cal Vin, Mjox Mjokojoko, Lamas Ellz, Mnara, Floppy X, 808, Poison Kid, Uno.Xo, and Obviedoh JellyfromtheB. He has also shared the stage with notable acts like Culture Love, Iyasa, Megatrons, Asaph, Senko, Ganyaz Jr, Lamas Ellz, Poison Kid, and Ellbe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Sdakwa.jpg",
            "description": "Sipepisiwe Moyo – moyosipepisiwe@gmail.com Nqobani Nelson Dube, better known as Sdakwa Shine, a multi-talented artiste from Bulawayo who specialises in rap music, Kwaito, and Afro-Pop is set to release a remix of his song titled “Injabulo” on Friday. The track was originally released in December 2024. In an interview, the musician shared insights into his […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Moja Love, heartfelt story of orphans, family dynamics to premiere in May",
            "url": "https://www.chronicle.co.zw/moja-love-heartfelt-story-of-orphans-family-dynamics-to-premiere-in-may/",
            "content": "Mthabisi Tshuma [emailprotected]\n\nTALENT of Steel is preparing for an exciting production in 2025 with Moja Love, an authentic Zimbabwean film that captures the essence of life through the lens of the Shona language. The film is primarily aimed at Zimbabwean audiences.\n\nInspired by real-life stories impacting the countrys socio-economic landscape, Moja Love delves into family, love, and the struggles that shape daily life. Written and directed by Eddie Ndhlovu, principal photography is scheduled to begin in March at Lake Chivero in Harare in collaboration with ZimParks.\n\nNdhlovu shared that the production is set to premiere in May.Moja Love opens with a poignant scene: a vibrant gathering of family and friends around a dishevelled pile of clothes and personal belongings  a traditional ceremony known as kugova nhumbi. This gathering, steeped in Shona culture, is a way to share the deceaseds (Betina) belongings. Among the crowd are her elder sister, Mai Goddy, a woman of strong opinions; her brother, the quiet yet thoughtful Ketai; his spirited twin, Fiona; the eager young sister, Rosina; and Betinas two children, the resilient Lucky (14) and the imaginative Zodwa (12), said Ndhlovu.\n\nThe film takes a deeper look at the challenges faced by orphans after the death of their parents.As emotions flare, a heated debate erupts over who will take custody of the children. Rosina, filled with ambition and a desire to provide a better life, insists on bringing them to the bustling city. This proposal is met with fierce resistance from Mai Goddy, who claims her right to the children, citing her years of care during Betinas illness. The tension mounts as family dynamics clash  voices rise, and old grievances surface, painting a vivid picture of familial bonds tested by tragedy. Ultimately, under the weight of family pressure, the decision falls to Mai Goddy, despite her questionable capabilities as a guardian. As Lucky reassures Zodwa that they will navigate this storm together, the children find solace in their aunt Fionas home and seek refuge from their uncle Ketais quiet strength, he explained.\n\nNdhlovu said that oja Love is not just a story of loss but a celebration of resilience and the spirit of Ubuntu.It explores the complexities of love, responsibility, and the struggle to forge a path in a world burdened by the challenges of being orphans.\n\nScheduled for release in May, the film will debut on television before being available online, with aspirations for recognition at film festivals worldwide.It promises to be a heartfelt journey that resonates with audiences, igniting conversations about love, loss, and the ties that bind us, he said. Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Eddie-Ndhlovu.jpg",
            "description": "Mthabisi Tshuma – revmmthiretshuma@gmail.com TALENT of Steel is preparing for an exciting production in 2025 with Moja Love, an authentic Zimbabwean film that captures the essence of life through the lens of the Shona language. The film is primarily aimed at Zimbabwean audiences. Inspired by real-life stories impacting the country’s socio-economic landscape, Moja Love delves […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Dube tops Tanzanian Premier League scorers chart",
            "url": "https://www.chronicle.co.zw/dube-tops-tanzanian-premier-league-scorers-chart/",
            "content": "Online ReporterZIMBABWE international and Young Africans striker, Prince Mgadaffi Dube, leads the Tanzanian Premier Leagues top goal-scorer chart, with an impressive 11 goals to his name this season.He is in line to win the Golden Boot with only nine matches to the end of the season.Dube was on target for his team at the weekend netting a goal in a 5-0 victory over Mashujaa.The goal, which came in the 49th minute, was crucial to Young Africans commanding performance and solidified Dubes status as a key player for the club.The second best scoring player in the league is his team mate Clement Mzize with 10 goals while and Jean Ahoua of Simba SC, is on nine goals.Behind them, Lionel Ateba of Simba SC has scored eight goals while Elvis Rupia of Singida Big Stars FC has seven goals.Dubes journey to Young Africans began in July 2024, when he joined the Tanzanian giants on a two-year contract after a challenging period at Azam FC.The striker had been embroiled in a contract dispute with Azam, which even reached the Tanzanian Football Federation.Ultimately, Azam agreed to release Dube after he paid a hefty fee, despite still having two years left on his original deal.Now settled at Young Africans, Dube is relishing the chance to showcase his abilities on the pitch, with his contract securing his future at the club until July 2026.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Primce-Dube.jpg",
            "description": "Online Reporter ZIMBABWE international and Young Africans striker, Prince ‘Mgadaffi’ Dube, leads the Tanzanian Premier League’s top goal-scorer chart, with an impressive 11 goals to his name this season. He is in line to win the Golden Boot with only nine matches to the end of the season. Dube was on target for his team […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "PhosAgro Increased Shipments to Africa by One Third in 2024…Expanded Range of Humanitarian Soil Protection Initiatives",
            "url": "https://www.chronicle.co.zw/phosagro-increased-shipments-to-africa-by-one-third-in-2024-expanded-range-of-humanitarian-soil-protection-initiatives/",
            "content": "Chronicle Correspondent\n\nMoscow  PhosAgro Group, one of the worlds largest phosphate-based fertilizer producers, increased its supplies of mineral fertilizers to African countries by a third in 2024.\n\nThe Companys total fertilizer exports to Africa in 2024 exceeded 730 thousand tonnes, a 33% increase from 2023 (548 thousand tonnes).\n\nThe top five African importers of PhosAgros agrochemical products included South Africa, where shipments increased by 10%; Mozambique, by 80%; Morocco, by around 450%; Cameroon, by 60%; and Ethiopia, which made a large purchase of fertilizers from PhosAgro for the first time in eight years.\n\nMikhail Sterkin, PhosAgros Deputy CEO for Sales and Marketing, said: PhosAgro is the largest Russian supplier of fertilizers to African countries.\n\nAccording to expert estimates, we account for 40% of total exports of all types of Russian mineral fertilizers [to the continent]. As a company whose products make up around 7% of African countries total fertilizer imports, we play an important role in bolstering the continents food security and food sovereignty.\n\nAccording to UN statistics, 40% of the land in Africa suffers from degradation due to cadmium contamination from fertilizers that contain heavy metal impurities. Our mineral fertilizers are free of cadmium and other toxic substances that are harmful to human health and soils, and they are exceptionally environmentally friendly. Safe fertilizers are the key to healthy soils and safe agricultural products. We intend to continue actively developing our collaboration with our African partners.\n\nThe Company is also taking active measures to protect Africas soil resources. PhosAgro was an official partner for the launch of the African Soil Laboratory Network (AFRILAB) as part of a global soil protection initiative in collaboration with the United Nations Food and Agriculture Organization (FAO). AFRILAB currently has 220 laboratories across 54 countries, assessing the quality and safety of fertilizers and monitoring soil conditions.\n\nIn addition, PhosAgro and the FAO launched the Global Soil Doctors programme, which includes the production of soil testing kits that enable farmers in developing countries  in African countries in particular  to independently assess the condition of their fields and to determine the nutrients necessary for the soil to maximise yields, to grow environmentally friendly crops and, as a result, to make an important contribution to the fight against hunger.\n\nIn February 2024, PhosAgro and the FAO signed an additional agreement to finance the third phase of their global soil protection initiative. The joint project aims to strengthen the Global Soil Laboratory Network (GLOSOLAN), which currently encompasses 160 countries and includes over 1,000 laboratories.\n\nTo date, more than 11,000 farmers from 20 developing countries have already taken part in the project, with around 5,000 more farmers set to receive training during the projects third phase.\n\nIn the latest phase of their partnership, PhosAgro has joined the FAOs initiative to recarbonize global agricultural soils (RECSOIL), the main goal of which is to manage and sequester soil organic carbon, an important step in the fight against climate change.\n\nPhosAgro also partners with UNESCO to award annual grants for research on environmental protection as part of the Green Chemistry for Life programme.\n\nOver eight rounds of the programme, 55 young scientists from all around the world have received grants, with African scientists occupying a special place in the programme. Throughout the programmes history, the international jury has awarded more than a quarter of the grants to talented African scientists from South Africa, Egypt, Kenya, Tunisia, Nigeria, Sudan and Zimbabwe.\n\nFurthermore, over 200 young African scientists have taken part in the PhosAgroIUPAC Summer Schools on Green Chemistry.\n\nDuring the second RussiaAfrica Economic and Humanitarian Forum, PhosAgro launched Pro Agro Lectorium, a digital educational platform for African farmers. The platform provides online lectures on a variety of topics: sustainable agriculture, the basics of plant nutrition, and the proper use of mineral fertilizers for achieving food security and for producing crops with qualities consumers are looking for.\n\nThe lecturers include experts from PhosAgro; leading scientists from the Russian Academy of Sciences, the Russian State Agrarian University  Moscow Timiryazev Agricultural Academy and other agricultural universities; as well as top executives from major agricultural companies from around the world.\n\nDuring the Forum, PhosAgro also signed cooperation agreements with leading African and Russian universities to promote agricultural education.\n\nThese partnerships are aimed at implementing scientific, educational and research projects in the field of sustainable agriculture, including the promotion of digital educational technologies across Africa. PhosAgro is currently collaborating with the University of Zambia, Makerere University (Uganda), Ahmed Baba University (Mali), Assiut University (Egypt) and Injibara University (Ethiopia).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/PhosAgro-.jpg",
            "description": "Chronicle Correspondent Moscow – PhosAgro Group, one of the world’s largest phosphate-based fertilizer producers, increased its supplies of mineral fertilizers to African countries by a third in 2024. The Company’s total fertilizer exports to Africa in 2024 exceeded 730 thousand tonnes, a 33% increase from 2023 (548 thousand tonnes). The top five African importers of […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Gwanda Town crafts donation policy to enhance transparency",
            "url": "https://www.chronicle.co.zw/gwanda-town-crafts-donation-policy-to-enhance-transparency/",
            "content": "Sukulwenkosi Dube-Matutu[emailprotected]GWANDA Municipality has crafted a donation policy to govern how donations will be administered, ensuring transparency and accountability.In an interview, Gwanda Municipality Alderman Thulani Moyo said transparency will help boost donors confidence.As part of efforts to bring much-needed development to the town, the municipality has engaged development partners and well-wishers under its private-public partnership approach.As a municipality, we have deliberately strengthened our private-public partnership to incorporate more partners into our development agenda. There is a lot that needs to be done in terms of service delivery.We also have key institutions that need attention, such as the hospital. We have engaged the business community, which has shown eagerness in improving our town through donations. We also have vulnerable people in our community. As part of the engagement process, we have crafted a donation policy to ensure that donations are handled transparently, he said.Alderman Moyo said the donation policy will clearly define how donations are received, stored, and handled. He added that each donation will be recorded and signed for.He called on various stakeholders to take part in this noble cause of assisting in the towns development where needed.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/Gwanda-Mayor-Alderman-Thulani-Moyo.jpg",
            "description": "Sukulwenkosi Dube-Matutu sukulwenkos.dube@chronicle.co.zw GWANDA Municipality has crafted a donation policy to govern how donations will be administered, ensuring transparency and accountability. In an interview, Gwanda Municipality Alderman Thulani Moyo said transparency will help boost donors’ confidence. As part of efforts to bring much-needed development to the town, the municipality has engaged development partners and well-wishers […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "China expands influence in Africa’s energy sector",
            "url": "https://www.chronicle.co.zw/china-expands-influence-in-africas-energy-sector/",
            "content": "CHINAs growing influence in Africas oil and gas sector, particularly in exploration and production continues to reshape the regions energy landscape.At the heart of this expansion is Chinas strategic interest in securing energy resources to fuel its growing economy while advancing its Belt and Road Initiative.As the global energy transition accelerates, Chinas engagement with Africas oil and gas sector has evolved, reflecting both a long-term investment strategy and a deeper commitment to regional energy security.China National Offshore Oil Corporation is actively developing key oil fields across Africa, including Nigerias ultra-deep Egina field and the recently operational Akpo West field.In Niger, China National Petroleum Corporation (CNPC) signed a $400 million crude supply deal in 2024 and is building a 1,980-km pipeline linking the Agadem Rift Basin to Benins Atlantic Oil Terminal. In South Sudan, Dar Petroleum Operating Co., which counts CNPC and Sinopec as major shareholders, resumed production this month after nearly a year-long hiatus. Sinopec is also expanding its footprint in Algeria through a March 2024 agreement with Sonatrach, which includes plans for the Hassi Berkane Nord exploration zone. Meanwhile, United Energy Group is set to double its Egyptian output after acquiring Apex International Energys Western Desert portfolio, adding over 22,000 barrels per day to its production across five concessions.In the Republic of Congo, Chinese firm Wing Wah is leading the Banga Kayo gas monetization project, converting flared gas into LNG, butane and propane. CNOOC is advancing Ugandas Lake Albert project, targeting first oil from the Kingfisher field in 2025. In Mozambique, CNPC is a partner in the $30 billion Rovuma LNG project, expected to reach FID in 2026, while CNOOC signed agreements in April 2024 for five exploration blocks in the Save and Angoche offshore areas.CNOOC is also making waves in Gabon, drilling the Tigre-1 probe in a high-potential deep-water oil prospect, marking the companys first exploration in Gabons deep waters in over five years.\n\nChinas energy investments in Africa extend beyond exploration and production to include vital infrastructure development, including pipelines, power plants and refineries.In Angola, China National Chemical Engineering Co. secured the EPC contract for the $6 billion Lobito Refinery, while China Engineering and Machinery Corp. was recently awarded the contract to build a 350 MW gas power plant in Nigeria. In South Sudan, CNPC and the government are exploring plans to build a new pipeline passing through Djibouti and Ethiopia, aimed at enhancing export capabilities as production increases in Blocks 3 and 7.Additionally, CNOOC is a key partner in the $5 billion East African Crude Oil Pipeline, which will facilitate the first Ugandan oil exports, with financing from the China Export-Import Bank and several other Chinese banks.These infrastructure projects are part of Chinas broader push to integrate African nations into global energy supply chains, enabling greater energy access while supporting regional economic growth.Looking toward 2025 and beyond, Chinas role in Africas energy sector is expected to evolve in response to emerging trends in the global energy market, including the drive toward cleaner energy sources and greater emphasis on sustainability. Through companies like China General Nuclear Power Group (CGN), JinkoSolar and China Energy Engineering Group, China is funding wind, solar, nuclear and hydropower projects across the continent, reinforcing its commitment to the African energy transition. This shift aligns with Chinas broader climate goals, which include achieving carbon neutrality by 2060, and highlights the growing synergy between Chinas energy investments and Africas renewable energy ambitions.As part of this growing collaboration, the African Energy Chamber (AEC) will host the Invest in African Energies investor forum in Shanghai on March 13, 2025.The event will focus on strengthening China-Africa relations and creating new opportunities for Chinese producers, investors and equipment suppliers to expand their footprint across Africa. The Shanghai forum will set the stage for the African Energy Week (AEW): Invest in African Energies conference in Cape Town, where key stakeholders will continue to discuss how Chinas increasing energy investments in Africa can drive future development, support the continents energy transition, and unlock new avenues for energy cooperation across both traditional and renewable sectors.Chinas expanding role in Africas energy sector is not only reshaping regional markets, but also creating vital opportunities for investment, infrastructure development and long-term energy security.As we prepare for the Invest in African Energies investor forum in Shanghai and African Energy Week 2025 in Cape Town, we look forward to strengthening partnerships that drive sustainable growth across both traditional and renewable energy industries, said Leoncio Amada Nze Nlang, CEMAC executive president at the AEC.-Source: African Energy Chamber\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/Solar-panels-at-Nkulumane-Clinic-in-Bulawayo-For-renewable-energy-feature.jpg",
            "description": "CHINA’s growing influence in Africa’s oil and gas sector, particularly in exploration and production continues to reshape the region’s energy landscape. At the heart of this expansion is China’s strategic interest in securing energy resources to fuel its growing economy while advancing its Belt and Road Initiative. As the global energy transition accelerates, China’s engagement […]",
            "time": "21:07",
            "date": "25 Feb 2025"
        }
    ]
}