{
    "news": [
        {
            "title": "President praises church for patriotism",
            "url": "https://www.chronicle.co.zw/president-praises-church-for-patriotism/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPRESIDENT Mnangagwa yesterday praised the church for its patriotic efforts and recognised its role in driving Zimbabwes development.\n\nHe credited this progress to the guidance of God and the tireless work of the nations citizens, which he called the foundation of Zimbabwes ongoing advancement.\n\nThe President emphasised Zimbabwes leadership in indigenous heritage-based development and urged citizens to embrace initiatives and innovations that further the agenda of modernisation and industrialisation.\n\nHe also stressed the importance of Zimbabweans supporting one another, individually and collectively, as they work to advance the country.\n\nPresident Mnangagwa noted how the church is rallying the nation towards progressive, Godly, and biblical patriotism, reminding congregants that Zimbabwe is an exceedingly good land.\n\nSpeaking at the annual National Thanksgiving and Dedication Service at the Zimbabwe International Exhibition Centre in Bulawayo, the President expressed his Governments support for such religious gatherings that unite people in gratitude to God for the countrys positive milestones.\n\nHe highlighted how development initiatives and programmes have become the solid foundation on which the country is built. The event, hosted by the Faith for the Nation Campaign and the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), was held under the theme Our Nation, Our Opportunity  celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nSince 2017, the National Thanksgiving and Dedication Service has become an essential platform for believers to intercede for Zimbabwes blessings and prosperity while acknowledging the significant role of faith in the nations advancement.\n\nPresident Mnangagwa urged the diverse congregants not to tire of praying and interceding for the country, no matter the circumstances.\n\nNyika inonamatirwa, inotongwa, inovakwa nevene vayo/ ilizwe likhulekelwa, libuswe, lakhiwa ngabanikazi balo, he said amid cheers from the congregants.\n\nWe have confidence that if we ask anything according to His will, He hears us, and that He shall grant our requests.The service was also attended by Vice President Kembo Mohadi, Defence Minister, Oppah Muchinguri-Kashiri, Lands, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, Information, Publicity, and Broadcasting Services Minister, Dr Jenfan Muswere, and his deputy Dr Omphile Marupi, Bulawayo Provincial Affairs and Devolution Minister, Judith Ncube, several Government officials, traditional leaders, and captains of industry.\n\nReflecting on the theme of the service Our Nation  Our Opportunity: Celebrating the Progress, acknowledging the Potential of our Country Zimbabwe, President Mnangagwa said it was both inspiring and energising.\n\nLooking back at the successes we have scored under the Second Republic; we are seeing the goodness of the Lord in our land of Zimbabwe. We are not in despair, and the Almighty God has never abandoned us. Our nation is being renewed day by day towards Vision 2030. Communities are being transformed to be empowered and more prosperous.\n\nWe are leaving no one and no place behind. For these, and many other gifts, we thank the Almighty God. Allow me to commend the remarkable contributions of churches across all denominations in nation-building, said the President.\n\nPresident Mnangagwa quoted extensively from the Bible and paid tribute to the church for its unwavering commitment to Zimbabwe. He said the Government appreciates the individual and collective wholehearted service shown by various church leaders.\n\nI particularly recognise the leadership of our churches, in their various offices, for being Godly spiritual shepherds over the people of our country. The Lord says in Jeremiah Chapter 3 verse 15: I will give you shepherds according to my heart, who will feed you with knowledge and understanding. Thank you all for remaining true to the offices you hold within the churches in our country.\n\nYour individual and collective, wholehearted service is appreciated by my Government. More so that you have preached the uncorrupted word of God, which remains the beacon of hope, source of wisdom, and guidance for the people of our nation.\n\nHe exhorted the congregants to spread the gospel and nurture the spiritual growth of many people from different backgrounds, inspiring them to live according to Gods teachings of love, unity, compassion, and service.\n\nHe said the Thanksgiving service was, therefore, also a tribute to the profound impact and unity of purpose that the church as a whole has demonstrated in communities.\n\nFocusing on patriotism, President Mnangagwa said the church inspires a sense of patriotism, noting that the youths are particularly challenged to resist the machinations by detractors to have them hate or look down upon their own motherland, Zimbabwe.\n\nPresident Mnangagwa said Zimbabweans are their liberators, using indigenous resources, skills, and talents. Others are welcome to assist, he said.\n\nIn pursuit of our National Vision 2030, I call upon us to embrace true patriotism and genuine love for our country and our people. Borrowing from the exhortations in Psalm Chapter 137 verses 5 and 6, I also urge us, individually and collectively, to patriotically proclaim that If I forget Zimbabwe, let my right hand forget her skill.\n\nIf I do not remember nor prefer Zimbabwe above my own joy, let my tongue cling to the roof of my mouth. Never be blind to the vast potential of our land. Open your eyes and hearts to truly love and be committed to the land of your birth. You, the youth, are the future of this great country.\n\nPresident Mnangagwa told the congregants that the future of Zimbabwe is bright.As we look to the future, our nation is emboldened by the goodness of the Almighty God that saw us liberate ourselves from colonial bondage and ultimately repossess the land stolen from our forefathers by those who occupied our beautiful country.\n\nToday, we stand proud and tall as a truly free and independent people, enjoying freedom of worship and advancing Godly values as well as a people-centred national development agenda.\n\nIn the year ahead, unflinching focus on our National Vision, goals, and aspirations, coupled with hard honest work; production and productivity; should see us live up to the instruction given to us in Genesis Chapter 1 verse 28.\n\nIt is our responsibility and duty to be fruitful and to subdue the earth. We remain anchored on our national philosophy, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ ilizwe, lakhiwa, libuswe, likhulekelwe ngabanikazi balo.\n\nThe Head of State recounted to the congregants some milestones that the country attained in the past 12 months. He said the key progressive signposts attained are vast and cut across all sectors, such as mining, manufacturing, tourism, ICTs, education, and other social services.\n\nHe said in the agriculture sector, the Government is not folding arms and surrendering to the vagaries of climate change. Numerous dams are being built and boreholes sunk to mitigate the impact of climate change.\n\nDuring the service, the congregation, including worshippers from neighbouring countries and Europe, were clad in a beautiful array of colourful religious robes. Some garments were even fashioned from the national fabric.\n\nHolding Bibles and tambourines, the joyful and elated worshippers sat together side-by-side, ready to honour the Almighty.\n\nJubilant and enthusiastic, the atmosphere was electrified with ululating and celebratory singing and dancing within the auditorium.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/SG.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa yesterday praised the church for its patriotic efforts and recognised its role in driving Zimbabwe’s development. He credited this progress to the guidance of God and the tireless work of the nation’s citizens, which he called the foundation of Zimbabwe’s ongoing advancement. The President emphasised Zimbabwe’s leadership in indigenous heritage-based […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Guard stabbed four times as  robbers raid Choppies for US$1 000",
            "url": "https://www.chronicle.co.zw/guard-stabbed-four-times-as-robbers-raid-choppies-for-us1-000/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nARMED robbers stormed a Choppies Supermarket in New Luveve suburb, Bulawayo, on Saturday night, leaving a trail of violence and terror.\n\nThe robbers, armed with guns, opened fire, narrowly missing a security guard. They then turned their brutality on other employees, stabbing one security guard four times and injuring the manager with a blow to the head.\n\nAfter overpowering the staff, the robbers forced the manager to open the main entrance, allowing them to escape on foot with a haul of US$1 000 in cash.\n\nThe drama unfolded just after 8pm, moments after the supermarket closed its doors for the evening. Staff were preparing to head home, and security personnel were conducting their routine checks.\n\nNearby vendors initially dismissed the sound of gunfire as celebratory fireworks, only to realise with growing horror that a robbery was underway.\n\nIt was just after 8pm when we heard the gun shots which we thought were firecrackers. We even chided the person, telling them not to do that near us. Moments later, we realised in horror that it was actually a gunshot, and we ran for our lives, said a female vendor who wished to remain anonymous.\n\nA nearby vendor indicated that security lights atop the building usually illuminate the area shortly before the shop closes. However, a power outage had plunged the vicinity into darkness, creating an ideal cover for the assailants.\n\nAn employee recounted the terrifying ordeal, stating that the robbers fired three shots.The first shot was aimed at the security guard who was conducting his routine end-of-day checks behind the building.\n\nMiraculously, the shot missed, sending the guard into flight for safety.\n\nWhen the shot was fired, one of the robbers manhandled the cashier, fired two shots in the air, and demanded to know where the manager was. In shock, the cashier told them the manager was at the back. In a flash, the manager had a gun pointed at his head and was ordered to open the shop, he said.\n\nThe manager sustained severe head injuries , while one of the security guards suffered multiple stab wounds  three to the leg and one to the arm.\n\nAfter collecting the days takings, they walked out on foot towards Cowdray Park, the employee added.National police spokesperson, Commissioner Paul Nyathi, confirmed the robbery and said investigations were underway.\n\nThe robbery occurred last night (Saturday) when the supermarket was closing. The security personnel were preparing for closure when they heard shots being fired. The suspects then forced the manager to open the front entrance, took some cellphones from employees and US$1 000 from the supermarket, and fled, said Comm Nyathi.\n\nHe stated that investigations are ongoing to determine the number of suspects involved and whether they utilised a vehicle during the robbery. He urged supermarket owners and managers to enhance security measures, particularly during closing hours, to deter and prevent similar incidents.\n\nIt is important for supermarkets to step up security during closing time because it is clear that these robbers were monitoring the situation and knew the shop had collected the days takings, said Comm Nyathi.\n\nNational Police Spokesperson Assistant Commissioner Paul Nyathi\n\nIn a chilling echo of a past incident, armed robbers targeted a Cash-in-Transit vehicle in Bulawayo in 2021. The vehicle, carrying over US$11 000 collected from various Choppies branches across the city, was making its final stop at the Choppies Parklands branch when it was ambushed. Suspicions of an inside job immediately arose, prompting police to question security guards and staff at the scene.\n\nFast forward to November of this year, and Bulawayo police delivered a significant blow to a notorious armed robbery syndicate that had been terrorising the city. In a meticulously executed operation, law enforcement apprehended eight individuals implicated in a string of 10 robberies.\n\nThe syndicates criminal activities resulted in the theft of goods valued over US$10 000 along with substantial sums of cash.The apprehended suspects, identified as Elvis Charakupa (40), Khulumani Moyo (51), Mavrick Dube (32), Mongameli Moyo (27), Nkosilomusa Dube (27), Qhawe Mabhena (43), Vumani Msipa (31), and Conilias Chigara (24), appeared before Bulawayo regional magistrate Mr Joseph Mabeza facing charges of robbery and illegal possession of firearms.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/JHBGJK.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw ARMED robbers stormed a Choppies Supermarket in New Luveve suburb, Bulawayo, on Saturday night, leaving a trail of violence and terror. The robbers, armed with guns, opened fire, narrowly missing a security guard. They then turned their brutality on other employees, stabbing one security guard four times and injuring the manager with […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "The World’s all-time top 50 players",
            "url": "https://www.chronicle.co.zw/the-worlds-all-time-top-50-players/",
            "content": "TODAY Chronicle continues with the si.com list of players ranked between 21-30 as already those in the 31-50 group have been published.\n\nIn this category are some exciting names which had the world spellbound because of their exploits on the field for top clubs and countries.\n\n30. Bobby MoorePeak: 1964-70Major Achievements: 1966 Fifa World Cup, 1970 Ballon dOr runner-up, 1964 FA Cup, PFA Player of the Century, Fifa World Cup All-Time Team.\n\nWinning the World Cup is an incredible achievement, and its one that would not have been possible without one of the greatest defenders and leaders of all time: Bobby Moore.A class act both on and off the pitch, Moore has been rightfully immortalized in statue form outside of Wembley Stadium.\n\n29. SocratesPeak: 1976-84Major Achievements: Three Campeonato Paulista, 1983 South American Footballer of the Year, 1980 Bola de Prata, 1976 Campeonato Paulista top scorer.\n\nA man as important off the field the as he was on it, he democratised Corinthians, creating a voting system for the clubs decision making process.\n\nThe Doctor is one of the most significant figures in Brazilian football history.A rare mix of elegance and power, Socrates was the perfect all-round midfielder.\n\nRonaldinho\n\n28. Sandor KocsisPeak: 1950-55Major Achievements: Olympic gold medal, 1954 Fifa World Cup Golden Boot, 1954 Fifa World Cup runner-up, 75 goals in 68 caps for Hungary, two La Liga titles, four Hungarian titles.\n\nSandor Kocsis scored 75 goals in 68 international appearances for Hungary.\n\nIn 1954, Sandor Kocsis scored 23 goals in 14 international appearances for Hungary. At the 1954 Fifa World Cup, Sandor Kocsis scored 11 goals in five games. All of the aforementioned facts exemplify one simple thing: Sandor Kocsis scored goals. A shocking amount of goals.\n\n27. Lothar MatthausPeak: 1988-92Major Achievements: 1990 Ballon dOr, 1991 Fifa World Player of the Year, 1990 Fifa World Cup, 1980 Uefa European Football Championship, two Uefa Cups, seven Bundesliga titles, one Scudetto, three DFB-Pokal titles.\n\nPut simply, Matthaus was the most complete player of his generation, a generation that just so happened to spawn the likes of Michel Platini, Diego Maradona, Zico etc.\n\nA natural born winner, and a natural born world shaker (his goal against Yugoslavia at the 1990 Fifa World Cup definitely registered on the Richter scale), Matthaus could, and did, do it all.\n\n26. RonaldinhoMajor Achievements: 2005 Ballon dOr, 2004 & 2005 Fifa World Player of the Year, 2005/06 Uefa Club Footballer of the Year, 2004 & 2005 FIFPro World Player of the Year, one Uefa Champions League, two La Liga titles, one Scudetto.\n\nThe candle that burns twice as bright burns half as long, is a quote that perfectly encapsulates Ronaldinhos career.Between 2004 and 2006, the world bore witness to something truly special: a footballer who played the beautiful game with genuine joy.\n\nThe flicks, the tricks, the gold boots, the smile, Ronaldinho was a walking advertisement for everything good about soccer.\n\nRuud Gullit\n\n25. Ruud GullitPeak: 1986-90Major Achievements: 1987 Ballon dOr, two-time Dutch Footballer of the Year, 1988 Uefa European Championship, two European Cups, three Scudetti, three Eredivisie titles, one Coppa Italia, one KNVB Cup.\n\nIn the late 80s, Gullit was the unstoppable force that led an unstoppable AC Milan juggernaut that dominated European soccer.Deservedly winning soccers equivalent of the MVP award (1987 Ballon dOr), the Dutch international was soccers equivalent to a triple-double machine.\n\n24. Bobby CharltonPeak: 1963-67Major Achievements: 1966 Ballon dOr, 1966 Fifa World Cup, 1966 Fifa World Cup Golden Ball, 1967/68 European Cup, three Football League First Division titles, 1962/63 FA Cup.\n\nRemember how good Frank Lampard was?Bobby Charlton was like Frank Lampard, only 100x better.The best player in the best England team of all time, Charlton was really, really, really good.\n\n23. Giuseppe MeazzaPeak: 1934-38\n\nMajor Achievements: 1934 & 1938 Fifa World Cup, 1934 Fifa World Cup Golden Ball, three Scudetti, one Coppa Italia, three Capocannoniere.\n\nSo good they named the most famous stadium in the world after him, Giuseppe Meazza is the first legend of Italian soccer.A mythical figure on the peninsula, those who know say Meazza is the greatest Italian footballer of all time; those who dont say hes the 23rd best player of all time.\n\nRomario\n\n22. Raymond KopaPeak: 1956-59\n\nMajor Achievements: 1958 Ballon dOr, 1961 French Player of the Year, 1958 Fifa World Cup All-Star Team, three European Cups, two La Liga titles, four Ligue 1 titles.\n\nRaymond Kopa is one of three geniuses of French soccer.A proverbial name in the top three of Ballon dOr voting throughout his peak years, Kopa was the creative force that enabled Ferenc Puskas and Alfredo Di Stefano to score a boatload of goals for Real Madrid in the 1950s and 60s.\n\nHe also helped guide Real Madrid to three European Cup triumphs.So yeah, by all accounts, a good player.\n\n21. RomarioPeak: 1990-94\n\nMajor Achievements: 1994 Fifa World Player of the Year, 1994 Fifa World Cup, 1994 Fifa World Cup Golden Ball, 1994 World Cup All-Star Team, 1989 & 1997 Copa America, one La Liga, three time Eredivisie, 1993/94 Pichichi winner.\n\nThe King of the Lob was one of the most composed and clinical goalscorers of the 1990s, who was also  most importantly  a big game player.\n\nA 1994 Fifa World Cup Golden Ball award here, a Clasico hat-trick there, Romario was a man for the big occasion.  si.com/Sports Reporter\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Romario.jpg",
            "description": "TODAY Chronicle continues with the si.com list of players ranked between 21-30 as already those in the 31-50 group have been published. In this category are some exciting names which had the world spellbound because of their exploits on the field for top clubs and countries. 30. Bobby Moore Peak: 1964-70 Major Achievements: 1966 Fifa […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "WATCH| Businessman’s generosity brings festive cheer to Skopo Adventist Mission",
            "url": "https://www.chronicle.co.zw/watch-businessmans-generosity-brings-festive-cheer-to-skopo-adventist-mission/",
            "content": "Mbulelo Mpofu recently in Nkayi\n\nSKOPO Adventist Mission in Nkayi recently witnessed a heart-warming scene of joy and gratitude as Mr Craig Tsepo Ntuliki arrived on behalf of the benevolent Bulawayo philanthropist, Mr Mthabisi Moyo.\n\nThe community, located 200 kilometres from Bulawayo, rejoiced as Mr Ntuliki brought essential resources to brighten the holiday season.\n\nSkopo Mission was transformed into a hub of festive cheer as Mr Ntuliki presented over 200 loaves of bread, 600 drinks, money, a beast for slaughter, and various gifts for local pupils. These items were symbols of Mr Moyos commitment to uplifting the community, and the response from the locals was overwhelmingly warm.\n\nThe atmosphere was electric with joyous laughter and heartfelt gratitude as the community welcomed Mr Ntuliki with open arms.\n\nMr Mthabisi Moyo\n\nMr Mqhuzula Nyathi, the headman from nearby Kimbi Village, expressed his gratitude for the kindness that Mr Moyo had shown.\n\nThe gifts brought much-needed relief to the community, and their appreciation shone through their smiles.\n\nThis is a wonderful gift for our community. We are grateful for Moyos generosity, which will bring joy to many families this festive season, Mr Nyathi said, visibly moved.\n\nMr Ntuliki, founder and director of Craluic Petroleum Solutions (Pvt) Ltd, emphasised the importance of philanthropy and community empowerment throughout his visit.\n\nHe shared that if he and Mr Moyo had been afforded more time, they would have liked to do even more for the people of Nkayi.\n\nWe believe in the power of giving and the impact it can have in uplifting communities. Its about creating opportunities and making a difference in peoples lives, he stated.\n\nThe visit also highlighted the valuable farming equipment that had been donated to the community by Dr Kudakwashe Tagwirei and his wife, Sandra, through the Bridging Gaps Foundation.\n\nMr Ntuliki noted that this equipment would significantly enhance agricultural productivity in the area, enabling local farmers to better support their families and contribute to the local economy.\n\nThe farming tools are a game-changer for this community. They will help families cultivate their lands more effectively, ensuring food security and improving livelihoods. Philanthropy shouldnt just stop at immediate relief; it should also focus on long-term sustainability, he remarked. As the day unfolded, Mr Ntuliki expressed profound gratitude for the opportunity to represent Mr Moyo and deliver these essential resources.\n\nHis admiration for the Tagwireis philanthropic efforts was evident as he acknowledged their commitment to improving lives across Zimbabwe.\n\nTheir work inspires us all. Collaboration among businesspeople and philanthropists is vital. Together, we can create a ripple effect of positive change, especially in rural and remote areas where the need is greatest, he said.\n\nMr Ntuliki captured the essence of giving by quoting Mother Teresa. Its not how much we give but how much love we put into giving.\n\nThis powerful statement resonated with the audience, serving as a reminder that the true spirit of philanthropy lies in the compassion and sincerity behind each gesture of kindness.\n\nAs the sun began to set over Nkayi, the community celebrated not only the gifts received but also the connections forged through generosity and goodwill.\n\nThe festive spirit was palpable, marked by laughter, shared stories, and a renewed sense of hope.Mr Moyos contributions have not only brought material support to Skopo Adventist Mission but also fostered a sense of unity and purpose among the community members.\n\nThe day served as a powerful reminder that even small acts of kindness rooted in love can have a profound impact on the lives of others. Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/EW.jpg",
            "description": "Mbulelo Mpofu recently in Nkayi SKOPO Adventist Mission in Nkayi recently witnessed a heart-warming scene of joy and gratitude as Mr Craig Tsepo Ntuliki arrived on behalf of the benevolent Bulawayo philanthropist, Mr Mthabisi Moyo. The community, located 200 kilometres from Bulawayo, rejoiced as Mr Ntuliki brought essential resources to brighten the holiday season. Skopo […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Mpilo Hospital opens dedicated mental health clinic amid drug abuse crisis",
            "url": "https://www.chronicle.co.zw/mpilo-hospital-opens-dedicated-mental-health-clinic-amid-drug-abuse-crisis/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTO address the growing crisis of drug and substance abuse in Zimbabwe, Mpilo Central Hospital has established a dedicated Mental Health Clinic.\n\nThe facility facilitates crucial support services, including specialised therapy for individuals grappling with substance addiction and those contemplating suicide.\n\nThe Government has recognised the gravity of the drug and substance abuse crisis and established a national task force to mitigate the problem.\n\nOne key strategy involves easing the overwhelming influx of drug-related cases at Ingutsheni Central Hospital in Bulawayo, which is the countrys primary psychiatric institution.\n\nWith drug and substance abuse cases constituting a significant portion of admissions, the Government aims to reduce the burden on Ingutsheni.\n\nThe drug and substance abuse crisis is widespread and affects people of all age groups. The youngest victims of the situation are 10 years old, while the oldest are 65 years old.\n\nSpeaking to the Chronicle, Sister Hango Ndebele, the head of the newly established Mental Health Clinic at Mpilo Hospital, explained the departments unique focus.\n\nSister Hango Ndebele\n\nUnlike other services in the hospital, the clinic specialises solely in addressing mental health concerns.\n\nThis unit is different from other units in the hospital in the sense that it provides comprehensive mental health services. We treat the client using a holistic approach. We dont simply focus on the mental illness but attend to the physical side as well, said Sister Ndebele.\n\nWe advocate for their treatment and involve family members in their care. The department is part of the Inter-Ministerial Task Force set up by the President to help fight the substance use issue, she said.\n\nThe National Task Force Combating Drug and Substance Abuse comprises seven key pillars, with the Ministry of Health and Child Care leading the crucial pillar focused on harm reduction and patient treatment.\n\nSister Ndebele stressed that the department at Mpilo Hospital provides comprehensive care, serving both inpatients and outpatients. She highlighted the significant threat that drug and substance abuse poses to the progress made in HIV prevention efforts.\n\nWhen we talk about harm reduction, we are saying for some reason you cannot stop, we cant just abandon you. We screen for HIV, TB, hepatitis, kidney function, and liver function, and we work with you to reduce your intake until you can resolve to stop, she said.\n\nSister Ndebele said that some patients voluntarily seek treatment at the clinic, while others are brought in by their families or emergency services in a state of intoxication or unconsciousness.\n\nShe noted that some patients display psychotic symptoms as a direct consequence of their substance and drug use.\n\nIn relation to substance use disorders, they start as early as the age group of 10 to 17 years, but the most dominant group is 35 to 45 years old, the working group. We do get those above 65 years, but not on a large scale.\n\nThe clinic has helped ease congestion at Ingutsheni Central Hospital as patients can get their medication at the hospital. The unit is currently manned by four mental health nurses trained by the World Health Organisation and by Gap and Friendship Bench in problem-solving therapy.\n\nIngutsheni Hospital\n\nWe also offer counselling services at the clinic. We have psychologists who assist us voluntarily as well. We also go out to schools to screen for depression, anxiety, and substance use, and also offer counselling, she said.\n\nTo ensure that mental health support reaches everyone, the unit extends its services beyond the hospital walls. They actively engage with corporate organisations, conducting workshops and presentations to raise awareness about mental health issues within the workplace.\n\nThrough a valuable partnership with Friendship Bench, the clinic has successfully trained community health workers. These trained individuals play a crucial role in identifying individuals in need of mental health support and referring them to the clinic for appropriate care.\n\nThe clinic also provides vital counselling services to individuals contemplating suicide, including those who have previously attempted to end their lives.\n\nWe handle para-suicide patients almost daily and offer counselling and other psychotherapies. We involve the family as they are affected as well. We also screen for depression and anxiety. For para-suicide, its mainly women, and with women, its a cry for attention, unlike men who use lethal forms and dont stop halfway. But we do have some as well, said Sister Ndebele.\n\nThe clinic actively engages in community outreach programmes, conducting mental health awareness campaigns to address the growing concern of drug and substance abuse.\n\nEvery quarter, we hold awareness campaigns and mental health drives in the community as a province. We have been to Ngozi Mine, Cowdray Park, Nkulumane, and this last one we integrated with a TB screening drive and offered mental health services in Emganwini, Nketa, and Mabuthweni, said Sister Ndebele.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/05/Untitled-23-6.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw TO address the growing crisis of drug and substance abuse in Zimbabwe, Mpilo Central Hospital has established a dedicated Mental Health Clinic. The facility facilitates crucial support services, including specialised therapy for individuals grappling with substance addiction and those contemplating suicide. The Government has recognised the gravity of the drug and substance […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "More faith groups should speak out against cyberbullying and hate speech",
            "url": "https://www.chronicle.co.zw/more-faith-groups-should-speak-out-against-cyberbullying-and-hate-speech/",
            "content": "ZIMBABWE has been grappling with an unprecedented increase in cyberbullying and hate speech on social media platforms, especially on X (formerly Twitter).\n\nThis has resulted in a surge of online violence, character assassination and the belittling of other peoples values and beliefs. The situation has become so alarming that it is now a matter that requires urgent attention and remedies.\n\nAmid all this, the church remains a crucial stakeholder in the countrys development and transformation. President Mnangagwa acknowledged this in his speech at the National Thanksgiving and Dedication Service in Bulawayo yesterday.\n\nThe church has been instrumental in developmental projects across the country and has served as a beacon of hope for many Zimbabweans. It has been pivotal in promoting unity and love among people of different races, tribes and religious backgrounds.\n\nHowever, Zimbabwe is in dire need of a church that offers spiritual guidance and moral leadership that will help the country navigate its growing cyberbullying and hate speech problem. The church has a unique position of trust and credibility in the community, and it is well-placed to lead efforts to unite Zimbabweans in the wake of divisive narratives that have emerged in the country.\n\nNational prayer preview at ZITF\n\nIt is, therefore, essential that the church takes a leading role in promoting tolerance of divergent views and love for ones country. This should involve the publication of discerning teachings on immoral and harmful speeches while also preaching about the values of patriotism  teaching about the dangers of hatred and encouraging people to appreciate unity in diversity amidst the ongoing political polarisation.\n\nThe church should prioritise engagements that involve critical conversations and debates around the issues affecting the nation.\n\nThis will require a concerted effort, and all faith groups need to come together under the banner of love and unity for Zimbabwe. It is commendable that some churches and religious organisations have already taken a stand against cyberbullying and hate speech by condemning any form of online violence and intolerant behaviour on social media platforms.\n\nMore faith groups should speak out against cyberbullying and hate speech. This should involve actively monitoring the social media activities of their congregants and urging them to desist from using hate speech or engaging in other forms of online violence.\n\nIt is also crucial that the Government works closely with the church in this regard. The Government should prioritise efforts aimed at promoting peace, harmony and unity in the country, with the church playing a key role in this process.\n\nThe church in Zimbabwe has a vital role to play in promoting a culture of tolerance, peaceful co-existence and love. All faith groups must work together. The church has a unique position of moral authority and credibility, which it must use for the greater good of Zimbabwe.\n\nIt is time for the church to step up and take the lead in helping to unite Zimbabweans and promote a culture of tolerance and love.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jyukiyuiu-680x380.jpg",
            "description": "ZIMBABWE has been grappling with an unprecedented increase in cyberbullying and hate speech on social media platforms, especially on X (formerly Twitter). This has resulted in a surge of online violence, character assassination and the belittling of other people’s values and beliefs. The situation has become so alarming that it is now a matter that […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Zimbabwe targets MSMEs for VAT compliance",
            "url": "https://www.chronicle.co.zw/zimbabwe-targets-msmes-for-vat-compliance/",
            "content": "Nokuthaba Brita Ncube,[emailprotected]\n\nIN a bid to enhance tax compliance among Micro, Small, and Medium Enterprises (MSMEs), the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, has proposed extending the Virtual Fiscalisation System for recording Value Added Tax (VAT) taxable transactions to MSMEs.\n\nMSMEs currently account for about 86 percent of overall economic activity.Zimbabwes informal economy has grown rapidly over the years, spanning diverse economic sectors as locals find innovative ways to fend for themselves.\n\nThis growth has led to the emergence of numerous informal businesses that operate outside formal tax systems and do not fulfil their tax obligations.\n\nA few formalised businesses carry the tax burden for non-compliant businesses, leading to higher production costs and reduced competitiveness of local products.\n\nFiscalisation, according to Zimra, refers to configuring fiscal devices to enable them to record sales and other tax information on the read-only fiscal memory (fiscal devices) at the time of sale for use by the tax authority in VAT administration (Statutory Instrument 104 of 2010).\n\nThe proposed initiative will be effective in the first quarter of 2025.\n\nI propose to extend the Virtual Fiscalisation System for the recording of VAT taxable transactions to Micro and Small Enterprises whose turnover falls below the VAT registration threshold for purposes of monitoring sales, during the first quarter of 2025, Prof Ncube stated in his national budget statement last month.\n\nMthuli Ncube\n\nThis will assist in promoting transparency and ultimately enhance tax compliance among Micro and Small Enterprises.\n\nIn September last year, Zimra also introduced QR codes, allowing taxpayers to scan and validate transactions.Several businesses were using cash registers, which became outdated due to this new requirement.\n\nIn the 2024 Budget Strategy Paper, Prof Ncube said achieving the target revenue collections was underpinned by tax administration initiatives that enhance enforcement and tax compliance, particularly of business processes and the adoption of new technology.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/01/MSMEs.jpg",
            "description": "Nokuthaba Brita Ncube, ncubenokuthababrita@gmail.com IN a bid to enhance tax compliance among Micro, Small, and Medium Enterprises (MSMEs), the Minister of Finance, Economic Development and Investment Promotion, Professor Mthuli Ncube, has proposed extending the Virtual Fiscalisation System for recording Value Added Tax (VAT) taxable transactions to MSMEs. MSMEs currently account for about 86 percent of […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "2024 Bulawayo Shutdown: A night of unforgettable performances",
            "url": "https://www.chronicle.co.zw/2024-bulawayo-shutdown-a-night-of-unforgettable-performances/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nTHE 2024 Byo Shutdown lived up to its billing as one of the most electrifying events of the year. It brought together top Zimbabwean talent for a night to remember.\n\nThe show at the Zimbabwe International Trade Fair (ZITF) Hall 1 celebrated local music, culture, and energy.An Unstoppable Line-up\n\nHosted by Sandra Ndebele, the night was filled with high-energy performances, bringing together some of the best artistes from across Zimbabwe.\n\nThe MCs, Mzoe 7, Metty Intombiemfitshane, and DJ Nospa, energised the crowd with their lively interactions and infectious vibes.\n\nMzoe7\n\nMzoe 7s fashion statement  changing into seven different outfits throughout the night  set the tone for the audience, who were dressed to impress.\n\nThe night kicked off with DJ Stout, who set the pace with a one-hour set before passing the baton to DJ Sfiso.The crowd was treated to an electrifying mix of deep house, thanks to DJ Ash T and Kotwane Hikwa, who played back-to-back sets. Feel G, Zulu Da House Maniac, Vitor Bravo, and Sancia continued the party, spinning tracks that kept everyone on their feet.\n\nVibes, Energy and Iconic MomentsBoy Nino brought the hip-hop vibes before Jaycee and Ma9Nine took to the stage to perform their hit remix of Ungayithi Vuu. At around 7.30pm, Insimbi ZeZhwane brought their signature Rhumba sound to the stage, with GPS becoming a fan favourite that had the crowd singing along.\n\nAs the night wore on, the energy only intensified. The performers maintained a powerful connection with the audience, dancing and engaging them throughout their sets. There were moments of unity, such as the vosho and Ngamanzi Te dances, which got the crowd moving and singing along.\n\nSandra Sandy Ndebele, the queen of the night, didnt just host; she connected with the crowd on a deeper level, even stepping into the role of a community leader, handing out parcels to the audience. Her presence added a unique flair to the event, reminding everyone of her long-standing influence in Zimbabwean music.\n\nSandra Ndebele\n\nNgwere, affectionately known as Silent Killer, brought the house down with his witty lyrics before the crowds favourite, Enzo Ishall, took over. Enzos A-game performance was met with thunderous applause, and it was clear that hes still a force to be reckoned with.\n\nFreeman entered the stage at exactly 11.47pm, and his performance was the highlight of the night. Chahwiriri got the crowd moving, and his mix of old hits and new tracks showed why he remains a key figure in Zimbabwes music scene.Iconic Performances and Crowning Moments\n\nKiller T, with his undeniable stage presence, followed Freeman, delivering hit after hit. His performance of Kana Ndanyura had the crowd singing every word, a testament to his popularity. Jah Prayzah, who has become one of Zimbabwes most influential musicians, brought his own unique energy to the stage. His set was filled with crowd favourites like Mdara Achauya and Nziya YeRudo.\n\nJah Prayzah\n\nWinky D, the undisputed king of Zimbabwean dancehall, came on stage shortly before 3am and put up a splendid performance.His ability to engage the audience, even with a five-minute song, was nothing short of magical. The crowd finished his lyrics, word for word.\n\nThe show closed with Saintfloew and Nisha TS, who kept the party going with their upbeat track Kutsamwa Kune Labour, sending everyone home with a smile.\n\nTop Performers of the Night\n\nFreemanFreemans performance was nothing short of flawless. He entertained a lively crowd, eager to dance, and kept them energised with his hits. His mix of new and old tracks, such as Kunyepa Ndisiye and Zvakaipa Dai Ndarega, showcased his versatility as an artiste. Freemans stage presence was magnetic, and the crowds response made it clear that he was still at the top of his game.\n\nMaster H2024 has been a breakthrough year for Master H. From a rising artiste to one of the most talked-about acts in the industry, his performance showed why hes earning so much attention. His infectious energy and versatility shone through, and his live act, especially the track Nawanadem, has made him a serious contender for Song of the Year.\n\nKiller TKiller T delivered a performance that confirmed his place as one of Zimbabwes top artistes. Known for his catchy hooks and dynamic stage presence, he had the crowd eating out of his hand. Kana Ndanyura was the standout track of the night, and his energy never wavered, making him one of the highlights of the evening.\n\nJah Prayzah\n\nJah Prayzah continues to prove why he is one of the most influential musicians in Zimbabwe. His performance was a perfect mix of traditional and modern sounds, and his ability to connect with the audience was exceptional. Tracks like Mdara Achauya and Nziya YeRudo had the crowd singing and dancing until the early hours of the morning.\n\nWinky DWinky D, the king of Zimbabwean dancehall, closed the show in grand fashion. His performance, which included a powerful set of hits, was a masterclass in stage presence.\n\nThe crowd was completely in tune with him, singing along to every word, and his ability to control the energy of the room was unmatched.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/WhatsApp-Image-2024-12-29-at-14.28.43-680x380.png",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com THE 2024 Byo Shutdown lived up to its billing as one of the most electrifying events of the year. It brought together top Zimbabwean talent for a night to remember. The show at the Zimbabwe International Trade Fair (ZITF) Hall 1 celebrated local music, culture, and energy. An Unstoppable Line-up Hosted by […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "No hunger despite worst drought — Minister Masuka",
            "url": "https://www.chronicle.co.zw/no-hunger-despite-worst-drought-minister-masuka/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nLANDS, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, has described the current drought affecting Zimbabwe as an anomaly, highlighting the absence of the typical long food queues often associated with such periods.\n\nHe attributed this unusual situation to the astute leadership of President Mnangagwa, emphasising that the Second Republic is committed to ensuring no citizen goes hungry.\n\nDuring a brief presentation on the state of agriculture at the 8th National Thanksgiving and Dedication Service in Bulawayo yesterday, Dr Masuka highlighted the availability of adequate, affordable food despite the unprecedented severity of the El Nio drought, the worst since Zimbabwes independence.\n\nDr Anxious Masuka\n\nThe El Nino drought is the worst since Zimbabwes independence, yet it is the most normal drought, with no queues and no escalation in food prices. This is all because of the astute leadership of President Mnangagwa.\n\nWe have enough food to feed 6,54 million people until March 2025, and enough to feed 4,5 million learners up to Grade 7 until April 2025. The Government is also distributing cash to 1,7 million vulnerable urban people, said Dr Masuka.He further outlined the Governments proactive measures to address the food security challenges.\n\nThe Government is directly supporting 12,74 million people, which is 83,4 percent of the population.President Mnangagwa has consistently stated that no one and no place will be left food-insecure.\n\nThe Government has implemented measures to avert food shortages by ensuring food security at the household level for vulnerable families across the country until the next harvest.\n\nIn the 2023-2024 farming season, Zimbabwe and southern Africa experienced El Nino weather conditions characterised by low rainfall and extremely high temperatures.Due to these conditions, farmers across the country watched their crops wilt during extended dry periods.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/09/Min-Dr-Anxious-Masuka-2.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw LANDS, Agriculture, Fisheries, Water and Rural Development Minister, Dr Anxious Masuka, has described the current drought affecting Zimbabwe as an anomaly, highlighting the absence of the typical long food queues often associated with such periods. He attributed this unusual situation to the astute leadership of President Mnangagwa, emphasising that the Second Republic […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Zimbabwe’s trade deficit narrows",
            "url": "https://www.chronicle.co.zw/zimbabwes-trade-deficit-narrows/",
            "content": "Sikhulekelani Moyo,[emailprotected]\n\nZIMBABWES trade deficit narrowed to US$46,9 million in November, representing a 60 percent decrease from US$137,8 million recorded in October, with the United Arab Emirates (UAE), South Africa, and China continuing to be the top export destinations, official figures show.\n\nA trade deficit occurs when a countrys value of imports is greater than that of exports in a given period. When the value of exports exceeds the value of imports, it implies a trade surplus.\n\nLatest data from the Zimbabwe National Statistics Agency (ZimStat) also reflects that the country recorded a 29,7 percent export increase to US$905,2 million from the October value of US$698,1 million.\n\nThe November 2024 trade deficit for goods was US$46,9 million, translating to a 66 percent decrease from a deficit of US$137,8 million recorded in October 2024.\n\nImports for November 2024 amounted to US$952,1 million, an increase of 13,9 percent from US$835,9 million recorded in October 2024, said ZimStat acting director for macro-economics, Ms Mable Chimhore, during a recent external trade statistics presentation.\n\nThe narrowing trade deficit comes at a time when Zimbabwe is becoming more integrated into global supply routes, with new markets presenting export opportunities for local products and services.\n\nAccording to ZimTrade, buyers across the world are now looking at Zimbabwe as a source market, with Zimbabwean products gaining mileage due to their high quality.\n\nThe growing appetite for Zimbabwean goods follows a robust campaign by President Mnangagwa to increase the visibility of local products in regional and international markets. With the current approach to economic diplomacy, several export promotion activities have been undertaken in recent years by ZimTrade.\n\nZimStat indicates that among the top 10 products exported in November were semi-manufactured gold (39,7 percent), tobacco (30,5 percent), and nickel mattes (11 percent). On the import side, mineral fuels constituted 22,1 percent, machinery and mechanical appliances (11,9 percent), cereals (9,1 percent), and vehicles (7,6 percent).\n\nAmong the major source countries for imports in November 2024 were South Africa (39,3 percent), China (13,2 percent), Bahamas (9,3 percent), and Singapore (5 percent), said Ms Chimhore.\n\nThe four countries accounted for around 67 percent of the total import value of US$952,1 million. @SikhulekelaniM1\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/trtr.jpg",
            "description": "Sikhulekelani Moyo, mskhulekelani16@gmail.com ZIMBABWE’S trade deficit narrowed to US$46,9 million in November, representing a 60 percent decrease from US$137,8 million recorded in October, with the United Arab Emirates (UAE), South Africa, and China continuing to be the top export destinations, official figures show. A trade deficit occurs when a country’s value of imports is greater […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        }
    ]
}