{
    "news": [
        {
            "title": "Isak might cost Liverpool £120m- Sunday’s gossip",
            "url": "https://www.chronicle.co.zw/isak-might-cost-liverpool-120m-sundays-gossip/",
            "content": "Alexander Isak might cost Liverpool 120m or more, Senegal midfielder Lamine Camara is attracting Premier League interest, Arsenal and Chelsea are linked with RB Leipzigs Benjamin Sesko.\n\nLiverpool might have to pay 120m or more to sign Sweden striker Alexander Isak, 25, from Newcastle United  and face competition from Chelsea and Arsenal. (Give Me Sport), externalTottenham, Liverpool, Manchester City and Chelsea have joined a list of Europes top clubs chasing Monacos 21-year-old Senegal midfielder Lamine Camara.\n\nArsenal and Chelsea have also been linked with a possible move for RB Leipzigs Slovenia striker Benjamin Sesko, with the 21-year-old unlikely to stay at the fourth-placed Bundesliga club if they fail to qualify for next seasons Champions League.Chelsea and Liverpool, meanwhile, could battle it out for RB Leipzigs highly rated France centre-back Castello Lukeba, although Real Madrid are also among the 22-year-olds long list of admirers.\n\nBayern Munich chief Karl-Heinz Rummenigge says the Bundesliga leaders want to compete for the signing of Bayer Leverkusens 21-year-old Germany forward Florian Wirtz, who has been linked with a summer move to Manchester City.\n\nArsenal could be left to rue selling striker Mika Biereth, 22, to Sturm Graz for 4m in the summer  the Danish youth international went on to score 11 goals in 16 games for the Austrian Bundesliga side before netting 10 goals in seven league matches for Monaco after moving for 10,7m in January.\n\nReal Betis are exploring a longer-term deal for on-loan Brazil winger Antony but are unlikely to be able to afford the Manchester United players wages or fee, which is expected to be 41m.\n\nLiverpool are keeping tabs on Brightons Carlos Baleba before a potential summer move for the 21-year-old defensive midfielder from Cameroon. Barcelona are closely monitoring Manchester United winger Alejandro Garnacho, 20, with a view to completing a move for the Argentina international in the summer.\n\nChelsea are preparing to complete a deal worth 12.4m plus add-ons for Corinthians 17-year-old Brazilian full-back Denner Evangelista, who would join the west London club in 2026.\n\nChelseas potential new recruit  whose full name is Denner Alves Evangelista Pereira but is known simply as Denner  is the cousin of Arsenals Brazil defender Gabriel Magalhaes.\n\nAston Villa are hoping to complete a double swoop for complete forward Charalampos Kostoulas, 17, and his Greece and Olympiakos team-mate Christos Mouzakitis, 18. BBC\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/rffr.jpg",
            "description": "Alexander Isak might cost Liverpool £120m or more, Senegal midfielder Lamine Camara is attracting Premier League interest, Arsenal and Chelsea are linked with RB Leipzig’s Benjamin Sesko. Liverpool might have to pay £120m or more to sign Sweden striker Alexander Isak, 25, from Newcastle United — and face competition from Chelsea and Arsenal. (Give Me […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "Roads crumble, commuters stranded… Long nightime walks for residents of crime-ridden suburbs",
            "url": "https://www.chronicle.co.zw/roads-crumble-commuters-stranded-long-nightime-walks-for-residents-of-crime-ridden-suburbs/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nBULAWAYOS road network is crumbling under the strain of heavy rains, deepening potholes and forcing commuter omnibus operators to avoid smaller roads in both western and eastern suburbs.\n\nThe worsening road conditions have disrupted public transport, with some routes being completely abandoned by kombi drivers. Passengers who once enjoyed being dropped off at stops within their neighbourhoods now face long and often dangerous walks home.\n\nAs the potholes widen and deepen with every downpour, commuters are left stranded, vulnerable, and at the mercy of criminals as public transport operators shun impassable routes.\n\nIn Magwegwe North, kombis used to access various stops throughout the suburb. However, with the roads now virtually impassable, residents say they are being dropped off at a single terminus, forcing them to walk long distances, sometimes late at night.\n\nMotorists navigate Bulawayos potholed roads\n\nFor Mrs Martha Ncube, a vegetable vendor in Magwegwe North, early mornings have turned into a daily gamble. Once, she could board a kombi near her house, a convenience that meant she didnt have to walk long distances in the dark. Now, the only option is the terminus, half a kilometre away, and the journey home after sunset is nerve-wracking.\n\nCrime has gone up. We are seeing more people being mugged because we are forced to walk long distances in the dark. I have to wake up at 4AM to get vegetables in town, and that walk to the terminus is terrifying, she said.Ms Ncube said the drivers refuse to go deeper into the suburb because the roads are too bad.\n\nThe story is the same in Pumula North. Mr Sibusiso Ndoro, a father of three, no longer feels safe walking home at night. Kombis that used to drive to his street have stopped, leaving him with a long trek from the main road.I live near Pumula High School. Kombis used to drop us at the schools main gate, but now they just turn around at the main road. No driver wants to risk their vehicle on these terrible roads, he said.\n\nI have had to run before after hearing footsteps behind me at night. Its a scary situation.The worsening road conditions are not just inconveniencing passengers but are hitting transport operators where it hurts most. Vehicle maintenance costs have skyrocketed as potholes take their toll on tyres, control arms, and suspension systems.\n\nMr Anesu Muvima, a kombi driver, no longer services parts of Pumula East because the cost is simply too high.The fare is R10 per passenger, but if I damage my vehicle driving into Pumula East, that money is not worth it. I have had to repair my suspension three times in two months. So, Id rather stay on the main road, he said.\n\nBulawayo United Passenger Transporters Association (BUPTA) chairman, Mr Morgan Msipa, whose organisation operates 1 300 kombis across the city, painted a bleak picture of the impact of the road crisis.\n\nTheres a road in Richmond called Glenvire Road and its so bad. I feel sorry for the vehicle owners who have to use it. And thats just one example.\n\nKombi operators are not refusing to take people closer to their homes out of malice, they simply cant afford the damages, he explained.\n\nThe crisis extends beyond the suburbs and into the heart of the city. Even the city centre, Bulawayos commercial hub, has turned into a minefield of potholes. At the intersection of Lobengula Street and 3rd Avenue, a crater-like pothole has been wreaking havoc for months, forcing drivers to manoeuvre dangerously to avoid it while giving way to traffic.\n\nDrivers are at pains trying to avoid that pothole, but in doing so, they either scratch their cars against others or risk an accident. The city council must act, said Mr Msipa.\n\nMotorists like Mr Malvin Kruger Ncube, a former president of Team VW Bulawayo, know all too well the cost of these treacherous roads.\n\nI cracked two of my 18-inch rims in the city centre because of potholes. It happened at George Silundika near the market area. Im constantly repairing my suspension, buying new tyres, fixing rims, which is financially draining, he lamented.Sixth Avenue Extension, which I use daily, is riddled with potholes, especially near a bridge in Mzilikazi. We are having a tough time with these potholes around the city centre.\n\nWard 17 Councillor Sikhululekile Moyo acknowledged the crisis but insisted that efforts are being made to improve the situation.\n\nA grader has been organised to work on the road leading to St Peters Village past Robert Sinyoka Primary School. We are pushing for more funding to fix the roads, not just in my ward but across the city, she said.\n\nAccording to Bulawayo City Council (BCC) statistics, the city has over 2 400 km of roads, much of which is in dire need of rehabilitation. While patchwork repairs have been attempted in some areas, many roads require complete reconstruction to restore them to a usable state.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/cxe-680x380.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com BULAWAYO’S road network is crumbling under the strain of heavy rains, deepening potholes and forcing commuter omnibus operators to avoid smaller roads in both western and eastern suburbs. The worsening road conditions have disrupted public transport, with some routes being completely abandoned by kombi drivers. Passengers who once enjoyed being dropped off […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "First national education radio and television channel ready for launch",
            "url": "https://www.chronicle.co.zw/first-national-education-radio-and-television-channel-ready-for-launch/",
            "content": "Nqobile Tshili,[emailprotected]\n\nZIMBABWE will soon launch its first national education radio and television channel as the Government intensifies efforts to strengthen blended learning and bridge the gap in accessing quality education between urban and rural learners.\n\nThe national educational channel is meant to address the existing disparities which have seen pupils from elite schools outperforming those in rural communities. The initiative will ensure that all learners, regardless of location or socio-economic background, have access to quality educational content.\n\nStudios for the new channel are being worked on at the Zimbabwe Broadcasting Corporation (ZBC) Montrose Studios in Bulawayo. The Ministry of Primary and Secondary Education has procured essential studio equipment and is working in partnership with the Ministry of Information, Publicity and Broadcasting Services to roll out the programme.\n\nResponding to questions from Chronicle, Permanent Secretary for Primary and Secondary Education, Mr Moses Mhike, described the education channel as a transformative step towards improving the countrys education sector.\n\nThis initiative marks a historic step towards leveraging efficient, affordable mass media (TV/radio) to ensure no child is left behind, especially in rural Zimbabwe where most schools are, he said.\n\nThis historic step also supports remote, distance, blended, mobile and flipped classroom learning to augment traditional teaching through providing digital content to disadvantaged learners with limited technology access.The project will be launched in phases, aligning with the 2025 academic year.\n\nThe Education studio at ZBC Montrose\n\nThrough this initiative, the ministry aims to deliver high-quality, up-to-date educational content to enhance learning effectiveness. The channel will also align economic and social goals by standardising an inclusive, heritage-based curriculum.Mr Mhike said the educational channel will play a transformative role in terms of accessibility to free, equitable and quality educational content, particularly for pupils in rural areas with limited internet or infrastructure.\n\nThis will ensure that all pupils receive a consistent, evaluated heritage-based curriculum, thereby reducing disparities in accessing quality education, he said.\n\nMr Mhike said the channel will also create resilience in the education sector by ensuring continuous learning during disruptions caused by pandemics and natural disasters.\n\nThe outbreak of Covid-19, which resulted in schools being closed for prolonged periods, saw the Ministry of Primary and Secondary Education introducing television and radio lessons, albeit on a limited scale.Mr Mhike said the education channel will provide supplemental resources for learning through delivering interactive lessons, expert-led instructions and multimedia tools (videos, animations) to enhance engagement.\n\nThis channel will focus on core subjects such as science, technology, engineering and mathematics (STEM), languages and extracurricular topics such as life skills and environmental education. This initiative positions Zimbabwe as a regional leader in leveraging technology for an inclusive, resilient and quality education system, he said.\n\nMr Mhike said the channel will be managed by the Ministry of Primary and Secondary Education, ensuring alignment with the heritage-based curriculum.\n\nPartnerships will include educational institutions, NGOs and development partners. Content categories will include but not limited to in-school supplementary materials developed by subject experts, he said.\n\nMr Mhike said the channel will also have interactive features such as live question-and-answer sessions, SMS quizzes, and community viewing groups, while regular impact assessments via pupil performance data and viewer feedback will be continuously carried out.\n\nHe said some of the programming will include non-formal learning resources for out-of-school youth/adults and storytelling for infant learners through community-engaged programming for early education.Mr Mhike said there will be a teachers forum in the channel where educators will develop content for pupils.\n\nHe said the ministry will also tailor-make special needs programming as part of inclusive learning.Mr Mhike said the channel will also unpack the ministrys policies and initiatives while providing recordings to national educational events.\n\nZBC Montrose\n\nThe education channel is expected to help resolve several long-standing challenges in the education sector, including textbook shortages in schools and teacher shortages in under-served areas.\n\nThe channel will address disparities by counterbalancing textbook shortages in under-served areas while mitigating teacher shortages through expert-led content and forums for upskilling teachers. We aim to reach marginalised communities by prioritising rural areas and pupils with disabilities through features such as subtitles and sign language, said Mr Mhike.\n\nThe initiative will also close geographical and socio-economic barriers that may limit learning opportunities.It will be interesting to note the multimedia learning that will take place using animations, simulations, and expert lectures to improve comprehension. Furthermore, multilingual content will also be available for delivering lessons in all the 16 Zimbabwean languages to promote inclusivity, he said.\n\nTo ensure the channels long-term sustainability, Mr Mhike said Government will implement a hybrid funding strategy combining state support and private sector partnerships. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/4EF3FG.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw ZIMBABWE will soon launch its first national education radio and television channel as the Government intensifies efforts to strengthen blended learning and bridge the gap in accessing quality education between urban and rural learners. The national educational channel is meant to address the existing disparities which have seen pupils from elite schools […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "Bosso go down in first game",
            "url": "https://www.chronicle.co.zw/bosso-go-down-in-first-game/",
            "content": "Bruce Chikuni, Zimpapers Sports HubMWOS FC 1-0 Highlanders\n\nIT was a dream start to the Castle Lager Premiership for newcomers MWOS, who could not have asked for a better beginning after edging Highlanders in their league opener.\n\nThe outcome was everything team boss Patrick Tamson could have dreamed of, starting their PSL journey with a win against Bosso.\n\nOne can only imagine the atmosphere in Norton had this match been played at Ngoni, the teams fortress, which is still under construction.\n\nNonetheless, the celebrations began at Baobab in Mhondoro-Ngezi, where MWOS fans gathered in numbers to witness the clubs finest hour.\n\nPatrick Tamson\n\nMashonaland West Province witnessed the birth of their new club, which promised more on its first step.MWOS started strongly, nearly scoring the opener, but Innocent Zambezis effort sailed over the bar in the 11th minute.\n\nThey came close again through Tafadza George, who failed to direct his header three minutes later.Highlanders forward Brighton Ncube missed a golden opportunity in the 20th minute, taking too long to hit the target despite dribbling past goalkeeper Martin Mapisa.\n\nThat moment sparked a sense of urgency in Bosso, who briefly asserted their dominance.However, the hosts soon regained control, and forward Salif Cheya failed to fire the Panthers ahead, with only the goalkeeper to beat, in the 30th minute.\n\nCheya broke the deadlock with a 61st-minute strike, capitalising on goalkeeper Rafael Pitisis dreadful error, following his failed attempt to show off his dribbling skills.\n\nPrince Ndlovu recorded Bossos first shot on target in the 63rd minute, but Mapisa was untroubled.George thought he had found the second goal from range, but his effort went inches wide five minutes later.\n\nMalvin Mudzvuka was denied by the crossbar in the 79th minute after a neat build-up by the hosts.The body language of Bosso players gave their travelling fans no reason to support the team in their hour of need as they lacked ambition in their approach.\n\nMWOS Nigel Matina ran the show with exciting dribbles, keeping fans on the edge of their seats for most of the game.Bosso coach, Kelvin Kaindiu attributed the loss to poor pre-season preparations.\n\nIt was not a good start for us, we did not have a good preseason. I think you all saw even the way we played. We are going to try to use these early games to condition ourselves and I think we conceded a soft goal, said Kaindu.His counterpart Lloyd Mutasa felt his troops could have even won with a better margin.\n\nIt is still work in progress and I have to give credit to the players for a spirited fight, it is not easy to beat Highlanders any day.With a little bit of luck, we could have scored more than two goals but we are just grateful with what we managed, it is something which we can work on, said Mutasa.\n\nPSL Week One results\n\nMWOS 1 Highlanders 0, Dynamos 0 ZPC Kariba 0, Scottland 1 Triangle 0, Green Fuel 1-1 Caps United, Simba Bhora 0-0 FC Platinum, Herentals College 2-1 TelOne FC , Manica Diamonds 0-0 Yadah FC , Chicken Inn 0-0 Bikita Minerals , Kwekwe United 1-1 Ngezi Platinum\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ythhy-1.jpg",
            "description": "Bruce Chikuni, Zimpapers Sports Hub MWOS FC 1-0 Highlanders IT was a dream start to the Castle Lager Premiership for newcomers MWOS, who could not have asked for a better beginning after edging Highlanders in their league opener. The outcome was everything team boss Patrick Tamson could have dreamed of, starting their PSL journey with […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "COMMENT: More companies must emulate Zwane Enterprises",
            "url": "https://www.chronicle.co.zw/comment-more-companies-must-emulate-zwane-enterprises/",
            "content": "Zwane Enterprises Private Limited which is upgrading the 120km Old Gwanda Road, has engaged eight local companies to assist it to undertake the work. Government and Zwane Enterprises Pvt Ltd signed the long-awaited concession agreement in January this year.\n\nCabinet approved the construction of the road in May last year but work could not start before the signing of the concession agreement. Zwane Enterprises chief executive officer, Eng Bekithemba Mbambo said President Mnangagwa is expected to lead the projects groundbreaking ceremony mid this month.\n\nEng Mbambo said soon after the groundbreaking ceremony, the massive work to upgrade the road will then start. A total of 42 homesteads will be relocated to pave way for the upgrading of the road estimated to cost $150 million and is being implemented under the Build, Operate and Transfer (BOT) arrangement.\n\nEng Mbambo said each of the local companies has been allocated 20km and the target is to complete most of the work this year.\n\nWe have been given 18 months to complete this project and we are confident the companies we have engaged will meet the target, said Engineer Mbambo.\n\nHe said his company was taking a leaf from Government which engaged six companies to reconstruct the Harare-Beitbridge Highway. The six companies reconstructing the 585km highway have proved beyond doubt that they have the capacity to undertake work of such magnitude. Government, fed up by the long wait for international contractors to undertake the reconstruction of the Harare-Beitbridge Highway, decided to engage local companies and work is now nearing completion.\n\nWe therefore have no reason to doubt that the local companies engaged by Zwane Enterprises Pvt Ltd will be equal to the task. The Old Gwanda Road upgrading project involves upgrading, construction and tolling of the 120km stretch joining Bulawayo City and Gwanda Town via Matobo. The road which passes through Matopo High School is in a very bad state hence Eng Mbambo approached Government seeking its approval for his company to upgrade the road under BOT. Zwane Enterprises Pvt Ltd will recoup its costs from the tolling fees.\n\nEng Mbambo is among Zimbabwean professionals that have gained valuable experience working in the diaspora and has returned home to help build the country. Government has appealed to Zimbabwean professionals working in the diaspora to return home and contribute to the building of the Zimbabwe we all want. Ilizwe lakhiwa ngabaninilo / Nyika inovakwa nevene vayo).\n\nWe want to commend Eng Mambo and other Zimbabwean professionals that have returned home to contribute to the development of their country.\n\nIt is our hope that more companies will come on board and invest in infrastructural development like what Zwane Enterprises Pvt Ltd is doing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/djsfhghdfsghd.jpg",
            "description": "Zwane Enterprises Private Limited which is upgrading the 120km Old Gwanda Road, has engaged eight local companies to assist it to undertake the work. Government and Zwane Enterprises Pvt Ltd signed the long-awaited concession agreement in January this year. Cabinet approved the construction of the road in May last year but work could not start […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "Zimbabwe’s creative industry shines at Namas… Khaya Arts wins big",
            "url": "https://www.chronicle.co.zw/zimbabwes-creative-industry-shines-at-namas-khaya-arts-wins-big/",
            "content": "Mbulelo Mpofu in Harare\n\nArts organisation Khaya Arts from Bulawayo were the winners at the 23rd edition of the National Arts Merit Awards (Nama) held at the Hippodrome in Harare on Saturday evening, clinching two awards.\n\nThe event, curated by the Jacaranda Culture and Media Corporation (JCMC), celebrated Zimbabwes finest artistic talents in a well-coordinated ceremony that showcased the countrys creative growth.\n\nFrom the outset, the red carpet was abuzz with excitement as arts enthusiasts and celebrities mingled, taking snapshots with notable figures, including South African actress Nombulelo Mhlongo  popular for her role as Sne in Durban Gen  alongside Zimbabwes own icons such as Tinashe Mutarisi, Tamy Moyo, Sylent Nqo and Bagga. The electric atmosphere set the stage for an unforgettable night of celebration.\n\nThe night undoubtedly belonged to Khaya Arts Production, which claimed the Outstanding Dance Group award, while its director, Future Dube, secured the Outstanding Choreographer accolade. Reflecting on the achievement, Dube said perseverance was the cornerstone of their success.\n\nThis is our first time winning a Nama, and I cant begin to describe our excitement as a team. Weve been nominated before, and weve submitted for years without success, but we never gave up. This victory is proof that perseverance pays off. Winning two gongs in one night is a milestone that will elevate Khaya Arts Production to greater heights.\n\nOn the night, Zimpapers also had a moment in the spotlight as journalist Mthabisi Tshuma bagged the Outstanding Journalist/Media House award for his coverage in the Chronicle. This marked his first Nama win after being nominated the previous year.\n\nOkuhle kuyabukwa, Tshuma remarked upon receiving his award.Being recognised on a national platform is a great honour, and having this award placed under the special category this year makes it even more special. Im humbled that my work is being acknowledged.\n\nThe night also witnessed history in the making as nine-year-old Victoria Falls actor Skhanyiso Ska Ngwenya became the youngest recipient of the Outstanding Actor award for his role in Rise in Rise. Ngwenyas win was met with widespread admiration, proving that talent knows no age.\n\nJah Prayzah\n\nIn a move to elevate Zimbabwean music onto the international stage, the Outstanding Breakthrough Artiste (Music) award came with an exciting perk. Winner Chillmaster earned an all-expenses-paid trip to perform at the Moto Moto Festival in Germany in July, a gesture that was met with rousing applause from the audience.\n\nMusic lovers were treated to a series of breath-taking performances from artistes such as Fusion 5 Mangwiro, Nisha Ts, Hwinza, Bagga, Joyful Praise, Sylent Nqo, Oriyano, Denilson, ProBeatz, and Atenda Chin. However, it was Jah Prayzahs electrifying set that truly brought the house down, leaving the audience on their feet in sheer admiration.\n\nWhile host Nabeelah Jogee who presented the show alongside Charlent Mangweni-Furusa initially struggled to connect with the crowd, the overall ambience remained vibrant throughout the evening. The presence of high-profile Gvernment officials added a layer of prestige to the event, signalling national support for the arts sector.\n\nThe 23rd edition of the Nama saw notable improvements in organisation, with JCMC bowing out in style after managing the awards since 2019.\n\nWhile no event is ever perfect, several enhancements were evident. There was better speech timing as award winners speeches were kept concise, ensuring a smoother flow of proceedings. For purposes of inclusivity, the presence of two sign language interpreters allowed deaf attendees to fully engage with the event.\n\nAlso, the inclusion of figures such as Nombulelo Mhlongo not only enriched the awards but also strengthened Zimbabwes artistic ties beyond its borders.\n\nNine-year-old Victoria Falls-based actor Sikhanyiso Ngwenya receiving award\n\nThe use of a teleprompter for hosts and presenters added a layer of professionalism, ensuring a well-structured presentation.Despite these advancements, there remains room for growth, particularly in entertainment interludes. While musical performances are a staple, incorporating other art forms such as comedy, poetry, and theatrical skits could enhance audience engagement. Additionally, as with any awards ceremony, debates over winners and perceived snubs were inevitable, proving once again that the Namas continue to be a platform of passionate discourse within the creative industry.\n\nAs the curtains closed on this years edition, it was evident that the Namas are on an upward trajectory, laying a solid foundation for future improvements. With continued refinement, the awards have the potential to reach international standards and further cement Zimbabwes place on the global arts stage.\n\nBelow is a full list of the National Arts Merit Awards 23rd edition winners\n\n1. Dance AwardsOutstanding Female DancerCeline Madziva in Respect My teamOutstanding Male DancerTichaona Hero Chikara in Into the lightOutstanding Dance Group/ProductionKhaya Arts Productions in UniAfricaOutstanding ChoreographerFuture Dube  Khaya Arts Productions\n\n2. Visual Arts AwardsOutstanding Male Visual ArtistMoffat TakadiwaOutstanding Female Visual ArtistPortia ZvavaheraOutstanding Upcoming Visual ArtistKundai NathanOutstanding Exhibition6 th Venice Biennale by Various Artists curated by Fadzai Veronica Muchemwa\n\n3. Spoken Word AwardsOutstanding PoetKudakwashe RiceOutstanding Social Media SkitsPanashe Gurende aka MoojayaOutstanding Stand-Up ComedianMukudzei Majoni aka King Kandoro\n\n4. Theatre Awards\n\nOutstanding ActressCaroline Mashingaidze Zimbizi as Tete Sabina in Family RiotsOutstanding ActorMichael Kudakwashe as Sidney in Family RiotsOutstanding Theatrical ProductionThe Aftermath by Patsimeredu TrustOutstanding DirectorEverson Ndlovu  HaywireOutstanding PlaywrightLeonard Matsa  Promise5. Literary Arts Awards\n\nOutstanding First Published WorkZagamo the war within by Ray Mawerera, Published by Royalty BooksOutstanding Childrens BookChimbira Nedzimwe Ngano by Primrose Dzenga Published by Torch Bearers Trust BooksOutstanding Fiction BookWeeping Tomato by Samantha Rumbidzai Vazhure Published by Carnelian Hearts LimitedOutstanding Non-Fiction BookEntrepreneurial Success: Insights on Growing Business in a Fluid Economy by Divine Simbi Ndhlukula PhD Published by Divine Simbi-Ndlukula (PhD)\n\n6. Film & Television AwardsOutstanding ActressMunashe Goromonzi as Tsitsi in The November PromiseOutstanding ActorSkanyiso Ngwenya as Rise in RiseOutstanding Music VideoNhemamusasa by Bagga Directed by Leopold Tapiwa Vengesa aka Leoy VOutstanding Screen Production (Television)The DNA Show by Tinashe MugabeOutstanding Screen Production (Short film)Dollar by Tawanda VomboOutstanding Screen Production (Full Length film)Nhoroondo by Vusa Hlatshwayo\n\n7. Music Awards\n\nOutstanding Female MusicianThamsanqa Moyo aka Tamy MoyoOutstanding Male MusicianHillary Marufu aka Master HOutstanding Breakthrough MusicianGift Kudakwashe Hombarume aka ChillmasterOutstanding Music GroupThe UnveiledOutstanding SongKana Ndanyura by Kelvin Kusikwenyu aka Killer TOutstanding AlbumNOP Makoni by Nkosilathi Sibiya aka Voltz JT\n\n8. Special AwardsPromoter of the YearEvent HulksOutstanding Artist in the DiasporaMasimba Hwati (Visual Artist) based in PolandArts Service AwardPrince Edward SchoolArts Personality AwardPartson Chimbodza (Chipaz Promotions)Lifetime Achievement AwardPhilip SvosvePeoples Choice AwardWallace Chirumiko aka Winky D\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/JYR.jpg",
            "description": "Mbulelo Mpofu in Harare Arts organisation Khaya Arts from Bulawayo were the winners at the 23rd edition of the National Arts Merit Awards (Nama) held at the Hippodrome in Harare on Saturday evening, clinching two awards. The event, curated by the Jacaranda Culture and Media Corporation (JCMC), celebrated Zimbabwe’s finest artistic talents in a well-coordinated […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "120 new schools in the pipeline",
            "url": "https://www.chronicle.co.zw/120-new-schools-in-the-pipeline/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTHE Ministry of Primary and Secondary Education has secured US$20 million from international partners while Treasury has committed additional funds as the Government targets the construction of 120 new schools and 300 classrooms this year to address infrastructure shortages.\n\nZimbabwe has a deficit of about 3 000 schools, leading to the emergence of illegal learning institutions. To tackle this challenge, the Government, through a multi-sectoral approach, plans to build new schools across the country this year.\n\nPrimary and Secondary Education Minister Torerai Moyo announced this development in the National Assembly while responding to concerns raised in the Primary and Secondary Education Parliamentary Portfolio Committee report on the state of school infrastructure.\n\nThe committee highlighted inadequate infrastructure, lack of basic amenities, lack of disability-friendly facilities, and delays in project completion due to funding constraints. Minister Moyo assured Parliament that the Government is making strides towards addressing these challenges to ensure quality education for all learners.\n\nI must mention that in the 2025 calendar year, we have secured adequate resources to construct new schools. We are targeting not less than 120 new schools, he said.\n\nThese include 30 schools whose funding we have already received from the Ministry of Finance, Economic Development and Investment Promotion through the National Building Society,\n\nMinister Moyo explained that the NBS model for school construction has been successfully implemented at universities such as Chinhoyi University of Technology. Through this partnership, 30 schools will be built across the countrys 10 provinces.\n\nChinhoyi University of Technology\n\nMinister Moyo said the ministry has partnered with international organisations, including the OPEC Fund for International Development (OFID), which has committed US$20 million for the construction of 50 schools. Of these, 40 will be day schools while 10 will be boarding schools.\n\nMinister Moyo emphasised that new schools will be constructed in areas where pupils travel long distances, ensuring alignment with international standards that recommend learners should not travel more than five kilometres to school.\n\nAccording to international conventions, learners should not travel more than five kilometres so priority will be those areas where learners are walking more than 5km to the nearest school, he said.\n\nMinister Moyo said his ministry will work with Members of Parliament to identify areas which need schools.Government in the 2025 national budget allocated funds for the construction of 100 schools. Private individuals and corporate partners are also expected to contribute to the construction of schools and the target this year is 120 new schools.Minister Moyo said funding for constructing of an additional 300 classrooms to accommodate growing student populations, has also been secured.\n\nMeanwhile, Minister Moyo announced plans to support schools with funding to start income-generating projects. He noted that many schools lack sustainable income-generating initiatives, prompting the Government to introduce capacity-building programmes for school development committee members.\n\nThe Ministry is working on evaluating the establishment and operations of commercial ventures at schools. It will also intensify training efforts focusing on project continuity and sustainability to enable the school development committees to mobilise resources effectively, said Minister Moyo.@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/SASSSSS.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE Ministry of Primary and Secondary Education has secured US$20 million from international partners while Treasury has committed additional funds as the Government targets the construction of 120 new schools and 300 classrooms this year to address infrastructure shortages. Zimbabwe has a deficit of about 3 000 schools, leading to the emergence […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "Government reaffirms commitment to mining investments",
            "url": "https://www.chronicle.co.zw/government-reaffirms-commitment-to-mining-investments/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nGOVERNMENT remains fully committed to facilitating investment in the mining sector through policy reforms, enhanced ease of doing business, and infrastructure development, a Cabinet Minister has said.\n\nMines and Mining Development Minister, Winston Chitando, said this during the ground breaking ceremony of the US$3,6 billion Palm River Energy Metallurgical Special Economic Zone and Industrial Park presided over by President Mnangagwa in Beitbridge last Monday.\n\nThe Industrial Park is set to position Zimbabwe as a leading global player in ferrochrome production and green energy innovation.\n\nIt comprises a coking plant that will have an annual capacity of producing one million tonnes of coke, a ferro-chrome smelting plant that will produce 100 000 tonnes of high-carbon ferro-chrome and a 1 200MW coal-fired thermal power plant.Surplus electricity will be fed onto the national grid, while the ferro-chrome plant will facilitate the production of stainless steel and castings.\n\nOur engagement with global investors continues to strengthen, ensuring mutually beneficial partnerships that drive sustainable economic growth, said Minister Chitando.\n\nThis ground-breaking ceremony is a testament to the Second Republics ability to attract large-scale investments and execute transformative projects.\n\nMining is a critical pillar of Zimbabwes economy, contributing 13,3 percent to GDP and more than 65 percent of export receipts. Despite challenges such as fluctuating commodity prices and global economic headwinds, the mining sector has demonstrated remarkable resilience, with projected growth of 5,6 percent in 2025, led by increased output in platinum group metals (PGMs), gold, chrome and diamonds.\n\nPart of the Palm River Energy Metallurgical Special Economic Zone and Industrial Park\n\nMinister Chitando said the industrial park was a massive integrated undertaking comprising a two-million-tonne-per-year ferrochrome smelting facility, a 1 200MW green energy and integrated power generation plant, a 7-million-tonne-per-year coal mine and supporting coal washing plant and a 1-million-tonne-per-year coking plant.\n\nHe said the facility had modern infrastructure, including commercial offices and logistics hubs and that it was set to provide 10 000 direct jobs, bringing employment opportunities to local communities and bolstering Zimbabwes skilled workforce through specialised training programmes.\n\nWe expect this project to be generating at least US$1,7 billion by the year 2030, said Minister Chitando.He added that a US$500 000 Palm River Fund, which will run for 10 years will be established to focus on youth education as part of corporate social responsibility around Beitbridge.\n\nAdditionally, the project aligns with National Development Strategy 1 (NDS1) by prioritising value addition, beneficiation and infrastructure expansion, said Minister Chitando.\n\nThe official ground breaking of the project underscores the mining sectors ongoing transformation. Additionally, chrome exports increased significantly, and coal production reached nearly 6 million tonnes.\n\nThese successes illustrate the sectors upward trajectory and highlight Zimbabwes potential as a regional mining powerhouse.The Xintai Palm River Energy Metallurgical Industrial Park will not only enhance national industrialisation and job creation, but also cement Zimbabwes position as a leader in responsible mining and energy innovation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/907-600x380.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau GOVERNMENT remains fully committed to facilitating investment in the mining sector through policy reforms, enhanced ease of doing business, and infrastructure development, a Cabinet Minister has said. Mines and Mining Development Minister, Winston Chitando, said this during the ground breaking ceremony of the US$3,6 billion Palm River Energy Metallurgical Special Economic […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "Avocado: Zimbabwe can uncover green gold with China exports",
            "url": "https://www.chronicle.co.zw/avocado-zimbabwe-can-uncover-green-gold-with-china-exports/",
            "content": "Tichaona Zindoga\n\nZimbabwes diversified agriculture group, Tanganda Tea Company is turning over a new leaf. The company recently reported that it is keen to tap into the Chinese avocado market as it diversifies its exports to increase earnings, following an increase in avocado export volumes, as the avocado fruit was primarily exported to the European markets last year.\n\nLooking East could unlock more value and turn Zimbabwes avocado into green gold following an agreement between Zimbabwe and China, as the Asian giant continues to open its market to agricultural produce from Africa.\n\nA recent media article quotes Tanganda as saying: Going forward, following the signing of a trade agreement between China and Zimbabwe in September 2024 at the Forum on China and Africa Cooperation (FOCAC) in Beijing, the Company expects to diversify its markets into China.\n\nThis is expected to maximise avocado exports in the early parts of the harvesting season and reduce reliance on the European markets.\n\nAvocado production of 3 976 tonnes grew by 84 percent over the prior years production of 2 156 tonnes due to the increased maturity profile of the plantations.\n\nFrameworkWhile FOCAC laid a solid multilateral framework for allowing more African produce, Zimbabwe and China had already taken steps to incorporate avocado into the export basket, adding to citrus; and prospects for other crops such as blueberry and macadamia, some of Zimbabwes hottest, nay, coolest, products on the market.\n\nIn 2024, during President Mnangagwas visit to China, the two sides signed the protocol for phytosanitary requirements for the export of Zimbabwean avocados to China. The protocol was one of the 17 agreements signed between China and Zimbabwe.\n\nThe development was welcomed by Zimbabwean stakeholders with the Chief Executive Officer of the Horticultural Development Council Linda Nielsen saying in a statement that the protocol presented the potential for avocado growers in Zimbabwe to expand their reach into one of the worlds largest avocado markets.\n\nTanganda Tea company estates\n\nThe statement said: The signing of this protocol delivers a significant opportunity for Zimbabwe to take advantage of the vast Chinese market. This will require strategic intent to meet the strict requirements of the Chinese market. Horticulture producers are ready to discuss investment requirements.\n\nIt stated that Zimbabwe was projected to produce a record 6 000 tonnes of avocados in 2024 and the avocado industry is planning to increase the growing area from 1 500 hectares to 4 000 hectares by 2030.\n\nThis growth is a critical component of the Horticulture Recovery and Growth Plan, which aims to develop the horticulture sector into a US$1 billion industry. Reaching this target will require supportive policies that attract investment to ramp up production, Nielsen said.\n\nFurther, HDC is working with stakeholders to pursue similar protocols for blueberries, pecans and macadamia nuts for the Chinese market.\n\nAfrican perspectiveWhere does Zimbabwe stand?The country is likely to make rich pickings should it penetrate the Chinese market, and follow other African countries that have successfully executed similar agreements with the Asian giant.\n\nLast year, South Africa  which produces the Hass avocado variety  made its first avocado export to China. According to an industry overview, South Africas average annual production is 146 600 tonnes of which 45 percent is exported fresh, mainly to Europe and the United Kingdom. On the other hand, Kenya, another country that has been allowed into China is a major global avocado producer, ranking sixth with a production of 633 000 tonnes in 2023. Its exports were seen rising on the back of trade with China.\n\nOther African countries that are major producers of the crop include Morocco, Burundi and Mozambique  and all these have to contend with competition from other parts of the world including Peru, Chile, New Zealand and Mexico.\n\nThe success of African avocado exports to China depends on factors such as product quality, competitive pricing and effective marketing strategies. While South Africa is well-positioned to capitalise on the Chinese market, Kenya faces challenges related to product quality and competition. Other African nations are still in the early stages of exploring export opportunities.Conditions and requirements\n\nPhytosanitary requirements are defined as the regulations set by a country to ensure that plants and plant products being imported meet specific standards regarding pest and disease freedom, essentially meaning they must be inspected and certified as free from harmful organisms before being allowed entry, typically requiring a phytosanitary certificate to verify compliance;\n\nphyto meaning plant and sanitary meaning clean or free from disease.As such, Zimbabwe needs to satisfy a number of conditions to be able to ensure avocado export success with China.\n\nThese include, ensuring quality standards and consistency, certification and compliance to ensure that its products are recognised as meeting international quality standards. Ensuring compliance with Chinas specific agricultural and phytosanitary.\n\nAt the same time for Zimbabwe to compete, it must up its game through investment to ensure steady supply and quality. It is also considered that smallholder farmers could also play a crucial role as outgrowers or key members of the supply chain and will thus require training and assistance on best practices in avocado cultivation, harvesting, and post-harvest handling is essential for increasing productivity and quality.\n\nFarmers are also urged to incorporate sustainable agricultural practices which will help ensure the long-term viability of avocado farming while also appealing to environmentally conscious consumers.\n\nAt the same time key stakeholders and policymakers will need to support farmers or export business through investment in export infrastructure that includes cold chain logistics to ensure that avocados reach China in good condition, including ensuring proper refrigeration during transportation, warehousing, and packaging; strengthening trade relationships with Chinese importers and facilitating the export process; establishing partnerships with Chinese importers and distributors; and marketing the Zimbabwe brand strongly, including on Chinese social media, among other measures.\n\nA large company like Tanganda will unlikely face challenges with meeting these conditions. However, new players need to be supported to ensure their full participation and benefits.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jtjy.jpg",
            "description": "Tichaona Zindoga Zimbabwe’s diversified agriculture group, Tanganda Tea Company is turning over a new leaf. The company recently reported that it is keen to tap into the Chinese avocado market as it diversifies its exports to increase earnings, following an increase in avocado export volumes, as the avocado fruit was primarily exported to the European […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        },
        {
            "title": "Dynamos, ZPC Kariba share the spoils",
            "url": "https://www.chronicle.co.zw/dynamos-zpc-kariba-share-the-spoils/",
            "content": "Tadious Manyepo, Zimpapers Sports Hub\n\nDynamos 0-0 ZPC Kariba\n\nDYNAMOS opened the 2025 Castle Lager Premiership season in a not-so-ideal manner after failing to break down a resolute ZPC Kariba defence to settle for this uninspiring draw at Rufaro Stadium yesterday.\n\nTrying to keep up with teams that pocketed maximum points in their opening matches like Scottland, Manica Diamonds, Herentals and MWOS, the Glamour Boys wheeled in with a lot of anticipation.\n\nBut, just like their opponents yesterday, DeMbare are still trying to cope up with the huge personnel loss suffered in the pre-season transfer window.\n\nIts a process and it takes a bit of time and effort as the body of evidence was in full display yesterday for both teams.Dynamos are giants though and the draw should have left them and their supporters, who attended the fixture en-masse, disappointed especially given that they were playing at home against a team that has failed to beat them for more than five years.\n\nCoach Lloyd Mablanyo Chigowe felt they should have pushed a bit more to get a result against a team that sat back for the majority of the game.\n\nLike I said, prior to the match it was always going to be a tricky match. If you remember last season we drew one all with ZPC Kariba. They did not give us space and they came with an intention to get a draw.\n\nThey were tenacious in defending and we played only on the break. Otherwise, we wanted to win more than them. They came here to sit and defend and make sure that they didnt concede a goal.\n\nIn the end, we shared the spoils. Probably a true reflection of the tactical approach of both teams. I think thats good enough. It was always going to be a difficult match considering that its a new team.\n\nLook at the players that we had last year. Its totally different this year, said Chigowe.Its a mixture of young stars and also the senior players. It was always going to be a tough game to play. Also, in the numbers that we had, considering the senior players that we had.\n\nYou can see that we dominated proceedings, especially in the second-half. Our opponents for all intents and purposes, did not take a shot on goal. No shot on target.\n\nBut they also made sure that they sat deep and had numbers behind the ball. They were tenacious and organised. The organisation was good. I will not take that away from them.\n\nDynamos were the ones to always probe the opponents defensive third.But it really took them long to throw the first punch with Leeroy Mavunga only chipping over-the-top pass to Valentine Kadonzvo who tapped the ball beyond a drawn-out ZPC Kariba goalkeeper Tatenda Munditi only for captain Boid Mutukure to hoof it away two minutes after the half-hour mark.\n\nMavunga returned to ask questions of his own two minutes later but his swinging ball couldnt dip early enough to find itself on the scoreboard.\n\nAt the opposite end, impressive winger Wayne Kamurai who restricted Emmanuel Jalais usual forward forays got closer to breaking the ice but Tendaishe Magwaza was at hand to mute the venom three minutes before the break.\n\nThere was still time for Dynamos left-back Nomore Chinyerere to pose the puzzle on Munditi but his curling free-kick was easily saved by the former CAPS United goalkeeper right on the stroke of half-time.\n\nZPC Kariba, who built a huge defensive reputation last season, conceding just 18 goals in 34 games, know their offensive limitations but they did try to launch some counter attacks and Collin Muleyas snap shot almost got them the lead a minute after the break but Prince Tafiremutsa was properly-positioned to smoother its sting.\n\nBesides those few-and-far-between chances from both ends, play was mostly concentrated on the channels and midfield with neither able to get the right formulae to break clear.\n\nIt was at some instances a very slow encounter between two teams trying to find themselves after suffering those huge blows brought by losing the core of their squads from last year.\n\nDynamos lost about 11 players and ZPC Kariba are almost re-building from the base after also losing 13 players.Perhaps it was a game neither deserved to win after doing less to warrant a result.\n\nIt was a huge point gained by ZPC Kariba on the road though but for their defensive effectiveness, coach Newton Chitehwe should also be worried for their flaws in front of goal, a major undoing in 2024, were more than glaring in yesterdays game.\n\nWe always worked on consolidating the way that we defended last year and also tried to improve going forward and I think going forward we did well but as games come by I think we are going to be better.\n\nBut for today, playing against Dynamos here, the pressure, the supporters and everything, I think we did well in terms of defending even in winning tussles, said Chitehwe.\n\nWe planned for a win, we wanted to win this game, at least maybe by a 1-0 score line but I know my brother (Chigowe) is good at defending also, so thats why maybe we didnt see a lot of attacks from both sides.\n\nTeamsDynamos: Prince Tafiremutsa, Emmanuel Jalai, Nomore Chinyerere, Clive Mandivei, Tendaishe Magwaza, Shadreck Nyahwa, Elton Chikona (Enasio Perezo 80min), Temptation Chiwunga, Frank Agyemang (Jairos Kasondo 80min), Leeroy Mavunga (Abel Gwatidzo 71min), Valentine Kadonzvo (Tellmore Pio 54min).ZPC Kariba: Tatenda Munditi, Boid Mutukure, Marshal Gavaza, Simbarashe Chimanikire, Kuzivakwashe Madima, Collen Muleya, Vitalis Chidzero, Munashe Kamwendo (Emmanuel Edmond 65min), Wayne Kamurai (Remmington Masuku 87min), Fanuel Shoko (Samuel Makawa 65min), Stanley Ngala (Moses Demera 80min).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/huhjhfvhjk.jpg",
            "description": "Tadious Manyepo, Zimpapers Sports Hub Dynamos 0-0 ZPC Kariba DYNAMOS opened the 2025 Castle Lager Premiership season in a not-so-ideal manner after failing to break down a resolute ZPC Kariba defence to settle for this uninspiring draw at Rufaro Stadium yesterday. Trying to keep up with teams that pocketed maximum points in their opening matches […]",
            "time": "06:40",
            "date": "03 Mar 2025"
        }
    ]
}