{
    "news": [
        {
            "title": "Truckload of Presidential Inputs vanishes in Tsholotsho as key suspects flee",
            "url": "https://www.chronicle.co.zw/truckload-of-presidential-inputs-vanishes-in-tsholotsho-as-key-suspects-flee/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nA TRUCK carrying Presidential Input Scheme seeds meant for Ward Seven in Tsholotsho district, Matabeleland North province, has been missing since last week.\n\nAn extension officer from the Agriculture and Rural Development Advisory Services (ARDAS) and a Grain Marketing Board (GMB) employee are reportedly on the run.\n\nAuthorities believe the incident is part of a seed diversion scam involving a police officer who accompanied the consignment when it departed from the GMB Tsholotsho depot earlier this month.\n\nA memo from the intelligence unit, seen by this publication, indicates that Ward Seven extension officer Ms Kwanele Dube and GMB contract employee Mr Langton Ncube disappeared after the truck, loaded with 400 bags of 50kg Urea fertiliser, 30 bags of 10kg sunflower seeds, and 100 bottles of 200ml Imidacloprid chemicals, failed to reach its destination after leaving the GMB depot on 4 January 2025.\n\nThe Presidential inputs, which were supposed to be distributed in Ward Seven, Patalika, on 4 January 2025, were diverted to an unknown destination and were not delivered. The consignment comprised 400 x 50kg Urea fertiliser, 30 x 10kg sunflower seeds, and 100 x 200ml Imidacloprid chemicals.\n\nThe main suspects are Kwanele Elena Alanna Dube, Ward Seven Agritex extension officer, and Langton Ncube, a GMB contract employee. Both are on the run. Additionally, Abisinjo Mpofu, a police officer stationed at ZRP Tsholotsho, is implicated.\n\nNo arrests have been made so far. Investigations revealed that the inputs were not recorded in the provisional dispatcher book because it was full. Consequently, the inputs never reached their destination. The suspects flight and the unsigned dispatcher book present challenges in recovering the inputs, while the police officer appears to be distancing himself from the case, the memo states.\n\nTsholotsho district development coordinator, Mr Aaron Gono, confirmed the matter but stated that he was yet to receive a full briefing.\n\nIt is reported that on 3 January 2025, ARDAS officer for Ward Seven, Kwanele Dube, booked GMB for the collection of the inputs for her ward the following day. The GMB manager agreed.\n\nOn 4 January, she arrived to collect the inputs, and the truck was loaded and cleared by acting GMB supervisor Langton Ncube. It is also reported that an unidentified police officer was present to accompany the truck. The truck departed on the same day.\n\nThe GMB depot manager received a call from the Presidents Office on Monday, 6 January, informing her that the truck never reached its destination. Investigations by ZRP began shortly thereafter. The whereabouts of Ms Dube and Mr Ncube remain unknown. Investigations are ongoing, reads a memo from Mr Gono addressed to Matabeleland North Acting Director of Local Government Services, Mr Tapiwa Zivovoi.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/08/g.jpg",
            "description": "Sikhumbuzo Moyo,smoyo@chronicle.co.zw A TRUCK carrying Presidential Input Scheme seeds meant for Ward Seven in Tsholotsho district, Matabeleland North province, has been missing since last week. An extension officer from the Agriculture and Rural Development Advisory Services (ARDAS) and a Grain Marketing Board (GMB) employee are reportedly on the run. Authorities believe the incident is part […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "Chief Justice calls for collaborative efforts to boost public confidence in judiciary",
            "url": "https://www.chronicle.co.zw/chief-justice-calls-for-joint-efforts-sparks-new-era-of-trust-as-2025-legal-year-opens/",
            "content": "Nqobile Tshili,[emailprotected]\n\nCHIEF Justice Luke Malaba has called for enhanced collaboration among stakeholders in the justice delivery system, emphasising that the judiciary alone cannot build public confidence without the support of the entire criminal justice value chain.\n\nSpeaking at the historic official opening of the 2025 legal year in Bulawayo yesterday, Chief Justice Malaba highlighted the establishment of the National Council on Administration of the Criminal Justice System as a critical step towards expediting criminal trials and fostering co-operation.\n\nFor the first time, the opening ceremony was held outside Harare, marking a significant shift in the judiciarys approach to inclusivity and decentralisation. This aligns with the Governments National Development Strategy 1 (NDS1) and the Second Republics commitment to devolution.\n\nThe event, held under the theme: Building Public Confidence in the Judiciary through Multi-Stakeholder Participation, began with the inspection of the quarter guard, followed by Chief Justice Malaba addressing members of the bench, service chiefs and other key stakeholders.\n\nChief Justice Malaba stressed that an effective justice system requires the seamless co-operation of various stakeholders, including the police, prosecutors, witnesses and correctional services.\n\nWhile the judiciary plays a central role in the administration of justice, it must be acknowledged that there are various other stakeholders who play critical roles in the proper functioning of the justice delivery system, he said.\n\nA breakdown in any part of this chain, whether its a failure to arrest suspects, lapses in prosecution, or the absence of witnesses, can derail the entire process and erode public confidence in the judiciary.\n\nThe newly established council, chaired by Judge President, Justice Maria Zimba-Dube, and including Prosecutor-General, Justice Loice Matanda-Moyo, aims to address these gaps by expediting criminal trials in both magistrates and high courts.\n\nChief Justice Malaba also called for the revitalisation of community service and pre-trial diversion committees, emphasising their importance in reducing case backlogs and improving access to justice.\n\nThe Chief Justice reaffirmed the judiciarys commitment to accountability, noting that the performance of courts and judicial officers is closely monitored through the JSC performance management system.\n\nAchieving this goal requires a shared commitment to fulfilling our constitutional obligations that underpin the administration of justice. The active participation and collaboration of the judiciary and its stakeholders is essential, as without this collective effort, fostering public trust in the judiciary will remain unattainable, he said.\n\nThe judiciary must remain exemplary, not only in its professional duties but also in the personal conduct of its officers. Judicial misconduct, if left unchecked, can undermine the public trust that is foundational to our justice system.\n\nChief Justice Malaba said public confidence in the judiciary hinges on its efficiency, impartiality and adherence to constitutional principles.\n\nThis means that the judiciarys overall performance is subject to the evaluation of the people of Zimbabwe. As a judiciary, we acknowledge that we cannot build public confidence and trust in isolation.\n\nAchieving the delivery of quality justice is possible only through collaboration and partnership with all stakeholders within the justice sector, said Chief Justice Malaba.\n\nHe said the conduct and manner in which each public institution carries out its mandate directly influences the level of confidence in the public sphere.\n\nThe principle of public confidence is, therefore, a broad constitutional principle that governs the actions and conduct of all public officials, including judges, magistrates and other individuals presiding over courts established under Zimbabwean law, said Chief Justice Malaba.\n\nThe public confidence in the judiciary is reflected in the publics belief in the efficiency, fairness and impartiality of the courts, in adherence to the rule of law, and in the protection of human rights and freedoms.\n\nThe Chief Justice said JSC will continue to implement policies and measures that safeguard judicial independence in decision-making while ensuring accountability to the public for its rulings.\n\nHe said the measures include the rigorous monitoring of court and judicial officer performance through JSCs performance management system.\n\nChief Justice Malaba said while it is impossible to entirely prevent misconduct, given human fallibility, JSC has established mechanisms to ensure that its errant members are held to account.\n\nIt is for that reason that the commission has taken a firm stance against corruption and judicial misconduct. If it is not nipped in the bud, judicial misconduct has the potential to undermine the very fabric upon which the public trust exists between the judiciary and the citizens is created, said Chief Justice Malaba.\n\nHe expressed satisfaction with the judiciarys integrity, noting that no misconduct charges were brought against judges in the previous year.\n\nChief Justice Malaba concluded by reiterating the judiciarys dedication to safeguarding judicial independence while fostering partnerships to deliver quality justice.\n\nThe active participation and collaboration of all stakeholders in the justice sector are indispensable for building public trust and ensuring the effective delivery of justice, he said. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/1-3-680x380.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw CHIEF Justice Luke Malaba has called for enhanced collaboration among stakeholders in the justice delivery system, emphasising that the judiciary alone cannot build public confidence without the support of the entire criminal justice value chain. Speaking at the historic official opening of the 2025 legal year in Bulawayo yesterday, Chief Justice Malaba […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "Odinga seeks Zimbabwe’s support for top AU post",
            "url": "https://www.chronicle.co.zw/odinga-seeks-zimbabwes-support-for-top-au-post/",
            "content": "Rumbidzayi Zinyuke, Harare Bureau\n\nPRESIDENT Mnangagwa yesterday met Kenyan opposition leader, Mr Raila Odinga, who was seeking Zimbabwes support for his candidature for the position of African Union Commission chairperson.\n\nMr Odinga is one of the three candidates in the race to succeed the incumbent, Mr Moussa Faki, who has held the position since 2017.\n\nOther candidates for the AU Commission chairperson are Djibouti Foreign Affairs Minister Tahtoud Ali Youssof and Somalias Fawzia Yusuf Adam.\n\nSpeaking after meeting President Mnangagwa at State House in Harare, Mr Odinga expressed hope that Zimbabwe and the rest of the SADC region would support his bid for the top AU post.\n\nI have come to announce (my candidature) and to also ask for support from Zimbabwe and SADC by extension.I am happy to have been received very well by the President, he said.\n\nPosting on his X handle later yesterday, Mr Odinga said: We landed in Harare, Zimbabwe today to a warm reception courtesy of HE President Emmerson Mnangagwa @edmnangagwa\n\nIts been a pleasure sharing with the president my vision for Africa and discussing my candidature for the AUC Chairmanship.\n\nPresident Mnangagwa is presently the SADC Chairperson, and it was fitting that Mr Odinga would visit Harare, as he seeks support from the entire regional bloc.\n\nThe African Union (AU) unanimously agreed in March to grant the Eastern Africa region the right to nominate the next chairperson of the AU Commission.\n\nThis decision marks the culmination of institutional reforms launched in November 2018. The AU Assembly aims to bolster transparency and meritocracy in the leadership selection process, prioritising equitable regional representation, gender parity and recruitment of top talent from across the African continent.\n\nMr Odinga said he had been touring many countries in Africa to garner support for his candidature and after Zimbabwe, he will visit other Southern Africa countries.\n\nHe stressed that African countries are facing similar challenges that should be tackled collectively.\n\nWe have shared experiences with other nations, we know where we are coming from, where we want to go. But Africa will only be developed by Africans themselves. We must have a clear roadmap and blueprint on how to develop Africa.We have 55 States in Africa, we are looking at how these countries can be integrated so that we benefit from the resources that we have in our continent, said Mr Odinga.\n\nHe added that the continent has a young population, which could drive transformation of the continent. The new AU Commission chair will be elected by the AU Assembly via a secret ballot on February 25 at the 38th AU Summit set for Addis Ababa, Ethiopia.\n\nPast chairpersons of the AU Commission have come from the AUs western, central and southern regions, hence the AU Executive Councils intervention to assert the right of the East African region to produce the next chairperson while North Africa will fill the deputy chairpersons post.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/1-4.jpg",
            "description": "Rumbidzayi Zinyuke, Harare Bureau PRESIDENT Mnangagwa yesterday met Kenyan opposition leader, Mr Raila Odinga, who was seeking Zimbabwe’s support for his candidature for the position of African Union Commission chairperson. Mr Odinga is one of the three candidates in the race to succeed the incumbent, Mr Moussa Faki, who has held the position since 2017. […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "New Zifa president assured of US$50 000 income",
            "url": "https://www.chronicle.co.zw/new-zifa-president-assured-of-us50-000-income/",
            "content": "Lovemore Dube,[emailprotected]\n\nTHE incoming Zifa president will receive US$50 000 per year from Caf.\n\nThis substantial increase from US$20 000 was unanimously approved by all 54 Caf-member countries in October last year.\n\nCaf president, Patrice Motsepe deemed the new compensation insignificant, highlighting the organisations commitment to supporting its national association heads.\n\nOther key officials, including Caf vice presidents and executive committee members, also received notable salary hikes of US$20 000.\n\nPresidents of zonal bodies like Cosafa and Cecafa received an increment of US$25 000.\n\nIt was also resolved last year that a chairman be appointed to head the African Clubs Association and be entitled to US$50 000.\n\nNational association presidents are not full-time employees but volunteers who get compensated for their time.\n\nZifa has been headed by a Normalisation Committee chaired by Lincoln Mutasa for the past two years.\n\nMotsepe has been an advocate of better remuneration for member association bosses since he first took office.\n\nSome of your presidents have no resources, theyve got nothing and theyve got to run the member associations out of their pockets, said Motsepe.\n\nThe gesture comes on the eve of Marchs Caf elective meeting at which Motsepe is seeking another term at the helm.\n\nMotsepe and other Fifa vice presidents get US$300 000 a year.\n\nFifa president, Gianni Infantino, gets more than US$4,67 million.\n\nWhen attending Fifa business, they are entitled to US$250 from the world football governing body.\n\nMembers of Fifa committees who do not get an annual salary receive compensation grants at the rate of US$300 a day or US$200 if they are provided breakfast, lunch or dinner.\n\nPhilemon Machana, Martin Kweza, Nqobile Magwizi, Twine Phiri, Makwinji Soma-Phiri, and Marshall Gore are the six candidates approved by Zifas integrity and ethics committee to stand for the associations presidency.\n\nWalter Magaya, previously considered a favourite, Benjani Mwaruwari and Themba Mliswa did not make the cut.\n\nZifa is expected to make a final announcement on the final list and voting members of the Zifa Council tomorrow.\n\nIt is anticipated that some names previously left out may appear.\n\nFor the vice presidents post, Gift Banda was omitted and jointly took the matter to the Court for Arbitration in Sport (CAS) with Mwaruwari.\n\nMagaya and Mliswa took their case to the High Court, contrary to the dictates of the Zifa constitution and electoral code that demand that disputes be referred to CAS.\n\nFor the first time in the Zifa constitution, a clause that demands five O-Levels or an equivalent was inserted for the president and deputy president.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/yujtuy-1.jpg",
            "description": "Lovemore Dube, lovemore.dube@chronicle.co.zw THE incoming Zifa president will receive US$50 000 per year from Caf. This substantial increase from US$20 000 was unanimously approved by all 54 Caf-member countries in October last year. Caf president, Patrice Motsepe deemed the new compensation “insignificant”, highlighting the organisation’s commitment to supporting its national association heads. Other key officials, […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "Matabeleland North pilots Integrated Electronic Case Management System",
            "url": "https://www.chronicle.co.zw/matabeleland-north-pilots-integrated-electronic-case-management-system/",
            "content": "Nqobile Tshili,[emailprotected]\n\nMATABELELAND North has been selected to pilot the Integrated Electronic Case Management System (IECMS) in the lower courts, marking a significant milestone in the digitisation of the countrys justice delivery system.\n\nAdditionally, a new court is set to be established in Brunapeg, Matabeleland South, as part of efforts to improve access to justice in peripheral areas, including the completion of the construction of magistrates courts in Gwanda in Matabeleland South and Cowdray Park in Bulawayo, among other areas.\n\nThe IECMS, introduced in 2023 at the countrys superior courts, enables litigants to submit and track documents electronically.Speaking during the inaugural ceremonial opening of the 2025 Legal Year at the Bulawayo High Court yesterday, Chief Justice Luke Malaba highlighted the success of the IECMS at apex courts and the phased rollout to magistrates courts.\n\nThe introduction of the IECMS in the magistrates courts marks the fourth and final phase of implementation. The JSC has resolved that the process will commence in January 2025. Given the size of the magistrates department, a phased approach will be adopted, starting with Mashonaland Central and Matabeleland North provinces, said Chief Justice Malaba.\n\nHe noted that the system, already operational for case reviews, appeals, civil and criminal matters in superior courts, has significantly improved efficiency and increased public confidence in the judiciary.\n\nChief Justice Malaba urged the public and stakeholders to embrace the electronic management of cases, aligning with global trends. He announced the establishment of an IECMS review committee to assess the systems efficiency and address any challenges.\n\nThe successful implementation of the IECMS has attracted interest from neighbouring countries, including Mozambique, Zambia, Malawi and Namibia. Namibia has gone a step further by signing a memorandum of understanding with Zimbabwe to adopt the system.\n\nWe also wish to extend the judiciarys gratitude to all stakeholders in the justice delivery system, including members of the public, for their unwavering support during the rollout of the IECMS in the superior courts.\n\nAs expected with a project of such national significance, challenges arose, but through co-operation and resilience, we overcame them, he said.\n\nChief Justice Luke Malaba greets Judges during the official opening of the 2025 legal year in Bulawayo yesterday\n\nChief Justice Malaba said over time, public confidence in the IECMS has grown, and more litigants now rely on the system.\n\nStakeholders are therefore encouraged to maintain this positive momentum as we expand the IECMS to the busiest courts, the magistrates courts, he said.\n\nThe JSC has made strides in decentralising courts to improve access to justice in remote areas. In 2024, five new regional courts were established in Kwekwe, Mutoko, Zvishavane, Mbare, and Guruve.\n\nTen resident magistrates courts were also opened in Triangle, Kotwa, Shamva, Banket, Beatrice, Mabvuku, Chinamora, Nembudziya and Wedza.\n\nSome of these courts are already operational, while others will open in the first term of the legal year. In Matabeleland South, a new resident court was designated for Brunapeg, and land has been secured for its construction, said Chief Justice Malaba.Additionally, circuit courts were set up in Lusulu and Siabuwa in Binga and Cashel Valley, Mahusekwa.\n\nIn total, the JSC established five regional courts, 10 resident magistrates courts and four circuit courts in 2024. Furthermore, two new courthouses were commissioned to enhance access to justice, said Chief Justice Malaba.\n\nChief Justice Malaba highlighted the JSCs achievements in 2024, including the commissioning of new courthouses in Chiredzi and Triangle, reducing travel distances for residents. Chegutu Magistrates Court was renovated, adding an extra courtroom and three offices.\n\nIn the coming months, the JSC anticipates considerable progress to be attained on the following construction projects: Judicial Training Institute of Zimbabwe, Training Centre, Gwanda Court Complex, Mutawatawa Magistrates Court, Mbare Magistrates Courts, Cowdray Park Magistrates Court and Kwekwe Magistrates Court, said Chief Justice Malaba.\n\nHe said the ongoing developments demonstrate the JSCs commitment to improving justice delivery across the country. @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/legal-year-opening-14-Jan-2025-8.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.zw MATABELELAND North has been selected to pilot the Integrated Electronic Case Management System (IECMS) in the lower courts, marking a significant milestone in the digitisation of the country’s justice delivery system. Additionally, a new court is set to be established in Brunapeg, Matabeleland South, as part of efforts to improve access to […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "‘Traders comply with import rules’…Government intensifies anti-smuggling efforts",
            "url": "https://www.chronicle.co.zw/traders-comply-with-import-rules-government-intensifies-anti-smuggling-efforts/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nTraders have been urged to familiarise themselves with import and trading regulations to ensure compliance with the law, as the Government intensifies efforts to combat smuggling and tax evasion.\n\nSpeaking during a Gwanda Business Association breakfast meeting on Friday, Zimbabwe Revenue Authority (Zimra) Bulawayo customs officer Mrs Makhosazana Kuture emphasised the need for traders to acquire import licences and comply with customs procedures.\n\nStakeholders follow proceedings during a Gwanda Business Association breakfast engagement meeting on Friday\n\nShe highlighted that goods imported by road must be pre-cleared through registered clearing agents, as stipulated under Statutory Instrument 9 of 2018 Customs and Excise Regulations.\n\nMrs Kuture warned traders against purchasing smuggled goods for resale, noting that Zimra, in collaboration with other regulatory authorities, is conducting a nationwide blitz targeting smuggled and counterfeit products.\n\nThe operation is part of a multi-agency initiative aimed at curbing smuggling and unethical business practices to safeguard local industries and protect consumer welfare.\n\nStakeholders follow proceedings during a Gwanda Business Association breakfast engagement meeting on Friday\n\nThe crackdown, which began last month, targets entertainment venues, liquor vendors, retail outlets and businesses dealing in contraband or counterfeit goods.\n\nShop owners are subjected to impromptu inspections and must produce documentation proving that their stock was legally imported. Non-compliant traders face heavy fines and the seizure of merchandise.\n\nThis blitz will cover every shop, so all traders must regularise their operations. The operation is here to stay, said Mrs Kuture.\n\nShe outlined the procedures for importing and exporting goods, explaining that commercial imports by road must be pre-cleared before arriving at the border. Rates of duty are listed in the Tariff Handbook HS 2022 SI 203 of 2022.\n\nWhen importers complete their purchases and have consignments ready, they should liaise with their clearing agents, who will handle the clearance and duty payment. At the border, we expect the clearing agent to have all the necessary paperwork ready for processing, she explained.\n\nMrs Kuture added that traders must retain their import documentation, such as bills of entry, for at least six years. Failure to provide these documents during post-clearance audits could result in penalties, including shop closures or confiscation of goods until duty is paid.\n\nShe also advised traders to familiarise themselves with customs duty rates, which vary depending on the nature of the goods. Some products, such as blankets, second-hand clothing, agricultural items and certain furniture, require import licences.\n\nBefore importing goods, consult Zimra to understand the necessary requirements. Some products, like expired or hazardous items, skin-lightening lotions and certain medicinal products, are restricted to protect public health and the economy, said Mrs Kuture.\n\nStakeholders follow proceedings during a Gwanda Business Association breakfast engagement meeting on Friday\n\nThe breakfast meeting, held under the theme Unlocking Business Opportunities in Gwanda in 2025: Trends, Insights, and Strategies, provided a platform for traders to raise concerns.\n\nGwanda Business Association chairperson, Mr Thomas Gwatida, said the meeting was crucial in addressing issues such as Zimras new systems, including TaRMS, FDMS, QR Code and HS Code, as well as the ongoing raids.\n\nMany traders were worried about confiscated goods and needed clarity on trading rules and regulations. This engagement allowed us to gain insights and ensure our members are well-informed to avoid losses, he said.\n\nMr Gwatida added that the association is committed to ensuring its members adhere to regulations to foster a compliant and thriving business environment.  @DubeMatutu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/t6u6868.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw Traders have been urged to familiarise themselves with import and trading regulations to ensure compliance with the law, as the Government intensifies efforts to combat smuggling and tax evasion. Speaking during a Gwanda Business Association breakfast meeting on Friday, Zimbabwe Revenue Authority (Zimra) Bulawayo customs officer Mrs Makhosazana Kuture emphasised the need […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "Raisedon Baya’s first 2025 wish…Lunch with 20 leading artistes",
            "url": "https://www.chronicle.co.zw/raisedon-bayas-first-2025-wish-lunch-with-20-leading-artistes/",
            "content": "Mthabisi Tshuma\n\nHis dream is nothing short of developing the Bulawayo Creative and Cultural Industries (CCIs) and even beyond the city, which is recognised as Zimbabwes cultural hub.\n\nHis name is Raisedon Baya.\n\nA creative legend in the making, an inspiration to many in the arts scene and a breakthrough figure for countless individuals, he is a man who spares no effort in achieving his goals.\n\nIntwasa Arts Festival koBulawayo, short plays such as Witnesses and Victims (directed by the late Sihlangu Dlodlo), Super Patriot and Morons, Madmen and Foolsyou name itthese are all his works.\n\nRaisedon Baya\n\nFor his first project of 2025, Baya revealed his wish to meet leaders in Bulawayos arts scene in an informal setting to share ideas.\n\nIts a simple wish: to have lunch with 20 arts leaders. Not a workshop, not a business meeting, but just an informal social gathering for networking.\n\nWe are a divided sectorvery competitive, very individualisticand that will not take the sector forward. We need to start working together, sharing, collaborating and that can only start with us getting to know each other and spending time together, said Baya.\n\nHe expressed hope that the lunch would mark the beginning of significant progress in the creative sector.\n\nThats the basic idea of the lunch: to kick-start a culture of trust and collaboration to develop our sector.\n\nI want a simple lunch, nothing expensive, and I am in the process of sourcing funds. The idea of the lunch is not to involve artists but leaders. There arent that many leaders. I now have the 20 leaders, who will be named soon, with the lunch likely to take place on January 18, said Baya. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/yhjugjuy.jpg",
            "description": "Mthabisi Tshuma His dream is nothing short of developing the Bulawayo Creative and Cultural Industries (CCIs) and even beyond the city, which is recognised as Zimbabwe’s cultural hub. His name is Raisedon Baya. A creative legend in the making, an inspiration to many in the arts scene and a breakthrough figure for countless individuals, he […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "COMMENT: A major milestone for decentralised justice",
            "url": "https://www.chronicle.co.zw/comment-a-major-milestone-for-decentralised-justice/",
            "content": "IN a landmark event, the Chief Justice of Zimbabwe, Luke Malaba, yesterday marked the official opening of the 2025 legal year with a speech underscoring the significance of decentralising justice.\n\nFor the first time, the main proceedings were held outside Harare, in Bulawayo, reflecting the Judicial Service Commissions commitment to making justice more accessible to all citizens, in line with the Constitution and the Governments National Development Strategy 1.\n\nThe Chief Justice highlighted the importance of this occasion as a moment to reflect on the past years achievements and challenges and to set a course for the future.\n\nHe praised the collective efforts of all stakeholders in the justice system, whose dedication to upholding the rule of law, protecting individual rights and ensuring fair and timely justice is crucial in meeting the evolving demands of society.\n\nChief Justice Luke Malaba greets Judges during the official opening of the 2025 legal year in Bulawayo yesterday\n\nThis event also served as a reminder of the judiciarys accountability to the public. The Chief Justice emphasised that the judiciary derives its mandate from the people and must therefore report on its performance and outline measures to address any challenges in justice delivery.\n\nWe applaud the decision to move the main proceedings to Bulawayo, decentralising justice has been a major goal in the Second Republic.\n\nDecentralisation has significantly improved access to justice in several ways, chief among them is proximity to legal services. By holding judicial proceedings and services in various regions, people no longer need to travel long distances to the capital for legal matters. This makes it easier for individuals to attend court sessions and access legal assistance.\n\nDecentralising courts helps distribute cases more evenly across the country, reducing the backlog in major cities. This leads to quicker resolution of cases and more efficient justice delivery.\n\nBringing justice closer to the people fosters greater transparency and accountability. When citizens see the judiciary actively working in their communities, it builds trust and confidence in the legal system.\n\nLocalising judicial services can reduce the costs associated with travel and accommodation for litigants, witnesses and legal professionals. This makes the legal process more affordable and accessible.\n\nIn a diverse country like Zimbabwe, decentralised courts can better understand and respect local customs and languages, ensuring that justice is administered in a culturally sensitive manner.\n\nThe opening of the legal year is not just a ceremonial event but a platform for the judiciary to explain how it has administered the courts and performed over the past year.\n\nThe decision to host the event in Bulawayo is a significant step towards decentralising public services and ensuring that justice is not confined to the capital but is accessible to all Zimbabweans.\n\nThis move is a testament to the judiciarys commitment to transparency, accountability, and service to the people.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/legal-year-opening-14-Jan-2025-12.jpg",
            "description": "IN a landmark event, the Chief Justice of Zimbabwe, Luke Malaba, yesterday marked the official opening of the 2025 legal year with a speech underscoring the significance of decentralising justice. For the first time, the main proceedings were held outside Harare, in Bulawayo, reflecting the Judicial Service Commission’s commitment to making justice more accessible to […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "Gold sector defies odds, surpasses target",
            "url": "https://www.chronicle.co.zw/gold-sector-defies-odds-surpasses-target/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nRECENT gold production figures from Fidelity Gold Refinery (FGR) illustrate a robust sector in Zimbabwe, defying expectations and solidifying the countrys position on the global market.\n\nGold is Zimbabwes single largest export earner, averaging US$3 billion annually over the past few years.\n\nIn 2016, miners delivered 21.4 tonnes to FGR, up from 18.6 tonnes in 2015.\n\nDeliveries increased to 24 tonnes in 2017 and 33.29 tonnes in 2018. In 2019, the total was 27.66 tonnes, rising to 30.1 tonnes in 2020 and reaching 29.7 tonnes in 2021.\n\nAccording to FGR, Zimbabwes sole buyer of the precious metal, 35.3 tonnes were realised in 2022.However, the countrys gold production reached a record 36,48 tonnes in 2024, a 21 percent surge from 30.1 tonnes recorded in 2023. The government had set a target of 35 tonnes.\n\nThis achievement comes despite numerous challenges, including economic fluctuations and global market pressures.\n\nThe intermittent power supply also significantly affected mining companies, which rely heavily on consistent electricity supply to operate machinery.\n\nPower challenges not only disrupt production but also drive up costs. Many mines rely on diesel generators as a temporary solution, however, high fuel prices and increased maintenance expenses add to their financial burdens.\n\nMines without access to dedicated power lines are facing severe and ongoing outages, which hinder their ability to meet production targets.\n\nAs a result, mining companies are increasingly relying on more expensive energy sources, such as diesel.\n\nThe rising costs associated with procuring these alternatives have created significant operational challenges for mining entities.\n\nDespite the challenges faced by authorities and industry players, however, gold production surpassed expectations.\n\nArtisanal and small-scale miners delivered a significant 23.7 tonnes of gold, while primary producers contributed 12.7 tonnes.\n\nThe mining sector is vital to Zimbabwes economy, accounting for approximately 60 percent of the countrys export earnings and making a substantial contribution to the Gross Domestic Product.\n\nThe government has been focusing on diversifying energy sources by investing in new infrastructure.\n\nA noteworthy development is the recent construction of the Hwange Thermal Power Station Units 7 and 8 Project, which has successfully added 600 megawatts to the national grid.\n\nThe gold sector carries huge potential for the countrys economy with small-scale miners producing about 60 percent of gold receipts, which has necessitated consistent efforts to support their production.\n\nIndustry experts credit this increase in production to the dedication of local miners and the governments efforts to improve the mining environment.\n\nStreamlining licensing procedures and supporting small-scale miners has resulted in higher output and investment.\n\nAdditionally, new technologies and enhanced mining practices have increased efficiency, enabling small operators to optimise their yields.\n\nMr Payne Kupfuwa, Chief Executive Officer of the Young Miners Foundation, asserts that the rise in gold production, primarily from small-scale miners, is beneficial for the economy and strengthens Zimbabwes position in the global gold market.\n\nAs demand for gold increases, local producers are well-positioned to take advantage of favourable conditions. He noted that reaching the 36-tonne milestone is just the start, paving the way for even greater achievements in the future.\n\nThe sector could produce between 40 to 50 tonnes annually with sufficient and readily available energy supply, he said.\n\nThe young miners family was thrilled by the delivery of 36.48 tonnes of gold in 2024, a 21 percent increase over 2023. This significantly contributes to Zimbabwes economic growth, as it is tied to gold production. We believe we can achieve annual outputs of 40 to 50 tonnes, he said.\n\nPower is essential throughout our gold production process. If power remains available, we can boost gold output. We are optimistic as young miners and are preparing for 2025, he said.\n\nMr Kupfuwa is optimistic that investors are likely to respond positively to the production levels, potentially increasing foreign direct investment in the sector.\n\nChief executive officer of the Zimbabwe Miners Federation (ZMF), Mr Wellington Takavarasha said several factors contributed to the growth in 2024, including the implementation of supportive policies, advantageous pricing and strengthened regulatory frameworks.\n\nIncreased mining activities by artisanal and small-scale miners, timely payments to miners and favourable gold prices are other factors, said Mr Takavarasha.\n\nThe introduction of a five percent gold incentive for artisanal and small-scale miners who sold 10kg of gold or more also significantly boosted deliveries, he said.\n\nMiss Precious Ndimande, a small-scale miner in Filabusi, emphasised that the growth of the mining sector is vital for attracting foreign investment and stabilising the economy.\n\nShe said exceeding 35 tonnes of gold production in 2024 signals an upward trend for Zimbabwes gold sector.\n\nWith collaborative efforts from the government, miners and stakeholders, a promising future lies ahead. The coming years may bring further advancements, reinforcing Zimbabwes role in the global gold market and significantly aiding the nations economic recovery.\n\nThe resilience and determination shown so far indicate a bright future, where Zimbabwe can truly excel on the world stage, she said.\n\nAdditionally, Miss Ndimande said women in mining are eager to contribute significantly to production levels.\n\nLarge-scale miners also significantly increased their output.\n\nDallaglio, the gold division of Padenga, produced 2 025kg in the nine months ending September, representing a 22 percent increase compared to the same period in 2022.\n\nOn the other hand, Caledonia produced 1 610 kg by September and has projected a full-year output of approximately 2 200kg for 2024.\n\nFigures from FGF show that the October 2024 output reached 4.3 tonnes, while in December, 4.2 tonnes were produced.\n\nThe fourth quarter production increased to 12.2 tonnes, representing the highest quarterly production of the year. This was followed by a production level of 10.4 tonnes recorded in the third quarter of 2024.\n\nGovernment has indicated plans to set up additional gold centres across provinces to boost deliveries to FGR and promote mineral beneficiation and local value-addition.\n\nFGR operates 17 gold buying centres strategically located across all mining provinces in Zimbabwe.The government has identified gold centres as among the key intervention strategies needed to bridge the gap between small-scale miners and some of their legacy challenges largely centred on a lack of machinery and technical know-how on modern mining methods.\n\nIn the 2025 National Budget statement, Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, noted that the initiative will be financed through collaboration between the Government and the private sector.\n\nAccording to the Mining Industry Prospects for 2025, mining executives are optimistic that the sector will register a strong rebound in 2025 with mineral revenue, employment levels and capacity utilisation projected to increase.\n\nSurvey findings show that average capacity utilisation for the mining industry is expected at 90 percent in 2025 up from 84 percent in 2024. Key sectors anticipated to drive the improvement in capacity utilisation are gold, ferrochrome and PGMs, reads part of the report.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/TYUYHT6.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chroncile.co.zw RECENT gold production figures from Fidelity Gold Refinery (FGR) illustrate a robust sector in Zimbabwe, defying expectations and solidifying the country’s position on the global market. Gold is Zimbabwe’s single largest export earner, averaging US$3 billion annually over the past few years. In 2016, miners delivered 21.4 tonnes to FGR, up from […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        },
        {
            "title": "Bulawayo gears up for Misters of Zimbabwe auditions",
            "url": "https://www.chronicle.co.zw/bulawayo-gears-up-for-misters-of-zimbabwe-auditions/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nBulawayo auditions for the Misters of Zimbabwe will take place at the Kings Kraal on January 25.\n\nThe auditions will begin at 10:00am and conclude at 2:00 pm. Other cities have already held their auditions online and entry to the Bulawayo auditions is free.\n\nThe pageant final is scheduled for March 15 at the Harare Showgrounds. According to one of the organisers, Zibusiso Mtshayisa, the auditions aim to discover male models who can represent Zimbabwe on a global stage.\n\nRoyce Gavi\n\nMisters of Zimbabwe is hosting its third Misters of Zimbabwe pageant, and other cities have already auditioned online. However, the Bulawayo auditions will be different, as we will be conducting physical auditions.\n\nFounded in 2023, Misters of Zimbabwe has quickly become a leading national male pageant. Our debut at the Man of the World competition in the Philippines earned multiple awards and in 2024, we secured the Mister Tourism World and Mister Tourism Africa franchises.\n\nWe also achieved accolades such as Best National Costume. With new franchises lined up for 2025, including Mister Earth International, we are a fast-growing, nationally recognised platform representing Zimbabwe on the global stage, he shared.\n\nThe judging panel includes award-winning model Royce Gavi, who is a fashion designer and the reigning Mr Tourism Africa Zimbabwe; Ben Chest, a multi-talented, award-winning model, actor, brand ambassador and influencer; and Victoria Ncube. Hosting the auditions will be Zibusiso Mzolisi Mtshayisa.\n\nBen Chest\n\nZibusiso further emphasised that the competition is seeking individuals who embody the values of confidence and community spirit.\n\nIf you think you have what it takes to be crowned, dont miss the opportunity to showcase your talent, make new connections and represent the country on a global stage.\n\nI personally requested the physical audition in Bulawayo as I wanted to create an opportunity for Bulawayos male models to participate. This was after realising that we have very few male models from Bulawayo, he said.\n\nParticipants are expected to arrive dressed in black T-shirts and jeans.\n\nThe pageant was created to provide opportunities and empower male models, as most pageants, such as Miss Universe and Miss Environment, traditionally focus on empowering young women.\n\nThe Misters of Zimbabwe also holds contracts with international pageants, including Mr Global, Mr Manhunt, Mr Grand International and Mr Tourism World.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/dddddddd.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com Bulawayo auditions for the Misters of Zimbabwe will take place at the King’s Kraal on January 25. The auditions will begin at 10:00am and conclude at 2:00 pm. Other cities have already held their auditions online and entry to the Bulawayo auditions is free. The pageant final is scheduled for March 15 […]",
            "time": "08:39",
            "date": "14 Jan 2025"
        }
    ]
}