{
    "news": [
        {
            "title": "Helidrive Zimbabwe Helicopter Airlifts First Patient in Tsholotsho",
            "url": "https://www.chronicle.co.zw/helidrive-zimbabwe-helicopter-airlifts-first-patient-in-tsholotsho/",
            "content": "By Sikhumbuzo Moyo[emailprotected]\n\nA CRITICALLY injured knife stab victim was airlifted yesterday afternoon by a Helidrive Zimbabwe helicopter from Tsholotsho District Hospital to the United Bulawayo Hospital (UBH), where he is receiving treatment from an Ear, Nose and Throat (ENT) specialist.\n\nThe man, whose identity could not be disclosed by Tsholotsho District Medical Officer Dr Mbonisi Nyathi for ethical reasons, was referred from Pumula Mission in the same district with a deep knife wound on his neck.\n\nHe is a male adult, aged 35 years. He was referred from Pumula Mission with a deep knife wound to the anterior aspect of his neck. He was flown to UBH and is under the care of an ENT specialist, said Dr Nyathi.\n\nThis marks the first airlift of a patient from Matabeleland North by a Helidrive helicopter and the second such case in the region this month. Earlier, four-and-a-half-year-old Tatenda Machezera from Bulawayo was airlifted for specialist treatment at Parirenyatwa Hospital in Harare.\n\nThe helicopter, which functions as a flying intensive care unit, is one of two air medical rescue service ambulances stationed at UBH. These ambulances provide swift medical responses for emergencies, such as critically injured road accident victims. They are also used to transport patients from remote areas that would otherwise take hours to reach by road.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/34erq12.jpg",
            "description": "By Sikhumbuzo Moyo smoyo@chronicle.co.zw A CRITICALLY injured knife stab victim was airlifted yesterday afternoon by a Helidrive Zimbabwe helicopter from Tsholotsho District Hospital to the United Bulawayo Hospital (UBH), where he is receiving treatment from an Ear, Nose and Throat (ENT) specialist. The man, whose identity could not be disclosed by Tsholotsho District Medical Officer […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "EFF’s Dr Mbuyiseni Ndlozi resigns from SA parliament",
            "url": "https://www.chronicle.co.zw/effs-dr-mbuyiseni-ndlozi-resigns-from-sa-parliament/",
            "content": "EFF MP Dr Mbuyiseni Ndlozi has resigned from parliament. The party made the announcement on Thursday after months of speculation about a fallout with party leader Julius Malema.\n\nThis followed the resignation of Malemas deputy Floyd Shivambu, who has since become MK Party secretary-general. Sources in the EFF had said Ndlozi was ostracised because he remained silent after Shivambus controversial exit.\n\nBut the party said on Thursday Ndlozis resignation, along with that of fighter Yazini Tetyana, was voluntary. The EFF has accepted the respective voluntary requests to be released from the deployment of the two fighters, who have diligently served the organisation in their respective deployments since the EFF has had representation in the legislative sphere, said EFF spokesperson Leigh-Ann Mathys in a statement.\n\nTetyana served in the Eastern Cape Provincial Legislature and, subsequently, parliament, while Ndlozi had served in the National Assembly since 2014, the party said.\n\nTimesLIVE\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/unnamed-1-680x380.jpg",
            "description": "EFF MP Dr Mbuyiseni Ndlozi has resigned from parliament. The party made the announcement on Thursday after months of speculation about a fallout with party leader Julius Malema. This followed the resignation of Malema’s deputy Floyd Shivambu, who has since become MK Party secretary-general. Sources in the EFF had said Ndlozi was ostracised because he […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "Presidential Heifer Scheme reshaping lives in Zimbabwe",
            "url": "https://www.chronicle.co.zw/presidential-heifer-scheme-reshaping-lives-in-zimbabwe/",
            "content": "Mashudu Netsianda,[emailprotected]\n\nThe Command Livestock Programme and Presidential Heifer Pass-on Scheme, aimed at empowering youths, have transformed into a lifeline for numerous families, providing hope and opportunities where there was once hardship.\n\nLaunched by President Mnangagwa between 2018 and 2022, the initiatives have provided thousands of Zimbabweans with heifers, aimed at boosting livestock production and improving livelihoods in rural areas.\n\nFor many beneficiaries, the heifer they received marked the beginning of a new chapter. One such beneficiary is Ms Sizile Mpabanga from Janee Village in Gwanda District.\n\nHer family had long relied on subsistence farming, struggling to make ends meet with limited resources. When they received five heifers, it was a turning point.\n\nThe day we received the heifer, I couldnt believe it. It was a dream come true. For years, we struggled to keep our small plot going. Our crops were often destroyed by drought, and we didnt have enough animals to help with ploughing, she said.\n\nBut now, we have a source of income and food. The heifer has already calved twice, and we sell the milk to the local market and raise money for school fees among other necessities.\n\nMs Mpabanga said although some of the animals succumbed to the El Nino-induced drought, the number had increased to about 13.\n\nI managed to take my son to university through farming using these heifers and selling milk. I am grateful to the Government for empowering my family through the command livestock scheme, she said.\n\nAnother beneficiary, Mr Philip Ndou of Mazunga in Beitbridge District said the Presidential scheme has seen his fortunes change.\n\nI received two heifers and a calf under the Command Livestock and these animals boosted my kraal. I have always been a cattle farmer because this part of the country receives low rainfall and has relied on animal husbandry, he said.\n\nThe number grew to about 11, although three later succumbed to drought due to depleted pastures. Unfortunately, just last week, one of the cows, which was calving was hit by a car while grazing along the highway.\n\nMr Ndou said with the onset of the rainy season, he is optimistic that the herd will grow following an improvement in pastures.\n\nHe said the Command Livestock programme has created new economic opportunities for him.\n\nAnother beneficiary of the Command Livestock programme, Ms Takalani Moyo of Mazunga Village said when she lost her husband in 2012 and another breadwinner, her son two years later, she thought her life was doomed forever.\n\nThe death of my husband had a devastating effect as it not only left me emotionally affected but also and financially stressed. When I received three heifers from the President, everything changed for the better, she said.\n\nThe cattle have grown to 10 and had it not been drought, the number could have been almost double. This scheme has transformed my life. I no longer have to rely on handouts.\n\nMs Sizi Madonko from Gwanda District shared a similar experience.\n\nWe were living hand-to-mouth before the heifer. My husband and I could barely afford to buy food, let alone pay for our childrens school fees. Now, we have milk, and we also sell some of the calves, she said, her voice filled with pride.\n\nOur children no longer have to drop out of school because we can now afford their fees.\n\nMr Moses Langa, a youth who benefitted under the Presidential Heifer Pass-on Scheme in Matabeleland South said heifers have brought a sense of dignity and empowerment to many youth in the province.\n\nThis scheme is a way of empowering us as young people. President Mnangagwa has always prioritised empowering us young people in agriculture, and mining among other sectors.\n\nUnder the Presidential Heifer scheme, youths inMatabeleland South got 70 heifers, he said.\n\nWe have been doing follow-ups since the scheme started in September last year and we expect in a year or two, to be dropping a calf. This is a life-changing scheme given that it came after we were given 10-hectare plots by the President.\n\nMr Langa said the gesture is in line with the Presidents mantra of leaving no one and no place behind in terms of development.\n\nYouths in Matabeleland North and Matabeleland South got 70 heifers each under the programme. Mashonaland East got the lions share of 90 heifers.\n\nMatabeleland North Provincial Affairs and Devolution Minister Richard Moyo, said the scheme has not only provided livestock to families but also created an avenue for income generation.\n\nLaunching the Provincial Integrated Youths Skills Development Centres (PIYSDC) for the countrys 10 provinces in 2022 in Kwekwe in Midlands Province, President Mnangagwa distributed 710 heifers targeting the youths as beneficiaries under the Presidential Heifer Pass-on Scheme.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/asx.jpg",
            "description": "Mashudu Netsianda, mashudu.netsianda@chronicle.co.zw  The Command Livestock Programme and Presidential Heifer Pass-on Scheme, aimed at empowering youths, have transformed into a lifeline for numerous families, providing hope and opportunities where there was once hardship. Launched by President Mnangagwa between 2018 and 2022, the initiatives have provided thousands of Zimbabweans with heifers, aimed at boosting livestock production and […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "Defer polls to 2030 for continued development — CCC",
            "url": "https://www.chronicle.co.zw/defer-polls-to-2030-for-continued-development-ccc/",
            "content": "Farirai Machivenyika,Harare Bureau\n\nTHE countrys main opposition party, CCC, is in agreement with a resolution by the ruling Zanu-PF party to postpone the next harmonised elections from 2028 to 2030 to allow developmental projects initiated by President Mnangagwa and the Second Republic to come to fruition.\n\nZanu-PF made the resolution at its National Peoples Conference held in Bulawayo last year, saying President Mnangagwa deserved to continue in office in light of the remarkable progress the country has achieved under his watch.\n\nIn an interview yesterday, CCC chief whip Mr Charles Moyo said the deferment of elections to 2030 would also allow smooth implementation of the National Development Strategy 2 (NDS2) that is being formulated and is expected to be launched in November this year.\n\nAs CCC we are lobbying for the deferment of elections, we are proposing dialogue as the CCC together with the revolutionary party Zanu-PF, he said.\n\nAsked how long the deferment should be, Mr Moyo said postponing the 2028harmonised elections to 2030 would be ideal.\n\nDeferment to 2030 would be ideal as it is in concurrence or in sync with the (implementation of) NDS 2, he said.\n\nThe implementation of NDS 2 is expected to run from this year to 2030 and Mr Moyo said the country should then use the deferment period for national and consensus building, fostering unity and improving service delivery.\n\nSince the advent of the Second Republic under President Mnangagwa, the country has seen massive infrastructure projects that include roads and dam construction, power generation projects that are expected to solve the electricity woes being experienced in the country and record-breaking wheat yields that have made the nation self-sufficient in terms of flour availability.\n\nCde Pupurai Togarepi, Zanu-PF chief whip in the National Assembly, said as the ruling party, they would take a position on the deferment if the CCC brings a motion on that issue to Parliament.\n\nThats their view (deferment of elections), it is allowed in a mature democracy. When the motion comes to Parliament, we will scrutinise the movers prayer for its reasonableness and allow all Parliamentary processes before we take a position.\n\nI am happy that they recognise the importance of various Government policies such as NDS blueprints to the development of Zimbabwe. Lets cross the bridge when we get there. We have always supported progressive and objective ideas brought forward during debates in Parliament, he said.\n\nJustice, Legal and Parliamentary Affairs Minister Ziyambi Ziyambi, said the Constitution would be amended to extend the Presidents term if that is the wish of the majority of Zimbabweans.\n\nMinister Ziyambi Ziyambi\n\nShould the generality of Zimbabweans want the President to continue in office then the law can be changed because Zimbabwe is a democracy and no law is cast in stone except the 10 Commandments. So, the law can be changed if thats what the majority of Zimbabweans want, Minister Ziyambi said.\n\nIn October last year, Zanu-PF was unanimous that President Mnangagwas term of office must be extended to 2030 to enable him to fulfill his unprecedented transformative developmental programmes.\n\nPresenting resolutions at the partys 21st National Peoples Conference that was held in Bulawayo, the Zanu-PF Secretary for Legal Affairs, Cde Patrick Chinamasa, said the resolution on the extension of the Presidents term appeared in all thematic committee resolutions and across the countrys 10 provinces.\n\nAt the conference, delegates overwhelmingly and unanimously endorsed a resolution to extend the Presidents term, directing the Government to proceed with the necessary constitutional amendments needed to clear the path for President Mnangagwa to stay on.\n\nRecently, Zanu-PF Central Committee member, Cde Jenfan Muswere, clarified the partys resolution making process, saying decisions made at the recent Annual National Peoples Conference are binding because they were unanimously adopted.\n\nCde Muswere, who is also Information, Publicity and Broadcasting Services Minister, and legislator for Makoni West Constituency, emphasised that the call for President Mnangagwas continued leadership was an agreed party position, resolved and adopted at the Annual National Peoples Conference.\n\nHe was responding to a question raised by Cde Gilbert Zowa, a recently elected war veterans association member, to clear the air on the ED2030 slogan.\n\nCde Zowa had sought clarity on the ED2030 slogan, noting that President Mnangagwa himself had expressed disinterest in extending his term beyond 2028, despite the partys enthusiasm for his continued leadership.\n\nThe ED2030 slogan has garnered significant traction as party supporters overwhelmingly urge President Mnangagwa to extend his Presidency beyond the current constitutional two-term limit.\n\nCde Muswere said the resolution to extend President Mnangagwas leadership beyond 2030 is in line with Zanu-PFs constitution, since the conference that endorsed the resolution had a full quorum, making it legally and properly constituted.\n\nHe highlighted the importance of maintaining constitutional integrity and adherence to party principles and values when implementing such resolutions.\n\nCde Muswere said the extension of President Mnangagwas leadership is an opportunity to consolidate the ongoing economic, infrastructural and social transformation programmes, guaranteeing continuity in policies aimed at achieving Vision 2030.\n\nStability and consistency in leadership, he said, are crucial for realising the countrys long-term goals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/07/Untitled-73.jpg",
            "description": "Farirai Machivenyika, Harare Bureau THE country’s main opposition party, CCC, is in agreement with a resolution by the ruling Zanu-PF party to postpone the next harmonised elections from 2028 to 2030 to allow developmental projects initiated by President Mnangagwa and the Second Republic to come to fruition. Zanu-PF made the resolution at its National People’s Conference […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "Bulawayo suburbs under illegal mining siege",
            "url": "https://www.chronicle.co.zw/bulawayo-suburbs-under-illegal-mining-siege/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nSix metres deep into the earth, two illegal gold miners laboured in silence yesterday afternoon, chipping away a rock in search of gold in a pit that has become a hub for illegal gold panning activities in the affluent Bulawayo suburb of Mqabuko Heights.\n\nThe massive pit, large enough to engulf a three-roomed house, has been a focal point for illegal mining for years. Using rudimentary tools such as chisels and hammers, the miners collected rocks which they planned to transport to an undisclosed milling site using a bicycle stationed nearby.\n\nTheir activities were shielded from the prying eyes of law enforcement, despite ongoing raids by police and the Environmental Management Authority (EMA).\n\nResidents of Mqabuko Heights are growing increasingly concerned about the impact of illegal mining.\n\nMr Alice Mombeshora, a resident, said the activities have disrupted the peace and devalued properties in the area.\n\nSome of the pits dug by illegal miners in the vicinity of houses at the suburb\n\nThey usually work in the middle of the night but have stopped using explosives to avoid drawing attention. Serious buyers will hesitate to invest in properties here because of the gold panners, she said.\n\nThe problem is not confined to Mqabuko Heights. Suburbs such as Queenspark, New Parklands, and Killarney are also grappling with land degradation caused by rampant illegal mining. In Queenspark, residents said gold panners continue their operations despite heavy rains.\n\nGold panning activities have been going on for years despite raids by law enforcement authorities in a bid to clamp down on rampant cases of violence in such operations.\n\nThe pits are under electricity pylons between Queenspark and Mahatshula. Recently, they used a fuel-powered generator to pump out rainwater so they could keep working, said Mr Alex Maphisa, a Queenspark resident.\n\nWe thought they would stop digging in the pits because of the recent rains, but it appears that they have devised ways of pumping the water out of the pits.\n\nTragically, illegal mining has also claimed lives. In December last year, Shelton Ndlovu (20) drowned in a pit filled with rainwater along the Lunga River in Umzingwane District\n\nIn May last year, two people were killed and several others seriously injured in violent clashes between rival illegal gold mining groups near Cement Siding in Bulawayo.\n\nSome of the pits dug by illegal miners in the vicinity of houses at the suburb\n\nThe fight erupted at Willsgrove East Mine, a registered claim operated by Umguza Black Empowerment Syndicate, over newly discovered gold deposits.\n\nThe gold panners reportedly attacked each other with dangerous weapons including picks, machetes and shovels.\n\nKillarney suburb has also seen a surge in illegal mining, with panners using compressors, picks and shovels to extract gold. A panner at a local squatter camp revealed that gold buyers visit the site daily to purchase the ore.\n\nZimbabwe Miners Federation chief executive officer, Mr Wellington Takavarasha, said in terms of the legal requirements for mining operations, a mine must be at least one kilometre from residential areas and miners must obtain a blasting licence from the Ministry of Mines. Community consent is also required before mining begins.\n\nThe blasting licence that a miner must obtain from the Ministry of Mines and Mining Development clearly stipulates that a mine must be at least one kilometre or more away from the nearest human settlements so that when blasting of explosives is done, people are safe from the debris, he said.\n\nA miner must also get the consent of the community where they intend to operate before commencing operations, which is why in extreme cases some communities are relocated to make way for mining operations.\n\nEnvironmental Management Authority (EMA) spokesperson, Ms Amkela Sidange, said mining is governed by the laws of the country and EMA plays its part in ensuring that certain tenants of the industry that border on environmental issues are adhered to.\n\nIllegal mining activities can encompass both established mining companies and the typical pick-and-shovel kind of mining. However, EMA conducts regular raids to make sure that miners comply with the rules and regulations that govern the industry in terms of complying with environmental issues, she said.\n\nEMA conducts awareness campaigns in communities and organised mining groups that come together to form mining clusters.\n\nMining results in the loss of ecological ecosystems in the form of trees and bio-diversity and from our side EMA, its important to make sure that all environmental related regulations are adhered to, said Ms Sidange\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/jhfgrhjhjf.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com Six metres deep into the earth, two illegal gold miners laboured in silence yesterday afternoon, chipping away a rock in search of gold in a pit that has become a hub for illegal gold panning activities in the affluent Bulawayo suburb of Mqabuko Heights. The massive pit, large enough to engulf a three-roomed […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "‘War is coming’ Scottland unveil deadly strike force",
            "url": "https://www.chronicle.co.zw/war-is-coming-scottland-unveil-deadly-strike-force/",
            "content": "innocent Kurira,[emailprotected]\n\nIN a move thats set to shake up the Castle Lager Premier Soccer League, newly promoted Scottland FC have unveiled a formidable attacking trio that could potentially become the countrys deadliest.\n\ncastle lager premier soccer league\n\nThe club yesterday announced the signing of Soccer Star of the Year, Walter Musona, first runner-up and top goal scorer, Lynoth Chikuhwa, and second runner-up, Khama Billiat.\n\nChikuhwa, who scored an impressive 17 goals last season, had been linked to Scottland FC for weeks.\n\nBilliat, who netted 13 goals, and Musona, who scored 10 goals and was named the best player in the land complete the trio.\n\nThis attacking force is reminiscent of some of the most feared trios in international football, including Barcelonas MSN (Lionel Messi, Luis Surez, and Neymar) and Liverpools Mohamed Salah, Roberto Firmino, and Sadio Man.\n\nSadio Mane\n\nScottland FCs bold move is accompanied by a warning: War is coming.\n\nWith the addition of another top striker, Tymon Machope, who scored 11 goals last season, the teams arsenal is indeed formidable.\n\nThe club has also announced the signing of several other top players, including Godknows Murwira, Mthokozisi Msebe, Michael Tapera, Kevin Moyo, Talbert Shumba, Nelson Chadya, Panashe Mutimbanyoka, Gareth Madhake, Tichaona Chipunza, Vassili Kawe, and Kingsley Mureremba. Veteran Highlanders defender Peter Muduhwa has also joined the team.\n\nScottland FCs meteoric rise is nothing short of remarkable. Promoted from the Northern Region Soccer League last season, the team has become the richest in the league, boasting a staggering US$2,5 million war chest for the 2025 season.\n\nThis is thanks to a US$1,5 million sponsorship deal with Sakunda Holdings and a US$1 million injection from IMC Communications, fronted by Harare businessman Wicknell Chivayo.\n\nWith Tonderayi Ndiraya at the helm as head coach, expectations are high for Scottland FC to make a significant impact in the 2025 season. @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fghgjb.jpg",
            "description": "innocent Kurira , innocent.kurira@chronicle.co.zw IN a move that’s set to shake up the Castle Lager Premier Soccer League, newly promoted Scottland FC have unveiled a formidable attacking trio that could potentially become the country’s deadliest.  The club yesterday announced the signing of Soccer Star of the Year, Walter Musona, first runner-up and top goal scorer, Lynoth Chikuhwa, […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "The world should not forget Afghanistan",
            "url": "https://www.chronicle.co.zw/the-world-should-not-forget-afghanistan/",
            "content": "Hujjatullah Zia,Correspondent\n\nIn a world where crises compete for attention, Afghanistan, once at the forefront of international aid and media coverage, now sits in the shadows. Last year, the global focus was overwhelmingly on victims of wars in Gaza, Sudan and Ukraine.\n\nThe multiple crises that plague Afghanistan have barely registered in international media headlines and yet, they persist. Afghans endure worsening humanitarian, climate and economic crises, characterised by severe poverty, food insecurity and dwindling aid.\n\nIn 2024, 23,7 million people  more than half of the population  required humanitarian assistance. Reports show that Afghanistan has the fourth largest number of people facing severe hunger and food shortages. About 12,4 million Afghans do not know where their next meal will come from, placing their country among the top hunger hotspots alongside Palestine, Yemen, Haiti and Syria.\n\nAbout 80 percent of families live on less than $1 per day per person. Nearly four million children, pregnant women and breastfeeding mothers are malnourished. These already dire circumstances are exacerbated by frequent natural disasters from which communities do not have the capacity to recover.\n\nEarthquakes, floods and landslides regularly devastate the country. For instance, in October 2023, several magnitude 6.3 earthquakes struck Herat province, killing at least 2 000 people and injuring thousands more. More than 10 000 homes were destroyed and more than 20 000 severely damaged. At least 275 000 people were affected and were in need of assistance.\n\nDespite some relief efforts in the immediate aftermath of the earthquakes, Herat remains devastated. Thousands of families are facing harsh weather for a second winter without permanent housing or proper access to water, food and sanitation. Destroyed schools have not been rebuilt.\n\nClimate change has also affected Afghanistan. Despite contributing less than 0,1 percent of global greenhouse gas emissions, it ranks among the top 10 countries most vulnerable to climate change. Issues like drought and water scarcity are particularly severe.\n\nIn Kabul, water shortages have become so dire that Unicef warned that the city could run out of groundwater by 2030 if immediate action isnt taken. The lack of water threatens not only urban populations but also rural communities where droughts have devastated local agriculture and livestock.\n\nAfghanistan has also struggled with a weak economy. Unemployment has doubled since 2023 while the forced return of Afghan nationals from neighbouring Pakistan has cut off vital economic lifelines. Despite increasing hostility towards Afghans in neighbouring countries, emigration continues at a high pace. About eight million people have left the country since 2020, according to the International Organisation for Migration.\n\nMany families consider leaving not only because of economic hardship but also because girls and women are denied education and employment.\n\nThese multiple crises are starkly visible in Kabul. Having no access to jobs, many women are forced to beg with their children in the streets while boys sell plastic bags, polish shoes and collect rubbish to earn money. Many labourers and wheelbarrow carriers have turned to begging, often waiting outside bakeries for scraps of bread.\n\nDespite the severity of the situation, Afghanistan rarely makes international headlines. This silence is especially heartbreaking when considering the growing number of children who are forced to work even in the cold of winter to earn a meagre living. Their stories of suffering deserve to be heard and acknowledged.\n\nHowever, Afghanistan needs more than attention. It requires meaningful action. The international community must recognise that the plight of the Afghan people is as urgent as those of the populations of Gaza, Sudan and Ukraine. A poverty and disaster-stricken Afghanistan abandoned by the international community can only be a source of instability in the region.\n\nTo break the cycle of hunger and poverty permanently, the international community, NGOs and donor countries must invest in sustainable, long-term solutions. These include building irrigation canals and dams, developing agriculture and livestock, improving infrastructure and creating jobs. Such efforts will help rural people remain in their communities, work their land and secure a better future for their children. Rural development would inevitably also help urban centres prosper.\n\nAfghanistans silent suffering and its plight require urgent action. By addressing the root causes of its crises, the international community can restore hope and dignity to its people and work towards a prosperous world where no nation is left behind.  Al Jazeera\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2018/11/s4.reutersmedia.net_-673x380.png",
            "description": "Hujjatullah Zia,Correspondent In a world where crises compete for attention, Afghanistan, once at the forefront of international aid and media coverage, now sits in the shadows. Last year, the global focus was overwhelmingly on victims of wars in Gaza, Sudan and Ukraine. The multiple crises that plague Afghanistan have barely registered in international media headlines […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "Bulawayo residents warned of increased risk of water-borne diseases",
            "url": "https://www.chronicle.co.zw/bulawayo-residents-warned-of-increased-risk-of-water-borne-diseases/",
            "content": "Mkhululi Ncube,[emailprotected]\n\nTHE onset of the rainy season in Bulawayo has brought renewed warnings from health experts about the risk of water-borne and vector-borne diseases.\n\nPoor drainage infrastructure, combined with heavy rains, has created conditions conducive to outbreaks of diseases such as cholera, typhoid and diarrhoea.\n\nBulawayo provincial medical director, Dr Maphios Siamuchembu, urged residents to remain vigilant and adopt preventive measures.\n\nDiseases that Bulawayo residents should be wary of during the rainy season include diarrhoeal diseases such as dysentery, cholera and typhoid. Rainwater can wash waste into unprotected and unsafe water sources.\n\nDue to water shortages in Bulawayo, people often resort to using rainwater for domestic purposes, increasing the risk of contracting these diseases, he said.\n\nDr Simbarashe Makati\n\nDr Siamuchembu urged residents to seek immediate medical attention if they experience symptoms such as diarrhoea, vomiting, or fever.\n\nHe also highlighted the increased risk of malaria, particularly in the south-eastern low-lying areas and the Zambezi Valley.\n\nMalaria transmission is heightened by heavy rainfall and high temperatures. Preventive measures include using mosquito nets, indoor and outdoor residual spraying, avoiding late outdoor activities, wearing long-sleeved clothing and using mosquito repellents.\n\nFor those living in high-risk areas, malaria prophylaxis medicines are available, but individuals should consult their doctors, especially if pregnant or lactating.\n\nMalaria is caused by a parasite of the genus plasmodium. It is transmitted to humans through female Anopheles species mosquito bites. Heavy precipitation and high temperatures alter the transmission and increase the incidence of malaria.\n\nHighest malaria risk is in the south-eastern low-lying areas. Higher elevation areas, which are becoming densely populated areas are becoming suitable for malaria transmission.\n\nPreventive measures include mosquito nets, outdoor and indoor residual spraying, avoiding late outdoor activities, wearing long-sleeved clothes and use of mosquito repellents\n\nDr Siamuchembu highlighted the role of hygiene in combating water-borne diseases.\n\nSimple practices like washing hands with soap before eating or preparing food can significantly reduce the risk of infection. People must also avoid consuming food from unhygienic sources during this period, he said.\n\nDr Simbarashe Makati a public health specialist, emphasised the importance of preventive measures.\n\nThe rainy season increases the likelihood of contaminated water sources, especially in areas with inadequate sanitation. We urge residents to ensure their drinking water is boiled or treated with chlorine to eliminate potential pathogens, he said.\n\nLike other water-borne diseases, improving sanitation and hygiene is key in prevention. Typhoid vaccines are available for prevention. They are available either in injectable format or as oral formulation.\n\nDr Wedu Ndebele\n\nDr Makati also warned of other seasonal hazards such as snake bites and scorpion stings, advising immediate first aid and safe handling of victims.\n\nDuring the rainy season with farming activities, there is a surge in snake bite cases. Once bitten by a snake or scorpion, as part of first aid, make sure you are in a safe environment to offer care.\n\nIf there is venom spit, the person rendering first aid must wash liberally with water and should not massage the wound site, he said.\n\nPaediatrician, Dr WeduNdebele, highlighted the vulnerability of children during this period.\n\nYoung children are particularly at risk because their immune systems are still developing. Parents should ensure their children drink safe water and eat well-cooked meals. Washing clothes, drying them in the sun and ironing them also helps eliminate disease-causing micro-organisms, he said.\n\nDr Ndebele noted that while Bulawayo is not a malaria-endemic area, an increase in imported cases is possible and mosquito nuisance may rise.\n\nThe Bulawayo City Council (BCC) has urged residents to report suspected cases of water-borne diseases promptly.\n\nThe council has also announced plans to intensify waste management and drainage maintenance efforts to minimise health risks during the rainy season.  @themkhust\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fdsfddfsdfs.jpg",
            "description": "Mkhululi Ncube , themkhust@gmail.com  THE onset of the rainy season in Bulawayo has brought renewed warnings from health experts about the risk of water-borne and vector-borne diseases.  Poor drainage infrastructure, combined with heavy rains, has created conditions conducive to outbreaks of diseases such as cholera, typhoid and diarrhoea. Bulawayo provincial medical director, Dr Maphios Siamuchembu, urged residents […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "Creatives mourn Winnie Khumalo",
            "url": "https://www.chronicle.co.zw/creatives-mourn-winnie-khumalo/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nOn Monday, South African Afropop superstar and dancer Winnie Khumalo, passed away at the age of 51, with local news attributing her death to a short illness. Her passing has left those in the creative and cultural industries reeling.\n\nHer last album, Woman, is a deeply personal reflection of her experiences, addressing themes of betrayal, family and lifes challenges.\n\nKhumalo was a regular feature at the now-defunct annual Kalawa Homecoming Party in Bulawayo and was a crowd favourite. She also worked for years with the late South African music icon, Brenda Fassie.\n\nThe record label, in a statement, described Khumalo as a true icon. Winnie Khumalo made a remarkable contribution to the South African music scene, inspiring many with her powerful voice and unforgettable performances. Her passion, talent and dedication to her craft have left an indelible mark on the industry and in the hearts of her fans. We extend our deepest condolences to her family, friends and fans during this difficult time, said the record label.\n\nOskido, one of the founders of Kalawa Jazmee, posted on his Facebook page that he was saddened by Khumalos death.\n\nMy heartfelt condolences on the passing of the iconic, Winnie Khumalo. Her legacy in music and entertainment will forever inspire us. May her soul rest in peace, posted Oskido.\n\nPopular radio personality, Babongile Skhonjwa told Chronicle Showbiz that Khumalo was a ball of fire and her loss will leave an unfillable gap.\n\nI remember bringing her to the country back in 2017 alongside Uhuru at the Youth Presidential Interface Rally in Bulawayo. She performed at White City Stadium and afterwards at Club 263 for the after-party. What shone most about her character was the fire in her belly. She was the life of the party.\n\nEzra Tshisa Sibanda with Winnie Khumalo and a colleague. (Picture credit Ezra Tshisa Sibanda Facebook page)\n\nNot only was she that, but she was also cool with everyone, very easy-going and everyone wanted a piece of her. We enjoyed having her around and her death leaves an unfillable gap, he said.\n\nBulawayo-based promoter, Mduduzi Mdlongwa, also reflected on Khumalos legacy, noting her maternal instincts and the warmth she exuded.\n\nI didnt interact a lot with her, but I would notice how everyone around her would call her mother. That on its own gave me the impression that she was a maternal figure and everybody loved her, said Mdlongwa, director of 3D Events.\n\nRadio personality, Ezra Tshisa Sibanda posted on his Facebook page about how Khumalo rocked the stage when she was a backing vocalist for the late Brenda Fassie.\n\nI remember vividly the sold-out Brenda Fassie concert in London and Fassies last-ever UK tour, which we promoted a few months before she died. I realised how talented Winnie Khumalo was; she was an exceptionally gifted musician and very strong on stage.\n\nStratford Rex Music venue was packed with over 3 000 people. Brendas band was on stage with her backing vocals also on stage, but she refused to sing as she was angry about somethinga story for another day, said Sibanda.\n\nHe said the crowd became restless, and she came to him and asked if she could take over and sing since Brenda was refusing to get on stage.\n\nI was panicking and hesitantly agreed. Winnie took over, belted out all Brenda Fassies hits and rocked the crowd big time. MaBree later joined in and took over. It was a fantastic concert and the crowd loved it, said Sibanda.\n\nHe added that Khumalo was just a great musician. Surely, death may have ended her life, but her musical legacy lives on, unbreakable and eternal. Her voice and talent were a gift to us, and we will honour that gift by keeping her memory alive. She might have gone, but the mark she left on our hearts is indelible, said Sibanda.\n\nIn South Africa, the Portfolio Committee on Sport, Arts and Culture noted her death with great sadness.\n\nCommittee Chairperson, Joe McGluwa said Ms Khumalos passing was a bad start to the year. Ms Khumalo was a legend. It fills us with great pride that she has left us with good memories of her undeniable artistic abilities. The music industry benefited greatly from her distinct voice and songwriting ability. The Afropop music genre is poorer with her passing.\n\nThe Live My Life hitmakers journey in music was marked by her support of legendary artistes before she launched her solo career.\n\nShe worked alongside icons like Brenda Fassie and took on the role of mentor to her daughter, Rethabile Khumalo, known for her hit Ntyilo Ntyilo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/FVYASTYSCTYDS.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com On Monday, South African Afropop superstar and dancer Winnie Khumalo, passed away at the age of 51, with local news attributing her death to “a short illness.” Her passing has left those in the creative and cultural industries reeling. Her last album, Woman, is a deeply personal reflection of her experiences, addressing themes […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        },
        {
            "title": "We salute SADC for intervening in Mozambique unrest",
            "url": "https://www.chronicle.co.zw/we-salute-sadc-for-intervening-in-mozambique-unrest/",
            "content": "THE directive by the Southern African Development Community (SADC) for its security committee to propose measures to safeguard regional trade routes, energy corridors, and humanitarian corridors disrupted by post-election unrest in Mozambique is a crucial step toward maintaining stability and fostering development in the region.\n\nAs we reported yesterday, unrest intensified on December 23, following the Constitutional Councils decision to uphold Frelimos overwhelming election victory.\n\nPresident-elect Cde Daniel Chapo secured 65,17 percent of the vote, while opposition leader Mr Venancio Mondlane, who has been linked to much of the unrest, garnered 24,19 percent.\n\nDaniel Chapo\n\nIn response to the escalating violence, SADC leaders convened a virtual Extraordinary Summit of Heads of State and Government of the Organ Troika on Sunday to address the political and security situation in Mozambique.\n\nThe Summit was chaired by Tanzanian President and chairperson of the SADC Organ on Politics, Defence, and Security Co-operation, Dr Samia Suluhu Hassan.\n\nOther attendees included Zambian President Hakainde Hichilema, the outgoing chairperson of the SADC Organ, Malawis Minister of Foreign Affairs Nancy Gladys Tembo, representing incoming chairperson President Lazarus Chakwera, and SADC Executive Secretary Mr Elias Magosi among others.\n\nAccording to the communiqu, the meeting expressed deep concern over the political and security situation in Mozambique and its socio-economic consequences. It highlighted the negative impact on regional supply chains, particularly for essential commodities.\n\nThe summit directed the inter-state defence and security committee to propose measures to protect the regional trade routes, humanitarian corridors, and energy supplies while finding solutions to the political and security challenges in the Republic of Mozambique, reads part of the communiqu.\n\nThe unrest in Mozambique has significantly impacted trade routes, which are vital for the economic integration and growth of SADC member states. Ensuring the security of these routes will facilitate the smooth flow of goods and services, thereby boosting regional trade and economic resilience.\n\nEnergy corridors are essential for the reliable supply of energy across the region. Disruptions can lead to energy shortages, affecting industries and households alike. By securing these corridors, SADC can ensure a stable energy supply, which is fundamental for economic activities and development.\n\nThe unrest has also hindered the delivery of humanitarian aid to affected populations. Safeguarding these corridors is critical to providing timely assistance and alleviating human suffering. This measure will also support the broader goal of regional stability and peace.\n\nThe ongoing unrest poses a significant threat to regional security and development. It can lead to increased displacement, economic instability, and a rise in criminal activities. By addressing these security challenges, SADC can create a conducive environment for sustainable development and regional cooperation.\n\nWe salute SADC for the proactive approach to mitigating the adverse effects of the unrest in Mozambique. By safeguarding trade routes, energy corridors, and humanitarian corridors, SADC can enhance regional security, promote economic growth, and ensure the well-being of its member states.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/SADC-States.jpg",
            "description": "THE directive by the Southern African Development Community (SADC) for its security committee to propose measures to safeguard regional trade routes, energy corridors, and humanitarian corridors disrupted by post-election unrest in Mozambique is a crucial step toward maintaining stability and fostering development in the region. As we reported yesterday, unrest intensified on December 23, following […]",
            "time": "09:30",
            "date": "09 Jan 2025"
        }
    ]
}