{
    "news": [
        {
            "title": "Glen View South, the numbers . . . ZANU PF poised to capitalise on momentum in Glen View",
            "url": "https://www.chronicle.co.zw/glen-view-south-the-numbers-zanu-pf-poised-to-capitalise-on-momentum-in-glen-view/",
            "content": "Gibson Nyikadzino,Zimpapers Politics Hub\n\nON Saturday, voters in the Glen View South constituency are going to the ballot to elect their National Assembly representative in a second by-election in nearly six years since the constituencys creation in 2008.\n\nThe first by-election, held on September 7, 2019, was necessitated by the death, on 10 June 2019, of Vimbai Tsvangirai-Java of the MDC Alliance. This time, the seat was left vacant following the death of legislator Mr Grandmore Hakata, who was from the opposition CCC.\n\nVoting patterns and the behaviour of the electorate in this constituency since 2008 have been unfavourable to ZANU PF candidates.\n\nHowever, by observing voting trends on the previous by-election and an electoral overview since 2008, ZANU PF stands a big chance of winning.\n\nFrom 2008, the opposition has metamorphosised; hence in the 2008, 2013, 2018 and 2023 elections, ZANU PF faced the opposition as MDC-T; MDC-Alliance and CCC.\n\nEach time the opposition has rebranded, its support base has been declining, giving room to ZANU PF.\n\nSince 2008, a closer analysis of the election results for this constituency shows that votes for the MDC declined between 2008 and 2013 before increasing in 2018.\n\nAlthough ZANU-PFs votes increased between 2008 and 2018, the opposition (as MDC-T or MDC-Alliance) continued to post victories with wide margins.\n\nThese big margins can be attributed to protest votes from urbanites who may have been swayed by the empty rhetoric of Mr Morgan Tsvangirai and the now retired Nelson Chamisa in the pre-and post-2018 era.\n\nIt appears rationality has somehow returned to the constituency to enable the electorate to vote based on issues.\n\nOf importance is to note that ZANU PFs electoral performance in Glen View South has been informed by its ability to organise and keep a presence in a constituency that traditionally has been an opposition stronghold.\n\nSince 2008, the constituency has been an opposition stronghold with Paul Madzore winning it twice in a row with wide margins of 9,158 votes in 2008 and 8,301 votes in 2013 against ZANU PF candidates 2,583 votes in 2013, for example.\n\nIn the 2018 harmonised elections, MDC-Alliance candidate Tsvangirai-Java won the constituency with 9,942 votes against ZANU PFs Dumisani Chipango who garnered 3,248 votes.\n\nHowever, following Tsvangirai-Javas death, her brother Vincent Tsvangirai won the poll with 3,474 votes against Offard Muchuwe of ZANU PF who polled 1,534 votes.Vincent Tsvangirais winning tally in the by-elections was 35 percent down from his sisters tally the previous year.\n\nThese results show that both ZANU PF and the MDC-Alliance were complacent in voter mobilisation. This might have been necessitated by the oppositions traditional enjoyment of victory in urban constituencies or ZANU PFs difficulties in penetrating these constituencies.\n\nThe turning point in Zimbabwes history of by-elections was experienced during the March 26, 2022, polls. Both ZANU PF and the opposition Citizens Coalition for Change (CCC) contested in 28 constituencies that were necessitated by the recall of opposition parliamentarians.\n\nOf the contested 28 seats, 21 seats belonged to the opposition while seven to ZANU PF. However, following the by-elections, ZANU PF successfully retained the seven seats it had won in 2018 and won an extra two seats in the Epworth and Mutasa South constituencies.\n\nIn that by-election, ZANU PF won 48,3 percent of the votes, while the CCC won 48,9 percent, with the MDC-Alliance taking home 2,6 percent. This was despite the fact that only eight of the constituencies were rural and 20 were urban seats where opposition parties tend to do better.\n\nIndications since the March 26 by-elections are that a non-complacent ZANU PF can fish in the oppositions pond. Of the total votes cast then, ZANU PF received 128,399 votes while the CCC had a total 129 799 votes. Between the two parties, there only existed a difference of 1,400 votes.\n\nPolitical changes are happening. ZANU PF now holds seven seats in the Harare Metropolitan Province, the largest since opposition inroads in 2000.\n\nThe Glen View South by-election now comes at a time when ZANU PFs popularity is surging nationally because of the absence of an organised opposition, the peoples sympathy towards the revolutionary party and the disappointments opposition followers have experienced with splits and backstabbing in their camp.\n\nDuring the 2023 harmonised polls, CCCs Hakata garnered 15,203 votes against ZANU PFs Muchuwe who garnered 3,112 votes.\n\nWith tomorrows race being contested by ZANU PFs Tsitsi Tawomera; National Constitutional Assembly (NCA)s Perpetua Mukanda, and independent candidates George Makwangwaidze, Tonderai Chakeredza and Tungamirai Madzokere, the hope is the ruling Zanu PF party will continue on its upward trajectory.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/TT1.jpg",
            "description": "Gibson Nyikadzino, Zimpapers Politics Hub ON Saturday, voters in the Glen View South constituency are going to the ballot to elect their National Assembly representative in a second by-election in nearly six years since the constituency’s creation in 2008. The first by-election, held on September 7, 2019, was necessitated by the death, on 10 June 2019, […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "Teen witnesses father’s fatal assault in Hope Fountain, suspect arrested",
            "url": "https://www.chronicle.co.zw/teen-witnesses-fathers-fatal-assault-in-hope-fountain-suspect-arrested/",
            "content": "*Sikhumbuzo Moyo, Zimpapers Investigations Desk*\n\nA 15-year-old girl remains traumatised after witnessing the brutal assault of her father, which eventually led to his death at Mpilo Hospital nine days later.\n\nThe deceased, Zama Dube (63), was viciously attacked by murder accused Nanzelela Ncube (28), also known as Sgananda, in front of his terrified daughter on 2 February in Hope Fountain. Ncube allegedly accused Dube of having an affair with his late brothers wife. Dube was a widower.\n\nAfter the assault, Ncube fled the scene, leaving Dube for dead. The severely injured man was rushed to Mpilo Hospital where he was admitted to the Intensive Care Unit, while police opened an attempted murder docket.\n\nOn 11 February, Dube succumbed to his injuries and police subsequently opened a murder docket.\n\nThe teenagers uncle revealed his niece remains haunted by the events, occasionally screaming at night. He said the girl, a pupil at Amhlophe High School, has not received any professional counselling.\n\nNcube had been on the run until Wednesday when police, acting on a tip-off, laid an ambush at his grandmothers homestead.\n\nActing Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele confirmed the arrest, stating the suspect is being held at Hillside Police Station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/kid.jpg",
            "description": "*Sikhumbuzo Moyo, Zimpapers Investigations Desk* A 15-year-old girl remains traumatised after witnessing the brutal assault of her father, which eventually led to his death at Mpilo Hospital nine days later. The deceased, Zama Dube (63), was viciously attacked by murder accused Nanzelela Ncube (28), also known as “Sgananda”, in front of his terrified daughter on […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "ICT Ministry launches Zimbabwe Digital Skills Programme",
            "url": "https://www.chronicle.co.zw/ict-ministry-launches-zimbabwe-digital-skills-programme/",
            "content": "Mthabisi Tshuma in Harare\n\nTHE Ministry of Information Communication Technology, Postal and Courier Services on Thursday, 10 April 2025, launched the Zimbabwe Digital Skills Development Programme in conjunction with the United Arab Emirates (UAE) Government.\n\nThe initiative was born out of a fruitful partnership with the UAE Government under the Government Experience Exchange Programme.\n\nOfficially launching the project at Potraz Headquarters, ICT Minister Tatenda Mavetera said they are guided by the goals and aspirations of the National Development Strategy (NDS1) and the visionary framework of Vision 2030, as articulated by the President, His Excellency Dr Emmerson Mnangagwa.\n\nThis programme is not just an educational initiative; it is a crucial step towards realising our collective dream of a prosperous, inclusive and technologically advanced nation.\n\nThe Zimbabwe Digital Skills Programme aims to train 1.5 million coders in essential skills such as Data Science Fundamentals, Programming Fundamentals, Android Kotlin Developer Fundamentals, and AI Fundamentals. This ambitious target reflects our commitment to empowering our youth with the tools they need to thrive in an increasingly digital world, said Minister Mavetera.\n\nFollow on X:@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/it.jpg",
            "description": "  Mthabisi Tshuma in Harare THE Ministry of Information Communication Technology, Postal and Courier Services on Thursday, 10 April 2025, launched the Zimbabwe Digital Skills Development Programme in conjunction with the United Arab Emirates (UAE) Government. The initiative was born out of a fruitful partnership with the UAE Government under the Government Experience Exchange Programme. […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "“Half-baked models”: Wilbert Rukato decries quality of models representing Zimbabwe abroad",
            "url": "https://www.chronicle.co.zw/half-baked-models-wilbert-rukato-decries-quality-of-models-representing-zimbabwe-abroad/",
            "content": "Trust Khosa.Zimpapers Arts and Entertainment Hub\n\nAs Zimbabwe slowly resurfaces on the international pageantry scene, Harare-based pageant and grooming expert Wilbert Rukato has raised concerns over the deteriorating quality of models representing the country abroad.\n\nThe founder of Size Four Modelling Agency who trained the likes of Greatmore Chatya and reigning Miss Universe Zimbabwe Sakhile Dube, believes that many of todays modelling instructors are failing to provide adequate training, resulting in underprepared models entering global competitions.\n\nIn an interview with Zimpapers Arts and Entertainment Hub, Rukato did not mince his words.The standards have declined when it comes to grooming and scouting for models. Over the past decade leading up to last year, Zimbabwe has not made a significant impact internationally because we are producing half-baked models.\n\nHe went on to highlight a range of basic skills lacking in aspiring beauty queens.Its sad that the models we have now dont know how to sit, stand, or even answer questions. Most of them are making it to the international stage because of powerful connections and wealthy sponsors, rather than merit.\n\nRukato lamented Zimbabwes lack of consistent visibility and success at prestigious global events such as Miss World and Miss Universe.The quality of models we are getting from the current crop of instructors is quite shocking. As a seasoned modelling trainer, I often find myself wondering where some of these models are being groomed.\n\nCalling for change, Rukato stressed the need for the formalisation and regulation of the modelling sector in Zimbabwe to ensure higher standards and more credible representation on international platforms.\n\nAmong those Rukato has trained are Phoebe Monjane (Miss Zimbabwe 2022), Sakhile Dube (Miss Universe 2024), Greatmore Chatya (Nokia Face of Africa 2005 finalist) Jeferson Mselera a TV presenter and brand ambassador for major brands, Michelle Wallace (Zimbabwe Supermodel 2024), and Francina Katuruza (Miss Zambia Zimbabwe 2023).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-10-at-15.35.15.jpeg",
            "description": "Trust Khosa.Zimpapers Arts and Entertainment Hub As Zimbabwe slowly resurfaces on the international pageantry scene, Harare-based pageant and grooming expert Wilbert Rukato has raised concerns over the deteriorating quality of models representing the country abroad. The founder of Size Four Modelling Agency who trained the likes of Greatmore Chatya and reigning Miss Universe Zimbabwe Sakhile […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "Who Is Prophet Ian Ndlovu – The man gifted cars and money by Wicknell Chivayo?",
            "url": "https://www.chronicle.co.zw/who-is-prophet-ian-ndlovu-the-man-gifted-cars-and-money-by-wicknell-chivayo/",
            "content": "Ashley Phiri,[emailprotected]\n\nFORGET your stereotypical pastor. Dr Ian Ndlovu is a man of many hats, effortlessly weaving together faith and academic pursuits. But thats not all  he tackles the complexities of marriage side-by-side with his formidable wife, Dr Angel Ndlovu.\n\nDr Ndlovus sermons and prophecies transcend the confines of the church, often venturing into the political arena. This has propelled him to international acclaim but also brought criticism. Dr Ndlovu holds firm that God cares deeply for the people and their leaders and that prophets are divinely chosen to address the leadership of their times.\n\nFrom the book of Genesis to the book of Revelations whenever a prophet was anointed by God to rise, he would speak to the leadership of that particular generation because God is concerned about His people, so he sends his prophets to offer guidance to leadership.\n\nWhen they asked Christ what the sign of his coming would be he said nation will rise against nation and kingdom against kingdom, what is that? Thats politics. From the book of Genesis to the book of Revelations whenever a prophet was anointed by God to rise, he would speak to the leadership of that particular generation, he said.\n\nDr Ian Ndlovu and his wife Dr Angel Ndlovu with Kenyan First Lady Rachel Ruto\n\nDr Ndlovu seems to have a special fondness for Kenya. He has prophesied many things about the Kenyan Government that have come to pass, and the Kenyan people have embraced him as a guiding voice.\n\nI started prophesying a lot of things about the Kenyan Government that came to pass and when the people there realised that God was using me to give direction in their country they contacted me. But I have spoken a lot of things about a lot of other countries including our own. We have three branches in Kenya but the reception we get across the entire nation is relatively good, he said.\n\nThis focus on national guidance is evident in the invitation that was extended to the Ndlovus to attend the inauguration of Kenyan President William Ruto in 2022, a cherished moment for Dr Angel Ndlovu.\n\nIt was my first time at the State House and introducing myself to the President was one of the cherished moments of my life. The most inspirational thing was his ability to strongly state his belief in God regardless of his elevated office. President Ruto is a very humble man, she said.\n\nDr Ndlovus academic journey is impressive. Born in Ntabazinduna in 1976, he attended Sihlengeni Secondary School and Mpopoma High School before earning his undergraduate degree in Economics with Education from Gweru Teachers College (now MSU). He then embarked on a teaching career, but his pursuit of learning never faltered.\n\nIn 2008, Dr Ndlovu started a prayer group in Nkulumane 5 with just four members. Today, his church, Divine Kingdom Baptist Church, boasts thousands of international members.\n\nWhile serving as a Teaching Assistant (TA) at the National University of Science and Technology (Nust) from 2008 to 2010, Dr Ndlovu continued his academic journey, obtaining his Masters degree. This dedication to education propelled him to a lectureship at Nust, a position he held from 2010 to 2022. He even expanded his teaching reach by becoming a part-time lecturer at the Zimbabwe Open University (ZOU).\n\nIn 2019, Dr Ndlovus hunger for knowledge remained insatiable, leading him to pursue a PhD from Unisa. Now, he serves as an external assessor at Unisa and a supervisor at Nust, truly embodying the spirit of lifelong learning.\n\nDr Ndlovus passion extends beyond academia. He met his wife, Dr Angel Ndlovu, who attributes her own academic success to her husbands encouragement and support.When I met my husband, I did have a degree, but he encouraged me to pursue my masters and then my PhD. If you look at the grades I obtained while doing my Masters and PhD they are so much better than the ones I got for my undergrad, she said.\n\nTogether, the Ndlovus have built a beautiful life, balancing their commitment to service with their dedication to family. They have two philanthropic organisations dedicated to helping the vulnerable, with Dr Angel Ndlovus expertise in development studies guiding their work.\n\nDr Angel Ndlovu with some young learners\n\nThe Ndlovus exemplify the perfect blend of academic excellence, faith and dedication to family and community. Their secret to maintaining a healthy family balance is to spend as much quality time as possible away from their busy schedules.\n\nTheirs is a story of faith, intellect and unwavering commitment. Dr Ian Ndlovu, the prophet with a global perspective, and Dr Angel Ndlovu, the doctor with a heart for her community, together inspire and empower, proving that love and purpose can go hand-in-hand.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-10-at-13.39.20.jpeg",
            "description": "Ashley Phiri, ashleyphiri66@gmail.com FORGET your stereotypical pastor. Dr Ian Ndlovu is a man of many hats, effortlessly weaving together faith and academic pursuits. But that’s not all — he tackles the complexities of marriage side-by-side with his formidable wife, Dr Angel Ndlovu. Dr Ndlovu’s sermons and prophecies transcend the confines of the church, often venturing […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "Government allocates 70 residential stands to Legislators",
            "url": "https://www.chronicle.co.zw/government-allocates-70-residential-stands-to-legislators/",
            "content": "Online Reporter\n\nTHE Ministry of Local Government and Public Works has announced the allocation of an additional 70 residential stands to serving and former Members of Parliament as part of their non-monetary benefits.\n\nIn a notice shared on their social media handles on Thursday, the Ministry confirmed that the latest allocations include 15 stands in Killarney (Goromonzi), 15 in Penrose (Zvimba), and 40 in Mabelreign (Harare).\n\nThis follows previous allocations of 263 stands since 2013 under a housing scheme for legislators from the 8th, 9th, and current 10th Parliament.\n\nThe facility is a once-off entitlement under their conditions of service, the Ministry said, emphasizing that the programme aligns with the Governments broader commitment to housing provision for war veterans, women, youth and civil servants.To date, MPs have received stands in Goromonzi (188), Bulawayo (49), Chiredzi (12), Kadoma (9), and Beitbridge (5).\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Cde-Daniel-Garwe-copy.jpg",
            "description": "Online Reporter THE Ministry of Local Government and Public Works has announced the allocation of an additional 70 residential stands to serving and former Members of Parliament as part of their non-monetary benefits. In a notice shared on their social media handles on Thursday, the Ministry confirmed that the latest allocations include 15 stands in […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "US$430 000 gift: Businessman recognises Prophet Ndlovu’s contribution to national unity",
            "url": "https://www.chronicle.co.zw/us430-000-gift-businessman-recognises-prophet-ndlovus-contribution-to-national-unity-2/",
            "content": "Online Reporter\n\nBusinessman Wicknell Chivayo has gifted Prophet Ian Ndlovu of Prophet Ian Ndlovu two brand-new vehicles and a substantial cash donation in recognition of his spiritual leadership.\n\nThe gifts include a 2025 Toyota Land Cruiser 300 Series VXR for the clergyman and a 2025 Toyota Fortuner 2.8D GD6 for his wife, Mrs Ndlovu, to support her charity work across Matabeleland province.\n\nIn a social media post announcing the donation on Thursday, Chivayo expressed deep admiration for the prophets work.In my entire lifetime, I have met a few true prophets of God who remain full of humility despite having an exceptional gift of prophecy, evangelism, and giving spiritual counsel to the nation. Today, I want to extend my deepest gratitude to a man of God whose ministry has touched countless lives, Prophet Ian Ndlovu.\n\nHe praised Prophet Ndlovu for his unifying role in Zimbabwes spiritual landscape.Through the Divine Kingdom Baptist Ministries, you have stood as a beacon of truth, unity and peace in the body of Christ. Your consistent calls for national prayer for our countrys leadership, regardless of political affiliation, is a mark of political maturity and spiritual integrity.What I admire most is that you never use the pulpit to sow division, but rather you have used it to foster dialogue and reconciliation.\n\nThe businessman, known for his philanthropic gestures, said that both vehicles worth US$280 000 are ready for collection at Faramatsi Motors in Harare. Additionally, he pledged US$100 000 towards the completion of the prophets church building and US$50 000 to support Mrs Ndlovus charitable initiatives.\n\nChivayo wished God to continue to increase Prophet Ndlovus influence and preserve his ministry, adding that Zimbabwe is spiritually richer because of men of faith like him.\n\nIan Ndlovu, a multifaceted leader, blending faith, academia, and philanthropy alongside his wife, addresses political and spiritual leadership, believing prophets must guide nations. This conviction has earned him international recognition, particularly in Kenya, where his prophecies about the government have come to pass.\n\nBorn in Ntabazinduna in 1976, Dr Ndlovu pursued education relentlessly, earning degrees in Economics with Education, a Masters, and later a PhD. He lectured at Nust and Zou while founding Divine Kingdom Baptist Church, which grew from a small prayer group to a global congregation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-10-at-13.39.20.jpeg",
            "description": "Online Reporter Businessman Wicknell Chivayo has gifted Prophet Ian Ndlovu of Prophet Ian Ndlovu two brand-new vehicles and a substantial cash donation in recognition of his spiritual leadership. The gifts include a 2025 Toyota Land Cruiser 300 Series VXR for the clergyman and a 2025 Toyota Fortuner 2.8D GD6 for his wife, Mrs Ndlovu, to […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "Bulawayo Basketball Association concludes referees course",
            "url": "https://www.chronicle.co.zw/bulawayo-basketball-association-concludes-referees-course/",
            "content": "Innocent Kurira,[emailprotected]\n\nTHE Bulawayo Basketball Association (BBA) will on Thursday conclude an ongoing international referees course at Khanyisile Sports Centre, led by Tanzanian instructor Zulfikar Karim.\n\nThe four-day programme, which began on Monday, has drawn referees from across the country, underlining its national significance.\n\nSpeaking on the sidelines of the course, Karim said the course is of importance in elevating local officiating standards.\n\nThis course is pivotal in ensuring the country produces internationally certified officials, he said.The initiative aligns with broader efforts to professionalise basketball officiating in Zimbabwe and provide local referees with opportunities to operate on the global stage.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/krim.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw THE Bulawayo Basketball Association (BBA) will on Thursday conclude an ongoing international referees course at Khanyisile Sports Centre, led by Tanzanian instructor Zulfikar Karim. The four-day programme, which began on Monday, has drawn referees from across the country, underlining its national significance. Speaking on the sidelines of the course, Karim said the […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "Highlanders FC’s Mbeba doubtful for CAPS United game",
            "url": "https://www.chronicle.co.zw/highlanders-fcs-mbeba-doubtful-for-caps-united-game/",
            "content": "Brandon Moyo\n\nHIGHLANDERS head coach Kelvin Kaindu has said that defender Andrew Mbeba will likely miss their Castle Lager Premier Soccer League encounter against CAPS United at Barbourfields Stadium on Sunday.\n\nThe lanky defender was stretchered off the field in Bossos previous match against Triangle United in Gibbo and hasnt been training. Mbeba is the only injury concern at the Bulawayo giants ahead of the battle of the cities.\n\nWe have a full squad that is training apart from Andrew Mbeba who picked up an injury in the last game against Triangle. We are yet to get feedback from the doctors, he hasnt been training but he is feeling slightly better. There has been some tremendous improvement.\n\nHe is going to see our medical doctor who will give us feedback and then we will assess him during training to see if he will be ready for our game, said Kaindu.\n\nThe Bosso gaffer, however, remains confident that they will be able to receive positive feedback from doctors as it is not a leg injury.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Untitled-4-7.jpg",
            "description": "Brandon Moyo HIGHLANDERS head coach Kelvin Kaindu has said that defender Andrew Mbeba will likely miss their Castle Lager Premier Soccer League encounter against CAPS United at Barbourfields Stadium on Sunday. The lanky defender was stretchered off the field in Bosso’s previous match against Triangle United in Gibbo and hasn’t been training. Mbeba is the […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        },
        {
            "title": "Ministers tour Emthunzini Township Housing Project in Matabeleland North",
            "url": "https://www.chronicle.co.zw/ministers-tour-emthunzini-township-housing-project-in-matabeleland-north/",
            "content": "Sikhumbuzo Moyo, Online Reporter\n\nTHE Minister of National Housing and Social Amenities, Zhemu Soda and the Minister of Public Service, Labour and Social Welfare, Edgar Moyo, today conducted an inspection tour of housing units under construction in Emthunzini Township as part of the Accelerated Presidential Housing Scheme.\n\nThe project, which aims to deliver 220,000 housing units nationwide by 2030, is a joint initiative between the two ministries, the National Social Security Authority (NSSA), and the National Building Society (NBS).\n\nPrivate contractors Hawkflight Construction and Marhaber Construction have been engaged to fast-track development, with a target of completing 4,000 units in the area at a rate of 118 houses every 60 days.\n\nDuring the tour, the ministers assessed progress and engaged with stakeholders to ensure the timely delivery of quality, affordable housing.\n\nThe Emthunzini development is part of the governments broader vision to provide modern, sustainable living spaces for Zimbabweans while stimulating economic growth through construction sector employment.\n\nThe Accelerated Presidential Housing Scheme remains a key pillar in our national development agenda, said Minister Soda. We are committed to working with all partners to ensure these homes meet the needs of our people.\n\nMinister Moyo added that the project aligns with the governments social welfare objectives, emphasizing that decent housing is fundamental to improving livelihoods.\n\nThe tour underscores the administrations push to address Zimbabwes housing backlog while promoting urban and peri-urban development. Further updates on the projects rollout are expected in the coming weeks.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/kikikikik.jpg",
            "description": "Sikhumbuzo Moyo, Online Reporter THE Minister of National Housing and Social Amenities, Zhemu Soda and the Minister of Public Service, Labour and Social Welfare, Edgar Moyo, today conducted an inspection tour of housing units under construction in Emthunzini Township as part of the Accelerated Presidential Housing Scheme. The project, which aims to deliver 220,000 housing […]",
            "time": "20:26",
            "date": "10 Apr 2025"
        }
    ]
}