{
    "news": [
        {
            "title": "Gamecocks duck extends",
            "url": "https://www.chronicle.co.zw/gamecocks-dark-extends22/",
            "content": "Fungai Muderere at Luveve Stadium\n\nChicken Inn.0Herentals.0THE Chicken Inn 2025 Castle Lager Premier Soccer League (PSL) season dark countinued after they were held to a nil all draw by visitors Herentals on Saturday.\n\nIt was Gamecocks fourth draw in five outings.The Joey Antipas mentored side is yet to post a win.\n\nHaving found the target once, the Simbisa Brands sponsored outfit have played four draws and lost once.In their game against Herentals, Gamecocks failed to convert numerous chances that came their way with the Students, on the other hand, asking numerous questions from the hosts defence .\n\nBrian Muza, George Majika and Michael Charamba took turns not to convert for Gamecocks while Herentals had Tinotenda Benza was the chief culprit for Herentals.The introduction of Brighton Makopa for ineffective Tinashe Mushaireni in 46th minute and a double substitution that saw Brandon Rendo and Edward Musena come in for Muza and Charamba respectively could not yeild anything for Chicken Inn.\n\nIn the 68th minute,Benza, who was Herentals captain of the day watched in disbelief when his close range effort was saved by an alert Donovan Bernard before Mpumelelo Bhebhe came to clear the ball for a corner.In the 75th minute, Gamecocks skipper Xolani Ndlovu had his well taken free kick punched for a corner by Herentals goalminder Tinotendaishe Takarinda.A minute later, Ralph Kawondera came to the rescue of the Students after he cleared Muza header from the line with the visitors in sixes and sevens at the back.\n\nIn their next match, Chicken Inn will face Dynamos in Harare while Herentals entertain newboys MWOS at Wadzanayi Stadium.Teams\n\nChicken InnD Bernard , A Chinda, M Bhebhe, J Tulani, X Ndlovu, D Jaricha, I Mabhunu, M Charamba, (Musena 85 mins) G Majika, T Mushaireni, B Muza (Rendo 85 mins),HerentalsT Tinotendaishe, W Chimbetu T Mupumha, L Dreamer (Zhuwawu 69th min), R Kawondera, T Benza, B Majaririra, K Sangare, T Chisi, I Benza, Z Ruguchu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-05-at-17.20.33-680x380.jpeg",
            "description": "Fungai Muderere at Luveve Stadium Chicken Inn….0 Herentals…….0 THE Chicken Inn 2025 Castle Lager Premier Soccer League (PSL) season dark countinued after they were held to a nil all draw by visitors Herentals on Saturday. It was Gamecocks’ fourth draw in five outings. The Joey Antipas mentored side is yet to post a win. Having […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Bulawayo Shutdown Show to go ahead…As Queens Sports Club rebuffs ZC’s objections",
            "url": "https://www.chronicle.co.zw/bulawayo-shutdown-show-to-go-ahead-as-queens-sports-club-rebuffs-zcs-objections/",
            "content": "Vusumuzi Dube, Deputy Radar Editor\n\nTHE proprietors of Queens Sports Grounds- the Queens Sports Club- have revealed that the hosting of the Bulawayo Shutdown Show is above board and is as per the lease agreement with Zimbabwe Cricket.\n\nThis comes after a statement from ZC distancing itself from the upcoming 9th Annual Pacific Bulawayo Shutdown Show, set for Saturday, 26 April 2025.\n\nIn a press statement released on Saturday, the Queens Sports Club board of management said under the current lease agreement with ZC, the club retains the right to host social events and activities at the venue in addition to accommodating cricket matches.\n\nThey further revealed that the lease agreement with ZC is set to expire in December.\n\nWe note with concern that this public communication was released without prior formal engagement at the Board Level, as has been the case before about the issue between ZC- as our tenant- and the Club, as the landlord. This has unfortunately created unnecessary public confusion and tension.\n\nWe wish to reassure all stakeholders that longstanding issues relating to this event have been adequately addressed over the years. Robust safeguards have been put in place to ensure smooth and responsible hosting. Ironically, ZC itself has previously hosted similar entertainment events- without the Clubs prior consent and, in certain cases, without remitting payment, said the board.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Byoshutdown.jpg",
            "description": "Vusumuzi Dube, Deputy Radar Editor  THE proprietors of Queens Sports Grounds- the Queens Sports Club- have revealed that the hosting of the Bulawayo Shutdown Show is above board and is as per the lease agreement with Zimbabwe Cricket. This comes after a statement from ZC distancing itself from the upcoming 9th Annual Pacific Bulawayo Shutdown […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Chicken Inn, Herentals tied nil all at halftime",
            "url": "https://www.chronicle.co.zw/chicken-inn-herentals-tied-nil-all-at-halftime/",
            "content": "Fungai Muderere at Luveve Stadium\n\nCHICKEN Inn and Herentals are tied nil all at halftime in a Castle Lager Premier Soccer League match that is being played at Luveve Stadium in Bulawayo.Gamecocks have been dominating the exchanges in the first stanza.\n\nIn the 24th minute, Chicken Inns Brian Muzas close range effort missed the target by a whisker.Muza had got on the end of a George Majika feed.\n\nTwo minutes later, the Students watched in disbelief when Tinotenda Benzas long range effort went over the bar.In the 35th minute, Chicken Inn had a penalty appeal turned down after Muza appeared to have brought down by Herentals defender Tinanshe Mupumha.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-05-at-15.55.15-680x380.jpeg",
            "description": "Fungai Muderere at Luveve Stadium CHICKEN Inn and Herentals are tied nil all at halftime in a Castle Lager Premier Soccer League match that is being played at Luveve Stadium in Bulawayo. Gamecocks have been dominating the exchanges in the first stanza. In the 24th minute, Chicken Inn’s Brian Muza’s close range effort missed the […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Gamecocks date Herentals College",
            "url": "https://www.chronicle.co.zw/gamecocks-date-herentals-college/",
            "content": "Fungai MuderereCHICKEN Inn and Herentals College are this afternoon set square it off at Luveve Stadium in of the Castle Lager Premier Soccer League (PSL) Week Five matches.The Gamecocks have endured a torrid start to the 2025 Premier Soccer League (PSL) season, failing to secure a single victory in their opening four matches.Coming off a narrow 1-0 defeat to ZPC Kariba, Chicken Inn themselves on number 16 on the log with just three points. Their upcoming clash against the unpredictable Students marks their 11th meeting since 2019, with Herentals often proving to be a difficult opponent.\n\nPSL results between Chicken Inn and Herentals since 2019:23/11/24: Herentals 0  0 Chicken Inn30/06/24: Chicken Inn 0-0 Herentals04/10/23: Herentals 1-1 Chicken Inn06/05/23: Chicken Inn 2-1 Herentals21/10/22: Herentals 0-0 Chicken Inn07/05/22: Chicken Inn 0-0 Herentals11/12/19: Herentals 0-2 Chicken Inn\n\nWill Chicken Inn finally shake off their early-season struggles and register their first win, or will Herentals continue to haunt them?It all needs a tactical discipline from both ends.Team Line UpsChicken InnD Bernard , A Chinda, M Bhebhe, J Tulani, X Ndlovu, D Jaricha, I Mabhunu, M Charamba, G Majika, T Mushaireni, B MuzaHerentalsT Tinotendaishe, W Chimbetu T Mupumha, L Dreamer, R Kawondera, T Benza, B Majaririra, K Sangare, T Chisi, I Benza, Z Ruguchu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/poty.jpg",
            "description": "Fungai Muderere CHICKEN Inn and Herentals College are this afternoon set square it off at Luveve Stadium in of the Castle Lager Premier Soccer League (PSL) Week Five matches. The Gamecocks have endured a torrid start to the 2025 Premier Soccer League (PSL) season, failing to secure a single victory in their opening four matches. […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Catch them young: Entumbane ECD Centre celebrates World Theatre Day",
            "url": "https://www.chronicle.co.zw/catch-them-young-entumbane-ecd-centre-celebrates-world-theatre-day/",
            "content": "Faith Ndlovu-Youth Interactive Correspondent\n\nEntumbane Early Childhood Development (ECD) Centre in Bulawayo, recently joined the global community in celebrating World Theatre Day, commemorated on March 21.\n\nThe belated event, hosted by Shaba Arts and Assitej Zimbabwe  a national association promoting theatre for children and young people  aimed to instil a love for theatre and the performing arts in young learners under the theme Take a Child to the Theatre.\n\nWorld Theatre Day is a global event that highlights the importance of theatre in fostering cultural appreciation and bringing people together.\n\nThe day, celebrated annually on March 27th, is a global celebration initiated by the International Theatre Institute (ITI) to honor and promote the art of theatre, its importance, and its role in fostering cultural understanding and peace.\n\nThe event featured vibrant performances and cultural activities, all designed to encourage creativity and artistic expression. Renowned cultural expert Ellen Mlangeni, who is the director of Thandanani Womens Ensemble led engaging sessions, teaching children poetry, storytelling, and traditional dances.\n\nThe celebration was a resounding success, offering young learners a magical introduction to the world of theatre.\n\nTopasi Ndlovu, director of Shaba Arts, stressed the importance of nurturing young minds to preserve culture and heritage.\n\nWere happy to commemorate this day in schools, especially with youngsters, as it makes it easier for them to learn heritage studies, Ndlovu said.\n\nHe highlighted the significance of introducing theatre to young children, explaining that the approach was tailored to their level.\n\nWe decided to focus on basic activities rather than core theatre elements since theyre still young. This makes it easier for them to understand and relate, he noted.\n\nNdlovu also stressed the power of theatre in engaging young minds.\n\nTheatre has a unique way of captivating children.\n\nIts essential to tap into their creativity and imagination from an early age, he said.\n\nFollowing the success of the initiative, Ndlovu expressed a desire to expand it to more schools.\n\nThis was a success, and we hope to visit more schools, teaching both young and older children to help preserve our culture.\n\nChildren can pass it down to the next generation. Growing up, we had no television and relied on theatre, so it remains a vital tool for storytelling and cultural preservation.\n\nMiss Sibanda, the ECDs headmistress, thanked the city council for supporting the initiative.\n\nIt shows they havent neglected the younger generation.\n\nYou can see the joy on the childrens faces  thats what makes it all worthwhile. Through experiences like these, they are nurtured into theatre and grow with the values they learn, she said.\n\nAs the global community marked World Theatre Day, Entumbane ECDs children walked away inspired, their imaginations ignited by the power of storytelling and performance.\n\nThe initiative was also aligned with the new curriculum, specifically under Heritage Studies.\n\nSource: The Herald\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Thandanani-Women’s-Ensemble-680x380.jpg",
            "description": "Faith Ndlovu-Youth Interactive Correspondent Entumbane Early Childhood Development (ECD) Centre in Bulawayo, recently joined the global community in celebrating World Theatre Day, commemorated on March 21. The belated event, hosted by Shaba Arts and Assitej Zimbabwe — a national association promoting theatre for children and young people — aimed to instil a love for theatre […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Imiklomela kaDakamela 2nd day kicks off",
            "url": "https://www.chronicle.co.zw/imiklomela-kadakamela-2nd-day-kicks-off/",
            "content": "Zimpapers Reporter\n\nFestivities have kicked off on the second day of the Imiklomelo KaDakamela awards, with the arrival of Chief Dakamela alongside other traditional leaders and guests from outside the country.The second day will see high achievers from around the country and beyond honoured for their work and deeds with gongs.\n\nNotable royalties who are part of the event so far are Chiefs: Menyezwa, Bhidi, Fuyana, Matema, Ndebele Kingdoms Princess Agnes Nomngoma Mabhena, among others.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-05-at-11.26.26-680x380.jpeg",
            "description": "Zimpapers Reporter Festivities have kicked off on the second day of the Imiklomelo KaDakamela awards, with the arrival of Chief Dakamela alongside other traditional leaders and guests from outside the country. The second day will see high achievers from around the country and beyond honoured for their work and deeds with gongs.   Notable royalties […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Cop killers arrive in court",
            "url": "https://www.chronicle.co.zw/cop-killers-arrive-in-court22/",
            "content": "Peter Matika,[emailprotected]Three suspects arrested earlier this week in connection with the fatal shooting of a police officer in Tshabalala suburb, Bulawayo have arrived at the Western Commonage courts for remand.\n\nThe suspects are also linked to a series of armed robberies and were apprehended following police investigations.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/pololo.jpg",
            "description": "Peter Matika,Peter.matika@chronicle.co.zw Three suspects arrested earlier this week in connection with the fatal shooting of a police officer in Tshabalala suburb, Bulawayo have arrived at the Western Commonage courts for remand.     The suspects are also linked to a series of armed robberies and were apprehended following police investigations. More to follow…    ",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Highlanders FC CEO resigns, amid corruption probe",
            "url": "https://www.chronicle.co.zw/highlanders-fc-ceo-resigns-amid-corruption-probe/",
            "content": "Innocent[emailprotected]\n\nHighlanders Chief Executive Officer, Brian Moyo, has resigned after being implicated in a corruption and misappropriation scandal regarding the signing of two Bulawayo Chiefs players.The club confirmed his resignation in a statement on Saturday.\n\nHighlanders has received and accepted the resignation letter from CEO Brian Moyo. His resignation comes at a time when the club had already initiated investigations and a disciplinary process following allegations of corruption and misappropriation of funds. The club assures its stakeholders that due process will be followed to resolve this matter, the statement read.\n\nMoyo, who had only been in office for four months, reportedly faced severe criticism after it emerged that he fraudulently pocketed US$5,000 in the deal. Sources reveal that Moyo submitted a fake US$23,000 invoice to Highlanders, while the club was supposed to pay Bulawayo Chiefs US$18,000 for the two players.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/y7uyu7i.jpg",
            "description": "Innocent Kurirainnocent.kurira@chronicle.co.zw Highlanders Chief Executive Officer, Brian Moyo, has resigned after being implicated in a corruption and misappropriation scandal regarding the signing of two Bulawayo Chiefs players. The club confirmed his resignation in a statement on Saturday. “Highlanders has received and accepted the resignation letter from CEO Brian Moyo. His resignation comes at a time […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Africa must produce, feed itself  — President",
            "url": "https://www.chronicle.co.zw/africa-must-produce-feed-itself-president/",
            "content": "Mashudu Netsianda in Victoria FallsPRESIDENT Mnangagwa has called for a paradigm shift in Africas education systems, urging stakeholders to adopt transformative strategies that will equip learners with practical skills to drive the continents industrialisation and economic growth.\n\nSpeaking at the 3rd Africa Education Summit in Victoria Falls yesterday, the President boldly stressed the need for education on the continent to move beyond policy discussions and reforms towards tangible action that translates learning into development.\n\nBuilding the Africa we want, demands a continuous paradigm shift from us stakeholders, policy makers, educators, innovators and learners alike, he told the delegates. Bold and decisive strategies have to be adopted so that we foster education systems that inculcate solution-driven minds and not produce merely certificate-holding graduates. Our discussions during this summit must, therefore, enable convergence towards scaling up transformative strategies that drive education and developmental progress across Africa. Together, we have yet another opportunity to innovate, think outside the box and promote impactful best practices to up-scale resilient systems, as we shape the future of our continent through education.\n\nPresident Mnangagwa said there was an urgent need for skills-based education, urging institutions to bridge the gap between academic learning and industry needs.\n\nOur schools and institutions of higher learning must become incubators of innovation, entrepreneurship and leadership, taking into account our indigenous knowledge systems, he said. Students and graduates should be capacitated to produce goods and services that meet the demands of our communities.\n\nWe must become a continent that can produce and feed itself.\n\nThe establishment of innovation hubs at the countrys state universities has already kick-started Zimbabwes industrial modernisation agenda through the pursuit of the Education 5.0 policy, which has so far seen the Government registering over 500 patents in various fields, thereby aiding national development.\n\nUniversities with innovation hubs and industrial parks so far are the National University of Science and Technology, Midlands State University, University of Zimbabwe, Harare Institute of Technology, Zimbabwe Defence University, and the Chinhoyi University of Technology.\n\nNational University of Science and Technology (Nust)\n\nDespite progress in literacy rates and access to higher education, President Mnangagwa said Africa still faces significant challenges in the education sector, including resource shortages and lack of trained educators.\n\nHe pointed out that about 30 million children in Sub-Saharan Africa, for instance, are out of school and called for increased collaboration among African states in teacher training to address this gap and ensure inclusive education.\n\nZimbabwe is ready to share experiences in this regard, said President Mnangagwa, stressing the importance of knowledge exchange among nations.\n\nTo reduce school absenteeism due to poverty, Zimbabwe has implemented a nationwide School Feeding Programme covering both rural and urban schools.\n\nIn our case as Zimbabwe, increased school infrastructure across the country, especially in new settlements has ensured that learners do not walk more than 5km to access educational facilities, said President Mnangagwa.\n\nGovernment has also embarked on a project to sink a borehole at every rural school and village, complemented by nutrition gardens to enhance food security, water access and sanitation in schools.\n\nLet us build on the solid foundation set out at previous engagements under this initiative to leap forward our education systems. To further translate our educational advancement for continental development, it is important to be holistic in our propositions, taking into account the unique African realities, said President Mnangagwa.\n\nThe quality of education varies widely, with many institutions lacking adequate resources and trained educators. These gaps and disparities hinder our ability to harness the full potential of our youth and translate educational advancements into tangible development outcomes, he added.\n\nPresident Mnangagwa further stressed the need for Africa to invest in clean energy and modern infrastructure to fully integrate ICTs, e-learning, and digital transformation in education\n\nLimited access to energy hinders prospects for most African learners, especially those in rural communities. Hence, investments in clean energy, along with modern school infrastructure, must now be deemed a dual necessity, he noted.\n\nCalling for further support for Science, Technology, Engineering and Mathematics (STEM) education, alongside vocational training and digital literacy, he said these will ensure students graduate with skills that empower them to create jobs and establish industries.\n\nOur students should exit education institutions with skills that empower them to create jobs, establish viable industries and solve societal challenges. Therefore, the need to enhance collaboration, scale up synergies and strengthen partnerships cannot be over emphasised, he said.\n\nUnder the Second Republic, President Mnangagwa said Government has increased support for the provision of modern teaching and learning materials.\n\nThese are having a positive impact on learning outcomes and resulting in dynamic teaching-learning processes that benefit both learners and educators. The digital divide remains a significant barrier to educational access across the continent, he said.\n\nLeveraging technology to bridge the educational divide will, in the main, enable even the most remote communities to access quality learning. Our governments have a duty to increase support for infrastructure to broaden digital access and literacy, particularly for students and teachers.\n\nPresident Mnangagwa noted that limited access to energy hinders prospects for most African learners, especially those in rural communities.\n\nHence, investments in clean energy, along with modern school infrastructure, must now be deemed a dual necessity. This is more urgent given the centrality of energy access for the deployment of ICTs, e-learning, innovation and overall digital transformation industrialisation of Africa, he said.\n\nUltimately, e-learning platforms, smart classrooms and Artificial Intelligence driven learning tools should no longer be luxuries but day to day teaching and learning necessities.\n\nUnder the Second Republic, the Government has increased support for modern teaching and learning materials, resulting in improved learning outcomes, said the President. Resource centres and libraries with digital capabilities are being promoted across the country, with the establishment of community information centres and deployment of mobile information buses.\n\nFurthermore, the countrys education reforms have seen curriculum revisions aimed at fostering critical thinking, creativity, and problem-solving abilities.\n\nWe are ensuring that education is accessible to all, regardless of socio-economic background, gender, or disability. Women and girls, in particular, must be empowered to excel in all fields and contribute meaningfully to our continents progress, said President Mnangagwa.\n\nThe 3rd Africa Education Summit is a premier event dedicated to fostering educational advancement across the continent. The event, which started on Thursday and ending today, brought together education ministers, policymakers and stakeholders from across Africa to deliberate on strategies for enhancing the continents education systems in line with Agenda 2063 and Vision 2030.\n\nVision 2030\n\nIt is running under the theme: Translating our Educational Advancement to Continental Development.\n\nThe summit is jointly hosted by Global Skills Hub United Kingdom, Africa Education Stakeholders, and the government of Zimbabwe. It seeks to create a transformative experience that will drive educational and developmental progress across Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/hj76rrj7676j.jpg",
            "description": "Mashudu Netsianda in Victoria Falls PRESIDENT Mnangagwa has called for a paradigm shift in Africa’s education systems, urging stakeholders to adopt transformative strategies that will equip learners with practical skills to drive the continent’s industrialisation and economic growth. Speaking at the 3rd Africa Education Summit in Victoria Falls yesterday, the President boldly stressed the need […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        },
        {
            "title": "Bulawayo descends into Wild West as gun violence escalates",
            "url": "https://www.chronicle.co.zw/bulawayo-descends-into-wild-west-as-gun-violence-escalates/",
            "content": "Bruce NdlovuTHE details surrounding the alleged murder of Sergeant Abel Masava are as brutal as they are utterly chilling. On the morning of March 28, Sergeant Masava, alongside his colleague, Constable Magaya, was attending to a domestic violence complaint in Sizinda when he noticed five suspicious men walking past.\n\nThe five were clad in black, blending seamlessly into the inky darkness of an autumn night in the densely populated suburb.\n\nAs a law enforcement officer, the mens attire and the fact that they carried sacks long after most had retired from their daily labours, prompted Sergeant Masava to inquire about their activities. It was a fatal inquiry.\n\nMoments later, Sergeant Masava lay prone on the ground, bleeding profusely from a gunshot wound to the head. He was later pronounced dead on arrival at United Bulawayo Hospitals.\n\nIn the Bulawayo of yesteryear, the incident would have plunged the city into a prolonged period of mourning, as people grappled with the untimely death of an officer of the law in such a violent manner.\n\nCollective tears shed over Sergeant Masavas death had even dried, another hair-raising incident involving firearms brought the city to a standstill only a few days later. Yeki Ncube, a member of the Nketa 8 Neighbourhood Watch Committee, found himself staring down the barrel of a gun when he and his colleagues encountered three men carrying bags and requested to search them. Before he could fully comprehend the situation, one of the three men produced a firearm and discharged it in his direction. As the suspects fled, swallowed by the inky blackness of the night, Ncube was left thanking his lucky stars for his continued existence.\n\nThese two incidents, occurring in suburbs so geographically proximate, highlighted the escalating problem of gun violence in the City of Kings. Nowadays, the people of Bulawayo scarcely have the time to process the shock, let alone mourn a death or injury resulting from a gun-related incident, before another one transpires. Gun violence, once thought to be the exclusive domain of Johannesburg, the city to which many from Bulawayo migrate in search of prosperity, now seems to be the staple of all crime-related conversations in Bulawayo.\n\nPolice officers, just like ordinary citizens, are increasingly finding themselves in the line of fire, as armed robbers in the city demonstrate a chilling willingness to use deadly force, even against law enforcement agents. Only a few weeks ago, Constable Cassandra Hove, a victim of alleged friendly fire, illustrated the perilous stakes that the countrys crime fighters face as they pursue some of the nations most dangerous criminals. Yet, barely a month after her demise, more police officers have found themselves in the crosshairs, as Bulawayo seemingly descends into a lawless Wild West.\n\nThe 2024 third-quarter crime statistics report, recently released by the Zimbabwe National Statistics Agency (Zimstat), revealed that Bulawayo has the highest crime rate in the country, nearly doubling the national average. The data paints a deeply concerning picture of rising crime in the province, with Bulawayo residents bearing a disproportionate share of the nations criminal burden. According to the report, Bulawayos crime rate is an alarming 2,506.1 per 100,000 people, significantly surpassing the national average of 1,370.6 per 100,000.\n\nThe late Sgt Abel Masava [Left] , The late Det Cst Cassandra Hove [Right]\n\nThe crime rate in Bulawayo Province nearly doubled the national crime rate, at 2,506.1 per 100,000 people against the national average of 1,370.6. Of the 205,925 cases recorded in the third quarter nationally, 84,001 were crimes against public safety and state security. The second most common type of crime recorded was acts against property only, with 48,566 cases. Acts leading to harm or intending to cause harm to the person were 40,078. The total number of persons charged by the police for all offences was 150,263, of which 89 percent were male, reads the report.\n\nA significant proportion of these incidents are gun-related robberies, which have left everyone, from business owners to private residents, living in fear of encountering gun-toting criminals. Fuel stations, in particular, have borne the brunt of the recent surge in crime, forcing business owners to alter their operating hours by closing early instead of remaining open 24 hours for security reasons. Their fears are not unfounded. Within the space of two days last week, robbers raided two service stations in Bulawayo and bound the attendants hands before escaping with cash. In the first incident, four men armed with a pistol pounced on Trek Garage in Gwabalanda and escaped with more than US$15,000 and R800 after attacking the fuel attendant and security guard, while in the second case, three men armed with pistols raided Amakhosi Service Station along the Bulawayo-Victoria Falls Road.\n\nWe have witnessed the upsurge of armed robberies at fuel service stations around the city. We urge petrol attendants not to keep large sums of money on themselves or their premises but to deposit their monies in the safes under lock and key and day sales to be banked, said Acting Bulawayo police spokesperson Assistant Inspector Nomalanga Msebele.\n\nPerhaps a greater concern for Bulawayo residents is that the perpetrators of gun crimes at times seem motivated by more than mere financial gain. High drama and sometimes callous violence have become hallmarks of some gun-related incidents. On 31 March, a 37-year-old man and his girlfriend had the misfortune of encountering a pair of particularly unpleasant individuals in Mbuyazwe along the Nyamandlovu road. What may have begun as a romantic getaway for the couple soon descended into a nightmare as the two assailants seized the man and wrestled with him for approximately 10 minutes before producing a black pistol and striking him twice on the back of the head. For good measure, they stabbed the man twice on each buttock with a knife, and to add insult to injury, they ransacked his car, taking four Samsung Galaxy cellphones and cash amounting to US$1,000 from his wallet. More gruesomely, one of the robbers then proceeded to sexually assault the mans girlfriend.\n\nWith President Mnangagwa declaring war on armed robbers in 2022, the countrys law enforcement officers have also demonstrated their readiness for the fight, subduing some of Bulawayos most notorious criminals. A Hollywood-style shootout between police officers and six robbers near the Bulawayo-Victoria Falls tollgate resulted in the demise of the six gunmen who had robbed a general dealership in Insuza.\n\nMeanwhile, two suspects were fatally shot, and three others were arrested in connection with last weeks Tshabalala incident. As police continue their crackdown on gun-toting criminals, it remains to be seen whether their efforts will restore Bulawayo to the once peaceful, gun-free city it used to be.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/gnfhgdf.jpg",
            "description": "Bruce Ndlovu THE details surrounding the alleged murder of Sergeant Abel Masava are as brutal as they are utterly chilling. On the morning of March 28, Sergeant Masava, alongside his colleague, Constable Magaya, was attending to a domestic violence complaint in Sizinda when he noticed five suspicious men walking past. The five were clad in […]",
            "time": "18:07",
            "date": "05 Apr 2025"
        }
    ]
}