{
    "news": [
        {
            "title": "Navaya, Chiragwi grab monthly gongs",
            "url": "https://www.chronicle.co.zw/navaya-chiragwi-grab-monthly-gongs/",
            "content": "Online Reporter\n\nTELONE striker Washington Navaya and Ngezi Platinum coach Takesure Chiragwi have been named the Castle Lager Premier Soccer League Player and Coach of the Month respectively.\n\nNavaya scored four goals in the opening four matches, while Chiragwi guided his team to three wins and one draw.\n\nUnder his leadership, Ngezi Platinum sit at the top of the table with 10 points, followed closely by MWOS, who have earned eight points.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Nav-680x380.jpg",
            "description": "Online Reporter TELONE striker Washington Navaya and Ngezi Platinum coach Takesure Chiragwi have been named the Castle Lager Premier Soccer League Player and Coach of the Month respectively. Navaya scored four goals in the opening four matches, while Chiragwi guided his team to three wins and one draw. Under his leadership, Ngezi Platinum sit at […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Maninja named Bosso player of the month",
            "url": "https://www.chronicle.co.zw/maninja-named-bosso-player-of-the-month/",
            "content": "Online Reporter\n\nHIGHLANDERS striker, Brighton Maninja Ncube has been named the Business Friends of Bosso Players Players of the Month for March.\n\nNcube is the first recipient of the award this season. The award was introduced last year by a group of businessmen as a means to reward outstanding players at the Bulawayo Giants.\n\nThe goal-poacher netted three goals in four appearances in March and is leading the clubs goal-scoring charts this season.\n\nHis three goals were all scored against newly promoted Kwekwe United whom Highlanders brushed aside 4-0 at Barbourfields Stadium in their second encounter of the season.\n\nIt was the first hat-trick of the season.\n\nI am pleased to have gotten this award. I would like to thank my teammates and coaches who made this possible. Gratitude also goes to the award sponsors,  said Ncube.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-04-at-17.43.35_dafdb4e8-666x380.jpg",
            "description": "Online Reporter HIGHLANDERS striker, Brighton “Maninja” Ncube has been named the Business Friends of Bosso Players’ Players of the Month for March. Ncube is the first recipient of the award this season. The award was introduced last year by a group of businessmen as a means to reward outstanding players at the Bulawayo Giants. The […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Power cut delays US$41k CBZ Bank fraud verdict in Tredgold Court",
            "url": "https://www.chronicle.co.zw/power-cut-delays-us41k-cbz-bank-fraud-verdict-in-tredgold-court/",
            "content": "Trish Mukwazo ,[emailprotected]\n\nA verdict in the case of two men accused of defrauding CBZ Bank of US$41,000 using title deeds belonging to a deceased person was postponed to Monday due to an electricity outage at Tredgold Magistrates Court in Bulawayo.\n\nThe duo was scheduled to appear in court today to receive their judgment, but the power outage, reportedly caused by a fault, forced a postponement.\n\nThe regional courts were severely affected as they rely on electricity to record court proceedings. As a result, all cases scheduled for today were postponed until Monday.\n\nThe provincial courts were however unaffected by the power outage and continued with their proceedings as scheduled.\n\nThe duo  Anoop Ranmanlal Desai, director of Phenduka Supplies Pvt Ltd, and Prosper Moyo, son of the deceased whose title deeds were used in the loan application  had appeared before Bulawayo regional magistrate Ms Sibonginkosi Mnkandla facing fraud charges.\n\nThe State closed its case after its final witness, Detective Sergeant Jacob Kachitsa, the investigating officer, testified. He told the court that Desai and Moyo allegedly worked with another suspect, Rahmiben Tharolbual Desai, who remains at large.\n\nDet Sgt Kachitsa testified that the late John Nkonyane Moyo, whose title deeds were fraudulently used, had three children, including Prosper. It is alleged that Prosper facilitated the submission of the property deeds to Desai, leading to the fraudulent acquisition of the loan.\n\nWitnesses from CBZ Bank testified in court and produced paperwork as evidence supporting the States case.\n\nProsecutor Nomthandazo Mafu told the court that on 6 July 2016, Desai and Prosper, in collaboration with Rahmiben Tharolbual Desai, approached CBZ Bank to apply for a loan on behalf of Phenduka Supplies Pvt Ltd.\n\nThe accused persons presented title deeds for a property registered under the late John Nkonyane Moyo as collateral. They were given guarantor forms that were required to be signed by John Nkonyane Moyo, said Ms Mafu.\n\nThey later returned the documents to CBZ Bank, purportedly signed by John Nkonyane Moyo, knowing he was deceased.\n\nThe court heard that CBZ Bank processed the loan application based on the provided documents, approving a loan of US$30,000 in 2016. The funds were deposited into CBZ Bank account number 026023699010014, belonging to Phenduka Supplies Pvt Ltd.\n\nCBZ Bank later registered a mortgage bond for US$41,000. When Desai failed to repay the loan, the account was downgraded to recoveries in 2019.\n\nDuring the banks efforts to auction the property, it was discovered the property belonged to a deceased individual and therefore could not be sold.\n\nAs a result of the accused persons actions, the bank suffered an actual prejudice of US$30,000, plus US$11,000 in accrued interest, said Ms Mafu.\n\nHowever, the electricity was restored mid-afternoon at Tredgold Magistrates Court.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/The-duo-Anoop-Ranmanlal-Desai-director-of-Phenduka-Supplies-Pvt-Ltd-and-Prosper-Moyo-son-of-the-deceased-whose-title-deeds-were-used-in-the-loan-application.jpg",
            "description": "Trish Mukwazo , trishmukwazo515@gmail.com   A verdict in the case of two men accused of defrauding CBZ Bank of US$41,000 using title deeds belonging to a deceased person was postponed to Monday due to an electricity outage at Tredgold Magistrates’ Court in Bulawayo.   The duo was scheduled to appear in court today to receive their judgment, […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Two Beitbridge men face attempted murder after a violent altercation at a party",
            "url": "https://www.chronicle.co.zw/two-beitbridge-men-face-attempted-murder-after-a-violent-altercation-at-a-party/",
            "content": "Langelihle S Nyathi,[emailprotected]\n\nTwo Beitbridge men, Walter Mbedzi and Bildard Sibanda, have been charged with attempted murder following a violent altercation at a party in Maduqlo under Chief Matibe.\n\nAccording to a statement by the National Prosecuting Authority of Zimbabwe (NPA), the incident occurred on March 31, 2025, during a celebration, where a dispute broke out after Mbedzi allegedly assaulted Edwin Moyo, the younger brother of the complainant, William Moyo.\n\nIt is reported that the situation quickly escalated into a fistfight involving other youths at the party.Amid the chaos, Walter allegedly stabbed the complainant in the chest, while Sibanda reportedly stabbed him on the right arm.\n\nThe victim sustained serious injuries and was rushed to the Beitbridge District Hospital, where he was initially treated and discharged and was readmitted the following day due to complications.\n\nThe case has been remanded to April 10, as the complainant is still hospitalized.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/09/attempted-murder.jpg",
            "description": "Langelihle S Nyathi, langae2001@gmail.com Two Beitbridge men, Walter Mbedzi and Bildard Sibanda, have been charged with attempted murder following a violent altercation at a party in Maduqlo under Chief Matibe. According to a statement by the National Prosecuting Authority of Zimbabwe (NPA), the incident occurred on March 31, 2025, during a celebration, where a dispute […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Almasi Collaborative Arts and The Public Theater launch inaugural Zimbabwean Writer’s Retreat",
            "url": "https://www.chronicle.co.zw/almasi-collaborative-arts-and-the-public-theater-launch-inaugural-zimbabwean-writers-retreat/",
            "content": "Online Reporter\n\nAlmasi Collaborative Arts has launched its inaugural Zimbabwean Writers Retreat, a two-week program designed to nurture emerging playwrights.\n\nThe selected playwrights  Amanda Ranganawa (Mutare), Tatenda Mutyambizi (Harare), Kingsley Chinhanu (Mutare), Philani Nyoni (Bulawayo) and Rudo Mutangadura (Harare)  will work in a supportive environment designed to encourage bold storytelling and artistic experimentation.\n\nThe program is made possible with the support of The Public Theater, a leading force in American theatre.\n\nThe initiative, running from March 31 to April 12 in Harare, provides five selected writers with dedicated time and space to develop their plays and refine their creative voices.\n\nThe retreat, in partnership with New Yorks renowned The Public Theater, was spearheaded by Danai Gurira, the celebrated actress and playwright known for The Walking Dead and Black Panther, who also serves as Executive Artistic Director of Almasi Collaborative Arts.\n\nHaving experienced the impact of similar retreats in the U.S., Gurira was inspired to create the same opportunity for Zimbabwean writers.\n\nThe writer brings the indelible word to the world; it is with them that the story is born, Gurira said.\n\nThis retreat gives these talented creatives the chance to focus fully on their craft, and I cant wait to see what stories emerge.\n\nGurira expressed gratitude to its Artistic Director, Oskar Eustis, for his commitment to uplifting Zimbabwean voices.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Almasi-Collaborative-Arts-and-The-Public-Theater-launch-inaugural-Zimbabwean-Writers-Retreat.jpg",
            "description": "Online Reporter Almasi Collaborative Arts has launched its inaugural Zimbabwean Writer’s Retreat, a two-week program designed to nurture emerging playwrights.  The selected playwrights — Amanda Ranganawa (Mutare), Tatenda Mutyambizi (Harare), Kingsley Chinhanu (Mutare), Philani Nyoni (Bulawayo) and Rudo Mutangadura (Harare) – will work in a supportive environment designed to encourage bold storytelling and artistic experimentation.   […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "President urges African educators to prioritise research and innovation",
            "url": "https://www.chronicle.co.zw/president-urges-african-educators-to-prioritise-research-and-innovation/",
            "content": "Mashudu Netsianda\n\nPresident Mnangagwa has urged educators across Africa to place a greater emphasis on research, highlighting its vital role in the continents modernisation.\n\nHe further stressed the need for a thorough reevaluation of whether African countries are adequately equipping learners with the essential skills necessary for progress and development.\n\nOfficially opening the 3rd Africa Education Summit in Victoria Falls, President Mnangagwa said Africa must foster an education system that promotes solution-based minds not merely certificate holders.\n\nIn the past, we felt those who spoke English were highly educated. We must scale up transformative strategies that promote development across Africa. Think outside the box to upscale resilience systems as we shape the future of our continent. Those who thought Africa was a dark continent are those who had dark minds, he said.\n\nPresident Mnangagwa said Africa should be holistic in its prepositions that take into account its unique realities.\n\nIncreased cooperation among African countries is key to cater for 30 million children out of school in sub-Saharan Africa. We should facilitate equitable access to education and in our case as Zimbabwe, increased school infrastructure especially in resettlement areas has ensured that learners walk more than 5km to school, he said.\n\nThis is to make sure that no one is left behind. It is the duty of the government to make sure that every child has access to education. My government has made it a point that we drill a borehole in every school and a nutrition garden.\n\nWe must work to align this sector, and our schools and higher learning institutions must be incubators of innovation so that our students produce goods and services that meet the demands of our communities.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/sc.jpg",
            "description": "Mashudu Netsianda President Mnangagwa has urged educators across Africa to place a greater emphasis on research, highlighting its vital role in the continent’s modernisation. He further stressed the need for a thorough reevaluation of whether African countries are adequately equipping learners with the essential skills necessary for progress and development. Officially opening the 3rd Africa […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Africa’s rise depends on strong education pillars: President Mnangagwa",
            "url": "https://www.chronicle.co.zw/africas-rise-depends-on-strong-education-pillars-president-mnangagwa/",
            "content": "Mashudu Netsianda\n\nPRESIDENT Mnangagwa has challenged stakeholders attending the ongoing 3rd Africa Education Summit in Victoria Falls to proffer solutions and actionable policies that propel the continent into a rising star.\n\nHe said since Africa is rising, education should be one of the strongest pillars of that rise.\n\nLet us build a robust education system that ensures that we take pride in our identity as Africans. We must work to align the education sector, and our schools and higher learning institutions must be incubators of innovation so that our students produce goods and services that meet the demands of our communities, said President Mnangagwa.\n\nHe implored private players including those in the diaspora to complement the Government by investing in clean energy, which is deemed a dual necessity.\n\nWe need an education system that enables our learners to create jobs and solve societal challenges. The need to enhance collaboration cannot be emphasised. My government has increased support for teaching and learning material and these are having a positive impact in learning processes and ensure a knowledge-driven economy, said President Mnangagwa.\n\nHe said the digital divide remains a challenge in the continent, adding that there is an urgent need to address those issues through promoting research in A1, climate change and agriculture in Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-04-at-13.50.14_3d87375f-680x380.jpg",
            "description": "Mashudu Netsianda PRESIDENT Mnangagwa has challenged stakeholders attending the ongoing 3rd Africa Education Summit in Victoria Falls to proffer solutions and actionable policies that propel the continent into a rising star. He said since Africa is rising, education should be one of the strongest pillars of that rise. “Let us build a robust education system […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Mberengwa school in sodomy storm…Deputy Head accused of violating 35 pupils",
            "url": "https://www.chronicle.co.zw/mberengwa-school-in-sodomy-stormdeputy-head-accused-of-violating-35-pupils/",
            "content": "Midlands Bureau\n\nTHE deputy Head of Masase High School in Mberengwa is on the run after he allegedly sodomised over 35 pupils at the school.\n\nAnymore Gumbo, reportedly sneaked out of the Evangelical Lutheran Church of Zimbabwe (ELCZ) run school premises on Friday after police descended on the school to investigate reports of sodomy.\n\nGumbo would allegedly invite pupils to his office before sodomising them.\n\nPolice and officials from the Ministry of Primary and Secondary Education have since launched an investigation into the case, with further allegations that the school head Mr Albion Masukume has been trying to sweep under the carpet.\n\nMidlands Provincial police Spokesperson, Inspector Emmanuel Mahoko confirmed the case, revealing that Gumbo was on the run and the police were making frantic efforts to arrest him.\n\nOfficials from the Ministry of Education have been on the ground since Friday after they received an anonymous letter from one of the teachers as the issue of sodomy had become the talk at the school.\n\nThe head has a very tight law which only allows pupils to talk to him if they want to report anything and this had seen the majority of the pupils being sodomised in silence, said an angry parent whose kid was also a victim of sodomy.\n\nMr Masukume confirmed the developments and said he has since communicated with the parents of the affected pupils\n\nIn a letter he sent to parents, Mr Masukume said the matter was now being handled by the police.\n\nI write with sorrow to inform you that allegations of child abuse by one of our staff members was reported. Currently, thorough investigations by Ministry of Primary and Secondary Education and the police are underway, reads part of the letter.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/Gumbo-680x380.jpg",
            "description": "Midlands Bureau THE deputy Head of Masase High School in Mberengwa is on the run after he allegedly sodomised over 35 pupils at the school. Anymore Gumbo, reportedly sneaked out of the Evangelical Lutheran Church of Zimbabwe (ELCZ) run school premises on Friday after police descended on the school to investigate reports of sodomy. Gumbo […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "Government warns councils against unauthorised workshops",
            "url": "https://www.chronicle.co.zw/government-warns-councils-against-unauthorised-workshops/",
            "content": "Nqobile Bhebhe,Senior Reporter\n\nTHE Ministry of Local Government and Public Works has issued a directive to all local authorities, cautioning them against participating in capacity-building workshops organised by several external entities without prior ministerial approval.\n\nIn an official circular addressed to all local authoritiesand copied to both the Urban Councils Association of Zimbabwe and the Association of Rural District Councils of ZimbabwePermanent Secretary Dr John Basera raised alarm over a surge in unsanctioned training programs.\n\nThe Ministry is highly concerned about the upsurge of capacity-building workshops ostensibly designed for local authorities by innumerable parties targeting management, councillors, and council committees, wrote Dr Basera.\n\nHe emphasised that attendance at such programs should only proceed with formal ministerial clearance.\n\nGiven the foregoing, all local authorities are advised not to attend any program that is not authorised by the Ministry or without seeking Ministerial clearance, in line with the Ministry guiding circular on the holding of workshops and meetings outside council jurisdiction, he added.\n\nDr Basera further urged councils to instead focus on internal capacity-building efforts initiated by the Ministry itself.\n\nIn the interim, local authorities should prioritise spearheading the Ministry-driven capacity building programs lined up for the first quarter and ensure the success of the same, he stated.\n\nThe directive aims to streamline training efforts and ensure consistency with national development objectives amid growing concern over fragmented and potentially conflicting external programs.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/jsfjdsds.jpg",
            "description": "Nqobile Bhebhe, Senior Reporter THE Ministry of Local Government and Public Works has issued a directive to all local authorities, cautioning them against participating in capacity-building workshops organised by several external entities without prior ministerial approval. In an official circular addressed to all local authorities—and copied to both the Urban Councils Association of Zimbabwe and the […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        },
        {
            "title": "SA-based dancer Nolie Mabona to bring expertise back to Zimbabwe’s dance industry",
            "url": "https://www.chronicle.co.zw/sa-based-dancer-nolie-mabona-to-bring-expertise-back-to-zimbabwes-dance-industry/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nVeteran dancer Noliwe Nolie Mabona, who has been based in South Africa for over 15 years, is considering returning home in the coming months to share the skills and experience she has gained with fellow Zimbabwean artists.\n\nNolie, whose journey began in the early 2000s, launched her career with the internationally acclaimed Umkhathi Theatre Works in 2002 and was also part of the Grassroots Theatre. Now, after years of honing her craft in the neighbouring country, she feels it is time to give back to the next generation of dancers in Zimbabwe.Here in South Africa, Im part of Royal Vibrations Foundation and also work with Izindlondlokazi, a continuous project where we perform on demand. Ive come to realise that home is best after all. According to my personal plans, Im most likely to return in September this year, Nolie shared.\n\nShe highlighted the differences between the South African and Zimbabwean creative industries, noting how South Africa invests heavily in its artists.Ive learnt a lot here and would love to bring that knowledge to the Zimbabwean dance scene. Theres a gap that needs to be filled, she added.\n\nReflecting on her journey, Nolie described it as a continuous process of growth and learning.I began performing in 2002, inspired by theatre for development using different artforms to identify problems and solutions within communities. The journey has not been easy. Many aspiring female artists face challenges, including a lack of mentorship and opportunities, as well as industry exploitation.At one of my lowest points in my career, Umkhathi Theatre Works Matesu Dube gave me a chance, and for that, I am grateful, she said.\n\nNow, as she looks toward her homecoming, she hopes to play a pivotal role in reshaping the local dance industry.  Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/rg.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Veteran dancer Noliwe “Nolie” Mabona, who has been based in South Africa for over 15 years, is considering returning home in the coming months to share the skills and experience she has gained with fellow Zimbabwean artists. Nolie, whose journey began in the early 2000s, launched her career with the internationally acclaimed […]",
            "time": "21:46",
            "date": "04 Apr 2025"
        }
    ]
}