{
    "news": [
        {
            "title": "Jah Prayzah, Jah Signal to headline Independence/Easter celebrations in Shurugwi",
            "url": "https://www.chronicle.co.zw/jah-prayzah-jah-signal-to-headline-independence-easter-celebrations-in-shurugwi/",
            "content": "Johnsias Mutonhori\n\nContemporary musician Jah Prayzah is set to light up the City of Gold this Saturday in a show that comes hot on the heels of Independence Day celebrations.\n\nFor the first time ever, Jah Prayzah will perform in Shurugwi, sharing the stage with fellow artiste Jah Signal, and supported by local DJs Nelz, Taflo, and Thunder at Vital Lounge.\n\nJah Signal\n\nShow organiser Moreblessing Mukomberanwa said preparations are complete for what promises to be an unforgettable night of music and celebration.This is a big event, strategically planned to follow Zimbabwes Independence Day, one of the most important days on our national calendar, Mukomberanwa said.\n\nPeople across the country are in a celebratory mood, and to make this holiday weekend even more memorable, we decided to bring one of Zimbabwes top musicians to Shurugwi, and the Midlands Province as a whole.\n\nHe added that the show is not just for locals, as tickets have also been selling fast in neighbouring towns like Gweru, Kwekwe, and Zvishavane.Were expecting a huge turnout from across the province. Our team is working tirelessly to ensure everyone enjoys a safe and memorable experience.\n\nExcitement is already in the air, with locals anticipating a weekend of double celebrations.Its going to be a busy weekend, said a local artisanal miner who identified himself as Nabling.\n\nOn Friday, Ill be in Nembudziya celebrating Independence Day, and on Saturday, Ill be at Vital Lounge for JP!\n\nKeisha Mudonhi, a nurse from Gweru and self-confessed superfan, could not hide her excitement either.I think Im JPs biggest fan! I cant wait to see him live at Vital Lounge. Luckily, Im off duty on Independence Day and the night of the show!\n\nMukomberanwa assured fans of top-tier service and maximum safety.We want to rebrand Shurugwi as a vibrant, peaceful town, a great place for entertainment. Vital Lounge is not just a bar, its a lifestyle venue offering everything youd expect from top entertainment spots in the country. From a VIP section and high-end catering to games and a secure environment, weve got it all.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dsfdf-680x360.jpg",
            "description": "Johnsias Mutonhori Contemporary musician Jah Prayzah is set to light up the City of Gold this Saturday in a show that comes hot on the heels of Independence Day celebrations. For the first time ever, Jah Prayzah will perform in Shurugwi, sharing the stage with fellow artiste Jah Signal, and supported by local DJs Nelz, […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "UK to showcase strategic partnerships at 2025 ZITF",
            "url": "https://www.chronicle.co.zw/uk-to-showcase-strategic-partnerships-at-2025-zitf/",
            "content": "Nqobile Bhebhe,Senior Business Reporter\n\nThe British Embassy is expected to showcase a series of high-impact initiatives at the Zimbabwe International Trade Fair (ZITF) in Bulawayo next week, reaffirming its commitment to strengthening bilateral ties with Zimbabwe.\n\nHaving returned to the premier business exhibition in 2022 after a 20-year absence, the embassy is once again set to make a notable presence.\n\nThis year, it will exhibit under the theme Partnerships for Growth showcasing collaborations that are bolstering economic resilience and fostering mutual prosperity.\n\nThe British Embassy will host a UK Pavilion at the 2025 Zimbabwe International Trade Fair (ZITF), highlighting impactful UK-Zimbabwe partnerships that are advancing growth in trade, investment, education, renewable energy and sports, the embassy said in a statement.\n\nThe UK Pavilion will spotlight key initiatives such as the support of horticultural exports including sugar snap peas and blueberries through the Horticulture Development Council (HDC), as well as the provision of US$10 million in agribusiness loans facilitated by NMB Bank and British International Investment (BII).\n\nRenewable energy will also feature prominently, with Africa GreenCo showcasing UK-backed investments in sustainable power solutions. In the education sector, the pavilion will promote UK higher education through initiatives led by the British Council and UK scholarship programmes.\n\nA major cultural and sporting milestone will also be celebrated: the upcoming tour of Zimbabwes national cricket team, the Chevrons, to the United Kingdom.\n\nThis marks Zimbabwes first bilateral cricket tour to England since 2003, following renewed engagements between Zimbabwe Cricket (ZC) and the England and Wales Cricket Board (ECB).\n\nThe tour includes a historic four-day mens Test match scheduled for 2831 May 2025.\n\nThis years ZITF, themed Blue Sapphire in honour of its enduring legacy, runs under the banner Industrialisation: Crafting an Integrated Economic Landscape.\n\nThe 2025 edition is expected to draw significant local and international participation, reflecting Zimbabwes aspirations for inclusive and sustainable industrial growth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-17-at-16.11.06-680x380.jpeg",
            "description": "Nqobile Bhebhe, Senior Business Reporter The British Embassy is expected to showcase a series of high-impact initiatives at the Zimbabwe International Trade Fair (ZITF) in Bulawayo next week, reaffirming its commitment to strengthening bilateral ties with Zimbabwe. Having returned to the premier business exhibition in 2022 after a 20-year absence, the embassy is once again set […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "Three men arrested in South Africa for stealing Zim livestock",
            "url": "https://www.chronicle.co.zw/three-men-arrested-in-south-africa-for-stealing-zim-livestock/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHREE men aged between 31 and 39 have been arrested by South African police for allegedly stealing and smuggling 88 goats from Zimbabwe across the Limpopo River, in yet another case reflecting the persistent scourge of cross-border livestock theft.\n\nThe trio was nabbed on Tuesday in the Bennde Mutale area of Limpopo Province during a joint tactical operation involving security agents from both Zimbabwe and South Africa, who are working together to curb cross-border crimes, especially stock theft.\n\nLimpopo police spokesperson, Colonel Malasela Ledwaba, said the suspects were intercepted following an intelligence-led operation spearheaded by the Makuya Police.Concerted efforts by police in the province to fight border crime are yielding results and this was evident when the Makuya Police arrested three suspects aged between 31 and 39 for smuggling of livestock, he said.\n\nCol Ledwaba said police seized a white Isuzu 44 pickup truck with a canopy and a large trailer loaded with 88 goats. The total estimated value of the seized livestock and vehicle is R470 000.Police received intelligence information about a suspicious vehicle fully loaded with goats suspected to have been smuggled from Zimbabwe into South Africa. The vehicle was monitored until it reached the tar road in Masisi, where it was intercepted, he said.\n\nThe suspects, who failed to produce any documentation proving ownership of the animals, were arrested and are expected to appear before the Thohoyandou Magistrates Court on charges of possession of suspected stolen property. Investigations are still underway.\n\nThe illegal movement of livestock across the Limpopo River has become a perennial problem, with goats, cattle and sheep frequently targeted by syndicates operating between the two countries. Cross-border livestock theft, especially involving goats, sheep and cattle, has become a growing problem in recent years, particularly along the porous border between Zimbabwe and South Africa. The crime not only disrupts rural livelihoods but also undermines food security and economic stability in affected communities.\n\nAccording to security authorities, syndicates often exploit unguarded border points to move stolen livestock, which is then sold on the South African black market for significantly higher prices. While goats may fetch between R600 and R1 000 on the Zimbabwean side, the same animals are sold for R3 500 or more in South Africa, making the trade highly lucrative for smugglers.\n\nIn response to the growing threat, both governments have ramped up joint patrols, community policing initiatives and intelligence-sharing efforts aimed at dismantling stock theft networks. Farmers and local residents in border communities have also begun forming cross-border neighbourhood watch groups to track suspicious movements and report incidents swiftly.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THREE men aged between 31 and 39 have been arrested by South African police for allegedly stealing and smuggling 88 goats from Zimbabwe across the Limpopo River, in yet another case reflecting the persistent scourge of cross-border livestock theft. The trio was nabbed on Tuesday in the Bennde Mutale area of […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "Zimbabwe makes strides in the attainment of SDG 4",
            "url": "https://www.chronicle.co.zw/zimbabwe-makes-strides-in-the-attainment-of-sdg-4/",
            "content": "Online Reporter\n\nZimbabwe has made significant strides in the attainment of Sustainable Development Goal 4 (SDG 4) on quality education says President Mnangagwa.\n\nIn his keynote address at the Childrens Party at Nyamuroro High School in Nembudziya, the President emphasised the importance of SDG 4 which focuses on ensuring inclusive and equitable quality education and promoting lifelong learning opportunities for all.\n\nThis goal is vital as it strives to ensure access to education for every child in Zimbabwe.\n\nUnder our education system, boys and girls are being given equal access to education.\n\nThe Education 5.0 system that the country now has answers to the 21st-century economy needs.\n\nWe now need students who can make and design products, said President Mnangagwa.\n\nMy Government will continue to equip you, the students so that you face the future with confidence.\n\nHe encouraged the students to be innovative and emphasised his mantra of Nyika inovakwa nevene vayo.\n\nHe also spoke against the peddling of drugs and the abuse of social media platforms by children.\n\nSay no to drugs and say no to cyberbullying.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-17-at-15.18.40-680x380.jpeg",
            "description": "Online Reporter Zimbabwe has made significant strides in the attainment of Sustainable Development Goal 4 (SDG 4) on quality education says President Mnangagwa. In his keynote address at the Children’s Party at Nyamuroro High School in Nembudziya, the President emphasised the importance of SDG 4 which focuses on ensuring inclusive and equitable quality education and […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "Child President Pious Nleya urges youth to take part in national development",
            "url": "https://www.chronicle.co.zw/child-president-pious-nleya-urges-youth-to-take-part-in-national-development/",
            "content": "Online Reporter\n\nChild President Pious Nleya says youths should play their part in building the country.\n\nWhile giving the vote of thanks at the Childrens Party, Nleya challenged youths to rise to the occasion and build the country.\n\nThis country requires future leaders, soldiers and policemen, and those are the great people present here.\n\nHe also spoke against the abuse of drugs by the youth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/dfdgf-680x360.jpg",
            "description": "  Online Reporter Child President Pious Nleya says youths should play their part in building the country. While giving the vote of thanks at the Children’s Party, Nleya challenged youths to rise to the occasion and build the country. “This country requires future leaders, soldiers and policemen, and those are the great people present here.” […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "President Mnangagwa gifts US$1 000 to all provincial performers at Children’s Party",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-gifts-us1-000-to-all-provincial-performers-at-childrens-party/",
            "content": "Online Reporter\n\nYouth Empowerment, Development and Vocational Training Minister Tino Machakaire has announced that President Mnangagwa has gifted US$1 000 to all ten provincial groups that performed at the Childrens Party.\n\nMinister Machakaire also spoke against drug abuse among the youth.Youth urged to take part in national development\n\nChild President Pious Nleya says youths should play their part in building the country.\n\nWhile giving the vote of thanks at the Childrens Party, Nleya challenged youths to rise to the occasion and build the country.\n\nThis country requires future leaders, soldiers and policemen, and those are the great people present here.\n\nHe also spoke against the abuse of drugs by the youth.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-17-at-15.18.37-680x380.jpeg",
            "description": "Online Reporter  Youth Empowerment, Development and Vocational Training Minister Tino Machakaire has announced that President Mnangagwa has gifted US$1 000 to all ten provincial groups that performed at the Children’s Party. Minister Machakaire also spoke against drug abuse among the youth. Youth urged to take part in national development Child President Pious Nleya says youths should […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "Solarisation of schools critical for driving STEM – Minister Moyo",
            "url": "https://www.chronicle.co.zw/solarisation-of-schools-critical-for-driving-stem-minister-moyo/",
            "content": "In his remarks before introducing the guest of honour at the Childrens Party, President Mnangagwa, the Minister of Primary and Secondary Education Dr Torerai Moyo said that the solarisation of all schools is critical to drive STEM.\n\nHe said that the availability of power at all schools will enable connectivity in line with the countrys digitalisation drive under the National Development Strategy and Vision 2030.\n\nHe introduces President Mnangagwa to deliver his keynote address.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/rffff-680x360.jpg",
            "description": "In his remarks before introducing the guest of honour at the Children’s Party, President Mnangagwa, the Minister of Primary and Secondary Education Dr Torerai Moyo said that the solarisation of all schools is critical to drive STEM. He said that the availability of power at all schools will enable connectivity in line with the country’s […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "Atmosphere still joyful at Children’s Party as all 10 provinces show off cultural talent",
            "url": "https://www.chronicle.co.zw/atmosphere-still-joyful-at-childrens-party-as-all-10-provinces-show-off-cultural-talent/",
            "content": "Blessings Chidakwa in Gokwe\n\nLaughter and cheers continues to fill the air as the Childrens Party carries on in full swing, with the atmosphere remaining vibrant and full of joy.\n\nThe celebration carries on with high spirits, fueled by colourful performances and proud displays of cultural heritage from across the country.\n\nEach of the countrys 10 provinces is bringing something special to the stage, with children donning traditional attire and performing dances passed down through generations.\n\nFrom dances and poems, the young performers are showcasing the rich tapestry of traditions that make each province unique.\n\nThe performances are blending the old with the new.\n\nMore than just entertainment, the event is serving as a powerful reminder of unity in diversity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/fvdffddf-680x360.jpg",
            "description": "  Blessings Chidakwa in Gokwe Laughter and cheers continues to fill the air as the Children’s Party carries on in full swing, with the atmosphere remaining vibrant and full of joy. The celebration carries on with high spirits, fueled by colourful performances and proud displays of cultural heritage from across the country. Each of the […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "School children grateful for the digitalisation initiative – Minister Moyo",
            "url": "https://www.chronicle.co.zw/school-children-grateful-for-the-digitalisation-initiative-minister-moyo/",
            "content": "Minister of Primary and Secondary Education Dr Torerai Moyo, while introducing the 3 050 child delegates from across the country who have gathered for the Childrens Party, says the children have gathered with the aim to draw inspiration from the Presidents leadership and commitment to transforming the lives of children in Zimbabwe.\n\nMinister Moyo said the children were grateful to the President for introducing the digitalisation initiative and addressing welfare issues in schools.\n\nHe also revealed that the child delegates were selected based on their academic prowess, sporting prowess, and commitment to community development.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/rffff-680x360.jpg",
            "description": "Minister of Primary and Secondary Education Dr Torerai Moyo, while introducing the 3 050 child delegates from across the country who have gathered for the Children’s Party, says the children have gathered with the aim to draw inspiration from the President’s leadership and commitment to transforming the lives of children in Zimbabwe. Minister Moyo said […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        },
        {
            "title": "WATCH: Wild cheers as President Mnangagwa meets children",
            "url": "https://www.chronicle.co.zw/watch-wild-cheers-as-president-mnangagwa-meets-children/",
            "content": "Blessings Chidakwa in Gokwe\n\nWild cheers erupted from thousands of children as President Mnangagwa stepped into the main venue of the Childrens Party at Nyamuroro High School in Nembudziya.\n\nWaving flags, hats, scarfs, placards and singing, the excited youngsters gave the President a rousing welcome.\n\nSome jumped to their feet, clapping rhythmically as he made his way to the stage.\n\nThe atmosphere is electric, with beaming smiles and animated chatter filling the air.\n\nPresident Mnangagwa responded with a warm wave and his trademark Presidential dance visibly moved by the spirited reception.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/04/WhatsApp-Image-2025-04-17-at-13.47.00-360x240.jpeg",
            "description": "Blessings Chidakwa in Gokwe Wild cheers erupted from thousands of children as President Mnangagwa stepped into the main venue of the Children’s Party at Nyamuroro High School in Nembudziya. Waving flags, hats, scarfs, placards and singing, the excited youngsters gave the President a rousing welcome. Some jumped to their feet, clapping rhythmically as he made […]",
            "time": "18:44",
            "date": "17 Apr 2025"
        }
    ]
}