{
    "news": [
        {
            "title": "Namibia’s ‘founding father’ Sam Nujoma dies aged 95",
            "url": "https://www.chronicle.co.zw/namibias-founding-father-sam-nujoma-dies-aged-95/",
            "content": "WINDHOEK, Feb 9 (Reuters)  Sam Nujoma, the activist and guerrilla leader who became Namibias first democratically elected president after it won its independence from apartheid South Africa, died aged 95 on Saturday, the Namibian Presidency said on Sunday.\n\nNujoma rose to head the thinly populated southern African country on March 21, 1990 and was formally recognised as Founding Father of the Namibian Nation through a 2005 act of parliament.\n\nThe acclaim was balanced out by domestic and international criticism over his intolerance of critical media coverage, his railing against homosexuality and over the 1998 constitutional amendment that let him run for a third term.\n\nHe was a longtime ally of Zimbabwean President Robert Mugabe, backing Mugabes land seizures from white farmers, though at home Nujoma stuck to a willing buyer, willing seller policy.\n\nThe foundations of the Republic of Namibia have been shaken, the presidency posted on X.\n\nOur venerable leader, Dr. Nujoma did not only blaze the trail to freedom  but he also inspired us to rise to our feet and to become masters of this vast land of our ancestors.\n\nThe presidency said Nujoma had been hospitalised for medical treatment over the past three weeks, adding: Unfortunately, this time, the most gallant son of our land could not recover from his illness.\n\nCOMPLEX LEGACY\n\nNujoma served his three terms as president from 1990 to 2005 and sought to project himself as a unifying leader bridging political divides.\n\nIn a country scarred by the legacy of apartheid and German colonial rule, Nujomas SWAPO party oversaw a national reconciliation programme under the motto One Namibia, One Nation.\n\nIn his speeches, Nujoma made a point of repeating the phrase: A united people, striving to achieve a common good for all members of the society, will always emerge victorious.\n\nAdvertisement  Scroll to continue\n\nHis achievements included establishing democratic institutions and prioritising reconciliation, said Ndumba Kamwanyah, a lecturer at the University of Namibia and a political analyst.\n\nBut his autocratic tendencies, on display in his treatment of the media and brutal suppression of the 1999 Caprivi rebellion, cast a shadow over his legacy, Kamwanyah added.\n\nWhile Nujomas presidency was foundational in establishing Namibias independence and governance, it was not without flaws, Kamwanyah said.\n\nCAMPAIGNER AND GUERRILLA\n\nNujoma was born in a village in northwestern Namibia in 1929, when his country was under South African administration. South Africa had controlled Namibia since World War One after a brutal few decades of German colonial rule remembered for the genocide of the Herero and Nama people.\n\nAs a boy he looked after his familys cattle and attended a Finnish mission school, before moving to the coastal town of Walvis Bay and then the capital Windhoek, where he worked for South African Railways, according to a biography posted on the website of Nujomas charitable foundation.\n\nNujoma left his job on the railways to focus his energies on bringing down the apartheid system.\n\nIn the late 1950s he became leader of the Owambo Peoples Organisation, a precursor to liberation movement SWAPO, organising resistance to the forced relocation of Black people in Windhoek that culminated in the police killing 12 unarmed people and wounding dozens more.\n\nNujoma was charged with organising the resistance and arrested.\n\nIn 1960, he went into exile. He travelled across Africa before reaching the United States, where he petitioned the United Nations for Namibias independence.\n\nMade SWAPO leader in absentia, Nujoma established its armed wing and in 1966 launched a guerrilla war against the apartheid government.\n\nIt took more than a decade of pressure from Nujoma and others before a U.N. Security Council resolution in 1978 proposed a ceasefire and elections, and another decade for the ceasefire deal to be signed and elections held in late 1989.\n\nSWAPO won a majority in those elections, and Nujoma took office in March the following year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Z6QCHG47FBNELJG4WLJP2N3QUA-680x380.jpg",
            "description": "WINDHOEK, Feb 9 (Reuters) – Sam Nujoma, the activist and guerrilla leader who became Namibia’s first democratically elected president after it won its independence from apartheid South Africa, died aged 95 on Saturday, the Namibian Presidency said on Sunday.   Nujoma rose to head the thinly populated southern African country on March 21, 1990 and […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "President Ruto calls for unified action to resolve DRC conflict",
            "url": "https://www.chronicle.co.zw/president-ruto-calls-for-unified-action-to-resolve-drc-conflict/",
            "content": "Online Reporter\n\nKenyan President William Ruto has called for urgent, collective, and sustained action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), emphasising the need for diplomatic solutions over military intervention.\n\nSpeaking at the historic joint summit of the East African Community (EAC) and Southern African Development Community (SADC) in Dar es Salaam, President Ruto expressed deep concern over the prolonged conflict, which has devastated the DRC for over two decades.\n\nHe commended Tanzanian President Samia Suluhu Hassan for hosting the summit, underscoring the importance of regional collaboration in resolving the crisis.\n\nWe find ourselves standing face to face with a grave security, diplomatic, and humanitarian crisis in the DRC, a situation that demands our immediate, collective, and sustained attention, he said.\n\nHe highlighted the immense toll the conflict has taken on the DRC, including mass displacement, loss of life, and economic setbacks.\n\nThe recent escalation of violence in Goma and surrounding areas, he warned, serves as a stark reminder of the urgent need for action.\n\nPresident Ruto called on all parties involved in the conflict to immediately cease hostilities, emphasising that military action alone will not bring a lasting solution.\n\nHe specifically urged the M23 rebel group to halt further advancements and called on the armed forces of the DRC to refrain from retaliatory measures.\n\nAn immediate ceasefire is the only way by which we can create necessary conditions for constructive dialogue and implementation of a comprehensive peace agreement, said President Ruto.\n\nHe reaffirmed the commitment of EAC and SADC to the principles of territorial integrity, national sovereignty, and peaceful coexistence. Additionally, he condemned attacks on diplomatic missions, civilians, and peacekeepers, calling such acts a violation of international law.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tr5g4.jpg",
            "description": "Online Reporter Kenyan President William Ruto has called for urgent, collective, and sustained action to address the ongoing security crisis in the eastern Democratic Republic of Congo (DRC), emphasising the need for diplomatic solutions over military intervention. Speaking at the historic joint summit of the East African Community (EAC) and Southern African Development Community (SADC) […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "Midlands man jailed for 20 years for murder",
            "url": "https://www.chronicle.co.zw/midlands-man-jailed-for-20-years-for-murder/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nA man from Mzila Village, Chief Sogwala, Lower Gweru, was arraigned before the Gweru High Court Circuit on murder charges.\n\nThe incident took place at Ngwenya Mine, Ranch Farm, Shamrock, Lower Gweru. Colleen Ngwenya had a misunderstanding with the now-deceased, who was a security guard at the mine. The deceased informed Ngwenya that weapons were not allowed on the premises, seized his knives, and advised him to collect them when he left the mine.\n\nA few hours later, Ngwenya waylaid the deceased and stabbed him in the buttocks and back. The deceased was found bleeding and lying on the ground by a passerby, who rushed to seek help. When the passerby returned with assistance, they found the deceased no longer breathing.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said Ngwenya was sentenced to 20 years imprisonment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2016/10/jail3.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com  A man from Mzila Village, Chief Sogwala, Lower Gweru, was arraigned before the Gweru High Court Circuit on murder charges. The incident took place at Ngwenya Mine, Ranch Farm, Shamrock, Lower Gweru. Colleen Ngwenya had a misunderstanding with the now-deceased, who was a security guard at the mine. The deceased informed Ngwenya […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "Man steals US$5k hidden in shoe",
            "url": "https://www.chronicle.co.zw/man-steals-us5k-hidden-in-shoe/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nA 30-year-old man from Runhanga Village, Domboshava, appeared at the Rusape Magistrates Court on theft charges.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said Emmanuel Munetsi allegedly stole US$5,000 from Susan Zimbudzi, a 58-year-old woman from Village 13, Chinyika West, Headlands. Munetsi, who claimed to be helping Zimbudzi purchase a vehicle, had been staying at her homestead.\n\nOn 19 January, while Zimbudzi was away tending to her cattle, Munetsi entered her bedroom and stole the money hidden in a shoe. He later left for Harare under the pretext of searching for a suitable vehicle. The theft was subsequently discovered, leading to his arrest. The stolen money has not been recovered.\n\nMunetsi was remanded in custody until 2 February.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/10/jail-brreak.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com  A 30-year-old man from Runhanga Village, Domboshava, appeared at the Rusape Magistrates’ Court on theft charges. In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said Emmanuel Munetsi allegedly stole US$5,000 from Susan Zimbudzi, a 58-year-old woman from Village 13, Chinyika West, Headlands. Munetsi, who claimed to be helping […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "Man pours beer on uncle and beats him up",
            "url": "https://www.chronicle.co.zw/man-pours-beer-on-uncle-and-beats-him-up/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nA 38-year-old man from Makovhula Village, Lupane, appeared before the Lupane Magistrates Court on assault charges.\n\nXolani Sibanda poured beer over his uncle, Nene Moyo, and proceeded to assault him using his fists and slapped him following a family dispute.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said the incident occurred on 28 October 2024 at Ndengwende Business Centre.\n\nSibanda was sentenced to 175 hours of community service.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com A 38-year-old man from Makovhula Village, Lupane, appeared before the Lupane Magistrates’ Court on assault charges. Xolani Sibanda poured beer over his uncle, Nene Moyo, and proceeded to assault him using his fists and slapped him following a family dispute. In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "DRC conflict not only affects its citizens but the region: President Mnangagwa",
            "url": "https://www.chronicle.co.zw/drc-conflict-not-only-affects-its-citizens-but-the-region-president-mnangagwa/",
            "content": "SADC chairperson and Zimbabwe President Emmerson Mnangagwa says the conflict in theDemocratic Republic of Congonot only affect its citizens but the region as well.\n\nHe says it is imperative that a lasting solution is found in the DRC for peace and stability in the region.\n\nSADC and the East African Community have convened in Tanzania to discuss the crisis in the DRC.\n\nSADC-EAC summit on DRC conflict:\n\nPresident Cyril Ramaphosa is in the Tanzanian capital, Dar es Salaam to attend the meeting.\n\nAddressing the summit, Mnangagwa said the meeting must put the interests of Congolese first.\n\nWe must remain united as we were during the struggle for the complete emancipation and independence of Africa from colonialism. We do have a duty to comprehensively frankly tackle and address the various challenges that are impeding the realisation of peace.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fgrgerf.jpg",
            "description": "SADC chairperson and Zimbabwe President Emmerson Mnangagwa says the conflict in the Democratic Republic of Congo not only affect its citizens but the region as well. He says it is imperative that a lasting solution is found in the DRC for peace and stability in the region. SADC and the East African Community have convened in Tanzania […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "Bulawayo man sentenced to 15 years for indecent assault",
            "url": "https://www.chronicle.co.zw/bulawayo-man-sentenced-to-15-years-for-indecent-assault/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nA 47-year-old man from Mpopoma was sentenced to 15 years imprisonment for indecent assault by the Western Commonage Magistrates Court.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said the incident took place on 16 October 2024, when the offender assaulted the complainant, an 11-year-old girl who was helping his daughter with homework.\n\nThe offenders daughter fell asleep, leaving the victim alone with him. Seizing the opportunity, he approached the complainant, fondled her breasts, and repeatedly inserted his fingers into her privates, the NPAZ stated.\n\nThe victim reported the incident to her teacher, added the NPAZ.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com  A 47-year-old man from Mpopoma was sentenced to 15 years’ imprisonment for indecent assault by the Western Commonage Magistrates’ Court. In a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said the incident took place on 16 October 2024, when the offender assaulted the complainant, an 11-year-old girl who was […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "Andy Rinomhota’s resilience inspires Cardiff City youngster who was signed from Man United",
            "url": "https://www.chronicle.co.zw/andy-rinomhotas-resilience-inspires-cardiff-city-youngster-who-was-signed-from-man-united/",
            "content": "ANDY Rinomhotas resilience has inspired Will Fish  a Cardiff City youngster whos struggling to get time since arriving at the club from Manchester United at the start of the season.\n\nFish has made just two starts in the Championship this season.\n\nIn an interview with BBC, the 21-year-old has hopes to emulate Cardiff City team-mate Rinomhota in establishing himself as a key player for the Bluebirds.\n\nRinomhota,a Warriors midfilder, fell out of favour in the previous before becoming a first team regular under coach Omer Riza in this campaign.\n\nEvery time you play for the club youre going to try and do your best. Thats all Ill try and do, Fish said.\n\nIts been tough at times, but the lads in front of me have done well and the way football works, it takes one little moment to get your chance and hopefully take it.\n\nFair play to Andy, you could see even when he wasnt playing he was a top professional and trained well.\n\nHes an obvious good example. Once he got that chance he took it and now hes probably been one of our most consistent players. Soccer24\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/04/player.jpg",
            "description": "ANDY Rinomhota’s resilience has inspired Will Fish – a Cardiff City youngster who’s struggling to get time since arriving at the club from Manchester United at the start of the season. Fish has made just two starts in the Championship this season. In an interview with BBC, the 21-year-old has hopes to emulate Cardiff City […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "Isaac Mpofu wins 5000m race at Bab track and field championships",
            "url": "https://www.chronicle.co.zw/isaac-mpofu-wins-5000m-race-at-bab-track-and-field-championships/",
            "content": "Innocent Kurira,[emailprotected]\n\nTOP athlete Isaac Mpofu has claimed victory in the 5000m race at the ongoing Bulawayo Athletics Board (Bab) Track and Field Championships at White City Stadium, finishing with a time of 14 minutes 56 seconds.\n\nAndrew Ndlovu secured second place with a time of 15 minutes 25 seconds, while Mthokozisi Mhlanga finished third in 15 minutes 40 seconds.\n\nThe Bab event is the first of the year and has attracted nearly 200 athletes, including top stars like Isaac Mpofu.\n\nThe championships are also coinciding with the Coach Education and Certification Systems (CECS) and the Technical Officials Education and Certification System (TOECS) courses, both taking place at the same venue.\n\nIn other final results so far, Thokozile Kunene won the 200m Girls Cadets category, finishing the race in 30.23 seconds, while Luda Dube placed second with a time of 32.19 seconds.\n\nIn the 200m Womens final, Rutendo Vushe took the top spot with a time of 25.55 seconds. Nomazulu Ndlovu and Nompumelelo Gadluma are currently in second and third places, recording times of 29.37 seconds.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/bjbnjn.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw TOP athlete Isaac Mpofu has claimed victory in the 5000m race at the ongoing Bulawayo Athletics Board (Bab) Track and Field Championships at White City Stadium, finishing with a time of 14 minutes 56 seconds. Andrew Ndlovu secured second place with a time of 15 minutes 25 seconds, while Mthokozisi Mhlanga finished […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        },
        {
            "title": "Trump signs order to cut funding for South Africa over land policy, ICJ case",
            "url": "https://www.chronicle.co.zw/trump-signs-order-to-cut-funding-for-south-africa-over-land-policy-icj-case/",
            "content": "(Reuters)  President Donald Trump signed an executive order to cut U.S. financial assistance to South Africa, the White House said on Friday, citing disapproval of its land policy and of its genocide case at the International Court of Justice against Washingtons ally Israel.\n\nThe United States allocated nearly $440 million in assistance to South Africa in 2023, the most recent U.S. government data shows.\n\nThe White House said Washington will also formulate a plan to resettle white South African farmers and their families as refugees.\n\nIt said U.S. officials will take steps to prioritize humanitarian relief, including admission and resettlement through the United States Refugee Admissions Program for Afrikaners in South Africa, who are mostly white descendants of early Dutch and French settlers.\n\nTrump has said, without citing evidence, that South Africa is confiscating land and that certain classes of people were treated very badly. South African-born billionaire Elon Musk, who is close to Trump, has said that white South Africans have been the victims of racist ownership laws.\n\nSouth African President Cyril Ramaphosa  who signed into law a bill last month aimed at making it easier for the state to expropriate land in the public interest  has defended the policy. He has said the government had not confiscated any land and the policy was aimed at evening out racial disparities in land ownership in the Black-majority nation. Ramaphosa said South Africa will not be bullied.\n\nAdvertisement  Scroll to continue\n\nWashington has also complained about the case brought by South Africa at the International Court of Justice, where it accused Israel of genocide over Israels military assault on Gaza that has killed tens of thousands and caused a humanitarian crisis.\n\nIsrael denies the allegations, saying it acted in self-defense following a deadly Oct. 7, 2023, attack by Palestinian Hamas militants.\n\nThe White House cited that case as an example of South Africa taking positions against Washington and its allies.\n\nAdvertisement  Scroll to continue\n\nThe executive order signed by Trump will address human rights issues in South Africa, the White House said. Trump had threatened to cut off funding for the nation soon after taking office.\n\nThe question of land ownership is highly politically charged in South Africa, due to the legacy of the colonial and apartheid eras when Black people were dispossessed of their lands and denied property rights.\n\nWhite landowners still possess three-quarters of South Africas freehold farmland. This contrasts with 4% owned by Black people, who make up 80% of the population compared with about 8% for whites, according to the latest 2017 land audit.\n\n Reuters\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/X4YJKMGDZRK23IBRDQASTJVC4Q-680x380.jpg",
            "description": "(Reuters) – President Donald Trump signed an executive order to cut U.S. financial assistance to South Africa, the White House said on Friday, citing disapproval of its land policy and of its genocide case at the International Court of Justice against Washington’s ally Israel. The United States allocated nearly $440 million in assistance to South […]",
            "time": "09:07",
            "date": "09 Feb 2025"
        }
    ]
}