{
    "news": [
        {
            "title": "Beitbridge activates disaster response teams amid Cyclone Chido rains",
            "url": "https://www.chronicle.co.zw/beitbridge-activates-disaster-response-teams-amid-cyclone-chido-rains/",
            "content": "Thupeyo Muleya,[emailprotected]\n\nThe Civil Protection Committee in Beitbridge has activated its Disaster Rapid Response (DRR) teams to remain on high alert following continuous rains across the district since Wednesday, linked to Cyclone Chido.\n\nCommittee chairperson, Mrs. Sikhangezile Mafu-Moyo, said while no damages have been reported yet, the teams are ready to respond to potential emergencies.We are on high alert and urge people to stay safe. The DRR committees on the ground are available to relay information on any imminent danger caused by heavy rains, said Mrs. Mafu-Moyo.\n\nShe urged residents to stock up on essential supplies, keep children away from water bodies, avoid crossing flooded rivers, and be ready to relocate if necessary, particularly those in low-lying areas.The districts flood-prone areas include Shashe, Tshitulipasi, Tshikwalakwala, Makakavhule, Tongwe, Umzingwane and Tshathapita among others\n\nIn Beitbridge Municipality, low-lying areas around the Dulivhadzimu bus terminus, the stadium, and council hostels are particularly vulnerable to flash floods.To mitigate risks, the committee has identified shelters, including churches, community halls, and schools on higher ground, to accommodate affected residents in case of emergencies.\n\nMrs Mafu-Moyo said there are ongoing awareness campaigns in areas prone to rainfall-related disasters. She also urged residents to stay informed through updates from the Meteorological Services Department (MSD) and the Civil Protection Committee.It is important for the community to follow weather updates to minimize the effects of climate-related disasters, she said.According to the MSD, Cyclone Chidos intensity has diminished significantly after moving overland. Increased friction has reduced its wind speed and rainfall intensity, downgrading it to a depression.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/01/Developing-Cyclone.jpg",
            "description": "Thupeyo Muleya, Thupeyo.muleya@zimpapers.co.zw The Civil Protection Committee in Beitbridge has activated its Disaster Rapid Response (DRR) teams to remain on high alert following continuous rains across the district since Wednesday, linked to Cyclone Chido. Committee chairperson, Mrs. Sikhangezile Mafu-Moyo, said while no damages have been reported yet, the teams are ready to respond to potential […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "Armed robber targeting cross-border travellers jailed for 12 years",
            "url": "https://www.chronicle.co.zw/armed-robber-targeting-cross-border-travellers-jailed-for-12-years/",
            "content": "Thupeyo Muleya Beitbridge BureauA 31-YEAR-OLD man, part of a gang believed to target cross-border travellers from Zimbabwe and rob them at gunpoint in South Africa, has been sentenced to an effective 10 years in prison by a Beitbridge regional court.Nomore Shava, of no fixed abode in Beitbridge, was recently arrested after robbing a Beitbridge woman at gunpoint of her car, two mobile phones, and R6 000 while acting in concert with two accomplices who remain at large.The victim had just arrived to visit a relative in Musina, South Africa, when Shava and his accomplices ambushed her, armed with a pistol.Although Shava denied the armed robbery charge, Beitbridge Regional Magistrate Ms Charity Maphosa convicted him on Friday, relying on the strength of the States evidence.Shava was sentenced to 12 years in prison, but Ms Maphosa conditionally suspended two years of the sentence for five years, leaving him with an effective 10 years to serve.Prosecutor Mr Willbrought Muleya told the court that on 5 November this year, the complainant had travelled to Musina in her Toyota RunX to visit a relative around 3 am. Upon disembarking from her vehicle, Shava and his accomplices emerged from the darkness, brandishing a pistol, and robbed her of two mobile phones, car keys, and R6 000  items valued at R66 000 in total.The matter was reported to police in Musina, and the complainant returned to Beitbridge, where she conducted a SIM swap and traced her stolen phone to a local dealer in Dulivhadzimu.Teaming up with other mobile phone dealers, the victim located the stolen phones with a man who had been given them by Shava to sell on his behalf.An ambush was subsequently organised, and police arrested Shava when he arrived to collect his money from the phone dealer. The stolen mobile phones were also recovered.Ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/armed-robbers-used-gun-robbery-600nw-1495712093-600x380.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 31-YEAR-OLD man, part of a gang believed to target cross-border travellers from Zimbabwe and rob them at gunpoint in South Africa, has been sentenced to an effective 10 years in prison by a Beitbridge regional court. Nomore Shava, of no fixed abode in Beitbridge, was recently arrested after robbing a […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "Zimbabwe receives moderate rainfall as Chido dissipates",
            "url": "https://www.chronicle.co.zw/zimbabwe-receives-moderate-rainfall-as-chido-dissipates/",
            "content": "Herald Reporters\n\nCyclone Chido that was expected to make landfall in the country today downgraded to a depression and brought much-needed but moderate rainfall to some parts of Zimbabwe.\n\nAccording to the Meteorological Services Department (MSD), the cyclones intensity diminished significantly as it moved overland, with increased friction reducing both its wind speed and rainfall intensity.\n\nOnce the cyclone moves over land, it loses its ability to maintain its original power due to increased friction, said Mr Tapiwa Muringo, MSD focal point person for Manicaland.\n\nAs a result, we see a reduction in both wind speed and rainfall intensity, which has led to this downgraded depression.\n\nAs of this afternoon, the residual moisture created cloudy conditions in some parts of the country, particularly in Manicaland and Mashonaland East Provinces.\n\nLight to moderate rainfall was recorded, with the MSD forecasting more to come.\n\nWe expect moderate rainfall ranging from 30 to 80 mm over much of the country as the depressions moisture mixes with that from the Inter-Tropical Convergence Zone (ITCZ), which typically begins to bring rainfall to Zimbabwe in mid-December, said Mr Nathan Nkomo, director of the Department of Civil Protection.\n\nThe ITCZ, a belt of low pressure located at the equator, is known for its seasonal rains, which usually start mid-December, marking the beginning of the rainy season across the country.\n\nCyclones usually produce larger storm systems with heavy rains and destructive winds, but as they lose strength over land, they primarily contribute moisture to local weather patterns, creating conditions conducive for lighter rainfall.\n\nIn Manicaland, cloudy conditions have been recorded since yesterday (Monday) but the rainfall has been light so far.\n\nCloudy and mild conditions are expected to continue, with scattered thunderstorms that may become heavy, bringing strong winds in some parts of the province, said Mr Muringo.\n\nThe rains have been light in other parts of the country as well.\n\nHarare received moderate rains this morning, with cloudy conditions persisting for the rest of the day.\n\nBulawayo experienced moderate rainfall that lasted for about 30 minutes this afternoon.\n\nOther areas, such as Chiredzi and Beitbridge, are still experiencing high temperatures, with little to no rain.\n\nDespite the light rainfall, the presence of Cyclone Chidos remnants continue to shape weather conditions across the country.\n\nWe are closely monitoring the situation, receiving daily updates from both the MSD and the climate service center, said Mr Nkomo.\n\nWhile we do not expect the heavy rainfall typically associated with a full cyclone, this residual moisture will contribute to the gradual onset of the rainy season.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Nathan-Nkomo.jpg",
            "description": "Herald Reporters Cyclone Chido that was expected to make landfall in the country today downgraded to a depression and brought much-needed but moderate rainfall to some parts of Zimbabwe. According to the Meteorological Services Department (MSD), the cyclone’s intensity diminished significantly as it moved overland, with increased friction reducing both its wind speed and rainfall […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "Budget Cash and Carry champions local brands with ‘Local is Lekker’ Initiative",
            "url": "https://www.chronicle.co.zw/budget-cash-and-carry-champions-local-brands-with-local-is-lekker-initiative/",
            "content": "Sikhulekelani[emailprotected]\n\nA LOCAL wholesale outlet in Bulawayo has taken it upon itself to promote local brands by allowing manufacturers to exhibit their products on its premises.Budget Cash and Carry, an affiliate of SO Sweet, is running promotional events that bring local producers to its facility in Belmont, where they interact with customers and provide information about locally made products.\n\nThe initiative aims to reduce imports while promoting the Buy Zimbabwe movement.In a recent interview, Budget Cash and Carry Managing Director, Mr Raeez Lunat, said the strategy seeks to increase consumer awareness and provide local companies with a platform to showcase their products, thereby reducing the demand for imported goods, which have negatively impacted the local economy.As part of its local content strategy, Budget Cash and Carry has set up exhibition stands displaying a variety of locally made products from different regions across the country to encourage customers to purchase more Zimbabwean goods.\n\nWe are promoting local products, from sweets to other items, as long as they are produced in Zimbabwe, he said. This will not be a one-off event; it will occur as often as possible with different local companies.\n\nMeanwhile, on Saturday, the company will hold its monthly brand activation programme for local products, titled Local is Lekker.Since the liberalisation of the economy in February 2009, Zimbabwe has been battling a negative trade balance largely driven by imported consumer goods. In response, the Government has introduced policies to promote local procurement and reduce the countrys import bill.\n\nThese initiatives include the Local Content Policy, which aims to boost domestic production with a focus on value addition.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dsada.jpg",
            "description": "Sikhulekelani Moyo-mskhulekelani16@gmail.com A LOCAL wholesale outlet in Bulawayo has taken it upon itself to promote local brands by allowing manufacturers to exhibit their products on its premises. Budget Cash and Carry, an affiliate of SO Sweet, is running promotional events that bring local producers to its facility in Belmont, where they interact with customers and […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "Stanbic Named Best Overall Bank 2024",
            "url": "https://www.chronicle.co.zw/stanbic-named-best-overall-bank-2024/",
            "content": "Online Reporter\n\nStanbic Bank Zimbabwe has been named the overall best performing bank at the Banks and Banking Survey Awards 2024 sponsored by First Capital Bank.\n\nStanbic Bank has now won the overall best performing bank for the second year in a row, cementing its place as the leading financial services institution in Zimbabwe.\n\nThe adjudicators of the Banks and Banking Survey said Stanbic Banks victory was anchored on the institutions strong digital footprint, cost discipline, efficient lending and brand positioning.\n\nThe bank managed to surpass other financial institutions in key deliverables namely profitability, efficiency, cash flows and shareholder value creation, said the adjudicators.\n\nThey commended the Standard Bank Group subsidiary for managing a healthy interest income underpinned by an uplift in the average lending book which jumped by a huge margin reflecting heightened appetite for foreign currency funding.\n\nStanbic Bank commands a huge market share in foreign currency denominated transactions owing to its brand profiling and this contributed to the institution landing the prestigious accolade.\n\nForeign shareholders support has ensured favourable credit terms thereby creating compelling customer demand and reference, noted the adjudicators.\n\nStanbic Bank registered an inflation adjusted profit of ZWL 743 billion for the year ended 31 December 2023 and this performance contributed significantly to the institution leading the banking pack.\n\nThe institutions net interest income closed the period at ZWL 423 billion on a net lending book of ZWL 1.9 trillion.\n\nLast week Stanbic Bank Zimbabwe Chief Executive (CE), Solomon Nyanhongo landed the overall Chief Executive Officer (CEO) of the year as well as the Banking sector CEO of the year awards at the prestigious annual CEO Round Table Awards.\n\nNyanhongo scooped the two awards as his leadership as well as the banks performance was rewarded for excelling in eight (8) categories namely: Business performance; Corporate & Strategy; Digital Journey; Customer Experience; Risk Management; Product Mix; Product Innovation; and Ethical Leadership & Management.\n\nNyanhongo was rewarded for guiding Stanbic Bank to greater heights in its business performance as measured by revenue growth as well as Leadership and Corporate Strategy whose indicator was strategic foresight.\n\nHe was honoured for championing the implementation of the institutions three strategic priorities, that is, transform client experience, execute with excellence, drive sustainable growth and value.\n\nNyanhongo was recognised for steering the Standard Bank Group subsidiary through a highly innovative digital journey with the institution registering the highest percentage of digitised customers.\n\nStanbic Banks journey towards digital transformation has been impactful, with 48% of its clients now fully digitized. Up to 94% of the 14.1 million transactions undertaken this year were conducted on digital channels.\n\nIt was noted that Stanbic Banks clients trust in its digital platforms and that the institution had an unwavering commitment to enhancing accessibility, convenience, and efficiency in every interaction.\n\nNyanhongo and the institution were rewarded for creating top-notch customer experience through which the institution had highest levels of customer satisfaction and customer retention.\n\nStanbic Bank Zimbabwe won the Best Customer Experience Award in the Banking Category from the Customer Experience Association of Zimbabwe. The institution has won the award for the past two years. Customer satisfaction across Stanbic Banks segments averaged 8.5 out of 10 suggesting that the institutions clients are highly satisfied with the services they provide them\n\nOver the years Stanbic Bank has been recognised for its sterling performances scooping awards such as the EMEA Finance African Banking Awards; Best Bank in Zimbabwe2021, 2020, 2018, 2017, 2015); Best Investment Bank in Zimbabwe 2015 and Global Investor Group Subsidiary-Custody Survey 2018  Winner in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/unnamed-7.jpg",
            "description": "Online Reporter Stanbic Bank Zimbabwe has been named the overall best performing bank at the Banks and Banking Survey Awards 2024 sponsored by First Capital Bank. Stanbic Bank has now won the overall best performing bank for the second year in a row, cementing its place as the leading financial services institution in Zimbabwe. The […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "A Warm Welcome: Tourism Minister greets visitors at Victoria Falls International Airport",
            "url": "https://www.chronicle.co.zw/a-warm-welcome-tourism-minister-greets-visitors-at-victoria-falls-international-airport/",
            "content": "IN arare and commendable gesture, Minister of Tourism and Hospitality, Barbara Rwodzi, on Wednesday morning personally met and welcomed nearly every visitor arriving at the Victoria Falls International Airport.\n\nThe Minister was earlier on taken around the airport by Principal Immigration Officer, Herbert Mudzvova who is officer in charge of Immigration Department at the Victoria Falls International Airport, to understand the operations of the facility.\n\nA family of 8 from South Africa chats with Tourism and Hospitality Industry Minister Barbara Rwodzi upon landing at the Victoria Falls International Airport\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/rwooo-680x380.jpg",
            "description": "Online Reporter IN a rare and commendable gesture, Minister of Tourism and Hospitality, Barbara Rwodzi, on Wednesday morning personally met and welcomed nearly every visitor arriving at the Victoria Falls International Airport. The Minister was earlier on taken around the airport by Principal Immigration Officer, Herbert Mudzvova who is officer in charge of Immigration Department at […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "Victoria Falls Town Clerk suspension sparks division",
            "url": "https://www.chronicle.co.zw/victoria-falls-town-clerk-suspension-sparks-division/",
            "content": "Leonard Ncube\n\nThe recent suspension of the Victoria Falls Town Clerk, Mr Ronnie Dube has caused a significant rift within the city, creating divisions both in the boardroom and among residents.\n\nOn Tuesday, some councillors boycotted a full council meeting, leading to a lack of quorum and further escalating tensions surrounding the situation.\n\nThe full council meeting was meant to deliberate among other issues, the suspension of Town Clerk who was suspended early this month amid allegations of corruption and abuse of office.\n\nThe Citys Mayor, Councillor Prince Thuso Moyo notified Mr Dube of his suspension through a letter dated December 2, 2024. The Mayor noted that Mr Dubes suspension was in terms of Section 29: (3) of the Urban Councils Act.\n\nThe Mayor said he had received several complaints and allegations of abuse of office and corruption against Mr Dube about the illegal allocation of land.\n\nCouncillors endorsed the suspension in a full council meeting the following day.\n\nHowever, Local Government and Public Works Minister Daniel Garwe wrote to the Mayor directing the councillors to rescind the resolution as it was unprocedural and not supported by policy.\n\nCouncillors sat last week and resolved to stand by their resolution and the Minister summoned the Mayor and committee chairpersons to Harare where he (the Minister) reportedly reiterated the Ministerial position on the need to rescind the suspension.\n\nThe councillors were then expected to sit on Tuesday but only five turned up forcing the postponement of the full council.\n\nChronicle understands the meeting was rescheduled to this Thursday.\n\nThe Mayor could not be reached for comment.\n\nHowever, sources alleged councillors were told not to attend the full council meeting so that there is no quorum, in full defiance of the ministers directive.\n\nVictoria Falls has 11 elected councillors and three proportional representation councillors\n\nResidents convened a meeting last week under the auspices of the civic consortium comprising the Victoria Falls Combined Residents Association (Vifacora) and Hwange District Residents Association (HWADRA), and threatened to deal with the councillors if they rescind the resolution.\n\nThey resolved that councillors must not sit in a full council to rescind the resolution saying the lawmakers should rather sacrifice themselves.\n\nThe residents said Minister Garwe should come to Victoria Falls so they engage with him over the issue. They had also resolved to demonstrate at the Victoria Falls City Council office although the plan failed.\n\nMore to follow..\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Mr-Ronnie-Dube.jpg",
            "description": "Leonard Ncube The recent suspension of the Victoria Falls Town Clerk, Mr Ronnie Dube has caused a significant rift within the city, creating divisions both in the boardroom and among residents. On Tuesday, some councillors boycotted a full council meeting, leading to a lack of quorum and further escalating tensions surrounding the situation. The full […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "ZGA Releases 2025 Calendar of Events",
            "url": "https://www.chronicle.co.zw/zga-releases-2025-calendar-of-events/",
            "content": "Brandon Moyo\n\nTHE Zimbabwe Golf Association (ZGA) has released the 2025 calendar of events, with a number of high-profile tournaments lined up.\n\nBulawayo Golf Club will host the traditional season opener, the Dugmore tournament, on January 25 and 26, before the Platinum Classic at Norton Golf Club brings the curtain down on 29th and 30th November.\n\nAlongside a host of local tournaments, including the Zimbabwe Open, scheduled for May 4 to 11, there are several international events on the agenda, such as the Golf RSA International Amateur (January 28 to 31), the African Amateur Championship (February 5 to 8, Leopard Creek, South Africa), and the Region Five tournament in Botswana.\n\nThe Lowveld Pro-Am, scheduled for 19th to 22nd June, is another major highlight on the calendar, along with the Zimbabwe Amateur in July.\n\nZGA 2025 Calendar of events:\n\nDugmore (January 25-26, Bulawayo Golf Club), GolfRSA International Amateur (January 28-31, Royal Johannesburg Golf Club), African Amateur Championship (February 5-8, Leopard Creek, South Africa), Mawegu Amateur (February 22-23, Norton Golf Club), Manicaland Amateur (March 8-9, Hillside Golf Club), Matabeleland Amateur (March 22-23, Bulawayo Country Club), Masvingo Amateur (April 5-6, Masvingo Golf Club), Hillside Masters (April 19-20, Hillside Golf Club), Region Five (TBC, Botswana), National Nomads (May 3-4, Bulawayo Golf Club), Zimbabwe Open (May 4-11, Royal Harare), National Club Championships (May 17-18, All Clubs), Mash Central Amateur (May 24-25, Bindura Golf Club), Munhumutapa Strokeplay (May 31- June 1, ZRP Golf Club), Midlands Amateur (June 14-15, Kwekwe Golf Club), Lowveld Pro-Am (June 19-22, Triangle and Chiredzi Golf Clubs), Champion of Champions (June 29-30, Roland Park Golf Club), Chapman Grandslam (July 5-6, Chapman Golf Club), Zim Amateur (July 19-20, Hillside Golf Club), Eisenhower Finals (TBA, New Zealand), Roland Park Open (August 9-10, Roland Park Golf Club), Bata Power Open (August 23-24, Gweru Golf Club), Mzilikazi Championship (September 6-7, Harry Allen Golf Club), Simon Muzenda Invitational (September 20-21, Kwekwe Golf Club), Jacaranda Challenge (September 27-28, Royal Harare), Mashwede Classic (October 4-5, Falcon Golf Club), Harare Amateur (October 18-19, TBA), Mashonaland East Amateur (November 1-2, Marondera Golf Club), Harry Allen Classic (November 15-16, Harry Allen Golf Club), Platinum Classic (November 29-30, Norton Golf Club).  @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/10/GOLF.jpg",
            "description": "Brandon Moyo THE Zimbabwe Golf Association (ZGA) has released the 2025 calendar of events, with a number of high-profile tournaments lined up. Bulawayo Golf Club will host the traditional season opener, the Dugmore tournament, on January 25 and 26, before the Platinum Classic at Norton Golf Club brings the curtain down on 29th and 30th […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "‘Cabinet calendar a success’: President lauds Government 2024 milestones",
            "url": "https://www.chronicle.co.zw/cabinet-calendar-a-success-president-lauds-government-2024-milestones/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nGovernment has made headway in advancing a people-centred national development agenda through initiating policies and projects that had a great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said. The Head of State and Government said this yesterday at State House while addressing the last Cabinet meeting for this year.\n\nToday marks the last Cabinet Meeting for the 2024 Cabinet Calendar. A synopsis of the business transacted during the year reveals that, as Government, we have made notable headway in our people-centred national development agenda. In this respect, during the course of the year, we crafted, reviewed and implemented impactful policies, programmes as well as projects in our quest to fulfil the collective aspirations of our citizens. In a nutshell, the 2024 Cabinet Calendar was a success, with its robust and frank deliberations, said President Mnangagwa.\n\nThese discussions were facilitated by the greatly improved quality of memoranda submitted to Cabinet. Guided by the principle of collective responsibility, it was pleasing that as Ministers, you rose above your respective sectoral interests, in favour of objectivity and the common national good, with co-ordination being more seamless. Congratulations.\n\nPresident Mnangagwa chronicled several achievements registered during the year in different sectors that include, energy, agriculture and health.\n\nHe said adequate grain continued to be distributed to citizens under the food deficit mitigation programme following the declaration of a State of Disaster for the 2023/2024 Summer Season, due to the El Nino-induced drought.\n\nThe timely delivery of food aid as well as agriculture inputs to our people at the grassroots level must be prioritised while complaints that transport costs are sometimes passed on to our people, must be honestly addressed. I, therefore, challenge the relevant Ministries, Departments and Agencies to apply themselves and device strategies that will increase transport and logistical efficiency in getting aid and support to our people, he said.\n\nOn health, President Mnangagwa commended stakeholders in the sector for implementing multi-pronged intervention measures, which saw the country combat the cholera outbreak during the first half of the year.\n\nHe said mechanisms were in place to deploy the recently approved Multi-Hazard Contingency Plan to curtail the effects of floods and other national disaster emergencies.\n\nI call upon you to provide leadership and assist your communities to mitigate damage and harm to property and life in the wake of the ensuing rainfall season. On the economic front, the revision of economic growth projections, on the back of the El Nino-induced droughts negative impact on agricultural output, was inevitable. However, we remain resolute and optimistic that the fiscal and monetary reforms introduced during the year will increasingly underpin currency stability and usher economic rebound, he said.\n\nTurning to the energy sector, President Mnangagwa said while there was a shortage of power owing to low generation at Kariba Hydropower Station, the improved use and exploitation of renewable energy sources in the country, particularly solar by companies and households, continued to reduce national grid power demand.\n\nThe initiatives by Zesa through new models of Independent Power Producers are welcome moves to crowd in the private sector in power generation, specifically for their respective energy needs. More campaigns should be mounted to encourage our people, in both rural and urban areas to adopt renewable energy for domestic use,\n\nOn housing, President Mnangagwa said the Government will continue to channel resources towards housing delivery, as well as the upgrading and rehabilitation of both residential and institutional accommodation nationwide.\n\nThe strides made by local authorities during the course of the year are commendable. These include the conclusion of Master Plans by most local authorities. There are also glimpses of mindset change within that sector. Regrettably, cases of corruption emanating from the sector remain worrisome. The bold decision by Harare City Council to transfer waste disposal and management to private entities should be supported and replicated in other local authorities. Quality service delivery to our citizens remains the core objective, said President Mnangagwa.\n\nThe decentralisation and devolution agenda, said President Mnangagwa, has led to an improved standard of life and living environments for people with enhanced basic social services infrastructure.\n\nHe said the Government will continue prioritising the digital economy and empowerment of youths, women and small to medium enterprises.\n\nPresident Mnangagwa also called for innovative financing models to accelerate the reconstruction of the Mbare Traders Market following a fire incident that gutted the place recently.\n\nThe digital technology revolution is the cornerstone of modernisation, industrialisation and efficient service delivery to drive sustainable economic growth, he said.\n\nHowever, the digitalisation of Government information and services was occurring at a slow pace, something he said was worrisome. President Mnangagwa implored Ministers to ensure that Government continues to provide service to the public during the Cabinet break.\n\nAs Cabinet takes a well-deserved break, let us take note that we are not shutting down Government business and the subsequent delivery of service. Mechanisms must be put in place to balance the demands of a family and associated festivities with serving the people of our great motherland, Zimbabwe. The service delivery demands of the people of Zimbabwe must be responded to timely. After all, we are a Government by the people and for the people, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfdfdfd-680x380.jpg",
            "description": "Zvamaida Murwira, Harare Bureau Government has made headway in advancing a people-centred national development agenda through initiating policies and projects that had a great impact on the collective aspirations of all Zimbabweans, President Mnangagwa has said. The Head of State and Government said this yesterday at State House while addressing the last Cabinet meeting for […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        },
        {
            "title": "President lauds Government 2024 milestones…takes swipe at truancy in cabinet",
            "url": "https://www.chronicle.co.zw/president-lauds-government-2024-milestones-takes-swipe-at-truancy-in-cabinet/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nPresident Mnangagwa yesterday slammed some Cabinet Ministers for failing to attend Cabinet meetings and Committees saying they should toe the line or risk appropriate consequences.\n\nHe said it was critical for Cabinet Ministers to realise that Cabinet meetings take precedence over all other businesses they might have. The Head of State and Government said this yesterday while addressing the last Cabinet meeting for the year.\n\nHe said while most Ministers rose above their respective sectoral interests in favour of achieving the common national good, there was a worrisome tendency by some Ministers and senior Government officials who were not attending meetings.\n\nLet me however hasten to emphasise that Cabinet processes are anchored on the timely submission of vital documents and regular attendance by Ministers and officials. These include both ad-hoc as well as standing Cabinet Committees. The worrisome tendency by Ministers and senior officials to absent themselves from meetings is untenable, said President Mnangagwa.\n\nIn some cases, junior officials are delegated to attend and merely warm bench the meetings. This culture is tantamount to dereliction of duty. Permanent Secretaries should ensure that in their absence, only directors and above should attend working party meetings.\n\nHe directed the Chief Secretary in the Office of the President and Cabinet, Dr Martin Rushwaya to monitor Ministers attendance of the meetings.\n\nIn the 2025 calendar year, the Chief Secretary is directed to strictly monitor individual attendance and ensure that errant Ministers and officials toe the line or risk dire consequences. Ministers should remain mindful that Cabinet business takes precedence over all other business, said President Mnangagwa.\n\nHe said Deputy Ministers should be adequately briefed to help them represent the Government when they attend meetings.\n\nIn cases where Deputy Ministers are assigned, they should be adequately capacitated to enable active participation in the requisite deliberations. To this end, I direct that in the 2025 programme cycle and going forward, Deputy Ministers must now sign performance contractors. It is incumbent upon Ministers to ensure that their deputies are comprehensively briefed on Government business and given the latitude for effective involvement, he said.\n\nA few years ago, President Mnangagwa introduced performance contracts for Cabinet Ministers, Permanent Secretaries and heads of parastatals and State entities as a way of encouraging hard work and results oriented workmanship.\n\nHe has also been conferring awards to top-performing Ministers, Permanent Secretaries and heads of Government departments as the Second Republic continues to foster a culture of excellence, work ethic and servant leadership in its quest to attain Vision 2030.\n\nAmong the notable winners were Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka who took first place as the top-performing Cabinet Minister for the second time running.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Cabinet-49.jpg",
            "description": "Zvamaida Murwira, Harare Bureau President Mnangagwa yesterday slammed some Cabinet Ministers for failing to attend Cabinet meetings and Committees saying they should toe the line or risk appropriate consequences. He said it was critical for Cabinet Ministers to realise that Cabinet meetings take precedence over all other businesses they might have. The Head of State […]",
            "time": "18:09",
            "date": "18 Dec 2024"
        }
    ]
}