{
    "news": [
        {
            "title": "Man found dead near a Shop",
            "url": "https://www.chronicle.co.zw/man-found-dead-near-a-shop/",
            "content": "Sheronrose Mugombi,[emailprotected]\n\nA 25-YEAR-OLD man was found dead at the Penhalonga turn-off, near Doreen Shops, Mutare.\n\nThe unnamed man was found lying with a deep cut on the lower back.\n\nIn a statement on X, Police said the incident took place on 15 February. Anyone with information to report at any station.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/09/MURDER-1.jpeg",
            "description": "Sheronrose Mugombi, mugombisheron@gmail.com A 25-YEAR-OLD man was found dead at the Penhalonga turn-off, near Doreen Shops, Mutare. The unnamed man was found lying with a deep cut on the lower back. In a statement on X, Police said the incident took place on 15 February. Anyone with information to report at any station.",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "All- white party to celebrate local socialite’s birthday",
            "url": "https://www.chronicle.co.zw/all-white-party-to-celebrate-local-socialites-birthday/",
            "content": "Peter Matika\n\nBulawayos buzzing nightlife scene is gearing up for a special celebration tomorrow as renowned bar bouncer and Chicken Inn chief security officer, Shepherd Mpofuaffectionately known as Shepirohosts an all-white-themed birthday party at Ko-Samuriwo Pub and Grill in Luveve suburb.\n\nThis is not just any birthday bash, as it marks a significant milestone for Shepiro, who is celebrating two decades of dedicated service in the security industry.\n\nSince stepping into the role back in 2005, he has become a familiar face at nearly every bar and club in the city, earning respect and admiration from patrons and colleagues alike.\n\nIm just really excited to bring everyone together. This party is not only about me turning another year older but also about connecting with all those amazing customers and clients who have been part of my journey over the years. Its a chance to celebrate the relationships I have built in Bulawayo, said Shepiro.\n\nHe said guests can expect the party to kick off as early as 3PM lasting into a night filled with good vibes, laughter, and perhaps a few surprises, as Shepiro hopes to create an atmosphere that reflects the joy and camaraderie he has fostered throughout his career.\n\nThe all-white theme adds a touch of elegance to the evening, encouraging attendees to dress to impress and join in the festive spirit. The colour is also significant as it shows maturity and the purity we have adopted as players in the security industry, said Shepiro.\n\nReminiscing he said bouncers used to have a physical approach when defusing situations but now have a more rational and intellectual approach.\n\nWe are here to protect each other whether right or wrong. Life is valuable and we want to safeguard peoples lives. We provide security services at weddings, football matches and many other functions. We are conflict managers and we want to ensure that conflicts are managed in a civilized manner, said Shepiro.\n\nHe promised the celebration to be a heartfelt gathering, showcasing not just the journey of a dedicated professional but also the connections that make Bulawayos nightlife so vibrant.\n\nThis is also a chance to celebrate not only my personal achievements but also the community that has embraced me throughout my career. So, if you are in the area and looking for a reason to celebrate, head over to Ko-Samuriwo Pub and Grill tomorrow. Join me as I toast to the past, present and future because this is one birthday bash you will not want to miss, said Shepiro.\n\nHe assured patrons and guests that security within and outside the premises has been increased, following incidents of vehicle theft recently.\n\nThe pub and grill has become one of the popular spots for nightlife lovers in the city.\n\nSituated within Chigumira Business area in Luveve suburb, the pub and grill attracts patrons from across the city.\n\nDue to the influx of people visiting various spots within Chigumira business area, thieves have also targeted cars from patrons who visit joints in the area.\n\nLast weekend, two cars were stolen within the same area but police recovered the two vehicles, a silver Mazda CX5 and a black Honda Fitwere found abandoned within 48 hours of the theft.\n\nWhile the Mazda CX5 was recovered with a missing battery, the Honda Fit was found intact.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hytjyuj.jpg",
            "description": "Peter Matika Bulawayo’s buzzing nightlife scene is gearing up for a special celebration tomorrow as renowned bar bouncer and Chicken Inn chief security officer, Shepherd Mpofu—affectionately known as Shepiro—hosts an all-white-themed birthday party at Ko-Samuriwo Pub and Grill in Luveve suburb. This is not just any birthday bash, as it marks a significant milestone for […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "World Bank launches programme to boost elementary education in Eastern and Southern Africa, targets 70m+ children",
            "url": "https://www.chronicle.co.zw/world-bank-launches-programme-to-boost-elementary-education-in-eastern-and-southern-africa-targets-70m-children/",
            "content": "Chronicle Writer\n\nA NEW World Bank programme is on the cards to expand equitable access and enhance learning outcomes in basic education across Eastern and Southern Africa, benefiting over 70 million children.\n\nThe Advancing Innovative Methods to Promote Learning (AIM4Learning) Programme is a US$1.54 billion regional programme funded by the World Banks International Development Association (IDA) and International Bank for Reconstruction and Development (IBRD).\n\nWith a focus on addressing the learning crisis in Eastern and Southern Africa, the World Bank has said the programme will use the latest innovations and technologies to enhance education quality while supporting the rapid expansion of school enrollment.\n\nAIM4learning will help countries in the region reduce school dropout rates, increase completion rates, and optimize the funding of basic education, said the multilateral finance organisation in a latest statement.\n\nIt noted that over the past 20 years, countries in Eastern and Southern Africa have made significant progress in basic education. Increased government spending has driven rapid expansions in school enrollment, including for girls.\n\nHowever, despite improvements, the World Bank says the region is facing a growing learning crisis, education outcomes remain low, with the COVID-19 pandemic and other recent shocks further dragging down learning results.\n\nToday, only 11 percent of children in the countries to be addressed by AIM4Learning can read and understand a simple text by age 10, and 14 million basic school-age children are out of school. The programme aims to halve this population, to 7 million by 2034, reads the statement.\n\nSub-Saharan Africa has the worlds fastest-growing child population, making foundational learning for all more critical than ever.\n\nAIM4Learning is an ambitious regional programme dedicated to ensuring quality education for every African child. By investing in education, we invest not just in individual futures, but in the prosperity, stability, and dignity of the entire continent, said Victoria Kwakwa, vice president for the World Banks Eastern and Southern Africa Region.\n\nThe AIM4Learning programme will be implemented in phases over a 10-year period and the first phase will include participation from Comoros and Ethiopia.\n\nAcross the world, technology is increasingly seen as an accelerator for learning, particularly for hard-to-reach and vulnerable children, said Laura Frigenti, CEO of the Global Partnership for Education.\n\nBut deploying technology and resources to tackle the grave education crisis and prepare children for the jobs of the future is no easy task. Partnerships are key to offer countries context-relevant technology support that can help them transform their education systems and make them fit for the 21st century.\n\nThe World bank said AIM4Learning is built on four pillars  transforming learning spaces, developing an effective teacher workforce, strengthening education systems and financing, and encouraging cross-country collaboration.\n\nIt said each participating country will select from a tailored set of options under each pillar, aligning with its specific context and most pressing challenges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/03/World-Bank.jpg",
            "description": "Chronicle Writer A NEW World Bank programme is on the cards to expand equitable access and enhance learning outcomes in basic education across Eastern and Southern Africa, benefiting over 70 million children. The “Advancing Innovative Methods to Promote Learning (AIM4Learning) Programme” is a US$1.54 billion regional programme funded by the World Bank’s International Development Association […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "Southern Region Div One best 11 revealed ……top three to be named today",
            "url": "https://www.chronicle.co.zw/southern-region-div-one-best-11-revealed-top-three-to-be-named-today/",
            "content": "Fungai Muderere,[emailprotected]\n\nAHEAD of a belated awards ceremony, the Zifa Southern Region Division One last seasons best 11 performing players list that is dominated by ZPC Hwange, has been released.\n\nThe awards ceremony will be held on Saturday at Bulawayos Queens Sports Club were the top three regions Soccer Stars are going to be named.\n\nThe breathtaking shows of goalkeeper Harmony Nare, striker Justin Kaunda and Israel Mkahanana did not go unnoticed as they were instrumental in ZPC Hwanges fine season that saw them being crowned champions.\n\nTrio is joined in the regions stars list by the Nkayi United duo of Tinotenda Chitete and Nhlanhla Fumpano.\n\nCasymn also has two players- Tatenda Ushe and Wilfred Nzondo- among last years creme de la creme.\n\nHopewell Moyo (Zimbabwe Saints), Mbongeni Minezhi (Bulawayo City) Micheal Tamela (Mainline) and Trevor Mugwagwa (Zebra Revolution) complete the list of last years best players of the season.\n\nOur top three Soccer Stars are going to be announced at our belated function that will be held at Queens Sports Club on Saturday (today). The Coach of the Year will also be announced at the same function. All I can say is that all systems go from our side.\n\nThe preparations for the event have gone on well. We are expecting to have a fun-filled function as we celebrate our last seasons individual and team accolades, said the regions spokesperson Blessing Mbwanda.\n\nThe 2024 Zifa Southern Region Division One League was conquered by ZPC Hwange, who secured the regions sole ticket to the Premier Soccer League (PSL).\n\nDespite their magnificent efforts in the field of play, the power generators will not be playing in the countrys elite football league after entering into a strategic partnership with Norton based MWOS, who will take their spot.\n\nIt was a development that did not go down well with hordes of local football followers in the southern region let alone Hwange based local football fans who will not have a representative in the Premier Soccer League (PSL) this season as Hwange FC were relegated at the end of the last campaign.\n\nAhead of the start of the 2025 season, ex PSL sides Bulawayo Chiefs, Arenel Movers, Hwange and Zimbabwe Saints have not haboured their intentions to outdo each other.\n\nThese teams will be looking to bounce back to the top-flight league, but they will face stiff competition from other strong teams in the region.\n\nCasmyn, Nkayi United, Bulawayo City, Zimbabwe Saints and Adachi all finished in the top eight last season and will be looking to build on their performance.\n\nClubs like the ambitious Talen Vision and Zebra Revolution could also cause some upsets. The fact that there are no easy games in this seasons fixture list means that teams will have to be at their best every week to stand a chance of winning the title.\n\n-@FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/WhatsApp-Image-2025-02-22-at-10.27.39-AM.jpeg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw AHEAD of a belated awards ceremony, the Zifa Southern Region Division One last season’s best 11 performing players list that is dominated by ZPC Hwange, has been released. The awards ceremony will be held on Saturday at Bulawayo’s Queens Sports Club were the top three region’s Soccer Stars are going to be […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "‘YOU ARE THE FUTURE’: President Mnangagwa tells youth to shape Africa’s destiny with unity and hard work",
            "url": "https://www.chronicle.co.zw/you-are-the-future-president-mnangagwa-tells-youth-to-shape-africas-destiny-with-unity-and-hard-work/",
            "content": "Nqobile Bhebhe,[emailprotected]PRESIDENT Mnangagwa yesterday urged local and regional youth to uphold traditions of unity, solidarity, and peaceful coexistence, stressing that their actions will shape the future of the region and Africa, and crucially, reaffirm the older generations belief in their potential.\n\nHe acknowledged the older generations crucial role in achieving independence and freedom, stating that these achievements and Zimbabwes liberation war heritage must be preserved for future generations.\n\nPresident Mnangagwa said this while addressing thousands of young people from across the countrys ten provinces during the National Youth Day celebration at the Zimbabwe International Exhibition Centre in Bulawayo.\n\nThe celebrations were held under the theme: Empower Youth: Secure the Future.\n\nPresident Mnangagwa, Vice-President Chiwenga and wife Colonel Miniyothabo, Minister of Defence Oppah Muchinguri-Kashiri and Minister of Youth Empowerment, Development and Vocational Training Tino Machakaire watch children demonstrate their taekwondo skills during the National Youth Day celebration at the Zimbabwe International Exhibition Centre in Bulawayo yesterday. Picture  BELIEVE NYAKUDYARA\n\nIn his keynote address, President Mnangagwa, chair of SADC, emphasised the importance of discipline and vigilance among the youth. The event was attended by Vice-President Constantino Chiwenga, Cabinet ministers, top Government officials, and representatives from sister liberation parties, including the ANC (South Africa), Frelimo (Mozambique), Chama Cha Mapinduzi (Tanzania), and CNDD-FDD (Burundi).\n\nI extend a special welcome to you, our young people, as well as delegates from other countries. Your presence here is a testament to the unity and solidarity that define us, the SADC region, and indeed the continent of Africa. I urge you, our young people, to guard jealously this long-standing tradition of unity, solidarity, and peaceful co-existence. The current development era equally demands that you constantly learn from each other, sharing knowledge and experiences for the betterment of your respective communities and countries. None but yourselves has that responsibility, said President Mnangagwa.\n\nHe underscored that the prosperity and future of the region and Africa lie in the hands of the young generation.\n\nWe, the older generation, played our part to bring about independence, freedom, and peace. The ball is now in your court. You must deliver. In unity, the youth of Africa can do more for the realisation of the Africa we want and deserve.\n\nPresident Mnangagwa reaffirmed the older generations belief in the youths potential.\n\nThis National Youth Day is set aside and dedicated to recognising the potential of you, the young people of our country. We, your leaders, believe in your potential and will continue to ensure that your zeal and energy are harnessed so that you accomplish your dreams and aspirations and ultimately, our national Vision 2030. The huge turnout, peaceful, jovial, and electric atmosphere characterising this gathering is a reflection of our collective unity and defining national character as an independent and sovereign people.\n\nEmphasising unity, he urged the youth to remain hardworking, patriotic, and loyal to the country.\n\nResist and reject machinations of those who would want to divide you and divide our nation.\n\nThe President said the celebrations were a chance to reflect on past generations contributions and stressed the importance of discipline, commitment, and hard work for Zimbabwes future.\n\nWe also have a chance to chart and refine the journey we are taking for a brighter future, particularly the role of you; our young people. In undertaking this critical task, remain emboldened by the virtues of courage, selfless sacrifice, and bravery which were defining among the youths of yesteryear. They took up arms against the oppressive colonial regime and brought us independence, sovereignty, territorial integrity, freedom, and democracy.\n\nThese historical milestones, including the rich liberation war heritage, are indispensable and must be safeguarded and passed down from generation to generation, he said.\n\nI, further, call upon you, the young people of this great nation, to continue displaying utmost discipline, commitment, and hard, honest work for the collective good of our country. In doing so, you must be aware that the unity and peace we enjoy today is a fundamental inheritance of the liberation struggle. No one must jeopardise or endanger these critical national aspects.\n\nNational Youth Day, a public holiday under the Second Republic, has become an inclusive platform for youth expression and engagement.\n\nPresident Mnangagwa reaffirmed the Governments commitment to youth empowerment through leadership roles in Government and other key institutions. He stressed that National Youth Day should be a platform for hope, unity, and safeguarding Zimbabwes heritage and freedoms.\n\nIn view of these achievements, I challenge the young people deployed in various leadership positions to continue displaying principles of servant leadership and discipline while galvanising the youth to fully participate in the socio-economic and cultural affairs of our country. As the vanguard of our country, you must take the initiative and develop synergies and partnerships while building a common united front to advance the aims and objectives of our peoples revolution and development thrust.\n\nHe implored the youth to remain vigilant and patriotic.\n\nDefend the integrity and dignity of our country, leadership, and its people. Stand firm, and inculcate a culture of volunteerism and service among all the young people in our beloved motherland, Zimbabwe. The young people both within our country and in the diaspora are called upon to leverage their potential, competencies, and skills towards the pursuit of fulfilling careers.\n\nPresident Mnangagwa urged young people to embrace technology, innovation, and entrepreneurship to create wealth, jobs, and economic growth, expressing confidence in their ability to make Zimbabwe a success.\n\nThe future of our country lies in your hands, he said.\n\nThe celebrations also saw the launch of the Zimbabwe Digital Skills Development Programme, an ambitious initiative implemented in collaboration with the United Arab Emirates.\n\nThis initiative will train 1,5 million young people across the country as software engineers, developers, and programmers. This will enhance digital literacy and skills among Zimbabwean citizens and empower a new generation of professionals who can contribute to technological innovation, he said.\n\nThe programme will train young people in programming, data science, and Android development, fostering innovation and supporting local tech solutions and start-ups.\n\nThis must enhance the countrys competitiveness in the global market, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/cxfhrdf.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw PRESIDENT Mnangagwa yesterday urged local and regional youth to uphold traditions of unity, solidarity, and peaceful coexistence, stressing that their actions will shape the future of the region and Africa, and crucially, reaffirm the older generation’s belief in their potential. He acknowledged the older generation’s crucial role in achieving independence and freedom, […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "Youth Day celebrations highlight Zimbabwe’s future: VP Chiwenga",
            "url": "https://www.chronicle.co.zw/youth-day-celebrations-highlight-zimbabwes-future-vp-chiwenga/",
            "content": "Sikhumbuzo Moyo,[emailprotected]Vice-President Constantino Chiwenga yesterday underscored the significance of National Youth Day, highlighting its connection to President Mnangagwas vision for Zimbabwes future.\n\nHe made these remarks while welcoming the President, who was the guest of honour, to the National Youth Day celebrations in Bulawayo.\n\nThe event, which drew thousands of young people, carried the theme Empower the Youth, Secure the Future. Such was the turnout, organised by the Ministry of Youth Empowerment, Development and Vocational Training, that organisers had to set up an additional large screen in Hall 2 to complement the one in the initially planned Hall 5.\n\nThe theme for this years commemorations resonates well with President Mnangagwas vision, he said, highlighting the alignment of the celebrations with the nations broader developmental goals.\n\nVice-President Chiwenga commended the Second Republic, under President Mnangagwas leadership, for its efforts in youth empowerment. He noted that the Government has launched numerous projects specifically designed to equip young people with essential skills and opportunities through tailored programmes.\n\nThe Second Republic has initiated many projects deliberately meant to empower youths through skills development and tailored programmes, VP Chiwenga said.\n\nEarlier, Bulawayos Minister of State for Provincial Affairs and Devolution, Judith Ncube, officially welcomed delegates, expressing her pride in hosting the momentous event, which was also attended by representatives from revolutionary parties in South Africa, Mozambique, Zambia, and Burundi.\n\nShe highlighted the significance of the National Youth Day commemorations, which serve as a unifying platform for young people from across the country.\n\nThe National Youth Day commemorations bring together all the youths from every corner of the country. The event celebrates the contributions of youth to national development and focuses on empowering young people to play a vital role in shaping Zimbabwes future, said Minister Ncube.\n\nGiving the closing remarks, Defence and War Veterans Affairs Minister, Oppah Muchinguri-Kashiri, expressed gratitude to President Mnangagwa for his astute leadership in ensuring the successful hosting of the National Youth Day commemorations in Bulawayo.\n\nPresident Mnangagwa remains committed to the growth and empowerment of young people. His presence at todays event proves that he has the youth at heart, she said.\n\nShe lauded both the days theme, Empower Youth, Secure the Future, and the Presidents speech, stressing their significance as a call to action for building a future inspired by digital innovation.\n\nMinister Muchinguri-Kashiri stressed the importance of preparing for a world where Artificial Intelligence (AI) and technology are integral to modern societies.\n\nThe theme and President Mnangagwas speech remind us of the need to plan for a digitally inspired future where Artificial Intelligence is part of modern societies, she said.\n\nShe reiterated that the commemorations theme and President Mnangagwas speech serve as a reminder of the need to plan for a digitally inspired future where AI is integral to modern societies.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ber.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw Vice-President Constantino Chiwenga yesterday underscored the significance of National Youth Day, highlighting its connection to President Mnangagwa’s vision for Zimbabwe’s future. He made these remarks while welcoming the President, who was the guest of honour, to the National Youth Day celebrations in Bulawayo. The event, which drew thousands of young people, carried […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "Mhlophe’s second act…Can he deliver where Sibanda fell short?",
            "url": "https://www.chronicle.co.zw/mhlophes-second-act-can-he-deliver-where-sibanda-fell-short-2/",
            "content": "Vusumuzi Dube,[emailprotected]\n\nHIGHLANDERS, Bulawayos iconic football giants, are a year away from their centenary.\n\nHopes for a celebratory season were briefly dashed when Fifa slapped them with a transfer ban for unpaid wages to former coach Baltemar Brito and his assistant.\n\nBrito was owed US$14,778 plus interest, and Torres US$11,788 plus interest, both accruing further penalties.\n\nJust when it seemed Bosso faced a prolonged crisis, socialite Wicknell Chivayo stepped in, paying off the debts in full.While this saved the clubs blushes, it exposed worrying questions about financial management.\n\nThe debt was notably absent from discussions at last months AGM, leaving fans in the dark.\n\nClub chairman Kenneth Mhlophe said they were relying on sponsors to resolve the issue before Fifas punishment, but the near miss has raised serious concerns about transparency as Bosso approaches its 100th year.\n\nKenneth Mhlophe\n\nWe engaged our sponsors over the issue. Going into the annual general meeting week, all appeared in place for the debt to have been paid, and we counted on their usual support, Mhlophe said.\n\nMhlophe deflected criticism by blaming his predecessor, Johnfat Sibanda, for the stalled Inyathi gold mining venture.\n\nThe project, intended to generate club revenue, reportedly made no progress under Sibandas leadership.\n\nThere was no action at all on the mining venture.\n\nThings were still as I had left them, and we then began to chase paperwork. As we speak, the papers have been lodged with the Ministry of Mines. Once they respond, we will be fine, Mhlophe said.\n\nBossos crisis has sparked scrutiny of Mhlophe and Sibandas leadership.Fans and stakeholders are comparing their tenures, achievements, and failures.\n\nThis week, Saturday Chronicle will analyse their impact on the club.\n\nMhlophe, the current chairperson, is no stranger to the Highlanders community, having previously served as the clubs chair from 2018 to 2021 before losing to Sibanda. His return to the helm of the club was seen as an opportunity to build on his earlier tenure and address lingering issues.\n\nHits:\n\nSecured more sponsorship for Highlanders\n\nMhlophe continued the Sakunda deal and secured a Better Brands sponsorship from Pedzai Scott Sakupwanya. Sakunda remained the main sponsor, while Better Brands covered costs for the Highlanders Academy (including all junior teams and the womens team, Highlanders Royals), paying staff and players.\n\nInfrastructure Development\n\nDuring his earlier tenure, Mhlophe initiated plans to renovate the clubs facilities, including the training grounds and the clubhouse. These efforts have continued in his current term, reflecting his commitment to improving the clubs infrastructure.\n\nImproved relations with fans\n\nMhlophe has worked tirelessly to restore trust and goodwill between the club and its fan base. Through community outreach efforts and fan engagement programmes, he sought to re-establish Highlanders as the peoples team. Last year, they held a successful fundraising initiative that was well-supported by both local and international fans.\n\nMisses:\n\nLimited success on the field\n\nDespite the perceived financial stability and structural improvements, Highlanders have yet to translate these gains into major success on the pitch. The club has not won the league title since 2006, and fans are growing increasingly impatient as the wait for a championship continues. In 2024, Highlanders failed to retain the Independence Trophy, were knocked out of the Chibuku Super Cup via a boardroom decision, and finished sixth in the league.\n\nFifa ban after failing to pay former coaches outstanding salaries\n\nThe biggest failure that has marred his leadership was the Fifa ban on registering new players after they failed to pay their former coaches. What makes this a greater stain on his tenure is the manner in which he hid this from the clubs membership during their AGM. A question on everyones mind is how many skeletons in their closet were not revealed to its membership; what else is Mhlophe and his executive hiding?\n\nFailure to negotiate meaningful contracts with players\n\nHighlanders continue to lose players on free transfers due to poor contract negotiations. Under Mhlophe, Marvelous Chigumira, Godfrey Makaruse, Peter Muduhwa, Lynoth Chikuhwa, and several juniors left for free after their contracts expired. This costly mismanagement, despite a prior AGM resolution against it, forces the team to rebuild without transfer revenue.\n\nLack of a clear plan to help finance the club\n\nMhlophes corporate experience hasnt translated into success for Highlanders. The club remains financially unstable, reliant on handouts, and lacks a clear survival plan.Proactive leadership is absent; Mhlophe mainly reacts to problems.The long-promised mining venture offers little immediate hope.\n\nFailure to provide replica jerseys\n\nLast season, fans made do with purchasing replica jerseys from the streets. The club continuously promised that the replicas were coming in a few weeks right up to the last game. We are now in 2025, and no sign of the replicas. Mhlophe has no plan at all on how he will counter the sale of these replicas on the streets. All that the club provided were woollen hats and scarves, which ironically were released during the summer season.\n\nNo movement in the transfer market\n\nIt is clear to all that Highlanders need to boost its squad, but a few weeks before the season starts, there is little or no movement on the transfer market. Other teams are busy bolstering their squad, but Mhlophe and his team are just silent. We will just give them the benefit of the doubt; maybe they are preparing to unleash a secret weapon that will once again bring smiles to its legion of fans\n\nSibanda took over the reins of Highlanders Football Club in March 2021, after defeating Kenneth Mhlophe in a closely contested election. His tenure was marked by high expectations, as he campaigned on a platform of change, accountability, and financial stability for the club.\n\nHits:\n\nSecured Sakunda sponsorship\n\nSibanda secured a lucrative Sakunda sponsorship, providing US$420 000 for player salaries, US$60 000 each for sign-on fees and operational expenses, a potential US$200 000 league-winning bonus, and Ford Everest and Ranger vehicles for the coach and captain.\n\nAvailed replica jerseys for fans\n\nThrough sponsorship from Sakunda, replica shirts were available in three colours for Bosso fans to purchase.\n\nBrought in Brito\n\nSibanda hired foreign coach Baltemar Jos de Oliveira Brito, who nearly won the league, and brought in Joel Luphahla as assistant, with a succession plan. Luphahla later left, finding success at Dynamos and now coaching Simba Bhora.\n\nBaltemar Jose De Oliveira Brito\n\nRenovation of the Highlanders Clubhouse\n\nThe Highlanders Clubhouse had gone for years without any notable renovations; it was now an eyesore, with non-functioning toilets, broken furniture, and everything in a state of disrepair. However, Sibandas administration secured a partnership deal with local businessman Phathisani Nkomo to modernise the clubhouse. This has made it a popular venue for Bosso fans after matches.\n\nBrought some cup glory to Highlanders\n\nDuring his tenure, Sibanda saw the team win the Independence Cup in 2022 and 2023.\n\nRevenue generation through the selling of players\n\nHe sold Daniel Msendami and Nqobizitha Masuku to Jwaneng Galaxy, thereby generating much-needed revenue for the club.\n\nMisses\n\nFailure to strengthen the squad, despite interest from players like Kuda Mahachi and Bruce Kangwa, resulted in a goal drought (just 24 goals) and cost Highlanders the league title.The championship remained elusive.\n\nFailure to produce audited results\n\nHe failed to produce audited accounts for the 2023 AGM, something that had not happened at the club in years. This eroded the trust of potential sponsors.\n\nFailed to get the clubs mining project in Inyathi off the ground\n\nHighlanders Inyathi gold mine claim, awarded in 2020 by President Mnangagwa, saw little development under Sibanda, despite plans to use proceeds for facilities and junior teams.A designated mine manager made no progress.\n\nInternal Divisions\n\nSibandas leadership was also marred by internal divisions within the clubs structures. Reports of factionalism and disagreements with board members occasionally surfaced, undermining his ability to lead effectively\n\nUltimately, Highlanders remain in a rebuilding phase, and the true measure of any chairpersons success will be the clubs ability to reclaim its status as a dominant force in Zimbabwean football. Both leaders have contributed to the clubs journey in different ways, and their legacies will hinge on whether the foundation they have laid can lead to sustained success in the future.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/12/Highlanders-Chairman-Johnfat-Sibanda-563x380.jpg",
            "description": "Vusumuzi Dube, vusumuzi.dube@sundaynews.co.zw HIGHLANDERS, Bulawayo’s iconic football giants, are a year away from their centenary.   Hopes for a celebratory season were briefly dashed when Fifa slapped them with a transfer ban for unpaid wages to former coach Baltemar Brito and his assistant.   Brito was owed US$14,778 plus interest, and Torres US$11,788 plus interest, both […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "Minister lauds Second Republic’s vision for youth empowerment",
            "url": "https://www.chronicle.co.zw/minister-lauds-second-republics-vision-for-youth-empowerment/",
            "content": "Nqobile Tshili,[emailprotected]THE Ministry of Youth Empowerment, Development and Vocational Training has commended the Second Republic for its commitment to youth leadership, highlighting the appointment of young people to key positions in Government and advocating for local scholarships to nurture home-grown talent.\n\nUnder President Mnangagwas leadership, a significant number of young individuals have been appointed to Cabinet and parastatal boards.\n\nYouths follow proceedings at the National Youth Day celebration in Bulawayo\n\nCurrently, Zimbabwes Presidential Scholarship only supports students studying abroad.\n\nYouth Empowerment, Development and Vocational Training Minister Tino Machakaire praised President Mnangagwas youth empowerment initiatives, noting the National Youth Days theme,\n\nEmpower Youth; Secure the Future, aligns with national development goals.\n\nYour Excellency, we appreciate the initiatives in place to promote youth empowerment, as well as the appointment of young people to various boards and influential government positions. May I take this opportunity to recognise my fellow youthful ministers, said Minister Machakaire.\n\nAs part of your strategic innovations towards achieving Vision 2030, we recognise and celebrate the progress made in key areas for youth development. One remarkable step has been establishing Youth Focal Desks. We commend you, Your Excellency, for creating these desks, important points of contact for youth engagement. However, further optimisation is needed to ensure they function more efficiently and effectively, ultimately becoming more responsive to young peoples needs.\n\nMinister Machakaire acknowledged Zimbabwes youth potential but stressed the need for further empowerment. He said his ministry is modernising Vocational Training Centres (VTCs) to equip young people with practical skills for national development.\n\nHe lobbied for a local scholarship programme to support students lacking the financial means to attend tertiary institutions.\n\nYour Excellency, you will be pleased to know that, thanks to your support for underprivileged students in ZimFEP schools, 13 students from Binga, who benefited from this initiative, successfully completed secondary education and have applied for the 2025 Presidential Scholarship Scheme. While this is commendable, we acknowledge that not all deserving students can be accommodated under the Presidential Scholarship Scheme.\n\nBuilding on this success, we humbly propose, through your wisdom and guidance, that we also create scholarships for our local state universities. This initiative would resonate with your core principles of devolution and the commitment to ensuring that no one and no place is left behind.Minister Machakaire said the Ministry is also prioritising digital skills training for young people.\n\nIn todays digital age, digital literacy is crucial for empowering young people to access education, employment, and economic opportunities. The ministry continues to prioritise digital literacy and skills development, ensuring our young people are well-equipped to thrive in our increasingly interconnected world, he said.\n\nMinister Machakaire called for improvements to the Youth Empowerment Bank and suggested the Government prioritise employing graduates from the Youth Service Zimbabwe programme, which has trained over 1 000 young people since last year.\n\nWe wish for a policy prioritising the employment and placement in higher learning institutions of these graduates. Such a policy would ensure that our home-grown talents contributions are not only recognised but prioritised in driving our country forward. It is worth mentioning, Your Excellency, that our Youth Service in Zimbabwe graduates are qualified in several fields.\n\nGone are the days when it was assumed this programme was only for the uneducated. Under your astute leadership, Your Excellency, we have trained qualified graduates who are more than able and ready to serve their country, he said.\n\nHe commended First Lady Dr Auxillia Mnangagwa for initiating programmes addressing social ills like drug and substance abuse and gender-based violence among young people.@nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/dfiruru.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE Ministry of Youth Empowerment, Development and Vocational Training has commended the Second Republic for its commitment to youth leadership, highlighting the appointment of young people to key positions in Government and advocating for local scholarships to nurture home-grown talent. Under President Mnangagwa’s leadership, a significant number of young individuals have been […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "EuroFilmFestZW celebrates decade with focus on women in film",
            "url": "https://www.chronicle.co.zw/eurofilmfestzw-celebrates-decade-with-focus-on-women-in-film/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE European Film Festival-Zimbabwe (EuroFilmFestZW) is marking its 10th anniversary in style, with a celebration of women in film and a doubling of the prize money for its prestigious Bioskop Short Film Competition.\n\nThis years festival promises to be a landmark event, bridging cultures and championing the creative talents of female filmmakers.\n\nAlex Gwaze, Co-Curator and Co-Coordinator of EuroFilmFestZW, stressed the significance of this milestone.\n\nThe European Union is proud to announce the 10th anniversary of the European Film Festival Zimbabwe, a decade-long celebration of cinematic artistry. This years festival is especially significant as it honours the theme: Celebrating Women.\n\nThe festival has always showcased the best of European cinema while highlighting the talents of Zimbabwean and African filmmakers.This year, for the first time in several years, the festival will be held in May, coinciding with both Europe Day (May 9th) and Africa Day (May 25th).\n\nMovie lovers taking notes at a EuroFilmFestZW workshop\n\nThese dates hold historical importance, marking the anniversary of the Schuman Declaration, which paved the way for the European Union, and the formation of the Organisation of African Unity (OAU), now the African Union (AU).\n\nThis timing provides a perfect opportunity to foster a stronger cultural dialogue between Europe and Africa, right here in Zimbabwe. We invite audiences to celebrate not just cinema, but the arts, music, culture, and food that connect and inspire us all, Gwaze said.\n\nCompetition gongs\n\nTo recognise and encourage Zimbabwean filmmakers, the prize pool for the Bioskop Competition has been doubled from US$400 to US$800. This increase aims to further inspire creativity and participation, particularly among women.\n\nWhile we typically receive 50 to 60 entries each year, weve noticed a concerning trend: fewer entries from female filmmakers.The theme Celebrating Women is therefore a deliberate and passionate focus to amplify womens voices and stories, Gwaze said.\n\nThe Bioskop Short Film Competition invites filmmakers to explore the theme Celebrating Women, encouraging interpretations ranging from personal stories to historical tributes. Films that depict women challenging norms and inspiring change are particularly welcome.\n\nThe Bioskop Short Film Competition offers prizes in the following categories: Best Narrative Short (US$800), Best Documentary Short (US$800), Best Sound Editing (US$400), Best Cinematography (US$400), Best Diaspora Film (US$400), and Best Actor/Actress (US$400).\n\nMovie lovers enjoy film screenings\n\nThe competition is open to Zimbabwean residents, and those of Zimbabwean heritage living in any European or African country.\n\nFor a decade, the festival has been a launchpad for talented filmmakers, providing a platform to showcase their work and connect with industry professionals. The winning film receives a cash prize and is screened at EuroFilmFestZW.\n\nLast years winners included My Husband Joe by Derby Bheta (Best Narrative) and Chasing Levels by Dumie Manyathela (Best Documentary). The addition of the Best Actor/Actress category last year broadened the festivals scope and recognised on-screen talent.\n\nFilmmakers have until April 6 to submit their entries via FilmFreeway. The competition welcomes all genres, including animation, documentary, and live-action. Films will be judged on content and creativity, with a focus on innovation, regardless of the filmmakers resources.\n\nAsaph performs at one of the EuroFilmFestZW sessions\n\nAs EuroFilmFestZW celebrates its tenth anniversary, it aims to highlight womens contributions, not only in cinema but across all industries.\n\nThis festival is an opportunity to shine a spotlight on the remarkable women who inspire, break barriers, and redefine societal roles, both in front of and behind the camera, Gwazesaid.\n\nThis years festival also coincides with the ongoing Zimbabwe Film Strategy 2025-2030, launched by the National Arts Council of Zimbabwe (NACZ) last year, which provides a comprehensive analysis of the local film industry.  @MbuleloMpofu.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/cxgefdfd.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE European Film Festival-Zimbabwe (EuroFilmFestZW) is marking its 10th anniversary in style, with a celebration of women in film and a doubling of the prize money for its prestigious Bioskop Short Film Competition. This year’s festival promises to be a landmark event, bridging cultures and championing the creative talents of female filmmakers. Alex […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        },
        {
            "title": "US$1 220 missing: Headmaster faces forgery charges",
            "url": "https://www.chronicle.co.zw/us1-220-missing-headmaster-faces-forgery-charges/",
            "content": "Trish Mukwazo,[emailprotected]\n\nTHE headmaster of Sojini Secondary School in Mbembesi, Matabeleland North, Themba Nyoni, appeared in court on Thursday accused of forging documents to withdraw US$1 220 from school funds.\n\nNyoni (53), of Mbembesi, allegedly forged the signature of the school chairman, Arnold Nombembe, on a withdrawal slip and cashed the funds at Stanbic Bank.\n\nHe appeared before Bulawayo magistrate Beverly Madzikatire and was remanded out of custody until March 6 for continuation of trial.\n\nThe State called forensic expert Kurauone Madzivanyika, who testified that Nombembes signatures on the withdrawal slip were forged.\n\nProsecutor Sehliselo Khumalo told the court that Nyoni allegedly committed the offence on November 21, 2023, when he forged Nombembes signature.\n\nThe matter came to light when Nombembe discovered a withdrawal slip bearing his forged signature at the school bursars office.\n\nThe withdrawal slip was for US$1 220, Khumalo said.\n\nIn 2018, Nyoni was taken to court following accusations of bullying and publicly berating teachers, accusing them of being useless. He reportedly fell out with some subordinates because they refused to accept his draconian rules.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/06/Wooden-Gavel.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com THE headmaster of Sojini Secondary School in Mbembesi, Matabeleland North, Themba Nyoni, appeared in court on Thursday accused of forging documents to withdraw US$1 220 from school funds. Nyoni (53), of Mbembesi, allegedly forged the signature of the school chairman, Arnold Nombembe, on a withdrawal slip and cashed the funds at Stanbic Bank. […]",
            "time": "06:33",
            "date": "23 Feb 2025"
        }
    ]
}