{
    "news": [
        {
            "title": "Watch:Mzilikazi district wins NASH Bulawayo athletes competition.",
            "url": "https://www.chronicle.co.zw/watchmzilikazi-district-wins-nash-22bulawayo-athletes-competition/",
            "content": "Mzilikazi district athletes go into song and dance after winning the Nash Bulawayo province inter district track and field athletics competitions at White City Stadium. They clinched 39 gold medals, 32 silver and 28 bronze medals. Coming second was Reigate who got 22 gold, 27 silver and 19 bronze medals while Khami were third with 19 gold, 23 silver and 26 bronze medals respectively\n\n",
            "image_url": null,
            "description": "Mzilikazi district athletes go into song and dance after winning the Nash Bulawayo province inter district track and field athletics competitions at White City Stadium. They clinched 39 gold medals, 32 silver and 28 bronze medals. Coming second was Reigate who got 22 gold, 27 silver and 19 bronze medals while Khami were third with […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "POSB starts selling Belarus tractors, offers flexible terms for farmers",
            "url": "https://www.chronicle.co.zw/posb-starts-selling-belarus-tractors-offers-flexible-terms-for-farmers/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nPEOPLES Own Savings Bank (POSB), one of the banks selected by the Government to resell Belarus tractors to local farmers has announced that the tractors are now available for purchase through the bank.The tractors were secured by Zimbabwe through the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development as part of an initiative to enhance agricultural mechanisation and productivity across the country.To make the programme accessible to more farmers, POSB Zimbabwe, in partnership with the ministry, is offering flexible financing options.These include a three-year repayment period with no collateral required and an attractive interest rate of 7.5 percent per annum.The initiative aims to reduce the financial burden on farmers, enabling them to invest in essential machinery without undue stress.In a statement, POSB chief executive officer Mr Garainashe Changunda urged interested farmers to visit the banks service centres with their application documents to purchase the tractors.As part of our commitment to transforming livelihoods and fostering sustainable agricultural practices, POSB Zimbabwe is pleased to offer a range of tractors from Belarus, including 81 Hp, 107 Hp, 130 Hp, and 155 Hp models, he said.These tractors are designed to meet the diverse needs of farmers, ensuring they have the right tools to enhance their productivity and efficiency.This project aligns with our commitment to supporting the agricultural sector and empowering local farmers with the tools they need to succeed. By offering flexible financing options, we aim to make these tractors accessible to as many farmers as possible, ultimately contributing to the growth and sustainability of Zimbabwes agriculture.We are thrilled to partner with the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development as one of the resellers of the Belarus tractors to our local farmers, said Mr Changunda.He added that the tractors are available to individual farmers, registered agribusinesses, farming cooperatives, and irrigation schemes. Interested parties must meet specific criteria, including having a farmers account, providing a cover letter, security of tenure documents, a detailed project proposal, and a payment plan, among other requirements.The mechanisation of the agricultural sector plays a crucial role in driving the countrys agro-based economy forward.Zimbabwe aims to increase agricultures contribution to the gross domestic product (GDP) from the current 20 percent to 33 percent.The initiative is also expected to help farmers transition into middle-income groups, supporting the countrys vision of becoming an upper-middle-income economy by 2030.In 2018, President Mnangagwa engaged his Belarusian counterpart, President Alexander Lukashenko, to support the farm mechanisation programme through the supply of farm equipment and the training of local farmers in cultivation, seeding, irrigation, and crop harvesting.In February 2024, President Mnangagwa commissioned 1,635 tractors, 16 combine harvesters, and other farming equipment under the US$66 million Belarus Phase 2 Mechanisation Facility.The first phase of the facility had earlier delivered 474 tractors, 60 combine harvesters, 210 planters, and five low-bed trucks to farmers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/lplplp.jpg",
            "description": "  Nqobile Bhebhe,Nqobile.bhebhe@chronicle.co.zw PEOPLE’S Own Savings Bank (POSB), one of the banks selected by the Government to resell Belarus tractors to local farmers has announced that the tractors are now available for purchase through the bank. The tractors were secured by Zimbabwe through the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development as part […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Man jailed for five years for attempting to kill Good Samaritan",
            "url": "https://www.chronicle.co.zw/man-jailed-for-five-years-for-atte2mpting-to-kill-good-samaritan/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA 27-YEAR-OLD man from Stakeng Village in Beitbridge has been sentenced to five years in prison for attacking a 17-year-old boy who had intervened to stop him from fighting another villager.\n\nKhulekahani Dube was arrested after he assaulted the teenager at Malibeng Business Centre in February this year, striking him on the head with a tyre lever and causing near-fatal injuries.\n\nDube was convicted of attempted murder when he appeared before Beitbridge Regional Magistrate Ms Charity Maphosa on Thursday. The magistrate sentenced him to five years in jail but conditionally set aside two and a half years of the sentence, leaving Dube with an effective prison term of two and a half years.\n\nProsecutor Mr Willborught Muleya outlined the events leading to the attack. On February 7, Dube arrived at Malibeng Business Centre with the teenagers friend over an undisclosed issue. The confrontation escalated into a fistfight, which the teenager attempted to stop.\n\nAfter the altercation, the other man left the scene, leaving the complainant and Dube at the business centre. Later that day, as the teenager was walking home, Dube followed him and attacked him with a tyre lever as punishment for intervening in the fight.\n\nFollowing the assault, Dube fled the scene. The victim, who sustained three deep cuts to his head, was rushed to the hospital by his uncle, who subsequently reported the incident to the police. This led to Dubes arrest.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/09/Jail-bars.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A 27-YEAR-OLD man from Stakeng Village in Beitbridge has been sentenced to five years in prison for attacking a 17-year-old boy who had intervened to stop him from fighting another villager. Khulekahani Dube was arrested after he assaulted the teenager at Malibeng Business Centre in February this year, striking him on […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Zimbabwe School of Mines, Kamativi Mining Company Sign Scholarship MoU",
            "url": "https://www.chronicle.co.zw/zimbabwe-school-of-mines-kamativi-mining-company-sign-scholarship-mou/",
            "content": "Nqobile Bhebhe, Senior Business Writer\n\nThe Zimbabwe School of Mines and Kamativi Mining Company (KMC) on Friday signed a memorandum of understanding (MoU) resulting in the awarding of scholarships to eight students by the lithium mining company.\n\nThe beneficiaries were drawn from various departments, including Geology and Metallurgical Assay.\n\nWe are thrilled to partner with the China-Zimbabwe Friendship Scholarship Fund, a testament to the strong bilateral relations between our two nations. At Kamativi Mining Company, we believe that education is the cornerstone of community development, and were committed to empowering the next generation of mining professionals, said Kamativi Mining Company spokesperson Mr Dumisani Chihoto.\n\nHe added that through this scholarship program, they were proud to support eight talented students from the Zimbabwe School of Mines, providing them with a comprehensive scholarship package to cover their tuition fees.\n\nOur ultimate goal is to create a pipeline of skilled and knowledgeable professionals who can contribute to the growth and development of Zimbabwes mining sector.We look forward to a fruitful collaboration with the Zimbabwe School of Mines and to providing these students with a platform to gain practical experience and potentially launch their careers at Kamativi Mining Company, said Mr Chihoto.\n\nOne of the beneficiaries, Miss Antoinette Mutiwi, a third-year Metallurgical Assay student, highlighted how the scholarship empowers women in mining.\n\nI would like to acknowledge the representatives of Kamativi Mining Company for recognising us as women, as ladies, for including us in this beautiful opportunity.\n\nKamativi Mining is trying to push forward the women in mining, and as women, we do promise to do our best in the upcoming future and now, she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/dfghaeh.jpg",
            "description": "Nqobile Bhebhe, Senior Business Writer The Zimbabwe School of Mines and Kamativi Mining Company (KMC) on Friday signed a memorandum of understanding (MoU) resulting in the awarding of scholarships to eight students by the lithium mining company. The beneficiaries were drawn from various departments, including Geology and Metallurgical Assay. “We are thrilled to partner with […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "‘Prophet’ on the run after boy (10) dies from concoction to remove evil spirits",
            "url": "https://www.chronicle.co.zw/prophet-on-the-run-after-boy-10-dies-from-concoction-to-remove-evil-spirits/",
            "content": "Mkhululi Ncube,[emailprotected]\n\nA TSHOLOTSHO man who made a t10-year-old juvenile drink a deadly concoction in an attempt to cast out evil spirits leading is being sought by police.Matabeleland North Provincial Police spokesperson Inspector Glory Banda identified the suspect as Nkulumo Ncube (36) from Gariya Three village in Tsholotsho.Police in Tsholotsho, Matabeleland North Province are appealing for information which may lead to the arrest of Nkulumo Ncube of Office Ncube homestead Gariya Three Village Tsholotsho. The suspect is being sought in connection with a case of murder in which a male juvenile 10 years old died on the 21st of November 2024 at Office Ncube homestead.The suspect allegedly gave the victim an unknown concoction to cast out evil spirits. It is alleged that after taking the concoction, the victim became unconscious and died instantly, he said.After the incident, Ncube disappeared.Inspector Banda said anyone with information that may lead to the arrest of Ncube should report at their nearest police station.@mkhust\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2020/02/poisonous-concoction-f.jpg",
            "description": "Mkhululi Ncube,themkhust@gmail.com A TSHOLOTSHO man who made a t10-year-old juvenile drink a deadly concoction in an attempt to cast out evil spirits leading is being sought by police. Matabeleland North Provincial Police spokesperson Inspector Glory Banda identified the suspect as Nkulumo Ncube (36) from Gariya Three village in Tsholotsho. “Police in Tsholotsho, Matabeleland North Province […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Watch: Regent Chief Mabhikwa introduced to community",
            "url": "https://www.chronicle.co.zw/watch-regent-chief-mabhikwa-introduced-to-community/",
            "content": "Nqobile TshiliHUNDREDS have converged at the Chief Mabhikwa homestead in Jotsholo, Matabeleland North, where Zanele Khumalo is being introduced to the community as Regent Chief Mabhikwa.\n\nZanele will be regent chief for the coming nine years as successor to the Mabhikwa Chieftaincy. A nine-year-old, Wayne Makhosemvelo Khumalo, will only assume the position when he is 18 years old.Provincial Council of Chiefs chairperson Chief Siansali, is leading the traditional ceremony attended by officials from Government departments as well the community.This is the first time for the Mabhikwa chieftaincy to select a female to the position of a chief.Wayne Makhisemvelo Khumalo, who is the substantive chief, is the son of the late Vusumuzi Khumalo, who died in 2022 following a road crash along the Bulawayo-Victoria Falls Highway.Zanele, is the elder sister to the late chief.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/lkmjnb.jpg",
            "description": "Nqobile Tshili HUNDREDS have converged at the Chief Mabhikwa homestead in Jotsholo, Matabeleland North, where Zanele Khumalo is being introduced to the community as Regent Chief Mabhikwa. Zanele will be regent chief for the coming nine years as successor to the Mabhikwa Chieftaincy. A nine-year-old, Wayne Makhosemvelo Khumalo, will only assume the position when he […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Zimbabwe wildlife ranger killed by elephant during patrol",
            "url": "https://www.chronicle.co.zw/zimbabwe-wildlife-ranger-killed-by-elephant-during-patrol/",
            "content": "Online WriterTHE Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced the tragic death of 62-year-old ranger Josphat Mandishara, who was fatally injured by an elephant during a routine patrol in the Gatche-gatche area near Kariba.\n\nThe incident occurred on the evening of March 13, 2025, around 10 PM, while Ranger Mandishara was returning to the harbour where their boat was docked.He encountered a charging elephant that emerged unexpectedly, leading to his fatal injuries. Mandishara was accompanied by two fellow rangers and a Zimbabwe Republic Police (ZRP) detail at the time, but they were occupied elsewhere during the incident.\n\nMandisharas remains were transported to Kariba District Hospital for a post-mortem examination, and the incident has been reported to the police. In response, ZimParks has dispatched rangers from the Charara Safari Area to manage the problem animal.\n\nZimParks Director General, Professor Edson Gandiwa, expressed deep sorrow over the loss, extending condolences to Mandisharas family, friends, and colleagues.Mandishara is remembered for his dedication to wildlife conservation in Zimbabwe.\n\nZimParks has emphasised its commitment to staff and wildlife safety, vowing to implement measures to prevent such tragedies.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/09/elephants-..by-Chris-Fallows.jpg",
            "description": "Online Writer THE Zimbabwe Parks and Wildlife Management Authority (ZimParks) has announced the tragic death of 62-year-old ranger Josphat Mandishara, who was fatally injured by an elephant during a routine patrol in the Gatche-gatche area near Kariba. The incident occurred on the evening of March 13, 2025, around 10 PM, while Ranger Mandishara was returning […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "“Push art before finances, the money will follow”: Asaph Afrika tells creatives",
            "url": "https://www.chronicle.co.zw/push-art-before-finances-the-money-will-follow-asaph-afrika-tells-creatives/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nDay One of the Artistes Creative Entrepreneurship project boot camp at Eveline High School kicked off on Thursday with a dynamic start, as 40 creatives gained invaluable insights from seasoned professionals  author Philani Amadeus Nyoni, arts administrator Raisedon Baya, and rapper Asaph Afrika.\n\nAsaph Afrika addressing artistes at the Artists Creative Entrepreneurship programme\n\nThe trio shared their experiences in the arts sector, reflecting on their journeys and encouraging the young cohort to remain resilient in their creative pursuits.\n\nNyoni said the artistes must learn to, Create as an artiste and sell as a businessman in order to see the light of day in the arts business. Dont just create for emotional release but have a specific reason why you are creating and that will be your fuel everyday.\n\nHe further challenged the artistes to keep on practising until they get it right.\n\nWork on your craft for at least two hours a day for the next five years and you will see tremendous changes and improvement in it. That will sustain you and make you a professional in whatever field you are in, he said.\n\nGuest facilitators Asaph Afrika and Raisedon Baya also hammered on the importance of identity. Baya, with 36 years under his belt shared how being resilient in art has made him the person he is today.\n\nIm a product of patience and perseverance. Back in the day, art was seen just as a pastime and it wasnt easy convincing parents that this was a path I would want to walk on for the rest of my life. To me, it hasnt always been about money but the love of art.\n\nHe also encouraged artistes to embrace education.\n\nTheres nothing sorry more than a shallow artiste. Lets take education seriously. Lets read wider, consume a lot of what we are about. If you are a writer, read more, if you are a singer, practice more and know yourself and know where you want to go. Be motivated to go on and ask yourself why you are doing what you are doing, he said.\n\nAsaph Afrika spoke of the magical four Ms in art: Money, message, music, mentality.\n\nTo me, art is about these Ms and what one is about. Im more on mentality more than anything but each one of us chooses which M they want to major at. Mentality brings out the message in my music I invest more on it because that defines who I am and what I produce. Also, we need to push art before finances, money will come as long as you have something going on. Just keep producing and those who are supposed to see will see, he said.\n\nThe bootcamp is set to continue and end on Saturday afternoon where the creatives will checkout from the Eveline High School premises.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/pokilkjuj.jpg",
            "description": "Mbulelo Mpofu,mbulelo.smpofu@gmail.com Day One of the Artistes Creative Entrepreneurship project boot camp at Eveline High School kicked off on Thursday with a dynamic start, as 40 creatives gained invaluable insights from seasoned professionals – author Philani Amadeus Nyoni, arts administrator Raisedon Baya, and rapper Asaph Afrika. The trio shared their experiences in the arts sector, […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "UK-based musician on overcoming depression and finding healing through music",
            "url": "https://www.chronicle.co.zw/uk-based-musician-on-overcoming-depression-and-finding-healing-through-music/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nUnited Kingdom-based musician Arthur Ncube, popularly known as Ar Mulah, is a Zimbabwean-born artiste with a deep passion for hip-hop and Afro-pop.\n\nHis love for music began 16 years ago at Mzingwane High School, and his artistic focus extends beyond being a performer  he is also a music engineer.\n\nAr Mulah said being surrounded by accomplished individuals in the music industry motivated him to pursue music professionally.\n\nMy passion for music started when I was young and living in South Africa. My parents would host gatherings and invite influential artistes, including the legendary Brenda Fassie.\n\nI pursued my music career when we moved to the UK, where I had the opportunity to collaborate with amazing artistes and DJs such as Charlie Sloth and Paigey Cakey. My catalogue includes singles like Manga Manga Business, Millionaire, and I Want You featuring Paigey Cakey, said Ar Mulah.\n\nThe budding artiste has been involved in several productions in the UK.\n\nIve been involved in music production, working on mixtapes and albums for various UK artistes, including Giggs when he collaborated with Nottingham artistes Landlordz and Joey P on the Narm to Nottz project. Ive also worked with Jah Digga and 2Tone Mr Socko.\n\nAfter taking a brief hiatus, he is now gearing up to release his debut album before the end of the year, which will feature rap superstar Awa Khiwe.\n\nWhile Ive mostly released singles, Im finally dropping my first album this December, and it includes a track with Awa Khiwe, he said.\n\nReflecting on his journey, Ar Mulah opened up about the personal tragedies that forced him to step away from music temporarily.\n\nAfter my mother passed away from breast cancer and my younger brother took his own life, I had to take a break from music to deal with the trauma and my mental health. However, through this painful experience, God blessed me with two beautiful children, and they have been my inspiration to turn my life around, he said.\n\nLooking ahead, Ar Mulah is planning to establish a record label in Bulawayo, the City of Kings and Queens.\n\nMy ultimate goal is to be a philanthropist  to sponsor and equip creatives with music, video, and podcasting equipment as my contribution to Bulawayos music scene.\n\nIm also deeply involved in community initiatives, helping young people leave a life of crime by focusing on music and the arts. Additionally, I support individuals struggling with depression and trauma, as I once did, said Ar Mulah.  Follow on X: @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/thanda.jpg",
            "description": "  Mthabisi Tshuma,revmmthiretshuma@gmail.com United Kingdom-based musician Arthur Ncube, popularly known as Ar Mulah, is a Zimbabwean-born artiste with a deep passion for hip-hop and Afro-pop. His love for music began 16 years ago at Mzingwane High School, and his artistic focus extends beyond being a performer – he is also a music engineer. Ar Mulah […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        },
        {
            "title": "Bosso captaincy a motivation: Mbeba",
            "url": "https://www.chronicle.co.zw/bosso-captaincy-a-motivation-mbeba-2/",
            "content": "Brandon[emailprotected]THE 2025 Castle Lager Premier Soccer League started with some leadership changes at Highlanders with defender Andrew Mbeba  one of the senior players at the club  taking over the captaincy.With Ariel Sibanda not getting game time and Peter Muduhwa having joined the newly promoted Scottland ahead of the start of the new season, Mbeba was entrusted by the Kelvin Kaindu led Bosso technical team to be the leader on the pitch.This is something which he is not taking likely as it is a dream for many to captain one of Zimbabwes most iconic football clubs.Speaking ahead of their away trip to Greenfuel tomorrow, Mbeba said his new role is a motivating factor in his game. With the armband and the support of his teammates, Mbeba said his aim is to help the black and white army achieve its goals, with team work remaining the core value.In the two games that he has captained, he hasnt felt any pressure.Its just a role that I am playing, which I have been given by the coaches on the field of play. All I want is for the team to achieve its goals. Its not about being the captain; its about teamwork and working hard as a team.There is no pressure, it has actually motivated me to greater heights. Being a captain for a big club in Zimbabwe is a big motivation, said Mbeba.Highlanders got their new campaign to a mixed start as they won one and lost one in their opening two matches. Bosso were handed a narrow 1-0 defeat by Premiership newboys MWOS FC in the opening game of the season.On Sunday, playing in front of their vociferous fans at Barbourfields Stadium, the Bulawayo giants made light work of Kwekwe United, trouncing them 4-0 courtesy of a Brighton Maninja Ncube hattrick, the first of the season.Melikhaya Ncube also added one to the scoresheet. @brandon_malvin\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Untitled-4-7.jpg",
            "description": "Brandon MoyoBrandonmalvin9@gmail.com THE 2025 Castle Lager Premier Soccer League started with some leadership changes at Highlanders with defender Andrew Mbeba – one of the senior players at the club – taking over the captaincy. With Ariel Sibanda not getting game time and Peter Muduhwa having joined the newly promoted Scottland ahead of the start of […]",
            "time": "18:41",
            "date": "14 Mar 2025"
        }
    ]
}