{
    "news": [
        {
            "title": "ZIMURA partners with ACRCloud to enhance broadcast monitoring services",
            "url": "https://www.chronicle.co.zw/zimura-partners-with-acrcloud-to-enhance-broadcast-monitoring-services/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nMUSIC royalty collection company, Zimbabwe Music Rights Association (Zimura) has partnered with ACRCloud to enhance broadcastmonitoring services.\n\nIn a recent social media post, Zimura wrote, We are proud to announce that the Zimbabwe Music Rights Association (ZIMURA) has partnered with ACRCloud, a leading global provider of music recognition technology, to enhance the way we track music airplay in Zimbabwe.\n\nThis partnership will provide real-time, detailed data on music played across radio stations in the country, including song titles, artists, and ISRC codes. Building on our prior collaboration with Wordl Intellectual Property Organisation (WIPO) Connect, we are now able to offer even more accurate and efficient royalty distribution services to our members, read the post.\n\nACRCloud is an automatic content recognition platform based on acoustic fingerprint technology to help media, broadcasters to identify, monitor and monetise content.\n\nIn todays digital landscape, accurate and efficient broadcast monitoring has become paramount for royalty collection companies.\n\nAs the music industry continues to evolve, the need for precise tracking and monitoring of broadcasted content has never been more pressing.\n\nBy enhancing their broadcast monitoring services, royalty collection companies can ensure that rights holders receive fair compensation for their work.\n\nThis not only promotes transparency and accountability but also fosters a healthier music ecosystem.\n\nFurthermore, advanced broadcast monitoring capabilities enable royalty collection companies to provide more detailed and reliable data to their clients, ultimately strengthening their relationships and reputation.\n\nThrough this collaboration, ZIMURA is confident that it will now be able to automatically identify songs played on radio, track play counts, and monitor airplay durations in real time. The integration with WIPO provides us with the tools needed to manage music rights effectively, while ACRClouds Broadcast Monitoring Service ensures that every song played on Zimbabwean radio is properly accounted for. This means more reliable and transparent royalty distribution for our composers, performers, and publishers.\n\nThis partnership with ACRCloud, supported by WIPO Connect, marks a pivotal step in transforming Zimbabwes music industry.\n\nBy replacing outdated manual tracking systems with automated and Al-powered tools, Zimura will be able to minimise errors, reduce administrative workload, and ensure our members receive fair compensation for their work. Together, were setting the stage for a more efficient, transparent, and globally competitive music ecosystem in Zimbabwe.\n\nFor over four decades, Zimura has been collecting royalties for those involved in the music business.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ftjut.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com MUSIC royalty collection company, Zimbabwe Music Rights Association (Zimura) has partnered with ACRCloud to enhance broadcast monitoring services. In a recent social media post, Zimura wrote, “We are proud to announce that the Zimbabwe Music Rights Association (ZIMURA) has partnered with ACRCloud, a leading global provider of music recognition technology, to enhance […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Insimbi ZeZhwane makes history: First rhumba video to hit 1 million YouTube views",
            "url": "https://www.chronicle.co.zw/insimbi-zezhwane-makes-history-first-rhumba-video-to-hit-1-million-youtube-views/",
            "content": "Mkhulululi Ncube,[emailprotected]\n\nINSIMBI ZeZhwane has made history in the Rhumba music category by becoming the first band to achieve one million views for a video on YouTube, albeit two years after the video was posted.\n\nThe video features the single track Imbulumakhasane, which was released in 2022. This milestone comes after the tragic loss of the bands beloved lead guitarist and vocalist, Elvis MaEli Mathe, who died in a road accident along the Bulawayo-Victoria Falls Road in August 2023.\n\nThe single was widely praised by fans for its clear vocals, a contrast to some of the bands previous songs where listeners had struggled to decipher the lyrics.\n\nBrema, a member of the band, expressed his elation at the achievement, stating, I am overjoyed by the achievement and would like to thank all who made this possible, especially the fans who watched the video online. We plead for more support so that we can continue to grow and reach even bigger numbers.\n\nCruz Moyo of Ezakithi TV, who shot the video, described the milestone as a pleasant surprise. He also shared some behind-the-scenes details about the making of the video, which was filmed in South Africa.\n\nThat was not the best video we could have done due to a number of reasons. The first problem we had was that the guys announced the release date before the video was even shot. So, we had to rush in many ways as we did not have enough time to execute the job properly. When they engaged me, they later disappeared and only returned a month before the release date. I told them I could not do the job and directed them to someone else, Cruz explained.\n\nThey went away, and two weeks later, they phoned me and said, Ndoda siphansi eflatini, let us go and shoot the video. They did not want to take no for an answer, so we did it under immense pressure due to time limitations, he added.\n\nCruz noted that Rhumba artists often make the mistake of setting album release dates well in advance, which creates unnecessary pressure when circumstances change.\n\nHe praised the bands professionalism during the production, although he revealed that the late MaEli struggled with one particular scene, which took longer to shoot.\n\nUnfortunately, my hard drive crashed; it would have been a good time to show how everything happened. In the video, there is a part where people are reversing. We spent a lot of time shooting that aspect with a green screen, but MaEli struggled to execute the part we wanted, and we had to let it go. On set, everything was perfect, and the cooperation was good, save for a moment or two where I felt Janisto, due to his seniority among the other guys, wanted more limelight. But we handled the matter, Cruz said.\n\nHe also highlighted the financial challenges faced during the production, as the band did not receive external support for the video and had to work with limited resources.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/lkmnbhjb-680x380.jpg",
            "description": "Mkhulululi Ncube, themkhust@gmail.com INSIMBI ZeZhwane has made history in the Rhumba music category by becoming the first band to achieve one million views for a video on YouTube, albeit two years after the video was posted. The video features the single track Imbulumakhasane, which was released in 2022. This milestone comes after the tragic loss […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "President Mnangagwa honours Sam Nujoma as a Pan-African icon, calls for continued liberation legacy at Namibian Hero’s burial",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-honours-sam-nujoma-as-a-pan-african-icon-calls-for-continued-liberation-legacy-at-namibian-heros-burial/",
            "content": "Online Writer\n\nWINDHOEK, NAMIBIA  In a solemn and stirring address at the burial of Namibias founding President, Dr Sam Nujoma, Zimbabwean President Emmerson Mnangagwa today paid tribute to the late liberation stalwart, describing him as a visionary leader whose legacy transcends borders and generations.\n\nSpeaking as the Chairperson of the Southern African Development Community (SADC), President Mnangagwa rallied the region and the continent to uphold Nujomas values of selflessness, integrity, and Pan-Africanism.\n\nAmid thunderous applause from a grieving yet resolute audience, President Mnangagwa rose to deliver his eulogy, reflecting on Nujomas immense contributions to Namibias independence and his unwavering commitment to Africas liberation. Today, we gather in profound grief and sorrow to honour the legacy of a liberation stalwart and founding father, President Mnangagwa began, his voice echoing across the sombre gathering.\n\nHe said Nujomas vision for freedom extended beyond political independence to the economic emancipation of the people.\n\nDr Nujoma understood that true independence was not merely about political freedom but also about the economic liberation of the masses, the President said.\n\nHe showed us that leadership is not about power but service to the people with integrity, honour, and sacrifice.\n\nPresident Mnangagwa hailed Nujoma as a true Pan-Africanist whose influence inspired liberation movements across the continent.\n\nHis vision for freedom transcended borders, igniting the flames of resistance and hope in the hearts of many beyond Namibia, he said.\n\nThe Zimbabwean leader also underscored the collective loss felt by the SADC region, Africa, and the world at large. The passing of Dr Nujoma is not only a loss to Namibia but to SADC, Africa, and the rest of the world. His sacrifices will remain etched in our memory for posterity, President Mnangagwa said.\n\nIn a call to action, Mnangagwa challenged the SADC region and the African continent to entrench Nujomas values by ensuring a brighter future for the younger generation.\n\nWe must, in solidarity, build an Africa that would make Dr Nujoma and all our forebears proud, he said.\n\nLet us honour him by ensuring that the young generation inherits a continent of opportunity, unity, and prosperity.\n\nMnangagwa concluded his address by affirming that Nujomas legacy would endure as a beacon for future generations. The works of Dr Nujoma will be written in the annals of history. May he rest in peace, he said, drawing a solemn close to his tribute.\n\nDr Sam Nujoma, who passed away at the age of 95, was Namibias first president and a towering figure in the countrys struggle for independence from South African apartheid rule. His burial marks the end of an era for Namibia and the broader African liberation movement, but his legacy, as Mnangagwa emphasized, will continue to inspire the pursuit of a united and prosperous Africa.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/kmlo.jpg",
            "description": "  Online Writer WINDHOEK, NAMIBIA – In a solemn and stirring address at the burial of Namibia’s founding President, Dr Sam Nujoma, Zimbabwean President Emmerson Mnangagwa today paid tribute to the late liberation stalwart, describing him as a visionary leader whose legacy transcends borders and generations. Speaking as the Chairperson of the Southern African Development […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Chitepo School of Ideology Not a Zanu-PF Project, Says Minister",
            "url": "https://www.chronicle.co.zw/chitepo-school-of-ideology-not-a-zanu-pf-project-says-minister/",
            "content": "By Sikhumbuzo Moyo,[emailprotected]\n\nTHE Herbert Chitepo School of Ideology is not a Zanu-PF project, as alleged by anti-government forces, but a national institution, Local Government and Public Works Minister Daniel Garwe has said.\n\nMinister Garwe stated that the school is driving a national ideological programme as guided by President Mnangagwa and is not affiliated with any political party.\n\nIdeology has no political face but carries a national identitythat of Zimbabwe. It is important to understand that this is a national programme, not a Zanu-PF project, as has been falsely claimed, said Minister Garwe.\n\nHe added that his ministry would soon be working with various state universities to advance different agendas related to local governance.\n\nChitepo School of Ideology is an institution designed to foster national consciousness and prioritise national interests above all else.\n\nIt is one of several such institutions in the region, established by revolutionary movements, with the objective of instilling the spirit of revolution in the youth and the population at large. The Mwalimu Julius Nyerere Leadership School in Tanzania serves as the headquarters for all former liberation movements in Southern Africa\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/Cde-Daniel-Garwe-copy.jpg",
            "description": "By Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Herbert Chitepo School of Ideology is not a Zanu-PF project, as alleged by anti-government forces, but a national institution, Local Government and Public Works Minister Daniel Garwe has said. Minister Garwe stated that the school is driving a national ideological programme as guided by President Mnangagwa and is not affiliated […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Presidential hopeful and Pastor Langton Towungana in adultery and maintenance scandal",
            "url": "https://www.chronicle.co.zw/presidential-hopeful-and-pastor-langton-towungana-in-adultery-and-maintenance-scandal/",
            "content": "Online WriterPRESIDENTIAL hopeful and pastor, Mr Langton Towungana from Victoria Falls, who contested the 2018 presidential elections as an independent candidate, has been caught in an adultery and maintenance scandal after fathering two children with a married woman from his church.\n\nMr Towungana has two children, aged six and two years, with Ms Nkazimulo Sibanda, with whom he had an extramarital affair while she was married to Mr Khawulani Ncube. Ms Sibanda and Mr Ncube had been married for several years but were childless. They sought prayers and counselling from Mr Towungana, who allegedly told Ms Sibanda that her husband was incapable of impregnating her. He then proposed a romantic relationship, leading to a sexual affair between them.\n\nAfter the birth of the two children, Mr Towungana later abandoned Ms Sibanda, citing concerns over his image as a pastor. Ms Sibanda then approached the maintenance court, which issued a default judgment against Mr Towungana after he failed to appear in court. The Victoria Falls Magistrates Court ordered him to pay US$300 per month in maintenance for the two children, starting from 31 December 2024. The payments were to be deposited into Ms Sibandas EcoCash account until the children turn 18 or until the order is reviewed or discharged by a competent court.\n\nThrough his lawyer, Mr Elvis Mashindi of Mashindi and Associates, Mr Towungana applied for a rescission of the judgment, arguing that the children were legally not his, as their birth certificates bore Mr Khawulani Ncubes name, making him the legal father.\n\nIn her court submission, Ms Sibanda stated that Mr Towungana was her pastor and that they attended the same church. She explained how he misled her into destroying her marriage before later abandoning her.\n\nAt the time I got to know him, my husband and I had a problem, and we sought prayers. We had been together for eight years when we started attending his church. After my husband left me, Mr Towungana invited me for counselling and told me my husband had a fertility issue, which was why we had no children.\n\nHe proposed a relationship and slept with me. I got pregnant, and when I informed him, he said he already knew my husband had a problem and assured me he would give me children. We agreed to keep silent for five years to protect his dignity as a pastor, and during that time, I got pregnant again, said Ms Sibanda.\n\nShe further stated that for four years, her first child did not have a birth certificate. When she sought Mr Towunganas advice, he instructed her to register the child using her husbands name. He allegedly promised to marry her and even offered to pay off her husband.\n\nI moved out of Khawulanis house in August 2024. I told Mr Towungana that I was afraid my husband would eventually discover the truth and harm me. He advised me to relocate to the rural areas, promising to follow later.\n\nHowever, he later told me he had engaged a lawyer and would no longer communicate with me. I then approached the court for maintenance, and an order was granted. He paid for one month before applying for a rescission order, said Ms Sibanda.\n\nThrough his lawyer, Mr Towungana argued that Ms Sibanda had committed a criminal offence by lying to the Registrar under Section 27 of the Births and Deaths Registration Act. He sought to have the maintenance order overturned under Order 30 of the Magistrates Court Rules 2019.\n\nHowever, the court dismissed his application for rescission, stating that the case highlighted Mr Towunganas lack of moral integrity as a pastor. The magistrate noted that Mr Towungana was accused of a serious case of adultery with a married congregant, resulting in two children who were now the subject of the maintenance dispute.\n\nThe application is dismissed. However, since the applicant is denying paternity, the maintenance order will remain in place in the interim to ensure the children are not unduly prejudiced pending the outcome of paternity tests. These tests must be conducted within three months, ruled the magistrate.\n\nThe case is set to return to court on 7 May.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Online Writer PRESIDENTIAL hopeful and pastor, Mr Langton Towungana from Victoria Falls, who contested the 2018 presidential elections as an independent candidate, has been caught in an adultery and maintenance scandal after fathering two children with a married woman from his church. Mr Towungana has two children, aged six and two years, with Ms Nkazimulo […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Dr Nujoma son reflects on his father’s legacy",
            "url": "https://www.chronicle.co.zw/dr-nujoma-son-reflects-on-his-fathers-legacy/",
            "content": "Online Reporter\n\nThe late Dr Sam Nujomas eldest child, Unoti Nujoma, who also serves as Namibias Minister of Labour, Industrial Relations and Employment Creation, described his fathers legacy, as one of unity- not just within Namibia but across the African continent.Minister Nujoma shared poignant memories of his father, recounting how he was just eight years old when Dr Nujoma made the life-altering decision to go into exile in 1959.This decision marked the beginning of a decades-long journey toward Namibias independence, a path fraught with hardship, but driven by an unyielding commitment to the liberation of his people.He says his father died 15 minutes before midnight on February 8, surrounded by his family and loved ones.Dr Nujoma, he says, left a legacy of unity in the country and region, hence the playing of the Namibian and African Union anthems at the ceremony.In honoring him, let us remember his legacy of selflessness and the unity he brought among Namibians that had been fragmented by the colonialists He thanks President Dr Nangolo Mbumba for according his father a State funeral and National Hero StatusMinister Nujoma also thanks countries and organizations that gave Dr Nujoma all forms of support leading to Namibias liberation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hynyn.jpg",
            "description": "Online Reporter The late Dr Sam Nujoma’s eldest child, Unoti Nujoma, who also serves as Namibia’s Minister of Labour, Industrial Relations and Employment Creation, described his father’s legacy, as one of unity- not just within Namibia but across the African continent. Minister Nujoma shared poignant memories of his father, recounting how he was just eight […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Milton Junior School unveils new prefects",
            "url": "https://www.chronicle.co.zw/milton-junior-school-unveils-new-prefects/",
            "content": "Online writer\n\nTODAY Milton Junior School in Bulawayo unveiled new prefects selected from Grades six and seven.\n\nThe momentous event took place at the school hall.\n\nBeing a prefect holds significant importance in the development of a child.\n\nIt is a significant responsibility that shapes a pupils character while preparing them for leadership roles in the future. A prefect is a role model who upholds school values, ensures discipline, and helps maintain order within the school community.\n\nThe duties of a prefect vary but often include assisting teachers in enforcing school rules, guiding younger learners, and ensuring a safe and respectful learning environment. Prefects may also represent their peers, voice student concerns to the administration, and help organise school events. These responsibilities require dedication, fairness, and excellent communication skills.\n\nSome of the pupils who were appointed prefects at Milton junior school pose for a picture with their teachers Mr Rambo and Mrs Mangena\n\nServing as a prefect builds essential character traits such as confidence, responsibility, and resilience. Prefects must lead by example, demonstrating honesty, discipline, and respect. They develop problem-solving skills by handling conflicts among students and ensuring rules are followed. This experience enhances their ability to make sound decisions under pressure, a skill that is valuable in both academic and professional life.\n\nAdditionally, being a prefect teaches teamwork and cooperation. Prefects work closely with teachers and fellow prefects to ensure the smooth running of the school. They learn how to balance authority with approachability, ensuring they are respected yet approachable leaders.\n\nThe role of a school prefect is not just about enforcing rulesit is about fostering a positive school environment and developing leadership qualities. The experience shapes students into responsible and confident individuals, preparing them for future leadership roles both within and beyond school.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ghjyiyuo.jpg",
            "description": "Online writer TODAY Milton Junior School in Bulawayo unveiled new prefects selected from Grades six and seven. The momentous event took place at the school hall. Being a prefect holds significant importance in the development of a child. It is a significant responsibility that shapes a pupil’s character while preparing them for leadership roles in […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Watch: Minister of Information Praises 3Ktv’s role in media liberalisation at 3rd anniversary celebration",
            "url": "https://www.chronicle.co.zw/watch-minister-of-information-praises-3ktvs-role-in-media-liberalisation-at-3rd-anniversary-celebration/",
            "content": "Online WriterHARARE, Zimbabwe  Today, Dr. Jenfan Muswere, the Minister of Information, Publicity and Broadcasting Services, attended the 3rd anniversary celebration of 3Ktv in Harare as the Guest of Honour.During his keynote address, Dr. Muswere emphasised the Governments ongoing commitment to liberalising the nations airwaves, a key initiative under President Emmerson Mnangagwas administration.Reflecting on the progress made since the establishment of the Second Republic, Dr. Muswere highlighted the significance of 3Ktvs contributions to the media landscape, noting that the anniversary represents a milestone in the opening up of broadcasting in Zimbabwe. He said: As we celebrate 3Ktvs 3rd anniversary, it is an opportunity for us to record and register some of the success stories in terms of the opening up of the airwaves by the new dispensation.\n\nThe Ministers remarks come amid broader discussions regarding media freedom and the governments efforts to improve the broadcasting sector, with 3Ktv being a notable example of these advancements.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jmajmajamajm.jpg",
            "description": "Online Writer HARARE, Zimbabwe – Today, Dr. Jenfan Muswere, the Minister of Information, Publicity and Broadcasting Services, attended the 3rd anniversary celebration of 3Ktv in Harare as the Guest of Honour. During his keynote address, Dr. Muswere emphasised the Government’s ongoing commitment to liberalising the nation’s airwaves, a key initiative under President Emmerson Mnangagwa’s administration. […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Zimbabwe to host 34th Zimbabwe-Zambia Joint Permanent Commission on Defence and Security",
            "url": "https://www.chronicle.co.zw/zimbabwe-to-host-34th-zimbabwe-zambia-joint-permanent-commission-on-defence-and-security/",
            "content": "Leonard Ncube Online Reporter\n\nZIMBABWE will host the 34th Session of the Zimbabwe-Zambia Joint Permanent Commission on Defence and Security in Victoria Falls this weekend.Delegates are expected to arrive on Friday, ahead of a welcome dinner in the evening, with official proceedings set to commence on Saturday morning.The Zimbabwe Defence Forces is hosting the event, which will begin with the official opening of the officials meeting on Saturday morning, followed by committee meetings.The commission comprises three committees: Defence, State Security, and Public Security.On Sunday morning, a senior officials meeting will take place, during which all three committees will present their reports for consideration and adoption. This will be followed by the closing ceremony for the officials meeting and the subsequent Ministers meeting.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2022/08/Untitled-1-copy-141.jpg",
            "description": "Leonard Ncube Online Reporter ZIMBABWE will host the 34th Session of the Zimbabwe-Zambia Joint Permanent Commission on Defence and Security in Victoria Falls this weekend. Delegates are expected to arrive on Friday, ahead of a welcome dinner in the evening, with official proceedings set to commence on Saturday morning. The Zimbabwe Defence Forces is hosting […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        },
        {
            "title": "Young entrepreneurs in Southern Africa struggle with funding gaps",
            "url": "https://www.chronicle.co.zw/young-entrepreneurs-in-southern-africa-struggle-with-funding-gaps/",
            "content": "Leonard Ncube and Leonorah NcubeYOUNG people from across Southern Africa have expressed concern over a financing gap for businesses, as financial institutions remain reluctant to fund start-ups.Speaking during a panel discussion on financing entrepreneurship at the ongoing SADC-United States Exchange Alumni Summit in Victoria Falls yesterday, participantsdrawn from entrepreneurial and fellowship programmes as well as civic society in 10 SADC countriesagreed that securing funding for new businesses remains a significant challenge.More than 200 young people from 10 SADC countries are attending the summit, which began on Wednesday and ends today.Held under the theme Regional Alumni Connections: Advancing Sustainable Solutions to Global Challenges, the summit aims to strengthen business ties, foster collaboration, and explore new growth opportunities in the region.The USA Alumni Summit is a gathering of alumni from the US Department of State programmes, with the overarching goal of capacitating and empowering the next generation of African leaders.The panellists included Mr Patrick Maseko, an executive head of innovation at ZB Financial Holdings; Ms Tadala Peggy Chinkwezule, a lawyer from Malawi; and Ms Thabo Joy Masiye, an enterprise developer from Zambia. The discussion was moderated by Mr Aylwin Chiyoka, a financial services leader from NMBZ Bank.The panellists emphasised the need for entrepreneurs to bridge the financing gap by identifying alternative and blended funding sources.There is a disconnect between banks and what small and medium enterprises (SMEs) are looking for. Banks prioritise market validation, meaning they want to know how they will recover their money. They also look at governancehow a business is structuredgrowth, scalability, and whether lending institutions will see a return on their investment, said Ms Masiye.She added that entrepreneurship is about innovation, and businesses should remain resilient even if they struggle to attract funding. Ms Masiye encouraged SMEs to explore microfinancing, blended financing, and networking to connect with potential funders.Mr Maseko urged small business owners to embrace financial literacy, highlighting that one of the major obstacles for start-ups is the requirement for three years financial statements before banks will consider providing funding.It is difficult to convince a bank to lend without meeting their requirements, so there is a need for financial education and collaboration among start-ups. Financial institutions are also increasingly focusing on financing agriculture, especially by providing insurance for small-scale farmers, he said.According to the World Bank, around 70 percent of SMEs lack financial backing, underscoring the need to close the funding gap, particularly in under-served communities.Ms Chinkwezule noted that in Malawi, only 40 percent of SMEs contribute to the Gross Domestic Product, with the major challenges being lack of access to finance and capacity building.To secure more funding, we need to move and develop faster. SMEs and businesses must be investor-ready and also seek alternative funding sources, she said.The panellists called on SMEs to invest in training, collaborations, reading, and mentorship to expand their networks.Participants urged banks to provide SMEs with contracts for service provision and to create more funding opportunities. They also appealed to the Alumni Association to establish a cross-border trading platform to enable young entrepreneurs to collaborate and market Southern Africas economic potential.Mr Burzil, an expert from South Africa, reiterated the need for entrepreneurs to develop well-structured businesses.We need to equip entrepreneurs with the skills to run proper businesses. There is a gap in the market, but the real question is whether there is a market in that gap. Businesses need to create value first before investors believe in them, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/kmimjm.jpg",
            "description": "Leonard Ncube and Leonorah Ncube YOUNG people from across Southern Africa have expressed concern over a financing gap for businesses, as financial institutions remain reluctant to fund start-ups. Speaking during a panel discussion on financing entrepreneurship at the ongoing SADC-United States Exchange Alumni Summit in Victoria Falls yesterday, participants—drawn from entrepreneurial and fellowship programmes as […]",
            "time": "18:41",
            "date": "28 Feb 2025"
        }
    ]
}