{
    "news": [
        {
            "title": "Rajshahi’s overseas players stuck in Dhaka hotel over BPL payment issues",
            "url": "https://www.chronicle.co.zw/rajshahis-overseas-players-stuck-in-dhaka-hotel-over-bpl-payment-issues/",
            "content": "The team owner and management havent responded to the players calls for updates as they await tickets for flights back home.Ryan Burl is among a group of overseas players waiting for the Durbar Rajashahi owners to pay him for his work in BPL 2025  Durbar RajshahiDurbar Rajshahis overseas players are effectively stranded in their team hotel in Dhaka after the franchise continued to miss payment deadlines. The team owner and management havent responded to the players calls for updates as they await tickets for flights back home. When this report was filed, the players were still in Dhaka.Rajshahi were eliminated from the Bangladesh Premier Leauge (BPL) on Saturday when Khulna Tigers beat Dhaka Capitals on the last day of the league stage.Mohammad Haris (Pakistan), Aftab Alam (Afghanistan), Mark Deyal (West Indies), Ryan Burl (Zimbabwe) and Miguel Cummins (West Indies) are all waiting for some portion of their payments due. A couple of them have been paid 25%, while some havent been paid at all. Furthermore, the players havent received daily allowance for the last 11 days.Rajshahi have been dogged by financial problems from the start of this BPL. Anamul Haque said that the local players hadnt received any payments prior to the start of the tournament as they are usually played 25% before the tournament starts. They boycotted a training session in Chattogram last month, while the overseas players boycotted a match. Burl and Haris eventually made themselves available to play and helped them stay in contention for a playoff finish, but they fell short on net run rate.Rajshahi owner Shafique Rahman got into trouble with the team hotel in Chattogram after failing to pay them on time. Photos of security personnel sitting outside his room went viral, while Rahmans car was seized by the hotel authorities. Later, when the Rajshahi team returned to Dhaka, they were forced to check out of one hotel due to payment issues.Nazmul Abedeen Fahim, member-secretary of BPLs governing council, said that the BCB didnt vet the Rajshahi franchise properly when they were taken on board last year. I think we didnt judge the franchises properly. I think we didnt verify their experience and financial strength. It has now put us in a difficult situation.On Saturday, Bangladeshs sports adviser Asif Mahmud said that he spoke to Rahman, warning him of the consequences.I spoke to the Rajshahi owner, who assured us that he will clear the payments, Mahmud said. I have told him clearly that if he fails to do so, we will take legal steps. No more discussions. Our fact-finding committee will be looking into how this team came to be. ESPN CricInfo\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/EFQWGF.jpg",
            "description": "The team owner and management haven’t responded to the players’ calls for updates as they await tickets for flights back home. Ryan Burl is among a group of overseas players waiting for the Durbar Rajashahi owners to pay him for his work in BPL 2025 • Durbar Rajshahi Durbar Rajshahi’s overseas players are effectively stranded […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "Bulawayo City Council slashes 2025 budget by 83 percent",
            "url": "https://www.chronicle.co.zw/bulawayo-city-council-slashes-2025-budget-by-83-percent/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nThe Bulawayo City Councils special budget committee has revised the local authoritys 2025 budget downwards by 83 percent, from the initially proposed figure of US$309 million to US$53 million.\n\nThe special budget committee, established in December last year after ratepayersled by the business communityrejected the proposed 2025 budget, was chaired by the Ministry of Local Government and Public Works. The rejection followed reports that the council had used an incorrect formula, indexing 2022 and 2023 tariffs to the United States dollar.\n\nThe revised budget now awaits approval by the parent ministry, in line with the law.\n\nThe chairperson of the special budget committee, Mrs Tswagai Fikile Marovatsanga, who is also the director of Local Government in Bulawayo, confirmed the developments.\n\nI have just been speaking to the town clerk (Mr Christopher Dube), who has told me that the document has been submitted to the Ministry of Local Government and Public Works for the usual processes. The committee resolved to use the 2017 budget and adjust it by 10 percent, said Mrs Marovatsanga.\n\nThe 2017 budget was US$48,109,346, and if the committees proposal is endorsed by the Ministry of Local Government and Public Works, the citys 2025 budget will stand at US$52,920,280.60. This significant reduction is expected to have major operational implications for the council, particularly in terms of service delivery and staff salaries.\n\nMr Dumisani Sibanda, who represented the Confederation of Zimbabwe Industries (Matabeleland Chapter) on the committee, said the initial proposal was to factor in a seven percent increase on the 2017 budget.\n\nThe figure was later adjusted to 10 percent after taking into account that the council still had some running contracts with some of its service providers, said Mr Sibanda.\n\nThe revised budget reflects the councils efforts to address ratepayer concerns while balancing its operational needs. However, the drastic reduction raises questions about the citys ability to maintain service delivery standards and meet its financial obligations in the coming year.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/BCC-LOGO.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw The Bulawayo City Council’s special budget committee has revised the local authority’s 2025 budget downwards by 83 percent, from the initially proposed figure of US$309 million to US$53 million. The special budget committee, established in December last year after ratepayers—led by the business community—rejected the proposed 2025 budget, was chaired by the […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "Monalisa Sibanda shines bright at the 2025 Junior National Championships in Harare",
            "url": "https://www.chronicle.co.zw/monalisa-sibanda-shines-bright-at-the-2025-junior-national-championships-in-harare/",
            "content": "Panashe Marijeni, Online Reporter\n\nBULAWAYO based swimmer Monalisa Sibanda left her mark at the 2025 National Junior Championship swimming tournament, which was held in Harare last week.The contest was held from Friday to Sunday.Sibanda secured multiple medals.Her impressive performances in the pool not only earned her podium finishes but also showcased her exceptional versatility as a swimmer.She brought home a total of 11 medals, including four gold, six silver and two bronze medals solidifying her as the overall winner in the Under11 category.Sibandas stellar performance at this tournament is just a glimpse into her immense potential. With medals in a range of events from individual sprints to challenging medleys and relays Sibandas versatility sets her apart as a future star in the sport.The swimming star is a grade six learner at Whitestone Primary School in Bulawayo. She is also a member of the School of Swimming Club.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hrjt.jpg",
            "description": "Panashe Marijeni, Online Reporter BULAWAYO based swimmer Monalisa Sibanda left her mark at the 2025 National Junior Championship swimming tournament, which was held in Harare last week. The contest was held from Friday to Sunday. Sibanda secured multiple medals. Her impressive performances in the pool not only earned her podium finishes but also showcased her […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "Munetsi on Wolverhampton Wanderers radar",
            "url": "https://www.chronicle.co.zw/munetsi-on-wolverhampton-wanderers-radar/",
            "content": "Online writer\n\nWARRIORS midfield enforcer Marshal Munetsi is reportedly closing in on a deal to join English Premier League (EPL) side Wolverhampton Wanderers.The Mabvuku-bred midfielder (28), has had exhilarating performances in the middle of the park for French Lig 1 side Stade Reims, for whom he has scored 15 goals in total since joining from Orlando Pirates in 2020.Wolves are hoping to bolster their squad in the current transfer window to entertain hopes of surviving relegation, as they are 17th on the table with just 19 points from 24 matches.French football publication Foot Mercator reports that that Munetsi is on Wolves radar and the Vitor Pereira-coached side wants to offer Reims a very big cheque for the Zimbabwean star, whose contract expires in 2027.The transfer would mark Munetsi as potentially the second Warriors international to play for Wolves, following his Zimbabwe teammate Tawanda Chirewa.Another Warriors hopeful Leon Chiwome, who is currently injured, also plays for the EPL side.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/jutjn.jpg",
            "description": "Online writer WARRIORS midfield enforcer Marshal Munetsi is reportedly closing in on a deal to join English Premier League (EPL) side Wolverhampton Wanderers. The Mabvuku-bred midfielder (28), has had exhilarating performances in the middle of the park for French Lig 1 side Stade Reims, for whom he has scored 15 goals in total since joining […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "Watch : Belmont Faces Water Waste and Road Hazards",
            "url": "https://www.chronicle.co.zw/belmont-faces-water-waste-and-road-hazards/",
            "content": "Online Reporter\n\nBELMONT Industries in Bulawayo is grappling with a leaking city council water pipe on Falcon Street for the past four months.Residents and business people around the area say the leak, which began on September 23, 2024 (reference number 2501W3676), has not only led to significant water wastage but has also caused severe damage to the road, creating hazardous potholes and disrupting traffic.The unchecked flow of water has resulted in rapidly deteriorating road conditions along Falcon Street, with potholes deepening to the point where smaller vehicles are now avoiding the area entirely. Motorists fear damage to their cars, while the safety hazard posed by the craters continues to grow. Residents have expressed frustration over the situation, questioning why the leak has not been repaired despite being reported weeks ago, said one resident.\n\nhttps://youtube.com/shorts/NCKSCl2-pXs\n\nAnother said the water leak was a slap in the face to residents who are being forced to conserve water.How can the city expect us to comply with water shedding when theyre allowing this leak to waste water and destroy our streets? The issue has raised concerns about the city councils prioritization of infrastructure maintenance and resource management, said the resident.Belmont Industries officials have called for immediate action, emphasizing the need to repair the burst pipe and address the damage to Falcon Street.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ryh.jpg",
            "description": "Online Reporter BELMONT Industries in Bulawayo is grappling with a leaking city council water pipe on Falcon Street for the past four months. Residents and business people around the area say the leak, which began on September 23, 2024 (reference number 2501W3676), has not only led to significant water wastage but has also caused severe […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "Open call for Music Connects Africa Accelerator Programme in Zimbabwe",
            "url": "https://www.chronicle.co.zw/open-call-for-music-connects-africa-accelerator-programme-in-zimbabwe/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nTHE Music Connects Africa (Zimbabwe) accelerator programme, previously known as Scripts and Bars, has extended an open call for music artistes and managers nationwide. This initiative aims to help creatives elevate their careers and music businesses as they join the 2025 cohort.\n\nIn the past, Kay Media Africa and UK-based radio station, Reprezent Radio with the support from the British Council in partnership with the Swiss Agency for Development and Co-operation (DSC) collaborated to deliver Scripts and Bars. This digital content creation project brought together 100 creatives from Zimbabwe and the UK to collaborate across the Music and Literature sectors.\n\nThrough one of its programmes, the Interstellar Residency saw UK-based radio presenter, Patricky Denny collaborate with Victoria-Falls based songstress, Novuyo Seagirl, Mutare-based author and poetess, Margaret Chideme, as well as Bulawayo animator and comic book artist, Tafadzwa ZOMBiE Shumba on a song titled, Umuntu Ngabantu.\n\nThe programme is inviting applications from songwriters, performing artistes, music producers, DJs, and talent managers who are 18 years and older and actively engaged in the music sector.\n\nSelected participants will have the opportunity to access invaluable resources, including music business masterclasses, financial support, market access, mentorship from industry experts, and showcasing opportunities.\n\nMasterclasses and mentorship sessions will be facilitated by seasoned professionals from Zimbabwe, across Africa, and the UK, ensuring that participants receive a wealth of knowledge and expertise.\n\nThe press statement stated that applicants are encouraged to apply only if they are committed to prioritising their music careers or businesses and can attend all scheduled activities, whether in person or online.\n\nApplications are open until 14 February and interested individuals can find the application form and additional details on http://www.kaymediaafrica.com.\n\nThe Music Connects Africa programme is a collaborative initiative between the British Council and the Embassy of Switzerland in Zimbabwe, delivered by Kay Media Africa in partnership with Reprezent from the UK.Its primary goal is to foster inclusive economic and social growth among young people and underrepresented communities by strengthening the cultural and creative industries, particularly in music.\n\nThe programme that started in January will continue till June 2025 and will include a mix of learning opportunities, recording camps, and networking events, all designed to nurture talent and provide insights into the music industry.\n\nPrevious iterations of the programme supported over 100 emerging music and literature professionals in Zimbabwe, awarding 24 grants and providing access to 15 showcase platforms, leading to the creation of 36 jobs.\n\nThe partners, the British Council is the UKs leading international organisation for cultural relations and educational opportunities, reaching millions worldwide through arts, culture, education, and the English language while the Swiss Embassy promotes diplomatic relations and cultural exchange, supporting bilateral cooperation and fostering economic and trade relations.\n\nBased in Harare, Kay Media Africa is a multimedia production studio specialising in audio-visual media production and project management for arts projects. They aim to assist storytellers and arts organisations in achieving their goals through creative campaigns and business support.\n\nEstablished in 2011, Reprezent Radio broadcasts cutting-edge underground music from Brixton, with DJs and presenters who are deeply embedded in the music industry.\n\nThis incubator programme has helped local artistes take their craft to the next level, case in point, rapper MeetLuminous extending his portfolio with the release of his debut book titled, Love, Sex and the Gospel.\n\nFollow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/uj5h.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com THE Music Connects Africa (Zimbabwe) accelerator programme, previously known as Scripts and Bars, has extended an open call for music artistes and managers nationwide. This initiative aims to help creatives elevate their careers and music businesses as they join the 2025 cohort. In the past, Kay Media Africa and UK-based radio station, […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "Bulawayo Ward 9 Councillor decries rising divorce rates and domestic violence",
            "url": "https://www.chronicle.co.zw/bulawayo-ward-9-councillor-decries-rising-divorce-rates-and-domestic-violence/",
            "content": "Online Reporter\n\nBULAWAYO Ward Nine Councillor Donaldson Mabuto has bemoaned the high level of moral decadence in the ward, saying divorce cases and domestic violence are alarming.\n\nSpeaking at a church service for the late broadcaster Zvikomborero Sibanda, Mr Mabuto, without providing statistics, said divorce cases, domestic violence, and uncouth behaviour by the youth are worrying.\n\nI cannot continue counselling someone far older than my father. Its disheartening what is happening in the ward.\n\nThere are high cases of divorce in the ward, especially among those aged between 30 and 40. Its shocking.\n\nPeople are not respecting each other, he said.\n\nEnds\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/09/Clr-Donaldson-Mabuto.jpg",
            "description": "Online Reporter BULAWAYO Ward Nine Councillor Donaldson Mabuto has bemoaned the high level of moral decadence in the ward, saying divorce cases and domestic violence are alarming. Speaking at a church service for the late broadcaster Zvikomborero Sibanda, Mr Mabuto, without providing statistics, said divorce cases, domestic violence, and uncouth behaviour by the youth are […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "US President Trump’s Land Expropriation claims dismissed by South African President Ramaphosa",
            "url": "https://www.chronicle.co.zw/us-president-trumps-land-expropriation-claims-dismissed-by-south-african-president-ramaphosa/",
            "content": "Nqobile Tshili,[emailprotected]\n\nSOUTH African President Cyril Ramaphosa has dismissed United States President Donald Trumps claims that the neighbouring country is violating human rights through its land expropriation policy.\n\nPresident Trump, who assumed the US presidency last month, has ruffled feathers by announcing policies that seem to clash with the independence of other nations.\n\nHe claimed that South Africa is confiscating land and treating certain classes of people badly, and America will not stand for it and will cut funding to the neighbouring country.\n\nResponding to President Trump through a statement, South Africas President Ramaphosa said it is his countrys sovereign democratic right to determine its policies, including those related to land.\n\nSouth Africa is a constitutional democracy that is deeply rooted in the rule of law, justice, and equality. The South African government has not confiscated any land. The recently adopted Expropriation Act is not a confiscation instrument but a constitutionally mandated legal process that ensures public access to land in an equitable and just manner, as guided by the constitution. South Africa, like the United States of America and other countries, has always had expropriation laws that balance the need for public usage of land and the protection of property owners rights, said President Ramaphosa.\n\nHe said his government will engage with the Trump administration in the hope of finding common ground.\n\nPresident Ramaphosa added that, with the exception of the Presidents Emergency Plan for AIDS Relief (PEPFAR), South Africa does not receive any funding from the US.\n\nWe look forward to engaging with the Trump administration over our land reform policy and issues of bilateral interest. We are certain that out of those engagements, we will reach a better and common understanding of these matters. The US remains a key strategic political and trade partner for South Africa. With the exception of PEPFAR aid, which constitutes 17 percent of South Africas HIV/AIDS programme, there is no other funding received by South Africa from the United States, said President Ramaphosa.\n\n @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hjgv.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw SOUTH African President Cyril Ramaphosa has dismissed United States President Donald Trump’s claims that the neighbouring country is violating human rights through its land expropriation policy. President Trump, who assumed the US presidency last month, has ruffled feathers by announcing policies that seem to clash with the independence of other nations. He […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "Beyoncé wins album of the year at the 2025 Grammy Awards",
            "url": "https://www.chronicle.co.zw/beyonce-wins-album-of-the-year-at-the-2025-grammy-awards/",
            "content": "Queen Bey:Beyonc won album of the year at the67th annual Grammy Awards, marking an elusive first victory in the category in her illustrious career.Kendrick Lamarwas another huge winner, taking home both record and song of the year for his rap beef anthem, Not Like Us.\n\nRising stars:Pop sensationSabrina Carpenter, rapperDoechii, and Pink Pony Club singerChappell Roanall won big awards, and the nominees for best new artist graced the stage with a series of electric performances.\n\nWildfire support:The show came as the Los Angeles area recovers fromlast months devastating wildfires. Artists made tributes to the city throughout the show, and host Trevor Noah saidfundraising effortspromoted during the telecast had raised $7 million from viewers.\n\nRed carpet fashion:Guests struck a comparatively restrained note in all-black outfits and muted colors  but there were still plenty of feathers, ruffles and sparkle.Check out all the best red carpet looks.\n\nWeve wrapped up our live coverage of the 2025 Grammy Awards.Read more here, or scroll through the posts below to catch up on musics biggest night.\n\nBeyonc has won more Grammy Awards than anyone in history, but there was always one big category missing from her trophy case: album of the year.\n\nThat changed Sunday night, as her genre-bending Cowboy Carter took top honors andgave her that elusive win.\n\nCompton rapper Kendrick Lamar, meanwhile, completed a victory lap after last summers beef with Drake. His song Not Like Us took home wins for best rap performance, song of the year and record of the year.\n\nSome of the other major winners Sunday included Chappell Roan, who won best new artist; Sabrina Carpenter, who won best pop vocal album (Short n Sweet); and Doechii, who won best rap album (Alligator Bites Never Heal).\n\nCheck out more photos from the show.\n\nLos Angeles was golden Sunday night, and not just because of the Grammy trophies.\n\nThe night served as a reminder that in a countrydisrupted by divisive national politics, people can still come together to support each other in times of trouble.\n\nThats just what the music industry did for this years Grammys, which was as much abouthelping those affected by the California wildfiresas it was about performances.\n\nIt also brought to mind theimportance of diversity, as women and artists of color took home some of the nights biggest prizes.\n\nKendrick Lamars Not Like Us officially became themost critically acclaimed diss track, as the pivotal song in his highly publicized beef with fellow rapper Drake took home best rap performance as well as record of the year and song of the year Grammys.\n\nBut it was ladies night for sure, as Chappell Roan, Sabrina Carpenter and Doechii also took home key awards.\n\nThe biggest, and most long-awaited win for some, was Beyoncat long lasttaking home album of the year.\n\nThat Los Angeles firefighters, whom she thanked in her acceptance speech,presented her the awardfelt like the cherry on top as did the camera capturing Taylor Swift  who was also nominated for album of the year, and with four prior wins holds the record in that category  clinking glasses with Beys husband, Jay-Z, in celebration.\n\nWithmillions of dollars raisedfor those affected by the fires and so much homage paid to the resilience of those affected via both the shows andsome of its commercials, the Grammys more than justified its decision to go forth with the ceremony in the wake of such a devastating tragedy.\n\nBeyonc has won album of the year at the Grammys, capturing an elusive first win in the category and marking her third win at the 2025 awards.\n\nBeyonc won the honor for her genre-bending Cowboy Carter.\n\nShe thanked the Recording Academy and those who collaborated with her on the album. Her daughter, Blue Ivy, accompanied her on stage.\n\nEarlier in the night, Beyonc became the first Black woman to win a Grammy for best country album. She also took home an award for best country duo/group performance for II Most Wanted with Miley Cyrus during the Grammys pre-show, making it a trio of trophies total.\n\nSome context:The Recording Academy hadconsistently overlooked Beyonc in this specific category, with the singer losing four times for her albums Renaissance (2023), Lemonade (2017), Beyonc (2015) and I Am Sasha Fierce (2010).\n\nFor the most part, Beyonc had remained publicly unfazed. She even seemed to refer to her unsuccessful bids in the category on the Cowboy Carter song Sweet Honey Buckin, singing in part that she takes losses on the chin.\n\nCNNs Alli Rosenbloom contributed reporting.\n\nLets hear it for the first responders.\n\nSeveral members of the Los Angeles Fire Department appeared on stage during Sundays Grammys telecast to help present the big award of the night, album of the year.\n\nBefore presenting the award, the LAFD members stood on stage for several minutes while the audience stood and applauded for the men and women who bravely fought the wildfires that devastated the city of Los Angeles last month.\n\nIn the midst of unprecedented fire conditions, their selfless acts of courage and commitment were nothing short of inspiring, Fire Chief Anthony Marrone said on stage, flanked by members of his staff. Our heartfelt condolences and prayers remain with all the families whove lost loved ones, friends and neighbors, along with everyone who has lost homes, business and have been displaced.\n\nMarrone and his colleague went on to announce Beyoncs album Cowboy Carter as the winner of the coveted album of the year award.\n\nIts a very brat Grammys.\n\nCharli XCX performed a high-energy version of her hit Von dutch on Sunday night at musics biggest night.\n\nIt started with the star getting out a black car outside the Crypto.com Arena where the ceremony was being held, and strutting to a small stage, surrounded by people.\n\nEventually, Charli XCX appeared on the Grammy stage where she shrugged off her black fur coat, leaving a skimpy all-denim outfit.\n\nShe also performed some of her song Guess which features Billie Eilish, who was seen singing along and dancing in the crowd.\n\nWhat is Brat Summer?Brat is less a noun than it is a concept, though it is also a thing. The title of Charli XCXs sixth studio album, the British singer has said she envisions a brat as someone who has a pack of cigs, a Bic lighter and a strappy white top with no bra.\n\nYoure just like, that girl who is a little messy and likes to party and maybe says some dumb things sometimes, she explained in a video shared on TikTok.\n\nMany theorize that it is the antithesis to the clean and highly groomed aspect so often on display by social media influencers.\n\nCNNs Lisa Respers France contributed reporting.\n\nThe Grammys have raised at least $7 million to support people affected by the Los Angeles wildfires so far.\n\nThe shows host, Trevor Noah, said that tally is just donations coming from people watching at home.\n\nThere has been a QR code appearing on the broadcast. Noah also mentioned earlier the code is on the tables where artists and celebrities are sitting inside the Crypto.com Arena in Downtown Los Angeles.\n\nThe money is going to the MusiCares Fire Relief fund. MusiCares is a charity founded by the Recording Academy to help people in the music industry by providing a variety of resources and disaster relief, according to its website.\n\nThe Recording Academy and MusiCares have partnered with several local organizations to provide resources for fire victims, theorganization said.\n\nDiana Ross appeared at the Grammys on Sunday to present the award for song of the year, and she shared an inspirational message before handing out the statuette.\n\nThe music legend, 80, began by sharing that shes been thinking a lot about how we can have the balance between celebrating and being filled with sorrow, and how music can be healing in that respect.\n\nI am inviting us all with love and hope and courage to those who are hurting tonight, especially the children who might be frightened. You are not alone. We stand with you, Ross said. My heart reaches out to you.\n\nWithout referring to any one issue in particular, Ross continued to share her hope that this moment is a reminder to us all of the power that we hold to rebuild, to lift and to come together with compassion.\n\nBy reminding our future generation that even in the darkness, she added, we can rise again and keep the light of hope and love alive.\n\nRoss went on to announce the winner of song of the year award, which was Kendrick Lamar for Not Like Us.\n\nKendrick Lamar has won the song of the year award for Not Like Us, marking his second huge win in the late stages of the 2025 Grammy Awards.\n\nThis follows up his win for record of the year for the same song, which was his final salvo in a widely publicized rap beef with Drake.\n\nLamar paid homage to West Coast artists while accepting his award.\n\nDiana Ross presented the award to Lamar, who mimed bowing down to her. Im starstruck, Lamar said.\n\nHe concluded his speech with a message for young rappers: I just hope you respect the art form.\n\nSome background:Widely considered one of the best rappers alive, Lamar already has 17 Grammys under his belt.\n\nLamars surprise album GNX debuted at No. 1 on the Billboard 200 albums chart in 2024, while five of its singles also took the top five slots in the Billboard Hot 100 songs chart.\n\nNext weekend:Lamar will headline the Super Bowl LIX halftime show next Sunday in New Orleans. The Not Like Us rapper made his debut on the Super Bowl halftime show stage in 2022 when he performed alongside Eminem, Dr. Dre, Snoop Dogg, Mary J. Blige and 50 Cent.\n\nCNNs Lisa Respers France and Alli Rosenbloom contributed reporting.\n\nNever stop being just like you.\n\nThose were the inspiring words from Alicia Keys, who was on fire Sunday night after being presented the Dr. Dre Global Impact Award.\n\nAccompanied by one of her young sons, Keys paid homage to the beautiful, powerful thing she said those at the Grammys were cultivating Sunday night.\n\nAfter giving big love to uber producer Dr. Dre, for whom the award was named, and whom Keys said taught her that if you were a creative you can touch the world.\n\nI always had to fight for a certain level of respect as a songwriter, a composer and especially a producer, Keys said. Its strange that we dont think of women as producers like Quincy (Jones) or Dre or (Keys husband Swizz Beats). Female producers have always powered the industry.\n\nKeys named a few, including Patrice Rushen, Linda Perry and Missy Elliott.\n\nThat won her one of the biggest cheers of the night, before she followed up by saying, When destructive forces try to burn us down, we rise from the ashes like a phoenix.\n\nHer hips never lie.\n\nLatin superstar Shakira performed Spanish-language music at the Grammys on Sunday, donning a gold fringe skirt and bedazzled top before she made a quick change into a head-to-toe bejeweled golden set.\n\nShakira had everyone from Sabrina Carpenter to Beyonc up on their feet during the energetic second part of her set.\n\nGloria Estefan introduced Shakira, calling her a global artist who has always shined the brightest.\n\nMoments earlier in the night, Shakira won her fourth career Grammy for best Latin pop album for Las Mujeres Ya No Lloran, an award she dedicated to immigrants in the US. Youre loved, youre worth it and I will always fight with you, she said during her acceptance speech.\n\nCNNs Elise Hammond contributed to this report\n\nKendrick Lamar dedicated his Grammy win for record of the year to Los Angeles, and talked about his personal connection growing up in the city and the influence it had on him as a person and an artist.\n\nLamar won the award for his hit song Not Like Us, the capstone of his feud last year with Drake. Record of the year recognizes the team behind producing a song, including the artist, producers and engineers, the Grammys said.\n\nThis is my neck of the woods that have held me down since a young pup, Lamar said in his acceptance speech. I cant give enough thanks to these places that I rolled around since high school.\n\nHe spoke directly to the families in the areas impacted by the wildfires: This is a true testament that we can continue to restore this city. The Grammys ceremony this year has been working to raise money for wildfire relief.\n\nLamar, who already had 17 Grammys before this win, will headline the Super Bowl LIX halftime show next Sunday in New Orleans.\n\nThe award was presented by Miley Cyrus.\n\nEven if its not you Beyonc I might just say it is, Cyrus joked before announcing Lamars win. Beyonc was also nominated for her song Texas Hold Em.\n\nKendrick vs. Drake:Lamar had one of musics buzziest years in 2024, with much of the attention centered on abeef heard round the world. The critically acclaimed rapper (and the first to have won a Pulitzer Prize) was locked in a lyrical battle with fellow artist (and former collaborator) Drake.\n\nDrake is now battling his own record label over Not Like Us. The Canadian rapper and singer is suing UMG Recordings for defamation, seeking compensatory and punitive damages over the labels publishing and promotion of the Lamar hit.\n\nThis post has been updated with additional remarks from Lamar and CNNs Lisa Respers France contributed reporting.\n\nWill Smith made a triumphant return to the award show stage on Sunday night, appearing during one of the Grammys most impactful segments: atribute to the legendary Quincy Jones.\n\nSmith had not been welcomed back to any major award show since hisinfamous slapat the 2022 Oscars, which caused him to be banned from attending the Academy Awards for 10 years.\n\nBut at the Grammys, Smith held a prominent role, introducing the tribute to Jones with lengthy remarks to honor him, and then reappearing several times between performances.\n\nSmith described Jones as a mentor, recalling his formative role in casting him on The Fresh Prince of Bel-Air.\n\nIn his 91 years, Q touched countess lives, Smith said. But I have to say, he changed my life forever.\n\nIts time for the big three categories at the 2025 Grammy Awards.\n\nBut some of those big awards sound like they could be similar, like record of the year and song of the year, for instance.\n\nIf youre a bit confused, heres what to know:\n\nRecord of the yearrecognizes the team behind producing a song, including the artist, producers and engineers, according to theRecording Academy behind the awards.\n\nSong of the year, however, is more about recognizing the person who wrote the new material of the song, according to the Grammys. Song of the year is focused on the song composition, rather than the technical creation of the track (as in record of the year).\n\nBut, dont confuse the terms album and record  they are not used interchangeably in the Grammys as they might be in casual conversation between music lovers.\n\nAccording to the guidelines, to qualify foralbum of the year, recordings must contain at least five different tracks and a total playing time of 15 minutes or a total playing time of at least 30 minutes with no minimum track requirement,the Grammys said.\n\nThe category is judged on the quality and artistry of the tracks on an album as a whole, it said, rather than an individual song  as in the record of the year and song of the year categories.\n\nChris Martin bid farewell to those we lost in the music industry at the Grammys during the In Memoriam segment.\n\nColdplays lead singer used their new single All My Love to bid farewell to stars from One Directions Payne to country superstar Toby Keith.\n\nThe year saw the loss of multiple people both famous and behind the scenes in the music world, which meant stars like legendary soul singer Sam Moore shared screen time with DJ/Producer Clark Kent and Recording Academy executive assistant, Lani Simmons.\n\nThe audience responded with a big round of applause at the conclusion of the tribute.\n\nFollowing the segment, during commercial break, One Directions Story of My Life played in the theater, further honoring Payne, who died after falling from a hotel balcony in Argentina last year.\n\nLady Gaga and Bruno Mars have won the Grammy for best pop duo or group performance, earning the award for their hit song Die With a Smile.\n\nGaga used her speech to speak out in support of the LGBTQ community.\n\nThe two also used their acceptance speech to highlight their appreciation for one anothers work.\n\nGaga, Im so honored to be a part of this song with you, Bruno said. Im so honored to have a small part in your giant musical legacy and I really truly believe that God gave us this song to sing together so thank you so much.\n\nGaga then called Bruno an incredible human being and a musician for the ages, adding that she doesnt know music without Bruno.\n\nWill Smith doesnt believe you would know who he is, were it not for the late Quincy Jones.\n\nThe rapper and actor hit superstardom thanks to The Fresh Prince of Bel Air, which Jones was instrumental in bringing to the small screen. Thats why it made perfect sense for Smith, along with famed pianist Herbie Hancock, to introduce a sprawling Grammys tribute to Jones, known as Q to those who loved him.\n\nJones touched almost every genre of music. The composer and producer, who added his tasteful polish to recordings by everyone from Ray Charles and Frank Sinatra to Michael Jackson,died in November 2024 at the age of 91.\n\nSmith introduced Cynthia Erivo Sunday night at the Grammys, who performed a stripped down version of Count Basie and Frank Sinatras Fly Me To the Moon, which Jones was well known for.\n\nShe was followed by other major stars including Lainey Wilson, Stevie Wonder and Janelle Mone, who honored Jones by performing just a few of the songs the American music giant helped make famous.\n\nWonder expressed his love of Jones and, accompanied by a choir of students who lost their schools to the recent Los Angeles wildfires, sang some of the 1985 charity single, We Are the World, which Michael Jackson and Lionel Ritchie wrote and Jones produced.\n\nMone donned the black suit, sparkly socks and black shoes Jackson made famous and broke out some of his dance moves  including a moonwalk  in performing Jacksons hit, Dont Stop til You Get Enough.\n\nThe stars were out Sunday at Crypto.com Arena in Los Angeles. They danced, mingled and took selfies as musics best were honored during the Grammy Awards.\n\nCheck out some behind-the-scenes photos andsee more photos from the show here.\n\nGlobal music star Shakira has added another award to her illustrious career, taking home the Grammy for best Latin pop album for Las Mujeres Ya No Lloran.\n\nThis is incredible. Thank you so much, she said while accepting the award.\n\nShakira said she wanted to dedicate the award to all my immigrant brothers and sisters in this country.\n\nYoure loved, youre worth it and I will always fight with you, she said. Shakira said that women who work really hard everyday to provide for their families are the true heroes.\n\nSo this is for you too, she added.\n\nThe star also thanked her family and her children who were in the audience.\n\nThis post has been updated with remarks from Shakiras speech.\n\nLady Gaga debuted a brand new music video during a break in the Grammys telecast on Sunday for a new song, which appeared to be named Abracadabra. The music video was presented by Mastercard as part of a long-form commercial.\n\nThe category is, dance or die, Gaga said at the beginning of the video, outfitted in a red patent leather getup complete with otherworldly headgear.\n\nThe song is a familiar Gaga sound, with its harmonies and upbeat tempo harkening back to her Fame Monster and Born This Way eras. In the video, Gaga was carried through a room by dozens of backup dancers while her haunting vocals rang out.\n\nThe colors of the video were primarily red, white, black and cream. One of her outfits was a full-length red leather cape dress with a classic Gaga oversized hat, complete with large red studs around the rim.\n\nLady Gaga has been promoting her upcoming album Mayhem, which is set to drop on March 7. She previously released her first single Disease in October.\n\nThe singer is nominated for two Grammys on Sunday for Die with a Smile, her 2024 collab with Bruno Mars  with whom she performed on stage at the award event.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/njknh.jpg",
            "description": "• Queen Bey: Beyoncé won album of the year at the 67th annual Grammy Awards, marking an elusive first victory in the category in her illustrious career. Kendrick Lamar was another huge winner, taking home both record and song of the year for his rap beef anthem, “Not Like Us.” • Rising stars: Pop sensation […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        },
        {
            "title": "“Zvikomborero Sibanda was an exceptional journalist” – Bulawayo Minister of State Judith Ncube",
            "url": "https://www.chronicle.co.zw/zvikomborero-sibanda-was-an-exceptional-journalist-bulawayo-minister-of-state-judith-ncube/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nBulawayo Provincial Affairs and Devolution minister Judith Ncube has described the late broadcaster Zvikomborero Sibanda as an exceptional and exemplary journalist.\n\nSpeaking at a church service at Salvation Army in Mpopoma, Minister Ncube said the late broadcaster was not afraid to tell the true Zimbabwe story without exaggeration.\n\nChronicle Managing Editor, Issac Waniwa is part of the mourners\n\nOn behalf of the Government, I bring President Mnangagwas condolences. The Bulawayo office stands together with you in this difficult moment, she said.\n\nHer contribution to the nation was great. We are proud that journalists like her are portraying the true Zimbabwe story.\n\nShe was talented, gifted and she carried her work exceptionally well, she said.\n\nThe Minister thanked Bulawayo City Council for agreeing to the family request to have her buried where her father is also buried at Athlone Cemetery.\n\nBorn on April 5, 1978, Kombo grew up in Mpopoma and attended Nkulumane Primary School in Bulawayo. She later completed her high school education at Usher High and Hermann Gmeiner High School before pursuing a qualification in Mass Communication and Journalism at Harare Polytechnic.\n\nHer media career began at Chronicle, where she completed her attachment, before moving on to ZBCtv.\n\nShe later worked with the National Oil Company of Zimbabwe before relocating to South Africa after marrying a South African national.\n\nShe returned to Zimbabwe in November last year, struggling with long-term health issues related to fibroids, a condition for which she had previously undergone surgery.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/8ouip.jpg",
            "description": "Nqobile Bhebhe, Nqobile.bhebhe@chronicle.co.zw Bulawayo Provincial Affairs and Devolution minister Judith Ncube has described the late broadcaster Zvikomborero Sibanda as an exceptional and exemplary journalist. Speaking at a church service at Salvation Army in Mpopoma, Minister Ncube said the late broadcaster was not afraid to tell the true Zimbabwe story without exaggeration. “On behalf of the […]",
            "time": "18:30",
            "date": "03 Feb 2025"
        }
    ]
}