{
    "news": [
        {
            "title": "TM Pick n Pay and CABS Join Forces to Combat Cancer with US$150,000 Donation",
            "url": "https://www.chronicle.co.zw/tm-pick-n-pay-and-cabs-join-forces-to-combat-cancer-with-us150000-donation/",
            "content": "Online WriterTODAY, two corporate giants, TM Pick n Pay and CABS, donated a total of US$150,000 worth of cancer medication to Mpilo Central Hospital. This collaborative effort highlights the collective commitment to fighting cancer in Zimbabwe.TM Pick n Pay contributed US$100 000, while CABS provided an additional US$50 000, working together to make a meaningful and lasting impact on the lives of those affected by cancer.The donation was made possible by funds raised during the Pink Drive and Blue November cancer awareness campaigns.These initiatives encouraged shoppers to support cancer patients by purchasing pink and blue merchandise. Furthermore, for every swipe made on a CABS Point of Sale (POS) machine in TM Pick n Pay stores nationwide during the campaign, CABS donated a portion towards combating cancer.Mpilo Central Hospital in Bulawayo, Zimbabwes second-largest public hospital, is a key referral centre in the countrys healthcare system. It houses one of only two public radiotherapy units in the country, providing essential treatment to cancer patients. Recent statistics underscore that cancer remains a significant health concern in Zimbabwe, highlighting the critical importance of timely and accessible treatment. The hospitals comprehensive approach addresses both immediate medical needs and contributes to the broader fight against cancer in the country.Mr Mehluli Mpofu, Managing Director of CABS, stressed the importance of the donation. Statistics show that cancer remains one of the leading health concerns in our country, and it was imperative that we came together to address this urgent need. By providing these resources, we are not only addressing immediate medical needs but also fostering a culture of awareness and support around mens health issues, he said.Mr Mpofu further highlighted CABSs broader commitment to social responsibility, stating, CABS remains dedicated to leveraging its resources and influence to champion causes that improve lives and uplift our society.Echoing this sentiment, TM Pick n Pays Chief Finance Officer, Mr Gamuchirai Nyamuzinga, emphasised the companys dedication to community well-being. Our efforts, exemplified by the Pink and Blue Month Campaign, reflect our belief that doing good is good business. This campaign, which featured the sale of pink cupcakes for Breast Cancer Awareness in October and blue cupcakes for Testicular Cancer in November, not only fostered community spirit but also raised essential funds for chemotherapy medications, enabling us to support local hospitals like Mpilo, he said.At the official handover ceremony at Mpilo Central Hospital, Director Mrs Nhoko, speaking on behalf of the Bulawayo Provincial Affairs and Devolution Minister, Cde Judith Ncube, commended TM Pick n Pay and CABS for their commitment to fostering unity and raising awareness about the importance of early detection and treatment of breast and testicular cancer.This collaborative initiative exemplifies the power of partnership, showcasing what can be accomplished when organisations, businesses, and the community join forces for a shared goal. The significance of this donation resonates deeply, underscoring the transformative potential that arises when partnerships are forged in pursuit of a greater good, said Mrs Nhoko.She further emphasised that the fight against cancer is continuous and requires vigilance in raising awareness, supporting research, and advocating for better services. Together, through unified action, we can forge a future where affordable treatment options are accessible to all.The event was attended by medical practitioners, community members, and representatives from TM Pick n Pay and CABS, illustrating a shared commitment to enhancing healthcare access for cancer patients in Zimbabwe.END\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/j5j7.jpg",
            "description": "Online Writer TODAY, two corporate giants, TM Pick n Pay and CABS, donated a total of US$150,000 worth of cancer medication to Mpilo Central Hospital. This collaborative effort highlights the collective commitment to fighting cancer in Zimbabwe. TM Pick n Pay contributed US$100 000, while CABS provided an additional US$50 000, working together to make […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "President Mnangagwa urges unity and focus at ZANU PF’s final Politburo session of 2024",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-urges-unity-and-focus-at-zanu-pfs-final-politburo-session-of-2024/",
            "content": "Online Writer\n\nHarare  President Emmerson Mnangagwa has called for renewed commitment and unity within ZANU PF as the party prepares for 2025.\n\nSpeaking at the 380th Ordinary Session of the Politburo in Harare on 19 December, the President highlighted the successes of 2024 while addressing challenges that threatened internal cohesion.\n\nReflecting on the year, President Mnangagwa praised the partys accomplishments in infrastructure development, economic growth, and capacity building.\n\nNotable milestones included the commissioning of the Shurugwi-Mhandamabwe Road, the expansion of Varun Beverages operations, and the launch of a US$1 billion energy project. He reiterated the importance of leveraging Zimbabwes natural resources to modernise and industrialise the economy.\n\nOur national development philosophy, Nyika inovakwa, inotongwa, inonamatigwa nevene vayo/ilizwe lakhiwa, libuswe, likhulekelwe ngabanikazi\n\nbalo, is now deeply embedded in the national consciousness, President Mnangagwa said.\n\nHe called on all Zimbabweans to work together to sustain the development momentum.\n\nThe President also addressed issues undermining party unity, particularly the misuse of social media for airing internal disputes.\n\nIt is disheartening to note the unbecoming levels of mud-slinging and counter-revolutionary tendencies on social media, he said.\n\nPresident Mnangagwa urged members to adhere to the partys constitution and engage in proper consultation processes to resolve conflicts.\n\nHe praised the work of the Hebert Chitepo School of Ideology in fostering patriotism and Pan-Africanism among the youth.\n\nThe president encouraged communities to maximise agricultural output during the current season, emphasising the need for vigilance against unpredictable weather patterns.\n\nLooking ahead, the President announced the imminent launch of the Land Tenure Implementation Programme, aimed at consolidating gains from the land reform initiative. The programme seeks to enhance land ownership, improve access to financing, and boost agricultural productivity.\n\nExpressing solidarity with regional partners, President Mnangagwa extended condolences to Mozambique and Malawi, which were recently affected by Tropical Cyclone Chido. He reaffirmed Zimbabwes commitment to regional collaboration on climate resilience and disaster mitigation.\n\nThe President congratulated Namibias SWAPO party and President-elect Netumbo Nandi-Ndaitwah on their election victory, pledging to deepen ties with regional liberation movements.\n\nAs the festive season approaches, President Mnangagwa urged party members to celebrate Unity Day and Christmas while reflecting on their commitment to serving Zimbabwe. Let us enter 2025 with optimism and determination to achieve even greater success for our nation, he concluded.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/jjunkl.jpg",
            "description": "Online Writer Harare – President Emmerson Mnangagwa has called for renewed commitment and unity within ZANU PF as the party prepares for 2025. Speaking at the 380th Ordinary Session of the Politburo in Harare on 19 December, the President highlighted the successes of 2024 while addressing challenges that threatened internal cohesion. Reflecting on the year, […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zimbabwe name squad for historic Test series against Afghanistan",
            "url": "https://www.chronicle.co.zw/zimbabwe-name-squad-for-historic-test-series-against-afghanistan/",
            "content": "Online Reporter\n\nZIMBABWE Cricket (ZC) has announced the squad for the historic two-match Test series against Afghanistan, with seven uncapped players  including opening batter Ben Curran  earning call-ups for the festive season fixtures in Bulawayo.\n\nApart from Curran, the other uncapped players picked for the series are batter Johnathan Campbell, wicketkeeper-batters Tadiwanashe Marumani and Nyasha Mayavo as well as pace bowlers Trevor Gwandu, Takudzwa Chataira and Newman Nyamhuri.\n\nCraig Ervine will captain the Zimbabwe side, with the experienced Sean Williams, Sikandar Raza, Blessing Muzarabani and Richard Ngarava providing a strong core to the squad.\n\nThe series marks a momentous occasion for Zimbabwean cricket as the country prepares to host its first Boxing Day Test at home in 28 years, set to take place from 26-30 December.\n\nThis will be followed by Zimbabwes inaugural New Years Test, scheduled for 2-6 January 2025. It will be a first for Zimbabwe, both at home and internationally, further adding to the significance of this series.\n\nZIMBABWE TEST SQUAD:\n\nCraig Ervine (captain), Ben Curran, Brian Bennett, Johnathan Campbell, Takudzwa Chataira, Joylord Gumbie, Trevor Gwandu, Takudzwanashe Kaitano, Tadiwanashe Marumani, Brandon Mavuta, Nyasha Mayavo, Blessing Muzarabani, Dion Myers, Richard Ngarava, Newman Nyamhuri, Sikandar Raza, Sean Williams.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/06/Sikandar-Raza-at-Northamptonshire-Cricket-Club-in-the-Vitality-Blast.jpg",
            "description": "Online Reporter ZIMBABWE Cricket (ZC) has announced the squad for the historic two-match Test series against Afghanistan, with seven uncapped players – including opening batter Ben Curran – earning call-ups for the festive season fixtures in Bulawayo. Apart from Curran, the other uncapped players picked for the series are batter Johnathan Campbell, wicketkeeper-batters Tadiwanashe Marumani […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "CPU rescues four marooned suspected smugglers at the Limpopo River",
            "url": "https://www.chronicle.co.zw/cpu-rescues-four-marooned-suspected-smugglers-at-the-limpopo-river/",
            "content": "Thupeyo Muleya Beitbridge BureauTHE Civil Protection Unit (CPU) in Beitbridge has rescued four suspected smugglers who spent over 10 hours marooned on an island within the Limpopo River.The quartet were part of a group of 11 people who became stranded while returning from South Africa after the river swelled around 10 p.m. on Wednesday. Beitbridge experienced significant rainfall, leading to most water bodies filling up.According to Beitbridge Civil Protection Unit chairperson, Mrs Sikhangezile Mafu Moyo, four people managed to swim across the river on Wednesday night.Four people managed to escape from the island that same night, while we successfully rescued four others with the help of a boat provided by the National Parks and Wildlife Authority. The subcommittee responsible for search and rescue, led by the police, carried out the mission, said Mrs Mafu Moyo.By midday, three individuals remained stranded on the island, with reports suggesting that there could be more people still marooned at the same location.When our news crew arrived at the scene, a relative had come to deliver food to the three individuals still trapped. The food had to be thrown across the riverbank, tied to stones.I heard about the incident when I came to collect some clients at a nearby food outlet. Someone who recognised my relative told me about it, so I decided to bring food for him and came here to see if I could assist, said Mr Itayi Tavarwisa.He stated that his relative and the others were waiting for the water current to subside before attempting to cross the river into Zimbabwe.A few years ago, two cousins were marooned at the same spot after the river swelled while they were trying to cross into South Africa. They were later rescued by the Civil Protection Unit after enduring over 20 hours in the bush.Ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2011/12/floodss.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau THE Civil Protection Unit (CPU) in Beitbridge has rescued four suspected smugglers who spent over 10 hours marooned on an island within the Limpopo River. The quartet were part of a group of 11 people who became stranded while returning from South Africa after the river swelled around 10 p.m. on […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zanu PF holds Ordinary Politburo meeting at party headquarters",
            "url": "https://www.chronicle.co.zw/zanu-pf-holds-ordinary-politburo-meeting-at-party-headquarters/",
            "content": "Online WriterTHIS afternoon, President Emmerson Mnangagwa, who is also the First Secretary of the ruling Zanu PF party, is chairing an Ordinary Session of the Politburo at the party headquarters in Harare.\n\nThe meeting is expected to address key issues affecting the party and the nation, including economic challenges, upcoming electoral strategies, and internal party dynamics.\n\nAs ZANU-PF continues to develop the economy, this session is particularly significant, as it will provide a platform for leadership to discuss strategies aimed at consolidating gains and maintaining the momentum towards Vision 2030 goals.\n\nThe Politburo, which is the partys highest decision-making body, plays a crucial role in shaping policies and guiding the partys direction.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/qdf.jpg",
            "description": "Online Writer THIS afternoon, President Emmerson Mnangagwa, who is also the First Secretary of the ruling Zanu PF party, is chairing an Ordinary Session of the Politburo at the party headquarters in Harare. The meeting is expected to address key issues affecting the party and the nation, including economic challenges, upcoming electoral strategies, and internal […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "New commissioners for Zimbabwe Prisons and Correctional Services sworn in",
            "url": "https://www.chronicle.co.zw/new-commissioners-for-zimbabwe-prisons-and-correctional-services-sworn-in/",
            "content": "Online WriterTHIS morning, President Emmerson Mnangagwa swore in six new commissioners for the Zimbabwe Prisons and Correctional Services Commission during a ceremony held at State House in Harare.The newly appointed commissionersSimon Madzimure, Albert Mandinika, Rosemary Nyamweda Kanonge, Sternly Kandongwe, Chipo Mandela, and Utloile Silaigwanaare tasked with overseeing the operations and reforms within the countrys correctional facilities.\n\nThe appointments come at a pivotal time as Zimbabwe seeks to address longstanding issues within its prison system, including overcrowding, inadequate living conditions, and the need for rehabilitation programmes.The new commissioners bring a diverse range of expertise and experience, which is expected to enhance the governance and effectiveness of the correctional services.The new commission will play a critical role in promoting human rights within prisons and ensuring that inmates are treated with dignity.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hjuf.jpg",
            "description": "Online Writer THIS morning, President Emmerson Mnangagwa swore in six new commissioners for the Zimbabwe Prisons and Correctional Services Commission during a ceremony held at State House in Harare. The newly appointed commissioners—Simon Madzimure, Albert Mandinika, Rosemary Nyamweda Kanonge, Sternly Kandongwe, Chipo Mandela, and Utloile Silaigwana—are tasked with overseeing the operations and reforms within the […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "Two dead, one injured in head-on collision after bus hit donkey along Bulawayo Beitbridge Road",
            "url": "https://www.chronicle.co.zw/two-dead-one-injured-in-head-on-collision-after-bus-hit-donkey-along-bulawayo-beitbridge-road/",
            "content": "Sukulwenkosi Dube-Matutu [emailprotected]\n\nTWO people died while one was injured when a bus hit a donkey leading to a collision with a Toyota Fortuner vehicle in the Makhado area, along the Bulawayo-Beitbridge Road.On their Twitter page police confirmed the incident which occurred this morning at around 1AM at the 227km peg.\n\nThe ZRP confirms a fatal road traffic accident which occurred on 19 December 2024 at the 227-kilometre peg along the Bulawayo-Beitbridge Road. Two people were killed while one person was injured when an Irizar Mtethi Bus with two passengers on board hit a donkey.Subsequently the bus veered off the road leading to a head-on collision with a Toyota Fortuner vehicle with one passenger on board. The bodies of the victims were taken to Beitbridge Hospital mortuary for post mortem while the injured was admitted to the same hospital, read the tweet.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Untitled-1-Recovered-2.jpg",
            "description": "Sukulwenkosi Dube-Matutu – sukulwenkosi.dube@chronicle.co.zw TWO people died while one was injured when a bus hit a donkey leading to a collision with a Toyota Fortuner vehicle in the Makhado area, along the Bulawayo-Beitbridge Road. On their Twitter page police confirmed the incident which occurred this morning at around 1AM at the 227km peg. “The ZRP confirms […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "President Mnangagwa appoints new Human Rights Commissioner",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-appoints-new-human-rights-commissioner/",
            "content": "Online Writer\n\nTHIS morning, President Emmerson Mnangagwa officially swore in Mr Martin Muduva as Zimbabwes new Human Rights Commissioner during a ceremony at State House in Harare. Commissioner Muduvas appointment comes amid ongoing concerns regarding human rights practices in the country and is seen as a critical step towards promoting accountability and safeguarding citizens rights.\n\nCom Muduva, who has a background in human rights advocacy and legal reform, is expected to lead the Zimbabwe Human Rights Commission in addressing complaints of human rights abuses and ensuring compliance with international human rights standards.His role will involve investigating cases of alleged violations, raising public awareness, and fostering dialogue between the Government and civil society.\n\nPresident Mnangagwa has always stressed the importance of upholding human rights as fundamental to national development and social cohesion.The appointment has been welcomed by various human rights organisations, who view it as an opportunity for renewed efforts to protect vulnerable groups and promote justice.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/fgbfv.jpg",
            "description": "Online Writer THIS morning, President Emmerson Mnangagwa officially swore in Mr Martin Muduva as Zimbabwe’s new Human Rights Commissioner during a ceremony at State House in Harare. Commissioner Muduva’s appointment comes amid ongoing concerns regarding human rights practices in the country and is seen as a critical step towards promoting accountability and safeguarding citizens’ rights. […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "President Mnangagwa swears in new Independent Complaints Commissioner",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-swears-in-new-independent-complaints-commissioner/",
            "content": "Online WriterTHIS morning, President Emmerson Mnangagwa officially swore in Dr Kudakwashe Christopher Muchena as Zimbabwes new Independent Complaints Commissioner during a ceremony at State House in Harare.\n\nDr Muchenas appointment comes at a crucial time as the country seeks to enhance accountability and transparency within public institutions.The Independent Complaints Commission has been tasked with investigating complaints against police and other law enforcement agencies, aiming to restore public confidence in the justice system.\n\nDr Muchenas background in law and human rights advocacy positions him well for this role, and his appointment is expected to promote greater oversight and responsiveness in handling public grievances.President Mnangagwa expressed his confidence in Dr Muchenas capabilities, highlighting the Governments commitment to upholding the rule of law and ensuring that citizens rights are protected.\n\nThis move is part of a broader initiative to reform the security sector and improve the relationship between the police and the communities they serve.\n\nAs Zimbabwe continues to grapple with issues of governance and human rights, Dr Muchenas role will be closely watched by civil society organisations and the public alike, who are eager for meaningful change in the handling of complaints against State actors.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/R3Q4HY.jpg",
            "description": "Online Writer THIS morning, President Emmerson Mnangagwa officially swore in Dr Kudakwashe Christopher Muchena as Zimbabwe’s new Independent Complaints Commissioner during a ceremony at State House in Harare. Dr Muchena’s appointment comes at a crucial time as the country seeks to enhance accountability and transparency within public institutions. The Independent Complaints Commission has been tasked […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        },
        {
            "title": "Zambian Special Envoy meets President Mnangagwa in Harare",
            "url": "https://www.chronicle.co.zw/zambian-special-envoy-meets-president-mnangagwa-in-harare/",
            "content": "Online WriterTHIS morning, a delegation from Zambia, led by former Vice President Enoch Kavindele, made a significant courtesy visit to His Excellency President Emmerson Mnangagwa at State House in Harare.\n\nThe meeting depicts the strengthening ties between Zambia and Zimbabwe, particularly in areas of trade, security, and regional cooperation.\n\nMr Kavindeles visit comes at a time when both nations are seeking to enhance bilateral relations, following a series of discussions aimed at fostering economic collaboration and addressing shared challenges.\n\nThe visit also highlights the ongoing diplomatic efforts by Zambia to reinforce its role as a pivotal player in regional politics, particularly in light of recent developments affecting both nations.It is part of a broader strategy to facilitate dialogue and cooperation among African nations.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/56j.jpg",
            "description": "Online Writer THIS morning, a delegation from Zambia, led by former Vice President Enoch Kavindele, made a significant courtesy visit to His Excellency President Emmerson Mnangagwa at State House in Harare. The meeting depicts the strengthening ties between Zambia and Zimbabwe, particularly in areas of trade, security, and regional cooperation. Mr Kavindele’s visit comes at […]",
            "time": "20:39",
            "date": "19 Dec 2024"
        }
    ]
}