{
    "news": [
        {
            "title": "PhosAgro Wins Second Consecutive Top Prize at Responsible Business Leaders National Awards",
            "url": "https://www.chronicle.co.zw/phosagro-wins-second-consecutive-top-prize-at-responsible-business-leaders-national-awards/",
            "content": "Moscow  During the 34th Congress of the Russian Union of Industrialists and Entrepreneurs, with Russian President Vladimir Putin in attendance at the plenary session, PhosAgro Group was awarded the top prize at the Responsible Business Leaders National Awards for the second year in a row.\n\nAfter three stages of evaluation, PhosAgro received the highest score among all participating companies, securing the top prize for the second year in a row.\n\nThe evaluation criteria took into account companies overall sustainability performance based on leading Russian indices and sustainability rankings, as well as companies role in finding solutions to social issues through corporate programmes aligned with key strategic development priorities.\n\nPhosAgro CEO Mikhail Rybnikov said: PhosAgro is honoured to receive this prestigious award for the second time. Ever since our Company was founded, our focus has always been on people: our employees, their families and all the residents of the regions where we operate.\n\nThats why our operations are inextricably linked to our efforts in the social sphere. Last year, we allocated a record RUB 14.5 billion for social and charitable projects, an increase of 20% from 2023. And we allocated another RUB 14 billion for environmental activities, a 26% year-on-year increase.\n\nThis is the foundation that has enabled us to achieve new production records year after year. Last year, we produced 11.8 million tonnes of agrochemical products, and this year we expect to reach a new all-time high, producing over 12.5 million tonnes. This represents a substantial contribution on the part of PhosAgro to ensuring the countrys food security.\n\nWe intend to remain committed to balancing our efforts to increase production with our commitment to the social responsibility.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/PhosAgro-.jpg",
            "description": "Moscow – During the 34th Congress of the Russian Union of Industrialists and Entrepreneurs, with Russian President Vladimir Putin in attendance at the plenary session, PhosAgro Group was awarded the top prize at the Responsible Business Leaders National Awards for the second year in a row. After three stages of evaluation, PhosAgro received the highest […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "No questions asked!: Chivayo puts up US$100 000 reward for armed robbery suspects",
            "url": "https://www.chronicle.co.zw/no-questions-asked-chivayo-puts-up-us100-000-reward-for-armed-robbery-suspects/",
            "content": "Showbiz Reporter\n\nFlamboyant businessman Wicknell Chivayo has offered a US$100 000 reward for information leading to the arrest of suspects involved in a robbery at his in-laws farm in Marondera, just days after he paid lobola for Lucy Muteke.\n\nPosting on his Facebook page this evening, Chivayo expressed regret over the incident, which took place in the early hours of March 18, 2025, at Alpha and Omega Farm.\n\nIt is with utmost regret that I share a very unfortunate incident that occurred at my in-laws residence in Marondera. According to information confirmed by the Zimbabwe Republic Police, a case of armed robbery is under investigation involving 20 suspects who unlawfully gained access to my in-laws residence and stole a significant sum of money and various valuable items, wrote Chivayo.\n\nCondemning the crime, he urged the public to assist law enforcement with any information that could lead to the identification and arrest of the perpetrators.\n\nTo support this public effort, I am offering a reward of US$100 000 in hard cash to anyone who provides credible information leading to the positive identification of any or all of these shameless robbers, their residential locations, or other significant particulars, ultimately resulting in their arrest.\n\nThis reward is offered on a no-questions-asked basis, provided any of the culprits are identified and apprehended.\n\nChivayo also shared contact details of key police officials and departments, urging people with information to reach out immediately.\n\nAccording to a statement from the Zimbabwe Republic Police (ZRP), the robbery occurred at around 1:00am, with suspects making off with US$74 100 in cash and several valuables, including mobile phones and a firearm. Investigations are ongoing.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fwqW.jpg",
            "description": "Showbiz Reporter Flamboyant businessman Wicknell Chivayo has offered a US$100 000 reward for information leading to the arrest of suspects involved in a robbery at his in-laws’ farm in Marondera, just days after he paid lobola for Lucy Muteke. Posting on his Facebook page this evening, Chivayo expressed regret over the incident, which took place […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "Six armed robbery suspects killed in a shoot-out with police in Bulawayo",
            "url": "https://www.chronicle.co.zw/six-armed-robbery-suspects-killed-in-a-shoot-out-with-police-in-bulawayo/",
            "content": "Online Writer\n\nA DRAMATIC exchange of gunfire between police officers and a gang of armed robbery suspects ended in tragedy in the early hours of 18 March 2025, near the Bulawayo-Victoria Falls tollgate in Insuza.\n\nAccording to a statement from the police, six suspects had spent the entire day drinking and observing operations at the Young Money General Dealer Shop in Insuza before executing a robbery late at night.The assailants, armed with pistols, knives, and axes, stormed the shop, overpowered two victims, and bound their hands with electric cables before covering their faces with blankets.\n\nDemanding gold and cash, the gang ransacked the premises, making off with an undisclosed sum of money, various groceries, a 48-volt lithium battery, an inverter, an amplifier, a nine-kilogram gas tank, and multiple mobile phones. The stolen goods were hastily loaded into their silver Honda Fit, bearing registration number AEY 4843, before they sped off into the night.\n\nOne of the victims managed to alert their employer, who quickly reported the crime to the police. Acting on the tip-off, law enforcement officers swiftly positioned themselves along the Bulawayo-Victoria Falls Road, where they spotted the suspects vehicle approaching the tollgate. When ordered to stop, the gang responded by opening fire on the police, triggering a fierce shoot-out.\n\nIn the chaos, the suspects rammed their vehicle into the tollgates boom barrier in an attempt to escape. However, they were subdued by the responding officers and subsequently transported to the United Bulawayo Hospitals, where they were later pronounced dead.\n\nPolice recovered a cache of weapons from the suspects, including two pistols loaded with four live rounds, two gas-operated pistols, two knives, and an axe. Additionally, some of the stolen property, including the groceries, lithium battery, inverter, gas tank, and amplifier, was found in the vehicle.\n\nIn a firm warning to criminal elements, the ZRP reaffirmed its commitment to combating armed robbery syndicates across the country.\n\nThere is no going back in the fight against armed robbery. Any form of confrontation by criminals will be met with appropriate measures, the statement read.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/01/ARMED-ROBBERY-680x380.jpg",
            "description": "Online Writer A DRAMATIC exchange of gunfire between police officers and a gang of armed robbery suspects ended in tragedy in the early hours of 18 March 2025, near the Bulawayo-Victoria Falls tollgate in Insuza. According to a statement from the police, six suspects had spent the entire day drinking and observing operations at the […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "What we know about the tragic shooting of Detective Constable Cassandra Hove",
            "url": "https://www.chronicle.co.zw/what-we-know-about-the-tragic-shooting-of-detective-constable-cassandra-hove/",
            "content": "Online Reporter\n\nWho is the late Detective Cassandra Hove?\n\nThe late Detective Constable Cassandra Hove\n\nDetective Constable Cassandra Hove, aged 37, was a dedicated member of Bulawayos elite all-female Criminal Investigations Department (CID) unit, Team Lozikeyi. She was a mother of four.\n\nThe late Detective Constable Cassandra Hove\n\nThe late Detective Constable Cassandra Hove\n\nCommissioner Stephen Mutamba\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/What-we-know-680x380.jpg",
            "description": "Online Reporter  Who is the late Detective Cassandra Hove?   Detective Constable Cassandra Hove, aged 37, was a dedicated member of Bulawayo’s elite all-female Criminal Investigations Department (CID) unit, Team Lozikeyi. She was a mother of four. Timeline: March 6, 2025, 8:40 PM: Detective Constable Cassandra Hove is fatally shot during a police operation in […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "Watch: Watch: Snake in car causes rumpus in Bulawayo City centre causes rumpus in Bulawayo City centre",
            "url": "https://www.chronicle.co.zw/watch-watch-snake-in-car-causes-rumpus-in-bulawayo-city-centre-causes-rumpus-in-bulawayo-city-centre/",
            "content": "Michelle Musandinyoz,[emailprotected]\n\nA SNAKE caused an uproar near a popular food outlet along Jason Moyo and Leopold Takawira today in Bulawayo .\n\nWitnesses say they first saw the snakes head partly protuding from a parked car belonging to an unidentified woman.\n\nSome witnesses said they first saw the snake on the pavement and it slithered into the car, leaving them wondering where it could have come from in the middle of the city.\n\nThe snake was later taken away by a man who is believed to be from a snake conservation society .\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/snakepark.jpg",
            "description": "Michelle Musandinyoz, mickyafrica271@gmail.com A SNAKE caused an uproar near a popular food outlet along Jason Moyo and Leopold Takawira today in Bulawayo . Witnesses say they first saw the snake’s head partly protuding from a parked car belonging to an unidentified woman. Some witnesses said they first saw the snake on the pavement and it […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "Robbery at “Madzimai Lulu’s” family farm days after lavish lobola ceremony",
            "url": "https://www.chronicle.co.zw/robbery-at-madzimai-lulus-family-farm-days-after-lavish-lobola-ceremony/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nJoy has quickly turned to sorrow for the family of Lucy Muteke, popularly known as Madzimai Lulu, after an armed robbery at their farm, Alpha Omega in Marondera.\n\nThe incident comes just days after Mutekes partner, businessman Wicknell Chivayo, paid her bride price in a lavish ceremony attended by high-profile guests and featuring luxury vehicles.\n\nAccording to a press statement released by the Zimbabwe Republic Police (ZRP) this afternoon, the robbery took place in the early hours of today, with suspects making off with US$74 100 and other valuables.The Zimbabwe Republic Police is investigating an incident of armed robbery which occurred at Alpha Omega Farm, Marondera, on 18th March 2025 at 01:00hrs, read the statement.Twenty suspects, who are yet to be identified and were armed with rifles, pistols, bolt cutters, machetes, and iron bars, attacked the farm security personnel. They proceeded to attack family members, cut burglar screens, and forced open doors, gaining entry into the family house.The suspects stole US$74 100 in cash, a pistol, a Samsung S24, a Samsung S23, a Samsung Galaxy A35, among other valuables.\n\nThe ZRP has appealed to the public for any information that may lead to the identification and arrest of the suspects.Anyone with information should feel free to contact the National Complaints Desk on (02420) 703631, WhatsApp 0712800197, or report to the nearest police station, the statement concluded.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/thyhyhayhya.jpg",
            "description": "Sipepisiwe Moyo,moyosipepisiwe@gmail.com Joy has quickly turned to sorrow for the family of Lucy Muteke, popularly known as “Madzimai Lulu”, after an armed robbery at their farm, Alpha Omega in Marondera. The incident comes just days after Muteke’s partner, businessman Wicknell Chivayo, paid her bride price in a lavish ceremony attended by high-profile guests and featuring […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "Grace Choir to host inaugural live DVD recording",
            "url": "https://www.chronicle.co.zw/grace-choir-to-host-inaugural-live-dvd-recording/",
            "content": "Showbiz Reporter\n\nThe Tabernacle of Grace Choir is set to mark a significant milestone in its 20-year ministry with its inaugural live DVD recording, scheduled for April 13.\n\nThe event will take place at the Grace Centre in Harare and is open to all with free entry.\n\nThis special recording will highlight the choirs commitment to spreading the messages of righteousness, evangelism, worship, fellowship, and charity. It will serve as a powerful testament to the dedication of the Grace Choir and the unwavering support of the community.\n\nAs we celebrate 20 years of ministry, this live recording will be a celebration of the hard work of the Grace Choir and the strength of our community, said a representative of the choir.\n\nOur vision is to bring the power of God to people worldwide and to raise individuals who embody the character of Jesus Christ.\n\nIn addition to celebrating this important milestone, a portion of the events proceeds will be used to complete the Grace Centre and provide support to the less privileged members of the community.\n\nWe are committed to using this platform to create a positive impact and extend our reach to those in need, the choir spokesperson added.\n\nFor two decades, the Grace Choir has been spreading the gospel, aiming to raise individuals who reflect Christs character, while also serving the community with a message of hope and love.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/grace.jpg",
            "description": "Showbiz Reporter The Tabernacle of Grace Choir is set to mark a significant milestone in its 20-year ministry with its inaugural live DVD recording, scheduled for April 13. The event will take place at the Grace Centre in Harare and is open to all with free entry. This special recording will highlight the choir’s commitment […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "Fastjet Zimbabwe introduces Harare-Lusaka route",
            "url": "https://www.chronicle.co.zw/fastjet-zimbabwe-introduces-harare-lusaka-route/",
            "content": "Melissa Mpofu,[emailprotected]\n\nFast-growing airline, Fastjet Zimbabwe, has announced the introduction of a new scheduled flight service from Harare to Lusaka, set to commence on April 9.\n\nThe new route will operate three times a week  on Mondays, Wednesdays, and Fridays. Flights will depart Harare at 6:00am, arriving in Lusaka at 6:55am, before returning at 7:25am, and landing back in Harare at 8:20am.\n\nThis marks Fastjets third regional route, following its existing flights to Johannesburg and Nelspruit in South Africa. Domestically, the airline services Bulawayo-Harare and Harare-Victoria Falls routes.\n\nFastjet Zimbabwe spokesperson, Nunurai Ndawana, expressed excitement over the new development.Fastjet Zimbabwe, the award-winning airline, is pleased to introduce a scheduled flight service from Zimbabwes capital city, Harare, to Lusaka, Zambia, starting on Wednesday, April 9, 2025. This new route will operate with a 50-seater Embraer ERJ145 aircraft, offering a comfortable experience with generous legroom while ensuring efficiency in regional connectivity.Ndawana highlighted the economic and social ties between Zimbabwe and Zambia, stressing Fastjets role in strengthening regional cooperation.The introduction of this route is a testament to our commitment to fostering economic and social development within the Zim-Zam region. For 10 years, Fastjet Zimbabwe has been a proud part of the Zimbabwean community, and we are delighted to expand our reach to Lusaka.\n\nFastjet Zimbabwe Business chief executive officer and country head, Donahue Cortes, said the airlines flight schedule is tailored for convenience.No other airline offers an early morning flight on this route. Our schedule ensures both business and leisure travellers can maximise their time in their destination city. This new Lusaka flight aligns with our focus on early morning departures, joining our sunrise flights to Bulawayo and Johannesburg.\n\nThe new route complements Emirates airline existing service, which connects customers to Zimbabwe via Zambia as part of its Dubai-linked route-sharing arrangement.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yuik.jpg",
            "description": "Melissa Mpofu, mellisa.mpofu@chronicle.co.zw Fast-growing airline, Fastjet Zimbabwe, has announced the introduction of a new scheduled flight service from Harare to Lusaka, set to commence on April 9. The new route will operate three times a week – on Mondays, Wednesdays, and Fridays. Flights will depart Harare at 6:00am, arriving in Lusaka at 6:55am, before returning […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "BCC says Tshabalala water not safe for drinking pending contamination tests",
            "url": "https://www.chronicle.co.zw/bcc-says-tshabalala-water-not-safe-for-drinking-pending-contamination-tests/",
            "content": "Chronicle Writer\n\nTHE Bulawayo City Council (BCC) has warned residents of Tshabalala suburb not to drink tap water in the area owing to a suspected case of water contamination following a leakage from overflowing sewerage.The water contamination was first reported by residents in Tshabalala areas of Mondela Beer Garden and Tshabalala Extension who reported smelly water coming out of their taps.A water bowser has since been dispatched by council to supply water in the affected areas and residents have been instructed not to drink tap water pending final testing.The community through the Ward Councillor has been advised not to drink the water pending final testing after completion of the repairs and flushing of the water system, reads a statement issued Tuesday.Water supplies are currently open to allow for continuous flushing of the system and final testing by the Water Quality team.On Monday 10 March 2025 in Tshabalala areas of Mondela Beer Garden and Tshabalala Extension there were reports of smelly water coming out of the taps. The reports highlighted a sewer blockage and overflowing sewers behind Mondela Beer Garden and a water leakage at the same place,The following day council sewer teams responded to a sewer blockage at 7529/25 Tshabalala.This fault was prioritised ahead of other faults as it was suspected to be linked with poor quality of drinking water in the area. Other blockages in the vicinity (64647 Tshabalala, Indlovu Youth Centre, Mondela Beer Garden) were also cleared in coordination with water teams who kept the water lines under pressure to avoid ingress of sewage into the water lines, said council.To maintain public healthy safety, council said its teams conducted inline chlorination in addition to monitored flushing of the system after completion of the repairs.The teams continue with investigation and close monitoring of the reported possible contamination cases, said the local authority, adding that water samples have been taken to a laboratory for analysis.Meanwhile, an exercise to identify system misusers is being carried out with backyard kitchens in the shopping centers being the probable culprits for throwing bones into the sewer system.Council has noted that the area has been enlisted as one of the hotspots to be attended by contractors under the ongoing Framework Agreement of clearing of sewer blockages.A total of 130 metres of pipes will be replaced after investigations conducted last year indicated ingress of silt showing an underground pipe breakage.A truck load of sand together with rags, bottles and bones were removed showing that there is also a high system misuse exacerbating the situation, said council.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/11/Untitled-18-1.jpg",
            "description": "Chronicle Writer THE Bulawayo City Council (BCC) has warned residents of Tshabalala suburb not to drink tap water in the area owing to a suspected case of water contamination following a leakage from overflowing sewerage. The water contamination was first reported by residents in Tshabalala areas of Mondela Beer Garden and Tshabalala Extension who reported […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        },
        {
            "title": "“Killer Cop” remanded to 1 April… advised to apply for bail at the High Court",
            "url": "https://www.chronicle.co.zw/killer-cop-remanded-to-1-april-advised-to-apply-for-bail-at-the-high-court/",
            "content": "Peter Matika,[emailprotected]CONSTABLE Nomore Muradzikwa, who allegedly confessed to fatally shooting Detective Constable Cassandra Hove a fortnight ago has been remanded in custody to 1 April.Muradzikwa appeared before Mr Maxwell Ncube for initial remand on Tuesday afternoon at the Magistrate Courts at Tredgold Building in Bulawayo.He was advised to apply for bail at the High Court of Zimbabwe in Bulawayo.Muradzikwa is being represented by Mr Tinashe Tashaya of Sengweni Legal Services.Ms Nkanyezi Xaba represented the State.More to follow\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/yujhnahna.jpg",
            "description": "Peter Matika,peter.matika@chronicle.co.zw CONSTABLE Nomore Muradzikwa, who allegedly confessed to fatally shooting Detective Constable Cassandra Hove a fortnight ago has been remanded in custody to 1 April. Muradzikwa appeared before Mr Maxwell Ncube for initial remand on Tuesday afternoon at the Magistrate Courts at Tredgold Building in Bulawayo. He was advised to apply for bail at […]",
            "time": "21:46",
            "date": "18 Mar 2025"
        }
    ]
}