{
    "news": [
        {
            "title": "President to preside over Extraordinary SADC Summit on DRC",
            "url": "https://www.chronicle.co.zw/president-to-preside-over-extraordinary-sadc-summit-on-drc/",
            "content": "Wallace Ruzvidzo, Harare Bureau\n\nTHE chairman of SADC, President Mnangagwa, will tomorrow preside over a crucial Extraordinary Regional Summit of Heads of State and Government, where leaders will convene virtually to discuss the deteriorating security situation in eastern Democratic Republic of Congo (DRC).\n\nThis emergency meeting comes on the heels of recent attacks by the M23 rebel armed group on Congolese security forces, SADC troops, and civilians in the region.\n\nThe summit is being convened following the virtual Extraordinary SADC Organ Troika Summit held last week.In a communique released yesterday, the SADC Secretariat said tomorrows Extraordinary Summit will extensively deliberate on the recommendations from the virtual Troika meeting.\n\nSADC Chairperson President Mnangagwa\n\nThe SADC Summit is responsible for setting the overall policy direction and controlling the functions of the regional bloc, making it the primary policy-making institution of the region.\n\nThe Southern African Development Community (SADC) will hold an Extraordinary Summit of Heads of State and Government on 13th March 2025 in a virtual format to discuss the security situation in the Democratic Republic of Congo (DRC).\n\nHis Excellency Dr Emmerson Dambudzo Mnangagwa, President of the Republic of Zimbabwe and Chairperson of SADC, will chair the Summit.\n\nThe Summit will receive updates on the latest security situation in the DRC and deliberate on the recommendation from the Extraordinary SADC Organ Troika Summit, which was held on the 6th of March 2025, said the Secretariat.President Mnangagwa has reaffirmed the regional bodys commitment to the realisation of lasting peace in the eastern DRC.\n\nThe people of the eastern DRC have suffered for far too long. SADC condemns in the strongest terms the attacks by aggressor forces. While we pause to mourn our loss, our resolve to ensure collective security cannot be shaken, he said.\n\nTo this end, our region stands ready to intensify efforts to protect SADC citizens from all forms of instability, in line with the SADC Mutual Defence Pact.\n\nThe peace and security of our region is a shared obligation, said the President during the last SADC Extraordinary Summit held in Harare on January 31.\n\nDespite efforts by SADC and the East African Community (EAC), fighting between Congolese security forces and the M23-led rebel group, has intensified in recent weeks.\n\nThe rebels, who had previously entrenched themselves in Goma in North Kivu, have now expanded their presence to the South Kivu capital Bukavu, establishing new administrative structures in the city.\n\nThe conflict has fuelled one of the worlds most severe humanitarian crises, with over 1 million Congolese seeking refuge beyond the countrys borders and about 21 million people within the country in urgent need of medical aid, food, and other essential supplies.\n\nSince the start of last year, nearly 358 000 people have been displaced, with 80 percent of this displacement linked to armed conflict. New UN-verified data also reveals a 30 percent rise in grave violations against children in eastern DRC compared to 2023.\n\nMeanwhile, Zimbabwe will today host the SADC Council of Ministers meeting to be presided over by Foreign Affairs and International Trade Minister Professor Amon Murwira as Chair of the Council.\n\nThe SADC Council of Ministers plays a crucial role in overseeing the function and development of SADC.It consists of Ministers from each of the 16 SADC member States, typically from ministries related to Foreign Affairs, Economic Planning, Finance, or Trade, and meets biannually in March and August.\n\nIn a statement yesterday, Foreign Affairs and International Trade director public diplomacy, communication and advocacy Mrs Philisiwe Chidawanyika said the Council will review the status of implementation of previous Council and Summit decisions.\n\nThe meeting was preceded by the SADC Standing Committee of Senior Officials, the finance committee meeting and the meeting of senior officials and key experts on the implementation of the Regional Indicative Strategic Development Plan (RISDP) 2020-2030, that were held at the New Parliament Building from March 4 to 7, 2025, she said.\n\nOn the SADC-European Union (EU) Ministerial Partnership Dialogue to be held on Saturday, Mrs Chidawanyika said Prof Murwira will co-chair the meeting with Polands Minister of Foreign Affairs, Radoslaw Sikorski.\n\nPoland is holding the rotating Presidency of the Council of the European Union.The Ministerial Dialogue will be preceded by the SADC and EU Senior Officials Dialogue on March 14, 2025.\n\nThe SADC-EU Dialogue was launched in 1994 as a platform to reinforce the relations between SADC and the EU, and promote co-operation in peace and security, trade, and policies aimed at sustainable economic growth.\n\nThe dialogue will take stock of progress in the implementation of the SADC-EU Co-operation programmes, and the 2021-2027 Multiannual Indica Programme for Sub Saharan Africa (MIP SSA), she said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ERYRFGDFGLG.jpg",
            "description": "Wallace Ruzvidzo, Harare Bureau THE chairman of SADC, President Mnangagwa, will tomorrow preside over a crucial Extraordinary Regional Summit of Heads of State and Government, where leaders will convene virtually to discuss the deteriorating security situation in eastern Democratic Republic of Congo (DRC). This emergency meeting comes on the heels of recent attacks by the […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "ZWG11,6Bn for road repairs… infrastructure faces severe damage from rains",
            "url": "https://www.chronicle.co.zw/zwg116bn-for-road-repairs-infrastructure-faces-severe-damage-from-rains/",
            "content": "Peter Matika,[emailprotected]\n\nA total of ZWG11,6 billion will be disbursed to road authorities this year through the Zimbabwe National Road Administration (Zinara) as the Government intensifies efforts to repair road infrastructure, which has been severely affected by incessant rains across the country.\n\nThe Government has already extended the Emergency Road Rehabilitation Programme (ERRP2) in response to the widespread damage to roads, which has seen some rural communities cut off due to the destruction of bridges. Commuter omnibus operators have also shunned certain routes in urban centres due to severe potholes and gullies.\n\nDeveloping an efficient road transport system is a key economic enabler for logistics and a critical pillar under the National Development Strategy (NDS1), which aims to build momentum towards Vision 2030.\n\nHowever, due to extensive damage to the countrys roads, some businesses are feeling the pinch of fleet repairs, resulting in high transportation costs, an inability to efficiently supply goods, and difficulties transporting people to their usual destinations, as well as adverse impacts on leisure activities.\n\nWhile minimal pothole patching works are ongoing on critical portions, the ZWG11,6 billion Zinara disbursement plan is expected to cover significant ground in the rehabilitation of major roads, easing the burden on road authorities, who are expected to begin large-scale roadworks once the rainy season ends.\n\nThe disbursements will be made to major road authorities, including local authorities, the Department of Roads, and the Rural Infrastructure Development Agency (Rida), who will also benefit from an allocation of two million litres of fuel to enhance operations.\n\nZinara has set aside a proposed budget of ZWG11,6 billion for financial disbursements for the year and will continue with the momentum to capacitate road authorities to draw down their annual budgets effectively, said Zinara in a recent public report for 2024 issued over the weekend.\n\nZinara has also made provisions for a further two million litres of fuel to add to the financial disbursements. Further to these disbursements, Zinara will continue to provide technical support through periodic refresher training as well as project support by the Zinara provincial engineers.\n\nWith the receipt of the 2025 road maintenance plans and programmes of work from all 94 road authorities, the road authority said preparations were already underway for the first quarter disbursements to support these projects.Looking back, Zinara noted that despite limited funding, the year 2024 saw significant progress towards achieving Vision 2030 in terms of road rehabilitation and maintenance.\n\nAccording to the report, road authorities achieved 122 percent of their planned works, surpassing the initial national target of 30 000 km and reaching an impressive 37 000 km.\n\nThis is compared to the prior years achievement of 23 000 km of roads maintained, said the authority.Some key projects undertaken in 2024 include part of the Bulawayo-Nkayi Road rehabilitation project, the Nyanga-Ruwangwe Road resurfacing project, the Shurugwi-Mhandamabwe 42 km road rehabilitation, the Golden Valley-Sanyati road project, and the greater Harare roads projects, among others.\n\nZinara\n\nThe comprehensive support system is part of the road authoritys holistic approach to ensuring the success of infrastructure development initiatives nationwide.\n\nLast year, Zinara reported that total disbursements closed at ZWG4,6 billion, driven by enhanced collections through improved revenue mechanisms and the increased project scope of special public interest projects, which required more funding.\n\nThe report stated that 53 out of the 94 road authorities utilised over 90 percent of their budgets, with 15 utilising 100 percent of their allocations. Mashonaland East Province, for instance, topped the leaderboard with 95 percent, followed by Matabeleland South Province at 92 percent, and Harare Metropolitan Province at 90 percent. Bulawayo Metropolitan used only 64 percent of their allocation, while Matabeleland North utilised 84 percent of their allocation.\n\nThis is a remarkable new standard, which speaks to improved project implementation and acquittal systems by the road authorities. Its also attributed to the enhanced support being rendered to road authorities through the Zinara provincial engineers, as well as the periodic training programmes facilitated by Zinara, reads the report.\n\nIt also noted that more than 1,9 million litres of fuel was disbursed to all road authorities and that 20 of the road authorities successfully drew down their full allocations.\n\nThe budgeted fuel for the year was two million litres. This initiative was well received by road authorities as it directly resolved a critical operational challenge they had been facing in terms of procuring fuel for their road maintenance activities, said Zinara.\n\nWith the fuel on hand, the road authorities were better equipped to use their equipment for some of the roadworks, and this went a long way to improving the scope of the maintenance works they were able to undertake.\n\nCommenting on the road rehabilitation issue, Bulawayo United Public Transport Association (Bupta) chairperson, Mr Morgan Msipa, expressed excitement over the disbursement schedule and urged Zinara to act swiftly to repair the countrys roads.\n\nIts a good move. Our roads are in a dire and deplorable state. We are excited to hear that funds have been availed for this. Its about time this is done as this has greatly affected our industry, he said.\n\nBulawayo Bus Operators Association chairman, Mr Patrick Dube, who also operates Green Horse buses, shared similar sentiments, urging the road authority to be proactive as the countrys roads are in a poor state.\n\nHe said that as an association, the allocation of road funds is a welcome development at a time when businesses are already feeling the adverse impacts of the damaged terrain.\n\nWe are required to maintain a timetable, but this is impossible due to the poor state of the roads. No bus can stick to the prescribed time because of the damage to the roads, he said.Our vehicles are also getting damaged. If the funds have been availed, they should get to work quickly.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/7656i.jpg",
            "description": "Peter Matika, peter.matika@chronicle.co.zw A total of ZWG11,6 billion will be disbursed to road authorities this year through the Zimbabwe National Road Administration (Zinara) as the Government intensifies efforts to repair road infrastructure, which has been severely affected by incessant rains across the country. The Government has already extended the Emergency Road Rehabilitation Programme (ERRP2) in […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "Cabinet approves10-point national priorities guideline",
            "url": "https://www.chronicle.co.zw/cabinet-approves10-point-national-priorities-guideline/",
            "content": "Nqobile Tshili,[emailprotected]\n\nCABINET has approved a 10-point national priorities guideline to drive the country towards an upper-middle-income economy by 2030, as it accelerates efforts under the second phase of the National Development Strategy (NDS2).\n\nThe second phase builds on the milestones achieved under NDS1, which recorded major successes despite unforeseen challenges such as Covid-19, El Nio-induced droughts, and disruptive geopolitical tensions.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, presented the 10-point plan to Cabinet as he outlined the national priorities for NDS2.\n\nThe 10-point plan includes macroeconomic stability, deepening the financial sector, as well as fostering inclusive economic growth and structural transformation, said Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, in a post-Cabinet media briefing yesterday.\n\nHe said the approved national priorities would serve as a driving force towards the attainment of Vision 2030. NDS2 (2026-2030) is the successor to NDS1, whose implementation concludes at the end of this year.As such, the NDS2: 2026-2030 will be the Second Republics second five-year Medium-Term Plan for achieving the countrys\n\nVision 2030, said Dr Muswere.Government has now adopted 10 national priorities that will guide and underpin the formulation and implementation of the\n\nNDS2 blueprint as follows: macroeconomic stability and financial sector deepening, inclusive economic growth and structural transformation, infrastructural development, housing, and food security, climate resilience, and environmental protection, said Dr Muswere.\n\nOther priorities include technology, innovation, and human capital development, job creation, youth development, the creative industry, and culture.Dr Muswere added that NDS2 will also focus on social development and social protection, regional development and inclusivity through devolution and decentralisation, as well as strengthening the countrys image-building, international diplomacy, trade, good governance, institution building, and security.\n\nHe stated that the Government would conduct an inclusive consultation process before the strategys launch in October.The streamlined national priorities are designed to optimise resource allocation and strengthen sectoral coordination for the effective and impactful delivery of services to the citizenry, he said.\n\nA broad-based consultative process will support Thematic Working Group re-alignment across the different socio-economic sectors, leading to the drafting and launch of NDS2 by October 2025, said Dr Muswere.\n\nHe also mentioned that Cabinet had approved the compendium for the first 100-Day Cycle Projects for 2025, which commenced on February 3 and are expected to be completed by 13 May.\n\nThe Government targets implementing 236 projects spread across all of the countrys provinces.The cycle covers 236 projects, involving ministries and the Rural Infrastructure Development Agency (RIDA). Of the total, 33 projects are being implemented nationwide, while 10 projects will be implemented outside Zimbabwe, said Dr Muswere.\n\nSome of the projects are replicated in more than one province. The nation is informed that the projects were selected based on their potential contribution to the aspirations of Vision 2030, primarily focusing on improving the livelihoods of citizens in all communities, said Dr Muswere.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube\n\nHe added that the projects are distributed according to the 14 thematic areas under NDS1 and are expected to unlock socio-economic growth, with 43 of them falling under the infrastructure and utilities pillar. Of these, 25 projects are being implemented under the devolution and decentralisation thematic area, with Binga in Matabeleland North dominating the transformative projects.\n\nEleven projects contribute to the Binga Development Initiative, covering the construction of a new clinic, completion of new registry offices, and installation of solar energy infrastructure in clinics and registry offices, said Dr Muswere.\n\nAdditionally, 62 projects across the selected 14 ministries, departments, and agencies are aligned with the 21st National Peoples Conference Resolutions.\n\nTo strengthen internal monitoring by the respective ministries, a regular tracking schedule will be followed, while progress as of day 50 will be publicised, in line with standing practice. Site visits to selected projects will be conducted to validate progress across the country, he said.\n\nDr Muswere also noted that following the December 2024 approval of the Presidential Solarisation Programme, significant progress has been made towards providing solar power to 200 000 households.\n\nHe stated that President Mnangagwa will soon launch the Presidential Solarisation Programme to mark the official commencement of the first year of the programme, with a date to be advised.\n\nGuidelines for the implementation of the programme have been established, with stakeholder mapping and identification of beneficiaries in villages across the eight rural provinces already completed, said Dr Muswere.\n\nCommunity mobilisation and awareness processes, spearheaded by the Ministers of State for Provincial Affairs and Devolution, have also been completed.\n\nGraduates of the Youth Service in Zimbabwe, with assistance from experts from the Harare Institute of Technology and the Rural Electrification Agency, will install a total of 200 000 solar kits in the identified households, said Dr Muswere.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/HGG.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw CABINET has approved a 10-point national priorities guideline to drive the country towards an upper-middle-income economy by 2030, as it accelerates efforts under the second phase of the National Development Strategy (NDS2). The second phase builds on the milestones achieved under NDS1, which recorded major successes despite unforeseen challenges such as Covid-19, […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "Investment in lithium soars… Gwanda lithium Mine completes plant",
            "url": "https://www.chronicle.co.zw/investment-in-lithium-soars-gwanda-lithium-mine-completes-plant/",
            "content": "Tapiwanashe Mangwiro, Senior Business Reporter\n\nGWANDA Lithium Mine has completed the construction of its multi-million-dollar lithium processing plant and secured an export permit from the Government.\n\nThis paves the way for the company to commence shipping its lithium concentrate to China.Mines and Mining Development Minister, Winston Chitando, recently confirmed the development in Parliament.\n\nThe lithium project is one of many multi-million-dollar lithium investments the country has witnessed in recent years, as demand for the global energy mineral is forecast to soar.\n\nZimbabwes lithium sector has been experiencing significant investment, particularly from Chinese companies.Notable projects include the US$300 million spodumene processing plant at Bikita Lithium Mine and the US$300 million lithium concentrator at the Arcadia project near Harare.\n\nThe surge in interest in Zimbabwes lithium sector stems from its crucial role in the global transition to clean energy, particularly the electrification of transportation and energy storage.\n\nLithium is a key component of rechargeable batteries for electric vehicles and renewable energy systems.Minister Chitando stated that the Chinese company had since applied for an export licence.Gwanda Lithium Mine has completed the construction of its lithium processing plant and has been following up on the application for an approved processing plant permit from the ministry.\n\nThey were given a waiver to proceed, pending the approval of the permit, Minister Chitando said.Since its inception in January 2024, Gwanda has been producing approximately 1,500 tonnes per day of lithium concentrate.The output, in an increasingly electrified global economy, underscores the mines operational efficiency and potential for growth.\n\nIn the meantime, Gwanda Lithium Mine is currently producing 1,500 tonnes per day of lithium concentrate since its inception in January 2024, the minister added.\n\nIn light of this significant production, the ministry issued a six-month export licence for a trial shipment of 5,000 metric tonnes of lithium concentrate to China.\n\nThis strategic move aims to test and establish viable international markets for the company as it seeks to position itself as a reliable supplier in the global electric battery lithium market.\n\nThe lithium mine employs 300 people, 80 percent of whom are locals.Production is expected to reach one million tonnes of ore and 200000 tonnes of lithium concentrate annually once the plant reaches full production capacity.\n\nThe US$54 million mining venture is a subsidiary of the Chinese global investor Tsingshan Holdings Limited Group, whose other unit last year completed the construction of the US$1,5 billion Dinson Iron and Steel plant in Mvuma, Midlands Province.The groups other two subsidiaries include Dinson Colliery in Hwange, Matabeleland North Province, and Afrochine Smelting in Selous, near Chegutu, Mashonaland West Province.\n\nDinson had earlier expressed interest in setting up a lithium battery manufacturing plant, which led it to secure lithium mining claims in Gwanda.\n\nThe company will thus produce lithium concentrates to support the proposed high-value lithium batteries project in Zimbabwe.Minister Chitando also provided an update in Parliament on the mining activities around the Boterekwa area in the Midlands Province.\n\nThere are currently two mining companies carrying out mining activities in the Boterekwa mountains.These are Chenxi Mining Company and Saironi Mining Company, which both purchased pre-existing mining locations from previous owners, he said.According to the minister, Chenxi Mining Company is conducting surface mining of gold and heap leaching, while Saironi Mining Company is engaged in underground and surface mining, including crushing, milling, carbon-in-pulp (CIP) and elution.\n\nThese activities highlight growing investments and expansions in Zimbabwes mining sector.The investments in the lithium and gold mining sectors reflect a broader strategy to diversify the nations mining portfolio.Supportive Government policies and a pro-business approach have driven investment in modern processing technologies that not only increase production but also improve the quality and marketability of the countrys mineral exports.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/db.jpg",
            "description": "Tapiwanashe Mangwiro, Senior Business Reporter GWANDA Lithium Mine has completed the construction of its multi-million-dollar lithium processing plant and secured an export permit from the Government. This paves the way for the company to commence shipping its lithium concentrate to China. Mines and Mining Development Minister, Winston Chitando, recently confirmed the development in Parliament. The […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "Striking a balance… Why Zimura’s cover song fee needs reassessment",
            "url": "https://www.chronicle.co.zw/striking-a-balance-why-zimuras-cover-song-fee-needs-reassessment/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nThe debate in Zimbabwes music industry continues to rage following the Zimbabwe Music Rights Association (Zimura)s recent introduction of licensing fees for performing cover music.\n\nUnder the new regulations, local bands and artistes must now pay $150 per event to perform cover songs  a move backed by the Copyright and Neighbouring Rights Act (Chapter 26:05).\n\nThis decision has sparked outrage among musicians and their associations, who argue the tariffs are unfair.Musicians and music associations have spoken. Veteran music producer and composer, Clive Mono Mukundu, described Zimuras move as a step in the right direction, stressing the importance of paying composers their dues. However, he feels the enforcement of this policy seems punitive and needs adjustment.\n\nThis issue of music composers receiving payments is actually a good thing and it is common practice worldwide. However, it shouldnt be presented in a way that feels punitive, as if its punishing those performing covers. It also shouldnt be implemented in a way that leaves cover performers with nothing.\n\nPerforming covers isnt a crime. If it were, do you think it would be allowed in the US, where cover performances are widespread? In fact, there are tribute bands that are legally recognised and even appreciated by original artistes. For example, Irish rock band, U2 has cover bands that they sometimes engage for shows. Performing covers isnt about stealing or devaluing someones work  its simply an artistes own interpretation of a song.\n\nLets not be afraid of competition, and lets not resist evolution because if we do, well be hit hard by revolution. We cant fight change, Mukundu said.\n\nComparing Zimbabwes copyright law to those of other countries, Mukundu noted that in many places, cover performers pay licence fees.\n\nIn Australia, they pay quarterly, while in other countries, they pay annually. This is where I object to our local law, where performers are being required to pay for each performance. Even from an administrative perspective, this process would be too complicated and inefficient. Taking inspiration from Australia, Europe and the US, I would prefer a once-off payment per month.\n\nZimura executive director Polisile Ncube-Chimhini\n\nHe also suggested that Zimura consider venue size when determining fees.For instance, someone performing at the HICC (a 4500-seater venue) cannot be expected to pay the same amount as someone performing at restaurants like Gavas and Chop Chop. The venues are different, so the fees should vary accordingly, just as they do in Western countries.\n\nAdditionally, there are musicians or bands who perform mostly original music and include just one or two cover songs  like Mbeu, Alick Macheso or the late Oliver Mtukudzi, who occasionally played Steve Makonis Handiende. These artistes cannot be compared to those who perform covers from start to finish. There should be variations in how this is regulated.\n\nIn the Western world, artistes submit setlists of the songs they will be performing so that the composers of cover songs receive their dues. From my perspective, this system should also be implemented here to help Zimura fairly compensate composers.Mukundu advised artistes not to be discouraged by Zimuras decision, saying that the organisation is simply fulfilling its mandate to represent composers.\n\nZimura is doing its job, and now its up to disgruntled artistes to seek proper representation  a strong union that can voice their concerns.\n\nAdding their voice, the Zimbabwe Musicians Union (Zimu) strongly opposed Zimuras directive, calling it a unilateral licensing fee directive.\n\nThe Zimbabwe Musicians Union (Zimu) denounces Zimuras sudden imposition of a US$150 licensing fee on artistes\n\nperforming cover songs. This directive contravenes both global best practices and Zimbabwean law.Globally, licensing fees for public performances are the responsibility of venues and promoters, who secure licences to cover all performances within their spaces, with royalties distributed to creators. This is standard practice in jurisdictions like the United States, South Africa and the European Union and has also been implemented by Zimura for years. By abruptly shifting this burden to artistes, Zimura has disrupted a longstanding system, sowing confusion and anxiety across the industry, read part of Zimus statement.\n\nZimu also criticised Zimuras lack of clarity on the enforcement of this fee, arguing that it has already led to the immediate suspension of live performances in some venues, leaving thousands of artistes jobless.\n\nThis lack of transparency has already led to risk-averse venues suspending live performances, stripping thousands of artistes of their livelihoods overnight. Families reliant on gig income now face an uncertain future.\n\nOf particular concern is the impact on women in music, many of whom depend on cover performances to sustain their careers. In response, Zimus United Women in Music desk is preparing to petition the Ministry of Women Affairs to address this crisis, which threatens decades of progress for female artistes, read the statement.Zimu also questioned how rural artistes, who already face marginalisation, are expected to absorb this additional financial burden.\n\nThe policys architects have not explained how rural artistes  already struggling  can afford this cost. Instead of fostering creativity, Zimuras fee threatens to silence a generation of musicians, many of whom rely on performances to support their families.\n\nZimu went on to demand immediate withdrawal of the $150 artiste fee, restoration of compliance obligations to venues and promoters and urgent stakeholder dialogue involving Zimu, artistes, Government, and copyright holders to design equitable solutions.\n\nThe Music Management Forum of Zimbabwe (MMFZ) also expressed concern over Zimuras licensing fee, labelling it exorbitant and detrimental.\n\nThe Music Management Forum of Zimbabwe is alarmed by Zimuras hefty tariff imposed on cover bands, which is effectively stifling the growth of live music in Zimbabwe.\n\nThese musicians do not publish their own works and rely on performing existing songs to make a living. Internationally, cover bands are recognised as a legitimate profession and in Zimbabwe, they play a vital role in promoting music and providing entertainment, MMFZ said in a statement.\n\nMMFZ further argued that Zimuras tariff of $150 per gig is excessive and unaffordable for cover bands, who are already among the lowest-paid musicians in the industry.\n\nThis tariff effectively acts as a ban on cover bands, criminalising them indirectly. Furthermore, MMFZ is concerned that Zimura has failed to protect the intellectual property of its members in the past, as seen in cases involving artistes like Charles Charamba, Dino Mudondo and the late Leonard Dembo.\n\nZimuras failure to protect its members intellectual property, combined with its exorbitant tariff on cover bands, raises questions about its priorities and commitment to promoting Zimbabwes music industry, MMFZ stated.MMFZ called on Zimura to reconsider its stance and engage with stakeholders to find a fair and sustainable solution.\n\nHowever, Zimura remained resolute in its stance. Its executive director Polisile Ncube-Chimhini stated that their primary objective is to protect the intellectual property rights of local, regional, and international rights holders, including composers, publishers and producers of music.\n\nIn accordance with the Copyright and Neighbouring Rights Act Chapter 26:05, we are mandated to issue licences to anyone who performs or plays music publicly.\n\nConcerns have been raised regarding our licensing fee of $150 per event for bands performing copyrighted music. We understand these concerns and appreciate the opportunity to provide clarity. The licensing fee is a necessary measure to ensure that original creators receive fair compensation for their work, she said.\n\nNcube-Chimhini noted many bands have been exploiting copyrighted music without obtaining proper licences or paying royalties to the original creators.\n\nThis has resulted in original music composers being pushed out of business. Venue owners and promoters often prefer cover bands that perform music from various rights holders rather than hiring the original artistes who charge a standard fee per show.\n\nThis unfair competition has left many music creators without jobs. Our licensing fee is based on thorough research, indicating that cover bands can earn between $300 to $700 or more per event, depending on their popularity. We firmly believe that a portion of this revenue should go to the original creators, she said.\n\nShe said this policy aims to ensure rights holders receive fair compensation and promote a sustainable music industry that respects intellectual property rights.\n\nWe urge bands and event organisers to obtain the necessary licences from Zimura and respect the rights of music creators. As a collective management organisation, Zimura is dedicated to advocating for the rights of music creators and ensuring fair compensation for their work. By working together, we can build a vibrant and sustainable music industry that benefits all stakeholders, she added.  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/fvrcf.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com The debate in Zimbabwe’s music industry continues to rage following the Zimbabwe Music Rights Association (Zimura)’s recent introduction of licensing fees for performing cover music. Under the new regulations, local bands and artistes must now pay $150 per event to perform cover songs — a move backed by the Copyright and Neighbouring […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "COMMENT: Tablets donation underscores Government’s efforts to see the youth tech-savvy",
            "url": "https://www.chronicle.co.zw/comment-tablets-donation-underscores-governments-efforts-to-see-the-youth-tech-savvy/",
            "content": "PRESIDENT Mnangagwas recent fulfilment of his promise to provide tablets and other ICT tools to members of the Junior Parliament of Zimbabwe is a commendable step towards enhancing digital literacy, among young people.\n\nThis initiative underscores the governments recognition of the critical role that technology plays in education, governance and economic participation.\n\nBy equipping the youth with digital tools, the government is fostering a generation that is not only tech-savvy but also prepared to contribute meaningfully to the national development agenda.\n\nThe distribution of these gadgets, as seen in Manicaland Province, is a tangible demonstration of the Presidents commitment to youth empowerment.\n\nMinister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza, highlighted that this move aligns with the National Digital Ambassador Programme, which aims to provide 1,5 million Zimbabwean youths with digital skills by 2030.\n\nThe Presidents responsiveness to the Junior Parliaments request reinforces his administrations vision of inclusive development, ensuring that no young person is left behind in the digital age.\n\nAccess to digital tools is no longer a luxury but a necessity. In an era where information is power, these tablets will enable young leaders to engage in research, enhance communication, and participate actively in national discourse.\n\nThe Junior Parliamentarians, as representatives of the countrys youth, will not only benefit personally but also serve as digital ambassadors who can impart knowledge to their peers. Such an approach fosters a ripple effect, allowing for widespread digital literacy that can drive socio-economic transformation.\n\nMoreover, the integration of digital literacy into the educational system is vital for Zimbabwes long-term economic growth. The Heritage-Based Curriculum being implemented in schools places a strong emphasis on technology, and these tablets will significantly aid in its successful adoption. Digital literacy is more than just knowing how to use a device, it is about understanding online safety, critical thinking and leveraging digital tools for innovation and entrepreneurship.If effectively implemented, this initiative can unlock opportunities for young Zimbabweans in fields such as e-commerce,\n\nsoftware development and digital marketing.This milestone must be complemented by broader infrastructural support. Internet connectivity, affordable data and training programmes are necessary to ensure that these gadgets are fully utilised.\n\nThe government must work with stakeholders, including private sector partners, to establish robust digital infrastructure, particularly in remote areas where access remains limited.\n\nThe initiative represents a crucial step towards equipping young Zimbabweans with the skills they need to thrive in a rapidly evolving digital world.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/xcdfsxczxcz.jpg",
            "description": "PRESIDENT Mnangagwa’s recent fulfilment of his promise to provide tablets and other ICT tools to members of the Junior Parliament of Zimbabwe is a commendable step towards enhancing digital literacy, among young people. This initiative underscores the government’s recognition of the critical role that technology plays in education, governance and economic participation. By equipping the […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "Fifa lift Bosso ban",
            "url": "https://www.chronicle.co.zw/fifa-lift-bosso-ban/",
            "content": "Sports Writers\n\nFIFA have lifted the transfer ban imposed on Highlanders, which had prevented the Bulawayo giants from signing new players due to the club owing former coaches Baltemar Brito and his assistant, Antonio Joao Torres.\n\nThe ban was imposed after Bosso failed to pay the duo US$27000 in allowances and winning bonuses for their 2022-2023 stint with the club.\n\nHowever, last month, Harare-based businessman Wicknell Chivayo, pledged to settle the debt. Earlier this month, Torres confirmed on social media that they had been compensated, expressing gratitude to the benefactor.\n\nBosso had been eagerly waiting for Fifa to lift the ban, which would allow the club to register new signings and strengthen their squad for the 2025 season, which is already underway.\n\nHarare-based businessman Wicknell Chivayo.\n\nFinally, the wait is over! We are delighted to announce that the Fifa ban has been lifted, thanks to the efforts of a dedicated Fifa team, and everything has been resolved.\n\nOnce again, a special thank you to Sir Wicknell Chivayo for facilitating the payment. With this hurdle cleared, we can now register our new signings. They could be part of our squad for the upcoming match against Green Fuel. Ukhonozokhala! announced Bosso yesterday.\n\nThe transfer ban had come at a difficult time for the club, which had just lost key players Peter Muduhwa, Lynoth Chikuhwa, Godfrey Makaruse and Marvelous Chigumira to Premier Soccer League side, Scottland FC.\n\nMeanwhile, Highlanders have shown a strong commitment to their players welfare by rewarding them for their emphatic 4-0 victory over Kwekwe United. The club ensured that both players and the technical staff were paid their well-deserved winning bonuses and allowances on Monday, a gesture that will surely boost morale within the Bosso camp ahead of their next match against Greenfuel on Saturday.\n\nThis timely payment is particularly significant following a challenging pre-season period, which saw delays in salary payments that led to players missing some training sessions due to growing frustration.\n\nWith the teams financial and operational challenges gradually being addressed, Highlanders future looks promising as they focus on building momentum and securing further wins.\n\nHighlanders players celebrate their first goal against Kwekwe United on Sunday\n\nJust before the start of the season, Bosso lost the services of four key players  Muduhwa, Chikuhwa, Makaruse, and Chigumira  who all joined the moneybags of Scottland FC in Harare. As a result, Bossos squad depth was severely compromised.Among the notable signings that Bosso have made is defender Malvern Hativagoni, who joins on a one-year loan deal from Bulawayo Chiefs.\n\nStriker Never Rauzhi, also from Bulawayo Chiefs, is set to return to Highlanders despite strong interest from TelOne. Rauzhi, a talented and quick forward, has struggled with injuries since his initial move to Bosso but is now fit and ready to rediscover his form for the upcoming season.\n\nWinger Tendai Muvuti, who played for Hwange FC last season and has previous experience with Bulawayo Chiefs, will add much-needed depth to the attacking options at Bosso. Midfielder Hubert Ncube from ZPC Hwange will also join the team, bringing energy and creativity to the midfield, while former Chegutu Pirates striker Panashe Mushonga will provide additional firepower up front.\n\nThe attacking department will further be bolstered by the arrival of 26-year-old Mbonisi Ncube, who has played for BDF XI in Botswana.\n\nWith the teams financial and operational challenges gradually being addressed, Highlanders future looks promising as they focus on building momentum and securing more victories.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/UUU.jpg",
            "description": "Sports Writers FIFA have lifted the transfer ban imposed on Highlanders, which had prevented the Bulawayo giants from signing new players due to the club owing former coaches Baltemar Brito and his assistant, Antonio Joao Torres. The ban was imposed after Bosso failed to pay the duo US$27 000 in allowances and winning bonuses for their […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "Chiefs optimistic of good harvest",
            "url": "https://www.chronicle.co.zw/chiefs-optimistic-of-good-harvest/",
            "content": "Nqobile Tshili,[emailprotected]\n\nTRADITIONAL leaders across the country have expressed optimism for a bumper harvest this summer season, a development expected to bolster household food security as the country emerges from a devastating El Nio-induced drought.\n\nZimbabwe recently experienced one of its worst droughts since independence nearly 45 years ago, leaving over six million people food insecure. Communal farmers also suffered significant livestock losses due to depleted pastures. However, the La Nia weather phenomenon has brought improved rainfall, offering renewed hope to rural communities that had relied on Government food aid.\n\nThe heavy rains have replenished most communal dams, ensuring a stable water supply for domestic use, livestock and irrigation.\n\nNational Council of Chiefs president, Chief Mtshane Khumalo, said the favourable conditions have raised expectations of a successful farming season, particularly for those who embraced the Governments Intwasa/Pfumvudza conservation farming method.\n\nThis years farming season is much better compared to last year. Communities that planted early under the Intwasa/Pfumvudza programme are expecting a bumper harvest, he said.\n\nHowever, Chief Mtshane Khumalo noted some farmers relying on cattle-drawn ploughing faced delays in planting, as many animals had not yet recovered from the effects of drought.\n\nDespite this, he expressed confidence that food availability will improve.I am confident that even those who may not harvest much will not struggle, as grain will be readily available within communities, making food more accessible and affordable, said Chief Mtshane Khumalo.Chief Mtshane Khumalo said that in most areas, community dams are full, ensuring a stable water supply.\n\nEven the boreholes that had dried up due to low water tables are now functioning again. The abundant rains have also ensured that dams are spilling, which is promising for both human consumption and livestock needs in the coming months, he said.Chief Mtshane Khumalo said the improved harvest will alleviate pressure on the Government, which had been forced to allocate additional funds for food aid.\n\nHe said that while the Government provided grain to many communities, challenges in transporting it to remote areas persisted.\n\nChief Nkalakatha from Nkayi, Matabeleland North, echoed similar sentiments, saying his community is already harvesting fresh maize, helping to mitigate food shortages.\n\nHe said the community is still receiving grain from the Government as part of the drought mitigation efforts.We were experiencing transport challenges before the community resolved to pay US$3 for the transportation of maize. So, all the glitches that were there in terms of transporting the relief grain are now over, said Chief Nkalakatha.He said the improved harvest will further reduce reliance on food aid.\n\nFurthermore, we are expecting a better harvest this year, which will alleviate the drought that we experienced in the past year, said Chief Nkalakatha.\n\nChief Maduna\n\nIn Matabeleland South, Chief Maduna from Insiza District said there were positive developments, attributing the improved agricultural outlook to the sustained rainfall.\n\nChief Madlambuzi from Bulilima added that livestock, which had been severely affected by the drought, are now recovering due to improved grazing conditions.\n\nWe are coming from a difficult period where the drought was not only affecting the people but their livestock. Since the rains intensified, pastures have improved and the animals are now in good shape, he said.We are also grateful to the Government that was able to provide our people with grain during the peak of the drought. Now, some have already started harvesting fresh maize from their fields.\n\nMeanwhile, the Government has said it managed to deliver 74 percent of the total relief grain to vulnerable communities, despite delays in Treasury payments to transporters.\n\nPresenting a ministerial statement before the National Assembly, Public Service, Labour and Social Welfare Deputy Minister Mercy Dinha, acknowledged financial constraints that slowed food distribution efforts.She said that during the first phase of grain distribution, her ministry distributed 89 per cent of the grain, with 72 percent being distributed in the second phase, while 62 percent received aid in the last phase.\n\nThe fourth blitz food distribution phase is underway, although at a slow pace as various depots in provinces like Manicaland, Mashonaland East, Masvingo, Matabeleland South and Midlands have run out of stocks. Manicaland and Mashonaland East are withdrawing their tonnage from concession depots with assistance from well-wishers, said Deputy Minister Dinha.She said Treasury has released ZiG40 million to clear transport arrears, which is, however, only a fraction of the ZiG238 million owed to transporters.\n\nDeputy Minister Dinha urged Treasury to expedite the release of funds to ensure the smooth transportation of grain to those in need.  @nqotshili\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/nvvnmmn.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw TRADITIONAL leaders across the country have expressed optimism for a bumper harvest this summer season, a development expected to bolster household food security as the country emerges from a devastating El Niño-induced drought. Zimbabwe recently experienced one of its worst droughts since independence nearly 45 years ago, leaving over six million people […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "PSL action enters round three",
            "url": "https://www.chronicle.co.zw/psl-action-enters-round-three/",
            "content": "Fungai Muderere,[emailprotected]\n\nTHE Castle Lager Premier Soccer League action will on Friday enter round three in a football menu that will be headlined by the game between log leaders Scottland FC and Ngezi Platinum Stars.\n\nThe two teams will fight it out at Rufaro Stadium.In their previous match, free spending Scottland dismissed CAPS United 2-0 to maintain a 100 percent record. Scottland FC, who are under the guidance of Tonderai Ndiraya, are the only club that is yet to drop points.\n\nIn their Week Two fixture, Ngezi Platinum Stars edged Greenfuel 1-0 courtesy of a Malvin Gaki strike.On Saturday, Highlanders will square it off against Greenfuel at Greenfuel Arena. The Andrew Mbeba captained Bosso will go into the match with their tails up following their 4-0 trouncing of Kwekwe United at home.\n\nJoey Antipas Chicken Inn will play host to former champions FC Platinum at Luveve Stadium. Gamecocks, who have so far played two goalless draws against Bikita Minerals, will be hard-pressed to collect their first set of full points.Last weekend, Norman Mapezas FC Platinum charges beat Manica Diamonds 1-0 in a match that was played at Zvishavanes Mandava Stadium.\n\nThe platinum miners needed a Vincent Nyangulu goal two minutes from time to undo the Mutare side, who had repelled everything thrown their way.\n\nOn numerous occasions last season, FC Platinum struggled to break down teams that sat back to defend.Dynamos will have a home tie against TelOne at Rufaro while defending champions Simba Bhora entertain Herentals at Wadzanayi Stadium.\n\nMhondoros Baobab Stadium will be the venue of the game between MWOS and Yadah Stars.Bruised Kwekwe United will seek to redeem themselves when they take on Bikita Minerals at Gwerus Bata Stadium.After watching his charges fall to Bosso, Kwekwe United head coach Saul Chaminuka underscored the need to work on their defensive discipline.\n\nWhat we need is to have defensive discipline. Hopefully in our next match versus Bikita Minerals all would have been rectified. We will keep pushing and working hard, said Chaminuka. His team boasts of a number of seasoned players that include Allen Gahadzikwa, Masimba Mambare and Timothy January, among others.On Sunday, Manica Diamonds will clash with ZPC Kariba at Sakubva Stadium while Luke Masomeres Triangle United welcome equally battered CAPS United at Greenfuel Arena\n\nPSL Week Three FixturesFriday : Scottland FC v Ngezi Platinum Stars (Rufaro)\n\nSaturday: Simba Bhora v Herentals (Wadzanayi), Dynamos v Telone (Rufaro), Chicken Inn v FC Platinum (Luveve),MWOS v Yadah (Baobab), Greenfuel v Highlanders (Greenfuel Arena), Kwekwe United v Bikita Minerals (Bata)Sunday: Manica Diamonds v ZPC Kariba (Sakubva), Triangle United v CAPS United (Greenfuel).  @FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ryj.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw THE Castle Lager Premier Soccer League action will on Friday enter round three in a football menu that will be headlined by the game between log leaders Scottland FC and Ngezi Platinum Stars. The two teams will fight it out at Rufaro Stadium. In their previous match, free spending Scottland dismissed CAPS […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        },
        {
            "title": "Bulawayo city gets US$100k to back youth-led initiatives",
            "url": "https://www.chronicle.co.zw/bulawayo-city-gets-us100k-to-back-youth-led-initiatives/",
            "content": "Michelle Musandinyoze,[emailprotected]\n\nThe City of Bulawayo has received an additional US$100 000 from Bloomberg Philanthropies to support youth-led climate and sustainability projects this year.\n\nThe latest disbursement marks the citys second round of the funding support programme after the success of the first round, which ran from April 1 to December 31, 2024.\n\nAs part of the initiative, the city has invited young people between the ages of 15 to 24 to be part of this years climate adaptation programme.\n\nAs part of the recruitment process, the city launched the open call for the 2025 Youth Climate Action Fund (YCAF) to mobilise young people for the initiative.\n\nThe programme provides opportunities for young people to co-produce, co-govern and co-design youth-led initiatives.In a public statement, Bulawayo City Council Mayor Senator David Coltart said the Youth Climate Action Fund presented opportunities for young people aged 15 to 24 years to help develop an effective climate change response plan for Bulawayo.\n\nDriven by initiatives of the participating youth, Clr Coltart said he expected Bulawayo to become a green and sustainable city.To qualify for the Youth Climate Action Fund, young people apply for funding in line with the citys climate action priorities.\n\nThese include planting trees for a changing climate adaptation, environment and natural resources, clean or renewable energy, reducing greenhouse gas emissions, building resilience, youth-led awareness, education, research and development initiatives.In the first round of the youth-led initiatives, young people conducted various innovative projects, including Bulawayos carbon footprint assessments, youth-led waste management innovations, innovative renewable energy projects, tree planting, community garden initiatives, biogas production, public education campaigns, climate hackathons to launching recycling or waste reduction initiatives.\n\nThe projects are critical for the citys road map towards a 40 percent per capita emissions reduction, which is part of co-governance strategies for mitigation planning.\n\nIn a public announcement, Clr Coltart expressed hope that young people in Bulawayo will also utilise this opportunity from YCAF to come up with innovative projects on how to plant and grow indigenous trees in the City and help achieve the citys reforestation and afforestation target of at least 3 000 trees per year.\n\nThe YCAF was established and is supported by Bloomberg Philanthropies. It is administered in partnership with United Cities and Local Governments (UCLG) and the Bloomberg centre for Public Innovation (BCPI) at Johns Hopkins University,US, as a fiscally sponsored project of the Rockefeller Philanthropy Advisors (RPA)\n\nThe fund provides technical assistance and funding to cities worldwide to engage scores of youth aged 15 to 24 in designing, implementing and overseeing urgent climate solutions.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jbbgbbjkbjkmbjm.jpg",
            "description": "Michelle Musandinyoze, mickyafrica271@gmail.com The City of Bulawayo has received an additional US$100 000 from Bloomberg Philanthropies to support youth-led climate and sustainability projects this year. The latest disbursement marks the city’s second round of the funding support programme after the success of the first round, which ran from April 1 to December 31, 2024. As […]",
            "time": "08:43",
            "date": "12 Mar 2025"
        }
    ]
}