{
    "news": [
        {
            "title": "I won’t be swayed to extend my term: President",
            "url": "https://www.chronicle.co.zw/i-wont-be-swayed-to-extend-my-term-president/",
            "content": "Zvamaida Murwira, Harare BureauPresident Mnangagwa has reaffirmed his commitment to observe his two-term limit of office that is expected to end in 2028, saying he will not be swayed by current efforts being made to extend the tenure to 2030.\n\nHe said those pushing to have his term extended were exercising their democratic right, but those efforts will not in any way persuade him to remain in office when his term ends. He will allow his party Zanu-PF and the country to elect his successor.\n\nThe Head of State and Government said this yesterday at State House during an interactive meeting with editors of various publications drawn from both the public and private media.\n\nThe interactive meeting was facilitated by the Department of Presidential Communications in the Office of the Present and Cabinet headed by Deputy Chief Secretary in the Office of the President and Cabinet Mr George Charamba.\n\nIn the no-holds-barred meeting, President Mnangagwa fielded questions from editors focusing on all facets ranging from the economy, politics, international relations and the media industry.\n\nSoon after delivering his keynote address, President Mnangagwa tackled questions from editors with responses that showed how conversant he was with current issues and punctuated his answers with humour and satire.\n\nThe question of clarity regarding his tenure in the context of current efforts being made to extend it to 2030 took centre stage with editors taking turns to pose questions on the subject.\n\nThe editors sought reconciliation between what he has always said about his commitment to constitutionalism and the current efforts being made by people who feel that he ought to extend it.\n\nThose pushing to have his term extended have cited the elaborate contribution President Mnangagwa has made in terms of signature projects that range from infrastructure, economic growth, agriculture and mining, among others, which saw Zanu-PF resolving at its Annual Peoples Conference in Bulawayo last year to pass a resolution to extend his term to 2030.\n\nAsked to respond to growing calls for him to lengthen his term President Mnangagwa said:\n\nIts not imaginable that there is anybody in the country who can push me. I feel very uncomfortable. I am very solid.\n\nI have always said I am a constitutionalist, I have my two terms when they come to an end, the country and the party will move on by electing my successor, said President Mnangagwa.\n\nOne editor appeared not to have been satisfied with the response and asked President Mnangagwa to make a pronunciation that would help in guiding the media.\n\nHe said this is so, given what he felt was confusion and anxiety as some were still pushing for the term to be extended beyond 2028 even though he had consistently said he would not go beyond his constitutionally provided term limit.\n\nI thought you are putting it very clearly, that I am very clear, that I have two terms, and these terms are very definite, and I am so democratic. When they come to an end, I will step aside and my party will elect my successor that is as clear as day. Those who have other imaginations, its a democratic society for people to dream, but facts will carry the day, said President Mnangagwa.\n\nAnother editor asked President Mnangagwa what assurance was there that he would not be persuaded to shift from his well-pronounced position given the current efforts to have his term extended.\n\nI will persuade the persuaders not to persuade me so that I remain constitutional, said President Mnangagwa.\n\nThe President was also asked about the apparent disrespect of the party leadership particularly directed at some members of the Presidium by certain elements in the party and members of the public, particularly on national events such as burial of national heroes at the National Heroes Acre.\n\nI am so happy, this is the vibrancy of democracy.\n\nThe foolish and the wise both have their day. I think those who really are Zanu-PF at heart go by the rules and decorum of Zanu-PF. We have other people who are in Zanu-PF, who in themselves are not Zanu-PF, but they dress in Zanu-PF regalia, so you must always see when people talk and see which camp they belong when they open their mouth, said President Mnangagwa.\n\nThe President has on several occasions been consistent that he will leave office once he has completed his two terms and would not violate the Constitution which he was equally instrumental in crafting during the constitution-making process which was eventually adopted in 2013.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/GFSRWERW.jpg",
            "description": "Zvamaida Murwira, Harare Bureau President Mnangagwa has reaffirmed his commitment to observe his two-term limit of office that is expected to end in 2028, saying he will not be swayed by current efforts being made to extend the tenure to 2030. He said those pushing to have his term extended were exercising their democratic right, […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Flood warning for Matabeleland,  Midlands provinces",
            "url": "https://www.chronicle.co.zw/flood-warning-for-matabeleland-midlands-provinces/",
            "content": "Nqobile Tshili,[emailprotected]THE Meteorological Services Department (MSD) has warned of heavy rains exceeding 70 millimetres within 24 hours between tomorrow and Thursday in the Matabeleland region and the Midlands.\n\nThe rains are likely to cause flooding in flood-prone areas, and members of the public, as well as motorists, have been advised against crossing flooded rivers.The operation of machinery and open trucks, including tractors, during the rains is also risky, according to the weather agency.\n\nIt further warned against sheltering under trees during storms, as lives have been lost in such circumstances.In its latest weather advisory issued yesterday, the MSD stated that heavy downpours were approaching from the western borders of the country.\n\nA thick cloud is slowly approaching the western borders of the country from Botswana. It is expected to be accompanied by moisture from the north-west as well as from the south-east, said the MSD.\n\nThis is anticipated to cause heavy rainfall (exceeding 70 mm) as well as strong winds in provinces such as Matabeleland South, Bulawayo Metropolitan, the Midlands, and the southern parts of Matabeleland North, effective from noon on Wednesday, 19 February, until the early hours of Thursday.\n\nThere is a chance of flash floods in flood-prone areas and river basins. Roads may also be slippery, and visibility may be reduced by rainfall, necessitating an increased braking distance, it said.\n\nThere may also be fallen trees and power lines. Therefore, the public is advised to take precautionary measures as recommended by the Civil Protection Unit.\n\nThe Ministry of Primary and Secondary Education has also urged stakeholders in the education sector not to allow children to cross flooded rivers, prioritising their safety.\n\nPermanent Secretary for Primary and Secondary Education, Mr Moses Mhike, stated that schools would implement catch-up strategies as the rains have disrupted learning.\n\nMr Moses Mhike\n\nThese are the critical issues we will be considering as the school term comes to a closewhether to extend the term. I think for the critical areas where disruptions have occurred, we may give them an extra week or two to allow for catch-up, he said.\n\nAlternatively, we could use weekends to bring pupils in for catch-up lessons. However, most of the catch-up strategies we implement will be based on recommendations from school heads.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/02/Meteorological-Services-Department-680x380.jpg",
            "description": "Nqobile Tshili, nqobile.tshili@chronicle.co.zw THE Meteorological Services Department (MSD) has warned of heavy rains exceeding 70 millimetres within 24 hours between tomorrow and Thursday in the Matabeleland region and the Midlands. The rains are likely to cause flooding in flood-prone areas, and members of the public, as well as motorists, have been advised against crossing flooded […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "OK Zim starts restocking",
            "url": "https://www.chronicle.co.zw/ok-zim-starts-restocking/",
            "content": "Nqobile Bhebhe,[emailprotected]LISTED retail giant, OK Zimbabwe Limited, has begun restocking and modifying its procurement models to strengthen vital supply relationships with both local and foreign suppliers, ensuring business viability.\n\nThe group has also welcomed the Monetary Policy Statement measures, which have lifted several restrictions and introduced greater flexibility to the foreign exchange market.\n\nIn December last year, the Zimbabwe Stock Exchange-listed group reassured stakeholders of its continued viability despite experiencing intermittent product supply challenges during the festive season.\n\nThe company pledged to restore normal supply levels while working to stabilise the trading environment in collaboration with key partners.\n\nThis follows a period in which the group experienced stock shortages during the third quarter ended 31 December 2024, as daily availability levels fell to around 50 per cent of normal stocking levels.This sparked speculation that the 83-year-old retail chain, which recently closed four outlets across the country, was on the verge of collapse.\n\nThe firm attributed the stock shortages to restricted supplies from manufacturers and distributors.Additionally, the group had outstanding and overdue creditors balances, which were predominantly denominated in US dollars against a backdrop of low US dollar sales collection, at times reaching as little as 20 per cent of total sales revenue.\n\nIn a recent trading update, group company secretary Mrs Margaret Munyuru stated that the low stocking levels were a direct consequence of sub-economic pricing arising from exchange rate distortions and suppliers need for foreign currency invoicing to cover operational and raw material costs.\n\nShe explained that suppliers continued to insist on shorter trading terms and, in some cases, prepayments for supplies invoiced in local currency.\n\nThis exerted pressure on the businesss working capital, creating the need to secure short-term funding.\n\nHowever, Mrs Munyuru noted that the company had begun restocking its operating units, with support from supplier partners and financial institutions that continue to assist with short-term funding structures.\n\nNew alternative procurement models have been developed, including, but not limited to, a structured stock supply arrangement with a third party for supplier assurance purposes, as the business works to restore critical supply relationships with both local and foreign suppliers.\n\nThe group is confident of restoring normal stocking levels before the end of the current financial year, she said.Mrs Munyuru emphasised that the fortunes of the countrys formal retail sector depend on exchange rate stability.\n\nConsultations with both fiscal and monetary authorities have led to a relaxation of the strict policing of applicable in-store exchange rates. The group welcomes the recently announced Monetary Policy Statement measures, which have removed a number of limitations and introduced a degree of flexibility within the foreign exchange market, she said.\n\nHowever, there is a need for absolute clarity on the roadmap towards a fully market-determined exchange rate system. Such a liberalised system would go a long way in restoring the competitiveness of the formal retail sector.\n\nMrs Munyuru also noted that power outages had worsened during the quarter under review, disrupting business operations and increasing operating costs as the company relied more on alternative power sources.To mitigate rising operating costs, the group decided to close four branches in Glen Norah, Kuwadzana 5, Chitungwiza Town Centre, and Robson Manyika Street, all in Harare.\n\nHowever, she stated that a review is underway regarding the future of branches struggling with unsustainable operating costs and costly licensing requirements.During the period under review, volumes decreased by 36 per cent compared to the same period last year.\n\nHowever, on a year-to-date basis, the group recorded volume growth of 10 per cent over the same period.The reduction in volumes recorded during the quarter resulted in a 36 per cent decline in revenue compared to the prior period.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/SDFWECVWEFSD.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw LISTED retail giant, OK Zimbabwe Limited, has begun restocking and modifying its procurement models to strengthen vital supply relationships with both local and foreign suppliers, ensuring business viability. The group has also welcomed the Monetary Policy Statement measures, which have lifted several restrictions and introduced greater flexibility to the foreign exchange market. […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Madlela earns first Nama nomination",
            "url": "https://www.chronicle.co.zw/madlela-earns-first-nama-nomination/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nPOPULAR musician and comedian Madlela Skhobokhobo has received his first-ever nomination at the National Arts Merit Awards (NAMA), marking a significant milestone in his career.\n\nRenowned for his witty skits that have captivated social media audiences, Madlela has been nominated in the Outstanding Social Media Skits category.\n\nHe will compete against fellow content creators Mama Vee and Moojaya, both of whom have also enjoyed a successful and impactful year.\n\nThe awards ceremony is set to take place on 1 March at the Harare Hippodrome. The event will be hosted by television personality Nabeelah Jogee, who will anchor the main stage, while Charlene Mangweni-Furusa will provide voice-over commentary.\n\nAccording to the National Arts Council of Zimbabwe (NACZ), the nominations for the 2024 awards were based on works submitted between 1 December 2023 and 30 November 2024.\n\nNational-Arts-Council-of-Zimbabwe\n\nThe adjudication process began on 1 December 2024. A total of 2,371 entries were received for the 23rd NAMA, including 814 physical submissions and 1,073 online entries, while 484 entries were submitted by monitors, NACZ stated.\n\nIn an interview, Madlela expressed his excitement and gratitude for the recognition at a national level.\n\nThis is my first time being nominated for the NAMAs. Its an honour, and we truly appreciate it, though I would have loved to be nominated for Best Actor under Madlela Comes Home Season 1 and 2, not just for skits. Nonetheless, were very grateful for finally receiving this recognition.\n\nI believe this nomination came as a result of consistency. Winning would mean so much, and I would dedicate the award to everyone who has supported us from the beginning, he said.\n\nMadlelas nomination comes at a time when he has been vocal about the need for better recognition of Matabeleland artistes, arguing that they are often overlooked when it comes to securing major gigs. @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/ggfdgshtgf.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com POPULAR musician and comedian Madlela Skhobokhobo has received his first-ever nomination at the National Arts Merit Awards (NAMA), marking a significant milestone in his career. Renowned for his witty skits that have captivated social media audiences, Madlela has been nominated in the Outstanding Social Media Skits category.  He will compete against fellow content […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Media key to national development",
            "url": "https://www.chronicle.co.zw/media-key-to-national-development/",
            "content": "Zvamaida Murwira, Harare BureauThe Government values a vibrant media industry but the vibrancy will only be realised if the sector adjusts to the evolving technology landscape that has changed the old ways of information dissemination, President Mnangagwa said yesterday.\n\nHe was speaking at State House at an interactive meeting with editors drawn from the public and private media.\n\nThe interactive meeting was facilitated by the Department of Presidential Communications in the Office of the President and Cabinet headed by Deputy Chief Secretary in the Office of the President and Cabinet, Mr George Charamba.\n\nI am acutely aware that your industry is having to survive in a very complex and challenging environment where many things have and continue to change, he said.\n\nNot least among these is a seismic shift in reader, viewer, and listener interest and behaviour, much of it caused, motivated or aided by giant technological changes and possibilities.\n\nThe old media is dead and with it, old modes, models, and ways of doing your craft. We feel the impact and repercussions of these changes of technologies even in our own sphere of Government which is supposed to be stable and traditionally change averse.\n\nPresident Mnangagwa said things are no longer the same for everyone, and never will ever be, adding that all sectors are having to adjust.\n\nOnly a few days ago, I made new appointments to our Government which included a portfolio I never thought I would need to think about a few years back. Big nations think they now have the prerogative of planning their economies with our resources in mind.\n\nIt is as if national boundaries have been collapsed in their favour, evidenced by emerging laws on critical minerals which foreign blocs are drafting, but with African resources in mind. This is an emerging threat we now have to contend with.\n\nThe President said the Government was keen to share with the media industry their challenges and explore how it could assist to survive the headwinds of the global change.\n\nGovernment values a vibrant media industry, that vibrancy is underwritten by viability of the media as individual businesses.\n\nAbove all, our national media are part of our institutional identity markers, they must be sovereign and self-determining in thought, expression and in the interests, they express and defend, said President Mnangagwa.\n\nHe challenged the media to be well-informed as they interpret the society and developments, particularly in proffering directional insights on the political trajectory.\n\nYour profession is to read and understand that script, which we do not always write legibly, so you can report and comment on it. From where I sit, I am always fascinated and even amused by your attempts at reading and interpreting those politics we ourselves do.\n\nSome political issues you do report well, others with quite some dramatic imagination. All in all, I want to believe you do it all in good faith. Once there is purity of motive, which is to inform and serve the national interest, even lapses and failures, which are inevitable from time to time, will always have a ring of dignity and gallantry about them, he said.\n\nPresident Mnangagwa said he valued interactions with the media, as evidenced by his readiness to meet when a request was made.\n\nWhen my spokesperson, George Charamba consulted me on this edition of what I believe is going to be the first of many such to come, I readily acceded to it, more so given that this is the beginning of yet another year into my mandate, he said.\n\nAsked if he is happy with the performance of the economy given some turbulence that has seen some mainstream retail outlets such as OK Zimbabwe closing some branches, President Mnangagwa said:\n\nI would say that as a country or as an economy, we would have wanted to be better than where we are but challenges continue to affect every economy, not only Zimbabwe but as a region and perhaps as a continent, but I am happy as Zimbabwe we are rising up to the challenge and we are doing our best to manage our economy and challenges facing it.\n\nFortunately, recently we had good rains and our economy is basically agricultural and we have a good season and its huge impetus with regard to the positive trajectory to the growth of our economy.\n\nThe President said the economy was doing better than what people would have expected given the yoke of illegal sanctions imposed by the West.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/tydhgsdfdf.jpg",
            "description": "Zvamaida Murwira, Harare Bureau The Government values a vibrant media industry but the vibrancy will only be realised if the sector adjusts to the evolving technology landscape that has changed the old ways of information dissemination, President Mnangagwa said yesterday. He was speaking at State House at an interactive meeting with editors drawn from the […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Nuisance illegal immigrant deported",
            "url": "https://www.chronicle.co.zw/nuisance-illegal-immigrant-deported/",
            "content": "Trish Mukwazo,[emailprotected]\n\nA 34-year-old illegal immigrant from Equatorial Guinea, who has been residing in the country since 2014 without a valid permit, has been sentenced to pay a fine of US$100 and is to be deported back to his country.\n\nAngue Benjamin Nchama (34) was convicted of violating the Immigration Act, which prohibits staying in Zimbabwe without a valid visitors certificate.\n\nBulawayo magistrate Mr Ernest Muzembe fined the accused US$100 and additionally suspended four months of imprisonment. He ordered that Nchama be deported back to Equatorial Guinea. In passing sentence, Mr Muzembe stated that Nchama did not have a permit to continue residing in Zimbabwe. He added that this was a strict liability offence, meaning that whether Nchama intended to commit the offence did not need to be proved.\n\nMr Muzembe also noted that Nchama posed a security threat, according to Mr Godfrey Kondo, the Chief Immigration Officer. His continued presence in Zimbabwe could pose a threat to national security, he said.\n\nMr Muzembe further mentioned that Nchamas girlfriends mother had applied for a protection order against him, as he had been violent towards her.\n\nThe allegations presented by State prosecutor Mr Mehluli Ndlovu state that Nchama, who was a student at Bulawayo Polytechnic College, migrated to Zimbabwe in September 2014 from Equatorial Guinea through Robert Gabriel Mugabe International Airport.\n\nThe accuseds student permit expired on 17 January 2025 after several extensions. After the expiry of his permit, he failed to renew it and remained in Zimbabwe without a permit, said Mr Ndlovu.\n\nThe matter came to light when Nchama was in Harare on attachment, after being taken to court by his girlfriends mother, Ms Gertrude Makwamba, who applied for and obtained a protection order against him.\n\nMs Makwamba approached the Harare Civil Court seeking the protection order against Nchama, who allegedly blamed and assaulted her for not grooming her daughter properly. She told the court that Nchama accused her of hiring men to sleep with her daughter. Nchama is alleged to have assaulted Ms Makwamba, accusing her of not properly grooming her daughter.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fdrfgdfg.jpg",
            "description": "Trish Mukwazo, trishmukwazo515@gmail.com A 34-year-old illegal immigrant from Equatorial Guinea, who has been residing in the country since 2014 without a valid permit, has been sentenced to pay a fine of US$100 and is to be deported back to his country. Angue Benjamin Nchama (34) was convicted of violating the Immigration Act, which prohibits staying in […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Agricultural sector on track to meet and exceed production expectations",
            "url": "https://www.chronicle.co.zw/agricultural-sector-on-track-to-meet-and-exceed-production-expectations/",
            "content": "THE recent rains across Matabeleland have brought a much-needed sense of optimism to local farmers, offering renewed hope for the 2024/25 farming season.\n\nThe Governments projection of a bumper harvest, with an expected 3,2 million metric tonnes of grain, is a cause for celebration, particularly given the early challenges faced by farmers. For those in regions like Hwange District, where crops were showing signs of stress due to moisture shortages, the consistent wet spell has been a life-saver.\n\nFarmers are reporting healthy growth in key crops like maize, sorghum, and millet, and the improvement in the weather has alleviated the fears that arose during the prolonged dry spell.\n\nIn Matabeleland North and South, local agricultural experts, such as Mr Thulani Ndlovu and Mr Bheki Ncube, have noted that crops which were struggling are now showing signs of recovery. Maize, which had suffered from a lack of rain during the early stages of the growing season, is now expected to bounce back, with traditional grains remaining less affected by the dry period.\n\nThe rains have also had a broader impact on water availability, boosting farmers confidence that their crops will not be left to wither in the event of further dry spells. This sense of security is especially significant in areas like Beitbridge, where access to water sources has been replenished.\n\nThe optimism is palpable, as farmers such as Mr Itani Ndou of Shashe in Beitbridge District and Ms Lindiwe Ndlovu of Hwanges Kasibo area now see the prospect of a plentiful harvest on the horizon.\n\nThe Governments support through schemes like the Presidential Input Scheme has also played a pivotal role. With over 11 million plots planted, surpassing the initial target, the agricultural sector is on track to meet and exceed production expectations. Additionally, the Minister of Information, Publicity and Broadcasting Services, Dr Jenfan Muswere, has expressed confidence that Zimbabwe will not only meet its national grain requirements but may also have a surplus, which could be used for strategic reserves or export markets.\n\nDr Jenfan Muswere, Minister of Information, Publicity and Broadcasting Services.\n\nThe forthcoming harvest, expected in April 2025, could significantly bolster Zimbabwes food security, reduce reliance on imports, and contribute to the national economy. However, with the La Nia weather season predicted to bring normal to above-normal rainfall, farmers are advised to continue monitoring weather patterns and adhere to best practices to maximise yields. If the weather holds, the optimism surrounding this season could well translate into the agricultural sectors strongest performance in years.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Rains.jpg",
            "description": "THE recent rains across Matabeleland have brought a much-needed sense of optimism to local farmers, offering renewed hope for the 2024/25 farming season. The Government’s projection of a bumper harvest, with an expected 3,2 million metric tonnes of grain, is a cause for celebration, particularly given the early challenges faced by farmers. For those in […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Ghanaian striker at Highlanders",
            "url": "https://www.chronicle.co.zw/ghanaian-striker-at-highlanders/",
            "content": "Innocent Kurira,[emailprotected]GHANAlAN Paul Orape was one of the new faces in Highlanders first team as they faced former players and club legends at a Family Fun Day event held at the clubhouse on Sunday.\n\nIt appears that Orape is among the players Highlanders are considering signing ahead of the 2025 Castle Lager Premier Soccer League season.\n\nThe 22-year-old Orape has previously played for Essa Areekode FC and Luca Sporting Club in India.\n\nOrape was part of the first-team squad on Sunday but was under the weather and could not be part of the playing team.\n\nOther new additions to the squad, believed to have finalised their deals, include Marlvin Hativagoni and Mafious Chiweta.\n\nThe duo was also part of the festivities at the Highlanders clubhouse on Sunday.In the main match of the day, the current Highlanders squad triumphed 5-2 over the Bosso legends and former players.\n\nHighlanders\n\nThe Highlanders first team got their goals from Marvin Sibanda, Brighton Ncube, McKinnon Mushore, Prince Ndlovu and Never Rauzhi, while Mkhokheli Dube and Bekithemba Ndlovu were on target for the former players and legends.\n\nChiweta (19) joins Highlanders from Bulawayos Ajax Hotspurs, who play in the Zifa Southern Region League.\n\nThe talented winger has impressed Kaindu, who is focused on rebuilding the squad for the 2025 PSL season after the departure of key players, including Lynoth Chikuhwa, Peter Muduhwa, Marvelous Chigumira and Godfrey Makaruse.\n\nThe club has also released defender Andrew Tandi and midfielder Brian Gaucho Ndlovu.Speaking after the event, Highlanders communications officer Nozibelo Maphosa said the day was a success.\n\nThe main purpose of the Family Fun Day was to raise funds for the club, but just as importantly, it provided an opportunity for the Highlanders family to come together before the start of the new season. It was a family-friendly environment, and we all had so much fun, Maphosa said.Maphosa said they would be releasing the events figures in due course.\n\nKaindus first stint with Highlanders began in 2012, when he led the team on a 23-match unbeaten run, narrowly losing the title to Dynamos on goal difference. He left in 2014, only to return for the 2024 season, where he led the team to a sixth-place finish in the table.\n\nThe Premier Soccer League (PSL) is expected to hold its annual general meeting next month, ahead of the 2025 season, which is set to kick off in March. Many clubs are working to finalise player transfers early to ensure they are fully prepared when the league begins.\n\nThe Castle Challenge Cup, which will feature Chibuku Super Cup champions Dynamos and league champions Simba Bhora next Saturday, is expected to kick-start the new season.  @innocentskizoe\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/hklrhidhidhiyd.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw GHANAlAN Paul Orape was one of the new faces in Highlanders’ first team as they faced former players and club legends at a Family Fun Day event held at the clubhouse on Sunday. It appears that Orape is among the players Highlanders are considering signing ahead of the 2025 Castle Lager Premier […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Belated Valentine’s gift for orphans",
            "url": "https://www.chronicle.co.zw/belated-valentines-gift-for-orphans/",
            "content": "Lesley Chikudo,[emailprotected].\n\nKHAYELIHLE Childrens Village orphans were treated to a belated Valentines lunch on Sunday by Doing Good Projects Trust, as a way of spreading love to the less privileged during the month of February.\n\nKhayelinhle Childrens Village is a local orphanage that provides care and support for abandoned or orphaned children. Doing Good Projects Trust is run by Shilloh Word and Prayer International Ministries, which has previously supported vulnerable children in the community by organising events that spread love and kindness to the less privileged.\n\nThe founder of Doing Good Projects Trust, Mr Brilliant Sithole, said: Love is not just a feeling, its an action, and we hope to inspire others to join us in sharing love and kindness with those around us.\n\nWe wanted to do something special for the children during this month of love, said Mr Sithole.\n\nWe believe that every child deserves to feel loved and cherished, and its important for the children at Khayelinhle Childrens Village to know that they are valued and loved, added Mrs Thina Mpofu, the organisations co-founder.\n\nThe belated Valentines lunch was a festive event, complete with a sumptuous meal served by volunteers. The children were also treated to games, music, and dancing, creating a fun and lively afternoon for the more than 40 minors.\n\nIt was a really fun day, said 10-year-old Thandi, one of the children at Khayelinhle Childrens Village. I loved the food and the games. It made me feel really happy.\n\nEight-year-old Alia expressed his gratitude for the lunch. It was nice of the organisation to do this for us. I felt much loved today, he said.\n\nFor 16-year-old Luke, the lunch was a special occasion for him and his friends.\n\nToday was amazing, it felt great to be part of something special. Sometimes, we forget that we are loved too. I want to thank everyone from The Shilloh Word and Prayer International Ministries for showing us that love isnt just for couples, but for everyone. This lunch made me feel important and part of a family, he said.\n\nSeeing the children enjoying themselves was the ultimate goal for the organisers of the event.\n\nWe believe that love knows no boundaries.\n\nIt is important to spread love and kindness wherever we go, and we are grateful for the opportunity to bring smiles to the faces of these wonderful children, said Mrs Sithole.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/Untitled-3-copy.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com. KHAYELIHLE Children’s Village orphans were treated to a belated Valentine’s lunch on Sunday by Doing Good Projects Trust, as a way of spreading love to the less privileged during the month of February. Khayelinhle Children’s Village is a local orphanage that provides care and support for abandoned or orphaned children. Doing Good Projects […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        },
        {
            "title": "Warriors to play in Durban",
            "url": "https://www.chronicle.co.zw/warriors-to-play-in-durban/",
            "content": "Innocent Kurira,[emailprotected]THE Warriors will play their crucial 2025 Fifa World Cup Qualifier against Benin on Thursday, March 20, at the Moses Mabhida Stadium in Durban, South Africa.\n\nThe match, scheduled to kick off at 18:00 hrs, will be a crucial fixture in the Warriors bid to secure a place in next years World Cup.\n\nThis announcement finally settles the uncertainty surrounding the venue for the upcoming match, as Zimbabwe continues to face challenges with hosting international games at home due to the lack of a CAF-approved stadium.\n\nOriginally, Zifa had planned to host the match in Polokwane.However, following a re-allocation of Bafana Bafanas January fixtures, alternative venues had to be considered.\n\nJohannesburgs approved stadia were unavailable due to rugby and other events, while Cape Town Stadium is presently undergoing pitch renovations.\n\nAfter an extensive search, Moses Mabhida Stadium emerged as the ideal venue.\n\nMoses Mabhida Stadium\n\nKnown for hosting top international matches, the stadium offers world-class facilities and the perfect conditions for the Warriors playing style.\n\nWe are confident that Moses Mabhida will provide the best environment for our team to perform and deliver a memorable result for the fans, Zifa said in a statement released yesterday.\n\nWe are excited to bring the Warriors closer to their passionate supporters in Durban. Moses Mabhida Stadium offers excellent facilities and is an ideal venue for our style of play. We encourage all Zimbabwean football fans to come out in full force, support the team, and rally behind them as they continue their quest for World Cup qualification.\n\nIn the absence of an approved venue in Zimbabwe, the Warriors have frequently played their international matches in South Africa. The team has built a strong presence in the neighboring country, having won two and drawn one of their last three games there.\n\nDespite struggling at the bottom of Group C with only two points from five games, the Warriors remain optimistic about their chances of advancing to the World Cup.\n\nZimbabwe will need to secure a strong result against Benin to stay alive in the qualification race.Rwanda leads the group with seven points, same as South Africa and Benin in second and third position respectively. Lesotho in fourth have five points while Nigeria are on three points.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/11/Warriors.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw THE Warriors will play their crucial 2025 Fifa World Cup Qualifier against Benin on Thursday, March 20, at the Moses Mabhida Stadium in Durban, South Africa. The match, scheduled to kick off at 18:00 hrs, will be a crucial fixture in the Warriors’ bid to secure a place in next year’s World […]",
            "time": "08:34",
            "date": "18 Feb 2025"
        }
    ]
}