{
    "news": [
        {
            "title": "Late equaliser denies GameCocks victory",
            "url": "https://www.chronicle.co.zw/late-equaliser-denies-gamecocks-victory/",
            "content": "Innocent Kurira At Luveve Stadium\n\nChicken Inn 1-1 FC Platinum\n\nCHICKEN Inn were left rueing missed opportunities as they conceded a late equaliser to FC Platinum in a 1-1 draw at home on Sarturday afternoon.\n\nThe GameCocks had looked set to secure their first three points of the season after Brian Muzas 66th-minute strike, but a goalkeeping error in the 85th minute allowed Thandolwenkosi Ngwenya to level the score and deny the hosts all three points.\n\nThe first half was a tense, cagey affair, with both sides struggling to break down each others defences. Chicken Inn had the first chance of note in the 17th minute when Xolani Ndlovu delivered a dangerous free kick into the box, but Mpumelelo Bhebhes header lacked the accuracy to test FC Platinum goalkeeper David Bizabani. Moments later, Godfrey Muchenje tried his luck from range, only to see his effort sail high and wide.\n\nFC Platinum had their own opportunities, with Ngwenya threatening in the 24th minute after a skilful turn saw him evade two defenders. However, Bernard Donovan was quick to close the space and made a crucial save to deny the forward.\n\nIn a blow to the visitors, FC Platinum were forced to make an early substitution when Shepherd Mhlanga was stretchered off after a knock, with Dylan Nchito replacing him in the 32nd minute. Chicken Inn had strong penalty claims in the 40th minute when Muza was seemingly fouled by Bizabani inside the box, but referee Mhaka Magare waved away the protests.\n\nA minute later, Elshamar Farasi came close to opening the scoring with a lobbed effort that sailed just over the bar as Bizabani was caught off his line.\n\nThe second half began with FC Platinum on the front foot, but Chicken Inn had their own chances. In the 49th minute, George Majika whipped in a dangerous cross, but Farasi could not direct his header on target. Oscar Bhebhe also came close with a powerful effort in the 62nd minute, but his shot was off target.\n\nJust when it seemed like Chicken Inn were heading for their first win of the season, disaster struck. In the 85th minute, FC Platinum equalised through Ngwenya after a mistake by goalkeeper Donovan. Brian Bandas weak shot was spilled by the keeper, and the rebound fell to Ngwenya, who calmly slotted home to make it 1-1.\n\nFC Platinum had another penalty appeal turned down in the 77th minute when Bhebhe was brought down inside the box by Lincoln Mangaira, but the referee remained unmoved.\n\nUltimately, the GameCocks were left to reflect on what could have been, as they failed to hold onto their slender lead and were forced to settle for a point. FC Platinum, on the other hand, will be satisfied with their resilience, snatching a share of the spoils.\n\nTeams\n\nChicken Inn:\n\nD Bernard, K Dzingwe, M Bhebhe, J Tulani, X Ndlovu, L Mangaira, E Farasi (G Mutungamiri 59), M Charamba (B Rendo 84), G Majika (W Vuwa 59), G Muchenje, B Muza (K Nyamutenga 81)\n\nFC Platinum:\n\nD Bizabani, B Nzori, N Nyasulu, M Ndlovu, B Banda, D Mhindirira (V Nyangulu 81), S Mhlanga (D Nchito 34), H Magaya, D Marowa (O Bhebhe 55), T Ngwenya (M Ngwenya 90), C Tshuma (J Selemani 55)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kmkmk.jpg",
            "description": "Innocent Kurira At Luveve Stadium Chicken Inn 1-1 FC Platinum CHICKEN Inn were left rueing missed opportunities as they conceded a late equaliser to FC Platinum in a 1-1 draw at home on Sarturday afternoon. The GameCocks had looked set to secure their first three points of the season after Brian Muza’s 66th-minute strike, but […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Zimbabwe hosts South African travel agents to boost tourism in Victoria Falls",
            "url": "https://www.chronicle.co.zw/zimbabwe-hosts-south-african-travel-agents-to-boost-tourism-in-victoria-falls/",
            "content": "Online Reporter\n\nTHE Ministry of Tourism and Hospitality Industry has partnered with key players in the sector to invite and host travel agents for familiarisation tours in the countrys prime tourism capital, Victoria Falls.\n\nA group of top South African tourism agents arrived in Victoria Falls on Thursday for a three-day familiarisation tour aimed at positioning Zimbabwe as a must-visit travel destination.\n\nThe Ministry partnered with Fastjet Zimbabwe, the Airports Company of Zimbabwe, the Zimbabwe Parks and Wildlife Management Authority, and other stakeholders.\n\nRepresenting a cross-section of leading travel consolidators in the industry, thetourism agents, include Tourvest, XL Nexus, and Stanley Safaris, among others.\n\nThe initiative seeks to promote Zimbabwes tourism to high-value travellers across key markets and ultimately attract increased arrivals. With the support of the Zimbabwe Tourism Authority, the agents are expected to experience various activities in Victoria Falls tourism portfolio.\n\nThey will enjoy a guided tour of the iconic Victoria Falls, a Zambezi River sunset cruise, a game drive, the breathtaking Flight of Angels helicopter tour, bungee jumping, and visits to some hotels.\n\nSouth Africa remains Zimbabwes largest regional tourist source market.\n\nThe familiarisation trip is designed to strengthen industry partnerships, enhance destination visibility, and drive visitor growth.By equipping top travel specialists with firsthand knowledge and authentic experiences, Zimbabwe is reinforcing its position as a premier adventure and wildlife destination on the global stage.\n\nThe visit by the agents comes just a week after the tourism resort hosted another group of travel agents from Asia, ensuring the destination remains active during off-peak seasons.\n\nNine travel agents from key Asian markets, particularly Singapore, Hong Kong, and the Philippines, recently completed a familiarisation tour of the country with the support of Qatar Airways, Thompsons Africa, and Gateway Singapore.\n\nTourism is a seasonal sector, with visitor arrivals typically reaching their lowest levels after the festive season and continuing until the end of March.\n\nTravel groups play a crucial role in bridging this gap, ensuring the industry remains vibrant throughout this period.\n\nThe Asian market is an increasingly important source of tourists, with many travellers from this region preferring to visit in groups.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-15-at-3.38.56-PM-680x380.jpeg",
            "description": "Online Reporter THE Ministry of Tourism and Hospitality Industry has partnered with key players in the sector to invite and host travel agents for familiarisation tours in the country’s prime tourism capital, Victoria Falls. A group of top South African tourism agents arrived in Victoria Falls on Thursday for a three-day familiarisation tour aimed at […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Stalemate at the break",
            "url": "https://www.chronicle.co.zw/stalemate-at-the-break/",
            "content": "Chicken Inn 0-0 FC Platinum\n\nInnocent Kurira At Luveve Stadium\n\nTHE first half between Chicken Inn and FC Platinum has unfolded as a cagey and closely contested affair, with neither side able to break the deadlock.\n\nIn the 17th minute, Xolani Ndlovu delivered a dangerous free kick into the box, which found Mpumelelo Bhebhe in space.\n\nHowever, Bhebhe was unable to direct his header on target. Moments later, Godfrey Muchenje fired from distance, but his effort sailed harmlessly over the bar.\n\nFC Platinum came close to taking the lead in the 24th minute when a clever turn by Thandolwenkosi Ngwenya one evaded two Chicken Inn defenders.\n\nHowever, goalkeeper Bernard Donovan was quick off his line to make a crucial save and deny what would have been a stunning opener.\n\nThe visitors were forced into an early change after 32 minutes when Shepherd Mhlanga was stretchered off with an injury, and Dylan Nchito came on in his place.\n\nWith five minutes remaining in the first half, Chicken Inn had strong claims for a penalty when Brian Muza appeared to be fouled inside the box by FC Platinum goalkeeper David Bizabani. However, referee Mhaka Magare waved away the appeals. Chicken Inn came close once more moments later, as Elshamar Farasi attempted to lob Bizabani, who had strayed off his line, but the effort sailed just over the bar.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/kmkmk.jpg",
            "description": "Chicken Inn 0-0 FC Platinum Innocent Kurira At Luveve Stadium THE first half between Chicken Inn and FC Platinum has unfolded as a cagey and closely contested affair, with neither side able to break the deadlock. In the 17th minute, Xolani Ndlovu delivered a dangerous free kick into the box, which found Mpumelelo Bhebhe in […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Chicken Inn set to face FC Platinum at Luveve Stadium in Match Day Three",
            "url": "https://www.chronicle.co.zw/chicken-inn-set-to-face-fc-platinum-at-luveve-stadium-in-match-day-three/",
            "content": "Innocent Kurira\n\nCHICKEN Inn will be out seek some form of redemption as they face a challenging FC Platinum in what promises to be a thrilling encounter this Saturday afternoon at Luveve Stadium.\n\nThe Gamecocks have struggled to find the back of the net, drawing both of their opening matches 0-0.\n\nThey will be eager to rediscover their attacking rhythm against Norman Mapezas FC Platinum, who have started the season strongly with four points from a possible six.\n\nFC Platinum, who dominated the head-to-head record last season, will be aiming to build on their recent 1-0 victory over Manica Diamonds.\n\nFor Chicken Inn to secure a positive result, they will need to show more than just defensive resilience against the Platinum Miners, who look set to maintain their strong form.\n\nThe teams lineup as follows:\n\nChicken Inn\n\nDonovan Bernard, Kudzaishe Dzingwe, Mpumelelo Bhebhe, Joseph Tulani, Xolani Ndlovu, Lincoln Mangaira, Elshamar Farasi, Michael Charamba, George Majika, Godfrey Muchenje, Brian Muza\n\nFC Platinum\n\nDavid Bizabani, Bothwell Nzori, Nickson Nyasulu, Mbongeni Ndlovu, Brian Banda, Devine Mhindirira, Shepherd Mhlanga, Hagiazo Magaya, Davison Marowa, Thandolwenkosi Ngweya, Claivert Tshuma\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jhyy.jpg",
            "description": "Innocent Kurira CHICKEN Inn will be out seek some form of redemption as they face a challenging  FC Platinum in what promises to be a thrilling encounter this Saturday afternoon at Luveve Stadium. The Gamecocks have struggled to find the back of the net, drawing both of their opening matches 0-0. They will be eager […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Watch: ZINA Bulawayo Province hosts preseason netball tournament at White City Stadium",
            "url": "https://www.chronicle.co.zw/watch-zina-bulawayo-province-hosts-preseason-netball-tournament-at-white-city-stadium/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTHE Zimbabwe Netball Association (ZINA) Bulawayo province Division Two is hosting a one-day open tournament at White City Stadium, with 11 teams taking part.\n\nThe tournament serves as a precursor to the upcoming 2025 league matches, according to the Secretary General, Simiso Ndlovu.\n\nBy the end of the day, we will have witnessed 25 games, and from what we have seen so far, it promises to be an exciting day for the game of netball, she said.\n\nThe participating teams are Free Stars, Lethal, Swallows, Thandanani, NUST, Sovereign, Majoni, Mthombothemba, Sobukhazi, and Makopo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/sport.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw THE Zimbabwe Netball Association (ZINA) Bulawayo province Division Two is hosting a one-day open tournament at White City Stadium, with 11 teams taking part. The tournament serves as a precursor to the upcoming 2025 league matches, according to the Secretary General, Simiso Ndlovu. “By the end of the day, we will have […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Elephants resurface in Beitbridge, destroying crops and threatening villagers",
            "url": "https://www.chronicle.co.zw/elephants-resurface-in-beitbridge-destroying-crops-and-threatening-villagers/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nA HERD of elephants has recently resurfaced in Beitbridge, causing significant damage to communal fields and posing a threat to villagers in the Joko, Mutetenwa, and Mzingwane areas.\n\nMr Jahson Mugodzwa, the Beitbridge Civil Protection Committee focal person, confirmed the situation and said they had notified both the Beitbridge Rural District Council (RDC) and officials from the National Parks and Wildlife Authority about the ongoing issues.\n\nWe have received distress calls from villagers in Mzingwane, where the elephants have destroyed several crop fields. Additionally, another herd is camped in Mutetenwa, and villagers are now living in fear for their safety. As the Civil Protection Committee, we have informed the relevant departments, who are already on the ground addressing the matter, said Mr Mugodzwa.\n\nElephants have become a recurring threat to both crops and villagers, particularly those living near water bodies such as the Shashe, Mzingwane, Bubi, and Limpopo Rivers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/jkuyyu.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau A HERD of elephants has recently resurfaced in Beitbridge, causing significant damage to communal fields and posing a threat to villagers in the Joko, Mutetenwa, and Mzingwane areas. Mr Jahson Mugodzwa, the Beitbridge Civil Protection Committee focal person, confirmed the situation and said they had notified both the Beitbridge Rural District […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Tsholotsho ready to host provincial Independence celebrations",
            "url": "https://www.chronicle.co.zw/tsholotsho-ready-to-host-provincial-independence-celebrations/",
            "content": "Sikhumbuzo Moyo ,[emailprotected]\n\nTSHOLOTSHO District has received the exciting news that it will host the Matabeleland North provincial independence celebrations, with Tsholotsho High School selected as the venue for the childrens party.\n\nMain celebrations will take place at Tsholotsho Stadium.\n\nThe childrens party is set to be held on the eve of the official Independence Day commemorations.\n\nTsholotsho District Development Coordinator, Mr Aaron Gono, expressed his delight at the announcement, describing it as a long-awaited opportunity for the district.\n\nAs a district, we received this news with great joy and excitement. We believe this event will boost business in the area and contribute to development. For instance, plans are already in place to rehabilitate the Bulawayo-Tsholotsho road, said Mr Gono.\n\nHe said the districts State Functions Committee has already been activated, and three preparatory meetings have been held so far. The childrens party will be hosted at Tsholotsho High School, while the main Independence event will take place at Tsholotsho Stadium, he said.\n\nThe Midlands province will host the national Independence celebrations. This years commemoration will be held under the theme: @45 Devolve and Develop Together Towards Vision 2030.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/ghgfhg.jpg",
            "description": "Sikhumbuzo Moyo , smoyo@chronicle.co.zw TSHOLOTSHO District has received the exciting news that it will host the Matabeleland North provincial independence celebrations, with Tsholotsho High School selected as the venue for the children’s party. Main celebrations will take place at Tsholotsho Stadium. The children’s party is set to be held on the eve of the official […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "SADC and EU hold ministerial dialogue in Harare",
            "url": "https://www.chronicle.co.zw/sadc-and-eu-hold-ministerial-dialogue-in-harare/",
            "content": "Online writer\n\nA HIGH-LEVEL Ministerial Partnership Dialogue between the Southern African Development Community (SADC) and the European Union (EU) is underway this morning at the New Parliament Building in Mt Hampden, Harare.\n\nThe dialogue aims to address a range of issues of mutual interest, including peace and security, human and sustainable development, climate change, the environment, and trade and investment.\n\nCo-chaired by Professor Amon Murwira, Chairperson of the SADC Council of Ministers and Zimbabwes Minister of Foreign Affairs and International Trade, and Mr Radosaw Sikorski, Polands Minister of Foreign Affairs, representing the EUs High Representative for Foreign Affairs and Security Policy, the meeting provides a platform for enhanced cooperation between the two parties.\n\nThe discussions are expected to pave the way for deeper collaboration and shared solutions to regional and global challenges.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/03/WhatsApp-Image-2025-03-15-at-11.17.33-AM-680x380.jpeg",
            "description": "Online writer A HIGH-LEVEL Ministerial Partnership Dialogue between the Southern African Development Community (SADC) and the European Union (EU) is underway this morning at the New Parliament Building in Mt Hampden, Harare. The dialogue aims to address a range of issues of mutual interest, including peace and security, human and sustainable development, climate change, the […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Six PSL matches on today",
            "url": "https://www.chronicle.co.zw/six-psl-matches-on-today/",
            "content": "Fungai Muderere,[emailprotected]\n\nSIX Week Three Castle Lager Premier Soccer League (PSL) matches are lined up for this afternoon at different venues.\n\nYesterday, highly fancied Scottland FC were edged 0-1 by 2023 league champions Ngezi Platinum Stars in a match that was played at Rufaro Stadium.\n\nComing from an emphatic 4-0 triumph over Kwekwe United, Kelvin Kaindu coached Highlanders will fight it out with Greenfuel at Greenfuel Arena while Simba Bhora welcome Herentals at Wadzanayi Stadium.\n\nRufaro Stadium will be the venue of the game between Dynamos and Hebert Maruwa mentored TelOne.\n\nChicken Inn will square it off against FC Platinum at Luveve Stadium in a match that is set to go either way.\n\nThe Gamecocks, who are yet to collect maximum points after two rounds of play, have hinted on throwing in some fresh pair of legs in their quest to get a positive result.\n\nLikely to be thrown into the fray by Gamecocks are youngCraig Ndlovu, Arthur Chinda and Brendon Rendo among others.\n\nMWOS have a date with Yadah Stars FC at Baobab Stadium.\n\nKwekwe United will play host to Bikita Minerals at Gwerus Bata Stadium.\n\nOn Sunday, Manica Diamonds will face ZPC Kariba at Sakubva Stadium while Triangle United meet CAPS United at Greenfuel Arena.\n\nTodays Week Three Fixtures\n\nSimba Bhorav Herentals (Wadzanayi), Dynamos v Telone (Rufaro), Chicken Inn v FC Platinum (Luveve),MWOS v Yadah (Baobab), Greenfuel vHighlanders (Greenfuel Arena), Kwekwe United v Bikita Minerals (Bata)\n\nSunday\n\nManica Diamonds v ZPC Kariba (Sakubva), Triangle United v CAPS United (Greenfuel)-@FungaiMuderere\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/03/kaindu-1.jpg",
            "description": "Fungai Muderere, fungai.muderere@bmetro.co.zw SIX Week Three Castle Lager Premier Soccer League (PSL) matches are lined up for this afternoon at different venues. Yesterday, highly fancied Scottland FC were edged 0-1 by 2023 league champions Ngezi Platinum Stars in a match that was played at Rufaro Stadium. Coming from an emphatic 4-0 triumph over Kwekwe United, […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        },
        {
            "title": "Burglar targets prosecutors house, makes off with about $3k in stolen goods",
            "url": "https://www.chronicle.co.zw/burglar-targets-prosecutors-house-makes-off-with-about-3k-in-stolen-goods/",
            "content": "Langelihle Nyathi,[emailprotected]*\n\nA 26-YEAR-OLD man appeared before the Chiredzi Magistrates Court for breaking into the home of a public prosecutor.\n\nThomas Kwindingwi from Totota Compound, Chishamiso, Hippo Valley, in Chiredzi District, was sentenced to 20 months in prison after being found guilty of theft.\n\nAccording to the National Prosecuting Authority of Zimbabwe (NPAZ), on 27 February 2025, at around 1:15 AM, Kwindingwi used an unknown tool to forcibly open the door while the prosecutor was asleep.\n\nThe convict reportedly stole valuables, including a P37 Pro Itel cellphone, an HP Victus laptop along with its charger, and other items.\n\nFollowing a police investigation, Kwindingwi was apprehended, and property worth $1 920 was recovered from the total stolen goods, valued at $2 915.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/courthammer-680x380.jpg",
            "description": "Langelihle Nyathi, langae2001@gmail.com*  A 26-YEAR-OLD man appeared before the Chiredzi Magistrates’ Court for breaking into the home of a public prosecutor. Thomas Kwindingwi from Totota Compound, Chishamiso, Hippo Valley, in Chiredzi District, was sentenced to 20 months in prison after being found guilty of theft. According to the National Prosecuting Authority of Zimbabwe (NPAZ), on […]",
            "time": "06:33",
            "date": "16 Mar 2025"
        }
    ]
}