{
    "news": [
        {
            "title": "President Mnangagwa signs Death Penalty Abolition Bill into law",
            "url": "https://www.chronicle.co.zw/president-mnangagwa-signs-death-penalty-abolition-bill-into-law/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nPRESIDENT Mnangagwa has officially signed the Death Penalty Abolition Bill into law, marking a significant milestone in Zimbabwes legal and human rights landscape. The move effectively abolishes the death penalty, making Zimbabwe the latest country to take a stand against capital punishment.\n\nThe Death Penalty Abolition Act, as published in the latest Government Gazette, amends several key pieces of legislation, including the Criminal Procedure and Evidence Act [Chapter 9:07], the Genocide Act [Chapter 9:20], the Criminal Law (Codification and Reform) Act [Chapter 9:23], and the Geneva Conventions Act [Chapter 11:06].\n\nThe new law states that no court shall impose a death sentence on any person, regardless of the offence committed. Instead, courts are required to impose the most appropriate alternative sentence based on the circumstances of each case.\n\nThe Supreme Court shall not confirm a sentence of death imposed upon an appellant, whenever that sentence may have been imposed, but instead shall substitute whatever other competent sentence is appropriate in the circumstances of the case and no sentence of death, whenever imposed, shall be carried out, reads a section of the Act.\n\nThe signing of the Bill marks the formal end of the death penalty in Zimbabwe, a practice that had not been carried out since the execution of Never Masina Mandlenkosi in 2005. Mandlenkosi was sentenced to death by the High Court for the brutal murder of Themba Nkiwane in 2002. Since his execution on July 22, 2005, no other prisoner has been executed in Zimbabwe.\n\nDespite the lack of a hangman for nearly two decades, Zimbabwean courts continued to pass death sentences as prescribed by the 2013 Constitution, which was adopted following a referendum.\n\nCurrently, there are 62 prisoners on death row in Zimbabwe. In 2013, then-Justice Minister, President Mnangagwa, publicly expressed his opposition to the death penalty, stating that he was against the execution of prisoners.\n\nThe abolition of the death penalty is a significant step toward the protection of human rights and aligns Zimbabwe with other countries that have taken similar actions to eliminate capital punishment.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/1212-2-680x380.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw PRESIDENT Mnangagwa has officially signed the Death Penalty Abolition Bill into law, marking a significant milestone in Zimbabwe’s legal and human rights landscape. The move effectively abolishes the death penalty, making Zimbabwe the latest country to take a stand against capital punishment. The Death Penalty Abolition Act, as published in the latest […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "Beitbridge businessman Chris “Shule Shule” Nguluvhe dies",
            "url": "https://www.chronicle.co.zw/beitbridge-businessman-chris-shule-shule-nguluvhe-dies/",
            "content": "Thupeyo[emailprotected]\n\nBeitbridge is mourning the loss of one of its most prominent businessmen and farmers, Mr Chris Nguluvhe, popularly known as Shule Shule, who passed away at the age of 61.\n\nMr Nguluvhe died on Tuesday morning at a hospital in Polokwane, Limpopo Province, South Africa, following a short illness, his eldest daughter, Ms Happiness Nguluvhe, confirmed. She added that funeral arrangements will be announced in due course.The news of his passing has left the Beitbridge community in shock, with many reflecting on his contributions to the town and beyond.Mr Nguluvhe was a trailblazer in Beitbridge, known for his entrepreneurial spirit and commitment to community development. In 2002, he established the Shule Shule Business Centre in Khwalu 1 suburb, which included the areas first sports bar, a venture that became a local landmark.\n\nHe was a major supporter of community initiatives, including Beitbridges community radio station, Lotsha FM, and the local football club Dulivhadzimu United FC. His philanthropic efforts extended to various social responsibility programs across the district, touching countless lives.\n\nA versatile entrepreneur, Mr Nguluvhe had business interests spanning multiple sectors, including customs and clearing, trucking, livestock production, accommodation, and fast food outlets. His contributions to these industries played a significant role in driving economic activity in the region.\n\nFuneral details will be shared once finalised\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hghg.jpg",
            "description": "Thupeyo Muleyathupeyo.muleya@zimpapers.co.zw Beitbridge is mourning the loss of one of its most prominent businessmen and farmers, Mr Chris Nguluvhe, popularly known as “Shule Shule,” who passed away at the age of 61. Mr Nguluvhe died on Tuesday morning at a hospital in Polokwane, Limpopo Province, South Africa, following a short illness, his eldest daughter, Ms […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "Wayne Rooney and Plymouth Argyle ‘agree to part ways with immediate effect’",
            "url": "https://www.chronicle.co.zw/wayne-rooney-and-plymouth-argyle-agree-to-part-ways-with-immediate-effect/",
            "content": "Wayne Rooney and Plymouth have mutually agreed to part ways with immediate effect after a nine-game winless run.\n\nRooney, 39, leaves with the club bottom of the Sky Bet Championship, four points from safety and escaping the relegation zone.\n\nWe would like to thank Wayne and his team for all their efforts and wish them well for the future, a statement said.\n\nFollowing Rooneys departure, first-team coach Kevin Nancekivell and club captain Joe Edwards will be in charge for Plymouths New Years Day clash against Bristol City.\n\nAlso departing the club will be assistant head coach Mike Phelan and first team coach Simon Ireland, the team said.\n\nIn a statement on the Plymouth website, Rooney thanked the clubs board as well as the staff, players and fans.\n\nThanks to all the staff who made me feel welcome and who make the club such a special place, the players and fans for their efforts and support during my time as head coach and I wish them all the best for the future, he said.\n\nTo the Green Army thanks for making the games at Home Park so special, they are memories that we will share forever.\n\nI would also like to give a special mention to my coaching staff Kevin Nancekivell, Simon Ireland, Darryl Flahavan and Mike Phelan for their knowledge, dedication, help and support.\n\nPlymouth Argyle will always hold a special place in my heart, and I will continue to look out for and take interest in their results.\n\nRooney replaced Ian Foster in May on a three-year deal at Plymouth. He managed to oversee 23 Championship games, racking up four wins, 13 defeats and six draws.\n\nThe former Manchester United and England forwards last game at the helm came on Sunday, when Argyle were beaten 2-0 at fellow strugglers Oxford.\n\nRead more from Sky News:UK weather: Country braces for tricky start to 20252024: A year in satellite images\n\nHis unsuccessful spell with Plymouth is the second setback for Rooneys coaching career in 2024 following his dismissal as Birmingham City head coach in January.\n\nHe has previously managed Derby County and Major League Soccer (MLS) side DC United.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Screenshot-2024-12-31-at-15-19-31-Wayne-Rooney-and-Plymouth-Argyle-agree-to-part-ways-with-immediate-effect-UK-News-Sky-News-680x380.png",
            "description": "~3 minutes Wayne Rooney and Plymouth have “mutually agreed to part ways with immediate effect” after a nine-game winless run. Rooney, 39, leaves with the club bottom of the Sky Bet Championship, four points from safety and escaping the relegation zone. “We would like to thank Wayne and his team for all their efforts and […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "Plumtree Residents Likely to Enter the New Year 2025 Without Water",
            "url": "https://www.chronicle.co.zw/plumtree-residents-likely-to-enter-the-new-year-2025-without-water/",
            "content": "Ronald Mpofu, Online Reporter\n\nPLUMTREE Town Council has warned its residents of a water disruption due to a power outage at the pump booster station. Residents were advised that water services would likely only return to normal once the power supply is restored.The general public is advised that there is a power outage at our water booster pump stations, which has affected the water supply to the town. Normal supplies are expected to be restored once the power has been restored. Any inconvenience caused is sincerely regretted, said Plumtree Town Council in a statement.Ends\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2021/06/plumtree-town-council.jpg",
            "description": "Ronald Mpofu, Online Reporter PLUMTREE Town Council has warned its residents of a water disruption due to a power outage at the pump booster station. Residents were advised that water services would likely only return to normal once the power supply is restored. “The general public is advised that there is a power outage at […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "Ko-Samuriwo Pub to host epic end-of-year shutdown with T-man Xpress",
            "url": "https://www.chronicle.co.zw/ko-samuriwo-pub-to-host-epic-end-of-year-shutdown-with-t-man-xpress/",
            "content": "Online Reporter\n\nKO-SAMURIWO Pub and Grill in Bulawayo is promising an epic end-of-year shutdown, which coincides with its first anniversary, with South Africas Amapiano hitmaker T-man Xpress headlining the event.\n\nT-man Xpress will be supported by resident DJs Mzoe, Sweeto, and Fabg, among other local DJs and the local dance group Asante Mo, and many more.\n\nHaving opened last December, the pub and grill attracts hundreds of revellers with its affordable alcohol and enhanced security.\n\nIn an interview, Brian Samuriwo, who owns the popular venue, said that, as it has become a norm for Bulawayo residents to want a memorable end-of-year shutdown, his venue will deliver an epic crossover show for the party lovers.\n\nIts the end of the year, and we know that a lot of people want to have a great experience as they welcome the new year. As Ko-Samuriwo Pub and Grill, we are promising to deliver a memorable 2024 shutdown. We have booked South Africas Amapiano hitmaker T-man Xpress, who will be our main act for the shutdown. He will be supported by our local artists, as we value their contributions. We are going to have DJ Mzoe, who is also one of our resident DJs, providing entertainment as we welcome 2025, said Samuriwo.\n\nHe promised maximum security for those who would be celebrating the new year with them.\n\nSamuriwo expressed gratitude to the Bulawayo community for supporting his business, saying the pub and grill could be among the best employers in the sector in Bulawayo.\n\nThrough this business, we have been able to employ at least 140 young people who are now able to support their families. We are looking forward to providing quality services as we start the new year. During the year, we were able to upgrade the facility, introducing the VIP section, and we tried to respond to the expectations of our clientele, said Samuriwo.\n\nIm proud to say that since we started operating a year ago, we have been able to give back to the community, and this is due to the proceeds that come from the business.\n\nKo-Samuriwo is now part of the Bulawayo township tourism corridor, and this year, foreign delegates who attended the Sanganai/Hlanganani Tourism Expo visited the facility following recommendations from the Zimbabwe Tourism Authority.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/TYURU.jpg",
            "description": "Online Reporter KO-SAMURIWO Pub and Grill in Bulawayo is promising an epic end-of-year shutdown, which coincides with its first anniversary, with South Africa’s Amapiano hitmaker T-man Xpress headlining the event. T-man Xpress will be supported by resident DJs Mzoe, Sweeto, and Fabg, among other local DJs and the local dance group Asante Mo, and many […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "91st birthday celebration of granny in Nyabane Village sparks joy and unity",
            "url": "https://www.chronicle.co.zw/91st-birthday-celebration-of-granny-in-nyabane-village-sparks-joy-and-unity/",
            "content": "Ronald Mpofu, Online Reporter\n\nA REMARKABLE 91-year-old grandmother celebrated her milestone birthday in style on 28 December 2024 at her Nyabane village homestead. The vibrant celebration, masterfully organised by her son, Meluleki Maranatha Mhlanga, and his wife, Nontobeko Patience Mhlanga, left the community in awe of the joyous occasion.\n\nThe celebration was elevated to new heights with a sleek, 21st-century flair, making it a truly unforgettable experience in a rural setting. The events success was attributed to the expertise of various professionals, including Dumi Events, who crafted the stunning dcor and catering; a live band of producers from Botswana, which included Kuseri Kumakili, popularly known as Kudzi of KK Studios in Gaborone; a Zimbabwean international saxophonist based in Botswana, Mr Andrew Chinganga, who has performed in Italy, Germany, and many other countries; and Pastor Mafu of the Pentecostal Assemblies of Zimbabwe (PAOZ), who delivered an electrifying performance. Roxtonic Media provided top-notch photography and videography services, and the charismatic poet Obert Dube skillfully hosted the ceremony as the master of ceremonies.\n\nBotswana Band of Producers\n\nEnnes Mathuma Mhlanga (ne Ncube) was born on 8 August 1933 at Nyabane. She married Makhosi Lot Mhlanga in 1954, marking 70 years of marriage this year. The couple was blessed with seven children, of whom their first-born, Shadreck Mhlanga, died in Zambia during the liberation struggle. The second-born, Angel Mhlanga, passed away last year. The surviving children are Senaniso, Simangele, Melusi, Meluleki Maranatha, and Sifiso Mhlanga.\n\nObert Dube and Ennes Mhlanga\n\nMrs Mhlanga, nicknamed NaNgondo, was lavished with praise for her tireless efforts and dedication to raising her children. Even today, she can still read and write, as she wrote some of the invitation letters for her birthday.\n\nAmong the invited guests were Chief Somfula Sikhathini, Councillor Ephraim Dube, and Mr Jonathan Ndlovu.\n\nChief Somfula Sikhathini\n\nNaNgondo, we wish you many more years in this life. At the age of 91, you can still manage to plough and uproot weeds from the fields. May you remain blessed with this energy you have today until you reach 100 years, said Mr Ephraim Moyo, the Ward 17 Councillor.\n\nMarking the end of the event, 20 grannies from the surrounding homesteads received presents of blankets from Mr and Mrs Maranatha.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Ennes.jpg",
            "description": "Ronald Mpofu, Online Reporter A REMARKABLE 91-year-old grandmother celebrated her milestone birthday in style on 28 December 2024 at her Nyabane village homestead. The vibrant celebration, masterfully organised by her son, Meluleki Maranatha Mhlanga, and his wife, Nontobeko Patience Mhlanga, left the community in awe of the joyous occasion. The celebration was elevated to new […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "Man jailed for 6 years for stealing a car",
            "url": "https://www.chronicle.co.zw/man-jailed-for-6-years-for-stealing-a-car/",
            "content": "Tarisiro Tafirenyika [emailprotected]\n\nA 46-YEAR-OLD man from Mberengwa was sentenced to prison for theft and possession of illegal items in the Zvishavane Magistrates Court.\n\nOn 5 November, at around 7:30 PM, the complainant parked his Toyota Funcargo next to his bedroom window. He locked the doors and took the keys with him before going to bed. On 6 November, at about 3:00 AM, Hlangabeza Mabhula, also known as Benjamin Kutira, approached the complainants house wearing a balaclava and gloves. He broke into the locked Toyota Funcargo, started the car without the keys, and damaged the ignition.\n\nIn a statement on X, the National Prosecuting Authority of Zimbabwe (NPAZ) said the complainant woke up to the sound of the engine and saw Mabhula reversing the car. He ran outside and threw a stone behind the cars wheel to stop it. Mabhula got out, armed with a kitchen knife, and charged at the complainant, who managed to escape. With help from the public, the complainant apprehended Mabhula near Mandava Cemetery.\n\nPolice found Mabhula with the stolen car, a balaclava, a kitchen knife, a table knife, a makeshift screwdriver, and an okapi knife.\n\nThe court sentenced Mabhula to six years in prison for stealing the car, with two years suspended, meaning he would serve four years. For possessing illegal items, he was fined USD 200 or given an additional two months in prison. All the items used in the crime were taken by the state and would be destroyed.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/05/arrested23-.jpg",
            "description": "Tarisiro Tafirenyika – tarisirotafirenyika@gmail.com A 46-YEAR-OLD man from Mberengwa was sentenced to prison for theft and possession of illegal items in the Zvishavane Magistrates’ Court. On 5 November, at around 7:30 PM, the complainant parked his Toyota Funcargo next to his bedroom window. He locked the doors and took the keys with him before going […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "High rainfall recorded across the country",
            "url": "https://www.chronicle.co.zw/high-rainfall-recorded-across-the-country/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nThe Meteorological Services Department has indicated that significant rainfall fell across Zimbabwe, easing some farmers concerns over the state of their crop which was wilting.\n\nThe recent increase in atmospheric moisture has led to widespread thunderstorms, with heavy rainfall occurring on Monday and overnight.\n\nSome of the highest recorded rainfall amounts fell in Marondera (130 mm), Gokwe (124 mm) and Kadoma Rail (100 mm).\n\nThe remainder of the country however recorded amounts below 20 mm. Initially, on Monday morning skies were partly cloudy and mild; however, by afternoon, conditions shifted to cloudy and warm, accompanied by scattered thunderstorms.\n\nThe department said Tuesday will begin with mild, partly cloudy conditions in the morning, transitioning to cloudy and warm weather throughout the day, with scattered thunderstorms expected in the afternoon.\n\nOn Wednesday, isolated thundershowers are likely to occur in Matabeleland South, southern parts of Midlands, and Masvingo provinces.\n\nThe Agricultural and Rural Development Advisory Services (ARDAS), chief director Mr Leonard Munamati, highlighted the need for farmers to finalise planting due to the increasingly short growing season.\n\nVarious areas have received rainfall during the festive season, and we are quite excited because in the past two days, most areas received heavy rainfall, he said.\n\nFarmers who have planted are now expecting germination and looking forward to improved rains. Most crops are currently in the vegetative stage, allowing for fertiliser application. We encourage split applications to enhance crop conditions.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Rains.jpg",
            "description": "Precious Manomano Herald Reporter The Meteorological Services Department has indicated that significant rainfall fell across Zimbabwe, easing some farmers’ concerns over the state of their crop which was wilting. The recent increase in atmospheric moisture has led to widespread thunderstorms, with heavy rainfall occurring on Monday and overnight. Some of the highest recorded rainfall amounts […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "Prophet Bruce and Pamela Edwards’ digital dawn: How social media has helped them reach new heights",
            "url": "https://www.chronicle.co.zw/prophet-bruce-and-pamela-edwards-digital-dawn-how-social-media-has-helped-them-reach-new-heights/",
            "content": "Mthabisi[emailprotected]\n\nIN 2024, Prophet Bruce Edwards and his wife, Prophetess Pamela Edwards, achieved a remarkable feat in modern ministry by harnessing the power of social media to elevate their church, Kingdom Empowerment Centre, to new heights.\n\nTheir innovative use of digital platforms has not only expanded their reach but has also created a vibrant online community for believers seeking solace and inspiration.\n\nProphet Edwards has become a beacon of hope in the digital landscape, establishing a digital sanctuary where followers can gather virtually to deepen their faith.\n\nThrough inspiring posts, live streams, and engaging videos, he has successfully shared his sermons and teachings with a global audience.\n\nThis digital outreach has connected him with people from diverse backgrounds, offering guidance, counselling, and support to those in need.\n\nReflecting on his journey, Prophet Bruce remarked, Social media is not just a tool; its a lifeline. It allows us to reach people who may never set foot in a physical church. In 2025, my message remains clear: hope is alive, and together, we can build a community of faith that transcends boundaries.\n\nTonight, the couple will host a much-anticipated CrossOver Night at the Zimbabwe International Exhibition Centre (ZIEC) Hall 2, welcoming worshippers to usher in the New Year with prayer and celebration.\n\nThis event is expected to draw attendees from Bulawayo, Filabusi, Gwanda, and Harare, where they have previously held live events focused on all-night prayers and spiritual interaction among men, women, and youth.\n\nOne of the key factors behind Prophet Bruces online success is his knack for simplifying complex spiritual concepts.\n\nHis relatable and engaging communication style has not only made spiritual teachings accessible but has also transformed the lives of many followers.\n\nAs a motivational speaker, he inspires individuals to embrace their potential and seek personal growth, all while actively engaging in philanthropic efforts to uplift the community.\n\nAs we step into 2025, the digital ministry of Prophet Bruce and Pamela Edwards continues to thrive, promising to touch more lives and spread a message of hope, faith, and empowerment.\n\nTheir journey serves as a testament to the profound impact of technology in faith-based outreach, inspiring a new generation of believers to connect with their spirituality in innovative ways.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hfgr.jpg",
            "description": "  Mthabisi Tshuma-revmmthiretshuma@gmail.com IN 2024, Prophet Bruce Edwards and his wife, Prophetess Pamela Edwards, achieved a remarkable feat in modern ministry by harnessing the power of social media to elevate their church, Kingdom Empowerment Centre, to new heights. Their innovative use of digital platforms has not only expanded their reach but has also created a […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        },
        {
            "title": "New Year’s Eve with Macheso at Beitbridge",
            "url": "https://www.chronicle.co.zw/new-years-eve-with-macheso-at-beitbridge/",
            "content": "Langalakhe Mabena\n\nAfter successfully staging a soldout gig at Esigodinis Athens last night, legendary Sungura maestro Alick Macheso has travelled to Beitbridge for a show to be held at Pagomba Cafe tonight.\n\nDubbed Beitbridge Shutdown, the New Years Eve event will see Macheso and the Ochestra Mberikwazvo performing alongside Apama, as they usher revellers into 2025 with a splendid gig.\n\nBaba Shero as Mecheso is affectionately known confirmed the gig as he said he is looking forward to having fun with his fans at Pagomba.\n\nWhen we say Orchestra Mberikwazvo is the peoples band we mean that we reach wherever our people request us to be. And this time around, people from Beitbridge requested that we enter a new year with them and we have honoured that as tonight we will be dancing and celebrating together.\n\nWe have become regulars here in Beitbridge and this is the second if not the third time for us to visit here and this means we are home and we are looking forward to have fun, said Macheso.\n\nDJ Keitho, one of the event organisers said all is set for tonights gig.We have staged several high-profile gigs at Pagomba during the year and as we end 2024, we want to shut it down in style that is why we settled for Macheso as he is a legend loved by many.People have to come in numbers to witness the spectacular show as Macheso and Apama are expected to deliver their best like always, said Keitho.\n\nDJ Keitho, one of the event organisers said all is set for tonights gig.\n\nWe have staged several high-profile gigs at Pagomba during the year and as we end 2024, we want to shut it down in style that is why we settled for Macheso as he is a legend loved by many.\n\nPeople have to come in numbers to witness the spectacular show as Macheso and Apama are expected to deliver their best like always, said Keitho.\n\nPeople have to come in numbers to witness the spectacular show as Macheso and Apama are expected to deliver their best like always, said Keitho.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/09/Alick-Macheso.jpg",
            "description": "Langalakhe Mabena After successfully staging a soldout gig at Esigodini’s Athens last night, legendary Sungura maestro Alick Macheso has travelled to Beitbridge for a show to be held at Pagomba Cafe tonight. Dubbed Beitbridge Shutdown, the New Year’s Eve event will see Macheso and the Ochestra Mberikwazvo performing alongside Apama, as they usher revellers into […]",
            "time": "20:24",
            "date": "31 Dec 2024"
        }
    ]
}