{
    "news": [
        {
            "title": "Grand send-off for National Hero Siziba",
            "url": "https://www.chronicle.co.zw/grand-send-off-for-national-hero-siziba/",
            "content": "Sukulwenkosi Dube-Matutu,[emailprotected]\n\nIT was a fitting tribute for a national hero as the body of the late Major-General (Retired) Solomon Siziba was welcomed with ululations, songs, poetic praises and traditional rituals yesterday at his rural home in Nhwali Village in Gwanda District, Matabeleland South.\n\nHundreds of villagers, Government officials and traditional leaders gathered to pay their respects to a man whose life was devoted to the liberation and development of Zimbabwe.\n\nThe solemn yet celebratory atmosphere was marked by the hauntingly beautiful chants of women, who performed traditional poetry, extolling Sizibas bravery, wisdom and enduring legacy.\n\nPall bearers remove a hearse carrying the body of the late national hero Major General (Rtd) Solomon Siziba from a military helicopter at Nhwali High School in Gwanda\n\nThe village reverberated to life as elderly Venda women led the poetic praises, a cultural ritual to honour his lifes work and formally present him to his ancestors for a warm reception in the afterlife. The moving ceremony reflected the deep respect and gratitude for the contributions of the late national hero.\n\nThe body of the national hero, who passed on last Wednesday, arrived in Gwanda from Bulawayo aboard a military helicopter that landed at Nhwali High School. It was greeted by a large gathering, including Matabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu, Gwanda South legislator and Deputy Minister of Information, Publicity, and Broadcasting Services Dr Omphile Marupi, service chiefs, family members and the local community.\n\nAfter a farewell service at his homestead, the body was transported to Killarney suburb, Bulawayo, where it will lie in state. A Zimbabwe National Army (ZNA) funeral parade is scheduled to take place at Imbizo Barracks today, with burial at the National Heroes Acre on Wednesday.\n\nSpeakers at the farewell ceremony praised Major-General Siziba for his dedication to the nation and his community.\n\nGwanda Ward 24 war veterans chairperson, Cde King Mtlokwa, expressed gratitude for the opportunity to bid farewell to a comrade within their community. He reflected on their shared upbringing and the valuable lessons he learned from the late hero.\n\nFamily representative Mr Isaac Siziba described Major-General Siziba as a selfless individual who prioritised empowering his relatives and extending his generosity to the wider community.\n\nHe said the late national hero was a father figure, even to the elderly.\n\nThe late Major-General (Retired) Solomon Siziba\n\nDr Ndlovu, the chief mourner, said the national hero status bestowed upon Major General Siziba was well-deserved, given his significant contributions to the countrys liberation. Major-General Siziba was a shining example of courage, loyalty and dedication. His unwavering commitment to justice, equality, and freedom made him a true patriot who served our nation with honour and distinction.\n\nHis bravery and strategic thinking shaped the course of our history and his contributions to our defence and security will never be forgotten, she said.\n\nDr Ndlovu expressed her deepest condolences to the Siziba family and the entire community for their loss.\n\nDeputy Minister Marupi, speaking on behalf of Zanu-PF, highlighted the sacrifices made by freedom fighters like Major-General Siziba.\n\nMajor-General Siziba sacrificed a lot of luxuries to liberate the country and hence people like him should be honoured. We are what we are today because of the works of people like him, he said.\n\nBorn in Nhwali, Maj-Gen (Rtd) Siziba attended Nhwali Primary School and proceeded to Manama High School in 1976.\n\nThe following year, he was part of the group that joined the armed struggle together with the now late national hero, Lt-Gen Sibusiso Busi Moyo, Beitbridge East legislator Cde Albert Nguluvhe, former commander of the Airforce, Chief Marshal (Rtd) Elson Moyo and former Zimbabwe International Trade Fair (ZITF) public relations manager, Mrs Cecilia Bhebhe, among others\n\nHe trained in Zambia and was attested into the ZNA during the ceasefire period.\n\nLeft: Pallbearers lift a casket carrying the body of the late national hero Major-General (Rtd) Solomon Siziba from a military helicopter at Nhwali High School in Gwanda. Above: Mourners pay their last respects at the Siziba homestead in Gwanda yesterday\n\nMaj-Gen (Rtd) Siziba was stationed at the Zimbabwe Military Academy in Gweru where he rose to the rank of Captain.\n\nHe was then transferred to the ZNA headquarters where he worked until 2005, rising to the position of Lieutenant-Colonel. He was posted to Botswana as Defence Attach from 2005 to 2013.\n\nUpon his return to Zimbabwe in 2013, Maj-Gen (Rtd) Siziba was appointed the Deputy Commander of One Brigade following his elevation to the rank of Colonel.\n\nFrom 2013 until 2018, he was appointed Director of Administration at the National Prosecuting Authority. Maj-Gen (Rtd) Siziba returned to the ZNA in 2018 and was elevated to the rank of Brigadier-General and was assigned to the Brigadier-General Inspectorate, a post he held until he retired from the military last year.\n\nHe was elevated to the position of Maj-Gen upon his retirement.\n\nMaj-Gen (Rtd) Siziba is survived by two children.@DubeMatutu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/111-680x380.jpg",
            "description": "Sukulwenkosi Dube-Matutu, sukulwenkosi.dube@chronicle.co.zw IT was a fitting tribute for a national hero as the body of the late Major-General (Retired) Solomon Siziba was welcomed with ululations, songs, poetic praises and traditional rituals yesterday at his rural home in Nhwali Village in Gwanda District, Matabeleland South. Hundreds of villagers, Government officials and traditional leaders gathered to pay […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Double heroes’ burial on Wednesday",
            "url": "https://www.chronicle.co.zw/double-heroes-burial-on-wednesday/",
            "content": "Harare Bureau\n\nNATIONAL Heroes Major General (Retired) Solomon Siziba and Cde Chenhamo Chen Chakezha Chimutengwende, who both passed away last week, will be buried at the National Heroes Acre in Harare on Wednesday.\n\nThe Government, through the Ministry of Home Affairs and Cultural Heritage, announced the twin heroes burial.\n\nMaj-Gen Siziba died at Josiah Magama Tongogara Barracks Camp Hospital last Wednesday after a long battle with cancer.\n\nHe was 67.\n\nCde Chimutengwende, a former Minister of Information, Posts and Telecommunications, succumbed to chronic kidney disease last Thursday.\n\nHe was 81.\n\nIn a statement yesterday, the Ministry of Home Affairs and Cultural Heritage, said following the conferment of National Hero status on the two patriots and indefatigable sons of the soil, there will be a twin burial for late Major General (Rtd) Solomon Siziba and Cde Chen Chimutengwende.\n\nBurial will be on Wednesday, 22 January 2025 at the National Heroes Acre, added the statement.\n\nOn Saturday, Maj-Gen Sizibas body was flown to Bulawayo, where friends, relatives, and the leadership of Bulawayo and the Matabeleland region paid their last respects.\n\nYesterday, his body was airlifted to his village and farm in Gwanda before returning to Bulawayo to lie in state at his family home.\n\nA funeral parade in his honour will be held this morning at 11am at Imbizo Barracks in Bulawayo.\n\nFollowing this, his body will be airlifted back to Harare to lie in state at Charles Gumbo Barracks ahead of burial on Wednesday.\n\nSimilarly, Cde Chimutengwendes body will be airlifted to his rural home in Chiweshe, at Majome Primary School, Mazowe District, where the entire Mashonaland Central Province will be able to pay their respects.\n\nHis body will lie in state in Chiweshe before being airlifted back to Harare on Tuesday.\n\nIt will lie in state at Charles Gumbo Barracks ahead of burial.\n\nGovernment said people should attend the burial proceedings on Wednesday, to give a fitting send-off to the two great sons of the soil.\n\nCde Chimutengwende has been described as a strong member of Zanu-PF, who played a major role before and after independence.\n\nHe served as a Government Minister, Member of Parliament for Mazowe and a Politburo member.\n\nBorn on August 28, 1943, Cde Chimutengwende first became a Zanu-PF Member of Parliament in 1985 in Mazowe and served as a legislator for over 25 years.\n\nHe also served for 14 years as a Cabinet Minister.\n\nCde Chimutengwende served as Senator and Deputy President of the Senate, Member of the Pan-African Parliament (PAP) and Head of the Zimbabwe delegation to the PAP.\n\nHe earned a Masters degree in Social Science and a PhD from the University of Bradford in the UK.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Chen-Chimutengwendeleft-The-late-Major-General-Retired-Solomon-Siziba.jpg",
            "description": "Harare Bureau NATIONAL Heroes Major General (Retired) Solomon Siziba and Cde Chenhamo “Chen” Chakezha Chimutengwende, who both passed away last week, will be buried at the National Heroes’ Acre in Harare on Wednesday. The Government, through the Ministry of Home Affairs and Cultural Heritage, announced the twin heroes’ burial. Maj-Gen Siziba died at Josiah Magama […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zifa polls countdown…Gwesela pledges to  end 6% levy on PSL clubs",
            "url": "https://www.chronicle.co.zw/zifa-polls-countdown-gwesela-pledges-to-end-6-levy-on-psl-clubs/",
            "content": "Innocent Kurira,[emailprotected]\n\nASPIRING Zifa board member Xolisani Gwesela says once elected, he will propose for the abolition of the six percent levy presently deducted from Premier Soccer League (PSL) clubs match-day revenues.\n\nThis bold initiative is at the heart of Gweselas comprehensive set of proposals, which aim to promote financial sustainability and development within the sport.\n\nBy scrapping the six percent levy, Gwesela believes that clubs will be able to invest more in player development, infrastructure and other essential areas.\n\nIn addition, Gwesela has pledged to engage in robust discussions with the Sports and Recreation Commission (SRC) to abolish the six percent deduction imposed on PSL clubs.\n\nThis move is expected to further alleviate the financial burden on clubs and allow them to focus on competing at the highest level.\n\nGweselas proposals also extend to the realm of governance, where he has advocated for the abolition of affiliation fees paid by ZIFA members and player registration fees paid by clubs.\n\nThis, he believes, will help to create a more inclusive and equitable football ecosystem in Zimbabwe.\n\nIn a gesture of leadership by example, Gwesela has proposed that the elected Zifa president forfeit the $50 000 annual payment deducted from the CAF grant.\n\nThis move is seen as a vital step towards optimising the use of resources and ensuring that funds are channelled towards meaningful development initiatives.\n\nFurthermore, Gwesela has emphasised the need to prioritise the welfare of Zifa staff, pledging to ensure that salaries and staff benefits are paid in full and on time. This, he believes, will help to boost morale and motivate staff, ultimately contributing to a more efficient and effective administration.\n\nFinally, Gwesela has proposed the establishment of a tripartite agreement involving ZIFA, local authorities and the Central Government. This partnership will focus on driving infrastructural development, with the aim of creating modern, state-of-the-art facilities that can host international matches and provide a fitting platform for Zimbabwean football to thrive.\n\nAs a passionate advocate for Zimbabwean football, I am committed to creating a more sustainable and equitable future for our beloved sport, Gwesela said.\n\nThese proposals are designed to unlock the full potential of our football ecosystem and I am excited to work with stakeholders to turn this vision into a reality.\n\nGweselas qualifications make him a strong candidate for the Zifa board.\n\nHe holds a Masters of Science in Media and Society Studies, a Postgraduate Diploma in Media and Society Studies and a Bachelor of Science (Hons) in Administration.\n\nGweselas experience in football administration is impressive, having worked as a Caf General Co-ordinator, a Cosafa General Co-ordinator and a Zifa Administration Instructor. He has also held various positions within Zifa, including Chief Operations Officer, Communications and Competitions Manager and Acting CEO.\n\nWith his wealth of experience and qualifications, Gwesela is confident that he has what it takes to contribute to the success of Zifa.\n\nThe elections are scheduled for January 25.\n\nGwesela will face competition from several other candidates for the Zifa board member post, including veteran administrator Chris Mtungwazi, former Warriors manager Sharrif Musa, Alois Bunjira, Highlanders secretary Morgen Dube, former Warriors coach Sunday Chidzambga, ex-Zifa Southern Region chairperson Andrew Tapela, Tizirayi Luphahla and womens football administrator, Sibekiwe Ndlovu.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/ujkiyuy.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw ASPIRING Zifa board member Xolisani Gwesela says once elected, he will propose for the abolition of the six percent levy presently deducted from Premier Soccer League (PSL) clubs’ match-day revenues. This bold initiative is at the heart of Gwesela’s comprehensive set of proposals, which aim to promote financial sustainability and development within […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "COMMENT: Let’s all as citizens unite and fight the scourge of corruption",
            "url": "https://www.chronicle.co.zw/comment-lets-all-as-citizens-unite-and-fight-the-scourge-of-corruption/",
            "content": "ZIMBABWEANS have once again been reminded that the anti-corruption fight is a collective responsibility hence the need for citizens to unite and fight the scourge.\n\nCommenting on the recent arrest of its four employees on allegations of corruption, the Zimbabwe Revenue Authority said it believes civic responsibility is essential in the collective effort to fight corruption.\n\nIt therefore urged members of the public to report any suspected corruption promptly so that appropriate measures can be taken.\n\nThe four employees were arrested at Beitbridge Border Post for soliciting bribes for the release of confiscated goods.\n\nZimra said it is committed to combating corruption and maintaining its integrity as an institution. It said it wants to ensure its operations are conducted transparently for the benefit of citizens.Together we can foster a culture of integrity that benefits all citizens, it said.\n\nZimra said it does not tolerate or support corrupt practices among its employees. It said it is committed to upholding the highest standards of integrity hence it takes any corruption allegations against its employees very seriously.\n\nPresident Mnangagwa has said there is a need for the private sector and other stakeholders to complement Government efforts to fight corruption.\n\nHe said Government on its part has embarked on a robust programme to strengthen good corporate governance and accountability in the management of public resources.\n\nIntegrity committees have been set up at public institutions to prevent corruption and promote good corporate governance.\n\nPresident Mnangagwa said the private sector, civil society and other stakeholders should also prioritise transparency and accountability through in-house anti-corruption efforts.\n\nThe Chartered Governance and Accountancy Institute of Zimbabwe (CGAIZ) has trained police officers and Zimbabwe Anti-Corruption Commission (Zacc) officials in forensic accounting, auditing and cyber security.\n\nPresident Mnangagwa said such collaboration goes a long away in strengthening public institutions to effectively and efficiently deliver on their mandate. He also urged members of the security sector to constantly upgrade their skills to keep abreast with criminals and corrupt elements modern techniques to evade the law.\n\nGovernment has already announced that plans are underway to introduce anti-corruption curricula from ECD to tertiary education as the nation steps up its fight against corruption.\n\nPresident Mnangagwa has said his administration will not shy away from taking corruption by the horns as the scourge has debilitating effects of retarding economic growth and development.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube said last Thursday that Government in its effort to fight corruption, is empowering anti-graft agencies and reinforcing the value for money concept.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/President-Mnangagwa.jpg",
            "description": "ZIMBABWEANS have once again been reminded that the anti-corruption fight is a collective responsibility hence the need for citizens to unite and fight the scourge. Commenting on the recent arrest of its four employees on allegations of corruption, the Zimbabwe Revenue Authority said it believes civic responsibility is essential in the collective effort to fight […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "WATCH: Scotts Maphuma shakes off January disease…leaves fans clamouring for more",
            "url": "https://www.chronicle.co.zw/watch-scotts-maphuma-shakes-off-january-disease-leaves-fans-clamouring-for-more/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nAMAPIANO musician Scotts Maphuma had people shake off January disease as he performed to a packed Cosmopolitan VIP Lounge in Bulawayo on Saturday night.\n\nWhen he landed at the Joshua Mqabuko Nkomo International Airport from South Africa, the Amapiano man of the moment, Scotts Maphuma promised his fans lightning during his show and from the experience it was just that.\n\nAt first it seemed the crowd was not that engaged in the proceedings as some were lazily dancing to the songs and seemed uninterested.\n\nHowever, the mood shifted a gear up as various local DJs took turns on the decks with DJ Sands dishing out everyones favourite tunes setting the mood for the night, followed by Umlungu Omnyama who did not disappoint either as well as DJ Liz.\n\nThere was hardly breathing space in the VVIP section and most people could be seen moving to the VIP section though they had to stand as all seats were occupied.\n\nThe music was pumping and the place was rocking, and the mood reached fever pitch when the man of the moment, Scotts Maphuma then took to the stage, amid a cacophony of cheers, screams and whistles.\n\nTaken by surprise and almost causing a stampede, his fans rushed to take a closer look with some fighting to get the best shot of his entrance.\n\nAfter taking to the stage, Scotts Maphuma lived up to his promise.\n\nHe dropped hit after hit of the peoples favourite, Wishi Wishi, One man side to side, Shaymoto and Biri Marung a track which was a crossover track on New Years Eve.\n\nIn the crowd many were dripping in sweat and could not sit down at the VVIP section as most opted to climb on top of tables just to get a clear view of the performance.\n\nThe crowd could not get enough of his time on stage as some were disappointed when he left.Some immediately left the night spot as they felt he should have performed longer than he did.\n\nOne reveller Edwin Makawure said he enjoyed the show and would love to see Scotts Maphuma on stage again.\n\nThe show was on fire, Scotts is a good performer but I feel he should have stayed on stage longer than he did.\n\nHowever, he made us dance throughout which is good and I hope we will be having more promoters bringing him in upcoming shows as he is clearly loved in Zimbabwe, he said.\n\nCharmaine Nkomo from Pumula said she enjoyed the performance too.\n\n I enjoyed the performance,I feel Scotts did justice on the stage. It was also a dream come true for me to witness a performance from my favourite artiste, she said.\n\nThough people wanted more from Maphuma, DJ Feel G contained the situation keeping the already blazing mood on fire through Zimdancehall and club anthems.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/lklklklj.jpg",
            "description": "Sipepisiwe Moyo,moyosipepisiwe@gmail.com AMAPIANO musician Scotts Maphuma had people shake off January disease as he performed to a packed Cosmopolitan VIP Lounge in Bulawayo on Saturday night. When he landed at the Joshua Mqabuko Nkomo International Airport from South Africa, the Amapiano man of the moment, Scotts Maphuma promised his fans “lightning” during his show and […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Woman in court for  attack on co-wife  over husband",
            "url": "https://www.chronicle.co.zw/woman-in-court-for-attack-on-co-wife-over-husband/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA 28-YEAR-OLD Bulawayo woman has appeared in court facing charges of assaulting her sister wife during a dispute over their husband.\n\nCaroline Pindani was arraigned before Western Commonage magistrate Mr Mehluli Moyo, who remanded her out of custody to January 27.\n\nThe prosecutor, Mrs Ellen Matenga said the incident occurred on January 12 when Pindani visited her sister wife, Mrs Grace Sibanda, at her home.\n\nAn argument arose between the two over their husband, leading to Pindani allegedly assaulting Mrs Sibanda, said Mrs Matenga.\n\nThe court heard that Pindani allegedly punchedMrs Sibanda, leaving her with a bruised face and a blue eye.\n\nIn her defence, Pindani denied the allegations, claiming there was no physical assault but rather a misunderstanding.\n\nI never assaulted her. I went to her house to ask if our husband could accompany me to the hospital. I have twins, and one of them needed to go to a local hospital for physiotherapy. I needed his help with the other twin since I am still breastfeeding, she said.\n\nPindani said while she was speaking with their husband, Mrs Sibanda came outside and intervened.\n\nWhen she held his hand, I also held his other hand. She then dragged him to her side while I tried to pull him to mine.\n\nIt was during this struggle that she overpowered me. She is the one who assaulted me, said Pindani.\n\nTestifying in court, Mrs Sibanda refuted Pindanis claims, insisting that she was the victim.\n\nShe came to my house and started insulting me, accusing me of not allowing our husband to go with her to the hospital. I stood on the left side of our husband, but she began pulling him to her side.\n\nWhen I resisted, she slapped me and hit me with her fists, leaving me with bruises, said Mrs Sibanda.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/08/court.gavel_.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com  A 28-YEAR-OLD Bulawayo woman has appeared in court facing charges of assaulting her sister wife during a dispute over their husband. Caroline Pindani was arraigned before Western Commonage magistrate Mr Mehluli Moyo, who remanded her out of custody to January 27. The prosecutor, Mrs Ellen Matenga said the incident occurred on January 12 […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Businessman posted ‘disturbing  messages’",
            "url": "https://www.chronicle.co.zw/businessman-posted-disturbing-messages/",
            "content": "Raymond Jaravaza,[emailprotected]\n\nA Bulawayo businessman Mr John Tafara Madzikatire allegedly fatally shot himself near his girlfriends house in Cowdray Park suburb on Saturday night.\n\nAccording to sources, Mr Madzikatire had, before the tragedy, been posting messages about death and suicide on his social media platforms.\n\nThe late Mr Madzikatire, who owned butcheries at KoChigumira Leisure Centre in Luveve and in Pumula North suburb, was found with a gunshot wound to his head outside his girlfriends house.\n\nBulawayo provincial spokesperson Assistant Inspector Nomalanga Msebele confirmed the incident, saying investigations are underway.\n\nPolice confirm the death of John Tafara Madzikatire who was found with a gunshot wound in the head.\n\nPolice are treating the case as suicide and investigations are underway, she said.\n\nAccording to people close to the late Mr Madzikatire, two days before his death, he posted a troubling message on his WhatsApp status:\n\nIf I leave this world u (you) will not say I am a coward, you better call me a coward, and I have no choice.\n\nA friend of the late Mr Madzikatire who refused to be named, said although the message appeared to hint at suicidal thoughts, it was not taken seriously at the time.\n\nSometimes people post messages that make it appear as if they are suicidal, but we didnt take it seriously. We dont really know what happened, whether it was suicide or something else, but his WhatsApp messages were disturbing, the friend said.\n\nWorkers at Samaz Butchery, one of the late Mr Madzikatires businesses, recalled seeing their boss on Saturday around 5 pm when he delivered meat to the Luveve outlet in his black Mercedes Benz.\n\nHe was accompanied by a young woman who stayed behind in the car while he unloaded the meat.\n\nWe were alerted by one of his friends that he had shot himself outside the womans house in Cowdray Park. We are still in disbelief that the boss killed himself. The butcheries will remain closed until we hear from the family, said an employee, who requested to remain anonymous.\n\nThe workers said soon after receiving the news about their boss death, they quickly hired a Honda Fit vehicle and rushed to the scene, where they found the police already present. The late businessmans vehicle was later parked outside the Luveve butchery after police released it to the family.\n\nThe late Mr Madzikatire is believed to have been with his girlfriend when he allegedly shot himself.\n\nThe girlfriend was questioned by police and later released.\n\nPolice sources said large sums of money were found at the scene of the shooting.\n\nThe cause of Mr Madzikatires death is still under investigation but the concerning social media posts have added to the mystery.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/business-man-shoots-self1.jpg",
            "description": "Raymond Jaravaza, raymondjaravaza@gmail.com A Bulawayo businessman Mr John Tafara Madzikatire allegedly fatally shot himself near his girlfriend’s house in Cowdray Park suburb on Saturday night. According to sources, Mr Madzikatire had, before the tragedy, been posting messages about death and suicide on his social media platforms. The late Mr Madzikatire, who owned butcheries at KoChigumira Leisure […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zimbabwe to advocate global financial reforms",
            "url": "https://www.chronicle.co.zw/zimbabwe-to-advocate-global-financial-reforms/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nZIMBABWE will leverage the World Economic Forum (WEF) annual meeting in Davos-Klosters, Switzerland, to advocate for crucial reforms to the global financial architecture and highlight the countrys rich natural resources, particularly in the energy minerals sector.\n\nThis years forum being held under the theme Collaboration for the Intelligent Age, will run from January 20 to 24, bringing together global leaders to address pressing challenges, including geopolitical shocks, economic growth and an inclusive energy transition.\n\nFinance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, will lead Zimbabwes delegation at the event.\n\nProf Ncube, who is also the chairman of the Committee of African Finance Ministers, stressed that reforming the global financial system is essential to better serve developing nations, particularly in Africa.\n\nSpeaking on the X platform last Thursday, Minister Ncube underscored the urgent need for change in the international financial framework.\n\nOver the past years, leaders on the continent as well as civil societies and economic think tanks, have raised concerns over how the international financial architecture is designed, saying it does not work for Africa.\n\nThe continent has borne the brunt of multiple global crises, with many African nations slipping into debt distress or default, and government borrowings reaching unprecedented levels.\n\nProf Ncube pointed out that Africas unsustainable debt burden has hindered social service delivery, deepened poverty and created a dependency syndrome.\n\nDespite being rich in natural resources, Africa continues to be disadvantaged by a global financial system designed to benefit superpowers, with terms that often trap developing nations in a cycle of hardship.\n\nThere is an issue of reforming the global financial architecture such that it must benefit developing countries. We are recalling the reform of the global financial architecture in the sense that we need to scale up development financing, said Prof Ncube.\n\nIt should be more concretionary going forward. This is critical to support economic development, especially in areas around infrastructure.\n\nProf Ncube said similar calls will be amplified at discussions at G20 level under South Africa on various strategies on how it could be achieved.\n\nSouth Africa is this year hosting G20, an inter-governmental economic forum comprising 19 countries and two regional unions  the European Union (EU) and recently the African Union (AU).\n\nIt represents 85 percent of the global economy, 75 percent of world trade and 67 percent of the global population.\n\nDuring the X engagement, Prof Ncube noted that WEF presents a platform for Zimbabwe to showcase its vast new energy minerals.\n\nWe are faced with a wonderful opportunity in terms of opportunities created by the fast-paced development in artificial intelligence, new technologies, new minerals of the future and bio-technology, he said.\n\nAt Davos, we will also discuss climate change issues as climate shocks are an issue which are real issues to us. Another area is on industrialisation and the issue of new energy minerals comes into play and Zimbabwe is a key global player with our endowment in rare earth minerals.\n\nProf Ncube said Zimbabwe will be contributing to how Africa should be contributing with its natural endowment in terms of the new energy minerals for maximum benefit.\n\nGlobal demand for critical minerals is projected to grow three-fold by 2040, presenting a strategic opportunity for African producers including Zimbabwe to increase output and the development of untapped mineral deposits.\n\nZimbabwe has been working to grow mining to a US$12 billion industry, supported by its vast mineral resources especially gold, platinum, lithium and chrome, which should anchor economic upturn and the countrys Vision 2030 of becoming an upper-middle-income economy.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/ghhggh.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw ZIMBABWE will leverage the World Economic Forum (WEF) annual meeting in Davos-Klosters, Switzerland, to advocate for crucial reforms to the global financial architecture and highlight the country’s rich natural resources, particularly in the energy minerals sector. This year’s forum being held under the theme “Collaboration for the Intelligent Age,” will run from […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Endless transport associations worry police",
            "url": "https://www.chronicle.co.zw/endless-transport-associations-worry-police/",
            "content": "Harare Bureau\n\nTHE Zimbabwe Republic Police has expressed concern over the increase in new commuter omnibus associations, a development that will contribute to chaos and lawlessness in urban transport.\n\nThe sudden creation of a lot of new small associations, riding on the reputation that few older and larger associations had established, shows the lack of a legal framework to regulate the formation of kombi associations and ensure they can perform specified functions rather than just being a voice for kombi owners.\n\nAuthorities suggest that the Government needs to expedite legislation to allow for self-regulation within the industry with legally recognised and established associations, ensuring proper operations on designated termini and bus stations.\n\nIn Bulawayo, the situation is somewhat better, with only three main kombi associations, making self-regulation feasible.\n\nIn contrast, Harare is experiencing a proliferation of associations, with new ones emerging daily. Despite this, two major associations are beginning to dominate the market amid fierce competition from independent operators and illegal mushikashika taxis and most authorities would welcome the two only.\n\nPresident Mnangagwa has indicated plans to introduce a Statutory Instrument to regulate commuter omnibus operations.\n\nAt the moment, the registration process is not overseen by the Ministry of Transport and Infrastructural Development or the Ministry of Local Government and Public Works, leading to confusion and unjustified fare hikes, especially during peak hours.\n\nPolice have announced efforts to target over 13 500 unregistered kombis and pirate taxis as part of an operation to restore order in Harare.\n\nReports indicate there are about 16 500 commuter omnibuses in the city, with only 2950 registered.\n\nNational police spokesperson, Commissioner Paul Nyathi, called for a structured operation among associations.\n\nHe added that the Ministry of Transport and Infrastructural Development is working on an appropriate Statutory Instrument to govern the operations of commuter associations.\n\nHowever, the police support the activities of associations in terms of road safety, but it becomes a challenge with the proliferation of some of the so-called public service vehicle associations in terms of how they conduct their activities, he said.\n\nMr Ngoni Katsvairo, chairman of the Greater Harare Association of Commuter Operators (GHACO), one of the two major associations, said some of the associations were fly-by-night, with no proper members and not attempt to regulate member services.\n\nHe suggested that there should be a minimum number of commuter omnibuses required to start an association, contrasting Harares situation with Bulawayo, where a route authority letter is mandatory for association membership.\n\nMr Frederick Maguramhinga, president of the Zimbabwe United Deregulated Commuter Operators (Zudco), the other major association in Harare, applauded the polices efforts.\n\nThis has always been our prayer to have compliant association vehicles protected from illegal operators taking our business, he said.\n\nHe expressed hope that the polices focus on reputable associations would lead to a more orderly transport system.\n\nThe ZRPs concerns underscore the urgent need for regulation in the transport sector to enhance safety and order.\n\nAs discussions continue regarding legislative frameworks, the perspectives of operators and law enforcement will be crucial in shaping the future of commuter transport in Zimbabwe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/07/Commissioner-Paul-Nyathi.jpg",
            "description": "Harare Bureau THE Zimbabwe Republic Police has expressed concern over the increase in new commuter omnibus associations, a development that will contribute to chaos and lawlessness in urban transport. The sudden creation of a lot of new small associations, riding on the reputation that few older and larger associations had established, shows the lack of […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        },
        {
            "title": "Matobo women take ukucomba to the next level",
            "url": "https://www.chronicle.co.zw/matobo-women-take-ukucomba-to-the-next-level/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nWOMEN from Matobo in Matabeleland South province, continued their artistic ascent on Friday, taking centre stage at the Matobo Goes Fashion and Beyond initiative held at the National Gallery of Zimbabwe (NGZ) in Bulawayo.\n\nGerman Ambassador to Zimbabwe, HE Udo Volz dancing with members of Iyasa. (Picture by Elliot Moyo, Early Entertainment)\n\nThe event, attended by esteemed guests including the Ambassador of Germany to Zimbabwe, His Excellency, Udo Volz, the Minister of State for Provincial Affairs and Devolution for Bulawayo Metropolitan Province, Cde Judith Ncube, Mayor for the City of Bulawayo, Clr David Coltart, Chief Nkulumane Masuku of Nzula, Chief Dakamela, Member of Parliament for Matobo, Cde Edgar Moyo and other dignitaries spotlighted Matobo womens artistic acumen, especially their paintings.\n\nBulawayo Metropolitan Province Mayor, Senator David Coltart addressing attendees at the Matobo Goes Fashion event on Friday. (Picture by Elliot Moyo, Early Entertainment)\n\nThe event was funded by the German Embassy while technical support was from Ekhaya Gaia, Amagugu Cultural Heritage Centre, NGZ and National Fashion Council of Zimbabwe.\n\nMzala Bear painted by Matobo women and unveiled at the Matobo Goes Fashion and Beyond event. (Picture by Elliot Moyo, Early Entertainment)\n\nTraditional motifs and designs hanged in and around NGZ in Bulawayo and to complement this were fashion designs by Nkanyezi Malunga and Yolanda Ngwenya.\n\nThese designs modelled by male and female models were inspired by paintings from the Matobo women and these were somewhat futuristic, having the power to usher in a new wave of fashion designs.\n\nThey were the crowning jewel, a transition from walls to fabric.\n\nIn her welcome remarks, the NGZ in Bulawayo Regional Director, Silenkosi Moyo applauded Matobo for their work.\n\nAs we gather this evening, we celebrate not only the creativity but also the rich cultural heritage that defines us as a people.\n\nMatojeni Melomaniacs performing at the Matobo Goes Fashion and Beyond event at the National Gallery of Zimbabwe in Bulawayo on Friday. (Picture by Elliot Moyo, Early Entertainment)\n\nThis exhibition marks a significant milestone in the ongoing journey of the Matobo women, who have been at the forefront of preserving and innovating our traditional hut painting art form, she said.\n\nMoyo also acknowledged that ukugudula/ukucomba (hut painting) had been a staple culture within Matobo women but it took Ekhaya Gaia Trust, the NGZ in Bulawayo and the late Pathisa Nyathis Amagugu International Heritage to come up with the, My Beautiful Home competition to incentivise efforts by Matobo women.\n\nFrom the huts in their homesteads, now, their paintings adorn the NGZ in Bulawayo, Jairos Jiri Centre, the Zimbabwe German Society, the Alliance Franaise in Harare and Ngoma/Ingungu Cultural Centre in Domboshava, celebrating their handiwork.\n\nAttendees also witnessed the unveiling of Mzala under the Buddy Bear initiative which previously showcased the artistic contributions of these women.\n\nTo complement the Matobo women were musical performances from the Matojeni Melomaniacs, Iyasa and poetess, Sithandazile UmAfricakazi Dube directing proceedings.  Follow on X @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fhgfhg.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com WOMEN from Matobo in Matabeleland South province, continued their artistic ascent on Friday, taking centre stage at the “Matobo Goes Fashion and Beyond” initiative held at the National Gallery of Zimbabwe (NGZ) in Bulawayo. The event, attended by esteemed guests including the Ambassador of Germany to Zimbabwe, His Excellency, Udo Volz, the […]",
            "time": "06:09",
            "date": "20 Jan 2025"
        }
    ]
}