{
    "news": [
        {
            "title": "Two brothers jailed for life over brutal murder of Bulawayo taxi driver",
            "url": "https://www.chronicle.co.zw/two-brothers-jailed-for-life-over-brutal-murder-of-bulawayo-taxi-driver/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nTWO brothers from Gokwe who brutally murdered a Bulawayo taxi driver before stealing his vehicle were on Friday sentenced to life imprisonment by Bulawayo High Court Judge, Justice Munamato Mutevedzi.\n\nKetai Nhanha and Jenfat Manamike were convicted of the cold-blooded murder of Christopher Dama, a taxi driver from Entumbane, who was killed on the night of June 19 last year. The duo was also handed an additional 20-year prison term for robbery.\n\nThe horrific crime, which sent shockwaves through the Entumbane community, took place along Emcwazini Road in the Figtree area, Bulilima district, Matabeleland South. Dama was viciously attacked with an axe, sustaining multiple head injuries, before his lifeless body was dumped in the bush. The two then fled the scene in his Honda Fit.\n\nDamas body was discovered the following morning by a villager, who immediately alerted a police constabulary unit. A manhunt was launched, leading to Nhanhas arrest on June 25 by detectives from CID Gwanda after he was spotted driving the stolen vehicle.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fgvjuy.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw TWO brothers from Gokwe who brutally murdered a Bulawayo taxi driver before stealing his vehicle were on Friday sentenced to life imprisonment by Bulawayo High Court Judge, Justice Munamato Mutevedzi. Ketai Nhanha and Jenfat Manamike were convicted of the cold-blooded murder of Christopher Dama, a taxi driver from Entumbane, who was killed […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "PSL announces gate charges, kickoff time for the 2025 Castle Challenge Cup",
            "url": "https://www.chronicle.co.zw/psl-announces-gate-charges-kickoff-time-for-the-2025-castle-challenge-cup/",
            "content": "Online writer\n\nTHE Premier Soccer League has confirmed the details for the 2025 Castle Challenge Cup set for February 22\n\nThe encounter will act as a season opener for the 2025 campaign and will be played between Castle Lager Premier Soccer League champions Simba Bhora and Chibuku Super Cup winners Dynamos.\n\nThe match will take place at Rufaro Stadium .\n\nKick-off time has been set at 2:30 pm.\n\nThe minimum entry price is $3 for the rest of the ground. Grand Stands ticket is costing $5, while the VIP is going for $10.\n\nThe VVIP is strictly by invitation\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fdgfr.jpg",
            "description": "Online writer  THE Premier Soccer League has confirmed the details for the 2025 Castle Challenge Cup set for February  22 The encounter will act as a season opener for the 2025 campaign and will be played between Castle Lager Premier Soccer League champions Simba Bhora and Chibuku Super Cup winners Dynamos. The match will take […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Ministers visit Beitbridge crash site, pledge support for victims’ families",
            "url": "https://www.chronicle.co.zw/ministers-visit-beitbridge-crash-site-pledge-support-for-victims-families/",
            "content": "Thupeyo Muleya,[emailprotected]\n\nA TEAM of three Government ministers on Friday visited the scene of a tragic accident where 25 people lost their lives after a bus collided head-on with a commercial truck.\n\nLocal Government and Public Works Daniel Garwe, his Transport and Infrastructural Development counterpart, Felix Mhona and Matabeleland South Provincial Affairs and Devolution Dr Evelyn Ndlovu also visited survivors receiving treatment at Beitbridge District Hospital.\n\nSpeaking during the tour, Minister Garwe, who also oversees civil protection matters, said the Government was deeply saddened by the horrific crash and pledged support for the bereaved families.\n\nWe express our condolences and we will do everything necessary to assist the bereaved family so that they may bury their departed relatives, he said.\n\nMinister Mhona said he had directed all enforcement departments under his ministry to conduct a full investigation into the accident and take appropriate action.\n\nWe are investigating the circumstances surrounding this tragedy, and necessary measures will be taken to prevent such incidents in the future, he said.\n\nDr Ndlovu said the province was in deep mourning following the accident. She wished the injured a speedy recovery and assured that her office would visit those receiving treatment at Gwanda and the United Bulawayo Hospitals.\n\nPresident Mnangagwa on Thursday expressed his condolences and announced that the deceased will receive State-assisted funerals.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/lmkl.jpg",
            "description": "Thupeyo Muleya, thupeyo.muleya@zimpapers.co.zw A TEAM of three Government ministers on Friday visited the scene of a tragic accident where 25 people lost their lives after a bus collided head-on with a commercial truck. Local Government and Public Works Daniel Garwe, his Transport and Infrastructural Development counterpart, Felix Mhona and Matabeleland South Provincial Affairs and Devolution […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zhombe man killed in suspected revenge attack",
            "url": "https://www.chronicle.co.zw/zhombe-man-killed-in-suspected-revenge-attack/",
            "content": "Patrick Chitumba,[emailprotected]\n\nA 33-YEAR-OLD man from Zhombe in the Midlands Province was allegedly killed in a suspected revenge attack on Tuesday evening near Tshapewa Business Centre.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the murder of Proud Moyo (33) of Mujikwa Village, Chief Malisa, Zhombe. He was fatally assaulted with a log and stabbed with a Columbian knife.\n\nThe Zimbabwe Republic Police confirms a case of murder involving a 33-year-old man who was stabbed with a Columbian knife at Tshapewa Business Centre, Zhombe, on 12 February at around 7pm, said Insp Mahoko.\n\nAccording to police investigations, Moyo and the suspect, Philani Kawasala (37) of Kasawala Village, Chief Malisa, Zhombe, had been drinking beer at the business centre earlier in the evening.\n\nMoyo left the business centre around 7pm, but Kawasala followed him, caught up with him, and attacked him with a log before stabbing him, said Insp Mahoko.\n\nA passer-by intervened and escorted the injured Moyo to his uncle, King Moyos homestead in the same village. However, he succumbed to his injuries shortly after arrival.\n\nInvestigations suggest that the attack stemmed from a long-standing grudge dating back to 2017, when Moyo allegedly stabbed Kawasala in a previous altercation.\n\nPolice are appealing for information that may lead to the arrest of Kawasala. We urge members of the public to resolve disputes peacefully to prevent loss of life. Anyone with information is encouraged to report to the nearest police station, said Insp Mahoko.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2013/12/knife.jpg",
            "description": "Patrick Chitumba, patrick.chitumba@chronicle.co.zw A 33-YEAR-OLD man from Zhombe in the Midlands Province was allegedly killed in a suspected revenge attack on Tuesday evening near Tshapewa Business Centre. Midlands provincial police spokesperson, Inspector Emmanuel Mahoko, confirmed the murder of Proud Moyo (33) of Mujikwa Village, Chief Malisa, Zhombe. He was fatally assaulted with a log and […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Teenager jailed 10 years for raping niece",
            "url": "https://www.chronicle.co.zw/teenager-jailed-10-years-for-raping-niece/",
            "content": "Lesley Chikudo,[emailprotected]\n\nA BULAWAYO teenager was on Thursday sentenced to 10 years in jail for raping his 11-year-old niece twice on different occasions.\n\nThe man (19) from Emthunzini whose name had been withheld to protect the victim. Was convicted of rape by Western Commonage regional magistrate, Mrs Sibongile Marondedze.\n\nIn passing the sentence, the magistrate noted that the offender was the complainants biological uncle whom the girl looked up to for protection.She also noted that the victim was emotionally disturbed to the extent of not attending school as she sometimes absconded from school.\n\nAs the biological uncle it was his duty to protect his niece, instead he took advantage of the authority he had as an uncle. He is a danger to the community and himself, due to his predatory behaviour hence there is a need for deterrence to avoid future offenders, ruled Mrs Marondedze.\n\nThe accused was supposed to protect the girl child but turned into a predator. As such, the offender is sentenced to an effective 10 years in jail.\n\nHe committed the crime between June and September last year.\n\nThe prosecutor, Ms Christina Manyika said the sexual offence occurred each time the complainant returned home from school.\n\nThe accused then dragged the complaint into his room and locked the door. He then raped her, said Ms Manyika.\n\nOn the second occasion, the court heard that the offender raped the victim after she came back from school in September last year.\n\nThe victim was coming from school and found the accused in the company of his friend. He dragged to his room where he removed her clothes and raped the complainant, said Ms Manyika.\n\nThe matter came to light when the victim wrote a letter to her mother narrating the abuse. A report was made a police report leading to the arrest of the man.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/gavel-rape.jpg",
            "description": "Lesley Chikudo, chikudolesley@gmail.com A BULAWAYO teenager was on Thursday sentenced to 10 years in jail for raping his 11-year-old niece twice on different occasions. The man (19) from Emthunzini whose name had been withheld to protect the victim. Was convicted of rape by Western Commonage regional magistrate, Mrs Sibongile Marondedze. In passing the sentence, the […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Call to capacity of African media to expose Illicit Financial Flows (IFFs) grows louder",
            "url": "https://www.chronicle.co.zw/call-to-capacity-of-african-media-to-expose-illicit-financial-flows-iffs-grows-louder/",
            "content": "Prosper Ndlovu in Ouagadougou, BURKINA FASO\n\nTHE call to strengthen the capacity of the media in Africa to expose Illicit Financial Flows (IFFs) and promote effective and efficient taxation has come under spotlight as the continent seeks leverage for ensuring sustainable development across the region.\n\nDuring the just-ended taxation conference for African media and tax administration communicators in Ouagadougou in Burkina Faso, delegates emphasized the need to scale up domestic resource mobilization (DRM) to move away from aid dependence.\n\nTo achieve this, the media has a critical role to play, especially in exposing rampant IFFs, which rob African states of nearly US$80 billion annually, according to official estimates.\n\nThese flows, in addition to facilitating money laundering and tax evasion, promote corruption and deprive African states of crucial resources for the implementation of ambitious public policies in the areas of health, education, infrastructure and economic development.\n\nA Burkina Faso senior government official, Mr Mamadou Sere, who was standing in for the Minister of Economics and Finance in the host country, said IFFs were a major drawback to Africas progress.\n\nThe figures are alarming. Every year, African countries lose billions of dollars to illicit financial flows, he said.\n\nIt is, therefore, imperative that we strengthen our mechanisms to combat these practices and work together to put in place effective strategies to stem this financial haemorrhage that is holding back our development efforts.\n\nIn this fight, the media and communication professionals play a key role. By informing the general public, raising awareness of tax obligations and denouncing fraudulent practices, you contribute to the formation of a conscious and committed public opinion.\n\nMr Sere further said the media are essential partners in promoting tax transparency and encouraging positive change in society.\n\nParticipants commended the conference theme: Strengthening the capacity of the media to cover issues relating to illicit financial flows, as it represented an opportunity to strengthen collaboration between tax administrations and the media in order to build an effective communication framework, based on trust and the exchange of information.\n\nIn his remarks, chairman of the African Tax Media Network (ATMEN), Mr Danicius Kaihenneh Sengbeh, said the media must be part of the tax revolution in the continent.\n\nToday, in Ouagadougou, we are not merely participants at a meeting; we are part of a movement. A movement to amplify the role of journalism in taxation, to bridge the divide between tax administrations and the media, and to ensure that African voices tell Africas tax story from an African perspective. This mission is urgent, and it is vital, said Mr Sengbeh.\n\nMr Mamadou Sere, Burkina Faso senior Treasury representative (left) accompanied by an official from that countrys revenue authority\n\nAs journalists, communicators, and advocates of tax justice, we are the messengers of change. Our pens, microphones, and cameras are not just tools; they are instruments of empowerment, fostering understanding between tax authorities and the citizens they serve.\n\nWe recognize that tax is not just about numbersit is about the lifeblood of our economies, the foundation of our infrastructure, and the catalyst for the Africa we all dream of, he said.\n\nTaxation is the lifeblood of any nations development, and our role in shaping the publics perception of tax policies, reforms, and obligations cannot be overstated.\n\nMr Sengbeh went on to highlight the journey of ATMEN, which he said was a Testament of Collaboration- born out of necessity to transform Africa.\n\nHe recalled how in 2018, over 70 journalists and communication officers met in Johannesburg under the auspices of ATAF, and saw the need for tax issues to be placed at the heart of media discussions.\n\nA year later, in Kigali, the same cause was reinforced and it was there that ATMEN took its first breath, an idea ignited by the shared commitment of journalists and tax communicators who understood that Africas tax narrative needed to be told by those who understood it bestAfricans.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/rftgtyy.jpg",
            "description": "Prosper Ndlovu in Ouagadougou, BURKINA FASO THE call to strengthen the capacity of the media in Africa to expose Illicit Financial Flows (IFFs) and promote effective and efficient taxation has come under spotlight as the continent seeks leverage for ensuring sustainable development across the region. During the just-ended taxation conference for African media and tax […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "ATAF urges collaboration to deliver effective tax administration, transparency and accountability in Africa",
            "url": "https://www.chronicle.co.zw/ataf-urges-collaboration-to-deliver-effective-tax-administration-transparency-and-accountability-in-africa/",
            "content": "Prosper Ndlovu in Ouagadougou, BURKINA FASO\n\nTHE African Tax Administration Forum (ATAF) has rallied different stakeholders in the continent, including the media, to scale up collaboration towards increasing domestic resource mobilization (DRM) to drive the regions development agenda.\n\nSpeaking on behalf of ATAF Executive Secretary, Mr Logan Wort, during a media and communications taxation training conference held here this week, Mr Eugene Southgate, said internal communicators and journalists across Africa have a critical role to play to enhance taxation in their respective countries.\n\nThe media plays a critical role in shaping public perception, influencing policy discussions, and promoting informed civic engagement, he said.\n\nIn the tax landscape, this role becomes even more vital. When tax policies are misunderstood or misrepresented, it leads to misconceptions, reduced compliance, and ultimately, revenue losses, which then directly impact on a countrys ability to grow its economy in order to take care of its people, said Mr Southgate.\n\nMr Eugene Southgate\n\nWe have seen across many of our member countries, when tax matters are communicated effectively, they foster trust, accountability, and voluntary compliance, which are key ingredients for sustainable domestic revenue mobilisation. So, what and how tax information is communicated is crucial.\n\nMr Southgate said journalists, in particular, have a very important role to play in keeping the public and citizenry informed about the truth, as well as exposing negative practices such as corruption and tax evasion.\n\nYou have one of the most powerful tools available  the word is mightier than the sword. Government communicators have an equally important role to play  not only in keeping the citizenry informed but to make information readily available in a simple and understandable way so that when the public engage with the revenue authority it is easy and pleasant, he added.\n\nThe paying of taxes can be traced backed thousands of years so there is general understanding of its place in society. But many seem to have forgotten that, the challenge to our communicators is how we communicate the message of DRM to the people.\n\nTurning to the significance of the regional media training programme, Mr Southgate said a well-informed media is an essential partner in explaining complex tax policies in a way that resonates with the public.\n\nHe commended the establishment of the African Tax Media Network in 2018 in Kigali, Rwanda, as a landmark step in this direction, creating a dedicated platform to support journalists and communicators in tax reporting.\n\nThis workshop builds on that vision, providing an opportunity to equip media professionals with the tools to engage effectively with tax issues, said Mr Southgate.\n\nEffective tax administration requires a collaborative approach. Tax authorities and the media share a common goal: to serve the public interest.\n\nWhile tax administrations work to implement fair and efficient tax systems, the media ensures that these efforts are understood and scrutinised by the public.\n\nHe noted inherent challenges and communication gaps such as limited access to information, and technical complexities, which often hinder productive engagement between tax officials and journalists.\n\nThe workshop sought to bridge these gaps by fostering dialogue, building mutual understanding, and developing strategies for effective communication. Through targeted discussions, it explored best practices for tax transparency, the role of digital media in tax awareness, and innovative storytelling techniques that can make tax matters more relatable.\n\nSince its inception, ATAF has been at the forefront of building strong, effective, and efficient tax administrations across Africa.\n\nIts work has contributed significantly to improving domestic revenue mobilisation. Over the past 15 years, ATAF has provided technical assistance, training, and policy support that has helped member countries increase their tax-to-GDP ratios, enhance compliance rates, and combat illicit financial flows.Beyond technical capacity-building, has also prioritised communication through media training programs, knowledge-sharing platforms, and stakeholder engagement initiative, which have empowered journalists and tax administrators alike to communicate tax matters more effectively. Through partnerships with international organisations and regional bodies, ATAF continues to champion transparency and accountability in tax governance.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/mnbjk.jpg",
            "description": "Prosper Ndlovu in Ouagadougou, BURKINA FASO THE African Tax Administration Forum (ATAF) has rallied different stakeholders in the continent, including the media, to scale up collaboration towards increasing domestic resource mobilization (DRM) to drive the region’s development agenda. Speaking on behalf of ATAF Executive Secretary, Mr Logan Wort, during a media and communications taxation training […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Wolves coach backs Marshall Munetsi to score a lot of goals",
            "url": "https://www.chronicle.co.zw/wolves-coach-backs-marshall-munetsi-to-score-lot-goals/",
            "content": "Online writer\n\nWOLVES coach Vitor Pereira believes new signing Marshall Munetsi is capable of scoring a lot of goals for the club.Munetsi joined Wolves on the deadline day of the January transfer window. He made his team debut last weekend after featuring as a second half substitute in the 2-0 win over Blackburn Rovers in the fourth round of the FA Cup.\n\nThe midfielder took an offensive role and created a couple of good opportunities.\n\nAmong the four opportunities he got, two were clear, including a header which went wide and a 1-v-1 incident in which he took long to decide and was muscled off the ball on the edge of the box.\n\nAfter showing his potential in front of the goal, Pereira believes the 28-year-old can add a new dynamic to Wolves midfield.\n\nHes a player who is a transition midfielder, with the physicality to appear in the box to score and after a few seconds hes in our box defending, the head coach said, as cited by Express and Star website.\n\nHe has this physicality that we need to be everywhere. Hes the kind of player that I appreciate a lot. Hes a midfielder that scores goals, if you look at his career hes scored a lot of goals. The situation he had with the header, its very normal for him because when the cross comes, he will be there. Thats what I appreciated when I analysed the player.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/klm.jpg",
            "description": "Online writer WOLVES coach Vitor Pereira believes new signing Marshall Munetsi is capable of scoring a lot of goals for the club.Munetsi joined Wolves on the deadline day of the January transfer window. He made his team debut last weekend after featuring as a second half substitute in the 2-0 win over Blackburn Rovers in […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Zanu-PF Councillor elected unopposed as Hwange Local Board Chair",
            "url": "https://www.chronicle.co.zw/zanu-pf-councillor-elected-unopposed-as-hwange-local-board-chair/",
            "content": "Sikhumbuzo Moyo,[emailprotected]\n\nZANU-PF councillor at Hwange Local Board, Peterson Ncube, was yesterday elected unopposed as the new chairperson following a vote of no confidence in the incumbent, Mr. Morrison Mafa, of the opposition Citizens Coalition for Change (CCC) party.\n\nCde Ncubes sensational ascendancy to the position comes despite the fact that ZANU-PF is the opposition party in the local authority, with just three councillors compared to CCCs 17 policymakers.\n\nCouncil sources said Mr. Mafa was running council business as a one-man gang, taking key decisions individually without consulting his chamber colleagues or even those from his own party.\n\nThis is a developing story.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/02/fewrfe.jpg",
            "description": "Sikhumbuzo Moyo, smoyo@chronicle.co.zw ZANU-PF councillor at Hwange Local Board, Peterson Ncube, was yesterday elected unopposed as the new chairperson following a vote of no confidence in the incumbent, Mr. Morrison Mafa, of the opposition Citizens Coalition for Change (CCC) party. Cde Ncube’s sensational ascendancy to the position comes despite the fact that ZANU-PF is the […]",
            "time": "18:40",
            "date": "14 Feb 2025"
        },
        {
            "title": "Watch : NAAZ rebounds",
            "url": "https://www.chronicle.co.zw/watch-naaz-rebounds/",
            "content": "Online ReporterKHAYA Arts entertain guests at the National Athletics Association of Zimbabwe rebranding function at a city hotel.\n\nThe organisation is launching its refreshed logo to symbolise a new era of dynamism and unity in the nations athletics scene.\n\n",
            "image_url": null,
            "description": "Online Reporter KHAYA Arts entertain guests at the National Athletics Association of Zimbabwe rebranding function at a city hotel. The organisation is launching its refreshed logo to symbolise a new era of dynamism and unity in the nation’s athletics scene.  ",
            "time": "18:40",
            "date": "14 Feb 2025"
        }
    ]
}