{
    "news": [
        {
            "title": "WATCH: Multitudes of Illegal gold miners invade Rhodes Estate",
            "url": "https://www.chronicle.co.zw/watch-multitudes-of-illegal-gold-miners-invade-rhodes-estate/",
            "content": "Raymond Jaravaza, Online Reporter\n\nMultitudes of illegal gold miners have invaded the largest pedigree cattle farm in the country, the Rhodes Estate in Matabeleland South Province.\n\nThe illegal panners continue to dig hundreds of pits on the farm in search of gold, leaving deep trenches into which cattle have been falling and dying.\n\nOn Wednesday, the Matabeleland South Minister of State for Provincial Affairs and Devolution, Dr Evelyn Ndlovu, toured the farm to gain a first-hand understanding of the damage caused by illegal mining activities.\n\nIn the video below, illegal miners hoist a fellow miner from a deep pit where they were digging for the precious mineral.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/gold-panners.jpg",
            "description": "Raymond Jaravaza, Online Reporter  Multitudes of illegal gold miners have invaded the largest pedigree cattle farm in the country, the Rhodes Estate in Matabeleland South Province. The illegal panners continue to dig hundreds of pits on the farm in search of gold, leaving deep trenches into which cattle have been falling and dying. On Wednesday, […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Police bust second hand clothes smugglers in Kwekwe",
            "url": "https://www.chronicle.co.zw/police-bust-second-hand-clothes-smugglers-in-kwekwe/",
            "content": "Midlands Bureau\n\nPOLICE in Kwekwe have arrested three suspected second hand clothes smugglers leading to the recovery of 14 bales.\n\nMidlands Provincial police spokesperson Inspector Emmanuel Mahoko said the 14 second hand clothes bales were recovered from a bus at a police road block last week.\n\nZimbabwe Republic Police Midlands is updating the public on progress of an operation against smuggling of goods, launched in December 2024 by the Government, said Insp Mahoko.\n\nOur latest arrest for Kwekwe happened on 24 January 2025. A total 14 bales of second-hand goods were recovered from two buses owned by Triptrans Bus Company.\n\nInsp Mahoko said three people were arrested after being identified to have had smuggled the goods and were charged for contravening section 38 (1) of The Customs and Exercise Act, Chapter 23.02.\n\nThe suspects are Eliaza Ndlovu (35) of Malbereign, Harare, Tinashe Sevenzayi (31) of Magwegwe, Bulawayo and Bonita Dozva (42) of Hatfield, Harare.\n\nThey all paid fines  US$800, ZWG1 812 and ZWG 6000 respectively, he said.\n\nInsp Mahoko said the anti-smuggling operation in Kwekwe is being spearheaded by Criminal Investigation Department, Police Intelligence and Operations sections of Zimbabwe Republic Police in conjunction with Zimbabwe Revenue Authority.\n\nPeople who intend to import goods into the country for personal use or for business purposes are called upon to abide by the countrys laws governing importation of goods. The operation is going ahead, he said.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/klklpj.jpg",
            "description": "Midlands Bureau   POLICE in Kwekwe have arrested three suspected second hand clothes smugglers leading to the recovery of 14 bales. Midlands Provincial police spokesperson Inspector Emmanuel Mahoko said the 14 second hand clothes bales were recovered from a bus at a police road block last week. “Zimbabwe Republic Police Midlands is updating the public […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Watch : Government incentives to boost manufacturing sector – Professor Mthuli Ncube",
            "url": "https://www.chronicle.co.zw/watch-government-incentives-to-boost-manufacturing-sector-professor-mthuli-ncube/",
            "content": "Senior Business Writer\n\nFINANCE, Economic Development, and Investment Minister Professor Mthuli Ncube on Wednesday said it is critical for the Government to support the manufacturing sector as it has the potential to create employment and generate revenue for the economy.\n\nSpeaking after touring the Zimbabwe Stock Exchange (ZSE)  listed Pro Plastics, a leading manufacturer of plastic pipes and fittings in Harare, Prof Ncube said several incentives exits for the sector.\n\nHe referred to the Value added Tax deferment which enables companies to import retooling equipment\n\nProf Ncube hailed the companys productive capacity and automation efforts and also expressed optimism about the countrys business environment, predicting improvements that could double Pro Plastics turnover.\n\nWith a turnover of US$25 million, Pro Plastics has been a key supplier of high-performance piping solutions to various sectors in Zimbabwe, such as mining and construction, the ministry said on its X account.\n\nThe company produces polyvinyl chloride (PVC), High-Density Polyethylene (HDPE), Low-density Polyethylene (LDPE) pipes and related fittings.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/t554gew.jpg",
            "description": "Senior Business Writer FINANCE, Economic Development, and Investment Minister Professor Mthuli Ncube on Wednesday said it is critical for the Government to support the manufacturing sector as it has the potential to create employment and generate revenue for the economy. Speaking after touring the Zimbabwe Stock Exchange (ZSE) – listed Pro Plastics, a leading manufacturer […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Artistes urged to collaborate, build audience support for the growth of Hip-hop industry",
            "url": "https://www.chronicle.co.zw/artistes-urged-to-collaborate-build-audience-support-for-the-growth-of-hip-hop-industry/",
            "content": "Sipepisiwe Moyo,[emailprotected]\n\nArtistes and community members have gathered at the National Gallery of Zimbabwe in Bulawayo for the ongoing Artist Development and Social Responsibility workshop, which kicked off on Monday and will run until Thursday.\n\nOrganised by hip-hop musicians Asaph and Leemzy Beatz, the workshop is being held under the theme, Hip Hop versus the Community.As part of our visit to the United States, we were tasked with developing projects for our community. This workshop was born from that initiative, and we established it under our organisation, the Kwela Initiative, said Asaph.\n\nOn the first day of the workshop, artistes met with the community to discuss the divide between Hip-Hop and the community, aiming to uncover the reasons behind the lack of support for Bulawayo artistes.\n\nASAPHAFRIKA addressing artists during a conflict transformation indaba held at Bulawayo Art Gallery Picture by Lubelihle Mathe\n\nHe added, We want to hear both sides  the community and the artistes  and hope to plot a way forward.\n\nThe workshop has sparked an engaging conversation between artistes and community members. Asaph commented on the turnout, saying, The number of community members present proves that this is a conversation many are reluctant to have, but we appreciate those who showed up.\n\nOne of the major issues discussed was the societal perception of Hip-Hop. Many participants expressed that Hip-Hop is often seen as a career choice for non-Christians. Hip-Hop, according to most artistes, is not just music but a culture and a powerful tool for storytelling and self-expression.\n\nHip-Hop artiste Swazy shared her personal experiences, saying, Society doesnt understand Hip-Hop. For example, Im a Christian rapper, and whenever I express my thoughts about the God I serve, people react with skepticism. They question if Hip-Hop and Christianity can mix. I believe these attitudes contribute to the challenges Hip-Hop faces in Bulawayo.\n\nArtists following proceedings during conflict transformation indaba held at Bulawayo Art GalleryPicture by Lubelihle Mathe\n\nIn addition to the stigma surrounding the genre, such as associations with drugs and profanity, some artistes highlighted the lack of industry representation and financial constraints as key obstacles to progress.\n\nVeteran playwright Raisedon Baya, who was also present, offered words of encouragement and guidance: What youre doing right now is the right pathdiscussing the problems and working toward solutions. One of the biggest issues in our industry is assumption. We dislike each other without ever meeting. We need to stand together and take action. When we run events and an artiste is scheduled to perform, they often dont promote the show on their social media. Then they complain about low attendance. Whos responsible for bringing in the audience?\n\nBaya stressed the impact of low attendance on artistes future opportunities, explaining, If I book an artiste and only two people show up, I might not book them again. This leads to the assumption that Hip-Hop lacks an audience, and the genre is then sidelined.\n\nArtistes were further encouraged to embrace digital media and the internet as essential tools to remain relevant, promote their music, and build a larger audience base. As the workshop continues, the focus remains on building a more sustainable and supportive music scene for artistes in Bulawayo.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/uhjk.jpg",
            "description": "Sipepisiwe Moyo, moyosipepisiwe@gmail.com Artistes and community members have gathered at the National Gallery of Zimbabwe in Bulawayo for the ongoing Artist Development and Social Responsibility workshop, which kicked off on Monday and will run until Thursday. Organised by hip-hop musicians Asaph and Leemzy Beatz, the workshop is being held under the theme, “Hip Hop versus […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Nketa Honda Fit accident: Death toll rises to 3",
            "url": "https://www.chronicle.co.zw/nketa-honda-fit-accident-death-toll-rises-to-3/",
            "content": "Ronald Mpofu, Online Reporter\n\nTHE death toll has risen to three in the incident where a Honda Fit ploughed into 11 members of the Johanne Masowe Church, who were returning from night prayers in Nketa, Bulawayo, on Sunday morning, police have confirmed.\n\nThe third victim is 13-year-old Tawanda Mbako of Nketa 6, son of Monica Tichava (41), who died on the spot. Mbako died at Mpilo Hospital on Tuesday, Acting Bulawayo Police Provincial Spokesperson Assistant Inspector Nomalanga Msebele confirmed.\n\nA 13 year old Tawanda Mbako of Nketa 6 and he is a son to the deceased Monica Tichava aged 41 who died on the spot, said Assistant Inspector Msebele.\n\nAnother victim Loraine Ruvarashe Shoko (17), a female also from Nketa 6, died on Monday at Mpilo Central Hospital after succumbing to her injuries.\n\nThe driver of the Honda Fit, police said, is facing charges of culpable homicide after losing control of his vehicle.The victim who died on the spot was trapped underneath the vehicle and had to be extricated by members of the Bulawayo Fire Brigade, who arrived at the scene shortly after the tragic incident.\n\nOn 26th January 2025, at approximately 5:00 a.m., a 29-year-old male driver from Gwabalanda, Bulawayo, lost control of his silver Honda Fit while driving along Nketa Drive with three passengers. The vehicle veered off the road and struck 11 pedestrians walking in the same direction.\n\nThe accident resulted in two pedestrian fatalities and nine others being injured. One passenger from the vehicle was also injured, bringing the total number of injured to 10. The injured were transported to Mpilo Hospital for treatment, while the deceased were taken to the United Bulawayo Hospitals (UBH) mortuary for post-mortem examinations, said Assistant Inspector Msebele.\n\nShe said the accident was caused by speeding, and the driver is facing charges. The cause of the accident was due to speeding and the drivers failure to keep the motor vehicle under proper control; hence a charge of culpable homicide has been preferred against him, said Assistant Inspector Msebele.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/Police-Accident-edit-by-Ronald-Mpofu-copy-2.jpg",
            "description": "Ronald Mpofu, Online Reporter THE death toll has risen to three in the incident where a Honda Fit ploughed into 11 members of the Johanne Masowe Church, who were returning from night prayers in Nketa, Bulawayo, on Sunday morning, police have confirmed. The third victim is 13-year-old Tawanda Mbako of Nketa 6, son of Monica […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Mighty Warriors squad for 2026 CAF Women’s AFCON Qualifiers named",
            "url": "https://www.chronicle.co.zw/mighty-warriors-squad-for-2026-caf-womens-afcon-qualifiers-named/",
            "content": "Innocent Kurira\n\nTHE Mighty Warriors provisional squad for the CAF Womens Africa Cup of Nations 2026 Qualifiers has been named.\n\nZimbabwe is set to face Angola in the first round of the qualifiers next month.\n\nAngola will play host to the first of the two legged tie.\n\nMighty Warriors Squad\n\nGoalkeepers\n\nVanessa Lunga (Chapungu Queens), Lindiwe Magwede (Herentals Queens), Precious Mudyiwa (Black Rhinos Queens), Sasha Machona (Maningi YSA)\n\nDefenders\n\nSheila Antonio (Chapungu Queens), Egness Tumbare (Correctional Queens), Nobukhosi Ncube (Chapungu Queens), Alice Moyo (Herentals Queens), Nokukhanya Ndlovu (FC Platinum Royals), Fortunate Ngocho (Black Mambas Queens),Purity Mugayi (Black Rhinos Queens)\n\nMidfielders\n\nDaisy Kaitano (Black Rhinos Queens),Emmaculate Msipa (Ramat Hasharon WFC, Israel), Shyline Dambamuromo (Herentals Queens), Danai Bhobho (Young Africans, Tanzania), Mavis Chirandu (Black Rhinos Queens), Christabel Katona (Black Rhinos Queens), Ennert Chemhere (FC Platinum Royals), Morelife Nyagumbo (Faithdrive Academy), Nadia Semba (Correctional Queens), Natasha Ndowa (Chapungu Queens)\n\nPatience Ndlovu (Highlanders Royals)\n\nForwards\n\nEthel Chinyerere (Chapungu Queens), Rutendo Makore (Black Rhinos Queens FC), Yolanda Kanyai (Darwin Olympic Sporting Club, Australia), Ruvimbo Mucherera (Maccabi Hadera WFC, Israel), Maud Mafuruse (Herentals Queens), Mitchel John (Harare City Queens), Anita Ncube (Faithdrive Academy)\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2019/03/mighty_warriors_1.jpg",
            "description": "Innocent Kurira THE Mighty Warriors provisional squad for the CAF Women’s Africa Cup of Nations 2026 Qualifiers has been named. Zimbabwe is set to face Angola in the first round of the qualifiers next month. Angola will play host to the first of the two legged tie. Mighty Warriors Squad Goalkeepers Vanessa Lunga (Chapungu Queens), […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "EFT Corporation appoints Farai Tigere as Zimbabwe operations lead",
            "url": "https://www.chronicle.co.zw/eft-corporation-appoints-farai-tigere-as-zimbabwe-operations-lead/",
            "content": "Business WriterEFT Corporation, a financial technology firm resulting from the merger of Ukheshe Technologies and EFT Corporation, has appointed Mr Farai Tigere to lead its operations in Zimbabwe.\n\nHis role will focus on advancing the organisations strategy for financial inclusion, digital transformation, and economic empowerment in the region.\n\nEFTCorp aims to redefine the future of digital financial services by harnessing the strengths of both companies, establishing itself as a leading force in the African fintech landscape.\n\nIn a statement, Mr Tigere said the primary goal is to maintain and expand EFTCorps established role as a major player in Zimbabwes payment ecosystem, which involves deepening the companys reach in underserved sectors and further strengthening its presence in commerce.\n\nI am excited about the new opportunities this role offers. For me personally, it represents professional growth, and for the company, it is a chance to steer the Zimbabwean arm of the business through a challenging but opportunity-rich period of growth.\n\nThere is significant potential for payment solutions to drive financial inclusion, ensuring more Zimbabweans benefit from access to formal financial services and opportunities, Mr Tigere said.\n\nFinancial inclusion for more Zimbabweans is essential for the countrys economic growth.\n\nThrough localised digital platforms and adaptable payment systems, EFTCorp empowers underserved communities as well as small businesses in the country by providing tools that are accessible, reliable, and aligned with their needs.\n\nEFTCorps ability to innovate and adapt is what enables us to remain relevant, added Mr Tigere.\n\nMr Tigere joined the company as an Implementation Engineer. In 2018, he moved to a role as a business development and solutions architect, where he played a key role in Zimbabwes digitisation efforts.\n\nHe has been occupying the role of General Manager at EFT Corporation since 2021. Before joining EFT Corporation, Mr Tigere worked at FBC Bank in the Switch Support and Branch ATM Support Network.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/uojikl.jpg",
            "description": "Business Writer EFT Corporation, a financial technology firm resulting from the merger of Ukheshe Technologies and EFT Corporation, has appointed Mr Farai Tigere to lead its operations in Zimbabwe. His role will focus on advancing the organisation’s strategy for financial inclusion, digital transformation, and economic empowerment in the region. EFTCorp aims to redefine the future […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Nxt Stop Sessions: Plumtree DJs showcase house music in scenic outdoor locations",
            "url": "https://www.chronicle.co.zw/nxt-stop-sessions-plumtree-djs-showcase-house-music-in-scenic-outdoor-locations/",
            "content": "Mthabisi Tshuma,[emailprotected]\n\nPlumtree-based wheel spinners DJ Yugoe, Corason, and Big Q have come together to launch a new initiative that seamlessly blends music with the natural beauty of their surroundings, aptly named the Nxt Stop Sessions.\n\nThe exclusive DJ performances are being streamed on the YouTube channel NxtStopSessions and will soon be available on various digital platforms.\n\nDJ Yugoe shared that Nxt Stop Sessions is an organised series of exclusive live DJ performances held in Plumtree.This initiative will take place at scenic outdoor locations on the outskirts of Plumtree, though some sessions may occasionally be held in the CBD. The concept is to merge music with the breathtaking natural beauty of the environment, he explained.\n\nAs a collaborative effort by Plumtrees DJs, the trio aims to showcase their skills and promote both local and international house music through Nxt Stop Sessions. Starting in February, they plan to release a new episode every weekend for three weeks each month, with the schedule potentially adjusted as the project progresses.\n\nWhile public participation was not initially part of the plan, DJ Yugoe mentioned that the sessions would be opened to the public as the videos gain popularity.\n\nThe first episode aired last week, and the second episode is scheduled to air this Thursday.  Follow on X -@mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/wsf43tserg-1.jpg",
            "description": "Mthabisi Tshuma, revmmthiretshuma@gmail.com Plumtree-based wheel spinners DJ Yugoe, Corason, and Big Q have come together to launch a new initiative that seamlessly blends music with the natural beauty of their surroundings, aptly named the Nxt Stop Sessions. The exclusive DJ performances are being streamed on the YouTube channel NxtStopSessions and will soon be available on […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zim players based abroad",
            "url": "https://www.chronicle.co.zw/zim-players-based-abroad/",
            "content": "IN the English Championship, Zimbabwean prospect Lucien Mahovo made his full debut for Norwich City on Saturday.\n\nMahovo started in Norwich XI that won 5-1 against Swansea City.\n\nThe young defender delivered a relatively decent performance in the left-back position, playing for sixty-five minutes.\n\nLuton Town midfielder Marvelous Nakamba made his sixth successive starting appearance against Millwall.\n\nCardiff City midfielder Andy Rinomhota also started over the weekend, playing the entire minutes in the 2-1 win versus Derby.\n\nTendayi Darikwa played the entire match as Lincoln City won 5-1 against Peterborough, while Tivonge Rushesha came on as a second half substitute in Readings 2-0 win over Leyton Orient in the English League One.\n\nTawanda Chirewa was on target last Friday after returning to Wolves earlier this month.\n\nChirewa, who returned to his parent club after his season-long loan stay at Derby was cut short, featured for the U21 side and scored a brace in the 3-1 win against Manchester City U21.\n\nIn Scottland, Tawanda Maswanhise featured for Motherwell in 2-1 loss versus Johnston, while Jordan Zemura started for Udinese against Roma in the Serie A.\n\nBill Antonio made his second appearance at Belgian side KV Mechelen after returning from a 10-month injury spell. Source Soccer24\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2023/10/Nakamba.jpg",
            "description": "IN the English Championship, Zimbabwean prospect Lucien Mahovo made his full debut for Norwich City on Saturday. Mahovo started in Norwich XI that won 5-1 against Swansea City. The young defender delivered a relatively decent performance in the left-back position, playing for sixty-five minutes. Luton Town midfielder Marvelous Nakamba made his sixth successive starting appearance […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        },
        {
            "title": "ICT Minister Dr Mavetera officially opens Potraz Data Privacy Week Symposium",
            "url": "https://www.chronicle.co.zw/ict-minister-dr-mavetera-officially-opens-potraz-data-privacy-week-symposium/",
            "content": "Mthabisi Tshuma in Victoria FallsThe Minister of Information Communication Technology, Postal and Courier Services, Dr Tatenda Mavetera, has officially opened the 2nd edition of the Potraz Data Privacy Week Symposium, which is being held in the resort city of Victoria Falls.\n\nMinister Mavetera is accompanied by ICT Deputy Minister Dingumuzi Phuti.The event is being held under the theme, Bridging Technology, Policy, Law and Practice Towards\n\nStrengthening Data Protection in Zimbabwe.As the Data Protection Authority of Zimbabwe, Potraz is committed to ensuring a high standard of data protection through public awareness, capacity building, compliance, and enforcement.\n\nThe three-day symposium is being attended by a cross-section of data protection experts, academics, researchers, business representatives, regulators, policymakers, and security services.Notable attendees include the Chairperson of the Parliamentary Committee on ICT, Postal and Courier Services, Hon Vusumuzi Moyo, the MP for Hwange West, and Hon Albert Mavhunga, the MP for Nketa, who is also a member of the committee.\n\nAmong those attending the symposium are Potraz Director General Dr Gift Machengete, Potraz Deputy Director Mr Alfred Marisa, directors from the ICT Ministry, Potraz board members, representatives from the Harare Institute of Technology (HIT), directors from the Office of the President and Cabinet (OPC), technical services directors in the Presidents department, officials from the Complaints and Investigation unit at the South African Information Regulator, officials from the Deposit Protection Corporation, and representatives from NetOne, Telecel, Africom, Zimswitch, Mukuru, the Computer Society of Zimbabwe, Silo Foods Industries, Econet, Zimpost, the Methodist Church, and Aura World, among others.\n\nIn her remarks, Minister Mavetera said the gathering underscores the collective commitment to safeguarding the digital rights and privacy of all Zimbabweans.There is a mission that grows more urgent as we navigate an increasingly interconnected world. In an era where data drives economies, empowers innovation, and shapes governance, privacy is no longer a luxuryit is a fundamental human right.\n\nThe rapid adoption of digital technologies in Zimbabwe, from mobile banking to e-government services, has transformed lives and businesses. However, it also exposes citizens to risks such as data breaches, identity theft, and cyber exploitation, said Minister Mavetera.Follow on X  @mthabisi_mthire\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2025/01/fgrgrtfg.jpg",
            "description": "Mthabisi Tshuma in Victoria Falls The Minister of Information Communication Technology, Postal and Courier Services, Dr Tatenda Mavetera, has officially opened the 2nd edition of the Potraz Data Privacy Week Symposium, which is being held in the resort city of Victoria Falls. Minister Mavetera is accompanied by ICT Deputy Minister Dingumuzi Phuti. The event is […]",
            "time": "18:30",
            "date": "29 Jan 2025"
        }
    ]
}