{
    "news": [
        {
            "title": "No room for troublemakers in Zanu-PF — President",
            "url": "https://www.chronicle.co.zw/1019969-2/",
            "content": "Joseph Madzimure, Harare Bureau\n\nPRESIDENT Mnangagwa yesterday read the riot act on senior party members who are abusing social media platforms to create divisions, causing discord and confusion among the membership base.\n\nThis comes as some senior ruling party members have been communicating opinionated views on social media. Addressing the 380th Session of the Politburo yesterday, President Mnangagwa emphasised the importance of unity and order within the party rank and file.\n\nAt this stage of our political development and with the maturity of our revolutionary party, it is disheartening to note the unbecoming levels of mud-slinging and other counter-revolutionary tendencies, including the broadcasting of party issues on social media platforms.\n\nThese acts continue to cause discord and confusion among the membership base. No one must put our party into disrepute. This is unacceptable. Such behaviour cannot be tolerated and must stop. Vari kuzviita cherai chikomba, emphasised President Mnangagwa.\n\nEvery member, President Mnangagwa said, must adhere to the provisions of the party constitution, founding principles, and procedural integrity, including wide consultation and formal ratification of issues that affect the party.\n\nPrudence must be exercised in the execution of our duties and rights as members, through the use of appropriate principal organs and structures of the party. Zanu-PF musangano unegwara, uye nematare.\n\nLet us do more to unite the party and entrench a positive culture of common purpose, harmony and love, as we advance our party Vision and Mission as articulated in Articles 6 and 7 of our party constitution, he said. On top of that, a social media policy is being crafted which will guide party members.\n\nThe President urged the party leadership to look forward to 2025 with optimism and confidence that the colossal party will sustain the development momentum realised so far.\n\nIn doing so, our primary concern at every leadership level should be to continue building a positive image of the party and expanding the membership base in our structures. The party must remain visible in the villages, and urban areas, always guiding misinformed cadres in our communities, and raising their political awareness. Mu Zanu-PF, iwe neni tine basa, he said.\n\nPresident Mnangagwa said despite the effects of the heinous illegal sanctions the country has witnessed numerous success milestones during the year.\n\nDespite the weighty and retarding effects of the heinous illegal sanctions on our country, we scored numerous success milestones during the year towards the modernisation, industrialisation and growth of our economy. Our national development philosophy, Nyika inovakwa, inotongwa, inonamatigwa nevene vayo/ ilizwe lakhiwa, libuswe, likhulekelwe ngabaninilo, is now embedded nationally, in the mind-sets of our people.\n\nAs such, through this rallying call as well as hard work, focus and determination, our country is realising growth across all sectors of the economy and also a higher quality of life for our people, said President Mnangagwa.\n\nIn the past few weeks alone, President Mnangagwa has officiated at various ceremonies for notable development projects and programmes being championed by the ruling party.\n\nThese included the commissioning of the Shurugwi-Mhandamabwe Road, the Varun Beverages Phase 6 and 7 expansion project, and the launch of the construction of a US$1 billion Titan New Energy Plant, among others.\n\nAs we continue to make efforts to position Zimbabwe as an infrastructure powerhouse, the central role of the iron and steel sector cannot be overemphasised. To this end, the convening of the Zimbabwe Iron and Steel Indaba was a welcome initiative.\n\nIt stands as a reminder to the party, Government and other stakeholders in the sector to quickly adapt and innovate as we revitalise this important industry of our nation, he said.\n\nFocus, he stated, must be towards guaranteeing that the natural endowments of the country benefit Zimbabweans and help accelerate the modernisation and industrialisation of the economy.\n\nHe commended party members for being instrumental in the success of programmes and activities that were held during the course of the year.\n\nYour individual and collective efforts were instrumental in the success of party programmes and activities held during the course of the year. The spirit of servant leadership and determination to wholeheartedly serve the party and people of our motherland, Zimbabwe, should remain our guiding beacon into the new year. Congratulations on a job well done, he said.\n\nHe also commended the party and Hebert Chitepo School of Ideology for facilitating training and capacity building for the members of the Youth League through the ongoing partnership with the Julius Nyerere School of Leadership.\n\nSuch leadership training programmes along with those conducted with various stakeholders within the country nurture our people to value and promote the ideals of patriotism and Pan-Africanism for the ongoing national development revolution.\n\nThe Chitepo School of Ideology, as a strategic Party and national institution, is directed to remain guided by the founding objectives, spirit and letter, that saw its establishment, he said.\n\nPresident Mnangagwa also wished Zimbabweans a prosperous Unity Day, Christmas and New Year holidays. He expressed his heartfelt empathy and solidarity with the people and Government of Mozambique and Malawi following the disruption, loss of life and damage to property by Tropical Cyclone Chido.\n\nDuring the Politburo session, a minute of silence was observed following the death of the gallant son of the soil and veteran of the liberation struggle, former Vice-President, Cde Phelekezela Report Mphoko.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Mnangagwa-observes-as-Zimbabwe-Prisons-and-Correctional-Services-Commission-Commissioner-Utoille-Slaigwana-signs-his-oath-of-office-at-State-House-in-Harare-yesterday-1-680x380.jpg",
            "description": "Joseph Madzimure, Harare Bureau PRESIDENT Mnangagwa yesterday read the riot act on senior party members who are abusing social media platforms to create divisions, causing discord and confusion among the membership base. This comes as some senior ruling party members have been communicating opinionated views on social media. Addressing the 380th Session of the Politburo […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "Zimpapers launches digital initiative",
            "url": "https://www.chronicle.co.zw/zimpapers-launches-digital-initiative/",
            "content": "Remember Deketeke, Harare Bureau\n\nZimbabwe Newspapers (1980) Limited, the largest media group in Zimbabwe, yesterday officially launched its ambitious digital transformation initiative aimed at modernising operations and enhancing reader engagement.\n\nZimpapers digital initiative\n\nThis initiative responds to the rapidly changing media landscape, where digital consumption is increasingly the norm.\n\nInformation Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, along with Deputy Minister Omphile Marupi and Permanent Secretary Nick Mangwana, also toured the groups new bookstore and coffee shops.\n\nMinister Muswere also participated in interviews with ZTN Prime and Capitalk, discussing the importance of embracing digital transformation for media entities.\n\nSpeaking at the launch, Minister Muswere emphasised the significance of digital transformation in achieving upper-middle-income status.\n\nZimpapers digital initiative\n\nWe are here to witness a groundbreaking digital initiative marking the beginning of Zimpapers journey toward total transformation as an institution, said Dr Muswere.\n\nZimpapers is undergoing a comprehensive digital transformation, with the Board, Management, and staff fully committed to this process. This initiative aims to ensure a total transformation of Zimpapers as an institution. This transformation is essential as we strive towards becoming an upper-middle-income society.\n\nZimpapers digital initiative\n\nDr Muswere outlined the key aspects of the transformative journey, including cultural, behavioural, digital, and business transformation.\n\nFor digital transformation to take place, the cultural transformation is to take the lead. The behavioural transformation is to take the lead as well, he said.\n\nThese four aspects in terms of the transformation of Zimpapers will ensure that the institution continues to grow.\n\nHe said that Zimpapers must adapt to the fourth industrial revolution.\n\nZimpapers digital initiative\n\nThe readership now focuses on traffic, content, and packaging. The old print media business model is declining, even though some segments still prefer physical copies, he said.\n\nThe board, management, and staff must strategically shift towards the complete digitalisation of Zimpapers. With approximately 8 million registered telecom subscribers and declining newspaper circulation, it is clear that we need to embrace the digital path.\n\nHowever, in this fourth industrial revolution, innovation is crucial, as necessity drives invention.\n\nDr Muswere added effective collaboration among the board, management, and staff is essential for the success of the digital transformation journey.\n\nZimpapers digital initiative\n\nTo drive Zimpapers a an institution, Dr Muswere emphasised the need to adapt to market trends by packaging content digitally.\n\nDrawing lessons from the successful Kenyan model, Zimpapers Group CEO Mr Pikirayi Deketeke said it can guide the entity towards full digital implementation.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/a.jpg",
            "description": "Remember Deketeke, Harare Bureau Zimbabwe Newspapers (1980) Limited, the largest media group in Zimbabwe, yesterday officially launched its ambitious digital transformation initiative aimed at modernising operations and enhancing reader engagement. This initiative responds to the rapidly changing media landscape, where digital consumption is increasingly the norm. Information Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "Farai Jere steps down from PSL‘…let football people lead’",
            "url": "https://www.chronicle.co.zw/farai-jere-steps-down-from-psl-let-football-people-lead/",
            "content": "Langton Nyakwenda, Harare Bureau\n\nIT was more of a goodbye and at the same time a gentle reminder of the good and bad things the top flight league encountered, in a six-year journey that began on September 9, 2018, when Farai Jere was elected Premier Soccer League chairman.\n\nJere who is stepping down from his post on December 31, spent the better part of yesterday with the 18 PSL board of governors. The day began at Borrowdale Estates where Jere unveiled a 1.4 ha piece of land that was acquired by the PSL for US$250 000.\n\nIt ended at a Harare hotel where the governors met for an extraordinary general meeting (EGM) that approved the 2025 Premier Soccer League budget.The EGM also deliberated on the new Zifa constitution, which now recognises the Premier Soccer League as a member.\n\nIt means the top flight will have 19 voters, including the 18 representatives from clubs, at the Zifa elections set for January 25 next year. Jere is contesting for the Zifa presidency.\n\nBut Jere can still bounce back as a PSL governor, even if he loses the Zifa election, by his position as the CAPS United president.\n\nThis is going to be my last meeting in my capacity as the PSL chairman, but I may come back again because as you know, I am the president of CAPS United, Jere said, soon after the EGM. But, the PSL is a system.\n\nI am leaving this office by the 31st of December and I wont be the PSL chairman. My vice chairman Lifa Ncube, will take over until the next PSL elections.Whoever will win the PSL chairmanship race will join us at Zifa where I will be the president, declared Jere.\n\nBut, the charismatic administrator has to wait until Monday, when the Zifa Ethics and Integrity Committee will release names of candidates who would have passed the integrity test.\n\nYadah Stars owner, Walter Magaya, Sakunda Holdings representative Nqobile Magwizi, former Warriors skipper Benjani Mwaruwari and Northern Region chairman Martin Kweza are vying for the Zifa presidency.\n\nFarai Jere\n\nPhilemon Machana, Marshall Gore, former legislator Temba Mliswa and former Premier Soccer League chairman Twine have also expressed interest in the hot seat.We want football to be led by people who understand the problems we have in football, Jere said.\n\nThats the direction we want to take and this is very critical, very important. The Premier Soccer League was founded in 1993 and since then the top flight league has operated from rented offices.\n\nDespite being the flagship football league in the country, the PSL has been a tenant for the past 32 years, shifting bases from the National Sports Stadium, City Sports Centre to Eastlea, where the top flight league is currently administered from.\n\nBut yesterday, at Borrowdale Estates on the outskirts of the capital Harare, a new chapter for the top flight league was written.\n\nA 1.4 ha piece of land was unveiled and on it, the PSL intends to build state of the art offices, a conference room, a football pitch and apartments. This is quite historic, it signifies where we want to take our football, said Jere.\n\nThis has never happened in the history of the Premier Soccer League. Added Jere: We cannot talk of football development without talking about infrastructure development.\n\nThats why even when you want to build a house you start by putting up a makeshift structure. This had never happened for the past 32 years, its the first piece of land that we will have on the balance sheet of the PSL.\n\nIt is going to be the home of our football, all the PSL clubs will be identified by this place, and the legacy of those who played our football before without offices, the great players, we are building on their legacy.\n\nJere revealed that womens football will also be accommodated. We will also incorporate women football. They need to also have offices to operate from.We are trying to show the world the direction we want to take, because this is what defines the seriousness of the league.\n\nIf you are to take the bottom-placed team in the league, its value was actually bigger than the value of the PSL, because we didnt have any tangible asset.We are always preaching the issue of club licensing, the issue of clubs having offices and yet the PSL didnt have its own building. So, we need to have everything to start from here.\n\nJere saluted the 18 clubs that participated in the 2024 Castle Lager Premier Soccer League for contributing towards the purchase of the Borrowdale Estates piece of land.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/08/Farai-Jere.jpg",
            "description": "Langton Nyakwenda, Harare Bureau IT was more of a goodbye and at the same time a gentle reminder of the good and bad things the top flight league encountered, in a six-year journey that began on September 9, 2018, when Farai Jere was elected Premier Soccer League chairman. Jere who is stepping down from his […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "Modi acquires Choppies",
            "url": "https://www.chronicle.co.zw/modi-acquires-choppies/",
            "content": "Nqobile Bhebhe,[emailprotected]\n\nRETAIL supermarket Sai Mart will assume control of Choppies Zimbabwe outlets starting January 1, marking a significant transition in Zimbabwes retail sector.\n\nThis development follows Choppies announcement of its decision to exit the Zimbabwean market as part of a broader strategy to ensure sustainable growth and profitability across its operation.\n\nSai Mart, owned by legislator and Deputy Minister of Industry and Commerce Raj Modi, operates six branches in Bulawayo. Deputy Minister Modi confirmed the development during a media briefing in Bulawayo yesterday.\n\nAs of January 1, 2025, we will take over Choppies Zimbabwe outlets, and they will be rebranded as Sai Mart, he said.\n\nDeputy Minister Modi, however, did not specify whether the acquisition includes all Choppies outlets nationwide or only those in Bulawayo.\n\nChoppies entered the Zimbabwean market in 2013 by acquiring several Spar shops and expanding its footprint in 2014 by opening a distribution centre in the country. The retailer currently operates 30 grocery stores nationwide under its subsidiary, Nanavac (Pty) Ltd, trading as Choppies Zimbabwe.\n\nIn November, Choppies announced its plans to sell its Zimbabwean operations. In a press release, the companys board of directors informed shareholders that it had entered discussions regarding the potential sale of Nanavacs business operations for cash. The sale, subject to certain conditions and regulatory approvals, aligns with Choppies strategic intent to focus on profitable retail operations.\n\nChoppies has faced challenges adapting to shifting consumer trends in Zimbabwe. Over the past two years, the country has witnessed a significant migration of shoppers to the informal retail sector, leading to a decline in foot traffic at formal retail outlets by as much as 30 percent.\n\nFounded in 1986 by Ramachandran Ottapathu and Farouk Ismail, Choppies Enterprises is Botswanas largest retail chain. The company has built a robust distribution network across South Africa, Zambia, Kenya and Zimbabwe, catering to diverse markets with a mix of international food brands and private-label products.\n\nDeputy Minister Modis Sai Mart aims to leverage this acquisition to expand its footprint and strengthen its position in Zimbabwes competitive retail landscape. The rebranding of Choppies outlets under Sai Mart is expected to usher in a new era for the supermarket chain while retaining its commitment to quality and affordability for Zimbabwean shoppers.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/dfgbrfgr.jpg",
            "description": "Nqobile Bhebhe, nqobile.bhebhe@chronicle.co.zw RETAIL supermarket Sai Mart will assume control of Choppies Zimbabwe outlets starting January 1, marking a significant transition in Zimbabwe’s retail sector. This development follows Choppies’ announcement of its decision to exit the Zimbabwean market as part of a broader strategy to ensure sustainable growth and profitability across its operation. Sai Mart, […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "President launches land tenure programme",
            "url": "https://www.chronicle.co.zw/president-launches-land-tenure-programme/",
            "content": "Zvamaida Murwira, Harare Bureau\n\nPresident Mnangagwa is today expected to launch the new Land Tenure Implementation Programme in Kwekwe which is expected to bolster the land ownership model, unlock huge amounts of finance, spur economic growth as well as enhance productivity.\n\nThe launch followed an adjustment to the countrys land tenure system that was announced by President Mnangagwa in October this year and is expected to improve land tenure security.\n\nUnder the new era, all the land held by beneficiaries of the Land Reform Programme under 99-year leases, offer letters and permits, will be held under a bankable, registrable and transferable document.\n\nAddressing the 380th Ordinary Session of the Zanu-PF Politburo at the revolutionary partys headquarters, President Mnangagwa, who is also First Secretary of the ruling party, said he will be launching the new programme at Pricabe Farm in Kwekwe.\n\nTomorrow (today) I will be launching the new land tenure implementation programme as we consolidate the gains of land reform. The programme is envisaged to bolster the land ownership model, and enhance access to financing, as well as to encourage production and productivity, said President Mnangagwa.\n\nHe implored communities to remain vigilant as the country seeks to capitalise on weather patterns for improved agricultural output.\n\nIn the agriculture sector, I once again urge communities, village by village, ward by ward to remain vigilant as we maximise the weather patterns for a successful agriculture season, said President Mnangagwa.\n\nTo ensure the smooth facilitation of the process, the Government issued an indefinite moratorium on the issuance of any new 99-year leases, offer letters and permits for agricultural land.\n\nIn announcing the new policy in October this year, President Mnangagwa said in implementing the new system, priority will be given to veterans of the liberation struggle, youths and women.\n\nIn addition, security of tenure to all agricultural land regularised under this programme will, at all times, only be transferable among indigenous Zimbabweans and land targeted for the new tenure system will exclude communal land that is under the jurisdiction of traditional chiefs.\n\nHe said the noticeable new paradigm amongst Zimbabwean farmers, especially the majority of beneficiaries of the land reform, was to regard and conduct farming as a business, a source of both livelihoods and means to increase personal economic value.\n\nChronicling the background of the programme, President Mnangagwa said the Government, has since 2008, put in place various programmes to assist farmers to be productive on the land through programmes such as the Basic Commodity Supply Side Intervention (Baccossi), Inputs and Mechanisation Equipment, Maguta, and the Special Grains Import Substitution Programme among others.\n\nIn the Second Republic, the country has witnessed and benefited from the Governments deliberate and complementary policy of incorporating accelerated infrastructure development which includes road construction and rehabilitation incorporating the much-needed rural roads, dam construction; irrigation; and housing development, he said.\n\nSome of the challenges, he said, that were faced by farmers in the past include difficulty in accessing affordable finance and varying levels of accountability from the farmers.\n\nThe President has since constituted a Cabinet Oversight Committee chaired by Defence Minister Oppah Muchinguri-Kashiri to lead the reform process.\n\nA technical committee  the Land Tenure Implementation Committee (LTIC)  to coordinate and steer the implementation of this process will also be constituted.\n\nThese Committees will work diligently to develop improved security of tenure for land beneficiaries while ensuring that the value of agricultural and urban State land is fully unlocked to guarantee inclusive and nationwide economic development.\n\nGovernment will put in place all the necessary institutional and logistical mechanisms to ensure the smooth coordination and implementation of these new policies and objectives.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/President-Mnangagwa-at-ZPCS.jpg",
            "description": "Zvamaida Murwira, Harare Bureau President Mnangagwa is today expected to launch the new Land Tenure Implementation Programme in Kwekwe which is expected to bolster the land ownership model, unlock huge amounts of finance, spur economic growth as well as enhance productivity. The launch followed an adjustment to the country’s land tenure system that was announced […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "Triple Crown for Bulawayo Literary Gem, Philani Amadeus Nyoni",
            "url": "https://www.chronicle.co.zw/triple-crown-for-bulawayo-literary-gem-philani-amadeus-nyoni/",
            "content": "Mbulelo Mpofu,[emailprotected]\n\nBULAWAYOS own literary genius, Philani Amadeus Nyoni, has achieved an unparalleled milestone, snagging three awards in just five months.\n\nNyonis unparalleled brilliance shone through as he clinched the coveted Best Outstanding Published Work award at the Botswana Literature Awards, outstripping 98 other entries.\n\nThis award followed his exhilarating triumphs at the Honorary AfriCAN Authors Award in South Africa, and the Phoenix Authors Award in Harare at the Phoenix Publishing Book Awards.\n\nNyonis unparalleled success is a testament to his exceptional drive, determination and devotion to storytelling.\n\nThe resounding success of his book The Testament of Black Jesus has been the single most significant catalyst in his exceptional winning streak.\n\nReaders and critics alike have praised the book for its impeccable narrative style and the profound themes it explores.\n\nIn an interview with Chronicle Showbiz, Nyoni reminisced not just on the moment he was awarded in Botswana but also on his meteoric rise to the pinnacle of literary stardom.\n\nI often say Books are like children; you do what you can for them, but ultimately, when they go out into the world, they have their own lives and identities. When my sister said I had outdone myself, I couldnt argue. Its a wonderful feeling that borders on scary, he said.\n\nAs Nyoni basks in the glory of his triple crown, he takes a moment to sum up the significance of this year.\n\nPhilani Nyoni (right) is presented with an AfriCAN Honoree Authors Award by Anthea Thyssen in South Africa\n\n2024 has given so positively in just about every sphere of my life, and I want to hold on to this momentum because I see great and wonderful things coming to manifest, things from unutterably big dreams, and I am here for them.\n\nSo, what drives this literary achievers success?\n\nNyoni attributes his achievements to a combination of factors, including his deep love for storytelling, a willingness to hone his craft, and the guidance of mentors from around the world.\n\nPhilani Nyoni with a NAMA gong\n\nIt takes a long time to achieve overnight success. I wrote my first poem 20 years ago and my first book 12 years ago. Between that time and now, I have had a lot of mentors who have guided me and left me intebe ezincane, I have also read thousands of books and written thousands of pages, many of them imperfect. I attribute my success to my deep love for what I do and a willingness to nurture it and put in the necessary elbow grease.\n\nWith his triple crown of awards, Nyoni has cemented his position as one of the most exciting and accomplished literary voices to emerge from Zimbabwe in recent years.  @MbuleloMpofu\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/hjyujy.jpg",
            "description": "Mbulelo Mpofu, mbulelo.smpofu@gmail.com BULAWAYO’S own literary genius, Philani Amadeus Nyoni, has achieved an unparalleled milestone, snagging three awards in just five months. Nyoni’s unparalleled brilliance shone through as he clinched the coveted “Best Outstanding Published Work” award at the Botswana Literature Awards, outstripping 98 other entries. This award followed his exhilarating triumphs at the “Honorary […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "COMMENT: Winning steps must  be enhanced going forward",
            "url": "https://www.chronicle.co.zw/comment-winning-steps-must-be-enhanced-going-forward/",
            "content": "Thanks to a range of measures that the Government put in place since January, the country is firmly on its way to setting a gold production record this year.\n\nThe highest that we have produced in history is 35 tonnes (t) in 2022. Authorities set a target to match the 2022 record this year but by the end of last month, miners had sold 32t of the metal, our single biggest foreign currency earner.\n\nThis means that between last month and the end of this month, miners have to sell three tonnes to achieve the forecast.But, speaking at a gold mobilisation send-off last week, Mines and Mining Development Minister, Winston Chitando said the Government was optimistic that total production for the year would exceed 35t.\n\nHis deputy, Polite Kambambura agreed, explaining that the ministry expected gold mining companies to deliver at least three tonnes more by the end of this month while platinum group metals miners, whose processing systems extract gold too to produce two tonnes by the end of this month.\n\nThis will set a yearly production record of 37t. We, most keenly, look forward to the final statistics over the next few weeks.\n\nLooking back, we note that the stellar output envisaged for this year was not an accident but a result of hard work and implementation of winning policies and programmes at Government and mine levels.\n\nEarlier this year, the Government scrapped 15 percent value-added tax on gold deliveries. This encouraged miners to sell their production to Fidelity Gold Refinery since they knew their sales revenues were not subject to tax.\n\nWe think this was the masterstroke that drove output this year and will continue to drive it into the future. In addition to the removal of the tax, the Government has expanded and strengthened its gold mobilisation system across all mining districts countrywide. Plans are underway to build more centres at which miners can sell their production near their mines. This decentralised approach ensures that miners dont spend money and time driving to distant urban centres to sell their production.\n\nYet another factor that has boosted output was the deliberate effort by the Government to help mechanise mining operations. Where a miner sought gold using pick and shovel, machines are now doing that backbreaking work for them.\n\nWe also believe that, motivated by the foregoing, miners, large and small, expanded their operations this year, and with it, output.\n\nAll the winning steps that the industry took this year to achieve the expected 37 tonnes must be enhanced going forward so that we set a production record yearly.\n\nGhana produced a humongous 118t of gold in 2022, South Africa second with 100t, Sudan (93t), Mali (64t) and Burkina Faso (45t).\n\nNoting the abundance of the precious metal in our country, the available skills and other resources, we feel we belong to that premier league.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Thanks-to-a-range-of-measures-that-the-Government-put-in-place-since-January-the-country-is-firmly-on-its-way-to-setting-a-gold-production-record-this-year..jpg",
            "description": "Thanks to a range of measures that the Government put in place since January, the country is firmly on its way to setting a gold production record this year. The highest that we have produced in history is 35 tonnes (t) in 2022. Authorities set a target to match the 2022 record this year but […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "GBV knows  no borders! SADC should unite against the scourge",
            "url": "https://www.chronicle.co.zw/gbv-knows-no-borders-sadc-should-unite-against-the-scourge/",
            "content": "Mkhululi Ncube,[emailprotected]\n\nGETTING married in a foreign country may have its unique challenges but things can turn even more sour when one suffers at the hands of an abusive partner and the justice system looks aside because of ones nationality.\n\nWhen *Ms Nokuthula Sibanda (36) left Zimbabwe for Botswana to do her beauty therapy attachment in 2007, she never thought that she would find herself getting married in a foreign land.\n\nShe says she first met her now ex-husband in Gaborone and although they spoke, she did not give much thought to his advances.\n\nI moved from my rented apartment to a new place and unbeknown to me, I had moved to his parents house. So when I woke up in the morning, I saw the guy who I had met in town. Things happened and a few months down the line, we were dating, she said.\n\nWith things happening fast, Nokuthula found herself pregnant and she was just 19 years old. Although she says her father-in-law made it clear that he was not happy with his son marrying a foreigner, her mother-in-law pushed for lobola and that everything be done according to their cultural norms.\n\nWe were supposed to do a white wedding but since I was pregnant, my mother-in-law said I should wait until I gave birth which happened in June 2008. In August of the same year, we tied the knot in court, she said.\n\nNokuthula said their love story turned sour when she was seven months pregnant and her husband beat her while she was carrying his baby.\n\nShe said she had visited Zimbabwe for the festive season and fell ill, which delayed her return to Botswana.\n\nWhen I got there, we moved out to rent our own apartment because I had challenges with the language. He suggested we move out. He had the wrong set of friends who influenced him wrongly. We had our first fight and he clapped me while pregnant.\n\nIn the morning he apologised and bribed me with chocolates and other presents. But the abuse never stopped. He would disappear after getting paid and return after having finished all the money as he was seeing someone else. When I asked about his movements and the money, he would beat me up, she said.\n\nHer ex-husband broke her right wrist and another injury she sustained on the leg from his abusive ways still troubles her during winter.\n\nHe wanted to kick me in the stomach but I dodged, blocked with my hand and he broke it. I have doctors and police reports to that effect. I reported the matter to my uncles but they said emendweni kuyabekezelwa, said Nokuthula.\n\nShe said this took a toll on her and she lost a lot of weight as a result. Nokuthula said she finally called time on the abusive relationship in 2014 after enduring six years of abuse.\n\nWhat broke the camels back was a fight over a DVD player. He strangled me, took hot isitshwala and spread it on my face, burning me in the process. For the first time, I reported him to the police but they were not interested in the case since I was a foreigner. They said it was a domestic matter that shouldve been handled at home. It was me against the people keen to protect their own from a foreigner, she said.\n\nNokuthula said even when they were referred to the village courts, the matter was looked at with the same lens. She said she abandoned seeking justice and left Botswana for South Africa, ending the abusive relationship. Looking back, Nokuthula said she picked two lessons from the experience, which she hopes will help other women.\n\nWe shouldnt rush to get married; I was married at 19 and clearly I wasnt mature then. Never dismiss the red flags which you see because it will only get worse once you are married. He started beating me before we signed the marriage certificate and I ignored all that. I also wanted to keep the marriage because society stigmatises omabuyekwendeni,she said.\n\nNokuthula says the two of them used to go to church but that did not count as the man would turn devil incarnate at home.She said her ex-husband is now a pastor in Botswana while she is vending on the streets of Bulawayo to support their two children as he is not supporting them.\n\nNokuthula shared her story during recent Gender-Based Violence commemorations organised by Emthonjeni Womens Forum.The 16 Days of Activism Against Gender-Based Violence are marked annually from November 25 to December 10.\n\nThis years commemorations were marked under the theme, Unite! Activism to end violence against women and girls.EMthonjeni Womens Forum Programmes Officer Ms Shirley Mabutho said there is a need for SADC countries to adopt uniform policies that deal with GBV.\n\nGender-Based Violence knows no borders, and justice must not discriminate based on citizenship or immigration status. SADC countries must adopt and enforce uniform policies that prioritise the protection of all individuals, regardless of nationality or documentation. This includes ensuring accessible reporting mechanisms, shelters, and legal aid for survivors, especially those who face additional vulnerabilities as migrants or undocumented individuals, she said.\n\nMs Mabutho said there is a need for public awareness campaigns and community engagement to challenge harmful cultural norms that perpetuate tolerance of GBV.\n\nShe said it was only through uniting as a region that a society where women and girls are truly safe and can be supported will be formed. @themkhust\n\nNote: Nokuthula isnot her real name.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Stakeholders-at-a-workshop-organised-by-Emthonjeni-Women’s-Forum-as-part-of-commemorations-to-mark-16-Days-of-Activism-Against-Gender-Based-Violence-recently.jpg",
            "description": "Mkhululi Ncube, themkhust@gmail.com GETTING married in a foreign country may have its unique challenges but things can turn even more sour when one suffers at the hands of an abusive partner and the justice system looks aside because of one’s nationality. When *Ms Nokuthula Sibanda (36) left Zimbabwe for Botswana to do her beauty therapy […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "WATCH: CSC officials, police bust  cross-border cattle rustlers",
            "url": "https://www.chronicle.co.zw/csc-officials-police-bust-cross-border-cattle-rustlers/",
            "content": "Raymond Jaravaza and Trish Mukwazo, Chronicle Writers\n\nA DECISION to sell 11 stolen cattle to the Cold Storage Company (CSC) proved to be a poor one for suspected cattle rustlers after alert officials and police at the abattoir noticed that the documents presented by the three men were fake.\n\nThe cattle believed to have been stolen in Botswana\n\nThe suspects have pending cases of stock theft in the courts. They were arrested on Tuesday with a truck laden with 10 cows and an ox at the CSC depot in Bulawayo trying to sell the livestock suspected to have been stolen from neighbouring Botswana as the animals did not bear local cattle brand marks.\n\nPolice identified the suspects as Trust Mpofu (37) of Nkulumane suburb, Prince Dube (40) of John West village under Chief Marupi and 31-year-old Mthuthukisi Msizi of Pumula North suburb.\n\nA CSC official briefed Chronicle yesterday morning on how an alert police officer who is stationed at the abattoir noticed that the documents presented by the trio were missing a vital stamp from the police station where they claimed the animals had been cleared for transportation to Bulawayo, where they would be ultimately sold to any abattoir in the city.\n\nThe alert police officer then contacted her counterparts from the Anti-Stock Unit who arrested the three suspects on stock theft charges.\n\nVehicle which carried stolen cattle from Botswana\n\nMpofu, Dube and Msizi were detained at Donnington Police Station while police continued with investigations. The truck used to ferry the cattle was impounded and is being held at the same police station.\n\nCSCs operations and production co-ordinator Mr Beit Tonderai Rinashe said the abattoir has a foolproof system that is designed to prevent stolen cattle from being sold or slaughtered at the facility.\n\nWe believe the cattle were stolen from Botswana and the suspects tried selling them here but CSC has systems in place that scrutinise documents such as movement permits and police clearance certificates.\n\nWe work hand in hand with the police and in this particular case an officer from ZRP noticed that the suspects were using a doctored document and we immediately called the Anti-Stock Theft Unit, said Mr Rinashe.\n\nAfter doing their due diligence, the Anti-Stock Theft Unit was satisfied that the cattle were stolen and arrested the suspects.\n\nCSC would like to assure farmers that stolen cattle will not be slaughtered here as we cross-check all the necessary documents to make sure that the animals have been cleared by the relevant authorities, he said.\n\nOne of the beasts died on arrival and the meat was donated to a wildlife sanctuary.\n\nInitially there were 12 cattle but one died on arrival at CSC. We slaughtered it and donated the meat to the Chipangali Wildlife Orphanage where the meat will be fed to crocodiles, he said.\n\nThe suspects yesterday afternoon appeared before Bulawayo provincial magistrate Mrs Nomagugu Maphosa. Ms Dorcas Maphosa prosecuted.\n\nThey were remanded in custody until 24 December for bail ruling. Ms Maphosa told the court that on 17 December at CSC, the trio was found with the cattle, which they failed to account for.\n\nThe State has overwhelming evidence against the accused persons in that they were found with cattle that do not belong to them, she said.\n\nIn opposing bail, Ms Maphosa told the court that the trio has pending cases related to stock theft.\n\nThe State prays for the accused persons to be remanded in custody.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/Stolen-cattle-from-Botswana-3.jpg",
            "description": "Raymond Jaravaza and Trish Mukwazo, Chronicle Writers A DECISION to sell 11 stolen cattle to the Cold Storage Company (CSC) proved to be a poor one for suspected cattle rustlers after alert officials and police at the abattoir noticed that the documents presented by the three men were fake. The suspects have pending cases of […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        },
        {
            "title": "Magwizi dismisses nomination objections",
            "url": "https://www.chronicle.co.zw/magwizi-dismisses-nomination-objections/",
            "content": "Innocent Kurira,[emailprotected]\n\nNQOBILE Magwizi, a top contender for the Zimbabwe Football Association (Zifa) presidency, has dismissed objections to his nomination, citing his removal from the US sanctions list.\n\nThe objections, raised by T Muzanenhamo, centre around Magwizis alleged inclusion on the Specially Designated Nationals and Blocked Persons (SDN) List.However, Magwizis camp argues that he was officially removed from the SDN List in March 2024, via a US executive order.\n\nMagwizi has addressed the matter directly with the integrity committee, confirming his removal from the list as per the Federal Register/Vol. 89, No. 46.I have been made aware of information circulating on social media alleging that an objection has been raised against my candidacy for ZIFA President, Magwizi said. While it is true that my name was once included on this list, I would like to confirm that I was officially removed from the SDN List as per the Federal Register/Vol. 89, No. 46, wrote Magwizi.\n\nMagwizi is one of several candidates vying for the Zifa presidency, including Marshall Gore, Temba Mliswa, Walter Magaya, Farai Jere, Twine Phiri, Philemon Machana and Benjani Mwaruwari.\n\nThe electoral committee is expected to announce the nominees for the posts of president, vice-presidents, and board members on December 23.\n\nTo be eligible for the presidency, candidates must meet specific requirements, including being at least 40 years old and possessing at least five Ordinary Level passes, including English Language.\n\nSeveral candidates are vying for the two vice president posts, with one reserved for a woman. Former Ngezi Platinum Stars chief executive officer Nyasha Kadenge, former Zifa board member Mavis Gumbo, and Loveness Mukura are among those contesting for the post.\n\nOther contenders include former ZIFA board vice-president Omega Sibanda and others like Gift Banda, Peter Dube, and Kennedy Ndebele.\n\nClose to 40 candidates intend to fill the board members posts, including veteran football administrator Francis Zimunya, Chicken Inn secretary Tavengwa Hara and former Zifa spokesperson, Xolisani Gwesela.\n\nOther candidates for the board posts are :\n\nChris Mtungwazi, Sweeny Mushonga, Admore Chivero, Morgen Dube, former Harare deputy mayor Kudzai Kadzombe, Desmond Ali, Tizirayi Luphahla, former Warriors doctor Nicholas Munyonga, football team Gunners founder Cuthbert Chitima, Alois Bunjira, Masimba Chihowa, Sibekiwe Ndlovu, Cecilia Gambi, Makwinji Soma-Phiri, Harlington Shereni and Blessing Mpande, among others.  @innocentskizoe.\n\n",
            "image_url": "https://www.chronicle.co.zw/wp-content/uploads/sites/3/2024/12/tytyt.jpg",
            "description": "Innocent Kurira, innocent.kurira@chronicle.co.zw NQOBILE Magwizi, a top contender for the Zimbabwe Football Association (Zifa) presidency, has dismissed objections to his nomination, citing his removal from the US sanctions list. The objections, raised by T Muzanenhamo, centre around Magwizi’s alleged inclusion on the Specially Designated Nationals and Blocked Persons (SDN) List. However, Magwizi’s camp argues that […]",
            "time": "09:08",
            "date": "20 Dec 2024"
        }
    ]
}