{
    "news": [
        {
            "title": "President reassigns ministers . . . appoints CIO boss",
            "url": "https://www.herald.co.zw/president-reassigns-ministers-appoints-cio-boss/",
            "content": "Africa Moyo-Deputy News Editor\n\nPRESIDENT Mnangagwa yesterday reassigned two Cabinet Ministers and appointed a new Director General of the Central Intelligence Organisation.\n\nPublic Service, Labour and Social Welfare Minister July Moyo has been appointed Minister of Energy and Power Development while the incumbent, Edgar Moyo, takes over the Public Service, Labour and Social Welfare portfolio.\n\nThe reassignments are with immediate effect.\n\nThe President also appointed a new Director-General of the Presidents Department, Dr Fulton Mangwanya.\n\nIn two separate statements yesterday evening, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, said: In terms of Subsection 1 of Section 104 of the Constitution of Zimbabwe, His Excellency the President, Cde Dr Emmerson Dambudzo Mnangagwa has reassigned the under-listed Ministers as follows: Hon. J.G. Moyo, M.P. Minister of Energy and Power Development (and) Hon. E. Moyo, M.P: Minister of Public Service, Labour and Social Welfare.\n\nThe re-assignments are with immediate effect.\n\nMinister July Moyo had been Public Service, Labour and Social Welfare Minister since 2023, while Minister Edgar Moyo was Energy and Power Development Minister from the same year.\n\nMinister July Moyo joins the Energy Ministry at a time when the country is facing power challenges occasioned mainly by low water levels in Kariba Dam due the El-Nino phenomenon, which hit most parts of Southern Africa last year.\n\nBut encouragingly, Minister Moyo comes in when Zimbabwe has embarked on 18 electricity generation projects with a capacity to deliver up 4 000MW in the next two years.\n\nThese will effectively make the country electricity self-sufficient with capacity to export the surplus.\n\nYesterday, Zimbabwe was generating a total of 935MW from Hwange (700MW), Kariba (185MW), Independent Power Producers 50MW. This is against a national demand of about 1 800MW.\n\nIn respect of the appointment of Dr Mangwanya, Dr Rushwaya said: In terms of Section 226(1) of the Constitution of Zimbabwe, His Excellency the President, Cde Dr Emmerson Dambudzo Mnangagwa has appointed Dr Fulton Mangwanya as the Director General, Presidents Department. The appointment is with immediate effect.\n\nDr Mangwanya takes over from Ambassador Isaac Moyo, who was in charge of the department from December 8, 2017.\n\nBy the time Ambassador Moyo assumed the DGs post, he was Zimbabwes Ambassador to South Africa and the United Kingdom of Lesotho.\n\nOn his part, Dr Mangwanya had been the Zimbabwe Parks and Wildlife Managements director-general since August 1, 2017.\n\nHe had replaced Mr Edson Chidziya, who left the organisation in 2015.\n\nDr Mangwanya has been described as committed, self-motivated, adaptable to evolving technologies and a results-oriented team player.\n\nHe was born on January 13, 1967 and began his career as a farm manager in the 1980s, before joining the Presidents Department in January 1988.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-1-680x380.jpg",
            "description": "Africa Moyo-Deputy News Editor PRESIDENT Mnangagwa yesterday reassigned two Cabinet Ministers and appointed a new Director General of the Central Intelligence Organisation. Public Service, Labour and Social Welfare Minister July Moyo has been appointed Minister of Energy and Power Development while the incumbent, Edgar Moyo, takes over the Public Service, Labour and Social Welfare portfolio. […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "New police chief lays out vision",
            "url": "https://www.herald.co.zw/new-police-chief-lays-out-vision/",
            "content": "Zvamaida Murwira-Senior Reporter\n\nNEWLY-appointed Zimbabwe Republic Police Commissioner-General, Stephen Mutamba, has pledged to transform the institution into a modern and corruption-free police service leveraging on technology to fulfil its constitutional mandate.\n\nComm-Gen Mutamba said this yesterday at a handover and takeover ceremony that was held at Mkushi Police Academy (formerly Morris Depot) in Harare.\n\nHe succeeded C0mmissioner-General Godwin Matanga who retired at the end of last year.\n\nIn his keynote address that saw guests, senior and junior officers enduring showers that fell during the event, Comm-Gen Mutamba said he was encouraged that he was inheriting a disciplined police service.\n\nLet me hasten to say that, one of the immediate inheritances that you have bequeathed me is a disciplined Police Service, well established and appropriately guided by the Strategic Plan: Horizon 2025.\n\nAlthough the Strategic Plan is coming to the end of its lifetime, the foundations it has laid for the organisation are critical going forward. More so, at a time when the Police Service has a vital role of creating a conducive environment for the sustenance and success of national development priorities pronounced through Vision 2030, said Comm-Gen Mutamba.\n\nHe paid tribute to Comm-Gen Matanga for providing sound leadership during his tenure.\n\nI greatly thank you my dear brother for laying such a strong foundation. Going forward, I hope to build on the already reinforced pillars to ensure that the Zimbabwe Republic Police indeed becomes a modern police service that leverages technology towards fulfilling its Constitutional mandate. In doing so, I will equally continue to ride on discipline as the cornerstone of the organisation whilst also expecting all members and officers of the organisation to remain steadfast.\n\nComm-Gen Mutamba thankedPresident Mnangagwa and the Government as a whole for showing trust in him.\n\nThe event was attended by Minister Kazembe, Minister of State for National Security, Lovemore Matuke, Director General of the Central Intelligence Organisation, Ambassador Isaac Moyo, Commander Zimbabwe National Army Lieutenant General Anselem Sanyatwe, service chiefs and senior Government officials.\n\nMay I therefore take this opportunity to reassure the appointing authority, the responsible Honourable Minister of Home Affairs and Cultural Heritage, Kazembe Kazembe, the whole Government as well the people of Zimbabwe that I am ready to take my assigned role and look forward to your support, he said.\n\nComm Gen Mutamba lauded Comm Gen Matanga for his leadership role, saying he will utilise some of the lessons he learnt from him.\n\nAbove all, I thank His Excellency, the President of the Republic of Zimbabwe, Cde Dr Emmerson Mnangagwa for trusting me and appointing me to head the organisation. Be rest assured that your trust will not be in vain. I look forward to the support and co-operation from the people of Zimbabwe in our endeavour to guarantee continued public confidence in the police service. In addition, it is my shared hope that we will be able to galvanise a disciplined and corrupt free police service by the year 2030, he said.\n\nIn his speech, Comm Gen Matanga said he was leaving the ZRP a happy man given his service and will be retiring to go into farming and other business interests.\n\nFor me personally, it is a boundless moment of delight as I bid farewell to longstanding colleagues and organisation that I served over a long period of time. Alas, the day will certainly come when we have to separate with the organisation that we have drawn a lot of friendships, experiences and livelihood from, he said.\n\nComm Gen Matanga saluted President Mnangagwa for affording him an opportunity to serve at the helm of the police service.\n\nHe dismissed social media reports that circulated recently claiming that he was refusing to leave office, describing them as flawed and premature.\n\nIn the same manner may I also take this opportunity to clarify an incorrect position that has been peddled in the media recently pertaining to my retirement. Ladies and gentleman, listen carefully. I was properly served by the President of Zimbabwe, His Excellency Dr Mnangagwa at a time when my retirement was due. I am so contended with the contribution and service I gave to the country in pursuit of national goals and aspirations, suffice to say the bar to modernise the police service is relatively high in view of resource constraints, skills flight and crippling sanctions we have endured for decades among other challenges, Comm Gen Matanga said.\n\nI am however, confident that a new broom sweeps clean and my successor will be able to ride on the achievements we have made and tackle existing challenges head on. I am comfortable to pass the baton to Cde Stephen Mutamba whom I have been with in the trenches for many years and have no doubt in his capacity to steer the ship going forward.\n\nThe event was attended by Minister Kazembe, Minister of State for National Security, Lovemore Matuke, Director General of the Central Intelligence Organisation, Ambassador Isaac Moyo, Commander Zimbabwe National Army Lieutenant General Anselem Sanyatwe, service chiefs and senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Comm-Gen-Mutamba-680x380.jpg",
            "description": "Zvamaida Murwira-Senior Reporter NEWLY-appointed Zimbabwe Republic Police Commissioner-General, Stephen Mutamba, has pledged to transform the institution into a modern and corruption-free police service leveraging on technology to fulfil its constitutional mandate. Comm-Gen Mutamba said this yesterday at a handover and takeover ceremony that was held at Mkushi Police Academy (formerly Morris Depot) in Harare. He […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Helicopter airlifts critically-ill child to Harare for treatment",
            "url": "https://www.herald.co.zw/helicopter-airlifts-critically-ill-child-to-harare-for-treatment/",
            "content": "Raymond Jaravaza-Bulawayo Bureau\n\nJUST over two weeks ago, four-and-a-half-year-old Tatenda Machezera was a picture of health.\n\nBut on a seemingly ordinary Sunday morning, December 22, 2024, a sudden and terrifying change occurred.\n\nTatenda began complaining of a severe headache and dizziness, and within hours, her condition dramatically deteriorated.\n\nAlarmed by her nosebleeds and unexplained bleeding from the mouth, her grandparents rushed her from their home in Bulawayos Emganwini suburb to the nearest clinic in Nketa.\n\nStaff at the local clinic referred the little girl to the United Bulawayo Hospitals (UBH), where her grandparents, Alexander Tirimboyi and Sphephile Ncube, began a near-fortnight stay at the referral health facility.\n\nThis continued until yesterday afternoon when the ailing child was airlifted to Parirenyatwa Hospital in Harare.\n\nAccompanied by her granny, Ncube, young Tatenda will undergo a barrage of tests to determine exactly what she is suffering from  the type of disease that would render a healthy child bedridden and in excruciating pain.\n\nTatenda was born without any complications and was a healthy child until 22 December when she got sick to an extent that she was bleeding from the nose and mouth. We spent the festive season at UBH as doctors and nurses tried to figure out what exactly is wrong with our grandchild. The doctors suspect she could be suffering from bone marrow cancer, but they said its better she is transferred to Harare for more tests, said Tirimboyi.\n\nJust before noon yesterday, UBH staff, patients, and visitors were taken aback by the sounds of rotor blades of an Ansat helicopter whirring in the air, announcing the arrival of the life-saving air ambulance in the city.\n\nThe helicopter, a flying intensive care unit, is one of two air medical rescue service ambulances that will be stationed at UBH to offer swift medical responses for emergencies, such as the critically injured in road accidents. The air ambulance will also be used to airlift patients from hard-to-reach areas, which would typically take hours to get to by road.\n\nYesterday, HeliDrive Zimbabwe, the air ambulance service, had two passengers  little Tatenda and her granny, Ncube, who was travelling as the legal guardian of the child. Tatendas parents work in South Africa, and her mother is expected to be in Harare this evening.\n\nWe will know exactly what it is our granddaughter is suffering from when the doctors are done with the tests, said Tirimboyi.\n\nHe expressed gratitude to HeliDrive Zimbabwe for the swift and efficient services that ensured young Tatenda was airlifted to the capital city at no cost to the family.\n\nThe staff at UBH has been amazing. Tatenda was in a bad state when she arrived at UBH, but they made sure that she gets the best assistance. Im grateful to HeliDrive Zimbabwe and the Government for introducing such a life-saving service that will ensure that patients are transferred from one hospital to another in a short space of time, Tirimboyi said.\n\nIt takes about six hours to drive from Bulawayo to Harare, a long drive that is not suited for someone in a precarious condition such as Tatenda. By helicopter air ambulance, the journey can be completed in slightly more than an hour.\n\nTypically, HeliDrive Zimbabwe carries a single adult patient, but in the case of a minor, a legal guardian is also accommodated in the air ambulance. In total, six people  Tatenda, Ncube, a medical doctor, a technician, pilot, and co-pilot  were aboard the air ambulance as it made its way into theskies en-route to Harare.\n\nOnce the helipad at UBH is complete, the HeliDrive Zimbabwe crew  doctors, pilots, technicians, and other personnel  will be housed in a building at the hospital. The ideal response time is 15 minutes from the time a call is received to the air ambulance taking off, as explained to our Bulawayo Bureau by HeliDrive Zimbabwe accountable manager Ellemencia Nyasha Makosa last year.\n\nIn the event that the air ambulance is summoned to an area where there is no helipad, the pilots use their discretion to use an open space such as a sports field to land.\n\nAir medical ambulances play a crucial role in healthcare by transporting patients, often in critical condition, from one location to another using aircraft specially equipped with medical equipment and staffed by trained medical professionals. The importance of air medical transport lies in its ability to provide rapid and efficient transportation for patients who require immediate medical attention or specialised care that may not be available locally.\n\nThe service allows for timely access to advanced medical facilities and specialised healthcare providers that may be located far away. This is particularly significant for individuals residing in remote areas or regions with limited healthcare resources. By bridging the geographical gap, air medical transport ensures that patients receive the necessary medical interventions promptly, potentially saving lives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/An-air-ambulance-crew-arrives-at-Parirenyatwa-Group-of-Hospitals-with-Tatenda-Machezera-680x380.jpg",
            "description": "Raymond Jaravaza-Bulawayo Bureau JUST over two weeks ago, four-and-a-half-year-old Tatenda Machezera was a picture of health. But on a seemingly ordinary Sunday morning, December 22, 2024, a sudden and terrifying change occurred. Tatenda began complaining of a severe headache and dizziness, and within hours, her condition dramatically deteriorated. Alarmed by her nosebleeds and unexplained bleeding […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "President promotes six colonels",
            "url": "https://www.herald.co.zw/president-promotes-six-colonels/",
            "content": "Columbus Mabika-Herald Reporter\n\nCommander-in-Chief of the Zimbabwe Defence Forces, President Mnangagwa, has promoted six colonels in the Zimbabwe National Army to the rank of Brigadier-General.\n\nThe President made the promotions in terms of the Defence Act (Chapter 11:02) Section 20, as read with Statutory Instrument 257 of 2020, Section 19c, Sub-section 2c, which reads: His Excellency the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces may on the advice of the Minister of Defence, acting on the recommendations of the Commander Zimbabwe Defence Forces, reward any member for distinguished service or gallant conduct on active service by promoting an officer to a higher rank.\n\nThe six who were promoted with effect from 16 December 2024 are Brigadier Generals Oscar Tshuma, Raban Nikisi, Benjamin Sabata, Passmore Taruodzera, Million Ndlovu and Lawrence Munzararikwa.\n\nSpeaking during the conferment of badges ceremony at Josiah Magama Tongogara Barracks in Harare yesterday, Commander Zimbabwe National Army (ZNA), Lieutenant General Anselem Sanyatwe, said the nation cannot continue to overlook drug and substance abuse which has become a national security threat undermining economic activity as the country moves towards realising an upper middle income economy.\n\nLt Gen Sanyatwe said drug and substance abuse was undermining the values and foundations of society and the military is not spared hence the need to take urgent action against the scourge.\n\nIn addition to the challenges of training and operational readiness, we must also confront a scourge of drug and substance abuse. The entire nation is grappling with the scourge and our organisation has not been spared,\n\nThe threat of drug and substance abuse is a challenge we cannot continue to overlook. It undermines the very foundations and values of military effectiveness and the trust placed upon us by the entire nation.\n\nTurning to the promotions, Lt Gen Sanyatwe said they were a testimony of hard work and loyalty.\n\nPromotions are characterised by any increase in duties and responsibilities, yours will not be an exception.\n\nHe called on the newly promoted officers to continue enhancing systems that ensure personnel are equipped not only to serve but to thrive.\n\nYou must ensure that personnel under your command are empowered, encourage their growth and foster an environment where they can thrive.\n\nThe country, Lt Gen Sanyatwe said, was going through a transitional economic and institutional revitalisation phase which undoubtedly requires complementary efforts.\n\nBrig Gen Sabata, who has been assigned to the position of Brigadier General Quarter Master Staff at Army Headquarters, said he will continue to be loyal to the Constitution and the command establishment.\n\nHe thanked President Mnangagwa for the confidence he showed by elevating him to a higher rank.\n\nWe undertake to be always loyal to the Constitution and command establishment of the ZDF and at the same time we always undertake to serve the people of Zimbabwe. May I also take this rare opportunity to heartily thank Commander ZNA together with his command element for tirelessly mentoring us throughout our military career spanning several years. It is through your tireless efforts and consistent guidance that we have got to where we are today, said Brig Gen Sabata.\n\nBrig-Gen Ndlovu concurred saying they will continue to work hard for the betterment of the army and nation at large.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Promoted-colonels-680x380.jpg",
            "description": "Columbus Mabika-Herald Reporter Commander-in-Chief of the Zimbabwe Defence Forces, President Mnangagwa, has promoted six colonels in the Zimbabwe National Army to the rank of Brigadier-General. The President made the promotions in terms of the Defence Act (Chapter 11:02) Section 20, as read with Statutory Instrument 257 of 2020, Section 19c, Sub-section 2c, which reads: “His […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Community embraces First Lady’s teachings . . . invites her to witness success of programme",
            "url": "https://www.herald.co.zw/community-embraces-first-ladys-teachings-invites-her-to-witness-success-of-programme/",
            "content": "Tendai Rupapa-Senior Reporter\n\nTHE Musiiwa Community of Madziwa, Mashonaland Central Province yesterday invited First Lady Dr Auxillia Mnangagwa to witness the cleaning of homes and execution of various chores for the elderly, including a centenarian, the disabled and orphans in line with her teachings, in a rare expression of love and compassion for vulnerable groups.\n\nHowever, Amai Mnangagwa, who accepted the invitation, did not just watch from the sidelines, but joined community women, including those from various churches in replanting maize and sugar beans that did not germinate well, doing laundry, cleaning houses, cooking and conversing with the elderly.\n\nThey left the places airy and with a breath of fresh air.\n\nThis comes as most elderly persons endure long periods of loneliness against the backdrop of ill-health associated with old age.\n\nSome people accuse the elderly of witchcraft and relegate them to rural areas which they seldom visit.\n\nBut, the First Lady constantly reminds the nation that the persons in the twilight of their lives, need love, compassion and assistance.\n\nShe practices what she preaches by rolling her sleeves and personally cleaning their homes, cooking for them and sharing meals while sitting with them on a reed mat.\n\nMasiiwa Village community members help weed the farm of Gogo Anna Nyabango (74years) as part of First Lady Dr Auxillia Mnangagwas initiatives to the elderly and the vulnerable in society.\n\nWhen the First Lady arrived at the home of Gogo Felita Ngadze (102), she was welcomed by the community before seeking permission to perform chores at the homestead.\n\nThe mother of the nation joined other women in replanting maize and beans because when Gogo Ngadze planted there was no rain and some of the crops did not germinate.\n\nAs Environment Ambassador and Agric4She patron, Dr Mnangagwa planted 10 different types of fruit trees at every homestead which was cleaned.\n\nThe community members split into groups so that they could cover many houses and not leave behind some vulnerable groups.\n\nWe are grappling with the effects of climate change, but as Agritex officers you should urge communities to be ready because the rains have come, The First Lady said.\n\nAmai Mnangagwa urged the community to assist those in need, especially the elderly, child-headed families and those with disabilities.\n\nShe further encouraged agricultural extension officers to do their farming demonstrations at the homes of such people so that they benefit.\n\nThe mother of the nation distributed farming inputs to hundreds of community members, including those whose houses were visited.\n\nAmai Mnangagwa also spoke out against child marriages, stressing the importance of ensuring children remained in school to unleash their full potential.\n\nShe began her address by wishing everyone a happy new year and said life was important.\n\nMasiiwa Village community members doing laundry at Gogo Erenesi Chikapinda (72 years) homestead as part of First Lady Dr Auxillia Mnangagwas initiatives of assisting the elderly and vulnerable groups in communities Mashonaland Central.\n\nIf we have life, we then assist one another to survive. I want to thank community that has called me here today to witness what they are doing as I taught them as we assist one another in performing household chores for the elderly. I thank women including churches for the work that has been done here today. I am thankful for the rains that are allowing our crops to germinate. I encourage all women to take to the fields so that we keep hunger at bay. I am glad that we have assisted the elderly, those with disabilities and orphans and planted crops that had not germinated. Yes, the Government assists including distributing inputs but as a mother I am saying let the Government come in when we would have done something at our homestead looking at vision 2030. Climate change has transformed our rainfall patterns therefore we must conform to the weather outlook. Today I have brought inputs for hundreds of people including maize seed, vegetable combo seed, fertilizer, knapsacks and pesticides. Let us not sell these inputs. I gave you so that you get good yields. Let us plant even our traditional grains which are nutritious and health. Today I visited the home of gogo vane 102 years who does not walk with the aid of a stick and is still very active. Her secret is that she consumes our traditional food. I also encourage you to plant trees, including fruit trees at your homesteads, she said.\n\nShe warned communities against indiscriminately cutting trees and burning forests and highlighted their importance.\n\nThe mother of the nation decried that Mashonaland Central Province tops in terms of child marriages and said such a trend had to be reversed through behaviour change.\n\nMashonaland Central tops in child marriages, why are we doing this? Why dont we let the children go to school and realise their full potential to look after us in future. You need seeds to plant and if they learn, they will go to work and be able to buy you these seeds. I beg you all please let us say no to child marriages. Let us raise our children well and give them equal opportunities with the boy child, she said.\n\nThe First Lady enjoined the community to live in peace and encouraged Members of Parliament to hear the peoples concerns so that they articulate them in Parliament.\n\nTo our Chiefs, I am thankful that you are uniting families in communities and I urge you to continue doing that so that people continue living in peace, she said.\n\nGogo Ngadze (102) was over the moon.\n\nWhat has happened here is so pleasing. Since my childhood and since I got married, I had never seen such a gesture. I am so happy and thankful for what Dr Mnangagwa has done for me and her teachings which people put to heart. I wish I could fly to God and tell him that I am so happy to have received such a gift from the First Lady as lowly as I am. Amai Mnangagwa is so loving and I had never seen such love, the old woman said as she sang and danced with delight.\n\nMrs Joy Mpofu said she was grateful for the valuable lesson which the First Lady had given them.\n\nWe were taught by our mother, Dr Mnangagwa that we must assist the elderly, the disabled and orphans with their chores, washing for them, cooking for them and fetching water for them. We were told to assist the needy. Today as a community we called the First Lady so that she sees us carrying forward the work she taught us because it helps achieve their chores. Here we are at Gogo Makaraus homestead and we showed her love and performed household tasks. Some people accuse the elderly of dabbling in witchcraft and leave them wallowing in poverty as they stick to life in the city. This is not good at all because we must always tap into their wisdom, she said happily.\n\nMrs Wendy Welengai echoed similar sentiments.\n\nAgric4SHE patron, First Lady Dr Auxillia Mnangagwa, hands over maize seed to Gogo Felita Ngadze (102 years) of Masiiwa Village as part of her philanthropic initiatives to help the elderly and vulnerable groups in communities.  Pictures: Edward Zvemisha.\n\nI move about the homes of theelderly assisting them with their chores and weeding their yards after being taught by our mother to look after these vulnerable groups. Today we invited the First Lady to come and see what we are doing. We visits anambuya nana sekuru as they impart knowledge in us as the fortress of wisdom. They teach us good morals so that we grow up well and eat traditional dishes. We are thankful to the First Lady for coming here at short notice, she said.\n\nGogo Eneresi Chikapinda (72) was swept by a tide of emotion and wept.\n\nI live alone here with no one to look after me. I bore 13 children out of which nine perished, leaving four who barely look after me. I go hungry and no one helps me at all. God has remembered me today. I thank Amai Mnangagwa for what she has done to me. I have no toilet and the kitchen is sagging but the children never look at me at all. Ndanga ndisina kana sipo yekuwachisa asi nhasi ndawachirwa hembe dzangu dzese and blankets. Ndinotenda, she said in-between sobs.\n\nMrs Sabina Ndengu said she was overjoyed to have learnt from the best.\n\nBeneficiaries celebrate afterAgric4SHE patron, First Lady Dr Auxillia Mnangagwa handed over agriculture inputs that include maize seed, vegetable combo seed, fertilisers, knapsack and pesticides to the elderly and vulnerable groups in Mashonaland Central.\n\nI am so glad I have learnt from the best. What the First Lady taught us is very good and gives these elderly persons a deeper sense of belonging and they feel loved. This is something that we shall continue doing and also teach our children, she said.\n\nThis dovetailed with the views expressed by Gogo Sheila Kuseni.\n\nWhat else would anyone ask for from a human being? What the First Lady has done here is a great thing. She entered the fields with us and participated in the cleaning process which means everything she does and says comes from the heart. She is a blessed woman whose teachings we must fully embrace for a brighter future, she said with happiness written all over her face.\n\nMashonaland Central Provincial Affairs and Devolution Minister Hon Christopher Magomo praised the First Lady for her love and educative programmes.\n\nPart of the agriculture inputs which included maize seed, vegetable combo seed,fertilisers, knapsack and pesticides which were donated by Agric4SHE patron, First Lady Dr Auxillia Mnangagwa to the elderly and the vulnerablein Mashonaland Central.\n\nWe have gathered under the auspices of elderly peoples empowerment support programme. This initiative backed by the First Lady, Dr Auxillia Mnangagwa represents a significant step in recognizing and uplifting the welfare of our elderly citizens. We are thankful for the time that you have committed to come here Amai. Your excellency, we are truly honoured and humbled to host you as we begin this new year. It is an honour that we do not take for granted and we deeply appreciate your presence. Congratulations for the new year. Amai, your unwavering commitment in driving positive change in livelihoods for vulnerable groups inspires us. Your compassion for the empowerment of disadvantaged individuals in our society is unparalleled and knows no boundary. Indeed your programmes are leaving no one and no place behind as we journey towards our vision 2030. May the Almighty God continue to bless you abundantly and provide you with the resources and energy needed to reach every person in need, he said.\n\nAll the elderly whose houses were cleaned were given food and toiletry hampers, courtesy of the First Lady.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/First-Lady1-680x380.jpg",
            "description": "Tendai Rupapa-Senior Reporter THE Musiiwa Community of Madziwa, Mashonaland Central Province yesterday invited First Lady Dr Auxillia Mnangagwa to witness the cleaning of homes and execution of various chores for the elderly, including a centenarian, the disabled and orphans in line with her teachings, in a rare expression of love and compassion for vulnerable groups. […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Key projects transform societies",
            "url": "https://www.herald.co.zw/key-projects-transform-societies/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nThe Governments ambitious Vision 2030 initiative is gaining momentum, with key developments in Mashonaland East signalling a transformative shift towards national growth and sustainability.\n\nLaunched to transform Zimbabwe into an empowered upper-middle-income economy by 2030, the initiatives in infrastructure development, economic diversification, and social progress recorded in Mashonaland East serve as a testament to this vision.\n\nDuring a provincial media tour yesterday, significant projects such as the Chivhu and Muchekeranwa dams, along with the Mahusekwa District Hospital, were highlighted.\n\nInformation, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said the construction of Chivhu Dam is just the beginning, unlocking vast opportunities for economic growth.\n\nChivhu Dam represents an integration of a number of activities in order to ensure that the dam is an integral part of the economy, he said.\n\nIt develops many tributaries related to tourism, domestic and industrial water use, and irrigation, currently supporting over 70 households.\n\nThe dam is already supporting irrigation agriculture, with farmers around the dam benefiting.\n\nDr Muswere added that the dam will help ensure that the upper middle-income society is attained by 2030.\n\nHe also noted the importance of economic empowerment for local farmers, stating that irrigation infrastructure is crucial for agricultural productivity.\n\nMashonaland East Provincial Affairs and Devolution Minister, Aplonia Munzverengwi, said the dam and an accompanying water treatment plant, will resolve chronic water shortages in Chivhu.\n\nChivhu town was experiencing a shortage of water. Now it will be a thing of the past, she said, urging engineers to expedite the construction of water tanks.\n\nInformation Communication Technology, Postal and Courier Services Minister, Tatenda Mavetera, acknowledged the project as a realisation of national goals.\n\nWe thank His Excellency our President for his visionary leadership, which has benefited the people of Chikomba West, she remarked, noting the involvement of various community groups, including war veterans, women and youth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muswere-in-Mahusekwa-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter The Government’s ambitious Vision 2030 initiative is gaining momentum, with key developments in Mashonaland East signalling a transformative shift towards national growth and sustainability. Launched to transform Zimbabwe into an empowered upper-middle-income economy by 2030, the initiatives in infrastructure development, economic diversification, and social progress recorded in Mashonaland East serve as a […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Heavy rains expected this weekend",
            "url": "https://www.herald.co.zw/heavy-rains-expected-this-weekend/",
            "content": "Precious Manomano-Herald Reporter\n\nTHE Meteorological Services Department has forecasted heavy rainfall today and tomorrow, across Mashonaland, Manicaland, and Midlands provinces.\n\nIn a statement yesterday, the Met Department said the weather was expected to be partly cloudy and mild, with a chance of rain showers in Matabeleland North and Mashonaland West. As the day progressed, the rest of the country would remain partly cloudy and warm.\n\nIn light of the forecasted thunderstorms, the department urged the public to stay indoors when thunder was heard to ensure safety.\n\nZimbabwe is experiencing moist and unstable weather, leading to widespread thunderstorms and heavy rainfall.\n\nRecent rainfall data indicate significant amounts recorded in the past 24 hours, with Binga 130mm, Matopos 35mm, Kadoma 33mm, Plumtree 32mm, Gokwe 30mm, Gweru 21mm, and Chibhero 26mm.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Screenshot-2024-12-31-at-11.18.33-680x380.jpg",
            "description": "Precious Manomano-Herald Reporter THE Meteorological Services Department has forecasted heavy rainfall today and tomorrow, across Mashonaland, Manicaland, and Midlands provinces. In a statement yesterday, the Met Department said the weather was expected to be partly cloudy and mild, with a chance of rain showers in Matabeleland North and Mashonaland West. As the day progressed, the […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Former US president Carter’s death a loss to Zim",
            "url": "https://www.herald.co.zw/former-us-president-carters-death-a-loss-to-zim/",
            "content": "Africa Moyo-Deputy News Editor\n\nTHE death of former United States President Jimmy Carter is not only a loss for the US, but Zimbabwe also, as he contributed immensely to the independence of Zimbabwe, a Cabinet Minister has said.\n\nForeign Affairs and International Trade Minister Professor Amon Murwira said this yesterday when he visited the US Embassy in Harare to sign the book of condolences and pass on President Mnangagwas message.\n\nFormer President Carter died at the age of 100 on Sunday and will be buried on Thursday next week.\n\nAfter signing the book, Prof Murwira hailed President Carter as one of the greatest statesmen in the world.\n\nHis Excellency President Dr E.D. Mnangagwa passed this message to say, President Carter has passed on, and as a country, we would be the first to pass our condolence message on this great loss because we believe its not only the loss of the United States, its the loss for Zimbabwe also, and its a loss for the global community, he said.\n\nWhen it comes to Zimbabwe, President Jimmy Carter contributed a lot to the independence of Zimbabwe. At the attainment of Independence, the United States was one of the first countries to establish an embassy or diplomatic relations with Zimbabwe.\n\nYou can see where we are right now, is the United States Embassy. Its one of the most majestic buildings in Zimbabwe, especially in terms of embassies. It shows the presence of the United States in Zimbabwe.\n\nProf Murwira attributed the construction of the imposing US Embassy in Harare to the contributions of former President Carter.\n\nAnd we really take this as a great loss, not only to the people of the United States, but to the people of Zimbabwe. But at the same time, he lived a very long life, for which I think God had a purpose so that he contributes, and we enjoy his contribution to world peace.\n\nWe have written in the book of condolences to pass our condolences from the deepest of Zimbabwes hearts, said Prof Murwira.\n\nIn her remarks, US Ambassador to Zimbabwe Pamela Clermont said she was extremely honoured that Prof Murwira visited the embassy so soon after the festive period to offer his condolences in person.\n\nI know its a busy time of the year for everyone. We are obviously very sad to lose the great American, former President Jimmy Carter.\n\nHis legacy in Africa is something. I think that reminds us that deep at our core, we share the same values of democracy and human rights and working together, both of our countries can strive to fulfill the promises of our respective founding fathers. Its a good reminder that the United States and Zimbabwe share more in common than the differences that we have, and its important that we use that as a base to work going forward, said Ambassador Clermont.\n\nWriting on his X handle, Acting Chief Secretary to the President and Cabinet Mr George Charamba also said President Carter contributed significantly to Zimbabwes independence.\n\nHe said President Carter was in office during the Lancaster House talks of 1979, which ended conflict in Zimbabwe, paving the way for the March 1980 general elections.\n\nFor two weeks, the talks seemed on the verge of collapsing over the issue of land primarily, and marginally over the distribution of assembly points across the country. Upon realising the talks were about to collapse, and that resumption of the liberation war would have meant total humiliating defeat for white Rhodesia, Carter then intervened to break the impasse by committing the United States to contributing towards land reforms.\n\nHe set two provisos: one, that the Patriotic Front would not disclose that this American commitment was meant to buy land from British landlords in Zimbabwe; American taxpayers would not want to hear that American money would go towards British landowners in Zimbabwe. Two, the PF would have to fly to Brussels to get the then EEC to chip in so a bigger budget would make the transaction feasible.\n\nIndeed, late President (Robert) Mugabe and late VP (Dr Joshua) Nkomo flew to Brussels that same weekend the offer was made and secured financial commitment from EEC. Before long, Jimmy Carter lost to the right-wing Ronald Reagan who repudiated the commitment which Carter had made towards the resolution of the Zimbabwean land question, said MrCharamba.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Murwira-at-US-Embassy-680x380.jpg",
            "description": "Africa Moyo-Deputy News Editor THE death of former United States President Jimmy Carter is not only a loss for the US, but Zimbabwe also, as he contributed immensely to the independence of Zimbabwe, a Cabinet Minister has said. Foreign Affairs and International Trade Minister Professor Amon Murwira said this yesterday when he visited the US […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Boy (7) survives 5 days in lion-inhabited game park",
            "url": "https://www.herald.co.zw/boy-7-survives-5-days-in-lion-inhabited-game-park/",
            "content": "Conrad Mupesa-Mashonaland West Bureau\n\nThe story of Tinotenda Pudu, a seven-year-old boy from Chief Nebiris Village South of Kariba Dam, lost in Matusadonna National Park shows the exceptional skills and dedication of the ZimParks rangers who managed to track him down despite the rains that had all but obliterated his tracks and the exceptional good sense and survival skills of the little boy who managed to find shelter on a rock promontory.\n\nOn December 27 last year, Tino, as he is affectionately known, vanished into the vast game park, a place revered and feared in equal measure with local communities seeing it as sacred to Nyaminyami, the river god.\n\nFor centuries, the park has been both a sanctuary for wildlife and a web for those who dare to wander too deep.\n\nMany who enter are never seen again, swallowed by the dense thickets and the predators.\n\nBut Tinos story defies the odds.\n\nAfter five harrowing days, the boy emerged from this lion-infested wilderness not only alive, but untouched by harm.\n\nThe details of his survival are both humbling and awe-inspiring.\n\nAlone in a wilderness teeming with lions, cheetahs, elephants, and venomous snakes, Tino displayed an instinct and resilience that belied his tender years.\n\nHe foraged for wild fruits, dug small holes near the riverbanks to drink from the earths hidden waters, and found refuge on rocky outcrops, safe from prowling predators.\n\nThe land, it seems, cradled him as if it recognised one of its own.\n\nHis discovery, 49 kilometres from his village, was no small feat.\n\nThe search party, comprising Zimbabwe Parks and Wildlife Management Authority (ZimParks) rangers, local villagers, and the Zimbabwe Republic Police, battled relentless rains that washed away his footprints, making the task seem insurmountable.\n\nYet, they pressed on, guided by determination. On Christmas Eve, their efforts bore fruit when they found Tino in the Sakata Valley area of Matusadonha National Park.\n\nWeak but alive, he was carried back to his family, a living testament to human endurance.\n\nThe local community, led by Chief Nebiri, performed traditional rituals, beating drums day and night in an attempt to call Tino back from the wilderness.\n\nThe drums, they believed, would guide his spirit home.\n\nWhile their efforts seemed in vain at first, the boys safe return has only deepened their faith in the sacredness of the land and the benevolence of its guardians.\n\nChief Nebiri, speaking with a mixture of solemnity and gratitude, acknowledged the parks otherworldly nature.\n\nThis is not the first time someone has wandered into the park and disappeared, he said.\n\nBut Tinos return is a blessing, a sign that the gods were watching over him.\n\nHe commended the search team, whose tireless efforts bridged the human and spiritual realms, bringing the boy back to the arms of his family.\n\nKariba district development coordinator, Mr Desmond Anele Gumbochuma, also reflected on the sacredness of Matusadonha Game Park.\n\nThis park is not just a home to wildlife. It is a land of mysteries, a place where the line between the natural and the supernatural blurs, he said.\n\nHe urged the community to respect its boundaries, warning of the dangers it harbours, not just from predators but from forces beyond human comprehension.\n\nZimParks spokesperson, Mr Tinashe Farawo, detailed the challenges faced during the operation.\n\nThe heavy rains made it difficult to track his footprints, but our team persisted. Finding him alive in such conditions is a testament to both the skill of our rangers and the resilience of the human spirit, he said.\n\nHe marvelled at how the boy survived in one of Africas harshest terrains, a park spanning over 1,470 square kilometres and home to an estimated 40 lions, one of the densest lion populations on the continent.\n\nFollowing his rescue, Tino was taken to a local clinic for preliminary examinations before being transferred to Siakobvu Hospital for further care. Physically, he bore no signs of harm.\n\nFor now, Tinos story stands as a beacon of hope and wondera reminder that even in the darkest, most treacherous of places, the light of the human spirit can endure.\n\nIt is a tale that transcends the ordinary, touching the realms of myth and legend, and leaving all who hear it with a profound sense of awe. Whether his survival was a stroke of luck, the result of sheer determination, or the work of divine intervention, one thing is certain, Tino Pudu is no ordinary boy, and Matusadonha is no ordinary place.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Tinotenda-Pudu-680x380.jpg",
            "description": "Conrad Mupesa-Mashonaland West Bureau The story of Tinotenda Pudu, a seven-year-old boy from Chief Nebiri’s Village South of Kariba Dam, lost in Matusadonna National Park shows the exceptional skills and dedication of the ZimParks rangers who managed to track him down despite the rains that had all but obliterated his tracks and the exceptional good […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        },
        {
            "title": "Editorial Comment: Rare Boxing Day Test Series boon for ZC, Chevrons",
            "url": "https://www.herald.co.zw/editorial-comment-rare-boxing-day-test-series-boon-for-zc-chevrons/",
            "content": "THE Zimbabwe senior mens cricket team have begun the 2025 calendar year on a busy note, in what promises to be an exciting season for the games enthusiasts, players, coaches and administrators.\n\nThe Chevrons could not have wished for any better end to 2024 and start to the new year than staging the format that defines global cricket  the Test  as they featured in a drawn series against Afghanistan at Queens Sports Club in Bulawayo.\n\nAfghanistans on-going multi-format tour concludes in Bulawayo this weekend.\n\nThe significance of this tour was highlighted by the historic Boxing Day and New Year Test cricket fixtures, which provided a rare treat to the domestic cricket aficionados.\n\nPrior to the two-match Test series, Zimbabwe and Afghanistan had also engaged in three T20 Internationals and as many One Day Internationals (ODIs).\n\nIt is not every day that Zimbabwe get to have a chance to play so much cricket at one go, let alone Test cricket and/or full tours.\n\nDespite the overall disappointment in the white ball series which the Chevrons lost, there was something to cheer about when the Boxing Day Test began in Bulawayo last week.\n\nThe Boxing Day Test was the first engagement in this format for the Chevrons in over 17 months.\n\nCrucially, this was also only the second time that Zimbabwes Chevrons were playing a home Test on Boxing Day, since 1996 when they last hosted England in Harare.\n\nBoxing Day Tests have become a tradition among the worlds top Test nations.\n\nZimbabwe had only hosted just a single Boxing Day Test, when they faced England 28 years ago in a drawn match badly hit by rain at Harare Sports Club.\n\nSince then, Zimbabwes only other involvement in a Boxing Day Test has been away from home, against New Zealand in Wellington in 2000 and when they played South Africa in the inaugural pink-ball, day-night Test at Port Elizabeth in 2017.\n\nThey also took on Sri Lanka in a Test match that started on 27 December 2001 in Colombo.\n\nThe Zimbabwe versus Afghanistan duel lived to the pre-match hype as the fans got full value for their money despite the intermittent rain disruptions.\n\nSeveral records were broken by both teams who put up excellent performances in this drawn match.\n\nZimbabwes first innings score of 586 broke their own previous scoring record in Test.\n\nThe Chevrons eclipsed their previous record of 563/9 which they had made against the West Indies in 2001.\n\nWe believe this commendable performance has given captain Craig Ervine and his Chevrons a platform to build on as they just now need to keep the momentum.\n\nLack of consistency has on many occasions been the Chevrons biggest undoing.\n\nHowever, their showing at Queens Sports Club won them the hearts of more neutrals apart from their traditional fans.\n\nTo add to the excitement, this was by far not a one-sided game, as fans had somewhat become accustomed to with the Chevrons often being on the receiving end.\n\nAfghanistan too made the same record with their colossal innings of 699 all out.\n\nThey broke their previous scoring record of 545/4 which they had also made against Zimbabwe in 2021.\n\nThat the match drew decent crowds to Queens Sports Club, was a strong testament that Test cricket is still alive after all.\n\nIt is unfortunate finances seem to stifle Zimbabwes ambitions to play more of these five-day games.\n\nBut judging by the interest the Boxing Day Test garnered, Zimbabwe Cricket should feel duty-bound to arrange more bilateral fixtures in the future.\n\nUnlike last year, the 2025 calendar looks promising, though.\n\nZimbabwe, are, next month expected to host Ireland for a full tour before the outward tours of Bangladesh and England where they have a scheduled once-off Test in May.\n\nThis will be followed by South Africas tour and a tri-angular series here in Zimbabwe.\n\nNew Zealand, Sri Lanka and Afghanistan are also scheduled to come to Zimbabwe before the end of the year.\n\nThis is what the Chevrons need to improve their quality of play  more games!\n\nZimbabwes poor results in recent years have been blamed on limited game time.\n\nBut there were encouraging performances by the Chevrons in the two Test matches against Afghanistan.\n\nYoung all-rounder Brian Bennett put up one of his best performances ever with both bat and ball.\n\nBennett took an astonishing 5/95 which he then followed up with 110 runs with the bat to help Zimbabwe put 586 on the board.\n\nThere were also hundreds for Sean Williams and skipper Craig Ervine and a 50 on debut by Ben Curran.\n\nThe bowlers then stole the show in the second match  the first New Year Test fixture for Zimbabwe! After a lengthy rain delay, they bowled out the visitors for 157 runs before close of play on Day One.\n\nThat was a huge improvement by the bowlers.\n\nIt shows that if these players can play cricket regularly, there are good prospects the Chevrons could move out of stagnation.\n\nThe bold decision by Zimbabwe Cricket to infuse new faces such as Newman Nyamhuri, Dion Myers, Takudzwanashe Kaitano, Curran and Bennett must also be commended.\n\nIt has breathed fresh hope for Zimbabwe.\n\nThe transition is well in motion with other players waiting in the wings, the likes of middle-order batter Jonathan Campbell, wicketkeeper-batters Tadiwanashe Marumani and Nyasha Mayavo, as well as pace bowlers Trevor Gwandu and Takudzwa Chataira.\n\nThis is progressive for a team whose core group of players is ageing.\n\nConsidering that the likes of Sean Williams, Sikandar Raza and skipper Ervine are not likely to be around for the next two to five years, ZCs talent conveyor belt now needs to be more productive than before.\n\nThe tour of Afghanistan, who are also in transition, should help set the tone for a joyous 2025 and beyond.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Zim-vs-Afghanistan-Test-680x380.jpg",
            "description": "THE Zimbabwe senior men’s cricket team have begun the 2025 calendar year on a busy note, in what promises to be an exciting season for the game’s enthusiasts, players, coaches and administrators. The Chevrons could not have wished for any better end to 2024 and start to the new year than staging the format that […]",
            "time": "06:37",
            "date": "04 Jan 2025"
        }
    ]
}