{
    "news": [
        {
            "title": "Air Ambulance rushes to rescue injured miner in Kadoma",
            "url": "https://www.herald.co.zw/air-ambulance-rushes-to-rescue-injured-miner-in-kadoma/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nA Government-sponsored air ambulance has arrived at Kadoma General Hospital to evacuate a miner who suffered severe injuries when a mine shaft collapsed.\n\nThe incident occurred when one side of the mine caved in, hitting the miners stomach and causing severe injuries.\n\nThe air ambulance, which departed from Charles Prince Airport at 2:34 pm, arrived in Kadoma at 3:11 pm, just 37 minutes later.\n\nOn board the aircraft are two medical practitioners and two captains who are now preparing to transport the injured miner to Sally Mugabe Referral Hospital for further treatment.\n\nMeanwhile, another air ambulance from the same fleet was dispatched to Chegutu, where it evacuated a woman in labour and transported her to Chinhoyi Hospital for medical attention.\n\nThe air ambulance service is one of the Second Republics milestones.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-21-680x380.png",
            "description": "Trust Freddy Herald Correspondent A Government-sponsored air ambulance has arrived at Kadoma General Hospital to evacuate a miner who suffered severe injuries when a mine shaft collapsed.   The incident occurred when one side of the mine caved in, hitting the miner’s stomach and causing severe injuries. The air ambulance, which departed from Charles Prince […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Man masquerades as Zanu PF Central Committee, gets away with US$10 000",
            "url": "https://www.herald.co.zw/man-masquerades-as-zanu-pf-central-committee-gets-away-with-us10-000/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA suspected fraudster who masqueraded as a Zanu PF Central Committee member has appeared in court on allegations of defrauding a businessman of US$10 000 under the pretext that he could facilitate the release of his goods that had been confiscated by the Zimbabwe Revenue Authority.\n\nWilbert Nyarugwe (44) was facing fraud charges when he appeared before Harare magistrate Ms Tilda Mazhande.\n\nHe was remanded in custody to Thursday for bail application.\n\nThe complainant is Mr Douglas Muraza.\n\nIt is alleged that sometime in September last year, Mr Muraza and his wife were introduced to Nyarugwe by their friend, Kelvin Maponga.\n\nNyarungwe told the couple that he was a Zanu PF Central Committee member and referred to himself as Honourable Nyarugwe.\n\nOn October 3 last year, Mr Murazas bus was impounded by Zimra in Masvingo for carrying smuggled goods.\n\nThe court heard that Nyarugwe heard about it and offered to facilitate the release of the bus and the goods.\n\nNyarugwe claimed to have good relations with Zimra Commissioner General, Mrs Regina Chinamasa. He said he would engage her so that she could assist in the matter.\n\nOn October 6, Nyarugwe told Mr Muraza that Mrs Chinamasa had requested for US$ 10 000 to release the bus and goods.\n\nMr Muraza gave his wife the money to hand over to Nyarugwe.\n\nA few days later, Nyarugwe asked Mr Muraza to go with him to Zimras offices in Masvingo to follow up on the release of the bus and goods.\n\nThe court heard that Nyarungwe introduced himself as a Zanu PF Central Committee member to Mr William Murashwa Gadzikwa, Zimra Masvingos Technical Services Manager. He informed him that he had come to check on the seized goods.\n\nNyarugwe was advised that they were still waiting for some report before they could compile the release terms.\n\nOn October 24 , Mr Muraza received an email from Zimra stating that he was supposed to pay ZWG 893,529.59 duty, a fine equivalent to the duty, interest and storage fees.\n\nMr Muraza immediately contacted Nyarugwe over the issue. The court heard that Nyarugwe claimed that he had given Mr Murazas money to Mrs Chinamasa but promised to reimburse it.\n\nNyarugwe then became evasive and has not reimbursed the money.\n\nInvestigations revealed that Nyarugwe was not in any way connected to the Zimra Commissioner General and does not know her personally.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-20-680x380.png",
            "description": "Prosper Dembedza Herald Correspondent A suspected fraudster who masqueraded as a Zanu PF Central Committee member has appeared in court on allegations of defrauding a businessman of US$10 000 under the pretext that he could facilitate the release of his goods that had been confiscated by the Zimbabwe Revenue Authority. Wilbert Nyarugwe (44) was facing […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Dr Moyo appointed MMCZ general manager",
            "url": "https://www.herald.co.zw/dr-moyo-appointed-mmcz-general-manager/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Minerals Marketing Corporation of Zimbabwe (MMCZ) has appointed Dr Nomusa Jane Moyo as its new general manager.\n\nThe appointment is set to redefine the leadership landscape in Zimbabwes mining sector.\n\nDr Moyo, who has been acting general manager since July 2023, brings extensive experience and a proven track record of success to the role.\n\nUnder her interim leadership in 2024, MMCZ achieved significant milestones, including a 21 percent surge in mineral sales, with 3,9 million tonnes sold, compared to 3,2 million the previous year.\n\nHer strategic efforts also saw the expansion of export markets to new destinations such as Australia, China, Colombia, Burundi and India.\n\nShe led initiatives to curb mineral leakages by equipping local laboratories with state-of-the-art technology and promoted value addition and beneficiation through the establishment of a gemstone cutting and polishing training centre at the Zimbabwe School of Mines.\n\nDr Moyos career spans 24 years in public entities, including eight years with the Zimbabwe Revenue Authority, one year with the Grain Marketing Board, and over 14 years with MMCZ, where she joined in December 2009.\n\nHer impressive qualifications include a Doctorate in Laws specialising in corporate governance, Masters and Bachelor of Laws, a BSc Honours in Economics and Full CIS certification.\n\nShe is also a member of the Law Society of Zimbabwe and the Chartered Governance and Accountancy Institute of Zimbabwe.\n\nThe MMCZ board, led by chairman Mr Jemister Chininga, expressed confidence in Dr Moyos ability to lead the corporation towards continued growth and success.\n\nHer appointment is seen as a strategic move to maximise returns for stakeholders, foster partnerships and strengthen Zimbabwes position in the global minerals market.\n\nDr Moyos leadership marks the beginning of a transformative era for MMCZ, with her expertise expected to drive innovation, enhance operational efficiency and unlock new opportunities in the minerals sector.\n\nAs the exclusive agent for marketing and selling all minerals produced in Zimbabwe, except gold and silver, MMCZ plays a critical role in the countrys economic development.\n\nWith Dr Moyo at the helm, the corporation is poised for a dynamic and prosperous future.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/08/Minerals-Marketing-Corporation-of-Zimbabwe.jpg",
            "description": "Ivan Zhakata Herald Correspondent The Minerals Marketing Corporation of Zimbabwe (MMCZ) has appointed Dr Nomusa Jane Moyo as its new general manager. The appointment is set to redefine the leadership landscape in Zimbabwe’s mining sector. Dr Moyo, who has been acting general manager since July 2023, brings extensive experience and a proven track record of […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Corruption is betraying liberation ethos: Acting President Chiwenga",
            "url": "https://www.herald.co.zw/corruption-is-betraying-liberation-ethos-acting-president-chiwenga/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nActing President Dr Constantino Chiwenga has condemned corruption and unethical business practices, asserting that such actions threaten the foundational ideals of Zimbabwes liberation struggle.\n\nDr Chiwenga was speaking while presiding over the burial of national heroes Major General (Rtd) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura at the National Heroes Acre in Harare this morning.\n\nVice President Kembo Mohadi and other senior Government officials also attended the burial of the three national heroes.\n\nUnder the Second Republic, Zimbabwe is working towards achieving an upper-middle income economy by 2030, with several capital and infrastructure projects taking shape or already completed.\n\nIt is through the selfless sacrifices and dedication of the late three gallant sons of the soil that we are laying to rest today, as well as many other departed and living cadres, that Zimbabwe continues to enjoy its sovereignty, said the Dr Chiwenga.\n\nWe can only realise our vision of attaining an empowered and prosperous upper middle-income society by guarding against all forms of actions that undermine the national interest.\n\nAt the forefront is corruption and all forms of related unethical and selfish conduct in small, medium or large economic units.\n\nAny shady dealing and acts of deceit undermine what these gallant national heroes sacrificed for, said the Acting President.\n\nThe triple heroes burial was the third ever in Zimbabwes history.\n\nSuch an occasion first took place on January 26, 2021, when Lieutenant General (Rtd) Dr Sibusiso Busi Moyo, Dr Joel Biggie Matiza, and Major General (Rtd) Paradzai Zimondi were laid to rest on the same day.\n\nThe second occasion was on April 29 last year when Cde Nash Nyasha Dzimiri, Brigadier General Shadreck Vezha and Cde Tsitsi Grace Jadagu were buried at the national shrine.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/vice-1-680x380.jpg",
            "description": "Mukudzei Chingwere Herald Reporter Acting President Dr Constantino Chiwenga has condemned corruption and unethical business practices, asserting that such actions threaten the foundational ideals of Zimbabwe’s liberation struggle. Dr Chiwenga was speaking while presiding over the burial of national heroes Major General (Rtd) Solomon Siziba, Cde Chenhamo ‘Chen’ Chakezha Chimutengwende and Ambassador John Shumba Mvundura […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "NEW: EMA blocks Greystone housing development on wetlands",
            "url": "https://www.herald.co.zw/new-ema-blocks-greystone-housing-development-on-wetlands/",
            "content": "Online Reporter\n\nTHE Environmental Management Agency (EMA) has rejected a proposed housing project in Greystone Park, Harare, as the area is a wetland.\n\nIn a statement on Tuesday, EMA said the necessary environmental licenses were not obtained before development was initiated.\n\nNotices have since been served to occupants and an Environmental Protection Order (EPO) has been issued to cease all activities.\n\nThe Environmental Management Agency has rejected the implementation of a housing development project in Greystone Park, Harare, because the project is being implemented in a wetland area, said EMA spokesperson, Ms Amkela Sidange.\n\nThe project is likely to result in irreversible ecological impacts, with a high likelihood of significant socio-economic consequences.\n\nEMA urged local authorities and developers to exercise caution in land allocation and adhere to the guidelines provided for in the National Wetlands Masterplan (2021), which identifies and maps wetlands across Zimbabwe.\n\nMs Sidange said at the end of 2024, approximately 258 780 hectares of wetlands had been mapped and protected.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/EMA.jpg",
            "description": "Online Reporter THE Environmental Management Agency (EMA) has rejected a proposed housing project in Greystone Park, Harare, as the area is a wetland. In a statement on Tuesday, EMA said the necessary environmental licenses were not obtained before development was initiated. Notices have since been served to occupants and an Environmental Protection Order (EPO) has […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Palestinian envoy condemns Israeli aggression, calls for global action",
            "url": "https://www.herald.co.zw/palestinian-envoy-condemns-israeli-aggression-calls-for-global-action/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nAmbassador of the State of Palestine to Zimbabwe Dr Tamer Almassri has denounced what he described as brutal Israeli aggression against Palestinians in the West Bank.\n\nIn a statement, Ambassador Almassri said the Israeli military intensified measures, including the installation of 898 checkpoints, 16 of which are newly added iron gates, effectively paralysing Palestinian movement and fragmenting communities.\n\nThis is a systematic denial of Palestinian rights, said Ambassador Almassri, adding that Israeli Prime Minister Benjamin Netanyahus actions were designed to shore up his faltering coalition government.\n\nThese measures are part of a deliberate attempt to impose apartheid, crush Palestinian resilience, and distract the international community from Israels recent crimes in Gaza.\n\nThe Ambassador pointed to the escalation of violence in Jenin, where Israeli forces reportedly carried out heavy military strikes using drones and airpower, leading to the tragic deaths of 10 Palestinians, 40 injuries and the destruction of infrastructure, including roads surrounding Ibn Sina Hospital.\n\nThe international community cannot remain silent in the face of these atrocities, Ambassador Almassri said.\n\nHe described the actions as collective punishment that flouts international law.\n\nWe call for immediate and effective sanctions on Israel to deter further aggression and to hold it accountable for its crimes against humanity.\n\nHe also reiterated Palestines steadfast commitment to achieving self-determination and an independent state, with Jerusalem as its capital.\n\nThe Palestinian people will never relinquish their inalienable rights, the Ambassador declared.\n\nThe plea for global intervention comes amid growing international scrutiny of Israeli policies in the occupied territories. Human rights groups have echoed similar concerns, labelling the checkpoints and iron gates as tools to enforce apartheid conditions on Palestinians.\n\nAs tension continues to rise, the Palestinian leadership is urging the international community to take decisive action to end the suffering and ensure justice for the Palestinian people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/b1551032-c00b-4828-aa7d-9b702338e385-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Ambassador of the State of Palestine to Zimbabwe Dr Tamer Almassri has denounced what he described as “brutal Israeli aggression” against Palestinians in the West Bank. In a statement, Ambassador Almassri said the Israeli military intensified measures, including the installation of 898 checkpoints, 16 of which are newly added iron gates, […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Local equity markets show mixed performance amid global challenges",
            "url": "https://www.herald.co.zw/local-equity-markets-show-mixed-performance-amid-global-challenges/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/unnamed-680x380.jpg",
            "description": "Tapiwanashe Mangwiro Tuesday trading on Zimbabwe’s stock exchanges reflected a blend of gains and losses, highlighting the complex dynamics shaping investor sentiment. On the Zimbabwe Stock Exchange (ZSE), the All Share Index dropped 0,84 percent to 204.80, while the Top 10 Index saw a smaller decline of 0,28 percent, closing at 204.55. Market capitalisation stood […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Copper cable thief electrocuted in Kuwadzana",
            "url": "https://www.herald.co.zw/copper-cable-thief-electrocuted-in-kuwadzana/",
            "content": "Crime Reporter\n\nA suspected copper cable thief was electrocuted on Monday after tampering with a Zesa substation in Kuwadzana, Harare.\n\nA bolt cutter and a copper cable that had been tampered with were recovered at the scene.\n\nNational police spokesperson Commissioner Paul Nyathi said, Police in Harare are investigating circumstances surrounding a case of electrocution in which a yet-to-be-identified man was found dead near a Zesa substation in Kuwadzana Phase 3, Harare, on January 20.\n\nThe victim was wearing a black jacket, a grey striped t-shirt, blue track bottom, and black sports shoes with a white sole.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter A suspected copper cable thief was electrocuted on Monday after tampering with a Zesa substation in Kuwadzana, Harare. A bolt cutter and a copper cable that had been tampered with were recovered at the scene. National police spokesperson Commissioner Paul Nyathi said, “Police in Harare are investigating circumstances surrounding a case of electrocution […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "OK Zimbabwe warns against job offer scam",
            "url": "https://www.herald.co.zw/ok-zimbabwe-warns-against-job-offer-scam/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nLeading retail chain OK Zimbabwe Limited has warned the public about a fraudulent job advertisement that is circulating on social media.\n\nThe advert falsely claims to offer employment opportunities at the company.\n\nIn a statement, OK Zimbabwe distanced itself from the fake communication and urged the public to remain cautious.\n\nThe company said the fraudulent message did not originate from them and advised job seekers to verify information before responding to such offers.\n\nThis information is not legitimate and did not originate from OK Zimbabwe Limited. We categorically distance ourselves from this communication in its entirety, reads the statement.\n\nOK Zimbabwe reassured the public that it remains committed to fair and transparent hiring practices.\n\nThe company said all legitimate job openings are advertised through its official platforms, including its website and LinkedIn page.\n\nThe retail giant also encouraged job seekers to verify any suspicious job offers and report fraudulent activities directly to the company.\n\nAs an equal opportunity employer, we are committed to ensuring that our recruitment processes are conducted with integrity and fairness, reads the statement.\n\nThis comes amid an increase in fraudsters who are exploiting social media to spread false messages and prey on vulnerable job seekers.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/download-2.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Leading retail chain OK Zimbabwe Limited has warned the public about a fraudulent job advertisement that is circulating on social media. The advert falsely claims to offer employment opportunities at the company. In a statement, OK Zimbabwe distanced itself from the fake communication and urged the public to remain cautious. The […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Man killed over US$10",
            "url": "https://www.herald.co.zw/man-killed-over-us10/",
            "content": "Crime Reporter\n\nA 37-year-old man died in Mazowe after he was pushed into a disused mineshaft following an argument over US$10.\n\nThe incident occurred at Jumbo Mine on Monday.\n\nPolice have since arrested the suspect in connection with the case.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Mazowe arrested Rynos Makwembere aged 34 in connection with a case of murder which occurred on January 20, 2025, at SOS Claim, Jumbo Mine, he said.\n\nThe victim, Claude Nyamatope aged 37 fell into a disused mineshaft and died on the spot after being pushed by the suspect following a misunderstanding over US$10.\n\nThe duo had received payment for constructing a shed at the mine, but the suspect allegedly withheld the victims share.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/killed.jpg",
            "description": "Crime Reporter A 37-year-old man died in Mazowe after he was pushed into a disused mineshaft following an argument over US$10. The incident occurred at Jumbo Mine on Monday. Police have since arrested the suspect in connection with the case. National police spokesperson Commissioner Paul Nyathi confirmed the incident. “Police in Mazowe arrested Rynos Makwembere […]",
            "time": "18:33",
            "date": "22 Jan 2025"
        }
    ]
}