{
    "news": [
        {
            "title": "Relief for Bosso as Fifa lifts transfer ban",
            "url": "https://www.herald.co.zw/relief-for-bosso-as-fifa-lifts-transfer-ban/",
            "content": "Innocent Kurira\n\nHIGHLANDERS has announced that Fifa has lifted their transfer ban, meaning the club can now register new players for the season.The club shared the news via a statement on Tuesday evening.\n\nWe are delighted to announce that the FIFA ban has been lifted, thanks to the efforts of a dedicated FIFA team as everything has been resolved. Once again, a special thank you to Sir Wicknell Chivayo for facilitating the payment. With this hurdle cleared, we can now register our new signings. They could be part of our squad for the upcoming match against Green Fuel, reads the statement.\n\nThe ban resulted from money owed to former coaches Baltemar Brito and Antonio Torres, which was paid by businessman Chivayo.\n\nCoach Kelvin Kaindu has already identified potential reinforcements, including defender Malvern Hativagoni, striker Never Rauzhi, winger Tendai Muvuti, and midfielders Hubert Ncube and Mafious Chiweta.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/Highlanders-Bosso.jpg",
            "description": "HIGHLANDERS has announced that Fifa has lifted their transfer ban, meaning the club can now register new players for the season.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Four districts avail land for Munhumutapa Housing Scheme in Mash West",
            "url": "https://www.herald.co.zw/four-districts-avail-land-for-munhumutapa-housing-scheme-in-mash-west/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nCONTRACTORS are now ready to develop land earmarked for the Munhumutapa National Housing Scheme in Mashonaland Wests four districts.\n\nBriefing Zanu PFs national youth affairs secretary and Youth Minister Cde Tino Machakaire in Chinhoyi last Saturday, Zanu PF provincial chairman, Cde Tapiwa Masenda said development on the land where thousands of youths will benefit is now in motion.\n\nCde Machakaire was in Chinhoyi to launch the Munhumutapa 10-hectare plots scheme which saw a total of 870 youths in Mashonaland West and Harare Provinces being allocated land.\n\nThe four districts where residential stands will be availed to youths for free include Makonde, Hurungwe, Chegutu and Sanyati.\n\nCde Masenda lauded President Mnangagwa for introducing youth-centred policies aimed at empowering them.\n\nLevels and Ndunge Yut at the meeting where they also entertained the crowd.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Minister-Machakaire-being-welcomed-by-provincial-party-leadership-in-Chinhoyi-680x380.jpeg",
            "description": "CONTRACTORS are now ready to develop land earmarked for the Munhumutapa National Housing Scheme in Mashonaland West's four districts.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Sadc to hold a virtual Extraordinary Summit of Heads of State and Government",
            "url": "https://www.herald.co.zw/sadc-to-hold-a-virtual-extraordinary-summit-of-heads-of-state-and-government/",
            "content": "Richard Muponde\n\nZimpapers Politics Hub\n\nTHE Southern African Development Community (Sadc) will hold a virtual Extraordinary Summit of Heads of State and Government on Thursday to discuss the security situation in DRC.\n\nSadc chairperson President Mnangagwa will chair the Summit.\n\nIn a Press release, the Sadc Head of Communication and Public Relations, Ms Barbara Lopi said the Summit will receive updates on the latest security situation in the DRC.\n\nIt will deliberate on the recommendation of the Extraordinary Sadc Organ Troika Summit which was held on March 6, 2025. The Sadc Summit is responsible for setting the overall policy direction and controlling the functions of the community, making it the primary policy-making institution of the bloc, said Ms Lopi\n\nThe virtual Extraordinary Summit of the Organ Troika was chaired by Tanzanian President Samia Suluhu Hassan, who is the chairperson of the Troika on Politics, Defence and Security.\n\nThe Summit emphasised the importance of regional solidarity and collective action to support the DRC.\n\nIt brought together key regional leaders, including President Lazarus McCarthy Chakwera of Malawi, the incoming Troika chairperson, President Hakainde Hichilema of Zambia, the outgoing Troika chairperson, President Cyril Ramaphosa of South Africa, part of the Sadc Mission in the DRC (SAMIDRC), and DRC President Flix Antoine Tshisekedi.\n\nThe Summit focused on reviewing the mandate of the SAMIDRC following the recent intensification of violence in the eastern parts of DRC.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/SADC-States.jpg",
            "description": "THE Southern African Development Community (Sadc) will hold a virtual Extraordinary Summit of Heads of State and Government on Thursday to discuss the security situation in DRC.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Foreign buses must stay in their lane: PAZ",
            "url": "https://www.herald.co.zw/foreign-buses-must-stay-in-their-lane-paz/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Passenger Association of Zimbabwe (PAZ) has raised concerns over foreign cross-border buses that are operating illegally on local routes.\n\nThe association has also called for stricter enforcement to protect the domestic transport sector.\n\nIn a statement, PAZ national coordinator, Mr Tafadzwa Goliati said the influx of unregulated foreign buses is creating unfair competition for local operators and compromising passenger safety.\n\nWe are not against regional transport, but foreign buses must stick to their designated routes, he said.\n\nAllowing them to operate freely on local routes without proper regulation is a direct threat to our transport industry.\n\nMr Goliati said local transport businesses are struggling due to the presence of foreign operators who may not be subjected to the same tax obligations, licencing requirements or safety inspections.\n\nIf we allow foreign buses to dominate local routes, we are not only endangering local peoples livelihoods but also compromising road safety standards, he said.\n\nMr Goliati urged law enforcement agencies to step up efforts to ensure that foreign bus companies comply with regulations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/a-680x380.jpg",
            "description": "The Passenger Association of Zimbabwe (PAZ) has raised concerns over foreign cross-border buses that are operating illegally on local routes.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Eyewitness account: Chipinge flooding came in gradually",
            "url": "https://www.herald.co.zw/eyewitness-account-chipinge-flooding-came-in-gradually/",
            "content": "Ray Bande\n\nManicaland Bureau\n\nFollowing the Bandama Farm dam collapse in Chipinge on Sunday and the confirmation that five people lost their lives in the tragedy, while two others are still missing, an eye witness has revealed how events unfolded on the fateful day.\n\nA 70-year old farm security officer, Mr Samson Masirande: On Sunday morning at around 8am I noticed some water flowing along the Dandoni River. The quantities were nothing to worry about and l wondered why the water was so dirty.\n\nI thought some youngsters were playing upstream. I went upstream to find out why the water was that dirty but found nothing.\n\nAt around midday, the water had increased to knee level and it later reached waist level. I then went to find out upstream again. This is when l started hearing a loud sound like that of a helicopter.\n\nThat is when I tried chasing away some children that were playing along the stream but instead of listening to my warnings, they scolded me.\n\nWhen the powerful wave came, it came with uprooted trees and logs. By that time the dam had cracked and we could only watch helplessly as the water was sweeping away everything on its way.\n\nLands, Agriculture, Fisheries, Water and Rural Development Deputy Minister Vangelis Haritatos and his Local Government, Public Works and National Housing counterpart, Engineer Benjamin Kabikira are leading a delegation that has visited the area to assess the damages caused by the dam water.\n\nThey are also mapping out modalities for Government intervention and consoling bereaved families.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/b9ca691a-f7c9-4852-976c-03533116ef1b-680x380.jpeg",
            "description": "Following the Bandama Farm dam collapse in Chipinge on Sunday and the confirmation that five people lost their lives in the tragedy, while two others are still missing, an eye witness has revealed how events unfolded on the fateful day.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Chipinge dam collapse: Death toll rises to five",
            "url": "https://www.herald.co.zw/chipinge-dam-collapse-death-toll-rises-to-five/",
            "content": "Ray Bande\n\nManicaland Bureau\n\nA sombre atmosphere is engulfing the Chivhunze Village in Chipinge where five people have now been confirmed dead after the Bandama Farm dam collapsed on Sunday and swept away some villagers.\n\nTwo others are still missing.\n\nThe rescue mission is working round the clock to locate the missing people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/6f56810f-959a-4326-af6b-0682d0980150-680x380.jpeg",
            "description": "A sombre atmosphere is engulfing the Chivhunze Village in Chipinge where five people have now been confirmed dead after the Bandama Farm dam collapsed on Sunday and swept away some villagers.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "New Commander takes over at 4 Infantry Brigade",
            "url": "https://www.herald.co.zw/new-commander-takes-over-at-4-infantry-brigade/",
            "content": "George Maponga in Masvingo\n\nBrigadier General Oscar Tshuma is the new commander of the 4 Infantry Brigade in Masvingo Province.\n\nBrigadier General Tshuma took over command from Brigadier General Cephas Gurira during a ceremony held at the Vitalis Musungwa Gava Barracks Brigade headquarters in Masvingo today.\n\nArmy commander Lieutenant General Anslem Sanyatwe was the chief witnessing officer at the colourful ceremony.\n\nOutgoing 4 Infantry Brigade Commander Brig Gen Cephas Gurira(left) hands over the brigade flag to the incoming commander Brig Gen Oscar Tshuma(right) at Vitalis Musungwa Gava Barracks in Masvingo today.\n\nBrigadier General Gurira leaves 4 Infantry Brigade to take command of Headquarters 1 Infantry Brigade which oversees Bulawayo Metropolitan as well as Matabeleland North and South Provinces.\n\nThe change of guard at 4 Infantry Brigade was witnessed by senior Government officials, including Permanent Secretary for Provincial Affairs and Devolution Dr Addmore Pazvakavambwa, chairperson of the provincial chiefs assembly Chief Chitanga, and senior military officers, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Outgoing-4-Infantry-Brigade-Commander-Brig-Gen-Cephas-Gurira-signs-to-handover-command-while-ZNA-Commander-Lt-Gen-Anselem-Sanyatwe-looks-on-at-Vitalis-Musungwa-Gava-Barracks-in-Masvingo-today.-680x380.jpg",
            "description": "Brigadier General Oscar Tshuma is the new commander of the 4 Infantry Brigade in Masvingo Province.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Mhako to represent Zimbabwe at Greece art exhibition",
            "url": "https://www.herald.co.zw/mhako-to-represent-zimbabwe-at-greece-art-exhibition/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nTawanda Mhako, a Chinhoyi Technical High School Form Six learner, will be part of the artists that will represent Zimbabwe in Greece this December.\n\nTawanda is veteran broadcaster Regis Mhakos son.\n\nHe is among the top five artists who recently participated at the Colours of Recovery Art Competitions in Harare.\n\nTawanda Mhako (right)holding an artistic piece of Sadio Mane with his schoolmate.\n\nThe competitions focused on the fight against drug and substance abuse.\n\nTawanda has made drawings of prominent people, including footballers Lionel Messi and Sadio Mane.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mhako-blue-tracksuit-flanked-by-one-of-his-schoolmates-and-teachers-holding-the-artistic-piece-that-secured-him-a-position-for-the-Greece-tour.-680x380.jpeg",
            "description": "Tawanda Mhako, a Chinhoyi Technical High School Form Six learner, will be part of the artists that will represent Zimbabwe in Greece this December.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Zero vending to be effected tomorrow night",
            "url": "https://www.herald.co.zw/zero-vending-to-be-effected-tomorrow-night/",
            "content": "Diana Nherera\n\nThe City of Harare and central Government are embarking on a joint operation on zero vending, which is expected to be effected tomorrow night.\n\nSpeaking at the launch of a revenue collection blitz yesterday, City of Harare director of housing and community services, Mr Addmore Nhekairo said the city and the Ministry of Local Government and Public Works are joining hands to stamp out illegal vending on the capitals streets.\n\nThat one is a serious issue and is going to be done by council and central Government, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/vendors5-640x380.jpg",
            "description": "The City of Harare and central Government are embarking on a joint operation on zero vending, which is expected to be effected tomorrow night.",
            "time": "21:28",
            "date": "11 Mar 2025"
        },
        {
            "title": "Mohammed Mussa’s 105k pots stolen",
            "url": "https://www.herald.co.zw/mohammed-mussas-105k-pots-stolen/",
            "content": "Arron Nyamayaro\n\nMohammed Murad Mussa (not related to the late businessman) lost goods worth US$105 000 to thieves at his Graniteside warehouse in Harare.\n\nMussa discovered the theft on Monday when he had gone to collect some stock.\n\nThe premises were secured by two security guards that are employed by Peace Security Company.\n\nDuring Mussas absence, someone used duplicate keys to open the warehouse door. They stole 2 100 boxes of Dolphin pots and went away, leaving the doors locked.\n\nHarare provincial police spokesperson, Inspector Luckmore Chakanza confirmed the case and said investigations are in progress.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/12/Inspector-Luckson-Julius-Chakanza-new.jpeg",
            "description": "Mohammed Murad Mussa lost goods worth US$105 000 to thieves at his Graniteside warehouse in Harare.",
            "time": "21:28",
            "date": "11 Mar 2025"
        }
    ]
}