{
    "news": [
        {
            "title": "Triple murder suspect hospitalised",
            "url": "https://www.herald.co.zw/triple-murder-suspect-hospitalised/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nTriple murder suspect Trymore Tore (37) who was arrested on Sunday afternoon following a joint police and community search has been admitted at Karoi District Hospital with multiple stab wounds.\n\nTore stabbed himself with an okapi knife four times on the chest and twice on the neck after realising that community members and the police were closing in on him.\n\nInvestigations had led the police to a house in Chikangwe Township, Karoi, but Tore managed to escape.\n\nHe retreated to his rural home where villagers and the police combed the area for two days.\n\nOn February 23 at around 5.45 pm, villagers spotted Tore hiding in a bush about a kilometre from his homestead.\n\nThis led to his apprehension by villagers and subsequent arrest by the police.\n\nTore was initially taken to Chitindiva Clinic where he was treated and admitted before being transferred to Karoi District Hospital.\n\nHe is being held under armed police guard.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/08/Arrested.jpg",
            "description": "Triple murder suspect Trymore Tore (37) who was arrested on Sunday afternoon following a joint police and community search has been admitted at Karoi District Hospital with multiple stab wounds.",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "Mbare cops demand money from motorists passing through police station’s gate",
            "url": "https://www.herald.co.zw/mbare-cops-demand-money-from-motorists-passing-through-police-stations-gate/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nTwo police officers who are stationed at Mbare Police Station have been convicted of criminal abuse of office after they were found guilty of charging US$1 to motorists passing through the stations gate.\n\nNaume Dube (31) and Victoria Shonhiwa (36) were remanded in custody to Tuesday for sentencing.\n\nThe State, led by Ms Dzidzai Josiah, proved that on March 18 last year, the two cops were deployed at Mbare Police Stations main gate for security reasons.\n\nOn the same day, officers from internal investigations received a tip off from members of the public that the duo was demanding US$1 from every motorist driving through the gate.\n\nA team of internal police officers carried out surveillance and saw the duo taking the money.\n\nCourt documents state that Shonhiwa received the money and gave it to Dube for safekeeping.\n\nThe internal officers immediately pounced on the duo and recovered US$120 after searching them.\n\nThe two cops were taken to the Police Internal Investigations Section and were later handed over to the Police Anti-Corruption Unit.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/convicted-word-red-frame-d-rendering-convicted-red-frame-130759894.jpeg",
            "description": "Prosper Dembedza Herald Correspondent Two police officers who are stationed at Mbare Police Station have been convicted of criminal abuse of office after they were found guilty of charging US$1 to motorists passing through the station’s gate. Naume Dube (31) and Victoria Shonhiwa (36) were remanded in custody to Tuesday for sentencing. The State, led […]",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "Dams replenished as water levels surge",
            "url": "https://www.herald.co.zw/dams-replenished-as-water-levels-surge/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nMajor dams across the country are experiencing a significant rise in water levels, with some reaching full capacity, according to the latest statistics released by the Zimbabwe National Water Authority (Zinwa).\n\nThe data paints a promising picture of improved water security.\n\nLake Mutirikwi and Silalabuhwa Dams have hit 100 percent capacity, indicating a strong recovery after months of fluctuating levels.\n\nOther major dams showing notable increases include Manyuchi whish is at 99,5 percent and Tugwi-Mukosi (96 percent), which is a boost in water reserves for both agricultural and domestic use.however, other dams remain at critically low levels.\n\nInyankuni Dam is at 9,8 percent while Lower Ncema is among the lowest at 7 percent, thereby raising concerns over water supply in their respective regions.\n\nUpper Ncema (35,2 percent), Mzingwane (33,3 percent), and Mazowe (32,8 percent) also remain below optimal levels, which necessitates continued monitoring and conservation efforts.\n\nZhovhe (92,6 percent), Masembura (93,1 percent), and Arcadia (82,6 percent) are among the dams that have recorded substantial water retention, while urban supply dams such as Chivero (73,2 percent) and Upper Insiza (75,4 percent) indicate stable conditions for major cities, including Harare and Bulawayo.\n\nThe latest dam level statistics reflect a significant improvement from the dry spells that previously threatened agricultural productivity and water supply.\n\nHowever, authorities remain on high alert for regions with persistently low levels, where water rationing may still be necessary.\n\nExperts remain hopeful that more dams will reach full capacity, ensuring a stable water supply for households, irrigation and hydropower generation in the months ahead.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/IMG-20250224-WA0124-680x380.jpg",
            "description": "Major dams across the country are experiencing a significant rise in water levels, with some reaching full capacity, according to the latest statistics released by the Zimbabwe National Water Authority (Zinwa).",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "Re-engagement and engagement helps boost investor confidence: President",
            "url": "https://www.herald.co.zw/re-engagement-and-engagement-helps-boost-investor-confidence-president/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nPresident Mnangagwa has said the re-engagement and engagement of old and new strategic partners has helped boost investor confidence in Zimbabwe.\n\nHe said more players are now taking up opportunities in the country, especially in the mining and energy sectors.The President said the move said will greatly contribute to Zimbabwes economic development.\n\nPresident Mnangagwa made these remarks while officiating at the groundbreaking ceremony at Palm River Energy Industrial Park in Beitbridge today (Monday).\n\nOur re-engagement and engagement initiative as the Second Republic is paying dividends, he said.\n\nWe commend Xintai Resources for coming forward to invest in the mining and energy sector through the setting up of this industrial park whose first phase is almost complete.\n\nThe project is being done in five phases over 12 years.\n\nIt is expected to have a coking plant, thermal power station, ferrochrome processing plant, and a carbon and steel plant.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/4602db1d-9ce2-4648-a1e6-36c7b139571f-680x380.jpeg",
            "description": "Thupeyo Muleya Beitbridge Bureau President Mnangagwa has said the re-engagement and engagement of old and new strategic partners has helped boost investor confidence in Zimbabwe. He said more players are now taking up opportunities in the country, especially in the mining and energy sectors.The President said the move said will greatly contribute to Zimbabwe’s economic […]",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "Zimpapers Tobacco Expo slated for Rusape",
            "url": "https://www.herald.co.zw/zimpapers-tobacco-expo-slated-for-rusape/",
            "content": "Ray Bande\n\nSenior Reporter\n\nZimpapers Mutare (The Manica Post and Diamond FM) will host its inaugural Manicaland Tobacco Expo in Rusape early next month.\n\nThe event, which coincides with the launch of the 2025 tobacco marketing season, seeks to explore business opportunities and facilitate networking among tobacco industry stakeholders, including farmers, service providers, merchants and buyers.\n\nThe expo provides a rare platform for tobacco stakeholders to come under one roof to address the challenges that have plagued the industry in previous years, hindering productivity and profitability.\n\nThe Manica Post Finance and Admin Officer, Mr Advance Khumalo said: We feel there is a yawning gap and hunger for an understanding of the complexities in the tobacco industry, hence this idea to host the Tobacco Expo.\n\nWe will bring together all the stakeholders in the tobacco value chain  from growers, service providers, policy regulators, buyers to merchants  during the three-day event.\n\nMr Khumalo said the door is also open for exhibitors in the tobacco and related industries.\n\nWe will have room for exhibitors to showcase their products and services during this event. This could be service providers in the tobacco industry or any of those whose services and products relate to the industry, said Mr Khumalo.\n\nThe Tobacco Industry and Marketing Board (TIMB) last week announced that the 2025 tobacco marketing season commences on March 5 for auction floors and March 6 for contract sales.\n\nZimbabwe is expecting 300 million kg of tobacco this season after farmers increased the area under tobacco to 84 661 hectares, surpassing last years 82 392 hectares.\n\nTobacco is the countrys second-largest foreign currency earner after gold, with about 98 percent of the locally produced crop exported in semi-processed form, amid growing calls for value addition.\n\nThere has been high demand for the cash crop in China, and funding from both Government and private tobacco companies has boosted output.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/ffc3a43e-148b-41ea-a866-2c5060199a14-680x380.jpeg",
            "description": "Zimpapers Mutare (The Manica Post and Diamond FM) will host its inaugural Manicaland Tobacco Expo in Rusape early next month.",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "President Mnangagwa launches Beitbridge’s US$3.6 billion industrial park",
            "url": "https://www.herald.co.zw/president-mnangagwa-launches-beitbridges-us3-6-billion-industrial-park/",
            "content": "Nqobile Bhebhe in Beitbridge\n\nPresident Mnangagwa has officiated at the groundbreaking and plaque unveiling ceremony of the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone project in Beitbridge.\n\nThe landmark project, which shows growing investor confidence in the Second Republic, has the potential to significantly transform the economy of the Matabeleland region and the country at large.\n\nPalm River is a multi-faceted project that will encompass mining, power generation, coke production, and steel manufacturing.\n\nWith its focus on energy, mining, and value addition, the project has the potential to transform the Matabeleland region into a hub of industrial activity and economic growth.\n\nThe President and his delegation toured the industrial park.\n\nVice President Dr Constantino Chiwenga, Vice President Kembo Mohadi, the Minister of State for Matabeleland South Provincial Affairs and Devolution Dr Evelyn Ndlovu, Finance, Economic Development and Investment Promotion Minister Professor\n\nMthuli Ncube, Mines and Mining Development Minister Winston Chitando and Chinese embassy officials were part of the delegation.\n\nSeveral players in the mining sector and Beitbridge community leaders were also present.\n\nThe project, which is expected to play a crucial role in strengthening Zimbabwes mining and energy sectors, was set up following discussions between the companys chairman and President Mnangagwa.\n\nIt will ultimately produce stainless steel, and is being implemented in phases.\n\nThe project covers an area of 5,163 hectares and will be constructed in five phases over 12 years. The first phase of construction will be done in two years, with a total investment of US$237 million.\n\nIn 2018, President Mnangagwa declared Beitbridge a Special Economic Zone as part of the Second Republics broader strategy to attract investment.\n\nThe SEZ model aims to enhance foreign direct investment, improve local business competitiveness, and drive economic growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/3b1bccf8-d118-4bc3-b951-377912d43c5b-680x380.jpeg",
            "description": "Nqobile Bhebhe in Beitbridge President Mnangagwa has officiated at the groundbreaking and plaque unveiling ceremony of the US$3.6 billion Palm River Energy Metallurgical Special Economic Zone project in Beitbridge. The landmark project, which shows growing investor confidence in the Second Republic, has the potential to significantly transform the economy of the Matabeleland region and the […]",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "Gokwe South gets fire tender",
            "url": "https://www.herald.co.zw/gokwe-south-gets-fire-tender/",
            "content": "Jerry Chifamba\n\nIn another milestone achieved under devolution, the Government has commissioned a fire tender for Gokwe South District.\n\nThe fire tender is part of the 133 units acquired from Belarus to enhance service delivery and community safety across Zimbabwe.\n\nSpeaking at the commissioning ceremony, Midlands Provincial Affairs and Devolution Minister Owen Ncube commended the Second Republic for its commitment to inclusive development.\n\nAs we approach the conclusion of NDS1 and the dawn of NDS2 in 2026, I wish to applaud the Second Republic for transforming the livelihoods of communities through bold, robust, and transformative programmes, he said.\n\nThe devolution funds have empowered local authorities to improve service delivery, modernise infrastructure, and implement life-changing projects.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/6b670048-015b-4e4a-a019-3cd4cd0f6ae3-680x380.jpeg",
            "description": "In another milestone achieved under devolution, the Government has commissioned a fire tender for Gokwe South District.",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "City of Mutare to hold roads indaba this afternoon",
            "url": "https://www.herald.co.zw/city-of-mutare-to-hold-roads-indaba-this-afternoon/",
            "content": "Diana Nherera\n\nThe City of Mutare in collaboration with the United Mutare Residents and Ratepayers Trust will this afternoon host a roads indaba to discuss the conditions of the citys roads.\n\nThe citys principal corporate communications and marketing officer Mr Charles Sadondo said town clerk Mr Blessing Chafesuka and other key stakeholders are expected to address residents at Mutare Hall.\n\nThey will provide valuable insights into the citys road infrastructure.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/mt-680x380.jpg",
            "description": "Diana Nherera The City of Mutare in collaboration with the United Mutare Residents and Ratepayers Trust will this afternoon host a roads indaba to discuss the conditions of the city’s roads. The city’s principal corporate communications and marketing officer Mr Charles Sadondo said town clerk Mr Blessing Chafesuka and other key stakeholders are expected to […]",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "President in Beitbridge for the groundbreaking of a US$3,6bn industrial park",
            "url": "https://www.herald.co.zw/president-in-beitbridge-for-the-groundbreaking-of-a-us36bn-industrial-park/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nPresident Mnangagwa has arrived in Beitbridge for a groundbreaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone.\n\nGovernment, in collaboration with a Chinese mining company, is developing a US$3,6 billion energy industrial park in the border town.\n\nThe President is accompanied by Vice Presidents Constantino Chiwenga and Kembo Mohadi, Matabeleland South Minister of State Dr Evelyn Ndlovu; Finance, Economic Development, and Investment Promotion Minister, Professor Mthuli Ncube; Mines and Mining Development Minister Winston Chitando and other senior Government officials.\n\nRepresentatives from the Chinese embassy and mining experts are also present.\n\nThe project, which is 20km west of Beitbridge town, seeks to produce stainless steel. The energy and steelworks initiative has already employed 400 local workers in its first year, with the expectation that it will ultimately employ over 2 000 people once it becomes fully operational.\n\nThis follows discussions between the chairman of Palm River Energy, Mr Xong Xi Dong, and President Mnangagwa.\n\nThe project will cover 5 100 hectares within a Special Economic Zone and is expected to make substantial contributions to Zimbabwes mining and energy sectors.\n\nIts first phase is being carried out through a joint venture between the Government, Xintai Resources and Tuli Coal.\n\nAfter the groundbreaking ceremony, the President is expected to tour the park which comprises a coking plant that will have an annual capacity of producing one million tonnes of coke, a ferrochrome smelting plant that will produce 100 000 tonnes of high-carbon ferrochrome, and a 1 200MW coal-fired thermal power plant.\n\nAny surplus electricity will be fed onto the national grid, while the ferrochrome plant will facilitate the production of stainless steel and castings.\n\nCoal supply to the project will be obtained from Tuli Coal Mine.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/5fa7e812-78bd-4151-b5df-23f3f282d39b-680x380.jpeg",
            "description": "President Mnangagwa has arrived in Beitbridge for a groundbreaking ceremony of the Palm River Energy and Metallurgical Special Economic Zone.",
            "time": "21:26",
            "date": "24 Feb 2025"
        },
        {
            "title": "Major boost for Chipinge’s health sector",
            "url": "https://www.herald.co.zw/major-boost-for-chipinges-health-sector/",
            "content": "Online Reporter\n\nMount Selinda and Checheches St Peters Hospitals recently acquired state-of-the-art X-ray machines, thereby significantly improving their diagnostic capabilities.\n\nThis will enhance the quality of health services provided to Chipinge community members who were previously forced to travel to Victoria Chitepo Provincial Hospital in Mutare for such services.\n\nDr Ozzimmo Matekenya, the Chipinge District Medical Officer, expressed his excitement and invited members of the public to take full advantage of the crucial health services now offered at these two public institutions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/dc8937ee-8c59-4731-aba3-cb39a3e3bd7b-680x380.jpeg",
            "description": "Online Reporter Mount Selinda and Checheche’s St Peter’s Hospitals recently acquired state-of-the-art X-ray machines, thereby significantly improving their diagnostic capabilities. This will enhance the quality of health services provided to Chipinge community members who were previously forced to travel to Victoria Chitepo Provincial Hospital in Mutare for such services. Dr Ozzimmo Matekenya, the Chipinge District […]",
            "time": "21:26",
            "date": "24 Feb 2025"
        }
    ]
}