{
    "news": [
        {
            "title": "‘We’ll always uphold your dignity, voices’",
            "url": "https://www.herald.co.zw/well-always-uphold-your-dignity-voices/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nPersons with disabilities can be assured that their voices will always be heard in the formulation of national policies and programmes, President Mnangagwa has said.\n\nSince the advent of the Second Republic, persons with disabilities have continued to be empowered and their living conditions have been improved.\n\nIn his address at a meeting with people with disabilities at State House in Harare yesterday, President Mnangagwa said under the Second Republic, the dignity of all persons with disabilities would be upheld.\n\nYou will recall that, in June 2021, I launched the National Disability Policy, which guides our efforts to craft, refine and implement responsive and inclusive disability frameworks across all sectors and levels.\n\nThe Policy draws from the United Nations Convention on the Rights of Persons with Disabilities and other International Conventions, which Government ratified, including the African Agenda 2063 and its disability inclusive protocols.\n\nThis will enhance the empowerment of persons with disabilities and dovetails with international standards and best practices.\n\nGuided by our mantra of leaving no one and no place behind, be assured that your voices will always be heard in the formulation of national development policies and programmes, he said.\n\nGovernment, said President Mnangagwa, was scaling up efforts towards meeting the aspirations and concerns of persons with disabilities.\n\nSecretary for Environment and Tourism in the Politburo First Lady Dr Auxillia Mnangagwa greets Political Commissar Cde Munyaradzi Machacha at a Politburo meeting in Harare yesterday\n\nAs such, Government Ministries have established Departments for Gender Mainstreaming, Inclusivity and Wellness, which are strategic focal entry points designed to enhance the inclusion of disability in the public sector.\n\nIt is pleasing to note that our efforts are aligned with the domestication of International Conventions and Protocols.\n\nThis unity of purpose and culture of working together must be sustained to promote the dignity of all persons with disabilities.\n\nOn its part, my Government is scaling up deliberate interventions towards the realisation of the aspirations of persons with disabilities. Our national Vision 2030 and National Development Strategy recognise disability inclusion as a fundamental and cross-cutting theme that should be considered by all socio-economic sectors, he said.\n\nThe President said Zimbabwes Constitution articulates a wide array of issues regarding the inclusion and empowerment of persons with disabilities, adding that the enactment of the Persons with Disabilities Bill must be expedited.\n\nSection 6 recognises Sign Language as one of the 16 Official Languages in the country. I commend efforts towards the inclusion of this critical language at public sector events. This must be intensified going forward.\n\nWhile, Section 22 of our Constitution emphasises the need to include disability at all levels in our development plans, a lot has been achieved towards embracing communication formats which are suitable for persons with disabilities, including Braille.\n\nEnhancing accessibility to buildings, amenities and public transport, to improve convenience and the overall quality of life for persons with disabilities in all their diversity, is critically important, he said.\n\nDefence Minister Oppah Muchinguri-Kashiri, Public Service, Labour and Social Welfare Minister Edgar Moyo and Special Advisor on National Disability Issues in the Office of the President and Cabinet Ms Rossy Mpofu follow proceedings at the meeting between President Mnangagwa and people with disabilities at State House in Harare yesterday\n\nPresident Mnangagwa said high impact national disability issues as well as a broad array of programmes and activities would be rolled out for the empowerment of persons with disabilities.\n\nNo one will be left behind. The Zimbabwe National Disability Expo has always been a successful event ever since its introduction.\n\nThe platform allows persons with disabilities, Government, the private sector, civil society organisations and communities to share ideas as well as perspectives, while enabling persons with disabilities to showcase their inherent abilities, he said.\n\nPresident Mnangagwa reaffirmed Governments commitment to facilitating and supporting persons with disabilities enterprises and income generating activities as well as other productive endeavours.\n\nTo this end, President Mnangagwa gifted persons with disabilities US$1 000 seed capital per association.\n\nSelf-reliance, self-sufficiency, and mastery of our destiny as individuals and as a country are key at this stage of our development.\n\nMy Government is determined to facilitate and support you in your enterprises and income-generating activities as well as other productive endeavours in areas such as agriculture, mining, and business, among others, said the President.\n\nHe urged the nation to adapt to the changing socio-economic environment and embrace innovative, inclusive and empowering models of development.\n\nInformation communication technologies continue to revolutionise the way we do things.\n\nTo this end, I challenge the sector to move with speed to set up a credible database for effective programming and projects for persons with disabilities.\n\nCapacity for the monitoring and evaluation of the various programmes for the sector should equally be enhanced.\n\nLet us begin to see more transformational results, said President Mnangagwa.\n\nSecretary for Environment and Tourism in the Politburo First Lady Dr Auxillia Mnangagwa shares a lighter moment with Politburo members Cde Richard Ndlovu, Tino Machakaire and Charles Tavengwa at a meeting in Harare yesterday\n\nThe President commended persons with disabilities for the successes they have achieved through the empowerment programmes being championed by his administration.\n\nI urge you, however, to build on the strong foundation set so far and develop your various enterprises into more productive and viable commercial brands.\n\nNyika inovakwa, inotongwa, inonamatigwa nevene vayo/ Ilizwe lakhiwa, libuswe, likhu-le-kelwe ngabanikazi balo.\n\nTogether, in unity, ngativake nyika yedu. Let us rally our collective skills and will-power to build, modernise and industrialise our beloved motherland, Zimbabwe.\n\nBrick by brick and stone upon stone, we are realising Vision 2030, he said.\n\nIn his remarks before introducing President Mnangagwa, Vice President Constantino Chiwenga said it was important to celebrate the progress that has been made in enhancing the livelihoods of persons with disabilities.\n\nThe VP also commended President Mnangagwa for his all-inclusive development stance.\n\nThrough the guest of honours leadership, we have witnessed significant milestones, he said.\n\nMinister of Defence Cde Oppah Muchinguri-Kashiri said under President Mnangagwa, persons with disabilities would not be left behind in the countrys developmental matrix.\n\nYour unwavering commitment to inclusivity and empowerment of the less privileged citizenry is truly inspiring, unparalleled and cannot be overemphasised, she said.\n\nSecretary for Environment and Tourism in the Politburo First Lady Dr Auxillia Mnangagwa greets other Politburo members at a meeting in Harare yesterday.  Pictures: John Manzongo\n\nPublic Service, Labour and Social Welfare Minister Edgar Moyo said the Second Republic would not waiver in meeting the needs and concerns of persons with disabilities.\n\nSpecial Advisor on National Disability Issues in the Office of the President and Cabinet (OPC) Ms Rossy Mpofu showered praises on President Mnangagwa and his administration for their continuous recognition and uplifting of people living with disabilities.\n\nSome of the people with disabilities at their interface with the President at State House in Harare yesterday.  Pictures: Believe Nyakudjara\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Persons with disabilities can be assured that their voices will always be heard in the formulation of national policies and programmes, President Mnangagwa has said. Since the advent of the Second Republic, persons with disabilities have continued to be empowered and their living conditions have been improved. In his address at […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Don’t be misled by hypocrites, Zanu PF members told",
            "url": "https://www.herald.co.zw/dont-be-misled-by-hypocrites-zanu-pf-members-told/",
            "content": "Zvamaida Murwira and Joseph Madzimure\n\nZANU PF members must guard against being misled by hypocrites who pretend to have the party at heart, but turn around and undermine its values, President Mnangagwa has said.\n\nAddressing the 381st Ordinary Session of the Politburo in Harare yesterday, the President, who is also the partys First Secretary, said all party members must defend the party, promote its ideals and be vigilant against misplaced narratives that distort facts and foment divisions.\n\nUnfortunate and misplaced narratives that seek to distort facts, as well as stir divisions and discord, should not be given a footing in our body politic. True cadres of the party are clear on the correct line of the revolution, our partys history, values and traditions.\n\nDo not be clouded or misled by wolves in sheeps clothing abusing our rich liberation heritage for their own divisive ends. Loyal members are Zanu PF by day and Zanu PF by night; not merely when it is convenient, or expedient to be members. At no time should we, as the party leadership, question you about your sense of commitment, duty and loyalty. Ngatizvibvunze patiri ipapo.\n\nPresident Mnangagwa urged all leagues of the party to implement programmes that raise the state of the countrys national consciousness.\n\nParty members must be taught the correct line, discipline and protocols of the party. We are a party of order and discipline. The leadership from the Politburo as well as provinces, districts, branches, villages/cells are directed to complement the Chitepo School of Ideology and deliberately roll-out initiatives that will instil the appropriate decorum, values and discipline within the rank and file of the party, he said.\n\nThese critical aspects, the President said, should ensure that Zanu PF grows stronger and remains dominant for posterity.\n\nZanu PF musangano wevanhu, musangano woruzhinji rweZimbabwe. We have a duty to stay with the people, listening to them and helping them to develop solutions that deliver a higher quality of life. We should not confuse them.\n\nUnity, peace and development, as the guiding motto of Zanu PF must never be treated as mere rhetoric, but an unending exhortation that propels our party and motherland, forward. Our love for the party and the people of Zimbabwe must be reflected through selfless efforts to serve, build our economy and consolidate the gains realised so far under the Second Republic, he said.\n\nPresident Mnangagwa urged Zanu PF members to guard against complacency and continue working hard for national development and the improvement of the lives of ordinary people.\n\nWork is ongoing; we should resist the temptation of thinking that we have achieved enough or that we have arrived.\n\nFar from it, much more work must be done in terms of infrastructure development, agriculture, mining and tourism, as well as in human capital development, ICTs, and improving efficiency in public sector service delivery, he said.\n\nThe President said the party must take leadership in creating suitable conditions for small and medium-sized companies to grow especially in rural areas, leveraging on the countrys vibrant agriculture sector, new technologies, science and innovations.\n\nI am pleased with the milestones realised in the agriculture sector, with the good rains generally received across the country adding to our optimism of a bumper harvest. We are now food self-sufficient. The time has come for us to put greater focus on the complete resuscitation and growth of our countrys agro-industrial sector, he said.\n\nPresident Mnangagwa congratulated Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka for receiving the best Minister award at the prestigious World Governments Summit recently held in Dubai.\n\nThe award attests to the successful policies of the Second Republic which are anchored on hard-honest work, resilience, stakeholder collaboration and the whole-of-society approach to delivering impactful results. Meanwhile, I commend the unity of purpose demonstrated by the Ministry of Youth, in co-operation with the Youth League, and the party leadership in Bulawayo, our affiliates and other stakeholders, for the successful celebrations of the National Youth Day, he said.\n\nGoing forward, the Zanu PF Youth League is called upon to strengthen and broaden the existing fraternal relations with other revolutionary movements within the region and beyond. Synergies should be scaled up towards more young people playing an active role in the economic affairs of the region for the realisation of the SADC Vision 2050.\n\nSome of the issues that were up for discussion during the Politburo included the partys short-term plans, as well as other strategic objectives that are critical in the long-term development for the party.\n\nPresident Mnangagwa said the overall and sectoral resolutions made by the party at last years Annual National Peoples Conference were an embodiment of the peoples aspirations and hopes.\n\nThese remain the foundation and pillar of the projects and initiatives that must guide our work for the year.\n\nIt is almost the half-way mark until we will be required to report to yet another conference. Greater zeal, focus and hard work are required from every member of the party for us to achieve our set targets. It is only in unity that we can fulfill all our plans and the major tasks that lie ahead of us. We cannot afford the luxury of indiscipline, distractions or lethargy.\n\nTo date, our revolutionary party is constantly proving that we can deliver, even under existential threats, risks, and challenges. The unity and resilience of people across all parts of the country and those abroad have been our strongest assets. This growing culture must make us proud as the ruling party and continue to be promoted and safeguarded, he said.\n\nPresident Mnangagwa urged party members to prepare for this years 45th Independence celebrations to be held in Gokwe, Midlands province, in keeping with the decentralisation of national events.\n\nLast year, Independence celebrations were held in Manicaland while Mashonaland Central hosted the 2023 commemorations. Bulawayo was the first province outside Harare to host the commemorations in 2022.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/HE-2.jpg",
            "description": "Zvamaida Murwira and Joseph Madzimure ZANU PF members must guard against being misled by hypocrites who pretend to have the party at heart, but turn around and undermine it’s values, President Mnangagwa has said. Addressing the 381st Ordinary Session of the Politburo in Harare yesterday, the President, who is also the party’s First Secretary, said […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Government slams latest ZCBC pastoral letter",
            "url": "https://www.herald.co.zw/government-slams-latest-zcbc-pastoral-letter/",
            "content": "Fungi Kwaramba, News Editor\n\nWHILE the Government appreciates the role of the Church in nation-building and even criticising some of its policies, it says it is difficult to digest the latest Zimbabwe Catholic Bishops Conference (ZCBC) pastoral letter which focuses on matters that are either dead and buried, such as the Presidential term extension or that are being dealt with like the issue of over taxation.\n\nThis follows the publication of a pastoral letter by Catholic bishops which spoke inter-alia about the debate on the Presidential term extension, issues of taxation, the death penalty, and the debt overhang.\n\nIn response to the bishops yesterday, Presidential Spokesperson, Mr George Charamba, who is also the Deputy Chief Secretary (Presidential Communications) in the Office of the President and Cabinet, said Government appreciates the church speaking strongly on issues that are afflicting the country, but it is somewhat concerned by the selective conclusions and generalisations that the Catholic Church made.\n\nThe bishops raised the issue of the debate around the Presidential term of office. Whilst this is really within their remit to proffer views and ideas on the matter, what Government found a bit disturbing is the fact that the Bishops conference is pronouncing itself on a matter which is in fact dead and buried.\n\nThe President, some two or so weeks ago, met with editors and made it very clear and in plain language that he has no intention whatsoever of pushing for an extension of his term beyond what is constitutionally provided for. It is therefore rather surprising that the eminent bishops decided to revisit what in fact is now a closed matter. When the party or any citizens express a desire to change the Constitution to accommodate an extra term for the President, that wish does not and cannot close the matter.\n\nThe nominee for that extension has to want to have that term extended, isnt it? This is why we talk about what we call an acceptance speech or a statement. The President has made it clear that he has no intention of accepting that proposal which is coming from the party and from society. And once the nominee has turned down the proposal, then it means the debate on the matter, whilst it may continue in society, cannot have any serious executive implication, in which case one does not expect the Holy fathers and Bishops to continue to harp on a matter which in fact stands closed, said Mr Charamba.\n\nApart from focusing on a matter that President Mnangagwa considers closed, Mr Charamba also said the Bishops are focusing on the issue of taxes which Government is seized with addressing.\n\nSecondly, we also could not understand why, especially after the inaugural Cabinet meeting statement by the President, why the issue of the burden of taxation, which is receiving attention from Government, why it continues to exercise the minds of the Bishops. If the statement by the President at the commencement of the 2025 Cabinet Year did not bring comfort to the Bishops, one wonders what would.\n\nI think it is very important that far from raising a matter which is already receiving executive attention, it would actually be a lot more helpful if the bishops can actually take the message of hope to society that indeed something is being done by way of rationalising our tax system to lighten the burden on the citizen, he said.\n\nThe ongoing tax reforms, added Mr Charamba, cannot be done overnight for that has serious implications on the economy as a whole.\n\nYou want to make sure that you are very deliberate and calculated in the way you reform the tax system so that you do not affect the revenue streams which are so needful when it comes to public investments and social development. We are talking about lives here. We are talking about key basic services which cannot be dispensed with and which have to be funded from the revenues that come from the tax structure that we have in the country.\n\nSo really our message to the bishops is to please bear with us, bear with Government as it reforms the tax structure with the ultimate objective of lightening the burden on the citizenry which is in fact the goal that we are all working towards. Yes, that also holds with respect to institutional reforms. I think all institutions remain candidates for reforms if we are going to run institutions that are a living tissue for the common good.\n\nMr Charamba said tackling the scourge of corruption requires all hands on deck as the bane is not limited only to the public sector but also extends to the private sector and conscience industry.\n\nReform in changing institutions is one challenge that all living institutions face and it does not exclude any one institution. Yes, there is an appreciation of the sentiments expressed by the Bishop with respect to fighting corruption, which by the way, is something that Government considers as a priority area.\n\nWe need everyone to come to the table; Government which means the Executive arm of the State, Parliament, the Judiciary, the churches themselves, civil societies and above all the citizens because ultimately corruption occurs and happens within society. And once a society says no to corruption then necessarily we defeat it because what corruption levies on the citizens is always very high and creates conditions of poverty which the Bishops are worried about, he said.\n\nAhead of Easter, an important period on the Christian calendar, which symbolises the resurrection of Jesus Christ and restoration of hope among all believers, Mr Charamba said the words of hope coming from the Bishops, especially during the Lent season, are reassuring.\n\nWe also do take particular note of the bishops, particularly during this time of the Lent. They have committed themselves to be pilgrims of hope and thats important. Indeed more than ever Zimbabwe does need emissaries of hope, does need a message of hope, a message that enthuses our nation to look forward and to move determinedly towards better circumstances which are inevitable, more so in light of the very good season that we have been blessed with. Everything in the country is looking green, the harvest is very promising, the tobacco season has just opened and we note that we are destined for a very good year, he said.\n\nMr Charamba said the abolishment of the death penalty, which was acknowledged by the Bishops, is a recognition of the sanctity of life.\n\nIt is a campaign which we are aware the churches were fully and spiritedly behind so really this is a fulfilment of that objective and the Government is quite happy that the bishops did acknowledge that breakthrough. Equally, Government was quite gratified to note that the bishops acknowledge the acute burden which comes with debt, said Mr Charamba.\n\nZimbabwes foreign debt currently stands at US$12 billion and a huge chunk of that has accrued due to interests charged by the lenders, which along with the calamatious economic sanctions imposed by Western countries has placed an unbearable burden on the country.\n\nThe debt has been compounded by inordinate interest rates. As you are aware the principal debt of Zimbabwe is actually quite low relative to the GDP of the country as well as the total assets of the country. Of course, it would have been a little more helpful and complete if the Bishops would have noted the second layer by way of sanctions which continue to weigh down the country, Mr Charamba said.\n\nHe added that a combination of debt entrapment and sanctions creates a very unsustainable situation for the nation.\n\nAll the same we do acknowledge and recognise with lots of thanks that breath on the part of the conference which has enabled them to see beyond just the national dimension of the situation we find ourselves in, Mr Charamba said.\n\nFrom now on, he said, Zimbabwe is at a critical juncture where there is a need to show common cause and common purpose so that the country moves in the same direction.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/07/1707-1-1-GEORGE-CHARAMBA_1.jpg",
            "description": "Fungi Kwaramba, News Editor WHILE the Government appreciates the role of the Church in nation-building and even criticising some of its policies, it says it is difficult to digest the latest Zimbabwe Catholic Bishops’ Conference (ZCBC) pastoral letter which focuses on matters that are either dead and buried, such as the Presidential term extension or […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "‘Tobacco sector on growth trajectory’",
            "url": "https://www.herald.co.zw/tobacco-sector-on-growth-trajectory/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nZIMBABWEs tobacco industry is on a promising trajectory, the Minister of Lands, Agriculture, Fisheries, Water and Rural Development Dr Anxious Masuka said yesterday.\n\nHe emphasised the Governments commitment to the Tobacco Value Chain Transformation Plan (2021-2025).\n\nThe tobacco auction floors opened yesterday with contract deliveries and sales, which form the bulk of the modern crop, starting today. The auction floors remain critical for self-financed growers and for the market discovery process that sets prices.\n\nThe official opening saw the first bale going under the hammer for US$4,65 per kilogramme compared to US$4,92 for the first bale at last years official opening. The first bale is a random selection and has little influence on price. Later yesterday, the highest bale registered a price of US$4,95 per kilogramme.\n\nProduction this year is expected to be around 280 million kilogrammes above last years 235 million kilogrammes.\n\nTobacco is the countrys single second largest foreign currency earning export product after gold and the Government is keen to see its continued production growth. Tobacco, since the land reform programme, is now grown by tens of thousands of farmers and is a driver of the agricultural prosperity seen across the tobacco belt.\n\nThis ambitious initiative, said Minister Masuka, aims to enhance the sectors output and value, maintaining Zimbabwe as a key player in the global tobacco market.\n\nHe shared preliminary findings that indicate a commendable increase in value addition and beneficiation, rising from two percent to seven percent since the launch of the plan.\n\nThis progress, though modest, is a testament to the collective efforts of stakeholders in the sector and underscores the potential for further growth.\n\nToday, we come together not just to celebrate the opening of the marketing season, but to acknowledge the role that tobacco plays in our economic development journey, said Minister Masuka.\n\nThe direct impact of agriculture to economic development is seen from the tobacco contribution to agricultural growth, domestic product and national economic development.\n\nI would like to begin by expressing my gratitude to all stakeholders involved in the sector, from the hardworking tobacco growers to the merchants, processors, the Government institutions that drive development of the Sector-Tobacco Research Board and the regulator Tobacco Industry and Marketing Board.\n\nMinister Masuka said Zimbabwe seeks to increase the level of value addition and beneficiation of tobacco into cutrag and cigarettes from two percent of the total tobacco produced to 30 percent to increase exports of cigarettes by 2025.\n\nPreliminary information suggests an increase in value addition and beneficiation from two percent to seven percent during the plan period.\n\nI have provided this rather unsavoury state of progress in the transformation of the sector to remind us of the collective obligation to deliver on the plan for the sake of our country, said Minister Masuka.\n\nTobacco on auction during the official opening of tobacco selling season in Harare yesterday. Picture Justin Mutenda\n\nHe said Zimbabwe is a choice source of flavour styles of tobacco desired by discerning world markets.\n\nOur tobacco is arguably, the most widely exported product from Zimbabwe. We must endeavour to keep it this way, said Minister Masuka.\n\nWe must continue to explore strategic alliances to accelerate production, increase value addition and beneficiation, to entrench local financing and to manage risk through diversification at farm level.\n\nTIMB chairman Mr Patrick Devenish said the auction floor represents not just the marketplace for the hard work of growers, but also a symbol of the dedication and resilience of all involved.\n\nThe mission remains to provide a platform where growers can showcase their high-quality tobacco and secure a fair price for their efforts.\n\nAs we celebrate todays opening, we also look forward with great optimism. We are committed to continuous improvement, and as such, we are investing in the future  both in technology and in our people, said Mr Devenish.\n\nThe board is introducing a biometric grower management system to address the longstanding challenges within Zimbabwes tobacco sector. This innovative solution will protect farmers, curbside marketing, eliminate fraudulent activities and restore transparency and efficiency in the industry.\n\nThe new system introduces biometric data capture, linking each farmers unique grower number to their fingerprints, GPS coordinates of their household and farm, and demographic data.\n\nThis comprehensive profiling protects farmers and ensures that only genuine farmers participate in the market.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/TS1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter ZIMBABWE’s tobacco industry is on a promising trajectory, the Minister of Lands, Agriculture, Fisheries, Water and Rural Development Dr Anxious Masuka said yesterday. He emphasised the Government’s commitment to the Tobacco Value Chain Transformation Plan (2021-2025). The tobacco auction floors opened yesterday with contract deliveries and sales, which form the bulk […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "First Lady donates wheelchair, blankets, groceries to disabled child",
            "url": "https://www.herald.co.zw/first-lady-donates-wheelchair-blankets-groceries-to-disabled-child/",
            "content": "Tendai Rupapa, Senior Reporter\n\nA COUPLE from Mufakose suburb in Harare with an eight-year-old child who has cerebral palsy, has its reasons to praise the Lord after First Lady Dr Auxillia Mnangagwa, a philanthropist par-excellence, came to their rescue.\n\nYesterday, the couple was at a loss for words after Dr Mnangagwa, who also is the Angel of Hope Foundations patron, gave the child a wheelchair, blankets, and an assortment of groceries.\n\nThe couple, Mr Bernard Mafuka (52) and Mrs Euphrasia Mafuka (37), shed tears of joy after Amai Mnangagwa fulfilled their wish and gave their child a wheelchair for easy mobility a few days after they had appealed for help through the Zimbabwe Broadcasting Corporation.\n\nDr Mnangagwa gave the family food items that included rice, maize-meal, cooking oil, salt and sugar, for the child.\n\nThe gifts underscored Dr Mnangagwas boundless love and quest to ease the plight of those in need.\n\nThe childs father could not hide his joy.\n\nI am grateful for what the First Lady, our mother, has done for us. She heard our plight with a child who cannot walk and the lack of a wheelchair.\n\nHis mother had no one to look after the child while performing other duties and always strapped him on her back.\n\nHowever, thanks to the First Ladys benevolence, my wife can now work achiita mabasa ake emaoko.\n\nI am truly grateful to Amai. Her love is deeper than the ocean. She goes everywhere around the country helping those with disabilities, the elderly, the sick, widows, widowers, and among many other vulnerable groups. Her love is unmatched. We are forever grateful as a family, he said.\n\nSimilar sentiments were echoed by the childs mother, who said she was grounded with the child who cannot walk, sit or eat alone.\n\nI want to thank the mother of the nation for what she has done for me and my family.\n\nOur child has cerebral palsy and he cannot walk or see properly.\n\nHe cant sit alone and even eat on his own. I went to the ZBC seeking help and our mother saw us and pasina nguva, Amai came to our rescue.\n\nMinamato yedu yakadairwa. She gave us a wheelchair and now I can work.\n\nI also thank Amai for the provisions that she gave us. I also want to thank her for remembering all those in need. The child wets himself and we did not have enough blankets.\n\nIts even worse this rainy season when the blankets take a long time to dry.\n\nThe blankets from the First Lady will assist us in a big way, she said, with happiness written all over her face.\n\nMr and Mrs Mafuka place their son Atipa in the wheelchair donated to them by First Lady Dr Auxillia Mnangagwa after hearing about their plight on television. Pictures: John Manzongo\n\nThe couples neighbours were awestruck by the First Ladys love and kindness.\n\nOne of the neighbours, who chose not to be named, expressed gratitude to the First Lady.\n\nAt times I would remain behind with the child while his mother was out selling wares.\n\nPreviously she would carry him on her back, but the child has grown, making this difficult.\n\nThe child cannot sit and has special needs which require the mother to be close by at all times.\n\nNow that the child has a wheelchair, she can now do her work as the child is in the wheelchair.\n\nThe child can also now play with others, she said.\n\nGogo Shorai Maungi said the First Lady was doing great things for the nation.\n\nI am touched by what the First Lady has done. The childs mother was failing to do anything to raise income because of the childs condition.\n\nThis show of love is unparalleled, she said, as she went about her domestic chores.\n\nThe views dovetailed with those of Sekuru Conrad Musanyera.\n\nOur First Lady is so loving and not selective. She helps everyone in need despite where they are and their background.\n\nShe is teaching us to show love to those in need at all times and for that, I am very grateful. We are learning a lot from the mother of the nation, he said.\n\nDr Mnangagwa, who has a passion for the welfare of women and children among many other vulnerable groups, traverses the length and breadth of the country assisting those in need and sowing the seeds of love in communities.\n\nMr Bernard Mafuka and his wife Euphrasia are all smiles as they push their son Atipa in the wheelchair donated to them by Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa after she saw about their plight on television\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/FL1-1.jpg",
            "description": "Tendai Rupapa, Senior Reporter A COUPLE from Mufakose suburb in Harare with an eight-year-old child who has cerebral palsy, has its reasons to praise the Lord after First Lady Dr Auxillia Mnangagwa, a philanthropist par-excellence, came to their rescue. Yesterday, the couple was at a loss for words after Dr Mnangagwa, who also is the […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Help combat drug abuse, military urged",
            "url": "https://www.herald.co.zw/help-combat-drug-abuse-military-urged/",
            "content": "Peter Matika, Bulawayo Bureau\n\nCommander Zimbabwe National Army (ZNA), Lieutenant-General Anselem Nhamo Sanyatwe, has said the military must play an active role to combat drug and substance abuse in the country, and challenged officers to lead by example in shunning the practice.\n\nSpeaking at the handover-takeover ceremony between outgoing Commander of Headquarters One Infantry Brigade, Brigadier General George Chitsva and his successor Brig-Gen Cephas Gurira at Khumalo Barracks in Bulawayo yesterday, Lt-Gen Sanyatwe said the drug and substance abuse scourge must be dealt with decisively to ensure national progress towards Vision 2030.\n\nHe also warned uniformed forces against partaking in drugs, saying this would disrupt not only their careers, but those of future generations.\n\nOur soldiers need to understand that engaging in such behaviours not only puts their futures at risk but also reflects on the entire formation and the Zimbabwe National Army in general, said Lt Gen Sanyatwe.\n\nHe urged Brig-Gen Gurira to take proactive steps to create an environment where open dialogue about this issue is encouraged.\n\nImplement educational programmes that highlight the dangers of drug and substance abuse, foster resilience and promote healthy coping mechanisms, said the ZNA Commander.\n\nHe said the change of command is a time honoured tradition that marks the transition of leadership and responsibility, underscoring the enduring spirit of the army.\n\nAs correctly noted by General Obasanjo of Nigeria, change of command is not just a ritual, but a demonstration of the strength and resilience of our institution. Were reminded of the paramount importance of continuity and tradition in our esteemed institution, said Lt Gen Sanyatwe.\n\nAs military professionals, we are the torch-bearers of bravery and a rich heritage, forged by the sacrifices, selflessness of our predecessors who have served our great nation with unwavering honour and distinction.\n\nThe ZNA has a collective sacred responsibility to perpetuate the legacy of visionary leaders who paved the nation. In the same vein, we should impart our knowledge, expertise and experience to the next generation of military leaders who will carry on the mantle of our noble profession, he added.\n\nThis legacy is anchored on the essential principles of discipline, integrity and professionalism, which are the foundation of our success as a cohesive, effective and formidable team.\n\nLt Gen Sanyatwe said the change of command between Brig Gen Chitsva and Brig Gen Gurira, is not only a transfer of authority, but a tradition of continuity that has been in existence for generations.\n\nHe said the tradition is anchored on the experience and wisdom of those before them and will deeply be entrenched in the institutions commitment to excellence, discipline and selfless service.\n\nThe two commanders whose changeover of command is taking place are high-calibre generals of unquestionable loyalty whose dedication to duty is top notch.\n\nBoth of them are founding members of the Zimbabwe Defence Forces and served with the ZANLA forces during Zimbabwes liberation struggle until their attestation into the Zimbabwe National Army at its inception in 1980. Since then, they have served in various capacities in the Zimbabwe Defence Forces.\n\nHe expressed gratitude to Brig Gen Chitsva for his tenure as Commander at HQ 1 Infantry Brigade, saying his selfless efforts have been instrumental in shaping the formation into a cohesive and effective force.\n\nThe ZNA Commander said Brig Gen Chitsva demonstrated exceptional resilience, adaptability and courage in the face of adversity and challenges caused by illegal sanctions. During his tenure, Brig Gen Chitsva implemented various projects and programmes that meticulously promoted the well-being and prosperity of the formation.\n\nDue to his commitment and resoluteness, he managed to effectively deal with smuggling of goods and other illicit activities along the Zimbabwe  South Africa border line.\n\nThis has never been easy, but I must commend the outgoing commander for how he handled these very delicate issues. In addition, he maintained the momentum in suppressing livestock rustling that was rampant in Matabeleland South, particularly in the areas of Shanyaugwe, Guyu and Mlambaphele.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Lt-Gen-Sanyatwe.jpg",
            "description": "Peter Matika, Bulawayo Bureau Commander Zimbabwe National Army (ZNA), Lieutenant-General Anselem Nhamo Sanyatwe, has said the military must play an active role to combat drug and substance abuse in the country, and challenged officers to lead by example in shunning the practice. Speaking at the handover-takeover ceremony between outgoing Commander of Headquarters One Infantry Brigade, […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT:  China-Africa facility to spur infrastructure growth",
            "url": "https://www.herald.co.zw/editorial-comment-china-africa-facility-to-spur-infrastructure-growth/",
            "content": "CHINA has been taking its international responsibilities seriously and also seeing that boosting international trade and developing less developed areas, such as much of Africa, makes everyone better off as markets and trade expand.\n\nA core programme in this development drive is the US$50 billion facility to back African modernisation and industrialisation that China unveiled at the Forum on China-Africa Co-operation, FOCAC, last year. Zimbabwe has identified 12 bids to be considered for this concessionary funding under the imaginative programme.\n\nTo a degree, the Chinese programme is of immediate as well as future mutual benefit since as we have seen already, in many of these sort of programmes, Chinese companies win the contracts on the basis of efficiency and price.\n\nWhen most of the risks no longer have to be calculated into the pricing, they should be even more competitive.\n\nSo using the China-Africa facility changes very little in who does the work and how the work is done, but makes a huge difference in speeding up that work and making sure that the pricing is ever tighter and more competitive.\n\nWe would also hope that as the facility starts operating across Africa that support is given practically to African industrialisation by finding suitable local partners, or seeing how much of the supply work can be done in Africa.\n\nOne example is the bid for some very heavy work to be done on the National Railways of Zimbabwe, which is a long way from its heyday as the prime mover of most cargo in Zimbabwe and into the region. Even restoring it to what it once was can only be a first step, as we are seeing that heavy industrial and mining output is expanding fast in Zimbabwe, so ever more cargo that should be shipped by rail is becoming available.\n\nThis will require a supply of heavy duty rails to replace some of the oldest material, and far more importantly a large number of new wagons of a range of designs. In the past all these had to be imported, but Zimbabwe now has a modern steelworks at Manhize, owned by a Chinese investor who has their core works in China and so would be well known to the railways supplier.\n\nIt should thus be possible that the upgrade of the railways could include a ready market for building up Zimbabwean industry. Most wagons require reasonable quantities of a suitable grade of steel and the Manhize works could almost certainly supply that grade with little problem.\n\nIn addition, because they are part of an international group that must already be supplying similar products elsewhere, they have the appropriate reputation and quality control as a reliable supplier.\n\nSo we could have a rolling stock manufacturing industry, and considering all our neighbours need to expand and upgrade their own rolling stock, there would be that market for a supplier inside the African Continental Free Trade Area using steel made inside AfCFTA from ores mined inside the area, so meeting any conceivable rules of origin. This sort of effort would multiply the benefits of a successful bid for China-Africa funds.\n\nThere are other examples in the 12 bids made by Zimbabwe that could provide not just solutions for Zimbabwean requirements but also build up the Zimbabwean economy.\n\nThis is not contradictory for China. That country accelerated from a fairly basic self-sufficiency to becoming the second largest economy in the world in very few decades largely on the basis of a massive industrialisation drive built around becoming a top trading nation.\n\nAn example of this is the fact that China is the third largest trading partner of the United States, after Canada and Mexico, which might explain why the three are the first targets of a new avowedly protectionist administration.\n\nThe two countries are hardly allies, but business is business and one would expect the two largest economies in the world to have a lot of business with each other, as they do despite everything.\n\nChina appreciates, more than most countries, the benefits of open trade since this is what was so critical in its own dramatic development, and that development also made China a far more important and larger market for others.\n\nZimbabwe is already a major winner of that Chinese development, as we see ever more investment and even more critically, we sell more stuff to Chinese customers. But as we sell more, we have the money to buy more. This is why trade develops economies and creates what are called positive feedbacks.\n\nSo China can plainly see that the larger and more wealth trading partners have, the more trade there will be for everyones benefit. The rich do the most business with each other. So helping Africa modernise and industrialise does not cut into the Chinese economy, rather it accelerates the creation of a far bigger and more important trading partner. Everyone then wins and wins big.\n\nThis understanding by China is important when it comes to its dealings with Africa and Zimbabwe. It is not looking at exploitative relationships, but rather on seeing a far bigger and more important trading partner able to do far more big business with everyone then winning.\n\nChina has been an all-weather friend to Africa in general and Zimbabwe has benefited from that as have many other countries. But we have also seen that China expects a degree of seriousness from its investment and trading partners, and Chinese investors and customers are especially keen on seeing high levels of efficiency and honesty.\n\nThat is why we can sell so much to China, because we have become a trusted supplier, and why major Chinese industrialists and miners are reasonably keen on investing in Zimbabwe despite our obvious need for more infrastructure, because we provide a secure investment environment that minimises risk.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/china-africa.jpg",
            "description": "CHINA has been taking its international responsibilities seriously and also seeing that boosting international trade and developing less developed areas, such as much of Africa, makes everyone better off as markets and trade expand. A core programme in this development drive is the US$50 billion facility to back African modernisation and industrialisation that China unveiled […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Harare to get new water treatment plant, 650 000 smart meters",
            "url": "https://www.herald.co.zw/harare-to-get-new-water-treatment-plant-650-000-smart-meters/",
            "content": "Trust Freddy, Herald Correspondent\n\nHarare is set to receive at least 650 000 smart water meters and a new water treatment plant as the Government moves to alleviate the ongoing water crisis by plugging revenue leakages and partnering with private companies.\n\nThis joint initiative, involves the Ministry of Local Government and Public Works, the City of Harare, the worlds biggest manufacturers of technically-advanced utility meter products and systems, Hangzhou Laison Technology Company and Helcraw Electrical.\n\nThe move to privatise Harares water supply, encompassing purification, distribution and billing systems follows a desperate plea for help by Harare Mayor Jacob Mafume to Chief Secretary to the President and Cabinet, Dr Martin Rushwaya.\n\nSpeaking at the official hand-over of Morton Jeffrey Water treatment plant to Laison Technology yesterday, Local Government and Public Works Minister Daniel Garwe said 650 000 smart water meters from China were en route to Harare.\n\nWe already have 40 brand new vehicles ready to start this programme. The shipment of 650 000 water meters is on its way and we expect them to be here in the shortest period of time. So this is the progress that has been achieved this far, he said.\n\nIn addressing the current water woes, Minister Garwe said going forward, the country will leverage on technology.\n\nNumber one is to ensure that we move with technology and attach billing to it, using smart water metering systems, similar to those used for electricity, he said.\n\nFor example, if Engineer Mazai wants to buy two millilitres of water, he will pay for exactly two millilitres of water.\n\nWe want to ensure that residents of Harare get value for their money. Thats our goal. With smart water metering and a billing system, residents will only pay for the water that is actually delivered and is of good quality, not for contaminated water or undelivered supplies.\n\nMinister Garwe said the move aligns with President Mnangagwas blueprint, launched two years ago titled, A call to action-no compromise to service delivery: First stage of interventions to modernise the operations of local authorities towards a 2030 Vision.\n\nThe two investors, Minister Garwe said, were given an opportunity to study in detail the water situation in Harare.\n\nThey came up with a report, which we are now seized with. The report, which was supported by the information that came from the City of Harare, shows that Lake Chiveros water is now contaminated. It needs cleaning up, and Morton Jaffray, the water treatment plant, needs refurbishment. We also discovered that the water conveyancing system from here to the various suburbs in Harare has suffered a lot of leakages, and a lot of purified water is being lost through those leakages.\n\nMayor Mafume described the move as the beginning of the transformative journey.\n\nEverybody needs water in the morning and at their workplace. We have entered into a partnership which we are launching today, under the guidance of the Ministry. This partnership is going to be transformative; it will deal with the repair and upgrading of Morton Jaffray, he said.\n\nHe also clarified that the City of Harare has not surrendered control of the plant, but is instead collaborating with partners to address the dire situation, where over 60 percent of water is non-billable.\n\nDeputy Managing director for Hangzhou Laison Technology Company, Mr Clark Dai said: Today, we are very excited and honoured to have the opportunity to work together with our partner, Helcraw Electrical, to bring the latest technology and innovation from China and partner with the City of Harare to ensure sustainable water management and provide residents with access to clean water.\n\nHelcraw Electrical Group chief executive officer Mr Brendon Jere was optimistic that they would solve Harares water problems, saying behind the scenes, they have worked with the Ministry of Local Government to understand the kind of work that needs to be done.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Harare.jpg",
            "description": "Trust Freddy, Herald Correspondent Harare is set to receive at least 650 000 smart water meters and a new water treatment plant as the Government moves to alleviate the ongoing water crisis by plugging revenue leakages and partnering with private companies. This joint initiative, involves the Ministry of Local Government and Public Works, the City […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "NPA recovers  ill-gotten US$100m",
            "url": "https://www.herald.co.zw/npa-recovers-ill-gotten-us100m/",
            "content": "Remember Deketeke, Herald Correspondent\n\nThe National Prosecution Authority of Zimbabwe (NPAZ) recovered US$100 million in 2024 through forfeiture and preservation orders across the Magistrates Court and the High Court, surpassing its initial target of US$35 million for asset recovery, the Prosecutor General, Justice Loice Matanda-Moyo has said.\n\nThe figure was revealed at the signing of a Memorandum of Understanding (MOU) between the NPAZ and the Southern African Parliamentarians Network Against Corruption (SAPNAC) in Harare yesterday.\n\nSpeaking on behalf of Justice Matanda-Moyo, Deputy Prosecutor General Mr Nelson Mutsonziwa said: We recovered a total of US$93,500,000 through forfeiture and preservation orders across the Magistrates Court and High Court. We surpassed our ambitious target of US$35,000,000 for asset recovery in 2024.\n\nIn 2024, we achieved an impressive 88.88 percent clearance rate for corruption and high-profile cases that were prosecuted in the High Court. We are also making significant strides in the Magistrates Court, with a 45.65 percent clearance rate for corruption cases for the just ended year,.\n\nJustice Matanda-Moyo who is also current president of the Asset Recovery Inter-Agency Network of Southern Africa (ARINSA) has leveraged this position to significantly enhance regional collaboration and collective capacity for asset recovery.\n\nOur strengthened collaborative efforts within ARINSA yielded significant results last year, including the successful recovery and repatriation of a helicopter from Victoria Falls back to Zambia, she revealed.\n\nThe helicopter, acquired with stolen state funds by a former Zambian Minister of Foreign Affairs, underscores our commitment to cross-border asset recovery.\n\nFurthermore, our Asset Forfeiture Unit successfully repatriated US$5 million stolen from National Foods Zimbabwe and concealed in South Africa, as well as R13 million embezzled from Chinhoyi University of Technology.\n\nThese figures, Justice Matanda-Moyo added, underscore the NPAZs commitment to not only prosecuting corruption within Zimbabwes borders, but also actively recovering the proceeds of crime.\n\nMeanwhile, Justice Matanda-Moyo said the partnership with SAPNAC marks a significant step forward in fighting corruption.\n\nSAPNAC deputy chairperson, who is also a parliamentarian in Mozambique, Ms Mupita Mazoka hailed the NPAs expertise.\n\nWith the numbers and what we have seen we can surely say NPA is becoming a formidable force in fighting corruption within the region, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/12/loice-matanda-moyo-03.jpg",
            "description": "Remember Deketeke, Herald Correspondent The National Prosecution Authority of Zimbabwe (NPAZ) recovered US$100 million in 2024 through forfeiture and preservation orders across the Magistrates Court and the High Court, surpassing its initial target of US$35 million for asset recovery, the Prosecutor General, Justice Loice Matanda-Moyo has said. The figure was revealed at the signing of […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "A cleaner Zimbabwe: Our collective responsibility",
            "url": "https://www.herald.co.zw/a-cleaner-zimbabwe-our-collective-responsibility/",
            "content": "Anashe Mpamombe, Herald Correspondent\n\nZimbabwe is a country of breath-taking landscapes, rich biodiversity warm and hospitable people.\n\nFrom the magnificent Victoria Falls to the rolling hills of the Eastern Highlands, our nation is blessed with natural beauty that attracts visitors from all over the world.\n\nHowever, to fully enjoy and preserve this beauty for future generations, we must take an active role in keeping our surroundings clean.\n\nLittering is a challenge, but we can easily overcome it together.\n\nA clean environment is not just about aesthetics; it is essential for our health, economy, and overall well-being.\n\nImagine walking through the streets of Harare or Bulawayo and seeing spotless roads, well-maintained parks, and clear waterways.\n\nSuch an environment is not only pleasing to the eye but also promotes public health, encourages tourism, and fosters a sense of national pride.\n\nKeeping our spaces clean is a responsibility we all share, and small actions can lead to significant change.\n\nOne of the most effective ways to reduce litter is to make waste disposal convenient and accessible. In recent years, there have been positive steps towards increasing the number of waste bins in public places, but there is still room for improvement.\n\nLocal councils, businesses, and communities can work together to ensure that bins are placed in strategic locations and emptied regularly.\n\nIf we all make an effort to use these facilities properly, our streets and public spaces would remain clean and inviting.\n\nEducation also plays a crucial role in creating a culture of cleanliness.\n\nSchools can incorporate environmental awareness programmes that teach children the importance of responsible waste disposal.\n\nWhen children grow up understanding the value of a clean environment, they carry those habits into adulthood.\n\nParents and guardians can also set a good example by ensuring their families dispose of waste properly at home and in public spaces.\n\nCommunity-driven initiatives have already shown great success in promoting cleanliness in various parts of the country.\n\nClean-up campaigns, organised by local groups, churches, and businesses, not only remove litter but also inspire others to take action.\n\nEvents like the National Clean-Up Day, launched by the Government, encourage people from all walks of life to participate in keeping their communities clean. Such initiatives demonstrate the power of collective action and show that when we work together, we can make a real difference.\n\nZimbabwe has also made progress in promoting environmentally friendly alternatives to plastic waste.\n\nMany businesses have embraced reusable bags, biodegradable packaging, and recycling programmes. Supporting these initiatives by choosing sustainable products and reducing single-use plastics can go a long way in minimising waste.\n\nWith more awareness and commitment, we can continue to develop innovative solutions that benefit both the people and the planet.\n\nTourism is one of Zimbabwes most important industries, and maintaining clean public spaces enhances our countrys appeal to visitors.\n\nA litter-free environment reflects a nation that values cleanliness, organisation and hospitality.\n\nTourists who experience a well-maintained Zimbabwe will leave with positive impressions, leading to more visitors, more jobs, and a stronger economy.\n\nBy keeping our cities, parks, and heritage sites clean, we contribute to national development in ways that benefit everyone.\n\nBusinesses also have a role to play in waste management. Restaurants, shopping centres, and markets can provide proper waste disposal facilities and encourage customers to use them responsibly.\n\nCorporate social responsibility programmes that focus on environmental conservation can help businesses engage with their communities while making a positive impact.\n\nWhen companies, Government bodies and citizens work together, we create an environment where cleanliness becomes a shared priority.\n\nTechnology can also be a useful tool in addressing littering. Many cities around the world have developed mobile applications that allow citizens to report overflowing bins or areas that need cleaning.\n\nWith Zimbabwes growing digital landscape, similar innovations can help improve waste management efficiency. Encouraging creativity and technological solutions can make environmental conservation more effective and accessible to everyone.\n\nAs individuals, the power to create a cleaner Zimbabwe starts with us.\n\nSimple actions such as keeping a small bag for trash while traveling, picking up litter when we see it, and encouraging friends and family to do the same can have a lasting impact. Respecting our environment is an act of patriotism, and every small effort contributes to a bigger change.\n\nA clean Zimbabwe is within our reach, and the good news is that many people are already taking action.\n\nWhether through organised clean-ups, recycling programmes, or responsible waste disposal, there are countless examples of citizens working towards a better environment.\n\nBy celebrating these efforts and inspiring others to join in, we can continue to build a culture of cleanliness and sustainability.\n\nOur country has a bright future, and by making cleanliness a priority, we ensure that future generations inherit a Zimbabwe they can be proud of.\n\nTogether, through awareness, responsibility, and action, we can create a nation where littering becomes a thing of the past. A cleaner Zimbabwe is not just a dream it is a goal we can achieve if we all play our part.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/clean.jpg",
            "description": "Anashe Mpamombe, Herald Correspondent Zimbabwe is a country of breath-taking landscapes, rich biodiversity warm and hospitable people. From the magnificent Victoria Falls to the rolling hills of the Eastern Highlands, our nation is blessed with natural beauty that attracts visitors from all over the world. However, to fully enjoy and preserve this beauty for future […]",
            "time": "09:09",
            "date": "06 Mar 2025"
        }
    ]
}