{
    "news": [
        {
            "title": "So, you are wondering, why cardboard boxes on injured persons?",
            "url": "https://www.herald.co.zw/so-you-are-wondering-why-cardboard-boxes-on-injured-persons/",
            "content": "(Zimpapers) Fact Checking Desk\n\nMANY Zimbabweans rely on social media platforms such as WhatsApp, Facebook and X for their news, exposing themselves to misinformation and biased sources. A recent social media frenzy centred around the use of cardboard boxes as makeshift plaster in first aid management following a tragic accident that claimed the lives of 25 people when an Urban Connect bus collided with a truck near the Lutumba tollgate along the Masvingo-Beitbridge highway.\n\nMajor talking point:The use of cardboard boxes on injured patients has sparked debate, with some experts defending the practice.\n\nIs there anything wrong with using cardboard box makeshift plasters?\n\nAccording to a Harare-based surgeon, it is common to use cardboard box slabs to immobilise an injured limb or suspected fracture during patient transportation or while waiting for X-rays.\n\nNo there isnt! This approach is widely accepted for immediate coverage of limbs in emergencies.\n\nResponding to Farai Maguwu on X, Australia-based medical practitioner, Thabisa Sibanda, cautioned against invading privacy when sharing images of patients with makeshift slabs.\n\nFirst, I wish to express my displeasure at the apparent invasion of privacy viz a viz this photo. Secondly may I offer a word of caution. This lady may be waiting for surgery and the surgeon felt no need to remove the prehospital makeshift slab in place.\n\nWhats the advantage of this? Does it work?\n\nIn emergencies where victims may be far from healthcare facilities, cardboard boxes are crucial to prevent further injury and stabilise fractures during transport. Community healthcare workers and first aid responders can easily utilise cardboard boxes to immobilise limbs and provide temporary support until patients receive proper medical care.\n\nVerdict:Using cardboard boxes for emergency handling of accident victims is cost-effective, widely accepted, and practical in Zimbabwe. These makeshift plasters help prevent further injury and facilitate the initial treatment of fractures before patients receive proper medical attention. Ultimately, patients will require a real plaster cast to hold the fracture in place while it heals, but cardboard boxes play a vital role in the initial stabilisation process.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-88-680x380.png",
            "description": "(Zimpapers) Fact Checking Desk MANY Zimbabweans rely on social media platforms such as WhatsApp, Facebook and X for their news, exposing themselves to misinformation and biased sources. A recent social media frenzy centred around the use of cardboard boxes as makeshift plaster in first aid management following a tragic accident that claimed the lives of […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Zhombe businessman loses US$8 000 to bogus VID officer",
            "url": "https://www.herald.co.zw/zhombe-businessman-loses-us8-000-to-bogus-vid-officer/",
            "content": "Midlands Bureau\n\nA Zhombe businessman lost US$8 000 to a bogus VID officer who claimed to be in charge of disposing vehicles forfeited to the State.\n\nMidlands provincial police spokesperson, Inspector Emmanuel Mahoko said the police are investigating a series of fraud cases involving the suspect who is only identified as Mageza.\n\nInspector Mahoko said cases involving Mageza go back to July 2024.\n\nIn one of the cases, Mageza duped Honest Mahleka, a businessman based at Joel Business Centre in Zhombe.\n\nThe suspect convinced Mahleka that he was disposing a Toyota Hiace and a Nissan AD Van at a cost of $8 500, he said.\n\nInspector Mahoko said the complainant was instructed to deposit the money into various EcoCash accounts.\n\nSoon after the transactions were made, the suspect was no longer reachable. We are appealing for information that may assist in the investigation, he said.\n\nInspector Mahoko urged members of the public to do thorough background checks before making any payments.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/Inspector-Emmanuel-Mahoko.jpg",
            "description": "Midlands Bureau A Zhombe businessman lost US$8 000 to a bogus VID officer who claimed to be in charge of disposing vehicles forfeited to the State. Midlands provincial police spokesperson, Inspector Emmanuel Mahoko said the police are investigating a series of fraud cases involving the suspect who is only identified as Mageza. Inspector Mahoko said […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Businesses meet Parliament Budget Committee",
            "url": "https://www.herald.co.zw/businesses-meet-parliament-budget-committee/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nThe Parliamentary Portfolio Committee on Budget, Finance, Economic Development, and Investment Promotion is meeting various business organisations today to gather their views on the Monetary Policy Statement that was recently released by RBZ Governor, Dr John Mushayavanhu.\n\nThe organisations largely welcomed the stance on maintaining a tight monetary policy that has brought stability to the market.\n\nThey also acknowledged the de-dollarisation process that is being implemented by monetary authorities but urged them to set out clear milestones that need to be achieved towards that goal.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/a3ff43f0-e8d4-461f-899c-f6fb24118200-680x380.jpeg",
            "description": "Farirai Machivenyika Senior Reporter The Parliamentary Portfolio Committee on Budget, Finance, Economic Development, and Investment Promotion is meeting various business organisations today to gather their views on the Monetary Policy Statement that was recently released by RBZ Governor, Dr John Mushayavanhu. The organisations largely welcomed the stance on maintaining a tight monetary policy that has […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Artisanal miner buried alive in Murewa",
            "url": "https://www.herald.co.zw/artisanal-miner-buried-alive-in-murewa/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nAn artisanal miner died in Murewa on Sunday after the tunnel he was working in at Jasperlite Services Private Limited Mine collapsed.\n\nPolice are yet to release the deceaseds name.\n\nReports are that the now-deceased and his colleague had dug for about four metres when the wall of the shaft collapsed.\n\nThe miner got trapped and his colleague reportedly called for help. The trapped miner was rescued and rushed to Murewa Hospital.\n\nHowever, he was pronounced dead on admission.\n\nPolice spokesperson for Mashonaland East, Inspector Simon Chazovachiyi confirmed the incident and said investigations are in progress.\n\nMeanwhile, efforts to locate three artisanal miners who were buried alive when a shaft collapsed in Makaha, Mudzi, are yet to resume after they were suspended due to heavy rains.\n\nThe trio was trapped on January 3 after they had entered the tunnel to prospect for gold.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-89-680x380.png",
            "description": "Victor Maphosa Mashonaland East Bureau An artisanal miner died in Murewa on Sunday after the tunnel he was working in at Jasperlite Services Private Limited Mine collapsed. Police are yet to release the deceased’s name. Reports are that the now-deceased and his colleague had dug for about four metres when the wall of the shaft […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Beitbridge horror crash victims get additional help",
            "url": "https://www.herald.co.zw/beitbridge-horror-crash-victims-get-additional-help/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nMore organisations have come in to support the Governments efforts in supporting the victims of the road accident that killed 25 people near the Lutumba tollgate last Thursday.\n\nThe accident happened when a Beitbridge-bound bus and a commercial lorry that was heading to Chirundu collided head-on.\n\nThe Government said the deceased would get State-assisted funerals, and most of them were buried over the weekend.\n\nEleven of the deceased were Beitbridge residents.\n\nDiscovery Ambulance Services has offered to transfer all those that need special medical attention in Harare.\n\nSo far, Discovery has taken four of the 29 people who were admitted at Beitbridge District Hospital to Harare.\n\nAccording to the practitioner in charge at Discovery Ambulance Services, Mr Elliot Chivige, the company will pay the victims medical bills.\n\nWe have decided to complement what is already being done by the Government. As an organisation we are offering to transport all those in need of special medical attention in Harare where we will pay all the medical bills and provide the consumables needed, he said.\n\nBeitbridge Mayor, Councillor Peter Pirato Mafuta and other stakeholders mobilised material support, including private ambulances.\n\nWe are grateful for the support we are receiving. A dark cloud is hovering over our heads following the death of 11 of our residents in that road accident, said Councillor Mafuta.\n\nThe Zimbabwe Passengers Transport Organisation (ZPTO) chairman, Dr Samson Nhanhanga also delivered US$11 000 to the Government to assist with the burial of the deceased.\n\nThe Insurance Council of Zimbabwe said it will also cover medical and funeral expenses, while the Traffic Safety Council of Zimbabwe has given an assortment of hampers to those hospitalised.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-88-680x380.png",
            "description": "Thupeyo Muleya Beitbridge Bureau More organisations have come in to support the Government’s efforts in supporting the victims of the road accident that killed 25 people near the Lutumba tollgate last Thursday. The accident happened when a Beitbridge-bound bus and a commercial lorry that was heading to Chirundu collided head-on. The Government said the deceased […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "President meets editors",
            "url": "https://www.herald.co.zw/president-meets-editors/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nPresident Mnangagwa today held an interactive meeting with editors from both the public and private media to share national issues and developments in the country.\n\nThe meeting provided an opportunity for the President to share his strategic vision while reflecting on the several achievements that his administration has recorded.\n\nIt was a no-holds-barred two-hour meeting that saw editors asking an array of questions on the economy, politics, and the media industry, among other issues.\n\nThe interaction was facilitated by the Department of Presidential Communications in the Office of the President and Cabinet, headed by Deputy Chief Secretary, Mr George Charamba.\n\nI want to warmly welcome you to State House. I do so mindful of the fact that this is our first meeting and that you represent different ownerships, editorial paths, and tendencies, which, in sum, constitute our national media industry, said President Mnangagwa.\n\nYet I am aware that one common denominator you have in that diversity and even competition is being Zimbabwean.\n\nHe said he is aware that the media industry is operating in a complex and challenging environment where many things, including technology, are evolving.\n\nNot least among these is a seismic shift in reader/viewer/listener interest and behaviour. Much of it is caused, motivated, or aided by giant technological changes and possibilities, he said.\n\nThe old media is dead and with it, old models and ways of doing your craft. We feel the impact and repercussions of these changes of technologies even in our own sphere of Government which is supposed to be stable and traditionally change-averse.\n\nThe Second Republic has made significant milestones in the areas of infrastructure, mining, and agriculture among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-87-680x380.png",
            "description": "Zvamaida Murwira Senior Reporter President Mnangagwa today held an interactive meeting with editors from both the public and private media to share national issues and developments in the country. The meeting provided an opportunity for the President to share his strategic vision while reflecting on the several achievements that his administration has recorded. It was […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Nature fights back, sand poaching truck submerged in river",
            "url": "https://www.herald.co.zw/nature-fights-back-sand-poaching-truck-submerged-in-river/",
            "content": "Sikhumbuzo Moyo\n\nBulawayo Bureau\n\nA truck loading river sand in Tshangani River, Nkayi, was completely submerged last Friday when water levels rose rapidly.\n\nAccording to a situation report from the Civil Protection Unit (CPU), the trucks engine failed to start, and the driver went to seek help.\n\nUpon his return, the river had swollen and his truck was submerged, with only a small tip still visible.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-81-680x380.png",
            "description": "Sikhumbuzo Moyo Bulawayo Bureau A truck loading river sand in Tshangani River, Nkayi, was completely submerged last Friday when water levels rose rapidly. According to a situation report from the Civil Protection Unit (CPU), the truck’s engine failed to start, and the driver went to seek help. Upon his return, the river had swollen and […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Minister Moyo vows to strengthen labour administration systems across Africa",
            "url": "https://www.herald.co.zw/minister-moyo-vows-to-strengthen-labour-administration-systems-across-africa/",
            "content": "Herald Reporter\n\nThe Chairperson of the African Regional Labour Administration Centre (ARLAC), Public Service, Labour and Social Welfare Minister Edgar Moyo has pledged to facilitate innovation, collaboration, and the empowerment of people through labour administration systems.\n\nHe made this pledge during the 51st ARLAC Governing Council Meeting for Ministers Responsible for Labour, Employment, and Manpower Issues held in Lusaka, Zambia, from February 11 to 14.\n\nARLAC is an intergovernmental organisation that promotes cooperation in labour administration, employment, and social protection among African countries.\n\nIn his keynote address, Minister Moyo said: Together, we will innovate, collaborate, and most importantly continue to empower people through our labour administration systems.\n\nThere will be challenges ahead, but I do not doubt that our collective strength and shared vision will help us navigate them successfully.\n\nThe minister expressed optimism about the future of the African Regional Labour Administration Centre (ARLAC).\n\nThe future of ARLAC is bright. Together, we will continue to drive positive change and make a lasting impact in the lives of workers and communities everywhere, he said.\n\nGoing forward, Minister Moyo emphasised the need to ensure that all labour administration systems are not only functional but are also future-proofed to address the evolving needs of the workforce.\n\nHe also commended the International Labour Organisation for its ongoing technical and financial support.\n\nYour involvement plays a crucial role in shaping the future of our work, and we look forward to continuing this journey with you, he said.\n\nThank you for your continued trust and commitment and for being here with us.\n\nThe closing ceremony which was held at Mulungushi International Conference Centre was graced by Zambias Vice-President, Mrs Mutale Nalumango.\n\nAddressing the delegates, Vice-President Nalumango urged governments to enact inclusive policies and allocate resources for labour market reforms.\n\nAddressing the shared labour market challenges requires a united effort. In response to these challenges, Zambia, as a proud member of ARLAC, is implementing and advocating for the following strategies that can be adapted across the region.\n\nSimplifying registration processes to encourage formalisation, tax rebates and provision of start-up loans for Small and Medium Enterprises (SMEs) to help formalize their operations, leveraging digital tools, mobile money services and e-banking.\n\nThe event brought together representatives from over 18 Member States to deliberate on innovative strategies to address informality in the labour market and promote transitions towards formality, thereby ensuring decent work for all.\n\nThe meeting drew participation from Zambias Minister of Labour and Social Security, Mrs Brenda Tambatamba, Retired Major General Pius Mokgware, Minister of Labour and Home Affairs for Botswana, as well as Lesothos Minister of Employment and Labour Tseliso Makhosi.\n\nOthers were South Africas Deputy Minister of Employment and Labour, Judity Nemadzinga Tshabalala; ILO officials; South Africa High Commissioner to Zambia, Saad Cachalia; Zimbabwe Ambassador to Zambia Charity Charamba; Zambias Permanent Secretaries of Labour, Principal Secretaries of Labour, Employers and Workers organisations representatives, chief executive officers from various private and parastatal organisations, as well as the academia.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/0b807a7a-b414-4ee3-ac46-203eaa15ee5d-680x380.jpeg",
            "description": "Herald Reporter The Chairperson of the African Regional Labour Administration Centre (ARLAC), Public Service, Labour and Social Welfare Minister Edgar Moyo has pledged to facilitate innovation, collaboration, and the empowerment of people through labour administration systems. He made this pledge during the 51st ARLAC Governing Council Meeting for Ministers Responsible for Labour, Employment, and Manpower […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Mighty Warriors leave for Angola",
            "url": "https://www.herald.co.zw/mighty-warriors-leave-for-angola/",
            "content": "Tadious Manyepo\n\nSports Reporter\n\nThe Mighty Warriors left the country for Luanda, Angola, for the first leg of their back-to-back 2026 Womens Africa Cup of Nations qualifier against the home side on Thursday.\n\nSithethelelwe Kwinji 15 Sibanda and her charges left this morning and are expected to arrive late in the afternoon.\n\nThey will have two days to acclimatise before plunging into battle against the Angolans.\n\nThey will hope to constrict the home side and carry an advantage going into the second leg that is scheduled for February 26 at the Lucas Moripe Stadium in Pretoria, South Africa.\n\nAggregate winners from this twin tie will face Malawi to determine who proceed to the WAFCON final tournament to be staged in Morocco next year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/466d6b84-1258-42b7-99cf-a78367f163c7-680x380.jpeg",
            "description": "Tadious Manyepo Sports Reporter The Mighty Warriors left the country for Luanda, Angola, for the first leg of their back-to-back 2026 Women’s Africa Cup of Nations qualifier against the home side on Thursday. Sithethelelwe “Kwinji 15” Sibanda and her charges left this morning and are expected to arrive late in the afternoon. They will have […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        },
        {
            "title": "Zimbabwean sprinters dominate global athletics stage",
            "url": "https://www.herald.co.zw/zimbabwean-sprinters-dominate-global-athletics-stage/",
            "content": "Jerry Chifamba\n\nZimbabwean athletes made history at the Tiger Paw Invitational held on Saturday at Clemson Universitys Indoor Track and Field Complex in South Carolina, USA.\n\nMakanakaishe Charamba stormed to victory in the 200m indoor race, breaking the Zimbabwean national record with a blistering time of 20.16 seconds, now the eighth-fastest indoor time in the world.\n\nFellow Zimbabwean sprinter Tapiwa Makarawu also shone, finishing second with a personal best of 20.31 seconds, making it the second-fastest time of the event.\n\nBoth athletes previously impressed at the 2024 Paris Olympics.The duos exceptional performance highlights Zimbabwes growing prominence on the global athletics stage.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-79-680x380.png",
            "description": "Jerry Chifamba Zimbabwean athletes made history at the Tiger Paw Invitational held on Saturday at Clemson University’s Indoor Track and Field Complex in South Carolina, USA. Makanakaishe Charamba stormed to victory in the 200m indoor race, breaking the Zimbabwean national record with a blistering time of 20.16 seconds, now the eighth-fastest indoor time in the […]",
            "time": "18:30",
            "date": "17 Feb 2025"
        }
    ]
}