{
    "news": [
        {
            "title": "Zanu PF wraps up campaign for Norton Ward 3 by-election",
            "url": "https://www.herald.co.zw/zanu-pf-wraps-up-campaign-for-norton-ward-3-by-election/",
            "content": "Conrad MupesaMashonaland West BureauThe ruling party, Zanu PF, is confident of winning the Norton Town Ward 3 seat in the by-election that is set for Saturday.\n\nThe seat fell vacant following the death of Citizens of Coalition Change (CCC) Councillor Prichard Paradzayi in January this year.\n\nCde Wilson Tsomondo is representing Zanu PF in the by-election.Local Government and Public Works Minister, who is also Zanu PF Mashonaland East chairperson Cde Daniel Garwe, and Zanu PF Mashonaland West chairperson Cde Mary Mliswa graced the final rally that was held at Karina Open Space in Ward 3.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/IMG-20250305-WA0084-680x380.jpg",
            "description": "The ruling party, Zanu PF, is confident of winning the Norton Town Ward 3 seat in the by-election that is set for Saturday.\nThe seat fell vacant following the death of Citizens of Coalition Change (CCC) Councillor Prichard Paradzayi in January this year.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Zimbabwe commemorates Africa Environment Day",
            "url": "https://www.herald.co.zw/zimbabwe-commemorates-africa-environment-day/",
            "content": "Walter NyamukondiwaMashonaland West Bureau ChiefZimbabwe today celebrated its natural beauty and ecological diversity at the belated Africa Environment Day commemorations in Chinhoyi.Stakeholders, including chiefs, the Environmental Management Agency (EMA) and the Forestry Commission gathered at the Chinhoyi University of Technology (CUT) for the commemorations.\n\nChief Zvimba and Mashonaland West Secretary for Provincial Affairs and Devolution, Mr Josphat Jaji who was standing in for Provincial Affairs and Devolution Minister Marian Chombo, planted the Quinine Tree.\n\nDelegates also toured exhibition stands of the various initiatives that are being undertaken to protect the environment and promote its sustainable usage.This years celebrations were held under the theme Investing in the Environment.\n\nThey also celebrate the legacy of Wangari Maathai, an environmentalist and Nobel Laureate. Maathai championed environmental conservation and sustainable development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/IMG-20250305-WA0082-680x380.jpg",
            "description": "Mashonaland West Bureau Chief\nZimbabwe today celebrated its natural beauty and ecological diversity at the belated Africa Environment Day commemorations in Chinhoyi.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Zimbabwe courts global capital: UK investment mission sparks high-value deals and strategic alliances",
            "url": "https://www.herald.co.zw/zimzimbabwe-courts-global-capital-uk-investment-mission-sparks-high-value-deals-and-strategic-alliances/",
            "content": "Herald Correspondent\n\nZimbabwe has made significant strides in securing foreign direct investment (FDI) following a high-profile business mission in the United Kingdom.\n\nThe mission was led by Ambassador Christopher Mutsvangwa and Finance and Investment Promotion Minister, Professor Mthuli Ncube, with the support and facilitation of His Excellency, Retired Colonel Christian Katsande, Zimbabwes Ambassador to the UK.\n\nThe engagement reinforced Zimbabwes position as an attractive frontier market for global capital, strengthening its trade and investment relations with the UK and beyond.\n\nThe two-day investment drive was a resounding success, fostering strategic investment discussions, high-value deal negotiations, and diplomatic engagements aimed at accelerating Zimbabwes economic transformation.\n\nThe delegations participation at the Top 100 Emerging Global Businesses 2024/2025 award ceremony at Westminster provided a critical platform to promote Zimbabwes investment-ready projects in steel production, real estate development, telecommunications, and energy infrastructure.\n\nA key enabler of the successful business mission was Ambassador Katsande, whose strategic leadership, diplomatic acumen, and extensive investor networks have been instrumental in driving Zimbabwes investment outreach in the UK.\n\nThe Ambassadors ability to cultivate high-level relationships with British business leaders, policymakers, and financial institutions has positioned Zimbabwe as a compelling destination for investment capital.\n\nOne of the most promising outcomes of the mission was the advancement of strategic foreign direct investment (FDI) commitments in Zimbabwes steel industry.\n\nAmbassador Mutsvangwa and the delegation also held discussions with C5 Capital, a global investment firm, to develop an Africa-focused Steel Investment Summit.\n\nThe proposed event aims to bring together leading industry players, institutional investors, and global business leaders, further solidifying Zimbabwes position as a regional steel production hub.\n\nThe Domak Group, a leading infrastructure and real estate developer, engaged in discussions on establishing a smart city project adjacent to the Manhize steel plant.\n\nThe planned development will integrate residential, commercial, and industrial zones, aligning with Zimbabwes national urbanisation and industrialisation strategy.\n\nAmbassador Katsande will play a pivotal role in ensuring seamless Government facilitation, including engagements with Zimbabwes Ministry of Local Government to accelerate land acquisition and investment approvals.\n\nThe mission also saw significant interest from the Zeru Business Group, which is exploring investment in Zimbabwes agriculture and hospitality sectors.\n\nZeru has expressed its intention to assess horticulture, agro-processing, and eco-tourism opportunities, with a fact-finding visit to Zimbabwe planned in the coming months.\n\nInvestor sentiment in Zimbabwes renewable energy sector also gained some momentum during the mission.\n\nROWE Oil & Gas initiated discussions on developing independent power projects (IPPs) focusing on solar, biofuel, and gas-powered energy solutions.\n\nThese firms are particularly interested in Zimbabwes progressive energy regulatory framework, which promotes private sector participation in power generation.\n\nThe London Embassy will continue to facilitate regulatory engagements with Zimbabwes Energy Ministry and the Zimbabwe Energy Regulatory Authority (Zera) to ensure the smooth entry of these investors into the market.\n\nThe missions discussions with Nigerian High Priest Chief Chukwudi explored ways to expand Nigerian investment flows into Zimbabwe, focusing on mining, infrastructure, and financial services.\n\nThe dialogue set the groundwork for a formal Zimbabwe-Nigeria trade delegation, which will be coordinated by Ambassador Katsande and Zimbabwes investment and trade promotion agencies.\n\nFollowing the highly successful mission, Zimbabwes London Embassy, under the stewardship of Ambassador Katsande, will play a crucial role in facilitating post-engagement investor support, ensuring that discussions translate into tangible investments.\n\nThe success of this business mission underscores Zimbabwes commitment to strengthening its global investment profile and deepening economic partnerships.\n\nAmbassador Mutsvangwa praised Ambassador Katsande and the London Embassy team for advancing Zimbabwes investment diplomacy agenda, highlighting the critical importance of sustained engagement with the UKs business and financial community.\n\nIn reflecting on the missions outcomes, Ambassador Katsande reaffirmed Zimbabwes commitment to fostering a dynamic, investor-friendly environment.\n\nZimbabwes economic renaissance is underpinned by an unwavering commitment to investment facilitation and regulatory transparency. The engagements in London reaffirm the global confidence in Zimbabwes market potential, and we are committed to ensuring that investors receive the highest level of support as they explore opportunities in our country.\n\nZimbabwe is open for business, and this mission has demonstrated that our investment story is one of growth, resilience, and opportunity, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/IMG-20250305-WA0076-680x380.jpg",
            "description": "Zimbabwe has made significant strides in securing foreign direct investment (FDI) following a high-profile business mission in the United Kingdom.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Japan injects US$5 million into sesame production",
            "url": "https://www.herald.co.zw/japan-injects-us5-million-into-sesame-production/",
            "content": "Ivan Zhakata recently in MWENEZIJapan has injected US$5 million into a project that is being implemented under the World Food Programme (WFP) for Zimbabwean smallholder farmers to boost sesame production for the export market.The initiative has provided training, irrigation support and market access to thousands of farmers, many of whom are women in drought-prone districts.\n\nSpeaking on the sidelines of a field visit in Mwenezi, the Counsellor at the Japanese Embassy in Zimbabwe, Mr Masataka Nakamura said Japan is committed to strengthening agricultural value chains in Zimbabwe.\n\nOur project sails through WFP, focusing on water irrigation, capacity building and analytics, he said.Sesame, a drought-resistant crop, has been embraced by many smallholder farmers in Zimbabwes dry regions due to its resilience.\n\nMr Lloyd Masunda, deputy country director for Sustainable Agriculture Technology (SAT) said there is a rapid growth of the sesame value chain in Zimbabwe.\n\nIn the last three years, we have worked with smallholder farmers, providing training, extension support and linking them to markets, Mr Masunda said.\n\nInitially, without external support, production was low. But last year, with WFP backing, we harvested over 650 tonnes of sesame from 2 930 farmers.\n\nThis season, we have scaled up to 11 278 farmers, covering 6 600 hectares, and we expect to produce 3 300 tonnes.Mr Masunda said Zimbabwe has successfully entered the export market, with 212 tonnes of sesame sold internationally last season.We exported 151 tonnes to Japan and smaller quantities to Mozambique. One of our biggest buyers is the Torture Corporation in Japan, and we also have commitments from buyers in India, China and Mozambique.\n\nThe economic impact on smallholder farmers has been significant, with expectations that this seasons harvest will generate approximately US$2.7 million in rural communities.\n\nWFPs Masvingo field offices programme policy officer, Mr Munyaradzi Gahadzikwa said the project is improving food security and livelihoods in drought-affected areas.\n\nIn Mwenezi alone, we are supporting 3 500 vulnerable farmers with funding from the government of Japan, working in collaboration with SAT and relevant Government ministries, Mr Gahadzikwa said.These farmers often struggle to put food on the table, but with sesame production, they have now achieved food security, nutrition security, and income security.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Zim-Japan-ties.jpg",
            "description": "Japan has injected US$5 million into a project that is being implemented under the World Food Programme (WFP) for Zimbabwean smallholder farmers to boost sesame production for the export market.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Climate insights key to fair, sustainable energy transition",
            "url": "https://www.herald.co.zw/climate-insights-key-to-fair-sustainable-energy-transition/",
            "content": "Sifelani TsikoInnovations EditorClimate-informed decisions are now more important for global investment in low-carbon energy transitions that guarantee reliable energy and future planning for electricity demand, a new global report shows.The 2023 Year in Review: Climate-driven Global Renewable Energy Potential Resources and Energy Demand Report says climate-informed and diversified energy solutions are essential if the world is to meet targets to triple renewable energy capacity and double energy efficiency by 2030.\n\nThe report was jointly produced by the World Meteorological Organization (WMO), the International Renewable Energy Agency (IRENA) and the Copernicus Climate Change Service (C3S), operated by the European Centre for Medium-Range Weather Forecasts (ECMWF).\n\nWhether it is solar power generation in drier-than-average conditions, wind power generation in regions experiencing shifts from La Nia to El Nio conditions, or hydropower generation in the face of fluctuating precipitation patterns, climate has a direct bearing on both electricity supply and demand, the three weather agencies said in a joint statement.\n\nSuch challenges also present unprecedented opportunities. The integration of climate insights into energy planning yields more reliable power generation, helps anticipate seasonal peaks in demand and strengthens the adaptability of future infrastructure development.\n\nCountries around the world are investing in cleaner sources of power to meet targets under the Paris Agreement.The report looks at 2023  a year which saw a transition from a La Nia to an El Nio phenomena, affecting key climatic variables for the energy sector, including wind speed, solar radiation, precipitation and temperature.\n\nIn addition, the report illustrates the potential applications of seasonal forecasts as a valuable tool for energy planning and management.\n\nSeasonal climate forecasts empower stakeholders to anticipate supply-demand fluctuations, optimise grid operations and enhance energy system resilience.\n\nThey also enable better preparation for extreme weather events, ensuring energy security and minimising disruptions.Globally, wind power installed capacity surpassed 1 000 GW in 2023, a 13 percent increase from the 2022 figures.Solar power has been growing considerably faster than wind power, with the installed capacity reaching 1 420 GW in 2023, a 32 percent increase from 2022.\n\nHydropower has grown slightly, with an installed capacity of about 1 410 GW in 2023, a 1 percent increase from 2022.Developing countries face a proportionally heavier financial burden in the shift to a sustainable economy as many are heavily engaged in energy-intensive industries and more reliant on coal for power generation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-6.jpg-climate.jpg",
            "description": "Climate-informed decisions are now more important for global investment in low-carbon energy transitions that guarantee reliable energy and future planning for electricity demand, a new global report shows.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Over 2 000 people get food aid in Shurugwi",
            "url": "https://www.herald.co.zw/over-2-000-people-get-food-aid-in-shurugwi/",
            "content": "Theseus Shambare recently in SHURUGWIOver 2 000 people in Gundura, Shurugwi, received food aid last Thursday.The Gundura Food Distribution Point (FDP), serving 497 households, distributed aid to 2 037 individuals, thereby addressing the vulnerability of the community, which is ranked as the districts fourth most food-insecure region by the District Drought Relief Committee (DDRC).\n\nThe regions reliance on artisanal mining, casual labour and small-scale farming, supplemented by remittances, has been severely challenged by the impacts of the El Nio-induced drought.\n\nThe seven-member FDP Committee plays a vital role in ensuring the efficient and equitable distribution of food.Acting director of social development in the Ministry of Public Service, Labour and Social Welfare, Mr Totamirepi Tirivavi underscored Governments responsive strategies and the importance of international support in mitigating hunger.\n\nFrom a Government perspective, we really want to appreciate the friends of Zimbabwe who have been assisting following the Presidents call for both domestic and international assistance after the El Nino-induced drought.\n\nThe government of South Korea has also come in with food aid.We are quite optimistic that our food situation will likely improve as the crop situation is promising, said Mr Tirivavi.\n\nThe United Nations World Food Programme (WFP) Lean Season Assistance (LSA) programme, supported by the Republic of Korea, is providing essential food baskets containing cereals, pulses, and fortified vegetable oil to vulnerable populations in this district.South Koreas Envoy to Zimbabwe, Ambassador Park Jae Kyung, expressed his countrys commitment to supporting Zimbabwes efforts in building climate resilience.\n\nI hope our assistance will make the people happy during this period, Ambassador Park said.He added: We understand Midlands Province is one of the hardest hit by the El Nino-induced drought. We will continue on this path not only by providing food aid, but also through our agriculture programmes.\n\nWe are launching the small grains production programmes, so the Embassy will come back to Midlands with more programmes.WFP Country Director and Representative, Ms Barbara Clemens highlighted the importance of collaborative efforts in achieving food security.\n\nFood security is about more than just putting food on the table. Through this programme and with Koreas invaluable support, we are making a real difference of ensuring that food is available, nutritious and delivered in a way that provides stability for families.Our efforts today are part of a broader partnership with the Government of Zimbabwe, whose leadership in food security and social protection in commendable.\n\nOur collaboration with the Government ensures that WFPs assistance aligns with national priorities, reinforcing Zimbabwes broader efforts towards building a happy and healthy nation.\n\nWe also recognise the resilience of communities, your strengths, determination, and willingness to engage in solutions that improve livelihoods. As WFP, we remain committed to working hand in hand with the Government, donors and communities to break the cycle of hunger and create food security for all, Ms Clemens said.\n\nThe programme is being implemented in partnership with the Government of Zimbabwe and the locally initiated Development Agency (LIP) under the Food Deficit Mitigation Strategy (FDMS), with funding from the Republic of Korea.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/IMG-20250305-WA0067-680x380.jpg",
            "description": "Over 2 000 people in Gundura, Shurugwi, received food aid last Thursday.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Zimbabwe scales up preparations for 2025 Osaka Expo",
            "url": "https://www.herald.co.zw/zimbabwe-scales-up-preparations-for-2025-osaka-expo/",
            "content": "Wallace RuzvidzoHerald ReporterPreparations for Zimbabwes participation at the 2025 Osaka Expo to be held in Japan from April 13 to October 13 are at an advanced stage, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said.Speaking at a post-Cabinet media briefing held in Harare on Tuesday, Dr Muswere said a 12-member delegation led by a Commissioner-General of the Zimbabwe pavillion, Mr Allan Majuru, who is also the ZimTrade chief executive officer, will represent Zimbabwe at the high-profile international event.\n\nPresident Mnangagwa will grace Zimbabwes National Day at the six-month-long expo on July 16.Cabinet considered and approved the preparations for the Expo 2025 Osaka Report, as presented by the Minister of Foreign Affairs and International Trade, Professor Amon Murwira, he said.\n\nThe expo will be held in Osaka, Japan, from April 13 to October 13, 2025. Plans are already at an advanced stage to establish the Zimbabwe pavilion.\n\nIdentification of public and private institutions, especially business community representatives that will showcase what we have in the tourism, mining, education, innovation and agriculture sectors, is ongoing.\n\nContent creation is already at an advanced stage, while construction of the pavilion, commercial space and development of websites is already underway, he said.\n\nThe expo will provide a platform to harness investment dividends and other collaborative opportunities, as the President will be engaging both international investors and the diaspora community in Japan.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Dr-Jenfan-Muswere.jpg",
            "description": "Preparations for Zimbabwe’s participation at the 2025 Osaka Expo to be held in Japan from April 13 to October 13 are at an advanced stage, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Gokwe, Kabuyuni communities get free medical check-ups",
            "url": "https://www.herald.co.zw/gokwe-kabuyuni-communities-get-free-medical-check-ups/",
            "content": "Peter TanyanyiwaHerald CorrespondentState-owned telecommunications company, TelOne, in partnership with Discovery Ambulance Services, recently brought medical professionals to Gokwe-Kabuyuni Constituency to provide services.They also delivered mobility aids, including wheelchairs, food parcels, and textbooks for schools.\n\nHundreds of people received free medical check-ups for conditions such as high blood pressure and diabetes.TelOnes corporate services director, Mr Crispen Dimba highlighted the companys dedication to building resilient communities.\n\nWe have seen some cases of Cerebral Palsy that were previously undiagnosed. As part of the mantra leaving no one behind, we are proud of the impact we are making here, he said.\n\nThis is our way of giving back, and we are committed to ensuring that no area is neglected, said Mr Dimba.Discovery Ambulance Services provided free first-aid training under the Presidential Emergency Medical Scheme.\n\nThe companys corporate legal secretary, Dr Takudzwa Zvobgo said the programme aligns with the National Development Strategy 1 (NDS1), which seeks to uplift marginalized communities.\n\nThe President has emphasized that Zimbabwe can only be built by its own people. This initiative is part of that vision. By delivering healthcare directly to the people and empowering the youths with critical skills, we are contributing to the long-term resilience of our communities, said Dr Zvobgo.\n\nLocal Member of Parliament, Cde Spencer Tshuma said such partnerships are essential for achieving sustainable change.This partnership is proof of what we can achieve when we work together. TelOnes involvement, along with Discovery Ambulance Services, has brought much-needed services to the people. Health is critical in achieving our national goals, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Screenshot_20250305_112332_WhatsApp-680x380.jpg",
            "description": "State-owned telecommunications company, TelOne, in partnership with Discovery Ambulance Services, recently brought medical professionals to Gokwe-Kabuyuni Constituency to provide services.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "President hosts persons with disabilities at State House",
            "url": "https://www.herald.co.zw/president-hosts-persons-with-disabilities-at-state-house/",
            "content": "Online ReporterPresident Emmerson Mnangagwa is hosting persons with disabilities at State House in Harare today, thereby reaffirming Governments commitment to inclusivity and support for the disabled community.The President launched the National Disability Policy in June 2021, which was a significant milestone in addressing challenges faced by persons with disabilities in Zimbabwe.\n\nThe policy aims to promote equal opportunities, accessibility, and empowerment for persons with disabilities across all sectors of society.Building on this initiative, the Government established the Technical National Coordination Committee in 2022 to oversee and guide the implementation of the policy.\n\nThe Committee plays a crucial role in ensuring that the objectives outlined in the policy translate into tangible improvements in the lives of persons with disabilities.\n\nTodays event at State House is expected to provide a platform for direct engagement between the President and representatives of persons with disabilities, allowing for discussions on progress, challenges, and further steps in policy implementation.Ends\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Emmerson-Mnangagwa-680x380.jpg",
            "description": "President Emmerson Mnangagwa is hosting persons with disabilities at State House in Harare today, thereby reaffirming Government’s commitment to inclusivity and support for the disabled community.",
            "time": "18:12",
            "date": "05 Mar 2025"
        },
        {
            "title": "Mutare dealer faces attempted murder charges",
            "url": "https://www.herald.co.zw/mutare-dealer-faces-attempted-murder-charges/",
            "content": "Crime Reporter\n\nEdward Muhamba, a dealer based in Mutare, has been arrested and charged with three counts of attempted murder after allegedly petrol bombing a house in the Greenside suburb while three individuals, including two minors, were asleep.\n\nHis legal representative, Mr Chris Ndlovu from Gonese and Ndlovu Legal Practitioners, appeared in court on his behalf.\n\nIn addition to the attempted murder charges, Muhamba faces one count of malicious damage to property for destroying the precast wall and gate of the targeted residence using a haulage truck.\n\nThe presiding magistrate, Mrs Phathekile Msipa, denied him bail, citing concerns about his potential flight risk to neighbouring countries.\n\nHe has been remanded in custody until March 20.\n\nProsecutor Ms Perseverance Musukuto argued vigorously against bail, providing details of the incident.\n\nShe stated that Muhamba, along with Salmon Muzonzini and other individuals, allegedly set fire to the home of Doreen Muchena following a business dispute between Muchena and Muzonzini.\n\nThe confrontation reportedly stemmed from a business partnership established in December 2024, in which Muzonzini provided Muchena with funds. When Muchena failed to account for the money, Muzonzini threatened her life if she did not return the funds.\n\nOn February 20 this year, at approximately 8:30pm, Muhamba allegedly collaborated with Muzonzini and two other accomplices, who remain at large, to attack Muchenas residence.\n\nThey used an unregistered yellow Scania truck and a silver Land Cruiser without registration numbers to reverse into the gate and the wall of the property, causing significant damage.\n\nAfter breaking a window, they reportedly threw a petrol bomb inside the house, igniting a fire while two children, aged 12 and 8, and a 20-year-old maid, Brenda Mutsonziwa, were inside. Fortunately, a neighbour intervened, rescuing the occupants by breaking a burglar bar on the lounge window.\n\nThe fire resulted in the roof of the house collapsing, with all interior possessions destroyed.\n\nThe estimated damage is around US$350 000. A witness, Sylvester Marangwanda, returning from Macs Shopping Centre, was able to identify the accused as they fled the scene in the silver Land Cruiser.\n\nThe case continues to develop as the investigation unfolds.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "Crime Reporter Edward Muhamba, a dealer based in Mutare, has been arrested and charged with three counts of attempted murder after allegedly petrol bombing a house in the Greenside suburb while three individuals, including two minors, were asleep. His legal representative, Mr Chris Ndlovu from Gonese and Ndlovu Legal Practitioners, appeared in court on his […]",
            "time": "18:12",
            "date": "05 Mar 2025"
        }
    ]
}