{
    "news": [
        {
            "title": "Mat South police ban dangerous weapons",
            "url": "https://www.herald.co.zw/mat-south-police-ban-dangerous-weapons/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe Zimbabwe Republic Police (ZRP) has imposed a three-month ban on carrying dangerous weapons in public in a bid to curb rising violent crimes in Beitbridge, Gwanda, Plumtree and Umzingwane Districts.\n\nIn a public notice, police announced that the ban will be in effect from March 27 to June 29, 2025.\n\nThe prohibited weapons include catapults, machetes, axes, knobkerries, swords, knives and daggers.\n\nThe ZRP said the decision was prompted by a spike in violent crimes, including murder, attempted murder, assault, robbery, domestic violence, unlawful entry, theft and rape.\n\nActing in terms of Section 2(4) of the Maintenance of Peace and Order Act (Chapter 11:23), I do hereby temporarily prohibit the carrying in public or public display of any of the following items capable of being used as weapons, namely catapults, machetes, axes, knobkerries, swords, knives or daggers from March 27 to June 29, 2025, reads the notice.\n\nFor the avoidance of doubt, it is declared that in terms of Section 4(4) of the Maintenance of Peace and Order Act, any person failing to comply with such a prohibition order shall be guilty of an offense and liable to a fine not exceeding level five or imprisonment for six months or to both such a fine and imprisonment, reads the notice.\n\nDuring this period, police will seize all prohibited weapons and arrest offenders found violating the order.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/zrp.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The Zimbabwe Republic Police (ZRP) has imposed a three-month ban on carrying dangerous weapons in public in a bid to curb rising violent crimes in Beitbridge, Gwanda, Plumtree and Umzingwane Districts. In a public notice, police announced that the ban will be in effect from March 27 to June 29, 2025. […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "Teachers not part of protests: Zimta",
            "url": "https://www.herald.co.zw/teachers-not-part-of-protests-zimta/",
            "content": "Ivan Zhakata\n\nTeachers have rejected plans to foment unrest in the country, underscoring the need for constructive engagement with authorities rather than disruptive demonstrations.\n\nIn an interview, Zimbabwe Teachers Association (Zimta) president, Mr Akuneni Maphosa reaffirmed the unions commitment to dialogue as the best approach to addressing teachers concerns.\n\nAs Zimta, we are a registered trade union that believes in engagements and dialogue with Government, he said.\n\nWe are not an organisation that meddles in politics, we do not participate in politics.\n\nWe are not against the Government and therefore our members are not going to be part of the March 31 protests, said Mr Maphosa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/dsfggfsdgfd.jpg",
            "description": "Ivan Zhakata Teachers have rejected plans to foment unrest in the country, underscoring the need for constructive engagement with authorities rather than disruptive demonstrations. In an interview, Zimbabwe Teachers Association (Zimta) president, Mr Akuneni Maphosa reaffirmed the union’s commitment to dialogue as the best approach to addressing teachers’ concerns. “As Zimta, we are a registered […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "Mashonaland West celebrates Chidhakwa’s RDC award",
            "url": "https://www.herald.co.zw/mashonaland-west-celebrates-chidhakwas-rdc-award/",
            "content": "Mashonaland West Bureau Chief\n\nZVIMBA DISTRICT is over the moon after its chief executive officer Mr Enias Chidakwa won the overall best leader in the rural local authorities category.\n\nMr Chidakwa beat 59 other CEOs from across the country on the back of impressive revenue collection and subsequent financing of budgeted projects.\n\nZvimba RDC also managed to build 13 classroom blocks in the period under review.\n\nIn an interview, Mr Chidakwa said his success hinged on leading a united team that pulls together in solving challenges and formulating strategies for growth.\n\nThis is an honour for Zvimba and Mashonaland West province, which continues to demonstrate its capacity to run local authorities, said Mr Chidakwa.\n\nHe noted the pressure from neighbouring urban local authorities  including Chinhoyi, Harare and Norton  puts healthy pressure on the council to perform.\n\nHis desire, he revealed, is to have Banket Local Board, Murombedzi Growth Point and Nyabira attain municipal and town statuses.\n\nMashonaland West province has maintained a tight grip on the accolade after Mhondoro-Ngezi RDC won the award last year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Zvimba-rdc.jpg",
            "description": "Mashonaland West Bureau Chief ZVIMBA DISTRICT is over the moon after its chief executive officer Mr Enias Chidakwa won the overall best leader in the rural local authorities category. Mr Chidakwa beat 59 other CEOs from across the country on the back of impressive revenue collection and subsequent financing of budgeted projects. Zvimba RDC also […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "BREAKING: Ignore calls for protests: Minister Muswere",
            "url": "https://www.herald.co.zw/breaking-ignore-calls-for-protests-minister-muswere/",
            "content": "Zvamaida Murwira\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has urged Zimbabweans to ignore calls for protests by misguided elements, assuring the nation that the countrys security sector is well-prepared to maintain law and order.\n\nDr Muswere said this while addressing the media in Harare on Saturday morning.\n\nAs official Government spokesman, I would like to assure the nation that peace and stability continue to prevail in our country in terms of the Constitution and all Zimbabweans should disregard misinformation and disinformation being peddled on social media platforms by cyber terrorists about the 31st of March, 2025, said Dr Muswere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/qefqef-1-680x380.jpg",
            "description": "Zvamaida Murwira Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has urged Zimbabweans to ignore calls for protests by misguided elements, assuring the nation that the country’s security sector is well-prepared to maintain law and order. Dr Muswere said this while addressing the media in Harare on Saturday morning. “As official Government spokesman, I […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "NEW: Masvingo province assures citizens of safety, security",
            "url": "https://www.herald.co.zw/new-masvingo-province-assures-citizens-of-safety-security/",
            "content": "George Maponga in MASVINGO\n\nSECURITY AGENTS in Masvingo province are on high alert to ensure the safety and security of residents.\n\nAt a press briefing at Benjamin Burombo Government Complex on Saturday, Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira said the Government will deal with those seeking to disrupt peace and normal business activities.\n\nThe briefing was also attended by members of the Joint Operations Command (JOC).\n\nMinister Chadzamira urged residents, businesses and public institutions, including schools, to continue their operations as usual, stating that their safety is guaranteed.\n\nOur various security arms of Government are on high alert in the wake of some social media posts calling for unlawful actions that undermine the prevailing peace and security in our province, he said.\n\nThe safety of our citizens in the province and visitors is guaranteed and we urge our people to continue with their day-to-day socio-economic activities in pursuance of Vision 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Minister-Chadzamira.jpg",
            "description": "George Maponga in MASVINGO SECURITY AGENTS in Masvingo province are on high alert to ensure the safety and security of residents. At a press briefing at Benjamin Burombo Government Complex on Saturday, Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira said the Government will deal with those seeking to disrupt peace and […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "NEW: Suspected serial armed robber appears in court",
            "url": "https://www.herald.co.zw/new-suspected-serial-armed-robber-appears-in-court/",
            "content": "Yeukai Karengezeka\n\nA 43-year-old man, Garikai Shangwa, suspected of being part of a syndicate behind a series of armed robberies, appeared in court on Friday facing five counts of robbery.\n\nHe was remanded in custody and advised to apply for bail at the High Court.\n\nShangwa is linked to multiple high-profile robberies, including the theft of US$74 000 from businessman Wicknell Chivayos in-laws at their Marondera farm.\n\nHe is also accused of participating in a violent robbery at Stapleford Farm in Nyabira on December 30, 2024, alongside accomplices Doubt Makumana, Doubt Stephen Kaseya Taurai  who is already on remand  and others still at large.\n\nAccording to the State, the gang first attacked two security guards at the farm, stealing their personal belongings, tying them up and threatening them with firearms to get information.\n\nShortly after, they ambushed a farm vehicle, stealing a shotgun and restraining both the driver and a supervisor.\n\nThe robbery escalated when the suspects broke into the farm owners residence, cutting through security fences before ransacking the house.\n\nThey reportedly stole an FN pistol, ammunition and US$40 000 in cash.\n\nThe gang later abandoned the stolen vehicle and divided the loot, which amounted to US$47 000 (including the pistol and ammunition).\n\nShangwa was arrested after police investigations, while some of his accomplices are still at large.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/08/Crime-Scene.jpg",
            "description": "Yeukai Karengezeka A 43-year-old man, Garikai Shangwa, suspected of being part of a syndicate behind a series of armed robberies, appeared in court on Friday facing five counts of robbery. He was remanded in custody and advised to apply for bail at the High Court. Shangwa is linked to multiple high-profile robberies, including the theft […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "NEW: Former CCC legislators convicted for unlawful gathering",
            "url": "https://www.herald.co.zw/new-former-ccc-legislators-convicted-for-unlawful-gathering/",
            "content": "Yeukai Karengezeka\n\nFORMER Citizens Coalition for Change (CCC) legislators Amos Chibaya and Costa Machingauta, along with three others, were convicted on Friday for participating in an unlawful gathering.\n\nThe ruling was delivered by magistrate Mrs Sharon Rakafa.\n\nHowever, 20 other accused individuals were acquitted after the court determined they had been arrested while merely walking along a road in Budiriro during the incident in 2023.\n\nMagistrate Rakafa ruled that these individuals were victims of a dragnet arrest, and the State failed to prove their involvement in the CCC gathering.\n\nThose convicted  Chibaya, Machingauta, Monica Mukwada, Aletta Viremai and Lancelot Tungwarara  were found guilty based on evidence that they were wearing CCC regalia and actively mobilising people to join the gathering.\n\nThe five were remanded out of custody and will return to court on Monday for sentencing.\n\nAccording to the State, on January 14, 2023, a total of 25 individuals, including those later acquitted, were invited to a CCC meeting at Machingautas residence in Budiriro 5B, Harare.\n\nThe invitation was reportedly shared on social media by Tungwarara.\n\nThe five convicted individuals were seen wearing CCC-branded caps, helmets and T-shirts at the gathering.\n\nThey allegedly chanted party slogans.\n\nPolice in Budiriro received a tip-off about the meeting and went to investigate.\n\nUpon arrival, they observed that the gathering was disturbing the peace.\n\nWhen officers ordered the group to disperse, the attendees reportedly resisted, leading to their arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-63.jpg",
            "description": "Yeukai Karengezeka FORMER Citizens Coalition for Change (CCC) legislators Amos Chibaya and Costa Machingauta, along with three others, were convicted on Friday for participating in an unlawful gathering. The ruling was delivered by magistrate Mrs Sharon Rakafa. However, 20 other accused individuals were acquitted after the court determined they had been arrested while merely walking […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "NEW: Parly sports committee meets Bulawayo councillors",
            "url": "https://www.herald.co.zw/new-parly-sports-committee-meets-bulawayo-councillors/",
            "content": "Zimpapers Sports Hub\n\nTHE Parliamentary Portfolio Committee on Sport is meeting Bulawayo City councillors Saturday morning to get an appreciation of the local authoritys thrust in providing facilities.\n\nDeputy director in the Ministry of Sport, Recreation, Arts and Culture Isaiah Mpofu confirmed the meeting on Saturday morning.\n\nThe councillors and parliamentarians will visit Barbourfields Stadium.\n\nCommittee chairperson Farai Jere and his committee have been to Harare, Mutare, Masvingo, Zvishavane, Hwange and Victoria Falls to get an appreciation of the situation on the ground.\n\nWhile enroute to Victoria Falls on Wednesday, they toured Khumalo Hockey Stadium and Queens Sports Club.\n\nOf concern is the dilapidation of facilities countrywide and promotion of bars at the expense of sport and recreation, according to Jere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/qwe.jpg",
            "description": "Zimpapers Sports Hub THE Parliamentary Portfolio Committee on Sport is meeting Bulawayo City councillors Saturday morning to get an appreciation of the local authority’s thrust in providing facilities. Deputy director in the Ministry of Sport, Recreation, Arts and Culture Isaiah Mpofu confirmed the meeting on Saturday morning. The councillors and parliamentarians will visit Barbourfields Stadium. […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "VP Chiwenga attending regional Catholic Bishops commemorations",
            "url": "https://www.herald.co.zw/vp-chiwenga-attending-regional-catholic-bishops-commemorations/",
            "content": "Mukudzei Chingwere\n\nVice President Dr Constantino Chiwenga has arrived at the Cathedral of the Sacred Heart of Jesus in Harare CBD for theMass to celebrate theGolden Jubilee of the Inter-Regional Meeting of Bishops of Southern Africa (IMBISA).\n\nThe Mass not only marks fifty years of collaboration but also celebrates the enduring commitment of the Church to the well-being of humanity and the advancement of communities.\n\nTheInter-Regional Meeting of Bishops of Southern Africa was established in 1975, and Zimbabwe is hosting the 50th anniversary.\n\nThe meeting has drawn Catholic Bishops from the region as well as several representatives of the church from the region.\n\nMore to follow\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/IMG-20250329-WA0003-680x380.jpg",
            "description": "Mukudzei Chingwere Vice President Dr Constantino Chiwenga has arrived at the Cathedral of the Sacred Heart of Jesus in Harare CBD for the Mass to celebrate the Golden Jubilee of the Inter-Regional Meeting of Bishops of Southern Africa (IMBISA). The Mass not only marks fifty years of collaboration but also celebrates the enduring commitment of the Church […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        },
        {
            "title": "‘Let’s entrench culture of dialogue’ . . . President hosts belated New Year’s reception for diplomats",
            "url": "https://www.herald.co.zw/lets-entrench-culture-of-dialogue-president-hosts-belated-new-years-reception-for-diplomats/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nTackling a myriad of pressing global challenges and resolving conflicts amicably needs fostering a culture of constructive dialogue on the international stage, President Mnangagwa has said.\n\nIn his remarks at a belated New Year reception with heads of diplomatic missions and international organisations accredited to Zimbabwe at State House yesterday, the President said on its part, Zimbabwe stood open for progressive dialogue with all nations.\n\nZimbabwe, he said, continued to position itself as a friend to all and enemy to none, guided by theforeign policy of engagement and re-engagement.\n\nMy Governments foreign policy thrust of engagement and re-engagement has seen responsive policies which harness opportunities and manage divergence. Undoubtedly, the ongoing engagements have opened new frontiers of cooperation and partnerships. I commend you all for your role in advancing this focus area.\n\nTogether, let us do more as we entrench a culture of dialogue in our international relations cooperation frameworks, he said.\n\nPresident Mnangagwa\n\nStill on the issue of dialogue, President Mnangagwa added: Zimbabwe remains open for dialogue aimed at the total removal of illegal sanctions.\n\nThe illegal economic sanctions, coupled with the prevalence of climate change-induced natural disasters and weather phenomenon, are negatively impacting our economy. However, domestic resource mobilisation, Diaspora remittances and inflows of foreign direct investments are augmenting the national fiscus.\n\nOur people and the economy are demonstrating extraordinary resilience, unity of purpose, innovation and resourcefulness, he said.\n\nThe President thanked SADC and other partners for their continued support in calling for the illegal embargoes unequivocal removal.\n\nI extend gratitude to our SADC family and African brothers and sisters for their principled support and solidarity as they amplify calls for the lifting of sanctions.\n\nWe also recognise the support we are receiving from the Group of Friends in Defence of the United Nations Charter, the Like-Minded Group and Non-Aligned Movement, said President Mnangagwa.\n\nHe reaffirmed Governments commitment to fostering inclusive growth, consolidating democracy and constitutionalism, while ensuring peace and stability for the overall economic prosperity of the general citizenry.\n\nThrough our multifaceted and people-centred development strategies, we are lifting more of our people out of poverty into prosperity. We look forward to journey this exciting path with you and the countries as well as organisations you represent.\n\nTogether, let us navigate the complex challenges affecting our world and the immense opportunities presented before us, he said.\n\nYesterdays gathering of ambassadors and international organisations facilitated closer interaction between the heads of missions and the Government.\n\nAs such, the President rallied them to submit objective and factual reports about Zimbabwe to their countries.\n\nMay you find the satisfaction and pride in taking our relations to a new level. Our doors remain open and arms outstretched as we dialogue and work in harmony towards a shared prosperity and brighter future for our peoples, said President Mnangagwa.\n\nZimbabwe, he said, maintained its stance as a friend to all and enemy to none, emphasising that the country was very much open for business.\n\nWe are open for business, and your nationals are welcome to pursue investments in our mining sector. Further, leveraging our strategic central location in the southern region, we are determined to work with our neighbours and investors to expand and modernise the North-South Corridor to enhance global supply chains and logistics, said the President.\n\nAt the broader international level, President Mnangagwa said Zimbabwe was committed to the protection of multilateralism and upholding the principles of the United Nations Charter, while rallying for support in its bid for a non-permanent United Nations Security Council seat.\n\nThe principles of equality and respect for each others interests should always guide us in our interactions. There are no big or small nations. Zimbabwes candidature for a non-permanent seat on the United Nations Security Council for the term 2027 to 2028, has been endorsed by SADC and the African Union.\n\nOur candidacy is deeply rooted in our commitment to global peace and security, an inclusive, fair and equitable international rule-based system, said the President.\n\nHe said the Second Republic was undertaking reforms across the board to ensure the countrys attainment of upper-middle-class economic status by 2030.\n\nThis has resulted in various political, economic and legislative reforms as well as the implementation of a broad array of people-centred projects to guarantee household food security, improve incomes and develop critical enablers to propel the modernisation and industrialisation of our economy.\n\nThe projected recovery in agriculture output is expected to drive economic growth to 6 percent, buoyed by the expected bumper harvest, following a successful summer season, said the President.\n\nHe appraised the diplomats on some of the initiatives being rolled out by Government towards the realisation of national goals.\n\nGovernment introduced the concept of village business units and nutritional gardens. Under the Presidential Drilling Programme, we are drilling boreholes in all our 35 000 villages.\n\nWe, thus, invite your missions to partner these initiatives from the perspective of training and capacity building as well as value addition and sourcing of export markets as we promote market driven productivity.\n\nUnder our agriculture transformation strategy and the village business unit concept, Zimbabwe envisions improved incomes and higher standards of living for our grassroots communities and to also contribute to global food security and nutrition, said the President.\n\nIn mitigating climate change, we are expanding dam construction, water conveyancing and resuscitating irrigation schemes. These initiatives provide scope for further partnerships, cooperation, and investments. The growth of the agriculture sector, as the bedrock of our agriculture-based industry, entails the need for retooling, expansion and diversification of our manufacturing sector. I challenge you, Your Excellencies, in your missions, to promote investments along related value chains.\n\nPresident Mnangagwa acknowledged the role played by the ambassadors in promoting Zimbabwe as a favourable and enjoyable tourist destination.\n\nOur national tourism sector has room for expansion across the provinces of our country I encourage you to scale up the promotion of investments and people to people exchanges between Zimbabwe and your jurisdictions, he said.\n\nAfrica, the SADC region and Zimbabwe, said the President, have re- purposed their development towards the modernisation, value addition, and industrialisation of their economies.\n\nRiding on our abundant natural resources, science, technology and innovation solutions, I exhort your missions to deliberately promote cooperation from your capitals around these aspects, as we create stronger synergies for the Africa we all want.\n\nMeanwhile, my Government looks forward to positive outcomes of engagements with the international community under the arrears clearance and debt resolution process, he said.\n\nOn last years El Nino-induced drought, the President said: The humanitarian aid, technical expertise and moral support received last year, from some of your countries and organisations, following my declaration of the El-Nino induced drought as a national disaster, was timely and greatly appreciated. These acts of kindness remind us of the power of unity in overcoming challenges.\n\nAs the current SADC Chair, President Mnangagwa said Zimbabwe wouldcontinue promoting innovation to unlock opportunities for sustainable economic growth and development towards an industrialised SADC.\n\nOn the peace and security challenges in the region, particularly in the eastern Democratic Republic of Congo, he said Zimbabwe, was playing its part through SADC and East African Community initiatives, to find lasting peace.\n\nWe continue to call for an immediate ceasefire and the cessation of hostilities as well as the pursuit of dialogue, as a panacea for sustainable peace and stability in the region. We once again appeal for the provision of humanitarian assistance to the displaced persons from the international community, he said.\n\nOn his part, the Dean of the diplomatic corps, Rwandan Ambassador James Musoni, said they would continue rallying behind President Mnangagwas leadership.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-with-Mr-James-Musoni-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter Tackling a myriad of pressing global challenges and resolving conflicts amicably needs fostering a culture of constructive dialogue on the international stage, President Mnangagwa has said. In his remarks at a belated New Year reception with heads of diplomatic missions and international organisations accredited to Zimbabwe at State House yesterday, the President […]",
            "time": "18:41",
            "date": "29 Mar 2025"
        }
    ]
}