{
    "news": [
        {
            "title": "Private players empower communities through key development projects",
            "url": "https://www.herald.co.zw/private-players-empower-communities-through-key-development-projects/",
            "content": "Herald Reporter\n\nPRIVATE players have reaffirmed their commitment to uplifting vulnerable communities across the country through a series of development projects targeting critical needs in education, healthcare, and youth empowerment.\n\nIn a statement released today, the Rotary Club of Msasa in Harare outlined progress in three ongoing initiatives empowering young mothers in Ruwa, upgrading education infrastructure in Beatrice, and renovating a mission clinic in Chivhu.\n\nSpeaking on the visit to Charltan Trust, a home for teenage mothers in Ruwa, the Rotary Club said the project exemplifies service above self.\n\nMany of these young women have no family support. Charltan Trust provides them with a safe place to live, grow, and learn while raising their children, read the statement.\n\nWe donated fabric materials and two sewing machines to enhance their skills training and income-generating projects.\n\nThe club added that this is not just a donation of tools but an investment in their future.\n\nThe young mothers, who produce handmade bags and hats, recently secured a contract to supply an exclusive international outlet in Harare, a major step toward economic independence, said the club.\n\nThese are the people we are called to serve those society has forgotten. Empowering them is the essence of Rotary.\n\nIn Beatrice, the club is overseeing the local implementation of the Manyoshwa Primary School Project. The US$67 703 project involves constructing classroom blocks and toilets for a rural farming community.\n\nThis is a community-driven initiative. Residents are providing labour and materials, and we are ensuring transparency and accountability, said the club.\n\nA site visit held on September 20 2024, confirmed readiness for the implementation stage.\n\nWe are excited to witness transformation where it is needed most, the Club said.\n\nDaramombe Mission Clinic located in Chivhu and serving both Chikomba and Buhera districts, is also receiving attention.\n\nThe clinic urgently needs a reliable water supply, solar power, and modern equipment, the Club said.\n\nWe are actively seeking partners to help rehabilitate the facility and restore dignity to rural healthcare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/12/herald-newspapers1.jpg",
            "description": "PRIVATE players have reaffirmed their commitment to uplifting vulnerable communities across the country through a series of development projects targeting critical needs in education, healthcare, and youth empowerment.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Traditional grains boost food and nutrition security:Govt",
            "url": "https://www.herald.co.zw/traditional-grains-boost-food-and-nutrition-securitygovt/",
            "content": "Patience Maturure\n\nAgriculture Correspondent\n\nTraditional grains have the potential to boost food and nutrition security, a senior Government official has said.\n\nAddressing farmers at a sorghum field day held at Mukarati Village, Ward 19, Muzarabani today, Lands, Agriculture, Fisheries, Water and Rural Development Permanent Secretary Professor Obert Jiri said traditional grains had the potential to improve livelihoods especially of people in low rainfall areas such as Muzarabani.\n\nWe know this area is hot, receives low rainfall but has rich soils. Traditional grains do well in this region and we encourage our farmers to grow crops according to their agro-ecological regions. They should go by nature.\n\nWhere there is low rainfall we must respond by growing traditional grains which give us good yields, he said.\n\nThis initiative aims to improve food security by providing farmers with the necessary support and inputs to increase their yields, improving their livelihoods and promoting the production and consumption of traditional grains.\n\nProf Jiri emphasised that sorghum yields that had been achieved this season are a testament to the potential of traditional grains in Muzarabani District.\n\nThat is the grain we must eat because it is naturally bio fortified with rich nutrients like zinc, magnesium and so forth, he said.\n\nProf Jiri said the swap programme whereby farmers could exchange their traditional grains for maize was still operational.\n\nHe however, urged farmers to eat traditional grains which are healthier.\n\nThe field day was aimed at providing a platform for farmers to share knowledge and best practices on sorghum production.a\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "Traditional grains have the potential to boost food and nutrition security, a senior Government official has said.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "President arrives in Uganda for Africa Regional Forum on Sustainable Development",
            "url": "https://www.herald.co.zw/president-arrives-in-uganda-for-africa-regional-forum-on-sustainable-development/",
            "content": "Wallace Ruzvidzo in KAMPALA, Uganda\n\nPresident Mnangagwa has arrived in Kampala, Uganda, where he is set to attend the 11th session of the Africa Regional Forum on Sustainable Development (ARFSD-11).\n\nHe was welcomed at the airport by Ambassador of Zimbabwe to Kenya, Uganda and Somalia Winpeg Moyo and officials from the Ugandan Government.\n\nThe forum is being held under the theme Driving job creation and economic growth through sustainable, inclusive, science-and evidence-based solutions for the 2030 Agenda and Agenda 2063.\n\nThe forum is being jointly organised by the United Nations Economic Commission for Africa (ECA) and the Government of Uganda in collaboration with the African Union Commission, the African Development Bank and the United Nations system organisations.\n\nPresident Mnangagwa is accompanied by Foreign Affairs and International Trade Minister, Professor Amon Murwira; Finance, Economic Development and Investment Promotion Minister, Professor Mthuli Ncube, Presidential spokesperson Mr George Charamba and other Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/IMG-20250408-WA0103-680x380.jpg",
            "description": "President Mnangagwa has arrived in Kampala, Uganda, where he is set to attend the 11th session of the Africa Regional Forum on Sustainable Development (ARFSD-11).",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Muzarabani farmers strike gold with sorghum",
            "url": "https://www.herald.co.zw/muzarabani-farmers-strike-gold-with-sorghum/",
            "content": "Felistas Tavarera\n\nFARMERS in Muzarabani are basking in the glory of a successful season in which they managed to grow more sorghum, which will enhance their livelihood.\n\nSpeaking during a field day in Mukarati Village, Muzarabani District Ward 19 today, Permanent Secretary Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Professor Obert Jiri, said the sorghum yields achieved this season show the potential of traditional grains in the area.\n\nWe are thrilled with the sorghum yields that you have achieved this season, which demonstrate the vast potential of traditional grains in your area; with the right support and inputs, we are confident you can increase our yields and improve your livelihoods, he said.\n\nThe event drew over 100 farmers, who shared knowledge and best practices on sorghum production.\n\nThe field day provided a valuable platform for farmers to exchange ideas and learn from each other; it also showcased the nutritional benefits of traditional grains, which are rich in essential nutrients like zinc and magnesium, Prof Jiri said.\n\nThe event was organised by Farm Biz, which is working to promote the production and consumption of traditional grains in the region. We believe traditional grains hold the key to improving food security and livelihoods in our region.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-1-copy-680x380.jpg",
            "description": "FARMERS in Muzarabani are basking in the glory of a successful season in which they managed to grow more sorghum, which will enhance their livelihood.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Jere addresses players, technical team",
            "url": "https://www.herald.co.zw/jere-addresses-players-technical-team/",
            "content": "Zimpapers Sports Hub\n\nCAPS United president Farai Jere today addressed players and the technical team in the wake of last Sundays protests by disgruntled fans over the Harare giants poor start to the season.\n\nJere visited the team at their training ground in Harare as they resumed preparations for the blockbuster fixture against Highlanders set for this Sunday at Barbourfields.\n\nCAPS United supporters raised objections against coach Lloyd Chitembwe following the 1-2 home defeat to log leaders Ngezi Platinum Stars at the weekend.\n\nThe supporters were not happy with the slow take off this season, as Makepekepe have managed just four points from the opening five matches. They have won only one game, drawn once and lost thrice, much to the disappointment of the clubs supporters.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/08/Farai-Jere.jpg",
            "description": "CAPS United president Farai Jere today addressed players and the technical team in the wake of last Sunday's protests by disgruntled fans over the Harare giants' poor start to the season.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Stanbic revel in hockey tourney success",
            "url": "https://www.herald.co.zw/stanbic-revel-in-hockey-tourney-success/",
            "content": "Zimpapers Sports Hub\n\nSTANBIC Bank Zimbabwe continues to be a vehicle of change in sport with their sponsorship of the St Georges College Stanbic Hockey 5s tournament bringing schools across the social demography together.\n\nThe bank has been the main sponsor of the internationally recognised five-aside Hockey festival, commonly referred to as Hockey 5s, for over three years and this year poured in US$10 000 towards the two-day youth extravaganza at St Georges College in Harare.\n\nThis year event held attracted schools like Kutama College, St Ignatius College, Tynwald 1, Mbare Academy, St Georges College, Hellenic Academy, Lomagundi and Christian Brothers College (CBC), institutions that normally dont get the opportunity to rub shoulders with each other.\n\nSt Georges head of hockey, Denford Kumundati commended Stanbic Bank for bankrolling almost all the major needs of the event, which included perimeter boards, meals for participants and officials.\n\nThe sponsorship by Stanbic Bank was pivotal in the smooth running of the event which continues to grow in leaps and bounds each year.\n\nThe number of participating schools grew from last years 33 to 48 this year, said Kumundati.\n\nHe said the importance of the sponsorship by Stanbic Bank could never be over emphasised as it facilitated for the participation of both elite and development schools who came together to showcase their hockey talents under one roof.\n\nThe tournament is significant towards the development of hockey in the country and is the only tournament outside of key national hockey matches and competitions, he said.\n\nStanbic Bank acting head, brand and marketing, Tariro Memo, said the leading financial services institution took great joy in playing a pivotal role in promoting the skills of young and upcoming hockey players.\n\nOver the years we have supported hockey at national level as part of the sports pillar under our sponsorship initiatives.\n\nOur support for Hockey 5s is meant to prop up grassroots hockey development and we hope that these players will feed into the senior national teams thus enhancing the levels of competitiveness of our national teams, said Memo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-5-2-680x380.jpg",
            "description": "STANBIC Bank Zimbabwe continues to be a vehicle of change in sport with their sponsorship of the St George’s College Stanbic Hockey 5’s tournament bringing schools across the social demography together.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Collaborations can propel us forward – Doc Vikela",
            "url": "https://www.herald.co.zw/collaborations-can-propel-us-forward-doc-vikela/",
            "content": "Trust Khosa\n\nZimpapers Arts and Entertainment Hub\n\nStand-up comedian, radio personality and content creator, Doc Vikela, has emphasised the importance of collaboration among creatives in the comedy sector to drive the industry forward.\n\nBorn Victor Mpofu, the versatile entertainer, who has been in the game for nearly two decades, believes that the new generation of comedians can still learn valuable lessons from their experienced colleagues.\n\nIn an interview, Doc Vikela noted that collaborations have made comedy in neighbouring countries more refreshing and engaging.\n\nI have been involved in comedy for almost two decades grooming a number of comics but I have observed that the new school has much to learn. What we need from them is an exchange of ideas with the seasoned ones to ensure we provide fans with a variety of content. People now want fresh jokes, but we cannot overlook the old guard that paved the way for them, he stressed.\n\nThrough his Simukua Academy, Doc Vikela has produced several comedians including King Kandoro, Mike Chipere, Munya Guramatunhu and Boss Kedha among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/06/Doc-Vikela.jpg",
            "description": "Stand-up comedian, radio personality and content creator, Doc Vikela, has emphasised the importance of collaboration among creatives in the comedy sector to drive the industry forward.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "Filmmaker Mudzvova celebrates successful short film premiere",
            "url": "https://www.herald.co.zw/filmmaker-mudzvova-celebrates-successful-short-film-premiere/",
            "content": "Trust Khosa\n\nZimpapers Arts and Entertainment Hub\n\nPROLIFIC filmmaker Jabulani Mudzvova has celebrated the recent premiere of his short film, Residue, as a resounding success that brought creatives together under one roof.\n\nAttracting 100 guestssurpassing the expected 90Mudzvova is optimistic about taking the film to major cinemas in cities like Bulawayo after the Harare premiere.\n\nIn an interview with Zimapers Arts and Entertainment Hub, Mudzvova praised the stakeholders who contributed to the premieres success.\n\nHonestly, its incredible to see an event that we worked so hard to pull off receive the reception it deserves, particularly for the dedicated cast and crew involved, he said.\n\nIts great to witness what was once merely an idea come to life and show our people what we can achieve when we put our heads down and work. Being in a crowd, hearing applause and answering questionsthats the final piece of the art for us as The Authors Collective.\n\nThis refreshing project showcases the talents of artists, thanks to The Authors Art Collective.\n\nIt features a stellar cast including household names such as AneUnhu Gwatidzo, Kuda Rice, Chloe Ncube and Africa Academy Award-nominated actress Charmaine Mujeri.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-3-680x380.jpg",
            "description": "PROLIFIC filmmaker Jabulani Mudzvova has celebrated the recent premiere of his short film, 'Residue', as a resounding success that brought creatives together under one roof.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "SOEs sign performance contracts",
            "url": "https://www.herald.co.zw/soes-sign-performance-contracts/",
            "content": "Anesu January\n\nHerald Correspondent\n\nState-Owned Enterprises (SOEs) under the Ministry of Information Communication Technology, Postal and Courier Services on Monday signed performance contracts as part of the Governments efforts to improve transparency, efficiency and accountability.\n\nThree enterprises: Zimpost, Postal and Telecommunications Regulatory Authority of Zimbabwe (POTRAZ) and Zimbabwe Academic Research Network (ZARNet) signed the contracts.\n\nThe contracts outline strategic objectives for each organisation to propel Zimbabwe to achieve Vision 2030 and transform Zimbabwe into a middle-income society by 2030.\n\nSpeaking at the event, Information Communication Technology, Postal and Courier Services Minister Tatenda Mavetera said the ministry is an economic enabler for all activities in Government, and it is important for the State-owned enterprises to keep working hard.\n\nLet us come up with ways that will make sure that we can achieve the target that we have set as a country, she said.\n\nMinister Mavetera said there should be regular updates from the SOEs to show the work they are doing in helping digitalise Zimbabwe.\n\nWe need weekly updates, she said. This was the vision of our President, of us having 100-day plans, and if you do not do anything, then you will not have anything to report in 100 days.\n\nShe expressed her gratitude for the efforts that were made last year by the enterprises saying there is a need for fresh thinking and innovative ideas.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Potraz-680x380.jpg",
            "description": "State-Owned Enterprises (SOEs) under the Ministry of Information Communication Technology, Postal and Courier Services on Monday signed performance contracts as part of the Government’s efforts to improve transparency, efficiency and accountability.",
            "time": "18:44",
            "date": "08 Apr 2025"
        },
        {
            "title": "ZION Apostolic Church bishop Shava buried",
            "url": "https://www.herald.co.zw/zion-apostolic-church-bishop-shava-buried-2/",
            "content": "Victor Maphosa\n\nRecently in Ngundu, Masvingo\n\nZion Apostolic Faith Mission in Zimbabwes Bishop Jason Jeremiah Mugari Shava, who died on March 25 2025, after a long illness, was buried at the churchs Jeru Headquarters in Ngundu, Masvingo Province over the weekend.\n\nBishop Shava died at his home in Mundingi Village under Chief Shindi in Masvingo after a long illness.\n\nHe was 87.\n\nMourners gathered at the church headquarters to pay their last respects to the revered bishop, with many testifying to the Godly works he was conducting in the community.\n\nThe Government accorded him liberation hero status for his immense contribution to Zimbabwes liberation war.\n\nSpeaking on behalf of the Shava family, Mr Justice Shava said the death of their father has left the family devastated and with a void that will be hard to fill.\n\nHe said their father was a loving man, a teacher, a comforter and a man who feared God.\n\nAs a family, we have lost a great man. This is a difficult moment for us and the church as a whole, he said.\n\nHe was a man who instilled a sense of hard work in all of us. He taught us to be self-reliant; he told us to use our hands and earn a decent living. He taught everyone including youths to use their hands to earn a living.\n\nHe was a man who loved discipline, he taught us to be self-disciplined. As a family, we are saddened by this huge loss. We pray that another great man will come up and lead the church and the family.\n\nWe want to thank President Mnangagwa for the (liberation) hero status given to our father. We never expected our father to be bestowed with hero status. We are so humbled by this and the whole family is grateful.\n\nZION Church Archbishop Jameson Pedzisai, popularly known as Archbishop Andreas the Third, said the death of Bishop Shava was a blow to the church.\n\nHe had a large following, and the flock has been left without its shepherd, especially now that we are about to celebrate the Easter holidays, he said.\n\nThis is hard for the church. Our wish is for the church to remain united as they look for a successor. The Bishop was hardworking and a unifier.\n\nWe pray that the one who is going to be a successor will also be a disciplined person and a unifier just like the late Bishop Shava.\n\nWe also want to thank the Government for the hero status. You see, Bishop Shava supported the ruling party wholeheartedly. He supported Government programmes in this community and he commanded a lot of respect from everyone.\n\nTo the Shava family, we are with you in our prayers and our wish is for you to be comforted and also to remain united, he said.\n\nBishop Shava left behind three wives, 26 children, 75 grandchildren and 35 great-grandchildren.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-2-3-680x380.jpg",
            "description": "  Victor Maphosa Recently in Ngundu, Masvingo Zion Apostolic Faith Mission in Zimbabwe’s Bishop Jason Jeremiah Mugari Shava, who died on March 25 2025, after a long illness, was buried at the church’s Jeru Headquarters in Ngundu, Masvingo Province over the weekend. Bishop Shava died at his home in Mundingi Village under Chief Shindi in […]",
            "time": "18:44",
            "date": "08 Apr 2025"
        }
    ]
}