{
    "news": [
        {
            "title": "640 hours of unpaid labour for attempted murder",
            "url": "https://www.herald.co.zw/640-hours-of-unpaid-labour-for-attempted-murder/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA 46-year-old woman from Tshithaudze, Beitbridge, has been sentenced to 640 hours of community service for stabbing a neighbour and inflicting near fatal injuries.\n\nJennifer Moyo was enraged when she saw her neighbour Lissed Shumba fighting with her daughter.\n\nShe took a knife and stabbed Shumbas head twice and once on the back.\n\nMoyo was convicted on one count of attempted murder when she appeared before Beitbridge regional magistrate Ms Charity Maphosa on Tuesday.\n\nShe was sentenced to five years in prison.\n\nHowever, three years were conditionally set aside for five years while the remaining two years were suspended on condition that she performs 640 hours of community service at Dulivhadzimu Clinic.\n\nThe State, led by Miss Tsitsi Mutukwa, said on January 14 at around 8 pm, Shumba had a misunderstanding with Moyos daughter and this resulted in a fist fight.\n\nUpon seeing the two fighting, Moyo intervened.\n\nShe took a kitchen knife and stabbed Shumba.\n\nThe fight was stopped by a mob and the matter was reported to the police.\n\nShumba was taken to Beitbridge District Hospital for treatment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/faq-whats-the-difference-between-aggravated-assault-and-attempted-murder-680x380.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 46-year-old woman from Tshithaudze, Beitbridge, has been sentenced to 640 hours of community service for stabbing a neighbour and inflicting near fatal injuries. Jennifer Moyo was enraged when she saw her neighbour Lissed Shumba fighting with her daughter. She took a knife and stabbed Shumba’s head twice and once on […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Police to impound unregistered vehicles",
            "url": "https://www.herald.co.zw/police-to-impound-unregistered-vehicles-3/",
            "content": "Crime Reporter\n\nThe Zimbabwe Republic Police has warned motorists driving vehicles with no registration number plates that they risk having them impounded.\n\nGovernment vehicles are also not excluded from this.\n\nIn a statement, national police spokesperson Commissioner Paul Nyathi said, The Zimbabwe Republic Police warns the public against driving vehicles with no registration plates.\n\nIn terms of the Vehicle Registration and Licensing Act, no vehicle, whether private or company owned, should be driven on the countrys roads with no number plates.\n\nThe Zimbabwe Republic Police will thus impound any vehicle found on the roads with no plates.\n\nGovernment vehicles are not excluded from the number plates requirement.\n\nHe also said motorists are implored to comply with regulations and fit proper and stipulated headlights on their vehicles.\n\nIn this regard, any vehicle driven on the roads while fitted with ballad or bar lights in clear contravention of the countrys laws and road safety requirements will be impounded and the owner or driver prosecuted, he said.\n\nThe Zimbabwe Republic Police urges motorists to observe road rules and regulations to safeguard lives on the roads, said Commissioner Nyathi.\n\nMeanwhile, the Commissioner-General of Police Stephen Mutamba has directed the police to arrest kombi drivers whose touts hang on the back of moving vehicles.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/05/police.jpg",
            "description": "Crime Reporter The Zimbabwe Republic Police has warned motorists driving vehicles with no registration number plates that they risk having them impounded. Government vehicles are also not excluded from this. In a statement, national police spokesperson Commissioner Paul Nyathi said, “The Zimbabwe Republic Police warns the public against driving vehicles with no registration plates.” In […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Businessman approaches court over death threats",
            "url": "https://www.herald.co.zw/businessman-approaches-court-over-death-threats/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA Harare businessman is living in fear after a Dzivarasekwa bouncer threatened to kill him and kidnap his children, the court has heard.\n\nMalcom Sikitara (42) appeared in court facing charges of threatening to kill Musa Muteteli (35).\n\nHe was remanded out of custody to February 27 for routine remand when he appeared before Harare magistrate, Ms Ethel Chichera.\n\nIt is the States case that on February 8, 2025, Sikitara went to Mutetelis workplace in Belvedere, Harare, and threatened to kill the complainant and kidnap his children.\n\nThe court heard that Sikitara continued with the threats.\n\nMuteteli is now living in fear for his life and that of his family.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "  Prosper Dembedza Herald Correspondent A Harare businessman is living in fear after a Dzivarasekwa bouncer threatened to kill him and kidnap his children, the court has heard. Malcom Sikitara (42) appeared in court facing charges of threatening to kill Musa Muteteli (35). He was remanded out of custody to February 27 for routine remand […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Madziwa FM back on air, seeks assistance to build new structures",
            "url": "https://www.herald.co.zw/madziwa-fm-back-on-air-seeks-assistance-to-build-new-structures/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nMadziwa FM is back on air following a brief hiatus that was caused by a devastating storm that damaged its studios.\n\nThe stations vice chairperson Mr Jack Soko said they have only managed to patch the roof of the studio to enable them to start broadcasting again.\n\nUnfortunately, the storm also damaged the antenna, which reduced the stations area of coverage.\n\nWe began broadcasting last week so that our listeners can catch up on news and current affairs, he said.\n\nHowever, the building we are using has been condemned, and we are looking forward to constructing new facilities.\n\nMr Soko also mentioned that the Chaminuka Rural District Council has allocated them a stand for this purpose, and he appealed for assistance to help build new studios and to furnish them.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/madziwa-fm-680x380.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau Madziwa FM is back on air following a brief hiatus that was caused by a devastating storm that damaged its studios. The station’s vice chairperson Mr Jack Soko said they have only managed to patch the roof of the studio to enable them to start broadcasting again. Unfortunately, the storm […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Restrictive fees, permits must go: President",
            "url": "https://www.herald.co.zw/restrictive-fees-permits-must-go-president/",
            "content": "Farirai Machivenyika and Wallace Ruzvidzo\n\nAll ministries should ensure that business does not suffer from prohibitive regulations as well as punitive administrative licences and fees, President Mnangagwa has said.\n\nIn his address at the First Meeting of the 2025 Cabinet Year on Tuesday, the President said instead of being restrictive, fees, licences, permits and regulations should promote economic development.\n\nTo enhance the overall performance of our economy, the Ease of Doing Business Agenda continues to be an important aspect of our programming.\n\nIn that regard, concerted efforts must be made to revisit all the areas that hinder the start or growth of all investments, whether local or foreign.\n\nI commend the entrepreneurial spirit among our people. By nature, Zimbabweans are hardworking, he said.\n\nTowards that end, Parliaments Portfolio Committee on Industry and Commerce yesterday convened to discuss the challenges faced by manufacturers and retailers in the formal sectors.\n\nConfederation of Zimbabwe Industries (CZI) chief economist, Dr Cornelius Dube, said there was need for legislation requiring Government ministries, departments and agencies to procure a specific percentage of their goods and services from local suppliers to boost the economy.\n\nGovernment should come up with legislation or a statutory instrument that compels it to buy a prescribed threshold for its goods and services from local suppliers, he said.\n\nDr Dube argued that this measure would enhance competitiveness and boost demand for local products.\n\nConfederation of Zimbabwe Retailers (CZR) president Mr Denford Mutashu highlighted the unfair competition posed by informal traders.\n\nThere are a lot of regulations and cost centres that we are facing as formal traders that those in the informal sectors are not paying. This makes our prices uncompetitive.\n\nThe closure of formal businesses could negatively impact other sectors, such as banking and finance, due to a decline in deposits, he said.\n\nIn her presentation, chief executive officer of the Consumer Council of Zimbabwe (CCZ) Ms Rosemary Mpofu-Chikarakara stressed the importance of addressing exchange rate discrepancies, foreign exchange shortages, and market distortions that encourage arbitrage.\n\nThe CCZ also wants smuggling stopped.\n\nIssues of porous border posts also need to be seriously dealt with and punitive (and) deterrent measures such as jail terms need to be introduced in order to curb these challenges.\n\nGovernment and the affected businesses can partner and aggressively invest and deploy advanced monitoring technologies, including drones, CCTV, and automated scanning systems, at all major border posts.\n\nAll imported products should abide by the rules, with no exemptions of who is importing. As long as there are other importers who are exempted from paying duty, loopholes will always be created and these products will then find their way both in the formal and informal market, creating an unfair playing field with the businesses that pay duties, the CCZ said.\n\nPortfolio Committee chairperson Cde Clemence Chiduwa acknowledged the concerns raised at the meeting.\n\nWe have taken note of the presentations and we will compile a report that we will table in the House for debate, he said.\n\nThe Committee aims to find viable solutions to support the local industry and create a fair competitive environment.\n\nThe Government and the Reserve Bank have taken taken steps to formalise the informal sector as part of broader measures outlined in the 2025 Monetary Policy Statement announced last Thursday, aimed at enhancing Government tax revenues and stabilising the economy.\n\nA week earlier, Finance, Economic Development and Investment Promotion Professor Mthuli Ncube announced measures to rein the burgeoning informal sector that was threatening the survival of formal businesses.\n\nThe RBZ Monetary Policy emphasises the need for both the informal and formal sectors to align, creating a more cohesive economic environment.\n\nRBZ Governor Dr John Mushayavanhu is advocating for the integration of informal businesses into a system that includes dual currencies, bank accounts, and electronic payments, which is essential for achieving the Governments economic goals.\n\nUnder the new regulations, items on a list of commonly smuggled goods will be presumed smuggled unless merchants can provide valid customs clearance.\n\nThis initiative places pressure on businesses to ensure compliance and legitimacy in their operations.\n\nGovernment will implement a presumptive retail-level VAT that manufacturers must collect when selling to small or informal businesses lacking tax clearance certificates.\n\nThis measure restricts wholesalers from engaging with unlicensed entities, further pushing informal businesses towards formalisation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Untitled-83-2.jpg",
            "description": "Farirai Machivenyika and Wallace Ruzvidzo All ministries should ensure that business does not suffer from prohibitive regulations as well as punitive administrative licences and fees, President Mnangagwa has said. In his address at the First Meeting of the 2025 Cabinet Year on Tuesday, the President said instead of being restrictive, fees, licences, permits and regulations […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zim to correct wrong narrative in Geneva",
            "url": "https://www.herald.co.zw/zim-to-correct-wrong-narrative-in-geneva/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nZimbabwe Ambassador-designate to the United Nations Office in Geneva, Ever Mlilo, has pledged to further the countrys interests as well as correct the negative narrative pushed by the countrys erstwhile detractors during her tenure in Switzerland.\n\nThe newly-appointed Permanent Representative to the UN Office in Geneva yesterday paid a courtesy call on President Mnangagwa, where she was briefed on her tasks.\n\nIn an interview after her meeting with the President, Ambassador Mlilo said in addition to pursuing the countrys economic development interests, she would use every means to correct the countrys narrative on the global stage.\n\nI will be advancing the cause of Zimbabwe, the interests of Zimbabwe, increasing the visibility of Zimbabwe in the international forum.\n\nI will also be pursuing economic development as it is guided by our mantra, Zimbabwe is Open for Business, we are open to business, and also to correct the wrong narrative that is out there about Zimbabwe.\n\nWe need to tell them who we are and what we stand for, and we are going to use every means to correct the narrative, especially at the United Nations Human Rights Council, and the International Labour Organisation, she said.\n\nAmbassador Mlilos mission to Geneva is her first diplomatic posting.\n\nIt is a moment of tremendous privilege . . . It is an honour that has been bestowed on me by His Excellency the President to represent him in this capacity and the great nation of Zimbabwe.\n\nI am grateful and I am forever indebted to him, she said.\n\nMrs Mlilo said she was confident that her expansive career in the Zimbabwe Republic Police and as a legal officer prior to her diplomatic posting, would help her in the discharge of duties.\n\nI am a legal officer by profession and I have served in the police force for 20 years. I think that is requisite experience that will see me execute the duties as they have been instructed by His Excellency, she said.\n\nAmbassador Mlilo also had some words of encouragement for the girl child.\n\nIt takes hard work to leave a mark, where you have been given an opportunity to execute a duty, do it to the best of your abilitywe have a good leader, our President will always recognise where good work is, she said.\n\nMrs Mlilo then narrated her career from her early school days, up until she was called from retirement by President Mnangagwa for the diplomatic mission.\n\nI went to school in Bulawayo, then finished at Queen Elizabeth (in Harare), joined the police force at a very young age, trained as a lawyer and I was already serving in the police force, rose through the ranks in the police force until I was a Commissioner and Director of Legal Services, then I retired to do lecturing and farming. And I was recalled by His Excellency to serve the country, said the mother of two.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-3.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Zimbabwe Ambassador-designate to the United Nations Office in Geneva, Ever Mlilo, has pledged to further the country’s interests as well as correct the negative narrative pushed by the country’s erstwhile detractors during her tenure in Switzerland. The newly-appointed Permanent Representative to the UN Office in Geneva yesterday paid a courtesy call […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Minister Muchinguri-Kashiri bemoans escalating global conflicts",
            "url": "https://www.herald.co.zw/minister-muchinguri-kashiri-bemoans-escalating-global-conflicts/",
            "content": "Talent Chimutambgi, Herald Reporter\n\nThe shifting geopolitical dynamics emanating from soaring conflicts, compounded by the adverse climate-induced disasters, are threatening global peace and security, Defence Minister Oppah Muchinguri-Kashiria said yesterday.\n\nSpeaking during the ongoing Aero India Exhibition and Ministers Conclave underway in India, Minister Muchinguri-Kashiri bemoaned the increase in global conflicts.\n\nThe Ministers Conclave is a platform where ministers and stakeholders in defence and security come together to consolidate their security sectors with a shared vision for the benefit of humanity.\n\nMinister Muchinguri-Kashiri said the platform was becoming a forum for global peace and security with a view of coming up with sustainable solutions in the quest for a peaceful and secure world, through new technologies and innovations in aviation.\n\nThe initiative is expected to entrench multilateral relations among African countries and India. It is pleasing that the Aero India show continues to grow in scope offering us great opportunities to witness the latest innovations and technologies in the aviation and defence industry. Military technology is indeed increasingly becoming integral to global peace and security given the non-traditional threats that are bedevilling our globe, said Minister Muchinguri-Kashiri.\n\nIt is pleasing that the conclave is coming at a time when India-Africa relations are growing from strength to strength as demonstrated by the continued participation of African countries at this event, she said.\n\nOur meeting is taking place on the backdrop of a shifting geopolitical environment and the rise in conflicts in many parts of the world, mainly in the Middle East and parts of Africa, said Minister Muchinguri-Kashiri.\n\nShe highlighted that these catastrophes confronting the world, were reversing the gains that have been made in the attainment of the UN Sustainable Development Goals, thereby exposing vulnerable groups.\n\nThe global peace and security environment is being made more complex by the increasing recurrence of natural disasters with most emanating from climate change, she said.\n\nThis is rolling back socio-economic achievements made in recent years towards the attainment of Sustainable Development Goals and are impacting the vulnerable most, that is women, children, the disabled and the elderly, she added.\n\nMinister Muchinguri-Kashiri said recurring droughts owing to the adverse effects of climate change were increasing vulnerability among people.\n\nThese unwelcome developments require the defence forces to think outside the box.\n\nIn recent years, Southern Africa, in particular, has experienced severe droughts and flooding caused by cyclones. During the 2023-2024 rain season, the region experienced the worst drought in living memory.\n\nThe current season experienced floods that destroyed some parts of our region. This development prompted members of the defence forces to be increasingly involved in national and regional disaster preparedness mechanisms, and this calls for the modernisation and redesigning of our defence forces.\n\nThis new phenomenon requires mutual bilateral and multilateral cooperation for us to exchange experiences and best practices, she said. Minister Muchinguri-Kashiri lauded the India-Africa relations that were facilitating economic growth through forums like the BRICS+.\n\nIndia has been increasingly investing in Africa and also leading in the opening of markets for African goods and services, and in addition, continues to avail fair credit lines through its membership of the BRICS.\n\nTrade relations between the Republic of India and Africa are underpinned by diverse economic engagements with both governments and the private sector. As a result, trade between India and Africa continues to grow, making India our Africas third largest trading partner, after China and the European Union.\n\nMeanwhile, Minister Muchinguri-Kashiri signed a memorandum of understanding on behalf of the Government with Indian Defence Minister Rajnath Singh.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/OM.jpg",
            "description": "Talent Chimutambgi, Herald Reporter The shifting geopolitical dynamics emanating from soaring conflicts, compounded by the adverse climate-induced disasters, are threatening global peace and security, Defence Minister Oppah Muchinguri-Kashiria said yesterday. Speaking during the ongoing Aero India Exhibition and Ministers’ Conclave underway in India, Minister Muchinguri-Kashiri bemoaned the increase in global conflicts. The Ministers’ Conclave is […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Gold coins deliver huge returns to investors",
            "url": "https://www.herald.co.zw/gold-coins-deliver-huge-returns-to-investors/",
            "content": "Business Reporter\n\nZimbabwes gold coins, introduced in July 2022, have delivered impressive returns to investors, with prices soaring 66 percent as gold prices rocket, statistics from the Reserve Bank of Zimbabwe (RBZ) show.\n\nThe coins, known as Mosi-Oa-Tunya, vernacular for the countrys world heritage tourist site Victoria Falls, were introduced as an investment alternative and instrument to absorb excess market liquidity and combat inflation.\n\nThe value of the coins is tied to the international gold price, fluctuating with the global market rate, plus a small production fee.\n\nThey have become a lucrative investment for those who bought them, rising from an initial price of US$1 823 on July 25, 2022, to US$3,040 yesterday for a 22-carat coin.\n\nThe coins, primarily were acquired by institutional investors, such as pension funds and individual investors, largely using local currency holdings.\n\nThe gold coins have proven a remarkably successful investment vehicle, Princess Revai, a Harare-based economist said.\n\nThe returns, exceeding 60 percent in US dollar terms in just over two years, have demonstrated the effectiveness of this instrument in preserving and growing wealth, particularly in a high-inflation environment.\n\nGold has traditionally been a good hedge during inflationary periods, and acts as a haven for investors, especially cautious ones with low risk tolerance.\n\nFor income-seeking investors, the gold can be used as collateral, potentially creating opportunities with asset managers.\n\nGiven Zimbabwes currency instability at the time of their introduction, following periods of currency volatility, buying gold coins with local currency, has proven a sound strategy for long-term value preservation, even at a reasonable premium.\n\nInflationary pressures and currency instability further solidify the investment case for gold coins.\n\nUpon purchase, buyers of the gold coins can choose to keep the coin themselves or deposit it with a bank of their choice, receiving a safe custody certificate or receipt in the latter case.\n\nThe coins are designed to be liquid assets, easily convertible to cash.\n\nThey are tradable both locally and internationally and can also be used for transactions.\n\nThe coins also have prescribed asset status, allowing institutional investors to use them to fulfil regulatory requirements for prescribed asset investments.\n\nThey can be used as collateral for loans and credit facilities, further enhancing their utility.\n\nThe central bank buys back the coins at the holders request, providing a guaranteed exit strategy.\n\nGold prices began 2022 robustly, fuelled by safe-haven demand due to the war in Ukraine and soaring inflation.\n\nHowever, as the US Federal Reserve aggressively raised interest rates to combat inflation, gold prices declined, finishing the year slightly lower.\n\nPrices recovered in 2023 as recession fears mounted and the US dollar weakened.\n\nHeightened geopolitical tensions and persistent inflation further supported golds appeal as a hedge against uncertainty.\n\nThe upward trend persisted in 2024, with gold reaching record highs. This was driven by expectations of the Federal Reserve pausing its interest rate hikes, further weakening the dollar.\n\nContinuing geopolitical risks and golds growing attractiveness as a safe-haven asset also contributed.\n\nGlobal gold prices have remained steady in early 2025, maintaining the upward trajectory of recent years.\n\nThe gold coins are sold through the Reserve Bank and its subsidiaries, Fidelity Gold Refinery and Aurex. The coins can also be traded through local commercial banks and selected international banking partners.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/WhatsApp-Image-2022-07-25-at-1.05.16-PM.jpeg",
            "description": "Business Reporter Zimbabwe’s gold coins, introduced in July 2022, have delivered impressive returns to investors, with prices soaring 66 percent as gold prices rocket, statistics from the Reserve Bank of Zimbabwe (RBZ) show. The coins, known as Mosi-Oa-Tunya, vernacular for the country’s world heritage tourist site Victoria Falls, were introduced as an investment alternative and […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Africa Youth Congress presents award to President",
            "url": "https://www.herald.co.zw/africa-youth-congress-presents-award-to-president/",
            "content": "Joseph Madzimure, Zimpapers Politics Hub\n\nThe Africa Youth Congress yesterday presented President Mnangagwa with the Liberation Vanguard Award in recognition of his bravery in the fight for Africas liberation.\n\nThe award was handed over by the newly elected Africa Youth Congress chairperson, Cde Taurai Kandishaya, at State House in Harare yesterday.\n\nCde Kandishaya was accompanied by members of the organisations advisory council, including Cde Emmanuel Mahachi an advisor, secretary for economic affairs Cde Tapiwa Masenda, deputy secretary general Cde Patience Matsveru, and country coordinator Cde Tendai Nyika.\n\nSpeaking to the media following the meeting with President Mnangagwa, Cde Kandishaya highlighted that the award represents the appreciation from the youth of Africa.\n\nHe described the Liberation Vanguard Award as a testament to President Mnangagwas role as a key figure in the continents liberation struggle.\n\nHe continues to empower the people of Zimbabwe and Africa as a whole. The mantra Nyika inovakwa nevene vayo reflects the essence of Pan-Africanism, advocating for home-grown solutions and reducing dependency, said Cde Kandishaya.\n\nHe said after presenting the award, President Mnangagwa expressed his gratitude.\n\nAFRICA YOUTH Congress cahirman Taurai Kandishaya flanked by Advisory Council (left) Emmanuel Mahachi (left) and Deputy Secretary General Patience Matsveru during a press conference after handing over Liberation Vaneguard award to President Mnangagwa yesterday\n\nIn addition, the Africa Youth Congress has nominated President Mnangagwa as patron of the organisation, alongside his Ugandan counterpart President Yoweri Museveni, as torchbearers for the cause.\n\nPresident Mnangagwa is one of the last senior fighters remaining. He joined the liberation struggle at the young age of 16 and has dedicated his life to combating neo-colonialism.\n\nThis is why the Africa Youth Congress has chosen to honour him with this award, said Cde Kandishaya.\n\nCde Mahachi called on African youths to be patriotic and respect their elders, adding youths have to follow the footsteps of their forefathers to shape the continent.\n\nAfrica can only be built by Africans alone. We should guard our continent jealously against any infiltration, said Cde Mahachi.\n\nThe foundations primary goal is to help the deprived youth of Africa to develop to their full potential, through increased access to education, especially in information communication technology (ICT) and entrepreneurship, to prepare them for meaningful participation in national development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/AY1.jpg",
            "description": "Joseph Madzimure, Zimpapers Politics Hub The Africa Youth Congress yesterday presented President Mnangagwa with the Liberation Vanguard Award in recognition of his bravery in the fight for Africa’s liberation. The award was handed over by the newly elected Africa Youth Congress chairperson, Cde Taurai Kandishaya, at State House in Harare yesterday. Cde Kandishaya was accompanied […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        },
        {
            "title": "Vatican ambassador commends First Lady for fighting GBV, empowering women",
            "url": "https://www.herald.co.zw/vatican-ambassador-commends-first-lady-for-fighting-gbv-empowering-women/",
            "content": "Tendai Rupapa, Senior Reporter\n\nWOMENFOLK deserve respect and to live in homes free of violence, Vatican ambassador Archbishop Janusz Urbanczyk, the Apostolic Nuncio to Zimbabwe has said.\n\nHe made the impassioned plea in discussions with Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa after paying a courtesy call at her offices on Tuesday.\n\nDuring their exchanges, in a meeting that was filled with cordiality, the ambassador said respecting women in the family and society at large helps to maintain peace, reduces gender-based violence, and prevents divorce cases.\n\nHe said stability and peace work hand-in-hand thus promoting productivity.\n\nThe ambassador spoke against some organisations that come into other countries in the name of helping but end up causing more harm than good.\n\nSerious consideration and serious respect are needed for women and children, they should be treated with dignity. Because, you know, what I experienced in some organisations, there are plenty of nice ideas, and words, but the reality is not there.\n\nAnd when speaking about respect, they are introducing other ideological elements, they are even confusing the people and introducing other problems, he said.\n\nHe further thanked the First Lady for her programmes aimed at grooming todays youth saying that children needed to be raised properly and shown the correct path.\n\nFirst Lady Dr Auxillia Mnangagwa exchange gifts with Vatican Ambassador Archbishop Janusz Urbanczyk, the Apostolic Nuncio to Zimbabwe at Zimbabwe House on Tuesday.  Pictures: John Manzongo\n\nThe ambassador had the privilege of touring the National Gender-Based Violence (GBV) Call Centre in the Office of the First Lady where victims of violence are assisted and linked to relevant organisations depending on their needs.\n\nThe 575 helpline is the brainchild of Amai Mnangagwa, who has taken the bull by its horns and pledged to curb domestic violence.\n\nThe ambassador showered praises on the First Lady for establishing the GBV call centre to end violence.\n\nViolence is always negative and it destroys families, destroying the normal situation. So, we must understand and try to help the weaker part. Women are always weaker and we must respect them and we must pay tribute, so it is important to have a Centre like this one to address domestic violence and violence against children. This is a place where we can collect data and completely help victims of gender-based violence, he said.\n\nCommenting on his meeting with the mother of the nation, the ambassador said: It was for me a great joy that I was able to come to see and greet personally the hardworking First Lady.\n\nRecognising her for all this work that she has been doing and continues doing for the country and trying to address the concerns of the people mainly women and children.\n\nEarlier, during the meeting, the ambassador told the First Lady his willingness to learn Shona and achieve a high degree of proficiency in it.\n\nHe said he was settling well in the country.\n\nIve been here for just over nine months, so its not that long since I came to stay here. I have been here for a short time and its my desire to stay here longer. I would like to learn Shona, he said.\n\nFirst Lady Dr Auxillia Mnangagwa interacts with Vatican Ambassador Archbishop Janusz Urbanczyk, the Apostolic Nuncio to Zimbabwe during a courtesy call at Zimbabwe House on Tuesday\n\nDr Mnangagwa responded by saying, Shona is so simple and that will be very good for you because you will be able now to communicate with everybody even with those in rural areas.\n\nThe First Lady warmly welcomed Archbishop Janusz Urbancyzk.\n\nI welcome you with a warm heart that your appointment to come here to work with us is very important for the whole country and myself as Amai, as a mother I feel greatly honoured that you have come to see me which is very important. In every given family, the mother is the first person to see at home because she is always there looking after the family. I welcome you on behalf of Zimbabwe. I know you have met so many people in Government, but on my part here I thank you very much. I am so humbled, Dr Mnangagwa said.\n\nThe ambassador gave a brief background about his family, including the fact that he is the only boy in a family of five.\n\nThank you and I agree wholly with you about the importance of a mother. Imagine that in my family, we are five siblings but I am the only boy.\n\nMy older sisters took care of me, so I was raised alongside my sisters. I did all the work, and house chores as a boy and I would not fail to do something because I am a boy. My sisters would make sure I even cleaned the house. I would do all kinds of work in the house just like my sisters, he said.\n\nThe First Lady said she was working along the same lines to ensure both girls and boys knew all tasks around the home.\n\nThat is what we are now also training our children here, the boy child and the girl child that you should do the same because when you grow up you have to know all these chores because when you come of age you will lead your family, but the background is very important.\n\nBut your sisters were looking after you showing motherly care and they were protecting you, also teaching you that life goes this way. We have time to do that in our country as well, that all the work that is done at home every child must do, she said.\n\nThe ambassador said it was critical for children to be groomed and shown the correct path, including on dressing for their own benefit in the future.\n\nInstilling the correct values in children, he said, helps them stay away from drugs and other harmful activities.\n\nSpeaking on the respect of women, the ambassador said equality was fundamental.\n\nIn some countries that I worked in, they are speaking, discussing womens equality and empowerment but they are not respecting seriously the importance of women, the role of the women in the family, in the society and the country. Countries must maintain peace and shun war because the weaker ones, women, suffer the most. I am happy that it is a different situation in Zimbabwe as women here are being empowered and there is gender equality, he said.\n\nThe First Lady weighed in saying indeed it was important to recognise women.\n\nShe concurred with the ambassador that in times of war, it is women and children who bear the brunt.\n\nAll that women need is respect and to be empowered, so that they fend for their children, the husband being there or not, she needs to be empowered to look after her family. So, if there is no respect, there is no empowerment to talk about, the First Lady said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1-3.jpg",
            "description": "Tendai Rupapa, Senior Reporter WOMENFOLK deserve respect and to live in homes free of violence, Vatican ambassador Archbishop Janusz Urbanczyk, the Apostolic Nuncio to Zimbabwe has said. He made the impassioned plea in discussions with Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa after paying a courtesy call at her offices on Tuesday. […]",
            "time": "08:34",
            "date": "13 Feb 2025"
        }
    ]
}