{
    "news": [
        {
            "title": "We’ll take Sadc to the next level: President",
            "url": "https://www.herald.co.zw/well-take-sadc-to-the-next-level-president/",
            "content": "Wallace Ruzvidzo in GABORONE, Botswana\n\nPRESIDENT Mnangagwa has assured the SADC Secretariat of his unwavering support during his tenure as Chairperson of the regional bloc.\n\nThe President also reaffirmed Zimbabwes commitment to working with all Heads of State in the regional bloc and the Secretariat towards the operationalisation of this years theme, Promoting Innovation to Unlock Opportunities for Sustainable Economic Growth and Development towards an Industrialised SADC.\n\nIn his address to the SADC Secretariat staff here yesterday, President Mnangagwa said the regions objective of deepening its integration agenda, as well as accelerating the quest towards a middle to high income region, remained a top priority.\n\nRELATED STORIES\n\nThe President was here for his maiden visit to the SADC Secretariat Headquarters after assuming Chairmanship of the regional bloc at the 44th SADC Summit of Heads of State and Government held in Harare in August.\n\nZimbabwe stands ready to work with fellow Heads of State and Government, the Secretariat, and other relevant stakeholders to operationalise this timely theme.\n\nI once again assure you that my door is open for continuous engagement as we promote deeper integration and sustainable development for the benefit of the peoples of the region.\n\nI count on your invaluable support as I execute the mandate bestowed upon me by the SADC Heads of State and Government, he said.\n\nSADCs approach, said President Mnangagwa, must always be driven by the regions collective desire to leave no one and no place behind.\n\nSADC chairperson, President Mnangagwa, and his Botswana counterpart President Duma Gideon Boko, show off an artists impression of the SADC Headquarters after receiving the building on behalf of SADC Heads of State and Government from Bongwe Investments in Gaborone, Botswana, yesterday\n\nThis is something the SADC Chair has effectively instilled in his Government and is now moving to impart on the regional bloc.\n\nThe shared objectives of deepening our regional integration agenda and accelerating our quest towards a middle to high income industrialised and integrated region, for the benefit of all SADC citizens, remain our key focus.\n\nHence, as we implement the various action plans and programmes, our approach must always be driven by our collective desire to leave no one and no place behind.\n\nAll the citizens of SADC should feel that they are an integral part of the community as a result of the impacts of our programmes and activities, he said.\n\nPresident Mnangagwa charged the regions citizenry to take pride in their identity and become producers, not mere consumers of goods and services.\n\nThis, he said, would boost intra-SADC trade and ensure it leverages on the opportunities occasioned by regional value chains.\n\nTrade between member states currently stands at 23 percent.\n\nUndoubtedly, increased intra-regional trade is an economic imperative as well as an important step towards the full integration for a united and prosperous SADC.\n\nThe current low levels of intra-regional trade, at only 23 percent, are worrisome.\n\nGreater efforts must be taken to remove all barriers to trade and take full advantage of the opportunities resulting from the various SADC Trade Protocols as well as our Industrialisation Strategy and Roadmap, among other framework.\n\nGoing forward, to boost intra-SADC trade and leverage on the opportunities occasioned by regional value chains, we must take pride in who we are and consume what we produce, said the SADC Chair.\n\nPresident Mnangagwa, flanked by Foreign Affairs and International Trade Minister Professor Amon Murwira (left) and SADC Executive Secretary Elias Magosi pose for a group photo with the regional bodys senior secretariat officials\n\nHe said this years theme was a clarion call that enjoins the region to harness the power of innovation in driving its industrialisation agenda, leveraging on the abundant natural resources, rich heritage and world class human resources.\n\nAs you are aware, the theme of the 44h SADC Summit reads, Promoting Innovation to Unlock Opportunities for Sustained Economic Growth and Development Towards an Industrialised SADC.\n\nZimbabwe stands ready to work with fellow Heads of State and Government, the Secretariat, and other relevant stakeholders to operationalise this timely theme.\n\nAlthough there is still scope to scale up our industrialisation drive, I wish to commend the efforts deployed by SADC Member States to date and the promotion of innovation, science and technology in their respective jurisdictions, President Mnangagwa said.\n\nZimbabwe, he said, was playing its part in nurturing and sustaining momentum at the national level.\n\nIn that regard, the heritage-based Education 5.0 system is helping to drive innovation, modernisation and the industrialisation of our economy.\n\nUnity, support, and solidarity, said President Mnangagwa, remained the cornerstone of the regional bloc.\n\nHe expressed gratitude to member states for the solidarity they continue to render Zimbabwe every year in calling for the unequivocal removal of the illegal Western imposed sanctions.\n\nZimbabwe is grateful to our brothers and sisters in SADC who have consistently stood with us.\n\nThe continuing recognition of the 25th of October as the day on which SADC Member States collectively raise their voices in disapproval of the sanctions imposed on the Republic of Zimbabwe, is always appreciated, the President said.\n\nPresident Mnangagwa is led on a tour of the Julius Nyerere SADC Library by the regional blocs Executive Secretary Mr Elias Magosi (centre) in Gaborone yesterday\n\nPresident Mnangagwa appraised the gathering on Zimbabwes efforts in preserving the regions heritage saying, our story will not be accurate if we leave others to tell it on our behalf.\n\nWe remain committed to do our part towards the protection and preservation of the rich heritage, culture, and liberation history of our region.\n\nTo this end, the construction of the SADC Liberation Square in Harare, which houses the Museum of African Liberation, is progressing well.\n\nI am aware of similar efforts in other SADC countries. It is the duty of the respective countries of SADC and our peoples as a whole to promote and take pride in our heritage for both present and future generations, said the President.\n\nTurning to infrastructure development, President Mnangagwa stressed the critical role infrastructure plays in enabling regional integration efforts.\n\nVital sectors such as water, meteorology, energy, Information and Communication Technology, as well as transport require modern infrastructure. Cross border investments must be pursued with greater vigour.\n\nThere is particularly an urgent need to revamp, modernise, and diversify in the energy sector, which is the backbone of industrialisation.\n\nIt is commendable that trade in power has continued among Member States, enabling those with deficits to benefit from the SAPP Grid. On-going inter-connector projects will soon connect all the mainland Member States to the SAPP Grid.\n\nIt is gratifying that our SADC region is scaling up efforts to diversifying its power generation mix by exploring alternative energy sources such as natural gas, solar, wind, and bio-energy, he said.\n\nSADC secretariat staff waiting to welcome the regional bodys chairperson, President Mnangagwa at the organisations headquarters in Gaborone yesterday.  Pictures: Presidential Photographer Tawanda Mudimu\n\nWith regards to transport connectivity, the SADC Chair said the enhanced efficiency in the transit of traffic and the adoption of the One Stop Border Post concept implemented by a number of member states had increased movement of people and goods within the region.\n\nHe lamented the effects of climate change across the region while imploring the region to increase coordination efforts.\n\nRegrettably, climate change continues to pose an existential threat to our people. The region is suffering from devastating climate change induced disasters that threaten to reverse the development gains we had made over the years.\n\nThis grim reality should inspire and compel us to enhance coordination efforts to effectively respond and build greater resilience.\n\nThe world has undoubtedly moved on, and SADC has appropriately adjusted and adapted to the ever-changing social, economic, political, technological and environmental dynamics, President Mnangagwa said.\n\nHe expressed gratitude to the SADC Secretariat for their dedication to duty and unwavering commitment to the regions Vision 2050.\n\nWe are confident that the Secretariat, with its pool of expertise and skills, will rise to the occasion at the service of SADC Member States.\n\nResearch, robust policy analysis and evidence-based recommendations should continue to be sharpened towards propelling our region to greater successes.\n\nGoing into the future, I urge you all to remain united and hardworking, taking full ownership of regional programmes as you wholeheartedly serve.\n\nI challenge you to remain true to the spirit of Pan-Africanism as well as the ethos and guiding principles that inspired our Founding Fathers to set up this august and strategic regional body, President Mnangagwa said.\n\nThe President addresses guests at his familiarisation tour of the regional bodys headquarters in Gaborone yesterday\n\nOn his part, SADC Executive Secretary Mr Elias Magosi urged the region to continue harnessing power from regional integration.\n\nThe meeting was attended by President Mnangagwas counterpart Botswana President Duma Boko, SADC Secretariat staff, diplomats, and other officials.\n\nThe President departed Gaborone for Harare last night.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-2.jpg",
            "description": "Wallace Ruzvidzo in GABORONE, Botswana PRESIDENT Mnangagwa has assured the SADC Secretariat of his unwavering support during his tenure as Chairperson of the regional bloc. The President also reaffirmed Zimbabwe’s commitment to working with all Heads of State in the regional bloc and the Secretariat towards the operationalisation of this year’s theme, “Promoting Innovation to […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "President calls for collective responses to regional threats",
            "url": "https://www.herald.co.zw/president-calls-for-collective-responses-to-regional-threats/",
            "content": "Wallace Ruzvidzo in GABORONE, Botswana\n\nALL complex and multifaceted threats that the SADC region has been facing in the last four years require urgent and collective responses, President Mnangagwa has said.\n\nThe President, who was handed over the recently purchased SADC Secretariat Headquarters building and then presided over the ground-breaking ceremony of the SADC Standby Force Regional Logistics Depot (RLD) here yesterday, said it was an imperative that the regional body has tactical capabilities to swiftly respond to the threats to the regions peace and security.\n\nMost recently, the region successfully concluded the SADC Mission in Mozambique (SAMIM) in July and extended the mandate of the SADC Mission in the Democratic Republic of Congo (SAMIDRC) from December 15 this year to December 14, 2025, at the regional bodys Extraordinary Summit of Heads of State and Government held in Harare last month.\n\nRELATED STORY\n\nAs such, President Mnangagwa, who is the current Chairperson of SADC, said once complete, the RLD will serve as a critical hub for the storage of and the rapid deployment of resources, personnel, and equipment.\n\nThis ground-breaking ceremony is timely and marks a significant stride in our journey towards promoting and consolidating peace, stability, and security in our region.\n\nThis is in line with the SADC Protocol on Politics, Defence and Security Cooperation, the SADC Mutual Defence Pact and other SADC, African Union and United Nations frameworks on peace and security.\n\nWe must recognise that this ground-breaking ceremony is the first step, as substantial work lies ahead of us, he said.\n\nThe project will require an estimated US$45 million to reach full operational capacity and to date, US$15 million has been mobilised.\n\nInvesting in peace and security, said President Mnangagwa, was always a worthwhile endeavour as the two are pre-requisites for the sustainable development of the region and continent at large.\n\nOn behalf of the SADC region, I therefore, appeal to Member States and partners alike to generously support this very important initiative.\n\nAllow me to commend the Chairperson of the SADC Organ on Politics, Defence, and Security Cooperation, Her Excellency Dr Samia Suluhu Hassan, President of the United Republic of Tanzania, for her astute stewardship in fostering peace and security in our region and reaffirm our full support for these efforts.\n\nI also wish to take this opportunity to thank the local community and our revered traditional leaders in this area for their support to this project, he said.\n\nThe SADC Chair implored the region to maintain its solidarity and close cooperation. This, he said, would ensure that the depot reaches its full operational capacity as envisaged.\n\nThe Botswana Government allocated the 19-hectare piece of land to SADC in 2012.\n\nThrough your support as a community, you are making a significant contribution to our regional community.\n\nWe thank you. We look forward to further cooperation as the construction of this Logistics Depot moves forward in the months and years ahead, the President said.\n\nSpeaking at the handover of the SADC Headquarters building earlier, President Mnangagwa said the building testified to the importance of collaborative efforts and the responsibility the regional bloc has in individually and collectively developing the region.\n\nPrior to its purchase by SADC, the building had been under Bongwe Investments (Proprietary) Limited for the past 18 years.\n\nTo all of us in the SADC region, the SADC House stands as a towering symbol of the solidarity, unity, freedom, independence and most importantly brings us together as a Region.\n\nIn this spirit, the SADC House should be an embodiment of our history, culture and heritage.\n\nWe should accelerate the construction of the Statues of our Founding Fathers that will grade this beautiful Headquarters as a way of honouring them and preserving our history, he said.\n\nPresident Mnangagwa expressed gratitude to the Botswana Government for the role it played throughout the acquisition process.\n\nThe parties involved in the Public-Private-Partnership project, which saw the implementation of this project, namely the Government of Botswana, the SADC Secretariat and the developers, Bongwe Investments (Proprietary) Limited, are congratulated for a job well done\n\nWe are particularly indebted to the Government of the Republic of Botswana for providing technical staff who ensured a smooth transition of the building from the private owners to SADC, he said.\n\nThe President described Botswana as Zimbabweans second home.\n\nFor us, Botswana is, indeed, our second home.\n\nOur two countries enjoy excellent multifaceted relations, underpinned by our shared values, history and destiny, said President Mnangagwa.\n\nAt both the SADC headquarters building handover and RLD groundbreaking ceremony, President Mnangagwa was accompanied by his Botswana counterpart President Duma Boko.\n\nOn his part at the groundbreaking ceremony, President Boko expressed Botswanas commitment to working hand in glove with SADC.\n\nThis is a demonstration of our enduring commitment not just to respond to the alarming cries and pleas but to step in practically and decisively and try and bring an end to the conflicts, he said.\n\nAt the handover, President Boko said Botswana was appreciative of President Mnangagwas leadership as SADC Chair.\n\nI must reiterate Botswanas commitment to SADC, to regional integration and the integration of the African continent at large, he said.\n\nBoth events were also attended by Executive Secretary Mr Elias Magosi, SADC Council of Ministers Chairperson and Minister of Foreign Affairs Professor Amon Murwira, Secretariat management and staff.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE6.jpg",
            "description": "Wallace Ruzvidzo in GABORONE, Botswana ALL complex and multifaceted threats that the SADC region has been facing in the last four years require urgent and collective responses, President Mnangagwa has said. The President, who was handed over the recently purchased SADC Secretariat Headquarters building and then presided over the ground-breaking ceremony of the SADC Standby […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "Ex-VP Mphoko burial slated for Byo tomorrow",
            "url": "https://www.herald.co.zw/ex-vp-mphoko-burial-slated-for-byo-tomorrow/",
            "content": "Joseph Madzimure and Nqobile Bhebhe\n\nNational hero and former Vice President Phelekezela Report Mphoko will be buried in Bulawayo tomorrow in accordance with his familys wishes.\n\nHe was 84.\n\nHis remains arrived in Zimbabwe from India on Thursday, accompanied by his wife Laurinda, children and other family members.\n\nCde Mphoko was declared a national hero in recognition of his contributions to the nation during the liberation struggle and after independence.\n\nYesterday, his body was airlifted from Manyame Airbase to Bulawayo ahead of burial tomorrow.\n\nRELATED STORIES\n\nSpeaking at a funeral parade which was attended by service chiefs and senior Government officials at Charles Gumbo Barracks in Harare yesterday, Acting President Dr Constantino Chiwenga described Cde Mphoko as an illustrious national hero who contributed immensely to the nation during the liberation struggle and after independence.\n\nWe have lost one of the few surviving renowned commanders from the former Zimbabwe Peoples Liberation Army, Zipra, a giant of the liberation struggle whose immense contribution to our independence is a legacy too bold, never to be forgotten or erased.\n\nTo the bereaved Mphoko family, his spouse, the children, and the nation at large, may we all derive solace in the knowledge that his selfless contribution to his country and people will continue to inspire us and future generations, he said.\n\nActing President Chiwenga said former VP Mphoko became actively involved in the countrys liberation movement as a youth in the 1960s.\n\nPallbearers carry the body of the late National Heroe Phelekezela Mphoko from a plane on its arrival at the Joshua Mqabuko Nkomo International Airport in Bulawayo yesterday.Picture Eliah Saushoma\n\nCde Mphoko, he said, was among the first youths to be dispatched for military training in the Union of the Soviet Socialist Republics, with the likes of Comrades Akim Ndlovu, Ambrose Mutinhiri, and Charles Chikerema in 1964.\n\nHe was appointed Chief of Logistics in the 1st Military Command of the struggle in 1965, and was instrumental in the planning and execution of the Wankie and Sipolilo battles in 1967 and 1968 military operations.\n\nIn 1971, he became a member of the Joint Military Command, which was a joint Zipra-Zanla High Command formed in Mbeya, Tanganyika, now the mainland part of Tanzania.\n\nIn 1975, he was appointed Chief of Logistics of the Zimbabwe Peoples Army (Zipa), a joint Zipra and Zanla force.\n\nIn 1976, he became Zimbabwe African Peoples Union (ZAPU) representative in Maputo, Mozambique, a post he held until Zimbabwes independence in 1980.\n\nDr Chiwenga said Cde Mphoko was part of the delegation that played a pivotal role in securing Zimbabwes independence during the 1979 Lancaster House Conference.\n\nAt independence, he was appointed to the demobilisation board of ex-combatants, and later several Government positions, including ambassadorial roles.\n\nIn his diplomatic career since 1987, he served with diligence as Zimbabwes Ambassador to Mozambique, Austria, Botswana, Russia, and South Africa.\n\nDeputy Chief Secretary Reverend Damasane chats with the late National Heroe widow Laurinda on her arrival with the body at the Joshua Mqabuko Nkomo International Airport in Bulawayo yesterday.Picture Eliah Sasuhoma\n\nDue to his diligence and acumen, he was appointed Vice President of the Republic of Zimbabwe in 2014, a position he held until 2017.\n\nHe was also in charge of the National Healing, Peace and Reconciliation portfolio where he worked relentlessly to promote national peace, reconciliation, and equitable development in the country.\n\nOur late former Vice President was also a successful businessman and a farmer, majoring in cattle ranching, said Acting President Chiwenga.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe, described Cde Mphoko as an illustrious son of Zimbabwe.\n\nWe are giving a befitting send-off to another son of the soil, the former Vice President Mphoko. He shall forever be remembered as a loyal, diligent and dedicated cadre whose contribution to Zimbabwes prosperity surpassed the test of time.\n\nAs is the norm, we always follow the wishes of the family members and we were guided by the family that they would prefer to inter the remains in Bulawayo, said Minister Kazembe.\n\nFamily representative and young brother, Mr Ndabezinhle Mphoko, hailed the Government for according his brother national hero status.\n\nThe recognition will last for ever and ever. Our family is not in conflict in any way with the Government. We are taking his body to Bulawayo in accordance with my brothers request, he said.\n\nMeanwhile, Zanu PF supporters in Harare led by youth league chairman Cde Emmanuel Mahachi bade farewell to the national hero.\n\nThey serenaded mourners by chanting revolutionary songs at Manyame Airbase as they bade farewell to the gallant son of the soil.\n\nThe body of the late National Hero Cde Phelekezela Mphoko lie in state at a city parlour on its arrival in Bulawayo yesterday.\n\nCde Machachi said as party members, they appreciate the role played by Cde Mphoko during the liberation struggle and after Independence.\n\nCde Mphoko was born on June 11, 1940 in Gwizane, Bubi District, Matabeleland North. He attended David Livingstone Memorial School and Mzilikazi High School before studying at the Tsholotsho Agricultural Breeding and Experimental School.\n\nCde Mphokos political activism began early, and he was arrested in 1963 for political violence. He later received military training in the Soviet Union and played a crucial role in the liberation struggle.\n\nHe served in several capacities in Government after independence, including as Zimbabwes Ambassador to several countries and as Vice President from December 2014 until November 2017.\n\nCde Mphoko is survived by his wife Laurinda, three children, as well as three grandchildren.\n\nYesterday, Cde Mphokos body was flown to Bulawayo by the Air Force of Zimbabwe from Harare, touching down at Joshua Nkomo International Airport at 2:42 pm.\n\nCde Mphokos casket, draped in the national flag, was carried to the waiting Doves Funeral Parlour hearse by members of the Zimbabwe National Army. Flags draping coffins boldly symbolise a nations profound appreciation and respect for its fallen heroes.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube, Deputy Chief Secretary in the Office of the President and Cabinet Paul Damasane, Politburo member Elifas Mashava, Zimbabwes Ambassador to India Ms Stella Nkomo, service chiefs, Zanu PF provincial chairman Cde Jabulani Sibanda, and other dignitaries received the body.\n\nFrom the airport, Cde Mphokos body was taken to Doves Funeral Parlour, where a brief service was held at the chapel.\n\nIn an interview at the funeral parlour where the body was kept last night, the late national heros younger brother, Mr Ndabenzinhle Mphoko, thanked the Government for its support.\n\nHe said the national hero would be buried tomorrow at his Douglasdale farm.\n\nThis is a very sad day for the Mphoko family, but this has been ameliorated by the Government support we received. We travelled very well from Harare. We had to reorganise the programme when the Government agreed that the body would be buried in Bulawayo.\n\nWe had to re-adjust and carry out a ceremony in recognition of the national hero at Charles Gumbo Barracks in Harare. The Acting President, Dr Chiwenga, addressed us and expressed his condolences to the family and the nation.\n\nTomorrow (today), we expect the body to be taken to his Douglasdale farm to lie in state ahead of burial on Sunday, said Mr Mphoko.\n\nIn a condolence message, the John Landa Nkomo Memorial Trust said it was deeply saddened by the passing of Cde Mphoko, who took over the nations vice presidency from the late Vice President John Landa Nkomo.\n\nIt said the two national heroes closely worked together from the early days of the liberation struggle under Zapu, making huge sacrifices and exhibiting a deep passion to end colonialism.\n\nTheir passion to serve the country continued after attaining independence as they fought for economic prosperity for the majority of Zimbabweans. The late VP Mphoko and the late VP Nkomo retained a close relationship throughout the struggle days, after independence, and right up until the passing of Cde John Landau Nkomo in 2013, it noted.\n\nSenior struggle stalwart, Senator Angeline Masuku, who is a trustee of the JL Nkomo Trust, said the late Vice President Nkomo and Cde Mphoko had a very close relationship from the days of the struggle, although few were aware of their bond.\n\nShe said it was befitting that President Mnangagwa bestowed the highest honour in the country of National Hero on Cde Mphoko, as he was deserving due to his commitment and sacrifices both before and after the liberation struggle.\n\nWe respect him for the work he did during the countrys fight for liberation, and we got to know that he was not just committed to fighting against the settler regime but went beyond that, seeking economic emancipation for the people and battling against neo-colonialism.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mphoko1.jpg",
            "description": "Joseph Madzimure and Nqobile Bhebhe National hero and former Vice President Phelekezela Report Mphoko will be buried in Bulawayo tomorrow in accordance with his family’s wishes. He was 84. His remains arrived in Zimbabwe from India on Thursday, accompanied by his wife Laurinda, children and other family members. Cde Mphoko was declared a national hero […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "President congratulates incoming Ghana President-elect",
            "url": "https://www.herald.co.zw/president-congratulates-incoming-ghana-president-elect/",
            "content": "Herald Reporter\n\nPresident Mnangagwa,who is also the SADC Chairperson, yesterday congratulated Ghanas President-Elect, John Dramani Mahama.\n\nIn his congratulatory message, President Mnangagwa said the victory attests to the confidence that the people of Ghana have in his leadership capabilities.\n\nOn behalf of the Government and people of Zimbabwe and, indeed, on my behalf, I wish to extend my sincere congratulations to you, Your Excellency, following your emphatic victory in the 7th December, 2024 General Elections, President Mnangagwa said.\n\nYour historic victory, marked by your phenomenal comeback, is an affirmation of the trust bestowed upon you by the people of Ghana, who are demonstrating their confidence in your visionary leadership of advancing Ghanas socio-economic transformation.\n\nPresident Mnangagwa reiterated his dedication to strengthening bilateral relations with the President-elect Mahama, building on the existing strong ties between the two nations.\n\nI wish to reaffirm my commitment to work closely with you, Your Excellency, to further strengthen and deepen the strong bonds of friendship and solidarity between our two countries and peoples.\n\nI further look forward to our cooperation and collaboration at the bilateral, continental and multilateral fora, on issues of mutual interest and concern.\n\nHe also wished the Ghana President-elect a peaceful and successful tenure.\n\nI take this opportunity to wish you, Your Excellency, good health and great success in leading your great country to prosperity.\n\nGhana held its general elections on 7 December which saw President-elect John Dramani Mahama and the National Democratic Congress emerging victorious.\n\nThe Electoral Commission of Ghana officially announced the results on Sunday after his main opponent, Vice President Mahamudu Bawumia, conceded defeat.\n\nMahama, who was president of Ghana between July 2012 and January 2017, makes a political comeback after his victory.\n\nDuring his campaign, he promised to reset the country on various fronts and tried to appeal to young Ghanaians.\n\nHis win marks a historic victory  making him the first president in Ghana since the 1992 return to multi-party democracy  to reclaim the presidency after being voted out.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2015/09/Ghanaian-President-John-Dramani-Mahama.jpg",
            "description": "Herald Reporter President Mnangagwa,who is also the SADC Chairperson, yesterday congratulated Ghana’s President-Elect, John Dramani Mahama. In his congratulatory message, President Mnangagwa said the victory attests to the confidence that the people of Ghana have in his leadership capabilities. “On behalf of the Government and people of Zimbabwe and, indeed, on my behalf, I wish […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "Minister Muswere commissions ZBC vehicles",
            "url": "https://www.herald.co.zw/minister-muswere-commissions-zbc-vehicles/",
            "content": "Rumbidzayi Zinyuke, Senior Reporter\n\nInvestment in the recapitalisation of the Zimbabwe Broadcasting Corporation (ZBC) is poised to change the media landscape and strengthen its role in shaping national identity and promoting Zimbabwean culture.\n\nThis was said by Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere yesterday at the commissioning of 25 vehicles and equipment for radio and television transmission.\n\nEquipment worth US$2 million was sourced through the Ministry of Finance, Economic Development and Investment Promotion, with another donation of US$100 000 from a private donor and an additional US$86 000 sourced through the Ministry of Information, Publicity and Broadcasting Services.\n\nThis recapitalisation effort is part of the Government of Zimbabwes commitment to ensure that ZBC takes its rightful place in terms of building national consciousness, taking into consideration heritage-based broadcasting, which also includes our values as a people, our ethics, but also, most importantly, the role, responsibility and mandate of ZBC as an institution, he said.\n\nHe said his ministry had been given the responsibility to ensure that ZBC implements a turnaround strategy which would catapult the institution to profitability.\n\nThis would be achieved through interventions such as a debt restructuring programme and increased revenue generation through advertising, among other initiatives.\n\nZimbabwe Broadcasting Cooperation (ZBC) donated vehicles and broadcasting equipment that commissioned by Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere in Harare yesterday. -Picture: Memory Mangombe\n\nAs directed by President Mnangagwa, Minister Muswere said the recapitalisation of strategic institutions such as the ZBC was vital for the macroeconomic growth of the country.\n\nMinister Muswere highlighted the crucial role of humanresources in ZBCs turnaround, emphasising the need for a strong work ethic, honesty and a collective effort to reduce costs and increase efficiency.\n\nThe turnaround strategy should include the importance of human resources management and organisational development.\n\nWhat we have to bring back is a culture of hard work, a culture of honesty, of oneness, selflessness and to do away with the culture of greed, cannibalisation and the culture of destruction has to go.\n\nIt is a responsibility for each and every employee of the corporation, to work together to achieve cost containment measures, he said.\n\nHe also stressed the importance of diversifying revenue streams and reducing reliance on Government funding.\n\nYou cannot be running around with begging bowls everywhere. The Treasury has got its own responsibilities.\n\nThe responsibility and creation of the Treasury is not to allow people to mismanage their institutions.\n\nI believe with the expertise that we have, with a diversified board of directors, with knowledge and experience, and a good executive, and with the collective responsibility of the workers committee, as part of an integral ecosystem, we should be able to turn around this institution, he said.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (second from right) commissioning Zimbabwe Broadcasting Cooperation (ZBC) donated vehicles and broadcasting equipment while his deputy minister Omphile Marupi (left) Information, Publicity and Broadcasting Services Permanent Secretary Nick Mangwana (right) and ZBC acting board chairman Advocate Lewis Uriri (centre) witnessing in Harare yesterday. -Picture: Memory Mangombe\n\nHe said the vehicles should all be channelled towards improved content creation and revenue collection.\n\nActing ZBC board chairperson Advocate Lewis Uriri said the equipment would significantly enhance operations, mobility and technical capabilities of the broadcaster.\n\nThe addition of these motor vehicles will significantly improve our mobility, enabling us to manage our demanding travel schedules and meet the daily operational requirements of our broadcasting mandate.\n\nLikewise, the broadcasting equipment will elevate our technical capabilities, ensuring that ZBC continues to deliver quality content that informs, educates and entertains the people of Zimbabwe, he said.\n\nAdvocate Uriri said the donations were not just investments in equipment and vehicles but in the nations ability to stay informed, inspired and connected.\n\nWe must be the first and most reliable source of accurate, factual and verifiable reportage and content in a context where the single most potent threat to our unitary Statehood and national security is disinformation, he added.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (third from right) ,his deputy minister Omphile Marupi (left) Information, Publicity and Broadcasting Services Permanent Secretary Nick Mangwana (second fro left) and taken on a tour of commissioning Zimbabwe Broadcasting Cooperation (ZBC) donated vehicles and broadcasting equipment by ZBC acting Chief Excutive Officer Tapiwa Mudzamba (left) in Harare yesterday. -Picture: Memory Mangombe\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/ZBC1.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Reporter Investment in the recapitalisation of the Zimbabwe Broadcasting Corporation (ZBC) is poised to change the media landscape and strengthen its role in shaping national identity and promoting Zimbabwean culture. This was said by Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere yesterday at the commissioning of 25 vehicles and equipment […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "First Lady launches Poultry4 Vanambuya Scheme",
            "url": "https://www.herald.co.zw/first-lady-launches-poultry4-vanambuya-scheme/",
            "content": "Tendai Rupapa in HURUNGWE\n\nAGRIC4SHE patron First Lady Dr Auxillia Mnangagwa yesterday unveiled an innovative programme called Poultry4 Vanambuya Empowerment Scheme, handing over 5 500 free range chickens that will benefit hundreds of elderly women from all constituencies of Hurungwe as she strives to ensure healthy living and access to capital for vulnerable communities.\n\nThe high breed free range (road runners) which include boschveld, sussex and koekoeks were from the First Ladys personal fowl-runs and hatcheries.\n\nThe mother of the nation distributed the road runners that are in three stages of maturity from two-week-old chicks, four-and-a-half weeks old, and point of lay.\n\nThe road runners have a high egg production efficiency.\n\nShe also handed over fertilisers to support the elderly in the cultivation of traditional grains, which have high nutritional value and medicinal properties and are also resistant to adverse weather conditions as well as diseases.\n\nIn addition, Amai Mnangagwa donated tonnes of rice to all communities as Christmas gifts.\n\nThe First Lady enjoined beneficiaries to work hard for the success of the project.\n\nIn an interactive session with the beneficiaries, she warned against laziness, domestic violence, early child marriages, cutting down of trees as well as drug and substance abuse.\n\nThe rains will be upon us very soon. Therefore, we need to be prepared. Let us conserve the environment and protect our trees and forests since we derive existence from them. They provide us with the oxygen that we breathe as well as medicine. If we look after them, they in turn look after us. Burning grass and cutting down trees contribute to climate change which induces extreme temperatures. If we do not cut down trees, even violent storms will hit us with less aggravation. We must keep our environment clean, she said.\n\nThe more than 5 500 hybrid chickens which are in three stages 2 weeks old chicks, four week old chicks and those ready to lay eggs, fertilisers and rice which were donated by Agric4She patron First Lady Dr Auxillia Mnangagwa during the launch of Poultry4 Vanambuya empowerment scheme in Mashonaland West yesterday\n\nHerself a patron of the environment, the First Lady said trees were essential windbreakers.\n\nLet us plant trees in our communities because if we cut trees and replant them, it will take a long time for them to grow. Today I have brought a programme inobatsira vana mbuya. Ini ndakakura ndiri munhu anoda kubatsira naizvozvo changes in life do not make one change her manners. A person is defined by her manners, chinonzi munhu, hunhu. First Ladies are mostly expected to stay at home, but I grew up working because I was the eldest in a child-headed family. That is why you see me striving to meet the people daily, helping them out because it is something inborn. Yesterday I was in Manicaland, today I am in Hurungwe district and it is my wish to assist everyone including the elderly.\n\nToday I have extended the Agric4She projects with a new programme enabling women to use their hands. Women are crying out that their spouses do not want to work and often take their money, they would have earned through projects. Women are crying out that they are being emotionally tormented by their drunk husbands. We reject gender-based violence, so use my national gender based violence toll-free line 575 to report and get help.\n\nI have brought this poultry project with chickens from my personal fowl-run. This is not a new project because there has always been the Presidential Poultry Scheme, but these chickens have come from me as a mother, and they have a high egg production efficiency. This is where I ask you, vanambuya, to stop having itchy feet and stay at home rearing your chickens. Taramba vanoswera vachitenderera kumaraini huku dzichisara dzisina mutarisi. You must then train your grandchildren to be in this project as you also sell the chickens and eggs with them so that they remain gainfully engaged and stay away from drugs. Vanasekuru, please assist your spouses to rear these chickens since the programme is beneficial to the whole family, she said.\n\nAgric4She patron First Lady Dr Auxillia Mnangagwa hands over more than 5 500 hybrid chicks and chickens, fertilizers and rice during the launch of Poultry4 Vanambuya empowerment scheme in Mashonaland West yesterday.  Pictures: John Manzongo\n\nDr Mnangagwa highlighted the projects she launched in Manicaland under Agric4She recently.\n\nIn Manicaland, I recently launched five projects under Agric4she, including Fisheries4she and banana farming. Let us work hard and eat what we produce. The President said we are all Sadc chairmen, but can a chairman go about begging for maize meal and salt? No, a chairman must gird his loins and work. Vanamai, if you start borrowing sugar from baba vepa next door, how will you pay back? This is where we start hearing promiscuity issues.\n\nIf I bring forth projects, I do so to ensure people get something to do. As a mother, I beg you to live harmoniously in the communities without quarrels. To my sons out there, please stay away from drugs and stop wearing five trousers at once. To the girl child, I urge you to dress decently and not walk in the nude. Nowadays, girls are being proposed love to on social media, and tomorrow, they will be in bed with that social media suitor. Vanangu musadaro, value your education, she said.\n\nThe First Lady urged parents to be firm.\n\nAs parents, let us give our children rules and guidelines. We grew up being beaten, but not fatally therefore lets discipline our children because they are hiding under rights. What rights? Is it a right to come back home pregnant when you are still in school? she said to applause.\n\nAgric4she national coordinator, Mr Nikros Kajengo, praised the First Lady for her vision, which has transformed the lives of thousands of people countrywide.\n\nI wish to thank the First Lady for her vision because this programme is not coming from the Government, but it is coming from her own coffers, her own projects and remittances she is personally undertaking. This programme focuses on the elderly as she leaves no one and no place behind.\n\nPart of the crowd that interacted with Agric4She patron First Lady Dr Auxillia Mnangagwa during the launch of Poultry4 Vanambuya empowerment scheme in Mashonaland West yesterday\n\nShe brought 12,5 tonnes of fertilisers for elderly women, 300 chickens at point of lay stage as well as 2 200 chickens at five months. She also brought 3 000 2-week old chickens.\n\nWe thank the First Lady for her vision. The hybrid chickens adapt to any weather conditions, he said.\n\nMr Passmore Nyamadzawo, a provincial livestock specialist for Mashonaland West Province, showered praises to the First Lady for the gesture.\n\nWe thank our First Lady for the chicken breeds that she has brought because these types of chickens grow well with high egg production efficiency and good meat quality. We hope these beneficiaries will keep them well and create a hub for these chickens. These breeds were rare in our province, and our experts will help monitor them and assist the beneficiaries so that we help Amai to fulfil her vision, he said.\n\nGogo Mary Paradza was at a loss for words.\n\nI am thankful to the First Lady for what she has done, and we are extremely grateful because we are widows who lost their spouses a long time ago. She has remembered us again and this time with chickens, which we are going to breed and sell to get money for the grinding mill and fees for our grandchildren as well as relish, she said.\n\nSimilar sentiments were echoed Gogo Shupikai Mutoranhanga, who said she had been thrown a lifeline.\n\nWith the introduction of this project, I believe my life will change for the better, and I shall be able to put food on the table for my grandchildren as well as send them to school. I want to take the project seriously and ensure I also train my grandchildren to run the project so that hunger becomes a thing of the past in our household, she said with a broad smile.\n\nGogo Thenjiwe Dube said, The introduction of this project in this community shows that the First Lady is God-sent. We did not have breeds similar to those that have been brought here, which have high meat quality and produce many eggs. This means we have a chance to make money from the sale of the chickens and eggs. We wish to invite the First Lady sometime in the future to come and witness the success of her project. All that she is doing shows that she is a loving mother with the interests and welfare of the people at heart, she said.\n\nMinister of State for Mashonaland West Provincial Affairs and Devolution Hon Marian Chombo thanked the First Lady for her thoughtfulness.\n\nWe are deeply grateful to you for unveiling such a programme. You frequently visit us here in Mashonaland West Province, ushering us the opportunity to set foot on the train of development, and todays project is a one of its kind, she said. Empowerment Scheme, which will benefit hundreds of elderly women from all constituencies of Hurungwe as she strives to ensure healthy living and capital access for vulnerable communities.\n\nThe high breed free range chickens (road runners) were from the First Ladys personal fowl-runs and her Angel of Hope Foundations projects, embodying her farming prowess handwork.\n\nThe mother of the nation distributed the road runners that are in three stages, including 2 week-old chicks, four-and-a-half weeks old, and point of lay.\n\nThe road runners have a high egg production efficiency.\n\nShe also handed over fertilisers to support the elderly in the cultivation of traditional grains, which boasts of high nutritional value and medicinal properties and are resistant to adverse weather conditions as well as diseases.\n\nIn addition, Amai Mnangagwa donated tonnes of rice to all communities as Christmas gifts. The First Lady enjoined the beneficiaries to work hard for the success of the project.\n\nIn an interactive session with the recipients, she warned against laziness, domestic violence, early child marriages, cutting down of trees as well as drug and substance abuse.\n\nThe rains will be upon us very soon. Therefore, we need to be prepared. Let us conserve the environment and protect our trees and forests since we derive existence from them. They provide us with the oxygen that we breathe as well as medicine. If we look after them, they in turn look after us. Burning grass and cutting down trees contribute to climate change, which induces extreme temperatures. If we do not cut down trees, even violent storms will hit us with less aggravation. We must keep our environment clean, she said.\n\nHerself a patron of the environment, the First Lady said trees also act as windbreakers.\n\nLet us plant trees in our communities because if we cut trees and replant them, it will take a long time for them to grow. Today I have brought a programme inobatsira vana mbuya. Ini ndakakura ndiri munhu anoda kubatsira naizvozvo aging does not make one change her manners. A person is defined by her manners, chinonzi munhu, hunhu. First Ladies are mostly expected to stay at home, but I grew up working because I was the eldest in a child-headed family. That is why you see me striving to meet the people daily, helping them out because it is something in-born. Yesterday I was in Manicaland, today I am in Hurungwe district and it is my wish to assist everyone including the elderly.\n\nToday I have extended the Agric4She projects with a new programme enabling women to use their hands. Women are crying out that their spouses do not want to work and often take their money, which they would have earned through projects. Women are crying out that they are being emotionally tormented by their drunk husbands. We reject gender-based violence, so use my national gender based violence toll-free line 575 to report and get help.\n\nI have brought this poultry project with chickens from my personal fowl-run.\n\nThis is a new project, there has always been the Presidential Poultry Scheme, but these chickens have come from me as a mother, and they have a high egg production efficiency. This is where I ask you, vanambuya, to stop having itchy feet and stay at home rearing your chickens. Taramba vanoswera vachitenderera kumaraini huku dzichisara dzisina mutarisi. You must then train your grandchildren to be in this project as you also sell the chickens and eggs with them so that they remain gainfully engaged and stay away from drugs. Vanasekuru, please assist your spouses to rear these chickens since the programme is beneficial to the whole family, she said.\n\nDr Mnangagwa highlighted the projects she launched in Manicaland under Agric4She recently.\n\nIn Manicaland, I recently launched five projects under Agric4she, including Fisheries4she and Banana farming. Let us work hard and eat what we produce. The President said we are all Sadc chairmen, but can a chairman go about begging for maize meal and salt? No, a chairman must gird his loins and work. Vanamai, if you start borrowing sugar from baba vepa next-door, how will you pay back? This is where we start hearing promiscuity issues.\n\nIf I bring forth projects, I do so to ensure people get something to do. As a mother, I beg you to live harmoniously in the communities without quarrels. To my sons out there, please stay away from drugs and stop wearing five trousers at once. To the girl child, I urge you to dress decently and not walk in the nude. Nowadays, girls are being proposed to love on social media, and tomorrow, they will be in bed with that social media suitor. Vanangu musadaro, value your education, she said.\n\nThe First Lady urged parents to be firm.\n\nAs parents, let us give our children rules and guidelines. We grew up being beaten, but not fatally therefore lets discipline our children because they are hiding under rights. What rights? Is it a right to come back home pregnant when you are still in school? she said to applause.\n\nAgric4she national coordinator, Mr Nikros Kajengo, praised the First Lady for her vision, which has transformed the lives of thousands of people countrywide.\n\nI wish to thank the First Lady for her vision because this programme is not coming from the Government, but it is coming from her own coffers, her own projects, her own remittances under Angel of Hope Foundation and other initiatives that she is personally undertaking.\n\nThis programme focuses on the elderly as she leaves no one and no place behind. We thank the First Lady for her vision. These are Sasol chickens, Boshvelds, and mostly hybrid chickens, which adapt to any weather conditions, he said.\n\nMr Passmore Nyamadzawo, a provincial livestock specialist for Mashonaland West Province, showered praises on the First Lady for the gesture.\n\nWe thank our First Lady for the chicken breeds that she has brought because these types of chickens grow well with high egg production efficiency and good meat quality. We hope these beneficiaries will keep them well and create a hub for these chickens. These breeds were rare in our province, and our experts will help monitor them and assist the beneficiaries so that we help Amai to fulfil her vision, he said.\n\nGogo Mary Paradza was at a loss for words.\n\nI am thankful to the First Lady for what she has don, and we are extremely grateful because we are widows who lost spouses a long time ago. She has remembered us again and this time with chicken, which we are going to breed and sell to get money for the grinding mill and fees for our grandchildren as well as relish, she said.\n\nSimilar sentiments were echoed by Gogo Shupikai Mutoranhang, who said she had been thrown a lifeline.\n\nWith the introduction of this project, I believe my life will change for the better, and I shall be able to put food on the table for my grandchildren as well as send them to school. I want to take the project seriously and ensure I also train my grandchildren to run the project so that hunger becomes a thing of the past in our household, she said with a broad smile.\n\nGogo Thenjiwe Dube said, The introduction of this project in this community shows that the First Lady is God-sent. We did not have breeds similar to those that have been brought her, which have quality meat and produce many eggs.\n\nThis means we have a chance to make money from the sale of the chickens and eggs. We wish to invite the First Lady sometime in the future to come and witness the success of her project. All that she is doing shows that she is a loving mother with the interests and welfare of the people at heart, she said.\n\nMinister of State for Mashonaland West Provincial Affairs and Devolution Hon Marian Chombo thanked the First Lady for her thoughtfulness.\n\nWe are deeply grateful to you for unveiling such a programme. You frequently visit us here in Mashonaland West Province, ushering us the opportunity to set foot on the train of development and todays project is a one of its kind, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/FL1.jpg",
            "description": "Tendai Rupapa in HURUNGWE AGRIC4SHE patron First Lady Dr Auxillia Mnangagwa yesterday unveiled an innovative programme called Poultry4 Vanambuya Empowerment Scheme, handing over 5 500 free range chickens that will benefit hundreds of elderly women from all constituencies of Hurungwe as she strives to ensure healthy living and access to capital for vulnerable communities. The […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "EDITORIAL COMMENT: ZIFA councillors must put national interest first",
            "url": "https://www.herald.co.zw/editorial-comment-zifa-councillors-must-put-national-interest-first/",
            "content": "LAST week a former Zimbabwe youth international and Gweru United legend, Collin Semwayo, revealed that he had wanted to contest for the highest office in Zimbabwes football when elections take place on January 25.\n\nHe was however, forced out without filing papers ahead of the December 11 deadline.\n\nElections to choose the new Zifa executive committee will be held next month and currently the football community awaits the conclusion of the vetting exercise that is expected to end on December 23 when the final list of candidates is unveiled.\n\nSemwayo claimed that he was forced out of the Zifa presidents race last week after five councillors allegedly demanded US$300 each to fill his nomination papers.\n\nI just needed five signatures appended to my form and I was told the Harare councillors want US$1 500, I then decided I would do the moral thing and pull out of the race.\n\nSemwayo also posted on his Facebook wall: Greetings people. Sorry guys I failed to make the cut! I couldnt cough up a bribery fee of $1,500 to the five councillors required to validate my nomination. Zimbabwe who bewitched us?\n\nSemwayo feels the game can never be traded for a few pieces of silverware adding that the game was in the mess it is in because of councillors unscrupulous behaviour.\n\nThe game should never be up for sale. I refuse to be corrupt and to gain office through unorthodox means. Our football definitely deserves better and it starts at the bottom with democratic processes like nominations. But if the stage is rotten it means the rest is a fallacy.\n\nThe game has been on its knees for a while. So what some of us wanted was real football development with well-structured national programmes that would have seen results coming by 2030, I am not taking about chancing but a well-defined pathway with stakeholders input and involvement.\n\nI have been a player at the highest level back home and I have kept myself in the picture about what is happening in Zimbabwean football. I have friends abroad with whom I have spoken about the local game and are keen to help, said Semwayo.\n\nHe might have been prompted to make certain claims on realisation he did not stand a chance.\n\nBut there are a number of crucial points that Semwayo makes and are worth noting as the football fraternity prepares for the biggest contest in Zifas recent history.\n\nAs a priest, Semwayo said offering a bribe to get into office is a sin, an immorality that must not manifest itself in the country.\n\nHe believes the councillors ought to prioritise reviving the game of football in the country, but fears Zifa might be captured by cartels which will ruin the future of the game.\n\nThere are many others who have made claims against councillors behaviour ahead of elections and this has been the story for most of the previous elections.\n\nCandidates are not under any pressure to come up with compelling election manifestos and this is because the crucial stakeholders, otherwise known as councillors, do not seem to care about that.\n\nWe have heard claims that winning candidates would have pampered the councillors and also pledged head of delegation roles once elected.\n\nIt has become virtually acceptable that for one to seek Zifa office they must have fat wallets and not necessarily solid plans for the game.\n\nUnder the current set-up, candidates do not even have to engage the public on their plans and they can go for the election without a single interview in the media and still emerge victorious.\n\nAll they need is to engage the councillors, which is often done behind closed doors.\n\nIn recent elections, one winning presidential candidate produced his printed manifesto less than an hour before the crucial meeting and won comfortably. It later emerged that the councillors had been booked into a decent hotel in the build-up to election day and that is where the actual bidding was done.\n\nWhat the country needs right now is the revival of football at all levels. The Warriors recent qualification for the 2025 AFCON finals makes it easy to then revive all the key structures so that the entire ecosystem is functional.\n\nThere is a need to do more for the women game. The previous leaders took turns to sabotage women football in Zimbabwe and, one of the biggest crimes, was to divert Fifa funds to other uses.\n\nRight now, the Mighty Warriors are far from being ideal because women football had been neglected for over a decade.\n\nWe had reports of abuse of female match officials, especially under the previous leadership that was eventually kicked out of office by the Sports Commission.\n\nIt is therefore a welcome development that we now see a rise in the number of female match officials handling high profile games in the Premier Soccer League under the Zifa Normalisation Committee.\n\nWe hope the substantive leadership that comes into office on January 25 will be inspired to do even more and raise the womens game.\n\nWhenever the age group teams take part in international assignments, the issue of selection is topical amid fears the game is being hijacked by the sprouting academies.\n\nThese are the things that should preoccupy the councillors between December 23 and January 25, which is the definitive stage of Zifa elections.\n\nCouncillors should be aware of what Zimbabwean football needs to be revived and be competitive again.\n\nCouncillors should be preoccupied by having stadiums filling up again as was the case in the 1980s and 1990s.\n\nCouncillors should be concerned about having the national teams gracing all the international tournaments on offer. This can only be achieved if the 78 councillors ignore the state of their wallets and focus on the national interest first. Only then will Zimbabwe football win.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Collin-Semwayo.jpg",
            "description": "LAST week a former Zimbabwe youth international and Gweru United legend, Collin Semwayo, revealed that he had wanted to contest for the highest office in Zimbabwe’s football when elections take place on January 25. He was however, forced out without filing papers ahead of the December 11 deadline. Elections to choose the new Zifa executive […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "Gems eye Championships bronze",
            "url": "https://www.herald.co.zw/gems-eye-championships-bronze/",
            "content": "Tadious Manyepo, Zimpapers Sports Hub\n\nGEMS captain Felistus Kwangwa expects Zimbabwe to be more clinical when they play Malawi in the bronze match of the African Championships in Namibia this afternoon.\n\nThe Ropafadzo Mutsauki girls were too wasteful and disoriented as they gave South Africa an easy victory in their semi-final showdown yesterday.\n\nStill the opponent could have been Malawi in the last four, but the Gems bottled their final Pool B match against Namibia to then finish second and be on the warpath against the best African team who had expectedly topped Pool B.\n\nWith Uganda beating Malawi in the other semi-final yesterday, the Gems will face the latter in a potential thriller for the right to take bronze back to their respective homes.\n\nZimbabwe were keen to notch up a better finish after securing third place in the same competition last year in Botswana.\n\nBut that doesnt matter now as they have to win to return home with a medal.\n\nAnd skipper Kwangwa has implored her teammates to keep their eyes on the ball if they are to win against Malawi.\n\nFirstly, we are disappointed as a team to have been defeated at the semi-final stage.\n\nWe were looking at reaching the final this time around after finishing third in last years tournament, said Kwangwa.\n\nWe are taking this semi-final match against Malawi as a must-win.\n\nIts a do-or-die fixture for us. We should throw everything in the courts.\n\nAbove all, we have to be clinical under the ring. This is a match we need to win at all costs.\n\nWe were aiming for gold or silver at worst. But this is sport, you cant predict anything.\n\nWe just need to play well and be able to put away all chances that we get. We need to get those turn-overs and put them to good use.\n\nThis is Malawi and they are a very good team. They are ranked above us and that makes them a dangerous outfit.\n\nBut obviously we will put everything to get a win.\n\nDespite losing in the semi-final, the Gems have shown a lot of improvement.\n\nPerhaps their recent tour of the UK improved them in so many ways.\n\nThe Gems participated in the Celtic Cup where they played against Wales, Scotland and Northern Ireland in Glasgow last month.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/08/Felistus-Kwangwa.jpg",
            "description": "Tadious Manyepo, Zimpapers Sports Hub GEMS captain Felistus Kwangwa expects Zimbabwe to be more clinical when they play Malawi in the bronze match of the African Championships in Namibia this afternoon. The Ropafadzo Mutsauki girls were too wasteful and disoriented as they gave South Africa an easy victory in their semi-final showdown yesterday. Still the […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "Robbers arrested in shootout",
            "url": "https://www.herald.co.zw/robbers-arrested-in-shootout/",
            "content": "Crime Reporter\n\nFIVE suspected robbers who were targeting families and business premises in and around Bulawayo have been arrested following a shoot-out with the police.\n\nThey are Nkosiyazi Nyathi (20), Vusumuzi Ncube (22), Mgcini Sibanda (24), Mlungisi Ndlovu (41) and Nkosiyazi Moyo (27).\n\nPolice have since launched a manhunt for the sixth suspect, Alex Nyathi alias Samduduzi, who is still at large.\n\nA Norinco pistol was also recovered from the suspects who were mostly committing armed robbery cases in and around the Cowdray Park area while they were armed with two pistols.\n\nOn December 12 police received information that some suspects had a pistol and they managed to arrest Nyathi and Ncube in Cowdray Park.\n\nThey were interviewed and admitted that they had stolen a Star pistol with a magazine loaded with 10 rounds of ammunition on November 10, 2023, at Nokel Security Company which is in Bulawayo.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Arrested.jpg",
            "description": "Crime Reporter FIVE suspected robbers who were targeting families and business premises in and around Bulawayo have been arrested following a shoot-out with the police. They are Nkosiyazi Nyathi (20), Vusumuzi Ncube (22), Mgcini Sibanda (24), Mlungisi Ndlovu (41) and Nkosiyazi Moyo (27). Police have since launched a manhunt for the sixth suspect, Alex Nyathi […]",
            "time": "2024-12-14 06:43:56"
        },
        {
            "title": "Zhombe transformative agenda gains massive traction",
            "url": "https://www.herald.co.zw/zhombe-transformative-agenda-gains-massive-traction/",
            "content": "Fidelis Munyoro, Chief Reporter\n\nPresident Mnangagwas resonant declaration, Nyika inovakwa nevene vayo/Ilizwe lakhiwa ngabanikazi balo (A nation is built by its own people), reverberates powerfully throughout Zhombe rural, inspiring a wave of collective action.\n\nUnited by this clarion call, the people of Zhombe, in Midlands, are weaving a tapestry of transformation, pooling their resources to breathe new life into schools and spearheading innovative projects that radiate benefit across the entire region.\n\nThis spirited endeavour is not merely an act of developmentit is a symphony of progress, reshaping the very essence and visage of Zhombe with every collaborative effort, brick by brick, dream by dream.\n\nWith communities having embraced the Zhombe Ekhaya Development Associations (Zeda) visionhailed as a game-changerit has sparked a movement brimming with potential to transform Zhombes economic and social panorama.\n\nZeda is a community-driven initiative aimed at fostering development in Zhombe, guided by the principle of a nation is built by its people.\n\nIt seeks to empower the local community by focusing on key areas such as education, infrastructure, and economic and social development.\n\nFor an area steeped in natural wealth, with gold mines scattered across its landscape, harnessing these resources for development is no longer a distant dream but an imminent reality.\n\nInspired by President Mnangagwas call to action, Zeda chairperson Mlindelwa Mancitshana reflects on the newfound determination of Zhombes people, saying, We saw a lot of potential among ourselves. We realised that we have so many people who were raised in Zhombe, yet our place looked so poor, while our children are presentable and impactful all over the world.\n\nThis awakening has spurred a renaissance of self-reliance and innovation.\n\nAfter listening to the Presidents intonation that Nyika inovakwa nevene vayo, we decided to connect using todays technology, put all our differences aside, and sit at a round table to find ways to address the challenges facing our schools, Mancitshana explains.\n\nRemember, these schools raised us to be who we are todayit felt unfair to ignore them in their state.\n\nWhat began as an idea has blossomed into a formidable force for development giving impetus to the National Development Strategy 1(NDS1), which is very clear on the significance of rural advancement, and this is being transmuted into practical action.\n\nThe first of its kind in Zhombe, the Zeda initiative has gained massive traction, uniting Zhombes people in a collective vision of progress.\n\nThrough a network of Old Students Associations (OSAs), Zeda has woven a fabric of solutions tailored to the needs of individual schools. Each schools alumni group tackles smaller issues such as repairing broken windows, providing furniture, or equipping students with uniforms and sports gear.\n\nBeyond these localised efforts, Zeda itself addresses large-scale challenges that individual OSAs cannot handle alone.\n\nOn a rotational basis, the association has undertaken transformative projects such as roofing damaged classroom blocks, building science laboratories, drilling boreholes, and installing solar power systemsinitiatives that breathe life into schools and communities alike.\n\nEach month, Zeda assists one school to solve a major problem, Mancitshana says. At the same time, other small projects are taking place at various schools through their individual OSAs.\n\nZedas reach has grown exponentially, with 30 Old Students Associations from both primary and secondary schools now affiliated with the organisation.\n\nThese groups, unified by a shared purpose, have become the lifeblood of Zhombes transformation.\n\nWe are still marching on as Zeda to assist other schools in forming their own OSAs and joining the movement, Mancitshana adds.\n\nThe response has been overwhelming, a testament to the power of collective action when fuelled by vision and purpose. Local authorities, school headmasters, and traditional leaders have rallied behind the initiative, lending their voices and guidance to ensure its success.\n\nChief Gwesela, a prominent traditional leader, describes Zeda as a vital catalyst to propel developmenta force that unites communities under the banner of progress while preserving the cultural essence of Ubuntu/Hunhu.\n\nThe ripples of Zedas impact extend beyond education. As the association grows, it envisions tackling broader challenges such as clinics, hospitals, road networks, and vocational collegesfacilities that will redefine Zhombes socio-economic landscape.\n\nGrowth points like Zhombe Joel, Zororo, Empress, and Malamulela are poised for upliftment, with Zeda determined to consult widely and carry everyone along on this transformative journey.\n\nWe all play an equal part in raising funds for these projects, Mancitshana says, emphasising the importance of inclusivity and shared ownership in decision-making.\n\nAlready, schools like Gwesela Bhalimasvosve Primary, Ntabeni Primary, Gwenzimkhulu Primary, and Commoner Primary have reaped the benefits of Zedas efforts, receiving roofing sheets, boreholes, and building materials.\n\nSanta Maria Primary School has embarked on a solar power system project, a beacon of hope for modernised learning in rural areas. Chiefs in the area have embraced Zeda wholeheartedly, recognising it as a solution to many of the challenges their people face.\n\nChief Gwesela underscores the initiatives importance, calling it a game-changer and a welcome development showing tremendous potential to change the face of Zhombe.\n\nIt is not political, he emphasises. It is a mechanism to drive the development agenda of the people of Zhombe, in line with President Mnangagwas vision of a better country. As chiefs, we are happy because it unites and develops our communities. Our role is to give guidance and promote development within the confines of traditional leadership, preserving our culture.\n\nZedas story is one of hope, resilience, and the power of unity. It is a living testament to the idea that when people come together, mountains can move, and dreams can take flight.\n\nAs Zhombes sons and daughters rally behind this noble cause, their collective efforts are crafting a legacy that will endure for generations, proving that a nation, indeed, is built by its own people.\n\nThe future belongs to those who believe in the beauty of their dreams, and for Zhombe, the future has never been this brighter.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/zhombe.jpg",
            "description": "Fidelis Munyoro, Chief Reporter President Mnangagwa’s resonant declaration, “Nyika inovakwa nevene vayo/Ilizwe lakhiwa ngabanikazi balo” (A nation is built by its own people), reverberates powerfully throughout Zhombe rural, inspiring a wave of collective action. United by this clarion call, the people of Zhombe, in Midlands, are weaving a tapestry of transformation, pooling their resources to […]",
            "time": "2024-12-14 06:43:56"
        }
    ]
}