{
    "news": [
        {
            "title": "Police name victims of Beitbridge-Masvingo road accident",
            "url": "https://www.herald.co.zw/police-name-victims-of-beitbridge-masvingo-road-accident/",
            "content": "Online Reporter\n\nPOLICE have released names of 21 victims who perished in a fatal accident involving an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, along the Beitbridge-Masvingo Road, on February 13.\n\nThe accident claimed 24 lives on the spot, while another victim died later in hospital, bringing the total death toll to 25.\n\nPolice also confirmed that 29 injured passengers are receiving treatment at Beitbridge District Hospital, while two others remain admitted at Gwanda Provincial Hospital.\n\nThirteen critically injured passengers were transferred to United Bulawayo Group of Hospitals for further medical care.\n\nIn a statement, police spokesperson Commissioner Paul Nyathi identified 21 of the 25 deceased victims, who have already been confirmed by their next of kin.\n\nThe victims are:\n\nPolice have appealed to the public to help identify the remaining four victims.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/89b11f6a-223c-4951-8ee3-52f546ce2345-680x380.jpeg",
            "description": "Online Reporter POLICE have released names of 21 victims who perished in a fatal accident involving an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, along the Beitbridge-Masvingo Road, on February 13. The accident claimed 24 lives on the spot, while another victim died later in hospital, bringing the total death […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "Three killed in Kwekwe mine accident",
            "url": "https://www.herald.co.zw/three-killed-in-kwekwe-mine-accident/",
            "content": "Online Reporter\n\nTHREE people tragically died after plunging into a disused mine shaft at Yellowsnake 37 Mine in Kwekwe on Thursday, police have confirmed.\n\nIn a statement, police said the victims had entered the mine using a cage lift, but as they were exiting the shaft, the hook fastening the rope to the cage snapped.\n\nThe cage plummeted down the shaft, overturned and crushed the miners.\n\nAuthorities transported the bodies to Kwekwe General Hospital for post-mortem.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/09/Untitled-44.jpg",
            "description": "Online Reporter THREE people tragically died after plunging into a disused mine shaft at Yellowsnake 37 Mine in Kwekwe on Thursday, police have confirmed. In a statement, police said the victims had entered the mine using a cage lift, but as they were exiting the shaft, the hook fastening the rope to the cage snapped. […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "Heavy rains leave trail of destruction in Mhondoro-Mubaira",
            "url": "https://www.herald.co.zw/new-heavy-rains-leave-trail-of-destruction-in-mhondoro-mubaira/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nIncessant rains that pounded parts of the country in recent days have left a trail of destruction in Mhondoro-Mubaira constituency, Chegutu district, destroying over 13 houses and multiple maize fields.\n\nThe heavy downpour, which hit the area on Friday, was accompanied by strong winds that flattened crops and damaged property, particularly in Ward 1.\n\nLocal legislator Chamu Chiwanza said authorities were mobilising resources to assist affected families.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Rains.jpg",
            "description": "Conrad Mupesa Mashonaland West Bureau Incessant rains that pounded parts of the country in recent days have left a trail of destruction in Mhondoro-Mubaira constituency, Chegutu district, destroying over 13 houses and multiple maize fields. The heavy downpour, which hit the area on Friday, was accompanied by strong winds that flattened crops and damaged property, […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "War Veterans Fund Programme rolls out in Manicaland",
            "url": "https://www.herald.co.zw/war-veterans-fund-programme-rolls-out-in-manicaland/",
            "content": "Online Reporter\n\nAll is set for the launch of the Presidential War Veterans Fund and borehole drilling scheme today at Dewedzo High School, Makoni West in Rusape, Manicaland Province, marking a significant milestone in the Second Republics efforts to empower the countrys war veterans.\n\nThe programme, spearheaded by Dr Paul Tungwarara, Special Presidential Investment Advisor to the United Arab Emirates, aims to provide interest-free loans to war veterans, enabling them to start businesses and improve their livelihoods.\n\nA total of US$150 000 has been allocated to Manicaland Province as part of the US$1.5 million set aside for war veterans nationwide. The allocation is subject to review over time.\n\nAs part of the programme, a solar powered borehole and a new house built for one of the war veterans will be officially launched, marking the beginning of the Presidential War Veterans borehole drilling scheme.\n\nThe launch event, scheduled for today, will be attended by high-profile dignitaries, including Makoni West Member of Parliament and Information Minister Dr Jenfan Muswere, Minister of State for Manicaland Province Advocate Misheck Mugadza, Minister of Veterans of the Liberation Struggle Affairs Monica Mavhunga, and Secretary for War Veterans Douglas Mahiya.\n\nThis programme has already been launched in Harare, Masvingo, Mashonaland Provinces, and Midlands, and is expected to be replicated in all other provinces.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/IMG-20250215-WA0027-680x380.jpg",
            "description": "Online Reporter All is set for the launch of the Presidential War Veterans Fund and borehole drilling scheme today at Dewedzo High School, Makoni West in Rusape, Manicaland Province, marking a significant milestone in the Second Republic’s efforts to empower the country’s war veterans. The programme, spearheaded by Dr Paul Tungwarara, Special Presidential Investment Advisor […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "UPDATE: Three killed in Beatrice road accident",
            "url": "https://www.herald.co.zw/update-three-killed-in-beatrice-road-accident/",
            "content": "Online Reporter\n\nThree people died on the spot on Saturday afternoon following a head-on collision between a Mandaza bus and a Glen View 2 High School bus at the 40-kilometre peg along the Masvingo-Harare Road, police have confirmed.\n\nIn a statement posted on X, the police said authorities are still assessing the number of injured passengers.\n\nThe ZRP confirms a fatal road accident which occurred this afternoon at the 40 kilometre peg along Masvingo-Harare Road in Beatrice, reads the statement.\n\nThree people died on the spot when a Mandaza bus was involved in a head on collision with a school bus.\n\nThe number of the injured people is yet to be established.\n\nPolice are currently at the scene.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/IMG-20250215-WA0012.jpg",
            "description": "Online Reporter Three people died on the spot on Saturday afternoon following a head-on collision between a Mandaza bus and a Glen View 2 High School bus at the 40-kilometre peg along the Masvingo-Harare Road, police have confirmed. In a statement posted on X, the police said authorities are still assessing the number of injured […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "Glen View 2 High School bus involved in accident on Harare-Masvingo highway",
            "url": "https://www.herald.co.zw/glen-view-2-high-school-bus-involved-in-accident-on-harare-masvingo-highway/",
            "content": "Online Reporter\n\nA Glen View 2 High School bus collided with a Mandaza Bus along the Harare-Masvingo Highway, about 10km after Beatrice, police have confirmed.\n\nAuthorities said investigations were underway, and more details would be released later this afternoon.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/IMG-20250215-WA0012.jpg",
            "description": "Online Reporter A Glen View 2 High School bus collided with a Mandaza Bus along the Harare-Masvingo Highway, about 10km after Beatrice, police have confirmed. Authorities said investigations were underway, and more details would be released later this afternoon.",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "President in Ethiopia for the 38th Ordinary Session of the African Union Summit",
            "url": "https://www.herald.co.zw/president-in-ethiopia-for-the-38th-ordinary-session-of-the-african-union-summit/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/1500x500-618x380.png",
            "description": "",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "President Mnangagwa to attend AU Assembly today",
            "url": "https://www.herald.co.zw/president-mnangagwa-to-attend-au-assembly-today/",
            "content": "Garikai Fadzi in ADDIS ABABA, Ethiopia\n\nPRESIDENT MNANGAGWA, who is also the chairperson of SADC, will attend the official opening of the 38th Ordinary Session of the African Union (AU) Assembly of Heads of State and Government here this morning.\n\nHe will also attend a high-level breakfast briefing on South Africas G20 Presidency, hosted by President Cyril Ramaphosa of South Africa at the AU headquarters.\n\nSouth Africas G20 Presidency takes place when the world is facing a series of overlapping and mutually reinforcing crises, including climate change, underdevelopment, inequality, poverty, hunger, unemployment, technological changes and geopolitical instability.\n\nPresident Mnangagwa also has a meeting lined up with his Mozambican counterpart, President Daniel Chapo.\n\nThe two could not meet yesterday due to a packed schedule.\n\nFurther, President Mnangagwa and Hakainde Hichilema of Zambia will formally introduce the SADC and COMESA endorsed candidate for the African Development Bank (AfDB), Dr Samuel Maimbo.\n\nMore than five candidates from African countries are contesting for the AfDB presidency.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/GjsrlmAXUAAeEN_-680x380.jpg",
            "description": "Garikai Fadzi in ADDIS ABABA, Ethiopia PRESIDENT MNANGAGWA, who is also the chairperson of SADC, will attend the official opening of the 38th Ordinary Session of the African Union (AU) Assembly of Heads of State and Government here this morning. He will also attend a high-level breakfast briefing on South Africa’s G20 Presidency, hosted by […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "President rallies Africa on health . . . Calls for local resources to fight disease outbreaks",
            "url": "https://www.herald.co.zw/president-rallies-africa-on-health/",
            "content": "Garikai Fadzi in ADDIS ABABA, Ethiopia\n\nTHE African continent should direct more local resources towards fighting outbreaks of diseases such as cholera, mpox and marburg, President Mnangagwa has said.\n\nAddressing the High-Level Meeting on Domestic Health Financing here yesterday, the President highlighted that on its part, Zimbabwe was working on ensuring at least 13 percent of its annual Budget is directed towards the health sector in line with the Abuja Declaration.\n\nThe High-Level Meeting on Domestic Health Financing encourages domestic investment in the sector appropriately so that each country can pursue its path to achieving and sustaining universal health coverage.\n\nI am pleased my Governments allocation towards health has increased significantly, from 9,8 percent of the national budget in 2024 to 13,01 percent in 2025, as we move towards the 15 percent Abuja target, he said.\n\nThe President unpacked some of the innovative ways Zimbabwe has adopted in raising revenue for the health sector.\n\nHe said Zimbabwe has successfully introduced innovation tax regimes towards the health sector, including the Health Levy, which is a mobile airtime tax, and the sugar tax for beverages, to combat the increasing burden of non-communicable diseases.\n\nMost recently, we have introduced a fast-food tax to further support our health initiatives and act as a negative incentive for the consumption of fast foods, said President Mnangagwa.\n\nRwanda President Paul Kagame is the African Union Domestic Health Financing champion.\n\nThe meeting came at a time when most African countries say their health sectors are at risk of challenges following anExecutive Order signed by United States President Donald Trump, withdrawing from the World Health Organisation (WHO) and immediately stopping foreign assistance for 90 days.\n\nHealth budgets on the continent were cushioned by aid, especially from US agencies, and its suspension is expected to bring challenges to many countries, hence the call for nations to focus on domestic resource mobilisation.\n\nOn its part, Zimbabwe has indicated that it will use taxes on alcohol, cigarettes, fast food, and sugary beverages, commonly known as sin taxes, to cover health sector needs.\n\nHealth and Child Care Deputy Minister, Sleiman Kwidini, recently told legislators in Parliament that the situation of health funding following the suspension of donations from the US was undercontrol.\n\nEarlier in the day, President Mnangagwas hectic schedule had seen him receiving Sheik Shakhboot Al Nahyan, Minister of State of the United Arab Emirates.\n\nPresident Mnangagwa meetsSheik Shakhboot Al Nahyan of the United Arab Emirates, Minister of State in the United Arab Emirates and a member of the Royal family in Addis Ababa, Ethiopia yesterday.\n\nThe Emirati visited President Mnangagwa at his hotel.\n\nUAE is presently Zimbabwes second largest trading partner behind South Africa.\n\nSpeaking after the meeting, Foreign Affairs and International Trade Minister, Professor Amon Murwira, described relations between Zimbabwe and the UAE as solid, ever since the two countries opened embassies in each others capitals in 2018 and 2019.\n\nOur number one trading partner is South Africa and now our number two trading partner is UAE, he said.\n\nZimbabwe exports precious minerals and agricultural products while importing manufactured goods and essential commodities from the UAE.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/13er31r-680x380.jpg",
            "description": "Garikai Fadzi in ADDIS ABABA, Ethiopia THE African continent should direct more local resources towards fighting outbreaks of diseases such as cholera, mpox and marburg, President Mnangagwa has said. Addressing the High-Level Meeting on Domestic Health Financing here yesterday, the President highlighted that on its part, Zimbabwe was working on ensuring at least 13 percent […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        },
        {
            "title": "Huge send off for B/bridge horror crash victims",
            "url": "https://www.herald.co.zw/huge-send-off-for-b-bridge-horror-crash-victims/",
            "content": "Thupeyo Muleya-Beitbridge Bureau\n\nThree Government ministers yesterday joined mourners at a mass send-off for the 25 people who tragically died in a head-on collision involving a bus and a haulage truck on the Beitbridge-Masvingo Highway on Thursday.\n\nLocal Government and Public Works Minister Daniel Garwe, Transport and Infrastructural Development Minister Felix Mhona, and Matabeleland South Provincial Affairs and Devolution Minister Dr Evelyn Ndlovu, were in Beitbridge to assess the situation and console the families of victims who perished in the tragedy.\n\nThe ministers also visited the accident site and survivors who are receiving treatment at Beitbridge District Hospital.\n\nA combined memorial service was held at Doves Funeral Services parlour, where scores of relatives and residents gathered.A sombreatmosphere enveloped the parlour as the community mourned the victims.\n\nMinister Garwe, who also oversees civil protection matters, said the Government was deeply saddened by the crash and pledged support for the bereaved families.\n\nWe express our condolences and we will do everything necessary to assist the bereaved families so that they may bury their departed relatives, he said.\n\nWe are here with a message from President Mnangagwa about his deepest sorrow over the loss of lives by fellow Zimbabweans, he said.\n\nIn his condolence message on Thursday, President Mnangagwa declared the accident a national disaster and accorded the 25 passengers State-assisted burials.\n\nMinister Garwe said families had been assisted with coffins, burial documentation, food, and transportation of the deceased from Beitbridge to various burial sites.\n\nHe said it was saddening that most families had lost breadwinners and young people.\n\nThe eldest among the deceased was around 56 years old and many were below 30. This is quite sad for us as a nation, he said.\n\nOn his part, Minister Mhona said he had directed all enforcement departments under his ministry to conduct a full investigation into the accident and take appropriate action.\n\nWe are investigating the circumstances surrounding this tragedy, and necessary measures will be taken to prevent such incidents in the future. We are grieving and we want to thank our great leader President, Cde Dr Emmerson Dambudzo Mnangagwa, who is also grieved and has stated in his statement that as authorities we must take action.\n\nSo, together with other enforcers, we dont take this lightly and we cant continue to tolerate lawlessness on our roads. I have tasked the Road Motor Transportation Department to take charge and make sure that we get to the bottom of this accident and we will not focus on this incident alone.\n\nMinister Mhona added that through various Government agencies, the Ministry of Transport would continue to educate motorists and road users on the importance of adhering to road rules and regulations.\n\nHe also commended the Beitbridge community for their assistance they rendered at the accident scene, ferrying victims to the hospital and offering support to survivors and medical staff at Beitbridge District Hospital.\n\nOn her part, Dr Ndlovu said Matabeleland South was in deep mourning.\n\nShe wished the injured a speedy recovery and assured them that her office would visit those receiving treatment at Gwanda and United Bulawayo Hospitals.\n\nPresident Mnangagwa expressed his condolences and announced that the deceased would receive State-assisted burials.\n\nZimbabwe Passengers Transport Organisation (ZPTO) chairman, Dr Samson Nhanhanga, offered condolences and called on public transport operators to address speeding.\n\nHe also donated US$11 000 to the Government to assist with burials.\n\nSpeed has become our worst enemy. We continue urging our drivers to adhere to good road driving ethics, he said.\n\nThe Insurance Council of Zimbabwe said it would cover medical and funeral expenses for all passengers, while the Traffic Safety Council has provided hampers to those hospitalised.\n\nThe local business community, including the Mayor of Beitbridge, Councillor Peter Pirato Mafuta, donated fuel, ambulances and other consumables.\n\nBeitbridge district medical officerDr Lenos Samhere, said they have 29 patients at the hospital.\n\nWe have 15 in the female ward and 14 in the male ward. Those who were in critical condition were transferred to Gwanda Provincial Hospital and United Bulawayo Hospitals, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Ministers-Mhona-and-Garwe-680x380.jpg",
            "description": "Thupeyo Muleya-Beitbridge Bureau Three Government ministers yesterday joined mourners at a mass send-off for the 25 people who tragically died in a head-on collision involving a bus and a haulage truck on the Beitbridge-Masvingo Highway on Thursday. Local Government and Public Works Minister Daniel Garwe, Transport and Infrastructural Development Minister Felix Mhona, and Matabeleland South […]",
            "time": "06:08",
            "date": "16 Feb 2025"
        }
    ]
}