{
    "news": [
        {
            "title": "Woman  jailed for stealing US$25k from her mother’s employer",
            "url": "https://www.herald.co.zw/woman-jailed-for-stealing-us25k-from-her-mothers-employer/",
            "content": "Prosper Dembedza, Herald Correspondent\n\nA 23-year-old Harare woman who stole US$25 000 from her mothers employer will spend the next 15 months in jail after she was convicted of theft.\n\nPriscilla Gwasira was convicted by Harare magistrate Ms Lisa Mutendereki after a full trial.\n\nShe was being jointly charges with Noah Defred (55) and Beauty Ushendibaba (53) who were acquitted.\n\nGwasira was also ordered to restitute US$17 700 to the complainant. The magistrate ruled that Gwasiras accomplices including her own mother (Ushendibaba) and Defred were not implicated by the CCTV hence word of mouth from the convict could not be taken as evidence without proper support.\n\nGwasira is Ushendibabas biological daughter. Defred and Ushendibaba were employed by Ashleigh Kruger, who is the complainant.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/court-hammer.jpg",
            "description": "Prosper Dembedza, Herald Correspondent A 23-year-old Harare woman who stole US$25 000 from her mother’s employer will spend the next 15 months in jail after she was convicted of theft. Priscilla Gwasira was convicted by Harare magistrate Ms Lisa Mutendereki after a full trial. She was being jointly charges with Noah Defred (55) and  Beauty […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "Natpharm Manicaland Warehouse completion eases drug storage challenges",
            "url": "https://www.herald.co.zw/natpharm-manicaland-warehouse-completion-eases-drug-storage-challenges/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nThe completion of the US$6 million National Pharmaceutical Companys warehouse in Manicaland Province will go a long way in addressing logistical challenges in the storage of drugs in the province, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said.\n\nDr Muswere said this Wednesday during the ongoing media tour of development projects across the country.\n\nThe operationalisation of the warehouse has gone a long way in the safe keeping of drugs, as you know some drugs require refrigeration and that has been addressed by this warehouse, Dr Muswere said.\n\nMinister Muswere also toured the 140 KW solar plant at the Victoria Chitepo Provincial Hospital that he also said will enhance operations at the provincial hospital.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/g34g34-680x380.jpg",
            "description": "Farirai Machivenyika Senior Reporter The completion of the US$6 million National Pharmaceutical Company’s warehouse in Manicaland Province will go a long way in addressing logistical challenges in the storage of drugs in the province, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said. Dr Muswere said this Wednesday during the ongoing media tour […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "Immigration compliance unit arrests 3 493 at Beitbridge",
            "url": "https://www.herald.co.zw/immigration-compliance-unit-arrests-3-493-at-beitbridge/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nTHE Department of Immigrations Regional Compliance and Enforcement Unit has said it is not relenting on its quest to prevent criminals and illegal migrants/immigrants from accessing the transformed Beitbridge Border Post.\n\nFigures from the department show that 3 493 people were arrested for various offences relating to illegal activities between Zimbabwe and South Africa between December 1 and January 7.\n\nThe on-going regional compliance operation which is also supported by other border agencies is meant to curtail criminal activities, among them border jumping, and touting.\n\nOther crimes include the use of fake immigration stamps, and fake travel documents that are synonymous with a surge in human traffic.\n\nAssistant Regional Immigration Officer-in-charge Beitbridge, Mrs Canisia Magaya said they were working with other border agencies to minimise illegal activities at the border post.\n\nShe said during the same period under review a total of 591 people had been refused entry into South Africa and Zimbabwe due to various reason.\n\nAmong these were 538 Zimbabweans, 46 Malawians, two Tanzanians, two Congolese, one Ghanaian and two Kenyans.\n\nSome of the reasons for refusal of entry include not having visas, unpaid fines, being undocumented and being blacklisted as undesirable immigrants, said Mrs Magaya.\n\nWe are not relenting on our quest to maintain safety and security of travellers and ensuring we have a flawless flow of traffic this festive season.\n\nOur regional enforcement and compliance remains firm on the ground and between December 1 and January 7 we intercepted a total of 3 493 people for violating immigration laws and we handed them to the ZRP for further management.\n\nShe said some of the irregular migrants were intercepted on the south African side of the border after finding their way through illegal crossing points dotted along the Limpopo River.\n\nMrs Magaya said the team was also descending hard on child smuggling cases and that during the festive period they prevented 61 minors from being illegal transported to South Africa.\n\nThese unaccompanied minors, have since been handed over to the Department of Social Development (DSD) for contact tracing and reunification with parents or guardians.\n\nWe have deployed enough manpower and are targeting all known hotspots and areas, said Mrs Magaya.\n\nAt the same time, the department is urging travellers to continuously use the designated port of entry and exit for their own safety.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/immigration.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau THE Department of Immigration’s Regional Compliance and Enforcement Unit has said it is not relenting on its quest to prevent criminals and illegal migrants/immigrants from accessing the transformed Beitbridge Border Post. Figures from the department show that 3 493 people were arrested for various offences relating to illegal activities between Zimbabwe […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "Rescue operation for trapped miners continue",
            "url": "https://www.herald.co.zw/rescue-operation-for-trapped-miners-continue/",
            "content": "Victor Maphosa in Makaha, Mudzi\n\nAttempts to rescue some artisanal miners who were buried alive after a shaft they were working in collapsed are underway in Makaha, Mudzi.\n\nThe incident occurred near Mutondo Business Centre in Makaha on Friday last week. While the number of miners trapped in the shaft is not yet known, sources close to the incident allege that about three people were buried alive on that day.\n\nWhen The Herald arrived at the mining site on Thursday members of the community were gathered at the site while some workers from neighboring mines were busy trying to locate the trapped people.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/44fg42fg-680x380.jpg",
            "description": "Victor Maphosa in Makaha, Mudzi Attempts to rescue some artisanal miners who were buried alive after a shaft they were working in collapsed are underway in Makaha, Mudzi. The incident occurred near Mutondo Business Centre in Makaha on Friday last week. While the number of miners trapped in the shaft is not yet known, sources […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "GMB announces 2024/25 pre-planting producer prices.",
            "url": "https://www.herald.co.zw/gmb-announces-2024-25-pre-planting-producer-prices/",
            "content": "Precious Manomano, Herald Reporter\n\nThe Grain Marketing Board has announced pre-planting prices for maize, traditional grains, soya bean and sunflower for the 2025 season.\n\nIn a statement Grain Marketing Board chief executive officer Dr Edson Badarai announced that the maize pre-planting prices is US$335,14 per tonne, traditional grains US$335,14 per tonne, soyabean US$619,31 per tonne and sunflower US$712,20 per tonne.\n\nLast season Government approved an incentive planting price of US$440 per tonne for wheat and US$360 for maize and sorghum per tonne.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Dr-Edson-Badarai.jpg",
            "description": "Precious Manomano, Herald Reporter The Grain Marketing Board has announced pre-planting prices for maize, traditional grains, soya bean and sunflower for the 2025 season. In a statement Grain Marketing Board chief executive officer Dr Edson Badarai announced that the maize pre-planting prices is US$335,14 per tonne, traditional grains US$335,14 per tonne, soyabean US$619,31 per tonne […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "Beitbridge Municipality starts attending to sewer reticulation challenges",
            "url": "https://www.herald.co.zw/beitbridge-municipality-starts-attending-to-sewer-reticulation-challenges/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nAuthorities at the Beitbridge Municipality have started working on addressing sewer reticulation challenges which had become a cause for concern around the town during the last three months.\n\nDulivhadzimu, Tshitaudze (Alpha and Two rooms area) and Khwalu 1 (Shule Shule area) among others have been the hardest hit by sewage challenges.\n\nIn some of the suburbs sewage is flowing freely onto the streets, resulting is residents raising alarm over possible outbreak of diseases such as cholera, typhoid and dysentery.\n\nBeitbridge town clerk Mr Loud Ramakgapola said a team was already on the ground attending to challenges in all the known hotspots.\n\nOur team is on the ground fixing the sewage problems. We expect to have covered a lot of ground by the end of the week, said Mr Ramakgapola.\n\nA few years ago the local authority was taken to court by the Environmental Management Agency (EMA) charged for contravening sections 57, 60 and 70 of the Environmental Management Act, for failing to attend to an increase in sewer bursts in most western suburbs.\n\nHowever, the municipality announced recently that it intends to upgrade its sewer reticulation infrastructure to meet the projected growth of the town.\n\nThe border town got a boost when the Government constructed a modern sewer oxidation dam under the US$300 million border upgrade project, being undertaken by the Government and its partner, Zimborders Consortium.\n\nThe sewer oxidation dam, a 1,4-water reservoir, an animal plant and quarantine centre, 220 housing units for civil servants and a fire station are major projects meant to improve service delivery.\n\nPrior to the latest development, the local authority had been struggling to address water and sewer reticulation challenges.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/sewage.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau Authorities at the Beitbridge Municipality have started working on addressing sewer reticulation challenges which had become a cause for concern around the town during the last three months. Dulivhadzimu, Tshitaudze (Alpha and Two rooms area) and Khwalu 1 (Shule Shule area) among others have been the hardest hit by sewage challenges. […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "Chombo awards scholarship to a bright female student",
            "url": "https://www.herald.co.zw/chombo-awards-scholarship-to-a-bright-female-student/",
            "content": "Conrad Mupesa Mashonaland West Bureau\n\nMASHONALAND West Provincial Affairs and Devolution Minister Marian Chombo has awarded a full scholarship to a gifted Grade 7 student, Mellisa Hwata, who attained eight points in her Grade 7 exams last year\n\nThe scholarship will cover her fees, uniforms and stationery for the next six academic years.\n\nMellisa, who was accompanied by her mother, met Minister Chombo at her offices on Thursday morning.\n\nMinister Chombo said her initiative demonstrates her commitment to fulfilling the Presidents Vision of ensuring every child has access to education, ultimately contributing to an upper-middle-income society by 2030.\n\nMellisa thanked the Minister before assuring her of her commitment to school work for the betterment of the nation and the girl child.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-15-680x380.png",
            "description": "Conrad Mupesa Mashonaland West Bureau MASHONALAND West Provincial Affairs and Devolution Minister Marian Chombo has awarded a full scholarship to a gifted Grade 7 student, Mellisa Hwata, who attained eight points in her Grade 7 exams last year The scholarship will cover her fees, uniforms and stationery for the next six academic years. Mellisa, who […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "President meets Algerian bound students",
            "url": "https://www.herald.co.zw/president-meets-algerian-bound-students-2/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPresident Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe.\n\nIn his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large.\n\nWhen you are there you individually and collectively become ambassadors of our country. So never think that you are an individual, wherever you are, you are actually representing us, he said.\n\nOne of the scholarship beneficiaries, Natasha Ruvimbo, said she was elated to have been accorded the scholarship.\n\nI am 20 and I was overjoyed, excited and most of all grateful to God for awarding me this opportunity and also to the President for this scholarship opportunity, she said.\n\nAnother student, Melogina Mano said: I am very happy because this is not an opportunity accorded to many.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/9e01f7d6-fc4e-4286-aa74-2191f5f0f26a-680x380.jpeg",
            "description": "Wallace Ruzvidzo Herald Reporter President Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe. In his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large. “When you are there […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "President meets Algerian bound students",
            "url": "https://www.herald.co.zw/president-meets-algerian-bound-students/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPresident Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe.\n\nIn his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large.\n\nWhen you are there you individually and collectively become ambassadors of our country. So never think that you are an individual, wherever you are, you are actually representing us, he said.\n\nOne of the scholarship beneficiaries, Natasha Ruvimbo, said she was elated to have been accorded the scholarship.\n\nI am 20 and I was overjoyed, excited and most of all grateful to God for awarding me this opportunity and also to the President for this scholarship opportunity, she said.\n\nAnother student, Melogina Mano said: I am very happy because this is not an opportunity accorded to many.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/9e01f7d6-fc4e-4286-aa74-2191f5f0f26a-680x380.jpeg",
            "description": "Wallace Ruzvidzo Herald Reporter President Mnangagwa on Thursday saw off five students who will be leaving for Algeria on a scholarship programme accorded to Zimbabwe. In his remarks at State House, the President charged the students to always remember that they are not just representing themselves but the country at large. “When you are there […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        },
        {
            "title": "SAPS dismiss ritual murder claims by foreigners in Limpopo province",
            "url": "https://www.herald.co.zw/saps-dismiss-ritual-murder-claims-by-foreigners-in-limpopo-province/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth Africas police commander for Limpopo province, Lieutenant General Thembi Hadebe has dismissed as false claims on some social media platforms that migrants (foreign nationals) are allegedly working with South Africans in the province to kill people for their body parts.\n\nAccording to the claims, there are organised criminals stealing vehicles and approaching houses, pretending to seek help.\n\nAs soon as they gain entry into the houses, they then kill the occupants by removing their body parts while they are still alive.\n\nIn a statement on Thursday, Lt Hadebe condemned the spreading of fake news.\n\nOne of our biggest threats at the moment is fake news, she said.\n\nWe strongly condemn the spreading of fake news, unverified information, rumours or threats as this seeks to cause panic and confusion, and in some instances incite possible violence. We urge the members of the public to fact-check first before sharing anything on social media platforms.\n\nLt Hadebe said the police will arrest those who will be found sharing inflammatory messages.\n\nShe urged members of the public to promptly report such incidents were people spread false or fake news to ensure that law enforcement deals with the culprits.\n\nOf late there has been an upsurge of false information being shared in various media platforms in South Africa to the effect that foreign nationals are responsible for unending crime in the neighbouring country.\n\nAccording to the World Population Review in 2024, South Africa was ranked the fifth country with the highest crime rate index of 75.5 per 100 000 people.\n\nIt experiences high rates of violent crimes including assaults, rape and murder.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-14-680x380.png",
            "description": "Thupeyo Muleya Beitbridge Bureau South Africa’s police commander for Limpopo province, Lieutenant General Thembi Hadebe has dismissed as false claims on some social media platforms that migrants (foreign nationals) are allegedly working with South Africans in the province to kill people for their body parts. According to the claims, there are organised criminals stealing vehicles […]",
            "time": "20:41",
            "date": "09 Jan 2025"
        }
    ]
}