{
    "news": [
        {
            "title": "‘Road infrastructure anchors integration’",
            "url": "https://www.herald.co.zw/road-infrastructure-anchors-integration/",
            "content": "Zvamaida Murwira in SHURUGWI\n\nZIMBABWE will continue to develop and upgrade road infrastructure as it is a key enabler for economic development and growth, not only for the country, but for the region and beyond, President Mnangagwa has said.\n\nHe made the remarks while addressing thousands of people gathered at Mkandapi Business Centre in Shurugwi District after commissioning a resurfaced 43-kilometre stretch of the Shurugwi-Mhandamabwe Highway.\n\nThe project is part of the Second Republics elaborate plans to stimulate economic growth anchored on infrastructural development.\n\nThe Government particularly wants to improve the countrys road network to enhance connectivity as envisaged in the National Development Strategy 1 (NDS1).\n\nAddressing a bumper crowd after unveiling a plaque at the nearby Chachacha Business Centre, the President said the project was part of the Governments development trajectory towards the attainment of Vision 2030.\n\nThe President addresses villagers at Mkandapi Business Centre after he commissioned the Shurugwi-Mhandamabwe Road project in Shurugwi, Midlands yesterday.Picture: Believe Nyakudjara.\n\nHe said Vision 2030 entailed the implementation of a harmonised regional strategy for road infrastructure development.\n\nThis project is part of Governments broader plan by the Second Republic aimed at attaining Vision 2030, which we should celebrate. The implementation of a harmonised regional strategy for road infrastructure in our region is not only for Zimbabwe, but for the region. We collaborate in many respects so that when our neighbours visit us, they should cherish what we are doing, said President Mnangagwa.\n\nHe commended the Ministry of Transport and Infrastructural Development led by Minister Felix Mhona for spearheading several road projects in the country.\n\nTodays event is impactful as we transform and upgrade our transport infrastructure which is a key enabler of our economic growth and development. I grew up in this area and in the 1940s and 1950s, we would travel long distances from here to Shurugwi and Gweru to sell sweet potatoes and other products with my mother. We would take the whole day travelling, but now because of modernisation, it is taking a few hours. This has all changed, President Mnangagwa said.\n\nHe urged ministries to continue pushing projects that have a national impact and also bear economic benefits.\n\nWe need to provide an efficient transport network which is essential for enabling people to exchange visits and access markets and also to promote regional and international integration. Zimbabwe cannot grow in isolation. The development of Zimbabwe is inter-related with the development of other countries in the region. Anychallenges that might affect one country in the region hurt other countries in the region, said President Mnangagwa.\n\nFor our country to develop we require robust infrastructure, planning and development, we need to develop the necessary domestic linkages. You must have a zeal to develop your own country. What determines the development of a country is its infrastructure, road network, schools and clinics that are adjacent to communities. You do not need to travel long distances to access social services such as education and health.\n\nHe commended Road Truckers Construction, the company that resurfaced Shurugwi Mhandamabwe Highway, for a job well done.\n\nPresident Mnangagwa and Vice President Constantino Chiwenga chat at the official opening of the Iron and Steel Indaba in Kwekwe yesterday.\n\nTurning to the countrys natural resources, President Mnangagwa said minerals must benefit the communities from which they are being extracted.\n\nWe also do not allow indiscriminate mining without due regard to the environment and land degradation, he said.\n\nOn agriculture, President Mnangagwa said farmers should continue preparing for the summer cropping season and assured villagers that the Government will continue providing seed inputs.\n\nHe also urged motorists not to drink and drive ahead of the festive season, calling on law enforcement agencies to apply the law firmly to ensure an accident-free holiday.\n\nTransport and Infrastructural Development Minister Felix Mhona commended President Mnangagwa for his leadership which he said had seen his Ministry registering several milestones in infrastructure development.\n\nYour wise leadership has registered wonders despite illegal sanctions that would have ordinarily affected the projects, he said.\n\nChief Secretary to the President and Cabinet Dr Martin Rushwaya (with neck-tie) and Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere (left)arrive for the official opening of the Iron and Steel Indaba in Kwekwe. yesterday\n\nMinister of State for Provincial Affairs and Devolution responsible for Midlands Province, Cde Owen Ncube, said the province has been a hub of development owing to the leadership of President Mnangagwa.\n\nThe Shurugwi-Mhandamabwe road is viewed as a catalyst for enhancing transport movement along the Southern corridor and has gone through a substantial transformation to improve border-to-border connectivity.\n\nIt primarily connects Beitbridge with other borders including Chirundu and Nyamapanda.\n\nThe event was attended by Cabinet Ministers, legislators, traditional leaders and senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-in-Chivi.jpg",
            "description": "Zvamaida Murwira in SHURUGWI ZIMBABWE will continue to develop and upgrade road infrastructure as it is a key enabler for economic development and growth, not only for the country, but for the region and beyond, President Mnangagwa has said. He made the remarks while addressing thousands of people gathered at Mkandapi Business Centre in Shurugwi […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Iron, steel sector key to economic revitalisation: President",
            "url": "https://www.herald.co.zw/iron-steel-sector-key-to-economic-revitalisation-president/",
            "content": "Patrick Chitumba and Freedom Mupanedemo\n\nPRESIDENT Mnangagwa has underscored the importance of the iron and steel industry in Zimbabwes economic revitalisation, highlighting its vast potential to transform, not only the countrys economy, but that of the entire SADC region.\n\nThe President said the industrys current state was worrisome, with Zimbabwe spending in excess of US$1 billion on importation of iron and steel.\n\nHe was speaking at a gathering to officially open the Iron and Steel Indaba which is underway at a hotel in Kwekwe.\n\nIn attendance were Vice President Constantino Chiwenga, Industry and Commerce Minister Mangaliso Ndlovu and other senior Government officials.\n\nIn attendance were Vice President Constantino Chiwenga, Industry and Commerce Minister Mangaliso Ndlovu and other senior Government officials.\n\nIt is my singular honour and privilege to officiate at this Iron and Steel Indaba here in Midlands Province, being hosted under the theme, Leveraging the Resurgence of Zimbabwes Iron and Steel Industry. As you are aware, the Engineering, Iron and Steel industry has always been a cornerstone of Zimbabwes industrial landscape. In the past this was through the operations of Ziscosteel, then the largest steelworks in Zimbabwe, he said.\n\nPresident Mnangagwa said the sector holds immense multiplier effects in promoting value addition and beneficiation by leveraging the countrys expansive mineral resources, such as iron ore and chrome, among others.\n\nIn light of this, the resurgence of this sector is of urgent necessity. This Indaba is, therefore, taking place at an opportune time. It is in line with our vision to ultimately establish a robust and sustainable iron and steel industry that meets domestic demand, while also positioning Zimbabwe as a regional manufacturing hub, he said.\n\nThe President added that the recent operationalisation of the Dinson Iron and Steel Company in Manhize, Mvuma, has significantly increased the prospects of the sector.\n\nThe investment by Tsingshan Group, which is the largest steel giant in Sub-Saharan Africa, and the 6th leader in the world, is a show of confidence, by one of the global industry leaders, in our iron and steel sub-sector, he said.\n\nThe iron and steel value chains, the President added, are among key sectors identified to accelerate the transformation and growth of the manufacturing sector.\n\nThrough the requisite policy mix, our manufacturing has been on the rebound. Capacity utilisation increased from an average of 36.4 percent in 2019 to 53.2 percent in 2023, while capital investments in the sector amounted to US$747 million over the past three years. Shelf occupancy of locally produced goods rose from about 64 percent to 80 percent in 2019 and 2023, respectively, he said.\n\nFurthermore, President Mnangagwa said, the manufacturing sectors contribution to overall national employment remains on a positive growth trajectory from 7.5 percent in 2019 to 9.7 percent in 2023.\n\nHe said the vast natural resources and a youthful population should be continuously harnessed for sustainable industrial transformation in the country.\n\nIt is a misnomer that we continue to lose millions every year on the importation of iron and steel and other related products. This is despite the numerous investments within our manufacturing sector. It is against this background that the Second Republic resolved to facilitate a vibrant, dynamic and competitive industrial base, driven by smart and strategic value-chain linkages. We are fostering structural transformation of our economy by putting in place deliberate and systematic measures to graduate from being resource-driven to a knowledge-based economy. This will be achieved through incremental step-by-step, brick-upon-brick, and stone-upon-stone processes, President Mnangagwa said.\n\nThe Iron and Steel indaba is thus expected to speed up the realisation of targets in the critical mining sector and the economy as a whole, towards Vision 2030.\n\nHe said the Indaba is taking place after the Government, through Treasury, recently presented an elaborate 2025 National Budget, which is both citizen and pro-business-centric.\n\nFrom a regional perspective, Zimbabwe, as the current chair of SADC, has the opportunity to drive both the national and regional industrialisation agenda.\n\nFurther, the present round of the Industrial Revolution is moving at a heightenedpace, characterised by increased digitalisation, artificial intelligence and innovation. These are in-turn transitioning traditional modes of production as well as broadening the range of products required by the markets, said President Mnangagwa.\n\nI, thus, challenge stakeholders in this sector to take leadership and implement forward-looking business models which impact beyond our borders and the continent. Zimbabwe and the SADC region are part of the global village and should not be left behind.\n\nHe said the domestication of the value chains and value addition must be expedited, adding that the sector is integral for the resuscitation and modernisation of the national railway network, as well as foundry and fabrication of industrial equipment for the transport and energy sectors, among others.\n\nIn the agriculture sector, President Mnangagwa said iron and steel products are essential to counter the dire consequences of climate change through expanding the countrys irrigation infrastructure to build resilience, while also securing farm land through appropriate boundary fences.\n\nSimilarly, our construction sector, other infrastructure such as dams, modern roads and bridges, among other upstream, downstream and main-stream products, all depend on the viability of this sector. Great is the task before you, hence the need to have unity of purpose and collaboration. This Indaba should merely be the first step. The sector cannot afford to work in silos but must be complementary in approach, leveraging on the various technical resources and skills that reside within different entities in the industry, he said.\n\nPresident Mnangagwa said to scale up efforts in this regard, it is critically important that the strategies to resuscitate and grow the sector are holistic, well-co-ordinated and focused on the overall national good.\n\nThe President, who later in the day commissioned the Shurugwi-Mhandamahwe road, said other national development projects such as the Gwayi-Shangani Dam in Matabeleland North, and Tugwi Mukosi Dam among others, are important for the realisation of national targets.\n\nHe said energy projects like the new 720 MW power plant under construction in the Hwange area, will aid the drive for a robust and growing iron and steel sector anchored on broader value chains.\n\nA skilled workforce equipped with modern technical expertise is an integral component for sustaining innovation, productivity and growth of the iron and steel industry. Hence, investments in human capital development are essential, as well as partnerships between industry players and academia, said President Mnangagwa.\n\nHe said the Indaba is taking place after the Government, through Treasury, recently presented an elaborate 2025 National Budget, which is both citizen and pro-business-centric.\n\nIt is my sincere hope that as businesses, you will capitalise on the wide spectrum of both fiscal and non-fiscal incentives availed for sustainable economic development. As we engage and deliberate throughout this Indaba, it is critically important that we collectively find lasting solutions to resuscitate and grow the iron and steel sector. The generality of our population counts on our unity of purpose to deliver a prosperous economy, sector by sector, President Mnangagwa said.\n\nAddressing the same gathering, VP Chiwenga said the entry of Dinson Iron and Steel into Zimbabwe was a game-changer which will see the country becoming one of the major producers of iron and steel products.\n\nHe said it was through President Mnangagwas engagement and re-engagement drive that Dinson invested in the country.\n\nIt is through your engagement and re-engagement efforts, Your Excellency, that Dinson Iron and Steel Company in Manhize, Mvuma set up a billion-dollar plant which will result in the country becoming a major player in the iron and steel industry in Africa, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/4-680x380.jpeg",
            "description": "Patrick Chitumba and Freedom Mupanedemo PRESIDENT Mnangagwa has underscored the importance of the iron and steel industry in Zimbabwe’s economic revitalisation, highlighting its vast potential to transform, not only the country’s economy, but that of the entire SADC region. The President said the industry’s current state was worrisome, with Zimbabwe spending in excess of US$1 […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Exposed: Secret perks for council bigwigs",
            "url": "https://www.herald.co.zw/exposed-secret-perks-for-council-bigwigs/",
            "content": "Trust Freddy-Herald Correspondent\n\nTop officials at Harare City Council have been accused of a scandalous cover-up of their huge salaries and benefits at a time when service delivery is woefully lacking.\n\nThe allegations were made by Ms Princess Mahari, managing director, and Mr Mike Jasi, technical operations officer of Groupview Technologies  a local partner of South African developer Quill Associates when they testified before the Harare City Council Commission of Inquiry.\n\nQuill Associates used to supply the Enterprise Resource Planning (ERP) system, including billing for the council.\n\nThe revelations painted a picture of gross irregularities, maladministration and negligence within the citys financial operations.\n\nMs Mahari told the commission that senior council officials were unwilling to integrate their own payrolls into the ERP.\n\nThis has created fertile ground for fraud, as certain salary payments can be easily manipulated. We found ourselves in constant conflict with city officials who refused to adhere tobasic accounting principles.\n\nMs Mahari disclosed that the officials also obstructed the integration of financial records from major subsidiaries, including City Park, Rufaro Marketing, and Harare Quarry.\n\nPrior to the discontinuation of the ERP, we submitted crucial reports highlighting deficiencies in the system. Yet, the city officials turned a blind eye, leaving us powerless to address the gaping holes in their financial controls, she said.\n\nMs Mahari said the exclusion of executive payrolls, coupled with poor financial practices, had fostered an environment ripe for fraud.\n\nThe two Groupview Technologies officials expressed concern that councils transactions could be slipping through the cracks, unrecorded and unaccounted for.\n\nThey pointed out that the lack of bank reconciliation left room for fraudulent activities.\n\nMr Jasi pointed out the dire consequences of the citys refusal to fully utilise the ERP system, claiming it created a loophole for corruption.\n\nRevenue generation is the lifeblood of the councils operations. Yet, management has consistently delayed critical integrationsputting finances at risk and leaving us vulnerable to fraud!\n\nMr Jasi revealed that the citys repeated audit disclaimers had tarnished its reputation, casting doubt over its financial integrity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/03/Town-House.jpg",
            "description": "Trust Freddy-Herald Correspondent Top officials at Harare City Council have been accused of a scandalous cover-up of their huge salaries and benefits at a time when service delivery is woefully lacking. The allegations were made by Ms Princess Mahari, managing director, and Mr Mike Jasi, technical operations officer of Groupview Technologies — a local partner […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Packed itinerary for President in Botswana",
            "url": "https://www.herald.co.zw/packed-itinerary-for-president-in-botswana/",
            "content": "Wallace Ruzvidzo in GABORONE, Botswana\n\nPRESIDENT Mnangagwa will have a packed itinerary today when he arrives for his maiden visit to the SADC Secretariat Headquarters since assuming Chairmanship of the regional bloc.\n\nThe President will meet and engage with the Secretariat staff, receive the recently purchased SADC Secretariat Headquarters Building, and preside over a ground-breaking ceremony to construct the SADC Standby Force Regional Logistics Depot (RLD).\n\nAs chair, President Mnangagwa has the overall mandate of providing policy direction and controlling the functions of the regional bloc.\n\nUpon arrival at the Secretariat Headquarters, the President will be ushered by the SADC Executive Secretary, Mr Elias Magosi, to sign in the guest book.\n\nThereafter, President Mnangagwa will proceed to the Julius Nyerere SADC Library, where he will appreciate the SADC History Collection. This will be followed by the unveiling of the Visiting Placard by the regional bloc chairperson.\n\nThe President will then meet the SADC Management team, where Deputy Executive Secretary for Corporate Affairs Dr Judith Kateera will brief him on the mandate, functions, and structure of the Secretariat and the division of responsibilities.\n\nHe will also be briefed on the Priorities of SADC, and the overall status of regional integration in the region (status, emerging issues, and recommendations).\n\nThe SADC Chair will then proceed to proffer guidance on the implementation of the blocs programmes going forward and preside over a meeting with all SADC Secretariat Staff accompanied by Botswana President Duma Boko.\n\nDuring their tenure, SADC Chairpersons traditionally visit the Secretariat to engage with management and addressstaff.\n\nThereafter, there will be a ceremonial hand-over of the SADC Headquarters Building from Bongwe Investments Proprietary Limited to President Mnangagwa as Chair of the regional bloc, on behalf of the regions Heads of State and Government.\n\nPrior to its handover today, the building was being governed through a Public-Private-Partnership (PPP) Agreement involving SADC, Bongwe Investments (Proprietary) Limited as the private party and the Botswana Government as a guarantor to the PPP arrangement.\n\nFollowing engagements at the SADC Secretariat Headquarters, President Mnangagwa and his counterpart President Boko will proceed to preside over the grounding breaking ceremony of the Regional Logistics Depot at Rasesa village, located about 40km from Gaborone.\n\nThe RLD will serve as a storage for materials, equipment and end-user stocks for use by the SADC Standby Force when undertaking mandated peace support and humanitarian missions.\n\nIn an interview yesterday, Zimbabwes Ambassador to Botswana Henry Mukonoweshuro said everything was in place for President Mnangagwas arrival this morning.\n\nHe said both Zimbabwe and Botswana, as well as the SADC Secretariat had pulled all the stops to ensure the SADC Chairs visit was a resounding success.\n\nThere is a lot of assistance from the host country and we are ready to roll. The SADC Secretariat is waiting for His Excellency (President Mnangagwa) to come and all logistics are going very well at this point in time, he said.\n\nDuring his tenure, President Mnangagwa will push for the realisation of the SADC Regional Indicative Strategic Development Plan (RISDP 2020-2030) and SADC Vision 2050.\n\nThe two strategic plans, which were approved by the 40th Ordinary SADC Summit in Maputo, Mozambique in 2020, seek to further deepen Southern Africas regional integration and foster development.\n\nThey are premised on three interrelated pillars; Industrial Development and Market Integration; Infrastructure Development in support of Regional Integration; and Social and Human Capital Development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa.jpg",
            "description": "Wallace Ruzvidzo in GABORONE, Botswana PRESIDENT Mnangagwa will have a packed itinerary today when he arrives for his maiden visit to the SADC Secretariat Headquarters since assuming Chairmanship of the regional bloc. The President will meet and engage with the Secretariat staff, receive the recently purchased SADC Secretariat Headquarters Building, and preside over a ground-breaking […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Angel of Hope, partners mobilise materials to rebuild schools, homesteads",
            "url": "https://www.herald.co.zw/angel-of-hope-partners-mobilise-materials-to-rebuild-schools-homesteads/",
            "content": "Tendai Rupapa-Senior Reporter\n\nANGEL of Hope Foundation patron First Lady Dr Auxillia Mnangagwa yesterday delivered truckloads of building materials, including cement and roofing sheets she mobilised, to repair 10 schools and over 79 homesteads that were damaged by heavy rains recently in Rukweza, Makoni South torching wild celebrations in a community that was at the crossroads.\n\nWith the support of her foundations partners and well-wishers, Dr Mnangagwa also donated food and toiletry hampers to the affected families and the elderly.\n\nSome of the Angel of Hope Foundations partners who complemented Amai Mnangagwa on yesterdays programme include Mr Phillip Mataranyika and Mr Obey Chimuka. Mr Chimuka, who is a former student at Handina Primary School in Rukweza, is currently building classroom and administration blocks at both Handina Primary and Secondary schools.\n\nHe is also constructing a clinic in Ward 31 named Chihombe Madhara Chimuka in remembrance of his late grandfather.\n\nPart of the crowd that interacted with Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa at Handina Primary School in Manicaland where she donated building materials and food hampers to schools and people affected by recent heavy rains in the area.\n\nThe First Lady thanked Mr Mataranyika for also spearheading and planting trees through his Nyaradzo Funeral Services which gives each grieving family a tree seedling, which they can plant at home or where they like, including at the cemetery.\n\nThe mother of the nation, who is also the countrys health ambassador also brought instant porridge for the benefit of children, who are close to her heart.\n\nThe porridge was donated by Food4Africa a partner of her AoHF to ensure children do not suffer malnutrition.\n\nHealth personnel taught the mothers how to prepare the porridge. The First Lady also held an interactive session with the community warning against drug abuse, child marriages, gender-based violence, promiscuity, laziness and poor relations among-in-laws.\n\nIn her address, the First Lady said although rainfall is presently low and the workload in the fields is also minimal, this was not a passport for people to engage in promiscuity and domestic violence which could result in permanent injuries or death.\n\nShe encouraged families to live in peace and harmony, while they waited for rainfall to work in the fields. To women, she advised them to respect the marriage institution by not snatching other peoples husbands, but to be involved in productive activities.\n\nSo touched by the First Ladys gesture were members of the Makoni South community that they broke into song and dance.\n\nThey thanked Amai Mnangagwa for her teachings and for coming to their rescue.\n\nI have been prompted to pay you a visit by challenges which were experienced in this place. Kuno kwakaita mafashamu akaparadza zvivakwa zvakawanda. Because of climate change and the extreme temperatures, we are experiencing, it is promising that we might incur hailstorms.\n\nWhen it comes to this, we do not have to look at Government alone, but we put our heads together even with the private sector and assist one another. With my Angel of Hope Foundation, I have partners whom I work with in my programmes. Angel of Hope Foundation is not a State-funded entity and relies on assistance from well-wishers.\n\nPart of the Christmas hampers and truck with loads of building materials that were donated by Angel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa in Manicaland yesterday.\n\nThese are the self-same partners who enabled me to come with the assortment of goods I have brought here today. I grew up with an inclination to assist those in need therefore even when I became First Lady, I proceeded to assist those in distress.\n\nI thank you heartily for congratulating me on my recent attainment of a PhD. I did this to motivate the youth and fellow women that education has no end and you achieve your vision through commitment and dedication, she said.\n\nThe First Lady said the door wasopen for everyone to go to school to deepen their knowledge.\n\nI brought the Zimbabwe Open University under the partnership with my AoHF so that you all could undertake short courses to advance and empower yourselves without looking at age. To our learners here present, we outrightly reject cases of those who fail to return to school in January after falling pregnant. We abhor naughtiness. Focus on your education because a profession is your first husband. But mothers, are we getting time to counsel our daughters and vana baba, are you sitting down with the boys to show them the right path?\n\nLet us build strong family relations, we want love, peace and unity to prevail in our families. We say no to gender-based violence even cases of letting children dabble in drugs.\n\nToday I have brought building materials to rebuild our homesteads and the destroyed schools. I encourage us to rebuild these structures the proper way so that they remain strong even in the face of strong winds. It is also my plea that we plant trees for windbreak and also to curb climate change. Let us not cut down trees or burn forests, she said.\n\nThe mother of the nation thanked her foundations partners who made the programme a success.\n\nShe encouraged youths to emulate such persons because they did not forget their roots.\n\nHad they focused on drugs, the First Lady said, the well-wishers would not have been able to chip in at the critical hour as they did.\n\nThe First Lady touched on gender-based violence and urged couples to shun the scourge which breaks families and affects children more.\n\nAs a mother she is moving with her Afrikana Humanism Programme and denounced promiscuity, urging couples to be content with one partner.\n\nUnenge uchichiva baba vepanext door kuti vanochena uye mukadzi wacho anochena zvekuti vakakupfimba haurambe asi wotozoona kuti havana kana sugar chaiyo yekutokupa. Madzimai let us respect the marriage institution, she said.\n\nDr Mnangagwa asked mothers-in-law and their daughters-in-law whether they were cooperating and living in peace. Marceline Muzhinye (23) said all was well with her mother-in-law.\n\nShe said she grew up as an orphan and when she got married she took her mother-in-law as her own mother since she yearned for motherly love. She said in return, the mother-in-law treated her well. A second respondent said her relations with her mother-in-law were fine, but not so rosy with her husband who was abusive and frequently bashes her.\n\nThe gathering also heard from a daughter-in-law who said her in-laws, both aunties and the mother-in-law, was a thorn in the flesh, referring to her husbands sisters as return soldiers.\n\nOne of the respondents said her husband was always drunk and she now survives on the measly earnings she gets from performing menial tasks at other peoples homesteads. She said sometimes the husband makes her sleep outside ordering her to return wherever she would have spent the day working.\n\nFirst Lady Dr Auxillia Mnangagwa interacts with senior citizens while handing over Christmas hampers to the elderly and other people affected by recent heavy rains at Handina primary school in Manicaland yesterday.\n\nGogo Eunice Muzondo encouraged young women not to bottle up abuse, but to speak out before its too late saying domestic violence can lead to death or permanent injuries.\n\nAnother elderly lady said daughters-in-law of today were lazy to the extent of not sweeping the yard.\n\nShe also touched on dressing saying they do not dress in a dignified manner even in the presence of their fathers-in-law.\n\nShe said her daughter-in-law brags that she was proposed love on social media when the mother-in-law was wooed over a period exceeding two years hence, they were not on the same page.\n\nThe First Lady took time to address every situation raised and helped address the issues, urging people to use her national gender-based violence 575 toll-free and report any form of abuse.\n\nMr Bofu Promise Chitsidzo, the headmaster of Nzvimbe Primary School in Nyazura said his school was among institutions whose roofs were blown away by strong winds.\n\nWe were stranded not knowing how we would rebuild the schools and today our mother has brought us cement, roofing material and other accessories to repair the schools and allow children to learn well. We are entering a rainy season. We thank the First Lady and those who help her in the Angel of Hope Foundation for the assistance they have rendered, he said.\n\nFirst Lady Dr Auxillia Mnangagwa interacts with senior citizens while handing over Christmas hampers to the elderly and other people affected by recent heavy rains at Handina primary school in Manicaland yesterday.\n\nManicaland Provincial Affairs and Devolution Minister Advocate Misheck Mugadza praised the First Lady for her gesture and congratulated her on her recent graduation with a Doctor of Philosophy degree in Tourism and Hospitality Management.\n\nOur First Lady recently shone like a beacon when she graduated with a PhD. We thank our mother for persevering with her education and we shall follow suit as her children.I am overjoyed to stand before you Amai here in Makoni in Manicaland to welcome you to Handina School in Makoni South. You once visited this place alongside the President.\n\nHere, we encountered a disturbing occurrence where 10 schools were destroyed by strong winds. Over 79 homesteads were not spared and this troubled us. We ran about with the Civil Protection Unit until we decided to approach you for assistance.\n\nToday, we have gathered here to welcome you as you bring materials to rebuild the homes and roof the schools. Our mother has come to assist us and brought us food hampers as well.\n\nI thank you, Amai for the hampers you recently brought for orphans, widows and the elderly in care homes. Our mother has a warm heart and is a visionary. She has many programmes like Agric4she, Teen Mothers Empowerment Programme, Gota/Nhanga/Ixhiba Programme, National GBV Call Centre, Vulnerable Population Empowerment programme, Cookout competitions, Girl Child Scholarships, Street Persons Empowerment Programme, Environment Protection Programme, Short Courses programme, Former Ladies of the Night Empowerment programme, among many other programmes aimed at transforming the lives of people, he said. Makoni South legislator Hon Albert Nyakuedzwa thanked the First Lady for her kindness.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/First-Lady1-3.jpg",
            "description": "Tendai Rupapa-Senior Reporter ANGEL of Hope Foundation patron First Lady Dr Auxillia Mnangagwa yesterday delivered truckloads of building materials, including cement and roofing sheets she mobilised, to repair 10 schools and over 79 homesteads that were damaged by heavy rains recently in Rukweza, Makoni South torching wild celebrations in a community that was at the […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Hero Mphoko body arrives",
            "url": "https://www.herald.co.zw/hero-mphoko-body-arrives/",
            "content": "Joseph Madzimure\n\nTHE body of former Vice President Phelekezela Mphoko, who died in India last week, arrived in Harare yesterday accompanied by his wife Laurinda, children and other family members.\n\nCde Mphoko, who was 84-years-old, was declared a national hero in recognition of his contributions before and after independence.\n\nThe body was received at Robert Gabriel Mugabe International Airport by Zanu PF Politburo members among them National Political Commissar Cde Munyaradzi Machacha.\n\nPresident Mnangagwa extended his condolences to the Mphoko family at the airport, shortly after returning from the Midlands where he had two official engagements.\n\nIn an interview at the airport, chief director in the Ministry of Home Affairs and Cultural Heritage Mr Mike Masaka said the body would lie in state at Charles Gumbo Barracks before being flown to Bulawayo today.\n\nThere would be an inter-ministerial meeting to determine the burial date.\n\nWe are going to convene an inter-ministerial meeting at 8am. It is only from that meeting that we will inform the public regarding the burial arrangements, said Mr Masaka.\n\nCde Machacha expressed the profound loss the nation has experienced with Cde Mphokos passing, recalling his pivotal role as a senior commander during the liberation struggle.\n\nCde Mphoko was born on June 11, 1940 in Gwizane, Bubi District, Matabeleland North. He attended David Livingstone Memorial School and Mzilikazi High School before studying at the Tsholotsho Agricultural Breeding and Experimental School.\n\nCde Mphokos political activism began early, and he was arrested in 1963 for political violence. He later received military training in the Soviet Union and played a crucial role in the liberation struggle.\n\nHe served in several capacities in Government after independence, including as Zimbabwes Ambassador to several countries and as Vice President from December 2014 until November 2017.\n\nCde Mphoko is survived by his wife Laurinda, three children, as well as three grandchildren.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-at-Mphokos-residence.jpg",
            "description": "Joseph Madzimure THE body of former Vice President Phelekezela Mphoko, who died in India last week, arrived in Harare yesterday accompanied by his wife Laurinda, children and other family members. Cde Mphoko, who was 84-years-old, was declared a national hero in recognition of his contributions before and after independence. The body was received at Robert […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Broadcasting Bill targets more foreign investment",
            "url": "https://www.herald.co.zw/broadcasting-bill-targets-more-foreign-investment/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nINFORMATION, Publicity and Broadcasting Services Minister Dr Jenfan Muswere yesterday tabled before the National Assembly, the Broadcasting Services Amendment Bill that will, among other things, rationalise foreign ownership of a broadcasting licence up to 40 percent to allow growth and investment in the sector.\n\nThe Bill, which was gazetted last month, will align the Broadcasting Services Act with the Constitution and also with the Public Entities Corporate Governance Act.\n\nDr Muswere made his presentation in Parliament early yesterday morning around 2am, after a marathon sitting that also debated the recently tabled 2025 National Budget.\n\nThe Broadcasting Services Amendment Bill was immediately sent to the Parliamentary Legal Committee that will see whether its provisions comply with the Constitution.\n\nClause Six of the Bill amends the principal Act, which provides that licences must be issued to persons who are Zimbabweans subject to exemption by the Minister.\n\nThe amendment seeks to allow foreign control in a broadcasting licence up to 40 percent as a measure of encouraging the development of this sector considering that it is a high capital venture and ensure that Zimbabweans remain in control of broadcasting services.\n\nThe amendment will mean that the Minister will no longer be required to approve the licensing of any person. The amendment also seeks to repeal the requirement for directors of licencees to be Zimbabwean citizens and places a limitation of 40 percent of the directors to be foreigners. Amendments to section 8(3) will allow any person other than a natural person to apply for licences such as community radios, reads the Bill.\n\nClause Three of the Bill provides that the role of the Broadcasting Authority of Zimbabwe (BAZ) is to regulate and manage the broadcasting service bands for sustenance rather than controlling broadcasting service bands.\n\nThe role of BAZ is to regulate and manage the broadcasting service bands for sustenance rather than control broadcasting service bands.\n\nThe intention is to move away from a perception that the legislation is intended to stifle the freedoms guaranteed by section 61 of the Constitution and instead to focus on necessary regulation of the airwaves.\n\nThis is also in line with current international trends as contained in some international instruments among them, the African Charter on Broadcasting, the African Charter on Human and Peoples Rights and the International Covenant on Civil and Political Rights, further reads the Bill.\n\nClause 4 amends section 4 of the principal Act by reducing the number of board members from 12 to seven and also providing for gender balance within BAZ.\n\nClause 15 amends section 38B by inserting a new provision which prohibits the sale of a motor insurance cover to persons who do not have ZBC radio licences.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Muswere.jpg",
            "description": "Farirai Machivenyika-Senior Reporter INFORMATION, Publicity and Broadcasting Services Minister Dr Jenfan Muswere yesterday tabled before the National Assembly, the Broadcasting Services Amendment Bill that will, among other things, rationalise foreign ownership of a broadcasting licence up to 40 percent to allow growth and investment in the sector. The Bill, which was gazetted last month, will […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Herald awards preps hot up",
            "url": "https://www.herald.co.zw/herald-awards-preps-hot-up/",
            "content": "Micah Zinduru-Herald Reporter\n\nPREPARATIONS are in full swing for the inaugural Herald Community Heroes and Heroines Awards ceremony, scheduled for December 16 at the Harare International Conference Centre.\n\nThis event seeks to honour extraordinary individuals from across Zimbabwe who have made significant contributions to their communities, but have often gone unnoticed.\n\nThe awards ceremony will bring together winners from all 10 provinces, recognising the efforts of those who have made a difference in their communities.\n\nHerald Editor Victoria Ruzvidzo said the event sought to shine a spotlight on the importance of acknowledging these community champions.\n\nWe are very excited to be hosting this event. There are many people doing remarkable work for their communities, and we want to appreciate them and inspire others to contribute as well, she said.\n\nRuzvidzo also confirmed that this will be an annual event, promising to dedicate weekly space in the publication for stories that highlight the impactful work of ordinary citizens across the nation.\n\nThe awards have garnered support from various partners and sponsors, with more organisations joining the cause. Nominations for the community heroes and heroines came from the public, with thousands of entries detailing why specific individuals should be celebrated. Many nominees received multiple nominations, showcasing the deep appreciation within their communities.\n\nA line up of entertainment, including performances from the Travellers band, will ensure a memorable night for all attendees.\n\nTickets for the event are priced at US$50 and are selling quickly, with only a limited number available.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Victoria-Ruzvidzo.jpg",
            "description": "Micah Zinduru-Herald Reporter PREPARATIONS are in full swing for the inaugural Herald Community Heroes and Heroines Awards ceremony, scheduled for December 16 at the Harare International Conference Centre. This event seeks to honour extraordinary individuals from across Zimbabwe who have made significant contributions to their communities, but have often gone unnoticed. The awards ceremony will […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Zim digital economy transforms livelihoods",
            "url": "https://www.herald.co.zw/zim-digital-economy-transforms-livelihoods/",
            "content": "Ivan Zhakata and Obey Musiwa\n\nInformation Communication Technology, Postal and Courier Services Minister Tatenda Mavetera has articulated a vision for a future where technology empowers citizens, drives economic growth and establishes Zimbabwe as a leader in the digital economy.\n\nSpeaking at the Zimbabwe Artificial Intelligence (AI) and Innovation Week at the University of Zimbabwe, Minister Mavetera emphasised the critical role of digital infrastructure as not just foundational, but essential for innovation and growth.\n\nThe Zimbabwe AI Innovation Week, co-hosted by the Government of Zimbabwe and funded by the UNDP, operates under the theme: Building Digital Infrastructure: Enabling Innovation and Connectivity in Zimbabwes Digital Economy.\n\nMinister Mavetera said the digital economy is no longer a mere concept, it has transformed how people live, work and interact.\n\nWe envision a future where technology empowers our people and drives economic growth, she said.\n\nArtificial intelligence, in particular, is a game-changer that can improve efficiency and unlock new opportunities.\n\nMinister Mavetera pointed out that robust digital infrastructure is vital for any nation aiming to compete globally.\n\nIt is the backbone that supports our digital economy, enabling seamless communication and innovation that addresses our most pressing challenges.\n\nFurther, she said Zimbabwe had made significant progress in developing its digital landscape.\n\nAs of 2024, internet penetration in the country stands at approximately 78,55 percent, with mobile penetration exceeding 96 percent.\n\nNotably, two of the three licenced mobile network operators now offer 5G connectivity, and the recent authorisation for Low Earth Satellites enhances connectivity options.\n\nThe Minister of Foreign Affairs and International Trade, Prof Amon Murwira discussed the profound impact of AI on improving market access.\n\nZimbabwe is part of a new economy that promotes prosperity and peace globally. We will use AI to enhance customer engagement and drive targeted advertising campaigns, gaining deeper insights into consumer behaviour.\n\nHe stressed the importance of training AI to recognise local products, ensuring that Zimbabwean goods and services are marketed effectively on a global scale.\n\nMinister of Youth Empowerment, Development and Vocational Training, Tino Machakaire, called for collective action in Africas digital innovation revolution.\n\nAI and innovation are now realities. Our vision is to cultivate a generation of young innovators who drive inclusive growth and sustainable development.\n\nMachakaire emphasised the Ministrys commitment to creating an environment where the creativity of young people can flourish.\n\nDr Willie Ganda, speaking on behalf of the Minister of Higher and Tertiary Education, Innovation, Science and Technology Development Dr Frederick Shava, highlighted the importance of education in AI inclusion.\n\nOur higher education institutions are not only integrators of ground-breaking ideas, but also laboratories for innovation.\n\nHe noted that AI is now embedded in various academic programmes, ensuring graduates are equipped to navigate and lead in the digital age.\n\nAs Zimbabwe moves forward in harnessing technology for economic growth, the Governments commitment to digital infrastructure, AI and education positions the nation to not only compete, but also thrive in the global digital economy.\n\nThe collaborative efforts of various ministries and organisations reflect a unified vision towards a prosperous technological future forZimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/c6f55834-5a13-4f62-9603-bb29b6551be7-680x380.jpeg",
            "description": "Ivan Zhakata and Obey Musiwa Information Communication Technology, Postal and Courier Services Minister Tatenda Mavetera has articulated a vision for a future where technology empowers citizens, drives economic growth and establishes Zimbabwe as a leader in the digital economy. Speaking at the Zimbabwe Artificial Intelligence (AI) and Innovation Week at the University of Zimbabwe, Minister […]",
            "time": "2024-12-13 08:47:14"
        },
        {
            "title": "Lesotho seeks partnership with Geo Pomona",
            "url": "https://www.herald.co.zw/lesotho-seeks-partnership-with-geo-pomona/",
            "content": "Blessings Chidakwa in MASERU, Lesotho\n\nA DELEGATION from Geo Pomona Waste Management met Lesotho Prime Minister, Samuel Ntsokoane Matekane, here yesterday to discuss a potential partnership aimed at improving waste management in the country.\n\nThe Prime Minister expressed his enthusiasm for the solutions presented and requested a memorandum of understanding to be prepared by next month.\n\nThe delegation, led by Deputy Chief Secretary in the Office of the President and Cabinet, Engineer Amos Marawa, held discussions at State House in Maseru where Prime Minister Matekane conveyed his approval of the waste management strategies proposed by Geo Pomona.\n\nEngineer Marawa described the meeting as fruitful, highlighting the Prime Ministers commitment to urgently address the waste management challenges facing Lesotho.\n\nWe just had a discussion with the honourable Prime Minister of Lesotho who has given our Government a commitment to implement this waste management project, Eng Marawa said.\n\nThere is a request that Geo Pomona, working through the government of Lesotho, should come up with a proposal that can fast track this cooperation.\n\nEng Marawa emphasised Zimbabwes readiness to assist Lesotho, particularly in resolving issues related to the current dumpsite, which poses health risks to nearby residents.\n\nSo that it doesnt affect the population residing near the dumpsite, we aim to provide a long-lasting solution for waste management in Maseru, and throughout Lesotho.\n\nLesotho Minister of Local Government, Chieftainship, Home Affairs, and Police, Mr Lebona Lephema, expressed gratitude towards SADC Chair President Mnangagwa for fostering this collaboration.\n\nI am going to be coming to Zimbabwe to see how best we can come up with the proposal. We are looking forward to your proposal and to ensure that we can work together.\n\nMr Lephema also discussed plans to enhance bilateral relations, including the potential use of national identity cards for travel between the two countries, and encouraged business investment opportunities.\n\nWe want to see if we can harmonise relations with Zimbabwe and South Africa, allowing our business people to invest in each others countries.\n\nDr Dilesh Nguwaya, the executive chairman and chairman of of Geo Pomona Waste Management, reaffirmed his organisations commitment to strengthening ties with Lesotho through co-operative agreements.\n\nWhat is next is to come up with a proposal for the government of Lesotho. I will urgently dispatch my team to conduct studies as this is an urgent matter.\n\nLesotho has faced significant waste management challenges, currently operating without a landfill and exporting hazardous waste 500km to South Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Lesotho-Prime-Minister-Samuel-Maketane-centre-meets-Geo-Pomona-Waste-Management-executive-chairman-and-chief-executive-officer-Dilesh-Nguwaya.jpg",
            "description": "Blessings Chidakwa in MASERU, Lesotho A DELEGATION from Geo Pomona Waste Management met Lesotho Prime Minister, Samuel Ntsokoane Matekane, here yesterday to discuss a potential partnership aimed at improving waste management in the country. The Prime Minister expressed his enthusiasm for the solutions presented and requested a memorandum of understanding to be prepared by next […]",
            "time": "2024-12-13 08:47:14"
        }
    ]
}