{
    "news": [
        {
            "title": "Fly Zim flag high: President . . . Sends off scholarship beneficiaries to Algeria",
            "url": "https://www.herald.co.zw/fly-zim-flag-high-president-sends-off-scholarship-beneficiaries-to-algeria/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nPRESIDENT Mnangagwa has implored students on Government-to-Government scholarship programmes outside the country to fly the Zimbabwean flag high as they are not just going to study, but represent the country as its ambassadors.\n\nYesterday, the President saw off five beneficiaries of an Algerian scholarship programme extended to him by his counterpart, President Abdelmadjid Tebboune.\n\nThe beneficiaries are Natasha Deni, Bukhosi Maphosa, Albert Jakarasi, Melogina Mano and Tinovimbanashe Kamutero.\n\nThey will be studying in various fields, including Science, Technology, Engineering and Medicine, areas which the President said were crucial in Zimbabwes development matrix.\n\nIn his remarks at State House in Harare, the President charged the students to make the country proud in their endeavours.\n\nYou are now ambassadors of our motherland, Zimbabwe, as you go for this programme in Science, Technology, Engineering and Medicine.\n\nThese are very critical fields for developing countries like Zimbabwe, so you must consider yourselves very lucky to have been selected. When you are there, you individually and collectively become ambassadors of our country. So, never think that you are an individual, wherever you are, you are actually representing us, he said.\n\nZimbabweans are known the world over for their hard work and tenacity, something President Mnangagwa said the students should showcase.\n\nMukanyadzisa muri ikoko, hamuna kunyadzisa vabereki venyu chete, matonyadzisa nesuwo ende kana madaro tinozonetsekana mangwana kuti titume here vamwe (If you act in an unbecoming manner during your stay in Algeria, know that you have not only let your parents down, but the nation at large and it will be difficult for us to send more students).\n\nSaka garai muchiziva kuti wakamirira nyika, hauna kuzvimirira pachako (You should always know that you are representing the country, you are not representing yourself).\n\nYou must go ahead and show the values of hard work. You must show that you are coming from a hard-working country. You must commit yourself to why you are there, he said.\n\nYou must go there with determination and courage and a sense of pride. Wherever Zimbabwean students go, they perform very well, we have that record across the world.\n\nPresident Mnangagwa said the scholarships were a testament to the cordial relations between Harare and Algiers.\n\nZimbabwe and Algeria have a longstanding relationship that continues to deepen. We have consolidated our relations and this is why we have this offer because our relationship is strengthening and is becoming more and more comprehensive.\n\nI wish to congratulate you students on your study assignment in Algeria.\n\nWe have a very long standing relationship with Algeria and the students that have gone before you behaved very well and upheld the good relations between us (Zimbabwe and Algeria), he said.\n\nI hope you will not be the group that will spoil that relationshipif that happens, our prisons are not full.\n\nPresident Mnangagwa shared a lighter moment with the students.\n\nPresident Mnangagwa poses for a group photograph with Foreign Affairs and International Trade Minister Professor Amon Murwira (fourth from left), Algerian Ambassador to Zimbabwe Mohamed Seoudi (fifth from right), his deputy Mohamed Mehdi (fourth from right), students leaving for Algeria on scholarship and their parents at State House in Harare yesterday.Picture: Kudakwashe Hunda.\n\nJust think of it as you are representing ED, its a tall order so you must always keep that in mind. As you represent us in foreign lands, you should know you are not representing yourself. You are representing us.\n\nAnd before you sleep, you should pray and say, I am representing ED so I must do my best, said the President light-heartedly.\n\n . . . when you come back here, its either I will give you a red carpet and congratulate you or you spend a few days behind bars for misrepresenting us.\n\nHe also encouraged the students to cherish the scholarship opportunity as it was not something to take for granted.\n\nSo as you go ahead, you must embrace every opportunity you find so that you can bring such experience back home for the benefit of developing our country. You are only very few.\n\nThe students in this country of your age, with your qualifications, are so many, but you have been found fit to take up this challenge.\n\nYou have been given guidance byyour parents that you will not be representing your families but Zimbabwe, the President said.\n\nAs beneficiaries of the cordial relations between Zimbabwe and Algeria, President Mnangagwa encouraged the students to hoist the countrys flag high as this would see more scholarship opportunities being availed.\n\nYou see, these scholarships are a testament to the relationship between Zimbabwe and Algeria.\n\nIf you carry yourself in high esteem during your time there we will certainly get more scholarships because of our good mannerisms. If you do not represent us well then they will just reduce the number, he said.\n\nPresident Mnangagwa also had some words for the students parents and guardians who were present during the send-off.\n\nTo the parents, do not expect financial benefits while the children are in Algeria, these children are going to school so you are the ones who should actually send them money, he said.\n\nAlgerian Ambassador to Zimbabwe Mohamed Seoudi said Zimbabwe was more than a friend to Algeria hence the continuous extension of scholarships.\n\nOur relations (with Zimbabwe) are going on excellently and what is better than the building of human resources? That is why Algeria is giving Zimbabwe more than 100 scholarships each year including these ones extended to the President from his brother (Algerian President).\n\nLike the President says, nyika inovakwa nevene vayo. Algeria is very committed to countries on the African continent like Zimbabwe who are more than friends to us, he said.\n\nOne of the beneficiaries, Natasha Deni, said she was elated to have been accorded the scholarship.\n\nI am 20 and I was overjoyed, excited and most of all grateful to God for awarding me this opportunity and also to the President for this scholarship opportunity, she said.\n\nAnother student, Melogina Mano, said she was grateful for the opportunity.\n\nI am very happy because this is not an opportunity accorded to many, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-Algeria-students1-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter PRESIDENT Mnangagwa has implored students on Government-to-Government scholarship programmes outside the country to fly the Zimbabwean flag high as they are not just going to study, but represent the country as its ambassadors. Yesterday, the President saw off five beneficiaries of an Algerian scholarship programme extended to him by his counterpart, President […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "Second Republic completes 8 000 projects",
            "url": "https://www.herald.co.zw/second-republic-completes-8-000-projects/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nGOVERNMENT has completed over 8 000 projects countrywide since the coming in of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday.\n\nSpeaking during a media tour of some of the projects in Manicaland Province, Dr Muswere said so much had been achieved in a short space of time.\n\nHe was accompanied by Manicaland Provincial Affairs and Devolution Minister Advocate Misheck Mugadza.\n\nProjects toured include the far-reaching new National Pharmaceutical Company warehouse, the solar project at Victoria Chitepo Provincial Hospital, Mega Market, the new Registry Office, the site where two silos are being constructed, Tikwiri Irrigation scheme and Romsley irrigation.\n\nMegamarket is one of the Presidents projects which commenced three years ago.\n\nPresident Mnangagwa is expected to commission the project this year.\n\nInformation and publicity and broadcast services Minister Jenfan Muswere (center) Manicaland Minister of State for Provincial Affairs and Devolution Misheck Mugadza (second from right), Natpham branch Manager Cathias Mundandishe (second from right) and other delegates are taken on a tour of Natpham warehouse in Mutare yesterday.Pictures: Joseph Manditswara.\n\nA total of 8 000 projects have been successfully completed from 2017, when His Excellency the President assumed office. You will all agree with me that so much has been achieved in a short space of time. We have had, for the year 2024, 346 projects that were completed, he said.\n\nDr Muswere said the thematic committee on National Development was also in the process of identifying some of the projects that were completed last year.\n\nSome of the projects also include, during the period when we had Cyclone Idai, when initiatives were put in place in order to reconstruct the infrastructure, especially the roads and the bridges, and the bulk of that work was done by the Government of Zimbabwe under the leadership of President Mnangagwa, he said.\n\nDr Muswere said some of the projects being implemented were a sign of the Governments commitment to devolution.\n\nWe are also travelling to the Passport Office, which also speaks to the devolution and decentralisation of services in our country. We know that decentralisation and devolution are part of the revolution that the Second Republic has put in motion and ensured that it becomes a success story, he said.\n\nDr Muswere said through decentralisation, Manicaland had hosted Independence Day celebrations in Murambinda, Buhera.\n\nAdv Mugadza said the opening of the Natpharm warehouse had addressed logistical challenges in the storage of medicines.\n\nWe are now able to safely store drugs and ensure their availability at our hospitals and clinics. We are also now in a position to store drugs coming through Beira, he said.\n\nManicaland Provincial Registrar Ms Joyce Munamati said their new offices would be completed in the first quarter of this year.\n\nThe construction of the building is expected to be complete by the end of the first quarter. The construction of the new offices is being donein line with the devolution policy and President Mnangagwas mantra of leaving no one and no place behind, she said.\n\nCurrently, the Registry is operating from wooden cabins, with some Mutare residents travelling toMarondera or Chipinge to obtain identity documents.\n\nAllied Timbers chief operations officer, Mr Ian Zimunya, said their operations had benefitted from equipment procured from Belarus.\n\nWe are now operating at between 80 and 85 percent through equipment procured from Belarus, he said.\n\nAt GMB, Engineer Willard Chirunga said they expect to complete the first silo before the end of the year.\n\nWe hope to complete the foundation works by April and install the prefabricated materials by October, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muswere-and-Manicaland-minister-of-State-Advocate-Mugadza-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter GOVERNMENT has completed over 8 000 projects countrywide since the coming in of the Second Republic under President Mnangagwa in 2017, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said yesterday. Speaking during a media tour of some of the projects in Manicaland Province, Dr Muswere said so much had been […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "New water treatment plant, smart meters for Harare",
            "url": "https://www.herald.co.zw/new-water-treatment-plant-smart-meters-for-harare/",
            "content": "Remember Deketeke-Herald Reporter\n\nTHE Ministry of Local Government and Public Works, Harare City Council and private players have signed a potentially game-changing agreement that will see the capital city getting a new water treatment plant and smart meters to improve water supply to residents.\n\nThe deal involves the Local Government Ministry, the City of Harare, Hangzhou Laison Technology Company, and Helcraw Electrical.\n\nAt the signing ceremony in the capital yesterday, Local Government and Public Works Minister Daniel Garwe said the Government was committed to enhancing the water supply chain countrywide.\n\nWater has become a critical issue, generating significant media interest. We are now taking action. Yesterday, we met with our investors to refine our tripartite partnership.\n\nMinister Garwe indicated that the Ministry and the City of Harare are taking decisive steps, as directed by President Mnangagwa, to deliver world-class services to residents by 2030.\n\nHe reassured the public that while technology may raise concerns about increased rates, it could actually lower delivery costs, aiming for globally effective solutions that ensure affordability.\n\nWhile technology often raises concerns about increased rates, we want to reassure the public that it can actually lower delivery costs. Our goal is to implement globally effective technology that ensures affordable, world-class services for everyone, said Minister Garwe.\n\nHarare Mayor Councillor Jacob Mafume highlighted the necessity of collaboration for the development of the capital city.\n\nA capital city cannot be built by the city alone; it requires the support of central Government and the private sector.\n\nHe drew parallels with successful cities like Kigali in Rwanda and New Cairo in Egypt, underscoring the importance of synergies in meeting citizens needs and emphasising that water and sewage services transcend political affiliations.\n\nCities we admire, like Kigali and New Cairo, were built through collaboration between municipalities and central Governments. We see no contradiction in working together to align with citizens needs.\n\nMr Clark Dai, deputy managing director of Hangzhou Laison Technology, expressed enthusiasm for the project, saying their smart water management system will serve as a benchmark not only for Harare but for Southern Africa.\n\nWe have developed a reliable, practical, and advanced system aimed at improving efficiency and addressing the challenges of non-buried water, he said.\n\nMr Brendon Jere, chief executive officer of Helcraw Electrical, said the water plant, distribution, and billing system are part of a comprehensive plan to ensure water reaches all residents of Harare sustainably and intelligently.\n\nThis initiative signifies a collaborative effort to tackle critical water supply challenges in Harare, with the new water treatment plant expected to set a standard for similar projects across Southern Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-garwe-and-Mayor-Mafume-680x380.jpg",
            "description": "Remember Deketeke-Herald Reporter THE Ministry of Local Government and Public Works, Harare City Council and private players have signed a potentially game-changing agreement that will see the capital city getting a new water treatment plant and smart meters to improve water supply to residents. The deal involves the Local Government Ministry, the City of Harare, […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "Growing calls for President to extend term",
            "url": "https://www.herald.co.zw/growing-calls-for-president-to-extend-term/",
            "content": "Joseph Madzimure-Senior Reporter\n\nTHERE is a growing call from Zanu PF structures, with more provinces joining the chorus in pleading with President Mnangagwa to continue his term of office beyond 2028 to realise Vision 2030.\n\nAppealing to President Mnangagwa to stay beyond 2028 is not a crime, but what the people are yearning for in appreciation of his work ethic, they said.\n\nThe structures are saying President Mnangagwa deserves to continue in office in light of the remarkable progress the country has achieved under his watch.\n\nThis week, Zanu PF Manicaland and Matabeleland South provinces joined other provinces such as Masvingo, Harare, Midlands and Mashonaland East in appealing to President Mnangagwa to remain in office beyond 2028.\n\nZanu PF Manicaland and Matabeleland South provinces are conducting inter-district meetings to give feedback on the 21st Zanu PF Annual Peoples Conference resolutions and appraise party structures up to ground level, the expectations of the leadership.\n\nOne of the resolutions which came out of the conference was the endorsement by all provinces of the extension of President Mnangagwas term beyond 2028.\n\nManicaland provincial chairman Cde Tawanda Mukodza said the purpose of the inter-district meetings was to give feedback on conference resolutions.\n\nWe were also unfolding the year plans, but the major factor is that inter-districts are a constitutional requirement and we have to do them, he said.\n\nCde Mukodza highlighted the importance of resolution Number One which stated that the party wants President Mnangagwa to continue with the good works as leader of the party and nation up to and after the year 2030.\n\nIts now our duty as a province to cascade these important resolutions to the grassroots, he said.\n\nMatabeleland South held their inter-district meeting in Insiza District on Wednesday which was attended by the party leadership from all top five wings; the main, women, war veterans and the youth wings at Mthwakazi Hall in Filabusi.\n\nIn an interview, Zanu PF Matabeleland South chairman Cde Mangaliso Ndlovu, who is also the Minister of Industry and Commerce, said they are conducting inter-district meetings across the province.\n\nWe started with Insiza District yesterday. We are now convening inter-district meetings in other districts. The move is meant to give feedback on the outcome of the 21st Zanu PF Annual Peoples Conference which was held in Bulawayo in October last year, he said.\n\nCde Ndlovu said one of the major resolutions is that the term of office of President Mnangagwa be extended beyond 2028.\n\nAll the provinces adopted that resolution and all the 10 provinces anonymously agreed on that. It is now up to party members and the generality of Zimbabweans to see that the resolution is implemented, he said.\n\nMeanwhile, the countrys main opposition party, CCC, is also in agreement with a resolution by the ruling Zanu PF party to postpone the next harmonised elections from 2028 to 2030 to allow developmental projects initiated by President Mnangagwa and the Second Republic to come to fruition.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/President-Mnangagwa-cabinet.jpg",
            "description": "Joseph Madzimure-Senior Reporter THERE is a growing call from Zanu PF structures, with more provinces joining the chorus in pleading with President Mnangagwa to continue his term of office beyond 2028 to realise Vision 2030. Appealing to President Mnangagwa to stay beyond 2028 is not a crime, but what the people are yearning for in […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "Mining royalties remittance penalties set",
            "url": "https://www.herald.co.zw/mining-royalties-remittance-penalties-set/",
            "content": "Farirai Machivenyika-Senior Reporter\n\nPERSONS responsible for remitting mining royalties to the Government, but failing to do so timeously without just cause face up to six months in prison, according to the Finance Act that came into force recently.\n\nThe Act stipulates that if royalties are not remitted by the required deadline, interest will accrue at a rate determined by the Minister of Finance, Economic Development and Investment Promotion.\n\nThis interest begins accruing the day after the deadline and continues until full payment is made.\n\nHowever, in special circumstances, the Commissioner-General of Zimbabwe Revenue Authority may extend the time for the remittance of royalties without charging interest.\n\nAs soon as it comes to the notice of the Commissioner-General of Zimra that any person responsible for remitting royalties timeously (which requires that royalties be remitted in the form of the mineral concerned and part local currency and foreign currency) has failed to do so, the Commissioner shall serve upon that person notice to pay amount equal to the amount of the royalties payable (hereinafter called the primary civil penalty), reads part of the Finance Act.\n\nIt says a person upon whom the Commissioner has served a notice who fails without just cause to comply with the notice within the first seven days of the period of 181 days shall be liable for a secondary civil penalty of US$30 or the maximum monetary figure specified from time to time for level 4, whichever is the lesser amount for each day the person remains in default, not exceeding a period of 181 days.\n\nIf the person continues to be in default after the period specified in subparagraph (a) (181 days), shall be guilty of an offence and liable on conviction to a fine not exceeding level 10 or to imprisonment for a period not exceeding six months or to both such fine and such imprisonment, reads the Act.\n\nThe Act also says a primary and secondary civil penalty that becomes payable by the infringer shall constitute a debt due by the infringer to Zimra and shall, at any time after it becomes due, be recoverable in a court of competent jurisdiction by proceedings in the name of the Authority.\n\nThe primary and secondary civil penalty shall be paid into and form part of the funds of the Consolidated Revenue Fund.\n\nWhere the Commissioner is satisfied that the failure on the part of the person concerned or any other person under the control or acting on behalf of that person to make payment of the mining royalties within the period for payment and was not due to an intent to avoid or postpone liability for the payment of the mining royalty, he may remit in whole or in part, any penalty or interest payable, reads the Finance Act.\n\nPending the outcome of any civil or criminal proceedings concerning the payment or non-payment of royalties, the person liable to deduct and remit royalties must do so timeously or be liable to the penalties for failure to do so.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Mining-royalties-680x380.jpg",
            "description": "Farirai Machivenyika-Senior Reporter PERSONS responsible for remitting mining royalties to the Government, but failing to do so timeously without just cause face up to six months in prison, according to the Finance Act that came into force recently. The Act stipulates that if royalties are not remitted by the required deadline, interest will accrue at […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "UAE envoy urges Zim to leverage on economic ties",
            "url": "https://www.herald.co.zw/uae-envoy-urges-zim-to-leverage-on-economic-ties/",
            "content": "Herald Reporter\n\nThe United Arab Emirates (UAE) Ambassador to Zimbabwe, Jassim Mohammed Al Qasimi, has encouraged Zimbabwe to capitalise on the existing relationship between the two nations to bolster its economy.\n\nHe said the UAE, as a global leader in the transport sector, is eager to engage in business ventures with Zimbabwe, reflecting a broader trend of significant foreign investment in various sectors in response to President Mnangagwas investment promotion initiatives.\n\nAmbassador Al Qasimi highlighted the UAEs emergence as one of Zimbabwes largest trading partners, a development spurred by the interest of several companies in investing within the country.\n\nIn a report detailing the UAEs accomplishments for 2024, the Ambassador attributed the nations successes to the visionary leadership and strengthened collaboration among its societal segments.\n\nThis success represents a tremendous opportunity for Zimbabwe and other countries to cooperate with the UAE and benefit from its experiences in achieving ambitious economic growth and sustainability, he said.\n\nHe reiterated the UAEs openness to further strengthen economic and investment relations, inviting Zimbabwe to explore partnership opportunities for mutual development.\n\nThe Ambassador pointed to the UAEs diversified economy, which has seen remarkable growth, offering a model for Zimbabwe as it aims for upper middle-income status by 2030.\n\nHe noted that 2024 has been a landmark year for the UAE, with the registration of 200 000 new companies and foreign trade exceeding 2,8 trillion Dirhams (approximately US$762 billion).\n\nSignificant achievements also included Foreign Direct Investment (FDI) inflows reaching 130 billion Dirhams (about US$35,4 billion) and industrial exports valued at 190 billion Dirhams (approximately US$51,7 billion).\n\nIn terms of international engagement, the UAE signed over 140 agreements in critical areas such as economy, sustainability, clean energy, technology, and security throughout 2024.\n\nThe UAE government also undertook a comprehensive legislative overhaul, updating 80 percent of its economic, social and regulatory frameworks to enhance competitiveness and align with global trends.\n\nThe aviation and tourism sectors have also thrived, with UAE airports welcoming 150 million passengers and tourist facilities hosting over 30 million guests, reinforcing the nations position as a major hub for tourism and hospitality.\n\nAdditionally, the UAE government has initiated more than 750 national projects aimed at sustaining economic development, which includes attracting global talent and fostering entrepreneurship.\n\nAs Zimbabwe looks to the future, the Ambassadors call to action presents a compelling opportunity for the nation to learn from the UAEs successes and forge a path toward economic growth and sustainability.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/UAE-President-680x380.jpg",
            "description": "Herald Reporter The United Arab Emirates (UAE) Ambassador to Zimbabwe, Jassim Mohammed Al Qasimi, has encouraged Zimbabwe to capitalise on the existing relationship between the two nations to bolster its economy. He said the UAE, as a global leader in the transport sector, is eager to engage in business ventures with Zimbabwe, reflecting a broader […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "Concern over price surge ahead of first term",
            "url": "https://www.herald.co.zw/concern-over-price-surge-ahead-of-first-term/",
            "content": "Obey Musiwa-Herald Correspondent\n\nAs the new school term approaches next Tuesday, parents and guardians are feeling the pinch from a sudden rise in the prices of uniforms and stationery.\n\nHarare was bustling with activity yesterday as families made last-minute arrangements for the upcoming term.\n\nA snap survey conducted by The Herald revealed that many parents were hopping from one retailer to another in search of affordable uniforms and supplies.\n\nThis back-to-school ritual has turned into a financial marathon, with price-conscious shoppers navigating a landscape of rising costs.\n\nHarare resident Ms Maldred Matambanadzo noted that while prices were relatively stable last month, there has been a noticeable increase.\n\nRetail prices were stable recently in the Central Business District, but now many stationery items have become more expensive, especially uniforms, she said.\n\nThe price of a bond paper rim has increased from three dollars to four dollars since last month.\n\nA snap survey conducted by The Herald revealed that many parents were hopping from one retailer to another in search of affordable uniforms and supplies.\n\nA snap survey conducted by The Herald revealed that many parents were hopping from one retailer to another in search of affordable uniforms and supplies.\n\nMatambanadzo said it is important to compare prices to avoid being overcharged amid rising public demand.\n\nRetailer Mr Tapiwanashe Chinyanga from Kaylar Closet said the surge in sales has prompted the store to extend its working hours.\n\nWe now open at 5am and close at 6.30pm to accommodate our customers busy schedules and ensure they can get the supplies they need on time, he said.\n\nMs Sharon Chigayo of Passion Stationery also observed a positive trend in sales.\n\nOur sales this year have been higher than last year, suggesting that customers are more interested in buying new school supplies and accessories, she stated.\n\nMs Chigayo attributed this trend to the demand for fresh, start-of-term merchandise, which includes new book collections and sets of pens andpencils.\n\nThe increased interest reflects a renewed commitment among parents to equip their children with the necessary tools for a successful school year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Back-to-school1-680x380.jpg",
            "description": "Obey Musiwa-Herald Correspondent As the new school term approaches next Tuesday, parents and guardians are feeling the pinch from a sudden rise in the prices of uniforms and stationery. Harare was bustling with activity yesterday as families made last-minute arrangements for the upcoming term. A snap survey conducted by The Herald revealed that many parents […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "Smallholder farmers backbone of agric renaissance",
            "url": "https://www.herald.co.zw/smallholder-farmers-backbone-of-agric-renaissance/",
            "content": "Precious Manomano-Herald Reporter\n\nSmallholder farmers are essential to the nations agricultural production, playing a critical role in driving economic growth and expanding export opportunities, Lands, Agriculture, Fisheries and Rural Development Permanent Secretary Professor Obert Jiri has said.\n\nThe farmers cultivate 1,4 million hectares of maize, representing approximately 70 percent of the grain marketed in the country.\n\nSmallholder farmers are not just participants in agriculture, they are the backbone of our agricultural sector. The contributions of smallholder farmers extend well beyond maize, he said.\n\nThey account for over 60 percent of the nations wheat output and have been instrumental in revitalising the tobacco sector, which has historically been a cornerstone of Zimbabwes economy.\n\nProf Jiri said Government prioritises programmes tailored specifically to support smallholder farmers, who manage smaller plots yet produce significant yields.\n\nThe success we are witnessing in the tobacco industry is largely driven by small-scale farmers who manage smaller plots of land, he said.\n\nOne of the key initiatives supporting these farmers is the Tobacco Transformation Plan, which aims for a production target of 300 million kilogrammes.\n\nLast seasons drought posed challenges, limiting yields to 236 million kilogrammes.\n\nHowever, this season shows promising signs of recovery, with an increase in both irrigated and dryland tobacco production.\n\nProf Jiri expressed optimism following good rains.\n\nWith the right conditions, we can achieve close to our 300 million kilogrammes target this season, he said.\n\nTo further support rain-fed farmers, the planting season for dryland tobacco has been extended to ensure that farmers relying on rainfall can still plant their crops.\n\nThis extension is crucial in helping farmers adapt to changing climate conditions, allowing them to mitigate risks associated with drought and inconsistent weather patterns.\n\nHe said the emphasis on processing tobacco into finished products, such as cigarettes, is also vital for enhancing agricultural profitability.\n\nThe total revenue generated from tobacco exceeds US$60 billion, with farmers benefiting around US$1 billion of that.\n\nWe must focus on establishing these value-added industries to enhance our agricultural profitability, he said.\n\nThe Governments commitment to value addition does not stop with tobacco. Similar strategies are being advocated for other agricultural sectors, such as cotton.\n\nProf Jiri said there is need to process raw lint into clothing products instead of exporting it unprocessed, saying the approach aims to create jobs and boost local industries, ultimately strengthening the agricultural sector.\n\nSmallholder farmers are also making strides with other crops. This season, they have planted 1,7 million hectares of maize out of a targeted 1,8 million hectares, with encouragement to utilise short-duration varieties for better yields.\n\nTraditional grains are projected to exceed their target of 500 000 hectares, reflecting the farmers adaptability and commitment to diversifying their production.\n\nProf Jiri highlighted that the success of smallholder farmers is not only crucial for meeting local food demands, but also for enhancing Zimbabwes export capacity.\n\nWhen we empower our smallholder farmers, we are not just feeding our nation; we are also positioning ourselves in the global market, he stated.\n\nFurthermore, the Government is working to provide better input packages for cotton farmers to ensure they achieve viable yields.\n\nThis, he said, is essential for farmers to earn a good price at auction markets when they export their products.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/professor-obert-jiri-old.jpg",
            "description": "Precious Manomano-Herald Reporter Smallholder farmers are essential to the nation’s agricultural production, playing a critical role in driving economic growth and expanding export opportunities, Lands, Agriculture, Fisheries and Rural Development Permanent Secretary Professor Obert Jiri has said. The farmers cultivate 1,4 million hectares of maize, representing approximately 70 percent of the grain marketed in the […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "Govt sets aside 380 000 vaccines for tick-borne diseases",
            "url": "https://www.herald.co.zw/govt-sets-aside-380-000-vaccines-for-tick-borne-diseases-2/",
            "content": "Precious Manomano-Herald Reporter\n\nGovernment has reassured farmers of its commitment to livestock health by confirming the availability of over 380 000 doses of vaccines for tick-borne diseases.\n\nThe Department of Veterinary Services (DVS) is scaling up efforts to combat an anticipated rise in animal diseases, by ensuring that farmers have the necessary resources to protect their livestock.\n\nDVS chief director Dr Pious Makaya gave details of the current vaccine stock, which includes 380 000 doses of Theileriosis, along with 40 000 doses of Anaplasmosis (gall sickness) and 40 000 doses of Babesiosis (red water).\n\nDespite this substantial supply, he noted that the department requires two million doses of anthrax and four million doses of blackleg, which are imported annually from Botswana.\n\nWith the coming of the rainy season, farmers and other stakeholders in the livestock industry should expect a general increase in animal diseases across the country, Dr Makaya said.\n\nHe identified potential threats, including internal and external parasites, food-borne diseases, insect or vector-borne diseases, and soil-borne diseases like blackleg and anthrax.\n\nIn response to these challenges, DVS is enhancing its laboratory-based surveillance of animal diseases nationwide.\n\nThe department has decentralised its diagnostic processes to provinces such as Manicaland, Masvingo, Gwanda, Bulawayo, and Gweru, to improve access to vital disease monitoring.\n\nIt is very important to make sure that the lab-based surveillance system goes down next to the farmer, Dr Makaya said.\n\nHe added that DVS plans to extend this decentralisation to all districts across the country to enhance extension and advisory services.\n\nFarmers are encouraged to dose their animals during this time to reduce infestations, but Dr Makaya cautioned against treating livestock in poor health due to drought conditions.\n\nMost of our animals are in poor conditions because of the impact of drought. So, they shouldnt deworm their livestock if they have poor blood conditions. We encourage farmers to deworm animals with a blood condition of 3 and above, he said.\n\nTo combat the expected rise in foodborne diseases, DVS will also increase inspections and certifications of abattoirs and milk processing plants to ensure the safety of animal-derived foods.\n\nThe department is committed to upscaling veterinary public health operations for beef and pork.\n\nDr Makaya further urged farmers to vaccinate their livestock against lumpy skin disease and take preventive measures against soil-borne diseases like blackleg and anthrax.\n\nHe highlighted the critical role of regular dipping, encouraging farmers to dip their animals weekly as advised by extension staff to mitigate the prevalence of tick-borne diseases.\n\nWith these comprehensive measures in place, the Government aims to support farmers in safeguarding their livestock and tackling the challenges posed by the rainy season, to boost the health and productivity of the livestock industry during this critical period.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Dr-Pious-Makaya-680x380.jpg",
            "description": "Precious Manomano-Herald Reporter Government has reassured farmers of its commitment to livestock health by confirming the availability of over 380 000 doses of vaccines for tick-borne diseases. The Department of Veterinary Services (DVS) is scaling up efforts to combat an anticipated rise in animal diseases, by ensuring that farmers have the necessary resources to protect […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        },
        {
            "title": "Editorial Comment: Mozambican opposition must accept final election results",
            "url": "https://www.herald.co.zw/editorial-comment-mozambican-opposition-must-accept-final-election-results/",
            "content": "THE opposition-led unrest in Mozambique has spawned disruptions and delays on transport routes and energy exports to neighbouring countries. It needs to stop now.\n\nSADC, as it does once the election process is over and the relevant national courts have considered all electoral petitions and objections and made their final ruling, has endorsed the election.\n\nMozambiques neighbours have held firmly to the position that the people of Mozambique have spoken and had the wishes of the majority confirmed.\n\nBut despite exhausting all channels to first contest the election and then the results, the opposition and groups of its supporters have still refused to accept the outcome and the fact that they were out-voted and lost.\n\nMost of the unrest is in the major cities of Maputo and in particular Beira and surrounding areas. This is why neighbours, and especially Zimbabwe, Zambia and Malawi, who rely on these major ports for so much of their trade, have been hit hard.\n\nPresident Mnangagwa, the SADC chairperson, last month congratulated incoming President Daniel Chapo and his Frelimo party on their victory, carefully waiting until the Mozambican courts had dealt with all objections since the winners could not be confirmed until all processes had been completed.\n\nThe SADC Organ on Politics, Defence and Security this week held an Extraordinary Summit, with all three Presidents who sit on it governing countries that directly border Mozambique, so having special interest in a return to peace in that country.\n\nPresident Samia Suluhu Hassan of Tanzania chaired the meeting attended by President Hakainde Hichilema of Zambia and President Lazarus Chakwera of Malawi.\n\nThe Troika had exceptionally detailed interest in resolving the dispute.\n\nThere has been a tendency among some opposition parties losing elections in the SADC region to seek support from neighbouring countries, especially those where a previous opposition leader has won an election recently and become the new President.\n\nIf the Mozambican opposition were hoping this route would work they were disappointed. Both President Chakwera in 2020 and President Hichilema in 2022 defeated the previous incumbents in their countries. But both are firm believers in the rule of law and the right of voters to choose and so have endorsed the Mozambican elections along with the rest of the region.\n\nSADC countries do not dictate who wins elections and who loses. They accept the final results, the ones confirmed by the national courts. These nations are perfectly aware that sometimes the incumbent wins and sometimes the opposition wins. It all depends on the voters. And sometimes, as was seen in Malawi, a former ruling party returns to power after a spell on the opposition benches. We are all democracies.\n\nThe Troika made it clear that the violence must cease and the regional trade routes allowed to function properly. But they were then prepared to mobilise the Panel of Elders, with the ministerial committee of the Troika, to help the Mozambican Government and opposition move away from the present confrontation.\n\nThis has been effective in other countries in the past, with the Elders largely getting the losers to accept their loss, but then making sure that the winners are extra careful not to trample on anyones rights. However, this is not actually a problem in modern SADC since the opposition has always continued to function and been able to contest elections with their full rights.\n\nA lot of the work of such panels is to help provide neutral ground for discussions and make suggestions where this might be useful to keep people talking, since SADC is not going to overturn modern elections, but is entitled to help all groups in a country at least work together on essentials.\n\nBoth SADC with President Mnangagwas earlier statement and now the Troika have called upon Mozambicans to accept the results.\n\nThe opposition has exhausted all legal routes and so needs to calm its supporters and stop the violence.\n\nAfter this weeks Troika meeting, Dr Hassan highlighted that the region could not ignore the crisis in Mozambique, especially when it affected the socio-economic fabric of the entire region.\n\nPresident Hichilema also stressed the need for the whole of SADC to support collective action to restore peace and security, and highlighted the damage that the Mozambique unrest was causing, especially with immediate neighbours.\n\nWhen the Mozambican courts ruled that the elections in October were valid and that incoming President Chapo won the Presidency and Frelimo won the parliamentary elections, both by a significant margin, it was not some sort of instant decision.\n\nThe legal processes and then the court hearings and the court discussions took two months, since the courts had to plough through the many objections made by the main opposition party and consider what was said.\n\nSometimes this happens in a democracy but when it does there must still be a final result, or at least a final decision, and that has now happened in Mozambique.\n\nOpposition leader Venancio Mondlane, who returned to Maputo from exile yesterday, must stop pandering to the whims and caprices of foreign handlers and put his country first.\n\nHis presence in Mozambique must not inflame tensions and stoke the embers of violence as the country needs to move forward in peace and harmony.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/Daniel-Chapo.jpg",
            "description": "THE opposition-led unrest in Mozambique has spawned disruptions and delays on transport routes and energy exports to neighbouring countries. It needs to stop now. SADC, as it does once the election process is over and the relevant national courts have considered all electoral petitions and objections and made their final ruling, has endorsed the election. […]",
            "time": "08:35",
            "date": "10 Jan 2025"
        }
    ]
}