{
    "news": [
        {
            "title": "Renowned businessman and farmer Nguluvhe dies",
            "url": "https://www.herald.co.zw/renowned-businessman-and-farmer-nguluvhe-dies/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nRenowned Beitbridge businessman and farmer Mr Chris Nguluvhe, commonly known as Shule Shule has died.\n\nHe was 61.\n\nAccording to his eldest daughter Miss Happiness Nguluvhe, the businessman died at a hospital in Polokwane, South Africa on Tuesday morning where he had been admitted following a short illness.\n\nShe said funeral arrangements will be announced in due course. The news about his death has sent the Beitbridge community into shock and mourning.\n\nMr Nguluvhe is also credited with establishing Shule Shule Business Centre in Khwalu 1 suburb after opening the first sports bar (Shule Shule) in the area in 2002.\n\nHe was one of the major sponsors of Beitbridges Community Radios Station, Lotsha FM, Dulivhadzimu United FC and was also involved in a number of community social responsibility programmes across the district.\n\nHe had business interests in customs and clearing, trucking, livestock production, accommodation and fast food.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/a-1-680x380.jpg",
            "description": "Renowned Beitbridge businessman and farmer Mr Chris Nguluvhe, commonly known as Shule Shule has died.",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe abolishes death penalty",
            "url": "https://www.herald.co.zw/zimbabwe-abolishes-death-penalty/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nIn a historic move, Zimbabwe has abolished the death penalty, fundamentally reshaping the nations approach to criminal justice.\n\nThe newly enacted Death Penalty Abolition Act [Chapter 9:26], published in the Government Gazette, marks a significant milestone in the countrys legal history.\n\nNo sentence of death, whenever imposed, shall be carried out, read part of the groundbreaking legislation.\n\nThis sweeping reform not only prohibits courts from imposing capital punishment but also mandates the re-sentencing of all prisoners currently on death row.\n\nThe Act further amends key laws, including the Criminal Procedure and Evidence Act, the Genocide Act, and the Criminal Law (Codification and Reform) Act, to align with the abolition of the death penalty.\n\nLife imprisonment and long-term sentences now replace what were once capital offenses, including treason and murder under aggravating circumstances.\n\nThe transitional provisions within the Act ensure that those already sentenced to death will be brought before the High Court for re-sentencing.\n\nJudges are directed to consider the nature of the offense, the prisoners circumstances and the time spent under the death sentence, among other factors.\n\nPrisoners are guaranteed legal representation, and the State will also be represented to ensure a balanced re-sentencing process.\n\nMinister of Justice and Parliamentary Affairs Justice Ziyambi Ziyambi welcomed the reform, describing it as a crucial step toward aligning Zimbabwes justice system with international human rights standards.\n\nThis Act is more than a legal reform; it is a statement of our commitment to justice and humanity, he said.\n\nWe recognise the importance of rehabilitation and the need to move away from retribution.\n\nHowever, the law does leave room for a conditional suspension of the abolition in times of public emergency.\n\nUnder the Defence Act, the death penalty can be reinstated temporarily during states of emergency declared under section 113 of the Constitution, though even in such cases, previously imposed death sentences will be commuted to life imprisonment.\n\nZimbabwes abolition of the death penalty places it among a growing number of African nations moving away from capital punishment.\n\nOver two-thirds of the worlds countries have now abolished the death penalty in law or practice, signaling a global shift toward more humane justice systems.\n\nAs the nation begins its transition to life without the death penalty, the reforms represent not only a legal transformation but also a broader societal reckoning with the principles of justice, mercy and rehabilitation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Death-by-hanging.jpg",
            "description": "Ivan Zhakata Herald Correspondent In a historic move, Zimbabwe has abolished the death penalty, fundamentally reshaping the nation’s approach to criminal justice. The newly enacted Death Penalty Abolition Act [Chapter 9:26], published in the Government Gazette, marks a significant milestone in the country’s legal history. “No sentence of death, whenever imposed, shall be carried out,” […]",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Air Zimbabwe Employee in court for draining plane fuel",
            "url": "https://www.herald.co.zw/air-zimbabwe-employee-in-court-for-draining-plane-fuel/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA 49-year-old Air Zimbabwe employee stationed at the Robert Gabriel Mugabe International Airport has appeared in court on allegations of draining Jet A1 fuel from his employers plane while it was awaiting service.\n\nJacob Mutemeri was facing theft charges when he appeared before a Harare magistrate, who granted him US$150 bail and he will be back in court on January 23, 2025.\n\nIt is the States case that on November 8, 2024. an Air Zimbabwe Boeing 737 Z-WPA Mbuya Nehanda arrived from Botswana and was reported to have a leak and also required service. It was parked at the Air Zimbabwe Engine Run Section awaiting maintenance. The plane had 6.3 tonnes of fuel.\n\nHaving noted the defects on the plane Mutemeri hatched a plan to steal Jet Al Fuel from it.\n\nMutemeri started draining fuel from the plane every night from November 15 to 22, 2024.\n\nThe court heard that on November 15, 2024, he drove an Air Zimbabwe Nissan Navara Single Cab Silver in colour and was seen arriving at the hangar where the plane was parked.\n\nHe allegedly disembarked from the vehicle and started draining fuel from the plane using containers.\n\nIt is the States case that he left the Air Zimbabwe complex and drove through the air side towards Gate A3 which is situated in the eastern direction of the airport.\n\nIt is alleged that he used the same modus operandi using the same vehicle on November 16 and left using the same route.\n\nThe court heard that on November 18, 2024, he entered at 3.30 am and left at 4.29 am using the same route.\n\nThe offence came to light on November 22 during the servicing of the reported leak that is when it was noted that the fuel from the plane was stolen and a report was made leading to his arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "A 49-year-old Air Zimbabwe employee stationed at the Robert Gabriel Mugabe International Airport has appeared in court on allegations of draining Jet A1 fuel from his employer’s plane while it was awaiting service.",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Sniper Storm commits to nurturing young talent in 2025",
            "url": "https://www.herald.co.zw/sniper-storm-commits-to-nurturing-young-talent-in-2025/",
            "content": "Trust Khosa\n\nLong-serving Zimdancehall star, Sniper Storm, has pledged to mentor young artistes as part of his resolutions for 2025.\n\nBorn Donald Chirisa, 46 years ago, the seasoned musician promised an exciting year ahead.\n\nAs one of the pioneers of urban contemporary music that gave rise to Zimdancehall, 2025 is truly the year for seasoned showbiz figures like me to lead by example, he said.\n\nWhile we have maintained a low profile, it is time for us to step up and guide the next generation.\n\nI have also realised that I still have the energy to mentor new stars by providing them with the exposure they need most.\n\nSniper, who has been focusing on business while staying out of the spotlight, urged young artistes to invest wisely in 2025.\n\nWhile making music is our primary business, I plan to show upcoming artists another side of myselfone focused on investment, he said.\n\nI will teach them entrepreneurial skills to ensure they do not put all their eggs in one basket. I do not want to see popular figures, like artists who once enjoyed fame, living in poverty. Many have faced dire consequences after failing to manage their success, and we must avoid that at all costs.\n\nWith a rich catalogue of albums and sing-along tracks like Love Yemusoja, Mob Psychology, and Hubhinya, Sniper has been a prominent figure in the industry for over 25 years.\n\nAs he reflects on his 25 years in the business, he believes he is ready to embrace the title of elder in showbiz.\n\nI have learnt a lot throughout my journey, and I believe it is time to give back to society, he said.\n\nI am eager to help the industry grow this year, and my fans can expect new music from us as a reminder that we are here to stay.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Untitled-2-1-680x380.jpg",
            "description": "Long-serving Zimdancehall star, Sniper Storm, has pledged to mentor young artistes as part of his resolutions for 2025.",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "SADC calls for immediate peace in Mozambique amid rising tensions",
            "url": "https://www.herald.co.zw/sadc-calls-for-immediate-peace-in-mozambique-amid-rising-tensions/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Southern African Development Community (SADC) has called for calm in Mozambique, where post-election unrest has led to violence, loss of lives and significant economic disruptions.\n\nSpeaking on behalf of the regional bloc, Dr Samia Suluhu Hassan, President of Tanzania and chairperson of the SADC Organ on Politics, Defence and Security Cooperation, has urged all parties to exercise restraint and prioritise the well-being of the Mozambican people.\n\nWe are deeply concerned by the continued loss of lives, injuries, destruction of private property, and public infrastructure, she said.\n\nPresident Hassan described the ongoing unrest as a serious threat to Mozambiques stability, cross-border trade and the free movement of people.\n\nThe unrest, which erupted following announcement of election results, has escalated in recent weeks, prompting SADC to intervene with an appeal for peace.\n\nPresident Hassan said the regional bloc was ready to support Mozambique in resolving the crisis.\n\nSADC calls upon all parties to exercise restraint and refrain from actions that escalate violence and unrest, she said.\n\nWe reaffirm our readiness to assist, through appropriate mechanisms, in facilitating a peaceful resolution to the existing challenges.\n\nWe appeal for an immediate cessation of all hostilities, while reiterating the importance of prioritising the well-being and livelihoods of the Mozambican people.\n\nThe violence has not only claimed lives but has also caused severe economic strain, hindering the nations recovery efforts and regional cooperation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/SADC-States.jpg",
            "description": "The Southern African Development Community (SADC) has called for calm in Mozambique, where post-election unrest has led to violence, loss of lives and significant economic disruptions.",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "SA border management boss to visit Beitbridge",
            "url": "https://www.herald.co.zw/sa-border-management-boss-to-visit-beitbridge/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nSouth Africas head of the Border Management Authority (BMA), Dr Michael Masiapato is set to visit the Beitbridge border post to oversee operations between Thursday and Sunday as the volume of south bound traffic peaks to mark the end of the festive season.\n\nThe border which is a nexus of trade and travel in Sadc has been handling nearly 20 000 travellers daily since December 10 an increase from the usual 13 000 during off peak periods.\n\nIt is a major link for travellers, importers and exporters from Angola, Tanzania, Mozambique, Malawi, DRC, Zambia, Botswana and Zimbabwe.\n\nIn a statement on Tuesday, the BMA said Dr Masiapato will be supported by Deputy Commissioner (BMA) Jane Thupana in facilitating the legitimate movement of goods and people.\n\nThe Commissioner of the Border Management Authority (BMA), Dr Michael Masiapato will be in Beitbridge port of entry from 2 to 5 January 2025 to conduct law enforcement operations for the return leg of the Festive period, said the BMA.\n\nBeitbridge port of entry has seen increased numbers of movement, and more are expected for the return leg. The Border Management Authority (BMA) is responsible for the execution of frontline border law enforcement functions related to immigration control; port health; access control; biosecurity; food safety and phyto-sanitary control; land border infrastructure development and maintenance; border information and risk management.\n\nBorder officials on the Zimbabweans side said they expect South Africa bound traffic to surge from January 2 to January 10 as the Christmas and New Years Holidays wind up.\n\nAt the moment there is low key activity on both sides of the Beitbridge Border Post.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Untitled-1-5-680x380.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau South Africa’s head of the Border Management Authority (BMA), Dr Michael Masiapato is set to visit the Beitbridge border post to oversee operations between Thursday and Sunday as the volume of south bound traffic peaks to mark the end of the festive season. The border which is a nexus of trade […]",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Man up for murder after strangling pregnant wife over food",
            "url": "https://www.herald.co.zw/man-up-for-murder-after-strangling-pregnant-wife-over-food/",
            "content": "Fungai Lupande Mashonaland Central Bureau\n\nA 27-year-old man from Mapunga Farm Compound in Bindura is facing murder charges after he allegedly strangled his pregnant wife until her water broke during an argument over food on Christmas Eve.\n\nItai Madewekunze appeared in Bindura Magistrates Court and was remanded in custody to January 14, 2025.\n\nProsecutor Gertrude Mayenyeso told the court that on December 24, 2024, around 7 pm, Madewekunze returned home to find that his pregnant wife had not prepared supper for him.\n\nA disagreement arose, and the wife suggested that he should go and get food from his mothers house.\n\nIn a fit of anger, Madewekunze grabbed his wife by the throat and began to strangle her. She screamed for help, prompting Believe Maringisa to try to intervene.\n\nMaringisa bit Madewekunze in an attempt to stop him, but he refused to release his grip. As a result of the struggle, the wifes water broke, and she was rushed to Bindura Hospital.\n\nUnfortunately, after giving birth, she passed away. The accused had bite marks on his back as a result of the altercation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/09/Crime-and-Murder.jpeg",
            "description": "A 27-year-old man from Mapunga Farm Compound in Bindura is facing murder charges after he allegedly strangled his pregnant wife until her water broke during an argument over food on Christmas Eve.",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Chicken Hut launches content creator program to boost Zimbabwe’s creative economy",
            "url": "https://www.herald.co.zw/chicken-hut-launches-content-creator-program-to-boost-zimbabwes-creative-economy/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nPORTUGUESE restaurant, Chicken Hut will tomorrow launch a ground-breaking content creator programme aimed at accelerating Zimbabwes creative economy which has the potential to generate US$50 million over the next five years.\n\nThe programme, which aims to foster intra-regional travel and collaboration among content creators, is being launched to coincide with celebrations to mark the 4th anniversary of the African Continental Free Trade Area (AfCFTA).\n\nThe AfCFTA to which Zimbabwe is signatory was operationalised on January 1, 2021, marking historical milestones towards continental economic integration.\n\nZimbabwe has deposited its instrument of ratification, a development expected to pave the way for the countrys full participation in the estimated US$3,4 trillion trading bloc and the worlds biggest single market with about 1,3 billion people.\n\nIn a statement Chicken Hut said it has taken a deliberate decision to launch its ground-breaking content creator programme on Wednesday to coincide with the anniversary for the operationalisation of the AFCFTA, a milestone for promoting trade and economic growth across the continent.\n\nCoinciding with this celebration, Chicken Hut has launched a ground-breaking content creator programme aimed at accelerating Zimbabwes creative economy while fostering intra-regional travel and collaboration among creators.\n\nZimbabwe plays a key role in intra-Africa trade as home to regional offices of Afreximbank, a bank instrumental in supporting initiatives like the Creative Africa Nexus (CANEX), said Chicken Hut.\n\nThe global content creator economy is valued at US$190 billion, with Africa contributing US$3 billion. South Africas share is US$500 million annually  and if Zimbabwe aligns its creative economy with these benchmarks, it has the potential to reach US$50 million within the next five years.In 2023, Mr Marvellous Nyongoro, also known as The African Finder, gained national attention after winning a trip to Cape Town through Chicken Huts pop-up store at Halsteds.\n\nLeveraging social media, Mr Nyongoro created a video urging his followers to tag Chicken Hut, asking the brand to sponsor him or appoint him as a brand ambassador. Chicken Hut responded, paving the way for Mr Nyongoro to collaborate with CANEX, an initiative by Afreximbank, said the Portuguese restaurant.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/09/Chicken-Hut.jpg",
            "description": "Oliver Kazunga Senior Business Reporter PORTUGUESE restaurant, Chicken Hut will tomorrow launch a ground-breaking content creator programme aimed at accelerating Zimbabwe’s creative economy which has the potential to generate US$50 million over the next five years. The programme, which aims to foster intra-regional travel and collaboration among content creators, is being launched to coincide with […]",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "ZRP urges public to celebrate holidays in a peaceful manner",
            "url": "https://www.herald.co.zw/zrp-urges-public-to-celebrate-holidays-in-a-peaceful-manner/",
            "content": "Crime Reporter\n\nThe Zimbabwe Republic Police has urged members of the public to celebrate the New Year in a responsible manner which ensures the safety of all Zimbabweans and visitors.\n\nIt said officers will continue maintaining high visibility in all residential areas, business premises and manning roadblocks.\n\nIn a statement national police spokesperson Commissioner Paul Nyathi said, The Zimbabwe Republic Police reminds the public that as the country celebrates and ushers in the New Year (2025) tonight , deployments will be made at all public places, which include shopping centres, residential, industrial areas and Central Business Districts to maintain law and order.\n\nThe public should therefore celebrate the New Year in a responsible manner which contributes towards the safety of all Zimbabweans and visitors.\n\nHe said Individuals and institutions who intend to use fireworks or fire crackers should observe the countrys laws and notify the local authority and Police to ensure the safety and security of the public.\n\nThe safety of children should also be prioritised as the nation welcomes the year 2025. In the same vein, those who will take to the streets and overturn bins or other objects or skid vehicles and engage in acts of violence while damaging infrastructure will be arrested, Comm Nyathi said.\n\nHe said the public should feel free to report anyone engaging in acts of disturbance to the Police on the listed telephone numbers:- Harare Toll Free 911 or 112, Harare Operations (0242) 748836 or 777651, Bulawayo Toll Free 112, 999, Bulawayo Operations (0292) 2735470r 883930, National complaints desk (0242) 703631 and Police General Headquarters WhatsApp 0712 800 197\n\nThe Zimbabwe Republic Police wishes Zimbabweans and visitors a peaceful and a prosperous 2025, Comm Nyathi said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter The Zimbabwe Republic Police has urged members of the public to celebrate the New Year in a responsible manner which ensures the safety of all Zimbabweans and visitors. It said officers will continue maintaining high visibility in all residential areas, business premises and manning roadblocks. In a statement national police spokesperson Commissioner Paul […]",
            "time": "18:33",
            "date": "31 Dec 2024"
        },
        {
            "title": "Mutare man jailed 12 years for stealing teenager’s bicycle at gunpoint",
            "url": "https://www.herald.co.zw/mutare-man-jailed-12-years-for-stealing-teenagers-bicycle-at-gunpoint/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nA 30-year-old Mutare man, Josiah Saungweme has been sentenced to 12 years in prison for robbing a 17-year-old of his bicycle at gunpoint.\n\nThe incident occurred on September 9, 2024, along the Marange-22 Miles road.\n\nAccording to the National Prosecuting Authority of Zimbabwe, Saungweme approached the teenager, who was riding a silver buffalo bicycle, and asked for directions.\n\nHe then pulled out a Blow F92 pistol and demanded that the teenager hand over the bicycle.\n\nThe teenager, fearing for his safety, surrendered the bicycle.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/09/Jailed.jpg",
            "description": "A 30-year-old Mutare man, Josiah Saungweme has been sentenced to 12 years in prison for robbing a 17-year-old of his bicycle at gunpoint.",
            "time": "18:33",
            "date": "31 Dec 2024"
        }
    ]
}