{
    "news": [
        {
            "title": "ZCC bishop flogs two congregants, one dies during ‘healing’ session",
            "url": "https://www.herald.co.zw/zcc-bishop-flogs-two-congregants-one-dies-during-healing-session/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA 36-year-old ZCC Damsko bishop has been convicted for flogging and killing a church congregant after claiming that she and her husband were mentally ill.\n\nThe woman died due to the injuries she sustained while her husband sustained severe injuries.\n\nCrispen Gomori of Limpopo View in Beitbridge was convicted on Tuesday after appearing before Beitbridge resident magistrate, Mr Takudzwa Gwazemba.\n\nGomori said he administered seven strokes on his male victim as a way of healing him as he was losing his mind.\n\nIn his defence, Gomori had argued that the couple agreed to the flogging since they are members of his church.\n\nIn aggravation, the State led by Mr Tawanda Chigavazira argued that even if the couple had agreed to being flogged, the assault was severe.\n\nHowever, for the assault charge Gomori was cautioned and discharged after the court felt that he had suffered a misconception of religious laws.\n\nThe court heard that on March 6, 2023, at around 12 pm, the complainant and his wife went to church.\n\nUpon arrival at the shrine, fellow congregants were instructed by Gomori to shackle the complainant and his wife to a tree with chains.\n\nGomori was claiming that the two were mentally ill.\n\nThe complainant and his wife spent the whole night tied to the tree until 8pm the next day when Gomori started assaulting them with a leather whip until the woman died at 4am.\n\nUpon realising that the woman had died, Gomori fled from the shrine.\n\nA police report was made, leading to Gomoris arrest.\n\nHis male victim was taken to Beitbridge District Hospital for treatment while the womans body was taken to the same hospital for a post-mortem.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/03/zcc.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau A 36-year-old ZCC Damsko bishop has been convicted for flogging and killing a church congregant after claiming that she and her husband were mentally ill. The woman died due to the injuries she sustained while her husband sustained severe injuries. Crispen Gomori of Limpopo View in Beitbridge was convicted on Tuesday […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Dzivarasekwa youths urged to work towards self-reliance",
            "url": "https://www.herald.co.zw/dzivarasekwa-youths-urged-to-work-towards-self-reliance/",
            "content": "Herald Reporter\n\nZanu PFs parliamentary candidate for Dzivarasekwa in the 2023 general elections, Cde Lovemore Chamatowa has called on youths to strive to be self-reliant in line with the Presidents mantra, nyika inovakwa nevene vayo.\n\nHe said this during an event organised by PC Foundation, an organisation dedicated to uplifting local youths, at Dzivarasekwa 2 Community Hall.\n\nThe event, led by Apostle Namai Chiwa, brought together young people to showcase their talents through dance and music.\n\nThe youths put up lively performances while celebrating their culture and community spirit.\n\nCde Chamatowa pledged his unwavering support for the PC Foundation and donated groceries, thereby underscoring his dedication to supporting the local community.\n\nThere is need for us as Dzivarasekwa residents to rally behind initiatives that foster community development, said Cde Chamatowa.\n\nHe called upon the community to unite in supporting the President and Zanu PF in implementing developmental initiatives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/93de97d4-48b4-4051-945c-112bef45a6f1-680x380.jpeg",
            "description": "Herald Reporter Zanu PF’s parliamentary candidate for Dzivarasekwa in the 2023 general elections, Cde Lovemore Chamatowa has called on youths to strive to be self-reliant in line with the President’s mantra, ‘nyika inovakwa nevene vayo’. He said this during an event organised by PC Foundation, an organisation dedicated to uplifting local youths, at Dzivarasekwa 2 […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Sinkhole swallows truck driver in Japan",
            "url": "https://www.herald.co.zw/sinkhole-swallows-truck-driver-in-japan/",
            "content": "A truck cabin that was swallowed by a sinkhole in Japan two weeks ago has been located in a nearby sewer pipe, authorities say.\n\nDrone images suggest that a human body is inside the cabin, but it is unclear if it is that of the trucks missing 74-year-old driver.\n\nJapanese authorities have asked hundreds of residents near Tokyo to evacuate as the sinkhole has grown to more than 40 meters wide  four times its width when it first appeared  thereby hampering rescuers efforts.\n\nAbout a fortnight ago, part of a road intersection about 30kms north of Japans capital opened up, swallowing a three-ton truck and its driver, a 74-year-old man, prompting a rescue mission.\n\nLocal authorities have also asked residents to cut down on bathing and doing laundry in a bid to cut down on wastewater, which could further complicate rescue efforts in the fragile area.\n\nTakashi Oguchi, a geographer from the University of Tokyo, said sinkholes are rare in Japan, but he warned that when a large underground waterpipe ruptures, leaked water could create a sinkhole.\n\nMuch of Japans public infrastructure was built between the 1960s and 1970s during an economic boom in the wake of World War II.\n\nThe sewage system in question is about 42 years old.\n\nWe will have such events more in the future because the decay of underground pipes is ongoing little by little, and many pipes are located below roads, Oguchi said.\n\nThe mission to rescue the truck driver has proven difficult so far, an official from Sewerage Works Division told CNN.\n\nThe driver was buried in sand, and if we bring heavy equipment near the asphalt it might fall in, he said.\n\nHe said rescue workers are planning to build a ramp to bring the heavy equipment from an angle.\n\nRescuers have used cranes to lift part of the truck out of the hole and have sent drones underground but have not been able to communicate with the truck driver since the incident occurred.  CNN\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/47e1068a-766f-4402-acba-f22a8e1f1f88-680x380.jpeg",
            "description": "A truck cabin that was swallowed by a sinkhole in Japan two weeks ago has been located in a nearby sewer pipe, authorities say. Drone images suggest that a human body is inside the cabin, but it is unclear if it is that of the truck’s missing 74-year-old driver. Japanese authorities have asked hundreds of […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Sanctions must fall for Zimbabwe to thrive”",
            "url": "https://www.herald.co.zw/sanctions-must-fall-for-zimbabwe-to-thrive/",
            "content": "Ivan Zhakata and Anesu January\n\nCitizens Against Economic Sanctions Zimbabwe (CAESZ) has vowed to intensify its campaign for the removal of economic sanctions imposed by the West.\n\nAddressing journalists in Harare, the organisations executive director Cde Martin Zharare said sanctions are stifling the countrys progress towards attaining Vision 2030.\n\nCde Zharare said Zimbabwes economic development hinges on breaking free from external restrictions.\n\nAs CAESZ, we are fully committed to supporting Vision 2030, he said.\n\nThese sanctions are a deliberate attempt to hinder Zimbabwes economic growth, and we will do everything in our power to raise awareness and mobilize our people against them.\n\nVision 2030 aims to transform Zimbabwe into an upper-middle-income economy by the end of the decade.\n\nCde Zharare said Government has already secured over $2,5 billion in infrastructure investments, which is a crucial step towards realising the goal.\n\nWe are seeing real progress in infrastructure development, but sanctions continue to slow down the full implementation of economic projects, he said.\n\nThese restrictions are an obstacle to job creation, business expansion, and national prosperity.\n\nCde Zharare also linked Zimbabwes development agenda to broader continental and global initiatives.\n\nVision 2030 aligns with the African Unions Agenda 2063 and the UN Sustainable Development Goals. It is a well-thought-out strategy that, if fully supported, will liberate Zimbabwe from the grip of economic imperialism.\n\nCAESZ has been actively engaging communities across Zimbabwe, spreading messages of resilience, unity, and economic patriotism.\n\nThe organisation conducted several awareness campaigns in 2024 and has already set its sights on expanding its activities in 2025.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/6976f52f-67fb-4681-8c4e-6b89bf809a2c-680x380.jpeg",
            "description": "Ivan Zhakata and Anesu January Citizens Against Economic Sanctions Zimbabwe (CAESZ) has vowed to intensify its campaign for the removal of economic sanctions imposed by the West. Addressing journalists in Harare, the organisation’s executive director Cde Martin Zharare said sanctions are stifling the country’s progress towards attaining Vision 2030. Cde Zharare said Zimbabwe’s economic development […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Government launches one-stop centre for title deeds",
            "url": "https://www.herald.co.zw/government-launches-one-stop-centre-for-title-deeds/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nThe Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, in collaboration with the Ministry of Justice, Legal and Parliamentary Affairs, has introduced a one-stop centre dedicated to the issuance of title deeds.\n\nThis initiative aims to assist holders of valid offer letters, A2 permits, 99-year leases, A1 Settlement Permits, A1 Temporary Permits, and ALSA leases.\n\nThe one-stop centre, located at the Harare Makombe Complex, will process title deeds for surveyed farms within three days for farmers who pay the purchase price in cash.\n\nThose who pay the purchase price within 90 days will be considered as making a cash payment upon deposit, allowing them to collect their title deeds after full payment is completed.\n\nFarmers seeking mortgage arrangements will also benefit from this initiative, as the Government is finalising modalities with selected banks to facilitate this service.\n\nOnce the modalities are completed, the nation will be informed, the ministries stated.\n\nTo initiate the process, farmers are required to complete a data collection form at the one-stop centre, with assistance from a valuation and estate officer.\n\nThey must attach certified copies of their national identity card or passport, along with the relevant tenure documents, and pay a processing fee of US$10.\n\nA surveyor will then confirm the survey status and upload the relevant diagram into the deeds system, indicating any applicable survey and examination fees.\n\nThis initiative is expected to benefit approximately 2 500 participants of Zimbabwes Land Reform Programme, who are set to receive their title deeds by March 2025.\n\nThe Government aims to curb multiple farm ownership, facilitate family inheritance, and provide exit strategies for those opting out of farming.\n\nThe land tenure system, officially launched by President Mnangagwa on December 28, 2024, is designed to grant full ownership rights to beneficiaries by the specified date.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-2025-02-12-at-14.17.33-680x380.png",
            "description": "Precious Manomano Herald Reporter The Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, in collaboration with the Ministry of Justice, Legal and Parliamentary Affairs, has introduced a one-stop centre dedicated to the issuance of title deeds. This initiative aims to assist holders of valid offer letters, A2 permits, 99-year leases, A1 Settlement Permits, A1 […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Magistrate fined for culpable homicide",
            "url": "https://www.herald.co.zw/magistrate-fined-for-culpable-homicide/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nA magistrate has been fined US$400 or five months in prison for culpable homicide following a fatal road accident.\n\nMakunde Timeon Tavengwa (46) appeared before the Masvingo Magistrates Court facing culpable homicide charges.\n\nOn November 22, 2023, Tavengwa was driving a Nissan X-Trail along the Harare-Masvingo Road when he hit Misheck Makuvire, a school pupil who was crossing the road.\n\nThe child died on the spot.\n\nInvestigations revealed that the accident occurred in clear daylight on a wide tarred road.\n\nThe court heard that Tavengwa was negligent as he failed to keep a proper look-out as he was speeding.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/Fined.jpeg",
            "description": "Ivan Zhakata Herald Correspondent A magistrate has been fined US$400 or five months in prison for culpable homicide following a fatal road accident. Makunde Timeon Tavengwa (46) appeared before the Masvingo Magistrates Court facing culpable homicide charges. On November 22, 2023, Tavengwa was driving a Nissan X-Trail along the Harare-Masvingo Road when he hit Misheck […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "CAG bus driver fined, banned for negligence",
            "url": "https://www.herald.co.zw/cag-bus-driver-fined-banned-for-negligence/",
            "content": "Herald Correspondent\n\nA CAG Travellers Coaches driver has been fined US$300 or three months in prison for negligent driving.\n\nThis comes after the bus he was driving was involved in an accident along the Harare-Chirundu Road.\n\nThomas Chokuda (49) of Trafalgar, Norton, appeared before the Karoi Magistrates Court where he pleaded guilty.\n\nHis Class 1 licence was cancelled and he was banned from driving heavy vehicles for two years.\n\nThe court heard that on September 17, 2024, Chokuda was driving a Zhongtong bus with 36 passengers on board when he applied emergency brakes to avoid cattle, causing the bus to overturn. Seventeen passengers sustained minor injuries as a result of the accident.\n\nChokuda was found guilty of speeding, failing to keep a proper look-out and losing control of the vehicle.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/Fined.jpeg",
            "description": "Herald Correspondent A CAG Travellers Coaches driver has been fined US$300 or three months in prison for negligent driving. This comes after the bus he was driving was involved in an accident along the Harare-Chirundu Road. Thomas Chokuda (49) of Trafalgar, Norton, appeared before the Karoi Magistrates’ Court where he pleaded guilty. His Class 1 […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Edmund Kudzayi wanted over $40k extortion charges",
            "url": "https://www.herald.co.zw/edmund-kudzayi-wanted-over-40k-extortion-charges/",
            "content": "Herald Reporter\n\nPolice are looking for a public relations expert and journalist, Edmund Kudzayi, after he was implicated in an extortion case where he and an accomplice were asking West Properties to pay US$40 000 to avoid publication of sensitive information concerning the company.\n\nHis alleged accomplice, Nominate Chazwe, was recently brought before magistrate Ms Marehwanazvo Gofa.\n\nChazwe was remanded in custody until Thursday for a bail hearing.\n\nAccording to police, Edmund Kudzayi, is still at large.\n\nWest Properties, represented by Mr Michael Chideme, had previously engaged Kukurigo Communications Private Limited, where Kudzayi serves as director, for advertising and public relations services.\n\nDuring this period, Kudzayi reportedly introduced Chazwe to West Properties as his business associate.\n\nAccording to court documents, in June 2024, Chazwe and Kudzayi claimed they had damaging information about West Properties and its managing director, Mr Kenneth Raydon Sharpe.\n\nThey threatened to publish the information unless the complainant paid them US$40 000.\n\nWest Properties negotiated and paid US$24 344 to Kukurigo Communications, which was received by Kudzayi.\n\nA few months later, Chazwe and Kudzayi allegedly demanded additional money while threatening to release the information if their demands were not met.\n\nThe court heard that Chazwe subsequently received US$1 000 from West Properties that was left at Horizon Hotel and was handed over by Noah Njambi.\n\nOn February 8 this year, Chazwe allegedly demanded a further US$4 000, prompting West Properties to report the matter at Harare Central Police Station.\n\nActing on the report, police set up a sting operation where the representative of West Properties handed over the money to Chazwe in their presence.\n\nChazwe was arrested on the spot, and the US$4 000 was recovered.\n\nThe State, represented by Mr Anesu Chirenje, alleges that Chazwe and Kudzayis actions were part of a sustained extortion campaign.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/02/wanted.jpg",
            "description": "Herald Reporter Police are looking for a public relations expert and journalist, Edmund Kudzayi, after he was implicated in an extortion case where he and an accomplice were asking West Properties to pay US$40 000 to avoid publication of sensitive information concerning the company. His alleged accomplice, Nominate Chazwe, was recently brought before magistrate Ms […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Police hunt for counterfeit products company directors",
            "url": "https://www.herald.co.zw/police-hunt-for-counterfeit-products-company-directors/",
            "content": "Crime Reporter\n\nPolice are still looking for Keacy Motor Spares directors who are believed to be behind the manufacturing and packaging of counterfeit brake fluid and the prime bond multipurpose adhesives that were being sold to unsuspecting customers at their shop along Harare Street.\n\nNational police spokesperson, Commissioner Paul Nyathi said investigations are in progress and they are looking for the company directors.\n\nThe Zimbabwe Republic Police confirms the arrest of Selina Nyurwa (33) and Ashley Kasambarara (32) for selling counterfeit products in Harare, he said.\n\nOn February 3, police from the Harare Licence lnspectorate received information that a foreign-owned company operating along Bristol Road, Workington in Harare was selling counterfeit brake fluid and prime bond silicon.\n\nThe police acted on the information, leading to the arrest of the suspects and the recovery of 88 boxes of prime bond (8 800 units) and 593 boxes of brake fluid (26 000 units).\n\nThe ZRP warns individuals and companies against selling counterfeit goods, he said.\n\nCommissioner Nyathi urged members of the public to report such individuals and companies to the police on the National Complaints Desk number (0242) 703631, WhatsApp 0716800197 or the nearest police station.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/1705-1-1-PAUL-THEMBA-NYATHI-1-1.jpg",
            "description": "Crime Reporter Police are still looking for Keacy Motor Spares directors who are believed to be behind the manufacturing and packaging of counterfeit brake fluid and the prime bond multipurpose adhesives that were being sold to unsuspecting customers at their shop along Harare Street. National police spokesperson, Commissioner Paul Nyathi said investigations are in progress […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        },
        {
            "title": "Private players lauded for supporting education sector",
            "url": "https://www.herald.co.zw/private-players-lauded-for-supporting-education-sector/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nTendera Primary School in Mhangura received a major boost on Tuesday after a local farmer and businessman Mr Domnic Jairos donated over 80 desks and chairs for learners and teachers.\n\nMr Jairos also paid school fees for the whole year for all the 30 Grade Seven pupils at the school.\n\nThe donation is expected to have a positive impact on the schools pass rate which currently stands at 4 percent.\n\nPrior to the donation, Grade Seven learners were bringing their own chairs and desks from home during examinations.\n\nTeachers, learners and parents lauded the donation.\n\nMakonde schools inspector Mr Solomon Katoma said more schools in the district are in dire need of a facelift to create a conducive learning environment.\n\nMr Jairos challenged other farmers to plough back into the communities they operate in.\n\nHe said giving back to society is critical in ensuring that the country attains Vision 2030 which seeks to transform the country into an upper middle-income economy.\n\nThe education sector is a key component for the attainment of Vision 2030, with the Government allocating ZiG46 billion to the Ministry of Primary and Secondary Education in this years budget.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/c1562598-ffd8-4058-942b-8e84bd290e72-680x380.jpeg",
            "description": "Conrad Mupesa Mashonaland West Bureau Tendera Primary School in Mhangura received a major boost on Tuesday after a local farmer and businessman Mr Domnic Jairos donated over 80 desks and chairs for learners and teachers. Mr Jairos also paid school fees for the whole year for all the 30 Grade Seven pupils at the school. […]",
            "time": "20:26",
            "date": "12 Feb 2025"
        }
    ]
}