{
    "news": [
        {
            "title": "‘Africa must determine  own destiny’",
            "url": "https://www.herald.co.zw/africa-must-determine-own-destiny/",
            "content": "Wallace Ruzvidzo in KAMPALA, Uganda\n\nAFRICA must produce its own food, clothing and essential goods, taking advantage of the abundant natural resources and rich heritage, President Mnangagwa has said.\n\nThe President made these remarks during a Presidential Dialogue at the 11th Africa Regional Forum on Sustainable Development here yesterday.\n\nPresident Mnangagwa, who is also the chairman of SADC, said the African continent must seize control of its development and future as Africas transformation will not occur by chance.\n\nLet us remain steadfast in advancing the implementation of both the 2030 Sustainable Development Agenda and Agenda 2063. That responsibility lies with us, the leaders and people of this great continent.\n\nAs Africa, we must take charge of our development and our destiny. Let us, therefore, re-commit ourselves to the guiding objectives of inclusive development, strengthening human capacities and eradicating poverty, in all its forms.\n\nThese must remain at the centre of our shared aspirations for a prosperous and peaceful Africa, he said.\n\nGoing forward, President Mnangagwa said Africa must jointly explore emerging technologies, as the continent stood a better chance of sustained development by maintaining a united front rather than as individuals.\n\nThese should include harnessing Artificial Intelligence and the Internet of Things to drive productivity, build globally competitive economies, and to boost intra-Africa Trade, he said.\n\nOn its part, the President said, SADC remained committed to the attainment of regional, continental and global goals.\n\nIn the context of the implementation of the 2030 Agenda for Sustainable Development and Agenda 2063: The Africa We Want, the collective experiences of our countries are invaluable in nurturing evidence-based leadership, as we reflect, learn and co-create solutions towards a better tomorrow. In Southern Africa, our resolve in this regard, is firmly grounded in the SADC Treaty.\n\nPrimarily our objective is to promote sustainable and equitable socio-economic development as well as the eradication of poverty through regional integration, said the SADC Chair.\n\nPresident Mnangagwa said the SADC Vision 2050 places inclusive development at the heart of the regions long-term aspirations.\n\nWe, thus, continue to strengthen institutions, broaden partnerships and entrench governance models that are responsive to current challenges and emerging opportunities, he said.\n\nThe President said the regions abundant natural resources offered a unique comparative advantage that must be fully leveraged to create decent jobs, sustainable enterprises and economic development through sustainable value chains, especially in commodity sectors.\n\nIn this regard, through the SADC Industrialisation Strategy and Roadmap, the region has identified priority value chains in agriculture and mining.\n\nFocus is on scaling up industrialisation, diversifying industrial sectors, infrastructure development, tourism,and ICTs among others, to ultimately stimulate intra-regional trade, said President Mnangagwa.\n\nHe said youth employability and skills development remained top regional priorities.\n\nPresident Mnangagwa\n\nRiding on the demographic dividend, SADC Member States are undertaking various education sector reforms to make education institutions Centres of Excellence for innovation, entrepreneurship and skills.\n\nThe goal is to ensure that our young people are equipped with the appropriate knowledge and skills for jobs of the future, President Mnangagwa said.\n\nAdditionally, he said, the region was scaling up investments in Technical, Vocational Education and Training, with a renewed emphasis on practical and digital skills to help young people and women to benefit from the ongoing technological and green transitions.\n\nSolutions and new products related to agri-tech, fin-tech, digital health and climate technologies, among others, have the potential to propel modernisation and industrialisation of the continent, the President said.\n\nIn the case of Zimbabwe, President Mnangagwa said the Second Republic was leveraging on the energy, creativity and innovativeness of the youth and has thus, established Innovation Hubs which are helping to spur inclusive development.\n\nIn 2024, my Government passed the Science Technology and Innovation Start-Up Bill, creating a legal framework for tax incentives, infrastructure access and public procurement reforms that favour youth led enterprises, he said.\n\nThe President said key to Zimbabwes development success milestones towards the realisation of SDGs and Agenda 2063, was Governments adoption of the Whole-of-Government Monitoring and Evaluation System.\n\nThis allows the real-time tracking and performance of national programmes across sectors, enabling data-driven and people-centred governance, improved transparency, accountability and more agile institutional responses.\n\nAt regional level, efforts by SADC Member States are also reinforced by the regions commitment to peace, security and good governance.\n\nWe recognise that political stability, the rule of law and peace within our borders, regionally and globally, are foundational to inclusive development and job creation, he said.\n\nSADC is implementing adaptation and mitigation strategies, which include climate-smart agriculture practices and the promotion of traditional crops.\n\nTo accomplish this, the SADC Chair said the establishment of irrigation infrastructure was being scaled up.\n\nIn the case of Zimbabwe, the provision of inputs to smallholder farmers that are specific to the respective climatic regions, along with the drilling of boreholes and establishment of nutritional gardens are having positive impacts on incomes as well as food and nutrition security, at the household level.\n\nPresident Mnangagwa and his counterpart President Museveni.\n\nThis transformational model is in-turn accelerating rural industrialisation, as well as the adoption of relevant technologies, which are backed by our strong traditional knowledge systems, all resulting in job creation at the community level, leaving no one and no place behind, said President Mnangagwa.\n\nHe said the SADC Regional Indicative Strategic Development Plan 2020-2030 and the SADC Industrialisation Strategy and Roadmap 2015-2063 were the main frameworks adopted to actualise Agenda 2063 and will go a long way in achieving SDGs.\n\nThis includes in particular, Goal Number 8, on decent work and economic growth. Employment creation and empowerment have been deemed central objectives in national development plans while the mainstreaming of these key cogs, across macroeconomic and sectoral policies, is also a priority.\n\nIn other words, we are of the view that our fiscal and monetary policies should simultaneously promote economic stability and job creation, said the President.\n\nAs climate change remains one of the greatest threats to developmental aspirations, President Mnangagwa said addressing its risks requires global solidarity, synergy, partnerships and investments.\n\nCalls for increased climate financing and technology transfer to Africa and the global south towards strengthening resilience and adaptation should remain pronounced. In our pursuit of inclusive growth, renewable energy has emerged as a vital enabler.\n\nThrough the adoption of an energy mix that best suits our realities, our continent must see more of our communities, particularly those in rural areas, having increased access to affordable and clean energy, said the President.\n\nHe said energy transition therefore, presented immense possibilities for green jobs for Africas youth and women.\n\nThe need for infrastructure financing, while being cautious of the risk of debt burden requires us to embrace innovative financing models to leapfrog sustainable development and economic growth, President Mnangagwa said.\n\nRegional collaboration in financing large-scale infrastructure projects is essential to drive connectivity and economic integration for shared modernisation, industrialisation and prosperity.\n\nSpeaking to journalists upon arrival at the Robert Mugabe International Airport in Harare yesterday, President Mnangagwa said SADC and the East Africa Community (EAC) came together in Uganda to map a way forward towards sustainable development.\n\nSo, in the meeting we held with the President of Uganda, we were able to discuss all these issues. Yes, other Heads of State were represented by their Foreign Ministers, but we were happy that it was a robust debate. And we were happy that both SADC and the East Africa Community were all represented in terms of respective countries from those two regions.\n\nAnd we resolved to pursue our goals as the two regions. Fortunately, from SADC, the chairman, and from the eastern region, the chairman was there. So, the two chairpersons were present. President (Yoweri) Museveni is our elder, so whenever we meet him we pay attention and learn from him. We were able to discuss issues facing our two regions. We are happy with the co-operation that is existing between the two countries, said the President.\n\nDuring deliberations in Uganda, President Museveni said Africa had the solutions to ensure sustained development.\n\nDeputy Secretary-General of the United Nations, Ms Amina Mohammed, said Africa must confront the hard truths and ensure bold solutions are cultivated for the continents continued development.\n\nThe Forum brought together Heads of State, former Presidents, Prime Ministers and Ministers, among other delegates.\n\nPresident Mnangagwa was accompanied by Foreign Affairs and International Trade Minister Professor Amon Murwira, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube and Presidential spokesperson Mr George Charamba.\n\nThe President was received at the airport by his deputies Vice Presidents Constantino Chiwenga and Kembo Mohadi, the Minister of Defence Oppah Muchinguri Kashiri, Cabinet Ministers, service chiefs and senior Government officials.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/President-in-Uganda-1-680x380.jpg",
            "description": "Wallace Ruzvidzo in KAMPALA, Uganda AFRICA must produce its own food, clothing and essential goods, taking advantage of the abundant natural resources and rich heritage, President Mnangagwa has said. The President made these remarks during a Presidential Dialogue at the 11th Africa Regional Forum on Sustainable Development here yesterday. President Mnangagwa, who is also the […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Zim, Uganda to cooperate in tourism revival",
            "url": "https://www.herald.co.zw/zim-uganda-to-cooperate-in-tourism-revival/",
            "content": "Wallace Ruzvidzoin KAMPALA, Uganda\n\nZIMBABWE and Uganda should revive collaboration in the tourism sector through establishing direct flights to tourist resorts like Victoria Falls, President Mnangagwa has said.\n\nTo that end, the President called upon both countries Tourism ministers to act swiftly and restore collaboration in the critical tourism sector.\n\nPresident Mnangagwa and his Ugandan counterpart President Yoweri Museveni held a bilateral meeting on the sidelines of the 11th Session of the African Regional Forum on Sustainable Development here yesterday.\n\nIn his remarks during the meeting, President Mnangagwa said the recent commencement of flights by Uganda Airlines to Zimbabwe was a show of goodwill towards strengthening relations between the two countries.\n\nFrequent flights between the two destinations have resultantly stimulated bilateral trade as the route sees up to 9 000 passengers travelling between the two destinations, with the volume expected to grow.\n\nI further wish to acknowledge that a significant step towards collaborative efforts to boost trade and investment between the two countries was the new Entebbe-Harare Uganda Airlines route. Zimbabwe is willing to grant freedom rights to Uganda Airlines, President Mnangagwa said.\n\nAlthough Harare was the immediate target route, Uganda Airlines also intends to service the Entebbe-Victoria Falls and the Entebbe-Lusaka-Bulawayo routes, which President Mnangagwa said would be a welcome development.\n\nIn this regard, I wish that the Ministers of Tourism of Zimbabwe and Uganda should begin the process to revive collaboration in this sector, which is now long overdue, he said.\n\nPresident Mnangagwa said Harare and Kampala continued to enjoy warm relations dating back to Zimbabwes protracted liberation struggle.\n\nI wish my dear brother to acknowledge the cordial relations which do exist between Zimbabwe and Uganda, which date back to Zimbabwes liberation struggle and the high-level visits that have taken place between the two countries since the advent of the Second Republic, as testimony of these warm relations between us.\n\nPresident Mnangagwa is welcomed by Vice Presidents Dr Constantino Chiwenga (right) andKembo Mohadi (centre) at Robert Gabriel Mugabe International Airport in Harare yesterday on arrival from the 11th Session of the African Regional Forum on Sustainable Development in Kampala, Uganda.  Picture: Edward Zvemisha.\n\nI want to recall the State visit to Zimbabwe by Your Excellency President Museveni, during which you officially opened the Zimbabwe International Trade Fair in 2019.\n\nMay I renew the Government of Zimbabwes readiness to continue working closely with Uganda at the bilateral, regional, continental and international levels to advance our common aspirations as African countries, said the President.\n\nEfforts, he said, were underway for the convening of the long overdue Zimbabwe-Uganda Joint Permanent Commission on Cooperation.\n\nPlans for a seminar to be convened by the two countries this August are also afoot.\n\nI also wish to note that various cooperation agreements have been signed between our two countries and emphasise the need to fully implement these agreements and work closely together to develop and grow our economies with a view to improve the livelihoods of our respective peoples. Efforts are being made to convene the inaugural session of the long overdue Zimbabwe-Uganda Joint Permanent Commission on Cooperation, said President Mnangagwa.\n\nHe said it was important for the two countries to take advantage of the AfricanContinental Free Trade Area.\n\nPresident Mnangagwa asked for Kampalas support in Zimbabwes bid for a United Nations Security Council (UNSC) non-permanent seat.\n\nRussia, India, Cuba and countries in the SADC region have already thrown their weight behind Zimbabwes bid.\n\nI wish to request, my dear brother, Ugandas support in Zimbabwes bid for a non-permanent seat on the United Nations Security Council for the 2027-2028 period, President Mnangagwa said.\n\nHe expressed Zimbabwes appreciation for the support rendered by Uganda in calling for the unequivocal removal of sanctions imposed by the United States.\n\nI wish, my dear brother, to appreciate your relentless support for the removal of the illegal sanctions imposed on Zimbabwe by the Western countries. We thank you for that stance.\n\nThe President wished Uganda peaceful general elections in January next year.\n\nI am informed that you are likely to have an election in January 2026. I wish you, President Museveni, a peaceful election. And I further wish to thank President Museveni for spreading the quest for regional peace and stability in the Great Lakes region and for his role as the East African Community appointed mediator for Inter-Burundi dialogue as well as his lead role in the establishment of the East African Political Federation, he said.\n\nPresident Mnangagwa returned home yesterday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Presidents-Mnangagwa-and-Museveni-680x380.jpg",
            "description": "Wallace Ruzvidzo in KAMPALA, Uganda ZIMBABWE and Uganda should revive collaboration in the tourism sector through establishing direct flights to tourist resorts like Victoria Falls, President Mnangagwa has said. To that end, the President called upon both countries’ Tourism ministers to act swiftly and restore collaboration in the critical tourism sector. President Mnangagwa and his Ugandan […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "White former farmers start receiving compensation",
            "url": "https://www.herald.co.zw/white-former-farmers-start-receiving-compensation/",
            "content": "Martin Kadzere-Senior Business Reporter\n\nZIMBABWE has started compensating white former commercial farmers whose land was acquired under the Land Reform Programme, marking a significant milestone towards resolving this long-standing issue and further opening pathways for the countrys arrears clearance and debt resolution.\n\nFinance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube announced that the Government had issued US$307.9 million in Treasury bonds and disbursed US$3.1 million in cash to 378 farmers.\n\nThe cash payment represents one percent of the US$311 million allocated for the first payment batch.\n\nTo date, the Land Compensation Committee has approved a total of 740 claims. The balance will be paid through a 10-year US dollar-denominated bond, Prof Ncube said.\n\nThe payment aligns with the revised Global Compensation Deed (GCD), an agreement between the Government and white former commercial farmers to pay US$3.5 billion in compensation for improvements made on the farms compulsorily acquired under the land reform programme.\n\nThis development follows the Governments commencement in February of compensating investors whose farms  protected by Bilateral Investment Promotion and Protection Agreements (BIPPAs) and ratified before the 2000 land reform  were repossessed.\n\nAccording to the Constitution, BIPPA farmers will be compensated for both land and improvements, while those who lost land through the fast-track land reform programme will be compensated for improvements only.\n\nOne of our commitments as we try to reform the Zimbabwe economy, to clear our arrears, is really to compensate the former farm owners who lost their farms during . . . the land reform programme, said Prof Ncube.\n\nWe have now begun to honour that agreement.\n\nThe bonds offer a fixed annual coupon rate of 2 percent to the holders and incorporates several key features designed to make them attractive and beneficial for the former farm owners.\n\nAll payments associated with the bonds, including the annual coupon payments, are entirely exempt from taxation. This is a significant advantage, particularly for elderly recipients, as it ensures the compensation is not reduced by tax liabilities.\n\nThe bonds are also designed for easy trading, with the Government intending to engage the Victoria Falls StockExchange to list them.\n\nThis will provide farmers with the flexibility to sell their bond holdings in the market if they require immediate access to funds before the 10-year maturity, Prof Ncube said.\n\nFurthermore, the bonds are recognised as liquid assets, signifying their immediate value and near-cash equivalence.\n\nThe bonds have been granted prescribed asset status, making them appealing to institutional investors like pension funds, potentially increasing demand and supporting their value and tradability.\n\nUnder the original 2020 GCD agreement, the farmers were scheduled to receive half of the US$3.5 billion compensation within the first year, followed by four annual instalments of US$437.5 million.\n\nHowever, facing challenges in raising the necessary funds, the Government re-engaged the farmers, leading to the revised compensation plan now being implemented.\n\nCompensation steering committee chairperson Mr Andrew Pascoe confirmed in an interview with The Herald yesterday that the initial payment was made about two weeks ago.\n\nMr Pascoe expressed confidence that more former landowners who were dissatisfied with the revised payment plan will now begin to apply for compensation.\n\nAs the word (about payment) goes out there, we expect the numbers (of applications) to also increase, said Mr Pascoe.\n\nLast year, the Government approved US$145 million in compensation claims for 94 BIPPA beneficiaries and started making disbursements early this year. The majority of these claims originated from the Netherlands (46), followed by Switzerland (27), Germany (14), Denmark (6), and Yugoslavia (1).\n\nA total of US$20 million has been paid so far.\n\nFarmer compensation is a key reform under Zimbabwes Structured Dialogue Platform for Arrears Clearance and Debt Resolution.\n\nEstablished in December 2022, the platform facilitates engagement with creditors and development partners, focusing on reforms across economic growth and stability, governance and land tenure, including farm owner compensation and BIPPAs.\n\nOutgoing African Development Bank (AfDB) president Dr Akinwumi Adesina was appointed to champion the dialogue, with former Mozambican President Joaquim Chissano serving as facilitator.\n\nThe payments will continue. We are very serious about this. By settling our arrears, we can tap into long-term capital which is essential for infrastructure development and other significant investments, said Prof Ncube.\n\nThis is not just crucial for the Zimbabwean Government; it also impacts our private sector, which faces restrictions from creditors due to these arrears. Lifting these caps will facilitate access to foreign capital, making it easier to obtain financing to support our industries and create meaningful jobs for our citizens.\n\nDeputy Chief Secretary in the Office of the President and Cabinet, Mr Willard Manungo, who is also the Co-Chair of the Sector Working Group on Land Tenure Reforms and Compensation, said the payment was a demonstration of the Governments commitment to the countrys reform agenda.\n\nThese positive developments present Zimbabwe with a strong opportunity to successfully negotiate its arrears clearance and outstanding debt obligations. It is also a boost towards the countrys re-engagement efforts with the international community, said Mr Manungo.\n\nThe United Nations Development Programme (UNDP) resident representative to Zimbabwe, Dr Ayodele Odusola, commended the progress being made under the BIPPA settlements, the Land Tenure Reforms, the Compensation frameworks, and the initial disbursements under the GCD.\n\nThese steps are vital for restoring trust, advancing reconciliation, and rebuilding Zimbabwes agricultural sector. We remain committed to supporting a transparent, inclusive, and sustainable process that contributes to economic recovery and re-engagement, said Dr Odusola.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/07/Prof-Mthuli-Ncube.jpg",
            "description": "Martin Kadzere-Senior Business Reporter ZIMBABWE has started compensating white former commercial farmers whose land was acquired under the Land Reform Programme, marking a significant milestone towards resolving this long-standing issue and further opening pathways for the country’s arrears clearance and debt resolution. Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube announced that the […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Independence Flame lit . . . as Uhuru preps hit top gear",
            "url": "https://www.herald.co.zw/independence-flame-lit-as-uhuru-preps-hit-top-gear/",
            "content": "Richard Muponde-Zimpapers Politics Hub\n\nThe Independence Flame was officially lit yesterday and has been transported to the Midlands Province for the launch of Independence Day celebrations.\n\nThe lighting ceremony took place at the Museum of Human Sciences in Harare, presided over by Mr Lovemore Mandima, the regional manager for the National Museums and Monuments of Zimbabwe (NMMZ) in the southern region.\n\nHe said today, Vice President Dr Constantino Chiwenga will officiate at the flames official presentation to the Midlands Province, marking the official commencement of preparations for Independence Day on April 18.\n\nThe main celebrations will be held in Gokwe under the theme Zim@45: Devolve and Develop Together towards Vision 2030.\n\nIn an interview on the sidelines of the lighting ceremony, Mr Mandima said:So, today (yesterday), the independence flame is moving from the capital city of Zimbabwe to the Midlands Province, where the launch of the 2025 independence commemorations shall be done tomorrow (today) by Vice President, Dr Constantino Chiwenga, at the historic Mutapa Hall.\n\nThe flame was transported to the Midlands aboard a roadshow truck, accompanied by an escort convoy from NMMZ and the police.\n\nFrom tomorrow, it will be paraded in several places in the Midlands Province, before it lands in Gokwe for the main commemorations on April 18.\n\nAfter the launch on the 10th of April tomorrow (today), the independence flame team shall then move around the whole Midlands Province. The first port of call shall be Mberengwa District at Mberengwa Centre. From there, on the same day, Friday the 11th, the flame shall move to Zvishavane town, said Mr Mandima.\n\nSo, after Zvishavane on the 12th, the flame shall move to Shurugwi District, and people shall gather at Chachacha Business Centre. From there, the flame shall move to Kwekwe District via Gweru District and in Kwekwe, people shall gather in Mbizo high-density on April 13.\n\nFrom Mbizo, the flame team shall move to Gokwe Centre, which is in Gokwe South on April 14. After Gokwe South, the team shall head to Gokwe North, to Chitekete, to Chireya (April 15), and Nembudziya (April 16). From Nembudziya, the team shall go down to Gokwe South, to Sikhombela detention camp, he said.\n\nMr Mandima said on April 17 the flame will be relit at Sikhombela and then head to the venue of the Independence Day commemorations in Mutora village in Gokwe Nembudziya.\n\nAt Sikhombela detention camp, the flame shall be relit by the Vice President, Cde Kembo Mohadi, onApril 17, and then from there, head northwards to where the main event shall be held on the 18th, to be officiated by the President of the Republic of Zimbabwe, His Excellency Dr E.D Mnangagwa on the 18th, Mr Mandima said.\n\nIn a statement earlier this week, the Ministry of Home Affairs and Cultural Heritage said the Zimbabwe Independence Flame is an enduring symbol of the countrys struggle for freedom and its commitment to building a better future for all its citizens.\n\nThe Ministry added:\n\nAs the flame continues to blaze brightly, it serves as a reminder of the sacrifices made by those who fought for our Independence and as a beacon of hope for generations to come.\n\nAdditionally, it represents the spirit of love, sacrifice, determination and collective unity and gallantry. All Zimbabweans along the route are encouraged to come and witness the process in memory and celebration of our heroes and heroines.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Independence-flame-680x380.jpg",
            "description": "Richard Muponde-Zimpapers Politics Hub The Independence Flame was officially lit yesterday and has been transported to the Midlands Province for the launch of Independence Day celebrations. The lighting ceremony took place at the Museum of Human Sciences in Harare, presided over by Mr Lovemore Mandima, the regional manager for the National Museums and Monuments of […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Zim calls for regional unity in energy solutions",
            "url": "https://www.herald.co.zw/zim-calls-for-regional-unity-in-energy-solutions/",
            "content": "Mukudzei Chingwere in VICTORIA FALLS\n\nSOUTHERN Africa member states are facing the same energy generation and distribution challenges, hence the need for a coordinated regional approach to overcome the problem that has the potential to curtail regional economic development, Vice President Dr Constantino Chiwenga has said.\n\nVP Chiwenga said this here yesterday when he stood in for President Mnangagwa for the official opening of the sixth International Renewable Energy Conference and Expo, which ran under the theme, Sustainable Energy Investments for a Better Future.\n\nThe Vice President also launched a comprehensive national energy policy that is now the guiding principle towards a reliable and efficient energy bank for a prosperous upper-middle income economy as envisioned by President Mnangagwa.\n\nCentral to the launched policy is the quest to drive towards a diversified energy mix, exploring solutions such as gas-to-power projects from the Muzarabani gas reserves and investigating the potential of nuclear energy.\n\nAs a region, Southern Africa faces common energy challenges, but we also share an opportunity for collective action, said VP Chiwenga.\n\nBy pooling resources and enhancing cross-border energy trading, we can enhance regional energy security, reduce costs and leverage our collective strengths.\n\nOne example of such co-operation is the Southern African Power Pool (SAPP), which facilitates electricity trading across member states.\n\nHe said efforts are underway to interconnect the SAPP with the East African Power Pool, creating new avenues for regional collaboration in energy supply and distribution.\n\nThe Government of Zimbabwe is exploring a range of energy solutions to diversify our energy mix, VP Chiwenga said.\n\nHe also reaffirmed Zimbabwes dedication to achieving ambitious targets for renewable and cleaner energy capacity and efficiency by 2030.\n\nThe energy policy launched yesterday will be the guiding principle towards efficient and reliable energy supply. Zimbabwe, for its part, is accelerating towards an empowered upper-middle income economy by 2030, and energy plays a central role in this development trajectory that is already underway.\n\nI am proud to announce the launch of Zimbabwes Energy Efficiency Policy during this conference, said VP Chiwenga.\n\nThis policy aims to optimise the use of existing energy resources, reduce waste and promote sustainable practices across the economy.\n\nFurthermore, private sector-driven projects, such as Captive Power Plants, are already underway and are expected to significantly reduce load shedding in the near future, contributing to a more reliable energy supply for all Zimbabweans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/e783ba54-409e-443f-a7a1-2a2cb4022b7a-680x380.jpg",
            "description": "Mukudzei Chingwere in VICTORIA FALLS SOUTHERN Africa member states are facing the same energy generation and distribution challenges, hence the need for a coordinated regional approach to overcome the problem that has the potential to curtail regional economic development, Vice President Dr Constantino Chiwenga has said. VP Chiwenga said this here yesterday when he stood […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Boost for Mat’land as investor courts VP Mohadi",
            "url": "https://www.herald.co.zw/boost-for-matland-as-investor-courts-vp-mohadi/",
            "content": "Robin Muchetu\n\nVICE President Kembo Mohadi yesterday met with a delegation of investors in Bulawayo to discuss investment opportunities in the Matabeleland region.\n\nDuring his engagement, he stated that the Government was committed to enhancing the ease of doing and will look into the proposals tabled, which are set to bring significant development.\n\nThe investor delegation from MAEC 87 International is keen to unlock more opportunities through a loan and a grant, which will see the three provinces of Matabeleland, Bulawayo, Matabeleland North and South directly benefiting with the rest of the country reaping spin-offs from the venture once approved.\n\nEmerging from the closed-door meeting with the investors, VP Mohadi, without delving much into the details, gave a brief of their private discussions.\n\nWe had an engagement with investors that are interested in funding the development of the corridor, the Trans Limpopo Corridor from Beitbridge up to Victoria Falls hence we had the three Ministers of State for Matabeleland South, Minister of State for Bulawayo Metropolitan and the Minister of State as represent for Matabeleland North, said VP Mohadi.\n\nWe deliberated on that. They (investors) have a fund that they think they can advance to us. But there are certain technicalities that we have discovered of how we would have wanted it done.\n\nAs the Second Republic focuses on transforming the economy towards Vision 2030, the Trans-Limpopo Spatial Development Corridor, a development initiative that is aimed at unlocking economic potential between Zimbabwe and South Africa, is one of the prime areas of interest.\n\nIt also seeks to ensure that the two countries engage and deliberate to improve the livelihoods of people positively.\n\nVP Mohadi highlighted that the investment opportunities will further be analysed before a decision to bring them on board is made.\n\nSo, we have adjourned and we have said to the Reserve Bank Governor and the funders themselves, the people advancing the loan, go and sit down and come and give us a position tomorrow (today) as to which is the legal or the right way to do this, he said.\n\nThe investors pitched their proposals including funding modalities before the VP, Ministers of State for the three provinces where development will take place, the Reserve Bank of Zimbabwe representative and other key representatives to this initiative.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/VP-Mohadi-680x380.jpg",
            "description": "Robin Muchetu VICE President Kembo Mohadi yesterday met with a delegation of investors in Bulawayo to discuss investment opportunities in the Matabeleland region. During his engagement, he stated that the Government was committed to enhancing the ease of doing and will look into the proposals tabled, which are set to bring significant development. The investor […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Mbare Traders’ Market commissioning tomorrow",
            "url": "https://www.herald.co.zw/mbare-traders-market-commissioning-tomorrow/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nAll eyes are on the newly-built Mbare Musika Market, which is set to be commissioned by President Mnangagwa tomorrow, setting a benchmark for modern and affordable trading in Harare.\n\nPurposefully designed from the ground up, this state-of-the-art facility offers a clean, secure and well organised space that meets the needs of todays vendors and customers.\n\nBuilt with functionality at its core, the market is anchored by a sustainable water supply, delivering 120 000 litres daily through drilled boreholes.\n\nThis ensures fully serviced public toilets, a washing bay for all products and daily cleaning routines that promote hygiene and safety.\n\nAffordability is matched with thoughtful design, with new affordable prices set to be announced on the day of commissioning, contrary to baseless reports suggesting that it would be beyond the reach of many.\n\nThe market features a professional waste management system, full CCTV coverage, secure parking and physical security to protect both traders and buyers.\n\nA standout feature is the on-site micro-lending facility, which provides access to capital for small-scale traders, empowering them to grow within a structured and supportive environment.\n\nVetted helpers are also on hand to assist clients with their goods, adding ease and trust to the shopping experience.\n\nMbare Retail Market Traders Association chairperson, Mr Erasmus Fofo, said they had engaged in meetings with relevant authorities to discuss the fees, which will be gazetted.\n\nThis comes after space barons have been trying to hijack the project to line their pockets, but they have been stopped in their tracks.\n\nMr Fofo declined to pre-empt the discussions.\n\nSpeaking after touring the facility on Monday, Local Government and Public Works Minister, Daniel Garwe, said all was set for the opening.\n\nOn Friday, His Excellency is coming to commission this beautiful traders market and also break the ground on the main market at the old traders site, he said.\n\nModern, secure, and built for economic inclusion, the new Mbare Musika Market redefines what a people focused trading space can be.\n\nIn November last year, President Mnangagwa declared a state of disaster in Mbare following an inferno that destroyed stalls and goods, directing that the area be modernised within the shortest possible time.\n\nWith urban renewal and regeneration close to his heart, the rejuvenation of Mbare was undertaken as a prototype to be replicated nationwide.\n\nZimbabwe Stock Exchange-listed firm Masimba Holdings, the main contractor for the Mbare Traders Market, is leading the renewal programme and is also expected to construct the main market.\n\nThe new Mbare Traders Market stands as a testament to President Mnangagwas vision of transforming Zimbabwe into an upper-middle-income economy by 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Reconstruction-of-the-main-road-leading-to-the-newly-built-Traders’-Market-in-Mbare-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter All eyes are on the newly-built Mbare Musika Market, which is set to be commissioned by President Mnangagwa tomorrow, setting a benchmark for modern and affordable trading in Harare. Purposefully designed from the ground up, this state-of-the-art facility offers a clean, secure and well organised space that meets the needs of today’s […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Govt improves major infrastructure, housing and social projects",
            "url": "https://www.herald.co.zw/govt-improves-major-infrastructure-housing-and-social-projects/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nIN just the first 50 days of this years 100-day cycle, the Second Republic has made remarkable strides in transforming communities nationwide through accelerated infrastructure, housing and social welfare projects under the National Development Strategy 1.\n\nThese developments reflect steady progress in the Governments mission to modernise infrastructure, expand housing and improve service delivery in line with Vision 2030.\n\nAddressing a post-Cabinet media briefing in Harare on Tuesday, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said under the Infrastructure Development Thematic Area, the Ministry of Public Service, Labour and Social Welfare had spearheaded a series of transformative works.\n\nRehabilitation of Dzivarasekwa Pumpstation, pumping/gravity mains and treated water reservoir repairs in Harare Metropolitan Province has been finalised. Disposal of 94 Glaudina and 12 Borrowdale residential stands in Harare is ongoing.\n\nFinal finishings and external works for the Glaudina Flats Project (Phase 1) are almost complete, with commissioning expected by the end of May 2025. Preparations for servicing 616 residential stands in Runyararo, Masvingo Province have been completed, he said.\n\nDr Muswere said site works for servicing 124 residential stands under the Mathendele Project in Plumtree, Matabeleland South Province had begun, while construction of Zvishavane Mixed Accommodation (Phase 2) in the Midlands Province was progressing well, with 156 residential units ready for commissioning.\n\nThe Zim Hydro-Power Project at Lake Mutirikwi in Masvingo Province has been completed and awaits commissioning. Civil works have been completed at Rupurara Valley Lodge, which also awaits commissioning.\n\nWork on the Tokwe-Mukosi Hydro-Power Project in Masvingo is ongoing, as is the construction of the Marondera Commercial Centre Warehouse in Mashonaland East and the New Glovers Solar Project at Munyati in Midlands Province, he said.\n\nDr Muswere said brickwork and column construction for Madokero Creek Phase 2 housing was underway, while paving works at ARLAC Dricway and parking bays in Harare Metropolitan Province were almost complete.\n\nRefurbishment of the childrens dormitory and administration block at Hupenyu Hutsva Residential Care Facility is also nearing completion, he said.\n\nOn the Social Protection Thematic Area, Dr Muswere reported good progress on two community initiatives, the potato production project at Khayelihle Childrens Village in Umguza, Matabeleland South, and the rabbit production project in Shamva, Mashonaland Central.\n\nDr Muswere said under the Infrastructure and Utilities Pillar, the Minister of Transport and Infrastructural Development, Felix Mhona, had also recorded significant milestones.\n\nConstruction of the Trabablas Interchange has exceeded its cycle target and is ongoing, with two bridges on Amalinda Road and the Harare Drive missing link completed and opened to traffic.\n\nUpgrading of the Harare-Masvingo-Beitbridge Road and the Harare-Kanyemba Road is ongoing. Construction of the Traffic Safety Council of Zimbabwe offices in Masvingo is on target, he said.\n\nDr Muswere said the upgrading of the Chipinge-Mt Selinda Road and the Shurugwi-Mhandamambwe Road fencing project was underway.\n\nTurning to the Governance Pillar, Dr Muswere said the Ministry of Home Affairs and Cultural Heritage was also recording solid progress.\n\nInstallation of solar systems at 10 registry offices across seven provinces namely Harare Metropolitan, Mashonaland Central, Mashonaland East, Manicaland, Masvingo, Matabeleland North and Matabeleland South is ongoing.\n\nRevamping of telecommunications systems at 50 police stations is 90 percent complete, while deployment of the online border management system at all borders and airports, as well as basic automation of 23 police stations, is ongoing.\n\nDr Muswere also outlined progress under the Youth, Sports and Culture Pillar, including the digitisation of delineation reports in Mwenezi and Chiredzi Districts in Masvingo Province.\n\nConstruction of the Hebert Chitepo Trust Training Centre workshop at Bonda Mission in Mutasa District, Manicaland, and the Sikombela Monument Development Project in Gokwe North, Midlands, are both progressing well, he said.\n\nDr Muswere said under the Infrastructure and Utilities Pillar, the renovation of Mswenhede Clinic and construction of a semi-detached staff house in the Mswenhede area of Mazowe District, Mashonaland Central, were nearing completion.\n\nHe said construction of a classroom block at Kundayi High School in Concession, also in Mazowe District, is ongoing.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-Muswere-2-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter IN just the first 50 days of this year’s 100-day cycle, the Second Republic has made remarkable strides in transforming communities nationwide through accelerated infrastructure, housing and social welfare projects under the National Development Strategy 1. These developments reflect steady progress in the Government’s mission to modernise infrastructure, expand housing and improve […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Govt, Zanu PF teams  assess Independence preps",
            "url": "https://www.herald.co.zw/govt-zanu-pf-teams-assess-independence-preps/",
            "content": "Africa Moyo and Patrick Chitumba\n\nSENIOR Government officials, ZANU PF Politburo members and ruling party directors yesterday descended on Nembudziya in Gokwe North District, where the main Independence Day national celebrations will be held, to assess progress made in preparing for the event.\n\nThis years Independence celebrations are running under the theme: Zim@45: Devolve and develop together towards Vision 2030.\n\nThe Midlands province is working to bring together about 100 000 people to the main venue on April 18 for the 45th independence anniversary.\n\nFrom the ZANU PF side, high profile officials in attendance were Cde Simbarashe Mumbengegwi, Cde Supa Mandiwanzira, and National Political Commissioner Cde Munyaradzi Machacha.\n\nGovernment officials were led by Deputy Chief Secretary Finance, Administration and Human Resources Mr Zvinechimwe Churu, Minister of Primary and Secondary Education Torerayi Moyo, Minister of Local Government and Public Works Daniel Garwe, Minister of State for Midlands Provincial Affairs and Devolution Owen Ncube and Deputy Minister of Health and Child Care Sleiman Kwidini.\n\nGiving an overview of progress ahead of next Fridays Independence Day national celebrations, Mr Edgars Seenza, the Provincial Affairs and Devolution Permanent Secretary for Midlands said several key construction and renovation activities across multiple sites, including the main arena at Gokwe North Open Grounds, gala site at Nembudziya High School, and the Childrens Party venue at Nyamuroro High School had been done.\n\nKey milestones at the open grounds include the completion of the football pitch, terraces, and the construction of ablution facilities, classrooms, and changing rooms.\n\nMr Seenza said overall progress was satisfactory with lawn planting now 100 percent complete on the football pitch where the main event will be held. Top-soiling and levelling of bumpy areas on the pitch is in progress.\n\nOutstanding works include ground marking and installation of dugouts and goal posts.\n\nAt the changing rooms, roofing was complete while internal and external plastering was 90 percent complete. The first external coat of paint has been applied.\n\nDoor and window frame fixing, electrical reticulation (first fix), and sewer line laying to the septic tank are also 100 percent complete, he said.\n\nOn ablution facilities, Mr Seenza said roofing and electrical reticulation was complete for all six facilities. Sewer lines to the septic tank were 100 percent complete for ablution facilities 1, 2 and 6 while sewer lines from the ablutions to the mainline were 100 percent complete for ablution facilities 3, 4, and 5.\n\nExternal plastering was 10 percent complete for ablution facilities while roofing is 80 percent complete.\n\nBrickwork and concreting for the four terraces was 100 percent complete, with outstanding works being plastering and installation of about 250 bucket seats that have already been supplied.\n\nMr Seenza said perimeter fencing installation was 90 percent complete.\n\nAt the gala site at Nembudziya High School, ablution block roofing was 100 percent complete while internal plastering was 50 percent complete, and laying of sewer lines from the ablution block to the septic tank was 100 percent complete.\n\nRoofing, external plastering, and the first external paint coat of the two classroom blocks was complete.\n\nAt the administration block, roofing was 85 percent complete, while truss installation is in progress and strong room steel fixing was 90 percent complete.\n\nMr Seenza said at the Childrens Party venue at Nyamuroro High School, construction was at an advanced stage.\n\nAt Nyamuroro Vocational Training Centre, Mr Seenza said construction of the female hostel was complete.\n\nAt Gokwe North District Hospital there is a new mortuary that is under construction, with progress also satisfactory.\n\nBoth the Zanu PF and Government delegations were happy with the progress and were optimistic that come April 18, the people will have celebrations to remember.\n\nAs Independence Day draws closer, provinces have since selected their child delegates to attend the Childrens Party on April 17 at Nyamuroro High School, and the main Independence celebrations at Nembudziya on the following day.\n\nJust over 3 000 child delegates are expected to attend the Childrens Party.\n\nArrival of child delegates from the provinces starts next Tuesday.\n\nThe decentralisation of Independence Day celebrations, introduced by the Second Republic led by President Mnangagwa, has been welcomed by the people as it leaves legacy infrastructure development in host provinces.\n\nBulawayo provinces was the first to host the devolved Independence Day commemorations in 2022, followed by Mashonaland Central in 2023 and Manicaland last year.\n\nAll the rural provinces benefited significantly from infrastructure development.\n\nApart from the construction of classroom blocks and roads in Nembudziya, 74 village, vocational training centre and school business units are being put in place and are set to be completed in time for the 45th Independence celebrations.\n\nThe development will also leave at least 7 400 households with clean and safe water as the business units come with communal water points.\n\nThe village and school business units are being established under the ongoing Presidential Rural Development Programme, which seeks to radically improve rural livelihoods and transform rural communities into active economic participants.\n\nAs of Tuesday, 28 business units had been completed while work on the remaining 46 is in progress.\n\nBeneficiaries include: Nyamuroro Secondary in Nembudziya, Nyamuroro Primary School, Nyamuroro Vocational Training Centre, Tafara Primary School in Gumunyu, Dukaupfu Secondary in Ward 13 Nembudziya, Tongogara Primary School in Ward 24, Gura Primary School in Ward 6 Chireya, Nembudziya Government High School, Chaminuka Primary School in Ward 20 Gumunyu, Rugare Primary School in Ward 18 Gumunyu, Nyamuponda Primary School in Ward 12 Nembudziya, Mhumha Secondary School in Ward 13 Nembudziya, Buno Primary School in Ward 36 Nembudziya, Kuedza Primary School in Ward 26, and Rubatsiro Clinic.\n\nVillages where the establishment of village business units is now at an advanced stage include Nyika 2 (Ward 16, Gumunyu), Mabika (Ward 17, Gumunyu), Murota (Ward 10, Chireya), Tafirei (Ward 9, Chireya), Chiwa (Ward 4, Chireya), Dambamazura (Ward 7, Chireya), Hwadze 9A (Ward 20, Gumunyu), Mudavanhu (Ward 13, Nembudziya), Masutu (Ward 11, Nembudziya), Chimera (Ward 29, Kabuyuni) Madongwe (Ward 28, Kabuyuni) and Mukomboni (Ward 36, Nembudziya), among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Preparations-for-this-year’s-national-Independence-celebrations-going-on-well-at-the-venue-in-Gokwe--680x380.jpg",
            "description": "Africa Moyo and Patrick Chitumba SENIOR Government officials, ZANU PF Politburo members and ruling party directors yesterday descended on Nembudziya in Gokwe North District, where the main Independence Day national celebrations will be held, to assess progress made in preparing for the event. This year’s Independence celebrations are running under the theme: “Zim@45: Devolve and […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        },
        {
            "title": "Editorial Comment: Internet access critical to national development",
            "url": "https://www.herald.co.zw/editorial-comment-internet-access-critical-to-national-development/",
            "content": "THE major remaining gaps contributing to the rural-urban divide are electricity and affordable internet access along with provision of safe available water supplies.\n\nSo there is little surprise that President Mnangagwa has led his Second Republic Government to fill these gaps and end the divide that tends to keep too many rural people with lower quality of life, despite the successful education and health initiatives that have largely filled other gaps.\n\nSo we have the Presidential Borehole Programme that is steadily drilling boreholes in every district until every village and every school has its own borehole and decent water supply. We have the Presidential Solar Electricity Programme, designed to ensure that every household has at least basic electricity supply for essentials from solar power if a grid connection is not possible.\n\nAnd now we have the Presidential Internet Programme approved by Cabinet this week to provide high-speed and broadband internet connection to every one of the 2 400 administrative wards across Zimbabwe.\n\nThese programmes have also been filling urban gaps, such as the urban boreholes, and the internet programme will work with all schools, but since services are so much easier to roll out in urban areas it will be the rural areas that will see the most dramatic progress.\n\nThe expansion of the mobile phone networks has largely ensured that a degree of internet access is available almost everywhere in Zimbabwe to everyone who has a smartphone, even a basic smartphone, and there is such a phone in the vast majority of households.\n\nBut the phone internet services are limited and data is sold at high prices, far higher than cable or satellite access and far higher than most people can afford, especially when they need broadband connections.\n\nThere are technical reasons why data is pricey on pure wireless telephone circuits, although the continual upgrade of the technology should reduce costs as the equipment on a tower can handle far wider bandwidths and quantities of data. The Government is already working to get the providers to be justifying costs and to be lowering data charges. But there will still remain inherent technical limits that require alternatives.\n\nThe point is that we need fuller and more affordable services when we want to use internet access to upgrade education, to provide clinics and hospitals with better access to expertise, to ensure businesses are fully linked, to make sure our development ministries can tie in their thousands of staff, and to give ordinary Zimbabweans access through some sort of community centre. This is what is behind the new Presidential programme which will use both terrestrial fibre optic cable connections, always the best and cheapest where there is cable, and low-orbit satellite connections where cable cannot be provided to ensure the critical centres across the communities are connected.\n\nThese are the schools and clinics, the business centres, the administrative offices and police stations, agricultural extension offices, courts, district development coordinators offices, vocational training centres and other obvious points. There is already a policy to set up community information centres across the country, and these will now be where ordinary people can come and access cheap or free broadband internet.\n\nFibre-optic cable is now available in most urban areas and can be extended easily to schools and other needed community centres that are not on the fibre grid. It should also be possible to extend fibre-optic cable into some rural areas, often having it ride piggyback on infrastructure that is already in place for cable phone and the electricity grid.\n\nBut that leaves a lot of places across rural Zimbabwe needing the other alternative, the low-orbit satellite networks. One such network is already licenced to operate in Zimbabwe and its competitors are catching up and will soon be able to offer similar services, with the competition helping to control prices.\n\nThe Ministry of Information Communication and Technology, Postal and Courier Services is following the dual strategy of getting the internet services to the desired community centres and on seeing how costs both at these centres and for the general public can be kept as low as possible.\n\nWe would hope that in many areas it will be possible to get a better density of community wifi centres by dual use. We would think that a community information centre could be opened next door to a connected school at very low cost, and could use the same connection, at least out of school hours. There will be other obvious ways of combining infrastructure.\n\nWe also note that the Presidential Internet Programme has to move along with the Presidential Solar Programme, since the schools and other centres need an electricity supply before a broadband internet connection. This makes much sense, so the developments will often come together in the more remote areas.\n\nTechnology is changing so fast in these digital fields that there may well be ways through innovative licencing and other systems to upgrade phone data while lowering its cost so we get the advantages of all systems. We can advance on a broad front.\n\nWithin a few years there should be no serious divisions between rural and urban areas when it comes to services, the divide being largely between those who farm for a living plus the service providers and processors within those communities, and those who work at jobs more conveniently done in urban areas.\n\nAlready housing standards have been converging as Government development programmes pump more cash into most rural households, and the devolution programme is making sure that rural people can get to health facilities nearer home and their children are within walking distance of schools.\n\nNow the trio of Presidential service programmes will over the next few years make sure that basic services reach all rural communities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Internet-680x380.jpg",
            "description": "THE major remaining gaps contributing to the rural-urban divide are electricity and affordable internet access along with provision of safe available water supplies. So there is little surprise that President Mnangagwa has led his Second Republic Government to fill these gaps and end the divide that tends to keep too many rural people with lower […]",
            "time": "08:29",
            "date": "10 Apr 2025"
        }
    ]
}