{
    "news": [
        {
            "title": "People Choice’ award for ANSA",
            "url": "https://www.herald.co.zw/people-choice-award-for-ansa/",
            "content": "Zimpapers Sports\n\nTHE Annual National Sports Awards (ANSA) are set to return after a five-year hiatus with the ceremony penciled for March 30 at the Cresta Lodge, Msasa.\n\nThis years awards will run under the theme Setting the gold standard and will see a slew of new additions and innovations aimed at making the ANSA a world class event.\n\nAmong these is the addition of a Peoples Choice award which is set to make its debut at this years edition and will feature 15 athletes from 12 local disciplines.\n\nThe nominees in this category include Zimbabwe Chevrons talisman Sikandar Raza, France-base basketball ace Vitalis Chikoko, Paige Van Der Westhuizen (swimming), Sasha Chimedza (tennis), Tapiwanashe Makarawu (athletics), Tapiwa Mafura (rugby), Benjamin Lock (tennis), Kellis Ndlovu (cricket), Isaac Mpofu (athletics), Scott Vincent (golf), Felistus Kwangwa (netball), Khama Billiat (football), Temba Gorimbo (Mixed Martial Arts), Chido Maenzanise (strong man), Kudakwashe Chiwandire (boxing).\n\nVoting for this award will be done primarily online.\n\nAs it pertains to the main awards, 10 categories are currently on the card and these include Junior Sportsman of the Year, Junior Sportswoman of the Year with a Disability, Junior Sportsman of the Year with a Disability, Sportswoman of the Year,\n\nSportsman of the Year, Sportsman of the Year with a Disability, Outstanding Professional Male Boxer, Outstanding professional female boxer, Coach of the Year, Technical Official of the Year and Team of the Year.\n\nThis is on top of the acknowledge awards and another addition in the form of media award for Sports Journalist of the Year (Print), Sports Journalist of the Year (Electronic) and Sports Media House of the Year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/sports.jpg",
            "description": "THE Annual National Sports Awards (ANSA) are set to return after a five-year hiatus with the ceremony penciled for March 30 at the Cresta Lodge, Msasa.",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "President honours Vapositori for ED",
            "url": "https://www.herald.co.zw/president-honours-vapositori-for-ed/",
            "content": "Herald Reporter\n\nPresident Mnangagwa has honoured the Apostolic Church with the Africa Inheritance Hall of Faith plaque for its commitment to spreading the word of God.\n\nThe plaque will be placed on the walls of the Africa Hall of Faith in Bethlehem, Palestine, the official birthplace of Jesus Christ.\n\nThe commemorative plaque was delivered to the national executive chairperson for Vapostori and MaZion for ED, Madzibaba Moses Gwasarira.\n\nMadzibaba Gwasarira is the first person to bring apostolic sect churches together in pursuit of religious patriotism and defending the gains of the liberation struggle.\n\nThe man of cloth said: The President has fulfilled his national philosophy of leave no one and no place behind, said Gwasarira\n\nNational spokesperson and secretary for information and publicity of Vapostori and MaZion for ED, Madzibaba Obey Mapuranga applauded the President for the gesture.\n\nVapostori and Zion leaders have been waiting for their leaders and efforts to be recognised and honoured in the statecraft of Zimbabwe.\n\nPresident Mnangagwa has shown greatness in successfully placing Zimbabwe at the centre of positive global conversation in opening new corridors for religious economics, democracy and peace.\n\nIt is a gesture of faith and brotherhood for Vapostori and MaZion for ED, said Mapuranga.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-4.jpg",
            "description": "President Mnangagwa has honoured the Apostolic Church with the Africa Inheritance Hall of Faith plaque for its commitment to spreading the word of God.",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "BOSSO SELECTION OPTIONS STILL LIMITED",
            "url": "https://www.herald.co.zw/bosso-selection-options-still-limited/",
            "content": "Sports Reporter\n\nHIGHLANDERS coach Kelvin Kaindu says selection options remain limited despite the transfer ban being lifted.\n\nThe ban affected the Premiership giants preparations for the 2025 season, with the team managing to assemble less than 20 players for each of their first two games.\n\nWe are (still) limited in terms of the number of players that are available for selection for Saturday game, said Kaindu.\n\nHe was addressing the media ahead of the Saturday away clash with Green fuel.\n\nCaptain Andrew Mbeba, who has been left out of the Warriors squad, remains upbeat.\n\nIts about team work and working hard maybe as a team, working with the other guys. That will make me go back to the national team, not as captain of Highlanders, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/02/bosso.jpg",
            "description": "HIGHLANDERS coach Kelvin Kaindu says selection options remain limited despite the transfer ban being lifted.",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "Youth empowerment catalyst for the attainment of Vision 2030",
            "url": "https://www.herald.co.zw/youth-empowerment-catalyst-for-the-attainment-of-vision-2030/",
            "content": "Diana Nherera\n\nThe Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Cde Charles Tawengwa has said youth empowerment is playing a critical role in achieving the aspirations of Vision 2030.\n\nSpeaking during a tour of Young Africa Zimbabwe in Chitungwiza this morning, Minister Tawengwa said youths are vital catalysts for development.\n\nWe aim to increase youth participation in decision-making and developmental processes from 3,3 percent in 2020 to 25 percent by 2030, he said.\n\nWe are implementing vocational training, entrepreneurship development and mentorship initiatives. We are reviewing our policies to make sure they are youth-friendly and supportive of youth development.\n\nWe are working tirelessly to achieve these initiatives because we believe that by empowering our youths, we unlock their full potential and create a brighter future for our nation, he said.\n\nAs we strive to become an upper middle-income society by 2030, we recognise that our youths are vital catalysts for this transformation.\n\nHe said the Government is committed to creating an enabling environment that fosters youth innovation, entrepreneurship and employment.\n\nThe general challenge now is to ensure that individuals make the most of emerging new opportunities in the exploitation of local raw materials and setting up new industries in line with Vision 2030, he said.\n\nMinister Tawengwa said programmes being offered at Young Africa Zimbabwe such as baking and catering, electronics, motor vehicle mechanics, panel beating and spray painting, cutting and designing are not only addressing youth unemployment but also promoting sustainable livelihoods, social empowerment and economic growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/09/charles-tavengwa.jpg",
            "description": "The Minister of State for Harare Metropolitan Provincial Affairs and Devolution, Cde Charles Tawengwa has said youth empowerment is playing a critical role in achieving the aspirations of Vision 2030.",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "War Veterans Fund ignites Guruve farmer’s hopes",
            "url": "https://www.herald.co.zw/war-veterans-fund-ignites-guruve-farmers-hopes/",
            "content": "Daniel Chigunwe\n\nHerald Correspondent\n\nBefore the Covid-19 pandemic, war veteran and farmer Cde Fellow Chivhenge was running a thriving strawberry project at his farm in Guruve.\n\nHe had a lucrative market for his produce around Mvurwi and Harare. At the peak of his business, Cde Chivhenge was supplying about 30kg of strawberries daily.\n\nHowever, the Covid-19 pandemic came by and like many other businesses; Cde Chivhenges strawberry enterprise was negatively affected.\n\nThe launch of the Presidential War Veteran Fund has reignited Cde Chivhenges drive to revive his strawberry enterprise.\n\nCde Chivhenge recently spoke to The Herald and could not hide his joy about the new empowerment initiative.\n\nBefore the pandemic, I was running a thriving horticulture business, supplying more than 30kg of strawberries daily. However, during the lockdown, we were driven out of business because strawberries are perishable, he said.\n\nI appreciate what the President has done for us as war veterans through the Presidential War Veterans Fund, the solar-powered boreholes, and the housing scheme.\n\nI am going to revive my strawberry business. In addition to selling raw strawberries, we are now going to make jam, juice and strawberry wine.\n\nWe plan to establish an operation focused on quality, sustainability, and local sourcing of raw materials. I am projecting to get 20 percent market share in local food stores.\n\nI also intend to train my fellow war veterans on strawberry farming. The crop requires irrigation water, which is doable since solar-powered boreholes will be made available for war veterans.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/559f8268-d3b6-4920-931c-6904a6c3c2bf-680x380.jpeg",
            "description": "Daniel Chigunwe Herald Correspondent Before the Covid-19 pandemic, war veteran and farmer Cde Fellow Chivhenge was running a thriving strawberry project at his farm in Guruve. He had a lucrative market for his produce around Mvurwi and Harare. At the peak of his business, Cde Chivhenge was supplying about 30kg of strawberries daily. However, the […]",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "Zimbabwe, India strengthen agric ties",
            "url": "https://www.herald.co.zw/zimbabwe-india-strengthen-agric-ties/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZimbabwe and India are deepening their agricultural collaboration through discussions focusing on mechanisation, climate resilience and trade opportunities.\n\nIndian Ambassador to Zimbabwe Bramha Kumar met Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka today to review ongoing projects and explore new avenues for cooperation.\n\nAmbassador Kumar commended Zimbabwes active participation in the Indian Economic and Technical Cooperation (ITEC) Programme, which provides over 250 fully funded scholarships to Government officials.\n\nHe said such programmes are strengthening bilateral ties and equipping Zimbabwean experts with critical skills.\n\nDr Masuka, in turn, praised Indias agricultural advancements and its successful push for the United Nations declaration of 2023 as the International Year of Millets.\n\nHe said millets could play a crucial role in boosting food security in Zimbabwe, particularly in arid and semi-arid regions.\n\nThe minister also said there is need for increased mechanisation in Zimbabwes agricultural sector and sought Indias support in this area.\n\nZimbabwe stands to benefit significantly from Indias experience in mechanisation and climate-resilient farming, Minister Masuka said.\n\nAmbassador Kumar reaffirmed Indias commitment to supporting Zimbabwes agricultural transformation.\n\nHe singled out the US$1 million climate-resilient agriculture project, delivered in 2023 through the India-UN Development Partnership Fund in Chiredzi and Mangwe.\n\nHe also encouraged Zimbabwe to expand its agro-exports to India, identifying it as a key market for Zimbabwean produce.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/b99d1300-dcfb-43ab-b5f3-7b9b04bd18cd-572x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent Zimbabwe and India are deepening their agricultural collaboration through discussions focusing on mechanisation, climate resilience and trade opportunities. Indian Ambassador to Zimbabwe Bramha Kumar met Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka today to review ongoing projects and explore new avenues for cooperation. Ambassador Kumar commended Zimbabwe’s […]",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "Youth empowerment key to Africa’s sustainable land governance and economic future",
            "url": "https://www.herald.co.zw/youth-empowerment-key-to-africas-sustainable-land-governance-and-economic-future-2/",
            "content": "Herald Correspondent\n\nYoung people are encouraged to actively engage in shaping Africas land governance and economic future as their involvement is vital for promoting sustainable development and equitable resource management.\n\nThis is in light of the increasing environmental and economic challenges facing the continent.\n\nAddressing journalists at the sidelines of the International Youth Summit on Land and Economic Freedom in Harare on Wednesday, Africa Youth Connect chairperson Cde Taurai Kundishaya said young people represent a vital demographic for addressing pressing environmental and economic challenges.\n\nHe said with a rapidly growing population, Africas youths are essential contributors to innovative solutions that can drive the continents growth.\n\nEngaging our youth in land governance is not just beneficial; it is imperative, Cde Kundishaya said.\n\nThey bring fresh perspectives and the energy needed to tackle issues like climate change and resource management.\n\nThe call for youth involvement comes at a time when many African nations are grappling with land disputes, food insecurity and economic instability.\n\nAs Africa faces significant challenges, the emphasis on youth involvement is gaining traction, with the hope that more young leaders will emerge to champion sustainable land governance and economic policies that benefit all citizens.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/w-680x380.jpg",
            "description": "Young people are encouraged to actively engage in shaping Africa’s land governance and economic future as their involvement is vital for promoting sustainable development and equitable resource management.",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "EMA lifts ban on Ran Mines operations",
            "url": "https://www.herald.co.zw/ema-lifts-ban-on-ran-mines-operations/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nThe Environmental Management Agency (EMA) has lifted the ban that suspended operations at Ran Mines due to cyanide contamination.\n\nThe ban was imposed after the Ran Mines slime dam burst on February 22.\n\nEMAs provincial education and publicity officer, Mr Maxwell Mupotsa said the mine has implemented pollution control measures.\n\nFollowing the mines efforts to prioritise community safety, we met the Civil Protection Unit and reviewed the order issued earlier, said Mr Mupotsa.\n\nThe mine is now using the old slime dam, which is situated quite a distance away from public areas.\n\nHe said recent tests have shown a reduced concentration of cyanide in the water sources around Chipadze Suburb.\n\nHowever, one borehole in Chipadze has been condemned due to cyanide contamination. Other boreholes are reportedly safe to use, with results indicating no cyanide presence.\n\nRan Mines manager, Mr Brienie Dzumbunu said they have decontaminated the affected areas in Chipadze.\n\nWe undertook the decontamination of the environment in collaboration with the EMA and other stakeholders. We have implemented several measures, including drainage systems, and enhanced the areas topography by reapplying gravel to improve the communitys safety, he said.\n\nThe ban had stalled our operations, but we resumed work last night. We will continue additional efforts to ensure safety.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-174-680x380.jpg",
            "description": "The Environmental Management Agency (EMA) has lifted the ban that suspended operations at Ran Mines due to cyanide contamination.",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "Harare dealer convicted in US$48k mobile toilets fraud",
            "url": "https://www.herald.co.zw/harare-dealer-convicted-in-us48k-mobile-toilets-fraud/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA Harare dealer, Tafadzwa Martin Munyawarara, has been convicted of defrauding an unsuspecting client of US$48 000 in a botched mobile toilets deal.\n\nThe magistrate, Ms Munashe Banda, said the State managed to prove a prima facie case against the accused person.\n\nThe State, led by prosecutors Tafara Chirambira and Takudzwa Jambawo, said the accused person misrepresented to the complainant, Mandy Mvukwe, that he could import mobile toilets for her.\n\nActing on this misrepresentation, the complainant gave US$48 000 to the accused.\n\nHowever, Munyawarara did not deliver the mobile toilets.\n\nIn convicting Munyawarara, the court indicated that he had admitted to receiving the funds and failing to account for them.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/convicted-word-red-frame-d-rendering-convicted-red-frame-130759894.jpeg",
            "description": "A Harare dealer, Tafadzwa Martin Munyawarara, has been convicted of defrauding an unsuspecting client of US$48 000 in a botched mobile toilets deal.",
            "time": "18:38",
            "date": "13 Mar 2025"
        },
        {
            "title": "Minor’s mother nails Madzibaba Joshua",
            "url": "https://www.herald.co.zw/minors-mother-nails-madzibaba-joshua/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nThe trial of a Glen View self-styled prophet, Marvelous Tunha popularly known as Madzibaba Joshua, who is facing charges of having sexual intercourse with a minor continued on Wednesday with the girls mother telling the court that he knew very well that she was still very young and going to school.\n\nThe minors mother told the court that the matter came to light when she discovered some intimate text messages of her communication with Tunha in her childs phone\n\nAt times he would ask my child how about school meaning he knew that he was having sexual intercourse with a minor, she said.\n\nDuring the previous sitting the 14-year-old girl told the court that she was in a relationship with Tunha, adding that they had been intimate twice.\n\nHowever, Tunha, the founder of St Joshua Apostolic Church, is denying the charges. According to the prosecutor, Ms Tariro Janhi, the complainant and her mother would regularly visit Tunhas shrine for spiritual healing.\n\nAt some point, Tunha reportedly asked for the minors cellphone number. The two began communicating via WhatsApp.\n\nIn October 2024, Tunha allegedly proposed love to the minor and she accepted. The court heard that later that month, Tunha arranged to meet the minor at Glen View 3 turn-off. He allegedly picked her up in a Toyota Quantum and drove to a Kuwadzana 2 lodge.\n\nThe two became intimate without protection. In November, Tunha made the same arrangement and had sex with the minor again.\n\nThe matter came to light in December when the minors mother went through her phone and discovered explicit messages she had exchanged with Tunha.\n\nThe mother took the minor to Matrix Disciplinary and Training Centre on December 22. She was interviewed by the operations manager, Mr Kudakwashe Katandika. During the interview, the minor detailed her sexual relationship with Tunha. A police report was made, leading to Tunhas arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "The trial of a Glen View self-styled prophet, Marvelous Tunha popularly known as Madzibaba Joshua, who is facing charges of having sexual intercourse with a minor continued on Wednesday with the girl's mother telling the court that he knew very well that she was still very young and going to school.",
            "time": "18:38",
            "date": "13 Mar 2025"
        }
    ]
}