{
    "news": [
        {
            "title": "Church key in driving modernisation: President",
            "url": "https://www.herald.co.zw/church-key-in-driving-modernisation-president/",
            "content": "Nqobile Bhebhe, Bulawayo Bureau\n\nPRESIDENT Mnangagwa has commended the church for its unwavering patriotism, acknowledging its crucial role in driving Zimbabwes rapid modernisation and infrastructure development.\n\nHe attributed this progress to the divine guidance of God and tireless efforts of the nations citizens, which have become the cornerstones of Zimbabwes ongoing advancement.\n\nZimbabwe, he said, was emerging as a leader in indigenous heritage-based development and encouraged citizens to embrace and promote initiatives and innovations that further the agenda of development, modernisation, and industrialisation.\n\nPresident Mnangagwa also stressed the importance of Zimbabweans supporting one another, both individually and collectively, as they work to advance the country.\n\nAdditionally, the Head of State noted that the church in Zimbabwe was rallying the nation towards progressive, Godly, and biblical patriotism, reminding congregants that Zimbabwe, which is God-given, was an exceedingly good land.\n\nRELATED STORIES\n\nDelivering his keynote address at the annual National Thanksgiving and Dedication Service in Bulawayo yesterday, the President said the Government always looked forward to such religious gatherings that united people to express gratitude to God for the many positive milestones surrounding the country.\n\nHe stated that the development initiatives and programmes for the upliftment and prosperity of the people had become the solid foundation upon which the country was built.\n\nPresident Mnangagwa is welcomed by Vice President Kembo Mohadi, Defence Minister Oppah Muchinguri-Kashiri, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere and Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Dr Anxious Masuka on his arrival at the National Thanksgiving and Dedication service at ZITF Grounds in Bulawayo yesterday\n\nThis years National Thanksgiving and Dedication Service, hosted by Inter-denominational churches, was held under the theme: Our Nation, Our Opportunity  celebrating the progress and acknowledging the potential for our country Zimbabwe.\n\nThe annual event has been conducted since 2017.\n\nThe service represents a collaborative initiative between the Faith for the Nation Campaign and the Zimbabwe Indigenous Interdenominational Council of Churches (ZIICC), providing an essential platform for believers to intercede for the continued blessings and prosperity of Zimbabwe, while acknowledging the significant role of faith in the nations advancement.\n\nPresident Mnangagwa told congregants from diverse denominations that, despite any circumstances, the church should not tire in praying and interceding for the country.\n\nNyika inonamatirwa, inotongwa, inovakwa nevene vayo/ ilizwe li-khu-le-ke-lwa, libuswe, lakhiwa ngabanikazi balo, he said amid cheers from the congregants.\n\nWe have confidence that, if we ask anything according to His will, He hears us, and that He shall grant our requests.\n\nThe service was also attended by Vice President Cde Kembo Mohadi, Defence Minister Oppah Muchinguri-Kashiri, Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka, Information, Publicity, and Broadcasting Services Minister Dr Jenfan Muswere and his deputy Dr Omphile Marupi, Minister of State for Provincial Affairs and Devolution Judith Ncube, several Government officials, traditional leaders, and captains of industry.\n\nPresident Mnangagwa presents a trophy to Agnes Sithole at the National Thanksgiving and Dedication Service at the Zimbabwe International Trade Fair Grounds in Bulawayo yesterday. Looking on are Zion Christian Church leader Bishop Nehemiah Mutendi and Lutheran Church Bishop Lazarus Khanye\n\nReflecting on the theme of the service, Our Nation  Our Opportunity: Celebrating the Progress, acknowledging the Potential of our Country Zimbabwe, he said it is both inspiring and energising.\n\nLooking back at the successes we have scored under the Second Republic, we are seeing the goodness of the Lord in our land of Zimbabwe. We are not in despair, and Almighty God has never abandoned us. Our nation is being renewed day by day towards Vision 2030. Communities are being transformed to be empowered and more prosperous.\n\nWe are leaving no one and no place behind. For these, and many other gifts, we thank Almighty God. Allow me to commend the remarkable contributions of Churches across all denominations in nation-building, said the President.\n\nQuoting extensively from the Bible, President Mnangagwa paid tribute to the church for its unwavering commitment to Zimbabwe. He said the Government appreciates the individual and collective, wholehearted service shown by various church leaders.\n\nI particularly recognise the leadership of our churches, in their various offices, for being Godly spiritual shepherds over the people of our country. The Lord says in Jeremiah Chapter 3 verse 15, I will give you shepherds according to my heart, who will feed you with knowledge and understanding. Thank you all for remaining true to the offices you hold within the Churches in our country.\n\nYour individual and collective, wholehearted service is appreciated by my Government. More so that you have preached the uncorrupted word of God, which remains the beacon of hope, source of wisdom, and guidance for the people of our nation.\n\nHe exhorted the congregants to spread the gospel and nurture the spiritual growth of many people from different backgrounds, inspiring them to live according to Gods teachings of love, unity, compassion, and service.\n\nChurch leaders from various denominations prayed for President Mnangagwa and the nation during the National Thanksgiving and Dedication Service at the ZITF Grounds in Bulawayo yesterday. Leading the prayer is Overseer and President of the Apostolic Faith Mission of Africa Reverend Clement Nyathi. Other Church leaders are Faith for Nation Campaign Founder and Chairperson Reverend Andrew Wutawunashe, Zion Christian Church leader Bishop Nehemiah Mutendi and national chairperson For Vapostori and Zion for Ed Madzibaba Moses Gwasarira\n\nHe said the Thanksgiving service was, therefore, also a tribute to the profound impact and unity of purpose that the Church as a whole has demonstrated in communities.\n\nFocusing on patriotism, President Mnangagwa said the church inspires a sense of patriotism, noting that the youths are particularly challenged to resist the machinations by detractors to have them hate or look down upon their own motherland, Zimbabwe.\n\nPresident Mnangagwa said Zimbabweans are their liberators, using indigenous resources, skills, and talents. Others are welcome to assist us, he said.\n\nIn pursuit of our National Vision 2030, I call upon us to embrace true patriotism and genuine love for our country and our people. Borrowing from the exhortations in Psalm Chapter 137 verses 5 and 6, I also urge us, individually and collectively, to patriotically proclaim that, If I forget Zimbabwe, let my right hand forget her skill.\n\nIf I do not remember nor prefer Zimbabwe above my own joy, let my tongue cling to the roof of my mouth. Never be blind to the vast potential of our land. Open your eyes and hearts to truly love and be committed to the land of your birth. You, the youth, are the future of this great country.\n\nPresident Mnangagwa told the congregants that the future of Zimbabwe is brighter.\n\nAs we look to the future, our nation is emboldened by the goodness of Almighty God that saw us liberate ourselves from colonial bondage and ultimately repossess the land stolen from our forefathers by those who occupied our beautiful country.\n\nToday, we stand proud and tall as a truly free and independent people, enjoying freedom of worship and advancing Godly values as well as a people-centred national development agenda.\n\nIn the year ahead, unflinching focus on our national Vision, goals, and aspirations, coupled with hard honest work; production and productivity; should see us live up to the instruction given to us in Genesis Chapter 1 verse 28.\n\nIt is our responsibility and duty to be fruitful and to subdue the earth. We remain anchored on our national philosophy, Nyika inovakwa, inotongwa, inonamatirwa nevene vayo/ ilizwe, lakhiwa, libuswe likhulekelwe, ngabanikazi balo.\n\nCongregants follow proceedings at the National Thanksgiving and Dedication service held at ZITF Grounds in Bulawayo yesterday\n\nThe Head of State recounted to the congregants some milestones that the country attained in the past 12 months. He said the key progressive signposts attained are vast and cut across all sectors, such as mining, manufacturing, tourism, ICTs, education, and other social services.\n\nHe said in the agriculture sector, the Government is not folding arms and surrendering to the vagaries of climate change. Numerous dams are being built and boreholes sunk to mitigate the impact of climate change.\n\nMeanwhile, during the service, worshippers, some from neighbouring countries and Europe, adorned in various colourful religious robessome designed from the national fabricsat side by side, holding their Bibles and tambourines, exhibiting a jubilant mood indicative of their eagerness to praise the Almighty.\n\nThe atmosphere was vibrant, characterised by ululation, singing, and dancing within the auditorium.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-7.jpg",
            "description": "Nqobile Bhebhe, Bulawayo Bureau PRESIDENT Mnangagwa has commended the church for its unwavering patriotism, acknowledging its crucial role in driving Zimbabwe’s rapid modernisation and infrastructure development. He attributed this progress to the divine guidance of God and tireless efforts of the nation’s citizens, which have become the cornerstones of Zimbabwe’s ongoing advancement. Zimbabwe, he said, […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "No hunger despite historic drought: Minister",
            "url": "https://www.herald.co.zw/no-hunger-despite-historic-drought-minister/",
            "content": "Nqobile Bhebhe, Bulawayo Bureau\n\nLANDS, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka has described the current drought affecting Zimbabwe as unusual, highlighting the absence of typical long food queues often associated with such periods.\n\nHe attributed this unusual situation to the astute leadership of President Mnangagwa, emphasising that the Second Republic was committed to ensuring no citizen goes hungry despite the drought.\n\nDuring a brief presentation on the state of agriculture at the 8th National Thanksgiving and Dedication Service at the Zimbabwe International Trade Fair Grounds in Bulawayo yesterday, Dr Masuka assured the nation of the availability of adequate and affordable food despite the unprecedented severity of the El Nio drought, the worst since Zimbabwes Independence.\n\nThe El Nino drought is the worst since Zimbabwes Independence, yet it is the most unusual drought, with no queues and no escalation in food prices. This is all because of the astute leadership of President Mnangagwa.\n\nWe have enough food to feed 6.54 million people until March 2025, and enough to feed 4.5 million learners up to Grade 7 until April 2025. The Government is also distributing cash to 1.7 million vulnerable urban people, said Dr Masuka.\n\nRELATED STORY\n\nThe Minister further outlined the Governments proactive measures to address the food security challenges.\n\nThe Government is directly supporting 12.74 million people, which is 83.4 percent of the population.\n\nPresident Mnangagwa has consistently stated that no one and no place will be left food-insecure.\n\nThe Government has implemented measures to avert food shortages by ensuring food security at the household level for vulnerable families across the country until the next harvest.\n\nIn the 2023-2024 farming season, Zimbabwe and Southern Africa experienced El Nino weather conditions, characterised by low rainfall and extremely high temperatures.\n\nDue to these conditions, farmers across the country watched their crops wilt during extended dry periods.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/01/EfYme5CX0AACo8O.jpg",
            "description": "Nqobile Bhebhe, Bulawayo Bureau LANDS, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka has described the current drought affecting Zimbabwe as unusual, highlighting the absence of typical long food queues often associated with such periods. He attributed this unusual situation to the astute leadership of President Mnangagwa, emphasising that the Second Republic was […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Tourism sector leads GDP growth in 2024",
            "url": "https://www.herald.co.zw/tourism-sector-leads-gdp-growth-in-2024/",
            "content": "Leonard Ncube, Bulawayo Bureau\n\nWITH the year 2024 drawing to a close tomorrow, Tourism and Hospitality Industry Minister Barbara Rwodzi has declared the year a resounding success for the sector.\n\nKey achievements include the introduction of a new policy framework and the successful hosting of major events, marking significant progress for the industry.\n\nSpeaking in Victoria Falls, where she led a meet-and-greet campaign by the ministry and Zimbabwe Tourism Authority, Minister Rwodzi said tourism outperformed itself this year, becoming the number one contributor to the Gross Domestic Product (GDP) in the first nine months of the year.\n\nTourism contributed 12 percent to the GDP and surpassed agriculture and mining in the first nine months, which were affected by climate change and falling global prices.\n\nMinister Rwodzi noted that the sectors efforts throughout the year were appreciated, as evidenced by people choosing Zimbabwe, and Victoria Falls in particular, as a destination.\n\nWe have surpassed our expectations for 2024, where we have seen that our tourism policy sailed through, and we are happy about it as Cabinet accepted it.\n\nIt means 2025 going forward, there will be implementation, and that implementation must have an impact on arrivals and investments as well as the regulatory front, said Minister Rwodzi.\n\nShe said one of the major achievements this year was hosting the inaugural United Nations Tourism Regional Forum on Gastronomy Tourism for Africa in Victoria Falls in July.\n\nThe country also scored a first in securing the rights to host the UN Tourism Gastronomy School to be built in Victoria Falls, making the country a world destination of choice.\n\nShe credited Meetings, Incentives, Conferences, and Exhibitions (MICE) tourism for this success.\n\nWe also clinched a deal to have the first school of gastronomy hosted here. MICE tourism is growing big in the country, and I believe its because we are marketing our country.\n\nIts not easy to advertise your tourism, but if you bring in UN Tourism, its something that boosts confidence across the world. It shows that people love Zimbabwe; they have been waiting to hear whats good about Zimbabwe, she said.\n\nThe minister commended President Mnangagwas Policy of Engagement and Re-engagement, as well as the Zimbabwe is Open for Business approach, for contributing to tourism growth.\n\nThe Government introduced the Tourism Growth and Recovery Strategy in 2020 to support the sector back to pre-Covid-19 levels.\n\nMinister Rwodzi said rigorous marketing was key to the heritage tourism strategy.\n\nMarketing is what we are going to be doing in 2025 about the destination. The bigger part of it is marketing; we are going to increase marketing as we go into 2025. Those coming for MICE are reporting back and coming back with their families. Regardless of sanctions and how we are perceived by people around the world, now they know that its comfortable to come to Zimbabwe.\n\nWe have done quite well as we are going above everything. Over the festive season, we are expecting numbers to rise to above 2 million from the Diaspora and more than 220 000 to be coming in across the ports. Tourism has contributed 12 percent to the Gross Domestic Product for the first nine months of the year, and it has been sitting at number one, she said.\n\nMinister Rwodzi said Zimbabwe was waking up, showing its beauty, peace, and hospitality.\n\nDuring the meet-and-greet, which was spread across the country, visitors were handed the national fabric as a sign of hospitality and marketing strategy.\n\nThe Minister said the programme has provided real statistics and insight into tourism in the country.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/Barbara-Rwodzi.jpg",
            "description": "Leonard Ncube, Bulawayo Bureau WITH the year 2024 drawing to a close tomorrow, Tourism and Hospitality Industry Minister Barbara Rwodzi has declared the year a resounding success for the sector. Key achievements include the introduction of a new policy framework and the successful hosting of major events, marking significant progress for the industry. Speaking in […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "First Lady scales dizzy heights in 2024  . . . doctorate caps stellar year",
            "url": "https://www.herald.co.zw/first-lady-scales-dizzy-heights-in-2024-doctorate-caps-stellar-year/",
            "content": "Tendai Rupapa, Senior Reporter\n\nLOVE and compassion were the hallmarks of the year 2024 for First Lady Dr Auxillia Mnangagwa, who touched many hearts and changed countless lives in the course of her philanthropic work.\n\nShe is an empowerment champion who never tires.\n\nHer deep passion to assist Zimbabweans and empowerment of women and girls runs in her veins.\n\nHer background moulded her resilience and inspired her philanthropy, which she started even before she became a First Lady.\n\nGrowing up in a child-headed family with her being the eldest, Amai Mnangagwa had to fend for her two younger siblings.\n\nShe also still found time for others, helping the elderly in her community.\n\nOver the years, Dr Mnangagwas work through her Angel of Hope Foundation has touched the lives of many vulnerable groups.\n\nRELATED STORIES\n\nToday, many have lived to tell how their lives were transformed for the better.\n\nIn the year 2024, she barely rested.\n\nHats off!\n\nSchoolchildren participate in a tug of war competition while being cheered by First Lady Dr Auxillia Mnangagwa during an interactive session and team building exercises after a school feeding programme\n\nAt a personal level, Dr Mnangagwa scaled dizzy heights academically, ending the year on a high note by graduating with a Doctor of Philosophy Degree in Tourism and Hospitality Management at Midlands State University (MSU).\n\nShe did this as a motivational factor, showing that with focus, anyone can climb the academic ladder despite social standing and age.\n\nCourtesy of the partnership between her AoHF and the Zimbabwe Open University, communities are being empowered through free open learning.\n\nThe programme is ongoing and courses on offer include Agriculture, Basic Counselling, Disability Management and Sign Language, Health Behaviour, Basic Records Management, Cultural Heritage, Entrepreneurship and Business Management, Early Childhood Development, Basic Nurse Aide programme and Palliative Care for the Elderly, and Basic Computer Literacy.\n\nHardworking, resilient, and unassuming, Dr Mnangagwa made significant contributions to the tourism sector in a year in which her efforts compelled UN Tourism to hold its first ever Tourism Forum on Gastronomy in Africa in her honour.\n\nGastronomy tourism, which mainly involves the exploration of food as the purpose of tourism, gives tourists a total experience of what Zimbabwe has to offer, in the process creating jobs and earning the country foreign currency.\n\nShe received a special invite to the UN Tourism Africa and Americas Summit in the Dominican Republic where she received a red carpet welcome because of her exploits in the tourism sector, a feat that has never been achieved by any sitting First Lady in Zimbabwe since the attainment of Independence in 1980.\n\nSchoolchildren receive food during one of the countless school feeding programmes organised by First Lady Dr Auxillia Mnangagwa around the country\n\nGrounded in the countrys traditional norms and values, she held separate camps for boys and girls drawn from the countrys 10 provinces, imparting in them life skills and the values of ubuntu needed for them to grow into responsible citizens. In a bid to teach the children to embrace the values of discipline, resilience, hard work and obedience to realise their dreams, Amai Mnangagwa continued with her Gota/Nhanga/Ixhiba programme countrywide.\n\nShe also held a special Gota/Nhanga/Ixhiba session for hundreds of primary and secondary school learners from Southern Africa who were attending the Regional World Childrens Day commemorations in Victoria Falls.\n\nThe children were from Zimbabwe, Zambia, Malawi, Mozambique, South Africa, Botswana and Namibia.\n\nOn the social front, she sought to mend broken homes by introducing the Afrikana Family Humanism programme to tackle widespread promiscuity among married couples in which couples were actually competing to outdo each other in cheating.\n\nIndeed, she filled the cracks in the walls of many homes by offering both men and women a shoulder to cry on.\n\nA good counsellor, Dr Mnangagwa, used her programme as a platform to promote good communication, love, and bonding among married people.\n\nWomen, who for many years have been on the receiving end of mens cheating, claimed they had turned the tables, but the First Lady counselled morality, dignity, and respect among partners.\n\nFirst Lady Dr Auxillia Mnangagwa teaches girls from Namibia, South Africa, Zambia, Botswana, Malawi, Mozambique and Zimbabwe good values, need to respect and preserve their bodies and value their education among other issues during and interactive nhanga/gota/ixhiba session she organised at the 2024 Regional World Childrens Day commemorations in Victoria Falls\n\nShe had previously introduced a highly educative and interactive Nharirire YeMusha programme which enabled Zimbabweans to roundly come up with the qualities for a model man and woman the country needs in the wake of the deteriorating social fabric caused by the collapse of the extended family unit and westernisation.\n\nThe programme focused on parents and guardians after children attributed their mischief to parents, who they said were neglecting their duties to mould them during the Gota/Nhanga Ixhiba programme.\n\nMen and women who attended the Nharirire Yemusha programme first met as a group where the First Lady addressed them on the objectives of the programme before they were separated with the men having their own discussions while women did the same.\n\nThis gave the two groups time and space to freely lay bare their issues.\n\nThis came as the mother of the nation, as Dr Mnangagwa is fondly referred to, captured the imagination of the world, earning standing ovations at various forums across the globe because of her philanthropic work.\n\nThe desire to help the need and inspire others to greatness is an in-born thing for the First Lady.\n\nAs health ambassador, Dr Mnangagwa held extensive medical outreach programmes in league with personnel from the Ministry of Health and Child Care unlocking vulnerable groups, including the disabled, the elderly and those with albinism, access to free eyesight checks, cervical cancer screening as well as checks for non-communicable diseases like hypertension and diabetes.\n\nAGRIC4SHE patron First Lady Dr Auxillia Mnangagwa distributes banana seedlings to women during the launch of Banana4SHE, in Honde Valley, Manicaland an initiative to economically empower women in rural and marginalised communities\n\nShe made use of her AoHFs mobile clinic and top-notch mobile hospital affixed with state-of-the-art equipment in the medical outreach programmes in all provinces including remote and hard-to reach areas in an effort to protect and preserve public health.\n\nAs a motivational factor, she also went through the cancer screening and camped with the medical teams encouraging people to get tested and screened as this would enhance their chances of survival if ailments were detected early and people were commenced on treatment.\n\nThrough her Angel of Hope Foundations partnership with the Seventh Day Adventist Church Warren Park District, they refurbished Warren Park Polyclinic and donated consumables to enable the health centre to fully service the community.\n\nAs part of the refurbishment, walls were painted, electricals fixed, a 10kv solar system was fitted, new water tank was fitted while a water pump and toilet sets were installed.\n\nThe partnership also saw the clinic receiving many other hospital consumables and equipment.\n\nTeen mothers were not left out.\n\nThe First Lady gave their children food, clothing, and blankets.\n\nShe offered the mothers a chance to go back to school and made sure they shared their tales with other young girls as examples to show that neglecting education in pursuit of men had negative consequences.\n\nShe hammered on the need for schoolchildren to stay focused, concentrate on their studies, and aim high to achieve greater things in life.\n\nAGRIC4SHE patron First Lady Dr Auxillia Mnangagwa distributes farming inputs to women during her launch of Pfumvudza4SHE, Banana 4She, Horticulture 4She Fisheries 4she and Poultry 4She in Honde Valley, Manicaland to economically empower women\n\nAn unassuming woman of valour who does not hide her passion for hard work, Dr Mnangagwa traversed the length and breadth of Zimbabwe as Agric4She patron, encouraging women as primary care givers in families to grow a variety of crops including traditional grains which boast high nutritional value and medicinal properties.\n\nWhat stuns many people is her energy and drive to get results.\n\nElderly women, children, and vulnerable members of the community were the major beneficiaries of her programmes.\n\nComing against the backdrop of an El Nino-induced drought, her message sank in well in communities countrywide where she also ventured with her popular school feeding programme in which she prepared food, personally fed learners and urged communities to carry forward the programme for the good of the children.\n\nGeared to mould women of virtue countrywide, the First Lady spent the year rolling out projects for women as a way of relieving pressure on mens wallets and in the process end domestic violence which mainly emanates from the sharing of scarce resources.\n\nMen, she said, as heads of households, must give their spouses a portion of land to grow crops for their granaries so that families would not go hungry while also boosting household food security and nutrition.\n\nThrough her Widows Association, she has also been rolling our projects for widows across the country so that they are self sustainable.\n\nIn 2018, Amai Mnangagwa introduced nationwide inheritance and property programme which involved experts from various fields who imparted knowledge to widows, widowers and orphans on inheritance issues making communities aware of their rights.\n\nFirst Lady Dr Auxillia Mnangagwa and Ambassadors accredited to Zimbabwe march during the First Ladys Road Safety walkathon along Mutare road ahead of the festive season to educate the motoring public on road safety\n\nShe carried over the programme through the years and has promised to intensify the awareness campaigns in 2025 so that people have knowledge on property rights and inheritance law.\n\nOnly this month, the First Lady led a gender-based violence awareness campaign walkathon from the infamous Booster to Overspill Shopping Centre in the sprawling settlement of Epworth promoting peace, love and harmony in families in the spirit of the 16 Day of Activism against Gender-based violence.\n\nThe Booster is a haven of prostitution as well as drug and substance abuse, which the First Lady abhors, hence her intervention to curb vice.\n\nShe was joined by the United Nations family, diplomats, the Zimbabwe Republic Police, GBV survivors, churches and members of the community.\n\nThe First Lady seeks to promote peaceful homes where couples live peacefully together, raising their children in a dignified manner free of early child marriages, violence, and drug and substance abuse.\n\nThis came as 10 children from Dr Auxillia Mnangagwa Childrens Home in Chiredzi touched down to a heroes welcome at Robert Gabriel Mugabe International Airport in Harare on their return from a triumphant Russian trip where they won a soccer trophy, flying the Zimbabwe flag high.\n\nThe children, previously among hordes of children living and working on the streets of major cities and towns who were taken by the First Lady and committed to the childrens home where they are housed, fed and sent to school, walked with a spring in their steps following the success.\n\nAndy Muridzo shares a lighter moment with First Lady Dr Auxillia Mnangagwa, while Tourism and Hospitality Industry Minister Barbara Rwodzi looks on after he performed at the cultural gastronomic dinner to appreciate Angel of Hope Foundation partners at State House\n\nThe First Lady also hosted an African-themed appreciation dinner for the organisations partners in recognition of their support throughout the year 2024.\n\nThe foundation, which is not State-funded, relies on its partners and well-wishers to be able to mobilise resources to assist the needy and implement life transforming projects throughout the country.\n\nIt is through the partners, that through her Angel of Hope Foundation, the First Lady managed among other things, to deliver truckloads of building materials, including cement and roofing sheets she mobilised, to repair 10 schools and over 79 homesteads that were damaged and had their roofs blown off by strong winds last month in Nyazura, torching wild celebrations in a community that was at the crossroads.\n\nDuring the festive season period, which marks the end of the year, the First Lady held a walkathon to promote road safety and mark the World Day of Remembrance for Road Traffic Victims in an oversubscribed event attended by diplomats, their spouses, embassies staff, Government officials and the Traffic Safety Council of Zimbabwe (TSCZ).\n\nAlso present were transport associations, drivers and conductors unions, churches, traditional chiefs as well as communities who all marched with the mother of the nation.\n\nIn recognition of her hard work, love and passion to save lives, Transport and Infrastructural Development Minister Felix Mhona announced her appointment as the road safety patron.\n\nJudging by the huge volume of work the First Lady achieved during the year under review, her appetite to do good for the nation evidently remains high.\n\nWelcome 2025.\n\nChildren from Dr Auxillia Mnangagwa home in Chiredzi who participated at the BRICS plus International Sports, Arts and Culture festival in Russia courtesy of Amai Mnangagwa proudly display the Zimbabwean and Russian flags, their soccer trophies and medals upon their return at Robert Gabriel Mugabe International Airport\n\nTourism and Hospitality patron First Lady Dr Auxillia Mnangagwa receives an award for promoting gastronomy tourism from UN Tourism secretary general Mr Zurab Pololikashvili during the UN Tourism Regional forum on gastronomy tourism for Africa in Victoria Falls\n\nBoys are taught how to mop the floor by First Lady Dr Auxillia Mnangagwa during her inaugural national boys camp\n\nFirst Lady Dr Auxillia Mnangagwa teaches girls from all the countrys provinces how to prepare and mix ingredients required to bake traditional bread during their educative and interactive boot camp\n\nFirst Lady Dr Auxillia Mnangagwa teaches boys drawn from the countrys 10 provinces how to prepare chicken for lunch during her inaugural national boys camp\n\nHealth Ambassador First Lady Dr Auxillia Mnangagwa interacts with some of the 25 medical doctors and nurses she invited from the United States through her Angel of Hope Foundation for medical outreach in Zimbabwe\n\nTourism patron First Lady Dr Auxillia Mnangagwa who received a special invitation to deliver a key note address at the inaugural UN Tourism Africa and Americas summit pose for a photograph with UN Tourism Secretary-General Mr Zurab Pololikashvili, Dominican Republic Minister of Tourism Mr David Collado, Dominican Republic Minister of Foreign Affairs Mr Roberto Alvarez, UN Tourism Executive Director Ms Natalia Batona, UN Tourism Regional Director for the Americas Mr Gustavo Santos, UN Tourism Regional Director for Africa and Caribbean Ms Elcia Grandcourt at the summit in Punta Cana, Dominican Republic.  Pictures: John Manzongo\n\nAgric4She patron First Lady Dr Auxillia Mnangagwa hands over more than 5 500 chicks and chickens, fertilisers and rice during the launch of Poultry for vana mbuya empowerment scheme\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa handed over building materials that include among other things, roofing sheets and cement to repair 20 schools and over 79 homes destroyed by recent heavy rains and also donated Christmas hampers and mealie meal and porridge for children to affected people and the elderly at Handina Primary School in Manicaland\n\nFirst Lady Dr Auxillia Mnangagwa interacts with senior citizens, while handing over Christmas hampers to the elderly and other people affected by recent heavy rains in Manicaland\n\nAngel of Hope Foundation patron First Lady Dr Auxillia Mnangagwa distributes hampers to people with albinism, the disabled and the elderly in Chitungwiza\n\nFirst Lady Dr Auxillia Mnangagwa leads a walkathon march against Gender Based Violence which she is championing through the national gender based violence 575 call centre she established and based at her office in Harare\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/FL1-3.jpg",
            "description": "Tendai Rupapa, Senior Reporter LOVE and compassion were the hallmarks of the year 2024 for First Lady Dr Auxillia Mnangagwa, who touched many hearts and changed countless lives in the course of her philanthropic work. She is an empowerment champion who never tires. Her deep passion to assist Zimbabweans and empowerment of women and girls […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Diaspora hailed for investments, remittances",
            "url": "https://www.herald.co.zw/diaspora-hailed-for-investments-remittances/",
            "content": "By Tafadzwa Zimoyo, Entertainment Editor\n\nThe Zimbabwean Diaspora community has been hailed for its contributions to national development at the Zimbabwe Diaspora Homecoming Celebration and Business Summit held in Harare.\n\nThe event brought together Government officials, local stakeholders and members of the Diaspora community to discuss investment opportunities.\n\nSeveral Diasporans received awards for their exemplary work, highlighting the importance of recognition in fostering a culture of achievement within the community.\n\nMr Blessed Kapesa, chairman of the Zimbabweans In Diaspora Organisation (ZIDO), hosted the event and emphasized its significance.\n\nThis is the second edition of the event in Zimbabwe, and we are pleased with the response not only from the diaspora community, but also from local stakeholders and the government, who wholeheartedly support our efforts, Kapesa said.\n\nGovernment representatives echoed this sentiment, underscoring the vital role of the diaspora in the countrys economy. The diaspora is a crucial part of our national development, a government official stated. Their investments and remittances play a significant role in stabilising our economy and creating jobs.\n\nThe summit featured presentations from provincial, urban, and rural councils pitching investment opportunities. It also showcased diaspora success stories, illustrating how Zimbabweans abroad have thrived while contributing to the homelands growth.\n\nRELATED STORY\n\nKapesa noted that the initiative aimed to unite the diaspora and facilitate the exchange of ideas. With the mantra Nyika inovakwa nevene vayo (A nation is built by its people), this event serves a vital purpose, he explained. We aim to bring diasporans together, especially during this festive season when many return home.\n\nThe event also provided a platform for developing new ideas that can benefit Zimbabwe. When we are in foreign lands, its challenging to bring forth concepts that can develop our communities, Kapesa added. This summit allowed us to gather representatives from various sectors, from finance to construction, all committed to driving the economy forward.\n\nBevan Makaka, a US-based entrepreneur who won the Best Logistics and Freight Award for his company Xcelerate, expressed his appreciation for the recognition. Im thrilled to end the year on a high note. This recognition motivates me to work harder, he said. I thank the organisers for this initiative; my representative reported that it was an excellent networking opportunity.\n\nThe Government has reiterated the necessity of supporting the diaspora community. They are not just citizens abroad; they are vital contributors to our economy, another government official remarked. We must respect and assist them in their endeavours to promote economic growth in Zimbabwe.\n\nThe Zimbabwe Diaspora Homecoming Celebration and Business Summit underscored the critical role of the diaspora in national development. By recognising their achievements and fostering collaboration, Zimbabwe aims to harness the full potential of its diaspora to drive economic growth and prosperity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Blessed-Kapesa.jpg",
            "description": "By Tafadzwa Zimoyo, Entertainment Editor The Zimbabwean Diaspora community has been hailed for its contributions to national development at the Zimbabwe Diaspora Homecoming Celebration and Business Summit held in Harare. The event brought together Government officials, local stakeholders and members of the Diaspora community to discuss investment opportunities. Several Diasporans received awards for their exemplary […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Interpol welcomes UN convention against cybercrime",
            "url": "https://www.herald.co.zw/interpol-welcomes-un-convention-against-cybercrime/",
            "content": "Crime Reporter\n\nThe International Criminal Police Organisation (Interpol) has welcomed the United Nations (UN) Convention Against Cybercrime adoption by the United Nations General Assembly as a significant milestone in the fight against cyber threats.\n\nThe first legally binding UN instrument on cybercrime, the convention is the product of five years of government negotiations, informed by INTERPOL and other international organisations and stakeholders.\n\nComplementing the current framework of UN crime-related treaties, it expands and updates the legal foundations of the international fight against crime.\n\nInterpols active participation in the discussions ensured that law enforcement perspectives and existing practical solutions to combat cybercrime were integrated into the treaty.\n\nThe convention recognises the essential role of INTERPOLs law enforcement network in facilitating international cooperation through the rapid and secure exchange of information on computer-related crime and other related criminal offences.\n\nInterpol Secretary General Valdecy Urquiza said, Cybercrime is a uniquely borderless threat that is increasing dramatically. Cyber-attacks destroy businesses, undermine public institutions, and endanger lives.\n\nOnly by moving forward together in lockstep can countries effectively combat cybercrime. The UN cybercrime convention provides a basis for a new cross-sector level of international cooperation we desperately need.\n\nRELATED STORY\n\nThe UN convention establishes a framework to tackle evolving cybercrime challenges, including the illegal access and interception of electronic data; online child sexual abuse and grooming; and money laundering.\n\nIt also calls on signatories to collaborate in intercepting the illicit proceeds of cybercrime and in collecting and sharing electronic evidence.\n\nThe adoption of the UN convention comes amid a sharp escalation in the scale and complexity of cyber-attacks, which increased by a record 75 per cent year-on-year in the third quarter of 2024.\n\nIn September, a two-month cybercrime operation coordinated by INTERPOL and AFRIPOL saw law enforcement from 19 African countries arrest 1 006 suspects and dismantle 134 089 malicious infrastructures and networks.\n\nINTERPOL helps law enforcement across its 196-country membership more effectively combat cybercrime by sharing intelligence  including from private sector partners coordinating operations and conducting training programmes.\n\nINTERPOL National Central Bureau (INTERPOL NCB) The organisation has a membership of 194 countries and Zimbabwe is a member. Each member country has a National Central Bureau (NCB) which deals with transnational crimes. Zimbabwe has been a member of Interpol since November 13, 1980, and has been conducting joint operations with other member states to curb cross-border crimes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Valdecy-Urquiza.jpg",
            "description": "Crime Reporter The International Criminal Police Organisation (Interpol) has welcomed the United Nations (UN) Convention Against Cybercrime adoption by the United Nations General Assembly as a significant milestone in the fight against cyber threats. The first legally binding UN instrument on cybercrime, the convention is the product of five years of government negotiations, informed by […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: Update sentencing powers of regional magistrates",
            "url": "https://www.herald.co.zw/editorial-comment-update-sentencing-powers-of-regional-magistrates/",
            "content": "A major upgrade in the qualifications of magistrates in the early 1970s, which in turn allowed a new top tier of experienced and well-qualified regional magistrates above the former top-ranked provincial magistrates, saw the transfer of almost all serious criminal trials from the High Court to this new tier.\n\nSentencing powers were slower to follow and often judges imposed a sentence on a conviction made by a regional magistrate.\n\nHowever, they were gradually raised first to five years, then seven, then in the early 1990s to 10 years and more recently to 12 years to cope with initially the rising sentences for rape and then the growing prevalence of robbery, plus the minimum sentences needed for stock-theft and theft of Zesa equipment.\n\nNow two judges of the High Court, Deputy Judge President Garainesu Mawadze, the number two High Court judge, and Justice Esther Muremba, who wrote the actual judgment reflecting the views of the two, have called for another major jump in sentencing jurisdiction for regional magistrates so that they can impose the sentences suggested in the fairly new sentencing guidelines.\n\nThey were the review panel for a conviction and sentence imposed on a pair of armed robbers and while they agreed that the regional magistrate had correctly convicted the two on the evidence, they found the 10-year sentence did not meet the needs of justice, being around half the 20 years suggested in the guidelines as the starting point for assessing a sentence for armed robbery in aggravating circumstances.\n\nAnswering the judges query, the regional magistrate imposing the sentence noted that her maximum jurisdiction was 12 years.\n\nShe could have referred the two for sentence in the High Court, a cumbersome and time-consuming process, but instead used her own jurisdiction.\n\nRegional magistrates are all well qualified legally, having both the law degrees and been practicing as a magistrate for many years before reaching the top tier.\n\nThis is why they are competent to try serious criminal cases such as those involving armed robbery, rape and attempted murder.\n\nThe two review judges thought that the sentencing jurisdiction should follow that thrust, and be in line with the guidelines.\n\nSuch serious sentences would still be reviewed by the High Court, but it is very rare for the High Court to interfere with what regional magistrates have done, or find sentences too low as in this case.\n\nUntil the 1970s few magistrates had law degrees, most being qualified through civil service law examinations, which is why they were limited to the lower level of criminal trials.\n\nA part-time law degree from the University of Zimbabwe qualified those on the bench without degrees along with the policy change that all new magistrates had to be graduates.\n\nThis allowed a small group of graduate magistrates with good experience to be promoted into the new tier of regional magistrate.\n\nThe fairly low sentencing powers of all magistrates meant that while they could cope with the less serious crimes, normally the non-violent crimes, they frequently had to refer criminals they had convicted to the High Court for sentencing, along with their considered opinion that they did not have the jurisdiction to impose an adequate sentence.\n\nThis created ever longer delays and meant the person who knew most about the case had no say in the sentence.\n\nWhile the increase in the maximum sentence a regional magistrate can impose is now 12 years, and that coped with almost all crimes they tried at the time it was last raised, it is now well below the recommended standard sentences for several violent crimes, in particular armed robbery with aggravating circumstances and rape, particularly rape of children or other aggravating circumstances.\n\nIn these sort of cases sentences of well above that 12-year limit are suggested by the guidelines.\n\nThe sentencing guidelines issued by the Judicial Service Commission were a major and successful attempt to ensure that justice was uniform and that similar crimes committed in similar circumstances with similar mitigation and aggravation received similar sentences.\n\nIn the old days, a much smaller judiciary could achieve this informally. But as the court system had been expanded to bring justice closer to all communities, and the regional magistrates are now longer confined to two divisions, but operate in many other courts across the provinces and districts, a set of guidelines were needed.\n\nThese do not impose a standard sentence, but give the sentencing judge or magistrate a starting point.\n\nIf the guideline starts with say 10 years, the judge or magistrate imposing the sentence then looks at the actual circumstances, and at the evidence in aggravation and mitigation, and moves the sentence up and down from 10 years for each factor until they arrive at a figure that fits the individual crime and criminal\n\nUnlike civil cases, which can involve a lot of tricky points of law and with a concept of proof on probabilities, criminal law is relatively simple when it comes to conviction.\n\nThere are a small number of elements for each crime that make up that crime, so the law is relatively simple, and conviction needs proof beyond reasonable doubt, again a simple standard needing a yes or no answer.\n\nSentencing has always been considered the far more difficult part of a presiding officers duty, finding the correct sentence to fit the crime and the criminal.\n\nBut our regional magistrates are considered competent for dealing with for the range of all the criminal cases they preside over, and in imposing sentences as a matter of routine. The need for higher sentences in the most violent crimes now means we need to follow the trust we have had in this group for half a century and give them, as the High Court judges recommend, the sentencing powers to meet the guidelines.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/12/court-hammer.jpg",
            "description": "A major upgrade in the qualifications of magistrates in the early 1970s, which in turn allowed a new top tier of experienced and well-qualified regional magistrates above the former top-ranked provincial magistrates, saw the transfer of almost all serious criminal trials from the High Court to this new tier. Sentencing powers were slower to follow […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Willdale reclassifies US$2,6m land banks",
            "url": "https://www.herald.co.zw/willdale-reclassifies-us26m-land-banks/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nLISTED brick manufacturer, Willdale Limited has reclassified its land banks valued at US$2,6 million as current assets following a resolution to develop and resell the land as part of the firms capital raising initiative.\n\nIn March this year, Willdale announced that it was converting its land banks to residential stands to raise capital for the acquisition of machinery to enhance production at its brick manufacturing plants.\n\nAt the time, Willdale indicated it had an estimated 165,6 hectares in Mt Hampden, an area seeing significant demand for residential stands following the completion of the new Parliament Complex while the planned city nearby has also enhanced its appeal.\n\nIn a statement accompanying the groups financial results for the year ended September 30, 2024, the brick manufacturer said: Land totalling US$2,6 million was reclassified to current assets following the resolution to develop and sell the land.\n\nApplications for development permits are at different stages of approval.\n\nIt said fund raising for the acquisition of a modern and more efficient rotary kiln plant was ongoing and Willdale believes that the planned plant will improve competitiveness particularly in the common bricksegment.\n\nDuring the year under review, the firm said electricity supply was constant but brick production at its plants was hampered by working capital shortages, which emanated from the changing business model and tight liquidity conditions that prevailed.\n\nProduction costs remained relatively higher than competitors who were using better technology.\n\nRevenue for the year at US$11 million was 64 percent above the prior year (2023: US$6,7 million).\n\nSales volumes declined by 7 percent due to reduced production. Average prices were 6 percent higher despite competition.\n\nExchange rate distortions affected revenue and costs in the first half of the year resulting in significant exchange losses.\n\nProfitability was also weighed down by real increases in other cost lines such as a 23 percent increase in NEC (National Employment Council) wages and electricity which recorded a 41 percent average tariff increase, said Willdale.\n\nThe brick manufacturer said during the period under review it noted several construction projects being undertaken and thus driving demand for bricks.\n\nIt is in this context that cluster home development together with establishment of shopping malls in major cities contributed significantly to Willdales revenue.\n\nLack of adequate stocks affected volume growth, with volumes declining by 7 percent compared to the prior year.\n\nProduction needs to be enhanced as soon as possible to effectively deal with emerging competition which is threatening both volumes and margins, said the company.\n\nOn its going concern status, the firm remains confident that it will continue to operate as a going concern for the foreseeable future.\n\nThe boards view is based on the successful implementation of its strategic plans, continued support from its stakeholders and other initiatives that are being undertaken to improve performance and minimise the impact of risks that the company faces, said Willdale.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/f2r.jpg",
            "description": "Oliver Kazunga Senior Business Reporter LISTED brick manufacturer, Willdale Limited has reclassified its land banks valued at US$2,6 million as current assets following a resolution to develop and resell the land as part of the firm’s capital raising initiative. In March this year, Willdale announced that it was converting its land banks to residential stands […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "Dangote explains fuel price fall",
            "url": "https://www.herald.co.zw/dangote-explains-fuel-price-fall/",
            "content": "The Nigerian billionaire and owner of the US$20 billion Dangote refinery, Aliko Dangote, recently explained why fuel prices in Nigeria have plummeted after a year of constant price hikes.\n\nDangote explains the drop in fuel prices in Nigeria during festive season.\n\nReduction in petrol prices due to market forces and need to protect refinerys interests and investment.\n\nDangote refinery announced reduction in ex-depot price of petrol to N899.50 per litre.\n\nThe president of the Dangote group revealed that the price drop for Premium Motor Spirit (petrol) during the festive season was brought on by market forces as opposed to deliberate efforts by marketers to ease the economic burdens that come with the festive season.\n\nDuring an interview on Arise TV, the Nigerian billionaire highlighted that he too must protect the interests of his refinery.\n\nThe price reduction is a response to the market, let me just put it that way. It is a refinery where we invested over US$20 billion and I think we have to try and protect our interests and also our investments, he said. On December 19th the Dangote refinery announced a reduction in the ex-depot price of petrol, to N899.50 per litre.\n\nThe downstream industry saw fierce pricing competition as a result, which compelled NNPCLto to lower its ex-depot price to N899 per litre.\n\nTo the pleasure of Nigerians, the refinery also announced that it will be partnering with MRS fuel station to offer fuel from its retail locations countrywide for N935 per litre. During the interview, he also said that petroleum imports have a big impact on Nigerias foreign exchange, as seen in the Punch Newspaper. Business Insider Africa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2017/11/0211-1-1-ALIKO-DANGOTE.jpg",
            "description": "The Nigerian billionaire and owner of the US$20 billion Dangote refinery, Aliko Dangote, recently explained why fuel prices in Nigeria have plummeted after a year of constant price hikes. Dangote explains the drop in fuel prices in Nigeria during festive season. Reduction in petrol prices due to market forces and need to protect refinery’s interests […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        },
        {
            "title": "DRAW LOOMS AS RAIN RUINS DAY 4",
            "url": "https://www.herald.co.zw/draw-looms-as-rain-ruins-day-4/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nPERSISTENT rain on day four of the historic Boxing Day Test between Zimbabwe and Afghanistan forced an early finish to proceedings at Queens Sports Club yesterday.\n\nThe rain began shortly after lunch and continued to pour, resulting in the match being called off for the day with two sessions still to be played on the penultimate day.\n\nWith overcast conditions throughout the day, only two overs were bowled after lunch before the rain began.\n\nOverall, only 31 overs were played on day four.\n\nWith a day left to go, the game is most likely ending as a draw.\n\nAfghanistan continued their resolute batting display, finishing the day on 515/3 from 156 overs, trailing Zimbabwe by just 71 runs. They had resumed day four with an overnight score of 425/2 (125 overs) and managed to add 90 runs for the loss of one wicket.\n\nThe only wicket that fell during the day saw debutant Newman Nyamhuri break the 364-run partnership between Rahmat Shah and Hashmatullah Shahidi early in the day.\n\nThe 18-year-old Nyamhuri had Shah caught at gully by Ben Curran for 234 runs off 424 deliveries, having added just three runs to his overnight score. Shah now holds the record for Afghanistans highest individual Test score and is one of only two batters from the country to have scored a double century in the longest format of the game.\n\nThe other Afghanistan batter to score a double century in Tests is captain Shahidi, who, at stumps on day four, was closing in on another massive score.\n\nShahidi ended the day on 179 runs from 367 balls.\n\nHe was batting alongside Asfar Zazai, who was also nearing his maiden Test half-century.\n\nThe 31-year-old Zazai was on 46 runs from 87 deliveries, with his best red-ball score being an unbeaten 48. Shahidi and Zazais fourth-wicket partnership had reached 87 runs by the close of play.\n\nThe 515 runs scored by Afghanistan at the end of day four is now their second-highest score in Tests, with their highest being 545/4 (declared) against Zimbabwe in 2021.\n\nZimbabwes debutant, Trevor Gwandu, has conceded 107 runs from 24 overs, including one maiden and one wicket.\n\nThe other wicket-taker is Blessing Muzarabani, with figures of 1/52.\n\nSean Williams and Brandon Mavuta have both conceded 98 runs from 34 and 27 overs, respectively.\n\nNyamhuri has given away 82 runs in 23 overs, while Brian Bennett has conceded 57 runs from 20 overs.\n\nThis game will be followed by Zimbabwes inaugural New Years Test, scheduled for January 2-6, 2025.\n\nTo date, the country has hosted only one Boxing Day Test, when Zimbabwe faced England in 1996 in a drawn match severely affected by rain at Harare Sports Club.\n\nSince then, Zimbabwes only other Boxing Day Tests have been played away from home  against New Zealand in Wellington in 2000 and against South Africa in the inaugural pink-ball, day-night, four-day Test in Port Elizabeth in 2017.\n\nZimbabwe also played Sri Lanka in a Test that started on December 27, 2001, in Colombo.\n\nZimbabwe has never played a New Years Test, either at home or abroad.\n\nWeather permitting, play will resume at 9.30am today for the final day.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/Blessing-Muzarabani.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub PERSISTENT rain on day four of the historic Boxing Day Test between Zimbabwe and Afghanistan forced an early finish to proceedings at Queens Sports Club yesterday. The rain began shortly after lunch and continued to pour, resulting in the match being called off for the day with two sessions still […]",
            "time": "06:38",
            "date": "30 Dec 2024"
        }
    ]
}