{
    "news": [
        {
            "title": "DRC crisis: Sadc, EAC eye peace breakthrough",
            "url": "https://www.herald.co.zw/drc-crisis-sadc-eac-eye-peace-breakthrough/",
            "content": "Fungi Kwaramba in DAR ES SALAAM, Tanzania\n\nSADC Chairperson President Mnangagwa will today chair a joint summit of SADC and the East Africa Community (EAC) along with EAC Chairperson Kenyan President William Ruto to persuade all involved in the Democratic Republic of Congo conflict to lay down arms and return the eastern parts of the resource-rich country to normalcy.\n\nThe President, who arrived here yesterday, will be leading the SADC Double Troika for the crucial indaba with their EAC counterparts in a unique and extraordinary summit that brings all parties involved in the decades-old conflict to the same table.\n\nTodays meeting was preceded by a joint meeting of Councils of Ministers from SADC and the EAC which discussed the deteriorating security situation in Eastern DRC, where rebels have gained a foothold, leaving an estimated 2 000 people dead and thousands more displaced.\n\nThe Joint SADC-EAC Meeting of Ministers was co-chaired by Zimbabwes Foreign Affairs and International Trade Minister Professor Amon Murwira and Kenya Prime Cabinet and Secretary for Foreign and Diaspora Affairs Dr Musaila Mudavadi.\n\nProf Murwira said the joint effort involving Southern Africa and East Africa underlines the importance of joint political and diplomatic efforts for normalcy to prevail in the Eastern DRC.\n\nIt is regrettable that the security and humanitarian crisis in Eastern DRC continues to deteriorate despite the noble efforts through the Luanda and the Nairobi (peace) processes. It is heart-breaking that around 400 000 people have been displaced in the city of Goma, this year alone, said Prof Murwira.\n\nDRC President Felix Tshisekedi, Rwanda President Paul Kagame, Tanzanian President Samia Suluhu Hassan, South Africa President Cyril Ramaphosa, Ugandan President Yoweri Museveni and Somalian President Hassan Sheikh Mohamud are all expected to attend todays make-or-break talks.\n\nSADC has 16 members and the EAC has eight but DRC, which has been plagued by conflicts for years now, is along with Tanzania a member of both blocs.\n\nRwanda, which is accused by the DRC of backing the M23 rebels that have taken key towns in Eastern DRC, is a member of EAC. Rwanda stridently denies sponsoring renegades in its neighbouring country.\n\nYesterday, SADC Executive Secretary Mr Elias Magosi hailed the convening of the Joint Meeting of SADC and EAC as a vital step in the spirit of solidarity and collaboration between members of SADC and EAC in finding a lasting solution to the security situation in the DRC.\n\nThe Joint SADC-EAC Summit will be held in fulfilment of the decision of the Extraordinary Summit of SADC Heads of State and Government of January 31 in Harare, where the summit assessed the precarious and fast-evolving security situation in the Eastern DRC, and called for an immediate joint Summit of SADC and EAC to find the best way forward, and a collective approach to the security situation in the DRC.\n\nSilencing the Guns is a key initiative within the African Unions (AU) Agenda 2063, a long-term plan aiming to achieve peace and sustainable development across the continent by 2063, to end all wars and violent conflicts in Africa by addressing the root causes of conflict and promoting dialogue-based conflict resolution mechanisms; essentially, its a flagship project within Agenda 2063 focused on creating a peaceful Africa through conflict prevention and resolution.\n\nFurther, the summit urged political and diplomatic leaders engaged in the conflict to collaborate in a unified dialogue effort.\n\nThis includes backing the Luanda Process and the United Nations Organisation Stabilisation Mission in the DRC (MONUSCO) to help restore peace and security in Eastern DRC.\n\nBoth the African Union and the United Nations have called for a peaceful resolution to the conflict in DRC, which threatens to throw the whole of the Great Lakes region into a wider conflagration.\n\nAhead of the joint summit, President Mnangagwa has said he is determined to ensure that guns are silenced in the region.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE1-1.jpg",
            "description": "Fungi Kwaramba in DAR ES SALAAM, Tanzania SADC Chairperson President Mnangagwa will today chair a joint summit of SADC and the East Africa Community (EAC) along with EAC Chairperson Kenyan President William Ruto to persuade all involved in the Democratic Republic of Congo conflict to lay down arms and return the eastern parts of the […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Chigudu declared national hero",
            "url": "https://www.herald.co.zw/chigudu-declared-national-hero/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nFormer Zanu PF provincial chairperson for Manicaland and career civil servant, Cde Tinaye Elisha Nzirasha Chugudu, who died on Wednesday, has been declared a national hero in honour of his contribution to the country before and after independence.\n\nPresident Mnangagwa has since sent a message of condolence to the Chigudu family, describing him as a principled man.\n\nZanu PF Politburo member, Cde Supa Mandiwanzira, was dispatched by the President yesterday to deliver the message of the decision by the party to declare Cde Chigudu a national hero at the deceaseds Mount Pleasant residence in Harare.\n\nCde Mandiwanzira was accompanied by the partys Central Committee member, Dr Jenfan Muswere, who is Information, Publicity and Broadcasting Services Minister and Makoni West legislator.\n\nFormer Buhera North legislator and Zanu PF Central Committee member, Cde William Mutomba, was among mourners at the funeral wake.\n\nPresident Mnangagwa said Cde Chigudu demonstrated bravery when he became one of the first cadres to be trained to fight in the liberation struggle.\n\nI received with deep sorrow and sadness, news of the untimely death of Cde Tinaye Elisha Nzirasha Chigudu, a veteran of our liberation struggle, former Permanent Secretary in the Ministry of Home Affairs, former Governor of Manicaland Province and former ZANU PF Manicaland Provincial Chairman, he said.\n\nCde Chigudu was among the brave sons and daughters of the soil who took a stand and fought for the Independence of Zimbabwe.\n\nHe was one of the first combatants to be sent for training in North Korea under the Zimbabwe Peoples Revolutionary Army (ZPRA), the military wing of the Zimbabwe African Peoples Union (ZAPU).\n\nPresident Mnangagwa said Cde Chigudu demonstrated his bravery when he was deployed as an intelligence operative in the then Salisbury.\n\nThe critical information he gathered regarding the modus operandi of the racist Rhodesian forces assisted the guerilla operations and recruitment of young Zimbabweans for training.\n\nCde Chigudu, said President Mnangagwa, was arrested and imprisoned for 12 years for his revolutionary role.\n\nAs he pursued the important mission, Cde Chigudu was captured and imprisoned for 12 years by the Rhodesian regime. After his release from prison, Cde Chigudu crossed into Zambia, reunited with his fellow comrades and resumed his duties and chores of the armed war of liberation.\n\nCde Chigudu was a principled cadre who served the ruling ZANU PF Party and the Government with unquestionable allegiance, loyalty and dedication, he said.\n\nPresident Mnangagwa described him as a fountain of wisdom who offered wise counsel and advice in conducting both party and Government business, drawing from his vast experiences.\n\nOn behalf of the party, ZANU PF, Government, my family and on my behalf, I wish to express my deepest, heartfelt condolences to the Chigudu Family on this sad loss.\n\nMay the family derive comfort from the contribution he made to this great nation. In recognition of his immense contribution to our nation, both before and after Independence, the ZANU PF Politburo agreed to accord him the status of national hero. May his dear soul rest in eternal peace, said President Mnangagwa.\n\nIn his message to mourners yesterday, Cde Mandiwanzira, who is also Nyanga South legislator, said there was unanimity among Politburo members when the issue of the hero status of Cde Chigudu came up for discussion.\n\nI have come here with a message from His Excellency, President Mnangagwa, who said he was deeply touched by the death of Cde Chigudu. He said Cde Chigudu ought to be conferred with the highest honour of a national hero owing to his contribution.\n\nWhen President Mnangagwa consulted his colleagues, there was unanimity that he deserved to be a national hero, said Cde Mandiwanzira.\n\nHe said Cde Chigudu remained principled and never wavered up until the end.\n\nUnlike cadres who made huge contributions but later deviated from the ethos of the liberation struggle, Cde Chigudu remained steadfast, said Cde Mandiwanzira.\n\nCde Chigudus brother, Mr Tafiramambo Chigudu, said the family felt humbled by the decision of the party and Government to confer their relative the highest honour.\n\nI want to thank the President, the party and the Government for the honour conferred on our relative.\n\nWe do not take this honour for granted because not every person is granted that honour. We are elated as a family, said Mr Chigudu.\n\nIn an interview, his widow, Mrs Ester Chigudu, described him as a loving husband and father.\n\nHe helped a lot of people in the family even within the extended family. His death is quite painful. He has been unwell for a long time, she said.\n\nHis daughter, Rudo, said her father was determined to see them prosper and do well in education.\n\nCde Chigudu was born on August 13, 1942. He had his early education at Chigudu School, Cyrene Mission and Harare Secondary School where he was expelled in 1964 because of his political activism.\n\nHe left the country in 1964 and went to Zambia under ZAPU. He then trained guerilla warfare in the Democratic Republic of Korea as a ZIPRA cadre.\n\nUpon his return he was deployed in the country as an intelligence officer. In May 1965, he was captured and detained in Gonakudzingwa, Gweru and finally Whawha.\n\nHe was in detention for 12 years and was released in 1977 and exiled. He went to the UK and was enrolled at Exeter University where he studied law between 1978 and 1981.\n\nOn coming home, he joined the civil service, first as under Secretary (Legal Affairs) Ministry of Transport from 1981. He was appointed Deputy Secretary for the Ministry of Home Affairs and then Permanent Secretary in the same Ministry from 1994 to 2004.\n\nHe later became Permanent Secretary for Mines and Mining Development from 2004 to 2005. He was then appointed Governor and Resident Minister of Manicaland in 2005 and retired in 2008.\n\nHe is the former ZANU PF provincial chairman of Manicaland and worked as a senior consultant under the United Nations Development Programme to structure the Ministry of Interior for South Sudan.\n\nAt the time of his death, he was farming in Makoni District.\n\nHe is survived by his wife, Mrs Esther Chigudu and seven children.\n\nMourners are gathered at Number 9, Belsize Close, Northwood, Mount Pleasant in Harare.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TC1.jpg",
            "description": "Zvamaida Murwira, Senior Reporter Former Zanu PF provincial chairperson for Manicaland and career civil servant, Cde Tinaye Elisha Nzirasha Chugudu, who died on Wednesday, has been declared a national hero in honour of his contribution to the country  before and after independence. President Mnangagwa has since sent a message of condolence to the Chigudu family, […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "President praises outgoing AfDB boss Adesina",
            "url": "https://www.herald.co.zw/president-praises-outgoing-afdb-boss-adesina/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nThrough unity, hard honest work, innovation and resilience, Africa can become a modernised and industrialised continent that is truly food and energy secure, peaceful and independent, President Mnangagwa said yesterday.\n\nIn his congratulatory message to African Development Bank (AfDB) president Dr Akinwumi Adesina, who will be leaving the post this year after having served at the helm of the continents development bank for the last 10 years, the President said Dr Adesina had served with distinction.\n\nHe had reignited a sense of hope and confidence in what Africa can achieve, leveraging on its abundant natural resources.\n\nOn behalf of the people and Government of Zimbabwe, and indeed on my own behalf, I congratulate the untiring son of Africa and Africas Optimist-in-Chief, Dr Akinwumi Adesina, for the 10 years of exceptional leadership as President of the African Development Bank Group. Congratulations, Mr President, he said.\n\nIn his 10 years of astute and steadfast service to our continent and the peoples of Africa, Dr Adesina has made us shift our perspectives towards the meaning of development finance. He reignited, among us, a new sense of hope and confidence in what we can achieve as an African people, leveraging on our resources.\n\nPresident Mnangagwa urged the youth and future generations to emulate the passion for Africas development exhibited by Dr Adesina.\n\nThe President appointed the AfDB chief as the Champion of Zimbabwes arrears clearance and debt resolution platform in 2022, a task he undertook with impeccable zeal and commitment.\n\nThis being his farewell year, I challenge current and future generations, the youth and women, to cherish the work of Dr Adesina and many other illustrious sons and daughters of Africa, as we work hard to realise a thriving and prosperous continent.\n\nThrough unity, hard honest work, innovation and resilience, we can realise a modern and industrialised Africa, that is truly food and energy secure, peaceful and independent.\n\nIn 2022, I was pleased to appoint Dr Adesina as the official Champion of the Zimbabwe Arrears Clearance and Debt Resolution process. He has undertaken this arduous task on behalf of my administration with impeccable zeal and commitment, said President Mnangagwa.\n\nAs the Champion of Zimbabwes arrears clearance and debt resolution process, Dr Adesina saw through constructive dialogue and the bringing together of all parties concerned. This has aided the Second Republic in deepening its engagement and re-engagement within the comity of nations.\n\nPresident Mnangagwa said Zimbabwe, as an agro-based economy, had benefitted immensely from Dr Adesinas agriculture credentials and mission to transform Africas rural farmlands into regions of prosperity.\n\nUnder his leadership, the Banks flagship, Technologies for African Agricultural Transformation (TAAT) was launched, delivering climate-smart and weather-resilient staple seeds to more than 40 million smallholder farmers across 30 countries on the continent.\n\nThis is set to see Africa produce an extra 120 million tonnes of food by the end of 2025, he said.\n\nUnder Dr Adesinas leadership, the continents premier development finance institution had grown into a global, award-winning brand.\n\nResultantly, the bank has become a reputable development finance partner of choice. Under his leadership, the African Development Bank Group has emerged as a global champion of inclusive green growth food security, climate-smart infrastructure, energy access for millions of Africans and financial innovation, he said.\n\nThe President went on to describe Dr Adesina as an iconic, true son of Africa.\n\nHaving known and interacted with Dr Adesina for many years, I applaud the numerous milestones he has achieved during his illustrious career.\n\nHe stands tall as one of the iconic and true sons of Africa, always advancing Africas cause and interests. Undoubtedly, his footprint and impact on Africa to realise its development aspirations will remain indelible\n\nMr President, Africa, and Zimbabwe, express their profound gratitude and thank you for your selfless, bold, decisive and dedicated service to our mother continent of Africa and her peoples.\n\nCongratulations once again, Your Excellency, Dr Adesina, for your exceptional leadership during your tenure at the helm of the African Development Bank. I wish you continued success in the years ahead, said President Mnangagwa.\n\nSince assuming the reins at the AfDB in 2015, Dr Adesina, a World Food Prize laureate, has been instrumental in attracting global investment, spearheading innovative development strategies, and consistently positioning Africa as a continent of immense potential and opportunity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/05/Dr-Akinwumi-Adesina.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter Through unity, hard honest work, innovation and resilience, Africa can become a modernised and industrialised continent that is truly food and energy secure, peaceful and independent, President Mnangagwa said yesterday. In his congratulatory message to African Development Bank (AfDB) president Dr Akinwumi Adesina, who will be leaving the post this year […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "‘No problem with Zacc getting certificates to prosecute cases’",
            "url": "https://www.herald.co.zw/no-problem-with-zacc-getting-certificates-to-prosecute-cases/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nThe National Prosecuting Authority will issue the Zimbabwe Anti-Corruption Commission (ZACC) with prosecutorial certificates should they want to prosecute cases.\n\nFor the certificates to be issued, ZACC must be prepared to adhere to prosecutorial guidelines which include a separate prosecution team from the investigators doing the court work.\n\nIn an interview, Prosecutor General Justice Loice Matanda-Moyo said she believed in team work and had no problem with issuing prosecuting certificates to ZACC or any other competent authority.\n\nOver the years, ZACC has been saying it wanted prosecutorial powers as part of efforts to effectively deal with the corruption scourge in the country.\n\nThe investigating arm said the prosecution of cases was sometimes stalled at the NPA, an arm which is also seized with other crimes that might not be related to corruption.\n\nIn an interview this week, Justice Matanda-Moyo said she had no problem issuing prosecuting certificates to ZACC.\n\nIf they want to prosecute matters, they can approach me, I have got powers to issue prosecution certificates, as long as they have a set department which is different from investigations so that we do not have an outcry from the public to say the same person who is investigating is the same person prosecuting, said Justice Matanda-Moyo.\n\nSo I do not see any problem. Because as NPA, we do not hoard the right to prosecute.\n\nI believe in teamwork, so the more people we have on board, the better.\n\nAs long as they report to the Prosecutor General and are bound by our prosecutorial guidelines, follow the guidelines on how we prosecute matters and how we reach decisions on whether a matter can be prosecuted or a matter cannot be prosecuted.\n\nIt is simply a question of that distinction so that there will be no outcry. Personally I do not hold views against getting lawyers from ZACC to prosecute matters here at NPA.\n\nShe said as NPA, they sometimes prioritise crimes that might be prevalent at a given time such as armed robberies and murder and might focus on such crimes ahead of other crimes in their effort to make society safe.\n\nIf another arm, which might be competent in prosecuting crime comes forth, she said, there was nothing wrong with that.\n\nThere might be times when cases of armed robbery are prevalent like now or murder cases might be rife, so we might take a deliberate position to concentrate on such cases, said Justice Matanda-Moyo.\n\nZACC has in the past said it was keen to have prosecutorial powers conferred on it to speed up corruption cases.\n\nThey have also argued that they sometimes did not agree with decisions not to prosecute cases that would have been submitted to the NPA.\n\nZACC has said it was surprised to see prosecutions declined when in their view, they would have attended to all possible areas of the law.\n\nIt was on that basis that ZACC felt that it required prosecuting powers to help expedite cases and push them before courts of law.\n\nLately, the NPA and ZACC have been at loggerheads, after the former withdrew charges against Harare City Council Town Clerk Hosiah Chisango and four others over a $9 million street lights tender.\n\nZACC felt that Chisango and the five others have a case to answer and is now preparing new charges against them.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/07/2607-1-1-LOICE-MATANDA-MOYO.jpg",
            "description": "Zvamaida Murwira, Senior Reporter The National Prosecuting Authority will issue the Zimbabwe Anti-Corruption Commission (ZACC) with prosecutorial certificates should they want to prosecute cases. For the certificates to be issued, ZACC must be prepared to adhere to prosecutorial guidelines which include a separate prosecution team from the investigators doing the court work. In an interview, […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "President affirms commitment to wetland conservation",
            "url": "https://www.herald.co.zw/president-affirms-commitment-to-wetland-conservation/",
            "content": "Mashudu Netsianda recently in HWANGE\n\nZIMBABWE has reaffirmed its commitment to wetland conservation and sustainable management, with the Government crafting various legal instruments to guide wetland protection efforts.\n\nIn a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri on Thursday during the belated 2025 World Wetlands Day commemorations at Kasibo area in Hwange District, Matabeleland North, President Mnangagwa said his administration had put in place a raft of measures and an ambitious plan for wetland management by increasing the area under sustainable management.\n\nThe annual event is observed every February 2 in recognition of the importance of wetlands and their role in environmental sustainability and economic resilience.\n\nThe day marks the adoption of the Convention on Wetlands on February 2, 1971, in the Iranian city of Ramsar, on the shores of the Caspian Sea. This years commemorations were held under the theme: Protecting Wetlands for Our Common Future.\n\nZimbabwe is one of the 173 contracting parties to the Convention on Wetlands, having ratified it in 2014.\n\nPresident Mnangagwa said the various measures implemented by the Government to enhance wetland conservation include increasing the area under sustainable wetland management in alignment with the National Development Strategy 1 (NDS1), the Wetland Rehabilitation Rolling Plan (2021-2025), and the National Biodiversity Strategy and Action Plan (NBSAP).\n\nThe National Wetlands Policy and the Environmental Management Act (Chapter 20:27) serve as key legal frameworks guiding wetland protection efforts.\n\nPresident Mnangagwa highlighted the critical role of wetlands in securing water sources and sustaining livelihoods.\n\nAs much as there is still a lot of work to be done to reverse the legacy of past actions that were detrimental to the integrity of our wetlands, our commitment to transformative and progressive sustainable wetland management is evident in the policy and administrative direction we are taking, he said.\n\nThe National Wetlands Policy outlines our aspirations to sustainably manage these vital resources, and the Environmental Management Act (Chapter 20:27) remains our principal legal instrument guiding wetland management in the country, said President Mnangagwa.\n\nZimbabwe is one of the 173 contracting parties to the Convention on Wetlands, having ratified it in 2014. This demonstrates our full commitment to ensuring that our wetlands remain pristine and capable of regenerating naturally.\n\nPresident Mnangagwa warned that wetlands globally face unprecedented threats due to rapid urbanisation, agricultural expansion, pollution, deforestation, and climate change. He stressed that these factors jeopardise the environmental services provided by wetlands, posing a risk to communities that rely on them.\n\nThe protection of wetlands for posterity remains unquestionable. No single individual, organisation, or government can tackle this challenge alone, he added.\n\nIt requires collective efforts from all sectors of society, including the public and private sectors, local communities, and international partners.\n\nCalling for increased environmental education, particularly among young people, he stressed the need to cultivate a new generation committed to preserving these vital ecosystems.\n\nZimbabwe is set to host the 15th Meeting of the Conference of the Parties to the Convention on Wetlands (COP15) in Victoria Falls in July this year.\n\nAs Zimbabwe, we stand tall and proud as a leader in wetland conservation.\n\nHosting COP15 at Victoria Falls, one of the Seven Wonders of the World and a designated Ramsar site, is an honour and an opportunity to showcase our dedication to environmental stewardship, said the President.\n\nThe future of our wetlands is in our hands, and so is our future. Let us protect wetlands for our common future. Value wetlands. Protect wetlands. Inspire others to value and protect wetlands, he said.\n\nThe event was attended by the Secretary General for the Convention on Wetlands, Dr Musonda Mumba, who is based in Switzerland; the Minister of Environment, Climate and Wildlife, Dr Sithembiso Nyoni; the Permanent Secretary for Matabeleland North Provincial Affairs and Devolution, Mrs Sithembile Ncube; the President of the Chiefs Council, Chief Mtshane Khumalo (Sen); Environmental Management Agency (EMA) officials; local traditional leaders; and senior Government officials, among others.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-6.jpg",
            "description": "Mashudu Netsianda recently in HWANGE ZIMBABWE has reaffirmed its commitment to wetland conservation and sustainable management, with the Government crafting various legal instruments to guide wetland protection efforts. In a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri on Thursday during the belated 2025 World Wetlands Day commemorations at Kasibo area in Hwange […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Women’s League backs President’s vision for 2030",
            "url": "https://www.herald.co.zw/womens-league-backs-presidents-vision-for-2030/",
            "content": "Mutsawashe Mashandure, Herald Correspondent\n\nThe ZANU PF Womens League has joined the growing calls for President Mnangagwa to remain in office until 2030 so he finishes his game-changing infrastructural developments.\n\nSpeaking at a Womens League meeting at the revolutionary partys headquarters in Harare yesterday, ZANU PF Womens League Secretary for Womens Affairs, Cde Mabel Chinomona said at its Annual National Peoples Conference last year, the ruling party adopted Resolution Number 1, among others, which calls on the President to continue until 2030.\n\nThe meeting was called to equip female ministers with ways to develop women across the country.\n\nCde Chinomona said that the Womens League supports the resolution to have President Mnangagwa remaining in charge until 2030.\n\nShe took the opportunity to chide some malcontents that are criticising the resolution, especially on social media.\n\nWe condemn those people who oppose our Presidents vision, because if the President does not fulfil the vision, we will not be able to see the achievements.\n\nBut if we allow him to lead, we will enjoy the fruits of becoming an upper-middle-income country by 2030 when everyone will have an improved living standard. Lets leave those who are criticising our President but as the Womens League, we will support our President, whom we love, said Cde Chinomona.\n\nZanu PF Secretary for Womens League Cde Mabel Chinomona(left), addresses members of the Womens Leagues female ministers and deputy ministers while flanked by her deputy Cde Judith Ncube (second from left) and the Leagues Secretary for Administration Cde Monica Mutsvangwa (third from left) and the Minister of Veterans of the Liberation Struggle Affairs, Dr Monica Mavhunga(right), during a meeting at the party headquarters in Harare yesterday.- Charles Muchakagara.\n\nShe added that as party deployees, the women ministers are expected to be responsive to the party.\n\nI was happy that every province has endorsed the Number 1 resolution that the sitting President will be there until 2030 so that the President can be able to accomplish his goal, and the people will see the vision in a better way, she said.\n\nThe party wings including the War Veterans League, Youth League and all the governing partys 10 provinces, have rallied behind Resolution Number 1 to have the President remain in office until 2030.\n\nCde Chinomona appreciated the women ministers for taking time out of their busy schedules to attend the meeting.\n\nWe are very busy and we appreciate the sacrifice you have made to be here with us today. This shows your dedication to our party. We are all here because we share a common goal, that of advancing the interests and well-being of women through our respective ministries, she said.\n\nShe said there was need to identify opportunities that exist in the ministries that should benefit women across the country.\n\nWe understand that gender desks have been set up in Government ministries, and we would like to have an insight into their roles in promoting and implementing economic empowerment policies for women, gender equality, gender-based issues and promoting support services for women and girls, she said.\n\nCde Chinomona said there was need to collaborate and work as a united force to promote, empower and protect women.\n\nWe look forward to engaging in productive and meaningful discussions and are confident that together we can achieve great things, she said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/WL1.jpg",
            "description": "Mutsawashe Mashandure, Herald Correspondent The ZANU PF Women’s League has joined the growing calls for President Mnangagwa to remain in office until 2030 so he finishes his game-changing infrastructural developments. Speaking at a Women’s League meeting at the revolutionary party’s headquarters in Harare yesterday, ZANU PF Women’s League Secretary for Women’s Affairs, Cde Mabel Chinomona […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Zim attains 100 percent maize hectarage",
            "url": "https://www.herald.co.zw/zim-attains-100-percent-maize-hectarage/",
            "content": "Patience Maturure\n\nAgriculture Reporter\n\nFARMERS have heeded Governments directive to increase cereal production to enhance both household and national food security and planted 1, 8 million hectares of a maize crop reported to be in good condition.\n\nLands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka revealed this recently at a field day hosted by a 90-year old widow, Gogo Emily Marimira Nherara at her homestead in Goromonzi districts ward 12.\n\nGogo Marimira has five Pfumvudza/Intwasa plots, three of which have maize while the remaining two have groundnuts and finger millet separately. She had been a beneficiary of the Pfumvudza/Intwasa programme since 2020 and has been scoring successful harvests.\n\nHis Excellency President Mnangagwa has set a target of 1, 8 million hectares of maize for the 2024/25 season and the nation has managed to reach a maximum of 1, 786 million hectares which is 99 percent, he said.\n\nThe Minister is on a countrywide tour to assess the condition of crops, as the country seeks to replenish the strategic grain reserve (SGR) and ensure adequate food and nutrition security.\n\nWe are on a countrywide tour to assess the crop condition to ascertain whether the Presidents wish and vision for the season will be fulfilled.\n\nWe have visited most parts of the country. The crop condition, especially maize, is good in all provinces, he said.\n\nThe Minister said 1, 8 million hectares of maize must be able to provide a minimum of 2, 7 million tonnes of the crop, as the condition is extremely good.\n\nFor cereal production we have targeted 3, 2 million hectares countrywide and I promise you that we will be able to achieve it, he said.\n\nThe good crop condition is expected to continue in that state as the meteorological services department (MSD) has indicated that the country will receive significant rainfall from next week onwards.\n\nMin Masuka advised farmers who have not yet completed planting and weeding to speed up their activities, as the rains are expected to end mid-March.\n\nIf you want to do sweet potatoes and perhaps very ultra early sunflower and African peas, you can do so now.\n\nThe rains are expected to taper off by about mid-March so this looks like its going to be a very good season for the country, the Minister added.\n\nThe rains augur well for the countrys food and nutrition security, livelihood improvement and the countrys agro-based economy.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Anxious-Masuka.jpeg",
            "description": "  Patience Maturure Agriculture Reporter FARMERS have heeded Government’s directive to increase cereal production to enhance both household and national food security and planted 1, 8 million hectares of a maize crop reported to be in good condition. Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka revealed this recently at a field […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Munetsi, Kundiona moves bode well for Zim sport",
            "url": "https://www.herald.co.zw/editorial-comment-munetsi-kundiona-moves-bode-well-for-zim-sport/",
            "content": "IT has been a rare and refreshing week for Zimbabwean sport, with two of the countrys top football and rugby players featuring prominently on the transfer market for their respective disciplines.\n\nZimbabwe senior soccer team midfielder and vice captain Marshall Munetsi surprised many, including the Warriors faithful, when he sealed an international transfer deadline day switch from French Ligue 1 club Stade Reims to English Premiership side Wolverhampton Wanderers.\n\nBy his own admission, Munetsi, fulfilled a career dream by making his move to Wolves and making the clubs fabled stadium  Molineux home.\n\nZimbabweans have watched few of their countrymen in the English Premier League lately and with national captain Marvelous Nakambas Kuton Town having been relegated, fans will be excited to see the 28-year-old Munetsi in action in what is regarded the worlds best football league.\n\nMunetsi could be in action as soon as Wednesday when Wolves face current log leaders Liverpool.\n\nBut more importantly for Zimbabwe is to have as many of our players playing in the elite leagues as possible.\n\nThere is no doubting that the experience and the competitive edge that one gets from playing in the English Premiership will have a rub-on effect on his Warriors teammates.\n\nIn fact, we believe that Munetsis dream move should also spur on the newly-elected ZIFA board to quickly review their development programmes and ensure the country produces more talented players capable of playing in the worlds top leagues.\n\nPrevious ZIFA boards somehow always shunned junior football, to the extent of even withdrawing the youth teams from the Confederation of African Football (CAF) and COSAFA competitions.\n\nThe negative results have been there for all to see with the number of players leaving the domestic league for the South African Premiership and to Europe dwindling over the years.\n\nYet we, no doubt need more players playing in the worlds best leagues which include the English Premiership, the German Bundesliga, Spanish LaLiga, Italian Serie A and the French top-flight.\n\nThe more players the country has in the top professional leagues, the greater the chances the Warriors have of not only lifting the Africa Cup of Nations but also securing qualification to the World Cup.\n\nWhile the Warriors have been to the AFCON on five occasions, it has been evident that they came short on quality when compared to such countries like Cote dIvoire, Nigeria, Cameroon, Morocco, Ghana, Senegal and Tunisia, who have featured regularly at the World Cup.\n\nThus, Munetsis transfer to a more challenging league should also be sweet news for Warriors coach Michael Nees in the year that he will guide Zimbabwe at the AFCON tournament in Morocco in December.\n\nWhile ZIFA, who should embrace and acknowledge the hard work being done by the top local academies, look to revive the development programmes and come up with new strategies, for the elite level, Nees has had to rely more on talent that is being fine-tuned in leagues such as Munetsis English Premiership and Jordan Zemuras Serie A.\n\nMunetsis move has also given hope that there will be a Zimbabwean name when the next transfer window opens.\n\nIn the same vein that the football fraternity has been celebrating Munetsis move, it is all smiles in the closely knit rugby family.\n\nThis comes as senior national rugby team tight head prop Cleopas Kundiona also made a switch from a French league to England.\n\nWhile Kundiona is naturally excited about the future after sealing a move to reigning English Rugby champions, Northampton Saints, his move also comes as a boost for the Zimbabwe team.\n\nThe 26-year-old prop who has spent the last three years in the French Pro D2 with USON Nevers after joining them from third-tier side SO Chambry, will be a key member of the Zimbabwe Sables.\n\nKundiona, has previously had a two-year stint at South African giants Sharks but is now set to make the biggest move of his career by joining Northampton at the end of the current season.\n\nHis move comes in a crucial year for Zimbabwe rugby.\n\nThe Sables will be one of eight teams battling for the sole ticket to the 2027 Rugby World Cup in Australia.\n\nAlthough they are the defending African Champions, the Sables must retain the Africa Cup as only the winners of that silverware will get automatic qualification.\n\nThis is why having players like Kundiona being signed by the top professional clubs, augurs well for national coach Piet Benade and his troops.\n\nZimbabwe has the pedigree to end a three-decade wait to qualify for the World Cup and those hopes can only be turned into reality if more and more of the countrys rugby players are in competing in the top echelons of the game.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Marshall-Munetsi-Wolves-680x380.jpg",
            "description": "IT has been a rare and refreshing week for Zimbabwean sport, with two of the country’s top football and rugby players featuring prominently on the transfer market for their respective disciplines. Zimbabwe senior soccer team midfielder and vice captain Marshall Munetsi surprised many, including the Warriors faithful, when he sealed an international transfer deadline day […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "FIFA coming back to assist ZIFA",
            "url": "https://www.herald.co.zw/fifa-coming-back-to-assist-zifa/",
            "content": "Eddie Chikamhi, Zimpapers Sports Hub\n\nA DELEGATION from FIFA is expected in the country tomorrow to facilitate an induction programme that should assist the newly elected ZIFA executive committee to settle into their tasks of transforming and administering the football association.\n\nBusinessman and philanthropist Nqobile Magwizi heads an expanded ZIFA executive commonly known as the board.\n\nIt is ZIFAs first elected board since Felton Kamambo in 2018.\n\nThe world football governing body supervised and gave the thumbs up to the elections that were conducted to mark the end of the Normalisation Committees tenure at the helm of the domestic football mother body.\n\nWhile the board, which looks a dynamic unit comprising virtually new faces, is still trying to find their feet, FIFA have wasted no time in dispatching a team to help show them the direction especially on governance matters.\n\nZIFA president Magwizi said they were eagerly anticipating the visit by the FIFA officials.\n\nWe will be receiving members from FIFA who are coming to Zimbabwe to carry out a comprehensive induction of all the executive Committee members, said Magwizi.\n\nThey are arriving on Sunday (tomorrow), and they will be with us the whole week. After this induction, we are also going to have some of the activities that will be happening in parallel.\n\nWe are also going to have a strategy session after the induction, which shapes the vision, which we are hoping that once we are done with our strategy for five years, we can then come and present to SRC, of course, even for sign-off, and get us going.\n\nThe ZIFA board has been vacant since 2022 when Felton Kamambo and his executive committees tenure expired.\n\nThe chaos surrounding Kamambos final moments in office resulted in the suspension of Zimbabwe by FIFA and the appointment of a Normalisation Committee that was led by Lincoln Mutasa.\n\nAs part of the normalisation process elections were held two weeks ago and Magwizi was an overwhelming favourite with the electoral committee following a landslide victory that saw him polling 61 out of the 72 valid votes cast.\n\nThe other members of the board that was ushered into office on January 25 are the two vice-presidents Kennedy Ndebele and Loveness Mukura; board members Kudzai Kadzombe, Alice Zeure, Tafadzwa Benza, Thomas Marambanyika, Brighton Ushendibaba and Davison Muchena.\n\nThis ZIFA board is faced with significant challenges, having inherited a difficult past characterised by boardroom squabbles, corruption, abuse of office, sexual harassment of female officials, legacy debts, poor planning, lack of professionalism and accountability.\n\nZIFA also endured international isolation for 18 months with FIFA lifting the suspension on July 11 2023 when the world body appointed Lincoln Mutasas Normalisation Committee.\n\nMagwizi said the transition was already in progress, with the strengthening of the ZIFA structures.\n\nWe are still getting on our feet; were still getting our shoes on, but weve begun running, said Magwizi.\n\nWeve had, I think, about four meetings. One of the first things that weve already done is weve brought in an auditor who is doing the balances for us, which is just for the transition.\n\nSo, we went through the processes, and weve appointed one of the audit firms to come and assist us with the balances, the current balances from the previous administration to the new administration.\n\nThe second thing weve done is that all the members of the ZIFA Executive Committee have resigned from their positions in the ZIFA structures in order to meet the requirements of corporate governance.\n\nThey are all now purely focusing on their roles in the ZIFA Executive Committee.\n\nA ZIFA board meeting has been lined up for the coming days to prepare for an EGM which is set to ratify the various committees that have been set up so that the assembly can be fully constituted.\n\nThey include the standing committees as well as the independent committees. One of the key committees that we need ratified in that EGM is the electoral committee.\n\nThat then should oversee the elections at PSL as well as for the women and any other affiliates that require those elections to be done, said Magwizi.\n\nFIFA, who have since extended congratulatory messages to ZIFA through the president of the world football organisation Gianni Infantino and secretary general Mattias Grafstrom.\n\nI am very pleased to extend my warmest congratulations on your recent election as president of the Zimbabwe Football Association, wrote Grafstrom.\n\nI look forward to building a strong and collaborative relationship with you and your team as we work together to promote and develop the beautiful game of football in Zimbabwe and in Africa.\n\nTogether with the whole FIFA Team, we are here for you and remain available to help you implement your vision and through our different programmes, further strengthen the game at all levels.\n\nI also wish to congratulate the members of the Executive Committee elected alongside you, whose experience and commitment will play an essential role in supporting your decisions and guiding your federations future.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/07/Nqobile-Magwizi.jpg",
            "description": "Eddie Chikamhi, Zimpapers Sports Hub A DELEGATION from FIFA is expected in the country tomorrow to facilitate an induction programme that should assist the newly elected ZIFA executive committee to settle into their tasks of transforming and administering the football association. Businessman and philanthropist Nqobile Magwizi heads an expanded ZIFA executive commonly known as the […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        },
        {
            "title": "Traffic Training Centre commissioned in Chivhu",
            "url": "https://www.herald.co.zw/traffic-training-centre-commissioned-in-chivhu/",
            "content": "Freeman Razemba and Victor Maphosa\n\nGovernment has inaugurated a Traffic Training Centre in Chivhu, reinforcing its commitment to road safety in alignment with President Mnangagwas principle of leaving no one and no place behind.\n\nThe centre, built by the Traffic Safety Council of Zimbabwe (TSCZ), was officially opened by Transport and Infrastructural Development Minister Felix Mhona yesterday.\n\nThe event took place at Hokonya Primary School and was attended by senior Government officials.\n\nMinister Mhona expressed enthusiasm for the new facility, emphasising its role in promoting road safety.\n\nThis training centre has become a central watershed for road safety in this part of the country. It serves as a train-the-trainers centre where teachers, students, and the public can gain knowledge to influence others, he said.\n\nMinister Mhona highlighted the multi-stakeholder responsibility of road safety management, noting that the development of Traffic Training Centres aims to address the limitations learners face regarding safe participation on the roads.\n\nThe objective is to give learners an opportunity to acquire knowledge and practice safer road use methods in a safe simulated traffic situation, he said.\n\nThe Minister assured guests at the ceremony about Governments ongoing support for the TSCZ.\n\nHe said new regulations, such as the requirement for Public Service Vehicle drivers to be at least 30 years old, have been implemented to enhance safety on the roads.\n\nLet me underscore the need for everyone to join hands with us in our quest to promote road safety and to put measures to avoid the continuous loss of lives in our country, he said.\n\nMinister of State for Provincial Affairs and Devolution for Mashonaland East, Aplonia Munzverengwi, represented by Mr Douglas Dzukwa, praised the initiative as critical for improving traffic management systems and reducing road accidents.\n\nThis state-of-the-art facility is equipped with modern technology and trained personnel to ensure effective traffic monitoring and enforcement, she said.\n\nMinister Munzverengwi highlighted the need for such infrastructure, especially given the provinces history of road accidents, particularly along the Harare-Marondera and Harare-Masvingo highways.\n\nMr Kura Sibanda, TSCZ chairperson, remarked on the significance of the centre in achieving the United Nations goal of reducing road carnage.\n\nHe emphasised the importance of early education in road safety, particularly for vulnerable road users such as children.\n\nHe noted alarming statistics from the Zimbabwe Republic Police, which reported that in the first half of 2022, there were 124 road traffic crashes near schools, resulting in 24 fatalities and 32 injuries among children.\n\nThe construction of this Traffic Training Centre remains an important factor in aiding the provision of road safety education to school children, he said.\n\nMr Sibanda stressed that children have unique physical and mental characteristics that limit their ability to handle complex traffic situations.\n\nIt is our responsibility as adults to protect our children and equip them with knowledge concerning road safety, he added.\n\nThe Chivhu Traffic Training Centre stands as a beacon of hope in promoting road safety education, equipping future generations with the knowledge they need to navigate traffic safely.\n\nThrough collaboration and commitment, the Government and local authorities aim to foster a safer environment for all road users.\n\nAs the centre begins its operations, there is optimism that it will make a tangible difference in reducing road accidents and enhancing the overall safety of the roads in Zimbabwe.\n\nThe initiative reflects a broader commitment to not only safeguard lives but also to encourage responsible behaviour among road users, thereby contributing to the long-term vision of a safer, more informed society.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TT.jpg",
            "description": "Freeman Razemba and Victor Maphosa Government has inaugurated a Traffic Training Centre in Chivhu, reinforcing its commitment to road safety in alignment with President Mnangagwa’s principle of leaving no one and no place behind. The centre, built by the Traffic Safety Council of Zimbabwe (TSCZ), was officially opened by Transport and Infrastructural Development Minister Felix […]",
            "time": "06:31",
            "date": "08 Feb 2025"
        }
    ]
}