{
    "news": [
        {
            "title": "Zimsec ‘O’ Level results out",
            "url": "https://www.herald.co.zw/zimsec-o-level-results-out-2/",
            "content": "Ivan Zhakata and Tapiwa Chikuhwa\n\nTHE Zimbabwe School Examinations Council (Zimsec) has this Friday released the 2024 November results for Ordinary Level examinations.\n\nAddressing journalists, Zimsec board chairperson Professor Paul Mapfumo said the results will be accessible on the Zimsec portal from 4pm today and will be available for the next five days.\n\nThe Zimbabwe School Examinations Council board and management would like to advise the nation of the release of the 2024 November Ordinary Level examination results, he said.\n\nWith effect from today, 17 January 2025, 4 pm, Ordinary Level examination candidates results will be accessible to all candidates and authorised personnel online through the ZIMSEC portal accessed through the ZIMSEC websitewww.zimsec.co.zw.\n\nPlease take note that this portal will be open for five days only. Heads of examination centres will be able to collect the results for their respective school or centres from our regional offices on Monday, 20 January 2025.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/04/Zimsec.jpg",
            "description": "THE Zimbabwe School Examinations Council (Zimsec) has this Friday released the 2024 November results for Ordinary Level examinations.",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Dynamos Football Club’s founding member’s freedom bid fails",
            "url": "https://www.herald.co.zw/dynamos-football-clubs-founding-members-freedom-bid-fails/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nDYNAMOS Football Club founding member Bernard Marriot Lusengos bid for freedom hit a snag after his application for discharge at the close of the States case was dismissed by Harare magistrate Ms Yeukai Dzuda.\n\nLusengo is facing allegations of corruptly acquiring 51 percent shareholding in the club and allocating other shares to undeserving people who are not the clubs original members.\n\nIn her ruling, the magistrate said Lusengo had a case to answer and ordered that he should be put to his defence.\n\nInvestigations established that Lusengo allegedly declared himself the clubs chairman, and is said to have acted against a High Court order which awarded each founding member one percent share.\n\nThe then High Court judge Justice Luke Malaba gave the order after the ownership wrangle spilled into court in 2005.\n\nMarriot is charged with fraud.\n\nLeslie Gwindi is the complainant in the matter.\n\nMarriot was arrested by the Zimbabwe Anti-Corruption Commission.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/07/dynamos-11.jpg",
            "description": "Prosper Dembedza Herald Correspondent DYNAMOS Football Club founding member Bernard Marriot Lusengo’s bid for freedom hit a snag after his application for discharge at the close of the State’s case was dismissed by Harare magistrate Ms Yeukai Dzuda. Lusengo is facing allegations of corruptly acquiring 51 percent shareholding in the club and allocating other shares […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Construction of NAC Marondera offices progressing well",
            "url": "https://www.herald.co.zw/construction-of-nac-marondera-offices-progressing-well/",
            "content": "Victor Maphosa\n\nMashonaland East Bureau\n\nConstruction of the National Aids Council (NAC) Mashonaland East Provincial offices in Marondera is progressing well, with the whole structure expected to be completed this year.\n\nThe project will gobble about US$4 million.\n\nSecretary for Provincial Affairs and Devolution for Mashonaland East Mr Tavabarira Kutamahufa toured the construction site on Thursday to have an appreciation of the progress being made.\n\nHe was accompanied by Government officials from the province.\n\nI am satisfied with the progress here. The contractor is working around the clock to meet the target so that the intended service can be availed, he said.\n\nThe building will have four floors.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/up.jpg",
            "description": "Victor Maphosa Mashonaland East Bureau Construction of the National Aids Council (NAC) Mashonaland East Provincial offices in Marondera is progressing well, with the whole structure expected to be completed this year. The project will gobble about US$4 million. Secretary for Provincial Affairs and Devolution for Mashonaland East Mr Tavabarira Kutamahufa toured the construction site on […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "President Mnangagwa pays tribute to late Vice President John Landa Nkomo",
            "url": "https://www.herald.co.zw/president-mnangagwa-pays-tribute-to-late-vice-president-john-landa-nkomo/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPresident Emmerson Mnangagwa has called on Zimbabweans to uphold the enduring values of unity and peace championed by the late Vice President Dr John Landa Nkomo.\n\nIn a statement commemorating the 12th anniversary of the late Vice Presidents death, President Mnangagwa said Dr Nkomo was a revolutionary leader, a devoted nation-builder and a tireless advocate for peace whose legacy continues to shape Zimbabwes socio-political landscape.\n\nDr John Landa Nkomo was a man of unparalleled patriotism whose mantra Peace begins with me. Peace begins with you. Peace begins with all of us resonates deeply with our aspirations for a united and peaceful Zimbabwe, he said.\n\nThe late Vice President, who passed on January 17, 2013, was hailed for his illustrious career in public service spanning from the pre-independence nationalist movement to holding key ministerial portfolios after independence.\n\nHis roles included Deputy Minister of Industry and Energy, Speaker of Parliament and Vice President, among others.\n\nPresident Mnangagwa said Dr Nkomo worked in promoting national healing, reconciliation and integration, laying a firm foundation for the countrys stability.\n\nHe urged Zimbabweans to carry forward the legacy of peace and to reject divisive tendencies.\n\nAs we remember Cde John Landa Nkomo, we should forever cherish the peace and tranquillity that has become the cornerstone of our developmental trajectory, he said.\n\nLet us remain united to safeguard the stable democracy crafted by the likes of Dr Nkomo and his revolutionary peers.\n\nDr Nkomos influence extended beyond Zimbabwes borders, with the President recalling his tenure as president of the International Labour Conference in 1993 and chair of the governing body of the International Labour Organisation in 1994.\n\nPresident Mnangagwa reiterated Governments commitment to inclusive development, a principle closely aligned with Dr Nkomos vision for a united and progressive Zimbabwe.\n\nOn its part, the Second Republic is walking the talk by leaving no one and no place behind in delivering on national policies, programmes, and projects, he said.\n\nAs the nation honours Dr Nkomos legacy, his famous words remain a call to action for Zimbabweans to foster peace and unity for generations to come.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-4.jpg",
            "description": "Ivan Zhakata Herald Correspondent President Emmerson Mnangagwa has called on Zimbabweans to uphold the enduring values of unity and peace championed by the late Vice President Dr John Landa Nkomo. In a statement commemorating the 12th anniversary of the late Vice President’s death, President Mnangagwa said Dr Nkomo was a revolutionary leader, a devoted nation-builder […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Court withdraws charges against Dorowa Minerals boss in US$77 000 fraud case",
            "url": "https://www.herald.co.zw/court-withdraws-charges-against-dorowa-minerals-boss-in-us77-000-fraud-case/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nThe Harare Magistrates Court has dropped charges against Dorowa Minerals managing director, James Chigwende, who was accused of defrauding a local company of US$77 000.\n\nChigwende had been jointly charged with his parent company, Chemplex Corporation Limited, for allegedly forging a contract related to the provision of services.\n\nHe was facing forgery charges and appeared before Magistrate Mr Isheunesu Matova.\n\nHis defense lawyer, Mr Moffat Makuvatsine, made an application to have the charges against Chigwende withdrawn as he was not supposed to have been charged in his personal capacity.\n\nThe defense argued that any legal liability should rest with the company, Chemplex Corporation Limited, rather than Chigwende.\n\nThe prosecution conceded to the application, and the charges against Chigwende were withdrawn before he entered a plea.\n\nThe State has now shifted its focus to Chemplex Corporation Limited, which is being represented by its legal manager, Mr Kudakwashe Jenami.\n\nProsecutor Mr Rufaro Chonzi informed the court that the State had obtained the relevant docket and was finalising minor amendments.\n\nThe company has been remanded to February 3, pending the provision of a trial date.\n\nThe case stems from a contractual dispute between Chemplexs subsidiary, Dorowa Minerals, and Coursim Investments, a company owned by Courage Katiyo, the complainant.\n\nOn February 20, Katiyo signed a 90-day fix-and-supply contract with Dorowa Minerals. The contract, facilitated through Chemplex Corporation, involved the erection of a greenhouse shade at Dorowa Minerals Murambinda site.\n\nA payment of US$77 264.19 was supposed to be paid to Coursim Investments. The contract was signed by Katiyo and the acting general manager of Dorowa Minerals at Chemplexs headquarters in Harare.\n\nHowever, witnesses for Dorowa Minerals, stationed at the mine, were unavailable at the time.\n\nThe witnesses, Viznet Ruzvezve and Evans Bonde, signed the contract on February 22 and returned the signed document via email.\n\nKatiyo later received a scanned copy of the signed contract and acknowledged its receipt.\n\nThe business relationship allegedly went sour when contractual breaches emerged, prompting Katiyo to terminate the agreement and send a termination notice to Chemplex via email.\n\nAfter termination, Katiyo demanded payment for the services rendered. Chigwende allegedly disputed the payment claim and presented a contract document that had allegedly been unlawfully altered.\n\nThe State alleged that Chigwende had forged the document by replacing the witnesses signatures and falsely dating them back to February 20.\n\nThis forgery was reportedly used by Chigwende to manipulate the terms of the contract and justify non-payment of the claimed amount.\n\nKatiyo discovered the discrepancies in the contract and accused Chigwende of using the forged document to withhold payment.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Yeukai Karengezeka Court Correspondent The Harare Magistrates Court has dropped charges against Dorowa Minerals managing director, James Chigwende, who was accused of defrauding a local company of US$77 000. Chigwende had been jointly charged with his parent company, Chemplex Corporation Limited, for allegedly forging a contract related to the provision of services. He was facing […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "CVR warns public about fake driver’s licence agents",
            "url": "https://www.herald.co.zw/cvr-warns-public-about-fake-drivers-licence-agents/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nGovernment has warned the public to be wary of fraudsters who are posing as licence agents distributors.\n\nThe scammers send fake text messages and demand payment from prospective individuals in exchange for fake drivers licences.\n\nThey direct people to the Vehicle Inspectorate Department (VID) offices in Eastlea, Harare, where they ask for a certain fee before they disappear.\n\nThe Civil Vehicle Registry (CVR) department confirmed the issue in a statement.\n\nIt has come to the attention of the Central Vehicle Registry (CVR) that a fraudster with the following Econet numbers  0779 171 199 and 0783 123 505  is sending text messages to prospective drivers advising them that their drivers licences are ready for collection.\n\nHe interchanges the following names  Mr Moyo, Mr Sibanda, Mr Nkomo or Mr Dube from VID Eastlea, said CVR in a statement.\n\nOnce the victims arrive in Harare, he directs them to deposit US$50 into either OneMoney, whose details are 0715 107 676 or 0715 107 468 and Ecocash 0786 721 613.\n\nOnce the money is deposited, he then blocks the victim. The public has been urged to be vigilant and report such incidents to the nearest police station.\n\nSecondly, do not deposit any money into an account provided by a stranger. Report to the nearest police station if you are texted by any of the above listed numbers to help the Zimbabwe Republic Police to apprehend the fraudsters, reads the statement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/08/depositphotos_85772112-stock-photo-stamp-fake.jpeg",
            "description": "Freeman Razemba Senior Reporter Government has warned the public to be wary of fraudsters who are posing as licence agents’ distributors. The scammers send fake text messages and demand payment from prospective individuals in exchange for fake driver’s licences. They direct people to the Vehicle Inspectorate Department (VID) offices in Eastlea, Harare, where they ask […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "15 magistrates set to be sworn in at Harare Magistrates Court",
            "url": "https://www.herald.co.zw/15-magistrates-set-to-be-sworn-in-at-harare-magistrates-court/",
            "content": "Yeukai Karengezeka\n\nCourt Correspondent\n\nFifteen new magistrates are set to be sworn in today at the Harare Magistrates Court in a ceremony presided over by Chief Magistrate Mrs Vongai Guwuriro.\n\nThe ceremony marks a significant step in the Judicial Service Commission (JSC)s ongoing efforts to enhance justice delivery across the country.\n\nThis development is expected to have a positive impact on the countrys justice system.\n\nThe coming onboard of more magistrates will help reduce the backlog of cases, ensuring that justice is delivered more efficiently and on time.\n\nFurthermore, the increased number of magistrates will improve access to justice by enabling more courts to operate.\n\nThis will make it easier for citizens to have their cases heard promptly, particularly in areas where courts are currently overwhelmed or understaffed.\n\nThe swearing-in aligns with the JSCs broader mission to promote access to justice for all Zimbabweans by addressing systemic delays and inefficiencies within the judiciary.\n\nBy expanding its capacity, the JSC is taking a significant step towards fostering a more responsive and equitable legal system.\n\nThe ceremony reflects the commitment of the judiciary to uphold its mandate of delivering fair and impartial justice while meeting the needs of the citizens.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-69-680x380.png",
            "description": "Yeukai Karengezeka Court Correspondent Fifteen new magistrates are set to be sworn in today at the Harare Magistrates Court in a ceremony presided over by Chief Magistrate Mrs Vongai Guwuriro. The ceremony marks a significant step in the Judicial Service Commission (JSC)’s ongoing efforts to enhance justice delivery across the country. This development is expected […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Suspected fraudster arrested",
            "url": "https://www.herald.co.zw/suspected-fraudster-arrested/",
            "content": "Crime Reporter\n\nPolice in conjunction with the Southern Africa Regional Anti-Corruption Organisation (SARACO) have arrested a suspected fraudster who was masquerading as a member of the First Family, defrauding several job seekers.\n\nThe suspect, Alizma Chigarande was arrested on January 16, 2025 in Harare by SARACO members who handed him to the police for further investigations.\n\nAllegations are that Chingarande allegedly posed as a member of the First Family and defrauded several individuals after promising them employment at the Harare City Council in exchange for money.\n\nThe suspect was arrested along Coventry Road near Colcom Foods in Harare.\n\nSARACOs assistant deputy director operations Mr Alvine Makufa confirmed the arrest.\n\nThis arrest is a testament to SARACOs commitment to fighting corruption in all its forms. The organisation has been working closely with law enforcement agencies to identify and bring to justice individuals involved in corrupt activities, he said.\n\nSARACOs efforts are a step in the right direction. By working together with the Government agencies and civil society organisations, SARACO aims to create a corruption-free Zimbabwe where citizens can live and thrive without fear of exploitation.\n\nAs Zimbabwe continues to navigate the challenges of corruption, SARACOs dedication to the cause is a beacon of hope.\n\nWith their tireless efforts, Zimbabweans can look forward to a brighter future, free from the shackles of corruption.\n\nChingarande was handed over to the polices Anti-Corruption Unit and is currently detained at Harare Central Police Station and is expected to appear in court soon.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Arrested.jpg",
            "description": "Crime Reporter Police in conjunction with the Southern Africa Regional Anti-Corruption Organisation (SARACO) have arrested a suspected fraudster who was masquerading as a member of the First Family, defrauding several job seekers. The suspect, Alizma Chigarande was arrested on January 16, 2025 in Harare by SARACO members who handed him to the police for further […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "US Embassy dedicates Carter Room to honour legacy of peacemaking",
            "url": "https://www.herald.co.zw/us-embassy-dedicates-carter-room-to-honour-legacy-of-peacemaking/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe US Embassy has honoured the legacy of former United States President Jimmy Carter by dedicating its largest conference space to his name.\n\nThe event held at the chancery in Westgate on Thursday and it brought together US Ambassador Pamela Tremont, Minister of Foreign Affairs and International Trade Amon Murwira, civil society leaders, and Carter Centre partners to commemorate the late Presidents profound impact on Zimbabwe and the world.\n\nAmbassador Tremont praised Carters dedication to diplomacy and justice.\n\nHis commitment to Zimbabwes future was not just a political decision but a deeply personal conviction that all people should have an opportunity to contribute to the future of their nation, she said.\n\nIt is fitting that this room, used to bring people together, bears the name of a leader who believed in the power of diplomacy and peacemaking.\n\nMinister Murwira said President Carters commitment to human rights and justice was instrumental during Zimbabwes journey to independence.\n\nWe extend our heartfelt gratitude to all who contributed to Zimbabwes independence  those who fought bravely for freedom and those who supported them from afar, including the late President Carter.\n\nA poignant moment of the ceremony came in the form of a video message from Ambassador Andrew Young, who served as President Carters lead negotiator during Zimbabwes independence negotiations.\n\nWe are very proud of our relationship with Zimbabwe. Thank you very much for remembering my boss, Jimmy Carter.\n\nPresident Carter, who passed away on December 29, 2024, at the age of 100 was the first US President to visit Sub-Saharan Africa and remains the only one to have visited Zimbabwe after his Presidency.\n\nHis lifelong commitment to human rights, health, and democratic governance left an indelible mark globally, including in Zimbabwe, where his support for independence and justice continues to be celebrated.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/f399e39d-6cac-4ea0-aa16-04fe187837c2-680x380.jpeg",
            "description": "Ivan Zhakata Herald Correspondent The US Embassy has honoured the legacy of former United States President Jimmy Carter by dedicating its largest conference space to his name. The event held at the chancery in Westgate on Thursday and it brought together US Ambassador Pamela Tremont, Minister of Foreign Affairs and International Trade Amon Murwira, civil […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        },
        {
            "title": "Shun divisive tendencies: President",
            "url": "https://www.herald.co.zw/shun-divisive-tendencies-president/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nZIMBABWEANS should at all times shun divisive tendencies to safeguard the countrys stable unitary democracy that was painstakingly crafted by the likes of former Vice President John Landa Nkomo, President Mnangagwa has said.\n\nIn a statement to mark the anniversary of the death of the late former Vice President, who passed away 11 years ago on January 17, 2013, the President described Cde Nkomo as a diligent nation-builder and dedicated champion of peace.\n\nAs such, President Mnangagwa said it was imperative that the general citizenry cherishes the peace and tranquillity that has become the cornerstone of the countrys current developmental trajectory.\n\nOn this day, 17th January, 2025, the Second Republic joins the Nkomo Family in commemorating the 12th anniversary of the passing on of the former Vice President of the Republic of Zimbabwe, Dr John Landa Nkomo.\n\nAn ardent revolutionary, diligent nation-builder and a dedicated champion of peace, Dr John Landa Nkomos footprints traversed the nascent trade union and nationalist landscape from 1958 to Independence and the immediate post-Inclusive Government era, he said.\n\nPresident Mnangagwa said in carrying on with Cde Nkomos legacy of pioneering lasting projects, the Second Republic was walking its talk by leaving no one and no place behind in delivering on national policies, programmes and projects.\n\nCde John Landa Nkomo was a passionate educator, an eloquent and forthright politician who pioneered lasting developmental projects in his rural Tsholotsho District and beyond.\n\nOn its part, the Second Republic is walking the talk by leaving no one and no place behind in delivering on national policies, programmes, and projects, he said.\n\nPresident Mnangagwa said the former Vice President discharged his duties diligently and honourably.\n\nCde Nkomo served in several portfolios  as Deputy Minister of Industry and Energy (1981); Minister of State in the Prime Ministers Office (1982-84); Minister of Labour, Manpower Planning and Social Welfare (1982-1984); Minister of Local Government and National Housing (1997); Minister of Home Affairs (2000); Minister of State in the Presidents Office responsible for Special Affairs (2002); and Speaker of Parliament (2005-2008).\n\nHe served as Minister of State in the Presidents Office responsible for National Healing, Reconciliation and Integration.\n\nIn 2009, he was appointed NationalChairman of the ruling ZANU-PF Party, the same year that he became the Vice President of Zimbabwe, a position he held until the time of his death in 2013.\n\nOn the international scene, Dr Nkomo was elected to the Presidency ofthe International Labour Conference in 1993, and chaired the Governing Body of the International Labour Organisation in 1994 positions in which he discharged his roles honourably, said President Mnangagwa.\n\nCde Nkomo, said the President, was a distinguished patriot whose dedication to unity and peace was unquestionable.\n\nThe late former Vice President exuded unparalleled patriotism and dedication to the values of unity and peace as expressed in his popular mantra.Peace begins with me. Peace begins with you. Peace begins with all of us.\n\nAs we remember Cde John Landa Nkomo, we should forever cherish the peace and tranquillity that has become the cornerstone of our developmental trajectory.\n\nI therefore beseech my fellow citizens and indeed future generations to always shun divisive tendencies in order to safeguard our stable unitary democracy that was painstakingly crafted by the likes of the dear departed Dr John Landa Nkomo, and his revolutionary peers, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/wgwg.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter ZIMBABWEANS should at all times shun divisive tendencies to safeguard the country’s stable unitary democracy that was painstakingly crafted by the likes of former Vice President John Landa Nkomo, President Mnangagwa has said. In a statement to mark the anniversary of the death of the late former Vice President, who passed […]",
            "time": "18:33",
            "date": "17 Jan 2025"
        }
    ]
}