{
    "news": [
        {
            "title": "‘Churches foster peace, economic development’",
            "url": "https://www.herald.co.zw/churches-foster-peace-economic-development/",
            "content": "Nqobile Bhebhe, Bulawayo Bureau\n\nPRESIDENT Mnangagwa yesterday reaffirmed Governments commitment to partnering churches, saying religious organisations play a crucial role in fostering peace, nation-building, and economic development.\n\nHe made these remarks at the commissioning of a state-of-the-art 10 500-seater Harvest House International Church auditorium in Bulawayos Selbourne Brooke.\n\nThe facility, whose construction began in October 2018, is a testament to resilience and faith, having been completed during the challenges wrought by the COVID-19 pandemic.\n\nAccording to your brief, the construction of this building commenced in 2018 and continued throughout the trying period of the COVID-19 pandemic. The completion of this building, therefore, stands as towering evidence of the determination, hard work and resilience of Harvest House International Church, he said.\n\nThrough this mammoth project, you demonstrated faith that moves mountains, and you are a living example that with God, all things are possible.\n\nThe sprawling 10-acre complex is one of the largest of its kind in Zimbabwe.\n\nIt features five seminar halls, a gymnasium, a food court, a restaurant, and a medical centre equipped with a pharmacy, dental surgery, general practitioner services, a blood laboratory, and physiotherapy facilities.\n\nThe facility includes multiple boardrooms and six retail outlets available for rent, catering for businesses such as jewellery and clothing.\n\nBishop Collin Nyathi and his wife Bishop Sarah Nyathi present a gift to President Mnangagwa after he officially commissioned Harvest House International Church in Bulawayo yesterday.  Picture: Obey Sibanda\n\nThe President commended the church for integrating community outreach into its mission, noting that the facility will offer both spiritual and socio-economic benefits.\n\nThis structure is one of the largest of its kind in our country. I am, further pleased to learn that in addition to spiritual nourishment, which is the reason for its existence, this building will also provide an outreach to the community.\n\nIt offers other facilities such as a gymnasium, restaurants, health and wellness centre, a mini-mall, recording studios and seminar hall, he said.\n\nPresident Mnangagwa encouraged the church to expand its presence, particularly in rural areas, in alignmentwith the Governments Vision 2030 philosophy of leaving no one and no place behind.\n\nIn line with Vision 2030, I challenge you to plant many more churches in rural areas, no one and no place should be left behind. The gospel should be preached to all our people wherever they are, as it was in the early church, he said.\n\nThe President also praised Harvest House International Church for nurturing leaders who contribute significantly to various sectors of society, both locally and abroad.\n\nSome of these leaders occupy influential positions in our nation, across various sectors of Government and industry while others play their part in socio-economic development in the diaspora. Siyabonga, tinotenda.\n\nGoing forward, I exhort you to scale up initiatives not only to inculcate Godly values and work ethics, but also spur production and productivity among your congregates towards economic prosperity as well as higher quality of life in our motherland, he said.\n\nHarvest House International Church members attend a service in their newly-commissioned church in Bulawayo yesterday\n\nThe President emphasised the importance of fostering economic prosperity and improving the quality of life in Zimbabwe.\n\nHe further called on the church to support national efforts in combating drug and substance abuse, particularly among the youth.\n\nThe Harvest House Campus Ministry programme at our national institutions of higher education such as the National University of Science and Technology, Bulawayo Polytechnic, the University of Zimbabwe, Hillside Teachers College, Mpilo School of Nursing and United Bulawayo Hospitals School of Nursing among others are welcome, said President Mnangagwa.\n\nThese must also serve to foster unity, peace, love harmony and greater social cohesion in our young adults while improving both their physical and spiritual health.\n\nHighlighting the churchs remarkable growth, President Mnangagwa noted that Harvest House International, founded in 1995 by Bishops Dr Collin and Dr Sarah Nyathi, has expanded from eight congregations in a home setting to over 800 branches worldwide, including in Botswana, Namibia, and the United Kingdom.\n\nAs the church continues its mission, the President assured it of the Governments unwavering support, emphasising the shared responsibility of building a prosperous Zimbabwe rooted in its African identity and heritage.\n\nMy Government has always cherished the role of the church in nation-building, as the church is a key partner with multi-dimensional responsibilities, said President Mnangagwa.\n\nWe must individually and collectively play our part towards socio-economic development, modernisation and industrialisation of our motherland, Zimbabwe, and the greater continent of Africa. That responsibility lies primarily with us.\n\nPresident Mnangagwa said the facility will aid in the Governments quest to position Bulawayo as a leading destination for Meetings, Incentives, Conferences, and Exhibitions (MICE).\n\nI have said, brick upon brick, stone upon stone, and step by step we are building the Zimbabwe we all want to live in, work in, do business in, and indeed the Zimbabwe we want to worship in, he said, drawing applause from the audience.\n\nAs President and on behalf of the Government and the people of Zimbabwe, I join you in celebrating this great achievement which will benefit the church, the City of Bulawayo and our great motherland, Zimbabwe as a whole.\n\nPresident Mnangagwa also commended the church for its commitment to constructing similar facilities nationwide, including schools, to complement Government programmes.\n\nThis structure is one of the largest of its kind in our country. I am further pleased to learn that in addition to spiritual nourishment, which is the reason for its existence, this building will also provide an outreach to the community.\n\nBulawayo Provincial Affairs and Devolution Minister Judith Ncube hailed the development as transformative.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/HE1-3.jpg",
            "description": "Nqobile Bhebhe, Bulawayo Bureau PRESIDENT Mnangagwa yesterday reaffirmed Government’s commitment to partnering churches, saying religious organisations play a crucial role in fostering peace, nation-building, and economic development. He made these remarks at the commissioning of a state-of-the-art 10 500-seater Harvest House International Church auditorium in Bulawayo’s Selbourne Brooke. The facility, whose construction began in October […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "Cyclone Chido makes landfall today",
            "url": "https://www.herald.co.zw/cyclone-chido-makes-landfall-today/",
            "content": "Herald Reporter\n\nTropical Cyclone Chido is expected to make landfall in the country today, the Meteorological Services Department (MSD) has said.\n\nIn a statement last night, the MSD said that as Cyclone Chido continued its west-south-westward movement, its wind speed and intensity diminished due to increased friction over land.\n\nMSD head of forecast Mr James Ngoma said the remnants of Cyclone Chido will combine with moisture from the Inter-Tropical Convergence Zone, leading to widespread thunderstorms across Zimbabwe from today to December 22.\n\nRELATED STORIES\n\nMore influence over Zimbabwe is projected to be from the cloud-band emanating from the west, through both Matabeleland provinces. This should result in widespread thunderstorms throughout the week.\n\nDespite the anticipation of heavy rainfall exceeding 50mm in provinces like Matabeleland South, Bulawayo Metropolitan, southern parts of Matabeleland North, Midlands, and Masvingo, the risk of flooding is low following a recent dry spell. However, the heat that was over Zimbabwe for much of last week, should potentially lead to these storms being violent, with lightning, strong winds, and hailstorms in certain areas.\n\nProvinces of particular concern include Mashonaland East, Manicaland, Masvingo, Matabeleland South, Bulawayo Metropolitan, and the southern parts of Midlands, said Mr Ngoma.\n\nIn light of the approaching storm, local authorities and disaster management agencies are advising residents to remain vigilant and prepared for adverse weather conditions.\n\nCommunities are being encouraged to stock up on essential supplies and to stay informed through official weather updates.\n\nThe Civil Protection Unit (CPU) has already been put on high alert to respond to the tropical cyclone.\n\nCPU director, Mr Nathan Nkomo, said the department had been placed on high alert, with officials closely and continuously monitoring the situation.\n\nWe continue to get updates from both our two early warning units, the Meteorological Services Department and the climate service centre on a daily basis and we are monitoring the situation, Mr Nkomo said.\n\nHe said the CPU had calculated a specific budget to address the potential impact of Cyclone Chido.\n\nWe are happy that so far we have extracted a specific budget for response to Chido, I think for a start we need something to the tune of US$1,6 million so that we are able to deal with issues to do with coordination efforts, shelter, (water, sanitation, and hygiene) WASH related issues, and we want to ensure that our refugees and settlements receive the necessary support and that every life is saved.\n\nCyclone Chido traversed into Mozambique early yesterday morning, bringing gale-force winds and heavy rain after leaving a trail of death and destruction in Frances Indian Ocean territory of Mayotte.\n\nAccording to the Mozambique Institute of Meteorology, the cyclone appeared to have intensified as it crossed the Mozambique Channel overnight to make landfall around 40 kilometres (25 miles) south of the northern city of Pemba.\n\nThe cyclone brought destructive winds exceeding 200 km/hr and heavy rains with rainfall rates reaching up to 30mm per hour (roughly 30 litres per square metre every hour).\n\nThis resulted in flash flooding in the coastal area.\n\nIn a statement yesterday, UNICEF Mozambique said they had deployed a team on the ground to work with Government to respond to the needs of affected families and children.\n\nMany homes, schools and health facilities have reportedly been partially or completely destroyed.\n\nWeather experts say Cyclone Chido shares characteristics with Cyclones Gombe and Freddy, which struck Southern Africa in 2022 and 2023, respectively.\n\nMeteorological experts have cautioned that the cyclones gusts could uproot trees and damage infrastructure, although the overall impact on Zimbabwe is expected to be less severe compared to neighbouring countries.\n\nAn update from the United Nations Office for the Coordination of Humanitarian Affairs (OCHA) yesterday said about 2,7 million people in six Southern African countries will be affected by the cyclone.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/James-Ngoma.jpg",
            "description": "Herald Reporter Tropical Cyclone Chido is expected to make landfall in the country today, the Meteorological Services Department (MSD) has said. In a statement last night, the MSD said that as Cyclone Chido continued its west-south-westward movement, its wind speed and intensity diminished due to increased friction over land. MSD head of forecast Mr James […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "Pass-out parade for 1 600 ZPCS recruits",
            "url": "https://www.herald.co.zw/pass-out-parade-for-1-600-zpcs-recruits/",
            "content": "Bulawayo Bureau\n\nPRESIDENT Mnangagwa will today officiate at the 154th recruit correctional officers pass-out parade at the Zimbabwe Prisons and Correctional Service (ZPCS) Training School in Ntabazinduna.\n\nThe pass-out parade will see 1 600 officers graduating after undergoing a rigorous six-month training course.\n\nPermanent Secretary in the Ministry of Justice, Legal and Parliamentary Affairs, Mrs Vimbai Nyemba, yesterday confirmed that President Mnangagwa will be the guest of honour.\n\nTomorrow (today), we are having our pass-out parade at the Ntabazinduna Prison Training School where we will have over 1 600 officers graduating after completing the course. The period was six months, and two groups are graduating at the same time, with President Mnangagwa presiding over the ceremony as the guest of honour, she said.\n\nAmong the graduating officers are recruits from the San community in Tsholotsho, whose representation in national security services has been steadily increasing.\n\nIn line with the Governments philosophy that no one and no place should be left behind in national development, President Mnangagwas administration has facilitated the recruitment of members of the San community into the countrys security services.\n\nThe first group of 20 youths from the San community in Tsholotsho District graduated in June 2022.\n\nThe San community has gradually increased in terms of recruits over the years, after the first graduation. We are pleased to note that they have responded positively and will be part of the 1 600 graduating at Ntabazinduna, said Mrs Nyemba.\n\nIn 2021, Cabinet passed a resolution that the countrys security services should set up a quota system for the San community as part of their integration into the broader society.\n\nPrior to the Second Republics interventions, the San people lived in their own world, far removed from the rest of the country. Most of them did not have birth certificates or identity documents resulting in them lacking access to many services, including health and voting.\n\nA majority of them could not access school and as a result, could not secure formal jobs, but only menial ones.\n\nIn 2021, President Mnangagwa sent a team of ministers to meet the San people to hear their concerns and how they wanted them to be resolved.\n\nShortly after that, officials were deployed to Tsholotsho to issue birth certificates and other identity documents. More than 5 000 people benefited.\n\nGovernment is also working on funding the building of a primary and secondary school to enhance access to education within the San community.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/10/Vimbai-Nyemba.jpg",
            "description": "Bulawayo Bureau PRESIDENT Mnangagwa will today officiate at the 154th recruit correctional officers’ pass-out parade at the Zimbabwe Prisons and Correctional Service (ZPCS) Training School in Ntabazinduna. The pass-out parade will see 1 600 officers graduating after undergoing a rigorous six-month training course. Permanent Secretary in the Ministry of Justice, Legal and Parliamentary Affairs, Mrs […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "Police issue warning on WhatsApp attacks",
            "url": "https://www.herald.co.zw/police-issue-warning-on-whatsapp-attacks/",
            "content": "Trust Freddy, Herald Correspondent\n\nPolice have issued a warning to the public to exercise caution when using digital platforms, particularly WhatsApp, following a surge in cyber attacks.\n\nCyber attackers are inviting users to click onto unknown numbers or exposing users to phishing scams where the attackers deceive people into providing sensitive data through fraudulent messages.\n\nThese attacks often result in the theft of sensitive information, including bank details, and, in some cases, extortion of money from family and friends.\n\nBut in all cases, the attacker and hacker has gained access from the account owner clicking on a link of some sort and authorities urge people to ignore and report messages from people and numbers they do not recognise.\n\nThe scammers primarily target high-profile individuals, including senior Government officials, media personnel, and social media influencers. However, anyone can fall victim.\n\nIn an interview yesterday, national police spokesperson Commissioner Paul Nyathi stated that authorities are working diligently to apprehend the perpetrators.\n\nThere is a rampant cyberattack targeting senior Government officials, media personnel, and people across the country, where messages are sent from unknown numbers, usually foreign numbers. The moment you click on a link, you will be hacked.\n\nHacking has become increasingly sophisticated in the digital age. Cyber criminals exploit vulnerabilities in software and human behaviour to gain unauthorised access to personal and financial information once given access by the phone owner.\n\nPhishing, a common tactic, involves deceiving individuals into providing sensitive data through fraudulent emails or messages. With the rise of mobile messaging platforms like WhatsApp, scammers have adapted their strategies, creating urgent and convincing scenarios to manipulate users.\n\nComm Nyathi emphasised the need for the public to stay alert and treat messages from unknown numbers with caution.\n\nThe public should desist from opening links from unknown sources, and as the police, we are using resources at our disposal to flush out these suspects.\n\nOnce scammers gain control of accounts, they solicit money from the victims contacts, often pretending to be in a state of emergency.\n\nOn WhatsApp, scammers send urgent messages to every contact, feigning a crisis and requesting financial assistance. On Facebook, they reach out to every friend.\n\nSeveral individuals have fallen prey to these scams. In one instance, a top Government official had his phone hacked and the scammers sent a message claiming to be in a dire financial situation.\n\nIm trying to send some money to someone for treatment; its not going through. I have issues with my account; can you help me send it to the persons account directly? I will refund it back immediately once my transfer is active.\n\nThe hacker created a sense of urgency, claiming to need help for a medical treatment payment, but the message lacked specific details about the treatment or the recipient.\n\nWhile some recipients grew suspicious, others unfortunately fell victim, with two individuals reportedly losing money, one sending US$250 and another transferring ZiG500.\n\nThe matter has been reported to the police. These scammers allegedly use lost or stolen identity documents to register new SIM cards, which they then employ to perpetrate cybercrimes. They often use foreign numbers to send deceptive messages. The scammers employ many tactics, including messages promising free data, such as Click this link to get 50GB of free data.\n\nClaims of winning large sums of money, such as You have won $100 000; click this link to collect your prize.\n\nDeceptive messages claiming a prominent individual has leaked a sensitive video, enticing recipients to click a malicious link. Clicking on these links can lead to disastrous consequences, including compromising the security of the victims WhatsApp account.\n\nHackers are also exploiting the WhatsApp Forward Call feature to gain unauthorised access to victims accounts and intercept incoming calls. This scam typically begins with a deceptive message, email, or phone call that tricks the recipient into dialling a phone number containing a man-machine interface code. If the individual falls for the ruse, their incoming calls will be automatically forwarded to the attackers number.\n\nOnce the attacker has successfully forwarded the victims calls, they can install WhatsApp, register the compromised number, and request a verification code via phone call, ultimately gaining control of the account.\n\nAs cyber threats continue to evolve, the police urge the public to remain vigilant and cautious when interacting with unknown contacts online.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/08/Paul-Nyathi.jpg",
            "description": "Trust Freddy, Herald Correspondent Police have issued a warning to the public to exercise caution when using digital platforms, particularly WhatsApp, following a surge in cyber attacks. Cyber attackers are inviting users to click onto unknown numbers or exposing users to phishing scams where the attackers deceive people into providing sensitive data through fraudulent messages. […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "Ex-VP Mphoko laid to rest",
            "url": "https://www.herald.co.zw/ex-vp-mphoko-laid-to-rest/",
            "content": "Peter Matika, Bulawayo Bureau\n\nScores of mourners yesterday gathered to bid farewell to national hero and former Vice President Cde Phelekezela Mphoko, who was laid to rest at his family plot in Douglasdale, Bulawayo.\n\nThe burial marked the conclusion of a life devoted to Zimbabwes independence, development, and reconciliation.\n\nPresident Mnangagwa, who conferred national hero status on Cde Mphoko, described him as a pillar of unity and resilience whose enduring legacy would continue to inspire future generations.\n\nCde Mphoko (84) passed away in India, where he had been receiving medical treatment.\n\nAs his casket was lowered into the grave, a 21-gun salute echoed in tribute to his immense contributions to the nation.\n\nThe ceremony was attended by senior Government officials, liberation war veterans, diplomats, and members of the public, underscoring the high esteem in which Cde Mphoko was held.\n\nIn his eulogy, Retired Brigadier-General Abel Mazinyane praised Cde Mphokos pivotal role in Zimbabwes liberation struggle, saying: He was not my best friend as people think, but he was my commander. I shared many profound experiences under his leadership and guidance.\n\nFamily spokesperson and younger brother, Mr Ndabezinhle Mphoko, expressed the familys deep sense of loss: No words can explain how much we will miss him. He was a humble man who cherished his privacy and family. His journey may have ended, but the memories and lessons he imparted will inspire generations to come.\n\nMatabeleland North Provincial Affairs and Devolution Minister Richard Moyo described Cde Mphoko as a courageous leader who played a vital role in Zimbabwes liberation and development.\n\nCde Mphoko was born on June 11, 1940 at Gwizane, in Bubi District of Matabeleland North Province.\n\nCde Mphoko is survived by his widow Laurinda, and they had three children together Sikhumbuzo, Siduduzo and son, Siqokoqela.\n\nHe was also blessed with three grandchildren.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/08/VP-Mphoko-1-1.jpg",
            "description": "Peter Matika, Bulawayo Bureau Scores of mourners yesterday gathered to bid farewell to national hero and former Vice President Cde Phelekezela Mphoko, who was laid to rest at his family plot in Douglasdale, Bulawayo. The burial marked the conclusion of a life devoted to Zimbabwe’s independence, development, and reconciliation. President Mnangagwa, who conferred national hero […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "Sadc PF honours Speaker Mudenda",
            "url": "https://www.herald.co.zw/sadc-pf-honours-speaker-mudenda/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nThe Sadc Parliamentary Forum has conferred Speaker of Parliament, Advocate Jacob Mudenda, with the Grand Defender of Democracy Award for his contribution to the regional parliament.\n\nThe honour was conferred to Adv Mudenda last week in Zambia during the Sadc PF 56th Plenary Session.\n\nAccording to the citation, Adv Mudenda was honoured, For the unflinching dedicated service, unwavering commitment to duty and iconic visionary leadership as an inspiring Member of the Executive Committee of the SADC Parliamentary Forum for the period November 2022 to December 2024 during the just ended SADC PF Plenary Assembly and related meetings.\n\nThe meeting was held under the theme, Leveraging Technology and Innovation for Smart, Inclusive, and Responsive Parliaments in the SADC Region.\n\nThe Plenary Assembly session brought together Parliamentary delegations from across the region to deliberate on key issues driving regional integration, technological advancement and inclusive governance.\n\nIn honouring Adv Mudenda, SADC PF noted his contributions during previous sessions, including one that was held in Johannesburg where he showed unparalleled leadership.\n\nHe also made high-profile deliveries, including a tribute to Professor Peter Katjavivi, the outgoing Speaker of the National Assembly of Namibia, in recognition of his extraordinary contributions to regional integration and parliamentary diplomacy.\n\nThe tribute formed part of the SADC PFs Legacy Project, celebrating Prof Katjavivis distinguished service ahead of his retirement in March 2025, read the SADC PF citation.\n\nAdvocate Mudenda also delivered the vote of thanks during the official opening ceremony, which featured an address by the guest of honour, President Hakainde Hichilema of Zambia.\n\nHis remarks underscored Zimbabwes commitment to regional collaboration and its readiness to host the 57th Plenary Assembly Session, scheduled for June/July 2025 in Zimbabwe.\n\nZimbabwes Speaker has been entrusted with the critical mandate to secure the remaining signatures for the amendment of the treaty to establish a regional parliament.\n\nSome of the remaining countries to append their signatures include Botswana, Madagascar and Mauritius and the objective is to ensure that no SADC country is left out.\n\nAs chairman of the Strategic Lobbying Team, Speaker Mudendas mission is to rally all countries and bring to fruition the transformation of the SADC PF into a fully-fledged Regional Parliament, a process that he has led for over 14 years.\n\nApplauded for his steadfast strategic guidance, past and present, Advocate Mudendas efforts have positioned the forum on the brink of transformation. This effort aims to facilitate the seamless transition of the SADC PF into a Regional Parliament, ensuring operational coherence during the transformation process matrix, reads the statement.\n\nAdvocate Mudendas instrumental role as chairperson of the Strategic Lobbying Team was further reaffirmed through his endorsement by the Plenary Assembly as an ex-officio member of the SADC PF Executive Committee.\n\nThis position underscores his invaluable contribution to the Forums operations and strategic objectives.\n\nThe 56th Plenary Assembly Session ended with a collective pledge to harness digital technologies for inclusive and responsive legislative institutions across the region.\n\nSADC PF noted that, under the chairmanship of President Mnangagwa, Zimbabwe demonstrated its digital prowess, integrating Artificial Intelligence and ICT systems into its Parliamentary frameworks.\n\nThis citizen-centric e-Parliament approach, underscores Zimbabwes ability to blend tradition with innovation, reinforcing its role as a regional leader in accountable and adaptive e-governance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Mudenda.jpg",
            "description": "Zvamaida Murwira, Senior Reporter The Sadc Parliamentary Forum has conferred Speaker of Parliament, Advocate Jacob Mudenda, with the Grand Defender of Democracy Award for his contribution to the regional parliament. The honour was conferred to Adv Mudenda last week in Zambia during the Sadc PF 56th Plenary Session. According to the citation, Adv Mudenda was […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "EDITORIAL COMMENT: Public health expands outward, upward under Second Republic",
            "url": "https://www.herald.co.zw/editorial-comment-public-health-expands-outward-upward-under-second-republic/",
            "content": "There has been a continuous and very effective upgrade of the entire public health network under the Second Republic involving building more clinics and hospitals, increasing staff and ensuring that the doctors and nurses are ever better qualified and have more skills, making sure equipment and other requirements are in place, and ensuring that medicines and medical supplies are adequately stocked.\n\nIt has not been an instant process, but progress has been continuous for more than six years across the full ambit of the public sector, which a large majority of Zimbabweans rely on and which is now moving into the lead for certain critical services.\n\nThe expansion of the basic primary health network tends to grab the headlines, since it has seen that significant expansion, especially in rural areas.\n\nRural district councils and central Government have been the source of devolution funds and equipment as they cooperate to make real the commitment to ensuring everyone is within 5km of a health centre.\n\nThere are still gaps, and some now oddly enough in cities where the expansion of residential areas has not been matched by the commissioning of new health and educational facilities, despite the considerably higher levels of city financing compared to most rural areas.\n\nBut the list of the new clinics, super-clinics and hospitals is growing and almost every week now we hear of a new facility being commissioned as work that started a year or two ago reaches its conclusion.\n\nAt the same time, more and better equipment is being moved into the public hospitals and clinics, and the logistical systems to ensure medical consumables and medicines are readily available where they are needed are now largely working.\n\nWe have moved beyond the stage where patients families had to provide so much.\n\nOf course, none of this would mean much unless the whole public health system was adequately staffed at all levels, from nurse aids and community health workers all the way up to specialised nursing teams and qualified and experienced specialist physicians and surgeons, which means the brain drain has to at least be slowed right down and, hopefully, some of those who have gained experience outside the country have come home.\n\nA sign of the upgrade at the top-end has been the 41 successful heart operations at Parirenyatwa Group of Hospitals this year, just six months after such surgery resumed with the first heart operation for some years done in the middle of last year.\n\nThis required reassembling and rebuilding a specialist team and making sure it had the back-up it needed. Such a team is not just a casual assembling of staff, but needs to be in place and to gain experience as a team to be effective.\n\nThe next stage, planned for next year, is to increase the number of heart operations to between 100 and 150. This will require some upgrade of facilities, with the hospital now looking at a 10-bed cardiothoracic intensive care unit and high dependency unit, as well as other back up.\n\nAt present heart surgery patients recover in the general intensive care unit which limits numbers that can be operated on.\n\nThe cardiothoracic unit needs to move above 100 operations a year to ensure that the team maintains its very level of skills, and as it moves into this range it can also start the teaching work that must be done if specialist staff are prepared to take over as time goes on, and in any case Zimbabwe must need more than one such unit if all patients who need surgery are to be operated on.\n\nWe still see a fair number of Zimbabweans travelling outside the country, principally South Africa and India, for heart surgery, which explains why there is a waiting list of only six months for the sole Zimbabwean unit.\n\nBut as people become confident that their own doctors and nurses can do the work, and the hospitals are properly equipped, then obviously a high proportion of those needing such surgery will elect to have it done at home at considerably lower cost.\n\nWe have seen some other high-end surgery, such as the separation of conjoined twins, as well as what can now be seen to be routine emergency surgery, with that helicopter ambulance service making sure that patients now arrive on time for this high-end surgery to be most effective, another of the upgrades.\n\nPresident Mnangagwa has been pushing the upgrade process, wanting a decent and efficient public health system that can be accessed by all Zimbabweans.\n\nThe private health sector has made a significant contribution to health, but its range is limited to those with adequate financial resources, either to afford the services or to at least pay the high monthly premiums needed in the health insurance and medical aid schemes that give full access to such private care.\n\nA sign of most developed countries, and now more and more developing countries, is that public sector can handle just about everything, and private health care is mostly concerned with private hospital rooms and nicer food, rather than making sure essential services are in place.\n\nFunding is getting better. Next year the health budget moves to 13 percent of all Government spending, just below the African target of 15 percent and so putting Zimbabwe very high on the list.\n\nAs the economy keeps growing, and so tax revenue automatically increases, ever more resources become available and so the public health sector becomes ever better.\n\nBut we have already, under the Second Republic, moved a long way along the path for a complete and functioning high level public health system, one that reaches the people and then can treat almost every ailment that the people reached may suffer from.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Parirenyatwa-Group-of-Hospitals.jpg",
            "description": "There has been a continuous and very effective upgrade of the entire public health network under the Second Republic involving building more clinics and hospitals, increasing staff and ensuring that the doctors and nurses are ever better qualified and have more skills, making sure equipment and other requirements are in place, and ensuring that medicines […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "Creatives reflect on achievements",
            "url": "https://www.herald.co.zw/creatives-reflect-on-achievements/",
            "content": "Trust Khosa\n\nAs the 2024 showbiz calendar nears its end, creatives across various art disciplines are reflecting on their achievements.\n\nThis year has been marked by lasting memories in numerous art genres, with top visual artists garnering international attention and representing Zimbabwe on the global stage.\n\nFilm and television have shown signs of revival, while literary arts, dance, and spoken word continue to thrive.\n\nHowever, there are genuine concerns that theatre is being overshadowed by other genres, primarily due to a shortage of venues nationwide.\n\nThe lack of funding and suitable spaces for performances has significantly hindered the theatre scene.\n\nTheatre is a dynamic platform for storytelling and cultural expression, connecting artists and audiences through live performance.\n\nIt remains vital in addressing national issues such as corruption, gender-based violence (GBV), and cultural heritage.\n\nDespite a growing preference for social media skits, Zimbabwean theatre practitioners are committed to keeping the genre alive.\n\nKey figures like Daves Guzha, Jasen Mphepo, Peter Churu, Daniel Maposa, and Silvanos Mudzvova are leading efforts to revive theatre in the country.\n\nGuzha, in particular, has worked tirelessly to ensure the survival of the genre through his theatre hub, Theatre in the Park, located in the heart of Harare Gardens.\n\nOne standout production, Song Unburied, is a powerful play rich with historical significance.\n\nThe ritualistic performance received an AA rating from the Censorship Board of Malawi and has been a hit in the region.\n\nIt calls for the return of anti-colonial heroine Mbuya Nehandas remains from an overseas gallery, resonating strongly with the period the country is campaigning for the return of stolen artifacts.\n\nMbuya Nehandas remains were taken abroad as a symbol of conquest.\n\nThe play has also been showcased at Madsoc Theatre in Lilongwe, Malawi, and has captivated South African audiences.\n\nFeaturing a star-studded cast, including Dalma Chiwereva, Charmaine Mujeri, Tinevimbo Chimbetete, and mbira player Abel Mafuleni, it was performed in the French-speaking Comoros Islands and received enthusiastic feedback, even being presented in Parliament before an appreciative crowd of 350.\n\nGuzha, who has also made a name as a filmmaker, has revitalised cinema at Theatre in the Park. As part of his community outreach, he has supported comedians through Comedy Thursdays, led by Tanya Alex.\n\nAnother notable figure in theatre revival is Churu, whose powerful play Molly Street has won many hearts. This production, which toured nationally and regionally, demonstrates that theatre remains relevant in contemporary society. The live audience aspect adds credibility, making it a must-see for those interested in pressing national issues.\n\nDirected by Churu and starring actress Chido Joan Tenga, the play explores themes of passion and domestic violence, focusing on the tragic story of a sex worker named Molly, who was killed by her lover.\n\nJasen Mphepo has also established a vibrant theatre centre that has become a hub for enthusiasts. The commitment of practitioners like Mphepo ensures that theatre continues to resonate with audiences.\n\nHis play, The Aftermath, which addresses human experiences, is poignant and thought-provoking, focusing on resilience, hope, and transformation following adversity.\n\nFeaturing powerful storytelling and captivating performances, this production is a must-see. Starring Farirai Clarence Borerwe, Munashe Goromonzi, Tapiwa Henry Mutekede, Jasen Mphepo, and Shingirai Manyengavana, the play is available on YouTube. Directed by Norbert Makoche, it vividly explores themes of family, life issues, and unity, remaining relevant to our lives today.\n\nOther key practitioners include Maposa of Savanna Arts Trust and Mudzova.\n\nAs a human rights activist and playwright, Mudzova has gained international recognition for his works addressing corruption and human rights, such as The Final Push (2007) and Missing Diamonds (2016).\n\nAlthough he operates internationally, he remains committed to ensuring the relevance of Zimbabwean theatre. Lastly, no debate of theatres revival would be complete without mentioning Stanley Mambo, who has made his mark in Malawi. Formerly a star of Zimbabwes first soap opera, Mambo is proud of his roots. As the owner of Mwezi Entertainment Productions, he has toured the region with his one-man show, State of the Ape.\n\nAfter the dissolution of Studio 263 in 2007, Mambo chose Malawi as a base to pursue his career in film and theatre, demonstrating his dedication to keeping theatre alive.\n\nThese enterprising theatre practitioners deserve recognition for their contributions to the arts while they are still active in the field.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/04/Daves-Guzha.jpg",
            "description": "Trust Khosa As the 2024 showbiz calendar nears its end, creatives across various art disciplines are reflecting on their achievements. This year has been marked by lasting memories in numerous art genres, with top visual artists garnering international attention and representing Zimbabwe on the global stage. Film and television have shown signs of revival, while […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "Man arrested for faking US$287k robbery",
            "url": "https://www.herald.co.zw/man-arrested-for-faking-us287k-robbery/",
            "content": "Crime Reporter\n\nA 39-YEAR-OLD man has been arrested on allegations of making a false report to the police that he had been robbed of US$287 000 cash and a vehicle by four armed robbers in Mutoko.\n\nNational police spokesperson Commissioner Paul Nyathi confirmed the arrest and said investigations were still in progress.\n\nOn December 11, 2024, at around 10am, Khumbulani Sibanda went to ZRP Mutoko where he reported that at around 8am, he was robbed of US$287 000 cash and an unregistered Toyota Allion car in the Harare central business district by four robbers who were driving a Ford Ranger double cab whose registration number was unknown.\n\nHe said the robbers later dumped him in Mutoko and went away with his vehicle.\n\nSibanda had indicated that on December 4, 2024, he assigned a security company to transport his cash amounting to US$2,3 million from Matabeleland South to Harare for safekeeping, intending to buy residential and business properties in the capital.\n\nHe had allegedly taken the stolen money from the security companys vault intending to make property payments for a business property in Melfort and residential property in Goodhope.\n\nAfter receiving the report, detectives from CID Mutoko took over the case and carried out preliminary investigations by visiting the place where he alleged that he was dumped, but failed to get any clues.\n\nThey liaised with CID Homicide Harare while escorting him to Harare. The detectives from CID Homicide made enquiries which revealed that in a space of a month, Sibanda had visited six Fawcett security firm branches in different towns asking for cash-in-transit (CIT) services.\n\nThey also established that he had no mining operations in Filabusi, Matabeleland South Province, as he had alleged.\n\nFurther investigations by the police revealed that Sibanda had lied that he had obtained the cash from Safeguard as officials from the security company denied knowing him as their client and that he had no money that was being kept there.\n\nIt was further established that between December 4 and 11, 2024, Sibanda had visited several business and residential owners promising to buy their properties in Melfort, Goodhope, Mainway Meadows, Norton, Ardbennie, Blue Ridge along Mutoko Road, among others, and some had visited lawyers with him to initialise the selling processes.\n\nPolice also interviewed his girlfriend, Agnes Mandiyenga (23), who said she had known Sibanda since November 2024 and they had been staying together at a garage along Willowvale Road.\n\nDuring that period, Sibanda only gave her US$20 cash for all their household needs.\n\nSibanda later admitted that he was never robbed and did not own any mine or a car and was using the false reports to get sympathy from people, especially businesspeople, so that they would give him money.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Assistant-Commissioner-Paul-Nyathi.jpg",
            "description": "Crime Reporter A 39-YEAR-OLD man has been arrested on allegations of making a false report to the police that he had been robbed of US$287 000 cash and a vehicle by four armed robbers in Mutoko. National police spokesperson Commissioner Paul Nyathi confirmed the arrest and said investigations were still in progress. On December 11, […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        },
        {
            "title": "SPONSORED: Take a Break from Summer",
            "url": "https://www.herald.co.zw/sponsored-take-a-break-from-summer/",
            "content": "Summer, what a wonderful time of year\n\nWhen influencing gets too much\n\nWhen the news cycle gets too much\n\nWhen the endless queues get too much\n\nWhen the shopping chaos gets too much\n\nWhen the unavailable Ubers get too much\n\nWhen the holiday work shifts get too much\n\nWhen the lawn mowing gets too much\n\nWhen the loud music gets too much\n\nWhen the traffic gets too much\n\nWhen the relentless schedule gets too much\n\nWhen the heatwaves get too much\n\nWhen the weather warnings get too much\n\nWhen the suntan lines get too much\n\nWhen the ever-growing laundry pile gets too much\n\nWhen the festivities get too much\n\nWhen the 2025 university applications get too much\n\nWhen the guests overstaying their welcome gets too much\n\nWhen the social media mayhem gets too much\n\nWhen the out of sync traffic lights get too much\n\nWhen the New Year resolutions get too much\n\nWhen the humidity gets too much\n\nWhen the crowded beaches get too much\n\nWhen the travel expenses get too much\n\nWhen reapplying sunscreen gets too much\n\nWhen the packing and unpacking gets too much\n\nWhen the photo-taking gets too much\n\nWhen the flies get too much\n\nWhen the pool maintenance gets too much\n\nWhen the fully booked airlines get too much\n\nWhen the mosquito bites get too much\n\nWhen the fishing trips get too much\n\nWhen the baking gets too much\n\nWhen the road trip stops get too much\n\nWhen the sand in the car gets too much\n\nWhen the picnic ants get too much\n\nWhen the sadza and nyama gets too much\n\nWhen the braai smoke gets too much\n\nWhen the television shows get too much\n\nWhen the iced-coffee trips get too much\n\nWhen the homemade cooking gets too much\n\nWhen the hot car seats get too much\n\nWhen the beach volleyball gets too much\n\nWhen the outdoor markets get too much\n\nWhen the air-conditioning bills get too much\n\nWhen the nature hikes get too much\n\nWhen the garden-watering gets too much\n\nWhen the shell-collecting gets too much\n\nWhen the hot sidewalks get too much\n\nWhen the bike rides get too much\n\nWhen the late nights get too much\n\nWhen the impromptu trips get too much\n\nWhen the 44 rides get too much\n\nWhen the mini-golf games get too much\n\nWhen the ice cube trays get too much\n\nWhen the late-night crickets get too much\n\nWhen the entertaining gets too much\n\nWhen the bumpy boat rides get too much\n\nWhen the paddleboarding gets too much\n\nWhen the public pool crowds get too much\n\nWhen the lack of parking gets too much\n\nWhen the summer internships get too much\n\nWhen all you need is a breather\n\nYou have made it to the end. Take a break from summer with KFC Zimbabwe on Saturday, 21 December, a day to pause, refresh, and savour the start of holiday mode. Swing by KFC for a taste of summer and officially step into the holidays, recharged and ready. See you there!\n\nDiscover KFCs Summer Delights!\n\nKFC Summer Twisters:https://www.youtube.com/watch?v=LVlAX00WROU\n\nKFC Summer Krushers:https://www.youtube.com/watch?v=QpCn-tFYrls\n\nKFC Summer Buckets:https://www.youtube.com/watch?v=SbiOjRR58UA\n\nAbout KFC Africa\n\nKFC has been in South Africa for over 53 years and has more than 1,300 stores across the country. The first KFC restaurant in South Africa opened in 1971 in Orange Grove, Johannesburg. KFC is the leading quick-service restaurant brand in South Africa with just under a third of market share, according to Brand Image Tracker. KFC serves more than 20 million customers a month and we work hard to ensure that no matter which of our restaurants they walk into, they will get that distinctive KFC flavour and have a great experience. KFCs Original Recipe Chicken was first made by Colonel Harland Sanders in 1940 when he perfected his secret recipe of 11 herbs and spices at his restaurant in Kentucky. Today, KFC is the worlds most popular chicken restaurant, still preparing our chicken with the Colonels secret recipe to his exact standards. Every KFC restaurant follows the same global processes and procedures to ensure that our customers get great-tasting food, every time.\n\nKFC Zimbabwe socials:\n\nInstagram  @kfc.zimbabwe https://www.instagram.com/kfc.zimbabwe/\n\nFacebook  KFC Zimbabwe https://www.facebook.com/kfczimbabwe\n\nX  @kfczimbabwe https://x.com/kfczimbabwe\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/KFC-680x380.jpg",
            "description": "Summer, what a wonderful time of year… When influencing gets too much When the news cycle gets too much When the endless queues get too much When the shopping chaos gets too much When the unavailable Ubers get too much When the holiday work shifts get too much When the lawn mowing gets too much […]",
            "time": "09:46",
            "date": "16 Dec 2024"
        }
    ]
}