{
    "news": [
        {
            "title": "Tech boost for junior MPs. . .President honours promise to improve digital literacy",
            "url": "https://www.herald.co.zw/tech-boost-for-junior-mps-president-honours-promise-to-improve-digital-literacy/",
            "content": "Lovemore Kadzura, Mutare Bureau\n\nPRESIDENT Mnangagwa has availed tablets and other information communication technology tools to all members of the Junior Parliament of Zimbabwe across the country as per his promise last year, and this will assist in improving digital literacy among the youthful population.\n\nLast weekend, Junior Parliamentarians from Manicaland Province received their gadgets at a function officiated by the Minister of State for Manicaland Provincial Affairs and Devolution, Advocate Misheck Mugadza, who said President Mnangagwa was fulfilling a promise he made to the young leaders during the 32nd Junior Parliament Session.\n\nAdv Mugadza said Government seeks to equip 1,5 million youths with digital skills by 2030, and youths must use the acquired skills to participate in national economic programmes for the development of the country.\n\nThe donation is in response to a plea made by Junior parliamentarians to President Emmerson Mnangagwa during the official opening of the 32nd Session of the Junior Parliament of Zimbabwe on July 3, 2024. Our President is a listening leader with a clear vision. He listens to peoples concerns, and addresses them promptly, he said.\n\nAdv Mugadza said the donation resonates well with the Presidents National Digital Ambassador Programme that seeks to empower 1,5 million young Zimbabweans with digital skills by 2030.\n\nThis initiative will go a long way in enhancing digital literacy and skills among Zimbabwean citizens, and empowering a new generation of professionals who can contribute to technological innovation. This digital skills programme is tailor-made to cover the digital divide as youths from remote areas have access to technology, he said.\n\nThrough the programme, Adv Mugadza said, Junior MPs will acquire skills in digital literacy, online safety and effective communication.\n\nYou will have access to a range of digital tools and resources to support your academic and professional pursuits. I would like to applaud the Ministry of Youth, Empowerment, Development and Vocational Training for the Junior Parliament concept as this gives young leaders a chance to become active participants in the developmental process of our country, he said.\n\nThis is in the spirit of leaving no one and no place behind as espoused by President Mnangagwa. As we navigate through the digital age, it is evident that digital literacy is crucial for the empowerment of young people to access education, employment and economic opportunities. This means we will continue to prioritise digital skills development and ensure that young people are adequately equipped to thrive in an increasingly inter-connected world.\n\nAdv Mugadza said Manicaland Province has immense potential for growth and enterprise development, and to fully capitalise on this, youths must be equipped with the relevant skills.\n\nHe said Government is spearheading the transformation of vocational training centres and aligning them with global trends, where modern practical skills that empower youths for both personal and national development are offered.\n\nJunior Parliament Second vice president, Luke Mavada, applauded Government for availing the tablets to young people, saying they will help make learning much easier.\n\nThe Government has done a very noble thing to give gadgets to members of the Junior Parliament and Cabinet. These tools will help us in our studies. They will help us in conducting research and for communication purposes.\n\nThese gadgets will help in our education. We are the generation of new technological advancement, and these tools will help us a lot, said Mavada.\n\nCurren Masakura, the Junior Minister of Information, Publicity and Broadcasting Services, said the tablets will enhance their adaptation to the Heritage-based curriculum being implemented in schools.\n\nI would like to extend my deepest gratitude to President Mnangagwa for availing these essential gadgets for us. This is empowerment of youths, who constitute the majority of the population. This will improve our digital literacy, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/President-Mnangagwa-3.jpg",
            "description": "Lovemore Kadzura, Mutare Bureau PRESIDENT Mnangagwa has availed tablets and other information communication technology tools to all members of the Junior Parliament of Zimbabwe across the country as per his promise last year, and this will assist in improving digital literacy among the youthful population. Last weekend, Junior Parliamentarians from Manicaland Province received their gadgets […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "Dam breach kills four",
            "url": "https://www.herald.co.zw/dam-breach-kills-four/",
            "content": "Ray Bande and Luthando Mapepa\n\nHerald Reporters\n\nA DAM breach at Bandama farm (formerly Canterbury farm) in Chipinge has resulted in the release of large quantities of water downstream, killing four people including a four-year-old girl.\n\nThree people are also missing following the incident which occurred on Sunday at the property owned by the late national hero and former Commander of 3 Infantry Brigade in Mutare, Brigadier General Eliah Bandama.\n\nLivestock has also been killed while irrigation facilities have been destroyed.\n\nA dam breach is the collapse or movement of part of a dam or its foundation, such that the dam cannot retain water and in general, the breach results in a release of large quantities of water, posing a risk to people or property downstream.\n\nSpeaking from the site of the incident, Minister of State for Manicaland Provincial Affairs and Devolution Advocate Misheck Mugadza, who visited the area yesterday to assess the damage and console bereaved families, said search teams are on the ground looking for the missing persons.\n\nI am on the ground and I can confirm that four people have died. Three are still missing. The search continues and we hope that we will be able to find the missing persons soon, said Adv Mugadza.\n\nCivil Protection Unit chairman for Manicaland province, Mr John Misi, said among the deceased is a minor who was in the company of her mother who was doing laundry downstream and a man who was fishing.\n\nHe said the other two people were swept away by raging waters downstream.\n\nThe dam breach occurred at Bandama Farm, formerly known as Canterbury Farm. Although we are waiting for finer details, we are told that there was a female adult who was washing clothes downstream in the company of her two children and one of them  four years old  was swept away and the body was later retrieved.\n\nThe other child who was with her mother, a 15-year-old, was swept away and was left marooned on a piece of land. The teen was later rescued.\n\nThe other person who died was a 30-year-old man who was on a fishing expedition. It happened at a farm that is owned by the late national hero Brigadier Bandamas family. The other two deceased were swept downstream, said Mr Misi.\n\nIn a separate interview, Chipinge District Development Co-ordinator Mr William Mashava said a search is currently underway for the bodies of missing people, adding that some macadamia farmers were left counting losses after their pump houses, which were close to the river in Ward 7 and 10 of the district, were swept away.\n\nSeveral pumps houses in Ward 7 and 10, which were installed close to the river, were destroyed due to flooding, said Mr Mashava.\n\nWard 10 Councillor Piason Sithole said the community, together with various stakeholders is on the ground assisting in the search for the missing persons.\n\nHe added that some villagers also lost their livestock.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/03/Page-1-Mugadza.jpg",
            "description": "Ray Bande and Luthando Mapepa Herald Reporters A DAM breach at Bandama farm (formerly Canterbury farm) in Chipinge has resulted in the release of large quantities of water downstream, killing four people including a four-year-old girl. Three people are also missing following the incident which occurred on Sunday at the property owned by the late […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "Teams on the ground to rehabilitate Byo-Vic Falls highway",
            "url": "https://www.herald.co.zw/teams-on-the-ground-to-rehabilitate-byo-vic-falls-highway/",
            "content": "Freeman Razemba, Senior Reporter\n\nSECTIONS of the Bulawayo-Victoria Falls Road in dire need of rehabilitation are now receiving urgent work and pictures circulating on social media claiming to be of people posing in a pothole on the highway are false, the Ministry of Transport and Infrastructural Development said yesterday.\n\nIt has come to our attention that a social media post is circulating, showing three people posing in a pothole on a road claimed to be part of the Bulawayo-Victoria Falls Highway. While we acknowledge that certain sections of the highway are in dire need of rehabilitation, the images in the post do not correspond to any section of the Bulawayo-Victoria Falls Highway, the Ministry said in a statement.\n\nIt said sections requiring immediate attention are currently being addressed through a collaborative effort between the Department of Roads and Bitumen World.\n\nWork is already underway, with teams camped in Hwange, Halfway, and Insuza to ensure the road is rehabilitated efficiently.\n\nIn October last year, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said Cabinet had considered and adopted the proposed Public-Private Partnership between Government and Bitumen World for the immediate rebuild of the Beitbridge-Bulawayo-Victoria Falls road.\n\nGovernment immediately engaged contractors who are now on the ground seized with rehabilitation works.\n\nThe Second Republic, under President Mnangagwa, has continued to prioritise infrastructural development countrywide under the Emergency Road Rehabilitation Programme (ERRP2) and various other initiatives which have transformed the economy as well as creating employment and bringing joy among citizens.\n\nThe President has invested significantly in infrastructural development as a key enabler to economic transformation, despite limited access to external lines of credit.\n\nSo far, more than 50 000km of roads have been rehabilitated, while 2 000 structures have been attended to since the start of the ERRP2 in 2021.\n\nGovernment is also in the process of negotiating with potential investors for the rehabilitation of some of the countrys roads.\n\nCurrently, some of the roads that are under construction are the Golden Valley Sanyati Road, Murambinda-Birchenough Road while on the Harare-Chirundu Road project, bush clearing is underway.\n\nRecently, the Government secured new equipment, including tractors, to resuscitate road maintenance units across the country.\n\nThis effort seeks to ensure consistent monitoring and maintenance of roads reconstruction under the ERRP2, reflecting the Second Republics commitment to infrastructure development.\n\nIn addition to reviving road maintenance units, plans are underway to establish asphalt plants nationwide to complement these efforts.\n\nThe resuscitation of road maintenance units is a crucial step in strengthening the countrys infrastructure, which is vital for achieving the Vision of becoming an upper-middle-income society by 2030.\n\nRoad construction is recognised as a key economic enabler, and these initiatives aim to support sustainable development across the nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Dr-Jenfan-Muswere.jpg",
            "description": "Freeman Razemba, Senior Reporter SECTIONS of the Bulawayo-Victoria Falls Road in dire need of rehabilitation are now receiving urgent work and pictures circulating on social media claiming to be of people posing in a pothole on the highway are false, the Ministry of Transport and Infrastructural Development said yesterday. “It has come to our attention […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "Sadc ministers to focus on  peace, security, industrialisation",
            "url": "https://www.herald.co.zw/sadc-ministers-to-focus-on-peace-security-industrialisation/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nTHE forthcoming SADC Council of Ministers which commences in Harare tomorrow will focus primarily on the SADC Regional Indicative Strategic Development Plan (RISDP), Foreign Affairs and International Trade Minister Professor Amon Murwira has said.\n\nThe RISDP 20202030 outlines six strategic priority areas, including Peace, Security and Good Governance; Industrial Development and Market Integration, Infrastructure Development, Social and Human Capital Development; and Cross-cutting issues including Gender, Youth, Environment and Climate Change, and Disaster Risk Management.\n\nMinister Murwira, who will preside over the meeting as the Chairperson of the SADC Council of Ministers, yesterday told The Herald that preparations for the gathering were going on superbly.\n\nPreparations for the SADC Council of Ministers are going on superblythey are going very well.\n\nDuring the meeting (which commences on Wednesday) we are going to discuss the SADC Regional Indicative Strategic Development Plan 2020-2030, he said.\n\nAccording to the programme, SADC Executive Secretary Mr Elias Magosi will make the welcome remarks tomorrow, followed by Prof Murwira.\n\nDuring the two-day meeting, the Ministers will also focus on the theme of the 44th SADC Summit of Heads of State and Government: Promoting innovation to unlock opportunities for sustained economic growth and development towards an industrialised SADC.\n\nThat summit was held in Harare in August last year and saw President Mnangagwa taking over as SADC Chairperson.\n\nOn Sunday, Mr Magosi, who is already in the country, met with the United Nations (UN) Food and Agriculture Organisation (FAO)s Sub-Regional Coordinator for Southern Africa Dr Patrice Talla and discussed issues around regional food security.\n\nThe Executive Secretary of the Southern African Development Community (SADC), H.E Elias M. Magosi today (Sunday) 09 March 2025 met with the United Nations (UN) Food and Agriculture Organisation (FAO) Sub-Regional Coordinator for Southern Africa, Dr Patrice Talla.\n\nThe Courtesy visit took place in Harare, Zimbabwe at the margins of the SADC Ordinary Council of Ministers Meeting to take place from 12-13 March 2025.\n\nMr Magosi expressed gratitude to the FAO for the technical and financial support provided to the Region and to individual Member States to progress with the implementation of the SADC RISDP 2020-2030, in the area of Agriculture and Food Security; Blue Economy, Fisheries and Aquaculture; Natural Resource Management; and Environment and Climate Change.\n\nThe Executive Secretary also underscored the willingness of the SADC Secretariat to continue working closely with FAO to fully implement RISDP 2020-2030 in those sectors.\n\nThe SADC Secretariat and FAO signed a Memorandum of Understanding (MoU) on 18th September 2020.\n\nThe MoU aims to promote co-operation mainly in the areas of food security and agriculture, including livestock and crops; natural resources, including fisheries/aquaculture and forestry; environment and climate change; and animal and plant genetic resources conservation, said the SADC Secretariat.\n\nOn his part, Dr Talla emphasised the need to review the current MoU 2020-2025 and develop and sign a new MoU for the period 20252030 to progress with the joint implementation of the RISDP 2020-2030, as well as the Kampala Declaration, approved in January 2025.\n\nOn Friday, there will be a closing ceremony where Prof Murwira is expected to make the concluding remarks.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Professor-Amon-Murwira.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter THE forthcoming SADC Council of Ministers which commences in Harare tomorrow will focus primarily on the SADC Regional Indicative Strategic Development Plan (RISDP), Foreign Affairs and International Trade Minister Professor Amon Murwira has said. The RISDP 2020–2030 outlines six strategic priority areas, including Peace, Security and Good Governance; Industrial Development and […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "Mbire councillors get motorbikes to improve mobility",
            "url": "https://www.herald.co.zw/mbire-councillors-get-motorbikes-to-improve-mobility/",
            "content": "Fungai Lupande, Mashonaland Central Bureau\n\nThere was jubilation in Mbire at the weekend after 22 councillors received motorbikes from the Mbire Rural District Council, to ensure they reach every corner of the district and attend important council meetings without barriers.\n\nWard 1 Councillor Christmas Kachasu expressed his gratitude to the local authority, noting that he previously relied on a worn-out motorcycle.\n\nHe highlighted the challenges posed by poor road conditions, worsened by recent rains, which hindered his ability to connect with the community effectively on foot.\n\nHis ward encompasses vast tracts of forests and abundant wildlife.\n\nI was exposing myself to a lot of danger while navigating wildlife-infested forests. Public transport posed many inconveniences, causing me to miss important council meetings, Cllr Kachasu said at the handover ceremony last Friday.\n\nMinister of State for Mashonaland West Provincial Affairs and Devolution, Christopher Magomo, reinforced the commitment to the mantra that no place and no one will be left behind, as directed by President Mnangagwa.\n\nHe commended the local authority for prioritising service delivery.\n\nThe roads are in a bad state, but these motorbikes will enable councillors to access hard-to-reach areas.\n\nThe bikes are cost-effective to maintain, allowing councillors to attend essential meetings. Given that the wards in Mbire are quite far apart, the motorbikes will serve as tools for monitoring developmental projects as we work towards Vision 2030, he said.\n\nMinister Magomo also announced that provincial independence celebrations would take place in Mbire, reflecting the ongoing decentralisation agenda.\n\nMbire council chairperson, Councillor Ishmael Chaukura, emphasised the councils commitment to President Mnangagwas directive to prioritise service delivery.\n\nHe called for the decentralisation of funds allocated by the Zimbabwe National Road Administration (Zinara) to the Rural Infrastructure Development Agency (RIDA).\n\nWe acknowledge the receipt of funds from Zinara. Our roads need significant attention, and the local authority often bears the blame.\n\nThe motorcycles will empower our councillors to connect with their communities effectively, said Cllr Chaukura.\n\nChief Senate Matsiwo thanked President Mnangagwa for the Zunde raMambo programme, which provides food relief to the vulnerable. He praised the strong relationship between the council and traditional leaders.\n\nChiefs are invited to all important meetings, and we work collaboratively. The council listens to the peoples needs; for instance, they constructed a mothers shelter at Masomo Clinic.\n\nHowever, I expressed concern over the poor state of roads, especially the Mahuhwe-Chitsungo and Mushumbi-Chitsungo Hospital routes.\n\nTravellers using the Mahuhwe-Musengezi-Chidodo Road are paying exorbitant fees for a small stretch, said Chief Matsiwo.\n\nMP for Mbire, Cde David Butau, described the local authority as results-oriented, highlighting the collaboration among traditional leaders, the Member of Parliament, and the community.\n\nWe embrace Vision 2030, ensuring that no one is left behind. Mbire has a crucial role in supporting the Presidents vision, he said.\n\nActing CEO for Pfura Rural District Council, Engineer Emson Chitsungo, praised the cooperative relationship between Mbire RDC, its residents, and traditional leaders, noting that the unity in Mbire is exemplary.\n\nMoving in the same direction is crucial for development. We have heard the Chief speak positively about their council, and I will convey this message to Mt Darwin, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Mbire.jpg",
            "description": "Fungai Lupande, Mashonaland Central Bureau There was jubilation in Mbire at the weekend after 22 councillors received motorbikes from the Mbire Rural District Council, to ensure they reach every corner of the district and attend important council meetings without barriers. Ward 1 Councillor Christmas Kachasu expressed his gratitude to the local authority, noting that he […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "Civil servants’ flats 96pc complete",
            "url": "https://www.herald.co.zw/civil-servants-flats-96pc-complete/",
            "content": "Victor Maphosa, Mashonaland East Bureau\n\nTHE construction of civil servants flats in Maronderas Dombotombo suburb is nearing completion, with commissioning expected in the first quarter of this year.\n\nActual structures are finished, and the contractor, Leengate Contractors, is working on finer details before allocating accommodation to beneficiaries.\n\nThis initiative is part of the Governments broader strategy to tackle accommodation challenges faced by civil servants.\n\nThe project is fully funded by the Government, reflecting the commitment of the Second Republic to improving the living conditions for its employees.\n\nThe development consists of four three-storey blocks designed to house 64 families.\n\nEach block is thoughtfully constructed to provide comfortable living spaces specifically for serving civil servants.\n\nThe project is crucial for those deployed by the State to serve in various ministries, departments, and agencies of Government.\n\nYesterday, Minister of State for Provincial Affairs and Devolution for Mashonaland East, Advocate Itayi Ndudzo, toured the construction site to assess progress.\n\nDuring the visit, he was accompanied by Secretary for Provincial Affairs and Devolution, Mr Tavabarira Kutamahufa, along with other Government officials from the province.\n\nThe tour allowed them to observe the construction process firsthand and understand the significance of the project for the local community.\n\nAdv Ndudzo expressed optimism about the project, highlighting it as a significant step towards providing adequate housing for civil servants.\n\nHe said the development aligns with the objectives of Vision 2030, which aims to enhance the living standards of citizens.\n\nThis accommodation is specifically for serving civil servants, meaning those deployed by the State will be properly accommodated in this compound, Adv Ndudzo said.\n\nThe Second Republic says it is important to ensure that civil servants have access to decent housing, which is vital for their well-being and productivity.\n\nAdv Ndudzo also emphasised the need for this model to be replicated in other districts throughout the province.\n\nHe hopes the project could be commissioned before the end of the year, allowing for similar ground-breaking initiatives in other regions.\n\nLocal authorities are encouraged to collaborate with the Ministry of National Housing and Social Amenities to identify available land for future projects.\n\nDeputy Director in the Ministry of National Housing and Social Amenities, Engineer Wonderful Mashava, confirmed that the contractor is making final touches to the flats.\n\nHe reiterated their commitment to ensuring that serving civil servants will benefit from this initiative.\n\nWe expect that these flats will be commissioned in the first quarter of 2025, he said.\n\nThis timeline reflects the urgency and importance of providing adequate housing for civil servants in the area.\n\nIn addition to the Dombotombo project in Marondera, the Government has initiated the construction of similar blocks of flats in Mutawatawa, located in the Uzumba Maramba Pfungwe district.\n\nThe ongoing project demonstrates the Governments commitment to improving housing for civil servants across the province. Further, plans to construct additional flats in Murehwa district are at an advanced stage.\n\nThese initiatives signify a concerted effort by the Government to enhance the livelihoods of civil servants, ensuring they have access to quality accommodation as they serve the nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/flats.jpg",
            "description": "Victor Maphosa, Mashonaland East Bureau THE construction of civil servants flats in Marondera’s Dombotombo suburb is nearing completion, with commissioning expected in the first quarter of this year. Actual structures are finished, and the contractor, Leengate Contractors, is working on finer details before allocating accommodation to beneficiaries. This initiative is part of the Government’s broader […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT: World Bank now upbeat  over Zimbabwe",
            "url": "https://www.herald.co.zw/editorial-comment-world-bank-now-upbeat-over-zimbabwe/",
            "content": "The World Bank, perhaps unfairly, tends to have the reputation of looking on global and national economies with a somewhat gloomy face, emphasising the problems, stresses and strains.\n\nSo it was surprising last week when the Confederation of Zimbabwe Industries heard a very upbeat presentation on Zimbabwean economic opportunities from World Bank senior country economist for Zimbabwe Mr Victor Steenbergen, who spoke in many ways as a promoter of Zimbabwe, with the caveats that we expect from a banker mind you.\n\nBut the basic message that he was pushing is that there is so much untapped potential in Zimbabwe, especially as we add private sector organisation and investment to what is already happening, that the prophets of doom and destruction are simply wrong, and that our future, if we work hard and make right decisions, is rather bright.\n\nSo many Zimbabweans actually like complaining, or feel that they should be able to get rewards when they make bad management decisions or simply for breathing rather than working, it is refreshing when a well-informed outsider can look dispassionately at our country and our economy and see vast opportunities.\n\nIt is interesting where he sees the initial range of opportunities we have only partly or perhaps barely tapped, when you think about future volumes. The traditional big three of agri-business, mining and tourism tended to dominate the presentation, with the industrialists being addressed still largely having to make a big splash.\n\nFarmers and agri-businesses obviously need to expand their range to include some of the far higher value crops, such as horticulture where there are good markets within range of a single flight or of land and see transport for some of the products if people decided to move quickly.\n\nWe are now building up this industry, although we still have some catch up to do to where were once were, with daily charter flights, although that is partly offset by the greater cargo space in scheduled passenger flights, often having capacity to take out such produce in the spaces that were used to bring in critical machine parts and other urgent spares.\n\nThe opportunities require both high-quality fresh produce as well as a range of processed products, which is where industrialists come in. Customers will demand near perfection plus zero disease or other problems so quality is what will sell. But this opens up many opportunities, including in the testing of produce before it is flown out as we have already seen.\n\nA lot of Zimbabwean farmers know what they are doing and can produce this sort of quality product, so the opportunities are large.\n\nMining as a second area mentioned. There has been dramatic expansion in recent years, with value more than quadrupling, and yet we are possibly only touching the surface when it comes to the modern minerals such as lithium and the platinum group, where Zimbabwe moves into the highest ranks of African and world reserves. Output has been climbing and local processing has been pushed, already to concentrates of both with plans to go to the next value-addition stages by the investor mining companies.\n\nBut apparently we can increase production significantly, even when our percentages appear in the top-ten charts.\n\nTourism, and here Mr Steenbergen was quite honest in that it tends to be totally dominated by Victoria Falls, when there is a lot more that could be developed with the same passion and expertise. One particular area for development is to try and get more people coming for the Falls, and this is the destination that everyone knows about, to then stay for a few more days and look at other attractions, everything from the animals down the road in Hwange to areas far further away.\n\nWe still have a fairly low average of bed nights for most international visitors and the serious development, since there are upper limits as to how many people can visit the Falls each day before it becomes too crowded.\n\nTourism, and mining and agri-business all share another interesting characteristic: they can be labour intensive and this is another plus for Zimbabwe, increasing wealth and getting more people to earn a reasonable living.\n\nWe need to note that Mr Steenbergen seems to agree strongly with the Government, that the private sector is the only real vehicle for creating wealth although it obviously does need support and infrastructure from the Government. But Governments do not rally run businesses, although provide the base on which they can be run.\n\nMr Steenbergen brought up the complications of some of our permit and licensing systems. The Government has been working on simplifying these, and we are probably coming into the stages where the private sector, potential investors and even the World Bank need to start sketching what they think is required and how the essential requirements can be put together in a single licence.\n\nWhat we have to keep is the environmental, health and safety rules, although these can be brought together as far as possible to simplify matters, and then get businesses to follow a simple tax code, and it needs to be simple, and a clear and easy to implement labour code.\n\nOne complication is that licences and permits come from different authorities under different Acts of Parliament and a whole pile of statutory instruments. We have moved towards a one-stop authority but clearly need to push that further and winnow out anything that does not really make sense, or more importantly and usefully, be able to combine authorities or at least the permit ends of them, so that a simple and straightforward permit can be issued with rational requirements, instead of a pile of them.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/10/World-Bank-680x380.jpg",
            "description": "The World Bank, perhaps unfairly, tends to have the reputation of looking on global and national economies with a somewhat gloomy face, emphasising the problems, stresses and strains. So it was surprising last week when the Confederation of Zimbabwe Industries heard a very upbeat presentation on Zimbabwean economic opportunities from World Bank senior country economist […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "Government to take  over unsuccessful EPOs",
            "url": "https://www.herald.co.zw/government-to-take-over-unsuccessful-epos/",
            "content": "Business Reporter\n\nThe Government plans to designate some of the areas covered by unsuccessful Exclusive Prospecting Orders (EPOs) as State assets, a Cabinet minister has said.\n\nThis follows a vetting exercise conducted last year after the Government suspended issuing new EPOs to curb speculative land holding and promote transparency in the mining sector, the countrys biggest source of foreign currency.\n\nIn 2023, the Government had 38 active EPOs granted.\n\nMining is also strategically important to Zimbabwe, employing thousands and contributing roughly 12 percent to the gross domestic product (GDP).\n\nZimbabwe is home to more than 60 mineral occurrences although about 10 are commercially exploited.\n\nMines and Mining Development Minister Winston Chitando, responding to a question during a question-and-answer session in Parliament, said the State-owned Mining Promotion Company would be responsible for exploration in the reserved areas.\n\nGovernment policy and plans are that for EPOs that did not succeed, the Government is going to take some of these areas as Government reservations, which means the Mining Promotion Company will be responsible for searching and exploring where minerals are found, the mines minister said.\n\nMinister Chitando said the reason EPOs were designated Government reservations and given to mining promotion companies was that in most areas, minerals were found in different geological locations.\n\nSome of these minerals are alluvial, which, when you mine, you find that they are not very far from the surface, but others are deep down.\n\nAfter explorations . . . it will be determined that these are alluvial deposits, and these are deposits that are deep and will need a lot of funding.\n\nThe Government then determines who would occupy such because of the resources needed. For alluvial deposits, even small players can partake in those, he said.\n\nEPOs give exclusive rights to investors to search for specific minerals in an identified location and are issued for three years, although they can be renewed for a maximum of six years.\n\nIn terms of financing the Mining Promotion Company, Minister Chitando said the Cabinet allowed the company to partner with other companies in exploring for minerals but would take the lead.\n\nSecondly, every year, the ministry receives an allocation from the annual budget, but the annual budget cannot cater to all the needs of the responsible department, he said.\n\nHe said EPOs, which are not reservation areas, would be opened to the public to apply for authority to explore.\n\nPrior to the suspension of issuing new EPO licences, concerns had been raised that some EPO holders were keeping them for speculative purposes, without contributing to economic development through exploration or mining activities.\n\nAnalysts contend that allowing multiple players to explore in areas covered by EPOs would unlock significant value within the mining sector and stimulate economic growth.\n\nThis move could encourage increased investment, job creation, and foreign exchange earnings, ultimately benefiting the national economy\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/winston-1.jpg",
            "description": "Business Reporter The Government plans to designate some of the areas covered by unsuccessful Exclusive Prospecting Orders (EPOs) as State assets, a Cabinet minister has said. This follows a vetting exercise conducted last year after the Government suspended issuing new EPOs to curb speculative land holding and promote transparency in the mining sector, the country’s […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "15 years later: All set for Sam commemorations",
            "url": "https://www.herald.co.zw/15-years-later-all-set-for-sam-commemorations/",
            "content": "Trust Khosa\n\nOn March 15, 2025, the music fraternity will mark 15 years since the tragic death of Samson Mtukudzi.\n\nHe lost his life in a road accident, along with his confidante and sound engineer, Owen Chimhare.\n\nThe memory of Sam remains vivid among his fellow musicians from that era.\n\nHis life, much like a candle in the wind, was abruptly extinguished by the relentless hand of fate.\n\nThe impact of his loss continues to resonate, particularly within his family, who are still grappling with the grief of his untimely passing.\n\nHis father, the legendary Oliver Tuku Mtukudzi, also endured years of pain following the death of his son, who was only 21 at the time, passionately navigating the music landscape.\n\nDespite his absence, Sams music continues to enchant listeners, with some tracks seemingly predicting his own fate.\n\nOn April 5, his legacy and life will be commemorated through song and dance at Pakare Paye Arts Centre in Norton, Mashonaland West province.\n\nThis celebration serves as a reminder of Sams enduring influence and the profound impact he made during his brief yet vibrant life.\n\nWith the nation set to celebrate its 45th Uhuru holiday next month, Sams commemoration will be a precursor to the main event on April 18 for the youths.\n\nSams 15th anniversary is worth celebrating, as the versatile crooner made a significant impact.\n\nThe event is indeed worth celebrating.\n\nFellow crooners of his generation are set to perform at the event.\n\nThese include Agga Nyabinde, Tamy Moyo, Bernard Betera, Watson Jay Watta Chidzomba, Sarungano, Donald Kanyuchi, Chiedza Chevatendi, Esau, and Tetenda Macheso, who fronts Cheso Boys.\n\nJudging by the line-up, fans are in for a real treat, as most of the stars have excelled in their own capacities with various musical groups.\n\nAgga, who was mentored by the national hero Tuku, noted that it was an honour to perform at his sons 15th anniversary.\n\nAs Agga Nyabinde and 2 Nice Band, I promise a sterling performance in honour of the late Sam Mtukudzi and his father as well.\n\nWe are going to give our best performance and make sure we do what Sam always wanted to do. I learnt a lot from the late Sam Mtukudzi because, being a son of a legend himself, he could play Tukus music, but he expressed himself in his own way, he said.\n\nAgga, who has been in the game for over a decade, hailed Sam for his originality.\n\nYou could listen to his music and say, This sounds like Tuku music, but its different. So Sam was being Sam; he was not imitating Oliver Mtukudzi, and I appreciate that from him. He also taught us that as youngsters, we can do music and be responsible people, he stressed.\n\nAgga, who doubles as an arts administrator with the National Arts Council of Zimbabwe (NACZ), urged fans to show up in numbers.\n\nWe need to celebrate each other even after losing each other to death. Sam was a promising lad who had potential, and we can only celebrate his music now. I urge fans to show up in numbers as we honour him. Its 15 years gone by, and it feels like yesterday because time is flying, he added.\n\nSimilar sentiments were echoed by Jay Watta, who is now a resident artiste at Pakare Paye.\n\nI knew Sam very well because we grew up together in Norton and learned to play music at Pakare Paye Arts Centre. I once worked with him in his band, and I can simply say he was way ahead of his time.\n\nHis maturity and songwriting skills made him a cut above the rest, he said.\n\nHe recalled the good times he shared with the late star musicians in their musical journey.\n\nBesides being a son of a music legend, Sam was humble, and he would reduce himself to our level. We never had fights with him because he was a natural leader, who prioritised his work first.\n\nWe have a lot of good memories during live shows, and we embarked on this peak, he recalled.\n\nJay Watta revealed that accepting Sams death was hard.\n\nThe memories are still fresh because we were close and belonged to the same generation. There are times I miss him a lot, and its hard to believe its now 15 years after his death. I wish him well wherever he is right now, and we can only learn from his legacy, he said.\n\nJay Watta, who has settled well at Pakare Paye, urged fans to show up in numbers.\n\nSuch commemorations call for a collective hand, and we urge fans to show up in numbers. I am ready for the event, and it will be a day to remember for all those who followed his music, he stressed. Sam died in 2010 at his peak and was buried at Warren Hills Cemetery in Harare.\n\nIn 2019, his father succumbed to diabetes complications at the age of 66.\n\nHe was declared a national hero and buried at his homestead in Madziva, Mashonaland Central province.\n\nThe loss of Sam and his father left a void hard to fill.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Tuku.jpg",
            "description": "Trust Khosa On March 15, 2025, the music fraternity will mark 15 years since the tragic death of Samson Mtukudzi. He lost his life in a road accident, along with his confidante and sound engineer, Owen Chimhare. The memory of Sam remains vivid among his fellow musicians from that era. His life, much like a […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        },
        {
            "title": "Slain detective buried",
            "url": "https://www.herald.co.zw/slain-detective-buried/",
            "content": "Peter Matika, Bulawayo Bureau\n\nTHE late Detective Constable Cassandra Hove, who was fatally shot during a gunfight with armed robbers in Bulawayos Pumula South suburb last Thursday, was laid to rest yesterday at her rural home in Mataruse Village, Mberengwa District, Midlands Province.\n\nHowever, her burial was overshadowed by controversy, as her family continues to question the circumstances surrounding her death.\n\nDuring her funeral service at Nyaradzo Funeral Parlour in Bulawayo on Sunday, emotions ran high as family members confronted the police, accusing them of concealing the truth.\n\nThey alleged that Hove was not killed by the robbers, but rather by one of her colleagues and demanded clarification on whether this was an accident or intentional.\n\nAccording to official police reports, Hove sustained gunshot wounds to her upper body during an exchange of fire with the suspects at around 8:40pm. She was rushed to a nearby private clinic, where she was pronounced dead upon arrival.\n\nThe family demanded to know the identities of the officers deployed in the Pumula South raid and the individual who authorised Hoves post-mortem, arguing that they were not involved in the process and were shocked to learn that someone else had signed documents at the hospital as Hoves next of kin.\n\nThe family said it was not satisfied with the version of events given by the police and vowed to pursue the matter until the culprits were brought to justice. Family spokesperson Mr Ryan Gambinga confirmed Hoves burial.\n\nShe has been laid to rest in Mataruse Village in Mberengwa today (yesterday), he said.\n\nShe is survived by four children.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Cassandra-Hove-680x380.jpg",
            "description": "Peter Matika, Bulawayo Bureau THE late Detective Constable Cassandra Hove, who was fatally shot during a gunfight with armed robbers in Bulawayo’s Pumula South suburb last Thursday, was laid to rest yesterday at her rural home in Mataruse Village, Mberengwa District, Midlands Province. However, her burial was overshadowed by controversy, as her family continues to […]",
            "time": "06:30",
            "date": "11 Mar 2025"
        }
    ]
}