{
    "news": [
        {
            "title": "Government assures Mash West of peace, security",
            "url": "https://www.herald.co.zw/government-assures-mash-east-of-peace-security/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nMashonaland West Provincial Affairs and Devolution Minister Marian Chombo has condemned planned demonstrations as an attempt to disrupt the nations peace, security and development.\n\nAddressing the media this morning, Minister Chombo said the Government is committed to promoting peace, security and development in the province.\n\nThe Minister of State for Provincial Affairs and Devolution unequivocally condemns the planned demonstrations across the breadbasket province of the nation, she said.\n\nThese demonstrations will not only disrupt our efforts towards peace and stability in the province, but will also disrupt our economic trajectory as well as put lives of innocent citizens at risk.\n\nShe said security organs will not hesitate to take decisive measures against those who intend to disrupt peace and stability in the province and the country at large.\n\nI humbly urge all stakeholders, including civil society organisations, the business community and community leaders, to desist from engaging in any activities that may incite violence or disrupt the prevailing peace and tranquillity, she added.\n\nShe urged citizens, the business community and all stakeholders to continue operating as usual and alert law enforcement agencies should there be attempts to disrupt peace and business activities.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/b0af9a9c-f717-45e1-9578-351909c967b8-680x380.jpeg",
            "description": "Mashonaland West Provincial Affairs and Devolution Minister Marian Chombo has condemned planned demonstrations as an attempt to disrupt the nation’s peace, security and development.",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "Business as usual in Harare",
            "url": "https://www.herald.co.zw/business-as-usual-in-harare/",
            "content": "Online Reporter\n\nHarare remains calm, with business going on as usual this Sunday, despite reports of a planned demonstration scheduled for tomorrow.\n\nShops and supermarkets, including TM Pick n Pay in the city centre, are recording steady customer activity, while transport services are operating without disruption.\n\nChurch services across the capital are going on as usual, with congregants gathering for prayers, showing no visible signs of concern over the anticipated protest.\n\nMeanwhile, authorities have assured the public that security measures are in place to maintain order.\n\nMost residents appear focused on their daily routines.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/d3df0237-784f-4045-95fb-4b8d71c9c90d-680x380.jpeg",
            "description": "Harare remains calm, with business going on as usual this Sunday, despite reports of a planned demonstration scheduled for tomorrow.",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "Mat South police ban dangerous weapons",
            "url": "https://www.herald.co.zw/mat-south-police-ban-dangerous-weapons/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nThe Zimbabwe Republic Police (ZRP) has imposed a three-month ban on carrying dangerous weapons in public in a bid to curb rising violent crimes in Beitbridge, Gwanda, Plumtree and Umzingwane Districts.\n\nIn a public notice, police announced that the ban will be in effect from March 27 to June 29, 2025.\n\nThe prohibited weapons include catapults, machetes, axes, knobkerries, swords, knives and daggers.\n\nThe ZRP said the decision was prompted by a spike in violent crimes, including murder, attempted murder, assault, robbery, domestic violence, unlawful entry, theft and rape.\n\nActing in terms of Section 2(4) of the Maintenance of Peace and Order Act (Chapter 11:23), I do hereby temporarily prohibit the carrying in public or public display of any of the following items capable of being used as weapons, namely catapults, machetes, axes, knobkerries, swords, knives or daggers from March 27 to June 29, 2025, reads the notice.\n\nFor the avoidance of doubt, it is declared that in terms of Section 4(4) of the Maintenance of Peace and Order Act, any person failing to comply with such a prohibition order shall be guilty of an offense and liable to a fine not exceeding level five or imprisonment for six months or to both such a fine and imprisonment, reads the notice.\n\nDuring this period, police will seize all prohibited weapons and arrest offenders found violating the order.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/zrp.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau The Zimbabwe Republic Police (ZRP) has imposed a three-month ban on carrying dangerous weapons in public in a bid to curb rising violent crimes in Beitbridge, Gwanda, Plumtree and Umzingwane Districts. In a public notice, police announced that the ban will be in effect from March 27 to June 29, 2025. […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "Teachers not part of protests: Zimta",
            "url": "https://www.herald.co.zw/teachers-not-part-of-protests-zimta/",
            "content": "Ivan Zhakata\n\nTeachers have rejected plans to foment unrest in the country, underscoring the need for constructive engagement with authorities rather than disruptive demonstrations.\n\nIn an interview, Zimbabwe Teachers Association (Zimta) president, Mr Akuneni Maphosa reaffirmed the unions commitment to dialogue as the best approach to addressing teachers concerns.\n\nAs Zimta, we are a registered trade union that believes in engagements and dialogue with Government, he said.\n\nWe are not an organisation that meddles in politics, we do not participate in politics.\n\nWe are not against the Government and therefore our members are not going to be part of the March 31 protests, said Mr Maphosa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/dsfggfsdgfd.jpg",
            "description": "Ivan Zhakata Teachers have rejected plans to foment unrest in the country, underscoring the need for constructive engagement with authorities rather than disruptive demonstrations. In an interview, Zimbabwe Teachers Association (Zimta) president, Mr Akuneni Maphosa reaffirmed the union’s commitment to dialogue as the best approach to addressing teachers’ concerns. “As Zimta, we are a registered […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "Mashonaland West celebrates Chidhakwa’s RDC award",
            "url": "https://www.herald.co.zw/mashonaland-west-celebrates-chidhakwas-rdc-award/",
            "content": "Mashonaland West Bureau Chief\n\nZVIMBA DISTRICT is over the moon after its chief executive officer Mr Enias Chidakwa won the overall best leader in the rural local authorities category.\n\nMr Chidakwa beat 59 other CEOs from across the country on the back of impressive revenue collection and subsequent financing of budgeted projects.\n\nZvimba RDC also managed to build 13 classroom blocks in the period under review.\n\nIn an interview, Mr Chidakwa said his success hinged on leading a united team that pulls together in solving challenges and formulating strategies for growth.\n\nThis is an honour for Zvimba and Mashonaland West province, which continues to demonstrate its capacity to run local authorities, said Mr Chidakwa.\n\nHe noted the pressure from neighbouring urban local authorities  including Chinhoyi, Harare and Norton  puts healthy pressure on the council to perform.\n\nHis desire, he revealed, is to have Banket Local Board, Murombedzi Growth Point and Nyabira attain municipal and town statuses.\n\nMashonaland West province has maintained a tight grip on the accolade after Mhondoro-Ngezi RDC won the award last year.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Zvimba-rdc.jpg",
            "description": "Mashonaland West Bureau Chief ZVIMBA DISTRICT is over the moon after its chief executive officer Mr Enias Chidakwa won the overall best leader in the rural local authorities category. Mr Chidakwa beat 59 other CEOs from across the country on the back of impressive revenue collection and subsequent financing of budgeted projects. Zvimba RDC also […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "BREAKING: Ignore calls for protests: Minister Muswere",
            "url": "https://www.herald.co.zw/breaking-ignore-calls-for-protests-minister-muswere/",
            "content": "Zvamaida Murwira\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has urged Zimbabweans to ignore calls for protests by misguided elements, assuring the nation that the countrys security sector is well-prepared to maintain law and order.\n\nDr Muswere said this while addressing the media in Harare on Saturday morning.\n\nAs official Government spokesman, I would like to assure the nation that peace and stability continue to prevail in our country in terms of the Constitution and all Zimbabweans should disregard misinformation and disinformation being peddled on social media platforms by cyber terrorists about the 31st of March, 2025, said Dr Muswere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/qefqef-1-680x380.jpg",
            "description": "Zvamaida Murwira Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has urged Zimbabweans to ignore calls for protests by misguided elements, assuring the nation that the country’s security sector is well-prepared to maintain law and order. Dr Muswere said this while addressing the media in Harare on Saturday morning. “As official Government spokesman, I […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "NEW: Masvingo province assures citizens of safety, security",
            "url": "https://www.herald.co.zw/new-masvingo-province-assures-citizens-of-safety-security/",
            "content": "George Maponga in MASVINGO\n\nSECURITY AGENTS in Masvingo province are on high alert to ensure the safety and security of residents.\n\nAt a press briefing at Benjamin Burombo Government Complex on Saturday, Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira said the Government will deal with those seeking to disrupt peace and normal business activities.\n\nThe briefing was also attended by members of the Joint Operations Command (JOC).\n\nMinister Chadzamira urged residents, businesses and public institutions, including schools, to continue their operations as usual, stating that their safety is guaranteed.\n\nOur various security arms of Government are on high alert in the wake of some social media posts calling for unlawful actions that undermine the prevailing peace and security in our province, he said.\n\nThe safety of our citizens in the province and visitors is guaranteed and we urge our people to continue with their day-to-day socio-economic activities in pursuance of Vision 2030.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/11/Minister-Chadzamira.jpg",
            "description": "George Maponga in MASVINGO SECURITY AGENTS in Masvingo province are on high alert to ensure the safety and security of residents. At a press briefing at Benjamin Burombo Government Complex on Saturday, Minister of State for Masvingo Provincial Affairs and Devolution Ezra Chadzamira said the Government will deal with those seeking to disrupt peace and […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "NEW: Suspected serial armed robber appears in court",
            "url": "https://www.herald.co.zw/new-suspected-serial-armed-robber-appears-in-court/",
            "content": "Yeukai Karengezeka\n\nA 43-year-old man, Garikai Shangwa, suspected of being part of a syndicate behind a series of armed robberies, appeared in court on Friday facing five counts of robbery.\n\nHe was remanded in custody and advised to apply for bail at the High Court.\n\nShangwa is linked to multiple high-profile robberies, including the theft of US$74 000 from businessman Wicknell Chivayos in-laws at their Marondera farm.\n\nHe is also accused of participating in a violent robbery at Stapleford Farm in Nyabira on December 30, 2024, alongside accomplices Doubt Makumana, Doubt Stephen Kaseya Taurai  who is already on remand  and others still at large.\n\nAccording to the State, the gang first attacked two security guards at the farm, stealing their personal belongings, tying them up and threatening them with firearms to get information.\n\nShortly after, they ambushed a farm vehicle, stealing a shotgun and restraining both the driver and a supervisor.\n\nThe robbery escalated when the suspects broke into the farm owners residence, cutting through security fences before ransacking the house.\n\nThey reportedly stole an FN pistol, ammunition and US$40 000 in cash.\n\nThe gang later abandoned the stolen vehicle and divided the loot, which amounted to US$47 000 (including the pistol and ammunition).\n\nShangwa was arrested after police investigations, while some of his accomplices are still at large.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/08/Crime-Scene.jpg",
            "description": "Yeukai Karengezeka A 43-year-old man, Garikai Shangwa, suspected of being part of a syndicate behind a series of armed robberies, appeared in court on Friday facing five counts of robbery. He was remanded in custody and advised to apply for bail at the High Court. Shangwa is linked to multiple high-profile robberies, including the theft […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "NEW: Former CCC legislators convicted for unlawful gathering",
            "url": "https://www.herald.co.zw/new-former-ccc-legislators-convicted-for-unlawful-gathering/",
            "content": "Yeukai Karengezeka\n\nFORMER Citizens Coalition for Change (CCC) legislators Amos Chibaya and Costa Machingauta, along with three others, were convicted on Friday for participating in an unlawful gathering.\n\nThe ruling was delivered by magistrate Mrs Sharon Rakafa.\n\nHowever, 20 other accused individuals were acquitted after the court determined they had been arrested while merely walking along a road in Budiriro during the incident in 2023.\n\nMagistrate Rakafa ruled that these individuals were victims of a dragnet arrest, and the State failed to prove their involvement in the CCC gathering.\n\nThose convicted  Chibaya, Machingauta, Monica Mukwada, Aletta Viremai and Lancelot Tungwarara  were found guilty based on evidence that they were wearing CCC regalia and actively mobilising people to join the gathering.\n\nThe five were remanded out of custody and will return to court on Monday for sentencing.\n\nAccording to the State, on January 14, 2023, a total of 25 individuals, including those later acquitted, were invited to a CCC meeting at Machingautas residence in Budiriro 5B, Harare.\n\nThe invitation was reportedly shared on social media by Tungwarara.\n\nThe five convicted individuals were seen wearing CCC-branded caps, helmets and T-shirts at the gathering.\n\nThey allegedly chanted party slogans.\n\nPolice in Budiriro received a tip-off about the meeting and went to investigate.\n\nUpon arrival, they observed that the gathering was disturbing the peace.\n\nWhen officers ordered the group to disperse, the attendees reportedly resisted, leading to their arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-63.jpg",
            "description": "Yeukai Karengezeka FORMER Citizens Coalition for Change (CCC) legislators Amos Chibaya and Costa Machingauta, along with three others, were convicted on Friday for participating in an unlawful gathering. The ruling was delivered by magistrate Mrs Sharon Rakafa. However, 20 other accused individuals were acquitted after the court determined they had been arrested while merely walking […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        },
        {
            "title": "NEW: Parly sports committee meets Bulawayo councillors",
            "url": "https://www.herald.co.zw/new-parly-sports-committee-meets-bulawayo-councillors/",
            "content": "Zimpapers Sports Hub\n\nTHE Parliamentary Portfolio Committee on Sport is meeting Bulawayo City councillors Saturday morning to get an appreciation of the local authoritys thrust in providing facilities.\n\nDeputy director in the Ministry of Sport, Recreation, Arts and Culture Isaiah Mpofu confirmed the meeting on Saturday morning.\n\nThe councillors and parliamentarians will visit Barbourfields Stadium.\n\nCommittee chairperson Farai Jere and his committee have been to Harare, Mutare, Masvingo, Zvishavane, Hwange and Victoria Falls to get an appreciation of the situation on the ground.\n\nWhile enroute to Victoria Falls on Wednesday, they toured Khumalo Hockey Stadium and Queens Sports Club.\n\nOf concern is the dilapidation of facilities countrywide and promotion of bars at the expense of sport and recreation, according to Jere.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/qwe.jpg",
            "description": "Zimpapers Sports Hub THE Parliamentary Portfolio Committee on Sport is meeting Bulawayo City councillors Saturday morning to get an appreciation of the local authority’s thrust in providing facilities. Deputy director in the Ministry of Sport, Recreation, Arts and Culture Isaiah Mpofu confirmed the meeting on Saturday morning. The councillors and parliamentarians will visit Barbourfields Stadium. […]",
            "time": "20:33",
            "date": "30 Mar 2025"
        }
    ]
}