{
    "news": [
        {
            "title": "DRC crisis: AU commends Sadc, EAC peace initiative",
            "url": "https://www.herald.co.zw/drc-crisis-au-commends-sadc-eac-peace-initiative/",
            "content": "Farirai Machivenyika, Senior Reporter\n\nChairperson of the African Union (AU) Commission, Dr Moussa Faki Mahamat, has welcomed decisions made by the Southern Africa Development Community (Sadc) and the East African Community (EAC) to hold a joint summit to find a lasting solution to the conflict in the eastern Democratic Republic of Congo (DRC) that has resulted in the death and displacement of millions of people.\n\nWriting on his X handle, Dr Mahamat said the positions taken by the two regional groupings were in sync with that of the AU.\n\nI welcome the conclusions of the East African Community and SADC leaders following their respective Summits regarding the security situation in Eastern Democratic Republic of Congo and their decision to hold a joint intra regional Summit to map the next practical steps. Their recommendations echo the long-standing African Union call for a political solution through dialogue within the framework of the AU-led Luanda and Nairobi processes, he said.\n\nSadc Chairperson, President Mnangagwa, on Friday convened an Extraordinary Summit of the regional body in Harare to address the deteriorating security situation in eastern DRC.\n\nAnnouncing the agreed course of action in a communiqu, SADC executive secretary, Mr Elias Magosi, said the regional bloc was dedicated to peace efforts.\n\nSummit called for an immediate joint Summit of SADC and EAC to deliberate on the way forward regarding the security situation in the DRC as proposed by the 24th Extraordinary Summit of Heads of State of the EAC held on 29th January 2025, he said.\n\nAs part of its resolutions, the summit mandated the SADC Organ Troika on Politics, Defence and Security Cooperation to intensify diplomatic engagements with all State and non-State actors involved in the conflict.\n\nMr Magosi said ceasefire efforts were of paramount importance.\n\nSummit mandated the SADC Organ Troika on Politics, Defence and Security Cooperation to engage all State and non-State parties to the conflict on a ceasefire process to protect lives and facilitate a smooth flow of humanitarian support to people and communities affected by the armed conflict, he said.\n\nMr Magosi said the summit called for a coordinated approach and urged all political and diplomatic leaders involved in the conflict to engage meaningfully in dialogue.\n\nHe reaffirmed SADCs support for existing peace initiatives.\n\nSummit urged political and diplomatic leaders, who are parties to the conflict, to engage in a co-ordinated effort of dialogue, including supporting the Luanda Process, MONUSCO (UN Mission in the Congo) and others, to restore peace and security in Eastern DRC.\n\nSADC leaders also reaffirmed their commitment to the DRCs sovereignty, territorial integrity, and long-term stability, pledging ongoing support for its development and security.\n\nIn its communiqu after its Extraordinary Summit on Wednesday last week, the EAC also proposed a joint summit.\n\nNoting that SADC has also been involved in eastern DRC. The Summit decided on a joint EAC-SADC Summit to deliberate on the way forward and mandated the Chairperson (Kenya President William Ruto) to consult with the Chairperson of SADC (President Mnangagwa) on the urgent convening of the same in the next few days, reads part of the EAC communiqu.\n\nIn his opening remarks at the Extraordinary Summit, President Mnangagwa noted with regret that since an Extraordinary Summit that was held in Harare in November last year, very little progress has been made in our search for lasting peace in the eastern DRC, which is now characterised by escalating hostilities and conflict.\n\nThis culminated in the unfortunate and atrocious attacks carried out on our Mission in Goma, that claimed the lives of several SAMIDRC and MONUSCO peacekeepers, while others sustained serious injuries.\n\nThe people of the eastern DRC have suffered for far too long. SADC condemns in the strongest terms the attacks by aggressor forces. While we pause to mourn our loss, our resolve to ensure collective security cannot be shaken, he said.\n\nPresident Mnangagwa said it was important that dialogue and peace building are boldly pursued to achieve the intended result of peace for the benefit of the people of the Eastern DRC.\n\nTo this end, our region stands ready to intensify efforts to protect SADC citizens from all forms of instability, in line with the SADC Mutual Defence Pact. The peace and security of our region is a shared obligation.\n\nOur political-will must be strengthened towards a concrete and actionable roadmap that will help accelerate the realisation of peace in the Eastern DRC, he said.\n\nMay we, as member states, continue to do all we can to support our gallant men and women in the theatre of operations, and ensure that SAMIDRC achieves its important objective.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-1.jpg",
            "description": "Farirai Machivenyika, Senior Reporter Chairperson of the African Union (AU) Commission, Dr Moussa Faki Mahamat, has welcomed decisions made by the Southern Africa Development Community (Sadc) and the East African Community  (EAC) to hold a joint summit to find a lasting solution to the conflict in the eastern Democratic Republic of Congo (DRC) that has […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "‘No need for referendum to extend Presidential term’",
            "url": "https://www.herald.co.zw/no-need-for-referendum-to-extend-presidential-term/",
            "content": "Joseph Madzimure, Senior Reporter\n\nZANU PF has escalated its Annual National Peoples Conference resolution to extend President Mnangagwas term of office beyond 2028 to Parliament, with the party saying there is no need for a referendum as the polls will be postponed to 2030 via a Constitutional Amendment.\n\nSpeaking at the Mashonaland Central Provincial Coordinating Committee meeting on Saturday, Zanu PF National Political Commissar Cde Munyaradzi Machacha said the resolution, which was adopted at the 21st Zanu PF Annual National Peoples Conference in Bulawayo in October last year, is now in the implementation phase.\n\nAt a party policy meeting last Monday, we agreed to allow the Parliament of Zimbabwe to implement Resolution Number One as presented at the conference. There is no going back in implementing the resolution, he said.\n\nCde Machacha said those opposed to the resolution should have voiced their opinions at the conference or at provincial and district coordinating committee meetings.\n\nThose who do not support the resolution were free to debate it at the conference, Provincial Coordinating Committee meetings, or District Coordinating Committee meetings. We are now at the implementation stage, he said.\n\nIn a separate address at a Zanu PF Harare Youth inter-district meeting on Saturday, Harare Provincial Chairman Cde Godwills Masimirembwa elaborated on the plan to amend the Constitution to extend President Mnangagwas term by two years, pushing the next elections to 2030.\n\nAfter Parliament amends the Constitution by postponing the elections, it is not necessary to go for a Referendum. There will be no need for a Referendum. Parliament was directed to amend the Constitution in line with Resolution Number One, Cde Masimirembwa said.\n\nHe clarified that the proposed amendment aligns with Section 91(2) of the Constitution, which stipulates that a person is disqualified from running for president if they have already served two terms, with each term defined as three or more years.\n\nThe Referendum is only necessary if we interfere with the term limit provision, which is a three-year period. If the President serves less than three years, its not considered a full term. He falls within the term limit of the presidential term provision, Cde Masimirembwa said.\n\nFurther, he said the proposed extension does not violate constitutional term limits, as it only postpones the elections to 2030 without altering the two-term cap.\n\nThis will be in line with the two-term limit of the President according to the countrys Constitution. He will be within the confines of the two-term limit. What is required is just to postpone the elections up to 2030. There is no need to worry about interference with the term limit, so the party resolution is in tandem with the term limit provision, Cde Masimirembwa said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/01/Cde-Munyaradzi-Machacha.jpg",
            "description": "Joseph Madzimure, Senior Reporter ZANU PF has escalated it’s Annual National People’s Conference resolution to extend President Mnangagwa’s term of office beyond 2028 to Parliament, with the party saying there is no need for a referendum as the polls will be postponed to 2030 via a Constitutional Amendment. Speaking at the Mashonaland Central Provincial Coordinating […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "Let’s protect wetlands, says President",
            "url": "https://www.herald.co.zw/lets-protect-wetlands-says-president/",
            "content": "Columbus Mabika, Herald Reporter\n\nPRESIDENT Mnangagwa has called for the preservation and protection of wetlands as they play a key role in sustaining biodiversity, climate resilience and water security.\n\nHe made the remarks in a statement to commemorate this years World Wetlands Day yesterday.\n\nWorld Wetlands Day is commemorated to mark the signing of the Treaty on the conservation of wetlands.\n\nThe treaty was signed on February 2, 1971, in Ramsar, Iran.\n\nThis years commemorations were held under the theme, Protecting Wetlands for Our Common Future.\n\nPresident Mnangagwa said it was time the world reaffirms its commitment towards safeguarding wetlands.\n\nAs we approach World Wetlands Day 2025, under the theme Protecting Wetlands for Our Common Future, we recognise the vital role wetlands play in sustaining biodiversity, climate resilience and water security, reads part of the statement.\n\nIn the run-up to COP15, it is time to reaffirm our commitment to protecting these essential ecosystems. Wetlands are not just natural resources-they are foundational to our shared future. Lets come together to protect and restore them, ensuring their benefits for generations to come.\n\nThe commemorations come as the Government has continued to push for the protection of wetlands, stressing the need for immediate action to ring-fence these vital ecosystems from encroachment and degradation.\n\nThe treaty aims to raise public awareness on the conservation, proper utilisation and management of wetlands and their resources.\n\nWetlands remain one of the countrys vital ecosystems that have traditionally provided a wide range of ecological goods and services.\n\nThis years commemoration is of significance, as the 15th Meeting of the Conference of the Contracting Parties to the Convention on Wetlands (COP15) will take place in Zimbabwe.\n\nEvery three years, representatives of governments of each of the Contracting Parties meet to facilitate crucial discussions on the conservation and sustainable use of wetlands and to agree on a work programme for the next three years.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/wetland.jpg",
            "description": "Columbus Mabika, Herald Reporter PRESIDENT Mnangagwa has called for the preservation and protection of wetlands as they play a key role in sustaining biodiversity, climate resilience and water security. He made the remarks in a statement to commemorate this year’s World Wetlands Day yesterday. World Wetlands Day is commemorated to mark the signing of the […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "Catholicism has shaped VP Chiwenga’s work ethic",
            "url": "https://www.herald.co.zw/catholicism-has-shaped-vp-chiwengas-work-ethic/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nVICE President Dr Constantino Chiwenga says his deep-rooted connection with the Roman Catholic Church and spirituality is his primary motivation which fuels his service to the nation as per the Christian dictates of honest and selfless hard work.\n\nThe VP said this after his induction into the Roman Catholic guild at the Catholic Church of the Immaculate Conception at the House of Nazareth in Harare yesterday, an occasion that marked a milestone in his life of faith.\n\nAccompanied by his wife Colonel Miniyothabo Chiwenga, it was a special family event as the VP was inducted together with four of his sons, Dr Kudzai Chiwenga and Messrs Tawanda Chiwenga, Kudakwashe Chiwenga and Takudzwa Chiwenga.\n\nSpeaking to The Herald after his induction, the VP said the church plays a key role in moulding the family institution which in turn morphs into love, peace and national cohesion and unity, which are key components for national development.\n\nI was baptised soon after my birth on the 2nd of July 1956 and I have been a Catholic ever since, said VP Chiwenga.\n\nFast forward when I went to the war of liberation in 1973, I never stopped my Catholicism, I went to war with my rosary and I came back with it.\n\nAsked how he balances his busy national assignments and the church, the VP said: If I am not mistaken, I am one of the first people to be in the office, I come to work early and my commitment to the church serves as a motivation to my work.\n\nVice President Constantino Chiwenga after being adorned with a sash marking his induction into the Roman Catholic guild in Harare yesterday. Picture Mukudzei Chingwere\n\nHe, however, acknowledged that his demanding career often kept him from regular church attendance and was quick to note that getting the opportunity to be finally inducted into the guild was a long-cherished desire he has carried for long.\n\nDuring the time of the war and even after when my work did not permit, people did not see me a lot at church but whenever the time permitted, I would then go to church, said VP Chiwenga.\n\nAs a family we have been doing a number of pilgrimages and we continue to do that, what I had not done was to join the guilds, it was because of the nature of my job.\n\nBut now I have decided to join and I had wanted to do that long back, and I have started now with the first phase and I will go through the entire process.\n\nThe guild system in the Catholic Church encourages members to deepen their faith through prayer and education while building fellowship among parishioners.\n\nSt Gerrard Parish Priest, Father Mark Chikuni, presided over the guilds induction mass.\n\nHe commended the Vice President and his family for their commitment to the church and serving the Lord.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/VP1.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter VICE President Dr Constantino Chiwenga says his deep-rooted connection with the Roman Catholic Church and spirituality is his primary motivation which fuels his service to the nation as per the Christian dictates of honest and selfless hard work. The VP said this after his induction into the Roman Catholic guild at […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "Chiefs to lead community outreach ahead of Gukurahundi hearings",
            "url": "https://www.herald.co.zw/chiefs-to-lead-community-outreach-ahead-of-gukurahundi-hearings/",
            "content": "Nqobile Tshili, Bulawayo Bureau\n\nTRADITIONAL chiefs have been urged to prepare their communities for the start of the Gukurahundi public hearings, which are due to begin before the end of March.\n\nFurther details of the programme are expected to be released within the next two weeks.\n\nOver the weekend, the Gukurahundi steering committee met in Bulawayo to finalise preparations for the hearings.\n\nChief Mtshane Khumalo, president of the National Council of Chiefs, chaired the meeting where traditional leaders agreed to begin community outreach and awareness campaigns.\n\nPresident Mnangagwa has tasked traditional leaders with leading the process of addressing the post-independence conflict that affected the Matabeleland region and parts of the Midlands, as part of national healing efforts.\n\nThe President launched the Gukurahundi public hearings programme last July, empowering traditional leaders to conduct the hearings. However, the provision of adequate resources had previously stalled progress, but now Government has committed more resources to ensure the process can begin.\n\nFollowing yesterdays meeting, Chief Mtshane, in an interview, said preparations are progressing well and stressed the importance of chiefs educating their communities on the hearings.\n\nThe public hearings will be held in rural areas, meaning those wishing to contribute will have to travel to their rural homes to make submissions.\n\nThe message to the public is that all chiefs have been urged to make their people aware of this programme. Some have already done so, and those who havent should explain that the programme is imminent. We believe this is important; the Gukurahundi issue has been with the people in the Matabeleland region for a long time. We dont know if we will fully close this chapter, but people should have the opportunity to share their experiences, said Chief Mtshane Khumalo.\n\nHe acknowledged the challenging task ahead but expressed confidence that the training received by traditional leaders over the past five years has equipped them to manage the process effectively.\n\nChief Mtshane Khumalo stressed that a victim-centred approach will be crucial for the success of the meetings.\n\nI believe its a mammoth task. Initially, when we were assigned, we thought we would complete it quickly. But, having gone through the processes, I can tell you it is a mammoth task. Going to the people will not be easy, but we have been trained on how to approach this process, how to conduct the meetings. We needed training on how to approach the victims. This is not like the normal cases we preside over in our courts.\n\nWhen we approach a Gukurahundi victim, you have to be very cautious. In most cases, these people are very emotional, and if you are not careful in your approach, you might cause more harm than good. So, we have to be careful how we approach them, and that requires training, he said.\n\nWhile some have suggested the Gukurahundi public hearings will be ineffective, Chief Mtshane Khumalo urged the public not to make assumptions and to allow the process to proceed smoothly.\n\nI dont think that assumption is correct, he said. Lets just wait and see what the victims will say because we are not all victims, and chiefs are merely facilitators in this programme. So, let us go and hear what the victims will say and await the Governments response and actions. I think its too early to pre-empt anything.\n\nThe Government has already procured recorders, laptops and other gadgets for use during the programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Senator-Chief-Mtshane-Khumalo.jpg",
            "description": "Nqobile Tshili, Bulawayo Bureau TRADITIONAL chiefs have been urged to prepare their communities for the start of the Gukurahundi public hearings, which are due to begin before the end of March. Further details of the programme are expected to be released within the next two weeks. Over the weekend, the Gukurahundi steering committee met in […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "Byo tragedy: Victims’ burial today",
            "url": "https://www.herald.co.zw/byo-tragedy-victims-burial-today/",
            "content": "Raymond Jaravaza, Bulawayo Bureau\n\nEDWIN Chimbangu (35), his four-year-old son Promise and seven-month-old daughter Prudence, victims of a horrific triple killing in their Cowdray Park home in Bulawayo, will be buried today in Chinhoyi, Mashonaland West Province.\n\nFive days have passed since the brutal act that claimed their lives. Happiness Chimbangu, the childrens mother and Edwins wife, remains in custody, charged with their murders.\n\nYesterday afternoon, three hearses from Kingdom Blue funeral services were a sombre sight on the streets of Bulawayo, as they made their way to Chinhoyi.\n\nIn a compassionate gesture, Kingdom Blue provided free transport, a coffin, and burial services for the youngest victim, seven-month-old Prudence.\n\nThe father and his son were covered by the familys funeral policy, but the youngest child was not. Therefore, Kingdom Blue stepped in to provide free burial services for her. They will be buried together in Chinhoyi today, said Mr Mbongiseni Ncube, an official from Kingdom Blue.\n\nThe alleged perpetrator, Happiness, appeared at the Western Commonage Magistrates Court on Saturday and was remanded in custody until 14 February 2025.\n\nThe court heard that on Wednesday at approximately 8pm, Happiness was at her Cowdray Park residence with her two children when her husband, Edwin, returned home from his vending business in the city centre.\n\nHe reportedly questioned why she had not prepared supper, despite having all the necessary ingredients.\n\nInstead of answering, Happiness allegedly raised her voice and threatened to kill herself with a kitchen knife she had taken from the table.\n\nSensing danger, Edwin quickly disarmed her. He then called for assistance from two church elders and his mother-in-law (Happinesss mother), who came and resolved the situation before returning home. The court heard that the family then had tea for supper at around 11pm and went to bed in the same room, except for Happiness, who remained seated on the bed.\n\nAt around 1am, the court was told, Happiness armed herself with a metal digger, which she had borrowed from a neighbour the previous day.\n\nWhile her family slept, she allegedly struck Edwin three times  once on the throat and twice on the jaw  resulting in his death.\n\nShe then allegedly struck four-year-old Promise three times on the neck, also causing his death.\n\nFinally, she allegedly struck seven-month-old Prudence three times on the head, resulting in her death, the court heard.\n\nFollowing the alleged killings, Happiness left the house and went to another church member, where she reportedly confessed to what she had done.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Chimbangu.jpg",
            "description": "Raymond Jaravaza, Bulawayo Bureau EDWIN Chimbangu (35), his four-year-old son Promise and seven-month-old daughter Prudence, victims of a horrific triple killing in their Cowdray Park home in Bulawayo, will be buried today in Chinhoyi, Mashonaland West Province. Five days have passed since the brutal act that claimed their lives. Happiness Chimbangu, the children’s mother and […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Joint regional initiative must end violence in DRC",
            "url": "https://www.herald.co.zw/editorial-comment-joint-regional-initiative-must-end-violence-in-drc/",
            "content": "SADC at its Extraordinary Summit in Harare on Friday made it clear that it would not abandon the Democratic Republic of Congo, in fact wishing to strengthen support for that country which is facing a rebel onslaught in its two eastern Kivu provinces.\n\nThe diplomatic initiative required to remove many of the underlying pressures that prolong the rebel violence, is two fold, a joint Summit of SADC and the East African Community (EAC) and the commissioning of the SADC Organ Troika on Politics, Defence and Security Co-operation to engage all state and non-state actors involved in the conflict to negotiate a ceasefire, protect civilian lives and facilitate the smooth delivery of humanitarian aid to affected communities.\n\nThe other set of decisions at the Friday Summit called by SADC Chairperson President Mnangagwa involve the immediate dispatch to the DRC of SADC Defence Ministers and their professional military advisors, the defence forces chiefs, to the DRC to assess the security situation and ensure the safety of the continuing SADC Mission in the DRC, SAMIDRC.\n\nThe joint SADC-EAC Summit of 22 countries, with DRC and Tanzania belonging to both groups, has already been agreed by both, the EAC in its extraordinary Summit on Wednesday and SADC on Friday. President Mnangagwa and EAC Chairperson Kenyan President William Ruto now simply have to work out the logistics, the date and venue, and thus it is likely the meeting will be very soon.\n\nThe SADC Troika is chaired by Tanzanian President Samia Suluhu Hassan, particularly well suited for engaging all state and non-state actors since Tanzania borders DRC and Rwanda, the main state actors, and even borders South Kivu and is only a short hop from North Kivu.\n\nThe visit by the Defence Ministers and defence chiefs can obviously make the political and professional security assessments, which are likely to include the requirements of the DRC military, which has had to absorb a number of former rebel movements in recent years and quite possibly needs assistance in its present process of conversion to a more professional and unified force.\n\nBehind all these efforts, it is important to see who are the most important people involved: the people of the DRC in general and the people of the eastern provinces in particular, as they have had to cope with rebel movements and frequent violence for far too many years. They need the peace and security of an end to violence, full integration into the DRC government services and full participation in the now flourishing DRC democracy and growing DRC economy.\n\nThere are hundreds of thousands of displaced people, and the occupation of the large city of Goma by the M23 rebel movement has seriously disrupted the major humanitarian efforts needed to look after them, since Goma was the base, as well as creating more displacements and placing far more people at serious risk of starvation and disease.\n\nThe Kivu provinces are even by the high standards of the DRC, one of Africas most resource rich countries, potentially exceptionally wealthy. It has been fairly well established that some mineral wealth has been smuggled out of areas under rebel control or at least open to rebel raids, and among other measures this use of conflict minerals needs to be ended.\n\nOnce the priority of those affected by the violence has been accepted, the concerns of others can be addressed and proper and lasting solutions found.\n\nThe DRC itself simply wants normal control over its own territory. It has, since the end of the military autocracy of Mobuto Sese Seko, prolonged because of his manoeuvring in the Cold War, been dealing with assorted rebel movements, usually through negotiation and absorbing them into the general body politic and the numerous fighting forces into its military.\n\nThe Kivu rebel movements have been more resistant to this process, and many of them and especially M23, bring in tribalism, self-identifying as Tutsi. That is a relic of the Belgian colonialism of DRC, Rwanda and Burundi which insisted on tribal classifications of what were by late pre-colonial times far more an economic classification of people who spoke the common indigenous language of what is now Rwanda, Burundi and some neighbouring communities in eastern DRC. Cattle-owning Tutsi were considered less inferior than crop farmers in this weird colonial set up.\n\nThe other major state player in the dispute is Rwanda, which has made it clear that it has security concerns after a large number of those directly involved in the Rwandan genocide of 1994 crossed into the then eastern Zaire with its then exceptionally poor administration. Rwanda has interfered in eastern DRC to ensure that these criminal elements and refugees were neutralised.\n\nThere is a lot of sympathy for Rwanda as it moved out of the genocide era, and has within its own borders done a lot to unify the population, starting with the destruction of those evil Belgian-era ID cards that recorded tribal affiliation and replaced them with cards that record citizens.\n\nBut it is important for Rwanda not only to cease whatever support it is giving to opposition movements next door, and Rwanda and DRC differ on just how much is given, but to also actively assist the peace process by ensuring normal relations with the DRC and preventing any movement of arms into DRC and any smuggling of conflict minerals out of DRC, regardless of the sources of arms and minerals.\n\nIt is fairly clear that a permanent solution to the crisis in the DRC must involve a secure border, to satisfy security concerns of both countries, and that might mean external neutral monitors. With that in place then the standard conversion of rebel movements into political parties can be pushed forward with confidence that this is the only path.\n\nDisplaced people can then be helped to return home and the DRC citizens who live in the eastern provinces can get on with their lives, their mineral and other resources being developed to give them a decent living.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/SADCC.jpg",
            "description": "SADC at it’s Extraordinary Summit in Harare on Friday made it clear that it would not abandon the Democratic Republic of Congo, in fact wishing to strengthen support for that country which is facing a rebel onslaught in its two eastern Kivu provinces. The diplomatic initiative required to remove many of the underlying pressures that […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "MARRIOT BACKS MABLANYO TO EXCEL",
            "url": "https://www.herald.co.zw/marriot-backs-mablanyo-to-excel/",
            "content": "Tadious Manyepo, Zimpapers Sports Hub\n\nSTRAIGHT from scoring a huge legal victory in which he was acquitted for fraudulently allotting himself a 51 percent shareholding at Dynamos, board chairman Bernard Marriot is eager to see more glamour under his wings in the 2025 season.\n\nThe Glamour Boys only surviving founder member had been living under the weight of a long-dragging court challenge for more than five years.\n\nBut he is now a free man after being cleared by Harare magistrate Yeukai Dzuda last Friday.\n\nThe veteran administrator on Saturday visited the DeMbare training ground in Belvedere to have an appreciation of the squad being put together by coach Lloyd Mablanyo Chigowe following a mass departure of players from last seasons Chibuku Super Cup winners.\n\nAnd he feels the renowned youth development gaffer, who was rewarded with a substantive contract last month, has been a busy man over the past three weeks.\n\nDynamos have lost their core, and Chigowe has been the one battling to patch up the holes, with some of his options drawing a lot of criticism as they barely match the ones they are replacing, at least in status.\n\nThe Harare giants will represent the country in the CAF Confederation Cup for the second successive time this year after winning the Chibuku Super Cup last season.\n\nBut almost 50 percent of the players who did duty for them last year, including defender and skipper Frank Makarati, Frederick Ansah-Botchwa, Sadney Urikhob, Tanaka Shandirwa, Emmanuel Ziocha, Donald Mudadi, Emmanuel Paga, and Kevin Moyo, among others, have since left. Chigowe also lost his assistant from last season, Joel Luphahla, who was lured by Premiership champions Simba Bhora.\n\nThis has forced the lanky coach to undertake an audacious rebuilding exercise in which he has brought in former Los Angeles Galaxy striker Farai Mutatu, ex-Yadah captain Clive Mandivei, Tellmore Pio, and Learnmore Muyambo, among others.\n\nMore importantly for Chigowe, he has also received the blessings of Marriot.\n\nThe Dynamos strongman is also upbeat about DeMbares chances in the coming season.\n\nAs the board, we dont interfere with the manner the executive and technical guys go about their work.\n\nBut it is always incumbent upon us to also get an appreciation of what happens in the field of play because that is the foundation at which the team comes up, Marriot said.\n\nThat is the reason why I took it upon myself to visit our training ground on Saturday just to see how everything is unfolding in the team.\n\nI would like to give the coach my full blessings. I know Chigowe is up to something special this coming season. He has been given the leeway to explore and rebuild the team in the manner he likes to see things unfold.\n\nI am quite confident that he is taking on board players who can fit into his rich playing philosophy.\n\nIf you look at it, Chigowe managed to win the Chibuku Super Cup last year with a team that was there with previous coaches.\n\nIt just goes on to show just how good he is as a coach. Now, he has the freedom to explore everything according to his own liking, and there is absolutely no reason why we should not believe in him. Marriot acknowledged that the players they have brought in so far are lightweight when compared to the profiles of those that have departed.\n\nYes, the team might be looking lightweight in terms of the profile of players appearing on the roster, but I bet this is how teams have been built.\n\nNames do not play football. If you look at it, Chigowe is doing his thing in a meticulous manner in which he is also elevating players from our juniors, who he has worked with at some point as well.\n\nLet me also thank our sponsors, Sakunda Holdings, led by Kudakwashe Tagwirei. This man has King Solomons wisdom and is endowed with rare compassion.\n\nPastor Blessing Nhahuma of the SDA summed it up by preaching on Genesis 41:38 about Tagwirei.\n\nWe are looking forward to a fruitful season, and as the board, we have our weight fully behind our coach, Lloyd Chigowe, an individual we have known for decades whose capabilities are well beyond any doubt.\n\nMarriot added that Dynamos were yet to replace outgoing chief executive officer Jonathan Mashingaidze but would always benefit from the latters consultancy.\n\nThere is no doubting Mashingaidzes knowledge of the local football terrain.\n\nI met with him during the ZIFA elections last week, and we had a positive chat. He knows my position regarding him.\n\nI am an admirer of his when it comes to delivery. We will always consult him, and we are ready to take his advice and everything. We know what kind of a person he is, and his knowledge of the game and his experience are never to be underestimated. He might be out of Dynamos for now, but we know he is still part of the family.\n\nIn that same vein, let me congratulate those who were voted into the ZIFA executive led by president Nqobile Magwizi and two deputies, Loveness Mukura and Kenny Ndebele.\n\nWe have so much confidence in their abilities, and we know, with unity, our football will go far with the elected board leading the way.\n\nPremier Soccer League\n\nMarriot, who is one of the founding fathers of the Premier Soccer League, also offered his support to the leagues acting CEO, Rodwell Thabe.\n\nThabe assumed office upon the resignation of Ndebele ahead of the ZIFA elections.\n\nNdebele subsequently posted a convincing win to become the ZIFA vice president.\n\nThabe has, over the years, garnered enough experience to steer the PSL ship and is widely regarded as one of the brightest prospects among the crop of emerging local football administrators.\n\nI think Thabe needs all our support as football stakeholders. I would like to congratulate him on his new appointment, however, on an interim basis. I know he is capable and able.\n\nHe should know that he has our full support and be able to deliver his mandate without any pressure whatsoever.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Lloyd-Chigowe.jpg",
            "description": "Tadious Manyepo, Zimpapers Sports Hub STRAIGHT from scoring a huge legal victory in which he was acquitted for fraudulently allotting himself a 51 percent shareholding at Dynamos, board chairman Bernard Marriot is eager to see more glamour under his wings in the 2025 season. The Glamour Boys’ only surviving founder member had been living under […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "Businesses urged to tap into RBZ’s concessional loans",
            "url": "https://www.herald.co.zw/businesses-urged-to-tap-into-rbzs-concessional-loans/",
            "content": "Oliver Kazunga\n\nSenior Business Reporter\n\nTHE Zimbabwe Investment and Development Agency (ZIDA) has urged investors to approach their respective banks for funding under the Targeted Finance Facility (TFF) to boost exports and enhance competitiveness for locally produced products.\n\nIn December last year, the Reserve Bank of Zimbabwe (RBZ) introduced the TFF with interest rates set at 20 percent for banks borrowing from the central bank and a maximum of 30 percent for on-lending to clients.\n\nThe TFF is a concessional funding designed to boost production, capacity utilisation, and economic growth. Its low interest rates reduce production costs, making local products more competitive.\n\nThe initiative was established following the realisation that commercial banks were lacking capacity to adequately finance productive sectors, a situation that could hinder economic growth.\n\nAccording the central bank, the 30 percent maximum is below the average corporate lending rate of 43 percent per annum.\n\nIn its latest investor bulletin, ZIDA said the cheap facility may improve margins and profitability for local companies.\n\nAmong other operational modalities, the TFF loans have a maximum 270-day maturity and should be repaid in full by the due date or earlier. Borrowers can access funds in Zimbabwe Gold (ZiG) and have the option to repay in the same currency or foreign currency at the prevailing exchange rate.\n\nThe TFF has stringent collateral requirements, demanding acceptable security from banks.\n\nIt can be secured by a diverse range of assets and instruments, such as foreign currency, gold-backed digital tokens or any other central bank instruments, foreign currency-denominated treasury bills with less than one year to maturity, local currency treasury bills with less than one year to maturity, and any other collateral acceptable to the RBZ, said ZIDA.\n\nThe industry has been grappling with liquidity constraints in both US dollars and ZiG, which have curtailed credit and pushed US dollar interest rates to around 20 percent, according to bankers.\n\nThe sharp rise in interest rates comes amid a worsening liquidity crunch, growing credit risk, and a challenging economic environment that is forcing banks to adjust their lending practices to stay afloat.\n\nThe Bankers Association of Zimbabwe (BAZ) president, Mr Lawrence Nyazema, confirmed last week that liquidity constraints are a major factor behind the rate hikes.\n\nAnalysts say the liquidity crunch has been exacerbated by the central banks tight monetary policy, which has reduced the amount of money available for lending.\n\nDespite concerns raised by some economic players regarding liquidity crunch, the Government expressed satisfaction with the ongoing liquidity management programme designed to maintain macroeconomic stability.\n\nIn a recent interview, Finance, Economic Development and Investment Promotion Minister Mthuli Ncube said the primary objective of the liquidity management programme was to safeguard the domestic currency.\n\nBy curbing excessive liquidity growth, a key driver of currency volatility, instability, and ultimately, inflationary pressures, the programme seeks to maintain macroeconomic stability.\n\nThe issue in terms of liquidity has been really the protection of the domestic currency, where we wanted to curtail the growth of liquidity, because any excessive growth of liquidity will impact the volatility of the currency and hence macroeconomic instability in general, Minister Ncube said.\n\nAt the moment, we feel that things are being managed in the right way, he added.\n\nDr Mushayavanhu singled out the inactive interbank market as the primary challenge, highlighting the reluctance of banks to lend to each other.\n\nHe noted that daily liquidity surpluses have persisted since September and to manage excess liquidity, the central bank had been sterilising it daily by issuing Non-Negotiable Certificates of Deposit (NCDs) at a zero percent interest rate.\n\nUnder TFF, the central bank is taking the sterilised funds for lending to banks.\n\nLiquidity is concentrated within a few banks, hindering efficient resource allocation within the banking sector, said Dr Mushayavanhu.\n\nIn a normal money market, banks that are long should lend overnight or even over 30, 60, 90 or 180 days to banks that are short at the bank policy rate or higher against security.\n\nSurprisingly, instead of lending to the bank next door and getting interest income, some banks are content with RBZ taking their excess funds and parking them in NNCDs at zero interest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/RBZ1.jpg",
            "description": "Oliver Kazunga Senior Business Reporter THE Zimbabwe Investment and Development Agency (ZIDA) has urged investors to approach their respective banks for funding under the Targeted Finance Facility (TFF) to boost exports and enhance competitiveness for locally produced products. In December last year, the Reserve Bank of Zimbabwe (RBZ) introduced the TFF with interest rates set […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        },
        {
            "title": "Govt procures 3 000 tractors to boost livestock sector",
            "url": "https://www.herald.co.zw/govt-procures-3-000-tractors-to-boost-livestock-sector/",
            "content": "Leonard Ncube, Herald Reporter\n\nGovernment has bought over 3 000 hay baling tractors to be distributed to four livestock provinces in the country as one of the measures to protect and rebuild the national herd in the wake of serious poverty and disease-related deaths.\n\nThis comes as Government is implementing a raft of measures to address the various feed and water-related challenges facing livestock communities in drought-stricken regions.\n\nZimbabwe recorded over 50 000 cattle deaths in 2024 due to water and food shortages triggered by the El Nio-induced drought, with the 2024/2025 rainy season offering a lifeline to farmers.\n\nThe country had close to 6 million cattle, and a significant percentage of these died due to poverty and disease, with the annual outbreak of Theileriosis, commonly known as January disease, claiming the majority of disease-related deaths. Presently, Government is conducting a countrywide livestock assessment to update the number of cattle, goats, sheep, donkeys, and other domestic animals.\n\nHowever, some districts have recorded more calving than deaths this rainy season, raising hope that the national herd will actually grow.\n\nSpeaking in Hwange, Lands, Agriculture, Fisheries, Water and Rural Development Minister Dr Anxious Masuka said several measures are being rolled out to address issues such as ticks, diseases, and drought that cause debilitation of cattle in communal areas.\n\nSo we are giving farmers tick grease under the Presidential Bliss Tick Grease Programme to ensure that they can suppress and manage ticks. Once we are able to do so, then we will be able to do some restocking, but at the same time, we have a vibrant project where we are doing artificial insemination, which is just starting now, said Dr Masuka.\n\nHe said artificial insemination is being carried out with an improved indigenous breed. He added that Government has initiated several programmes in terms of livestock, especially in the livestock provinces.\n\nWe have said what we want to see, as we are coming from the worst drought in 43 years. We are expecting more tractors, about 3 100 tractors under the mechanisation programme this month. We will allocate tractors to Matabeleland North, Matabeleland South, Midlands, and Masvingo, the main livestock provinces, to cut hay along the roads so that they can prepare for drought, said Dr Masuka.\n\nHe was responding to concerns by players in the livestock sector who urged Government to also extend extra raw materials for stock feed formulation, the same way the crop sub-sector is subsidised, to curtail poverty deaths in domestic animals.\n\nSome farmers lost as many as 100 cattle during the course of last year due to poverty and disease-related deaths.\n\nMinister Masuka said it is President Mnangagwas vision for farmers to protect their herd through the Presidential Rural Development Programme, which is biased towards community development.\n\nUnder this programme, various projects, including borehole drilling in all community areas, dam construction, establishment of Village Business Units, and others, are being implemented to help grow the national herd.\n\nMeanwhile, Government is also capacitating women at household level with 10 chickens each as part of empowerment programmes, under a scheme that started three years ago.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/01/Dr-Anxious-Masuka.jpg",
            "description": "Leonard Ncube, Herald Reporter Government has bought over 3 000 hay baling tractors to be distributed to four livestock provinces in the country as one of the measures to protect and rebuild the national herd in the wake of serious poverty and disease-related deaths. This comes as Government is implementing a raft of measures to […]",
            "time": "08:34",
            "date": "03 Feb 2025"
        }
    ]
}