{
    "news": [
        {
            "title": "Africa ready to lead: President. . . revels over Kirsty’s emphatic victory",
            "url": "https://www.herald.co.zw/africa-ready-to-lead-president-revels-over-kirstys-emphatic-victory/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nTHE election of former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, to the helm of the International Olympic Committee (IOC), is testament that Africa is ready to lead at the highest level, President Mnangagwa has said.\n\nIn his address at a banquet he hosted for IOC president-elect Coventry at State House in Harare last night, the President said her victory was not only for Zimbabwe, but African people as a whole.\n\nCoventry becomes the 10th president of the IOC and the first woman, as well as the first person from outside Europe and the United States, to lead the worlds most powerful sporting body.\n\nThe victory of Honourable Coventry is, thus, not only a source of inspiration and pride for Zimbabwe, but for the SADC region and Africa as a whole.\n\nWith five world records to her name, breaking records is in her nature; she has done it again.\n\nIn the true spirit of Africa tinoti: Makorokoto, Amhlophe and Hongera (as they say in Swahili), President Mnangagwa said.\n\nHe also paid tribute to Coventrys family for mentoring her to become a national treasure.\n\nAllow me to also pay tribute and gratitude to Mr Rob and Mrs Lyn Coventry, parents of our golden girl as well as to her husband Mr Tyrone Seward.\n\nWe thank you for the mentorship, guidance and support as well as all the sacrifices you made along the way, for Honourable Coventry to realise her career success. Congratulations.\n\nYou are not only our national treasure, but a treasure to all young athletes across Africa and the developing world, President Mnangagwa said.\n\nHe challenged parents and guardians to nurture the younger generations to become champions.\n\nI challenge parents and guardians to nurture, support and encourage our talented young boys and girls as they compete in various sporting disciplines\n\nThe success milestone by Minister Kirsty Coventry signifies the enduring warrior spirit and unflinching resilience embedded in us, as a proud Zimbabwean and African people, said the President.\n\nHe added that during Ms Coventrys tenure as Sports Minister, Zimbabwe had become more competitive in various sporting disciplines.\n\nSince her tenure, the Zimbabwe Senior Netball team, the Gems, qualified for the Netball World Cup on two occasions, the National Soccer Team, the Warriors qualified for AFCON, and the mens Rugby Team scooped the African Championship, among others.\n\nThe Zimbabwe Chevrons and the Lady Chevrons alike, have become more competitive following the improved administration of Cricket.\n\nWe now host both Test and One Day International Games on a more frequent basis, the highlight of which was the ICC T20 World Cup Qualifiers in 2023.\n\nThe leadership of Honourable Coventry has, therefore, been instrumental to Zimbabwe successfully hosting various regional and international sporting events, further elevating our countrys reputation as a favourable global sporting destination, said President Mnangagwa.\n\nHe said as a strong advocate of inclusion, good governance and professionalism in sports administration, Ms Coventry had constantly advocated for sports administrators in the country to occupy decision-making posts regionally, continentally and internationally.\n\nIn line with my Governments national development mantra of leaving no one and no place behind, the Honourable Minister and incoming president we are celebrating today, oversaw the construction of multi-purpose facilities in disadvantaged areas across the country.\n\nThese include Chambuta in Chiredzi; Rafamoyo in Gutu; Mabhikwa in Lupane and Karigamombe in Zvimba, among others, the President said.\n\nThese projects and other strategies spearheaded by my dear Minister have encouraged inclusivity in sports, and ensured that young boys and girls across the country access opportunities to develop and nurture their God-given talents.\n\nIn his remarks to introduce the President, Vice President Dr Constantino Chiwenga described the IOC president-elect as a record-breaker whom the country was proud of.\n\nThis is a moment of immense pride for our country, he said.\n\nOn her part, former Minister Coventry chronicled how she had a dream to represent Zimbabwe at the Olympics while watching the 1992 Barcelona Olympics at home.\n\nShe went on to represent Zimbabwe and win the countrys first gold medal at the Athens Olympics in 2004.\n\nThe IOC president-elect expressed gratitude to President Mnangagwa for giving her an opportunity to serve as the countrys Sports Minister.\n\nI am extremely grateful for that opportunity, she said.\n\nMs Coventry said although she consequently had to step down as Sports Minister, she will always support the Second Republic as and when needed.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-12-1.jpg",
            "description": "THE election of former Minister of Sport, Recreation, Arts and Culture, Kirsty Coventry, to the helm of the International Olympic Committee (IOC), is testament that Africa is ready to lead at the highest level, President Mnangagwa has said.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Lt-Gen Sanyatwe retired, replaces Coventry as Sports Minister",
            "url": "https://www.herald.co.zw/lt-gen-sanyatwe-retired-replaces-coventry-as-sports-minister/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nPRESIDENT Mnangagwa has retired Zimbabwe National Army (ZNA) Commander, Lieutenant-General Anselem Sanyatwe and appointed him Sport, Recreation, Arts and Culture Minister with immediate effect.\n\nHe replaces Dr Kirsty Coventry, the newly-elected president of the International Olympic Committee (IOC), who will now assume the most powerful position in the world of sports.\n\nHer tenure begins on June 23 and she will be based at the IOC headquarters in Lausanne, Switzerland.\n\nLt-Gen Sanyatwe is a distinguished military Commander, having played a huge role in Zimbabwes war of liberation and military operations after Independence.\n\nHis impressive career in the military saw him rise through the ranks to become the ZNA Commander.\n\nLt-Gen Sanyatwe also has diplomatic experience from his previous tenure as Ambassador of Zimbabwe to Tanzania.\n\nIn a statement last night, Chief Secretary to the President and Cabinet, Dr Martin Rushwaya, announced the new appointment.\n\nActing in terms of section 108 (1) (a) of the Constitution of Zimbabwe, His Excellency President Dr E.D Mnangagwa has relieved Honourable Kirsty Coventry from her position as Minister of Sport, Recreation, Arts and Culture following her well-deserved election as the president of the International Olympic Committee, said Dr Rushwaya.\n\nIn terms of section 216 (2) (Command of Defence Forces) as read with section 340 (1) (f) of the Constitution of Zimbabwe and section 115 (Commander in Chief Prerogative) of the Defence Act [Chapter 11:02], the President, in His capacity as such and as Commander in Chief of the Defence Forces, has relieved and retired Lieutenant General Anselem Nhamo Sanyatwe, from the Zimbabwe Defence Forces and as Commander of the Zimbabwe National Army with immediate effect.\n\nAnd: In terms of section 104 (3) of the Constitution, appoints Lieutenant General (Rtd) Anselem Nhamo Sanyatwe as Minister of Sport, Recreation, Arts and Culture with immediate effect.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/09/Martin-Rushwaya-680x380.jpg",
            "description": "PRESIDENT Mnangagwa has retired Zimbabwe National Army (ZNA) Commander, Lieutenant-General Anselem Sanyatwe and appointed him Sport, Recreation, Arts and Culture Minister with immediate effect.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Diaspora remittances surge 7,5pc in Feb",
            "url": "https://www.herald.co.zw/diaspora-remittances-surge-75pc-in-feb/",
            "content": "Michael Tome\n\nBusiness Reporter\n\nDiaspora remittances grew by 7,5 percent to US$165 million in February this year, up from US$153,8 million in the same month last year, remaining a key source of foreign currency inflows supporting the economy.\n\nThe remittances come from a large pool of Zimbabweans living and working outside the country, including South Africa, the United Kingdom, the United States, Australia, Canada and the United Arab Emirates.\n\nDiaspora remittances are crucial for the economic and social well-being of countries of origin, acting as a lifeline for families and communities, and contributing significantly to development by supporting basic needs, education, healthcare and even investments in agriculture and businesses.\n\nIn Zimbabwe, remittances continue to offer a reliable source of extra income to millions of local people who depend on their migrant relatives for financial aid back home while at the same time ensuring that inflows of foreign currency are greater than outflows, even when imports outnumber exports.\n\nTypically, remittances are sent to support ordinary living expenses, education, housing development, healthcare and investments in businesses, among other critical uses.\n\nThe inflows provide significant liquidity to power various key sectors of the economy, at a time when Zimbabwe has limited access to concessional funding from multilateral lenders like the International Monetary Fund and the World Bank.\n\nDecades-long western sanctions also mean Zimbabwe has for long been excluded from many global sources of funding needed to support key development programmes, including loans to individuals.\n\nAs such, the inflows are critical in boosting consumer aggregate demand in the domestic economy and driving industrial activity.\n\nLess than 2 million Zimbabweans live in the Diaspora, with South Africa being the most popular destination.\n\nA Zimbabwe National Statistics Agencys (ZimStats) 2022 census states that about 908,913 Zimbabwean migrants live and work in South Africa, while 47 928 are domiciled in Botswana, 23 166 in the United Kingdom (UK), and the rest are spread around the globe.\n\nRecent data from the UK Office of National Statistics shows that there has been a notable increase in the number of Zimbabweans who were granted UK skilled work visas since 2019.\n\nAccording to the Reserve Bank of Zimbabwe (RBZ), Diaspora remittances have consistently played a vital role in bolstering the countrys economy, contributing significantly to the nations total foreign currency inflows.\n\nIn February 2025, Zimbabwes Diaspora remittances grew by 7,5 percent year-on-year, totalling US$165 million, up from US$153,8 million in February 2024.\n\nThe diaspora remittances have continuously supported the economy, accounting for 17 percent of the total foreign currency receipts, said RBZ in its monthly statistics.\n\nLast year, Zimbabwe witnessed a significant surge in diaspora remittances, with inflows reaching a record US$2,2 billion, representing a 22 percent increase from the US$1,8 billion recorded in 2023.\n\nThe diaspora represents a huge growth opportunity for the country, including bridging the huge gap in infrastructure financing, while the inflows can be tapped to fundraise for other development obligations through issuing diaspora bonds.\n\nBeyond their valuable contribution to the well-being of individual households, another dimension of their positive impact on the countrys economy includes helping to stabilise the foreign exchange market, which is critical to support economic growth.\n\nThe central bank says it will continue to explore incentives to boost the diaspora remittance inflows, given the importance of remittances in the economy.\n\nAs the Government continues to implement policies to support the diaspora community and promote economic growth, diaspora remittances will remain a vital source of foreign exchange to propel economic growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/08/Reserve-Bank-of-Zimbabwe.jpg",
            "description": "Diaspora remittances grew by 7,5 percent to US$165 million in February this year, up from US$153,8 million in the same month last year, remaining a key source of foreign currency inflows supporting the economy.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Address root cause of DRC conflict: President",
            "url": "https://www.herald.co.zw/address-root-cause-of-drc-conflict-president/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nChairperson of the Southern African Development Community, President Mnangagwa, has described the conflict in the eastern Democratic Republic of Congo as complex, requiring an inclusive and honest dialogue to resolve.\n\nIn his closing address at a joint virtual summit between SADC and the East African Community (EAC) that focused on finding a sustainable resolution to the protracted crisis that has displaced millions and destabilised the Great Lakes region, President Mnangagwa called for concerted efforts to end the conflict.\n\nAfter the three-hour meeting that ended around 11pm on Monday, the President commended Kenyan President William Ruto, who is the chairman of EAC, and the two regional blocs secretariats for the work they have done to ensure the implementation of all tasks that needed completion.\n\nWe will continue to count on their expertise for the desired results in the eastern Democratic Republic of Congo. We all agreed that the conflict is complex and requires us to address its root causes. This can only be achieved through an inclusive and honest dialogue, said President Mnangagwa.\n\nIn todays complex geopolitical environment, it is critically important that we deploy the necessary mechanisms and resources to enhance self-reliance in the spirit of our mantra, African solutions to African problems. None but ourselves have to find solutions to our challenges, with others coming in to complement our own efforts.\n\nHe implored leaders from the two regional blocs to move with speed in implementing agreed outcomes.\n\nThe endeavours and joint efforts under our regional economic communities must see the realisation of lasting peace and sustainable development in the eastern Democratic Republic of Congo.\n\nWe should move with speed in laying the ground for our defence chiefs to engage the relevant authorities on the ground, and facilitate the smooth withdrawal of SAMIDRC (Sadc Mission in the DRC) troops, work for a ceasefire, a cessation of hostilities and create conditions for an all-inclusive dialogue under the merged Luanda and Nairobi process, said President Mnangagwa.\n\nHe said the merger has to happen as a matter of urgency and called on the international community to expeditiously come together, without delay, and provide the much-needed humanitarian assistance to the affected population.\n\nIt is necessary that the pragmatic decisions we have made today be implemented with speed. The people of DRC and the international community are looking up to us, with anticipation. We should not fail them, President Mnangagwa said.\n\nDuring the summit, the two blocs resolved to appoint five former eminent African leaders as Facilitators in the eastern DRC where there are hostilities pitting Government forces and the M23 armed group.\n\nThe facilitators are: former Nigerian President Olusegun Obasanjo, former Kenyan President Uhuru Kenyatta, former South African President Kgalema Motlanthe, former President of Central Africa Republic Catherine-Samba Panza and former President of Ethiopia Sahle Work Zewde.\n\nThe two blocs chairpersons, President Mnangagwa and President Ruto of Kenya, are set to convene a meeting with the five facilitators to map a way forward in the wake of escalating hostilities in the Great Lakes region.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-13-1.jpg",
            "description": "Chairperson of the Southern African Development Community, President Mnangagwa, has described the conflict in the eastern Democratic Republic of Congo as complex, requiring an inclusive and honest dialogue to resolve.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Iranian firms interested in Zim investment",
            "url": "https://www.herald.co.zw/iranian-firms-interested-in-zim-investment/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nZIMBABWE and Irans excellent political relations are poised to extend to the economic front on the back of Iranian manufacturing companies keen to set up shop in Zimbabwe.\n\nLast year, Iran Tractor Manufacturing Company (ITMCO) expressed their interest in a meeting between Vice President Dr Constantino Chiwenga and Iran first Vice President Mohammad Mokhber in Tehran.\n\nYesterday, the Charge dAffaires of Iran in Zimbabwe, Mr Hadi Taheri, paid a courtesy call on VP Chiwenga where he renewed the interest of companies from his country and took the opportunity to invite the VP to the third edition of the Iran-Africa International Economic Conference next month.\n\nThe VP has attended the previous editions as Zimbabwe continues to spread global economic synergies in traditional and emerging markets.\n\nThe conference is part of the global energy super-powers quest to deepen mutually beneficial economic co-operation with African countries and Zimbabwe, in line with President Mnangagwas thrust to pursue all economic beneficial synergies, is firmly on board. Speaking after meeting VP Chiwenga, Mr Taheri spoke about their economic synergies with Zimbabwe.\n\nIn the meeting with Vice President Chiwenga, various topics and areas of co-operation were discussed. Firstly we invited the Vice President to come and visit Iran and participate in the third edition of the Iran Africa seminar in Tehran and also the Iran Expo next month, said Mr Taheri.\n\nWe also discussed a variety of bilateral issues and topics like manufacturing tractors, where we discussed the possibilities of an Iranian company coming to manufacture tractors here in Zimbabwe.\n\nIn the field of medicines and pharmaceuticals, we spoke about bringing medical equipment here from Iran like cancer machines.\n\nWe already have two memorandums in the field of medicines and pharmaceuticals. Some of our medicines have already come here and there has been good feedback.\n\nThe third consignments are coming and we are now working on bringing medical equipment, said Mr Taheri.\n\nAfter attending the Second Iran-Africa Economic Conference last year, an increase in interest to trade and exchange technical expertise between Zimbabwe and Iran has been reported.\n\nThe Iran-Africa conference seeks to provide an alternative economic order against the status quo which is skewed in favour of the West and their political allies to the detriment of the rest of the world.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-14-2.jpg",
            "description": "ZIMBABWE and Iran’s excellent political relations are poised to extend to the economic front on the back of Iranian manufacturing companies keen to set up shop in Zimbabwe.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Top honours for VP Mohadi",
            "url": "https://www.herald.co.zw/top-honours-for-vp-mohadi/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nVICE President Kembo Mohadi was yesterday awarded the prestigious Induna Matshe Leadership Excellence Award in recognition of his unwavering loyalty to Zimbabwes liberation struggle, exceptional leadership, and contributions to the agricultural sector.\n\nThe VP was presented with the award at his offices in Harare by Legacy TVs executive leadership.\n\nSpeaking at the handover ceremony, Legacy TV Executive Director Pardon Mangwende said the award is critical in preserving Zimbabwes liberation legacy and honouring those committed to national development.\n\nEvery year, Legacy TV presents the Legacy Empowerment Awards to recognise individuals who support the Government and Zanu PF, he said.\n\nThese awards serve to safeguard the legacy of the liberation struggle. If we look at todays title, Induna Matshe, its the pre-First Chimurenga name.\n\nMr Mangwende explained the significance of the Induna Matshe title.\n\nKing Lobengula sent emissaries to the UK, but they refused to sell this country despite being enticed with material gains.\n\nThey returned and remained resolute in their loyalty to the King, he said.\n\nMr Mangwende drew parallels between historic figures and the leadership qualities embodied by award recipients.\n\nIf you look at Chaminuka, he was a great prophet and leader. Munhumutapa was one of the most influential rulers in this region, he said.\n\nHe also paid tribute to figures like Cde Lookout Masuku, a key revolutionary in Zimbabwes fight for independence. The Legacy Empowerment Awards reaffirm Legacy TVs commitment to recognising leadership excellence and preserving Zimbabwes history of resilience and patriotism.\n\nLast year, the Nehanda Nyakasikana Leadership Excellence Award was also presented to honour the legacy of Mbuya Nehanda, the spirit medium and First Chimurenga leader.\n\nAn enduring symbol of female strength and courage, Mbuya Nehanda represents the power and potential of women in shaping society .\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-15-1.jpg",
            "description": "VICE President Kembo Mohadi was yesterday awarded the prestigious Induna Matshe Leadership Excellence Award in recognition of his unwavering loyalty to Zimbabwe’s liberation struggle, exceptional leadership, and contributions to the agricultural sector.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "EDITORIAL COMMENT : All public officers must work at highest level",
            "url": "https://www.herald.co.zw/editorial-comment-all-public-officers-must-work-at-highest-level/",
            "content": "Zimbabweans pay taxes, and we all pay some sort of tax even if it is just VAT on things we buy, and expect value for the money that is collected and spent in their name by the Government, hence President Mnangagwas emphasis on evaluating the performance of those running the public sector.\n\nThis started in 2021 as part of the stream of reforms the President wanted under the Second Republic, to ensure that the targets and goals in the many plans, largely combined and integrated under the National Development Strategy, were not just words sitting in a dusty file on a shelf, but the living bones of national growth.\n\nThe measure is delivery, and even when there is a disaster such as arose from the drought last year, then making sure the delivery ameliorates the consequences and moves swiftly into recovery and resuming progress. Again what is required is effective action and this is what is measured.\n\nThe President wants to see an agile, innovative, responsive and resilient governance system, delivering what is needed, and that means overcoming setbacks such as pandemics, droughts, floods and the like with recovery programmes that maintain the advance, as well as sailing faster through calmer waters and exceeding goals.\n\nPublic servants who are complacent and seek comfort, that is chugging along, staying honest and keeping the files clean rather than solving the daily problems thrown up as you move forward properly and speedily come in for particular scorn by the President.\n\nHe is keen on his adoption of performance management moving right down the whole public service, with everyone held accountable for what they are supposed to do, what they do and what they do not do.\n\nHe has been making progress since he introduced his system and had the first performance contracts drawn up and signed, with these becoming more widespread and more detailed as the years go by.\n\nAdding some spice to the evaluations are the annual performance awards by the President for the best performing minister, the best performing permanent secretary, the best provincial affairs minister of state and provincial permanent secretary, and the heads of the most critical commissions, authorities and agencies.\n\nOne of the most interesting results of these competitions has been not only those who tend to be highly ranked, but also the fact that a high level of teamwork produces a highly efficient ministry or office.\n\nThe results of last years performers highlights this.\n\nThe Ministry of Transport and Infrastructure Development won most of the big awards, Minister Felix Mhona taking the award of top performing minister, Permanent Secretary Engineer Joy Makumbe leading the high ranking officials, and ZINARAs Dr George Manyaya being the chair of the best revenue collector.\n\nThe results of the Ministrys work and performance are there for all to see, as this Ministry does the roads, among other major programmes, and we can all see if the roads we use are functional or non-functional, and just as important if there is some serious improvement month after month and year after year. A bad road should not be eternal.\n\nBut the Ministry has to not just have the work done, but needs to make sure that it is done properly and that when private contractors are used, as is common these days, they can be safely signed off as having done a proper job and given their own value for money under the contract. So the minister needs to set rational and implementable policies setting the priorities and making sure everyone is pulling their weight.\n\nThat needs to be backed by a Permanent Secretary with both the technical education and skills pertinent to the Ministry and the administrative ability to make sure everything is properly run and that each member of staff gives off their best. So Minister Mhona and Engineer Makumbe are obviously a tight team.\n\nBut development does need money, and that explains why a third winner comes from the Ministry, the best board chairperson of a revenue collecting agency.\n\nA few years ago, Zinara was a byword for all the Presidents list of ills: corruption, complacency, inefficiency, waste and very little service to the people of Zimbabwe.\n\nMost of the money appeared to be spent on administration as executives padded their nests, and what was spent on roads appeared to be spent badly on the wrong roads.\n\nThe clean up has been spectacular, moving from an authority at the bottom of the heap to now one at the top, with squeaky clean audit reports, a high level of efficiency and low administrative costs, and supplying a lot of the money through its collection of vehicle licence fees and tollgate charges that is needed by its parent Ministry.\n\nAnd having that money spent correctly and properly with the right priorities is where we return to the Minister and Permanent Secretary.\n\nThe ministrys success needed everyone and every unit to be on the ball and doing its job, but doing that job together with everyone not just pulling their weight but doing so in the same direction and under the same plan.\n\nWe note the second placed Minister and Permanent Secretary, Minister Anxious Masuka and Prof Obert Jiri clearly form another tight team at Lands, Agriculture, Fisheries, Water and Rural Development, and making sure that an innovative minister has a top-notch technical and administrative team in support.\n\nYet again this team was seen among the Ministers of State for Provincial Affairs and Devolution, with the Masvingo team of Minister Ezra Chadzamira and Permanent Secretary Dr Addmore Pazvakavambwa heading their lists.\n\nThey also saw their top slot as a result of having a strong team right down the line in their province, with everyone contributing and pulling their weight in the same direction.\n\nA lot of performance contracts and performance evaluation is built around this double need of having first class people willing and able to do a good job, but doing so as a team with a set of common goals so that the individual efforts all add up to something far greater, and in the end in the public sphere a far better, more prosperous and fairer Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-50.jpg",
            "description": "Zimbabweans pay taxes, and we all pay some sort of tax even if it is just VAT on things we buy, and expect value for the money that is collected and spent in their name by the Government, hence President Mnangagwa’s emphasis on evaluating the performance of those running the public sector.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "First Lady, transport stakeholders in crucial indaba. . .  decries surge in carnage, calls for orderliness",
            "url": "https://www.herald.co.zw/first-lady-transport-stakeholders-in-crucial-indaba-decries-surge-in-carnage-calls-for-orderliness/",
            "content": "Tendai Rupapa\n\nSenior Reporter\n\nFIRST Lady Dr Auxillia Mnangagwa, who is the countrys road safety patron, has decried rising road traffic accidents saying the public transport sector in particular holds a significant responsibility in ensuring the safety and well-being of all citizens.\n\nIn a first-of-its-kind highly subscribed meeting with stakeholders in the transport sector yesterday, Dr Mnangagwa, who is also the patron of the National Transport and Drivers Association, said she was concerned with the current wave of accidents which demanded urgent solutions to save innocent lives.\n\nThose in attendance included officials from the Traffic Safety Council of Zimbabwe, the City of Harare, the Zimbabwe Republic Police (ZRP), the Ministry of Transport and Infrastructural Development, Harare Youth Transporters, Zimbabwe Union of Drivers and Conductors (ZUDAC), GHACO, Passenger Association of Zimbabwe, Lifestyle Youth Association, Women in Transport Zimbabwe Association, among others.\n\nAmai Mnangagwa invited these groups and relevant stakeholders to engage in an open and honest dialogue about the causes of the escalating crisis so as to collectively formulate actionable solutions that will effectively address the urgent national concern.\n\nIt emerged during discussions that the major causes of accidents were recklessness on the part of drivers, fatigue, driving under the influence of alcohol, use of incompetent drivers (popularly known as kuburukirana), defective vehicles and the quest to hit targets at the expense of safety.\n\nIn a bid to foster orderliness, Dr Mnangagwa made sure 12 member committees were formed for three key associations, namely the Drivers Association, Rank Marshals Association and Passengers Association.\n\nThe groups welcomed the idea saying the mushrooming of various associations was doing more harm than good to the people.\n\nIt is with a heavy heart, yet with a spirit of steadfast hope that I stand before you today. We gather, not for celebration, but for a crucial dialogue, a critical introspection on a matter that profoundly impacts the lives of every Zimbabwean, the issue being the escalating crisis of road accidents and the tragic loss of precious human lives on our national roads. It is from this perspective, the perspective of profound concern and unwavering commitment that I come to you today. The rising tide of road traffic accidents in our nation has reached a critical juncture. The statistics, stark and alarming, paint a grim picture of suffering, loss and shattered dreams, she said.\n\nEveryday, the First Lady said, families were being torn apart, futures extinguished and communities were being left reeling from the devastating consequences of preventable tragedies.\n\nWe cannot be in good conscience. This silent epidemic cannot continue to claim lives and inflict irreparable damage to our nation. My deep concern stems only not from the alarming numbers but also from the intimate stories behind each statistic including the children orphaned, the parents bereaved, and the families struggling to cope with the sudden and unexpected loss of a loved one. Each life lost on our roads is a tragedy, a profound loss to our nation and a stark reminder of the urgent need for change.\n\nYour presence here today signifies your commitment to this cause. The commitment that I deeply appreciate and commend. The public transport sector in particular holds a significant responsibility in ensuring the safety and well-being of our citizens. Millions of Zimbabweans rely on public transportation every day to commute to work, access essential services and connect with their families and communities, she said.\n\nOne of the transport operators expresses his views about the influx of unregistered commuter omnibuses on the roads at a transport sector stakeholders interactive meeting with road safety patron First Lady Dr Auxillia Mnangagwa at Zimbabwe House yesterday\n\nRoad safety, she said, was an unwavering priority that transcended all other considerations.\n\nRoad carnage is not an unavoidable reality, rather it is a preventable tragedy. It is a consequence of choices and of failure to adhere to safety regulations and prioritise the well-being of our passengers and inability to realise the responsibility of lives under your care. We have heard a lot about accidents on our roads. In years gone by, we complained of bad roads that damaged both our vehicles and passengers. After the roads were repaired, we sadly witnessed a spike in deaths countrywide and not in Harare alone. All roads from Beitbridge to Manicaland, Mashonaland West everywhere there are accidents. Some of these deaths leave people handicapped and they cannot be able to do anything in the future. Were you certified by the Vehicle Inspectorate Department as a competent driver? Where is your defensive driving certificate? Sometimes a car fails and you continue accelerating, thus forcing something that is not in perfect working order. This brings into question whether or not you understood the Highway Code. Is your drivers licence genuine? Did you acquire it from the relevant authorities? Did you undertake the requisite test? Did you read and understand the Highway Code? The Highway Code tells you what to do and what not to do. We as mothers cry whenever someone dies nekuti tisu tinotakura nine months. Taneta kuchema sana amai, she said.\n\nThe First Lady said she was appalled by some public service vehicle drivers who were always speeding even on pavements and driving against the flow of traffic.\n\nKnow that the long arm of the law will catch up with you, she said. Dr Mnangagwa made reference to the recent Dzivaresekwa Turn-off accident saying it pained her because people were killed, including a couple.\n\nWhat will those orphaned children do? Is it a quest for money or targets that is driving you to do this? Let us discuss what should be done. The other issue I observed is that of transport associations which are mushrooming. Can we not have a solid association to oversee that we reduce accidents? I am opening the floor, she said, before calling upon everyone present to observe a moment of silence for those who perished in road accidents.\n\nA representative of the passengers association said some drivers worked under the influence of alcohol and drugs hence the accidents.\n\nAs passengers, it is our wish to be carried and arrive alive. Some kombis are not part of associations which makes it difficult for police to identify them whenever they break the law. As we see it, some drivers and conductors work under the influence of alcohol because bars are all over including near ranks. There are also people who sell illicit drugs like mitoriro, mbanje and bronco in the ranks. These people are causing accidents, he said.\n\nMr Elisha Masango laid the blame on the shoulders of kombi owners who set high targets.\n\nAmai, the other contributory factor is the issue of targets. Whenever the kombi owners meet, they share information on targets and no one wants to be paid less. They then put pressure on the driver to hit the target and this makes the kombi crew do anything possible to reach the target, he said.\n\nMr Robert Makunike, a kombi driver who operates from Market Square, spoke about dysfunctional traffic lights on many roads.\n\nHe said the broken-down traffic lights caused traffic jams and accidents and pleaded with the City of Harare to look into the issue.\n\nAn association member blamed transport owners for employing drivers without checking whether they had licences and defensive driving certificates.\n\nOne of the commuter omnibus drivers expresses his views on commuter omnibus drivers who are giving unlicenced drivers their vehicles which is causing many accidents at a transport sector stakeholders interactive meeting with road safety patron First Lady Dr Auxillia Mnangagwa at Zimbabwe House yesterday\n\nHe further blamed drivers for letting unlicensed conductors drive at the expense of public safety.\n\nMr Moreblessing Takayendesa, a transport owner, shared some grim statistics.\n\nAmai in Harare we have 16 000 kombis, but only 2 500 are registered under associations. Kombis that are unregistered are causing problems. If a vehicle is under an association it would be easily recognised because it will be branded. Those not branded will hit and run without a trace, he said.\n\nAnother operator said the increase in the number of associations was not to serve the people, but for profiteering, hence the proliferation of associations since all members paid subscriptions.\n\nMr Desmond Chendambuya said some kombi owners were not servicing their vehicles resulting in them operating with worn out tyres. He also pointed at fatigue saying drivers were not resting as they had no off days since the operator did not hire relief drivers.\n\nA council official said the First Ladys interface was critical. He thanked President Mnangagwa for his efforts in road rehabilitation.\n\nWhat we are witnessing on our roads is uncalled for, roads were fixed, but still people are dying. That is not proper because this is due to human error. That is what we are here for. The greatest power that has been suggested by our mother is to come up with three solid associations which are powerful because what is happening in all these associations is a mere quest for money. We are failing to self-regulate and wait to be arrested by the council. Do we have the power to instil values in one another? As council, we sat down and have a resolution to place boom gates at all ranks where we levy fees and we sat down with some associations and discussed with them, he said.\n\nA representative of the Ministry of Transport and Infrastructural Development, Mr Dzingai Mafusire, Commissioner of Road Motor Transportation Management, said the frequency of accidents on the roads was worrisome.\n\nRoad accidents are bad and each time there is an accident we feel the burden, we feel the pressure and our honourable minister is very committed to issues to do with road safety. As a ministry, we support the issue of associations and we have used our administrative powers to recognise associations. We however, saw that there are a lot of associations that are sprouting. There is need for a statutory instrument governing the operations of the associations. In addition to that, we have also requested the City of Harare, through the Ministry of Local Government, to come up with a transport policy. A similar arrangement was made in Bulawayo and it is working well, there is order. Harares transport policy helps plan the ferrying of people. As you are aware, our city has grown exponentially to over six million people whose daily needs require proper planning and coordination. The transport policy will help the council to get into some contractual agreements with associations that are there and this helps empower the associations to manage ranks and lure investment, he said.\n\nA police representative Superintendent Chitakatira Oliver blamed accidents on some driving schools that were not teaching people properly since most accidents were attributable to human error as opposed to mechanical fault.\n\nWe should have a positive attitude to protect people. As police, we cant say we are 100 percent perfect, but there are mechanisms we have put in place to curb the complaints and we have numbers to make reports to, he said.\n\nTSCZ boss Mr Munesu Munodawafa said they were going to purchase breathalysers to keep drivers in check.\n\nAs TSCZ we have a tender to purchase breathalysers which are coming in a few weeks time. The breathalysers will be used by the police on the road. We are also planning to have road traps. Our Government gave us the mandate to work with the police by availing speed traps to the ZRP, he said.\n\nThe First Lady concurred that rank marshals were getting drunk and ended up forcing travellers to board certain vehicles and some people lost goods in the fracas.\n\nBe sober, presentable and responsible. I will visit the ranks personally to observe. Why are drivers letting unlicensed people drive? Why are you driving under the influence of alcohol and keeping a bottle under the seat? Why drive with a fake licence my children? she said.\n\nTo the City of Harare, yes you spoke about plans but what do we do now in terms of bus stops and ranks so that we tame this jungle madness because if they rank, they will be controlled swiftly without difficulties, she said.\n\nDr Mnangagwa urged transport operators to sit down and discuss the issue of targets that were contributing to accidents.\n\nActing Harare town clerk Engineer Phakamile Mabhena emphasised the need for self introspection as mentioned by the First Lady to address some of the challenges raised at the meeting. The way everyone was speaking here shows that the challenge we have at hand is easy to solve. We do not need someone from afar to come and solve the challenge for us, but we ourselves have the solution. All of us from council to rank marshals, drivers, operators, police, all of us, no one is left behind. The other issue our mother spoke about is the need for dialogue. As we sit here we are not working closely together, dialogue builds us so that we sit down and come up with one resolution and look after the people. We thank you mhamha for bringing us together and giving us something to think about. Let us not chase after money at the expense of everything else, including safety, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/1.jpg",
            "description": "FIRST Lady Dr Auxillia Mnangagwa, who is the country’s road safety patron, has decried rising road traffic accidents saying the public transport sector in particular holds a significant responsibility in ensuring the safety and well-being of all citizens.",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "RESILIENT Warriors FIGHT ON . . . derail Super Eagles in their own backyard",
            "url": "https://www.herald.co.zw/resilient-warriors-fight-on-derail-super-eagles-in-their-own-backyard/",
            "content": "Tadious Manyepo in UYO, Nigeria\n\nNigeria (0) 1\n\nZimbabwe (0) 1\n\nTHE Warriors can no longer be bullied. Not in this age and time.\n\nThey are no longer that easy-to-beat sort.\n\nYes, they might still remain rooted at the base of Group C for which neighbours South Africa have seized control, but the Warriors have shown they are ready to take the battle to the wire.\n\nAlthough with four points from six games, they cannot top their pool given they are nine behind leaders Bafana Bafana, they will no doubt still have a huge say in the destiny of the Group C qualification ticket as there are four more matches to fulfil.\n\nLast night at Godswill Akpabio Stadium, here they showed the world they have the heart after this brave draw.\n\nThe manner in which they fought back, to stab the hearts of the more than 30 000 spectators who packed this venue, after falling behind with 16 minutes still to play wasnt only heroic but some telling signs of a force in the oven.\n\nSubstitute forward Tawanda Chirewa stepped up to tap in the equaliser right at the death.\n\nBy that time, Nigerias hitman and scorer on the night Victor Osimhen had been substituted for Victor Boniface and seemed keenly awaiting to be hoisted high up as a saviour of a country, whose qualification fate is no longer in their hands.\n\nIn fact some pundits had tipped Nigeria to massacre Zimbabwe and given the Super Eagles storied dominance of the Warriors over the years.\n\nBookmakers even placed their winning odds at 1/35 and 1/17 for a draw.\n\nBut this is no Mickey Mouse team of amateurs.\n\nThey boast of top talent with players spread across the competent leagues across the world.\n\nIt could have been a win for the Warriors, with a bit of luck and precision.\n\nBut still the point, though not big enough to give them some brighter qualification prospects, was as significant as they get.\n\nThats probably the biggest point they have picked in a campaign where they have drawn four games including the reverse fixture against Nigeria in Rwanda in November 2023.\n\nThe Warriors needed to be tactical, of course, coming against a team of so much attacking talent that had Samuel Chukwueze, Ademola Lookman and Osimhen.\n\nThe trio, aided by their 12th man in the stands, were quite a menace in the opening stages of the game.\n\nA 20-minute sustained attack at Zimbabwes goal could have seen the Warriors collapsing on any other day.\n\nBut their defensive tact, aided by impressive goalkeeper Washington Arubis solidity ensured the visitors survived that spell.\n\nThere was a moment when it was literally Arubi versus Osimhen with the latter always coming second best.\n\nWith just eight minutes on the clock, Arubi dived to his right to deny the lanky Turkish-based Nigerian talisman from a point-blank header that was headed for his right.\n\nTwo minutes later Arubi thwarted the strikers shot on the turn and also stopped Samuel Chikwuezes follow-up.\n\nAt the other end of the field, Walter Musona should have opened the scoring when outsprinting the Nigeria rearguard only to shoot wide of Stanley Nwabalis goal.\n\nThe second half was pretty much the same and at one point the hosts were so desperate and trying to shoot even where it was impossible.\n\nThe resoluteness of the Warriors was always going to pay them dividends but then everything went up in smoke when Osimhen was left unattended and nodded home the opener from the blind side.\n\nWith only a quarter of an hour on the clock, Nigeria thought they had sealed the points to make sure they kept Group C leaders South Africa who are now on 13 points in check.\n\nAnd if they needed a hint of what was to come, it should have come with three minutes to full time.\n\nA good exchange of passes on the left culminated in the ball falling on the path of on-rushing Knowledge Musona, who was totally unmarked and with Nwabali sprawling on the grass, he needed to just guide it in.\n\nShockingly, he wasnt able to measure it up and crashed the underside of the crossbar much to the sigh of the Nigerians, who by then had broken into party mood.\n\nBut Chirewa wouldnt let them off the hook when his quick feet helped him to emerge smarter from an acute angle.\n\nCoach Michael Nees decided to congratulate outgoing Sports, Recreation, Arts and Culture Minister Kirsty Coventry first and foremost after the most successful female Olympian in Africa won the IOC presidency last week before saluting his charges.\n\nWe came here with the intention to win. We played well but we could only draw. Its a big point for us. My boys did very well and with some bit of luck we could have won, said Nees.\n\nIts the second time Zimbabwe managed to rescue a point inside five days in the same competition after staging another massive act by coming from a 2-0 down to draw 2-2 against Benin at Moses Mabhida in Durban last Thursday.\n\nTeams:\n\nNigeria:\n\nStanley Nwabali; Ola Aina, William Troost Ekong, Calvin Bassey, Bright Osayi; Wilfred Ndidi, Alex Iwobi (Raphiel Onyenika 78 min) Samuel Chukwueze (Bulu Arokodale 59 min), Moses Simon; Ademola Lookman, Victor Osimehn (Victor Boniface 86 min)\n\nZimbabwe:\n\nWashington Arubi, Emmanuel Jalai, Divine Lunga, Munashe Garananga, Gerald Takwara, Marshall Munetsi, Andy Rinomhota (Tawanda Maswanhise 84 min), Jordan Zemura, Khama Billiat (Prince Dube 84 min), Knowledge Musona (Terrence Dzvukamanja 62 min), Walter Musona (Tawanda Chirewa 80 min)\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-6-1.jpg",
            "description": "Nigeria…         (0) 1",
            "time": "08:42",
            "date": "26 Mar 2025"
        },
        {
            "title": "Marley’s 1980 visit opened  doors for Jamaican crooners",
            "url": "https://www.herald.co.zw/marleys-1980-visit-opened-doors-for-jamaican-crooners/",
            "content": "Trust Khosa\n\nRobert Nesta Marley (Bob Marley)s visit to Zimbabwe in 1980 was a monumental event that opened floodgates for Jamaicans and left an indelible mark on the nations history.\n\nShowbiz gurus, Hararians and freedom-hungry Zimbabweans gathered for the Independence Day celebrations at Rufaro Stadium.\n\nThe atmosphere was electric, filled with a mix of euphoria and anxiety as the nation stood on the brink of a new era.\n\nFor both nationalists and the masses yearning for freedom, this was an event not to be missed.\n\nThe festivities at Rufaro were headlined by the late legendary reggae prophet Marley) and the Wailers, who arrived in Harare to endorse Zimbabwes newfound independence.\n\nThose fortunate enough to attend the show often describe it as a defining moment, one that still resonates in the archives of their memories. The ceremonial home of football became a vibrant stage for Marley, who not only entertained but also inspired a generation with his powerful message of hope and liberation. Forty-five years later, the memories of that unforgettable day continue to linger in the minds of those who experienced it.\n\nMarley, a true philosopher and a passionate advocate for African emancipation, played a pivotal role in ushering Zimbabwe into its new dawn.\n\nAs the nation celebrated its Independence Day, Marleys presence added a unique depth to the festivities, marking the beginning of a transformative chapter in Zimbabwes history.\n\nAlthough he died on May 11, 1981  a year after his historic visit to Zimbabwe  he left footprints that are hard to erase. He will also be credited with opening the floodgates for other Jamaican artists who toured Zimbabwe.\n\nSince then, Jamaicans have continued to visit our shores for live performances, while others have adopted Zimbabwe as their second home.\n\nNot only have Jamaican artists fallen in love with Zimbabweans, but they have also been embraced by the locals due to Marleys influence. Despite his international appeal and fame, which he still enjoys from his grave, Marleys love for this country was immense. Fellow Jamaican artists and groups have become regular visitors to Zimbabwe. Mystic Roots Band, Don Carlos, Sizzla Kalonji, Capleton, Cocoa Tea, Fantan Moja, Sean Paul, Anthony B, Busy Signal, Morgan Heritage, and most recently, Burning Spear, are some of the big names to have visited our shores. The list would be incomplete without mentioning Luciano, who performed twice in Zimbabwe, as well as Popcaan and Chris Martin. Martin, who preferred being called Tinashe during his visit courtesy of Red Rose Entertainment under the aegis of Barbara Mama Red Rose Chikosi, thoroughly enjoyed his stay, and it was Marley who paved the way.\n\nAs the countdown to the 2025 Uhuru celebrations gather momentum, Marleys name will always be on many peoples lips.\n\nA down-to-earth reggae icon, he funded his trip to Harare out of love for Zimbabwe and even composed a special song for this journey. Affable reggae crooner, researcher, and musician Professor Zindi, who had a close encounter with Marley in 1980, told the Zimpapers Arts and Entertainment Hub that the late reggae prophet inspired other artistes to fall in love with Zimbabwe.\n\nBob Marleys 1980 visit to Zimbabwe played a significant role in encouraging other Jamaicans to fall in love with the country.\n\nMost Jamaican artistes wanted to follow suit after what happened to Marley. The warm hospitality he received in Zimbabwe was enough to convince them to come here, stressed Professor Zindi.\n\nMarley was a down-to-earth singer despite being a superstar. When he came here, he was humble and never behaved like a pop star or top celebrity. He actually funded his trip to Zimbabwe when he was invited to perform at the Uhuru celebrations.\n\nProfessor Zindi recounted how the late nationalist Edgar Two Boy Tekere brokered the deal after sending emissaries to negotiate with Marley.\n\nTekere was the one who sent Job Kadengu, who owned a club, and Gordon Muchanyuka, another businessman from Harare back in the day. The two managed to convince Marley to perform in Zimbabwe, but he brought his own equipment and paid for his band members travel fares to come and perform. That alone was enough proof of his love for the country, he emphasised.\n\nHe only singled out the late Peter Tosh as the only pompous Jamaican reggae artiste who made weird demands when approached to perform here.\n\nThe only person who was rude was Peter Tosh, who wanted an invitation to perform from the late former President Robert Mugabe. He insisted that he would only come with an invitation from Mugabe, he recalled.\n\nFellow reggae fanatic and entertainment consultant Taonga CC Mafundikwa, who was young when Marley came to Zimbabwe, noted that the visit was a game-changer.\n\nIt opened many floodgates because we have many Jamaicans still visiting Harare after Marley. I am close to most artiste who came after Marley and were charmed by our hospitality.\n\nThe late Peeteh Morgan of Morgan Heritage always told me he was more than willing to come and just visit Zimbabwe. Its quite unfortunate that he is now late, but we cant take away the love he had for this nation, he said.\n\nMafundikwa believes that good ties between Harare and Jamaica should be maintained for the development of the music sector.\n\nWe need to maintain the good relations existing between the countries. Credit should always be given to Marley, whose genuine love for Zimbabwe was unparalleled.\n\nHe loved this country, and it would be great for the nation to host members of his family one day, he shared.\n\nCredit also goes to local arts promoters who have been hosting these international acts from Jamaica to exchange notes with locals.\n\nWith the 45th Uhuru celebrations on the horizon, this is the perfect time to remember icons of Marleys calibre who contributed significantly to our first Independence Day celebrations.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/Untitled-8.jpg",
            "description": "Robert Nesta Marley (Bob Marley)’s visit to Zimbabwe in 1980 was a monumental event that opened floodgates  for Jamaicans and left an indelible mark on the nation’s history.",
            "time": "08:42",
            "date": "26 Mar 2025"
        }
    ]
}