{
    "news": [
        {
            "title": "Suspected car thief steals vehicle with juvenile inside",
            "url": "https://www.herald.co.zw/suspected-car-thief-steals-vehicle-with-juvenile-inside/",
            "content": "George Maponga in Masvingo\n\nA cheeky car thief allegedly stole a Honda Fit in Masvingos Mucheke suburb and drove off with the owners five-year-old child.\n\nThe thief allegedly observed the car owner, Tarisai Hokonya (38) of Mucheke D suburb, walking back into her house and leaving her car with her child inside, parked in front of the gate.\n\nWhen Hokonya got into the house, the suspect sneaked into the car and drove off. Upon returning to the car, Hokonya, who intended to drive to Harare, found both her vehicle and five-year-old daughter missing.\n\nAccording to Masvingo provincial police spokesperson, Inspector Kudakwashe Dhewa, Hokonyas daughter returned home crying a quarter of an hour after the car was stolen.\n\nShe told her mother that she had been dumped by the unknown suspect near Runyararo Primary School.\n\nPolice launched a manhunt for the car and suspect. They found the car dumped near Masvingo Provincial Heroes Acre.\n\nIt had been involved in an accident and was extensively damaged. Inspector Dhewa said the suspect stole the car battery and a Samsung cellphone that was inside.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/images-4-680x380.jpg",
            "description": "A cheeky car thief allegedly stole a Honda Fit in Masvingo’s Mucheke suburb and drove off with the owner’s five-year-old child.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "Masvingo couple arrested with mbanje, husband jailed",
            "url": "https://www.herald.co.zw/masvingo-couple-arrested-with-mbanje-husband-jailed/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nA couple from Masvingo has been arrested in Beitbridge over a drug peddling matter after police detectives found them carrying an assortment of mbanje.\n\nThe husband, Simbarashe Kagande (41) was jailed on Monday for an effective two and half years for contravening a section of the Dangerous Drugs Act when he appeared before Beitbridge resident magistrate Mr Takudzwa Gwazemba.\n\nHis wife, Isabell Mhangami (34) is expected to stand trial before the same court on Tuesday.\n\nKagande will, however, serve 30 months in prison after Mr Gwazemba conditionally set aside six months of his 36-month term for five years.\n\nThe 0,564 kilogrammes of mbanje were forfeited to the State as part of the sentence. Appearing for the State, Mr Ronald Mugwagwa told the court that on April 13, the couple arrived at Masvingo turn off with an assortment of goods intending to hitchhike.\n\nThey were busted by detectives who had information that they had dagga, which they intended to take to Masvingo.\n\nTheir belongings were searched, leading to the discovery of the mbanje weighing 0,564 grammes worth US$56.\n\nThe two were subsequently arrested.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/01/Mbanje-305x175-680x380.jpg",
            "description": "A couple from Masvingo has been arrested in Beitbridge over a drug peddling matter after police detectives found them carrying an assortment of mbanje.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "Three killed in Mashava mine collapse",
            "url": "https://www.herald.co.zw/three-killed-in-mashava-mine-collapse/",
            "content": "Online Reporter\n\nThree people have been killed after a mineshaft collapsed at SP Mining Syndicate in Mashava, Masvingo Province.\n\nThe incident which follows a recent gold rush in the area left six others with various degrees of injuries.\n\nZimbabwe Republic Police Masvingo Province spokesperson, Inspector Kudakwashe Dehwa confirmed the incident which occured at around 3am on Saturday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/shabani-mashava-1-680x380.jpg",
            "description": "Three people have been killed after a mineshaft collapsed at SP Mining Syndicate in Mashava, Masvingo Province.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "Sport Minister Tours National Sports Stadium",
            "url": "https://www.herald.co.zw/sport-minister-tours-national-sports-stadium/",
            "content": "Zimpapers Sports Hub\n\nNEW Sport, Recreation, Arts and Culture Minister Anselem Sanyatwe this afternoon conducted his first tour of the National Sports Stadium where he got first hand appreciation of the progress made in the renovations at the facility.\n\nThe stadium was closed for renovations in 2022 after it was condemned by FIFA and the Confederation of African Football.\n\nThe Minister was shown around the stadium by officials from the Ministry led by Permanent Secretary Nicholas Moyo and representatives from the contractors. Sports and Recreation Commission Director General Eltah Nengomasha and other senior officials also took part in the tour.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Minister-Sanyatwe-680x380.jpg",
            "description": "NEW Sport, Recreation, Arts and Culture Minister Anselem Sanyatwe this afternoon conducted his first tour of the National Sports Stadium where he got first hand appreciation of the progress made in the renovations at the facility.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "President meets Chinese envoy",
            "url": "https://www.herald.co.zw/president-meets-chinese-envoy/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nPresident Mnangagwa held bilateral talks with a Chinese delegation led by the Executive Vice Governor of Jiangsu Province, Ma Xin, who paid him a courtesy call at State House this afternoon.\n\nThe two held bilateral talks meant to deepen cooperation between the two countries.\n\nChina and Zimbabwe enjoy bilateral relations that have seen Beijing standing with Harare at a time when Western countries have imposed illegal sanctions on Zimbabwe.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/842eb636-e1b7-44a5-bd43-89c1db69dc9e-680x380.jpeg",
            "description": "President Mnangagwa held bilateral talks with a Chinese delegation led by the Executive Vice Governor of Jiangsu Province, Ma Xin, who paid him a courtesy call at State House this afternoon.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "Road safety campaign launched ahead of Easter, Independence holidays",
            "url": "https://www.herald.co.zw/road-safety-campaign-launched-ahead-of-easter-independence-holidays/",
            "content": "Freeman Razemba\n\nSenior Reporter\n\nTraffic Safety Council of Zimbabwe board chairperson, Mr Kura Sibanda has said drivers on the countrys roads should avoid reckless driving, drunk driving, and all other violations of road rules to preserve lives during the upcoming holidays.\n\nMr Sibanda was speaking during the launch of the Easter and Independence holidays road safety campaign in Glendale this Monday.\n\nWe are launching this Easter safety campaign to remind all road users of the importance of responsible driving. Improving road safety is not solely the responsibility of the Government. Its a shared responsibility that requires the active participation of every road user, from motorists to pedestrians and cyclists.\n\nWe encourage all of you to take a proactive role in making our roads safer this Easter. This means observing traffic rules, exercising patience and caution while driving, and being vigilant on the roads, he said.\n\nMr Sibanda said road transport represents the most widely used means of transport in Zimbabwe, hence the need for vigilance.\n\nIt is our sincere wish that the presence of our campaign teams on the nations roads will save lives. It has become increasingly clear that road safety is a key aspect of development and needs to be accorded the seriousness it deserves.\n\nYou will see a strong presence of law enforcement and traffic safety officers on the roads, conducting roadblocks and patrols to ensure that traffic laws are being observed. We want to create a visible deterrent to reckless behaviour and to ensure that all road users take road safety seriously.\n\nAs Traffic Safety Council of Zimbabwe, we continue to reiterate the message of road safety, keeping in mind, that Safety First, There Is No Second Chance, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/TSCZ-board-chairman-Mr-Kura-Sibanda-680x380.jpg",
            "description": "Traffic Safety Council of Zimbabwe board chairperson, Mr Kura Sibanda has said drivers on the country’s roads should avoid reckless driving, drunk driving, and all other violations of road rules to preserve lives during the upcoming holidays.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "South Africa appoints US envoy",
            "url": "https://www.herald.co.zw/south-africa-appoints-us-envoy/",
            "content": "Online Reporter\n\nSouth African President Cyril Ramaphosa has announced that the countrys former deputy finance minister, Mr Mcebisi Jonas, will be his special envoy to the United States.\n\nPresident Ramaphosa said Jonas will be entrusted with advancing South Africas diplomatic, trade and bilateral priorities.\n\nLast month, the US expelled South Africas Ambassador, Mr Ebrahim Rasool, over remarks he had made about the Trump administration.\n\nPresident Ramaphosas office said Jonas will be serving as the official representative of the President and South Africa.\n\nHe will lead negotiations, foster strategic partnerships and engage with US government officials and private-sector leaders to promote our nations interests.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Mr-Mcebisi-Jona-680x380.jpg",
            "description": "South African President Cyril Ramaphosa has announced that the country’s former deputy finance minister, Mr Mcebisi Jonas, will be his special envoy to the United States.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "All-female crew tour space",
            "url": "https://www.herald.co.zw/all-female-crew-tour-space/",
            "content": "Billionaire Jeff Bezos Blue Origin launched his fiance Lauren Sanchez to space today with an all-female celebrity crew that included Katy Perry and Gayle King.\n\nIt was the latest wave in space tourism, where more of the rich and famous than ever before  or lucky and well-connected  can enter the zero-gravity realm traditionally dominated by professional astronauts.\n\nSanchez, a helicopter pilot and former TV journalist, invited the others along for the 10-minute, fully automated flight, packing on the star power with singer-songwriter Perry and CBS Mornings co-host King.\n\nAlso sharing the ride were film producer Kerianne Flynn; Aisha Bowe, a former Nasa engineer who started her own companies to promote science education; and Amanda Nguyen, a scientist who studied planets around other stars and now advocates for survivors of sexual violence.\n\nBlue Origin declined to say how much the flight cost or who paid what.\n\nThe only other all-female crew in 64 years of human space flight was back in 1963. That is when Soviet cosmonaut Valentina Tereshkova launched by herself, becoming the first woman in space. Tereshkova spent three days off the planet.\n\nEven after the latest launch, women represent barely 15 per cent of the more than 700 people who have travelled into space.\n\nSanchez said she deliberately chose women to launch with her, each of them eager to inspire both the young and old to dream big, and even commissioned special flight suits.\n\nIts an important moment for the future of commercial space travel and for humanity in general and for women all around, Katy Perry said last week.\n\nThe launch brought out VIPs to West Texas, including Oprah Winfrey and several other women.\n\nBezos is an American businessman best known as the founder of Amazon, the worlds largest e-commerce and cloud computing company. -www.scmp.com\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/fcbe10c3-ac8a-4406-a4ba-affe94cb8f61-680x380.jpg",
            "description": "Billionaire Jeff Bezos’ Blue Origin launched his fiancée Lauren Sanchez to space today with an all-female celebrity crew that included Katy Perry and Gayle King.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "Man in court for raping granny (83)",
            "url": "https://www.herald.co.zw/man-in-court-for-raping-granny-83-2/",
            "content": "Online Reporter\n\nA 37-year-old man from Virimai Village under Chief Nyashanu in Buhera appeared at Murambinda Magistrates Court on allegations of raping a granny aged 83.\n\nSimbarashe Dzingai was not asked to plead to the rape charges when he appeared before magistrate Mr Poterai Gwezhira, who remanded him in custody. He is expected to appear at Rusape Regional Court on April 17.\n\nThe State, led by Tavonga Mawire, alleges that sometime in March this year, Dzingai visited the elderly woman, who was fast asleep in a kitchen hut at her homestead in Munyanyi Village.\n\nDzingai woke up the granny and asked for water. She reportedly directed Dzingai where he could fetch the water but he insisted she should get the water for him.\n\nAs the two were exchanging words, Dzingai forced himself on the elderly woman.\n\nFurther allegations are that Dzingai threatened to assault the granny if she revealed the sexual attack to anyone.\n\nOn April 8, Dzingai allegedly returned to his victims homestead and started shouting at her, accusing her of interfering in his relationship with another woman.\n\nIt was during the exchange of words that the elderly woman revealed that Dzingai raped her.\n\nThe matter was reported to police leading to his arrest.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "A 37-year-old man from Virimai Village under Chief Nyashanu in Buhera appeared at Murambinda Magistrates Court on allegations of raping a granny aged 83.",
            "time": "18:45",
            "date": "14 Apr 2025"
        },
        {
            "title": "Senator Chinomona praises Zvimba Women’s Project",
            "url": "https://www.herald.co.zw/senator-chinomona-praises-zvimba-womens-project-2/",
            "content": "Conrad Mupesa\n\nMashonaland West Bureau\n\nZANU PFs Secretary for Womens Affairs Cde Mabel Chinomona has praised the women of Mashonaland West for their active participation in the countrys economic framework, which is essential for achieving Vision 2030.\n\nShe, however, warned women against the abuse of resources provided by the party. Women across the provinces seven districts are engaged in flourishing projects including chicken farming and sewing projects after receiving support from the party.\n\nDuring a visit to the Zvimba sewing project at Rasper Skills Development and Wellness Centre near Norton, Cde Chinomona observed that local women are primarily focused on sewing school uniforms.\n\nThese uniforms already have a market, thanks to the support from four ZANU PF Members of Parliament in Zvimba East, Zvimba West, Zvimba South and Zvimba North.\n\nCde Decide Manhanzva from Zvimba East and Cde Dexter Malinganiso from Zvimba South have collectively bought more than 1 000 uniforms. The uniforms will be donated to vulnerable children in both primary and secondary schools.\n\nCde Chinomona is set to present incubators to the women as the party continues to invest in their empowerment.\n\nShe was accompanied by the Womens League Secretary for Administration Cde Monica Mutsvangwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/05/Secretary-for-Women’s-Affairs-Cde-Mabel-Chinomona.jpg",
            "description": "ZANU PF's Secretary for Women's Affairs Cde Mabel Chinomona has praised the women of Mashonaland West for their active participation in the country's economic framework, which is essential for achieving Vision 2030.",
            "time": "18:45",
            "date": "14 Apr 2025"
        }
    ]
}