{
    "news": [
        {
            "title": "Air ambulance roll out continues . . . Vic Falls personnel complete training",
            "url": "https://www.herald.co.zw/air-ambulance-roll-out-continues-vic-falls-personnel-complete-training/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nTHE Government-sponsored air ambulance service will from next week be fully operational in Victoria Falls as the roll-out continues across the country.\n\nZimbabwe received a fleet of 18 Russian-made Ansat and Mi-17 helicopters in 2023 in a deal initiated by President Mnangagwa to ensure that patients in the public health system have access to top-class medical care.\n\nThe availing of this service has already seen several lives being saved across the country, with people in rural areas now able to be airlifted promptly to central hospitals.\n\nThe air ambulance service has so far been rolled out in Harare, Bulawayo and now Victoria Falls.\n\nMedical personnel comprising four doctors and four nurses have since received training at a local hospital in the resort city the countrys prime tourist destination.\n\nThis latest development will see an improvement in Victoria Falls capacity to promptly deal with eventualities that may arise needing the air ambulance services.\n\nPresident Mnangagwa visited HeliDrive Air Medical facilities in Russia last year and endorsed the roll out of air ambulance services in Zimbabwe.\n\nThis tour has been an eye-opener. The air medical services are critical for Zimbabwe. I give it my blessings, he said.\n\nTourism and Hospitality Industry Minister Barbara Rwodzi told The Herald yesterday that such services were a pull factor in terms of assuring prospective tourists, including high-profile figures of their safety, as they would be guaranteed of being taken care of should the need for the service arise.\n\nWe welcome the initiative, first and foremost let me thank His Excellency President Mnangagwa for bringing this long-term (service) which has positive results for tourism.\n\nAs the tourism sector and Ministry, we appreciate this because we have a lot of tourists who visit Victoria Falls as one of the seven wonders of the world. Many high profile people flock to Victoria Falls, but end up thinking twice, so right now we are working on the construction of a hospital which has a theatre because we do not have one in Victoria Falls, said Minister Rwodzi.\n\nThese high profile people put so much importance on their health and security so when they go for holiday to relax they really consider what happens in case of an emergency. They look for services such as the air ambulance so that if anything happens to them they are taken to a hospital that has a theatre which may be in Harare or Bulawayo. So these air ambulances that are coming will give comfort to the niche market of clients.\n\nNational Air Ambulance Service Russia Medical Director Mr Andrei Perevedentcev said local medical personnel in Victoria Falls had been fully trained and were ready for action.\n\nWe have trained eight medical personnel from the local hospital, four doctors and four nurses. So, that was kind of initial training, but its good enough to begin operations. Our plan is to relocate a helicopter to Victoria Falls latest at the beginning of February.\n\nSo, together with that helicopter, another doctor will come to Victoria Falls and do some kind of additional hands-on training because now that we have trained them on the ground, the next stage is to be trained practically in the helicopter.\n\nBut the local medical personnel is already, let us say, ready for action, he said.\n\nMr Perevedentcev went on to explain the operational modalities.\n\nWe have found a helipad inside the hospital. It is quite in a good condition. All we have to do is to remove some debris that surrounds the helipad, and then we will probably put a container there or establish an office nearby.\n\nBut for the beginning of operations, more or less, everything is ready, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/President-Mnangagwa-with-air-ambulance-officials-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter THE Government-sponsored air ambulance service will from next week be fully operational in Victoria Falls as the roll-out continues across the country. Zimbabwe received a fleet of 18 Russian-made Ansat and Mi-17 helicopters in 2023 in a deal initiated by President Mnangagwa to ensure that patients in the public health system have […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "Ambassador Mvundura declared National Hero",
            "url": "https://www.herald.co.zw/ambassador-mvundura-declared-national-hero/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nFORMER Zanu PF Manicaland provincial chairman Ambassador John Mvundura, who died in Harare last week, was yesterday declared a National Hero by President Mnangagwa.\n\nHe was 81.\n\nZanu PF Deputy Secretary General Cde Mike Nyambuya delivered a message from President Mnangagwa to the Mvundura family on the conferment of National Hero status.\n\nCde Nyambuya was accompanied to the Mvundura family home in Harare by Zanu PF Deputy Secretary for Lands and Agriculture, Cde Mike Madiro.\n\nIn his remarks, Cde Nyambuya said the President had seen it fit to bestow the highest honour on Ambassador Mvundura for his immense contribution during and after the protracted liberation struggle.\n\nI have been sent by President Mnangagwa to relay the message that Ambassador Mvundura has been accorded National Hero status, he said.\n\nHis track record speaks for itself. He was a selfless and dedicated Zimbabwean who has left a distinct trail of his deeds during the liberation struggle and after the liberation struggle.\n\nSo after considerations, His Excellency has conferred national hero status on Cde John Shumba (Mvundura).\n\nCde Nyambuya said details on burial arrangements would be availed by the Ministry of Home Affairs and Cultural Heritage in due course.\n\nHowever, he suggested that Ambassador Mvundura could be buried tomorrow (Wednesday) together with Major-General (Retired) Solomon Siziba and former Information, Posts and Telecommunications Minister Cde Chenhamo Chen Chakezha Chimutengwende.\n\nI think he will be buried at the National Heroes Acre on Wednesday along with the others, he said.\n\nCde Nyambuya said Ambassador Mvundura had left a lasting legacy that would forever be cherished.\n\nHe was a strong man with strong views, who never failed to make his opinions known. He gave his life for the liberation of this country and we shall forever remember him, he said.\n\nAmbassador Mvunduras younger brother, Mr George Mvundura, expressed gratitude to President Mnangagwa for honouring not only his brother but the family at large.\n\nHe also expressed gratitude to the Zanu PF Manicaland leadership for being with the family since the death of Ambassador Mvundura.\n\nThe President has seen it fit that Cde Mvundura is accorded National Hero status and as a family, we are very grateful for that decision.\n\nWe are so happy to know that we have a President who loves us and recognises us as a family.\n\nWe also thank the Zanu PF leadership in Manicaland for standing by us and ensuring one of our own is bestowed with such an honour, he said.\n\nAmbassador Mvunduras first-born daughter, Ms Janet Mvundura, described her father as a caring man who took good care of his family.\n\nHe was a loving man who took care of his family well. He was a father who expected much from us as his children.\n\nHe always wanted us to walk in a straight path to safeguard the family name, she said.\n\nAmbassador Mvundura is survived by his wife Mrs Perpetual Mvundura and 10 children.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/cde-Mike-Nyambuya-at-Amb-Mvundura-house-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter FORMER Zanu PF Manicaland provincial chairman Ambassador John Mvundura, who died in Harare last week, was yesterday declared a National Hero by President Mnangagwa. He was 81. Zanu PF Deputy Secretary General Cde Mike Nyambuya delivered a message from President Mnangagwa to the Mvundura family on the conferment of National Hero status. […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "O’Level Cambridge results scandal rocks private school",
            "url": "https://www.herald.co.zw/olevel-cambridge-results-scandal-rocks-private-school/",
            "content": "Trust Freddy-Herald Correspondent\n\nSEVERAL students at Knowstics Academy in Nyanga are yet to receive their Ordinary Level Cambridge examination results after officials at the private school allegedly embezzled more than US$40 000 in examination fees.\n\nThe Government has since launched an investigation into the matter, with the Manicaland Provincial Education Director dispatching a team to the ground to get to the bottom of the issue.\n\nThis scandal comes as all OLevel students are now left with only five days to prepare for their transition to Advanced Level, after the Government gazetted 27 January as the new opening date for all Lower Sixthclasses.\n\nIn a circular released on January 16 this year, Knowstics Group of Schools told parents and stakeholders that the British Council was yet to release OLevel Cambridge results for 2024.\n\nThe purpose of this communique is to advise parents and stakeholders that the British Council has not released the Form Four Cambridge results because the former management of the school appears to have embezzled the examination fees as the examination fees paid by the parents were not paid to British Council, reads part of the statement.\n\nI have been having meetings with the officials of the British Council and was hoping to resolve the matter so that they could release the results today at 0900hrs, but we ended up spending the entire day today having discussions with the officials of British Council, but up to now (2300hrs), I am still waiting to get their final position on the issue regarding the release of the results.\n\nThis also comes barely a month after Knowstics Academy was placed under corporate rescue in a bid to revamp its operations and restore its reputation.\n\nAccording to the statement, the school was mulling taking legal action to force the British Council to release the results.\n\nI sought legal advice during the day and depending on the outcome of the deliberations amongst British Councils officials, I will decide the legal action to take.\n\nI will follow up tomorrow morning with the British Council officials to get their final position which will inform the next action we will have to take.\n\nThe action recommended by the Attorneys will require a few studentsrepresented by their parents to make an urgent chamber application to compel the British Council to release the results. The school will be responsible for the payment of legal fees for the urgent chamber application.\n\nI will give British Council up to 11 am tomorrow and if the matter is not resolved by then, I will engage the lawyers so that we map the way forward, which way forward will be communicated to stakeholders tomorrow.\n\nThe school also revealed that they were going to report the matter to the police.\n\nI am going to report a case of theft of trust funds amounting to US$41 272.00 to the Zimbabwe Republic Police and institute civil proceedings to recover the amount in question from the perpetrators of this criminal offence.\n\nHowever, my primary focus at the moment is to pursue options aimed at causing British Council to release theOLevel Cambridge results and thereafter will attend to the matter involving what appears to be a case of theft of trust funds.\n\nWhen The Herald contacted Knowstics Academy on its direct office line yesterday, the phone was picked up by a lady who said she was not in the right position to comment and promised to give us the number of a person who could comment.\n\nHowever, an hour later, when The Herald contacted them again and asked to speak to the schools principal, she simply said: Why cant you call the British Council?\n\nThis reporter also went to the British Council Zimbabwe offices in Belgravia, Harare, where he failed to even reach the reception after being advised by the security personnel manning the premises that they had just been informed that the council was not ready to entertain the media and that they had no comment.\n\nUnfortunately, I cannot let you in, I have just been informed that they have no comment, the security guard said.\n\nWhen contacted for comment, the Acting Manicaland Provincial Education Director, Mr Richard Gabaza, confirmed the incident, saying they received the report on Friday and were still verifying the number of students affected.\n\nThe school is in Mutasa District, and I am based in Mutare so the District Schools Inspector (DSI) is the one handling the investigation, and after its completion, the DSI will submit a comprehensive report, he said.\n\nPrimary and Secondary Education Ministry spokesperson Mr Taungana Ndoro also confirmed that investigations were in full swing.\n\nWere still monitoring and investigating the situation, Mr Ndoro said.\n\nThis development also comes amid revelations that the top private school, which was recently placed under corporate rescue, has been battling an avalanche of legal suits from disgruntled staffers and service providers since 2023.\n\nIn that year, the non-payment of staff members was reported to the National Employment Council for Welfare and Educational Institutions (NEC).\n\nMeanwhile, Primary and Secondary Education Permanent Secretary Mr Moses Mhike has announced that all 2025 Lower Sixth classes will commence on Monday, January 27.\n\nMr Mhike said pupils will pay fees based on the number of days they attend school in Term 1, proportional to the total approved fees for the term.\n\nThe commencement date for the 2025 Lower Sixth classes is Monday, the 27th of January 2025. Please ensure that all Heads of schools, teachers, parents and pupils are advised of this date.\n\nThe fees payable by the lower six pupils will be on a pro-rata basis to the approved Term One fee for each school, given by the following formula:\n\nNumber of days remaining in Term 1 2025 x total approved term 1 Fees.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Exam-scam-680x380.jpg",
            "description": "Trust Freddy-Herald Correspondent SEVERAL students at Knowstics Academy in Nyanga are yet to receive their Ordinary Level Cambridge examination results after officials at the private school allegedly embezzled more than US$40 000 in examination fees. The Government has since launched an investigation into the matter, with the Manicaland Provincial Education Director dispatching a team to […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "Acting President mourns national heroes",
            "url": "https://www.herald.co.zw/acting-president-mourns-national-heroes/",
            "content": "Mukudzei Chingwere-Herald Reporter\n\nACTING President Dr Constantino Chiwenga has expressed his heartfelt condolences following the death of three National Heroes  Major General (Retired) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura.\n\nMaj-Gen Siziba and Cde Chimutengwende are set to be buried tomorrow at the National Heroes Acre in Harare, amid indications Ambassador Mvundura might be interred on the same day.\n\nActing President Chiwenga said Maj-Gen Siziba was one of the students at Manama Mission School who were recruited in 1977 by ZIPRA together with the likes of Air Chief Marshal (Rtd) Elson Moyo, the late national hero Lieutenant-General (Rtd) Sibusiso Busi Moyo, and Beitbridge East legislator Cde Albert Ngulube.\n\nMaj-Gen Sizibas sacrifices, said Acting President Chiwenga, must remain a great challenge to everyone.\n\nHe underwent basic guerrilla training in Kaunga under the current Commander Defence Forces General Philip Valerio Sibanda, who was the Camp Commandant, said Acting PresidentChiwenga.\n\nMaj-Gen Siziba was one of the survivors of the Freedom Camp and Mukushi Camp attacks by Rhodesian Forces in 1978.\n\nIn 1979, he was selected to undergo training in the Soviet Union, Moscow in Russia as a Reconnaissance Officer.\n\nHe was attested into the Zimbabwe National Army and commissioned to the rank of Captain.\n\nHe participated in the Mozambique Campaign and was also deployed in the DRC during Operation Sovereign Legitimacy.\n\nIn 2005, Maj-Gen Siziba was appointed Defence Attach in Botswana where he was credited for establishing the Botswana Military Attach Association and producing its constitution\n\nApart from his military contribution to the country, said Acting President Chiwenga, Maj-Gen Siziba was instrumental in the establishment of the National Prosecution Authority where he served as director administration and board secretary.\n\nIn respect of Ambassador Mvundura, the Acting President said: I received with deep sorrow and sadness, (news) of the untimely death of Ambassador John Shumba Mvundura, a seasoned diplomat and a veteran of our liberation struggle.\n\nHis first Diplomatic Mission was in Mozambique and Swaziland followed by Malawi, Libya, Nigeria and Cuba.\n\nDespite retiring from Government service in 1994, his resilience, commitment to duty and contribution to the diplomatic mission, the Government re-appointed him in 2000 and he served until 2013. Cuba was his last Diplomatic mission.\n\nActing President Chiwenga said Cde Mvunduras political career began in the early days of ZAPU and ZANU when the black political activists began mobilising support to act against the oppressive colonial rule.\n\nAs an activist and chair of youths in Old Highfield, he was among the brave sons and daughters of the soil who stood up and fought for the independence of Zimbabwe.\n\nTurning to Cde Chimutengwende, Acting President Chiwenga said he was a dedicated patriot and renowned author whose commitment to the independence and emancipation of the people of Zimbabwe surpasses any reasonable doubt.\n\nWhilst serving in the legislature, Cde Chimutengwendes astuteness saw him being appointed to the post of Deputy President of the Senate and head of the Zimbabwe delegation to the Pan-African Parliament (PAP), said Acting President Chiwenga.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Acting-President-Chiwenga-680x380.jpg",
            "description": "Mukudzei Chingwere-Herald Reporter ACTING President Dr Constantino Chiwenga has expressed his heartfelt condolences following the death of three National Heroes – Major General (Retired) Solomon Siziba, Cde Chenhamo “Chen” Chakezha Chimutengwende and Ambassador John Shumba Mvundura. Maj-Gen Siziba and Cde Chimutengwende are set to be buried tomorrow at the National Heroes Acre in Harare, amid […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "Funeral parade for Major-Gen Siziba",
            "url": "https://www.herald.co.zw/funeral-parade-for-major-gen-siziba/",
            "content": "Fungai Lupande and Columbus Mabika\n\nA FULL military parade was held yesterday for National Hero Major-General (Retired) Solomon Siziba at Lookout Masuku Barracks in Bulawayo, while another National Hero, Cde Chenhamo Chen Chakezha Chimutengwendes body was taken to his Chiweshe rural home.\n\nCommander Defence Forces, General Philip Valerio Sibanda, was the chief mourner at the funeral parade.\n\nMaj-Gen Siziba died last Wednesday at Josiah Magama Tongogara Camp Hospital in Harare after a long battle with cancer.\n\nHe was 67.\n\nGeneral Sibanda described Maj-Gen Siziba as a true revolutionary cadre, an emblem of the liberation struggle, a man of integrity and a distinguished diplomat.\n\nThe late Generals career spans from the liberation struggle when he gave up his youth to fight for the emancipation of our people and the freedom we enjoy today.\n\nAs the impetus of the war of liberation gathered momentum and penetrated through all corners of the country, the late Major-General, together with his fellow youths in his area were pained by the oppression and ill-treatment of fellow Zimbabweans at the hands of the Rhodesians, he said.\n\nGeneral Sibanda added that entire Zimbabwe Defence Forces was struggling to cope with the death of Maj-Gen Siziba.\n\nThis is a very painful and sad moment as we struggle to come to terms with what has befallen the Siziba family, Zimbabwe Defence Forces and the nation at large, he said.\n\nAs I stand before you, I am filled with a profound sense of loss, but also with a deep appreciation for the time we were privileged to share with the Major-General (Rtd), he said.\n\nIn Chiweshe, scores of people in Mashonaland Central converged at Cde Chimutengwendes homestead to celebrate his life.\n\nPallbearers carry the casket bearing the body of National Hero Chenhamo Chimutengwende on arrival at Majome Village in Chiweshe, Mashonaland Central yesterday.\n\nCde Chimutengwende died last Thursday after a long battle with chronic kidney disease.\n\nHe was 81.\n\nHis body was received at Majome Primary School in Chiweshe by Zanu PF officials and supporters, family members and friends.\n\nCde Chimutengwende was praised for pioneering many developmental projects in Chiweshe and Mazowe, including the construction of schools, the Glendale-Chiweshe Road, and spearheading the rural electrification drive in his area during his 28 years as a Member of Parliament for Mazowe.\n\nSpeakers described Cde Chimutengwende as a unifier and advisor, who mentored many political figures in Mashonaland Central province.\n\nMazowe Central MP Maxmore Njanji said he inherited a constituency that was well-developed by Cde Chimutengwende.\n\nThe good work done by Cde Chimutengwende is a testament to the life he lived.\n\nHe constructed schools and roads and brought electricity to Mazowe Central, he said.\n\nHome Affairs and Cultural Heritage Minister and Zanu PF Mashonaland Central provincial chairperson, Cde Kazembe Kazembe, said Cde Chimutengwende was well-loved in Mazowe, adding that at one time, party members urged him to become their Senator, despite his desire to take a break.\n\nHe was the longest-serving Member of Parliament in Mazowe because he was deeply cherished by the people. He was a peace-loving individual, a unifier, and a vibrant personality, he said.\n\nHe was an advisor and counsellor during the time of intra-party conflicts. I was hesitant to become a political commissar during that time, but due to his wise counsel, I accepted.\n\nMinister of State for Mashonaland Central Provincial Affairs and Devolution, Christopher Magomo, who was the chief mourner, called on the province to celebrate a life well-lived.\n\nHe also implored people from the province to come out in largenumbers to pay their last respects to this gallant son of the soil.\n\nGod has called him home; although it is painful, let us celebrate the time we spent with him. He was loyal until the end, he said.\n\nThe President was not hesitant to confer him with national hero status. He was an advisor who treated everyone with respect. We are all on a journey; only our bus stops differ.\n\nZanu PF national Political Commissar Cde Munyaradzi Machacha conveyed his condolences to the Nyangoni family, adding the ruling party feels the weight of the loss since Cde Chimutengwende tirelessly supported the party.\n\nHe loved people, and we worked together while he was the Minister of Broadcasting and I was a journalist, he said.\n\nHe was a jovial man who made everyone feel welcome. He was a Pan-Africanist par excellence.\n\nHe mentored and guided me. We have been robbed as Mazowe and Mashonaland Central.\n\nPolitburo member Cde Kenneth Musanhi said Cde Chimutengwende never missed an opportunity to bring joy to every moment.\n\nHe was amazing. When I last saw him at the National (Sports) Stadium, he humorously recounted his political career using his name.\n\nI thank the party and the President for their prompt response in granting him national hero status. We are mourning, but we need to celebrate the time we spent with him.\n\nWe fasted and prayed for his recovery, but God called him home. He was your son, but he belonged to the whole nation, said Cde Musanhi.\n\nFamily spokesperson, Mr Munyaradzi Nyangoni, expressed gratitude to the President and the party for according their relative national hero status.\n\nWe feel comforted from the time of his illness until his demise. He prioritised the party and spoke fondly of Zanu PF during family times, he said.\n\nMrs Rita Majome described the late hero as a humble man who interacted with everyone in the village.\n\nWe were neighbours in the village, and he contributed immensely to its development. Every time he visited, he would invite everyone to spend time with him, she said.\n\nMourners shared light-hearted moments as they recalled how vibrant Cde Chimutengwende was and how much he loved to dance to rhumba music.\n\nHis body lay in state at Majome Village last night and a church service is lined up today, before the body is taken back to Harare, and lie in state at Charles Gumbo Barracks ahead of a potential triple burial at the National Heroes Acres, alongside Maj-Gen Siziba and Ambassador John Mvundura who was declared yesterday evening.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Gen-Valaerio-Sibanda-680x380.jpg",
            "description": "Fungai Lupande and Columbus Mabika A FULL military parade was held yesterday for National Hero Major-General (Retired) Solomon Siziba at Lookout Masuku Barracks in Bulawayo, while another National Hero, Cde Chenhamo “Chen” Chakezha Chimutengwende’s body was taken to his Chiweshe rural home. Commander Defence Forces, General Philip Valerio Sibanda, was the chief mourner at the […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "First Lady encourages communities to plant trees . . . rallies support for the elderly",
            "url": "https://www.herald.co.zw/first-lady-encourages-communities-to-plant-trees-rallies-support-for-the-elderly/",
            "content": "Tendai Rupapa-Senior Reporter\n\nENVIRONMENT and Wildlife Patron First Lady Dr Auxillia Mnangagwa yesterday took her tree planting initiative, Agric4She and elderly empowerment to Mashonaland West Province where she left the people of Nyamangara Village beaming with delight and created a lasting impression of love, caring for the environment and hard work.\n\nTree planting is important for the environment, wildlife, and human well-being.\n\nThe tree planting season in Zimbabwe runs from the beginning of the rainy season in December until the end of April.\n\nFor many years, alongside the Forestry Commission and the Environmental Management Agency (EMA), Dr Mnangagwa has always been leading from the front in planting trees across the countrys provinces be it in forests, schools, or homesteads.\n\nYesterday, she led in the planting of more than 2 000 trees including gum trees and indigenous trees an initiative that communities, churches, traditional chiefs, and other stakeholders described as beneficial, as they joined her in planting the trees.\n\nThis comes at a time when most places are now bare owing to the rampant burning of forests and wanton cutting down of trees.\n\nMashonaland West Province has many tobacco growers who rely on firewood to cure their crop, hence Amai Mnangagwas call for them to have woodlots and replace trees whenever they cut them for production purposes.\n\nThe mother of the nation took the opportunity to surprise the elderly in that area and paid them surprise visits during which she cleaned their entire houses, swept the compounds, prepared them sumptuous meals, and did their laundry before taking to the fields to plant sweet potatoes and weeding.\n\nEnvironment patron First Lady Dr Auxillia Mnangagwa share a lighter moment with Minister of State and Devolution for Mashonaland West Mariam Chombo, Forestry Commission operations manager Mr Lewis Radzire and other dignitaries during a tree planting programme in Murombedzi yesterday.\n\nThis came as the First Lady forges ahead with her drive to sow the seeds of love and inculcate in people, a sense of responsibility for the elderly.\n\nShe was joined by other women from the community whom she urged to continue with the kind gesture of caring for the vulnerable groups.\n\nThrough her Angel of Hope Foundation, Amai Mnangagwa donated blankets, food hampers, and toiletries to all the elderly she visited.\n\nAs Agric4She patron, she also handed over farming inputs and chemicals to hundreds of women including the elderly.\n\nShe further donated tonnes of rice to the communities.\n\nEnvironment patron First Lady Dr Auxillia Mnangagwa teaches a girl how to plant a tree during a tree planting programme she organised in Murombedzi yesterday.\n\nAddressing the gathering, the First Lady said she had visited the area to spend time with them while teaching each other the importance of tree planting and looking after the elderly.\n\nToday, I have come to be with you ndichitandara nemi tichiita basa tiripamwechete tichidzidzisana kukosha kwezvirongwa zvandauya nazvo. There is a link that connects trees, humans, and wildlife. It is difficult to separate trees from the lives of people. Tree planting can help combat deforestation, soil erosion, and climate change while also providing benefits for people and wildlife, she said.\n\nShe bemoaned the cutting down of trees without re-planting them which she said exposed the country to the effects of climate change, erosion, and depleted forests.\n\nWhenever I travel with my programmes around the country, I am saddened with the way trees are being cut and veld fires. This also removes the natural habitat for wildlife Ndinorwadziwa ndichiona masango ave magwenga.\n\nLet us avoid the cutting down of trees and burning of forests because the law is against this. If you cut for production purposes, please re-plant the trees.\n\nIf we cut down trees and not replace them, how will our future generations know about them? Our forests are essential because they provide a habitat for our animals, she said.\n\nThe First Lady, who has traversed the length and breadth of the country urging communities to plant trees, spelt the need for community leaders to show how important the countrys resources were so that everyone rallied behind them in preserving trees and forests.\n\nShe humbly engaged traditional leaders and asked them what should be done to people who cut down trees.\n\nPeople plant trees during a planting programme led by Environment patron First Lady Dr Auxillia Mnangagwa in Murombedzi yesterday.\n\nOne of the chiefs responded, As traditional chiefs, we are also saddened by this kind of behaviour. Tinoti munhu asingazive pekushandisira demo rake ngaasungwe.\n\nThe First Lady further urged communities to also plant trees at their homesteads especially fruit trees.\n\nWill tourists visit us when our country is bare? These trees dzinopfekedzawo nyika yedu and this will attract tourists. Ndinoda kupa kuridziro kune varikuchera zvicherwa kuti vaite zviripamutemo. Vamwe vanopinda makanzi nevemutemo vasapinde vobva vazodhirikirwa nekuti pasi pazara mvura nekunaya. Even when the rain season is over, let us mine zviripamutemo. Makomba pese pese anoparadza vanhu nezvipfuyo zvichidonheramukati, she said.\n\nShe urged people to be vigilant during this rainy season and avoid crossing flooded rivers and dams.\n\nCommenting on the elderly, the First Lady said she aimed to empower them and show them love.\n\nPeople plant sweet potatoes at the homestead of one of the elderly people in Mashonaland West yesterday.\n\nThey are the fountain of wisdom and the programme is to show them how much we love them. We should always care for them by visiting them and helping them with household chores. Naizvozvo ndinokukurudzirai kuti musare muchizviita, she said.\n\nDr Mnangagwa also tackled social ills and spoke against drug and substance abuse urging communities to work with the police.\n\nShe also called on families to live in peace and harmony.\n\nAmai Mnangagwa also urged people especially women to work hard.\n\nThe last season had a hot dry period which affected some crops that were in the fields. I therefore wish to thank the Lord for giving us the abundant rainfall that we are receiving across the country. Madzimai, ngatipindei mumunda tishande, she said.\n\nMinister of Environment, Climate and Wildlife Dr Sithembiso Nyoni commended the First Lady for her initiatives.\n\nAs we embark on tree planting season every year, we take this as an opportunity to create awareness and remind communities of the pivotal role that they have to play in ensuring that we conserve our trees and forests realising their importance and ensuring that we maintain sustainable livelihoods.\n\nWomen wash clothes and blankets for the elderly at one of the homesteads of the elderly people in Mashonaland West yesterday.\n\nAs we continue the tree-planting blitz today, its important to recognise the significant environmental accomplishments and works that our First Lady has done. She has been a pillar of strength and a source of wisdom in our work, she said.\n\nMashonaland West Minister of State for Provincial Affairs and Devolution, Marian Chombo, also paid glowing tribute to Amai Mnangagwa.\n\nMr Steven Zingwena, who was representing the Acting Director General of the Forestry Commission, commended the First Lady for spearheading the reforestation initiative across the country.\n\nOur patron, the First Lady Dr Auxillia Mnangagwa is very influential in that she has supported tree planting for many years. These tree-planting events are preceded by her campaigns in every season of tree planting.\n\nFirst Lady Dr Auxillia Mnangagwa cooks sadza for the elderly in Mashonaland West yesterday.\n\nShe goes around all the provinces of the country hyping about the forthcoming tree planting season. As we are at Nyamangara village, we have also demonstrated that we are in support of the Presidential Horticulture Recovery Programme, which seeks to distribute ten fruit trees per household.\n\nThe target for this year is 25 million trees. And so far, we have planted around 16 million trees. This is attributed to the awareness campaigns by the First Lady. We are hoping to surpass our target by the end of the season, he said.\n\nThe elderly visited by the First Lady were on cloud nine and thanked her for her love and kindness.\n\nWomen prepare meals for the elderly at one of the homesteads of the elderly where First Lady Dr Auxillia Mnangagwa led the programme in Mashonaland West yesterday.\n\nMy daughter, I am so full of joy. If I did not have poor eyesight, I would have stood up and danced in appreciation of your love and kindness. Coming to visit me here ini hangu chembere yachena musoro from as far as Harare shows great love, said Gogo Netsai Mundendedzi.\n\nFor Gogo Prisca Mutandagayi, it was an honour to be visited by the mother of the nation and sharing a meal with her while sitting in her thatched hut.\n\nWomen wash plates and dishes for the elderly at one of the homesteads in Mashonaland West yesterday.\n\nWhat Amai vedu venyika has done, is so wonderful even in the eyes of God. I am of ill-health and I am not supposed to stay in a dusty environment, but because of sore legs and an aching back, I was living in dirty yet this affected my health. I want to thank Amai Mnangagwa for remembering me, she said.\n\nThe First Lady is leading by example through caring for the elderly, saying it is critical to ensure they are properly looked after and urging communities and churches to allocate themselves time to help with household chores.\n\nFirst Lady Dr Auxillia Mnangagwa and other women weed a maize field at one of the homesteads of the elderly in Mashonaland West yesterday.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/First-Lady1-1-680x380.jpg",
            "description": "Tendai Rupapa-Senior Reporter ENVIRONMENT and Wildlife Patron First Lady Dr Auxillia Mnangagwa yesterday took her tree planting initiative, Agric4She and elderly empowerment to Mashonaland West Province where she left the people of Nyamangara Village beaming with delight and created a lasting impression of love, caring for the environment and hard work. Tree planting is important […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "Zimpapers makes executive appointments",
            "url": "https://www.herald.co.zw/zimpapers-makes-executive-appointments/",
            "content": "Herald Reporter\n\nTHE Zimbabwe Newspapers board of directors has announced the departure of chief executive Mr Pikirayi Deketeke, chief finance officer Mr Farai Matanhire and chief marketing officer Mr Tapuwa Mandimutsira who have all gone on leave while serving their notices of employment termination.\n\nGroup editorial executive Mr William Chikoto has been appointed the acting chief executive, while group financial controller Mrs Annah Kufakunesu has been appointed acting chief finance officer.\n\nZimpapers chairperson Mrs Doreen Sibanda said: We are grateful for the dedication and commitment shown by Mr Deketeke, Mr Matanhire, and Mr Mandimutsira over the years. As they move on to new endeavours, we extend our heartfelt appreciation and best wishes for their future success.\n\nAs we bid farewell to these executives, we are committed to ensuring a smooth transition and continued success under new leadership.\n\nShe said Mr Chikoto was well-positioned to steer Zimpapers through the transition period and its digital transformation due to his extensive experience and deep understanding of the companys business.\n\nOn Mrs Kufakunesu, Mrs Sibanda said she had a wealth of financial expertise and a proven track record of driving financial performance.\n\nWe are confident that her leadership will continue to uphold the high standards of financial management and strategic growth, Mrs Sibanda said.\n\nZimpapers is forging ahead with its digital transformation strategy and expanding its market presence to ensure sustained growth and innovation. Our commitment to leveraging cutting-edge technologies and enhancing customer experiences remains unwavering.\n\nWe are excited about the future prospects and the opportunities that lie ahead. We assure our stakeholders that the company is in capable hands and is poised for continued success.\n\nMr Deketeke was appointed CEO in April 2015 and led the company through numerous milestones, which include diversifying the Zimpapers business from being a purely newspaper publishing and printing company to the integrated media group that it is now.\n\nMr Chikoto has previously served as Editor of The Sunday Mail and Editor of The Herald, two of the groups flagship papers before moving to head office as group editorial executive.\n\nHe is also leading the groups newsroom transformation project, a cornerstone of the digital transformation programme.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/William-Chikoto-680x380.jpg",
            "description": "Herald Reporter THE Zimbabwe Newspapers board of directors has announced the departure of chief executive Mr Pikirayi Deketeke, chief finance officer Mr Farai Matanhire and chief marketing officer Mr Tapuwa Mandimutsira who have all gone on leave while serving their notices of employment termination. Group editorial executive Mr William Chikoto has been appointed the acting […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "Digitisation of Govt arms in full swing",
            "url": "https://www.herald.co.zw/digitisation-of-govt-arms-in-full-swing/",
            "content": "Blessings Chidakwa-Herald Reporter\n\nTHE digitisation of Government departments and agencies, which was proclaimed by President Mnangagwa, is now in full swing with the first batch of rural district councils receiving their ICT gadgets yesterday.\n\nHanding over 415 ICT gadgets to 39 rural councils, Information Communication Technology, Postal and Courier Services Minister Tatenda Mavetera said during the last Cabinet meeting last year, the President directed that the digitisation drive be quickly rolled out.\n\nWe want to thank our visionary leader, President Mnangagwa, who has emphasised that we need to digitalise our Government departments. We realised that the first port of call, especially for the citizens is the councils.\n\nSo, when we did our analysis for us to find out which Government departments need capacitation, we realised that RDCs need great capacitation.\n\nShe said the capacitation of councils remains at the heart of the Presidents vision.\n\nThis is very, very important because we realised that in terms of service delivery, in terms of even their capacity, whatever they need to do will be enhanced very much.\n\nWe are very happy that these 415 computers will go a long way towards capacitating our RDCs, and also for us to be able to attain a digitalised Zimbabwe.\n\nMinister Mavetera said they will take all the necessary steps to equip the councils.\n\nWe need to be able to equip them with the hardware. We have also gone some way in terms of connectivity, high-value connectivity, also increasing the uptime.\n\nSo we have engaged the Ministry of Local Government and said to them, it is quite important for them to also look at initiatives to provide alternative power sources, so that when it comes to connectivity, it is readily available, especially for RDCs.\n\nAccepting the gadgets on behalf of Local Government and Public Works Minister Daniel Garwe, his deputy Benjamin Kabikira said the donation will go a long way in improving efficiency among councils.\n\nDeputy Minister Kabikira said as a ministry, they are happy that the donation of computers will essentially accelerate the modernisation and digitisation agenda in pursuit of Vision 2030 and to be compliant in terms of service delivery by local authorities as outlined in the Call to Action Blueprint.\n\nI am happy to report that your donation has gone a long way in giving wings to our ministrys thrust of accelerating modernising and digitising our operations at all levels, he said.\n\nDeputy Minister Kabikira said Information Communication Technology has become an undoubted pillar of national development, and rural areas must be never left behind in the digital transformation journey.\n\nAssociation of Rural District Councils of Zimbabwe chairman, Dr Aaron Shamu, thanked President Mnangagwa for remembering this third tier of Government with such a good donation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Mavetera-680x380.jpg",
            "description": "Blessings Chidakwa-Herald Reporter THE digitisation of Government departments and agencies, which was proclaimed by President Mnangagwa, is now in full swing with the first batch of rural district councils receiving their ICT gadgets yesterday. Handing over 415 ICT gadgets to 39 rural councils, Information Communication Technology, Postal and Courier Services Minister Tatenda Mavetera said during […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "Tshabangu withdraws appeal",
            "url": "https://www.herald.co.zw/tshabangu-withdraws-appeal/",
            "content": "Yeukai Karengezeka-Court Correspondent\n\nCCC secretary-general Sengezo Tshabangu has formally withdrawn his appeal to the Supreme Court, which sought to challenge a High Court ruling that declared his recent changes to the partys parliamentary leadership unlawful.\n\nThe appeal, co-filed with Nonhlanhla Mlotshwa, named several key respondents, including the CCC acting president Professor Welshman Ncube, Lynette Karenyi, Sessel Zwidzai, Edwin Mushoriwa, and the Speaker of the National Assembly.\n\nThe notice of withdrawal, submitted on January 9, 2025, included an offer to cover costs incurred during the legal proceedings.\n\nThis withdrawal follows a decisive High Court judgment in which Justice Neville Wamambo ruled against Mr Tshabangus unilateral actions to alter the partys parliamentary leadership structure.\n\nThe judgment was handed down in response to an urgent application filed by Professor Ncube, who successfully argued that Mr Tshabangu lacked the authority to reassign Members of Parliament.\n\nProf Ncube maintained that Mr Tshabangus actions constituted covert recalls, a practice explicitly prohibited by a prior High Court ruling.\n\nJustice Wamambo upheld this position, finding that Mr Tshabangus attempt to remove Lynette Karenyi, Sessel Zwidzai, and Edwin Mushoriwa from the Parliamentary Committee on Standing Rules and Orders amounted to recalls both in their substance and legal effect.\n\nThe judge further ruled that Mr Tshabangus appointment of Nonhlanhla Mlotshwa as opposition chief whip was unconstitutional, as the position itself lacks legal recognition under the countrys framework.\n\nMoreover, Mr Tshabangus self-appointment as the overall leader of the opposition in Parliament was deemed a flagrant violation of CCCs internal hierarchy. In granting the interim relief sought by Prof Ncube, Justice Wamambo annulled Mr Tshabangus reshuffle of parliamentary leadership.\n\nThe judge cited an earlier judgment by Justice Tawanda Chitapi, which had explicitly barred Tshabangu from initiating recalls pending the resolution of the primary legal dispute surrounding his authority.\n\nJustice Wamambo remarked: Further, the reshuffle in this case amounts to a recall both literally and at law. I also find that the position of chief whip is not sanctioned by the constitution and is thus unlawful. The removal of members from the CSRO and their replacement amounts to a recall. Effectively, the first respondent disobeyed the order rendered in HH 652/23. In light of these circumstances, I find that the application is meritorious and should be granted.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Sengezo-Tshabangu-1-680x380.jpg",
            "description": "Yeukai Karengezeka-Court Correspondent CCC secretary-general Sengezo Tshabangu has formally withdrawn his appeal to the Supreme Court, which sought to challenge a High Court ruling that declared his recent changes to the party’s parliamentary leadership unlawful. The appeal, co-filed with Nonhlanhla Mlotshwa, named several key respondents, including the CCC acting president Professor Welshman Ncube, Lynette Karenyi, […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        },
        {
            "title": "Editorial Comment: Corruption must be eliminated at all levels",
            "url": "https://www.herald.co.zw/editorial-comment-corruption-must-be-eliminated-at-all-levels/",
            "content": "WHILE the major cases of corruption have tended to make the headlines, the culture of corruption now being tackled effectively in Zimbabwe has been carried across a slew of amounts from a few dollars up to the headline grabbing millions.\n\nThe determination to investigate and prosecute all involved, regardless of whether they are a big shot or just a small shark, by the police, the Zimbabwe Anti-Corruption Commission and the Prosecutor General, shows that we are not tolerating or excusing any corruption.\n\nThis sort of attitude is needed as we continue clearing out the criminals and stop their crimes slowing Zimbabwes growth.\n\nSometimes an investigation just requires careful checking and some sort of audit process, that allows the honest to be ticked off the lists and the suspiciously dishonest invited to explain just what they are doing. Sometimes they can even be caught red-handed.\n\nOne exercise in progress is auditing the duty free import of personal motor vehicles by long-service civil servants below the top management ranks. The scheme has already been highlighted as helping to retain well-qualified and hard working civil servants and so has been considered a success.\n\nZimra has been checking up on the cars and while the honest majority have sighed and driven their cars up to a Zimra officer to be checked out, we have already seen those who probably sold them directly or indirectly being uncovered.\n\nAs the check is remarkably simple, just a look at the car with the owner standing by, all fiddles will be uncovered.\n\nAs with all schemes meant to help employees in both the private and public sectors, there have been those wanting to abuse the system or latch on to it to further other crimes.\n\nSome civil servants went through the application process, but then for a price allowed a dealer or someone else to import the vehicle under their names.\n\nThis particular fiddle also saw civil servants selling the vehicle before the minimum holding time was reached if they wished to retain the duty rebate.\n\nThen there were those who went commercial over the corruption, with one woman from Zimra using her boss electronic signature to sign off on more than 400 fake rebate letters, generally held by car dealers.\n\nWhile she has wisely gone to ground, probably in a foreign country, already assets in this country have been frozen so that eventually she will not profit.\n\nThis sort of bulk order corruption and forgery explains why some authorities suspect there could be as many as 3 000 cars and pick-ups that escaped duty illegally, although far fewer civil servants were involved.\n\nIn some cases importers were not even civil servants, just people outside Government service who held fake documents, and in other cases there have been civil servants startled to find they are on some list of importers when they never applied for the benefit, but whose identities were in effect stolen by criminals.\n\nSo the investigation has had many facets, but in the end those who may have acted corruptly and those who were outside criminals will all be accounted for and in the end Zimra will get the duty money, and the guilty will lose their cars.\n\nBoth sources will help the Government find the money for important projects.\n\nThe main point is that the investigations and prosecutions are shielding no one.\n\nProsecutor-General Justice Loice Mutanda-Moyo wryly noted that she and her office are certainly not going to shield civil servants as some have speculated. There are already six prosecutors on trial for bribe taking, so no one is being spared.\n\nThe culture of corruption, and the assumption that it is possible to get favours for bribes, has seen some other types of con-artist at work.\n\nThere is now a man in court accused of conning a number of people out of US$2 855. He was seeking low-level bribes, generally US$20 a shot, to guarantee employment by Harare City Council in a low level job of a named person.\n\nThere were people intending to help relatives and prepared to spend US$100 to have five listed, but part of the success of this low-level con artist was his cheapness, which meant people did not perform the sort of checks they might well have thought prudent for more expensive schemes.\n\nIn the end, the conned people found out there were no jobs to start with, and that the conman was not connected to the council.\n\nBut the corruption culture meant that those paying off the conman thought that paying what they must have known were illegal fees was just part of life, and that is sad.\n\nWe have seen over the decades similar con-schemes, especially around the civil registry offices, where smooth-talking touts take a small bribe and vanish, although some, once they have a willing payer, may ask for a top-up because they have to pay off a second registry clerk.\n\nAs people start realising that corruption is being tackled effectively we hope that these sort of attempts, to collect a bribe for a service that does not even exist, will be rejected.\n\nMeanwhile, some Government offices, like Zimra tax offices, the civil registries and the central vehicle registry, will need to retain their public notices that they do not employ agents wandering around outside and their clients and customers need to talk to regular officers inside.\n\nChecks are always important and most legitimate civil service offices and private businesses welcome such checks, especially if they can then have yet another conman arrested.\n\nThose who think they are benefiting from someone elses corruption need to think seriously since they are either being conned, or are being sucked into a deal that will see them join the con person in the dock.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/12/Untitled-32.aevev_.jpg",
            "description": "WHILE the major cases of corruption have tended to make the headlines, the culture of corruption now being tackled effectively in Zimbabwe has been carried across a slew of amounts from a few dollars up to the headline grabbing millions. The determination to investigate and prosecute all involved, regardless of whether they are a big […]",
            "time": "06:08",
            "date": "21 Jan 2025"
        }
    ]
}