{
    "news": [
        {
            "title": "Blitz on smuggling continues",
            "url": "https://www.herald.co.zw/blitz-on-smuggling-continues/",
            "content": "Walter Nyamukondiwa\n\nMashonaland West Bureau Chief\n\nThe inter-ministerial taskforce against smuggling of goods and illicit imports is continuing with its crackdown on undeclared or under-declared goods along the Harare-Chirundu Highway.\n\nSeveral buses are being stopped at roadblocks along the Chirundu-Chinhoyi Highway and commandeered to the Zimra provincial offices in Chinhoyi where they are being subjected to rigorous searches.\n\nAt least four cross-border buses were parked at the offices this afternoon as Zimra officials and other agencies conducted checks to see if all items had been declared.\n\nSources said the crackdown has been relentless over the past two months.\n\nThis is now an everyday occurrence where buses park in front of the Zimra offices and all goods are offloaded. They inspect item by item with those who have not declared or under-declared paying duty and a fine, said a trader operating near the Zimra offices.\n\nObservers have noted that the number of cross-border buses has not reduced and people continue with their business.\n\nI think the people are still making money despite the crackdown, otherwise the number of traders should have declined or others would have stopped altogether, said an observer.\n\nIt means they still register a profit even after paying duty.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Smuggled-goods-680x380.jpg",
            "description": "Walter Nyamukondiwa Mashonaland West Bureau Chief The inter-ministerial taskforce against smuggling of goods and illicit imports is continuing with its crackdown on undeclared or under-declared goods along the Harare-Chirundu Highway. Several buses are being stopped at roadblocks along the Chirundu-Chinhoyi Highway and commandeered to the Zimra provincial offices in Chinhoyi where they are being subjected […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Inter-Tropical Convergence Zone continues to influence rain",
            "url": "https://www.herald.co.zw/inter-tropical-convergence-zone-continues-to-influence-rain/",
            "content": "Precious Manomano\n\nHerald Reporter\n\nThe Inter-Tropical Convergence Zone (ITCZ) is continuing to trigger scattered thunderstorms across Zimbabwe, resulting in particularly heavy rainfall in the Mashonaland and Matabeleland North provinces.\n\nThe Meteorological Services Department (MSD) said that significant rainfall was recorded, in Bindura (109 mm), Henderson (95 mm), Binga (59 mm), Chinhoyi (43 mm), Kariba (37 mm), Gokwe (33 mm), and Victoria Falls (30 mm).\n\nOn Wednesday, the weather in Masvingo, Matabeleland South, and southern Manicaland was characterised by cloudy skies and cool temperatures, accompanied by patchy morning drizzle and isolated afternoon showers.\n\nOther regions of the country experienced mostly cloudy conditions, with scattered thunderstorms expected in the evening.\n\nLooking ahead, a low-pressure system near Beira is likely to keep the ITCZ stationary over the northernmost regions in the country, which will sustain thunderstorm activity in these areas throughout the forecast period.\n\nAt the same time, a middle-level anticyclonic circulation is anticipated to gradually dry the atmosphere from the south, leading to a reduction in rainfall activity across southern parts of the country.\n\nThis dynamic weather pattern highlights the contrasting conditions that different regions of the country will experience in the coming days.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/The-Meteorological-Services-Department.jpg",
            "description": "Precious Manomano Herald Reporter The Inter-Tropical Convergence Zone (ITCZ) is continuing to trigger scattered thunderstorms across Zimbabwe, resulting in particularly heavy rainfall in the Mashonaland and Matabeleland North provinces. The Meteorological Services Department (MSD) said that significant rainfall was recorded, in Bindura (109 mm), Henderson (95 mm), Binga (59 mm), Chinhoyi (43 mm), Kariba (37 […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Seven suspected armed robbers in court for over US$14k theft",
            "url": "https://www.herald.co.zw/seven-suspected-armed-robbers-in-court-for-over-us14k-theft/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nSEVEN suspected armed robbers who were targeting companies in Harare appeared in court on Wednesday facing three counts of armed robbery.\n\nTinashe Rodgers Magreen (37) Tinashe Thompson (30), Willton Masvosva (35), Tapiwanashe Bakasa (30), Peter Mahwite (49), Anymore Gatsi (38) and Tatenda Mashayamombe (29) appeared before Harare magistrate Tilda Mazhande who remanded them in custody to February 10.\n\nHe advised them to approach High Court for bail. The court heard that on January 16 this year, the armed robbers went to Chains company located at Number 73 Plymouth Road, Southerton, Harare.\n\nThey approached a security guard while armed with knives and iron bars and tied his hands and legs using a wire.\n\nThe court heard that the armed robbers searched him and stole a small G-Tech cellphone, US$60-00 cash and his identity documents.\n\nThey then broke into the offices and searched for valuables but they failed to find anything and they left the scene.\n\nOn January 20, the armed robbers allegedly went to AMPS Engineering at number 379 Limpopo Way, Southerton, Harare and approached Boas Chitsvaira, a security guard manning the premises.\n\nThey handcuffed his hands and also tied his legs with a wire and one of the robbers remained guarding him.\n\nThe court heard that the suspected robbers stole US$5 from an employee Mafukeni Masaisai andproceeded to break into the accounts office.\n\nIt is alleged that they attempted to blast a safe but they failed forcing them to load the safe containing US$12 000 in a Nissan NP300 which was parked at the front office.\n\nIt is the States case that the accused also stole a DVR and an HP laptop from the front office before they drove away.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Prosper Dembedza Herald Correspondent SEVEN suspected armed robbers who were targeting companies in Harare appeared in court on Wednesday facing three counts of armed robbery. Tinashe Rodgers Magreen (37) Tinashe Thompson (30), Willton Masvosva (35),  Tapiwanashe Bakasa (30), Peter Mahwite (49), Anymore Gatsi (38) and Tatenda Mashayamombe (29) appeared before Harare magistrate Tilda Mazhande who […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Nurses urged to have valid tax clearances",
            "url": "https://www.herald.co.zw/nurses-urged-to-have-valid-tax-clearances/",
            "content": "Anesu January\n\nThe Herald Correspondent\n\nThe Nurses Council of Zimbabwe has directed that all nurses should present valid tax clearances from the Zimbabwe Revenue Authority as part of their registration and renewal requirements.\n\nIn a statement issued on Tuesday the Nurses Council of Zimbabwe said: In line with the requirements of Public Notice 92 of 2024, all Nurses are to produce a valid Tax clearance as part of the registration and renewal requirements.\n\nAll health institutions and organisations are hereby required to submit a list of their ZIMRA tax-cleared personnel to the Nurses Council of Zimbabwe (NCZ).\n\nThis comes after the Zimbabwe Revenue Authority encouraged all professional in health institutions to ensure compliance with this new requirement to avoid disruption to their practices.\n\nThe tax clearance requirement is a strategy to ensure healthcare professionals contribute to the national revenue system.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Nurses-Council-of-Zimbabwe-680x380.jpg",
            "description": "Anesu January The Herald Correspondent The Nurses Council of Zimbabwe has directed that all nurses should present valid tax clearances from the Zimbabwe Revenue Authority as part of their registration and renewal requirements. In a statement issued on Tuesday the Nurses Council of Zimbabwe said: “In line with the requirements of Public Notice 92 of […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Shurugwi police arrest notorious thief",
            "url": "https://www.herald.co.zw/shurugwi-police-arrest-notorious-thief/",
            "content": "Midlands Bureau\n\nPolice in Shurugwi have arrested a 21-year-old man for a spate of unlawful entry and theft cases committed around the mining town.\n\nMidlands provincial police spokesperson Inspector Emmanuel Mahoko confirmed the arrest of Panashe Dera of Matamba Village, Shurugwi, on Monday at around 3:30 am.\n\nHe said the arrest was made following investigations of a fresh report of unlawful entry and theft case by Blessing Mandishona of Ironsides, Shurugwi.\n\nInvestigations led police officers to Melita Building where they bumped into the suspect, Panashe Dera, with a stolen cell phone, he said.\n\nThey arrested him and recovered Mandishonas phones.\n\nInspector Mahoko said further interviews led to the recovery of several phones from Deras girlfriend, Jani Gavi.\n\nFurther investigations are ongoing and the suspect has since been linked to at least 16 cases. He is set to appear in court for trial, he said.\n\nInspector Mahoko called on people in and around Shurugwi who might have fallen victim to unlawful entry and theft incidents to visit Shurugwi Police Station to help identify recovered items.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/mahoko.jpg",
            "description": "Midlands Bureau Police in Shurugwi have arrested a 21-year-old man for a spate of unlawful entry and theft cases committed around the mining town. Midlands provincial police spokesperson Inspector Emmanuel Mahoko confirmed the arrest of Panashe Dera of Matamba Village, Shurugwi, on Monday at around 3:30 am. He said the arrest was made following investigations […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Cde Mupamhanga declared National Hero",
            "url": "https://www.herald.co.zw/cde-mupamhanga-declared-national-hero/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nPresident Mnangagwa has accorded National Hero status to former Deputy Chief Secretary in the Office of the President and Cabinet Cde Justin Mupamhanga, Vice President Dr Constantino Chiwenga has said.\n\nThe Vice President announced the Presidents decision in his condolence message following the death of Cde Mupamhanga.\n\nI learnt with a deep sense of grief and sadness of the passing on at Arundel Clinic this morning of Cde Justin Mupamhanga after a brave fight against diabetes and high blood pressure, he said.\n\nIn recognition of his distinguished role in the struggle for Independence and in the development of our nation, especially in laying the foundations and growing the agriculture and energy sectors, His Excellency President Dr ED Mnangagwa, in consultation with the Politburo, has directed that he be accorded National Hero status.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/03/2803-1-1-JUSTIN-MUPAMHANGA.jpg",
            "description": "Mukudzei Chingwere Herald Reporter President Mnangagwa has accorded National Hero status to former Deputy Chief Secretary in the Office of the President and Cabinet Cde Justin Mupamhanga, Vice President Dr Constantino Chiwenga has said. The Vice President announced the President’s decision in his condolence message following the death of Cde Mupamhanga. “I learnt with a […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Air Ambulance rushes to rescue injured miner in Kadoma",
            "url": "https://www.herald.co.zw/air-ambulance-rushes-to-rescue-injured-miner-in-kadoma/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nA Government-sponsored air ambulance has arrived at Kadoma General Hospital to evacuate a miner who suffered severe injuries when a mine shaft collapsed.\n\nThe incident occurred when one side of the mine caved in, hitting the miners stomach and causing severe injuries.\n\nThe air ambulance, which departed from Charles Prince Airport at 2:34 pm, arrived in Kadoma at 3:11 pm, just 37 minutes later.\n\nOn board the aircraft are two medical practitioners and two captains who are now preparing to transport the injured miner to Sally Mugabe Referral Hospital for further treatment.\n\nMeanwhile, another air ambulance from the same fleet was dispatched to Chegutu, where it evacuated a woman in labour and transported her to Chinhoyi Hospital for medical attention.\n\nThe air ambulance service is one of the Second Republics milestones.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-21-680x380.png",
            "description": "Trust Freddy Herald Correspondent A Government-sponsored air ambulance has arrived at Kadoma General Hospital to evacuate a miner who suffered severe injuries when a mine shaft collapsed.   The incident occurred when one side of the mine caved in, hitting the miner’s stomach and causing severe injuries. The air ambulance, which departed from Charles Prince […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Man masquerades as Zanu PF Central Committee, gets away with US$10 000",
            "url": "https://www.herald.co.zw/man-masquerades-as-zanu-pf-central-committee-gets-away-with-us10-000/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA suspected fraudster who masqueraded as a Zanu PF Central Committee member has appeared in court on allegations of defrauding a businessman of US$10 000 under the pretext that he could facilitate the release of his goods that had been confiscated by the Zimbabwe Revenue Authority.\n\nWilbert Nyarugwe (44) was facing fraud charges when he appeared before Harare magistrate Ms Tilda Mazhande.\n\nHe was remanded in custody to Thursday for bail application.\n\nThe complainant is Mr Douglas Muraza.\n\nIt is alleged that sometime in September last year, Mr Muraza and his wife were introduced to Nyarugwe by their friend, Kelvin Maponga.\n\nNyarungwe told the couple that he was a Zanu PF Central Committee member and referred to himself as Honourable Nyarugwe.\n\nOn October 3 last year, Mr Murazas bus was impounded by Zimra in Masvingo for carrying smuggled goods.\n\nThe court heard that Nyarugwe heard about it and offered to facilitate the release of the bus and the goods.\n\nNyarugwe claimed to have good relations with Zimra Commissioner General, Mrs Regina Chinamasa. He said he would engage her so that she could assist in the matter.\n\nOn October 6, Nyarugwe told Mr Muraza that Mrs Chinamasa had requested for US$ 10 000 to release the bus and goods.\n\nMr Muraza gave his wife the money to hand over to Nyarugwe.\n\nA few days later, Nyarugwe asked Mr Muraza to go with him to Zimras offices in Masvingo to follow up on the release of the bus and goods.\n\nThe court heard that Nyarungwe introduced himself as a Zanu PF Central Committee member to Mr William Murashwa Gadzikwa, Zimra Masvingos Technical Services Manager. He informed him that he had come to check on the seized goods.\n\nNyarugwe was advised that they were still waiting for some report before they could compile the release terms.\n\nOn October 24 , Mr Muraza received an email from Zimra stating that he was supposed to pay ZWG 893,529.59 duty, a fine equivalent to the duty, interest and storage fees.\n\nMr Muraza immediately contacted Nyarugwe over the issue. The court heard that Nyarugwe claimed that he had given Mr Murazas money to Mrs Chinamasa but promised to reimburse it.\n\nNyarugwe then became evasive and has not reimbursed the money.\n\nInvestigations revealed that Nyarugwe was not in any way connected to the Zimra Commissioner General and does not know her personally.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Screenshot-20-680x380.png",
            "description": "Prosper Dembedza Herald Correspondent A suspected fraudster who masqueraded as a Zanu PF Central Committee member has appeared in court on allegations of defrauding a businessman of US$10 000 under the pretext that he could facilitate the release of his goods that had been confiscated by the Zimbabwe Revenue Authority. Wilbert Nyarugwe (44) was facing […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Dr Moyo appointed MMCZ general manager",
            "url": "https://www.herald.co.zw/dr-moyo-appointed-mmcz-general-manager/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nThe Minerals Marketing Corporation of Zimbabwe (MMCZ) has appointed Dr Nomusa Jane Moyo as its new general manager.\n\nThe appointment is set to redefine the leadership landscape in Zimbabwes mining sector.\n\nDr Moyo, who has been acting general manager since July 2023, brings extensive experience and a proven track record of success to the role.\n\nUnder her interim leadership in 2024, MMCZ achieved significant milestones, including a 21 percent surge in mineral sales, with 3,9 million tonnes sold, compared to 3,2 million the previous year.\n\nHer strategic efforts also saw the expansion of export markets to new destinations such as Australia, China, Colombia, Burundi and India.\n\nShe led initiatives to curb mineral leakages by equipping local laboratories with state-of-the-art technology and promoted value addition and beneficiation through the establishment of a gemstone cutting and polishing training centre at the Zimbabwe School of Mines.\n\nDr Moyos career spans 24 years in public entities, including eight years with the Zimbabwe Revenue Authority, one year with the Grain Marketing Board, and over 14 years with MMCZ, where she joined in December 2009.\n\nHer impressive qualifications include a Doctorate in Laws specialising in corporate governance, Masters and Bachelor of Laws, a BSc Honours in Economics and Full CIS certification.\n\nShe is also a member of the Law Society of Zimbabwe and the Chartered Governance and Accountancy Institute of Zimbabwe.\n\nThe MMCZ board, led by chairman Mr Jemister Chininga, expressed confidence in Dr Moyos ability to lead the corporation towards continued growth and success.\n\nHer appointment is seen as a strategic move to maximise returns for stakeholders, foster partnerships and strengthen Zimbabwes position in the global minerals market.\n\nDr Moyos leadership marks the beginning of a transformative era for MMCZ, with her expertise expected to drive innovation, enhance operational efficiency and unlock new opportunities in the minerals sector.\n\nAs the exclusive agent for marketing and selling all minerals produced in Zimbabwe, except gold and silver, MMCZ plays a critical role in the countrys economic development.\n\nWith Dr Moyo at the helm, the corporation is poised for a dynamic and prosperous future.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2018/08/Minerals-Marketing-Corporation-of-Zimbabwe.jpg",
            "description": "Ivan Zhakata Herald Correspondent The Minerals Marketing Corporation of Zimbabwe (MMCZ) has appointed Dr Nomusa Jane Moyo as its new general manager. The appointment is set to redefine the leadership landscape in Zimbabwe’s mining sector. Dr Moyo, who has been acting general manager since July 2023, brings extensive experience and a proven track record of […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        },
        {
            "title": "Corruption is betraying liberation ethos: Acting President Chiwenga",
            "url": "https://www.herald.co.zw/corruption-is-betraying-liberation-ethos-acting-president-chiwenga/",
            "content": "Mukudzei Chingwere\n\nHerald Reporter\n\nActing President Dr Constantino Chiwenga has condemned corruption and unethical business practices, asserting that such actions threaten the foundational ideals of Zimbabwes liberation struggle.\n\nDr Chiwenga was speaking while presiding over the burial of national heroes Major General (Rtd) Solomon Siziba, Cde Chenhamo Chen Chakezha Chimutengwende and Ambassador John Shumba Mvundura at the National Heroes Acre in Harare this morning.\n\nVice President Kembo Mohadi and other senior Government officials also attended the burial of the three national heroes.\n\nUnder the Second Republic, Zimbabwe is working towards achieving an upper-middle income economy by 2030, with several capital and infrastructure projects taking shape or already completed.\n\nIt is through the selfless sacrifices and dedication of the late three gallant sons of the soil that we are laying to rest today, as well as many other departed and living cadres, that Zimbabwe continues to enjoy its sovereignty, said the Dr Chiwenga.\n\nWe can only realise our vision of attaining an empowered and prosperous upper middle-income society by guarding against all forms of actions that undermine the national interest.\n\nAt the forefront is corruption and all forms of related unethical and selfish conduct in small, medium or large economic units.\n\nAny shady dealing and acts of deceit undermine what these gallant national heroes sacrificed for, said the Acting President.\n\nThe triple heroes burial was the third ever in Zimbabwes history.\n\nSuch an occasion first took place on January 26, 2021, when Lieutenant General (Rtd) Dr Sibusiso Busi Moyo, Dr Joel Biggie Matiza, and Major General (Rtd) Paradzai Zimondi were laid to rest on the same day.\n\nThe second occasion was on April 29 last year when Cde Nash Nyasha Dzimiri, Brigadier General Shadreck Vezha and Cde Tsitsi Grace Jadagu were buried at the national shrine.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/vice-1-680x380.jpg",
            "description": "Mukudzei Chingwere Herald Reporter Acting President Dr Constantino Chiwenga has condemned corruption and unethical business practices, asserting that such actions threaten the foundational ideals of Zimbabwe’s liberation struggle. Dr Chiwenga was speaking while presiding over the burial of national heroes Major General (Rtd) Solomon Siziba, Cde Chenhamo ‘Chen’ Chakezha Chimutengwende and Ambassador John Shumba Mvundura […]",
            "time": "20:40",
            "date": "22 Jan 2025"
        }
    ]
}