{
    "news": [
        {
            "title": "President delivers on promise. . . Unveils Youth Empowerment Scheme today",
            "url": "https://www.herald.co.zw/president-delivers-on-promise-unveils-youth-empowerment-scheme-today/",
            "content": "Wallace Ruzvidzo\n\nHerald Reporter\n\nPRESIDENT Mnangagwa will today launch the Youth Empowerment Scheme, which will provide Zimbabwean youths with access to funding, including mining and farming equipment.\n\nThe initiative seeks to support young entrepreneurs and farmers, helping them to drive economic growth and development.\n\nAfrica has the worlds youngest population, with a significant portion under 25,and this youth demographic is projected to grow substantially, presenting both opportunities and challenges for the continents future.\n\nBy 2030, young Africans are projected to constitute 42 percent of the worlds youth population, with Africas youth population expected to reach nearly 1.3 billion, representing a 42 percent increase from current levels.\n\nYouth Empowerment, Development and Vocational Training Minister Tino Machakaire yesterday told The Herald that after todays launch, the countrys youth demographic will have a plethora of opportunities to take advantage of, under the youth-tailored programme.\n\nHis Excellency, the President Cde Dr ED Mnangagwa will be launching a youth empowerment scheme. The scheme involves funding, farm mechanisation, as well as mining equipment among other youth empowerment initiatives.\n\nWe are anticipating a gathering of 5 000 youths mobilised from across all the 10 provinces and the venue is HICC, he said.\n\nPresident Mnangagwa has continued to underline the youths critical role in the countrys economic development and as Zimbabwes vanguard.\n\nTowards this end, since the coming in of the Second Republic, various youth-centred initiatives have been rolled out, enabling the youth to actively participate in the countrys economic turnaround.\n\nWe, the older generation played our part to bring about independence, freedom and peace. The ball is now in your court. You must deliver. In unity, the youth of Africa can do more for the realisation of the Africa we want and deserve, he said.\n\nPresident Mnangagwa said the Second Republic had demonstrated its unwavering commitment to empowering young people through the deliberate and bold placement of youth in key leadership and decision making positions.\n\nThis includes Government Ministries, Departments and Agencies, in Parliament as well as other strategic institutions, such as boards of parastatals and advisory councils among others.\n\nIn view of these achievements, I challenge the people deployed in various leadership positions to continue displaying principles of servant leadership and discipline, while at the same time galvanising the youth to fully participate in the socio economic and cultural affairs of the country, said the President at last months National Youth Day celebrations held in Bulawayo.\n\nTodays launch of the Youth Fund is expected to be attended by investors from Asia, who are keen on investing in the country and creating jobs for the youth.\n\nInvited by Special Presidential Investment Advisor to the United Arab Emirates Dr Paul Tungwarara, four business tycoons, with a combined net worth of nearly US$500 million, will be at the launch.\n\nThe investors are looking for opportunities to drive the countrys economic growth across multiple sectors, including education, renewable energy, and healthcare.\n\nAmong the investors are Dr Ajeenkya Patil, Mr Rajat Verma and Mr Ravi Reddy, renowned multimillionaires from India, as well as Mr Lalu Samuel, a prominent millionaire from the United Arab Emirates.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/qewfqefqf-680x380.jpg",
            "description": "Wallace Ruzvidzo Herald Reporter PRESIDENT Mnangagwa will today launch the Youth Empowerment Scheme, which will provide Zimbabwean youths with access to funding, including mining and farming equipment. The initiative seeks to support young entrepreneurs and farmers, helping them to drive economic growth and development. Africa has the world’s youngest population, with a significant portion under […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "Ignore  Geza’s ‘delusional rumblings’, nation told",
            "url": "https://www.herald.co.zw/ignore-gezas-delusional-rumblings-nation-told/",
            "content": "Herald Reporter\n\nThe nation shouldcontinue ignoring the delusional rumblings being made by former Zanu PF member, Mr Blessed Geza, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said last night.\n\nGeza, who was expelled from the ruling party for attempting to undermine the party and committing acts deemed treasonous, continues to make utterances dismissed as misdirected by the Government.\n\nIn a statement, Dr Muswere said no amount of wanton ranting would cause despondency in the country.\n\nZimbabweans are encouraged to continue ignoring Gezas delusional rumblings.\n\nHis polemic and reactionary grandstanding is a clear misdirection of ambition, said Dr Muswere.\n\nGeza is a divisionalist and factionalist hell-bent on sowing seeds of division, but all his efforts will not bear fruit.\n\nHe is a fugitive from justice and it will not be long before his inflammatory statements are dealt with.\n\nDr Muswere dismissed him asa self-serving individual, falsely claiming to speak on behalf of the war veterans, and his rants are nothing but hallucinations.\n\nHe said Geza has no moral or legal authority to speak on behalf of anyone, or make corruption allegations, as the Second Republic led by President Mnangagwa has zero tolerance to corruption.\n\nGeza and his partners in crime cannot rewrite Zimbabwes history, he said.\n\nAll his efforts to divide the ruling Zanu PF and country at large, said the Minister, would not bear fruit.\n\nNo iota of imagination will create disunity within the leadership. The leadership remains united and the party Zanu PF remains united, he said.\n\nLaw enforcement agents are on high alert, ready to deal with anyone attempting to cause despondency in the country, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/FQF23DF-680x380.jpg",
            "description": "Herald Reporter The nation should  continue ignoring the “delusional rumblings” being made by former Zanu PF member, Mr Blessed Geza, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, said last night. Geza, who was expelled from the ruling party for attempting to undermine the party and committing acts deemed treasonous, continues to make utterances […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "Zimparks kills two jumbos",
            "url": "https://www.herald.co.zw/zimparks-kills-two-jumbos/",
            "content": "Thupeyo Muleya\n\nBeitbridge Bureau\n\nZimbabwe National Parks and Wildlife Management Authority (ZimParks) rangers have shot dead two elephants in Beitbridge as part of efforts to control a herd that has been destroying crops and posing a threat to villagers in the district over the past few weeks.\n\nThe affected communities are primarily located near major water bodies, including the Uzingwane, Limpopo, Bubi, and Mutetenwa rivers. The elephants, concentrated in the Zimbabwean component of the Greater Mapungubwe and Greater Limpopo Transfrontier Conservation Areas (TFCAs), have not only destroyed crops but also endangered villagers, many of whom are now afraid to move around at night.\n\nZimParks spokesperson, Mr Tinashe Farawo, confirmed that teams were dispatched to assess the situation and take necessary action.\n\nSo far, we have shot and killed two elephants in the Mutetenwa area of Beitbridge to control the herd that had been camped there for several days. Our teams will remain on the ground to monitor the situation in all hotspot areas where these elephants are commonly seen during this time of the year, said Mr Farawo.\n\nHe added that ZimParks is conducting continuous campaigns to minimise human-wildlife conflicts.\n\nOur animals are overpopulated, and we must find ways to coexist while saving lives. We advise people in hotspot areas to avoid moving at night where possible. If they encounter elephants or other dangerous animals, they should give them space and immediately notify rangers in their respective areas, Mr Farawo said.\n\nMr Jahson Mugodzwa, the Beitbridge Civil Protection Committee focal person, confirmed the ongoing issues, saying the committee had alerted both the Beitbridge Rural District Council (RDC) and ZimParks officials.\n\nWe have received distress calls from villagers in Mzingwane, where elephants have destroyed several crop fields. Another herd is camped in Mutetenwa, and villagers are living in fear for their safety. As the Civil Protection Committee, we have informed the relevant departments who are already on the ground addressing the matter, said Mr Mugodzwa.\n\nHe added that five teams of stakeholders dealing with wildlife have been deployed across the district to manage the situation.\n\nElephants have become a recurring threat to crops and villagers, particularly those living near water bodies such as the Shashe, Mzingwane, Bubi, and Limpopo rivers.\n\nIn separate interviews, villagers from the affected areas praised the local civil protection committee for its swift response in dispersing the wild animals.\n\nWe are relieved as villagers because we were living in fear of being attacked by the elephants. Many have lost crops in their communal fields, leaving them vulnerable, said Miss Remeketsi Mbedzi, a villager from Malala.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/01/images-1.jpg",
            "description": "Thupeyo Muleya Beitbridge Bureau Zimbabwe National Parks and Wildlife Management Authority (ZimParks) rangers have shot dead two elephants in Beitbridge as part of efforts to control a herd that has been destroying crops and posing a threat to villagers in the district over the past few weeks. The affected communities are primarily located near major […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "India, Zimbabwe reaffirm bond through education,  technology",
            "url": "https://www.herald.co.zw/india-zimbabwe-reaffirm-bond-through-education-technology/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZimbabwe and India have reaffirmed their commitment to strengthening bilateral relations through education, technology and trade.\n\nYesterday Zimbabwe joined Indian at its Indian Technical and Economic Cooperation (ITEC) Day celebrations in Harare, an event that brought together ITEC alumni, Government officials and business leaders to recognize the programme s impact on capacity building and national development.\n\nSpeaking at the event, Indian Ambassador to Zimbabwe Bramha Kumar said the two countries were deepening cooperation particularly in education and skills development.\n\nThe ITEC programme is one of Indias most successful capacity-building initiatives, benefiting over 150 countries, including Zimbabwe, said Ambassador Kumar.\n\nWe are pleased to see increasing participation, with 209 Zimbabwean professionals utilising ITEC courses this year, up from 150 last year.\n\nThe programme, which has been running since 1985, offers Zimbabwe 217 training slots annually in various fields, including agriculture, health, education, energy and defence.\n\nAmbassador Kumar said the growing engagement reflected the strong ties between the two nations.\n\nOur relationship is built on a shared history, mutual respect, and South-South cooperation. India is committed to supporting Zimbabwe in its journey towards economic growth and self-reliance, he said.\n\nBeyond education, India has made significant investments in Zimbabwes infrastructure and trade.\n\nIndian businesses have invested US$600 million in sectors such as mining, textiles, food processing and agriculture, creating 15 000 jobs.\n\nAdditionally, 17 Indo-Zim Technology Centres established in 2008 were recently upgraded with state-of-the-art CNC machines to enhance Zimbabwes technical education.\n\nOn defence cooperation, Ambassador Kumar said a recent Memorandum of Understanding (MoU) signed at AERO India 2025 marked a milestone in military collaboration.\n\nDeputy Minister of Foreign Affairs and International Trade Sheillah Chikomo expressed Zimbabwes gratitude for Indias long-standing support particularly in education and skills training.\n\nThe ITEC programme aligns perfectly with our national vision to enhance education, technical expertise and global competitiveness, she said.We are grateful for the 270 annual scholarships India offers Zimbabwe, as well as the 56 fully funded postgraduate courses under the Indian Council for Cultural Relations (ICCR).\n\nShe said Zimbabwe and India signed an MoU at the Central University of Technology and Management (Odisha), which has already seen 71 Zimbabwean professionals admitted for specialised training in fields such as engineering, agriculture and technology.\n\nFurther collaboration has been established with Indias National Forensic Science University, where Zimbabwean professionals are receiving training in cybersecurity, forensic psychology and DNA testing.\n\nZimbabwe aspires to be a knowledge-driven society under Vision 2030. Indias support in modern technical training and skill development is playing a crucial role in achieving this goal, Deputy minister Chikomo said.\n\nIndia and Zimbabwe share centuries-old ties, dating back to the 14th and 15th centuries. India also played a crucial role in supporting Zimbabwes liberation struggle, and this partnership has since evolved into structured cooperation in trade, investment, and education.\n\nAmbassador Kumar reaffirmed Indias philosophy of Vasudhaiva Kutumbakammeaning The World is One Familyas the guiding principle behind its engagement with Zimbabwe. As India continues to expand its footprint in Zimbabwe through education, investment and technological collaboration, both nations are set to benefit from stronger economic and people-to-people ties, ensuring a mutually prosperous future.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/23R13E-680x380.jpg",
            "description": "Ivan Zhakata Herald Correspondent Zimbabwe and India have reaffirmed their commitment to strengthening bilateral relations through education, technology and trade. Yesterday Zimbabwe joined Indian at its Indian Technical and Economic Cooperation (ITEC) Day celebrations in Harare, an event that brought together ITEC alumni, Government officials and business leaders to recognize the programme ’s impact on […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "Zim to host Sadc labour ministers’ meeting",
            "url": "https://www.herald.co.zw/zim-to-host-sadc-labour-ministers-meeting/",
            "content": "Herald Reporter\n\nZIMBABWE will next week host the SADC Ministers of Employment and Labour and Social Partners meeting, whose discussions will centre on various employment and labour related issues in the region.\n\nThe meeting is also expected to discuss the signature and ratification status of the SADC Protocol on Employment and Labour; Declaration of the promotion of Decent Works and the Elimination of Forced Labour in the fisheries sector in the SADC region; and Development of the Revised Regional Technical and Vocational Education and Training.\n\nAddressing a post-Cabinet media briefing in Harare on Tuesday, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said preparations were on course for the successful hosting of the meeting in Victoria Falls.\n\nZimbabwe is the current Chair of SADC.\n\nCabinet received an update on the preparations for the meeting of Southern African Development Community (SADC) Ministers of Employment and Labour and Social Partners, which will be held from 24 to 28 March 2025, at Elephant Hills Hotel, in Victoria Falls, as presented by the Minister of Public Service, Labour and Social Welfare, Honourable EdgarMoyo.\n\nThe objective of the meeting is to enable the ministers of labour and employment and social partners in the SADC region to take stock of the implementation of Employment and Labour Sector Programmes, and to decide on issues of strategic relevance to the region.\n\nCabinet assures the nation that preparations for the meeting are progressing well, hesaid.\n\nIn a communiqu, the SADC Secretariat said a meeting of senior officials will be held before the ministerial meeting.\n\nThe ministers will discuss various employment and labour related issues of importance to the SADC region.\n\nThe meeting will be preceded by a meeting of Senior Officials responsible for employment and labour on the 24th-26th March 2025, who will be preparing documents for the Ministers meeting,\n\nsaid SADC.\n\nLast years meeting, held in Angola, noted that since adoption at Summit in 2023, the SADC Protocol on Employment and Labour had been signed by the Republics of Angola and Malawi and the Kingdom of Eswatini.\n\nThey committed to undertake national consultations with a view to sign and ratify the Protocol during the period up to 2025, noting that the instrument will go a long way in promoting decent work, underpinned by inclusive and productive employment, respect for rights at work, enhanced social security and strong labour market institutions.\n\nMember States were urged to develop and intensify the implementation of National Employment Policies and other related strategies to increase employment opportunities and reduce labour underutilisation.\n\nThey were also encouraged to ensure effective implementation and monitoring and to produce labour statistics on a regular basis using the latest statistical standards and approved the SADC Labour Market Observatory (LMO) Data Master Plan for endorsement by the SADC Statistics Committee.\n\nIn addition, they directed the Secretariat to expedite the operationalisation of the SADC LMO.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/04/sadc.jpg",
            "description": "Herald Reporter ZIMBABWE will next week host the SADC Ministers of Employment and Labour and Social Partners meeting, whose discussions will centre on various employment and labour related issues in the region. The meeting is also expected to discuss the signature and ratification status of the SADC Protocol on Employment and Labour; Declaration of the […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "Amai’s cookout competition brings together people of all abilities",
            "url": "https://www.herald.co.zw/amais-cookout-competition-brings-together-people-of-all-abilities/",
            "content": "Herald Correspondent\n\nTHE Amais Traditional Cookout Competition has returned for 2025 with a new inclusive category for people living with disabilities, as part of the countrys efforts to promote gastronomy, township tourism, and community empowerment.\n\nIt was a hive of activity at Belvedere Teachers College in Harare yesterday, as hundreds of people gathered to witness the Harare Province cookout competition, which comprised professional chefs, tertiary students, and members of the community.\n\nThe cookout competition was divided into four categories, comprising community participants, professional chefs, students, and people living with disabilities.\n\nThe community category had 20 participants, while the professional chefs and students categories each had 10 participants. The newly added category of people living with disabilities had five participants.\n\nAt the centre of the competition was Zimbabwes signature dish, the highfiridzi, a delectable mix of beef and leafy greens (rape/covo or tsunga) simmered to perfection.\n\nThe stage was set for a showdown of flavours, as participants from Harare District took to the stoves to prepare Zimbabwes favourite dish  the renowned highfiridzi.\n\nThis beloved Zimbabwean delicacy is usually served with sadza and its name traces back to Highfield, one of Harares oldest suburbs, where lush backyard gardens supply the leafy greens that give this dish its authentic, natural flavours.\n\nTourism and Hospitality Industry Minister, Barbara Rwodzi, was the guest of honour at the event, accompanied by her deputy, Tongai Mnangagwa.\n\nOther notable attendees included senior Government officials from various ministries, such as Women Affairs, Community, Small and Medium Development, Higher and Tertiary Education, Innovation, Science and Technology Development, as well as the Minister of State for Provincial Affairs and Devolution.\n\nWe want to thank our First Lady for this initiative and for being a patron who is giving us a good direction that is even recognised by UN Tourism which has given our destination an endorsement, Minister Rwodzi said.\n\nShe also revealed that since the inaugural United Nations (UN Tourism) Regional Forum on Gastronomy for Africa held last year in Victoria Falls there has been a significant improvement in the tourism sector.\n\nFrom 2024 July up to now as we are speaking, we are experiencing a number and a number of tourists that are coming from international markets because UN Tourism has endorsed our destinations in a way.\n\nThe cookout programme is a concept introduced by First Lady Dr Auxillia Mnangagwa in 2019.\n\nSince then, the Ministry of Tourism and Hospitality Industry has been tasked to coordinate the implementation of the programme together with provinces and other line ministries.\n\nMinister Rwodzi also highlighted that Amais Traditional Cookout Competition has made notable strides in inclusivity this year by introducing persons living with disabilities.\n\nAmai has introduced a new approach this year, bringing together people with disabilities and men who can cook for their families, promoting unity and inclusivity.\n\nThis move aligns with the Presidents vision of leaving no one behind and promotes unity and inclusivity.\n\nFrom the four categories, the judges selected the top three winners, who will proceed to the national cookout competition once all provincial competitions have been completed.\n\nThe winners shared their excitement in separate interviews, eager to advance to the national cookout competition.\n\nI didnt expect to win, as I had hastily prepared these dishes, but surprisingly, I emerged as the winner, said Naomi Ngarandi, a Kuwadzana resident living with a disability, who made her debut in this years competition and scooped the first prize.\n\nI would like to thank Amai (Dr Auxillia Mnangagwa) for including persons with disabilities, as it is clear from the competition that we can compete with anyone and take our talents far, she added.\n\nAnother participant, Ms Martha Charenga from Chitungwiza, who was the second runner-up in the persons living with disabilities category, said: I am very excited because we managed to compete among the giants and came out victorious, she said.\n\nChef Nelson Shonhiwa, who took home the top prize in the professional chefs category, praised the Ministry for promoting gastronomy tourism and encouraged his fellow men to participate and hone their cooking skills.\n\nI encourage other men out there to showcase their talents, regardless of the category. Men are often shy, but if they have a talent, they should participate, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/D13E12-680x380.jpg",
            "description": "Herald Correspondent THE Amai’s Traditional Cookout Competition has returned for 2025 with a new inclusive category for people living with disabilities, as part of the country’s efforts to promote gastronomy, township tourism, and community empowerment. It was a hive of activity at Belvedere Teachers’ College in Harare yesterday, as hundreds of people gathered to witness […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "Zim’s location strategic for development",
            "url": "https://www.herald.co.zw/zims-location-strategic-for-development/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nZimbabwe is not merely participating in the global economy but is actively shaping it by leveraging its strategic location in Southern Africa as a gateway to SADC, COMESA, and AfCFTA markets, a Cabinet Minister has said.\n\nTo showcase its potential, the Government is utilising the Zimbabwe International Trade Fair (ZITF) as a platform for the international community to explore what the country has to offer.\n\nThe Ministry of Industry and Commerce, in partnership with ZITF, yesterday hosted a breakfast meeting for diplomats ahead of this years 65th ZITF event, themed Industrialisation: Crafting an Integrated Economic Landscape.\n\nSpeaking at the event, Deputy Minister of Industry and Commerce, Raj Modi, representing Minister Mangaliso Ndlovu, said diplomatic corps can play a vital role in unlocking Zimbabwes vast untapped economic potential.\n\nWe are not just participating in the global economy; we are actively shaping it. Zimbabwes strategic location at the heart of Southern Africa positions it as a natural gateway to the SADC, COMESA, and AfCFTA markets. This access to a market of over 1,3 billion people and a combined GDP of approximately US$3,4 trillion presents unparalleled opportunities for foreign businesses, he said.\n\nDeputy Minister Modi said the African Continental Free Trade Area (AfCFTA) is a cornerstone of Agenda 2063, the African Unions blueprint for a prosperous and integrated continent.\n\nHe stressed the diplomatic corps role in attracting international exhibitors, investors, and business delegations.\n\nYour role in positioning Zimbabwe as a premier trade and investment destination is not merely appreciated; it is indispensable.\n\nWe rely on your influence to promote this platform as a gateway for investment, trade linkages, and industrial cooperation.\n\nYour advocacy will be instrumental in attracting international exhibitors, investors, and business delegations, he said.\n\nHe also pointed to Zimbabwes commitment to political stability and peace, alongside ongoing reforms by the Zimbabwe Investment and Development Agency (ZIDA), as key factors in creating a conducive investment climate.\n\nZITF is more than an exhibition; it is a dynamic ecosystem of trade, networking, and industrial collaboration. It brings together key stakeholders, fostering mutually beneficial partnerships and driving technological advancement and skills development. We urge you to engage your respective business communities, chambers of commerce, and investment agencies to ensure a robust international presence at ZITF 2025, he added.\n\nZITF Company Chairman, Mr Busisa Moyo, likened economic collaboration to a well-balanced meal, emphasising that retooling industries and securing financing are top priorities for businesses.\n\nAs a meal nourishes our bodies, collaboration strengthens our economy. Industry leaders are focused on mechanisation for scale and efficiency, as well as securing finance for operations and infrastructure, he said.\n\nHe noted that ZITF, as one of Africas premier trade showcases, continues to drive industrial growth and foster vital business connections. ZITF 2025 will spotlight our nations drive toward a sustainable industrial ecosystem. We aim to reduce reliance on raw material exports by encouraging value addition and manufacturing, Mr Moyo said.\n\nMr Moyo emphasised the critical role diplomats play in fostering economic growth by advocating for national interests, promoting trade agreements, and providing valuable market insights.\n\nTogether, we can showcase the potential of our diverse industries and create a vibrant platform for collaboration and growth.\n\nLet us unite in this endeavour to foster deeper connections and explore new avenues for partnership, he said.\n\nThis years ZITF will run from April 21 to 26, 2025, and is expected to attract a wide range of international exhibitors, investors, and business delegations. The event will highlight Zimbabwes industrial potential, focusing on value addition, manufacturing, and sustainable economic growth.\n\nZimbabwe is strategically positioning itself as a hub for trade and investment in Southern Africa, leveraging its geographic location and participation in regional and continental trade agreements.\n\nThe ZITF serves as a critical platform for showcasing the countrys industrial capabilities and fostering international partnerships.\n\nWith a focus on political stability, industrialisation, and value addition, Zimbabwe aims to play a significant role in shaping the global economy while addressing local economic challenges.\n\nThus the involvement of the diplomatic corps and international stakeholders will be crucial in realising these ambitions.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/23R23RE-680x380.jpg",
            "description": "Blessings Chidakwa Herald Reporter Zimbabwe is not merely participating in the global economy but is actively shaping it by leveraging its strategic location in Southern Africa as a gateway to SADC, COMESA, and AfCFTA markets, a Cabinet Minister has said. To showcase its potential, the Government is utilising the Zimbabwe International Trade Fair (ZITF) as […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "FIU widens net to consolidate ZiG stability",
            "url": "https://www.herald.co.zw/fiu-widens-net-to-consolidate-zig-stability/",
            "content": "Richard Muponde\n\nSenior Reporter\n\nTHE Reserve Bank of Zimbabwes (RBZ) Financial Intelligence Unit (FIU) is expanding operations to other cities and towns outside Harare in a move aimed at consolidating the stability of the Zimbabwean Gold (ZiG) and ensuring nationwide compliance with currency exchange regulations.\n\nA massive recruitment drive of FIU inspectors has started while plans to establish offices in Bulawayo by May are at advanced an stage.\n\nThe decentralisation will continue in other provinces, targeting areas with lower compliance levels.\n\nIn previous years, Zimbabwe has experienced currency volatility caused by economic saboteurs through currency manipulation.\n\nBut over the past five months, the ZiG has been stable, with parallel market rates now almost at convergence with the official rate.\n\nThis stability came after the FIU launched blitzkriegs targeting businesses, banks and the informal sector to restore sanity in the economy.\n\nIn an interview with The Herald, FIU director-general Mr Oliver Chiperesa emphasised the need for the units expanded presence to consolidate the current economic stability and tackle pockets of resistance to compliance, particularly in areas outside the capital city.\n\nThe FIU currently has offices only in Harare, and this year we are starting to move to other centres, starting with Bulawayo. At the moment, we are recruiting inspectors to beef up the current numbers, he said.\n\nMr Chiperesa attributed the stability of the ZiG to heightened compliance among businesses, bolstered by efforts from the FIU, the security sector, and the Government crack down on currency manipulators and economic saboteurs.\n\nThe FIU director general acknowledged that compliance levels remain inconsistent in areas where the FIU does not have a permanent presence.\n\nWe have been receiving reports from other centres that businesses there have lower compliance levels. We have been sending some teams on an ad hoc basis to those centres, and we found that indeed in areas where the FIU does not have a presence, compliance levels among traders tends to be lower, he said.\n\nCompliance means businesses across the country must accept all currencies under use in Zimbabwe, and all methods of payments.\n\nMr Chiperesa said to address this gap, the FIUs expansion drive will ensure that traders in all provinces adhere to currency regulations.\n\nHe said the establishment of permanent offices in Bulawayo is a first step, with plans to review and expand to other towns and cities in the future.\n\nWe want to make sure we have a presence in all major centres of the country, starting with Bulawayo. We will review where else we need to deploy permanent FIU offices, Mr Chiperesa said. He reiterated the FIUs commitment to enforcing regulations and making sure that the stability being enjoyed at the moment is maintained.\n\nWe want to consolidate the current stability and make sure that businesses in all provinces are complying with the monetary requirements, Mr Chiperesa said.\n\nSharp disparities between official and parallel market exchange rates fuelled economic instability in the past.\n\nHowever, the Government and the central bank have made concerted efforts to stabilise the ZIG through regulatory enforcement and interventions targeting black market operators.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/04/Untitled-9.financial-intelligence-unit.jpg",
            "description": "Richard Muponde Senior Reporter THE Reserve Bank of Zimbabwe’s (RBZ) Financial Intelligence Unit (FIU) is expanding operations to other cities and towns outside Harare in a move aimed at consolidating the stability of the Zimbabwean Gold (ZiG) and ensuring nationwide compliance with currency exchange regulations. A massive recruitment drive of FIU inspectors has started while […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "Smith fraud trial resumes, more witnesses testify",
            "url": "https://www.herald.co.zw/smith-fraud-trial-resumes-more-witnesses-testify/",
            "content": "Court Correspondent\n\nTHE trial of Michael Smith, accused of defrauding MA Auto Suppliers, trading as Mr Cruiser of at least US$38 000 and R124 000, has resumed with State leading testimony from two key witnesses.\n\nSmith faces multiple charges, including two counts of theft of trust property, 12 counts of fraud, and 25 counts of corruptly concealing transactions from his principal, represented by Mr Michael Scott Asher, before Harare magistrate Mrs Ethel Chichera.\n\nThe first witness, Ms Sophia Mupariwa, a customer services advisor at MA Auto Suppliers, testified about her former boss.\n\nHer responsibilities include attending to customer inquiries, receiving and booking customer vehicles, inspecting vehicles, and generating quotations and job cards, among others.\n\nMupariwa said that from 2020 to 2022, Smith was employed as a director, overseeing daily operations.\n\nDuring this time, the company serviced several vehicles owned by Smith, his family, and his friends.\n\nShe alleged that Smith frequently ordered the release of these vehicles either without full payment or after partial payments, despite the company providing labour and parts for the services.\n\nFor instance, in one case, a client with a Land Cruiser 100 Series was charged US$1 680 for seat covers, but only paid US$850, leaving a loss of US$830 to the company.\n\nOn another occasion, Smith brought in his sons Prado J95 for repairs quoted at US$1 378.46, but paid only US$600, leaving a balance of US$778.46.\n\nThe second witness, Ms Christine Vellah, the finance and administration manager at MA Auto Suppliers, detailed her role in maintaining financial records and ensuring fiscal compliance.\n\nShe testified that Smith managed company cash and would provide her with payment schedules, making it difficult for her to reconcile accounts due to incomplete information.\n\nMs Vellah revealed troubling practices involving a company called Mant Procurement, in which Smith held a 50 percent stake.\n\nThis company allegedly siphoned money from MA Auto Suppliers without providing legitimate services.\n\nFor example, she noted an independent runner charged only 15 percent for transportation, but Smith inflated costs, hiding invoices to justify higher charges, leading to a loss exceeding R100 000.\n\nMs Vellah recounted several other instances of alleged fraud.\n\nOn November 9, 2020, Smith received a US$10 000 loan from Cruiser Bond (Pvt) Ltd without informing her, resulting in the company having to repay the full amount without any record of its use.\n\nIn a sale of a Toyota Land Cruiser 78 series for US$13 000, only US$5 000 was recorded in company accounts, with Smith pocketing the rest.\n\nIn addition, Smith reportedly took company property, including chairs valued at R4 786 and a 95-litre fridge, without ever making payment.\n\nMs Vellah highlighted another instance where Smith instructed her to pay ZW$295 200 for fees related to a jointly operated boat, despite the company only being liable for ZW$88 250.\n\nThe remainder was Smiths responsibility, which he never repaid.\n\nProsecutor Chirenje, through Ms Vellah, tendered documentary evidence relating to cash records, invoices, emails, and bank statements that incriminate the accused largely relating to counts 1 to 14.\n\nDefence counsel Mr Takudzwa Nyambira raised an objection arguing that some of the schedules which the witness was testifying to were not in order.\n\nHe also said he did not have some of the schedules they were being referred to by the witness, but Mr Chirenje said it was not the duty of the State to put them in order since he served him with all the documents.\n\nMr Nyambira then consented to the admission of the said documents into the record.\n\nThe trial continued yesterday with Ms Vellah testifying.\n\nThe case will resume on March 25 with cross-examination by the defence lawyer.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "Court Correspondent THE trial of Michael Smith, accused of defrauding MA Auto Suppliers, trading as Mr Cruiser of at least US$38 000 and R124 000, has resumed with State leading testimony from two key witnesses. Smith faces multiple charges, including two counts of theft of trust property, 12 counts of fraud, and 25 counts of […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        },
        {
            "title": "‘Let’s share mutual content, strengthen ties’",
            "url": "https://www.herald.co.zw/lets-share-mutual-content-strengthen-ties/",
            "content": "Gibson Nyikadzino\n\nZimpapers Politics Hub\n\nTHE resilience shown by the Zimbabwe-Cuba bond serves as a strength of character and remains unbreakable despite the punitive unilateral Western coercive measures targeting the countries sovereignty, Information, Publicity and Broadcasting Services Deputy Minister Dr Omphile Marupi has said.\n\nHe made the remarks at the Ministerial Forum and the IV Patria International Colloquium in Havana, Cuba, which ended yesterday and was also attended by Information Communication Technology, Postal and Courier Services Deputy Minister Dingumuzi Phuti.\n\nHe said the existence of an agreement between the Zimbabwean news agency, New Ziana, and its Cuban counterpart, Prensa Latina, should be used to share mutual content and strengthen longstanding bilateral relations between the two countries.\n\nThe Zimbabwe delegation is attending this meeting to receive and share knowledge and expertise to forge new joint paths in the development of our countries, hence the importance of co-operation with Cuba in the field of media communication, said Dr Marupi.\n\nThe resilience of both nations in the face of economic sanctions imposed by imperialist powers has not hindered medical co-operation, the training of Zimbabwean professionals on the island, and exchanges in areas of mutual interest.\n\nTherefore, the promotion of the bilateral agreement between our two news agencies allows this reality to be reflected and shared in the media of both countries.\n\nDr Marupi emphasised the importance of the concretisation of the Zimbabwe-Cuba relations as the two sovereign states advance together into the future with common challenges in a world marked by digital economies.\n\nAddressing the same gathering, Deputy Minister Phuti urged Zimbabwean and Cuban authorities to safeguard their information systems by creating regulating policies that protect their sovereignty.\n\nIt is imperative to safeguard information in order to protect our sovereign systems. We must pay special attention to creating regulatory policies that provide tools to remain more protected in this regard, Deputy Minister Phuti said.\n\nZimbabwe and Cuba have been targeted by imperialist powers for maintaining their resolve to fight imperialism, neo-colonialism, and Western machination to interfere with their sovereignty.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Dr-Omphile-Marupi-600x380.jpg",
            "description": "Gibson Nyikadzino Zimpapers Politics Hub THE resilience shown by the Zimbabwe-Cuba bond serves as a strength of character and remains unbreakable despite the punitive unilateral Western coercive measures targeting the countries’ sovereignty, Information, Publicity and Broadcasting Services Deputy Minister Dr Omphile Marupi has said. He made the remarks at the Ministerial Forum and the IV […]",
            "time": "06:30",
            "date": "20 Mar 2025"
        }
    ]
}