{
    "news": [
        {
            "title": "President arrives in Tanzania",
            "url": "https://www.herald.co.zw/president-arrives-in-tanzania/",
            "content": "Fungi Kwaramba in Dar es Salaam\n\nPresident Mnangagwa has arrived in Tanzania for the joint Sadc and EAC Summit that is expected to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) crisis where the government is fighting rebels in the eastern part of the country.\n\nThe President, who will join other African Heads of State and Government tomorrow for the joint Sadc-EAC Summit, was welcomed at the Julius Nyerere International Airport by the countrys Ambassador to Tanzania Helen Dingani.\n\nEarlier today, Foreign Affairs Ministers from Sadc and the EAC attended precursor meetings to the joint summit.\n\nAs the Sadc Chairperson, President Mnangagwa will co-chair the joint conference with his EAC counterpart President William Ruto of Kenya.\n\nDemocratic Republic of Congo President Felix Tshisekedi and Rwandan President Paul Kagame are also expected to attend the summit as the main protagonists in the three-decade-long conflict that has lately threatened to ignite a regional war in the Great Lakes region.\n\nDRC accuses Rwanda of sponsoring marauding rebel groups in its rich eastern region, charges which Kigali stridently refutes.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-in-Tanzania-680x380.jpg",
            "description": "Fungi Kwaramba in Dar es Salaam President Mnangagwa has arrived in Tanzania for the joint Sadc and EAC Summit that is expected to thrash out a peaceful resolution to the Democratic Republic of Congo (DRC) crisis where the government is fighting rebels in the eastern part of the country. The President, who will join other […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "Veteran liberation war hero Cde Tinaye Chigudu declared national hero",
            "url": "https://www.herald.co.zw/veteran-liberation-war-hero-cde-tinaye-chigudu-declared-national-hero/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nPresident Mnangagwa has mourned the passing of veteran liberation fighter and former Manicaland Governor, Cde Tinaye Elisha Nzirasha Chigudu, describing him as a principled cadre whose dedication to Zimbabwes independence and governance was unwavering.\n\nIn a statement following Cde Chigudus passing, President Mnangagwa expressed deep sorrow, highlighting the late heros role in the liberation struggle and his service to both the ruling Zanu PF party and the Government.\n\nI received with deep sorrow and sadness, news of the untimely death of Cde Tinaye Elisha Nzirasha Chigudu, a veteran of our liberation struggle, President Mnangagwa said.\n\nHe was among the brave sons and daughters of the soil who took a stand and fought for the Independence of Zimbabwe.\n\nCde Chigudu was among the earliest combatants trained under the Zimbabwe Peoples Revolutionary Army (ZPRA) in North Korea.\n\nHis intelligence operations in Salisbury (now Harare) provided crucial insights into Rhodesian military tactics, aiding the guerrilla warfare efforts.\n\nHis capture and subsequent 12-year imprisonment by the colonial regime did not deter his commitmentupon release, he resumed his fight for liberation.\n\nPresident Mnangagwa acknowledged Cde Chigudus post-independence contributions, particularly in the Government and the ruling party.\n\nHe was a fountain of wisdom who offered wise counsel and advice in conducting both Party and Government business, drawing from his vast experiences, President Mnangagwa said.\n\nIn recognition of his immense contributions to Zimbabwe, both during and after the liberation struggle, the Zanu PF Politburo has conferred upon him the status of National Hero.\n\nOn behalf of the Party, Zanu PF, Government, my family, and on my behalf, I wish to express my deepest, heartfelt condolences to the Chigudu Family on this sad loss.\n\nMay the family derive comfort from the contribution he made to this Great Nation.\n\nCde Chigudus hero status means he will be laid to rest at the National Heroes Acre in Harare, where the countrys most distinguished liberation figures are honored.\n\nHis passing marks the end of a significant chapter in Zimbabwes history, but his legacy of resilience, patriotism and service will live on.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Cde-Tinaye-Chigudu.jpg",
            "description": "Ivan Zhakata Herald Correspondent President Mnangagwa has mourned the passing of veteran liberation fighter and former Manicaland Governor, Cde Tinaye Elisha Nzirasha Chigudu, describing him as a “principled cadre” whose dedication to Zimbabwe’s independence and governance was unwavering. In a statement following Cde Chigudu’s passing, President Mnangagwa expressed deep sorrow, highlighting the late hero’s role […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "US$52k thief jailed 5 years",
            "url": "https://www.herald.co.zw/us52k-thief-jailed-5-years/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nA Harare man who stole a satchel containing US$52 000 from a Bhola Hardware employee while he was coming out of Harare Street branch has been jailed for 5 years.\n\nTapiwanashe Murefu (27) was initially sentenced to 15 years in jail before five years were suspended on condition of good behavior, another five years were also set aside on condition that the accused restitutes US$51k to the complainant before October 2025.\n\nThe State led by Ms Dzidzai Josiah proved that Murefu teamed up with his accomplices and drove to Bhola Hardware located along Harare Street in three motor vehicles.\n\nOn arrival they confronted the complainant who was coming from the shop and grabbed his satchel containing cash amounting to US$52 000 and ran back into their vehicles and immediately sped off.\n\nThe complainant later made a report at the ZRP Kopje and investigations were instituted.\n\nInvestigations were carried out leading to the arrest of Murefu who then implicated his accomplices.\n\nMurefu led the police to the recovery of USS$1 000 and while his accomplice Tawanda Mutuma led to the recovery of US$500\n\nThe accused were allegedly captured on CCTV committing the offence and there were witnesses to testify.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/courthammer-680x380.jpg",
            "description": "Prosper Dembedza Herald Correspondent A Harare man who stole a satchel containing US$52 000 from a Bhola Hardware employee while he was coming out of Harare Street branch has been jailed for 5 years. Tapiwanashe Murefu (27) was initially sentenced to 15 years in jail before five years were suspended on condition of good behavior, […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "President leaves for joint SADC – EAC Summit on DRC",
            "url": "https://www.herald.co.zw/president-leaves-for-joint-sadc-eac-summit-on-drc/",
            "content": "\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Summit1-564x380.png",
            "description": "",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "President leaves for Tanzania",
            "url": "https://www.herald.co.zw/president-leaves-for-tanzania/",
            "content": "Fungi Kwaramba\n\nNews Editor\n\nPresident Mnangagwa has departed for Tanzania to participate in an extraordinary summit involving regional leaders from SADC (Southern African Development Community) and the East Africa Community (EAC).\n\nThe summits primary focus is to address the escalating security crisis in the Democratic Republic of Congo (DRC).\n\nAs the SADC Chairperson, President Mnangagwa has underscored Africas commitment to silencing the guns in DRC.\n\nHis departure was marked by a send-off at Robert Mugabe International Airport, attended by Vice President Constantino Chiwenga, various Cabinet ministers, and service chiefs.\n\nHe was also accompanied by DefenCe Minister Oppah Muchinguri Kashiri.\n\nThis summit reflects a collaborative effort by African nations to tackle regional security challenges.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/WhatsApp-Image-2025-02-07-at-14.21.06-1-680x380.jpeg",
            "description": "Fungi Kwaramba News Editor President Mnangagwa has departed for Tanzania to participate in an extraordinary summit involving regional leaders from SADC (Southern African Development Community) and the East Africa Community (EAC). The summit’s primary focus is to address the escalating security crisis in the Democratic Republic of Congo (DRC). As the SADC Chairperson, President Mnangagwa […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "Streetlights for Donga Business Centre",
            "url": "https://www.herald.co.zw/streetlights-for-donga-business-centre/",
            "content": "Midlands Bureau\n\nTONGOGARA Rural District Council has installed streetlights at Donga Business Centre to address a rise in crime.\n\nThe councils chief executive officer Engineer Tungamirai Chuchuchu said before the installation of the streetlights there had been incidents of mugging at the business centre and in nearby areas.\n\nThe 1000 watts lights were installed by Radiation Company on December 22, 2024, and cover a distance of 400 metres from the business centre up to Shurugwi-Mhandamabwe Road, he said.\n\nEngineer Chuchuchu said the RDC is playing an active role in addressing the surge in criminal activity in the area.\n\nA lot should be done to ensure that residents are safe at all times, he said. Council believes that improved lighting will deter criminal activity and create a safer environment for residents and visitors.\n\nEngineer Chuchuchu said the RDC is also embarking on other projects like fencing the council beer hall, with the hope of attracting investors for the growth of the council.\n\nThe beer hall is being fenced so that we can rent it out and increase council revenue, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/TONGO-680x380.jpg",
            "description": "Midlands Bureau TONGOGARA Rural District Council has installed streetlights at Donga Business Centre to address a rise in crime. The council’s chief executive officer Engineer Tungamirai Chuchuchu said before the installation of the streetlights there had been incidents of mugging at the business centre and in nearby areas. “The 1000 watts lights were installed by […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "Five copper cable thieves jailed",
            "url": "https://www.herald.co.zw/five-copper-cable-thieves-jailed/",
            "content": "Crime Reporter\n\nFive copper cable thieves, including one woman, have been arrested and jailed for between 20 and 50 years.\n\nThe five are Phillip Chitava (43), Steven Nyakabau (31), Partson Gurupira (28), Clayton Nyakatonje (24) and Mary Ngono (33) of Chinzanga in Motoko.\n\nCriminal Investigations Department spokesperson, Detective Inspector Rachel Muteweri said the five were found in possession of copper windings and cables without the requisite licenses.\n\nFrom May 2024 to January 2025, the accused persons connived to steal copper windings from transformers and network boosters in and around Mutoko, she said.\n\nThe accused persons tripped the transformers and stole copper windings. They were also targeting network boosters and telephone cables.\n\nDue to the prevalence of vandalism in Mutoko, police detectives conducted an operation which resulted in the arrest of the five accused persons. The five were charged with eleven counts, she said.\n\nOn January 28, Chitava appeared at Kotwa Magistrates Court where he was convicted and sentenced to an effective 20 years imprisonment.\n\nOn February 4, Nyakabau, Gurupira and Nyakatonje appeared before the Kotwa Magistrates Court and were convicted and sentenced to 50 years imprisonment.\n\nHowever, they will each serve an effective 30 years in prison as the other 20 years will run concurrently with the sentence.\n\nMeanwhile, Ngono is yet to appear in court.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/06/Man-jailed.jpeg",
            "description": "Crime Reporter Five copper cable thieves, including one woman, have been arrested and jailed for between 20 and 50 years. The five are Phillip Chitava (43), Steven Nyakabau (31), Partson Gurupira (28), Clayton Nyakatonje (24) and Mary Ngono (33) of Chinzanga in Motoko. Criminal Investigations Department spokesperson, Detective Inspector Rachel Muteweri said the five were […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "EMA takes National Clean-Up Campaign to Manhenga, Bindura Rural",
            "url": "https://www.herald.co.zw/ema-takes-national-clean-up-campaign-to-manhenga-bindura-rural/",
            "content": "Fungai Lupande\n\nMashonaland Central Bureau\n\nThe Environmental Management Agency (EMA) has urged business owners at the Manhenga Business Centre to actively participate in the national clean-up campaign.\n\nThis call to action was made after it was observed that many people at the business centre were bystanders during the clean-up exercise.\n\nEMAs provincial manager, Mr Robert Rwafa said there is need for the Bindura Rural District Council to take action against irresponsible business owners who are littering the area.\n\nI urge everyone to actively participate in the national clean-up. Let us remind each other that the clean-up campaign is a lifestyle, he said.\n\nIt is concerning that officials and visitors are doing the cleaning while residents remain spectators.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/10/EMA.jpg",
            "description": "Fungai Lupande Mashonaland Central Bureau The Environmental Management Agency (EMA) has urged business owners at the Manhenga Business Centre to actively participate in the national clean-up campaign. This call to action was made after it was observed that many people at the business centre were bystanders during the clean-up exercise. EMA’s provincial manager, Mr Robert […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "Clean-up campaign takes root",
            "url": "https://www.herald.co.zw/clean-up-campaign-takes-root/",
            "content": "Zimbabwes National Clean-Up Day is to a nationwide initiative where the first Friday of every month is designated as a day for citizens to actively clean their surrounding areas.\n\nThe day was established by President Emmerson Mnangagwa to promote environmental awareness and tackle waste management issues across the country.\n\nEveryone is encouraged to participate in cleaning their communities during this time frame, from individuals to businesses and organisations.\n\nToday, several top officials took part in the clean-up exercise across the country. Here we give you some updates on todays events.\n\n[nicklaus_border_shortcode title= time=11.55AM]\n\nHarare Minister takes clean-up to Glen View\n\nMinister of State Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa led the clean-up campaign in Glen View at Makomva Shopping Centre this morning.\n\nHe was joined by Harare Mayor Jacob Mafume and local councillors.\n\nThe clean-up exercise came just a few days after the launch of Operation Chenesa Harare 3 in Glen View.\n\nSpeaking after the clean-up exercise, Senator Tawengwa challenged residents to ensure a clean environment to eradicate diseases such as cholera.\n\nGlen View was one of the cholera hotspots and the outbreak saw a number of residents falling victim.Senator Tawengwa said residents should embrace proper waste management.\n\nI urge you to embrace proper waste management to reduce diseases associated with dirty environments. Waste management can be taken as a business. You can earn a living through recycling waste,  he said.\n\nLets desist from littering. Proper waste management will even reduce the costs of chemicals needed for water treatment, he said.\n\nMash West Clean and Green Cities awards ceremony underway\n\nDeputy Minister Kabikira, traditional chiefs and government officials during the Mashonaland West Provincial Clean up exercise in Chegutu\n\nTHE Mashonaland West Provincial Clean and Green Cities awards ceremony is underway at Chegutu Civic Centre, with outstanding local authorities set to be honoured.\n\nThe ceremony also coincided with the provincial clean-up campaign that was led by Local Government and Public Works Deputy Minister, Engineer Benjamin Kabikira.\n\nThe Deputy Minister also planted the Quinin (Mutowamakaka) tree which is known for its medicinal properties and is used as an indicator for high-water tables for borehole drilling.\n\nAll the rural and urban local councils are present at the event, which has drawn players from the public and private sectors.\n\nEMA takes National Clean-Up Campaign to Bindura\n\nThe Environmental Management Agency (EMA) has urged business owners at the Manhenga Business Centre to actively participate in the national clean-up campaign.\n\nThis call to action was made after it was observed that many people at the business centre were bystanders during the clean-up exercise.\n\nEMAs provincial manager, Mr Robert Rwafa said there is need for the Bindura Rural District Council to take action against irresponsible business owners who are littering the area.\n\nI urge everyone to actively participate in the national clean-up. Let us remind each other that the clean-up campaign is a lifestyle, he said.\n\nIt is concerning that officials and visitors are doing the cleaning while residents remain spectators.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/WhatsApp-Image-2025-02-07-at-12.00.18-680x380.jpeg",
            "description": "Zimbabwe’s National Clean-Up Day is to a nationwide initiative where the first Friday of every month is designated as a day for citizens to actively clean their surrounding areas. The day was established by President Emmerson Mnangagwa to promote environmental awareness and tackle waste management issues across the country. Everyone is encouraged to participate in […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        },
        {
            "title": "Harare Minister takes clean-up to Glen View",
            "url": "https://www.herald.co.zw/harare-minister-takes-clean-up-to-glen-view/",
            "content": "Talent Chimutambgi\n\nHerald Reporter\n\nMinister of State Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa led the clean-up campaign in Glen View at Makomva Shopping Centre this morning.\n\nHe was joined by Harare Mayor Jacob Mafume and local councillors.\n\nThe initiative was mooted by President Mnangagwa as part of efforts to ensure a clean environment nationwide.\n\nThe clean-up exercise came just a few days after the launch of Operation Chenesa Harare 3 in Glen View.\n\nSpeaking after the clean-up exercise, Senator Tawengwa challenged residents to ensure a clean environment to eradicate diseases such as cholera.\n\nGlen View was one of the cholera hotspots and the outbreak saw a number of residents falling victim.\n\nSenator Tawengwa said residents should embrace proper waste management.\n\nI urge you to embrace proper waste management to reduce diseases associated with dirty environments. Waste management can be taken as a business. You can earn a living through recycling waste,  he said.\n\nLets desist from littering. Proper waste management will even reduce the costs of chemicals needed for water treatment, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/WhatsApp-Image-2025-02-07-at-12.00.18-680x380.jpeg",
            "description": "Talent Chimutambgi Herald Reporter Minister of State Harare Metropolitan Provincial Affairs and Devolution, Senator Charles Tawengwa led the clean-up campaign in Glen View at Makomva Shopping Centre this morning. He was joined by Harare Mayor Jacob Mafume and local councillors. The initiative was mooted by President Mnangagwa as part of efforts to ensure a clean […]",
            "time": "18:29",
            "date": "07 Feb 2025"
        }
    ]
}