{
    "news": [
        {
            "title": "S$200 000 Presidential Revolving Fund launched in Glen View South",
            "url": "https://www.herald.co.zw/s200-000-presidential-revolving-fund-launched-in-glen-view-south/",
            "content": "Herald Reporter\n\nIn a significant move to bolster economic development, a US$200 000 Presidential Revolving Fund has been launched in Glen View South, Harare.\n\nThis initiative aims to empower local residents by providing interest-free loans for entrepreneurial projects, thereby fostering self-sufficiency and community growth.\n\nThe fund is part of a broader national strategy to stimulate grassroots economic activities.\n\nAddressing Glen View South Constituency, Dr Paul Tungwarara, Special Advisor to the President, emphasised the importance of discipline and accountability among beneficiaries to ensure the funds sustainability.\n\nResponsible borrowing and timely repayment will ensure that more people benefit from this initiative, thereby driving long-term economic progress in our communities, he said.\n\nCommunity members have welcomed the fund, viewing it as an opportunity to start and expand their small businesses.\n\nOne resident, Tendai Chuma said, This fund gives us hope. Many of us have business ideas but lack capital. Now we have a chance to grow.\n\nThe revolving fund is expected to create hundreds of jobs and uplift the livelihoods of Glen View South residents.\n\nSimilar initiatives are being implemented across the country, including the US$1,5 million Presidential War Veterans Fund, with each of Zimbabwes 10 provinces receiving US$150 000 to support short-term projects for war veterans.\n\nPresident Mnangagwa also launched a US$2 million revolving fund aimed at supporting youth-led income-generating projects countrywide.\n\nEach province will receive US$200 000.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/tykk57k-680x380.jpg",
            "description": "Herald Reporter In a significant move to bolster economic development, a US$200 000 Presidential Revolving Fund has been launched in Glen View South, Harare. This initiative aims to empower local residents by providing interest-free loans for entrepreneurial projects, thereby fostering self-sufficiency and community growth. The fund is part of a broader national strategy to stimulate […]",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "Four Chitungwiza men in court over vehicle arson attacks",
            "url": "https://www.herald.co.zw/four-chitungwiza-men-in-court-over-vehicle-arson-attacks/",
            "content": "Prosper Dembedza\n\nFour Chitungwiza men have appeared in court for allegedly carrying out a series of vehicle arson attacks at business premises in Avondale, Highlands, Newlands and Goromonzi on Friday last week.\n\nLast Matarutse (40), Abel Jobe (47), Kizito Chinhanga (40) and Thomas Chanetsa (45) were charged with malicious damage to property when they appeared separately before Harare magistrate, Ms Marehwanazvo Gofa.\n\nThe court remanded them in custody to April 14, advising them to apply for bail at the High Court.\n\nAllegations are that Matarutse targeted IMC Communications at 42 Lanark Road, Avondale.\n\nHe is accused of driving his silver Toyota Corolla to the premises and setting the vehicle on fire at the entrance gate, causing damage to the lighting system and a Starlink authorised dealer signpost.\n\nJobe is accused of attempting to destroy Sano Complex in Goromonzi after he reportedly drove his blue Nissan Sunny to the premises and set the vehicle on fire. However, the fire did not cause any significant damage.\n\nChinhanga is being charged with targeting Sakunda Holdings at 11 Argyle Road, Avondale.\n\nHe allegedly drove his blue Nissan X-Trail to the entrance, set the vehicle on fire, and attempted to destroy the premises.\n\nChanetsa allegedly attempted to burn down a DA Service Station at 486A Glenara Avenue, North Highlands in Harare.\n\nHe is accused of driving his red Toyota Raum to the forecourt and setting it on fire. The blaze was extinguished before it could cause any damage.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/court-1.jpg",
            "description": "Four Chitungwiza men have appeared in court for allegedly carrying out a series of vehicle arson attacks at business premises in Avondale, Highlands, Newlands and Goromonzi on Friday last week.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "Buhera woman scalds hubby with hot water over scotch cart dispute",
            "url": "https://www.herald.co.zw/buhera-woman-scalds-hubby-with-hot-water-over-scotch-cart-dispute/",
            "content": "Online Reporter\n\nA man from Majere Village in Buhera is battling for his life at Victoria Chitepo Hospital in Mutare after his wife scalded him with hot water following a heated dispute over the use of their scotch cart.\n\nMr Munyaradzi Muchetu, who was initially admitted at Murambinda Hospital before being transferred to Manicaland Provinces biggest referral hospital, sustained severe burns after his wife, Estery Gwenzi (34), scalded him.\n\nThe incident occurred on March 29 at their homestead.\n\nGwenzi has since been taken to Buhera Magistrates Court and is facing charges of attempted murder.\n\nGwenzi was not asked to plead to the charges when she appeared before magistrate Mr Poterai Gwezhira.\n\nShe was remanded in custody and will appear at Rusape Regional Court on April 4.\n\nAccording to the State, Mr Muchetus sister, Ms Simbiso Muchetu, returned the couples scotch cart to their homestead.\n\nThe couple exchanged words until they decided to call Ms Muchetu to resolve the matter.\n\nThe court heard that moments after Ms Muchetu left the couples place, Gwenzi fetched a bucket with hot water and poured it on her husband.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-10-680x380.jpg",
            "description": "A man from Majere Village in Buhera is battling for his life at Victoria Chitepo Hospital in Mutare after his wife scalded him with hot water following a heated dispute over the use of their scotch cart.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "Vendors protest over uncollected garbage at Mbare Vegetable Market",
            "url": "https://www.herald.co.zw/vendors-protest-over-uncollected-garbage-at-mbare-vegetable-market/",
            "content": "Diana Nherera\n\nVendors at Mbare Vegetable Wholesale Market are refusing to pay fees to the Harare City Council as garbage has not been collected over the past four months.\n\nWard 3 Councillor Simbarashe Chanachimwe revealed this during last weeks council meeting.\n\nHe said that there was rotten garbage at the market.\n\nThe only way to restore the markets reputation and functionality is through a comprehensive daily refuse collection strategy, he emphasised. People need gumboots to walk in the market.\n\nCouncillor Chanachimwe said new dumpsites are emerging in Mbare.\n\nHarare Mayor Jacob Mafume said affected areas need to be identified.\n\nLets improve it and ensure regular collection, he said.\n\nWe need to ensure that the garbage goes where its supposed to go.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/01/Vendors.jpg",
            "description": "Vendors at Mbare Vegetable Wholesale Market are refusing to pay fees to the Harare City Council as garbage has not been collected over the past four months.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "President hands over US$7,4 million farm equipment to youths",
            "url": "https://www.herald.co.zw/president-hands-over-us74-million-farm-equipment-to-youths/",
            "content": "Online Reporters\n\nIn a move that seeks to empower young people in agriculture, President Mnangagwa has handed over 72 high-tech tractors and 10 combine harvesters valued at US$7,4 million to youth agricultural groups from various provinces.\n\nThe official handover ceremony, held at the Agricultural Mechanisation Facility in Hatcliffetoda, is a follow-up to the Presidential Youth Empowerment Scheme that was recently launched, with the President pledging to pay 50 percent of the total cost of the equipment.\n\nThe event also saw each province receiving a borehole-drilling rig to accelerate the establishment of irrigation systems in Youth Business Units.\n\nThe Government is buying the agricultural equipment from Belarus to resell to farmers under flexible financing terms through Empower Bank.\n\nThe terms include a three-year repayment period with no collateral required and an interest rate of just 7,5 percent per annum.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/03/a3982002-2819-40fa-8bd4-cd04d17c60fb-680x380.jpg",
            "description": "In a move that seeks to empower young people in agriculture, President Mnangagwa has handed over 72 high-tech tractors and 10 combine harvesters valued at US$7,4 million to youth agricultural groups from various provinces.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "Firm stopped from mining in Makonde",
            "url": "https://www.herald.co.zw/firm-stopped-from-mining-in-makonde/",
            "content": "Nyore Madzianike\n\nTHE High Court has ordered Angel Hill Mining Private Limited, a Chinese mining company, to immediately halt its mining and desilting activities along Angwa River in Makonde District, Mashonaland West Province.\n\nThe ruling was made as the company failed to obtain an Environmental Impact Assessment (EIA) certificate from the Environmental Management Agency (EMA).\n\nHigh Court judge, Justice Tawanda Chitapi, has set conditions for the mining company to resume its activities.\n\nHe ruled that the company can only resume its operations after it has obtained the EIA certificate and approval from EMA to mine in the area.\n\nIn his application, the EMA director general argued that the Chinese company was operating illegally and should cease its activities until it gets authorisation.\n\nIn his ruling, Justice Chitapi emphasised the legal requirement for an EIA certificate.\n\nIn my view, the applicant was entitled to the interdict he seeks because, as it stands, the respondents operations are being conducted outside the law, Justice Chitapi stated.\n\nThe court cannot permit the continuation of an illegality if it has been established.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2021/07/high-court-of-zimbabwe-01.jpeg",
            "description": "THE High Court has ordered Angel Hill Mining Private Limited, a Chinese mining company, to immediately halt its mining and desilting activities along Angwa River in Makonde District, Mashonaland West Province.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "13 companies honoured at Chitungwiza Trade Fair",
            "url": "https://www.herald.co.zw/13-companies-honoured-at-chitungwiza-trade-fair/",
            "content": "Diana Nherera\n\nOLD Mutual and Nyaradzo Life Assurance Company emerged as standout exhibitors at the Chitungwiza Trade Fair, earning top honours for Best Financial Advisor and Best Funeral Provider, respectively.\n\nYoung Africa was recognised for Best Educational Stand, while Kunaka won Best SME in Chitungwiza. Probfix Financial Services took home the award for Best Microfinance Institution.\n\nOther winners included Croc Security for Best Security Stand, Knock Out for Best Home Use Product, and Azam TV for Best Home Entertainment Exhibitor.\n\nFlorida Engineering was named Best Renewable Energy Exhibitor, Bethel Events won Best Events Exhibitor, and Telecel claimed the title of Best Telecom Network Operator.\n\nUtsanzi was recognised as Best Newcomer, while Zimra secured the award for Best Government Agency Stand.\n\nSpeaking at the awards ceremony at Chitungwiza Town Centre last week, Chitungwiza Trade Fair executive Mr Lexie Mrewa praised the exhibitors for their contributions to the local economy.\n\nLet us continue to expand our reach and attract more customers. While Chitungwizas official population is 400 000, the Chitungwiza Publicity Association estimates it could be as high as 1.5 million. If you attract even five percent of that, you have a strong customer base to sustain your business, he said.\n\nMr Mrewa said Chitungwiza is a dynamic hub of talent and opportunity.\n\nChitungwiza is a source of markets, talent, and innovation. Some of Zimbabwes largest churches and most celebrated musicians started here. While there are challenges, there is also immense potential. I urge you to see Chitungwiza as a powerful economic force, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-9-680x380.jpg",
            "description": "OLD Mutual and Nyaradzo Life Assurance Company emerged as standout exhibitors at the Chitungwiza Trade Fair, earning top honours for Best Financial Advisor and Best Funeral Provider, respectively.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "Vee Mampeezy plans solo show in Bulawayo",
            "url": "https://www.herald.co.zw/vee-mampeezy-plans-solo-show-in-bulawayo/",
            "content": "Langalakhe Mabena\n\nZimpapers Arts and Entertainment Hub\n\nBOTSWANA music star Vee Mampeezy, famed for his hit song Taku Taku, has announced plans for a solo concert in Bulawayo following the overwhelming support he received at the SWAN Music Festival this past weekend.\n\nThe festival, held at White City Stadium, saw Mampeezy share the stage with top artistes, including Alick Macheso, Awa Khiwe, Winky D, Kwesta, and Toss.\n\nReflecting on his deep connection with Bulawayo, Mampeezy, born Odirile Ishmael Sento, revealed that the city was the first in Zimbabwe to embrace him when he performed there two decades ago.\n\nI was amazed by the love and energy at White City Stadium. The crowd knew almost every song, and it was emotional to see that Bulawayo still supports me after all these years, he said.\n\nMy first international gig outside Botswana was here in Bulawayo, and the support has never wavered. To show my gratitude, I want to host a solo concert to celebrate this bond.\n\nThe musician expressed his love for Zimbabwe, adding that he is eager to collaborate with local promoters to make the event a reality.\n\nMampeezy launched his music career at 16, releasing his debut album Kasi Angels in 2001, which became an instant hit.\n\nHis signature blend of kwaito, gospel, and house music has earned him a loyal fan base across Africa.\n\nHe cites legendary figures like the late Brenda Fassie, Hugh Masekela, and Oliver Mtukudzi as key influences.\n\nMampeezy has collaborated with several top African artistes, including the late kwaito icon Mandoza and Nigerian dancehall star Patoranking.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/04/Untitled-8-680x380.jpg",
            "description": "BOTSWANA music star Vee Mampeezy, famed for his hit song \"Taku Taku\", has announced plans for a solo concert in Bulawayo following the overwhelming support he received at the SWAN Music Festival this past weekend.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "Jasen Mphepo challenges comedians to support each other",
            "url": "https://www.herald.co.zw/jasen-mphepo-challenges-comedians-to-support-each-other/",
            "content": "Trust Khosa\n\nZimpapers Arts and Entertainment Hub\n\nVETERAN theatre practitioner Jasen Mphepo has challenged stand-up comedians to foster a culture of mutual support by attending each others shows.\n\nMphepo, who hosts various shows at the Jasen Mphepo Little Theatre in Harare, said many established comedians do not support emerging talent.\n\nI have observed a troubling trend where seasoned comedians rarely attend shows featuring upcoming performers. They dont show up to cheer them on, he said.\n\nHe contrasted this with the music industry, where established artists routinely support their peers.\n\nMusicians have created a positive tradition of attending each others performances, especially during family shows. Prominent figures like producer Clive Mono Mukundu often show up, celebrate peers.\n\nMphepo said unity among comedians is crucial for the industrys growth.\n\nIn the spirit of camaraderie and professionalism, we expect comedians to uplift each other by attending shows. Their presence alone can elevate a young performers event, he noted.\n\nIf comedians dont support each other, fans wont take them seriously. Collaboration is essential for growth and strengthening the entertainment landscape.\n\nMphepo has long championed young talent at his theatre, recently hosting rising comedy stars such as Josh Mukahanana, Mike Chipere, Munya Guramatunhu, David Chimusoro, and Tinotenda Kurwaisimba.\n\nBy promoting mutual support, he hopes to cultivate a thriving comedy industry.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2016/05/2605-1-1-JASENMPHEPO.jpg",
            "description": "VETERAN theatre practitioner Jasen Mphepo has challenged stand-up comedians to foster a culture of mutual support by attending each other’s shows.",
            "time": "21:27",
            "date": "02 Apr 2025"
        },
        {
            "title": "Macheso, Soma pre-Independence bash on cards",
            "url": "https://www.herald.co.zw/macheso-soma-pre-independence-bash-on-cards/",
            "content": "Trust Khosa\n\nZimpapers Arts and Entertainment Hub\n\nAs the build-up to the 45th Uhuru Celebrations gathers momentum, sungura musicians Alick Macheso and Somandla Mafia Ndebele are eager to deliver an unforgettable experience for their fans.\n\nThis dynamic duo, known for their electrifying performances, will once again take to the stage together on April 11 for a pre-Independence bash at Warras Park in Glen View, Harare.\n\nIn a recent interview, representatives from Machesos camp expressed their enthusiasm for the upcoming event.\n\nWe are already immersed in the spirit of celebrating Independence Day, remarked Tichaona Makahamadze, Machesos publicist.\n\nOn the 11th of April, we will undoubtedly usher in the Independence mood with a spectacular double act alongside Somandla Ndebele. Our series of joint shows has been overwhelmingly well-received, and fans have truly embraced this collaboration.\n\nWe cant wait for the big day and encourage everyone to come out in their large numbers to enjoy the festivities.\n\nMakahamadze urged Zimbabweans to take pride in their heritage during this significant month.\n\nApril holds a special place in our hearts as we celebrate Independence Day. Its the perfect time for us all to reflect on who we are and honour the sacrifices made by our freedom fighters, he added.\n\nNdebele said their joint show will be a special occasion.\n\nI am proud to be Zimbabwean, and I cant wait to celebrate this day with my fellow citizens. Our pre-Independence Day gig on April 11 alongside my brother Alick Macheso will be a special occasion. We are committed to giving our fans a memorable treat, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2019/08/2908-1-1-MACHESO-1.jpg",
            "description": "As the build-up to the 45th Uhuru Celebrations gathers momentum, sungura musicians Alick Macheso and Somandla “Mafia” Ndebele are eager to deliver an unforgettable experience for their fans.",
            "time": "21:27",
            "date": "02 Apr 2025"
        }
    ]
}