{
    "news": [
        {
            "title": "Discipline key, says President. . .Slams disrespect of leadership at public events",
            "url": "https://www.herald.co.zw/discipline-key-says-president-slams-disrespect-of-leadership-at-public-events/",
            "content": "Zvamaida Murwira, Senior Reporter\n\nPresident Mnangagwa has warned people who put on Zanu PF regalia, but then go on to deviate from the principles the revolutionary party stands for through indiscipline such as disrespect of leadership, especially at public events.\n\nHe said Zanu PF values discipline as a cornerstone of its survival and everyone was duty-bound to uphold discipline.\n\nThe President said this on Monday at an interactive meeting with editors from the public and private media at State House.\n\nHe made the remarks after being asked on the apparent disrespectful conduct shown by some Zanu PF supporters and some members of the public, who sometimes seek to denigrate the party leadership, particularly the Presidium at national events such as burials of national heroes at the National Heroes Acre.\n\nI am so happy; this is the vibrancy of democracy. The foolish and the wise both have their day. I think those who really are Zanu PF at heart go by the rules and decorum of Zanu PF.\n\nWe have other people who are in Zanu PF, who in themselves are not Zanu PF, but they dress in Zanu PF regalia, so you must always see when people talk and see which camp they belong to when they open their mouths, said President Mnangagwa.\n\nTurning to political developments on the globe, the President said the decision by the United States administration led by President Donald Trump to impose sanctions against South Africa for its policy to embark on land reform would not affect the region, but would galvanise Pretoria and the region as a whole to work hard.\n\nI can assure you that those who impose sanctions on other countries should have learnt a lesson. Zimbabwes growth was faster when we were under sanctions than before sanctions.\n\nSo, if you want an economy to grow faster, impose sanctions. So we are a good lesson, we have developed and grew our economy under sanctions and I do not think that South Africa would be an exception.\n\nSouth Africa is a solid country with a solid economy based on its resources and I have belief that the people of South Africa are rooted in South Africa themselves.\n\nThe outside world can only assist what the South Africans themselves can do for their country. So do not lose sleep about people imposing sanctions on others, said President Mnangagwa.\n\nOn the efforts being pursued to resolve the countrys debt arrears, the President said there will eventually be a reflection on achievements made, given that African Development Bank (AfDB) president, Dr Akinwumi Adesinas term at the bank was coming to an end this year.\n\nDr Adesina is the Champion of Zimbabwes arrears clearance and debt resolution process while former Mozambican President Joachim Chissano is the high level facilitator.\n\nWe are still in that process; our facilitator is still engaged in that process. Everything possible is being done and we shall know what achievement we will have at the end of his term and we will pick it from there, said President Mnangagwa.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-5.jpg",
            "description": "Zvamaida Murwira, Senior Reporter President Mnangagwa has warned people who put on Zanu PF regalia, but then go on to deviate from the principles the revolutionary party stands for through indiscipline such as disrespect of leadership, especially at public events. He said Zanu PF values discipline as a cornerstone of its survival and everyone was […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "Fourth food distribution blitz underway",
            "url": "https://www.herald.co.zw/fourth-food-distribution-blitz-underway/",
            "content": "Herald Reporter\n\nThe fourth Food Distribution Blitz is underway, having started on February 1 and is expected to end next month as the Second Republic ensures no one will starve, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere, has said.\n\nSpeaking at yesterdays post-Cabinet media briefing, Dr Muswere said Cabinet considered and noted the Report on the Food Deficit Mitigation Programme as presented by Public Service, Labour and Social Welfare Minister, Edgar Moyo.\n\nThe third blitz in terms of food distribution commenced on the 1st of November, 2024 and ended on the 31st January 2025, with deserving people having received assistance, he said.\n\nThe Government of Zimbabwe has distributed over 90 percent of the total grain to food insecure and vulnerable households while development partners distributed 10 percent.\n\nThe 4th Blitz Food Distribution Phase commenced on 1st February and is expected to end on 31st March, 2025. The Government of Zimbabwe will undertake the First Round Crop Assessment to determine the likely harvest and the outlook is positive.\n\nLast year, President Mnangagwa declared the El-Nino induced drought, which decimated the countrys grain output, a state of disaster and activated the Government machinery to render assistance to the affected households to ensure no one starved.\n\nThe Government also appealed for assistance from development partners who have also been chipping in with food relief.\n\nSince April last year when President Mnangagwa declared a state of disaster following the poor harvest, the Government, with support from development partners, has been feeding the people across the country.\n\nDr Muswere also gave an update on the Presidents recent working visit to Ethiopia where he attended the African Union Summit.\n\nZimbabwe participated in a number of bilateral and sideline meetings on the margins of the 38th African Union Summit.\n\nHe said President Mnangagwa met the United Arab Emirates Minister of State for Foreign Affairs and emphasised that Zimbabwe was open for business.\n\nThe President also met President Daniel Chapo of Mozambique and held bilateral discussions.\n\nThe two leaders reaffirmed the existing excellent Government-to-Government and party-to-party relations.\n\nThe Zimbabwe delegation also met Ethiopian Foreign Minister Gedion Timothewos.\n\nThe two countries agreed to resume the Joint Permanent Commission of Cooperation in Addis Ababa this year, said Dr Muswere.\n\nDuring the summit, President Mnangagwa led discussions on vital regional issues, notably the ongoing peace and security challenges in Sudan and the Eastern Democratic Republic of Congo (DRC).\n\nAs chairperson of SADC, he advocated a unified peace process and humanitarian access in the DRC, reinforcing the regions commitment to sovereignty and territorial integrity.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/CB1.jpg",
            "description": "Herald Reporter The fourth Food Distribution Blitz is underway, having started on February 1 and is expected to end next month as the Second Republic ensures no one will starve, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere, has said. Speaking at yesterday’s post-Cabinet media briefing, Dr Muswere said Cabinet considered and noted the […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "City bigwigs’ salaries gobble US$500k monthly",
            "url": "https://www.herald.co.zw/city-bigwigs-salaries-gobble-us500k-monthly/",
            "content": "Blessings Chidakwa, erald Reporter\n\nHarare City Council is shelling out about US$500 000 a month towards salaries for executives, with the town clerk receiving a monthly salary of US$27 000, which can increase to US$30 000 with additional perks while the least-paid executive earns US$15 000 per month.\n\nNone of these salaries and perks have the approval of the Local Government Board, the Commission of Inquiry into Harare Citys affairs heard yesterday.\n\nIn addition, directors who reportedly have no pay slips, spent US$124 000 on foreign trips last year alongside US$1 million on high-end vehicles during the 2023 election period.\n\nThe commission, chaired by retired Justice Maphios Cheda, learnt that suspended town clerk Hosiah Chisango was allocated US$18 000 for a trip to Dubai while another director, Engineer Isaac Chawatama, received US$15 000.\n\nDuring proceedings before the commission of inquiry, Harare Mayor Councillor Jacob Mafume disclosed that the monthly wage bill for top management amounts to around US$500 000.\n\nClr Mafume surprised the commission by stating that top management salaries were closely guarded secrets.\n\nHe recounted an incident where he requested a report on salaries from the human resources director, who refused to provide it, citing instructions from the town clerk.\n\nHe then showed me the document in confidence, and from what I saw, the highest-paid executive is receiving US$27 000 while the lowest is getting US$15 000, he said.\n\nClr Mafume noted that the highest-paid executives salary could reach US$30 000, including perks, and described the relationship between his office and the executive as fractured, as he is frequently accused of overstepping his powers as a ceremonial mayor.\n\nI was just shown the salaries and there are no pay slips. Executive salaries take US$500 000 monthly, not approved by the Local Government Board and the parent Ministry, he stated.\n\nThe commission also heard that the citys lack of an enterprise resource planning (ERP) system, a modern financial system for high-end businesses and entities, is largely due to the financial illiteracy and mismanagement of councillors.\n\nEvidence leader Mr Thabani Mpofu questioned Clr Mafume about the councillors role in passing a resolution that led to the termination of the BIQ billing system that was supplied by South African firm Quill Associates.\n\nIf all councillors work in unison, the council should have had an ERP, right? Were it not for the council resolution, BIQ should have not been terminated? asked Mr Mpofu.\n\nClr Mafume responded: I objected to the decision to terminate BIQ when a resolution was made. I was just a councillor, not the mayor.\n\nHowever, Mr Mpofu insisted there is overwhelming evidence of mismanagement among councillors, highlighting past Audit Committee chairperson Clr Blessing Dumas admission of financial illiteracy.\n\nThe commission also pressed Clr Mafume on issues such as non-functional traffic lights, potholed roads, and the proliferation of service stations in residential areas.\n\nAlthough verbal submissions for the Commission of Inquiry into Harares affairs concluded yesterday, individuals can still submit written affidavits, as the commission has three months to compile its report to President Mnangagwa, the appointing authority.\n\nClr Mafume was the final witness to testify and was convicted for lying under oath about his residential address.\n\nJustice Cheda, who fined Clr Mafume US$300 or a three-month jail term wholly suspended, thanked all witnesses and stakeholders involved in the evidence gathering process.\n\nThe gathering of evidence from this commission has come to an end. We will then adjourn and deliberate on presentations and submissions that were given by the witnesses, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Mafume-1.jpg",
            "description": "Blessings Chidakwa, erald Reporter Harare City Council is shelling out about US$500 000 a month towards salaries for executives, with the town clerk receiving a monthly salary of US$27 000, which can increase to US$30 000 with additional perks while the least-paid executive earns US$15 000 per month. None of these salaries and perks have […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "All set for Youth Day celebrations",
            "url": "https://www.herald.co.zw/all-set-for-youth-day-celebrations-2/",
            "content": "Nqobile Tshili, Bulawayo Bureau\n\nALL is set for the hosting of the National Youth Day commemorations in Bulawayo this Friday with President Mnangagwa leading proceedings amid expectations the event would spotlight key youth empowerment programmes and investments ushered in by the Second Republic as part of its inclusive development agenda.\n\nThe National Youth Day is commemorated annually on February 21 and this year the event will be held at the Zimbabwe International Exhibition Centre (ZIEC) on account of precautionary measures in view of likely heavy rains.\n\nThousands of youths from across the country are expected to attend the gathering, which will run under the theme: Empower youth: Secure the future.\n\nExcitement has already gripped the city ahead of the programme amid high hopes the programme will inspire young people and deliver solutions to some of the challenges facing the country while unlocking opportunities for the youths.\n\nSpeaking ahead of the event, Bulawayo Metropolitan Provincial Affairs and Devolution Minister Judith Ncube, said the province is ready to host the National Youth Day commemorations.\n\nOn Monday we had a preparatory meeting for the National Youth Day commemorations. Due to the prevailing weather conditions we resolved that we move the venue for the event from Barbourfields Stadium to ZITF grounds (ZIEC). But preparations are moving swiftly and we are happy with the progress so far, said Minister Ncube.\n\nShe said hosting another national event is very significant for the City of Bulawayo as it speaks to local development.\n\nIts very important for Bulawayo to be hosting such national events. It gives us the opportunity to show our capabilities and capacity. While we might not have adequate accommodation we have proved to be capable of hosting these national events, she said.\n\nIm challenging young people to come in their numbers and showcase the Bulawayo culture.\n\nMinister Ncube said tomorrow (Thursday) stakeholders involved in youth programming will be showcasing their projects and it will be essential for young people to participate in them. She said issues to do with drugs and substance abuse will be tackled during the engagements.\n\nMilestone investment in education are some of the areas where the Government has empowered young people, some whom have been capacitated to start their own business projects.\n\nHigher and Tertiary Education, Innovation, Science and Technology Development Permanent Secretary, Professor Fanuel Tagwira, said universities and colleges have prepared thorough knowledge and technical skills for them to compete in the 21st century.\n\nThrough Heritage Education 5.0, universities and polytechnic colleges provide students with a solid foundation in their chosen field, equipping them with theoretical knowledge, practical skills and entrepreneurial mind set, he said. Polytechnic colleges, in particular, focus on providing hands-on training in technical fields that enable young people to go and start businesses, said Prof Tagwira.\n\nStudents were introduced to critical and problem solving as part of their development.\n\nUnder President Mnangagwas leadership universities this year had been mandated to ensure students innovations can be commercialised.\n\nIn 2025, President Mnangagwa has directed the ministry to support commercialisation of student prototypes and ideas from innovation hubs into start-up businesses that can create employment, he said.\n\nBy providing young people with a comprehensive education, practical skills, and personal development opportunities, our universities and polytechnic colleges empower them to succeed in their careers, make meaningful contributions to society, and become active, responsible citizens, said Prof Tagwira.\n\nHe said the introduction of innovation hubs at institutions of higher learning had been prioritised to promote critical thinking, analysis, and problem-solving, thereby helping students develop essential life skills.\n\nProf Tagwira said students were encouraged to collaborate and build strong relationships with peers, as well as mentors while developing leadership skills.\n\nMost of our universities and colleges now offer opportunities for students to take on leadership roles, participate in extracurricular activities, and develop entrepreneurial skills. All our Universities and colleges in Zimbabwe offer strong industrial internship programmes, providing students with valuable learning experience and job opportunities. Institutions offer career counseling services, helping students explore their interests, identify career paths, and create personalised career plans, said Prof Tagwira.\n\nGovernment was also cognisant that some students might be handicapped to pay their tertiary fees hence the work for fees programme being rolled at all the institutions.\n\nStudents in tertiary institutions face challenges of raising fees for their studies. The Government has started a work study programme in all our universities and colleges to make sure no child fails to get higher education because of the circumstances of the parents, said Prof Tagwira.\n\nStudents with disabilities tend to get disadvantaged by their physical condition. Government has now come up with a programme of providing assistive devices to such students to enhance their learning.\n\nProf Tagwira said the Government encouraged students to be part of alumni communities, which have also become a key enabler for professional growth through networking.\n\nInstitutions of higher learning provided platforms for young people to address social issues including drugs and substance abuse.\n\nUniversities and polytechnic colleges foster diverse and inclusive environments, promoting cross-cultural understanding, empathy, and social responsibility.\n\nWith the current drug menace in Zimbabwe our Institutions offer counseling services, support groups, and wellness programmes to promote students mental health and overall well-being, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/06/Minister-Judith-Ncube.jpg",
            "description": "Nqobile Tshili, Bulawayo Bureau ALL is set for the hosting of the National Youth Day commemorations in Bulawayo this Friday with President Mnangagwa leading proceedings amid expectations the event would spotlight key youth empowerment programmes and investments ushered in by the Second Republic as part of its inclusive development agenda. The National Youth Day is […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "Three drug rehab centres established",
            "url": "https://www.herald.co.zw/three-drug-rehab-centres-established/",
            "content": "Rumbidzayi Zinyuke, Senior Reporter\n\nTreasury has released ZiG800 million for the national drug and substance abuse response programme this year, part of which will be used to operationalise three new rehabilitation centres established in Victoria Falls, Bulawayo and Kwekwe.\n\nWith more than 70 percent of patients admitted in public mental health institutions being drug and substance abuse-related, there have been calls for the Government to increase the capacity of institutions to be able to meet the demand.\n\nThe establishment of the rehabilitation centres complements the roll out of measures aimed at addressing the drivers of the scourge, including supply of drugs and substances.\n\nAddressing questions during the post-Cabinet briefing in Harare yesterday, Minister of Skills Audit and Development Professor Paul Mavima said the Drug and Substance Abuse Taskforce was now awaiting the release of the funds from Treasury to start programmes.\n\nWe are now just waiting for the release of funds from the Treasury to kick-start our programmes, including for purposes of making sure that our new rehabilitation centres are resourced with equipment, the necessary staff and in cases where there is need for medication, they are also provided with medicines, he said.\n\nHowever, the amount allocated through this years National Budget is expected to be complemented by the private sector.\n\nTo this end, Prof Mavima said a high-level event would be held bringing together stakeholders from Government and private sector to support the national response.\n\nWe have a whole-of-society approach so we have participants from the private sector, from the non-governmental sector, from churches, from traditional leaders in this task force and we want also to see the same representation in terms of the resources that are contributed in fighting against the demands of drug and substance abuse, he said.\n\nWhile the capacity of the three new rehabilitation centres was yet to be ascertained, the services to be provided were expected to reach thousands of people affected by the scourge.\n\nThe Inter-Ministerial Taskforce on Drug and Substance Abuse was established to address issues of prevention, care, harm reduction, treatment, and law enforcement on the supply of drugs after over half of households identified drug and substance abuse as one of the major challenges affecting youths during the Zimbabwe Livelihoods Assessment.\n\nInformation, Publicity and Broadcasting Services Minister Dr Jenfan Muswere said between September 1 last year and January 31 this year, 79 illegal drug bases were destroyed, with 9 527 offenders arrested.\n\nOf this total, 616 were suppliers while 8 911 were end users. Collaboration with the international law enforcement agencies led to the arrest of three people carrying 23 kilogrammes of dagga in Zambia. The Medicines Control Authority of Zimbabwe conducted 117 inspections and closed five non-compliant premises, he said.\n\nTo address some of the root causes of the scourge, he said 155 421 youth had benefited from vocational training programmes.\n\nThe Ministry of Primary and Secondary Education has also integrated drug and substance abuse into the school curriculums, reaching 7,2 million learners, while 62 656 students were engaged in prevention programmes through the Ministry of Higher and Tertiary Education, Innovation, Science and Technology Development.\n\nThrough the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, awareness programmes were conducted, reaching 111 537 people.\n\nThe nation is also informed that the Ministry of Sport, Recreation and Arts engaged 11 836 participants in cultural and sports events, while religious organisations educated 16 759 congregants through sermons and awareness programmes. Entities such as Visionary Cadres Association of Zimbabwe and Mubatirapamwe reached over 2 130 people with drug abuse prevention messages.\n\nThe Ministry of Health and Child Care, Zimbabwe Prisons and Correctional Services and partners enhanced rehabilitation programmes, serving 19 new patients in prison.\n\nThe private sector and diaspora community are invited to invest in the establishment of rehabilitation centres, Dr Muswere said.\n\nHe said that 13 695 people had received psycho-social support to assist with reintegration, while 886 individuals were reintegrated into their families.\n\nAt least 6 000 parents attended parenting sessions and 1 161 people were reached through the online support platform.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2020/05/0105-1-1-PROFESSORPAUL-MAVIMA-680x380.jpg",
            "description": "Rumbidzayi Zinyuke, Senior Reporter Treasury has released ZiG800 million for the national drug and substance abuse response programme this year, part of which will be used to operationalise three new rehabilitation centres established in Victoria Falls, Bulawayo and Kwekwe. With more than 70 percent of patients admitted in public mental health institutions being drug and […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "Presidential War Vets Fund taken to Mash West",
            "url": "https://www.herald.co.zw/presidential-war-vets-fund-taken-to-mash-west/",
            "content": "Walter Nyamukondiwa and Trust Freddy\n\nMashonaland West has become the latest recipient of a US$150 000 Presidential War Veterans Fund provincial allocation, bringing the total disbursement to US$1,5 million, as the Second Republic delivers on its promise to support the countrys liberation heroes.\n\nThis is not the last programme, as another one targeting war collaborators will be launched next week while housing and borehole drilling schemes will also be rolled out to all the provinces.\n\nThe programme, spearheaded by Dr Paul Tungwarara, who is Special Presidential Investment Advisor to the United Arab Emirates, aims to provide interest-free loans to war veterans, enabling them to start businesses and improve their livelihoods.\n\nHundreds of people yesterday gathered at Newlands Primary School in Banket, Zvimba North Constituency, Mashonaland West, to witness the official launch of the Presidential War Veterans Fund and the drilling of a borehole as the schemes move a gear up.\n\nAs of yesterday, 10 boreholes had been drilled for war veterans and five houses built in Mashonaland West alone and 100 war veterans from each province are expected to benefit from the housing scheme.\n\nMashonaland West Minister of State for Provincial Affairs and Devolution Marian Chombo said: I am grateful for the support that the Government continues to give to our war veterans.\n\nWe all agreed as a Government that no war veteran should lose their land while they are still alive, and even after death.\n\nIf such incidents occur, we urge you to report them. I am happy that the programme is being launched close to the area where the Famous Seven started the war.\n\nMinister Chombo said President Mnangagwa had demonstrated he valued the freedom fighters.\n\nMashonaland West is developing in line with President Mnangagwas aspirations of leaving no one and no place behind. Government has been supportive of the war veterans and on our part we are ensuring that none of them is dispossessed of land, she said.\n\nDr Tungwarara said he was unperturbed about the ongoing criticism being levelled against the War Veterans Fund.\n\nWe are not worried, we do not care, and we are not trying to please anyone. Instead, we are focusing on delivering and doing what is supposed to be done. The war veterans need to be empowered. Lets just watch the space and not talk too much. I believe in talking less and taking more action, and letting our work speak for itself.\n\nDr Tungwarara was excited to launch the fund in Mashonaland West the province where the Famous Seven freedom fighters were the first to engage in combat with Rhodesian soldiers.\n\nSome people were mocking the houses we built on social media, but we really appreciate it because we learn from their criticism and we have since improved the houses we are building based on their criticism.\n\nVeterans of the Liberation Struggle Affairs Deputy Minister Headman Moyo said: As a Ministry, we are committed to supporting the welfare of war veterans, and we are grateful that after the President noticed the Government was being overwhelmed, he appointed Dr Tungwarara to support us as a Ministry.\n\nDr Tungwarara has been delivering on his promises, and we appreciate his efforts in driving the empowerment schemes for war veterans, which is in line with the Presidents vision for a better future\n\nDeputy Minister Moyo said war veterans from the provinces had agreed that President Mnangagwa should continue in office up to 2030.\n\nMashonaland West Provincial chairperson, Cde Mary Mliswa-Chikoka said the province had been eagerly waiting for the launch of the fund.\n\nThe President has demonstrated that he cares about the people and has not forgotten those he fought with in the war of liberation.\n\nThe overall fund is expected to grow to US$10 million by June this year, with each province set to receive US$1 million.\n\nSecretary for War Veterans in the Politburo, Cde Douglas Mahiya said: I am praying for the 2030 vision to sail through. The support we are receiving has never happened in the past 40 years, but the President is now saying that all war veterans must be included in the development of the nation and contribute meaningfully to the economy.\n\nWe are grateful as war veterans because this programme is ongoing, and we should continue to shower praise and send messages of gratitude to the President about these programmes.\n\nWe are thrilled that war veterans are benefiting from the housing scheme, as some had not managed to build a decent house since 1980.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/WV.jpg",
            "description": "Walter Nyamukondiwa and Trust Freddy Mashonaland West has become the latest recipient of a US$150 000 Presidential War Veterans Fund provincial allocation, bringing the total disbursement to US$1,5 million, as the Second Republic delivers on its promise to support the country’s liberation heroes. This is not the last programme, as another one targeting war collaborators […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Exploitation of Invictus gas field moves closer",
            "url": "https://www.herald.co.zw/editorial-comment-exploitation-of-invictus-gas-field-moves-closer/",
            "content": "The steady progress being made in the exploration and exploitation of what is now known to be a very large natural gas field in Zimbabwes Cabora Basa Basin reached another milestone recently with the necessary approvals for the environmental and social impact assessment for Invictus Energy.\n\nThis allows Invictus to start pilot gas production at the Mukuyu field section and start earning income from the find. The initial pilot production is to supply gas to a new power station at Eureka Gold Mine, which is about 60km to the gas field and so an ideal starting point for commercial exploitation.\n\nThis would be Zimbabwes first gas power station. No details have been given as to whether the pilot power station would be at the mine, so a short gas pipeline would be required, or whether it will be on the Mukuyu field with the necessary electricity grid extension to connect to the mine.\n\nPresumably this is still being worked out by Invictus, Dallaglio who is Eurekas owner, and Himoinsa SA who have been contracted as the Eureka power provider.\n\nWe can probably expect some fairly rapid development as a gas power station can be built in a matter of months. A gas power station unit is basically a jet engine connected to a generator in a shed with a transformer to have the output at the correct voltage. Several suppliers offer the necessary equipment almost off the shelf.\n\nThe longest delay may well be the construction of the short pipeline or the short length of electrical grid, rather than the pilot power station unit.\n\nThe acceptance by the Environmental Management Authority of the impact assessment shows that Invictus is willing to follow the rules, largely to minimise environmental damage and ensure safety to surrounding communities.\n\nThe assessment also deals with the longer-term effects and what is needed to rehabilitate that minimum of environmental damage.\n\nAs Invictus has shown, it is considerably better and easier to work out all the problems and lay down solutions in advance, rather than have to clean up an environmental mess or disaster later on because no one worked through the development when they should have done.\n\nThe EMA is not unreasonable, but is charged with making sure that while development takes place for the growth of the nation, this development produces the minimum in damage.\n\nInvictus are also keen to as commercial extraction of gas starts, to be able to liquefy this gas and transport it to markets.\n\nAs has been clear all along, the main product from the Cabora Basa basin, at least at the beginning, will be natural gas although the condensates from the heavier hydrocarbons will be commercially useful in time.\n\nThe main market for the initial gas extraction needs to be electric power, Zimbabwes economy is growing at a fast clip and already the demand for electricity exceeds supply, and although the six older units at Hwange Thermal can be refurbished or rebuilt, and more units can be added, the country urgently needs another major power station.\n\nThe risks of severe drought in the upper Zambezi catchment means that Zimbabwe and Zambia can no longer rely on their Kariba power stations to the degree that they have for the past 60 years, and the building and commissioning of a dam and a pair of hydro-electric power stations in the Batoka Gorge now appears to be an extremely risky business venture, so risky that no one is pursuing what was once regarded as the obvious next major investment.\n\nGas power stations are still carbon burners, but the carbon footprint of a gas power station is about half that of an equivalent sized coal station, so using gas is a more environmentally friendly option. Even more importantly, a gas station is significantly cheaper than an equivalent coal station, since there is less machinery involved.\n\nWhile solar power is the obvious green source of power for Zimbabwe, there is the factor that it is only generated while the sun shines. While storage solutions exist, these are not really cheap. In any case there is need for a base of 24/7 power generation\n\nSo, once there is a guaranteed source of gas, the gas power station is the obvious option. The Invictus discoveries have shown that there is a guaranteed source of gas, and while Invictus want to drill more wells to explore the boundaries and potential yields of the gas fields that are now known to exist, they also want to start commercial drilling and exploitation of what is known.\n\nCommercial gas exploitation could also start providing raw materials for what should be a chemical industrial sector in Zimbabwe.\n\nThis starts with fertilisers, as we still have to import a large chunk of what we need. But the main source of ammonia and ammonia products production these days is natural gas, and that would make a huge dent in our import bills.\n\nIn fact Sable Chemicals expressed a few years ago interest in seeing a pipeline from the top end of Mashonaland Central to Kwekwe, so important can natural gas be as a raw material in so many chemical products, starting with the ammonia fertilisers.\n\nThis was just a declaration of interest, and again costing will decide whether it is more sensible to liquefy and truck the gas, or send it by pipeline.\n\nThe future major power station presents choices again, whether it should be built on the field with the grid connections and grid extensions to bring the power to where most users are, or whether it would be better to build the power station near an existing town, perhaps Bindura, and pipe the gas from the field to the power station.\n\nIn either case we hope that those responsible for Zimbabwes energy development are in contact with Invictus to work out the correct solution, so that as commercial gas supplies start being available we can use them properly and quickly.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/uhbg-680x380.jpg",
            "description": "The steady progress being made in the exploration and exploitation of what is now known to be a very large natural gas field in Zimbabwe’s Cabora Basa Basin reached another milestone recently with the necessary approvals for the environmental and social impact assessment for Invictus Energy. This allows Invictus to start pilot gas production at […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "CHEVRONS CLINCH SERIES . . . Curran’s maiden ton inspires Zim to record win",
            "url": "https://www.herald.co.zw/chevrons-clinch-series-currans-maiden-ton-inspires-zim-to-record-win/",
            "content": "Brandon Moyo, Zimpapers Sports Hub\n\nBEN CURRANS maiden One Day International century propelled Zimbabwe to a commanding and yet rare nine-wicket victory over Ireland that helped the hosts clinch the three-match series at Harare Sports Club yesterday.\n\nThe 28-year-olds unbeaten ton, which featured contributions to two record-breaking partnerships, helped Zimbabwe secure the series 2-1.\n\nThe Chevrons controlled the match with the bat, ensuring that for the 20th time in the format, they chased a target exceeding 240 runs.\n\nCurran and his record-breaking opening partner, Brian Bennett, batted with intent from the start, putting on an entertaining display before captain Craig Ervine came in to continue the excellent batting show.\n\nStars had to align for an under-pressure Zimbabwean side, and fortune smiled early when, for the first time this series, Ervine won the toss and chose to field first.\n\nHis bowlers delivered, restricting Ireland to 240/6 before Zimbabwe comfortably chased down the target in just 39.2 overs, finishing on 246/1. This secured their first series win since 2023, when they defeated the Netherlands 2-1 in Harare.\n\nIt also marked the Chevrons joint-largest margin of victory by wickets, matching their nine-wicket win over Kenya in Bulawayo in 2002.\n\nCurran and Bennetts 124-run opening stand is now the joint seventh-highest first-wicket partnership for Zimbabwe in ODIs, tied with that of Grant and Andy Flower (vs New Zealand in 1992; vs Kenya in 1997).\n\nIt was also the first century opening stand for Zimbabwe in the past 10 years, with the previous one coming in 2014 when Sikandar Raza and Hamilton Masakadza put on 224 runs against Afghanistan at Queens Sports Club.\n\nAfter Bennett fell, Curran and Ervine had a 122-run stand for the second wicket, which is now the 10th-highest second-wicket partnership for Zimbabwe in ODIs.\n\nIn the 10th over, Curran smashed 15 runs off Josh Little, including three boundaries, setting up Zimbabwes best powerplay score in ODIs at 77/0, surpassing the previous best of 75.\n\nCurran, in just his sixth ODI for Zimbabwe, brought up his maiden century off 120 balls with a four. He also became the first member of the Curran family to score a century in international cricket.\n\nUnbelievable feeling, and also to get the series win is a big thing for us. Just happy to contribute. To be honest, I wouldnt say theres too much of a difference (in the games). I think in the first two games, I didnt face many balls in the Power Play and hit a couple of fielders, so it didnt quite necessarily go my way, but it was running smoothly as I would have liked. Luckily, today, I hit the gaps a couple of times for twos, and then all was good.\n\nUnbelievably a good feeling and very proud to be here representing Zimbabwe, said Curran.\n\nBennett finished the series with 247 runs from three innings at an impressive average of 82.33, etching his name into Zimbabwes cricketing history.\n\nHis tally in this series now stands as the third-highest by a Zimbabwean batter in a three-match ODI series, following Brendan Taylors 310 runs against New Zealand in 2011/12 and Sikandar Razas 252 runs against Bangladesh in 2022.\n\nI am just doing my best and doing one for the team, said Bennett.\n\nHeading into the decider, both Zimbabwe and Ireland fielded unchanged teams.\n\nZimbabwes bowlers did well to restrict Irelands scoring, claiming the first breakthrough in the seventh over when Richard Ngarava dismissed Paul Stirling for nine runs, caught by Johnathan Campbell.\n\nTrevor Gwandu then struck to remove Curtis Campher for 11 runs, also caught by Campbell, leaving Ireland on 42/2 in 13.3 overs.\n\nAndy Balbirnie and Harry Tector put together an 86-run partnership for the third wicket before Balbirnie was dismissed for 64 off 99 balls.\n\nTector fell in the 39th over for 51 off 84 balls, leaving Ireland on 159/4. Lorcan Tucker contributed 61 runs off 54 balls, but Blessing Muzarabani dismissed him, helping drag Ireland to a respectable total of 240/6. Ngarava and Gwandu picked up two wickets apiece, finishing with figures of 2/42 and 2/44, respectively, while Muzarabani (1/47) and Wellington Masakadza (1/58) claimed the other two wickets.\n\nZimbabwes chase started strongly, with Bennett and Curran playing aggressively, hitting boundaries.\n\nBennett would fall just two runs shy of his half-century, trapped in front by Graham Hume. Bennett departed for 48 off as many ball, bringing Ervine to the crease.\n\nThe captain brought up his 23rd half-century off 43 balls and scored the winning runs with a towering six.\n\nCurran remained unbeaten on 118 from 130 balls, while Ervine finished on 69 not out from 59 deliveries.\n\nHe was duly named Player of the Match, while Bennett was named Player of the Series.\n\nChevrons coach Justin Sammons was also naturally happy with the result.\n\nWe know weve come really close over the last few months.\n\nTheres been moments that could have gone our way that didnt, and thats obviously hurt us in a sense, said Sammons.\n\nIreland batter Paul Stirling felt that they lost the game at toss.\n\nAt sort of half way time I think we spoke about maybe 250 being the sort of minimum score and possibly getting 20 more than that but to be honest we knew the toss can be crucial here, said Stirling.\n\nUp next is a three-match T20I series, which kicks off on Saturday at the same venue.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/BEN-CURRAN.jpg",
            "description": "Brandon Moyo, Zimpapers Sports Hub BEN CURRAN’S maiden One Day International century propelled Zimbabwe to a commanding and yet rare nine-wicket victory over Ireland that helped the hosts clinch the three-match series at Harare Sports Club yesterday. The 28-year-old’s unbeaten ton, which featured contributions to two record-breaking partnerships, helped Zimbabwe secure the series 2-1. The […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "Beitbridge Hospital set for major upgrade",
            "url": "https://www.herald.co.zw/beitbridge-hospital-set-for-major-upgrade/",
            "content": "Thupeyo Muleya, Beitbridge Bureau\n\nBEITBRIDGE District Hospital is set for a major upgrade to meet modern service delivery needs and respond to growing demand in line with the transformation of the town into a city.\n\nDeputy Minister of Health and Child Care Dr Sleiman Kwidini toured the hospital yesterday and commended the towns growth in terms of population and infrastructure, which demands modern health services.\n\nThe 140-bed hospital is a referral centre for the 250 000 local population from more than 17 primary health care clinics. It is also a referral of at least 15 000 people who pass through the town in transit daily and several others from neighbouring districts, including Gwanda and Mwenezi.\n\nDespite the towns growth, the health facility is still operating with a skeletal staff establishment set in the 1990s. This has resulted in human and material resource gaps amid increased patient burden.\n\nWe appreciate the workload and operational challenges at this hospital, hence as the Government, we are going to urgently upgrade and expand the infrastructure and manpower to this hospital, said Deputy Minister Kwidini.\n\nSo far, in terms of medicines it is pleasing to note that the local pharmacy has between 55 and 60 percent of the basic medication for any medical facility.\n\nWe have also facilitated that more medication and consumables are delivered to this key health institution as a matter of urgency.\n\nHe said the expansion of the hospital would see more material and human resources being deployed to Beitbridge soon on a phased basis.\n\nGovernment is already working with other partners and has completed building a bigger pharmacy at the hospital, which will soon be opened for business.\n\nAs the Government, we have noted during our routine working visit that the hospital is strained in terms of resources due to the increased demand for services and its location in a transit town located between major highways leading to Harare and Bulawayo, said Deputy Minister Kwidini.\n\nSo, we want this hospital to be bigger than it is so that it may carry the burden of people transiting through this town and the local residents.\n\nWe want to boost its capacity to be able to contain any form of disaster as is the case with what they have been doing during major road accidents like the one that occurred last Thursday when we lost 25 lives and more than 40 others were injured.\n\nThe Deputy Minister reiterated the need to ensure the hospital was ready to handle any pressure including emergencies.\n\nOn equipment, its important that we put more diagnostic machines including the X-ray and laboratories, which will be delivered later this month with the support of the Global Fund, he said.\n\nIn the long run, the Government intends to expand all its health facilities around port towns so that they may be able to handle their local and transit populations.\n\nBeitbridge District medical officer Dr Lenos Samhere recently said they were handling an average of 350 baby deliveries monthly, which is more than what the provincial and other district hospitals are handling.\n\nWe are in the range of major referral centres like the United Bulawayo Hospitals, said Dr Samhere.\n\nWith regards to last Thursdays accident, Dr Samhere said most patients had been treated and discharged.\n\nWe are left with two people in the female ward and one will be discharged later today while the other one will be transferred for specialised treatment, said Dr Samhere.\n\nFollowing the road traffic accident, we admitted 23 patients in the female ward where one died, 14 were transferred to other hospitals for specialised treatment and six were discharged and we are remaining with two, he said.\n\nIn the male ward, we admitted 21 patients, six were transferred for specialised treatment, two died and 13 were discharged. Five other patients died at the Out Patients Department.\n\nTown Mayor Peter Mafuta said there was an urgent need for the Ministry of Health and Child Care to avail more ambulances and resources at the  hospital.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Kwidini.jpg",
            "description": "Thupeyo Muleya, Beitbridge Bureau BEITBRIDGE District Hospital is set for a major upgrade to meet modern service delivery needs and respond to growing demand in line with the transformation of the town into a city. Deputy Minister of Health and Child Care Dr Sleiman Kwidini toured the hospital yesterday and commended the town’s growth in […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        },
        {
            "title": "Oriyano: A young man of many talents",
            "url": "https://www.herald.co.zw/oriyano-a-young-man-of-many-talents/",
            "content": "Trust Khosa\n\nZimbabwes most trending youthful musician, Kudakwashe Royne Kachehiko, proudly carries the title of man of the moment.\n\nBetter known as Oriyano, this multi-talented young man is in his early 20s and is simply unstoppable.\n\nFrom music production and fashion design to pencil art, poetry, and beatboxing, Oriyano effortlessly rules the scene.\n\nWith six years of experience under his belt, the floodgates of success have finally opened for him.\n\nHis fairytale journey has led many social media users to compare him to superstar Jah Prayzah, thanks to his remarkable talent.\n\nWhile flattered by the comparisons, Oriyano remains humble.\n\nHe chooses not to dwell on the flattery but instead learns from Jah Prayzah and other superstars who came before him, such as Soul Jah Love and Andy Muridzo.\n\nJah Prayzah is an icon, and it would be unwise to claim that I am at his level, he asserts. I respect him and am willing to learn from him.\n\nFans comparing me to Jah Prayzah are entitled to their opinions, but I am not at his level. What I enjoy most is the support I receive from my fans, who wish me well in my journey.\n\nBlessed with a beautiful voice and a knack for creating engaging and spiritually uplifting love songs, Oriyanowhose name means a jewelis destined for greatness.\n\nAfter enlisting radio presenter Phathisani Sibanda to lead his management team, Oriyano is undoubtedly one of Zimbabwes new gems poised to dominate the 2025 showbiz calendar.\n\nPromoters have been following him closely, but the young talent remains committed to his work.\n\nHe has assembled a 12-member live band, a serious move that underscores his ambition to succeed.\n\nWith a live band, serious rehearsals are essential to enable improvisation when we take the stage, he explains.\n\nWe have a series of shows booked this year overseas, and it truly promises to be a good year for our camp. More music is also coming up this year to ensure fans have fun listening to my music.\n\nI just love my passion, and I hope I made the right decision venturing into music. I find relief in music after all that I have gone through in my life, including the death of our loved ones.\n\nTrending with chart-toppers like Makarima Mupoto, Super Glue, and Areka featuring Nyasha David, the singers amazing talent is hard to ignore.\n\nI just do the song writing and recording, and the rest is up to the fans to make their own assessment. With the help of my management, we are destined for greater things to come out here.\n\nPeople should expect us to continue doing well, and I am simply humbled by the support, said the devoted Christian who finds time to worship at their apostolic shrine.\n\nBorn into a family of four, his background was never rosy, according to Phathisani.\n\nWhen you reflect on the life of this youngster, you wont troll him on social media because he has defied the odds.\n\nOf course, he has some haters already calling him all sorts of names, but he didnt choose to have that voice. Its simply a gift from God, which has enabled him to touch the hearts of many across the world. Haungarombere voice. (You cant consult sangomas for a beautiful voice). He is simply a fine young man who enjoys his craft, and I will assist him. I got the blessing of my bosses to help him whenever he needs my expertise, as is the case right now, he said.\n\nThe popular radio personality, who is not new to this role, has urged Oriyano to remain focused.\n\nMy prayer is for him to remain loyal to the game and be the professional guy he is right now. He is talented, and no one will take that away from him.\n\nHe is also willing to learn from top musicians and will not be drawn into those fun debates or get carried away. We simply love to see him making progress in life, and he has shown those signs, he added.\n\nThe Herald Arts has been informed that the singer who lost his father last year was yet to come to terms with the death.\n\nHe always breaks down whenever he thinks of his father. The chant Ishmael refers to his late father who died last year, but he is willing to forego it.\n\nLast weekend, he also invited his mother on stage at Jongwe Corner in Harare to bless him. His wish was to see his father come to watch him perform live on stage, stressed a member of his management team.\n\nBesides music, he is also a motor mechanic.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Oriyano.jpg",
            "description": "Trust Khosa Zimbabwe’s most trending youthful musician, Kudakwashe Royne Kachehiko, proudly carries the title of “man of the moment.” Better known as Oriyano, this multi-talented young man is in his early 20s and is simply unstoppable. From music production and fashion design to pencil art, poetry, and beatboxing, Oriyano effortlessly rules the scene. With six […]",
            "time": "06:33",
            "date": "19 Feb 2025"
        }
    ]
}