{
    "news": [
        {
            "title": "President seeks to silence guns in DRC",
            "url": "https://www.herald.co.zw/president-seeks-to-silence-guns-in-drc/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nSADC Chairperson President Mnangagwa is today expected to leave for Dar es Salaam, Tanzania, where he will attend the joint SADC-East African Community (EAC) Summit, as the two regional blocs seek an amicable solution to the eastern Democratic Republic of Congo (DRC) security situation.\n\nThe President will lead a Double Troika comprising himself as SADC chairman, the outgoing Chair Angolan President Joo Loureno and incoming Chairperson Madagascar President Andry Rajoelina, and Chairperson of the Organ on Politics, Defence and Security Cooperation Tanzanian President Samia Suluhu Hassan, the outgoing Chair Zambias Hakainde Hichilema and the incoming Chair, Malawi President Lazarus Chakwera.\n\nDeputy Chief Secretary in the Office of the President and Cabinet (Presidential Communications), Mr George Charamba, who is also the Presidential spokesperson, told The Herald yesterday that President Mnangagwa was hopeful that the joint meeting would culminate in the silencing of guns, not only in eastern DRC, but the region at large.\n\nThis (SADC-EAC Summit) is a sequel to the SADC Extraordinary Summit of Heads of State held here (in Harare) to deliberate on eastern DRC . . . where it was agreed that both SADC and the East African Community (EAC) hold a joint summit with a view to tackling the security situation in the region, particularly in DRC.\n\nWe hope that when the two regional blocs combine, we can find a durable way towards lasting peace in the DRC.\n\nThe President is worried by the infighting happening there and is hopeful that the urge for peace will prevail and we silence the guns, he said.\n\nPresidents Mnangagwa and Kenyas William Ruto will lead the deliberations as SADC and EAC Chairpersons, respectively.\n\nMr Charamba also revealed that some non-State actors would be part of the SADC-EAC Summit, as the issue is extensively deliberated on, in the hope of finding a lasting solution to the crisis.\n\nAs you may be aware, the President is going as the SADC Chair and will be heading the Double Troika which means the three (the SADC chairman, outgoing chairman and incoming Chairperson) as well as in the organ . . . the Chairperson of the Organ on Politics, Defence and Security Cooperation, the outgoing Chair and the incoming Chair plus the three Troop Contributing Countries which are South Africa, Tanzania and Malawi.\n\nFor the first time we also hope that non-State actors will also participate at the Summit, he said.\n\nDRC, a member of both SADC and the EAC, accuses Rwanda, which is a member of the latter grouping, of backing M23 and other rebel groups, that have left death and destruction in eastern DRC. According to earlier reports, President Ruto said both DRCs President Felix Tshisekedi and Rwandan President Paul Kagame have agreed to attend the Summit, which is expected to usher a lasting resolution to the crisis.\n\nThe Kenyan leader also confirmed that he had engaged South African President Cyril Ramaphosa, Ugandan President Yoweri Museveni and other leaders to be part of the process.\n\nEastern DRC has witnessed a dramatic escalation of violence as M23 rebels, backed by Rwandan soldiers, have overrun the key city of Goma and are now threatening to march towards the capital, Kinshasa.\n\nDecades of unrest have ravaged the region, with multiple armed groups fighting for dominance over the areas vast mineral wealth.\n\nThe capture of Goma, the capital of North Kivu province, has sparked fierce clashes, further worsening the already catastrophic humanitarian situation.\n\nThe M23 rebels are now advancing on the neighbouring province of South Kivu, putting the city of Bukavu  the provincial capital  squarely in their sights.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/HE-2.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter SADC Chairperson President Mnangagwa is today expected to leave for Dar es Salaam, Tanzania, where he will attend the joint SADC-East African Community (EAC) Summit, as the two regional blocs seek an amicable solution to the eastern Democratic Republic of Congo (DRC) security situation. The President will lead a Double Troika […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "President launches countdown to COP 15 Wetlands indaba",
            "url": "https://www.herald.co.zw/president-launches-countdown-to-cop-15-wetlands-indaba/",
            "content": "Mashudu Netsianda in HWANGE\n\nPRESIDENT Mnangagwa yesterday officially launched the countdown to the 15th Meeting of the Conference of the Parties to the Convention on Wetlands (COP15), which Zimbabwe will host in July this year.\n\nThe 14th Meeting of the Conference of the Contracting Parties (COP14) took place from 5 to 13 November 2022 in Wuhan (China) at the East Lake International Conference Centre (ELICC) and Geneva (Switzerland) at the International Conference Centre Geneva (CICG).\n\nThe opening ceremony and high-level segment were in a hybrid format, with the participation of invited representatives both in Wuhan and Geneva linked via video.\n\nNegotiations and all other aspects of COP14 took place in person in Geneva.\n\nAs the countdown officially begins, Zimbabwe is intensifying preparations to host the 15th Conference of Parties (COP15) to the Ramsar Convention on Wetlands, a landmark global event set to take place in Victoria Falls from July 23 to 31.\n\nAddressing stakeholders in a speech read on his behalf by Defence Minister Oppah Muchinguri-Kashiri at the belated World Wetlands Day commemorations at Kasibo in Hwange District yesterday, President Mnangagwa stressed the importance of the conference, declaring that only 170 days remain until the historic event.\n\nI, therefore, compel that this countdown be flighted and announced every day on all key national and international media platforms to ensure the whole world and the entire nation remains reminded of COP15 and the legacy we want to build on wetlands, President Mnangagwa said.\n\nZimbabwes selection as the host country for COP15 signifies its growing role as a leader in wetland conservation.\n\nThe country is home to seven Ramsar-designated wetlands, including Victoria Falls, Driefontein Grasslands, and Lake Chivero, which are internationally recognised for their ecological significance.\n\nThese wetlands play a crucial role in biodiversity conservation, water purification, and climate change mitigation.\n\nThe President stressed the diplomatic and environmental significance of the upcoming event, describing it as a vital platform for fostering international partnerships.\n\nCOP15 meeting is essential in building stronger diplomatic partnerships as contracting parties to the Convention on Wetlands and ensuring that the protection of wetlands remains a global priority for our common future, he said.\n\nThe Ramsar Convention, an international treaty adopted in 1971, seeks to promote the conservation and sustainable use of wetlands. With over 170 contracting parties, the convention underlines the importance of wetlands as essential ecosystems supporting both human livelihoods and wildlife.\n\nPresident Mnangagwa expressed gratitude to the Ramsar Secretariat, particularly its secretary general, Dr Musonda Mumba, for supporting Zimbabwes successful bid to host the prestigious conference.\n\nI want to promise you and the whole world that Zimbabwe will do its best to ensure that COP15 is successful, he said.\n\nThe President further extended a call to nations across the world to actively participate in COP15.\n\nl want to encourage contracting countries around the world to participate in COP15 as a conference of significant opportunity for dialogue on global wetland issues and collaborative efforts towards sustainable management practices, he said.\n\nAs Zimbabwe, we stand tall and proud as a leader in wetland conservation that promotes international co-operation and growth. I am equally proud that we will be hosting you at Victoria Falls, one of the Seven Wonders of the World and one of our Seven National Ramsar sites.\n\nTo that end, we are excited to welcome you to converse and contribute positively towards global wetland protection initiatives.\n\nI am equally proud that we will be hosting you at Victoria Falls, one of the Seven Wonders of the World and one.\n\nZimbabwe has been making strides in wetland preservation through legislative frameworks such as the Environmental Management Act, which protects wetlands from degradation.\n\nHowever, President Mnangagwa noted that rapid urbanisation, agriculture expansion, and climate change continue to pose challenges, necessitating stronger conservation efforts.\n\nGlobally wetlands are facing unprecedented threats from rapid urbanisation, agriculture and land degradation, pollution, deforestation, and effects of climate change, he said.\n\nThese threats not only undermine the environmental services provided by wetlands but also put at risk the communities that depend on them for their survival.\n\nOn that note, protection of wetlands for posterity remains unquestionable the world over. The future of our wetlands is in our hands and so is our future. Therefore, let us protect wetlands for our common future. Value wetlands, protect wetlands, inspire others to value and protect wetlands.\n\nVictoria Falls, the venue for COP15, is not only a UNESCO World Heritage Site but also a Ramsar-listed wetland of international importance. Its selection as the host city aligns with Zimbabwes commitment to balancing environmental conservation and sustainable tourism.\n\nThe conference is expected to attract environmentalists, policymakers, scientists, and international delegates, all converging to deliberate on strategies for wetland conservation amid the challenges posed by climate change.\n\nPresident Mnangagwa said Zimbabwe is poised to showcase its commitment to global environmental stewardship while leveraging the event to drive sustainable development initiatives.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/President-Mnangagwa.jpg",
            "description": "Mashudu Netsianda in HWANGE PRESIDENT Mnangagwa yesterday officially launched the countdown to the 15th Meeting of the Conference of the Parties to the Convention on Wetlands (COP15), which Zimbabwe will host in July this year. The 14th Meeting of the Conference of the Contracting Parties (COP14) took place from 5 to 13 November 2022 in […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "President backs US deportations",
            "url": "https://www.herald.co.zw/president-backs-us-deportations/",
            "content": "Wallace Ruzvidzo, Herald Reporter\n\nPRESIDENT Mnangagwa has thrown his weight behind United States President Donald Trumps decision to repatriate undocumented Zimbabwean citizens who have been staying in America illegally.\n\nThis comes as the US has intensified efforts to deport undocumented migrants, with at least 545 Zimbabweans being among the 1,4 million illegally present on the US Immigration and Customs Enforcement (ICE) non-detained docket.\n\nThere are thousands of Zimbabweans living or studying legally in the United States, hence the decision to soon have an e-passport facility at the Washington DC Embassy, but there are others who have overstayed a temporary visa or have managed to drift into the country without permission.\n\nThe US immigration authority was on January 22 given authority to arrest irregular migrants in or near sensitive locations including schools, churches and hospitals  places that, under the Joe Biden administration, required more steps to be taken before arrests could be initiated.\n\nWriting on his official X account, President Mnangagwa said the recent move by the US was welcome.\n\nThe Government of Zimbabwe supports the United States Governments decision to repatriate and return our Zimbabwean citizens who may have been residing in the US illegally, he said.\n\nAccording to ICE, the individuals on the non-detained docket are awaiting final orders of removal, but the agency is unable to provide a list of case-specific reasons on why certain non-citizens cannot be removed.\n\nReasons for the delay in removals include the pursuit of relief or protection from removal, such as asylum, withholding of removal or protection under the Convention Against Torture. The US has thus, called on foreign Governments to take appropriate steps to confirm the citizenship of non-citizens suspected to be their nationals.\n\nThe US Government believes every country is obligated to accept the return of its citizens and nationals who are ineligible to remain in the United States.\n\nLack of cooperation from the foreign government delays and, in many cases, inhibits the removal process, reads the ICE report said.\n\nThe US Government has already commenced flights transporting illegally present immigrants to their countries of origin including India, Venezuela, Brazil, Mexico, Colombia, El Salvador, Guatemala, Honduras and Panama.\n\nImmigration teams have carried out raids to capture the undocumented migrants in the states of New York, California, Arizona, Texas, and Colorado.\n\nAccording to daily statistics shared by ICE on its official X account, at least 5 000 undocumented immigrants have been detained.\n\nAlthough the Trump administration has faced resistance from some citizens denouncing the repatriations, he ordered the preparation of a facility to hold up to 30 000 undocumented migrants.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Repatriation.jpg",
            "description": "Wallace Ruzvidzo, Herald Reporter PRESIDENT Mnangagwa has thrown his weight behind United States President Donald Trump’s decision to repatriate undocumented Zimbabwean citizens who have been staying in America illegally. This comes as the US has intensified efforts to deport undocumented migrants, with at least 545 Zimbabweans being among the 1,4 million illegally present on the […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "RBZ raises savings rates, cuts POS charges",
            "url": "https://www.herald.co.zw/rbz-raises-savings-rates-cuts-pos-charges/",
            "content": "Business Reporter\n\nTHE Reserve Bank of Zimbabwe has directed banks to increase interest on savings and time deposits and to scrap all charges for transactions valued at US$5 and below or the Zimbabwe Gold (ZiG) equivalent, to promote wider use of the domestic currency across the economy.\n\nThe new directives are part of a coterie of bold policy measures RBZ Governor Dr John Mushayavanhu announced in his 2025 Monetary Policy Statement to anchor the prevailing economic stability.\n\nDr Mushayavanhu told journalists and bank executives in Harare yesterday that its interventions, couched around a tight monetary policy stance, had restored exchange rate and inflation stability.\n\nInterest on ZiG savings account deposits has been hiked from 3,5 percent to 5 percent and from 5 percent to 7 percent for time deposits.\n\nSimilarly, the central bank has increased interest on US dollar savings account deposits from 1 percent to 2,5 percent while time deposits will now attract 4 percent from 2,5 percent.\n\nThe latest policy measures have been tailored along the key pillars of the Reserve Banks new Strategic Plan (2025-2029), which exclusively focuses on its core mandate of maintaining price and financial stability.\n\nDr Mushayavanhu said the Strategy Plan was aligned to the Back-to-Basics thrust aimed at balancing Confidence-Trust-Credibility-Efficiency-Stability-Growth outcomes.\n\nHe said the new measures would support the countrys targeted 6 percent growth, a huge leap following the restricted 2 percent expansion in 2024, when the El Nino-induced drought curtailed growth.\n\nDr Mushayavanhu said minimum interest rates for savings and time deposits in both ZiG and US dollars had been reviewed upwards, with immediate effect, in response to recent stakeholder concerns and the need to reward depositors.\n\nThe Reserve Bank encourages banks to offer depositors more than the stipulated minimum deposit rates, to promote a banking and savings culture in the economy, Dr Mushayavanhu said.\n\nThe central bank chief said domestic stakeholders consulted by the bank bemoaned the current high levels of bank charges obtaining in the banking sector.\n\nThe RBZ, he said, will continue to ensure that banks strictly adhere to a policy compelling them to exempt from bank charges all accounts that maintain a balance below US$100 or its equivalent in ZiG.\n\nIn addition, Point of Sale (POS) transactions for amounts less than US$5 or its equivalent in ZiG are also exempted from transaction charges, for both banking institutions and Payment System Providers (PSPs), Dr Mushayavanhu said.\n\nHe said the bank was also working with the Bankers Association of Zimbabwe and payment service providers (PSPs) to come up with mechanisms to minimise bank charges and encourage use of e-cash to promote ZiG.\n\nThese mechanisms will be finalised and communicated before the end of the first half of 2025, Dr Mushayavanhu said.\n\nTo enhance digital transactions in the economy, Dr Mushayavanhu said banks and PSPs had been directed, with immediate effect, to ensure that every business account (new and existing) was issued with POS machine or any other approved digital mechanism, which can facilitate transactions in both ZiG and US dollar.\n\nAny dormant POS machines or digital transactional gadgets should be reported to the Reserve Bank.\n\nTo promote the use of normal banking channels on all domestic trading transactions, the bank has advised local authorities and other licensing entities to ensure that all applicants for trading licences (individuals/ corporates) have a bank account and a functional POS machine at the point of licensing and/or renewal.\n\nDr Mushayavanhu said the central bank had acted on complaints from stakeholders during the consultative meetings alleging that some mobile money operators were applying discriminatory pricing practices against ZiG in preference for US dollar transactions.\n\nThe RBZ Governor said efforts to promote ZiG were in line with the Vision enunciated by President Mnangagwa and provided for in the National Development Strategy policy framework to dedollarise the economy.\n\nIn order to promote the use of prepaid international debit and credit cards, Dr Mushayavanhu said the Reserve Bank had, with immediate effect, reviewed upwards the annual limit from US$500 000 to US$1 million.\n\nTo address working capital challenges recently experienced by some wholesalers and retailers, the central bank has extended the targeted finance facility to these critical sectors to enable them to restock.\n\nIn January 2025, the central bank introduced the (TFF) to enhance banks support to productive sectors. The TFF is financed from the pool of banks statutory reserves held at the central bank, implying that there is no new money created to finance it.\n\nThe operational modalities of the facility have already been issued to banks.\n\nTo ensure the effectiveness of the TFF, beneficiaries of the funds can access the interbank market to access the requisite foreign currency, upon submitting bonafide invoices to support their import requirements.\n\nPreviously, beneficiaries under the facility were not allowed to use it to purchase hard currency on the interbank market to curtail speculative tendencies.\n\nDr Mushayavanhu has also scrapped limits on funds that can be accessed from the foreign exchange interbank market that had been set at US$500 000 and US$100 000 for Primary and Secondary users of foreign exchange, respectively, every week per entity.\n\nFurther, the RBZ Governor announced that authorised dealers were now expected to on-sell foreign exchange purchased from willing sellers, including the Reserve Bank, at a margin consistent with international best practices, after scrapping the previous limit of 5 percent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/03/Dr-John-Mushayavanhu.jpg",
            "description": "Business Reporter THE Reserve Bank of Zimbabwe has directed banks to increase interest on savings and time deposits and to scrap all charges for transactions valued at US$5 and below or the Zimbabwe Gold (ZiG) equivalent, to promote wider use of the domestic currency across the economy. The new directives are part of a coterie […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "Urban land for war veterans",
            "url": "https://www.herald.co.zw/urban-land-for-war-veterans/",
            "content": "Mukudzei Chingwere, Herald Reporter\n\nPRESIDENT Mnangagwa has approved the allocation of urban land for war veterans, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said.\n\nDr Muswere announced the offer during a press conference in Harare last night, which was also attended by Secretary for the War Veterans League, Cde Douglas Mahiya and Special Presidential Investment Advisor to the United Arab Emirates, Dr Paul Tungwarara.\n\nThe trio detailed how this initiative aligns with the Governments ongoing efforts to support and uplift the lives of war veterans who played a critical role in the countrys liberation struggle. The initiative is part of a broader strategy to promote social justice and rectify historical imbalances faced by veterans.\n\nThe land will be distributed in various urban areas, allowing veterans to establish homes and engage in entrepreneurial ventures across the countrys 10 provinces.\n\nDr Muswere said the land allocated to the war veterans can also be used as collateral.\n\nUrban land has been allocated across all the 10 provinces starting with the Jumbo, Mazowe district urban land which will be part of an economic empowerment initiative to support the war veterans, he said.\n\nCde Mahiya said the league expressed gratitude to President Mnangagwa and his administration for recognising their contributions and addressing their needs.\n\nThe President has given us land in Jumbo in the Mazowe area, the President has put in place what is known as the Presidential War Veterans Fund that is going to benefit all veterans, he said.\n\nCde Mahiya said the land in urban areas will be used for housing, building schools, clinics and other amenities.\n\nThis will be administered locally by the chairman of the war veteran league, a wing of the party in every district.\n\nThe President has also introduced, through Cde Tungwarara as our adviser, the Presidential War Veterans Borehole Scheme, he said.\n\nDr Tungwarara said all the projects they have started for war veterans will be cascaded to the countrys 10 provinces to ensure every war veteran benefits.\n\nWe want to thank the President for the programme. We are going to all the provinces to make sure every war veteran benefits. The President has also approved that each and every war veteran should receive a borehole at their homesteads just to support them, said Dr Tungwarara.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/DM.jpg",
            "description": "Mukudzei Chingwere, Herald Reporter PRESIDENT Mnangagwa has approved the allocation of urban land for war veterans, Information, Publicity and Broadcasting Services Minister Dr Jenfan Muswere has said. Dr Muswere announced the offer during a press conference in Harare last night, which was also attended by Secretary for the War Veterans League, Cde Douglas Mahiya and […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "Midlands Province hails  First Lady’s medical outreach",
            "url": "https://www.herald.co.zw/midlands-province-hails-first-ladys-medical-outreach/",
            "content": "Tendai Rupapa, Senior Reporter\n\nMRS Janet Shoko sat cross-legged on a reed mat awaiting her turn to be screened for cervical cancer with tears rolling down her chubby cheeks as she thought about her sister, Bridget, who passed on late last year.\n\nBridget had been wasting away without knowing what was eating into her well-rounded frame, leaving her skinny and weak.\n\nThe family pointed at witchcraft and traded accusations with other family members and neighbours leading to strained relationships.\n\nIt was only after her death that the family was told Bridget had succumbed to cancer.\n\nMy sister died a slow and painful death. We could see her wasting away and we all thought it was witchcraft at play until the day she breathed her last. Cancer is a dangerous disease and had we known and sought treatment early, she could have been alive.\n\nTaingotedza dzinanga nemamwe machurch tichingonzi kuroiwa. Chokwadi rega vakuru vakati kusaziva kufa. I really thank the First Lady, our mother, Amai Mnangagwa for bringing in cancer screening services for both men and women to our province especially our community of Gokwe so that we get screened and commence treatment early to save lives, she said as she wiped off her tears with the back of her hand.\n\nShe was not alone.\n\nHer neighbour, Mrs Elizabeth Zhombe said she recently collapsed in the fields one afternoon following a long struggle with headache.\n\nShe had not sought medical help until yesterday when she attended the First Ladys medical outreach programme. After health checks and tests, she was told she was diabetic.\n\nA health worker immunises a school girl against polio during a free medical outreach organised by Health Ambassador First Lady Dr Auxillia Mnangagwa in Gokwe yesterday.  Pictures: John Manzongo\n\nShe was immediately put on medication. On the mens side, 50-year-old Njabulo Sibanda had been suffering in silence.\n\nFor some time, he had been having pain in the lower back, having difficulty urinating, sometimes seeing blood in the urine and unexplained weight loss.\n\nI found it hard to talk about it with anyone or to reach out for help at our local clinic. Mupfungwa dzangu ndaingoti chandakadya chapfuka nekuti sevarume tine twumisikanzwa twatinomboita.\n\nI later approached a certain old man in our village who diagnosed me and said it was a sexually transmitted disease. He started giving me some concoctions which he said would cure the disease. The pain did not go away. My health was deteriorating and later decided to tell my friend. He encouraged me to come today for free prostate cancer screening. My fears were confirmed, I was told I have prostate cancer.\n\nI want to thank Amai Mnangagwa for availing these services to us. Kune vamwe varume ndinoti ngativei nehushamwari nezvipatara tisafire mudzimba takanyarara. Let us safeguard our health and our lives, he said.\n\nIt is because of such tales that the Midlands Province welcomed with both hands, health ambassador First Lady Dr Auxillia Mnangagwas two-day medical outreach programme where villagers were being screened for cancer and other non-communicable diseases free of charge.\n\nOther services offered at the medical outreach included HIV and Aids testing and counselling, family planning services as well as polio vaccination for children below the age of 10.\n\nIn the past two days over 300 men were screened for prostate cancer and other health ailments, while thousands of women benefited from the services which were on offer.\n\nWomen and children queue for free medical checks during a medical outreach brought by Health Ambassador First Lady Dr Auxillia Mnangagwa in Gokwe yesterday\n\nPeople came from as far as Chirumhanzu, Shurugwi and Gweru. Mrs Chipo Sautare, a villager was equally ecstatic.\n\nWhere on earth would anyone get such a person with a loving heart? Amai is committing time to assist our community with this medical outreach and for that, we must be grateful.\n\nMen do not readily accept health checks, but Amai is encouraging them to come and get screened and the move is paying dividends. We need to appreciate our mother, the First Lady, she said.\n\nThe First Lady is God-sent. She is doing wonders for our communities across the country and we must never miss such opportunities if we want to live longer and remain healthy enough to work and put food on the table for our children. Her love for humanity is clear and we need to embrace her teachings, said Mr Oscar Denga.\n\nThe views dovetailed with those of Gogo Esther Moyo, who said she had been given an opportunity to have her health checked, something that had never happened in her life.\n\nI had never been screened for cancer or any other disease since birth and were it not for the First Lady, I do not know as to whether I would have accessed such services.\n\nThe medical outreach programme attested to her great love and gave me a deeper sense of belonging, she said with a broad smile.\n\nMr Darlington Jira said he felt privileged to have benefited from the medical outreach.\n\nThe First Lady has made it possible for me to undergo a medical examination which gave me an action plan on how I can manage my health, said another man.\n\nThis came as the medical outreach programme initiated by Dr Mnangagwa at Mapfungautsi Clinic in Gokwe Central entered its second and last day yesterday, with people from walks of life trooping in to access health services that were being offered free of charge.\n\nUsing her mobile hospital, mobile clinic and personnel from the Ministry of Health and Child Care, Dr Mnangagwa ensured women were screened for cervical cancer and breast cancer, while men were screened for prostate cancer. Midlands Provincial Medical Director Dr Mary Muchekeza described the medical outreach as being a resounding success and thanked the First Lady for rallying communities towards the preservation of health to save lives.\n\nThe outreach also comes amid advice by health experts that there were greater chances of survival for cancer patients who present early for treatment.\n\nDr Muchekeza also showered praises on the First Lady for enabling men to get screened for prostate cancer despite the age-old reality of males shunning health checks and only presenting for treatment when it was too late.\n\nI want to thank the First Lady for the programme that we have been having for the past two days in our province, the cancer screening programme that she was spearheading. Amai has been our ambassador for health and the champion of this programme for over so many years. Over the two days, we have seen an overwhelming presence of people wanting to get the services that we have been giving.\n\nWe have been screening for cervical cancer in women, we have also been screening for breast cancer using the mobile hospital and clinic from Amais AoHF.\n\nTo support Amais vision, we also mobilised our own staff within the province to do what we call VIAC (visual inspection with acetic acid of the cervix) meaning the mouth of the uterus, she said.\n\nThe provincial medical director said getting screened and knowing ones health status were critical to save lives.\n\nBenefits of the programme are that you get picked early if you have any pre-cancerous signs on the cervix or on the breast. The difference that we have been having in this programme, that our mother brought for us, is that this time around at Mapfungautsi it involves men as well.\n\nWe have been screening for prostate cancer, something that we have not been really doing very actively and our First Lady saw it fit for that to happen. We know men usually shun seeking health care. They usually want to use women as their proxies for their health.\n\nThey say if my wife is okay, then I am okay. But Amai is encouraging men to get screened for prostate cancer and we are happy they came in their numbers. We cannot be more than grateful for this programme.\n\nIts a programme that many people would not have had if Amai had not brought it to us. The reason why I am saying this is because it has brought together people from all walks of life, it has brought together doctors and nurses even from other districts to come and put their hands on deck to make sure that people are getting screened, thanks to Amai, she said.\n\nDr Muchekeza said the First Ladys medical outreach had been a great success and the Ministry of Health could build up on it to cover more areas countrywide.\n\nGokwe is a very big district, it has a very big population: heath facility ratio of more than 1 to 11 000 and a very spaciously populated so much so that so many people do not have the privilege of even going to a health facility, so when we have an outreach like this when Amai does something like this, it is always more than welcome.\n\nWe are very happy that at the end of the two days, Amai has managed to encourage people to seek health care including men.\n\nAs I speak, people from Gokwe have come, people from Kwekwe District have come, Gweru and Chirumhanzu districts also came. It just shows the magnitude of the response that we have gotten for this programme, she said.\n\nThe provincial medical director also paid tribute to the First Lady for promoting healthy eating and wellness, saying this also boded well for the countrys economic development.\n\nAmai has been talking about general wellness. What you eat also has an effect on whether you are healthy or not.\n\nAmai has been emphasising the fact that if you are not healthy, there is no economic development that you can talk about and I cannot agree with her more as a provincial medical director. So we are also preaching the wellness gospel, watch what you eat, exercise, get seen, get screened, and get told early about whatever condition that you are suffering from whether it is BP, diabetes, or arthritis, we are saying get checked as much as possible and as frequently as advised by the health professionals so that you remain healthy, you live longer and you then have a contribution towards your economic development. As an individual, as a household, as a family, as a community and as a district, she said.\n\nGokwe Central legislator Cde Daveson Masvisvi praised the First Lady for holding the medical outreach in his constituency.\n\nFirst and foremost, our heartfelt gratitude goes to you Amai, the First Lady for your unwavering commitment to the health and wellbeing of Zimbabweans, particularly women and vulnerable groups.\n\nYour dedication through the Angel of Hope Foundation continues to touch lives and bring hope to many. Your presence here is a true testament to your love for the people and we are truly grateful.\n\nThis cancer screening initiative is not just a health intervention, but a significant step towards achieving Vision 2030. As we strive to build a prosperous and healthy nation, a healthy Zimbabwe is a progressive Zimbabwe and your efforts in ensuring that no one is left behind, especially in remote areas like Gokwe are commendable, he said.\n\nThe First Lady has been involved in many medical outreaches, ensuring no place and no one is left behind, demonstrating her love for the nation.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/FL1-1.jpg",
            "description": "Tendai Rupapa, Senior Reporter MRS Janet Shoko sat cross-legged on a reed mat awaiting her turn to be screened for cervical cancer with tears rolling down her chubby cheeks as she thought about her sister, Bridget, who passed on late last year. Bridget had been wasting away without knowing what was eating into her well-rounded […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "EDITORIAL COMMENT: Ministers of State need to be highly active",
            "url": "https://www.herald.co.zw/editorial-comment-ministers-of-state-need-to-be-highly-active/",
            "content": "The major thrust of the Second Republic is economic growth, with this growth being seen in all parts of the country and benefiting all communities and interests as the nation advances together to the Vision 2030 of an upper middle-income society and economy.\n\nAs part of this wide-front advance, the Government has taken up with enthusiasm its Constitutional duty to advance the devolution agenda, particularly in transferring chunks of the capital development budget to provinces and districts, in the belief that first people who live in an area can set their priorities better than a civil servant in Harare and secondly because they can often mobilise other resources to stretch the devolution allocations from the budget.\n\nA critical group in this process are the Ministers of State for Provincial Affairs and Devolution, with their teams headed by Permanent Secretaries, who not only have the duty of ensuring that communities and central Government are communicating, but also more generally to ensure that their provinces are racing forward through co-operation between the private sector, the communities and the Government departments in their area.\n\nIt is a wide-ranging set of responsibilities, and these are growing, and President Mnangagwa has made it very clear that he expects the Ministers of State to be highly active on the ground, knowing what is going on in their province and becoming the go-to person of choice when problems arise that need solutions involving others.\n\nThis means they also have to deal with Cabinet and central Government, and make sure that their provinces gaps and problems, as well as the successes and fixes, are known and that they are dealing with the correct authorities to get something done that needs to be done.\n\nPresident Mnangagwa was irritated on Wednesday when meeting the 10 Ministers of State because some are not keeping Cabinet posted, and are not attending crucial Cabinet Committee meetings.\n\nThere is a lot of development in many districts, and even some urban areas, but often driven by the local business people, the rural district council or municipality, communities and the constituency MPs. We read about a new clinic for example, and if the reporting journalist has done their job we hear about the team that did the work: the local community and its leaders, the ward councillor, the local MP, the rural district council and its devolution budget and even a couple of local business people who came on board. Perhaps the only input from the Minister of State is gracing the occasion when the clinic is opened.\n\nTo be honest, in some of these successes the Minister of State need not be involved, everyone else responsible knowing what to do and doing it, and the Minister just has to congratulate those responsible, and carefully note their names and contact details in the competent book. On other projects the Minister should know about problems as they arise, someone delaying something for instance and so taking action to prod.\n\nAn active Minister will hear, early, that the borehole has been delayed at the clinic because the rig was overbooked somewhere else, and perhaps a phone call might see that rig squeezed in to complete a major project that a whole community has backed. It can sometimes just be little things like that.\n\nThis gathering of knowledge means that the Minister of State and the Permanent Secretary have to get around the province, meeting the councils, meeting the traditional leaders, meeting the local business people, meeting the investors at their mines or other major inputs.\n\nA lot of this might be informal or semi formal, but the Minister will soon have a very good idea of who is pushing forward, who is holding back and why.\n\nThe chiefs in each province sit in a council, that has regular meetings. While the Minister of State is not part of those meetings they can easily arrange a social gathering after the meeting so they can meet all the chiefs and be able to put a face to a name and be in better contact.\n\nThe same goes for regular contact with the provincial heads of many line ministries; these officials do not fall under the Minister of State, but they should know each other and be able to co-operate.\n\nThe same again goes for the chairpersons of rural district councils and municipalities, and the Permanent Secretary should be in constant contact with the top local government officials, the chief executives and town clerks.\n\nEqually important are the contacts with businesspeople and investors. A new mine might well need help getting to know their local community and local councillors to set up those community extras, and perhaps there might be problems where the Minister of State can help, even making sure that the relevant line ministry provincial head at least listens to what seems to be an important request from the business person.\n\nIn any organisation, private or public, there will be the doers, the sitters and those who would rather nothing was done that means they have to put in a days work. An active Minister of State will know who is who, and be able to help the doers, prod the sitters and see if something cannot be done to accelerate early retirement for those who want the quiet life.\n\nThe President has made it clear that he wants no place and no person left behind in the race for development, and here the Minister of State has their hardest job. The successes speak for themselves, and often just need a show of appreciation for a job well done, but the left-behind often have no voice. The Minister needs to know who is falling behind, and why, and these areas and communities are probably going to need more active involvement to get them back on track.\n\nThere will also be co-ordination, which considering the fact that rivers are often used as boundaries might just be making sure two neighbouring rural district councils share the cost of a vital footbridge so children can go to school. It could easily be something bigger, like how a major irrigation scheme will work in several districts, with everyone co-operating and seeing that allocations are fair.\n\nAs the President noted, an active Minister of State is going to be busy, very busy, but they will also have the reward of seeing their province move ahead, without any left behind, and knowing that they have made a difference, which is more than many can say.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/etheh-680x380.jpg",
            "description": "The major thrust of the Second Republic is economic growth, with this growth being seen in all parts of the country and benefiting all communities and interests as the nation advances together to the Vision 2030 of an upper middle-income society and economy. As part of this wide-front advance, the Government has taken up with […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "Embassies urged to focus on trade",
            "url": "https://www.herald.co.zw/embassies-urged-to-focus-on-trade/",
            "content": "Remember Deketeke, Herald Reporter\n\nPRESIDENT Mnangagwa has issued the Reporting Directive for Zimbabwes Foreign Service No. 1 of 2025, whose objectives are to identify opportunities for trade, investment, as well as economic growth and also detect potential threats to peace and security.\n\nThis was said by Foreign Affairs and International Trade Minister, Professor Amon Murwira, when he delivered a lecture on Zimbabwes foreign policy at Zimbabwe Staff College in Harare yesterday.\n\nIn order to foster the application or operationalise Zimbabwes Doctrine of Foreign Relations and International Cooperation by Zimbabwean diplomats, the President has issued the Reporting Directive for Zimbabwes Foreign Service No. 1 of 2025, said Prof Murwira.\n\nThe Reporting Directive for Zimbabwes Foreign Service details how all reports produced within the Ministry of Foreign Affairs and International Trade, both internal and from Zimbabwes Mission abroad, shall provide a comprehensive overview of relevant information.\n\nThis report, he said, is generated under various topics that include foreign actions/events that may impact Zimbabwes sovereignty, national peace, security and stability, national development and international trade. This also includes actions that may have a bearing on fostering Zimbabwes fundamental rights and freedoms (humanitarian, social well-being, norms and values) and the welfare of Zimbabwean citizens abroad. Foreign actions that may impact Zimbabwes prospects for international cooperation; the countrys image and national interest are also covered.\n\nIn addition, Prof Murwira said there is also a directive to refocus the countrys diplomatic resources to suit Zimbabwes ever-evolving interests.\n\nEconomic diplomacy is one means through which we shall serve our national interest. ZimTrade is our entity that facilitates our trade with the foreign environment, he said.\n\nOur foreign policy puts emphasis on trade. Trade that is based on our Heritage. We are boosting our local production based on our heritage so as to boost our comparative advantage.\n\nProf Murwira said the doctrine is founded on parameters of reference that serve to guide foreign policy and development which are, Zimbabwe is a friend to all and an enemy to none; leaving no one and no place behind; Nyika inovakwa nevene vayo; Zimbabwe is open for business and Liberation of the mind, among other points.\n\nIn an era where countries are increasingly competing for investment and trade partnerships, the Government recognises the need to be proactive in identifying and leveraging opportunities that can drive economic growth.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Professor-Amon-Murwira.jpg",
            "description": "Remember Deketeke, Herald Reporter PRESIDENT Mnangagwa has issued the Reporting Directive for Zimbabwe’s Foreign Service No. 1 of 2025, whose objectives are to identify opportunities for trade, investment, as well as economic growth and also detect potential threats to peace and security. This was said by Foreign Affairs and International Trade Minister, Professor Amon Murwira, […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "Home demolitions without orders declared unconstitutional",
            "url": "https://www.herald.co.zw/home-demolitions-without-orders-declared-unconstitutional/",
            "content": "Fidelis Munyoro, Chief Court Reporter\n\nThe Constitutional Court has delivered a decisive blow to local authorities seeking to demolish homes using their administrative authority by declaring that demolishing homes without a court order is unconstitutional.\n\nThe court also ordered the relevant law to be amended to ensure that all can have their day in court before a home is demolished and that a court has been persuaded that a demolition order is necessary.\n\nThis historic ruling, building on a 2024 High Court decision, cements the protection of homeowners across the nation, particularly those in informal settlements, who have long suffered under the shadow of arbitrary evictions.\n\nThe case began in 2020, spearheaded by the Chitungwiza Residents Trust (CHITREST), which challenged sections of the Regional, Town, and Country Planning Act.\n\nThese provisions granted local authorities the power to demolish homes without judicial oversight.\n\nRepresented by Zimbabwe Lawyers for Human Rights, with Advocate Tererai Mafukidze leading the charge, CHITREST argued that these laws violated Section 74 of the Constitution, which guarantees protection against arbitrary eviction.\n\nIn a judgment authored by Justice Bharat Patel on behalf of the seven-judge bench, the court unanimously upheld the High Courts earlier finding.\n\nJustice Patel ruled that the provisions in question contravened Section 74, stating: It is patently clear that this process, without any rider or qualification, would invariably result in the occupants affected being arbitrarily evicted from their homes or having their homes demolished, without due process.\n\nHe further noted that such actions render nugatory the socio-economic rights enshrined in the Constitution and undermine Section 28, which obligates the state to ensure access to adequate shelter.\n\nThe provisions under scrutiny  sections 32(2)(c) and (d) and 37(1)(a)(i) of the Act  allowed local authorities to issue demolition notices and proceed with demolitions once the notice period expired, without ever seeking judicial approval.\n\nJustice Patel described this approach as unduly excessive and disproportionate, asserting that the rights enshrined in Section 74 must not be sacrificed on the altar of town planning.\n\nHe emphasised that freedom from arbitrary eviction or demolition guaranteed by Section 74 cannot be overemphasised, adding that demolitions must comply with due process and the audi alteram partem rule, which ensures all parties are heard before action is taken.\n\nThis means that someone whose home is up for demolition must first have their day in court. They can still lose the home, but not until all factors are weighed by an impartial court.\n\nWhile acknowledging the need for urban planning, Justice Patel reasoned that the Acts provisions failed to strike a proper balance between this legitimate purpose and the constitutional rights of citizens.\n\nThe justification for demolition, i.e., the interests of town planning, does not, in my view, suffice to override the requirements of due process and thereby warrant the infringement of Section 74, he declared.\n\nThe courts decision stemmed from a settlement reached in October 2024, where all parties agreed that the contested provisions were unconstitutional. This settlement also invalidated a demolition order issued by Chitungwiza Municipality on October 8, 2020.\n\nThe court confirmed the constitutional invalidity of the provisions and suspended their effect for 12 months, granting the Government time to amend the defective legislation.\n\nJustice Patel observed, By virtue of Section 175(6)(b) of the Constitution, it is just and equitable to make an order suspending the declaration of invalidity for a specific period to allow the competent authorities to correct the defective legislation.\n\nThe ruling compels local authorities to obtain a court order before demolishing any structure, ensuring affected home owners can challenge such actions in court.\n\nThis marks a significant victory for residents of informal settlements, who have historically borne the brunt of mass demolitions, often left homeless and destitute. They can still have their homes demolished, but only after due process and not on the whim of a city official.\n\nThe Ministries of Local Government, Public Works, and Justice, Legal, and Parliamentary Affairs have been tasked with amending the unconstitutional sections of the Act to ensure that the courts intervene between the desire for demolition and the demolition.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/court-hammer.jpg",
            "description": "Fidelis Munyoro, Chief Court Reporter The Constitutional Court has delivered a decisive blow to local authorities seeking to demolish homes using their administrative authority by declaring that demolishing homes without a court order is unconstitutional. The court also ordered the relevant law to be amended to ensure that all can have their day in court […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        },
        {
            "title": "Hero status sought for Chigudu",
            "url": "https://www.herald.co.zw/hero-status-sought-for-chigudu/",
            "content": "Lovemore Kadzura, Manicaland Bureau\n\nZANU PF Manicaland Province has submitted a recommendation to the Politburo to honour Cde Tinaye Elisha Nzirasha Chigudu as a national hero in recognition of his contributions during and after the liberation war.\n\nManicaland was plunged into mourning following the death of Cde Chigudu in Harare on Wednesday evening. He was 83.\n\nZANU PF Manicaland provincial chairman, Cde Tawanda Mukodza, yesterday confirmed the latest development, saying the Politburo will review their recommendation.\n\nNational hero status is a prestigious honour bestowed upon individuals who have made outstanding contributions to Zimbabwes liberation and development.\n\nCde Chigudu was a shrewd politician, who served as ZANU PF Manicaland provincial chairman and in various public service with distinction.\n\nThe passing on of the former provincial chairman is a tremendous loss to both the province and the nation. His demise comes closely after the loss of another former provincial chairman, making his absence even more deeply felt.\n\nNotably, we have submitted a recommendation to the Politburo to honour him as a national hero, in recognition of his significant contributions during the liberation war and beyond.\n\nThe provincial party leadership unanimously agreed to make this request, and we are optimistic about its success. The late Cde Chigudu held several prominent positions, including former Permanent Secretary in the Ministry of Home Affairs, former Governor of Manicaland Province, former ZANU PF Manicaland provincial chairman, and was a decorated war veteran, said Cde Mukodza.\n\nHe described Cde Chigudu as a fountain of wisdom, and a cadre who offered wise counsel and advice on conducting party business, drawing from his own experiences.\n\nThis is a huge loss, and I repeat, he was someone who offered wise counsel and advice whenever we faced challenges. He was someone I would tap into for his experience, and his passing on has left a gap that will be difficult to fill, said Cde Mukodza.\n\nThe late Cde Chigudus story is one of remarkable courage and resilience.\n\nAs one of the first combatants trained in North Korea under ZIPRA, the military wing of the Zimbabwe African Peoples Union (ZAPU), he played a significant role in Zimbabwes liberation struggle.\n\nHis bravery was further demonstrated when he operated as an intelligence officer in the then Salisbury, despite the risks.\n\nUnfortunately, his efforts were eventually discovered, leading to his capture and detention for 12 years.\n\nIn a surprising turn of events, the Rhodesian Forces deported Cde Chigudu to Britain, fearing that if he was reunited with his fellow comrades in Rhodesia or Zambia, he would continue to fuel the liberation movement. The drastic measure underscores the significant threat he posed to the Rhodesian regime.\n\nCde Chigudu, who has been unwell for some time, was described as a unifier and man of the people by family members and friends.\n\nFamily spokesperson and brother, Cde Edgar Chigudu, said the family has lost a pillar of strength who consistently advocated for unity.\n\nHe said Cde Chigudu left a huge void that will be difficult to fill.\n\nHis close ally and fellow war veteran, Cde Shadreck Tongesayi Chipanga, a ZANU PF Central Committee member, described Cde Chigudu as a straightforward leader who valued ethics and hard work.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Cde-Tinaye-Chigudu.jpg",
            "description": "Lovemore Kadzura, Manicaland Bureau ZANU PF Manicaland Province has submitted a recommendation to the Politburo to honour Cde Tinaye Elisha Nzirasha Chigudu as a national hero in recognition of his contributions during and after the liberation war. Manicaland was plunged into mourning following the death of Cde Chigudu in Harare on Wednesday evening. He was […]",
            "time": "09:46",
            "date": "07 Feb 2025"
        }
    ]
}