{
    "news": [
        {
            "title": "President’s stroke of genius unlocks billions",
            "url": "https://www.herald.co.zw/presidents-stroke-of-genius-unlocks-billions/",
            "content": "Wallace Ruzvidzo-Herald Reporter\n\nTHE introduction of bankable title deeds for State-owned land and the establishment of Mutapa Investment Fund have placed the national economy in a position of solvency in just six months, chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has said.\n\nIn an interview on ZBCTVs Face the Nation programme, broadcast last night, Mr Tagwirei said the two initiatives were strokes of genius on the part of President Mnangagwa.\n\nMr Tagwirei explained that the new Land Tenure Implementation Programme, launched by President Mnangagwa on December 20 2024, had created an asset worth about US$13 billion. This was on top of the US$16 billion valuation of the Mutapa Investment Fund.\n\nYou know that our debt in this country is around US$21 billion. With one single stroke of genius from the President, he has solved the issue of the farmer who did not have access to finance; he has made sure that constitutional provisions are met (as regards the right to own and transfer land), and now Government has an asset.\n\nIf you are a businessperson like I am, one of the things you try and avoid is to be insolvent. You have heard comments, people saying Zimbabwe is insolvent as a country . . .\n\nWithin six months, the President has managed to make sure that this country is solvent, while ensuring that the farmer has got access to cheap finance, he said.\n\nMr Tagwirei expressed confidence that the work of the Land Tenure Implementation Committee would unlock huge economic benefits for all Zimbabweans, not just the estimated 380 000 direct beneficiaries of the Land Reform Programme.\n\nHe said the fees people would pay to get the bankable title deeds could raise in the region of US$13 billion, which would be placed in a fund administered by banks.\n\nPart of the money is going to be used to pay some obligations that Government has. Also, the fund is going to go towards infrastructure, and while another chunk of that fund is going to go to the farmers themselves so that they can access finance.\n\nBecause the very same fund is going to be used to build infrastructure, that is how our economy is going to grow. Not only that, remember we gave mortgages to these farms. It means Government has also got an (additional)asset.\n\nHe projected a huge leap in national GDP thanks to the Land Tenure Implementation Programme and the Mutapa Investment Fund.\n\nI believe that with this stroke of genius, our GDP is going to move from US$47 billion where it is right now, to in excess of US$65 billion.\n\nMr Tagwirei described the Land Tenure Implementation Programme as one of the best the world has ever seen, adding he was excited to be part of it.\n\nHe said the Land Tenure Implementation Committee had submitted recommendations to Government that would allow the issuance of two land-based mortgages that would raise money for agricultural operations.\n\nThe deed structured by the Land Tenure Implementation Committee will see beneficiaries of the Land Reform Programme who had 99-year leases, offer letters, and permits getting a bankable, registrable and transferable document.\n\nSaid Mr Tagwirei: The liberation objective was that we were going to take the land from those who stole it from us  Im just using crude words  and to make sure that it goes to the beneficiaries of this country, right? So what government did initially is that it took the land for the people, and now they are doing the second part of this dispensation, of making sure that the would-be beneficiary is given security.\n\nIn its first three months, the committee will facilitate the issuance of 2,000 title deeds, and then another 24,000 for both A1 and A2 farmers over 18 months.\n\nDuring that 18-month period, Mr Tagwirei said the Land Tenure Implementation Committee would also be reviewing the seamlessness of the system in place to ensure the nation derived maximum benefit.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/3rg3g4g-680x380.jpg",
            "description": "Wallace Ruzvidzo-Herald Reporter THE introduction of bankable title deeds for State-owned land and the establishment of Mutapa Investment Fund have placed the national economy in a position of solvency in just six months, chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has said. In an interview on ZBCTV’s “Face the Nation” programme, broadcast […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Title deeds: Banks can’t seize farmers’ land",
            "url": "https://www.herald.co.zw/title-deeds-banks-cant-seize-farmers-land/",
            "content": "Fungi Kwaramba-News Editor\n\nBANKABLE title deeds for State-owned land will not result in financial institutions seizing control of large tracts of land, or lead to the reversal ofthe Land Reform Programme,Chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has said.\n\nSpeaking on ZBCTVs Face the Nation programme last night, Mr Tagwirei allayed fears that financial institutions would wrest land from beneficiaries of agrarian reform who would have failed to service loans extended under the scheme.\n\nThe businessman also laughed off speculation that he would personally grab land from indigent or defaulting farmers, adding that the issuance of title deeds would indirectly address aspects of multiple farm ownership, as is stipulated in the countrys Constitution.\n\nOutlining the processes and mandate of the Land Tenure Committee, Mr Tagwirei said it was impossible for banks to take ownership of what is essentially State land.\n\nThe land belongs to the Government, it does not belong to the bank. If you look at the total value of this land that we are talking about, the actual value is around US$20 billion. There is no bank that can give a mortgage for that land.\n\nSo what the banks are merely doing is administering the mortgage that this farmer is going to get (through Government) on that piece of land. The ultimate owner of this land still remains Government, its not the bank that owns it.\n\nWhen the bank is repossessing this land for whatever reason, maybe the farmer has failed to pay, remember that the owner is still the Government . . . ok? They (banks) will have to consult Government, obviously, when they are doing that process.\n\nHe added: One of the things that you must understand is that these farmers are supposed to be commercial farmers, not subsistence farmers. When you were applying to get that piece of land, you were saying I want to be a commercial farmer.\n\nAnd the risks that are associated with being a commercial farmer are that you must make sure that you work the land so that you are able to pay back.\n\nMr Tagwirei said because title deeds were allocated on the basis of an individuals unique national identification number, this could help address public concerns about multiple farm ownership.\n\nHe emphasised, though, that this was not the committees core concern or its mandate.\n\nSection 289 of the Constitution says that any citizen of this country is allowed to have access to land. A citizen is a person. Its not an institution. Its a person. A person is identified by an ID number. The ID number represents a person. You cannot have multiple ID numbers . . .\n\nWhen an ID is given to an individual, to a citizen of this country, the ID is a unique identifier to an individual. When we are issuing title to a farmer, the main focus point is the ID number; we will issue it on the basis of that ID number.\n\nWhen the bank repossesses this land  because a bank cannot take land  on behalf of Government,the bank cannot then own the land because they have no ID number.\n\nOn claims that he would use his financial muscle to gain control of land, Mr Tagwirei said at an average valuation of US$2,000 per hectare of arable land, it was ridiculous to think he could purchase it because he did not have that kind of money.\n\nSome people have even said Kudakwashe Tagwirei wants to take all this land for himself because he can buy it, which I cant because I dont have US$20 billion to buy this land.\n\nMr Tagwirei explained that banks would only administer a fund that would, among other things, provide affordable financing to farmers.\n\nPresident Mnangagwa launched the bankable deeds late last year as part of measures to unlock the value of Zimbabwes agricultural land and to grow the economy in line with national development targets.\n\nThe deeds are structured as per recommendations of the Land Tenure Implementation Committee, which brings together 14 experts from a variety of fields.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/ef2f2f-680x380.jpg",
            "description": "Fungi Kwaramba-News Editor BANKABLE title deeds for State-owned land will not result in financial institutions seizing control of large tracts of land, or lead to the reversal of  the Land Reform Programme,  Chairperson of the Land Tenure Implementation Committee, Mr Kudakwashe Tagwirei, has said. Speaking on ZBCTV’s “Face the Nation” programme last night, Mr Tagwirei […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Gukurahundi public hearings to start first quarter",
            "url": "https://www.herald.co.zw/gukurahundi-public-hearings-to-start-first-quarter/",
            "content": "Nqobile Tshili-Bulawayo Bureau\n\nGukurahundi public hearings are expected to open in the first quarter of this year, with a designated Command Centre in Bulawayo being renovated to securely store witnesses testimonies and other sensitive information.\n\nThis initiative underscores the Governments commitment to addressing the countrys past and fostering national healing.\n\nPresident Mnangagwa launched the Gukurahundi public hearings in July last year, marking a historic step towards resolving issues stemming from the post-independence conflict.\n\nThe hearings are part of the Second Republics broader efforts to address grievances, particularly in Matabeleland and parts of the Midlands, where communities have linked underdevelopment to the effects of Gukurahundi.\n\nWhile the 1987 Unity Accord united liberation movements Zanu PF and PF-Zapu, bringing peace to the nation, lingering social issues remain.\n\nThe public hearings are expected to provide a platform for communities to chart a path forward in addressing these matters.\n\nTraditional leaders, mandated by President Mnangagwa to spearhead the hearings, have received training alongside their rapporteurs.\n\nEssential equipment, including recorders and laptops, has been procured to facilitate the process.\n\nThe countrys Constitution and customary law empower chiefs to resolve conflicts among people in accordance with traditions and customs.\n\nAttorney-General Mrs Virginia Mabiza, who serves as the National Coordinator of the programme, said preparations are on track.\n\nShe said the hearings steering committee on Gukurahundi met last weekend to discuss modalities of implementing the programme.\n\nThe purpose of the meeting was to plan for the upcoming hearings. It is the hope that during the first quarter, the hearings are going to commence. These are public hearings and the media to a certain extent is going to be allowed as regulated by the sector, said Mrs Mabiza.\n\nThat is the progress that we have recorded so far. Resources will never be adequate, but Im happy to announce that the Office of the President and Cabinet has availed some resources to take us somewhere and we are optimistic that the hearings will begin in the first quarter.\n\nNational Council of Chiefs president, Chief Mtshane Khumalo, expressed optimism about starting the hearings in February.\n\nI had a meeting with the Attorney-General Mrs Mabiza on Monday where we discussed the matter. We aim to commence the hearings in February if everything goes according to plan, he said.\n\nThis will be a busy period for us. Although we intended to begin shortly after the President launched the programme, resource constraints delayed progress. However, we are now ready to move forward.\n\nChief Mtshane highlighted the importance of the Command Centre, which will serve as a secure repository for testimonies. Located at the corner of Joshua Mqabuko Nkomo Street and Simon Muzenda Avenue in Bulawayo, the facility is undergoing renovations by the Department of Public Works to meet programme requirements.\n\nWe now have the Command Centre which will be used for the storage of our data. We are going to be using the offices that previously housed the National Peace and Reconciliation Commission. We have been assured that the offices will be secure, we have been promised security 24/7, he said.\n\nTraditional leaders will conduct hearings in villages, but testimonies will be stored at the Command Centre for security reasons.\n\nTo ensure smooth operations, the Government is hiring staff for the Command Centre and plans to provide vehicles for the 72 or 73 chiefs involved in the hearings.\n\nCars will be hired for all the chiefs involved to improve their mobility. The Office of the President and Cabinet will hire vehicles to enhance the mobility of chiefs and their teams during the hearings, Chief Mtshane said.\n\nAdditionally, a refresher training session for traditional leaders, including newly appointed chiefs, is planned, subject to funding availability. The public hearings are expected to play a crucial role in promoting healing and reconciliation while addressing unresolved issues from the past.\n\nSpeaking at the launch of the Gukurahundi manual to guide the holding of victim-friendly public hearings at State House in Bulawayo in October 2022, President Mnangagwa emphasised the importance of unity. He noted that detractors have attempted to sow divisions, but the Government remains resolute in its commitment to fostering national cohesion.\n\nThe manual, developed through inclusive engagements between chiefs and various stakeholders, is a culmination of traditional leaders meetings with the President, which began in March 2019.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Mrs-Virginia-Mabiza-680x380.jpg",
            "description": "Nqobile Tshili-Bulawayo Bureau Gukurahundi public hearings are expected to open in the first quarter of this year, with a designated Command Centre in Bulawayo being renovated to securely store witnesses’ testimonies and other sensitive information. This initiative underscores the Government’s commitment to addressing the country’s past and fostering national healing. President Mnangagwa launched the Gukurahundi […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Chapo sworn in as fifth Moza leader",
            "url": "https://www.herald.co.zw/chapo-sworn-in-as-moza-president/",
            "content": "Herald Reporter\n\nFRELIMO leader Mr Daniel Chapo was yesterday sworn in as Mozambiques President at a ceremony attended by Defence Minister Oppah Muchinguri-Kashiri, who was representing Sadc chairman President Mnangagwa.\n\nThe ceremony was also attended by numerous leaders from the SADC region.\n\nPresident Chapo (47) is Mozambiques fifth president since gaining independence from Portugal in 1975.\n\nHe won the elections held on October 9 last year, securing over 65 percent of the vote against his closest challenger, Mr Venncio Mondlane, who received 24 percent.\n\nIn his address to over 2 500 guests, President Chapo vowed to devote my energies to defending, promoting and consolidating national unity, human rights, democracy and the well-being of the Mozambican people.\n\nTogether, united, we can work to develop our country and ensure a brighter future for all Mozambicans.\n\nHe emphasised the need to restore patriotism and pride in being Mozambican, adding that Mozambique cannot remain a hostage to corruption, nepotism and incompetence.\n\nPresident Chapo also committed to propelling Mozambiques economy through robust strategies aimed at unlocking the countrys vast resources, including natural gas, oil, agriculture, and minerals.\n\nZimbabwe and Mozambique share a long-standing relationship that dates back to the liberation struggle, with Mozambique providing crucial support and bases for freedom fighters, often putting its citizens atrisk.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Muchinguri-Kashiri-Chief-Charumbira-and-Victor-Matemadanda-680x380.jpg",
            "description": "Herald Reporter FRELIMO leader Mr Daniel Chapo was yesterday sworn in as Mozambique’s President at a ceremony attended by Defence Minister Oppah Muchinguri-Kashiri, who was representing Sadc chairman President Mnangagwa. The ceremony was also attended by numerous leaders from the SADC region. President Chapo (47) is Mozambique’s fifth president since gaining independence from Portugal in […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Africa must counter security threats: Minister",
            "url": "https://www.herald.co.zw/africa-must-counter-security-threats-minister/",
            "content": "Columbus Mabika and Spiwe Sarakunze\n\nAFRICA needs to invest in home-grown and developed hardware, software and critical information system infrastructure to counter national security challenges, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, has said.\n\nHe said this in his remarks while presenting on the topic, The evolution of information systems and how this has impacted on national security, to participants of the National Defence Course at the Zimbabwe National Defence University in Harare yesterday.\n\nDr Muswere said technology is developing at a faster pace, which is having a bearing on national security.\n\nDr Muswere added that information, publicity and broadcasting is also not immune from the major transformations taking place in the world, making it imperative to reflect on evolutions of technology and their impact on national security.\n\nThe evolution of information system value chains is mainly outside Africa, from hardware, software, and development and this poses national, regional and continental security threats, he said.\n\nSo, Africa needs to define the future of ICT systems in terms of home-grown solutions. As we are gathered here today, the global community is going through enormous transformation.\n\nTechnology is developing at an unprecedented rate, and this has a complex effect on national security.\n\nDr Muswere added that information, publicity and broadcasting is also not immune from the major transformations taking place in the world, making it imperative to reflect on evolutions of technology and their impact on national security.\n\nDeveloping nations continue to face foreign-funded propaganda through social media and radio stations, he said, resulting in massive misinformation to suit the aspirations of the funders.\n\nThis action, Dr Muswere said, is against International Telecommunications Union regulations.\n\n(Through) such interference, foreign nations are able to voice their opinions on African issues thereby interfering with issues beyond the reach of their geographical boundaries, he said.\n\nDr Muswere said the birth of the Second Republic had fast-tracked the connection of communities to the internet and extension of the radio signal to rural areas.\n\nNew television stations are mushrooming in all corners of the country. Since 1980, Zimbabwe only had one broadcaster and today under the astute leadership of our President Cde Dr ED Mnangagwa, Zimbabwe enjoys a flourishing information access economy, he said.\n\nTurning to social media, Dr Muswere said they continue to misinform society, hence the need to put some regulatory mechanisms.\n\nSocial media usage is on the rise and is consistently affecting mainstream media. As we speak, within the broadcasting industry, printed media circulation used to be 100 000 copies per day, but is now less than 10 000 copies per day (due to social media), he said.\n\nDr Muswere said revenue that used to support the local media industry is now being taken by social media channels, causing viability challenges for the mainstream media.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/q3r3r3qr-680x380.jpg",
            "description": "Columbus Mabika and Spiwe Sarakunze AFRICA needs to invest in home-grown and developed hardware, software and critical information system infrastructure to counter national security challenges, Information, Publicity and Broadcasting Services Minister, Dr Jenfan Muswere, has said. He said this in his remarks while presenting on the topic, “The evolution of information systems and how this […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Engaging Zanu PF not selling out: Tshabangu",
            "url": "https://www.herald.co.zw/engaging-zanu-pf-not-selling-out-tshabangu/",
            "content": "Nqobile Tshili-Bulawayo Bureau\n\nCCC interim secretary-general, Senator Sengezo Tshabangu, has defended the oppositions engagement with the ruling Zanu PF, saying such interactions foster a healthy democracy and promote national development.\n\nSen Tshabangu, who is also the leader of the opposition in Parliament, faced criticism from opposition activists for participating in a visit to President Mnangagwas Pricabe Farm in Kwekwe over the weekend as part of parliamentary business.\n\nDuring the visit, President Mnangagwa encouraged the opposition to adopt a more vibrant approach to governance, asserting that a robust opposition helps keep the ruling party accountable. In an interview yesterday, Sen Tshabangu dismissed claims that engaging with the ruling party amounted to betrayal.\n\nIt is certainly strange reasoning to suggest that an opposition which engages with the ruling party is selling out. How else should State affairs be conducted? Democracies across the world have healthy interactions between the ruling party and the opposition, he said.\n\nThe real issue is whether or not the opposition remains true to the independent political demands of its constituency.\n\nSen Tshabangu added that the oppositions engagements with Zanu PF reflect a commitment to advancing national interests while maintaining its independence.\n\nWe have maintained that the status quo is inconsistent with the objectives of the struggle for national liberation. Our engagements with the ruling party have asserted this contention, he said.\n\nSen Tshabangu called for a shift in opposition politics, urging maturity and a focus on home-grown solutions.\n\nThe tragedy is to assume that opposition should oppose for the sake of it. It is not enough to oppose. In fact, it is not the task of the opposition. The task is to offer alternative, objectively sound, and home-grown solutions made by Zimbabweans, for Zimbabweans, and about Zimbabweans, he said.\n\nTurning to Zanu PFs resolution to defer the 2028 elections to extend President Mnangagwas term until 2030, Sen Tshabangu said the CCC had not yet deliberated on the matter.\n\nThat issue has not been considered by the party. At present, it is a matter internal to Zanu PF. Zanu PF has neither approached us on the issue nor presented it in the appropriate legislative body for deliberations, he said.\n\nSen Tshabangu said the issue of the deferring of elections has not arisen in any of their party meetings, stressing the importance of understanding and debating the reasons behind any proposal to defer elections.\n\nIt will be important to understand and debate the reasons for the argument of the deferring of elections and how that benefits us as a people and country. Deferring elections cannot be an end in itself, he said. On the question of CCCs internal structures, Sen Tshabangu acknowledged the need for a congress to elect substantive leaders.\n\nCongress is an absolute necessity. We are in the process of strengthening the party to prepare and have a congress. It will happen as soon as the conditions permit, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Sengezo-Tshabangu-1-680x380.jpg",
            "description": "Nqobile Tshili-Bulawayo Bureau CCC interim secretary-general, Senator Sengezo Tshabangu, has defended the opposition’s engagement with the ruling Zanu PF, saying such interactions foster a healthy democracy and promote national development. Sen Tshabangu, who is also the leader of the opposition in Parliament, faced criticism from opposition activists for participating in a visit to President Mnangagwa’s […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "19 new civil registry offices opened",
            "url": "https://www.herald.co.zw/19-new-civil-registry-offices-opened/",
            "content": "Manicaland Bureau\n\nNINETEEN new civil registry centres have been set up since 2018, significantly improving access to civil documentation, Home Affairs and Cultural Heritage Minister Kazembe Kazembe said in Mutare yesterday.\n\nIn an interview on the sidelines of a familiarisation tour of departments in the city that fall under his purview, Minister Kazembe applauded the construction of civil registry offices in areas that previously did not have them, as part of the devolution and decentralisation agenda.\n\nWe are grateful to President Mnangagwa for his visionary leadership that has enabled the country to have civil registration offices in areas that previously did not have, he said.\n\nSince the inception of the Second Republic, we have been able to have 19 new such offices across the country, underlining President Mnangagwas development trajectory that espouses the need not to leave any place and no one behind.\n\nThis explains the reason we now have e-passports being accessed in areas such as Chipinge and others. The idea is to lessen the burden for our citizenry.\n\nAccess to civil documents such as birth certificates and passports has been a challenge, especially in marginalised areas, with people travelling to cities to get them.\n\nHowever, Government has moved with speed to construct new passport offices countrywide, with such offices being opened in other countries such as South Africa for the convenience of people.\n\nMinister Kazembe said the new provincial Civil Registry Building for Manicaland, which is almost complete in Mutare, will soon be replicated in Masvingo and Mashonaland Central.\n\nIt is sad that our people have been getting civil documentation from substandard facilities, and this is the reason President Mnangagwa saw it fit that we have state-of-the-art offices to replace the dilapidated old structures.\n\nThis is all part of His Excellencys thrust to build back better. After this construction of state-of-the-art offices here in Mutare, we will be moving to Masvingo and Mashonaland Central.\n\nAll other provinces will also have similar projects taking place, starting with areas where there is greater need.\n\nThe new provincial civil registry office for Manicaland is expected to be complete by the end of March bringing relief to workers in the Civil Registration Department who had been operating from wooden cabin offices over the years.\n\nApart from touring the civil registry provincial offices, Minister Kazembe, who was accompanied by his deputy, Chido Sanyatwe during the tour, also took time to visit Tongogara Refugee Camp in Chipinge district as well as Forbes Border Post.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Minister-Kazembe-1-680x380.jpg",
            "description": "Manicaland Bureau NINETEEN new civil registry centres have been set up since 2018, significantly improving access to civil documentation, Home Affairs and Cultural Heritage Minister Kazembe Kazembe said in Mutare yesterday. In an interview on the sidelines of a familiarisation tour of departments in the city that fall under his purview, Minister Kazembe applauded the […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Rains leave 15 dead, 785 households hit",
            "url": "https://www.herald.co.zw/rains-leave-15-dead-785-households-hit/",
            "content": "Precious Manomano-Herald Reporter\n\nAT least 15 people have died, while 785 households, the bulk of them in Midlands Province, have been damaged by the rains that continue to be experienced in most parts of the country.\n\nApart from the impact on people, the rains have also damaged 118 schools and 13 health facilities, leaving many without access to education and essential services.\n\nThe devastation has been recorded from September last year up to now.\n\nRegions such as Midlands, Manicaland, Masvingo, and Matabeleland North are grappling with the aftermath, facing escalating infrastructure damage and safety concerns. Amid rising waters, urgent rescue efforts are underway.\n\nIn the Midlands, 433 households have been affected, 181 households in Manicaland, 46 in Masvingo, and 47 in Matabeleland North.\n\nIn terms of learning infrastructure, the situation escalated on January 11 when Muponjane Primary School in Zvishavane was struck by a powerful storm, leaving significant damage.\n\nThe District Civil Protection Committee said the recent disaster at Muponjane has exacerbated the existing classroom shortages at the school.\n\nWith an estimated repair cost of US$8 120, the school now faces a daunting challenge. Amid rising waters, two middle-aged men remain marooned along the Runde River near Citrus Plantation.\n\nThe rivers flow is rapidly intensifying, posing a significant threat to their safety. In response, the District Civil Protection Committee is swiftly assembling a rescue team to ensure their evacuation.\n\nTragically, the rains have also led to drownings, while artisanal gold miners have also been particularly affected.\n\nIn Hwedza, three miners lost their lives in a mine shaft disaster on December 27, with their bodies retrieved on January 3.\n\nThere are recommendations to close the Chikomba mining area given the recurrence of these incidents, a department representative noted.\n\nIn Makaha, Mudzi district, three miners remain trapped underground after a shaft they were working under caved in about 14 days ago.\n\nOne miner managed to escape, and rescue efforts are ongoing, with a 24-hour command centre established, comprising personnel from the police, army, health officials, mines chiefs, and the Environmental Management Agency (EMA).\n\nAll the trapped miners are of the same family from Mateta 1 Village under Chief Chireya in Gokwe, officials reported, drawing attention to the personal tragedies hidden within this disaster.\n\nIn Mberengwa, two miners died after a shaft they were working under collapsed last Thursday.\n\nFlash floods also hit Mbare, Harare, on January 8, inundating homes near the new Mbare Traders temporary market, a development that underscored the challenge of poor drainage faced by local authorities.\n\nIn Mashonaland Central, the storm unleashed devastation on Avonda Farm along the Bindura-Harare highway on January 7, affecting 11 households.\n\nRoofs were ripped, leaving families vulnerable.\n\nIn response, the Department of Civil Protection provided essential relief items, including rice, tinned beef, and sanitisers.\n\nAs the rains continue and the impacts deepen, communities are left grappling with the aftermath, and with more rains expected today and tomorrow, more people and infrastructure could be affected by natures fury.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Remiti-Primary-School-680x380.jpg",
            "description": "Precious Manomano-Herald Reporter AT least 15 people have died, while 785 households, the bulk of them in Midlands Province, have been damaged by the rains that continue to be experienced in most parts of the country. Apart from the impact on people, the rains have also damaged 118 schools and 13 health facilities, leaving many […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "NDS2 to consolidate economic gains: Mthuli",
            "url": "https://www.herald.co.zw/nds2-to-consolidate-economic-gains-mthuli/",
            "content": "Joseph Madzimure-Senior Reporter\n\nTHE agenda for the National Development Strategy 2, which will build on the achievements of NDS1 and further transform the economy up to 2030, will be formulated later this year, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has said.\n\nGovernment is confident of achieving an economic growth rate of 6 percent this year attributed to the rebound in agriculture and ongoing capital projects in the manufacturing sector.\n\nAgriculture is expected to recover due to the current rainfall outlook.\n\nIn an exclusive interview, Prof Ncube said the economy has moved from recovery to a sustained growth trajectory, creating fertile ground for the inevitable realisation of Vision 2030.\n\nThe Government crafted the National Development Strategy 1 for 2021-2025, a development plan that embraces political, economic, and social spheres towards sustainable development, leaving no one and no place behind.\n\nThis is also the last year in the implementation of the NDS-1 agenda. We are preparing to launch the NDS-2 agenda into next year, 2026. So by the end of the year, we will be launching a document, which is the NDS-2 document, which again will seek to drive further transformation of our economy and leaving no one and no place behind in doing so, said Prof Ncube.\n\nGovernment will continue creating an enabling environment for sustainable and inclusive economic development through enunciating and implementing robust policies aimed at consolidating the gains already made in the countrys economic development in line with Vision 2030.\n\nProf Ncube said the Government would re-impose duty on imported buses to improve local production.\n\nWe will re-impose duty on completed buses that are imported. Again, you can see where we are going. We want to support local production of vehicles including trucks and buses. We believe that these policies will go a long way in supporting the economy, in supporting resilience, in supporting the transformation of the economy, said the Minister.\n\nThe Minister noted that the current rains have rejuvenated hopes for a better harvest following a dry spell at the beginning of the season.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/02/Minister-Mthuli-Ncube-1.jpg",
            "description": "Joseph Madzimure-Senior Reporter THE agenda for the National Development Strategy 2, which will build on the achievements of NDS1 and further transform the economy up to 2030, will be formulated later this year, Finance, Economic Development and Investment Promotion Minister Professor Mthuli Ncube has said. Government is confident of achieving an economic growth rate of […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Editorial Comment: Enforcement of kombi permits will clean up sector",
            "url": "https://www.herald.co.zw/editorial-comment-enforcement-of-kombi-permits-will-clean-up-sector/",
            "content": "Asignificant majority of the working population of Harare Metropolitan rely on public transport to get to and from work, and during the school term they are joined by a large group of schoolchildren who attend schools beyond normal walking distances.\n\nThe overwhelming bulk of vehicles involved in this major movement of people every day are privately-owned, Zupcos contribution now being minimal outside the dedicated services for a range of civil servants.\n\nThis means that proper standards and requirements need to be set, and then enforced, to ensure high levels of safety for the passengers as well as ease of use, a requirement not always highlighted by Harare City Council, although it should be.\n\nIn the absence of the city council showing any interest whatsoever, the police have taken on the burden of enforcement, at least so far as the registration, licensing and insurance of kombis is concerned and the continuing effort to get pirate taxis, the mushikashikas, off the roads since they cannot be registered and insured for the sort of public transport service they offer.\n\nThe problems of the terminuses in the city centre and the ranks in the city centre and many suburban areas has so far been left to the city council who, after a brief surge of energy for a few weeks last year when they did manage to contain the touts, have relapsed back into total inactivity and allowed protection rackets to resume to the detriment of both the passengers who need to board kombis and the drivers and owners of the kombis.\n\nThe police estimate that only around 2 950 kombis are properly and up-to-date registered for public transport in Harare Metropolitan, with more than 13 000 others existing, but not compliant or fully compliant with the requirements.\n\nSome of these are not even runners and will never return to the roads, but there is a large group that are offering services, but whose owners need to go through the procedures and get all the permits and licences required.\n\nA compliant kombi owner needs the normal ZINARA licence and vehicle insurance.\n\nBut as a public service vehicle the kombi needs the operators licence, requiring in turn a Zimra tax clearance certificate, the additional passenger insurance, the red on white registration plates including the third plate so there cannot be substitution, a certificate of fitness, a City of Harare permit, RMT route authority and a City of Harare rank disc.\n\nNone of this is impossible to obtain, and the fact that almost 3 000 kombis have the required paperwork, discs, plates and the like shows that it is routine for an operator who keeps the kombi in shape and pays the required fees.\n\nThe rest need to get their roadworthy kombis fixed up so all offering services are compliant.\n\nBut it is a fair amount of paperwork to display at a police checkpoint and we think it should be possible to work out some way of obtaining advance clearance and a single combined pass of some sort so that compliant kombis are not held up at checkpoints and passengers delayed.\n\nThis requires a degree of trust and the police could limit the special passes to kombis owned by operators who belong to reputable associations.\n\nAnother way of enforcing the rules without causing delays and congestion would be to enforce the rules about dropping off and picking up passengers.\n\nGenerally this must be done at the four city centre terminuses and associated ranks since the terminuses are generally on the small side.\n\nWe also think the city council should be willing to have more bus stops at suitable points so people can be dropped off nearer where they need to go. There is also that problem of no central bus station, with three of the four terminuses to the west of the city centre and one, the largest, well over 1km to the east.\n\nKombis should be allowed to loop around the city centre so they can drop off passengers at both groups of terminuses.\n\nAt some stage, the city council and the National Railways of Zimbabwe need to work out how to use that huge railway reserve at the south of the city centre as a proper railways station for commuter and long distance travel plus the huge central bus station next door, which in a multi-storey structure could include a huge vendors market and get traders off the pavements.\n\nThe railways could be compensated for the land they surrender to buses by land in Aspindale and other suitable areas.\n\nThe existing terminuses are maintained to a degree by the kombi crews that use them, although there are limits what they can do.\n\nThe city council, as expected, does nothing and there are not even proper rubbish bins for the vast amount of litter, instead piles of rubbish accumulate in informal dumps just outside as the users try and keep the rest of the area clear.\n\nKombi owners are prepared to pay modest charges to proper terminuses operators, rather than see their drivers extorted by touts, and would be more willing to pay if that money was used to upgrade and maintain the terminuses, with municipal staff keeping order and touts away, vendors prevented from grabbing bus bays for their stalls, proper garbage bins regularly emptied, decent public lighting, passenger shelters repaired or installed, and generally speaking creating modern clean bus stations for the passengers.\n\nThis sort of set up, with unauthorised stops prevented and all loading done at a terminus, make enforcement of the kombi rules simple, as police could just walk down the line and check over the permits, without having to have road blocks or checks. Patrols could prevent quiet parking away from the terminuses by the non-compliant.\n\nBy upgrading terminuses, allowing sensible legal bus stops and generally looking at the passengers as well as the kombis, Harare City Council could make the city centre a far more friendly place for public transport, which it must do as car ownership rises.\n\nEvery kombi replaces around 50 or so private cars, and having all those in the city centre will create total gridlock congestion.\n\nSo we need safe, efficient and passenger-orientated public transport and that requires co-operation between the police and transport operators, which is now happening as the police make it clear they will enforce the rules and so the non-compliant operators are fixing their paperwork.\n\nBut that is just the start. The upgrade also needs more cooperation between police and operators and the city council, with the council giving a lot of thought to the sort of services its residents who use public transport require and want, so that terminuses, bus stops and ranks are properly provided, are safe and at least clean and free of touts.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/01/Police-680x380.jpg",
            "description": "A significant majority of the working population of Harare Metropolitan rely on public transport to get to and from work, and during the school term they are joined by a large group of schoolchildren who attend schools beyond normal walking distances. The overwhelming bulk of vehicles involved in this major movement of people every day are […]",
            "time": "06:37",
            "date": "16 Jan 2025"
        }
    ]
}