{
    "news": [
        {
            "title": "Blessed Mhlanga remanded in custody",
            "url": "https://www.herald.co.zw/blessed-mhlanga-remanded-in-custody/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nAlpha Media Holdings (AMH) senior reporter Blessed Mhlanga who is facing charges of transmitting data message inciting public violence will be back to court on February 27 for bail ruling.\n\nHe appeared before Harare regional magistrate Mr Farai Gwatima. The State opposed bail on the basis that Mhlanga is a flight risk and is likely to interfere with witnesses.\n\nThe State also said Mhlanga is likely to commit offences of the same nature if granted bail.\n\nThere is a likelihood that he will commit similar offences. The same machinery he used in the present case that is before the court is yet to be recovered by the police and procedures to recover the same have commenced, said the State in opposing bail.\n\nIn opposing bail the State called Josphat Chitamira from CID Counter Terrorism Unit , who said there are 10 witnesses who are Mhlangas workmates hence his fear is that he will influence them which will prejudice the investigation.\n\nIn response Mr Mhike said the State failed to proffer evidence on why his client is not a proper candidate for bail.\n\nHe proposed bail in the sum of US$100 and for Mhlanga to reside at his given address. Mr Mhike also said his client can also be ordered not to interfere with any State witnesses.\n\nIt is alleged that on January 27 this year by Mhlanga used a computer to record a video of one Blessed Runesu Geza and made the video available to members of the public by transmitting and broadcasting the video through an internet platform called\n\nYouTube,HSTVzimlive.co.zw. intending to incite members of the public to commit acts of violence.\n\nThe court heard that the broadcasted videos contained statements intended to incite members of the public to commit public violence in Zimbabwe. The accused was deemed to have acted unlawfully.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Blessed-Mhlanga.jpg",
            "description": "Alpha Media Holdings (AMH) senior reporter Blessed Mhlanga who is facing charges of transmitting data message inciting public violence will be back to court on February 27 for bail ruling.",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "State opposing Mhlanga’s bail application",
            "url": "https://www.herald.co.zw/state-opposing-mhlangas-bail-application/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nAlpha Media Holdings (AMH) senior reporter Blessed Mhlanga has appeared in court on charges of publishing material likely to incite public violence.\n\nBail application is currently underway, with the State opposing bail on the basis that Mhlanga is a flight risk and is likely to interfere with witnesses.\n\nThe State also said Mhlanga is likely to commit offences of the same nature if granted bail.\n\nThere is a likelihood that he will commit similar offences. The same machinery he used in the present case that is before the court is yet to be recovered by the police and procedures to recover the same have commenced, said the State in opposing bail.\n\nMeanwhile, the arresting officer is giving evidence on why Mhlanga is not a proper candidate for bail.\n\nMore to follow.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/04/Blessed-Mhlanga.jpg",
            "description": "Alpha Media Holdings (AMH) senior reporter Blessed Mhlanga has appeared in court on charges of publishing material likely to incite public violence.",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Zimpapers, Ace Student Recruitment partner on Languages Expo",
            "url": "https://www.herald.co.zw/zimpapers-ace-student-recruitment-partner-on-languages-expo/",
            "content": "Tamuka Mukiwa\n\nThe countrys largest diversified media house, Zimpapers, has partnered with Ace Students Recruitment, a study agency, to host a Languages Day Expo at the National Gallery of Zimbabwe in Harare on Wednesday.\n\nThe exhibition is being held in commemoration of International Mother Language Day which was proclaimed by the United Nations Educational, Scientific and Cultural Organisation (UNESCO) in 1999 to recognise the importance of mother languages in preserving cultural heritage and fostering cultural diversity.\n\nAce Students Recruitment director Ms Shireen Ramajan said her organisation strives to make international study accessible to all.\n\nWe believe in the transformative power of education and strive to make international study accessible to all, she said.\n\nAs one of the study abroad agencies exhibiting at the Languages Day expo, Ace Students Recruitment has pledged to utilise the platform to connect prospective students with suitable universities.\n\nThe expo aims to promote language diversity and cultural heritage and will bring together students, youths, professionals, academics, study abroad agencies, and the public.\n\nIn an interview, Zimpapers public relations and communications manager Mrs Pauline Matanda said, We are excited to partner with Ace Students Recruitment on this important initiative.\n\nAs a media organisation, we recognise the importance of promoting language diversity and cultural heritage and we believe that this expo will provide a valuable platform for Zimbabweans to celebrate their linguistic and cultural diversity.\n\nThe agency has been known for helping students to successfully pursue their studies abroad by offering them guidance and collaborating with reputable universities for placement.\n\nOne of the students recruited by Ace Students Recruitment, Fadzai Mupenzwa who is pursuing her studies in Dubai, the United Arab Emirates, said, Embarking on my studies in Dubai was a seamless experience, thanks to Ace Student Recruitment, she said.\n\nTo be part of this exciting programme, please contact Kumbirai Tarusarira on 0782623185.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-4-680x380.jpg",
            "description": "The country’s largest diversified media house, Zimpapers, has partnered with Ace Students Recruitment, a study agency, to host a Languages Day Expo at the National Gallery of Zimbabwe in Harare on Wednesday.",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Murdered for stealing green mealies, body dumped at court",
            "url": "https://www.herald.co.zw/murdered-for-stealing-green-mealies-body-dumped-at-court/",
            "content": "Arron Nyamayaro\n\nAn Epworth man was arrested for fatally assaulting a man he had caught stealing his green mealies.\n\nThe suspected thiefs body was subsequently dumped at the Epworth Magistrates Court.\n\nIsaac Mudyiwa, 49, reportedly caught Christopher Chida stealing his green mealies and assaulted him all over his body with planks.\n\nWhen Chidas condition deteriorated, Mudyiwa carried and dumped him at the Epworth Magistrates Court.\n\nHarare provincial deputy police spokesperson, Assistant Inspector Faith Mapisa confirmed the case.\n\nHe said Chidas body was found with no visible injuries and was taken to Chitungwiza Hospital mortuary for a post-mortem.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2022/12/Re-arrested.jpg",
            "description": "An Epworth man was arrested for fatally assaulting a man he had caught stealing his green mealies.",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Harare Province to receive Presidential War Veterans Fund disbursement",
            "url": "https://www.herald.co.zw/harare-province-to-receive-presidential-war-veterans-fund-disbursement/",
            "content": "Herald Reporter\n\nThousands of people have thronged the Zanu PF headquarters where Harare Province will receive US$150 000 which is its share from the US$1,5 million Presidential War Veterans Fund.\n\nSpecial Presidential Investment Advisor to the United Arab Emirates, Dr Paul Tungwarara is expected to hand over the funds to war veterans.\n\nThe event will be attended by Minister of State for Harare Metropolitan Province Cde Charles Tavengwa; War Veterans Minister Cde Monica Muvhanga, Zanu PF Harare Provincial chairperson Cde Godwills Masimirembwa and Zanu PF Secretary for War\n\nVeterans, Cde Douglas Mahiya, among others.\n\nHarare Province becomes the fifth province to receive its allocation after Masvingo, Mashonaland East, Midlands and Mashonaland Central.\n\nThe financial assistance is expected to empower war veterans and their families, enabling them to initiate various development projects.\n\nAddressing the media last week in Mashonaland Central, Cde Mahiya said the goal is to channel the efforts of the liberation war heroes into fostering the countrys economic development.\n\nOur idea is to be able to turn the forces that liberated this country to be the forces that will liberate the economy of this country when war veterans have the money to venture into strategic businesses that can assist the party and the Government to overcome economic problems that are bedevilling this nation as a result of sanctions, he said.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/c2e22f8d-3092-4338-9e85-2ba148a0852d-680x380.jpeg",
            "description": "Thousands of people have thronged the Zanu PF headquarters where Harare Province will receive US$150 000 which is its share from the US$1,5 million Presidential War Veterans Fund.",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Silobela man die in revenge mission",
            "url": "https://www.herald.co.zw/silobela-man-die-in-revenge-mission/",
            "content": "Midlands Bureau\n\nA 33-year-old Silobela man has been arrested after the people he mobilised to attack a fellow villager in a revenge mission fatally stabbed the latter at Msilahobe Business Centre last week.\n\nMidlands Provincial police spokesperson, Inspector Emmanuel Mahoko said police in Silobela are investigating circumstances surrounding the murder case.\n\nHe said the murder took place on Thursday at around 10 pm.\n\nIt is alleged that the suspect, Pardon Ncube (33) of Nduku Village, Silobela, was in the company of his wife and son when he had an altercation with Bekhithemba Tshuma, the now deceased, he said.\n\nDuring the altercation, Tshuma and his friends assaulted Ncube and damaged his vehicles windscreen with bricks.\n\nNcube drove off and went home.\n\nHe mobilised his friends Nelly Msipa, Xolani Msipa, Dho Msipa, Prosper Ndlovu and Pardon Ndlovu for a revenge attack.\n\nThey went back to Msilahobe Business Centre looking for Tshuma and met him along the way as he was walking with an identified man. The suspects attacked Tshuma, with one of them stabbing him with a knife, said Inspector Mahoko.\n\nTshumas body was discovered by a passerby lying in a pool of blood.\n\nZRP Silobela attended the scene and has so far arrested Ncube. He is being held in police custody while awaiting an initial appearance in court, said Inspector Mahoko.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/12/Arrested.jpg",
            "description": "A 33-year-old Silobela man has been arrested after the people he mobilised to attack a fellow villager in a revenge mission fatally stabbed the latter at Msilahobe Business Centre last week.",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "‘Vultures provide US$1,8 billion worth of ecosystem services to southern Africa’",
            "url": "https://www.herald.co.zw/vultures-provide-us18-billion-worth-of-ecosystem-services-to-southern-africa/",
            "content": "Sifelani Tsiko\n\nInnovations Editor\n\nVultures, at risk of extinction, are providing southern African countries with an estimated US$1,8 billion worth of ecosystem services a year, a new study has revealed.\n\nThe assessment, carried out by the conservation group BirdLife International, found that vultures which help to stem the spread of disease by eating carcasses in the wild, have a huge value to ecosystems of southern African countries.\n\nAccording to the report which focused on Botswana, Zimbabwe and Zambia, vultures provide ecosystem services including bequest values, sanitation and pest control services totalling US$1,8 billion per year.\n\nThis includes sanitation and pest control services to human health.\n\nThe decline of vulture populations across the continent is indeed worrying. This groundbreaking study on the economic value of vultures in the region is crucial in advancing conservation efforts, said Matthew Lewis, head of conservation, Africa at BirdLife International.\n\nBirdLife and partners will continue to collaborate with stakeholders in the region to turn the tide for vultures in Southern Africa.\n\nSaid Leeroy Moyo, preventing extinctions programme manager at BirdLife Zimbabwe: As BirdLife Zimbabwe, this report is intended to support policy advocacy for vulture conservation.\n\nIt seeks to enhance awareness among local communities and stakeholders regarding vultures essential role in maintaining ecosystem health and promoting human well-being.\n\nBy integrating these findings into national conservation strategies, he said this could help mitigate threats such as poisoning, habitat loss, and illegal trade supporting a sustainable future for vulture populations in Zimbabwe.\n\nAbout seven of Africas 11 vulture species are at risk of extinction. They are listed as Vulnerable, Endangered or Critically endangered on the IUCN Red List.\n\nVultures are an important scavenging species that help stem the spread of disease in Africas ecosystems by eating carcasses that would otherwise rot.\n\nOther scavengers like rats and jackals eat carcasses and then go after livestock or become pests to humans.\n\nExperts fear that if vultures are removed, the numbers of rats and jackals will increase, thereby posing a threat to humans.\n\nVultures, essential for maintaining ecological balance by scavenging on decaying carcasses, have experienced alarming declines, with African vulture populations plummeting by 80 to 97 percent over the last five decades, with some species facing a decline of over 92 percent.\n\nThe main threats include poisoning (responsible for 61 percent of recorded vulture deaths across Africa), belief-based use (29 percent) and electrocution by energy infrastructure (9 percent).\n\nEnvironmentalists say halting and reversing these declines is now imperative to prevent vultures extinction.\n\nMary Malasa, programme manager at BirdWatch Zambia said: Quantifying vultures role as natures clean-up mechanism strengthens the case for their conservation. This valuation will serve as a tool not only to raise awareness but to ensure that the role of vultures in the ecosystem is appreciated.\n\nIn Southern Africa, widespread poisoning of vultures through secondary poisoning poses a severe threat to vultures, with incidents such as the mass poisoning in Botswana in 2019 resulting in the death of over 500 critically endangered vultures.\n\nOther threats include the presence of diclofenac in carcasses, which has also compounded the fight to save the scavengers from across the world.\n\nBirdLife International and its partners commissioned the study to evaluate the value of vultures in the African context and the impact of not having vultures in the ecosystem.\n\nVultures are worth much more to society in saving health service costs and the significant revenue generated in the tourism sector as well.\n\nThe decline of the scavengers can have serious knock-on effects on other species.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2023/06/Vultures.jpg",
            "description": "Vultures, at risk of extinction, are providing southern African countries with an estimated US$1,8 billion worth of ecosystem services a year, a new study has revealed.",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Fake news! Econet Zimbabwe dismisses viral ‘VPN deductions’ notice",
            "url": "https://www.herald.co.zw/fake-news-econet-zimbabwe-dismisses-viral-vpn-deductions-notice/",
            "content": "Online writer\n\nECONET Wireless Zimbabwe has dismissed as fake a widely circulated social media post claiming that the company will deduct funds from EcoCash wallets of customers who have used virtual private networks (VPNs) to access free data.\n\nThe post, which appeared to mimic an official Econet announcement, alleged that the telecommunications giant had detected unauthorised VPN activity and would impose automated deductions to recover data costs.\n\nThe viral image, purportedly from Econets official X page, was marked FAKE by the company, indicating it was not an authentic statement.\n\nEconet has not issued any official notice confirming such deductions.\n\nIn recent years, telecom providers in Zimbabwe have been battling growing VPN usage, as customers use the technology to bypass data restrictions and access blocked content.\n\nHowever, the legitimacy of enforcing retroactive charges for VPN usage remains questionable under the countrys consumer protection laws.\n\nThe fake notice has sparked concern among Econet subscribers, particularly those who rely on VPNs to access restricted platforms. Some social media users speculated that the hoax was an attempt to spread panic, while others called for Econet to clarify its position on VPN use.\n\nEconet Zimbabwe has urged customers to follow its verified communication channels for accurate updates and to disregard misleading information circulating online.\n\nThe fake notice follows a pattern of similar fraudulent announcements targeting major Zimbabwean corporations in recent months.\n\nExperts warn that misinformation campaigns on social media are becoming increasingly sophisticated, often using brand logos and official language to deceive the public.\n\nAuthorities have advised citizens to verify sources before sharing sensitive corporate communications, as spreading false information could lead to unnecessary panic or financial scams.\n\nEconet is yet to issue a formal statement on whether legal action will be taken against those responsible for the fake post.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2024/08/Untitled-28-2.jpg",
            "description": "Online writer ECONET Wireless Zimbabwe has dismissed as fake a widely circulated social media post claiming that the company will deduct funds from EcoCash wallets of customers who have used virtual private networks (VPNs) to access free data. The post, which appeared to mimic an official Econet announcement, alleged that the telecommunications giant had detected […]",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Society mourns the death of eminent surgeon, Prof Kakande",
            "url": "https://www.herald.co.zw/society-mourns-the-death-of-eminent-surgeon-prof-kakande/",
            "content": "Sifelani Tsiko\n\nInnovations Editor\n\nThe death of prominent surgeon, Professor Ignatius Kakande who played an instrumental role in transforming the College of Surgeons of East, Central, and Southern Africa (COSECSA) will leave a void in the continents medical landscape.\n\nSurgical Society of Zimbabwe president Dr Wilfred Muteweye told The Herald that Prof Kakande was a towering figure in the field of surgery, adding that he leaves behind a legacy of excellence, dedication and transformative leadership.\n\nThe Surgical Society of Zimbabwe joins the broader surgical community across East, Central, and Southern Africa in mourning the loss of this esteemed surgeon, mentor, and scholar, he said.\n\nProf Kakandes passing leaves a void that will be deeply felt, but his legacy will continue to inspire future generations of surgeons. COSECSA, and indeed the entire region, is poorer without him, but richer for having known and benefited from his extraordinary life and work. May his soul rest in eternal peace.\n\nProf Kakande, a distinguished surgeon and scholar whose career spanned over 50 years, died on February 18 at the age of 81.\n\nThe Ugandanborn eminent scholar played a pivotal role in the formation of COSECSA in 1999, a milestone that revolutionised surgical education and practices across the region.\n\nFor more than 15 years, his compatriots say, Prof Kakande served with distinction on the governing council and executive committee of the college, contributing significantly to its growth and establishment as a premier academic institution.\n\nHis visionary leadership and tireless efforts laid the foundation for COSECSAs enduring impact on surgical training and healthcare in Africa.\n\nOne of Prof Kakandes most enduring contributions was his stewardship of the East and Central African Journal of Surgery (ECAJS).\n\nHe served as its editor-in-chief from 1995 to 2016, taking over from Professor John Jellis, who had founded the journal in 1975 under the name Proceedings of the Association of Surgeons of East Africa.\n\nUnder Prof Kakandes guidance, the ECAJS evolved into a respected peer-reviewed publication, showcasing the innovations, challenges, and triumphs of surgical practice across the continent.\n\nHis commitment to advancing surgical knowledge and fostering academic excellence has left an indelible mark on the field, Dr Muteweye said.\n\nProf Kakande qualified as a surgeon in the early 1970s and dedicated his life to the practice and teaching of surgery.\n\nHe served as a surgeon and lecturer at several leading institutions, including the University of Nairobi (from 1977), Makerere University, and the National University of Rwanda.\n\nOver the decades, he trained and mentored hundreds of surgeons across the COSECSA region, earning a reputation as a fatherly figure who was deeply respected and admired by his peers and students alike.\n\nHis wisdom, humility, and unwavering dedication to his craft inspired countless individuals to pursue excellence in surgery, Dr Muteweye said.\n\nLast December, Prof Kakandes contributions were celebrated when he joined delegates at COSECSAs 25th anniversary celebrations in Zimbabwe.\n\nHis presence at this milestone event was a testament to his enduring commitment to the college and its mission, said Dr Muteweye.\n\nProf Kakande will be best remembered for his commitment to building a platform for African surgeons to showcase innovations, discuss challenges and find mechanisms to improve surgical practice across the African continent.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Untitled-1-2-680x380.jpg",
            "description": "Sifelani Tsiko Innovations Editor The death of prominent surgeon, Professor Ignatius Kakande who played an instrumental role in transforming the College of Surgeons of East, Central, and Southern Africa (COSECSA) will leave a void in the continent’s medical landscape. Surgical Society of Zimbabwe president Dr Wilfred Muteweye told The Herald that Prof Kakande was a […]",
            "time": "20:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Zimbabwe advances climate resilience",
            "url": "https://www.herald.co.zw/zimbabwe-advances-climate-resilience/",
            "content": "Ivan Zhakata and Anesu January\n\nGovernment in collaboration with the African Development Bank (AfDB) has taken a bold step towards strengthening climate resilience in State enterprises and parastatals (SEPs).\n\nThe initiative, launched under the Institutional Support for State Enterprises Reform Project, aims to provide a structured approach to mainstreaming climate action within key economic sectors.\n\nSpeaking at the opening of the Development of Climate Change Resilience Guidelines for State enterprises and parastatals workshop, Mr Onesimo Musi, executive director of the State Enterprises Restructuring Agency (SERA) said the role of SEPs is critical in Zimbabwes economic transformation and mitigating climate change.\n\nState enterprises and parastatals operate in sectors that are highly sensitive to climate change, including energy, mining, manufacturing, agriculture and transport, he said.\n\nThis makes it imperative for them to adopt sustainable practices that align with national and global climate goals.\n\nThe workshop, a product of collaboration between the Office of the President and Cabinet, SERA, research agencies and the AfDB, brought together key stakeholders to craft comprehensive climate change resilience guidelines.\n\nThe guidelines will serve as a roadmap for integrating climate adaptation measures, monitoring performance and enhancing access to climate finance across SEPs.\n\nMr Musi said while State enterprises hold significant economic influence, they must also act as powerful policy tools for the Government to implement effective climate reforms.\n\nHe said the effects of climate change, coupled with the economic challenges posed by the Covid-19 pandemic, have necessitated urgent reforms to build resilience within State-owned entities.\n\nThis workshop is a crucial platform for dialogue, knowledge sharing and collaboration. It is through such engagements that we can refine these guidelines to ensure they drive effectiveness, efficiency, and sustainability in our climate response efforts, Mr Musi said.\n\nThe development of these guidelines marks a milestone in Zimbabwes climate policy framework, aligning with National Development Strategy 1 (NDS1) and international commitments under the Paris Agreement.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/7546e5b1-5c48-4223-b0d8-213acc2c81fe-680x380.jpeg",
            "description": "Government in collaboration with the African Development Bank (AfDB) has taken a bold step towards strengthening climate resilience in State enterprises and parastatals (SEPs).",
            "time": "20:35",
            "date": "25 Feb 2025"
        }
    ]
}