{
    "news": [
        {
            "title": "ZMX mobilises finance for commodity trading",
            "url": "https://www.herald.co.zw/zmx-mobilises-finance-for-commodity-trading/",
            "content": "Edgar Vhera\n\nAgriculture Specialist Writer\n\nTHE Zimbabwe Mercantile Exchange (ZMX) is working with financiers in banking, pension fund and insurance industries to guarantee sufficient liquidity for commodity sales on their trading platform for the 2025 agricultural marketing season.\n\nZMX chief executive officer, Mr Collen Tapfumaneyi revealed this while giving an update on preparations for the upcoming agricultural marketing season.\n\nWith liquidity having been a major hindrance to trading activities in recent times, ZMX is working with financiers in the banking, insurance and pension fund industries to ensure there is sufficient liquidity to support commodity trading.\n\nThis will ensure farmers are paid expeditiously while buyers such as agro-processors will be capacitated to offtake the commodities to their maximum requirements, he said.\n\nThe rains currently pounding most parts of the country have raised hopes of improved local grain and other commodity harvests for the upcoming agricultural marketing season.\n\nMr Tapfumaneyi said his organisation was geared for the anticipated improved local grain supply this marketing season.\n\nZMX is working with various stakeholders to increase storage capacity, including increasing the number of warehouse distribution points across provinces to meet market demand effectively. This is aimed at enhancing utilisation of the warehouse receipt system (WRS), he explained.\n\nIn the outlook, ZMX aims to expand its warehouse facilities significantly and increase the number of aggregation centres in each district.\n\nWe are also working with farmer organisations and other key stakeholders in order to register a substantial number of farmers on our platform and conduct awareness campaigns to improve access to the exchange for all stakeholders plus facilitate enhanced trading through our weekly auctions, he added.\n\nMeanwhile, ZMX is ready for the upcoming annual African Continental Free Trade Area (AfCFTA) Association of African Commodity Exchanges (A-ACX) conference to be held in the country from March 26 to 27.\n\nThe conference presents a strategic opportunity for Zimbabwe to enhance its economic position, foster regional collaboration, enhance visibility and open up multiple avenues for growth and collaboration in the commodities sector while promoting sustainable growth within the African continent, he highlighted.\n\nThe hosting of the event in Zimbabwe is a thumbs up to ZMX, which was launched in 2021 before joining the A-ACX in 2023 and had its CEO appointed to its steering committee.\n\nMr Tapfumaneyi said hosting the conference highlighted Zimbabwes growing role in the continental commodities market.\n\nThis reflects the countrys increasing importance as a player in trade and economic development within Africa, as well as commitment to AfCFTA goals, he noted.\n\nThe AfCFTA is a major African economic integration initiative whose objectives include boosting intra-African trade and promoting economic resilience across the continent.\n\nSixteen leading African commodities exchanges united to form AfCFTA A-ACX to advance intra-African trade and collaboration in 2023.\n\nThe ZMX boss said the conference provided Zimbabwe with an opportunity to showcase its contributions to the African commodities market, particularly its innovative frameworks and strategies for market development.\n\nAs the host country, Zimbabwe stands to benefit from potential investments in its natural resources and commodities sectors, which are crucial to the economy. The event offers a platform for global investors to explore opportunities in Zimbabwes market, he said.\n\nThe conference will bring in delegates from across Africa, benefiting Zimbabwes tourism and hospitality sectors.\n\nLocal stakeholders will have the chance to engage with international experts, gaining insights and skills that can help develop Zimbabwes commodities market further.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-99-680x380.png",
            "description": "Edgar Vhera Agriculture Specialist Writer THE Zimbabwe Mercantile Exchange (ZMX) is working with financiers in banking, pension fund and insurance industries to guarantee sufficient liquidity for commodity sales on their trading platform for the 2025 agricultural marketing season. ZMX chief executive officer, Mr Collen Tapfumaneyi revealed this while giving an update on preparations for the […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Presidential War Veterans Fund extends to Mashonaland West",
            "url": "https://www.herald.co.zw/presidential-war-veterans-fund-extends-to-mashonaland-west/",
            "content": "Trust Freddy\n\nHerald Correspondent\n\nHundreds of people have gathered at Newlands Primary School in Banket, Mashonaland West, to witness the official launch of the Presidential War Veterans Fund and the drilling of a borehole.\n\nThe programme, spearheaded by Dr Paul Tungwarara, Special Presidential Investment Advisor to the United Arab Emirates, aims to provide interest-free loans to war veterans, enabling them to start businesses and improve their livelihoods.\n\nSeveral high-ranking officials are in attendance, including Mashonaland West Minister of State for Provincial Affairs and Devolution, Marian Chombo, Secretary for War Veterans, Cde Douglas Mahiya, and Deputy Minister of Veterans of the Liberation Struggle Affairs, Headman Moyo.\n\nAlso present are Mashonaland West Provincial chairperson, Cde Mary Mliswa-Chikoka, and Mashonaland West Province War Veterans League chairperson, Cde Happison Muchechetere, among other distinguished guests.\n\nMashonaland West is set to receive US$150 000 as its share of the US$1,5 million set aside for war veterans nationwide. The allocation is subject to review and potential increase over time.\n\nAs part of the programme, eight solar-powered boreholes have been drilled and five new houses have been built for war veterans.\n\nThis will be extended to other war veterans to give them access to clean water and improve their living conditions.\n\n",
            "image_url": null,
            "description": "Trust Freddy Herald Correspondent Hundreds of people have gathered at Newlands Primary School in Banket, Mashonaland West, to witness the official launch of the Presidential War Veterans Fund and the drilling of a borehole. The programme, spearheaded by Dr Paul Tungwarara, Special Presidential Investment Advisor to the United Arab Emirates, aims to provide interest-free loans […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Woman granted peace order against abusive husband",
            "url": "https://www.herald.co.zw/woman-granted-peace-order-against-abusive-husband/",
            "content": "Anesu January\n\nHerald Correspondent\n\nA Harare man has been brought before the Harare Civil Court for assaulting his wife of five years after she gave him a divorce token.\n\nSheila Matare who was seeking a peace order against her husband Simbarashe Zioni told magistrate Judith Tarufunga that the latter has been abusing her verbally and emotionally.\n\nThis man has been emotionally abusing me because I divorced him. That is why I have applied for a peace order, she said.\n\nHowever, Zioni told the court that he did not expect to receive a divorce token.\n\nI came from the beerhall one evening and I could hear my wife shouting as I was sleeping, he said.\n\nShe then placed a $100 bond note in my hand and I asked what the money was for and she told me she was divorcing me.\n\nZioni told the court that he was staying at Matares house at the time.\n\nShe wanted us to move, and I had all the plans in order, only to receive a divorce token, he said.\n\nMagistrate Tarufunga granted the peace order in Matares favour and ordered Zioni to refrain from abusing her.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "Anesu January Herald Correspondent A Harare man has been brought before the Harare Civil Court for assaulting his wife of five years after she gave him a divorce token. Sheila Matare who was seeking a peace order against her husband Simbarashe Zioni told magistrate Judith Tarufunga that the latter has been abusing her verbally and […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Zanu PF to elect new leader upon expiry of my term, President",
            "url": "https://www.herald.co.zw/zanu-pf-to-elect-new-leader-upon-expiry-of-my-term-president/",
            "content": "Zvamaida Murwira\n\nSenior Reporter\n\nZanu PF is bound to elect a new leader to take up the reigns both at the revolutionary party and the country once the incumbents term of office comes to an end in 2028, the partys leader and First Secretary, President Mnangagwa has said.\n\nHe said while there might be some who were keen to have his term extended beyond 2028, he will equally engage the party to accept his long pronounced position that reaffirms his commitment to the constitutionally provided two terms.\n\nPresident Mnangagwa said this on Monday during an interactive engagement with editors drawn from both the public and private media at State House.\n\nThe engagement saw President Mnangagwa share his strategic vision while offering the media an opportunity to share their views on developments in the media as well as seek clarifications on an array of issues affecting the country ranging from the economy, politics among others.\n\nI am very clear, that I have two terms, and these terms are very definite and I am so democratic. When they come to an end, I will step aside and my party will elect my successor. That is as clear as day. Those who have other imaginations, its a democratic society for people to dream but facts will carry the day, said President Mnangagwa.\n\nAsked to comment on current efforts being made to have him extend his term up to 2030 through constitutional amendments in order to give legal effect to a resolution passed at Zanu PFs annual peoples conference in Bulawayo last year, President Mnangagwa said he will have to engage them on the need for him to be in compliance with the Constitution.\n\nI will persuade the persuaders not to persuade me so that I remain constitutional, said President Mnangagwa\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/President-Mnangagwa-4.jpg",
            "description": "Zvamaida Murwira Senior Reporter Zanu PF is bound to elect a new leader to take up the reigns both at the revolutionary party and the country once the incumbent’s term of office comes to an end in 2028, the party’s leader and First Secretary, President Mnangagwa has said. He said while there might be some […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Activists’ trial postponed as State witness fails to turn up",
            "url": "https://www.herald.co.zw/activists-trial-postponed-as-state-witness-fails-to-turn-up/",
            "content": "Prosper Dembedza\n\nHerald Correspondent\n\nThe trial of three civic society leaders who allegedly protested outside the Harare Magistrates Court against the arrest of Jameson Timba and 78 other CCC activists has been postponed to February 28 after the arresting officer, who is a State witness, failed to show up.\n\nThis prompted Harare magistrate, Ms Rufaro Panavanhu, to issue a warrant of arrest for the arresting officer, Donald Chingarafa, for failing to attend court.\n\nThe trio stands accused of participating in a protest at the Harare Magistrates Court after Citizens Coalition for Change members had been arrested for gathering unlawfully.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/court-hammer.jpg",
            "description": "Prosper Dembedza Herald Correspondent The trial of three civic society leaders who allegedly protested outside the Harare Magistrates Court against the arrest of Jameson Timba and 78 other CCC activists has been postponed to February 28 after the arresting officer, who is a State witness, failed to show up. This prompted Harare magistrate, Ms Rufaro […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Recent rains bring relief to Bulawayo’s Dams, but water crisis persists",
            "url": "https://www.herald.co.zw/recent-rains-bring-relief-to-bulawayos-dams-but-water-crisis-persists/",
            "content": "Rutendo Nyeve\n\nBulawayo Bureau\n\nThe City of Bulawayo has recorded a slight improvement in dam inflows compared to the same period last year, thereby providing a glimmer of hope amid persistent water supply challenges.\n\nAccording to the latest Dam Watch statistics released on Tuesday by town clerk Mr Christopher Dube, as of Monday the cumulative inflows into the citys operational dams had risen to 21.29 percent of total capacity, which is an increase from last years levels.\n\nThe total operational dam levels stand at 44.68 percent, a slight increase from the 43.20 percent recorded on the same date in 2024.\n\nThis improvement is attributed to the recent rains received across the country.\n\nAmong the key dams, Upper Ncema Dam has shown a remarkable recovery and now stands at 50.03 percent, compared to 17.20 percent last year.\n\nThis improvement follows the strategic release of water from Upper Ncema into Lower Ncema, which had reached a critical low of 9.26 percent earlier this month.\n\nHowever, Insiza Mayfair Dam is currently at 52.04 percent capacity, down from 58.92 percent last year, while Inyankuni Dam has dropped to 19.27 percent from 29.46 percent.\n\nThe cumulative inflows as at 17 February was 88,275,173 cubic meters, with a daily increase of 5,028,431 cubic meters.\n\nInsiza Dam recorded the highest inflow at 31,337,100 cubic meters, while Inyankuni Dam reported no inflows on the same day.\n\nDespite the slight improvement, the City of Bulawayo continues to urge residents to use water sparingly as the overall dam levels remain below optimal.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-96-680x380.png",
            "description": "Rutendo Nyeve Bulawayo Bureau The City of Bulawayo has recorded a slight improvement in dam inflows compared to the same period last year, thereby providing a glimmer of hope amid persistent water supply challenges. According to the latest Dam Watch statistics released on Tuesday by town clerk Mr Christopher Dube, as of Monday the cumulative […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Men outnumber females in borrowing money – RBZ",
            "url": "https://www.herald.co.zw/men-outnumber-females-in-borrowing-money-rbz/",
            "content": "Nqobile Bhebhe\n\nA Credit Registry database has revealed that men overwhelmingly outnumber women across nearly all eligible age groups seeking loans from financial institutions.\n\nThe Credit Registry, which went live in 2017, addresses Zimbabwes ease of doing business deficiencies relating to getting credit and explores two sets of issues, strength of credit reporting systems and effectiveness of collateral and bankruptcy laws in facilitating lending.\n\nAccording to the latest figures from the Mid-Term Monetary Policy, as of December 31, 2024, the number of men borrowing in the 31-40 age group stood at 665 283, compared to 350 121 women.\n\nThis trend is even more pronounced in the 41-50 age group, where 560 640 men took out loans, more than double the 266 536 women who borrowed during the same period.\n\nThe report further reveals that in the 18-25 age group, 74 843 men sought loans, while only 22 695 women did the same.\n\nIn the 61 and above category, the gender gap was equally notable, with 79 739 men borrowing compared to just 24 591 women.\n\nAs outlined in the mid-term monetary policy, financial institutions and other stakeholders continued to make use of the Credit Registry and private credit bureaus through December 2024.\n\nThe sharing of credit information enables better credit risk management and informed decision-making, ultimately fostering financial inclusion and enhancing financial stability.\n\nBy 31 December 2024, the Credit Registry maintained a total of 23,51 million searchable records, a significant increase in the number of credit reports available for reference.\n\nAdditionally, there was a 27.76 percent rise in cumulative inquiries, up from 4,085,598 on 21 December 2023.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/aa718b2c-3b5b-4fce-af38-b553b796b31e.jpeg",
            "description": "  Nqobile Bhebhe A Credit Registry database has revealed that men overwhelmingly outnumber women across nearly all eligible age groups seeking loans from financial institutions. The Credit Registry, which went live in 2017, addresses Zimbabwe’s ease of doing business deficiencies relating to getting credit and explores two sets of issues, strength of credit reporting systems […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Zimbabwe nears mine-free status",
            "url": "https://www.herald.co.zw/zimbabwe-nears-mine-free-status/",
            "content": "Ivan Zhakata\n\nHerald Correspondent\n\nZimbabwe has made significant progress in clearing landmines planted during the liberation war with 96 percent of contaminated land now safe for communities.\n\nHowever, a funding shortfall of US$23,79 million threatens to delay the countrys goal of becoming mine-free by 2028.\n\nSpeaking during the National Stakeholders Dialogue on Humanitarian Demining and Mine Victims Assistance, Defence Minister Oppah Muchinguri-Kashiri said Zimbabwe has made phenomenal progress in demining despite erratic funding.\n\nNearly all mine-infested land has been cleared, except for 12 square kilometers, she said.\n\nShe commended the efforts of the Zimbabwe National Armys Mine Clearance Unit, HALO Trust, Norwegian Peoples Aid and the Mine Advisory Group, saying their work had ensured that provinces like Manicaland and Mashonaland Central are mine-free.\n\nMinister Muchinguri-Kashiri said Mashonaland East remain one of the most affected areas requiring urgent intervention.\n\nThe initial target was to complete demining by December 2025, but Muchinguri-Kashiri said setbacks such as the Covid-19 pandemic and fluctuations in international donor funding have made that timeline unrealistic.\n\nWe are now working on submitting another three-year extension request to the Secretariat of the Treaty as funding constraints have made it difficult to meet the original deadline, she said.\n\nMinister Muchinguri-Kashiri said international support is crucial for the final phase of the operation.\n\nCompletion of mine clearance will not only enhance safety in our communities but also unlock economic opportunities, she said.\n\nThis aligns with Zimbabwes Vision 2030 of achieving an empowered and prosperous society.\n\nGovernment currently allocates US$2 million per year to demining efforts but additional funding is needed to sustain operations.\n\nAuthorities are also working on a new Mine Action Strategy beyond 2025, which will include demobilisation of deminers, management of any remaining residual contamination, and increased support for mine victims.\n\nMinister Muchinguri-Kashiri reaffirmed Zimbabwes commitment to the Anti-Personnel Mine Ban Treaty and said the Government will soon submit its sixth extension request to the Treatys secretariat.\n\nWe are at the tail end of this journey, but the final push requires a collective effort from Government, donors and stakeholders, she said.\n\nWith continued financial support, Zimbabwe hopes to finally eliminate the deadly legacy of landmines, ensuring safer communities and sustainable development.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2014/06/Halo-Trust-Operations-manager-Mr-Michael-Madziva-burning-retrieved-landmines-in-Mukumbura-on-Thursday-6.jpg",
            "description": "Ivan Zhakata Herald Correspondent Zimbabwe has made significant progress in clearing landmines planted during the liberation war with 96 percent of contaminated land now safe for communities. However, a funding shortfall of US$23,79 million threatens to delay the country’s goal of becoming mine-free by 2028. Speaking during the National Stakeholders Dialogue on Humanitarian Demining and […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Parliament briefed on fuel situation in the country",
            "url": "https://www.herald.co.zw/parliament-briefed-on-fuel-situation-in-the-country/",
            "content": "Farirai Machivenyika\n\nSenior Reporter\n\nThe Ministry of Energy and Power Development, led by Permanent Secretary Engineer Gloria Magombo is appearing before the Portfolio Committee on Energy and Development with parastatals under her ministry to give an update on the state of the countrys fuel sector.\n\nThe parastatals include the Zimbabwe Energy Regulatory Authority and the National Oil Infrastructure Company of Zimbabwe.\n\nIn her presentation, Eng Magombo said the fuel supply situation is stable amidst demand growing.\n\nShe also said talks with the government of Mozambique are ongoing for the construction of a second pipeline from Beira.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-94-680x380.png",
            "description": "Farirai Machivenyika Senior Reporter The Ministry of Energy and Power Development, led by Permanent Secretary Engineer Gloria Magombo is appearing before the Portfolio Committee on Energy and Development with parastatals under her ministry to give an update on the state of the country’s fuel sector. The parastatals include the Zimbabwe Energy Regulatory Authority and the […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        },
        {
            "title": "Harare directors spent US$124 000 on holidays last year",
            "url": "https://www.herald.co.zw/harare-directors-spent-us124-000-on-holidays-last-year/",
            "content": "Blessings Chidakwa\n\nHerald Reporter\n\nHarare City Councils top executives last year allocated themselves US$124 000 for holidays at a time when service delivery was nosediving.\n\nThis was revealed before the Commission of Inquiry into Harares affairs, where evidence leader Thabani Mpofu provided a document with the citys 2024 holiday expenditure.\n\nAccording to the document, suspended town clerk Hosiah Chisango was allocated US$18 000 for a trip to Dubai while another director, Engineer Isaac Chawatama, was allocated US$15 000.\n\nWhen quizzed over this, Mayor Mafume professed ignorance.\n\n",
            "image_url": "https://www.herald.co.zw/wp-content/uploads/sites/2/2025/02/Screenshot-93-680x380.png",
            "description": "Blessings Chidakwa Herald Reporter Harare City Council’s top executives last year allocated themselves US$124 000 for holidays at a time when service delivery was nosediving. This was revealed before the Commission of Inquiry into Harare’s affairs, where evidence leader Thabani Mpofu provided a document with the city’s 2024 holiday expenditure. According to the document, suspended […]",
            "time": "18:37",
            "date": "18 Feb 2025"
        }
    ]
}